 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Владелец", ОтборВладелец) Тогда
		Элементы.ОтборВладелец.ТолькоПросмотр = Истина;
		Элементы.ОтборВладелец.КнопкаОткрытия = Ложь;
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборВладелец) Тогда
		Параметры.Отбор.Удалить("Владелец");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
											"Владелец",
											ОтборВладелец,
											ВидСравненияКомпоновкиДанных.Равно,
											НСтр("ru = 'Отбор по владельцу'"),
											Истина,
											РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
	УстановитьДоступностьИзменения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборТиповаяОперацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ОтборВладелец,,, ЗначениеЗаполнено(ОтборВладелец));
	Элементы.Владелец.Видимость = НЕ ЗначениеЗаполнено(ОтборВладелец);
	УстановитьДоступностьИзменения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	// оповестим владельца на случай установки / снятия пометки удаления
	Оповестить("ЗаписьПроводки", ОтборВладелец);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПредыдущийПорядок(Команда)
	ИзменитьПорядок(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СледующийПорядок(Команда)
	ИзменитьПорядок(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменение порядка проводок.
//
// Параметры
//  Вверх  - Булево - Если ИСТИНА, то перемещаем вверх, если ЛОЖЬ, то вниз
//
&НаКлиенте
Процедура ИзменитьПорядок(Вверх=Истина)
	
	ТекущаяПроводка = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяПроводка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекстВопроса = НСтр("ru='Внимание.
							|Изменение порядка проводок отразится на вновь проводимых операциях
							|и на перепроводимых операциях. При изменении не гарантируется корректное
							|заполнение дополнительных реквизитов проводки, которые заполняются вручную.
							|Вы уверены, что хотите изменить порядок проводок?'");	
	КнопкиВопроса = Новый СписокЗначений;
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Да, я хочу изменить порядок'"));
	КнопкиВопроса.Добавить(КодВозвратаДиалога.Нет, НСтр("ru='Нет, не надо менять порядок'"));
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ИзменитьПорядокЗавершение", ЭтотОбъект, Новый Структура("Вверх, ТекущаяПроводка", Вверх, ТекущаяПроводка)), ТекстВопроса, КнопкиВопроса);

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПорядокЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Вверх 			= ДополнительныеПараметры.Вверх;
    ТекущаяПроводка = ДополнительныеПараметры.ТекущаяПроводка;
    
    Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
    
    Отказ = Ложь;
	
    НачатьИзменениеПорядка(ТекущаяПроводка, Вверх, Отказ);
	
	Если Не Отказ Тогда
		
        Оповестить("ЗаписьПроводки", ОтборВладелец);
        Элементы.Список.Обновить();
		
    КонецЕсли;

КонецПроцедуры // ИзменитьПорядок()

&НаСервере
Процедура НачатьИзменениеПорядка(Проводка, Вверх, Отказ)
	
	Справочники.ПроводкиТиповыхОпераций.ПереместитьПроводку(Проводка, Вверх, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьИзменения()
	
	РедактированиеВозможно = Истина;
	Если НЕ ЗначениеЗаполнено(ОтборВладелец) Тогда
		РедактированиеВозможно = Ложь;
	ИначеЕсли Справочники.ТиповыеОперации.ТиповаяОперацияНаПоддержке(ОтборВладелец) Тогда
	    РедактированиеВозможно = Ложь;
	ИначеЕсли НЕ ПравоДоступа("Изменение", Метаданные.Справочники.ТиповыеОперации) Тогда
		РедактированиеВозможно = Ложь;	
	ИначеЕсли ЗначениеЗаполнено(ОтборВладелец) И НЕ Справочники.ТиповыеОперации.ПраваДоступаКТиповойОперации(ОтборВладелец).Редактирование Тогда
		РедактированиеВозможно = Ложь;
	КонецЕсли;
		
	Элементы.ФормаПредыдущийПорядок.Доступность = РедактированиеВозможно;		
	Элементы.ФормаСледующийПорядок.Доступность = РедактированиеВозможно;
	Если НЕ РедактированиеВозможно Тогда
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьДоступностьИзменения()

//&НаСервере
//Функция ТекстЗапросаПоставляемыеПроводки()
//
//	Возврат "ВЫБРАТЬ
//	        |	СправочникПроводкиТиповыхОпераций.Ссылка,
//	        |	СправочникПроводкиТиповыхОпераций.ВерсияДанных,
//	        |	СправочникПроводкиТиповыхОпераций.ПометкаУдаления,
//	        |	СправочникПроводкиТиповыхОпераций.Предопределенный,
//	        |	СправочникПроводкиТиповыхОпераций.Владелец,
//	        |	СправочникПроводкиТиповыхОпераций.Код,
//	        |	СправочникПроводкиТиповыхОпераций.Наименование,
//	        |	СправочникПроводкиТиповыхОпераций.НеИспользовать,
//	        |	СправочникПроводкиТиповыхОпераций.Условие,
//	        |	СправочникПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента,
//	        |	НЕОПРЕДЕЛЕНО КАК КФО,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаКФО,
//	        |	НЕОПРЕДЕЛЕНО КАК Сумма,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСумма,
//	        |	НЕОПРЕДЕЛЕНО КАК СчетДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСчетДт,
//	        |	НЕОПРЕДЕЛЕНО КАК КПСДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаКПСДт,
//	        |	НЕОПРЕДЕЛЕНО КАК КЭКДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаКЭКДт,
//	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт1,
//	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСубконтоДт1,
//	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт2,
//	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСубконтоДт2,
//	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт3,
//	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСубконтоДт3,
//	        |	НЕОПРЕДЕЛЕНО КАК ХарактеристикаДвиженияДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияДт,
//	        |	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаПодразделениеДт,
//	        |	НЕОПРЕДЕЛЕНО КАК КоличествоДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаКоличествоДт,
//	        |	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаВалютаДт,
//	        |	НЕОПРЕДЕЛЕНО КАК ВалютнаяСуммаДт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаДт,
//	        |	НЕОПРЕДЕЛЕНО КАК СчетКт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСчетКт,
//	        |	НЕОПРЕДЕЛЕНО КАК КПСКт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаКПСКт,
//	        |	НЕОПРЕДЕЛЕНО КАК КЭККт,
//	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт1,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаКЭККт,
//	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСубконтоКт1,
//	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт2,
//	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСубконтоКт2,
//	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт3,
//	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСубконтоКт3,
//	        |	НЕОПРЕДЕЛЕНО КАК ХарактеристикаДвиженияКт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияКт,
//	        |	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаПодразделениеКт,
//	        |	НЕОПРЕДЕЛЕНО КАК КоличествоКт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаКоличествоКт,
//	        |	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаВалютаКт,
//	        |	НЕОПРЕДЕЛЕНО КАК ВалютнаяСуммаКт,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаКт,
//	        |	НЕОПРЕДЕЛЕНО КАК ИФО,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаИФО,
//	        |	НЕОПРЕДЕЛЕНО КАК ВидПервичногоДокумента,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаВидПервичногоДокумента,
//	        |	НЕОПРЕДЕЛЕНО КАК ДатаПервичногоДокумента,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаДатаПервичногоДокумента,
//	        |	НЕОПРЕДЕЛЕНО КАК НомерПервичногоДокумента,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаНомерПервичногоДокумента,
//	        |	НЕОПРЕДЕЛЕНО КАК Содержание,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаСодержание,
//	        |	НЕОПРЕДЕЛЕНО КАК НомерЖурнала,
//	        |	СправочникПроводкиТиповыхОпераций.ФормулаПериод,
//	        |	СправочникПроводкиТиповыхОпераций.НеПересчитыватьСумму,
//	        |	ВЫБОР
//	        |		КОГДА ПОДСТРОКА(СправочникПроводкиТиповыхОпераций.Условие, 1, 100) = """"
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ КАК ЗаданоУсловие
//	        |ИЗ
//	        |	Справочник.ПоставляемыеПроводкиТиповыхОпераций КАК СправочникПроводкиТиповыхОпераций";	
//
//КонецФункции // ТекстЗапросаПоставляемыеПроводки()

#КонецОбласти
