#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнвентаризацияСервер.ПроверитьСовпадениеСотрудникаВОписиИРасписке(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОчищающаяСтруктура = Новый Структура("ДокументРасписки");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОчищающаяСтруктура);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УдалитьНепроверяемыеРеквизиты(ПроверяемыеРеквизиты);
	
	Если Документы.ИнвентаризационнаяОписьБСО.ЕстьОшибкиЗаполнения(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьНепроверяемыеРеквизиты(ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	НепроверяемыеРеквизиты.Добавить("Раздел21");
	НепроверяемыеРеквизиты.Добавить("Раздел21.ВидДокумента");
	НепроверяемыеРеквизиты.Добавить("Раздел21.НачальныйНомер");
	НепроверяемыеРеквизиты.Добавить("Раздел21.КонечныйНомер");
	НепроверяемыеРеквизиты.Добавить("Раздел21.Сумма");
	НепроверяемыеРеквизиты.Добавить("Раздел21.Количество");
	
	НепроверяемыеРеквизиты.Добавить("Раздел21.НачальныйНомерНеСоответствует");
	НепроверяемыеРеквизиты.Добавить("Раздел21.КонечныйНомерНеСоответствует");
	НепроверяемыеРеквизиты.Добавить("Раздел21.КоличествоНеСоответствует");
	НепроверяемыеРеквизиты.Добавить("Раздел21.СуммаНеСоответствует");
	НепроверяемыеРеквизиты.Добавить("Раздел21.Статус");
	
	НепроверяемыеРеквизиты.Добавить("Раздел21.ВидДенежногоДокумента");
	НепроверяемыеРеквизиты.Добавить("Раздел21.БСО");
	НепроверяемыеРеквизиты.Добавить("Раздел21.НачальныйНомер");
	НепроверяемыеРеквизиты.Добавить("Раздел21.КонечныйНомер");
	
	НепроверяемыеРеквизиты.Добавить("Раздел3.НаименованиеДокумента");
	НепроверяемыеРеквизиты.Добавить("Раздел3.НомерДокумента");
	НепроверяемыеРеквизиты.Добавить("Раздел3.ДатаДокумента");
	
	НепроверяемыеРеквизиты.Добавить("СоставКомиссииРаздел2.ПричинаОтсутствия");
	НепроверяемыеРеквизиты.Добавить("СоставКомиссииРаздел4.ПричинаОтсутствия");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли