#Область ПрограммныйИнтерфейс

// Формирует массив счетов капвложений, для целей учета данных для заполнения
// карточек капвложений. Это счета 106.хх с субконто "Основные средства"
//
// Возвращаемое значение:
//	Массив - массив ссылок на счета капвложений
Функция СчетаКапвложенийДляКарточкиКапвложений() Экспорт
	Возврат ОбслуживаниеКарточекКапвложенийПовтИсп.СчетаКапвложенийДляКарточкиКапвложений();
КонецФункции	

// Определяет, является ли счет, счетом капвложений, т.е. счетом 106
// с субконто ОС. 
//
// Параметры:
//  Счет - ПланСчетовСсылка
// 
// Возвращаемое значение:
//  Булево - если ИСТИНА, то это счет капвложений
Функция ЭтоСчетКапвложений(Счет) Экспорт
	Возврат(СчетаКапвложенийДляКарточкиКапвложений().Найти(Счет) <> Неопределено);
КонецФункции	

#Область ФормированиеДвиженийПоКарточкам

// Инициирует процесс формирования движений документа в регистре сведений "ОперацииКапвложений"
//
// Параметры:
//  ТаблицаПроводок - ТаблицаЗначений - Таблица бухгалтерских проводок, которые уже сформировал документ, и которые
//					могут использоваться для формирования таблицы движений в другие регистры
//  ДокументОбъект - ДокументОбъект - Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура - Структура дополнительных реквизитов типовой бухгалтерской операции
//	ТекстОшибки - Строка - текст, который будет заполнен описанием ошибки, если она возникнет при формировании движений
//
// Возвращаемое значение:
//	Булево - флаг успешности формирования движений по регистру
Функция СформироватьДвиженияПоКарточкамКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТекстОшибки) Экспорт
	
	ДвиженияОперацийКапвложений = ДокументОбъект.Движения.Найти("ОперацииКапвложений");
	Если ДвиженияОперацийКапвложений = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли РезервированиеНФА.ЭтоРезервированиеНФА(ДокументОбъект) И ДокументОбъект.Резервировать Тогда
		Возврат Истина;
	КонецЕсли;

	ДвиженияОперацийКапвложений.Очистить();
	ДвиженияОперацийКапвложений.Записывать = Истина;

	ТабДвижений = Новый ТаблицаЗначений;
	ТабДвижений.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТабДвижений.Колонки.Добавить("КарточкаКапвложений", Новый ОписаниеТипов("СправочникСсылка.КарточкиКапвложений"));
	ТабДвижений.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	 
	Если НЕ СформироватьТаблицуДвижений(
		ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Тогда
			
		Возврат Ложь;
	ИначеЕсли ТабДвижений = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТабДвижений) Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Период = ДокументОбъект.Дата;
	Если ТаблицаПроводок.Количество() > 0 И ЗначениеЗаполнено(ТаблицаПроводок[0].Период) Тогда
		Период = ТаблицаПроводок[0].Период;
	КонецЕсли;	
	
	Для каждого ТекДвижение Из ТабДвижений Цикл	
		НоваяЗапись = ДвиженияОперацийКапвложений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекДвижение);
		НоваяЗапись.Период = Период;
	КонецЦикла;	

	УстановитьСтатусЗакрытияКарточекКапвложений(
		ТабДвижений.ВыгрузитьКолонку("КарточкаКапвложений"), ДокументОбъект, ТаблицаПроводок);

	Возврат Истина;
КонецФункции	

#КонецОбласти

// Устанавливает статус закрыта/открыта карточки капвложений на основе данных движений и проводок.
//
// Параметры:
//   КарточкиКапвложений - Массив из СправочникСсылка.КарточкиКапвложений - массив карточек капвложений, для которых 
//   			устанавливаем статус
//   ТекущийДокументОбъект - ДокументОбъект из ОпределяемыйТип.ДокументыСПроводкамиПоКапвложениям - 
//   		документ-объект, для которого устанавливаем статус 
//   ТаблицаПроводок - ТаблицаЗначений - 
//   		таблица с данными о проводках, которые будут сформированы проводящимся документом.
//			Передается, если процедура вызывается при провдении документа из подсистемы "Типовые операции". 
//			Если процедура вызывается из других мест, то можно не передавать
//   УчитыватьОснованиеРегистрацииКапвложений - Булево - если текущий документ "РегистрацияКапвложений", то когда
//		документ проводится, нужно учитывать проводки его документа-основания, т.к. регистрируемая карточка 
//		привязывается к проводкам именно документа-основания. При проведении нужно передавать ИСТИНА. 
//		В противном случае, если у документа "РегистрацияКапвложений" отменяется проведение, то передавать нужно ЛОЖЬ  
Процедура УстановитьСтатусЗакрытияКарточекКапвложений(
	КарточкиКапвложений, ТекущийДокументОбъект, ТаблицаПроводок = Неопределено,
	УчитыватьОснованиеРегистрацииКапвложений = Истина) Экспорт
	
	Если НЕ Константы.КарточкиКапвложенийЗакрыватьАвтоматически.Получить() Тогда
		Возврат;
	КонецЕсли;		
	
	ТекущийДокументСсылка = ТекущийДокументОбъект.Ссылка;
	Если ТаблицаПроводок = Неопределено Тогда
		ТаблицаПроводок = ПустаяТаблицаПроводок();
	КонецЕсли;	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета106
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|ГДЕ
	|	ЕПСБУВидыСубконто.ВидСубконто = &ВидСубконтоОС
	|	И ПОДСТРОКА(ЕПСБУВидыСубконто.Ссылка.Код, 1, 3) = ""106""
	|	И НЕ ЕПСБУВидыСубконто.Ссылка.ЭлементГруппа
	|СГРУППИРОВАТЬ ПО
	|	ЕПСБУВидыСубконто.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ККВ.Ссылка КАК КарточкаКапвложений,
	|	ККВ.ОбъектВложений КАК ОбъектВложений,
	|	ККВ.Закрыта КАК Закрыта,
	|	ККВ.ДатаЗакрытияКарточки КАК ДатаЗакрытия
	|ПОМЕСТИТЬ КарточкиКапвложений
	|ИЗ
	|	Справочник.КарточкиКапвложений КАК ККВ
	|ГДЕ
	|	ККВ.Ссылка В (&КарточкиКапвложений)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ККВ.КарточкаКапвложений КАК КарточкаКапвложений,
	|	ККВ.ОбъектВложений КАК ОбъектВложений,
	|	ККВ.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ДанныеККВ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОперацииКапвложений.КарточкаКапвложений КАК КарточкаКапвложений,
	|		ОперацииКапвложений.КарточкаКапвложений.ОбъектВложений КАК ОбъектВложений,
	|		ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ОперацииКапвложений.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|				ТОГДА ОперацииКапвложений.ДокументКапвложений
	|			ИНАЧЕ ОперацииКапвложений.Регистратор
	|		КОНЕЦ КАК Регистратор
	|	ИЗ
	|		РегистрСведений.ОперацииКапвложений КАК ОперацииКапвложений
	|	ГДЕ
	|		ОперацииКапвложений.Активность
	|		И ОперацииКапвложений.КарточкаКапвложений В (&КарточкиКапвложений)
	|		И ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ОперацииКапвложений.Регистратор) = ТИП(Документ.РегистрацияКапвложений)
	|				ТОГДА ОперацииКапвложений.ДокументКапвложений
	|			ИНАЧЕ ОперацииКапвложений.Регистратор
	|		КОНЕЦ <> &ТекущийДокумент
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РегистрацияКапвложенийОбъектыВложений.КарточкаКапвложений,
	|		РегистрацияКапвложенийОбъектыВложений.ОбъектВложений,
	|		РегистрацияКапвложенийОбъектыВложений.Ссылка.ДокументОснование
	|	ИЗ
	|		Документ.РегистрацияКапвложений.ОбъектыВложений КАК РегистрацияКапвложенийОбъектыВложений
	|	ГДЕ
	|		Ссылка = &ДокументРегистрацияКапвложений) КАК ККВ
	|СГРУППИРОВАТЬ ПО
	|	ККВ.КарточкаКапвложений,
	|	ККВ.ОбъектВложений,
	|	ККВ.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПроводок.Регистратор КАК Регистратор,
	|	ТаблицаПроводок.Период КАК Период,
	|	ТаблицаПроводок.СчетДт КАК СчетДт,
	|	ТаблицаПроводок.СчетКт КАК СчетКт,
	|	ТаблицаПроводок.ВидСубконтоДт1 КАК ВидСубконтоДт1,
	|	ТаблицаПроводок.СубконтоДт1 КАК СубконтоДт1,
	|	ТаблицаПроводок.ВидСубконтоКт1 КАК ВидСубконтоКт1,
	|	ТаблицаПроводок.СубконтоКт1 КАК СубконтоКт1,
	|	ТаблицаПроводок.Сумма КАК Сумма
	|ПОМЕСТИТЬ ТаблицаПроводок
	|ИЗ
	|	&ТаблицаПроводок КАК ТаблицаПроводок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаПроводок.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(КарточкиКапвложений.КарточкаКапвложений, ЗНАЧЕНИЕ(Справочник.КарточкиКапвложений.ПустаяСсылка)) КАК
	|		КарточкаКапвложений,
	|	НАЧАЛОПЕРИОДА(ТаблицаПроводок.Период, ДЕНЬ) КАК ДатаОперации,
	|	ТаблицаПроводок.СубконтоДт1 КАК СубконтоДт1,
	|	ТаблицаПроводок.СубконтоКт1 КАК СубконтоКт1,
	|	ВЫБОР
	|		КОГДА ТаблицаПроводок.СчетДт В
	|			(ВЫБРАТЬ
	|				Таб.Ссылка
	|			ИЗ
	|				Счета106 КАК Таб)
	|		И ТаблицаПроводок.СубконтоДт1 = ЕСТЬNULL(КарточкиКапвложений.ОбъектВложений,
	|			ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|			ТОГДА ТаблицаПроводок.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ТаблицаПроводок.СчетКт В
	|			(ВЫБРАТЬ
	|				Таб.Ссылка
	|			ИЗ
	|				Счета106 КАК Таб)
	|		И ТаблицаПроводок.СубконтоКт1 = ЕСТЬNULL(КарточкиКапвложений.ОбъектВложений,
	|			ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка))
	|			ТОГДА ТаблицаПроводок.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ТаблицаПроводок1
	|ИЗ
	|	ТаблицаПроводок КАК ТаблицаПроводок
	|		ЛЕВОЕ СОЕДИНЕНИЕ КарточкиКапвложений КАК КарточкиКапвложений
	|		ПО ТаблицаПроводок.СубконтоДт1 = КарточкиКапвложений.ОбъектВложений
	|		ИЛИ ТаблицаПроводок.СубконтоКт1 = КарточкиКапвложений.ОбъектВложений
	|ГДЕ
	|	ТаблицаПроводок.СчетДт В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета106 КАК Таб)
	|	И ТаблицаПроводок.ВидСубконтоДт1 = &ВидСубконтоОС
	|	И ТаблицаПроводок.СубконтоДт1 В
	|		(ВЫБРАТЬ
	|			Таб.ОбъектВложений
	|		ИЗ
	|			КарточкиКапвложений КАК Таб)
	|	ИЛИ ТаблицаПроводок.СчетКт В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета106 КАК Таб)
	|	И ТаблицаПроводок.ВидСубконтоКт1 = &ВидСубконтоОС
	|	И ТаблицаПроводок.СубконтоКт1 В
	|		(ВЫБРАТЬ
	|			Таб.ОбъектВложений
	|		ИЗ
	|			КарточкиКапвложений КАК Таб)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеККВ.КарточкаКапвложений КАК КарточкаКапвложений,
	|	НАЧАЛОПЕРИОДА(ДвиженияБУ.Период, ДЕНЬ) КАК ДатаОперации,
	|	ВЫБОР
	|		КОГДА ДвиженияБУ.СчетДт В
	|			(ВЫБРАТЬ
	|				Таб.Ссылка
	|			ИЗ
	|				Счета106 КАК Таб)
	|		И ДвиженияБУ.СубконтоДт1 = ДанныеККВ.ОбъектВложений
	|			ТОГДА ДвиженияБУ.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ДвиженияБУ.СчетКт В
	|			(ВЫБРАТЬ
	|				Таб.Ссылка
	|			ИЗ
	|				Счета106 КАК Таб)
	|		И ДвиженияБУ.СубконтоКт1 = ДанныеККВ.ОбъектВложений
	|			ТОГДА ДвиженияБУ.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ ОборотыККВ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(,, Активность
	|	И Регистратор В
	|		(ВЫБРАТЬ
	|			Таб.Регистратор
	|		ИЗ
	|			ДанныеККВ КАК Таб)
	|	И (СчетДт В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета106 КАК Таб)
	|	ИЛИ СчетКт В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета106 КАК Таб)),,) КАК ДвиженияБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеККВ КАК ДанныеККВ
	|		ПО ДвиженияБУ.Регистратор = ДанныеККВ.Регистратор
	|		И (ДвиженияБУ.СубконтоДт1 = ДанныеККВ.ОбъектВложений
	|		ИЛИ ДвиженияБУ.СубконтоКт1 = ДанныеККВ.ОбъектВложений)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаПроводок.КарточкаКапвложений,
	|	ТаблицаПроводок.ДатаОперации,
	|	ТаблицаПроводок.Сумма
	|ИЗ
	|	ТаблицаПроводок1 КАК ТаблицаПроводок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеККВ.КарточкаКапвложений,
	|	НАЧАЛОПЕРИОДА(ИсторияКапвложений.ДатаОперации, ДЕНЬ),
	|	ВЫБОР
	|		КОГДА ИсторияКапвложений.СторонаСчетВложения = ""Дт""
	|			ТОГДА ИсторияКапвложений.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА ИсторияКапвложений.СторонаСчетВложения = ""Кт""
	|			ТОГДА ИсторияКапвложений.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.ИсторияКапвложений КАК ИсторияКапвложений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеККВ КАК ДанныеККВ
	|		ПО ИсторияКапвложений.КарточкаКапвложений = ДанныеККВ.КарточкаКапвложений
	|		И ИсторияКапвложений.ОбъектВложений = ДанныеККВ.ОбъектВложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыККВ.КарточкаКапвложений КАК КарточкаКапвложений,
	|	МАКСИМУМ(ОборотыККВ.ДатаОперации) КАК ДатаПоследнейОперации,
	|	СУММА(ОборотыККВ.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ОборотыККВ1
	|ИЗ
	|	ОборотыККВ КАК ОборотыККВ
	|СГРУППИРОВАТЬ ПО
	|	ОборотыККВ.КарточкаКапвложений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыККВ.КарточкаКапвложений КАК КарточкаКапвложений,
	|	ОборотыККВ.ДатаПоследнейОперации КАК ДатаОперации,
	|	ОборотыККВ.Сумма КАК Сумма,
	|	ЕСТЬNULL(КарточкиКапвложений.Закрыта, ЛОЖЬ) КАК Закрыта,
	|	ЕСТЬNULL(КарточкиКапвложений.ДатаЗакрытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаЗакрытия
	|ИЗ
	|	ОборотыККВ1 КАК ОборотыККВ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КарточкиКапвложений КАК КарточкиКапвложений
	|		ПО ОборотыККВ.КарточкаКапвложений = КарточкиКапвложений.КарточкаКапвложений";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВидСубконтоОС", ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства"));
	Запрос.УстановитьПараметр("КарточкиКапвложений", КарточкиКапвложений);
	Запрос.УстановитьПараметр("ТаблицаПроводок", ТаблицаПроводок);
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокументСсылка);
	
	ДокументРегистрацияКапвложений = Неопределено;
	Если ТипЗнч(ТекущийДокументСсылка) = Тип("ДокументСсылка.РегистрацияКапвложений") 
		И УчитыватьОснованиеРегистрацииКапвложений Тогда
		ДокументРегистрацияКапвложений = ТекущийДокументСсылка;
	КонецЕсли;	
	Запрос.УстановитьПараметр("ДокументРегистрацияКапвложений", ДокументРегистрацияКапвложений);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма = 0 Тогда 
			Если НЕ Выборка.Закрыта ИЛИ Выборка.ДатаЗакрытия <> Выборка.ДатаОперации Тогда
				ЗакрытьКарточкуКапвложений(Выборка.КарточкаКапвложений, Выборка.ДатаОперации);
			КонецЕсли;
		ИначеЕсли Выборка.Закрыта Тогда
			ОткрытьКарточкуКапвложений(Выборка.КарточкаКапвложений);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

// Обработчик подписки "СнятьСтатусЗакрытаКарточекКапвложения" на событие "ОбработкаУдаленияПроведения".
//
// Параметры:
//   ДокументОбъект - ДокументОбъект - Объект документа, для которого выполняется обработка удаления проведения.
//   Отказ - Булево - Признак отказа от проведения обработки.
Процедура СнятьСатусЗакрытаКарточекКапвлжений(ДокументОбъект, Отказ) Экспорт
	Если НЕ ДокументОбъект.ДополнительныеСвойства.Свойство("КарточкиКапвложений") Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьСтатусЗакрытияКарточекКапвложений(
		ДокументОбъект.ДополнительныеСвойства.КарточкиКапвложений, ДокументОбъект.Ссылка,, Ложь);
КонецПроцедуры

// Обработчик подписки "ЗаполнитьКарточкиКапвложенийВДопСвойствах" на событие "ПередЗаписью" 
// по заполнению карточек капвложений, к которым привязаны проводки документа в дополнительных свойствах документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - Объект документа, для которого заполняются карточки капвложений
//  Отказ - Булево
//  РежимЗаписи     - РежимЗаписиДокумента - параметр, передаваемый в подписку на событие ПередЗаписью,
//                    когда Источник это ДокументОбъект.
//  РежимПроведения - РежимПроведенияДокумента - параметр, передаваемый в подписку на событие ПередЗаписью,
//                    когда Источник это ДокументОбъект.
Процедура ЗаполнитьКарточкиКапвложенийВДопСвойствах(
	ДокументОбъект, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		КарточкиКапвложений = Новый Массив;
		
		НаборЗаписей = РегистрыСведений.ОперацииКапвложений.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка, Истина);
		НаборЗаписей.Прочитать();
		
		КарточкиКапвложений = НаборЗаписей.ВыгрузитьКолонку("КарточкаКапвложений");
		Если КарточкиКапвложений.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		ДокументОбъект.ДополнительныеСвойства.Вставить("КарточкиКапвложений", КарточкиКапвложений);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодготовкаДанныхДляДвиженийПоКарточкам

Функция СформироватьТаблицуДвижений(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки)
	ИмяДокумента = ДокументОбъект.Метаданные().Имя;
	Если НЕ Документы[ИмяДокумента].ИнициализироватьТабДвиженийДляКарточкиКапвложений(
		ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Тогда
		Возврат Ложь;	
	КонецЕсли;		
		
	Возврат Истина;	
КонецФункции	

#КонецОбласти

Процедура ЗакрытьКарточкуКапвложений(КарточкаКапвложений, ДатаЗакрытия)
	Если НЕ ЗначениеЗаполнено(КарточкаКапвложений) Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	ККВ_Объект = КарточкаКапвложений.ПолучитьОбъект();
	ККВ_Объект.Закрыта = Истина;
	ККВ_Объект.ДатаЗакрытияКарточки = ДатаЗакрытия;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ККВ_Объект, Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	

Процедура ОткрытьКарточкуКапвложений(КарточкаКапвложений)
	Если НЕ ЗначениеЗаполнено(КарточкаКапвложений) Тогда
		Возврат;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Истина);
	ККВ_Объект = КарточкаКапвложений.ПолучитьОбъект();
	ККВ_Объект.Закрыта = Ложь;
	ККВ_Объект.ДатаЗакрытияКарточки = Дата(1, 1, 1);
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ККВ_Объект, Истина);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры	

Функция ПустаяТаблицаПроводок()
	ТипСчетСсылка = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	ТипВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	ТипОССсылка = Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства");
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Регистратор", Метаданные.ОпределяемыеТипы.ДокументыСПроводкамиПоКапвложениям.Тип);
	Таблица.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("СчетДт", ТипСчетСсылка);
	Таблица.Колонки.Добавить("СчетКт", ТипСчетСсылка);
	Таблица.Колонки.Добавить("ВидСубконтоДт1",ТипВидСубконто);
	Таблица.Колонки.Добавить("СубконтоДт1", ТипОССсылка);
	Таблица.Колонки.Добавить("ВидСубконтоКт1", ТипВидСубконто);
	Таблица.Колонки.Добавить("СубконтоКт1", ТипОССсылка);
	Таблица.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	
	Возврат Таблица;
КонецФункции	

#КонецОбласти