
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьНастроек();
	УстановитьОтображениеЗащищенногоСоединения();
	УстановитьДоступностьПросмотраКлючаДоступа(Ложь);
	УправлениеМаскированиемКлючаДоступа(Истина);
	УстановитьДоступностьПросмотраПароля(Ложь);
	УправлениеМаскированиемПароля(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ВосстановитьДанныеИзБезопасногоХранилища()
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьДанныеВБезопасноеХранилище();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПарольИзменен = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Запись.СпособПодключения = Перечисления.СпособыПодключенияФРМО.ИПС Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("КлючДоступа"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособПодключенияПриИзменении(Элемент)
	
	УстановитьВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресСервисаПриИзменении(Элемент)
	
	ФорматироватьАдресСервиса();
	
КонецПроцедуры

&НаКлиенте
Процедура КлючДоступаПриИзменении(Элемент)
	
	ПриИзмененииКлючаДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПриИзмененииПароля();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьОИД(Команда)
	
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана организация.'"),,, "Запись.Организация");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьОИДКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенноеСоединение(Команда)
	
	Запись.ЗащищенноеСоединение = Не Запись.ЗащищенноеСоединение;
	УстановитьОтображениеЗащищенногоСоединения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьКлючДоступа(Команда)
	
	УправлениеМаскированиемКлючаДоступа(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьКлючДоступа(Команда)
	
	УправлениеМаскированиемКлючаДоступа(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПароль(Команда)
	
	УправлениеМаскированиемПароля(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПароль(Команда)
	
	УправлениеМаскированиемПароля(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если Модифицированность Или Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для проверки подключения необходимо сохранить настройку.'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьПодключениеЗавершение", ЭтотОбъект);
	ИнтеграцияФРМОКлиент.СформироватьТокенНаКлиенте(Оповещение, Запись.Организация);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьНастроек()
	
	ЭтоСпособИПС				= (Запись.СпособПодключения = ПредопределенноеЗначение("Перечисление.СпособыПодключенияФРМО.ИПС"));
	ЭтоСпособРегионЛокальный	= (Запись.СпособПодключения = ПредопределенноеЗначение("Перечисление.СпособыПодключенияФРМО.РегионЛокальный"));
	ЭтоСпособРегионСервис1С		= (Запись.СпособПодключения = ПредопределенноеЗначение("Перечисление.СпособыПодключенияФРМО.РегионСервис1С"));
	
	Элементы.ГруппаНастройкиИПС.Видимость = ЭтоСпособИПС;
	Элементы.ГруппаНастройкиРегион.Видимость = ЭтоСпособРегионЛокальный Или ЭтоСпособРегионСервис1С;
	Элементы.ГруппаАдресСервиса.Видимость = ЭтоСпособИПС Или ЭтоСпособРегионЛокальный;
	Элементы.Логин.Видимость = ЭтоСпособРегионЛокальный;
	Элементы.ГруппаПароль.Видимость = ЭтоСпособИПС Или ЭтоСпособРегионЛокальный;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтображениеЗащищенногоСоединения()
	
	Элементы.ВыключитьЗащищенноеСоединение.Видимость = Запись.ЗащищенноеСоединение;
	Элементы.ВключитьЗащищенноеСоединение.Видимость = Не Запись.ЗащищенноеСоединение;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматироватьАдресСервиса()
	
	СтруктураURI = ОбщегоНазначенияКлиентСервер.СтруктураURI(Запись.АдресСервиса);
	
	Если ЗначениеЗаполнено(СтруктураURI.Схема) Тогда
		Запись.ЗащищенноеСоединение = (СтруктураURI.Схема = "https");
		УстановитьОтображениеЗащищенногоСоединения();
	КонецЕсли;
	
	Если Запись.СпособПодключения = ПредопределенноеЗначение("Перечисление.СпособыПодключенияФРМО.РегионЛокальный")
		И ЗначениеЗаполнено(СтруктураURI.Логин) Тогда
		Запись.Логин = СтруктураURI.Логин;
		Пароль = СтруктураURI.Пароль;
		ПриИзмененииПароля();
	КонецЕсли;
	
	ЧастиАдреса = Новый Массив; 
	Если ЗначениеЗаполнено(СтруктураURI.Хост) Тогда
		ЧастиАдреса.Добавить(СтруктураURI.Хост);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтруктураURI.ПутьНаСервере) Тогда
		ПутьНаСервере = СтруктураURI.ПутьНаСервере;
		Пока СтрЗаканчиваетсяНа(ПутьНаСервере, "/") Цикл
			ПутьНаСервере = Лев(ПутьНаСервере, СтрДлина(ПутьНаСервере) - 1);
		КонецЦикла;
		Если ЗначениеЗаполнено(ПутьНаСервере) Тогда
			ЧастиАдреса.Добавить(ПутьНаСервере);
		КонецЕсли;
	КонецЕсли;
	
	Запись.АдресСервиса = СтрСоединить(ЧастиАдреса, "/");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКлючаДоступа()
	
	КлючДоступаИзменен = Истина;
	УстановитьДоступностьПросмотраКлючаДоступа(Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДоступностьПросмотраКлючаДоступа(Доступно)
	
	Элементы.СкрытьКлючДоступа.Доступность = Доступно;
	Элементы.ПоказатьКлючДоступа.Доступность = Доступно;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМаскированиемКлючаДоступа(РежимПароля)
	
	Элементы.КлючДоступа.РежимПароля = РежимПароля;
	Элементы.СкрытьКлючДоступа.Видимость = Не РежимПароля;
	Элементы.ПоказатьКлючДоступа.Видимость = РежимПароля;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПароля()
	
	ПарольИзменен = Истина;
	УстановитьДоступностьПросмотраПароля(Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьДоступностьПросмотраПароля(Доступно)
	
	Элементы.СкрытьПароль.Доступность = Доступно;
	Элементы.ПоказатьПароль.Доступность = Доступно;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеМаскированиемПароля(РежимПароля)
	
	Элементы.Пароль.РежимПароля = РежимПароля;
	Элементы.СкрытьПароль.Видимость = Не РежимПароля;
	Элементы.ПоказатьПароль.Видимость = РежимПароля;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьДанныеИзБезопасногоХранилища()
	
	Данные = РегистрыСведений.НастройкиОбменаФРМО.ДанныеИзБезопасногоХранилища(Запись.Организация);
	
	Заглушка = ЭтотОбъект.УникальныйИдентификатор;
	КлючДоступа = ?(ЗначениеЗаполнено(Данные.КлючДоступа), Заглушка, "");
	Пароль = ?(ЗначениеЗаполнено(Данные.Пароль), Заглушка, "");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьДанныеВБезопасноеХранилище() 
	
	ЭтоОбменЧерезРегион = (Запись.СпособПодключения = Перечисления.СпособыПодключенияФРМО.РегионЛокальный)
		Или (Запись.СпособПодключения = Перечисления.СпособыПодключенияФРМО.РегионСервис1С);
	НуженПароль = (Запись.СпособПодключения = Перечисления.СпособыПодключенияФРМО.РегионЛокальный)
		Или (Запись.СпособПодключения = Перечисления.СпособыПодключенияФРМО.ИПС);
	
	НоваяЗапись = Ложь;
	Данные = Новый Структура;
	Данные.Вставить("КлючДоступа", ?(ЭтоОбменЧерезРегион, ?(КлючДоступаИзменен Или НоваяЗапись, КлючДоступа, Неопределено), ""));
	Данные.Вставить("Пароль", ?(НуженПароль, ?(ПарольИзменен Или НоваяЗапись, Пароль, Неопределено), ""));
	
	РегистрыСведений.НастройкиОбменаФРМО.ДанныеВБезопасноеХранилище(Запись.Организация, Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеЗавершение(НастройкаПодключения, Параметры) Экспорт
	
	Если ИнтеграцияФРМОКлиент.ВыполнятьОбменНаКлиенте(НастройкаПодключения.Организация) Тогда
		СообщениеПроверки = ИнтеграцияФРМОКлиентСервер.ПроверитьПодключение(НастройкаПодключения);
	Иначе
		СообщениеПроверки = ПроверитьПодключениеСервер(НастройкаПодключения);
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеПроверки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПодключениеСервер(НастройкаПодключения)
	
	Возврат ИнтеграцияФРМОКлиентСервер.ПроверитьПодключение(НастройкаПодключения);
	
КонецФункции

#Область ЗагрузкаОИД

&НаКлиенте
Процедура ЗагрузитьОИДКлиент()
	
	ДанныеОИД = ЗагрузитьОИДСервер(Запись.Организация);
	
	Если ДанныеОИД.КодОшибки = "ИТС_НеверныйЛогинИлиПароль" Тогда
		ПодключитьИнтернетПоддержку();
	ИначеЕсли СтрНачинаетсяС(ДанныеОИД.КодОшибки, "Организация_") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеОИД.СообщениеОбОшибке,,, "Запись.Организация");
	Иначе
		Запись.ОИД = ДанныеОИД.ОИД;
		Если ЗначениеЗаполнено(ДанныеОИД.СообщениеОбОшибке) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеОИД.СообщениеОбОшибке);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьОИДСервер(Организация)
	
	Результат = Новый Структура("ОИД,КодОшибки,СообщениеОбОшибке", "", "", "");
	
	ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "ИНН,КПП");
	
	Если Не ЗначениеЗаполнено(ДанныеОрганизации.ИНН) Тогда
		Результат.КодОшибки = "Организация_ИНН";
		Результат.СообщениеОбОшибке = НСтр("ru = 'У организации не заполнен ИНН.'");
		Возврат Результат;
	КонецЕсли;
	
	Данные = РегистрыСведений.НастройкиОбменаФРМО.ДанныеОИД(ДанныеОрганизации.ИНН, ДанныеОрганизации.КПП);
	ЗаполнитьЗначенияСвойств(Результат, Данные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку()
	
	ТекстВопроса = НСтр("ru = 'Для загрузки OID необходимо подключить Интернет-поддержку пользователей.'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодключенияИнтернетПоддержки", ЭтотОбъект);
	
	ИнтеграцияФРМОКлиент.ПодключитьИнтернетПоддержку(ТекстВопроса, ОписаниеОповещения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПослеПодключенияИнтернетПоддержки(Результат, ДополнительныеПараметры) Экспорт
	
	ЗагрузитьОИДКлиент();
	
КонецПроцедуры;

#КонецОбласти

#КонецОбласти
