#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ЗаполнитьФормуНаСервере();
		ЗаполнитьСохраненныеДанные();
	Иначе
		УстановитьОтображениеТолькоВыбранныхСтрок();
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияПредопределеннаяНастройка",
		"Видимость", ЗначениеЗаполнено(Объект.ИдентификаторПоставляемыхДанных));

	Если ЗначениеЗаполнено(Объект.ИдентификаторПоставляемыхДанных) Тогда
		УстановитьНедоступностьПредопределенногоЭлемента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьФормуНаСервере();
	ЗаполнитьСохраненныеДанные();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Объект.ТиповаяОперация) И НЕ Объект.НеИспользовать Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Необходимо выбрать типовую операцию или отключить использование настройки'"),
			,
			"ТиповаяОперация",
			"Объект",
			Отказ);
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ЕстьОшибкиВТаблице(РеквизитыДокументаОснования)
		Или ЕстьОшибкиВТаблице(РеквизитыОперацииОснования)
		Или ЕстьОшибкиВТаблице(РеквизитыОперации) Тогда
			
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'В настройке используются несуществующие реквизиты'"), , , ,
			Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПеренестиТаблицуФормыВОбъект("РеквизитыДокументаОснования", ТекущийОбъект);
	ПеренестиТаблицуФормыВОбъект("РеквизитыОперацииОснования", ТекущийОбъект);
	ПеренестиТаблицуФормыВОбъект("РеквизитыОперации", ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторДокументаПриИзменении(Элемент)
	УстановитьВидимостьОшибкиДокумента(ЭтотОбъект, Ложь);
	Если Не НаименованиеИзменено Тогда
		УстановитьНаименование();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуВыбораИОМ(Элемент, "ИдентификаторДокумента", РодителиИОМДокумента, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТиповаяОперацияПриИзменении(Элемент)
	ОбновитьТаблицуРеквизитовОперации(Объект.ТиповаяОперация, "РеквизитыОперации");
КонецПроцедуры

&НаКлиенте
Процедура ТиповаяОперацияОснованияПриИзменении(Элемент)
	ОбновитьТаблицуРеквизитовОперации(Объект.ТиповаяОперацияОснования, "РеквизитыОперацииОснования");
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаОснованияПриИзменении(Элемент)
	ИдентификаторДокументаОснованияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаОснованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФормуВыбораИОМ(Элемент, "ИдентификаторДокументаОснования", РодителиИОМДокументаОснования, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеИзменено = ЗначениеЗаполнено(Объект.Наименование);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыДокументаОснования

&НаКлиенте
Процедура РеквизитыДокументаОснованияЗначениеРеквизитаПриИзменении(Элемент)
	УстановитьФлагВыбранВТекущейСтроке(Элементы.РеквизитыДокументаОснования.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыДокументаОснованияПриИзменении(Элемент)
	УстановитьОтборСписка(ЭтотОбъект,
		"РеквизитыДокументаОснования",
		ЗначениеОтбораСписка(ТекущееЗначениеФлагаТолькоОтмеченные("РеквизитыДокументаОснования")));
	УстановитьЗаголовокГруппыРеквизитыДокумента(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыОперацииОснования

&НаКлиенте
Процедура РеквизитыОперацииОснованияЗначениеРеквизитаПриИзменении(Элемент)
	УстановитьФлагВыбранВТекущейСтроке(Элементы.РеквизитыОперацииОснования.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОперацииОснованияПриИзменении(Элемент)
	УстановитьОтборСписка(ЭтотОбъект,
		"РеквизитыОперацииОснования",
		ЗначениеОтбораСписка(ТекущееЗначениеФлагаТолькоОтмеченные("РеквизитыОперацииОснования")));
	УстановитьЗаголовокГруппыРеквизитыОперации(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРеквизитыОперации

&НаКлиенте
Процедура РеквизитыОперацииСинонимРеквизитаДокументаПриИзменении(Элемент)
	УстановитьФлагВыбранВТекущейСтроке(Элементы.РеквизитыОперации.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОперацииЗначениеРеквизитаПриИзменении(Элемент)
	УстановитьФлагВыбранВТекущейСтроке(Элементы.РеквизитыОперации.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОперацииРеквизитОперацииОснованияПриИзменении(Элемент)
	УстановитьФлагВыбранВТекущейСтроке(Элементы.РеквизитыОперации.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОперацииСинонимРеквизитаДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РеквизитыОперации.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("ОписаниеРеквизитовДокумента, ВыбранныйРеквизит, ТипЗначенияРеквизитаОперации");
	ПараметрыФормы.ОписаниеРеквизитовДокумента  = ТаблицаОписанияРеквизитовВСписок();
	ПараметрыФормы.ВыбранныйРеквизит            = ТекущиеДанные.ИмяРеквизитаДокумента;
	ПараметрыФормы.ТипЗначенияРеквизитаОперации = ТекущиеДанные.ТипРеквизита;
	
	ОткрытьФорму("Справочник.ПравилаЗаполненияТиповойОперацииПриВводеНаОсновании.Форма.ВыборРеквизитаДокумента",
		ПараметрыФормы, Элемент, , , , Новый ОписаниеОповещения("ПослеВыбораРеквизитаДокумента", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыОперацииПриИзменении(Элемент)
	УстановитьОтборСписка(ЭтотОбъект,
		"РеквизитыОперации",
		ЗначениеОтбораСписка(ТекущееЗначениеФлагаТолькоОтмеченные("РеквизитыОперации")));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТолькоОтмеченные(Команда)
	ИзменитьФлагТолькоОтмеченные("РеквизитыДокументаОснования");
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОтмеченныеРеквизитыОперацииОснования(Команда)
	ИзменитьФлагТолькоОтмеченные("РеквизитыОперацииОснования");
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОтмеченныеРеквизитыОперации(Команда)
	ИзменитьФлагТолькоОтмеченные("РеквизитыОперации");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуВыбораИОМ(Элемент, ИмяРеквизитаИОМ, СписокРодителей, СтандартнаяОбработка)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("РежимВыбора", Истина);
	ПараметрыОтбора.Вставить("ВыбиратьГруппыОбъектовМетаданных", Ложь);
	ПараметрыОтбора.Вставить("ТекущаяСтрока", Объект[ИмяРеквизитаИОМ]);
	ПараметрыОтбора.Вставить("Отбор", Новый Структура);
	ПараметрыОтбора.Отбор.Вставить("Ссылка", Новый Массив);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыОтбора.Отбор.Ссылка,
		Элементы[ИмяРеквизитаИОМ].ПараметрыВыбора.Получить(0).Значение);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПараметрыОтбора.Отбор.Ссылка, СписокРодителей.ВыгрузитьЗначения());
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ИдентификаторыОбъектовМетаданных.ФормаВыбора", ПараметрыОтбора, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлагВыбранВТекущейСтроке(ТекущаяСтрока)
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьЗаполненноеЗначение = Ложь;
	ЕстьЗаполненноеЗначение = ЕстьЗаполненноеЗначение
		Или ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущаяСтрока, "ЗначениеРеквизита"));
	ЕстьЗаполненноеЗначение = ЕстьЗаполненноеЗначение
		Или ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущаяСтрока, "ИмяРеквизитаДокумента"));
	ЕстьЗаполненноеЗначение = ЕстьЗаполненноеЗначение
		Или ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущаяСтрока, "РеквизитОперацииОснования"));
	
	ТекущаяСтрока.Выбран = ЕстьЗаполненноеЗначение;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНедоступностьПредопределенногоЭлемента()
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Наименование");
	ИменаЭлементов.Добавить("ИдентификаторДокументаОснования");
	ИменаЭлементов.Добавить("ИдентификаторДокумента");
	ИменаЭлементов.Добавить("ТиповаяОперацияОснования");
	ИменаЭлементов.Добавить("ТиповаяОперация");
	ИменаЭлементов.Добавить("РеквизитыДокументаОснованияВыбран");
	ИменаЭлементов.Добавить("РеквизитыДокументаОснованияЗначениеРеквизита");
	ИменаЭлементов.Добавить("РеквизитыОперацииОснованияВыбран");
	ИменаЭлементов.Добавить("РеквизитыОперацииОснованияЗначениеРеквизита");
	ИменаЭлементов.Добавить("РеквизитыОперацииВыбран");
	ИменаЭлементов.Добавить("РеквизитыОперацииСинонимРеквизитаДокумента");
	ИменаЭлементов.Добавить("РеквизитыОперацииЗначениеРеквизита");
	ИменаЭлементов.Добавить("РеквизитыОперацииРеквизитОперацииОснования");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов,
		"ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыДокументовОснований()
	
	ВидыДокументовОснований = Новый Соответствие;
	
	Для Каждого Документ Из Метаданные.Документы Цикл
		Для Каждого ВидОснования Из Документ.ВводитсяНаОсновании Цикл
			ВидыДокументовОснований.Вставить(ВидОснования.ПолноеИмя());
		КонецЦикла;
	КонецЦикла;
	
	ВозможныеДокументыОснования = Новый Массив;
	Для Каждого ВидОснования Из ВидыДокументовОснований Цикл
		ВозможныеДокументыОснования.Добавить(ВидОснования.Ключ);
	КонецЦикла;
	
	ВозможныеИОМ = Новый Массив;
	ВыбранПравильныйВидДокументаОснования = НЕ ЗначениеЗаполнено(Объект.ИдентификаторДокументаОснования);
	Для Каждого ИОМ Из ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(ВозможныеДокументыОснования) Цикл
		ВозможныеИОМ.Добавить(ИОМ.Значение);
		ВыбранПравильныйВидДокументаОснования = ВыбранПравильныйВидДокументаОснования
			ИЛИ Объект.ИдентификаторДокументаОснования = ИОМ.Значение;
	КонецЦикла;
	
	РодителиИОМДокументаОснования.ЗагрузитьЗначения(РодителиВыбранныхИОМ(ВозможныеИОМ));
	
	УстановитьПараметрВыбораЭлемента("ИдентификаторДокументаОснования", ВозможныеИОМ);
	УстановитьВидимостьОшибкиДокументаОснования(ЭтотОбъект, НЕ ВыбранПравильныйВидДокументаОснования);
	
КонецПроцедуры

&НаСервере
Функция РодителиВыбранныхИОМ(ВозможныеИОМ)

	ИОМРодители = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВозможныеИОМ, "Родитель");
	ВыбранныеРодители = Новый Соответствие;
	Для каждого ИОМРодитель Из ИОМРодители Цикл
		ВыбранныеРодители.Вставить(ИОМРодитель.Значение);
	КонецЦикла;
	Результат = Новый Массив;
	Для каждого ВыбранныйРодитель Из ВыбранныеРодители Цикл
		Результат.Добавить(ВыбранныйРодитель.Ключ);
	КонецЦикла;
	Возврат Результат;

КонецФункции


&НаСервере
Процедура ЗаполнитьВидыВводимыхДокументов()
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторДокументаОснования) Тогда
		УстановитьПараметрВыбораЭлемента("ИдентификаторДокумента", Новый Массив);
		УстановитьВидимостьОшибкиДокумента(ЭтотОбъект, Истина);
		Возврат;
	КонецЕсли;
	
	ОМ = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторДокументаОснования);
	
	ВидыВводимыхДокументов = Новый Массив;
	Для Каждого Документ Из Метаданные.Документы Цикл
		Если Документ.ВводитсяНаОсновании.Содержит(ОМ) Тогда
			ВидыВводимыхДокументов.Добавить(Документ.ПолноеИмя());
		КонецЕсли;
	КонецЦикла;
	
	ВозможныеИОМ = Новый Массив;
	ВыбранПравильныйВидДокумента = НЕ ЗначениеЗаполнено(Объект.ИдентификаторДокумента);
	Для Каждого ИОМ Из ОбщегоНазначения.ИдентификаторыОбъектовМетаданных(ВидыВводимыхДокументов) Цикл
		ВозможныеИОМ.Добавить(ИОМ.Значение);
		ВыбранПравильныйВидДокумента = ВыбранПравильныйВидДокумента
			ИЛИ Объект.ИдентификаторДокумента = ИОМ.Значение;
	КонецЦикла;
	
	РодителиИОМДокумента.ЗагрузитьЗначения(РодителиВыбранныхИОМ(ВозможныеИОМ));
	
	УстановитьПараметрВыбораЭлемента("ИдентификаторДокумента", ВозможныеИОМ);
	УстановитьВидимостьОшибкиДокумента(ЭтотОбъект, НЕ ВыбранПравильныйВидДокумента);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрВыбораЭлемента(ИмяЭлемента, СсылкиПараметра)

	Отбор = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(СсылкиПараметра));
	ПараметрыВыбораЭлемента = Новый ФиксированныйМассив(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Отбор));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяЭлемента,
		"ПараметрыВыбора", ПараметрыВыбораЭлемента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьОшибкиДокументаОснования(Форма, ВидимостьОшибки)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДекорацияОшибкаДокументОснование",
		"Видимость", ВидимостьОшибки);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьОшибкиДокумента(Форма, ВидимостьОшибки)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДекорацияОшибкаВводимыйДокумент",
		"Видимость", ВидимостьОшибки);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере()
	
	ОбновитьТаблицуРеквизитовДокумента();
	ОбновитьТаблицуРеквизитовОперации(Объект.ТиповаяОперацияОснования, "РеквизитыОперацииОснования");
	ОбновитьТаблицуРеквизитовОперации(Объект.ТиповаяОперация,          "РеквизитыОперации");
	ЗаполнитьВидыДокументовОснований();
	ЗаполнитьВидыВводимыхДокументов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСохраненныеДанные()
	ЗаполнитьВыбранныеРеквизитыДокумента();
	ЗаполнитьВыбранныеРеквизитыТиповойОперации(РеквизитыОперацииОснования, Объект.РеквизитыОперацииОснования, Истина);
	ЗаполнитьВыбранныеРеквизитыТиповойОперации(РеквизитыОперации,          Объект.РеквизитыОперации,          Истина);
	
	ИзменитьВидимостьКолонкиОшибка("РеквизитыДокументаОснования");
	ИзменитьВидимостьКолонкиОшибка("РеквизитыОперацииОснования");
	ИзменитьВидимостьКолонкиОшибка("РеквизитыОперации");

	УстановитьЗаголовокГруппыРеквизитыДокумента(ЭтотОбъект);
	УстановитьЗаголовокГруппыРеквизитыОперации(ЭтотОбъект);
	
	НаименованиеИзменено = ЗначениеЗаполнено(Объект.Наименование) И Объект.Наименование <> НаименованиеПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеТолькоВыбранныхСтрок()
	
	УстановитьФлагТолькоОтмеченные(ЭтотОбъект, "РеквизитыДокументаОснования", Истина);
	УстановитьФлагТолькоОтмеченные(ЭтотОбъект, "РеквизитыОперацииОснования", Истина);
	УстановитьФлагТолькоОтмеченные(ЭтотОбъект, "РеквизитыОперации", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписаниеРеквизитовДокумента()
	
	ОписаниеРеквизитовДокумента.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторДокументаОснования) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторДокументаОснования);
	ДобавитьСтандартныеРеквизитыВОписаниеРеквизитов(МетаданныеДокумента);

	ЗапрещенныеРеквизиты = ЗапрещенныеРеквизитыДокумента();
	Для Каждого РеквизитДокумента Из МетаданныеДокумента.Реквизиты Цикл
		
		Если Не ЗапрещенныеРеквизиты.Свойство(РеквизитДокумента.Имя) Тогда
			ДобавитьОписаниеРеквизитаДокумента(РеквизитДокумента.Имя, РеквизитДокумента.Тип, РеквизитДокумента.Синоним);
		КонецЕсли;
		
	КонецЦикла;
	
	ОписаниеРеквизитовДокумента.Сортировать("Синоним");

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтандартныеРеквизитыВОписаниеРеквизитов(МетаданныеДокумента)
	
	ИмяТипа = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(МетаданныеДокумента);
	
	Если ИмяТипа = "Документы" Тогда
		ДобавитьОписаниеРеквизитаДокумента(
			"Ссылка",
			Новый ОписаниеТипов("ДокументСсылка." + МетаданныеДокумента.Имя),
			НСтр("ru = 'Ссылка'"));
		
		ДобавитьОписаниеРеквизитаДокумента(
			"ПометкаУдаления",
			Новый ОписаниеТипов("Булево"),
			НСтр("ru = 'Пометка удаления'"));
		
		ДобавитьОписаниеРеквизитаДокумента(
			"Проведен",
			Новый ОписаниеТипов("Булево"),
			НСтр("ru = 'Проведен'"));
	ИначеЕсли ИмяТипа = "Справочники" Тогда
		ДобавитьОписаниеРеквизитаДокумента(
			"Ссылка",
			Новый ОписаниеТипов("СправочникСсылка." + МетаданныеДокумента.Имя),
			НСтр("ru = 'Ссылка'"));
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОписаниеРеквизитаДокумента(Имя, ТипЗначения, Синоним)
	
	НоваяСтрока = ОписаниеРеквизитовДокумента.Добавить();
	НоваяСтрока.Имя         = Имя;
	НоваяСтрока.ТипЗначения = ТипЗначения;
	НоваяСтрока.Синоним     = Синоним;
	
КонецПроцедуры

&НаСервере
Функция ЗапрещенныеРеквизитыДокумента()
	
	Результат = Новый Структура;
	Результат.Вставить("ИдИсточника");
	Результат.Вставить("Ответственный");
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеРеквизита(Имя, Синоним)
	Возврат СтрШаблон("%1 (%2)", Синоним, Имя);
КонецФункции

&НаСервере
Процедура ОбновитьТаблицуРеквизитовДокумента()
	
	ЗаполнитьОписаниеРеквизитовДокумента();
	
	РеквизитыДокументаОснования.Очистить();
	Для Каждого РеквизитДокумента Из ОписаниеРеквизитовДокумента Цикл
	
		НоваяСтрока = РеквизитыДокументаОснования.Добавить();
		НоваяСтрока.ИмяРеквизита = РеквизитДокумента.Имя;
		НоваяСтрока.ТипРеквизита = РеквизитДокумента.ТипЗначения;
		НоваяСтрока.Синоним      = ПредставлениеРеквизита(РеквизитДокумента.Имя, РеквизитДокумента.Синоним);
		
	КонецЦикла;
	
	РеквизитыДокументаОснования.Сортировать("Синоним");
	
КонецПроцедуры

&НаСервере
Процедура ИдентификаторДокументаОснованияПриИзмененииНаСервере()
	ОбновитьТаблицуРеквизитовДокумента();
	УстановитьВидимостьОшибкиДокументаОснования(ЭтотОбъект, Ложь);
	ЗаполнитьВидыВводимыхДокументов();
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Функция ТаблицаОписанияРеквизитовВСписок()
	
	Список = Новый СписокЗначений;
	Для Каждого СтрокаОписания Из ОписаниеРеквизитовДокумента Цикл
		Список.Добавить(Новый Структура("Имя, Тип", СтрокаОписания.Имя, СтрокаОписания.ТипЗначения),
			СтрокаОписания.Синоним);
	КонецЦикла;
	Возврат Список;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораРеквизитаДокумента(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.РеквизитыОперации.ТекущиеДанные;
	ТекущиеДанные.ИмяРеквизитаДокумента = ВыбранныйЭлемент.Значение;
	ТекущиеДанные.СинонимРеквизитаДокумента = ВыбранныйЭлемент.Представление;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуРеквизитовОперации(ТиповаяОперация, ИмяТаблицы)

	ВыбранныеСтроки = СкопироватьОтмеченныеСтроки(ЭтотОбъект[ИмяТаблицы]);
	ВыбранныеСтроки.Индексы.Добавить("ИмяРеквизита");

	ЭтотОбъект[ИмяТаблицы].Очистить();
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыТиповойОперации = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация, ,
		"Наименование");
	Для Каждого ОписаниеРеквизита Из РеквизитыТиповойОперации Цикл
		
		НоваяСтрока = ЭтотОбъект[ИмяТаблицы].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Новый Структура("РеквизитОперации", ОписаниеРеквизита.Ссылка));
		НоваяСтрока.ИмяРеквизита = ОписаниеРеквизита.ИмяДляФормулы;
		НоваяСтрока.ТипРеквизита = ОписаниеРеквизита.ТипЗначения;
		НоваяСтрока.Синоним      = ПредставлениеРеквизита(ОписаниеРеквизита.ИмяДляФормулы,
		                                                  ОписаниеРеквизита.Наименование);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока,
			ДанныеЗаполненияСтрокиПоИмениРеквизитаОперации(ВыбранныеСтроки, НоваяСтрока.ИмяРеквизита));
		
	КонецЦикла;
	
	ЭтотОбъект[ИмяТаблицы].Сортировать("Синоним");
	ЗаполнитьВыбранныеРеквизитыТиповойОперации(ЭтотОбъект[ИмяТаблицы], ВыбранныеСтроки, Ложь);
	
КонецПроцедуры

&НаСервере
Функция ДанныеЗаполненияСтрокиПоИмениРеквизитаОперации(Таблица, ИмяРеквизита)
	
	Результат = Новый Структура("ИмяРеквизитаДокумента, ЗначениеРеквизита, РеквизитОперацииОснования");
	
	НайденыСтроки = Таблица.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяРеквизита));
	Если НайденыСтроки.Количество() > 0 Тогда
		Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НайденыСтроки[0]);
		УдалитьСвойствоСтруктуры(Результат, "РеквизитОперации");
		УдалитьСвойствоСтруктуры(Результат, "ИмяРеквизита");
		УдалитьСвойствоСтруктуры(Результат, "ТипРеквизита");
		УдалитьСвойствоСтруктуры(Результат, "Синоним");
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УдалитьСвойствоСтруктуры(Структура, Свойство)
	Если Структура.Свойство(Свойство) Тогда
		Структура.Удалить(Свойство);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СтрокиСОшибками(Таблица)
	Отбор = Новый Структура("Ошибка", Истина);
	Возврат Таблица.НайтиСтроки(Отбор);
КонецФункции

&НаСервере
Функция ЕстьОшибкиВТаблице(Таблица)
	Возврат СтрокиСОшибками(Таблица).Количество() > 0;
КонецФункции

&НаСервере
Процедура ИзменитьВидимостьКолонкиОшибка(ИмяТаблицы)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяТаблицы + "Ошибка",
		"Видимость", ЕстьОшибкиВТаблице(ЭтотОбъект[ИмяТаблицы]));
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуСОшибкой(Таблица, Отбор)
	
	ИмяРеквизита = ЗначениеОтбора(Отбор);
	
	НоваяСтрока = Таблица.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Отбор);
	НоваяСтрока.Синоним = ПредставлениеНеНайденногоРеквизита(ИмяРеквизита);
	НоваяСтрока.Ошибка  = Истина;
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеОтбора(Отбор)
	Для Каждого ЭлементОтбора Из Отбор Цикл
		Возврат ЭлементОтбора.Значение;
	КонецЦикла;
	
	Возврат "";
КонецФункции

&НаСервере
Процедура ЗаполнитьВыбранныеРеквизитыДокумента()
	Для Каждого СтрокаОбъекта Из Объект.РеквизитыДокументаОснования Цикл

		СтрокаРеквизита = ПолучитьСтрокуРеквизита(РеквизитыДокументаОснования, "ИмяРеквизита", СтрокаОбъекта, Ложь);
		Если СтрокаРеквизита = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРеквизита.Выбран = Истина;
		СтрокаРеквизита.ЗначениеРеквизита = СтрокаОбъекта.ЗначениеРеквизита;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыбранныеРеквизитыТиповойОперации(ТаблицаРеквизитовОперации, СохраненныеЗначения, ДобавлятьНесуществующие)
	
	Для Каждого СтрокаОбъекта Из СохраненныеЗначения Цикл

		СтрокаРеквизита = ПолучитьСтрокуРеквизита(ТаблицаРеквизитовОперации, "РеквизитОперации", СтрокаОбъекта, ДобавлятьНесуществующие);
		Если СтрокаРеквизита = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполняемыеЗначения = Новый Структура("ЗначениеРеквизита, ИмяРеквизитаДокумента, РеквизитОперацииОснования");
		ЗаполнитьЗначенияСвойств(ЗаполняемыеЗначения, СтрокаОбъекта);
		
		ЗаполнитьЗначенияСвойств(СтрокаРеквизита, ЗаполняемыеЗначения);
		СтрокаРеквизита.Выбран = Истина;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаОбъекта, "ИмяРеквизитаДокумента")
			И ЗначениеЗаполнено(СтрокаОбъекта.ИмяРеквизитаДокумента) Тогда
			ОписаниеРеквизита = ПолучитьОписаниеРевизитаДокумента(СтрокаОбъекта.ИмяРеквизитаДокумента);
			Если ОписаниеРеквизита = Неопределено Тогда
				СтрокаРеквизита.Ошибка                    = Истина;
				СтрокаРеквизита.СинонимРеквизитаДокумента = ПредставлениеНеНайденногоРеквизита(
					СтрокаОбъекта.ИмяРеквизитаДокумента);
			Иначе
				СтрокаРеквизита.СинонимРеквизитаДокумента = ОписаниеРеквизита.Синоним;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтрокуРеквизита(Таблица, Имя, СтрокаОбъекта, ДобавлятьНесуществующие)
	Отбор = Новый Структура(Имя, СтрокаОбъекта[Имя]);
	Строки = Таблица.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Возврат Строки[0];
	ИначеЕсли ДобавлятьНесуществующие Тогда
		Возврат ДобавитьСтрокуСОшибкой(Таблица, Отбор);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ПолучитьОписаниеРевизитаДокумента(Имя)
	
	НайденыСтроки = ОписаниеРеквизитовДокумента.НайтиСтроки(Новый Структура("Имя", Имя));
	Если НайденыСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайденыСтроки[0];
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПредставлениеНеНайденногоРеквизита(Имя)
	
	Возврат СтрШаблон(НСтр("ru = 'Не найден (%1)'"), Имя);
	
КонецФункции

&НаСервере
Процедура ПеренестиТаблицуФормыВОбъект(ИмяТаблицы, ТекущийОбъект)
	
	ТекущийОбъект[ИмяТаблицы].Очистить();

	Для Каждого СтрокаОбъекта Из ЭтотОбъект[ИмяТаблицы] Цикл
		Если СтрокаОбъекта.Выбран Тогда
			Строка = ТекущийОбъект[ИмяТаблицы].Добавить();
			ЗаполнитьЗначенияСвойств(Строка, СтрокаОбъекта);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФлагТолькоОтмеченные(ИмяТаблицы)
	
	УстановитьФлагТолькоОтмеченные(ЭтотОбъект, ИмяТаблицы, НЕ ТекущееЗначениеФлагаТолькоОтмеченные(ИмяТаблицы));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагТолькоОтмеченные(Форма, ИмяТаблицы, ЗначениеФлага)
	
	УстановитьОтборСписка(Форма, ИмяТаблицы, ЗначениеОтбораСписка(ЗначениеФлага));
	ИмяКолонки = ИмяТаблицы + "ТолькоОтмеченные";
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		ИмяКолонки,
		"Пометка",
		ЗначениеФлага);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Форма, ИмяТаблицы, Отбор)
	
	Форма.Элементы[ИмяТаблицы].ОтборСтрок = Отбор;
			
КонецПроцедуры

&НаКлиенте
Функция ТекущееЗначениеФлагаТолькоОтмеченные(ИмяТаблицы)
	ИмяКолонки = ИмяТаблицы + "ТолькоОтмеченные";
	Флаг = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы, ИмяКолонки, "Пометка") = Истина;
	Возврат Флаг;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗначениеОтбораСписка(ЗначениеОтметки)
	Если ЗначениеОтметки Тогда
		Возврат Новый ФиксированнаяСтруктура(Новый Структура("Выбран", Истина));
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Функция НаименованиеПоУмолчанию()
	
	ШаблонНаименования = НСтр("ru = '""%1"" на основании ""%2""'");
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторДокументаОснования) Тогда
		СинонимОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИдентификаторДокументаОснования, "Синоним");
	Иначе
		СинонимОснования = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторДокумента) Тогда
		СинонимДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИдентификаторДокумента, "Синоним");
	Иначе
		СинонимДокумента = "";
	КонецЕсли;
	
	Возврат СтрШаблон(ШаблонНаименования, СинонимДокумента, СинонимОснования);
	
КонецФункции

&НаСервере
Процедура УстановитьНаименование()
	
	Если НЕ НаименованиеИзменено Тогда
		Объект.Наименование = НаименованиеПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СкопироватьОтмеченныеСтроки(Таблица)
	Отбор = Новый Структура("Выбран", Истина);
	Возврат Таблица.Выгрузить().Скопировать(Отбор);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппыРеквизитыДокумента(Форма)
	
	УстановитьЗаголовокСвернутойГруппыФормы(Форма, "ГруппаРеквизитыДокументаОснования", Форма.РеквизитыДокументаОснования);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппыРеквизитыОперации(Форма)
	
	УстановитьЗаголовокСвернутойГруппыФормы(Форма, "ГруппаРеквизитыОперацииОснования", Форма.РеквизитыОперацииОснования);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутойГруппыФормы(Форма, ИмяГруппы, Таблица)
	
	ЗаголовокГруппы = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, ИмяГруппы, "Заголовок");
	Дополнение = ТекстКоличествоВыбранныхЭлементов(Таблица);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		ИмяГруппы,
		"ЗаголовокСвернутогоОтображения",
		СтрШаблон(НСтр("ru = '%1 (%2)'"), ЗаголовокГруппы, Дополнение));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстКоличествоВыбранныхЭлементов(Таблица)
	
	ВыбраноЭлементов = КоличествоОтмеченныхЭлементов(Таблица);
	Если ВыбраноЭлементов = 0 Тогда
		Возврат НСтр("ru = 'без фильтра'");
	Иначе
		Возврат СтрШаблон(НСтр("ru = 'выбраны: %1'"), ВыбраноЭлементов);
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоОтмеченныхЭлементов(Таблица)
	
	ВыбраноЭлементов = 0;
	Для Каждого Элемент Из Таблица Цикл
		Если Элемент.Выбран Тогда
			ВыбраноЭлементов = ВыбраноЭлементов + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыбраноЭлементов;
КонецФункции

#КонецОбласти
