 #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения, Неопределено - Форма отчета или форма настроек отчета.
//       Неопределено когда вызов без контекста.
//   КлючВарианта - Строка, Неопределено - Имя предопределенного
//       или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено когда вызов без контекста.
//   Настройки - Структура - Настройки общей формы отчета (для изменения).
//       См. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//   Например, если схема отчета зависит от ключа варианта или параметров отчета.
//   Чтобы изменения схемы вступили в силу следует вызывать метод ОтчетыСервер.ПодключитьСхему().
//
// Параметры:
//   Контекст - Произвольный - 
//       Параметры контекста, в котором используется отчет.
//       Используется для передачи в параметрах метода ОтчетыСервер.ПодключитьСхему().
//   КлючСхемы - Строка -
//       Идентификатор текущей схемы компоновщика настроек.
//       По умолчанию не заполнен (это означает что компоновщик инициализирован на основании основной схемы).
//       Используется для оптимизации, чтобы переинициализировать компоновщик как можно реже).
//       Может не использоваться, если переинициализация выполняется безусловно.
//   КлючВарианта - Строка, Неопределено -
//       Имя предопределенного или уникальный идентификатор пользовательского варианта отчета.
//       Неопределено, когда вызов для варианта расшифровки или без контекста.
//   НовыеНастройкиКД - НастройкиКомпоновкиДанных, Неопределено -
//       Настройки варианта отчета, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда настройки варианта не надо загружать (уже загружены ранее).
//   НовыеПользовательскиеНастройкиКД - ПользовательскиеНастройкиКомпоновкиДанных, Неопределено -
//       Пользовательские настройки, которые будут загружены в компоновщик настроек после его инициализации.
//       Неопределено, когда пользовательские настройки не надо загружать (уже загружены ранее).
//
// Примеры:
// 1. Компоновщик отчета инициализируется на основании схемы из общих макетов:
//    Если КлючСхемы <> "1" Тогда
//        КлючСхемы = "1";
//        СхемаКД = ПолучитьОбщийМакет("МояОбщаяСхемаКомпоновки");
//        ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//    КонецЕсли;
//
// 2. Схема зависит от значения параметра, выведенного в пользовательские настройки отчета:
//    Если ТипЗнч(НовыеПользовательскиеНастройкиКД) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
//        ПолноеИмяОбъектаМетаданных = "";
//        Для Каждого ЭлементКД Из НовыеПользовательскиеНастройкиКД.Элементы Цикл
//            Если ТипЗнч(ЭлементКД) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
//                ИмяПараметра = Строка(ЭлементКД.Параметр);
//                Если ИмяПараметра = "ОбъектМетаданных" Тогда
//                    ПолноеИмяОбъектаМетаданных = ЭлементКД.Значение;
//                КонецЕсли;
//            КонецЕсли;
//        КонецЦикла;
//        Если КлючСхемы <> ПолноеИмяОбъектаМетаданных Тогда
//            КлючСхемы = ПолноеИмяОбъектаМетаданных;
//            СхемаКД = Новый СхемаКомпоновкиДанных;
//            // Наполнение схемы...
//            ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
//        КонецЕсли;
//    КонецЕсли;
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	Если КлючСхемы <> "1" Тогда
		КлючСхемы = "1";
		СхемаКД = Отчеты.ЗадолженностиПоПлановойОплатеОбразование.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		ДобавитьХарактеристикиВСхемуКомпоновкиДанных(СхемаКД);
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКД, КлючСхемы);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	МассивЗаголовковРесурсов = Новый Массив;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		ЗаменитьТекстыЗапросовФактическихОплат(СхемаКомпоновкиДанных);
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	ОбработатьМакет(МакетКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.НачатьВывод();
	ТаблицаЗафиксирована = Ложь;
	ДокументРезультат.ФиксацияСверху = 0;
	
	Пока Истина Цикл
		
		ЭлементРезультата = ПроцессорКомпоновки.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		Иначе
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьХарактеристикиВСхемуКомпоновкиДанных(СхемаКД)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоляПриказовОбразование.Ссылка КАК Ссылка,
	|	ПоляПриказовОбразование.ТипЗначения КАК ТипЗначения,
	|	ПоляПриказовОбразование.Наименование КАК Наименование
	|ИЗ
	|	ПланВидовХарактеристик.ПоляПриказовОбразование КАК ПоляПриказовОбразование";
	ВыборкаПоля = Запрос.Выполнить().Выбрать();
	
	ТекстПоляВСКД =
	"ВЫБОР
	|		КОГДА СведенияОСтудентахСрезПоследних.Поле = &ПолеПриказа
	|			ТОГДА СведенияОСтудентахСрезПоследних.Значение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ"; 
	
	НаборДанных = СхемаКД.НаборыДанных.Найти("ХарактеристикиУчащихся");
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(НаборДанных.Запрос);
	ПоследнийЗапросПакета = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	КолонкиПоследнегоЗапроса = ПоследнийЗапросПакета.Колонки;
	ОператорВыбрать = ПоследнийЗапросПакета.Операторы[0];
	ОператорВыбрать.Источники[0].Источник.Псевдоним = "СведенияОСтудентахСрезПоследних";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		// Добавить поля и связь источников по факультету
		СвязьПоФакультету = СхемаКД.СвязиНаборовДанных.Добавить();
		СвязьПоФакультету.НаборДанныхИсточник = "Данные";
		СвязьПоФакультету.НаборДанныхПриемник = "ХарактеристикиУчащихся";
		СвязьПоФакультету.ВыражениеИсточник = "Факультет";
		СвязьПоФакультету.ВыражениеПриемник = "Факультет";
		СвязьПоФакультету.Обязательная = Истина;
		
		ПолеЗапроса = ОператорВыбрать.ВыбираемыеПоля.Добавить("Факультет");
		КолонкаЗапроса = КолонкиПоследнегоЗапроса[КолонкиПоследнегоЗапроса.Количество() - 1];
		КолонкаЗапроса.Псевдоним = "Факультет";
		
		ЭлементВыбораСКД = ПоследнийЗапросПакета.ПоляВыбораКомпоновкиДанных.Добавить("Факультет");
		ЭлементВыбораСКД.ИспользоватьРеквизиты = Истина;
		
		ЭлементОтбораСКД = ОператорВыбрать.ВыраженияОтбораКомпоновкиДанных.Добавить("СведенияОСтудентахСрезПоследних.Факультет");
		ЭлементОтбораСКД.ИспользоватьРеквизиты = Истина;
		
		ОператорВыбрать.Группировка.Добавить("Факультет");
	КонецЕсли;
	
	НомерПоля = 0;
	ТекстыПолей = Новый Массив;
	ТекстыУсловийСКД = Новый Массив;
	ИменаПолейСКД = Новый Массив;
	Пока ВыборкаПоля.Следующий() Цикл
		
		НомерПоля = НомерПоля + 1;
		// Имя поля формируется из ссылки и не привязано к наименованию и порядку выбора элементов
		ИмяПоля = "_" + СтрЗаменить(Строка(ВыборкаПоля.Ссылка.УникальныйИдентификатор()), "-", "_");
		
		УсловиеСКД = СтрЗаменить(ТекстПоляВСКД, "&ПолеПриказа", "&ПолеПриказа" + НомерПоля);
		
		ПолеЗапроса = ОператорВыбрать.ВыбираемыеПоля.Добавить("МАКСИМУМ(" + УсловиеСКД + ")");
		КолонкаЗапроса = КолонкиПоследнегоЗапроса[КолонкиПоследнегоЗапроса.Количество() - 1];
		КолонкаЗапроса.Псевдоним = ИмяПоля;
		
		ЭлементВыбораСКД = ПоследнийЗапросПакета.ПоляВыбораКомпоновкиДанных.Добавить(ИмяПоля);
		ЭлементВыбораСКД.ИспользоватьРеквизиты = Истина;
		
		ЭлементОтбораСКД = ОператорВыбрать.ВыраженияОтбораКомпоновкиДанных.Добавить(УсловиеСКД);
		ЭлементОтбораСКД.ИспользоватьРеквизиты = Истина;
		ЭлементОтбораСКД.Псевдоним = ИмяПоля;
		
		НовыйПараметр = СхемаКД.Параметры.Добавить();
		НовыйПараметр.Имя = "ПолеПриказа" + НомерПоля;
		НовыйПараметр.Заголовок = "Поле приказа: " + ВыборкаПоля.Наименование;
		НовыйПараметр.ТипЗначения = ВыборкаПоля.ТипЗначения;
		НовыйПараметр.Значение = ВыборкаПоля.Ссылка;
		НовыйПараметр.ВключатьВДоступныеПоля = Ложь;
		НовыйПараметр.ОграничениеИспользования = Истина;
		
		НовоеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле = ИмяПоля;
		НовоеПоле.ПутьКДанным = "СведенияОбУчащемся." + ИмяПоля;
		НовоеПоле.Заголовок = ВыборкаПоля.Наименование;
		НовоеПоле.ТипЗначения = ВыборкаПоля.ТипЗначения;
	
	КонецЦикла;
	
	НаборДанных.Запрос = СхемаЗапроса.ПолучитьТекстЗапроса();

КонецПроцедуры

Процедура ОбработатьТекстЗапроса(НаборДанных)
	
	ТекстЗапроса = НаборДанных.Запрос;
	
	СтрокаДаты = Формат(ТекущаяДата(), "ДЛФ=D");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%дату", СтрокаДаты);
	
	СтрокаПоискаПолей = "СведенияОбУчащихсяСрез.Студент КАК Студент,";
	СтрокаЗаменыПолей = "СведенияОбУчащихсяСрез.Студент КАК Студент, СведенияОбУчащихсяСрез.Факультет КАК Факультет,";	
	СтрокаПоискаВхождения = "РегистрСведений.СведенияОСтудентах.СрезПоследних(&КонецПериода, ) КАК СведенияОбУчащихсяСрез) КАК ВложенныйЗапрос";
	
	ЧислоВхождений = СтрЧислоВхождений(ТекстЗапроса, СтрокаПоискаВхождения);
	
	Если ЧислоВхождений > 0 Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоискаПолей, СтрокаЗаменыПолей);
		ШаблонПоискаСоединения = "ВложенныйЗапрос%1.Студент = ТаблицаПлановыхОплат.Учащийся";
		ШаблонЗаменыСоединения = "ВложенныйЗапрос%1.Студент = ТаблицаПлановыхОплат.Учащийся И ВложенныйЗапрос%1.Факультет = ТаблицаПлановыхОплат.Факультет";
		НомерВхождения = 0;
		
		Пока НомерВхождения <= ЧислоВхождений Цикл
			
			СтрокаПодзапросаСоединения = ?(НомерВхождения = 0, "", Строка(НомерВхождения));
			СтрокаПоискаСоединения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоискаСоединения, СтрокаПодзапросаСоединения);
			СтрокаЗаменыСоединения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонЗаменыСоединения, СтрокаПодзапросаСоединения);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, СтрокаПоискаСоединения, СтрокаЗаменыСоединения);
			
			НомерВхождения = НомерВхождения + 1;
			
		КонецЦикла; 
				
	КонецЕсли; 
	
	НаборДанных.Запрос = ТекстЗапроса;
	
КонецПроцедуры

Процедура ОбработатьМакет(МакетКомпоновки)
	
	ОбработатьТекстЗапроса(МакетКомпоновки.НаборыДанных.Данные.Элементы.ПланДоПериода);
	ОбработатьТекстЗапроса(МакетКомпоновки.НаборыДанных.Данные.Элементы.ПланПериода);
	ОбработатьТекстЗапроса(МакетКомпоновки.НаборыДанных.Данные.Элементы.ОплатаДоПериода);
	ОбработатьТекстЗапроса(МакетКомпоновки.НаборыДанных.Данные.Элементы.ОплатаВПериод);
	
КонецПроцедуры

Процедура ЗаменитьТекстыЗапросовФактическихОплат(СхемаКомпоновкиДанных)

	// Факультет получить из данных студентов, а не из регистра накопления "Расчеты со студентами"
	
	СхемаКомпоновкиДанных.НаборыДанных.Данные.Элементы.ОплатаДоПериода.Запрос = ТекстЗапросаОплатаДоПериода();
	СхемаКомпоновкиДанных.НаборыДанных.Данные.Элементы.ОплатаВПериод.Запрос   = ТекстЗапросаОплатаВПериод();

КонецПроцедуры

Функция ТекстЗапросаОплатаДоПериода()

	Возврат
	"ВЫБРАТЬ
	|	ПоследниеДаты.Студент КАК Студент,
	|	МАКСИМУМ(СведенияОСтудентах.Факультет) КАК Факультет,
	|	СведенияОСтудентах.Договор КАК Договор
	|ПОМЕСТИТЬ ФакультетыСтудентов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОСтудентах.Студент КАК Студент,
	|		МАКСИМУМ(СведенияОСтудентах.Период) КАК Период,
	|		СведенияОСтудентах.Договор КАК Договор
	|	ИЗ
	|		РегистрСведений.СведенияОСтудентах КАК СведенияОСтудентах
	|	ГДЕ
	|		СведенияОСтудентах.Период <= &КонецПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОСтудентах.Студент,
	|		СведенияОСтудентах.Договор) КАК ПоследниеДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтудентах КАК СведенияОСтудентах
	|		ПО ПоследниеДаты.Студент = СведенияОСтудентах.Студент
	|			И ПоследниеДаты.Период = СведенияОСтудентах.Период
	|			И ПоследниеДаты.Договор = СведенияОСтудентах.Договор
	|{ГДЕ
	|	ПоследниеДаты.Студент.* КАК Учащийся}
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДаты.Студент,
	|	СведенияОСтудентах.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Студент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСоСтудентамиОбороты.Организация КАК Организация,
	|	ФакультетыСтудентов.Факультет КАК Факультет,
	|	РасчетыСоСтудентамиОбороты.Студент КАК Учащийся,
	|	РасчетыСоСтудентамиОбороты.ВалютаВзаиморасчетов КАК Валюта,
	|	РасчетыСоСтудентамиОбороты.ДоговорКонтрагента КАК Договор,
	|	РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовРасход КАК ОплатаДоПериода,
	|	ВЫБОР
	|		КОГДА РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовПриход - РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовРасход  > 0
	|			ТОГДА РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовПриход - РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовРасход
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗадолженностьДоПериода
	|
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Факультет.*,
	|	Учащийся.*,
	|	Валюта.*,
	|	Договор.*,
	|	ОплатаДоПериода,
	|	ЗадолженностьДоПериода}
	|ИЗ
	|	РегистрНакопления.РасчетыСоСтудентами.Обороты(, {(ДОБАВИТЬКДАТЕ(&НачалоПериода, СЕКУНДА, -1))}, Авто, {(Организация).* КАК Организация, (Студент).* КАК Учащийся, (Факультет).* КАК Факультет, (ВалютаВзаиморасчетов).* КАК Валюта}) КАК РасчетыСоСтудентамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФакультетыСтудентов КАК ФакультетыСтудентов
	|		ПО РасчетыСоСтудентамиОбороты.Студент = ФакультетыСтудентов.Студент
	|			И РасчетыСоСтудентамиОбороты.ДоговорКонтрагента = ФакультетыСтудентов.Договор
	|ГДЕ
	|	1 = &РассчитыватьОплатуДоПериода
	|{ГДЕ
	|	РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовРасход КАК ОплатаДоПериода,
	|	ФакультетыСтудентов.Факультет.*}
	|{ХАРАКТЕРИСТИКИ
	|	ТИП(Справочник.Студенты)
	|	ВИДЫХАРАКТЕРИСТИК ПланВидовХарактеристик.ПоляПриказовОбразование
	|	ПОЛЕКЛЮЧА Ссылка
	|	ПОЛЕИМЕНИ Наименование
	|	ПОЛЕТИПАЗНАЧЕНИЯ ТипЗначения
	|	ЗНАЧЕНИЯХАРАКТЕРИСТИК (ВЫБРАТЬ
	|			СведенияОбУчащихсяСрез.Студент КАК Студент,
	|			СведенияОбУчащихсяСрез.Поле КАК Поле,
	|			СведенияОбУчащихсяСрез.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.СведенияОСтудентах.СрезПоследних(&КонецПериода, ) КАК СведенияОбУчащихсяСрез)
	|	ПОЛЕОБЪЕКТА Студент
	|	ПОЛЕВИДА Поле
	|	ПОЛЕЗНАЧЕНИЯ Значение }";

КонецФункции

Функция ТекстЗапросаОплатаВПериод()

	Возврат
	"ВЫБРАТЬ
	|	ПоследниеДаты.Студент КАК Студент,
	|	МАКСИМУМ(СведенияОСтудентах.Факультет) КАК Факультет,
	|	СведенияОСтудентах.Договор КАК Договор
	|ПОМЕСТИТЬ ФакультетыСтудентов
	|ИЗ
	|	(ВЫБРАТЬ
	|		СведенияОСтудентах.Студент КАК Студент,
	|		МАКСИМУМ(СведенияОСтудентах.Период) КАК Период,
	|		СведенияОСтудентах.Договор КАК Договор
	|	ИЗ
	|		РегистрСведений.СведенияОСтудентах КАК СведенияОСтудентах
	|	ГДЕ
	|		СведенияОСтудентах.Период <= &КонецПериода
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СведенияОСтудентах.Студент,
	|		СведенияОСтудентах.Договор) КАК ПоследниеДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтудентах КАК СведенияОСтудентах
	|		ПО ПоследниеДаты.Студент = СведенияОСтудентах.Студент
	|			И ПоследниеДаты.Период = СведенияОСтудентах.Период
	|			И ПоследниеДаты.Договор = СведенияОСтудентах.Договор
	|{ГДЕ
	|	ПоследниеДаты.Студент.* КАК Учащийся}
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоследниеДаты.Студент,
	|	СведенияОСтудентах.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Студент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСоСтудентамиОбороты.Организация КАК Организация,
	|	ФакультетыСтудентов.Факультет КАК Факультет,
	|	РасчетыСоСтудентамиОбороты.Студент КАК Учащийся,
	|	РасчетыСоСтудентамиОбороты.ВалютаВзаиморасчетов КАК Валюта,
	|	РасчетыСоСтудентамиОбороты.ДоговорКонтрагента КАК Договор,
	|	РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовРасход КАК ОплатаПериода,
	|	РасчетыСоСтудентамиОбороты.Регистратор КАК Регистратор,
	|	РасчетыСоСтудентамиОбороты.ПериодСекунда КАК ПериодСекунда
	|{ВЫБРАТЬ
	|	Организация.*,
	|	Факультет.*,
	|	Учащийся.*,
	|	Валюта.*,
	|	Договор.*,
	|	ОплатаПериода,
	|	Регистратор.*,
	|	ПериодСекунда}
	|ИЗ
	|	РегистрНакопления.РасчетыСоСтудентами.Обороты(&НачалоПериода, &КонецПериода, Авто, {(Организация).* КАК Организация, (Студент).* КАК Учащийся, (ВалютаВзаиморасчетов).* КАК Валюта}) КАК РасчетыСоСтудентамиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФакультетыСтудентов КАК ФакультетыСтудентов
	|		ПО РасчетыСоСтудентамиОбороты.Студент = ФакультетыСтудентов.Студент
	|			И РасчетыСоСтудентамиОбороты.ДоговорКонтрагента = ФакультетыСтудентов.Договор
	|{ГДЕ
	|	РасчетыСоСтудентамиОбороты.СуммаВзаиморасчетовРасход КАК ОплатаПериода,
	|	РасчетыСоСтудентамиОбороты.Регистратор.*,
	|	ФакультетыСтудентов.Факультет.*}
	|{ХАРАКТЕРИСТИКИ
	|	ТИП(Справочник.Студенты)
	|	ВИДЫХАРАКТЕРИСТИК ПланВидовХарактеристик.ПоляПриказовОбразование
	|	ПОЛЕКЛЮЧА Ссылка
	|	ПОЛЕИМЕНИ Наименование
	|	ПОЛЕТИПАЗНАЧЕНИЯ ТипЗначения
	|	ЗНАЧЕНИЯХАРАКТЕРИСТИК (ВЫБРАТЬ
	|			СведенияОбУчащихсяСрез.Студент КАК Студент,
	|			СведенияОбУчащихсяСрез.Поле КАК Поле,
	|			СведенияОбУчащихсяСрез.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.СведенияОСтудентах.СрезПоследних(&КонецПериода, ) КАК СведенияОбУчащихсяСрез)
	|	ПОЛЕОБЪЕКТА Студент
	|	ПОЛЕВИДА Поле
	|	ПОЛЕЗНАЧЕНИЯ Значение }";

КонецФункции

#КонецОбласти

#КонецЕсли
