#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);   
	
	Если МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.ЕБПАУБУ") И НЕ ПометкаУдаления Тогда  
		// надо проверить дубли
		ПредполагаемыйДубль = Справочники.ЛицевыеСчета.ЛицевойСчетПоНомеру(Код, Владелец); 
		Если ЗначениеЗаполнено(ПредполагаемыйДубль) И НЕ Ссылка = ПредполагаемыйДубль Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для организации %1 уже существует лицевой счет с номером %2.
			|Запись невозможна!'"),
			Владелец,
			Код);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ); 
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ОтдельныйСчетГОЗ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ГосударственныйКонтрактПоГОЗ");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МодульИнтеграции) 
		Или МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.НетИнтеграции") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидОбмена");  
		МассивНепроверяемыхРеквизитов.Добавить("НастройкаФорматов"); 
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
	ПроверяемыеРеквизиты,
	МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец") И ЗначениеЗаполнено(ДанныеЗаполнения.Владелец) Тогда
		Владелец = ДанныеЗаполнения.Владелец;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 
	
#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли


