
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(ЭтотОбъект,,"Владелец");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОС",
		,,, Ложь, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
	УстановитьОтборПоКодуИнвНомера(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБГУ.ВосстановитьОтборСписка(Список, Настройки, "Владелец");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборИнвНомерПриИзменении(Элемент)
	УстановитьОтборПоКодуИнвНомера(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ОбъектыТекущейСтроки = ПолучитьСписокОбъектовТекущейСтроки();
	Если ОбъектыТекущейСтроки.Количество() > 0 Тогда
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Организация", ОбъектыТекущейСтроки[0].Значение);
		ДопПараметры.Вставить("ОсновноеСредство", ОбъектыТекущейСтроки[1].Значение);
		ПараметрыСоздания = Новый ФиксированнаяСтруктура(ДопПараметры);
	Иначе
		ПараметрыСоздания = Новый ФиксированнаяСтруктура;
	КонецЕсли;
	
	Элементы.Список.ДополнительныеПараметрыСоздания = ПараметрыСоздания;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ОбъектыТекущиейСтроки = ПолучитьСписокОбъектовТекущейСтроки();
	
	Если ОбъектыТекущиейСтроки.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ОбъектыТекущиейСтроки.Количество() = 2 Тогда
		ПоказатьЗначение(Неопределено, ОбъектыТекущиейСтроки[1].Значение);
	Иначе
		
		МенюВыбора = Новый СписокЗначений;
		МенюВыбора.Добавить(ОбъектыТекущиейСтроки[1].Значение, "Открыть объект: " + ОбъектыТекущиейСтроки[1].Значение);
		МенюВыбора.Добавить(ОбъектыТекущиейСтроки[2].Значение, "Открыть инв. номер: " + ОбъектыТекущиейСтроки[2].Значение);
		
		ПоказатьВыборИзМеню(Новый ОписаниеОповещения("СписокПередНачаломИзмененияЗавершение", ЭтотОбъект), МенюВыбора, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзмененияЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ПоказатьЗначение(Неопределено, ВыбранноеЗначение.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьОтбор(Команда)
	УстановитьОтборПоКодуИнвНомера(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоКодуИнвНомера(Форма)
	
	Если ЗначениеЗаполнено(Форма.ОтборИнвНомер) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "БезОтбора", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "КолСимволов", СтрДлина(Форма.ОтборИнвНомер));
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "НачалоКода", Форма.ОтборИнвНомер);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "БезОтбора", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "КолСимволов", 1);
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "НачалоКода", "");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокОбъектовТекущейСтроки()
	
	СписокРезультат = Новый СписокЗначений;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		СписокРезультат.Добавить(ТекущиеДанные.Владелец);
		СписокРезультат.Добавить(ТекущиеДанные.ОС);
		Если ЗначениеЗаполнено(ТекущиеДанные.ИнвентарныйНомер) Тогда
			СписокРезультат.Добавить(ТекущиеДанные.ИнвентарныйНомер);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СписокРезультат;
	
КонецФункции

#КонецОбласти
