
#Область СлужебныйПрограммныйИнтерфейс

///////////////////////////////////////////////////////////////////////////////////
// Управление отображением и доступностью гражданства

Процедура ГражданствоФизическихЛицЛицоБезГражданстваПриИзменении(Форма) Экспорт
	Если Форма.ГражданствоФизическихЛицЛицоБезГражданства Тогда
		Форма.ГражданствоФизическихЛиц.Страна = ПредопределенноеЗначение("Справочник.СтраныМира.ПустаяСсылка");
	Иначе
		Если Форма.ГражданствоФизическихЛицПрежняя.Страна <> ПредопределенноеЗначение("Справочник.СтраныМира.Россия") Тогда
			Форма.ГражданствоФизическихЛиц.Страна = Форма.ГражданствоФизическихЛицПрежняя.Страна;
		КонецЕсли; 
	КонецЕсли;
	ГражданствоФизическихЛицПроверитьЗаполненностьПериода(Форма);
	ОбновитьОтображениеПолейВводаГражданства(Форма);
КонецПроцедуры

Процедура ГражданствоФизическихЛицСтранаПриИзменении(Форма) Экспорт
	ГражданствоФизическихЛицПроверитьЗаполненностьПериода(Форма);
	ОбновитьОтображениеПолейВводаГражданства(Форма);
КонецПроцедуры

Процедура ОбновитьОтображениеПолейВводаГражданства(Форма) Экспорт
	Форма.Элементы.ГражданствоФизическихЛицЛицоБезГражданства.Доступность = Истина;
	Если Форма.ГражданствоФизическихЛицЛицоБезГражданства Тогда
		Форма.Элементы.ГражданствоФизическихЛицСтрана.Доступность = Ложь;
		Форма.Элементы.ГражданствоФизическихЛицСтрана.АвтоОтметкаНезаполненного = Ложь;
		Форма.Элементы.ГражданствоФизическихЛицСтрана.ОтметкаНезаполненного = Ложь;
	Иначе
		Форма.Элементы.ГражданствоФизическихЛицСтрана.Доступность = Истина;
		Форма.Элементы.ГражданствоФизическихЛицСтрана.АвтоОтметкаНезаполненного = Истина;
		Форма.Элементы.ГражданствоФизическихЛицСтрана.ОтметкаНезаполненного =  НЕ ЗначениеЗаполнено(Форма.ГражданствоФизическихЛиц.Страна);
	КонецЕсли;
	ОбновитьПолеГражданствоПериод(Форма);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ПРОСМОТРА ИСТОРИИ ПЕРИОДИЧЕСКИХ ДАННЫХ ФИЗИЧЕСКИХ ЛИЦ

Процедура ГражданствоИстория(ФизическоеЛицо, Владелец)Экспорт
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицо);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, ТолькоПросмотр", Отбор, Истина, Ложь);
	ОткрытьФорму("РегистрСведений.ГражданствоФизическихЛиц.ФормаСписка", ПараметрыФормы, Владелец);	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ГражданствоФизическихЛицПроверитьЗаполненностьПериода(Форма)
	Если Форма.ГражданствоФизическихЛиц.Страна = ПредопределенноеЗначение("Справочник.СтраныМира.Россия")
		И НЕ ЗначениеЗаполнено(Форма.ГражданствоФизическихЛицПрежняя.Период) Тогда
		Форма.ГражданствоФизическихЛиц.Период = '00010101000000';
	Иначе
		Если Не ЗначениеЗаполнено(Форма.ГражданствоФизическихЛиц.Период) Тогда
			Форма.ГражданствоФизическихЛиц.Период = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьПолеГражданствоПериод(Форма)
	// не обязательно заполнение поля Период если данные по умолчанию и при этом 
	// записи о гражданстве еще нет
	Если Форма.ГражданствоФизическихЛиц.Страна = ПредопределенноеЗначение("Справочник.СтраныМира.Россия") И 
		НЕ ЗначениеЗаполнено(Форма.ГражданствоФизическихЛицПрежняя.Период) Тогда
		Форма.Элементы.ГражданствоФизическихЛицПериод.АвтоОтметкаНезаполненного = Ложь;
		Форма.Элементы.ГражданствоФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
	Иначе
		Форма.Элементы.ГражданствоФизическихЛицПериод.АвтоОтметкаНезаполненного = Истина;
		Если ЗначениеЗаполнено(Форма.ГражданствоФизическихЛиц.Период) Тогда
			Форма.Элементы.ГражданствоФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
		Иначе
			Форма.Элементы.ГражданствоФизическихЛицПериод.ОтметкаНезаполненного = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
