
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбранноеПоле = Параметры.ВыбранноеПоле;
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	
	Для каждого АгрегатнаяФункция Из Справочники.ПроводкиТиповыхОпераций.ДоступныеАгрегатныеФункции() Цикл
	
		СписокАгрегатныхФункций.Добавить(АгрегатнаяФункция.ИмяДляФормулы, АгрегатнаяФункция.Представление);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокАгрегатныхФункций

&НаКлиенте
Процедура СписокАгрегатныхФункцийПриАктивизацииСтроки(Элемент)
	УстановитьТекстФормулы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ОповеститьОВыборе(ТекстФормулы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстФормулы(Форма)

	ТекущаяФункция = Форма.Элементы.СписокАгрегатныхФункций.ТекущиеДанные;
	Если ТекущаяФункция = Неопределено Тогда
		ТекстФормулы = Форма.ВыбранноеПоле;
	Иначе
		ТекстФормулы = СтрЗаменить(ТекущаяФункция.Значение,	"<РеквизитРабличнойЧасти>",	Форма.ВыбранноеПоле);
		ТекстФормулы = СтрЗаменить(ТекстФормулы,			"<ИмяТабличнойЧасти>",	"""" + Форма.ИмяТабличнойЧасти + """");
	КонецЕсли;
	Форма.ТекстФормулы = ТекстФормулы;

КонецПроцедуры // УстановитьТекстФормулы()

#КонецОбласти
