#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПроверитьПередЗаполнениемРаздела1(Знач ДокументОбъект, Отказ) Экспорт
	
	Отказ = Ложь;
	
	ИнвентаризацияСервер.ПроверитьНаличиеСчетовБезУчетаПоПодразделениямДокументаОписи(ДокументОбъект, Отказ);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0510470";
	КомандаПечати.Представление = 
		НСтр("ru='Инвентаризационная опись ценных бумаг (ф. 0510470)'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// печать формы 0510470

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Форма0510470");
	Если ПечатнаяФорма <> Неопределено Тогда
		
		// ИндикаторКворумаПрисутствия
		ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
		// Конец ИндикаторКворумаПрисутствия

		ПечатнаяФорма.ТабличныйДокумент = СформироватьПечатнуюФорму0510470(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = 
			НСтр("ru = 'Инвентаризационная опись ценных бумаг (ф. 0510470)'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ИнвентаризационнаяОписьЦенныхБумаг.ПФ_MXL_Ф0510470";

	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// Возвращаемое значение:
//   см. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииЗаблокированныхРеквизитов.ЗаблокированныеРеквизиты
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("Организация");
	Результат.Добавить("ВидЦенныхБумаг");
	Результат.Добавить("ФормаЦенныхБумаг");
	Результат.Добавить("РешениеОПроведенииИнвентаризации");
	Результат.Добавить("Подразделение");
	Результат.Добавить("ИФО");
	Возврат Результат;
КонецФункции

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеРаздела1(ДокументОбъектИлиФорма, Отказ, НепроверяемыеРеквизиты,
	ПроверкаИзФормы = Ложь) Экспорт

	ИмяТабличнойЧасти = "Раздел1";
	ИмяСписка = НСтр("ru = 'Раздел 1'");

	ПроверитьЗаполнениеРаздела(ДокументОбъектИлиФорма, ИмяТабличнойЧасти, ИмяСписка, Отказ,
		НепроверяемыеРеквизиты, ПроверкаИзФормы);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРаздела21(ДокументОбъектИлиФорма, Отказ, НепроверяемыеРеквизиты,
	ПроверкаИзФормы = Ложь) Экспорт

	ИмяТабличнойЧасти = "Раздел21";
	ИмяСписка = НСтр("ru = 'Раздел 2.1'");

	ПроверитьЗаполнениеРаздела(ДокументОбъектИлиФорма, ИмяТабличнойЧасти, ИмяСписка, Отказ,
		НепроверяемыеРеквизиты, ПроверкаИзФормы);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРаздела22(ДокументОбъектИлиФорма, Отказ, НепроверяемыеРеквизиты,
	ПроверкаИзФормы = Ложь) Экспорт

	ИмяТабличнойЧасти = "Раздел22";
	ИмяСписка = НСтр("ru = 'Раздел 2.2'");

	ПроверитьЗаполнениеРаздела(ДокументОбъектИлиФорма, ИмяТабличнойЧасти, ИмяСписка, Отказ,
		НепроверяемыеРеквизиты, ПроверкаИзФормы);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРаздела3(ДокументОбъектИлиФорма, Отказ, НепроверяемыеРеквизиты,
	ПроверкаИзФормы = Ложь) Экспорт

	ИмяТабличнойЧасти = "Раздел3";
	ИмяСписка = НСтр("ru = 'Раздел 3'");

	ПроверитьЗаполнениеРаздела(ДокументОбъектИлиФорма, ИмяТабличнойЧасти, ИмяСписка, Отказ,
		НепроверяемыеРеквизиты, ПроверкаИзФормы);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРаздела4(ДокументОбъектИлиФорма, Отказ, НепроверяемыеРеквизиты,
	ПроверкаИзФормы = Ложь) Экспорт

	ИмяТабличнойЧасти = "Раздел4";
	ИмяСписка = НСтр("ru = 'Раздел 4'");

	ПроверитьЗаполнениеРаздела(ДокументОбъектИлиФорма, ИмяТабличнойЧасти, ИмяСписка, Отказ,
		НепроверяемыеРеквизиты, ПроверкаИзФормы);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеРаздела(ДокументОбъектИлиФорма, ИмяТабличнойЧасти, ИмяСписка, Отказ,
	НепроверяемыеРеквизиты, ПроверкаИзФормы)
	
	Если ПроверкаИзФормы Тогда
		Объект = ДокументОбъектИлиФорма.Объект;
		Форма = ДокументОбъектИлиФорма;
	Иначе
		Объект = ДокументОбъектИлиФорма;
	КонецЕсли;
	
	Таблица = Объект[ИмяТабличнойЧасти];
	МетаданныеРеквизитов = Метаданные.Документы.ИнвентаризационнаяОписьЦенныхБумаг
		.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
	
	ИменаРеквизитов = Новый Массив;
	СинонимыРеквизитов = Новый Структура;
	Для Каждого Реквизит Из МетаданныеРеквизитов Цикл
		Если Реквизит.ПроверкаЗаполнения = ПроверкаЗаполнения.ВыдаватьОшибку Тогда
			НепроверяемыеРеквизиты.Добавить(СтрШаблон("%1.%2", ИмяТабличнойЧасти, Реквизит.Имя));	
			ИменаРеквизитов.Добавить(Реквизит.Имя);
			СинонимыРеквизитов.Вставить(Реквизит.Имя, МетаданныеРеквизитов[Реквизит.Имя].Синоним);
		КонецЕсли;
	КонецЦикла;
	
	НастройкаПроверкиПоКоличеству = НастройкаПроверкиПоКоличеству(ИмяТабличнойЧасти);
	НастройкаПроверкиПоОтметке = НастройкаПроверкиПоОтметке(ИмяТабличнойЧасти);
	НастройкаПроверкиСерияНомер = НастройкаПроверкиСерияНомер(ИмяТабличнойЧасти);
	НастройкаПроверкиНомера = НастройкаПроверкиНомера(ИмяТабличнойЧасти);
	
	ВидСообщения = "";
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		ПроверитьТолькоЗаключениеКомиссии = ИмяТабличнойЧасти = "Раздел4" И Не Объект.ВыявленыНесоответствия
			И Не Объект.ВыявленыОтклонения;
		НеПроверятьЗаключениеКомиссии = ИмяТабличнойЧасти = "Раздел4" И ПроверкаИзФормы;
		
		Для Каждого ИмяРеквизита Из ИменаРеквизитов Цикл
			
			Если ПроверитьТолькоЗаключениеКомиссии И ИмяРеквизита <> "ЗаключениеКомиссии" Тогда
				Продолжить;
			КонецЕсли;
			
			Если НеПроверятьЗаключениеКомиссии И (ИмяРеквизита = "ЗаключениеКомиссии"
				Или ИмяРеквизита = "СтатусОбъяснения") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПропуститьПроверкуКоличествоНеЗаполнено(ИмяРеквизита, СтрокаТаблицы,
				НастройкаПроверкиПоКоличеству) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПропуститьПроверкуСерияНомер(ИмяРеквизита, СтрокаТаблицы, НастройкаПроверкиСерияНомер)
				И ПропуститьПроверкуНомера(ИмяРеквизита, СтрокаТаблицы, НастройкаПроверкиНомера) Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ПропуститьПроверкуНетОтметки(ИмяРеквизита, СтрокаТаблицы, НастройкаПроверкиПоОтметке) Тогда
				Продолжить;
			КонецЕсли;

			Если ПропуститьПроверкуОбъяснениеРаздел3(ИмяРеквизита, СтрокаТаблицы, ПроверкаИзФормы) Тогда
				Продолжить;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(СтрокаТаблицы[ИмяРеквизита]) Тогда
				
				СинонимРеквизита = СинонимыРеквизитов[ИмяРеквизита];
				ВидСообщения = "Заполнение";
				
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", ВидСообщения,
					СинонимРеквизита, СтрокаТаблицы.НомерСтроки, ИмяСписка);
					
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, СтрокаТаблицы.НомерСтроки,
					ИмяРеквизита);
				Если ПроверкаИзФормы Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Форма.РеквизитФормыВЗначение("Объект"),
						Поле, "Объект", Отказ);
				Иначе
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, Поле, "Объект", Отказ);
				КонецЕсли;		
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция НастройкаПроверкиПоКоличеству(ИмяТабличнойЧасти)
	НастройкаПроверкиПоКоличеству = Новый Соответствие;
	
	Если ИмяТабличнойЧасти = "Раздел21" Тогда
		
		НастройкаПроверкиПоКоличеству.Вставить("Серия", "Количество");
		НастройкаПроверкиПоКоличеству.Вставить("Номер", "Количество");
		НастройкаПроверкиПоКоличеству.Вставить("Валюта", "Количество");
		НастройкаПроверкиПоКоличеству.Вставить("Курс", "Количество");
		
	ИначеЕсли ИмяТабличнойЧасти = "Раздел22" Тогда

		НастройкаПроверкиПоКоличеству.Вставить("СерияНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("НомерНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("КурсНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("СтатусНеСоответствует", "КоличествоНеСоответствует");

		НастройкаПроверкиПоКоличеству.Вставить("СерияИзлишки", "КоличествоИзлишки");
		НастройкаПроверкиПоКоличеству.Вставить("НомерИзлишки", "КоличествоИзлишки");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаИзлишки", "КоличествоИзлишки");
		НастройкаПроверкиПоКоличеству.Вставить("КурсИзлишки", "КоличествоИзлишки");

		НастройкаПроверкиПоКоличеству.Вставить("СерияНедостача", "КоличествоНедостача");
		НастройкаПроверкиПоКоличеству.Вставить("НомерНедостача", "КоличествоНедостача");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаНедостача", "КоличествоНедостача");
		НастройкаПроверкиПоКоличеству.Вставить("КурсНедостача", "КоличествоНедостача");

	ИначеЕсли ИмяТабличнойЧасти = "Раздел3" Тогда

		НастройкаПроверкиПоКоличеству.Вставить("СерияИзлишки", "КоличествоИзлишки");
		НастройкаПроверкиПоКоличеству.Вставить("НомерИзлишки", "КоличествоИзлишки");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаИзлишки", "КоличествоИзлишки");
		НастройкаПроверкиПоКоличеству.Вставить("КурсИзлишки", "КоличествоИзлишки");

		НастройкаПроверкиПоКоличеству.Вставить("СерияНедостача", "КоличествоНедостача");
		НастройкаПроверкиПоКоличеству.Вставить("НомерНедостача", "КоличествоНедостача");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаНедостача", "КоличествоНедостача");
		НастройкаПроверкиПоКоличеству.Вставить("КурсНедостача", "КоличествоНедостача");

		НастройкаПроверкиПоКоличеству.Вставить("СерияИзлишкиПодтверждено", "КоличествоИзлишкиПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("НомерИзлишкиПодтверждено", "КоличествоИзлишкиПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаИзлишкиПодтверждено", "КоличествоИзлишкиПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("КурсИзлишкиПодтверждено", "КоличествоИзлишкиПодтверждено");

		НастройкаПроверкиПоКоличеству.Вставить("СерияНедостачаПодтверждено", "КоличествоНедостачаПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("НомерНедостачаПодтверждено", "КоличествоНедостачаПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаНедостачаПодтверждено", "КоличествоНедостачаПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("КурсНедостачаПодтверждено", "КоличествоНедостачаПодтверждено");

		НастройкаПроверкиПоКоличеству.Вставить("СерияИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("НомерИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("КурсИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");

		НастройкаПроверкиПоКоличеству.Вставить("СерияНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("НомерНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("КурсНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");

	ИначеЕсли ИмяТабличнойЧасти = "Раздел4" Тогда

		НастройкаПроверкиПоКоличеству.Вставить("СерияНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("НомерНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("КурсНеСоответствует", "КоличествоНеСоответствует");
		НастройкаПроверкиПоКоличеству.Вставить("СтатусНеСоответствует", "КоличествоНеСоответствует");

		НастройкаПроверкиПоКоличеству.Вставить("СерияИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("НомерИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("КурсИзлишкиНеПодтверждено", "КоличествоИзлишкиНеПодтверждено");

		НастройкаПроверкиПоКоличеству.Вставить("СерияНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("НомерНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("ВалютаНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");
		НастройкаПроверкиПоКоличеству.Вставить("КурсНедостачаНеПодтверждено", "КоличествоНедостачаНеПодтверждено");

	КонецЕсли;
	
	Возврат НастройкаПроверкиПоКоличеству;
КонецФункции

Функция НастройкаПроверкиПоОтметке(ИмяТабличнойЧасти)
	НастройкаПроверкиПоОтметке = Новый Соответствие;
	
	Если ИмяТабличнойЧасти = "Раздел21" Тогда
		
		НастройкаПроверкиПоОтметке.Вставить("СерияНеСоответствует", "НеСоответствует");
		НастройкаПроверкиПоОтметке.Вставить("НомерНеСоответствует", "НеСоответствует");
		НастройкаПроверкиПоОтметке.Вставить("ВалютаНеСоответствует", "НеСоответствует");
		НастройкаПроверкиПоОтметке.Вставить("КурсНеСоответствует", "НеСоответствует");
		НастройкаПроверкиПоОтметке.Вставить("КоличествоНеСоответствует", "НеСоответствует");
		НастройкаПроверкиПоОтметке.Вставить("СтатусНеСоответствует", "НеСоответствует");
		
	ИначеЕсли ИмяТабличнойЧасти = "Раздел3" Тогда
		
		НастройкаПроверкиПоОтметке.Вставить("НаименованиеДокумента", "Подтверждено");
		НастройкаПроверкиПоОтметке.Вставить("НомерДокумента", "Подтверждено");
		НастройкаПроверкиПоОтметке.Вставить("ДатаДокумента", "Подтверждено");
	
	КонецЕсли;
	
	Возврат НастройкаПроверкиПоОтметке;	
КонецФункции

Функция НастройкаПроверкиСерияНомер(ИмяТабличнойЧасти)
	НастройкаПроверкиСерияНомер = Новый Соответствие;
	Если ИмяТабличнойЧасти = "Раздел1" Тогда
		НастройкаПроверкиСерияНомер.Вставить("Серия", "Номер");
		НастройкаПроверкиСерияНомер.Вставить("Номер", "Серия");
	ИначеЕсли ИмяТабличнойЧасти = "Раздел21" Тогда
		НастройкаПроверкиСерияНомер.Вставить("Серия", "Номер");
		НастройкаПроверкиСерияНомер.Вставить("Номер", "Серия");
		НастройкаПроверкиСерияНомер.Вставить("СерияНеСоответствует", "НомерНеСоответствует");
		НастройкаПроверкиСерияНомер.Вставить("НомерНеСоответствует", "СерияНеСоответствует");
	ИначеЕсли ИмяТабличнойЧасти = "Раздел22" Тогда
		НастройкаПроверкиСерияНомер.Вставить("СерияНеСоответствует", "НомерНеСоответствует");
		НастройкаПроверкиСерияНомер.Вставить("НомерНеСоответствует", "СерияНеСоответствует");
		НастройкаПроверкиСерияНомер.Вставить("СерияИзлишки", "НомерИзлишки");
		НастройкаПроверкиСерияНомер.Вставить("НомерИзлишки", "СерияИзлишки");
		НастройкаПроверкиСерияНомер.Вставить("СерияНедостача", "НомерНедостача");
		НастройкаПроверкиСерияНомер.Вставить("НомерНедостача", "СерияНедостача");
	ИначеЕсли ИмяТабличнойЧасти = "Раздел3" Тогда
		НастройкаПроверкиСерияНомер.Вставить("СерияИзлишки", "НомерИзлишки");
		НастройкаПроверкиСерияНомер.Вставить("НомерИзлишки", "СерияИзлишки");
		НастройкаПроверкиСерияНомер.Вставить("СерияНедостача", "НомерНедостача");
		НастройкаПроверкиСерияНомер.Вставить("НомерНедостача", "СерияНедостача");
		НастройкаПроверкиСерияНомер.Вставить("СерияИзлишкиПодтверждено", "НомерИзлишкиПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("НомерИзлишкиПодтверждено", "СерияИзлишкиПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("СерияНедостачаПодтверждено", "НомерНедостачаПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("НомерНедостачаПодтверждено", "СерияНедостачаПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("СерияИзлишкиНеПодтверждено", "НомерИзлишкиНеПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("НомерИзлишкиНеПодтверждено", "СерияИзлишкиНеПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("СерияНедостачаНеПодтверждено", "НомерНедостачаНеПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("НомерНедостачаНеПодтверждено", "СерияНедостачаНеПодтверждено");
	ИначеЕсли ИмяТабличнойЧасти = "Раздел4" Тогда
		НастройкаПроверкиСерияНомер.Вставить("СерияНеСоответствует", "НомерНеСоответствует");
		НастройкаПроверкиСерияНомер.Вставить("НомерНеСоответствует", "СерияНеСоответствует");
		НастройкаПроверкиСерияНомер.Вставить("СерияИзлишкиНеПодтверждено", "НомерИзлишкиНеПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("НомерИзлишкиНеПодтверждено", "СерияИзлишкиНеПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("СерияНедостачаНеПодтверждено", "НомерНедостачаНеПодтверждено");
		НастройкаПроверкиСерияНомер.Вставить("НомерНедостачаНеПодтверждено", "СерияНедостачаНеПодтверждено");
	КонецЕсли;
	Возврат НастройкаПроверкиСерияНомер;	
КонецФункции

Функция НастройкаПроверкиНомера(ИмяТабличнойЧасти)
	НастройкаПроверкиНомера = Новый Соответствие;
	Если ИмяТабличнойЧасти = "Раздел21" Тогда
		НастройкаПроверкиНомера["НомерНеСоответствует"] = Новый Структура;
		НастройкаПроверкиНомера["НомерНеСоответствует"].Вставить("Номер", "Номер");
		НастройкаПроверкиНомера["НомерНеСоответствует"].Вставить("Количество", "КоличествоНеСоответствует");
	ИначеЕсли ИмяТабличнойЧасти = "Раздел3" Тогда
		НастройкаПроверкиНомера["НомерИзлишкиПодтверждено"] = Новый Структура;
		НастройкаПроверкиНомера["НомерИзлишкиПодтверждено"].Вставить("Номер", "НомерИзлишки");
		НастройкаПроверкиНомера["НомерИзлишкиПодтверждено"].Вставить("Количество", "КоличествоИзлишкиПодтверждено");
		НастройкаПроверкиНомера["НомерНедостачаПодтверждено"] = Новый Структура;
		НастройкаПроверкиНомера["НомерНедостачаПодтверждено"].Вставить("Номер", "НомерНедостача");
		НастройкаПроверкиНомера["НомерНедостачаПодтверждено"].Вставить("Количество", "КоличествоНедостачаПодтверждено");
		НастройкаПроверкиНомера["НомерИзлишкиНеПодтверждено"] = Новый Структура;
		НастройкаПроверкиНомера["НомерИзлишкиНеПодтверждено"].Вставить("Номер", "НомерИзлишки");
		НастройкаПроверкиНомера["НомерИзлишкиНеПодтверждено"].Вставить("Количество", "КоличествоИзлишкиНеПодтверждено");
		НастройкаПроверкиНомера["НомерНедостачаНеПодтверждено"] = Новый Структура;
		НастройкаПроверкиНомера["НомерНедостачаНеПодтверждено"].Вставить("Номер", "НомерНедостача");
		НастройкаПроверкиНомера["НомерНедостачаНеПодтверждено"].Вставить("Количество",
			                                                             "КоличествоНедостачаНеПодтверждено");
	КонецЕсли;
	Возврат НастройкаПроверкиНомера;
КонецФункции

Функция ПропуститьПроверкуКоличествоНеЗаполнено(ИмяРеквизита, СтрокаТаблицы, НастройкаПроверкиПоКоличеству)
	ПропуститьПроверку = Ложь;
	РеквизитПроверки = НастройкаПроверкиПоКоличеству[ИмяРеквизита];
	Если РеквизитПроверки <> Неопределено Тогда
		ПропуститьПроверку = СтрокаТаблицы[РеквизитПроверки] = 0;
	КонецЕсли;
	Возврат ПропуститьПроверку;
КонецФункции

Функция ПропуститьПроверкуСерияНомер(ИмяРеквизита, СтрокаТаблицы, НастройкаПроверкиСерияНомер)
	ПропуститьПроверкуСерияНомер = Ложь;
	РеквизитПроверки = НастройкаПроверкиСерияНомер[ИмяРеквизита];
	Если РеквизитПроверки <> Неопределено Тогда
		ПропуститьПроверкуСерияНомер = ЗначениеЗаполнено(СтрокаТаблицы[РеквизитПроверки]);
	КонецЕсли;
	Возврат ПропуститьПроверкуСерияНомер;
КонецФункции

Функция ПропуститьПроверкуНомера(ИмяРеквизита, СтрокаТаблицы, НастройкаПроверкиНомера)
	ПропуститьПроверкуНомера = Истина;
	РеквизитПроверки = НастройкаПроверкиНомера[ИмяРеквизита];
	Если РеквизитПроверки <> Неопределено Тогда
		РеквизитНомер = РеквизитПроверки.Номер;
		РеквизитКоличество = РеквизитПроверки.Количество;
		ПропуститьПроверкуНомера = СтрокаТаблицы[РеквизитКоличество] > 0 
			И Не ЗначениеЗаполнено(СтрокаТаблицы[РеквизитНомер]);
	КонецЕсли;
	Возврат ПропуститьПроверкуНомера;
КонецФункции

Функция ПропуститьПроверкуНетОтметки(ИмяРеквизита, СтрокаТаблицы, НастройкаПроверкиПоОтметке)
	ПропуститьПроверку = Ложь;
	РеквизитПроверки = НастройкаПроверкиПоОтметке[ИмяРеквизита];
	Если РеквизитПроверки <> Неопределено Тогда
		ПропуститьПроверку = Не СтрокаТаблицы[РеквизитПроверки];
	КонецЕсли;
	Возврат ПропуститьПроверку;
КонецФункции

Функция ПропуститьПроверкуОбъяснениеРаздел3(ИмяРеквизита, СтрокаТаблицы, ПроверкаИзФормы)
	ПропуститьПроверку = ИмяРеквизита = "Объяснение" И ((СтрокаТаблицы.КоличествоИзлишкиНеПодтверждено = 0
		И СтрокаТаблицы.КоличествоНедостачаНеПодтверждено = 0) Или ПроверкаИзФормы);
	Возврат ПропуститьПроверку;
КонецФункции

#Область ЗаполнениеРаздела1

Функция ПараметрыЗаполненияРаздел1() Экспорт
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ВидЦенныхБумаг", Перечисления.ВидыЦенныхБумаг.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ФормаЦенныхБумаг", Перечисления.ФормаЦенныхБумаг.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ДатаИнвентаризации", Дата(1,1,1));
	ПараметрыЗаполнения.Вставить("КФО", Перечисления.КВД.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Счет", ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("ИФО", Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
	ПараметрыЗаполнения.Вставить("Подразделение", Справочники.Подразделения.ПустаяСсылка());
	Возврат ПараметрыЗаполнения;
КонецФункции

// Формирует таблицу с данными раздела 1 по данным бухучета
//
// Параметры:
//  ПараметрыЗаполнения - Структура - см. ПараметрыЗаполненияРаздел1() 
//
// Возвращаемое значение:
//   ТаблицаЗначений
//
Функция ТаблицаРаздела1(ПараметрыЗаполнения) Экспорт
	
	ТаблицаРаздела1 = ИнвентаризацияСервер.ПолучитьПустуюТаблицуТабличнойЧасти(
		Метаданные.Документы.ИнвентаризационнаяОписьЦенныхБумаг.ТабличныеЧасти.Раздел1);
	
	Период = НачалоДня(ПараметрыЗаполнения.ДатаИнвентаризации);
	ГраницаОстатка = ИнвентаризацияКлиентСервер.ПолучитьДатуОпределенияОстатков(Период);
	ДатаСреза = ИнвентаризацияКлиентСервер.ПолучитьДатуСрезаРегистровСведенийНакопления(Период);
	СчетаЗаполнения = СчетаЗаполнения(ПараметрыЗаполнения, ДатаСреза);
	Если СчетаЗаполнения.Количество() = 0 Тогда
		Возврат ТаблицаРаздела1;		
	КонецЕсли;	
	
	ДатаКурса = НачалоДня(ПараметрыЗаполнения.ДатаИнвентаризации);
	ВалютаРуб = ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	КурсыВалют = Новый Соответствие;
	КурсРубля = Новый Структура("Валюта, Курс, Кратность", ВалютаРуб, 1, 1);
	КурсыВалют.Вставить(ВалютаРуб, КурсРубля);
	СуммаПоОстатку = ПараметрыЗаполнения.ВидЦенныхБумаг = Перечисления.ВидыЦенныхБумаг.Акция;
	Счет31 = БухгалтерскийУчет.СписокСчетов("31", ДатаСреза, , ПараметрыЗаполнения.Организация);
	ОтдельныйЗапросОстатка = ПараметрыЗаполнения.ВидЦенныхБумаг = Перечисления.ВидыЦенныхБумаг.Акция
		И Не БухгалтерскийУчет.СчетВИерархии(СчетаЗаполнения[0], "31"); 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГраницаОстатка", ГраницаОстатка);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗаполнения.Организация);
	Запрос.УстановитьПараметр("СчетаЗаполнения", СчетаЗаполнения);
	Запрос.УстановитьПараметр("Счет31", Счет31);
	Запрос.УстановитьПараметр("ОтдельныйЗапросОстатка", ОтдельныйЗапросОстатка);
	Запрос.УстановитьПараметр("ВалютаРуб", ВалютаРуб);
	Запрос.УстановитьПараметр("Документарные",
		ПараметрыЗаполнения.ФормаЦенныхБумаг = Перечисления.ФормаЦенныхБумаг.Документарная);
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОбъектыФинансовыхВложений);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	
	ТекстЗапроса = ТекстЗапросаТаблицаРаздела1();
	
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.КФО) Тогда
		УсловиеКФО = "КФО = &КФО";
		Запрос.УстановитьПараметр("КФО", ПараметрыЗаполнения.КФО);
	Иначе
		УсловиеКФО = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеКФО", УсловиеКФО);
	
	ЕстьОтборПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(ПараметрыЗаполнения.ИФО);
	Если ЕстьОтборПоИФО Тогда
		УсловиеИФО = "ИФО = &ИФО";
		Запрос.УстановитьПараметр("ИФО", ПараметрыЗаполнения.ИФО);
	Иначе
		УсловиеИФО = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеИФО", УсловиеИФО);
	
	ЕстьОтборПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И ЗначениеЗаполнено(ПараметрыЗаполнения.Подразделение);
	Если ЕстьОтборПодразделения Тогда
		УсловиеПодразделения = "ЕСТЬNULL(Подразделения.Ссылка, &Подразделение) = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение", ПараметрыЗаполнения.Подразделение);
	Иначе
		УсловиеПодразделения = "ИСТИНА";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПодразделения", УсловиеПодразделения);

	Запрос.Текст = ТекстЗапроса;
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаРаздела1 = ТаблицаРаздела1.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРаздела1, Выборка);
		
		Если Не ЗначениеЗаполнено(СтрокаРаздела1.КодЦеннойБумаги) Тогда
			СтрокаРаздела1.КодЦеннойБумаги = Выборка.РНФИ;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.Серия) И Не ЗначениеЗаполнено(Выборка.Номер) Тогда
			СтрокаРаздела1.Серия = Выборка.РегистрационныйНомер;
			СтрокаРаздела1.Номер = "";
		Иначе
			ДобавитьРазделительНомера(СтрокаРаздела1.Номер);
		КонецЕсли;
		
		КурсВалюты = КурсыВалют[Выборка.Валюта];
		Если КурсВалюты = Неопределено Тогда
			КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.Валюта, ДатаКурса);
			КурсыВалют.Вставить(Выборка.Валюта, КурсВалюты);
		КонецЕсли;
		
		СтрокаРаздела1.Курс = КурсВалюты.Курс;
		СтрокаРаздела1.Кратность = КурсВалюты.Кратность;
		
		СуммаПоНоминалу = Окр(СтрокаРаздела1.Номинал * СтрокаРаздела1.Количество, 2);
		Если СуммаПоОстатку Тогда
			СуммаБУ = ?(Выборка.Валюта = ВалютаРуб, Выборка.СуммаБУРуб, Выборка.СуммаБУВал);
			Если СуммаПоНоминалу <> СуммаБУ Тогда
				СтрокаРаздела1.Номинал = ?(СтрокаРаздела1.Количество = 0, 0, СуммаБУ / СтрокаРаздела1.Количество);
			КонецЕсли;
			СуммаПоНоминалу = СуммаБУ;
		КонецЕсли;
		
		Если Выборка.Валюта = ВалютаРуб Тогда
			СтрокаРаздела1.СуммаВал = 0;
			СтрокаРаздела1.СуммаРуб = СуммаПоНоминалу;
		Иначе
			СтрокаРаздела1.СуммаВал = СуммаПоНоминалу;
			СтрокаРаздела1.СуммаРуб = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаРаздела1.СуммаВал,
				КурсВалюты, КурсРубля);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРаздела1;
КонецФункции

Процедура ДобавитьРазделительНомера(Номер) Экспорт
	Разделитель = "//";
	Если Не ЗначениеЗаполнено(Номер) Или СтрНайти(Номер, Разделитель) > 0 Тогда
		Возврат;
	КонецЕсли;
	Номер = СтрШаблон("%1%2-", Номер, Разделитель);
КонецПроцедуры

Функция ТекстЗапросаТаблицаРаздела1()

	Возврат
		"ВЫБРАТЬ
		|	ОбъектыФинансовыхВложений.Ссылка КАК ЦеннаяБумага,
		|	ЕСТЬNULL(Валюты.Ссылка, &ВалютаРуб) КАК Валюта,
		|	СУММА(ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаОстаток, 0)) КАК СуммаБУВал,
		|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаОстаток) КАК СуммаБУРуб
		|ПОМЕСТИТЬ ВТБухОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ГраницаОстатка, Счет В (&СчетаЗаполнения), &ВидыСубконто,
		|		Организация = &Организация
		|	И &УсловиеИФО
		|	И &УсловиеКФО) КАК ЖурналПроводокЕПСБУОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложений
		|		ПО ЖурналПроводокЕПСБУОстатки.Субконто1 = ОбъектыФинансовыхВложений.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
		|		ПО ЖурналПроводокЕПСБУОстатки.Валюта = Валюты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
		|		ПО ЖурналПроводокЕПСБУОстатки.Подразделение = Подразделения.Ссылка
		|ГДЕ
		|	ОбъектыФинансовыхВложений.Документарные = &Документарные
		|	И &УсловиеПодразделения
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыФинансовыхВложений.Ссылка,
		|	ЕСТЬNULL(Валюты.Ссылка, &ВалютаРуб)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыФинансовыхВложений.Ссылка КАК ЦеннаяБумага,
		|	ЕСТЬNULL(Валюты.Ссылка, &ВалютаРуб) КАК Валюта,
		|	СУММА(ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаОстаток, 0)) КАК СуммаБУВал,
		|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаОстаток) КАК СуммаБУРуб
		|ПОМЕСТИТЬ ВТБухОстаток31
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ГраницаОстатка, Счет В (&Счет31), &ВидыСубконто,
		|		Организация = &Организация
		|	И &УсловиеИФО
		|	И &УсловиеКФО) КАК ЖурналПроводокЕПСБУОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложений
		|		ПО ЖурналПроводокЕПСБУОстатки.Субконто1 = ОбъектыФинансовыхВложений.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
		|		ПО ЖурналПроводокЕПСБУОстатки.Валюта = Валюты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
		|		ПО ЖурналПроводокЕПСБУОстатки.Подразделение = Подразделения.Ссылка
		|ГДЕ
		|	ОбъектыФинансовыхВложений.Документарные = &Документарные
		|	И &УсловиеПодразделения
		|	И &ОтдельныйЗапросОстатка
		|СГРУППИРОВАТЬ ПО
		|	ОбъектыФинансовыхВложений.Ссылка,
		|	ЕСТЬNULL(Валюты.Ссылка, &ВалютаРуб)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦенныеБумагиОстатки.Организация КАК Организация,
		|	ЦенныеБумагиОстатки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЦенныеБумагиОстатки.КоличествоОстаток КАК Количество
		|ПОМЕСТИТЬ ВТКоличествоЦБ
		|ИЗ
		|	РегистрНакопления.ЦенныеБумаги.Остатки(&Период, Организация = &Организация
		|	И ЦеннаяБумага В
		|		(ВЫБРАТЬ
		|			ВТБухОстаток.ЦеннаяБумага
		|		ИЗ
		|			ВТБухОстаток КАК ВТБухОстаток)) КАК ЦенныеБумагиОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбъектыФинансовыхВложений.Ссылка КАК ЦеннаяБумага,
		|	ОбъектыФинансовыхВложений.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	ОбъектыФинансовыхВложений.РНФИ КАК РНФИ,
		|	ОбъектыФинансовыхВложений.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ОбъектыФинансовыхВложений.РегистрационныйНомер КАК РегистрационныйНомер,
		|	ОбъектыФинансовыхВложений.Серия КАК Серия,
		|	ОбъектыФинансовыхВложений.Номер КАК Номер,
		|	ОбъектыФинансовыхВложений.НоминальнаяСтоимость КАК Номинал,
		|	ВТБухОстаток.Валюта КАК Валюта,
		|	ЕСТЬNULL(ВТКоличествоЦБ.Количество, 0) КАК Количество,
		|	ВЫБОР
		|		КОГДА &ОтдельныйЗапросОстатка
		|			ТОГДА ЕСТЬNULL(ВТБухОстаток31.СуммаБУВал, 0)
		|		ИНАЧЕ ВТБухОстаток.СуммаБУВал
		|	КОНЕЦ КАК СуммаБУВал,
		|	ВЫБОР
		|		КОГДА &ОтдельныйЗапросОстатка
		|			ТОГДА ЕСТЬNULL(ВТБухОстаток31.СуммаБУРуб, 0)
		|		ИНАЧЕ ВТБухОстаток.СуммаБУРуб
		|	КОНЕЦ КАК СуммаБУРуб
		|ИЗ
		|	ВТБухОстаток КАК ВТБухОстаток
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФинансовыхВложений КАК ОбъектыФинансовыхВложений
		|		ПО ВТБухОстаток.ЦеннаяБумага = ОбъектыФинансовыхВложений.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоЦБ КАК ВТКоличествоЦБ
		|		ПО ВТБухОстаток.ЦеннаяБумага = ВТКоличествоЦБ.ЦеннаяБумага
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБухОстаток31 КАК ВТБухОстаток31
		|		ПО &ОтдельныйЗапросОстатка
		|		И ВТБухОстаток.ЦеннаяБумага = ВТБухОстаток31.ЦеннаяБумага
		|		И ВТБухОстаток.Валюта = ВТБухОстаток31.Валюта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектыФинансовыхВложений.Наименование";
	
КонецФункции

#КонецОбласти

// Возвращает массив счетов заполнения с учетом установленных отборов
//
// Параметры:
//  ПараметрыЗаполнения - Структура - см. ПараметрыЗаполненияРаздел1()
//  НаДату - Дата
//
// Возвращаемое значение:
//   Массив из ПланСчетовСсылка.ЕПСБУ 
//
Функция СчетаЗаполнения(ПараметрыЗаполнения, НаДату)
	
	СчетаЗаполнения = Новый Массив;
	
	ДопустимыеСчета = Перечисления.ВидыЦенныхБумаг.ДопустимыеСчетаПоВидуЦеннойБумаги(ПараметрыЗаполнения.ВидЦенныхБумаг,
		НаДату, ПараметрыЗаполнения.Организация);
	ЗаданныеСчета = БухгалтерскийУчет.СписокСчетов(ПараметрыЗаполнения.Счет, НаДату, , ПараметрыЗаполнения.Организация);
	
	Для Каждого Элемент Из ЗаданныеСчета Цикл
		Если ДопустимыеСчета.Найти(Элемент) <> Неопределено Тогда
			СчетаЗаполнения.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СчетаЗаполнения;	
КонецФункции

#Область УсловноеОформление

Процедура УстановитьУсловноеОформления(Форма) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;

	УстановитьУсловноеОформлениеРаздел1(УсловноеОформление);
	УстановитьУсловноеОформлениеРаздел21(УсловноеОформление);
	УстановитьУсловноеОформлениеРаздел22(УсловноеОформление);
	УстановитьУсловноеОформлениеРаздел3(УсловноеОформление);
	УстановитьУсловноеОформлениеРаздел4(УсловноеОформление);

	ИнвентаризацияСервер.ДобавитьУсловноеОформлениеСоставКомиссииПричинаОтсутствия(Форма, "СоставКомиссииРаздел2");
	ИнвентаризацияСервер.ДобавитьУсловноеОформлениеСоставКомиссииПричинаОтсутствия(Форма, "СоставКомиссииРаздел4");
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеРаздел1(УсловноеОформление)

	// отметка незаполненного
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел1Серия");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел1.Номер", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел1Номер");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел1.Серия", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеРаздел21(УсловноеОформление)

	// данные раздела 1
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21НомерСтроки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21ЦеннаяБумага");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21КодЦеннойБумаги");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21ЕдиницаИзмерения");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.ДанныеРаздела1", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);

	// отметка незаполненного
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21Серия");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21Номер");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21Валюта");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21Курс");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.Количество", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21Серия");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.Номер", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21Номер");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.Серия", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// отметка незаполненного не соответствтует
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21СерияНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21НомерНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21НоминалНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21ВалютаНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21КурсНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21КоличествоНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21СуммаВалНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21СуммаРубНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21СтатусНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.НеСоответствует", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21СерияНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.НомерНеСоответствует", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел21НомерНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.СерияНеСоответствует", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел21.Номер", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

КонецПроцедуры

Процедура УстановитьУсловноеОформлениеРаздел22(УсловноеОформление)

	// отметка незаполненного
	// не соответствтует
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22СерияНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22НомерНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22ВалютаНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22КурсНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22СтатусНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.КоличествоНеСоответствует", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22СерияНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.НомерНеСоответствует", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22НомерНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.СерияНеСоответствует", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// излишки
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22СерияИзлишки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22НомерИзлишки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22ВалютаИзлишки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22КурсИзлишки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.КоличествоИзлишки", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22СерияИзлишки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.НомерИзлишки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22НомерИзлишки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.СерияИзлишки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// недостача
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22СерияНедостача");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22НомерНедостача");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22ВалютаНедостача");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22КурсНедостача");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.КоличествоНедостача", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22СерияНедостача");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.НомерНедостача", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел22НомерНедостача");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел22.СерияНедостача", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

КонецПроцедуры

Процедура УстановитьУсловноеОформлениеРаздел3(УсловноеОформление)

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3Объяснение");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.Объяснение", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<...>");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3Объяснение");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.Объяснение", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор, ,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,	
		"Объект.Раздел3.КоличествоИзлишкиНеПодтверждено", ВидСравненияКомпоновкиДанных.Больше, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,	
		"Объект.Раздел3.КоличествоНедостачаНеПодтверждено", ВидСравненияКомпоновкиДанных.Больше, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненныйРеквизит);

	// тлоько просмотр
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КоличествоИзлишкиПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КоличествоНедостачаПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НаименованиеДокумента");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерДокумента");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3ДатаДокумента");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.Подтверждено", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.Подтверждено", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КоличествоИзлишкиПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоИзлишки", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КоличествоНедостачаПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоНедостача", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерИзлишки", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерНедостача", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Отметка не заполнено
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияИзлишки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3ВалютаИзлишки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КурсИзлишки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоИзлишки", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияНедостача");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостача");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3ВалютаНедостача");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КурсНедостача");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоНедостача", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияИзлишкиПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3ВалютаИзлишкиПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КурсИзлишкиПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоИзлишкиПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияНедостачаПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3ВалютаНедостачаПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КурсНедостачаПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоНедостачаПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3ВалютаИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КурсИзлишкиНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоИзлишкиНеПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3ВалютаНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3КурсНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.КоличествоНедостачаНеПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// дополнительные условия отметки не заполнено Серия Номер в строке Результат инвентаризации
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияИзлишки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерИзлишки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишки");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияИзлишки", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияНедостача");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерНедостача", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостача");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияНедостача", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// дополнительные условия отметки не заполнено Серия Номер в строке Подтверждено
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияИзлишкиПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерИзлишки", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияИзлишки", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияИзлишкиПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерИзлишки", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияНедостачаПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерНедостача", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияНедостача", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияНедостачаПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерНедостача", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// дополнительные условия отметки не заполнено Серия Номер в строке НеПодтверждено
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияИзлишкиНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерИзлишки", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияИзлишки", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерИзлишкиНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияИзлишкиНеПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерИзлишки", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3СерияНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерНедостача", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияНедостача", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел3НомерНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.СерияНедостачаНеПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел3.НомерНедостача", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеРаздел4(УсловноеОформление)
	
	// Отметка не заполнено
	// Если количества нет, проверка не требуется
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ВалютаНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КурсНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СтатусНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.КоличествоНеСоответствует", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ВалютаИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КурсИзлишкиНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.КоличествоИзлишкиНеПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ВалютаНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КурсНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.КоличествоНедостачаНеПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	// дополнительные условия отметки не заполнено Серия Номер в строке Результат инвентаризации
	// если заполнена серия, номера может не быть и наоборот
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.НомерНеСоответствует", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерНеСоответствует");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.СерияНеСоответствует", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияИзлишкиНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.НомерИзлишкиНеПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерИзлишкиНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.СерияИзлишкиНеПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.НомерНедостачаНеПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерНедостачаНеПодтверждено");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.СерияНедостачаНеПодтверждено", ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// указание статуса не требуется, если нет излишков и недостач
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СтатусОбъяснения");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.КоличествоИзлишкиНеПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,	
		"Объект.Раздел4.КоличествоНедостачаНеПодтверждено", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
		
	// отсутствуют несоответствия и отклонения, в графах 1 - 32 отражаются нули
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КодСтроки");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ЦеннаяБумага");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КодЦеннойБумаги");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ЕдиницаИзмерения");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НоминалНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ВалютаНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КурсНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КратностьНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КоличествоНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СуммаВалНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СуммаРубНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СтатусНеСоответствует");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НоминалИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ВалютаИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КурсИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КратностьИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КоличествоИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СуммаВалИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СуммаРубИзлишкиНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СерияНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НомерНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4НоминалНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4ВалютаНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КурсНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КратностьНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4КоличествоНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СуммаВалНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СуммаРубНедостачаНеПодтверждено");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Раздел4СтатусОбъяснения");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВыявленыНесоответствия", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВыявленыОтклонения", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область Печать

Функция СформироватьПечатнуюФорму0510470(МассивОбъектов, ОбъектыПечати)

	КлючПараметровПечати = "ПечатьФормы0510470";
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати = КлючПараметровПечати;
	
	ДанныеДляПечати = ДанныеДляПечати0510470(МассивОбъектов);
	ОбластиМакета = ОбластиМакета0510470();
	
	ВыборкаШапка = ДанныеДляПечати.Выборки.Шапка;

	Пока ВыборкаШапка.Следующий() Цикл
			
		Если ТабДокумент.ВысотаТаблицы > 0 Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерПервойСтроки = ТабДокумент.ВысотаТаблицы + 1;
	
		ВывестиЗаголовок(ТабДокумент, ДанныеДляПечати, ВыборкаШапка, ОбластиМакета);
		ВывестиРазделы(ТабДокумент, ДанныеДляПечати, ВыборкаШапка, ОбластиМакета);
		ВывестиКомиссиюИИсполнителя(ТабДокумент, ВыборкаШапка, ОбластиМакета, ДанныеДляПечати.СоставКомиссииРаздел4);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерПервойСтроки, ОбъектыПечати, 
			ВыборкаШапка.Ссылка);
			
	КонецЦикла;
	
	// Колонтитулы
	ТабДокумент.ВерхнийКолонтитул.Выводить = Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница	= 2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа = НСтр("ru='Форма 0510470 с.[&НомерСтраницы]'");
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ВывестиЗаголовок(ТабДокумент, ДанныеДляПечати, ВыборкаШапка, ОбластиМакета)
	ЗначенияПараметров = Новый Структура;
	
	УправлениеПечатьюБГУ.ЗаполнитьПараметрыСведенийУчреждения(ЗначенияПараметров, ВыборкаШапка.Ссылка, 
		ДанныеДляПечати.СведенияУчреждений);
	
	НомерДокументаДляПечати = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
		ВыборкаШапка.Ссылка, 
		ВыборкаШапка.Номер);
		
	НомерРешенияОПроведенииИнвентаризации = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
		ВыборкаШапка.РешениеОПроведенииИнвентаризации,
		ВыборкаШапка.НомерРешенияОПроведенииИнвентаризации);
	
	ТребуемыеДанные = "ДолжностьНаименование,НаименованиеПолное,Код";
	ДанныеОтветственногоЛица = Справочники.Сотрудники.ДанныеСотрудника(ВыборкаШапка.ОтветственноеЛицо, 
		ТребуемыеДанные, ВыборкаШапка.Дата);
	
	КодСчета = КодСчета(ВыборкаШапка.КФО, ВыборкаШапка.СчетКод, ВыборкаШапка.СчетЗабалансовый);
	
	ЗначенияПараметров.Вставить("Дата", ВыборкаШапка.Дата);
	ЗначенияПараметров.Вставить("Номер", НомерДокументаДляПечати);
	ЗначенияПараметров.Вставить("НомерРешения", НомерРешенияОПроведенииИнвентаризации);
	ЗначенияПараметров.Вставить("ДатаРешения", ВыборкаШапка.ДатаРешенияОПроведенииИнвентаризации);
	ЗначенияПараметров.Вставить("НомерКомиссии", ИнвентаризацияКлиентСервер.ФорматироватьПолныйНомерКомиссии(
		ВыборкаШапка.НомерКомиссии, ВыборкаШапка.НомерРабочейКомиссии, Истина));
	ЗначенияПараметров.Вставить("ОтветственноеЛицоНаименованиеИДолжность", СтрШаблон("%1 %2", 
		ДанныеОтветственногоЛица.НаименованиеПолное, ДанныеОтветственногоЛица.ДолжностьНаименование));
	ЗначенияПараметров.Вставить("УчетныйНомер",	ДанныеОтветственногоЛица.Код);
	ЗначенияПараметров.Вставить("КодСчета", КодСчета);
	
	Область = ОбластиМакета.Заголовок;
	Область.Параметры.Заполнить(ВыборкаШапка);
	Область.Параметры.Заполнить(ЗначенияПараметров);
	Область.Параметры.Заполнить(ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(ВыборкаШапка.Дата, Истина));
	
	ТабДокумент.Вывести(Область);
КонецПроцедуры

Процедура ВывестиРазделы(ТабДокумент, ДанныеДляПечати, ВыборкаШапка, ОбластиМакета)
	
	ПараметрыВыводаТаблицы = ИнвентаризацияСервер.ПолучитьПараметрыВыводаТаблицы();
	
	ПараметрыВыводаТаблицы.ТабличныйДокумент = ТабДокумент;
	ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоТаблице = Истина;
	ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоСтранице = Ложь;

	ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = 
		"Документы.ИнвентаризационнаяОписьЦенныхБумаг.ЗаполнитьОбластьСтрокаТаблицы";

	ВалютаРегламентированногоУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("ВалютаРегламентированногоУчетаКод", 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВалютаРегламентированногоУчета, "Код"));

	ПрочеркиПустыхПолей = ПолучитьНастройкиПрочерковПустыхПолей();
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("ПрочеркиПустыхПолей", ПрочеркиПустыхПолей);
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("КлючНабораПолей", "");
	КлючПолейСтрокиРаздела1 = "ПоляСтрокиРаздела1";
	КлючПолейСтрокиРаздела21_1 = "ПоляСтрокиРаздела21_1";
	КлючПолейСтрокиРаздела21_2 = "ПоляСтрокиРаздела21_2";
	КлючПолейСтрокиРаздела22_1 = "ПоляСтрокиРаздела22_1";
	КлючПолейСтрокиРаздела22_2 = "ПоляСтрокиРаздела22_2";
	КлючПолейСтрокиРаздела3_1 = "ПоляСтрокиРаздела3_1";
	КлючПолейСтрокиРаздела3_2 = "ПоляСтрокиРаздела3_2";
	КлючПолейСтрокиРаздела3_3 = "ПоляСтрокиРаздела3_3";
	КлючПолейСтрокиРаздела4_1 = "ПоляСтрокиРаздела4_1";
	КлючПолейСтрокиРаздела4_2 = "ПоляСтрокиРаздела4_2";
	
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("ОбластиМакета", ОбластиМакета); 
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("НетОтклоненийИНеСоответствий",
		Не ВыборкаШапка.ВыявленыНесоответствия И Не ВыборкаШапка.ВыявленыОтклонения); 

	// РАЗДЕЛ 1

	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();

	ВыборкаРазделИтоги = ДанныеДляПечати.Выборки.Раздел1;
	ВыборкаРазделИтоги.Сбросить();
	ВыборкаРазделИтоги.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка");
	
	ПараметрыВыводаТаблицы.Области.Заголовок = ОбластиМакета.Раздел1Заголовок;
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы	= ОбластиМакета.Раздел1Шапка;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел1Строка;
	ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел1Итого;
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела1;
	
	ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ВыборкаРазделИтоги;
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = ВыборкаРазделИтоги.Выбрать();
	
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
	ВывестиПодписьИсполнителяРаздела1(ТабДокумент, ВыборкаШапка, ОбластиМакета);
	
	// РАЗДЕЛ 2

	ТабДокумент.Вывести(ОбластиМакета.Раздел2Заголовок);

	// РАЗДЕЛ 2.1
	
	ВыборкаРазделИтоги = ДанныеДляПечати.Выборки.Раздел21;
	ВыборкаРазделИтоги.Сбросить();
	ВыборкаРазделИтоги.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка");

	// РАЗДЕЛ 2.1 Таблица 1
	
	ПараметрыВыводаТаблицы.Области.Заголовок = ОбластиМакета.Раздел21Заголовок;
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы	= ОбластиМакета.Раздел21Шапка;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел21Строка;
	ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел21Итого;
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела21_1;
	
	ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ВыборкаРазделИтоги;
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = ВыборкаРазделИтоги.Выбрать();
	
	ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
	// РАЗДЕЛ 2.1 Таблица 2
	
	ПараметрыВыводаТаблицы.Области.Заголовок = Неопределено;
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы = ОбластиМакета.Раздел21Шапка_2;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел21Строка_2;
	ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел21Итого_2;
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела21_2;
	
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи.Сбросить();
	
	ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
	// РАЗДЕЛ 2.2
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ВыборкаРазделИтоги = ДанныеДляПечати.Выборки.Раздел22;
	ВыборкаРазделИтоги.Сбросить();
	ВыборкаРазделИтоги.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка");
	
	// РАЗДЕЛ 2.2 Таблица 1
	
	ПараметрыВыводаТаблицы.Области.Заголовок = ОбластиМакета.Раздел22Заголовок;
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы	= ОбластиМакета.Раздел22Шапка;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел22Строка;
	ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел22Итого;
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела22_1;
	
	ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ВыборкаРазделИтоги;
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = ВыборкаРазделИтоги.Выбрать();
	
	ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
	// РАЗДЕЛ 2.2 Таблица 2
	
	ПараметрыВыводаТаблицы.Области.Заголовок = Неопределено;
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы = ОбластиМакета.Раздел22Шапка_2;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел22Строка_2;
	ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел22Итого_2;
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела22_2;
	
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи.Сбросить();
	
	ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
	// РАЗДЕЛ 2.2 Комиссия
	
	ВывестиКомиссиюИИсполнителя(ТабДокумент, ВыборкаШапка, ОбластиМакета, ДанныеДляПечати.СоставКомиссииРаздел2);

	// РАЗДЕЛ 3
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабДокумент.Вывести(ОбластиМакета.Раздел3Заголовок);
	
	ВыборкаРазделИтоги = ДанныеДляПечати.Выборки.Раздел3;
	ВыборкаРазделИтоги.Сбросить();
	Если ВыборкаРазделИтоги.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
		
		// РАЗДЕЛ 3 Таблица 1

		ПараметрыВыводаТаблицы.Области.Заголовок = Неопределено;
		ПараметрыВыводаТаблицы.Области.ШапкаТаблицы	= ОбластиМакета.Раздел3Шапка;
		ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел3Строка;
		ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел3Итого;
		ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела3_1;

		ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ВыборкаРазделИтоги;
		ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = ВыборкаРазделИтоги.Выбрать();

		ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
		ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
		
		// РАЗДЕЛ 3 Таблица 2

		ПараметрыВыводаТаблицы.Области.Заголовок = Неопределено;
		ПараметрыВыводаТаблицы.Области.ШапкаТаблицы = ОбластиМакета.Раздел3Шапка_2;
		ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел3Строка_2;
		ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел3Итого_2;
		ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела3_2;

		ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи.Сбросить();

		ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
		ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
		// РАЗДЕЛ 3 Таблица 3

		ПараметрыВыводаТаблицы.Области.Заголовок = Неопределено;
		ПараметрыВыводаТаблицы.Области.ШапкаТаблицы = ОбластиМакета.Раздел3Шапка_3;
		ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ОбластиМакета.Раздел3Строка_3;
		ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел3Итого_3;
		ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела3_3;

		ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи.Сбросить();

		ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
		ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
		
		// РАЗДЕЛ 3 Приложения

		УправлениеПечатьюБГУ.ВывестиПриложенияПриПечати(ТабДокумент, ВыборкаШапка.Ссылка,
			ОбластиМакета.Раздел3Приложение);

	КонецЕсли;
	
	ВывестиПодписьИсполнителяРаздела3(ТабДокумент, ВыборкаШапка, ОбластиМакета);
	
	// РАЗДЕЛ 4
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ВыборкаРазделИтоги = ДанныеДляПечати.Выборки.Раздел4;
	ВыборкаРазделИтоги.Сбросить();
	ВыборкаРазделИтоги.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка");
	
	// РАЗДЕЛ 4 Таблица 1
	
	ПараметрыВыводаТаблицы.Области.Заголовок = ОбластиМакета.Раздел4Заголовок;
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы	= ОбластиМакета.Раздел4Шапка;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ?(
		ПараметрыВыводаТаблицы.ДополнительныеПараметры.НетОтклоненийИНеСоответствий, 
		ОбластиМакета.Раздел4СтрокаНетОтклоненийИНеСоответствий,
		ОбластиМакета.Раздел4Строка); 
	ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел4Итого;
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела4_1;
	
	ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ВыборкаРазделИтоги;
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = ВыборкаРазделИтоги.Выбрать();
	
	ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);

	// РАЗДЕЛ 4 Таблица 2

	ПараметрыВыводаТаблицы.Области.Заголовок = Неопределено;
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы	= ОбластиМакета.Раздел4Шапка_2;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы = ?(
		ПараметрыВыводаТаблицы.ДополнительныеПараметры.НетОтклоненийИНеСоответствий,
		ОбластиМакета.Раздел4СтрокаНетОтклоненийИНеСоответствий_2,
		ОбластиМакета.Раздел4Строка_2.ПолучитьОбласть());
	ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ОбластиМакета.Раздел4Итого_2;
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.КлючНабораПолей = КлючПолейСтрокиРаздела4_2;
	
	ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ВыборкаРазделИтоги;
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = ВыборкаРазделИтоги.Выбрать();
	
	ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
КонецПроцедуры

Процедура ВывестиПодписьИсполнителяРаздела1(ТабДокумент, ВыборкаШапка, ОбластиМакета)
	
	ЗначенияПараметров = ИнвентаризацияСервер.ПолучитьСведенияОтветственногоИсполнителяДляПечати(
		ВыборкаШапка.ОтветственныйИсполнительБухгалтерскойСлужбы, ВыборкаШапка.Дата);

	ОбластьОтветственныйИсполнитель = ОбластиМакета.ОтветственныйИсполнительРаздела1;
	ОбластьДатаПодписи = ОбластиМакета.ДатаПодписиРаздела1;
	
	ОбластьОтветственныйИсполнитель.Параметры.Заполнить(ЗначенияПараметров);
	
	ОформляющиеОбласти = Новый Массив;
	ОформляющиеОбласти.Добавить(ОбластьОтветственныйИсполнитель);
	ОформляющиеОбласти.Добавить(ОбластьДатаПодписи);
	Если Не ТабДокумент.ПроверитьВывод(ОформляющиеОбласти) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьОтветственныйИсполнитель);
	ТабДокумент.Вывести(ОбластьДатаПодписи);
	
КонецПроцедуры

Процедура ВывестиПодписьИсполнителяРаздела3(ТабДокумент, ВыборкаШапка, ОбластиМакета)
	
	ЗначенияПараметров = ИнвентаризацияСервер.ПолучитьСведенияОтветственногоИсполнителяДляПечати(
		ВыборкаШапка.ОтветственноеЛицо, ВыборкаШапка.Дата);

	ОбластьОтветственноеЛицо = ОбластиМакета.ОтветственноеЛицоРаздела3;
	ОбластьДатаПодписи = ОбластиМакета.ДатаПодписиРаздела3;
	
	ОбластьОтветственноеЛицо.Параметры.Заполнить(ЗначенияПараметров);
	
	ОформляющиеОбласти = Новый Массив;
	ОформляющиеОбласти.Добавить(ОбластьОтветственноеЛицо);
	ОформляющиеОбласти.Добавить(ОбластьДатаПодписи);
	Если Не ТабДокумент.ПроверитьВывод(ОформляющиеОбласти) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	ТабДокумент.Вывести(ОбластьОтветственноеЛицо);
	ТабДокумент.Вывести(ОбластьДатаПодписи);
	
КонецПроцедуры

Процедура ВывестиКомиссиюИИсполнителя(ТабДокумент, ВыборкаШапка, ОбластиМакета, СоставКомиссии)
	ПараметрыВывода = УправлениеПечатьюБГУ.ПараметрыВыводаСоставаКомиссииПриПечати();
	ПараметрыВывода.ЗаголовокПредседателя = НСтр("ru='Председатель комиссии:'");
	ПараметрыВывода.ЗаголовокПервогоРядовогоЧлена = НСтр("ru='Члены комиссии:'");
	ПараметрыВывода.ПризнакРабочейКомиссии = ЗначениеЗаполнено(ВыборкаШапка.НомерРабочейКомиссии);
	ПараметрыВывода.ВыводитьДополнительныеСведения = Истина;
	ПараметрыВывода.НастройкиДополнительныхСведений.ВыводитьПричинуОтсутствия = Истина;
	ПараметрыВывода.НастройкиДополнительныхСведений.ВыводитьЗамещающегоСотрудника = Истина;
	УправлениеПечатьюБГУ.ВывестиСоставКомиссииПриПечати(ТабДокумент, ВыборкаШапка.Ссылка, 
		ОбластиМакета.ЧленКомиссии, СоставКомиссии, ПараметрыВывода);
	ЗначенияПараметров = ИнвентаризацияСервер.ПолучитьСведенияОтветственногоИсполнителяДляПечати(
		ВыборкаШапка.ОтветственныйИсполнитель, ВыборкаШапка.Дата);
	Область = ОбластиМакета.ОтветственныйИсполнитель;
	Область.Параметры.Заполнить(ЗначенияПараметров);
	ТабДокумент.Вывести(Область);
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода = Неопределено,
	ДополнительныеПараметры = Неопределено) Экспорт
	
	ЗаполнитьНулиВСтрокеРаздела(ОбластьСтрокаТаблицы, Выборка, ДополнительныеПараметры);
	
	ЗначенияПараметров = Новый Структура;
	ЗаполнитьКурсВалютыРеглУчетаПриПечатиВСтрокеРаздела(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	ЗаполнитьКодСтатусаНеСоответствует(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
	ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(ОбластьСтрокаТаблицы, Выборка, 
		ДополнительныеПараметры.ПрочеркиПустыхПолей, ДополнительныеПараметры.КлючНабораПолей);
	
КонецПроцедуры

Процедура ЗаполнитьНулиВСтрокеРаздела(ОбластьСтрокаТаблицы, Выборка, ДополнительныеПараметры)
	КлючНабораПолей = ДополнительныеПараметры.КлючНабораПолей;
	ОбластиЗаполнения = Новый Массив;
	Если КлючНабораПолей = "ПоляСтрокиРаздела4_2" И Не ДополнительныеПараметры.НетОтклоненийИНеСоответствий Тогда
		ОбластьСтрокаТаблицы = ДополнительныеПараметры.ОбластиМакета.Раздел4Строка_2.ПолучитьОбласть();
		Если Выборка.КоличествоИзлишкиНеПодтверждено = 0 Тогда
			ОбластиЗаполнения.Добавить("Раздел4СтрокаИзлишки");
		КонецЕсли;
		Если Выборка.КоличествоНедостачаНеПодтверждено = 0 Тогда
			ОбластиЗаполнения.Добавить("Раздел4СтрокаНедостача");
		КонецЕсли;
		ЗаполнитьНулиВОбласти(ОбластьСтрокаТаблицы, ОбластиЗаполнения);
		ОбластьСтрокаТаблицы.Параметры.Заполнить(Выборка);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьНулиВОбласти(Знач ОбластьСтрокаТаблицы, ОбластиЗаполнения)
	Для Каждого ИмяОбласти Из ОбластиЗаполнения Цикл
		ОбластьЗаполнения = ОбластьСтрокаТаблицы.Область(ИмяОбласти);
		ОбластьЗаполнения.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Текст;
		ОбластьЗаполнения.Текст = "0";
		ОбластьЗаполнения.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьКурсВалютыРеглУчетаПриПечатиВСтрокеРаздела(ЗначенияПараметров, Выборка, ДополнительныеПараметры)
	КлючНабораПолей = ДополнительныеПараметры.КлючНабораПолей;
	Если КлючНабораПолей = "ПоляСтрокиРаздела1" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела21_1" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела21_2" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "НеСоответствует");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела22_1" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "НеСоответствует");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела22_2" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "Излишки");
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "Недостача");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела3_1" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "Излишки");
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "Недостача");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела3_2" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, 
			"ИзлишкиПодтверждено");
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, 
			"НедостачаПодтверждено");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела3_3" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, 
			"ИзлишкиНеПодтверждено");
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, 
			"НедостачаНеПодтверждено");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела4_1" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, "НеСоответствует");
	ИначеЕсли КлючНабораПолей = "ПоляСтрокиРаздела4_2" Тогда
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, 
			"ИзлишкиНеПодтверждено");
		ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, 
			"НедостачаНеПодтверждено");
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьКурсВалютыРеглУчетаПриПечати(ЗначенияПараметров, Выборка, ДополнительныеПараметры, Постфикс)
	ВалютаРегламентированногоУчетаКод = ДополнительныеПараметры.ВалютаРегламентированногоУчетаКод;
	ЗначенияИсточника = Новый Структура("ВалютаКод" + Постфикс);
	ЗаполнитьЗначенияСвойств(ЗначенияИсточника, Выборка);
	Если ЗначенияИсточника["ВалютаКод" + Постфикс] = ВалютаРегламентированногоУчетаКод Тогда
		ЗначенияПараметров.Вставить("Курс" + Постфикс, "");
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьКодСтатусаНеСоответствует(ЗначенияПараметров, Выборка, ДополнительныеПараметры)
	ЗначенияИсточника = Новый Структура("СтатусНеСоответствуетКод");
	ЗаполнитьЗначенияСвойств(ЗначенияИсточника, Выборка);
	Если ЗначениеЗаполнено(ЗначенияИсточника.СтатусНеСоответствуетКод) Тогда
		ЗначенияПараметров.Вставить("СтатусНеСоответствуетКод",
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ЗначенияИсточника.СтатусНеСоответствуетКод, Истина));
	КонецЕсли;
КонецПроцедуры

Функция ДанныеДляПечати0510470(МассивОбъектов)
	
	НомераТаблиц = Новый Структура;
	ТекстЗапроса = ТекстЗапросаПечать0510470(НомераТаблиц); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = ТекстЗапроса;
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("СоставКомиссииРаздел2", 
		ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов, "СоставКомиссииРаздел2"));
	ДанныеДляПечати.Вставить("СоставКомиссииРаздел4", 
		ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов, "СоставКомиссииРаздел4"));
	ДанныеДляПечати.Вставить("СведенияУчреждений", 
		УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов));

	ДанныеДляПечати.Вставить("Выборки", Новый Структура);
	Выборки = ДанныеДляПечати.Выборки;
	Выборки.Вставить("Шапка", РезультатЗапроса[НомераТаблиц.Шапка].Выбрать());
	Выборки.Вставить("Раздел1", РезультатЗапроса[НомераТаблиц.Раздел1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Выборки.Вставить("Раздел21", 
		РезультатЗапроса[НомераТаблиц.Раздел21].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Выборки.Вставить("Раздел22",
		РезультатЗапроса[НомераТаблиц.Раздел22].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Выборки.Вставить("Раздел3",	РезультатЗапроса[НомераТаблиц.Раздел3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Выборки.Вставить("Раздел4",	РезультатЗапроса[НомераТаблиц.Раздел4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ТекстЗапросаПечать0510470(НомераТаблиц)
	
	НомераТаблиц.Вставить("Шапка", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Раздел1", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Раздел21", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Раздел22", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Раздел3", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Раздел4", НомераТаблиц.Количество());
	
	Возврат	
		"ВЫБРАТЬ
		|	Шапка.Ссылка КАК Ссылка,
		|	Шапка.Номер КАК Номер,
		|	Шапка.Дата КАК Дата,
		|	Шапка.Организация КАК Организация,
		|	Шапка.Подразделение КАК Подразделение,
		|	Шапка.ДатаНачала КАК ДатаНачала,
		|	Шапка.ДатаОкончания КАК ДатаОкончания,
		|	Шапка.ДатаИнвентаризации КАК ДатаИнвентаризации,
		|	Шапка.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
		|	Шапка.ОтветственныйИсполнительБухгалтерскойСлужбы КАК ОтветственныйИсполнительБухгалтерскойСлужбы,
		|	ВЫБОР Шапка.ВидЦенныхБумаг
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенныхБумаг.Акция)
		|			ТОГДА ""Акции""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенныхБумаг.Облигация)
		|			ТОГДА ""Облигации""
		|		КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЦенныхБумаг.Вексель)
		|			ТОГДА ""Векселя""
		|		ИНАЧЕ ""Иные ценные бумаги, кроме акций""
		|	КОНЕЦ КАК ВидЦенныхБумаг,
		|	Шапка.ФормаЦенныхБумаг КАК ФормаЦенныхБумаг,
		|	Шапка.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|	Шапка.КФО,
		|	ЕСТЬNULL(Шапка.Счет.Код, ""000.00"") КАК СчетКод,
		|	ЕСТЬNULL(Шапка.Счет.Забалансовый, ЛОЖЬ) КАК СчетЗабалансовый,
		|	Шапка.РешениеОПроведенииИнвентаризации КАК РешениеОПроведенииИнвентаризации,
		|	Шапка.РешениеОПроведенииИнвентаризации.Номер КАК НомерРешенияОПроведенииИнвентаризации,
		|	Шапка.РешениеОПроведенииИнвентаризации.Дата КАК ДатаРешенияОПроведенииИнвентаризации,
		|	Шапка.Комиссия КАК Комиссия,
		|	Шапка.НомерКомиссии КАК НомерКомиссии,
		|	Шапка.НомерРабочейКомиссии КАК НомерРабочейКомиссии,
		|	Шапка.МестоИнвентаризации КАК МестоИнвентаризации,
		|	Шапка.ВыявленыНесоответствия КАК ВыявленыНесоответствия,
		|	Шапка.ВыявленыОтклонения КАК ВыявленыОтклонения
		|ИЗ
		|	Документ.ИнвентаризационнаяОписьЦенныхБумаг КАК Шапка
		|ГДЕ
		|	Шапка.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Раздел1.Ссылка КАК Ссылка,
		|	Раздел1.НомерСтроки КАК КодСтроки,
		|	Раздел1.ЦеннаяБумага.Наименование КАК НаименованиеЦеннойБумаги,
		|	Раздел1.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	Раздел1.ЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
		|	Раздел1.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		|	Раздел1.Серия КАК Серия,
		|	Раздел1.Номер КАК Номер,
		|	Раздел1.Номинал КАК Номинал,
		|	Раздел1.Валюта.Код КАК ВалютаКод,
		|	Раздел1.Курс КАК Курс,
		|	Раздел1.Количество КАК Количество,
		|	Раздел1.СуммаВал КАК СуммаВал,
		|	Раздел1.СуммаРуб КАК СуммаРуб
		|ИЗ
		|	Документ.ИнвентаризационнаяОписьЦенныхБумаг.Раздел1 КАК Раздел1
		|ГДЕ
		|	Раздел1.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	КодСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(СуммаРуб)
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Раздел21.Ссылка КАК Ссылка,
		|	Раздел21.НомерСтроки КАК КодСтроки,
		|	Раздел21.ЦеннаяБумага.Наименование КАК НаименованиеЦеннойБумаги,
		|	Раздел21.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	Раздел21.ЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
		|	Раздел21.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		|	Раздел21.Серия КАК Серия,
		|	Раздел21.Номер КАК Номер,
		|	Раздел21.Номинал КАК Номинал,
		|	Раздел21.Валюта.Код КАК ВалютаКод,
		|	Раздел21.Курс КАК Курс,
		|	Раздел21.Количество КАК Количество,
		|	Раздел21.СуммаВал КАК СуммаВал,
		|	Раздел21.СуммаРуб КАК СуммаРуб,
		|	Раздел21.СерияНеСоответствует КАК СерияНеСоответствует,
		|	Раздел21.НомерНеСоответствует КАК НомерНеСоответствует,
		|	Раздел21.НоминалНеСоответствует КАК НоминалНеСоответствует,
		|	Раздел21.ВалютаНеСоответствует.Код КАК ВалютаКодНеСоответствует,
		|	Раздел21.КурсНеСоответствует КАК КурсНеСоответствует,
		|	Раздел21.КоличествоНеСоответствует КАК КоличествоНеСоответствует,
		|	Раздел21.СуммаВалНеСоответствует КАК СуммаВалНеСоответствует,
		|	Раздел21.СуммаРубНеСоответствует КАК СуммаРубНеСоответствует,
		|	Раздел21.СтатусНеСоответствует.Код КАК СтатусНеСоответствуетКод,
		|	Раздел21.СтатусНеСоответствует.Наименование КАК СтатусНеСоответствуетНаименование
		|ИЗ
		|	Документ.ИнвентаризационнаяОписьЦенныхБумаг.Раздел21 КАК Раздел21
		|ГДЕ
		|	Раздел21.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	КодСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(СуммаРуб),
		|	СУММА(КоличествоНеСоответствует),
		|	СУММА(СуммаРубНеСоответствует)
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Раздел22.Ссылка КАК Ссылка,
		|	Раздел22.НомерСтроки КАК КодСтроки,
		|	Раздел22.ЦеннаяБумага.Наименование КАК НаименованиеЦеннойБумаги,
		|	Раздел22.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	Раздел22.ЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
		|	Раздел22.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		|	Раздел22.СерияНеСоответствует КАК СерияНеСоответствует,
		|	Раздел22.НомерНеСоответствует КАК НомерНеСоответствует,
		|	Раздел22.НоминалНеСоответствует КАК НоминалНеСоответствует,
		|	Раздел22.ВалютаНеСоответствует.Код КАК ВалютаКодНеСоответствует,
		|	Раздел22.КурсНеСоответствует КАК КурсНеСоответствует,
		|	Раздел22.КоличествоНеСоответствует КАК КоличествоНеСоответствует,
		|	Раздел22.СуммаВалНеСоответствует КАК СуммаВалНеСоответствует,
		|	Раздел22.СуммаРубНеСоответствует КАК СуммаРубНеСоответствует,
		|	Раздел22.СтатусНеСоответствует.Код КАК СтатусНеСоответствуетКод,
		|	Раздел22.СтатусНеСоответствует.Наименование КАК СтатусНеСоответствуетНаименование,
		|	Раздел22.СерияИзлишки КАК СерияИзлишки,
		|	Раздел22.НомерИзлишки КАК НомерИзлишки,
		|	Раздел22.НоминалИзлишки КАК НоминалИзлишки,
		|	Раздел22.ВалютаИзлишки.Код КАК ВалютаКодИзлишки,
		|	Раздел22.КурсИзлишки КАК КурсИзлишки,
		|	Раздел22.КоличествоИзлишки КАК КоличествоИзлишки,
		|	Раздел22.СуммаВалИзлишки КАК СуммаВалИзлишки,
		|	Раздел22.СуммаРубИзлишки КАК СуммаРубИзлишки,
		|	Раздел22.СерияНедостача КАК СерияНедостача,
		|	Раздел22.НомерНедостача КАК НомерНедостача,
		|	Раздел22.НоминалНедостача КАК НоминалНедостача,
		|	Раздел22.ВалютаНедостача.Код КАК ВалютаКодНедостача,
		|	Раздел22.КурсНедостача КАК КурсНедостача,
		|	Раздел22.КоличествоНедостача КАК КоличествоНедостача,
		|	Раздел22.СуммаВалНедостача КАК СуммаВалНедостача,
		|	Раздел22.СуммаРубНедостача КАК СуммаРубНедостача
		|ИЗ
		|	Документ.ИнвентаризационнаяОписьЦенныхБумаг.Раздел22 КАК Раздел22
		|ГДЕ
		|	Раздел22.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	КодСтроки
		|ИТОГИ
		|	СУММА(КоличествоНеСоответствует),
		|	СУММА(СуммаРубНеСоответствует),
		|	СУММА(КоличествоИзлишки),
		|	СУММА(СуммаРубИзлишки),
		|	СУММА(КоличествоНедостача),
		|	СУММА(СуммаРубНедостача)
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Раздел3.Ссылка КАК Ссылка,
		|	Раздел3.НомерСтроки КАК НомерСтроки,
		|	Раздел3.КодСтроки КАК КодСтроки,
		|	Раздел3.ЦеннаяБумага.Наименование КАК НаименованиеЦеннойБумаги,
		|	Раздел3.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	Раздел3.ЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
		|	Раздел3.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		|	Раздел3.СерияИзлишки КАК СерияИзлишки,
		|	Раздел3.НомерИзлишки КАК НомерИзлишки,
		|	Раздел3.НоминалИзлишки КАК НоминалИзлишки,
		|	Раздел3.ВалютаИзлишки.Код КАК ВалютаКодИзлишки,
		|	Раздел3.КурсИзлишки КАК КурсИзлишки,
		|	Раздел3.КоличествоИзлишки КАК КоличествоИзлишки,
		|	Раздел3.СуммаВалИзлишки КАК СуммаВалИзлишки,
		|	Раздел3.СуммаРубИзлишки КАК СуммаРубИзлишки,
		|	Раздел3.СерияНедостача КАК СерияНедостача,
		|	Раздел3.НомерНедостача КАК НомерНедостача,
		|	Раздел3.НоминалНедостача КАК НоминалНедостача,
		|	Раздел3.ВалютаНедостача.Код КАК ВалютаКодНедостача,
		|	Раздел3.КурсНедостача КАК КурсНедостача,
		|	Раздел3.КоличествоНедостача КАК КоличествоНедостача,
		|	Раздел3.СуммаВалНедостача КАК СуммаВалНедостача,
		|	Раздел3.СуммаРубНедостача КАК СуммаРубНедостача,
		|	Раздел3.СерияИзлишкиПодтверждено КАК СерияИзлишкиПодтверждено,
		|	Раздел3.НомерИзлишкиПодтверждено КАК НомерИзлишкиПодтверждено,
		|	Раздел3.НоминалИзлишкиПодтверждено КАК НоминалИзлишкиПодтверждено,
		|	Раздел3.ВалютаИзлишкиПодтверждено.Код КАК ВалютаКодИзлишкиПодтверждено,
		|	Раздел3.КурсИзлишкиПодтверждено КАК КурсИзлишкиПодтверждено,
		|	Раздел3.КоличествоИзлишкиПодтверждено КАК КоличествоИзлишкиПодтверждено,
		|	Раздел3.СуммаВалИзлишкиПодтверждено КАК СуммаВалИзлишкиПодтверждено,
		|	Раздел3.СуммаРубИзлишкиПодтверждено КАК СуммаРубИзлишкиПодтверждено,
		|	Раздел3.СерияНедостачаПодтверждено КАК СерияНедостачаПодтверждено,
		|	Раздел3.НомерНедостачаПодтверждено КАК НомерНедостачаПодтверждено,
		|	Раздел3.НоминалНедостачаПодтверждено КАК НоминалНедостачаПодтверждено,
		|	Раздел3.ВалютаНедостачаПодтверждено.Код КАК ВалютаКодНедостачаПодтверждено,
		|	Раздел3.КурсНедостачаПодтверждено КАК КурсНедостачаПодтверждено,
		|	Раздел3.КоличествоНедостачаПодтверждено КАК КоличествоНедостачаПодтверждено,
		|	Раздел3.СуммаВалНедостачаПодтверждено КАК СуммаВалНедостачаПодтверждено,
		|	Раздел3.СуммаРубНедостачаПодтверждено КАК СуммаРубНедостачаПодтверждено,
		|	Раздел3.СерияИзлишкиНеПодтверждено КАК СерияИзлишкиНеПодтверждено,
		|	Раздел3.НомерИзлишкиНеПодтверждено КАК НомерИзлишкиНеПодтверждено,
		|	Раздел3.НоминалИзлишкиНеПодтверждено КАК НоминалИзлишкиНеПодтверждено,
		|	Раздел3.ВалютаИзлишкиНеПодтверждено.Код КАК ВалютаКодИзлишкиНеПодтверждено,
		|	Раздел3.КурсИзлишкиНеПодтверждено КАК КурсИзлишкиНеПодтверждено,
		|	Раздел3.КоличествоИзлишкиНеПодтверждено КАК КоличествоИзлишкиНеПодтверждено,
		|	Раздел3.СуммаВалИзлишкиНеПодтверждено КАК СуммаВалИзлишкиНеПодтверждено,
		|	Раздел3.СуммаРубИзлишкиНеПодтверждено КАК СуммаРубИзлишкиНеПодтверждено,
		|	Раздел3.СерияНедостачаНеПодтверждено КАК СерияНедостачаНеПодтверждено,
		|	Раздел3.НомерНедостачаНеПодтверждено КАК НомерНедостачаНеПодтверждено,
		|	Раздел3.НоминалНедостачаНеПодтверждено КАК НоминалНедостачаНеПодтверждено,
		|	Раздел3.ВалютаНедостачаНеПодтверждено.Код КАК ВалютаКодНедостачаНеПодтверждено,
		|	Раздел3.КурсНедостачаНеПодтверждено КАК КурсНедостачаНеПодтверждено,
		|	Раздел3.КоличествоНедостачаНеПодтверждено КАК КоличествоНедостачаНеПодтверждено,
		|	Раздел3.СуммаВалНедостачаНеПодтверждено КАК СуммаВалНедостачаНеПодтверждено,
		|	Раздел3.СуммаРубНедостачаНеПодтверждено КАК СуммаРубНедостачаНеПодтверждено,
		|	Раздел3.НаименованиеДокумента КАК НаименованиеДокумента,
		|	Раздел3.НомерДокумента КАК НомерДокумента,
		|	Раздел3.ДатаДокумента КАК ДатаДокумента,
		|	Раздел3.Объяснение КАК Объяснение
		|ИЗ
		|	Документ.ИнвентаризационнаяОписьЦенныхБумаг.Раздел3 КАК Раздел3
		|ГДЕ
		|	Раздел3.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(КоличествоИзлишки),
		|	СУММА(СуммаРубИзлишки),
		|	СУММА(КоличествоНедостача),
		|	СУММА(СуммаРубНедостача),
		|	СУММА(КоличествоИзлишкиПодтверждено),
		|	СУММА(СуммаРубИзлишкиПодтверждено),
		|	СУММА(КоличествоНедостачаПодтверждено),
		|	СУММА(СуммаРубНедостачаПодтверждено),
		|	СУММА(КоличествоИзлишкиНеПодтверждено),
		|	СУММА(СуммаРубИзлишкиНеПодтверждено),
		|	СУММА(КоличествоНедостачаНеПодтверждено),
		|	СУММА(СуммаРубНедостачаНеПодтверждено)
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Раздел4.Ссылка КАК Ссылка,
		|	Раздел4.НомерСтроки КАК НомерСтроки,
		|	Раздел4.КодСтроки КАК КодСтроки,
		|	Раздел4.ЦеннаяБумага.Наименование КАК НаименованиеЦеннойБумаги,
		|	Раздел4.КодЦеннойБумаги КАК КодЦеннойБумаги,
		|	Раздел4.ЕдиницаИзмерения.Наименование КАК НаименованиеЕдиницыИзмерения,
		|	Раздел4.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		|	Раздел4.СерияНеСоответствует КАК СерияНеСоответствует,
		|	Раздел4.НомерНеСоответствует КАК НомерНеСоответствует,
		|	Раздел4.НоминалНеСоответствует КАК НоминалНеСоответствует,
		|	Раздел4.ВалютаНеСоответствует.Код КАК ВалютаКодНеСоответствует,
		|	Раздел4.КурсНеСоответствует КАК КурсНеСоответствует,
		|	Раздел4.КоличествоНеСоответствует КАК КоличествоНеСоответствует,
		|	Раздел4.СуммаВалНеСоответствует КАК СуммаВалНеСоответствует,
		|	Раздел4.СуммаРубНеСоответствует КАК СуммаРубНеСоответствует,
		|	Раздел4.СтатусНеСоответствует.Код КАК СтатусНеСоответствуетКод,
		|	Раздел4.СтатусНеСоответствует.Наименование КАК СтатусНеСоответствуетНаименование,
		|	Раздел4.СерияИзлишкиНеПодтверждено КАК СерияИзлишкиНеПодтверждено,
		|	Раздел4.НомерИзлишкиНеПодтверждено КАК НомерИзлишкиНеПодтверждено,
		|	Раздел4.НоминалИзлишкиНеПодтверждено КАК НоминалИзлишкиНеПодтверждено,
		|	Раздел4.ВалютаИзлишкиНеПодтверждено.Код КАК ВалютаКодИзлишкиНеПодтверждено,
		|	Раздел4.КурсИзлишкиНеПодтверждено КАК КурсИзлишкиНеПодтверждено,
		|	Раздел4.КоличествоИзлишкиНеПодтверждено КАК КоличествоИзлишкиНеПодтверждено,
		|	Раздел4.СуммаВалИзлишкиНеПодтверждено КАК СуммаВалИзлишкиНеПодтверждено,
		|	Раздел4.СуммаРубИзлишкиНеПодтверждено КАК СуммаРубИзлишкиНеПодтверждено,
		|	Раздел4.СерияНедостачаНеПодтверждено КАК СерияНедостачаНеПодтверждено,
		|	Раздел4.НомерНедостачаНеПодтверждено КАК НомерНедостачаНеПодтверждено,
		|	Раздел4.НоминалНедостачаНеПодтверждено КАК НоминалНедостачаНеПодтверждено,
		|	Раздел4.ВалютаНедостачаНеПодтверждено.Код КАК ВалютаКодНедостачаНеПодтверждено,
		|	Раздел4.КурсНедостачаНеПодтверждено КАК КурсНедостачаНеПодтверждено,
		|	Раздел4.КоличествоНедостачаНеПодтверждено КАК КоличествоНедостачаНеПодтверждено,
		|	Раздел4.СуммаВалНедостачаНеПодтверждено КАК СуммаВалНедостачаНеПодтверждено,
		|	Раздел4.СуммаРубНедостачаНеПодтверждено КАК СуммаРубНедостачаНеПодтверждено,
		|	Раздел4.СтатусОбъяснения КАК СтатусОбъяснения,
		|	Раздел4.ЗаключениеКомиссии КАК ЗаключениеКомиссии
		|ИЗ
		|	Документ.ИнвентаризационнаяОписьЦенныхБумаг.Раздел4 КАК Раздел4
		|ГДЕ
		|	Раздел4.Ссылка В (&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(КоличествоНеСоответствует),
		|	СУММА(СуммаРубНеСоответствует),
		|	СУММА(КоличествоИзлишкиНеПодтверждено),
		|	СУММА(СуммаРубИзлишкиНеПодтверждено),
		|	СУММА(КоличествоНедостачаНеПодтверждено),
		|	СУММА(СуммаРубНедостачаНеПодтверждено)
		|ПО
		|	Ссылка";
	
КонецФункции

Функция ОбластиМакета0510470()
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризационнаяОписьЦенныхБумаг.ПФ_MXL_Ф0510470");
	
	ОбластиМакета = Новый Структура();
	ОбластиМакета.Вставить("Заголовок", Макет.ПолучитьОбласть("Заголовок"));

	ОбластиМакета.Вставить("Раздел1Заголовок", Макет.ПолучитьОбласть("Раздел1Заголовок"));
	ОбластиМакета.Вставить("Раздел1Шапка", Макет.ПолучитьОбласть("Раздел1Шапка"));
	ОбластиМакета.Вставить("Раздел1Строка", Макет.ПолучитьОбласть("Раздел1Строка"));
	ОбластиМакета.Вставить("Раздел1Итого", Макет.ПолучитьОбласть("Раздел1Итого"));

	ОбластиМакета.Вставить("ОтветственныйИсполнительРаздела1", Макет.ПолучитьОбласть("ОтветственныйИсполнительРаздела1"));
	ОбластиМакета.Вставить("ДатаПодписиРаздела1", Макет.ПолучитьОбласть("ДатаПодписиРаздела1"));

	ОбластиМакета.Вставить("Раздел2Заголовок", Макет.ПолучитьОбласть("Раздел2Заголовок"));
	ОбластиМакета.Вставить("Раздел21Заголовок", Макет.ПолучитьОбласть("Раздел21Заголовок"));
	ОбластиМакета.Вставить("Раздел21Шапка", Макет.ПолучитьОбласть("Раздел21Шапка"));
	ОбластиМакета.Вставить("Раздел21Строка", Макет.ПолучитьОбласть("Раздел21Строка"));
	ОбластиМакета.Вставить("Раздел21Итого", Макет.ПолучитьОбласть("Раздел21Итого"));
	ОбластиМакета.Вставить("Раздел21Шапка_2", Макет.ПолучитьОбласть("Раздел21Шапка_2"));
	ОбластиМакета.Вставить("Раздел21Строка_2", Макет.ПолучитьОбласть("Раздел21Строка_2"));
	ОбластиМакета.Вставить("Раздел21Итого_2", Макет.ПолучитьОбласть("Раздел21Итого_2"));
	
	ОбластиМакета.Вставить("Раздел22Заголовок", Макет.ПолучитьОбласть("Раздел22Заголовок"));
	ОбластиМакета.Вставить("Раздел22Шапка", Макет.ПолучитьОбласть("Раздел22Шапка"));
	ОбластиМакета.Вставить("Раздел22Строка", Макет.ПолучитьОбласть("Раздел22Строка"));
	ОбластиМакета.Вставить("Раздел22Итого", Макет.ПолучитьОбласть("Раздел22Итого"));
	ОбластиМакета.Вставить("Раздел22Шапка_2", Макет.ПолучитьОбласть("Раздел22Шапка_2"));
	ОбластиМакета.Вставить("Раздел22Строка_2", Макет.ПолучитьОбласть("Раздел22Строка_2"));
	ОбластиМакета.Вставить("Раздел22Итого_2", Макет.ПолучитьОбласть("Раздел22Итого_2"));

	ОбластиМакета.Вставить("Раздел3Заголовок", Макет.ПолучитьОбласть("Раздел3Заголовок"));
	ОбластиМакета.Вставить("Раздел3Шапка", Макет.ПолучитьОбласть("Раздел3Шапка"));
	ОбластиМакета.Вставить("Раздел3Строка", Макет.ПолучитьОбласть("Раздел3Строка"));
	ОбластиМакета.Вставить("Раздел3Итого", Макет.ПолучитьОбласть("Раздел3Итого"));
	ОбластиМакета.Вставить("Раздел3Шапка_2", Макет.ПолучитьОбласть("Раздел3Шапка_2"));
	ОбластиМакета.Вставить("Раздел3Строка_2", Макет.ПолучитьОбласть("Раздел3Строка_2"));
	ОбластиМакета.Вставить("Раздел3Итого_2", Макет.ПолучитьОбласть("Раздел3Итого_2"));
	ОбластиМакета.Вставить("Раздел3Шапка_3", Макет.ПолучитьОбласть("Раздел3Шапка_3"));
	ОбластиМакета.Вставить("Раздел3Строка_3", Макет.ПолучитьОбласть("Раздел3Строка_3"));
	ОбластиМакета.Вставить("Раздел3Итого_3", Макет.ПолучитьОбласть("Раздел3Итого_3"));

	ОбластиМакета.Вставить("Раздел3Приложение", Макет.ПолучитьОбласть("Раздел3Приложение"));

	ОбластиМакета.Вставить("ОтветственноеЛицоРаздела3", Макет.ПолучитьОбласть("ОтветственноеЛицоРаздела3"));
	ОбластиМакета.Вставить("ДатаПодписиРаздела3", Макет.ПолучитьОбласть("ДатаПодписиРаздела3"));

	ОбластиМакета.Вставить("Раздел4Заголовок", Макет.ПолучитьОбласть("Раздел4Заголовок"));
	ОбластиМакета.Вставить("Раздел4Шапка", Макет.ПолучитьОбласть("Раздел4Шапка"));
	ОбластиМакета.Вставить("Раздел4Строка", Макет.ПолучитьОбласть("Раздел4Строка"));
	ОбластиМакета.Вставить("Раздел4СтрокаНетОтклоненийИНеСоответствий",
		Макет.ПолучитьОбласть("Раздел4СтрокаНетОтклоненийИНеСоответствий"));
	ОбластиМакета.Вставить("Раздел4Итого", Макет.ПолучитьОбласть("Раздел4Итого"));
	ОбластиМакета.Вставить("Раздел4Шапка_2", Макет.ПолучитьОбласть("Раздел4Шапка_2"));
	ОбластиМакета.Вставить("Раздел4Строка_2", Макет.ПолучитьОбласть("Раздел4Строка_2"));
	ОбластиМакета.Вставить("Раздел4СтрокаНетОтклоненийИНеСоответствий_2", 
		Макет.ПолучитьОбласть("Раздел4СтрокаНетОтклоненийИНеСоответствий_2"));
	ОбластиМакета.Вставить("Раздел4Итого_2", Макет.ПолучитьОбласть("Раздел4Итого_2"));

	ОбластиМакета.Вставить("ЧленКомиссии", Макет.ПолучитьОбласть("ЧленКомиссии"));
	ОбластиМакета.Вставить("ОтветственныйИсполнитель", Макет.ПолучитьОбласть("ОтветственныйИсполнитель"));

	Возврат ОбластиМакета;
	
КонецФункции

Функция КодСчета(КФО, СчетКод, СчетЗабалансовый)
	Разделитель = " ";
	ЧастиСчета = Новый Массив;
	Если ЗначениеЗаполнено(КФО) Тогда
		ЧастиСчета.Добавить(КФО);
	ИначеЕсли Не СчетЗабалансовый Тогда
		ЧастиСчета.Добавить("0");
	КонецЕсли;
	ЧастиСчета.Добавить(СчетКод);
	Если Не СчетЗабалансовый Тогда
		ЧастиСчета.Добавить("000");
	КонецЕсли;
	КодСчета = СтрСоединить(ЧастиСчета, Разделитель);
	КодСчета = СтрЗаменить(КодСчета, ".", Разделитель);
	Возврат КодСчета;
КонецФункции

Функция ПолучитьНастройкиПрочерковПустыхПолей()

	ОбщиеПоля = Новый Массив;
	ОбщиеПоля.Добавить("НаименованиеЦеннойБумаги");
	ОбщиеПоля.Добавить("КодЦеннойБумаги");
	ОбщиеПоля.Добавить("НаименованиеЕдиницыИзмерения");
	ОбщиеПоля.Добавить("КодЕдиницыИзмерения");
	
	ОбщиеПоляСПостфиксом = Новый Массив;
	ОбщиеПоляСПостфиксом.Добавить("Серия");
	ОбщиеПоляСПостфиксом.Добавить("Номер");
	ОбщиеПоляСПостфиксом.Добавить("ВалютаКод");
	ОбщиеПоляСПостфиксом.Добавить("Курс");
	
	ПоляСтрокиРаздела1 = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляСтрокиРаздела1, ОбщиеПоля);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляСтрокиРаздела1, ОбщиеПоляСПостфиксом);

	ПоляСтрокиРаздела21_2 = Новый Массив;
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела21_2, ОбщиеПоляСПостфиксом, "НеСоответствует");
	ПоляСтрокиРаздела21_2.Добавить("СтатусНеСоответствуетКод");
	ПоляСтрокиРаздела21_2.Добавить("СтатусНеСоответствуетНаименование");
	
	ПоляСтрокиРаздела22_1 = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляСтрокиРаздела22_1, ОбщиеПоля);
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела22_1, ОбщиеПоляСПостфиксом, "НеСоответствует");
	ПоляСтрокиРаздела22_1.Добавить("СтатусНеСоответствуетКод");
	ПоляСтрокиРаздела22_1.Добавить("СтатусНеСоответствуетНаименование");
	
	ПоляСтрокиРаздела22_2 = Новый Массив;
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела22_2, ОбщиеПоляСПостфиксом, "Излишки");
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела22_2, ОбщиеПоляСПостфиксом, "Недостача");
	
	ПоляСтрокиРаздела3_1 = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляСтрокиРаздела3_1, ОбщиеПоля);
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела3_1, ОбщиеПоляСПостфиксом, "Излишки");
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела3_1, ОбщиеПоляСПостфиксом, "Недостача");
	
	ПоляСтрокиРаздела3_2 = Новый Массив;
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела3_2, ОбщиеПоляСПостфиксом, "ИзлишкиПодтверждено");
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела3_2, ОбщиеПоляСПостфиксом, "НедостачаПодтверждено");
	ПоляСтрокиРаздела3_2.Добавить("НаименованиеДокумента");
	ПоляСтрокиРаздела3_2.Добавить("НомерДокумента");
	ПоляСтрокиРаздела3_2.Добавить("ДатаДокумента");
	
	ПоляСтрокиРаздела3_3 = Новый Массив;
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела3_3, ОбщиеПоляСПостфиксом, "ИзлишкиНеПодтверждено");
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела3_3, ОбщиеПоляСПостфиксом, "НедостачаНеПодтверждено");
	ПоляСтрокиРаздела3_3.Добавить("Объяснение");
	
	ПоляСтрокиРаздела4_1 = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляСтрокиРаздела4_1, ОбщиеПоля);
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела4_1, ОбщиеПоляСПостфиксом, "НеСоответствует");
	ПоляСтрокиРаздела4_1.Добавить("СтатусНеСоответствуетКод");
	ПоляСтрокиРаздела4_1.Добавить("СтатусНеСоответствуетНаименование");
	
	ПоляСтрокиРаздела4_2 = Новый Массив;
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела4_2, ОбщиеПоляСПостфиксом, "ИзлишкиНеПодтверждено");
	ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела4_2, ОбщиеПоляСПостфиксом, "НедостачаНеПодтверждено");
	ПоляСтрокиРаздела4_2.Добавить("СтатусОбъяснения");
	ПоляСтрокиРаздела4_2.Добавить("ЗаключениеКомиссии");
	
	ИменаПолей = Новый Структура;
	ИменаПолей.Вставить("ПоляСтрокиРаздела1", ПоляСтрокиРаздела1);
	ИменаПолей.Вставить("ПоляСтрокиРаздела21_1", ПоляСтрокиРаздела1);
	ИменаПолей.Вставить("ПоляСтрокиРаздела21_2", ПоляСтрокиРаздела21_2);
	ИменаПолей.Вставить("ПоляСтрокиРаздела22_1", ПоляСтрокиРаздела22_1);
	ИменаПолей.Вставить("ПоляСтрокиРаздела22_2", ПоляСтрокиРаздела22_2);
	ИменаПолей.Вставить("ПоляСтрокиРаздела3_1", ПоляСтрокиРаздела3_1);
	ИменаПолей.Вставить("ПоляСтрокиРаздела3_2", ПоляСтрокиРаздела3_2);
	ИменаПолей.Вставить("ПоляСтрокиРаздела3_3", ПоляСтрокиРаздела3_3);
	ИменаПолей.Вставить("ПоляСтрокиРаздела4_1", ПоляСтрокиРаздела4_1);
	ИменаПолей.Вставить("ПоляСтрокиРаздела4_2", ПоляСтрокиРаздела4_2);
	
	Возврат ИнвентаризацияСервер.ПолучитьНастройкиПрочерковПустыхПолей(ИменаПолей);
	
КонецФункции

Процедура ДобавитьОбщиеПоляВНастройкуПрочерков(ПоляСтрокиРаздела, ОбщиеПоляСПостфиксом, Постфикс)
	Для Каждого ИмяПоля Из ОбщиеПоляСПостфиксом Цикл
		ПоляСтрокиРаздела.Добавить(ИмяПоля + Постфикс);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ТаблицаРаздела1", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли