#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьДанные();
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		
		ПодтвердитьИЗакрытьФорму();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	ПодтвердитьИЗакрытьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьДанные()
	
	ИмяТЧУчетныеГруппыКонтрагентов = "Приложение111кРазделу2УчетныеГруппыКонтрагентов";
	
	ТЧУчетныеГруппыКонтрагентов = Объект[ИмяТЧУчетныеГруппыКонтрагентов];
	
	Для Каждого Элемент Из Параметры.СписокГруппКонтрагентов Цикл
		НоваяСтрока = ТЧУчетныеГруппыКонтрагентов.Добавить();
		
		НоваяСтрока.ГруппаКонтрагентов = Элемент.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	Заголовок = Параметры.ТекстЗаголовкаФормы;
	
	Элементы.УчетныеГруппыКонтрагентовГруппаЗаголовок.Заголовок = Параметры.ТекстЗаголовкаГруппы;
	Элементы.УчетныеГруппыКонтрагентовГруппаКонтрагентов.Заголовок = Параметры.ТекстЗаголовкаКолонки;
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("УчетныеГруппыКонтрагентовГруппаКонтрагентов");
	
	ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИЗакрытьФорму()
	
	Если Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПодтвердитьИЗакрытьФормуОтвет", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, НСтр("ru='Сохранить изменение порядка учетных групп контрагентов?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
		Возврат;
	КонецЕсли;
	
	ЗакрытьФормуБезВозвратаДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИЗакрытьФормуОтвет(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = КодВозвратаДиалога.Да Тогда
		ЗакрытьФормуСВозвратомДанных();
		
	ИначеЕсли ВыбранноеЗначение = КодВозвратаДиалога.Нет Тогда
		ЗакрытьФормуБезВозвратаДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуСВозвратомДанных()
	
	Модифицированность = Ложь;
	
	Закрыть(ПолучитьВозвращаемоеЗначение());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуБезВозвратаДанных()
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВозвращаемоеЗначение()
	
	СписокГруппКонтрагентов = Новый СписокЗначений();
	
	ТЧУчетныеГруппыКонтрагентов = Объект[ИмяТЧУчетныеГруппыКонтрагентов];
	
	Для Каждого СтрокаТаблицы Из ТЧУчетныеГруппыКонтрагентов Цикл
		СписокГруппКонтрагентов.Добавить(СтрокаТаблицы.ГруппаКонтрагентов);
	КонецЦикла;
	
	Возврат СписокГруппКонтрагентов;
	
КонецФункции

// НедоступныеКолонки
&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_Очистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
// Конец НедоступныеКолонки

#КонецОбласти
