#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий 

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	Документы.ЗакрытиеОстатковПоЖурналамСлужебный.ОчиститьДвиженияВТЧ(Ссылка, ПометкаУдаления);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СписокДокументов.Очистить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если ЕстьДублиДокументаВЭтомПериоде() Тогда
			ТекстОшибки = НСтр("ru = 'За выбранный финансовый год уже есть введенный документ ""Формирование остатков служебный"".'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Ссылка, , , Отказ);
			Возврат;
		КонецЕсли;
		
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДанныеАвтоПроведения")
			И ЭтотОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения.ВызовИзФормы Тогда
			УстановленнаяОперация = ЭтотОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения.ТиповаяОперация;
		Иначе
			УстановленнаяОперация = БухгалтерскиеОперацииСервер.БухгалтерскаяОперацияДокумента(Ссылка);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(УстановленнаяОперация) Тогда
			УстановленнаяОперация = Справочники.ТиповыеОперации.ЗакрытиеОстатковПоЖурналамСлужебный_ЗакрытиеОстатковПоЖурналамСлужебный;
		КонецЕсли;
		
		ДополнительныеРеквизиты = Новый Структура;
		
		//сначала снимем проведение всех документов в ТЧ
		Документы.ЗакрытиеОстатковПоЖурналамСлужебный.ОчиститьДвиженияВТЧ(Ссылка);
		
		Счет000 = ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.Вспомогательный");
		КЭК000 = БухгалтерскийУчетПовтИсп.КЭК0();
		
		МаксимальноеКоличествоПроводок = МаксимальноеКоличествоПроводокВДокументе;
		
		МассивНезадействованныхДокументовИзТЧ = СписокДокументов.Выгрузить(,"ДокСсылка");
		
		//выполняем запрос и формируем документы
		МассивРезультатов = Документы.ЗакрытиеОстатковПоЖурналамСлужебный.ЗапросПоОстаткамЖурналов(ЭтотОбъект);
		
		ТаблицаПроводок = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		ДатаПроводки = КонецДня(ФинансовыйГод);
		УточнениеПериода = БухгалтерскийУчет.ЗначениеУточненияПериода(ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.СлужебныеОперации"));
		
		Выборка = МассивРезультатов[0].Выбрать(); 
		Пока Выборка.Следующий() Цикл
			
			СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Выборка.Счет);
			
			// Уберем остаток по журналу на счет 000
			
			НовПроводка = ТаблицаПроводок.Добавить();
			
			НовПроводка.Активность = Истина;
			НовПроводка.Период = ДатаПроводки;
			НовПроводка.Организация = Организация;
			НовПроводка.УточнениеПериода = УточнениеПериода;
			НовПроводка.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.СлужебныеОперации");
						
			НовПроводка.Содержание = НСтр("ru = 'Закрытие остатков по журналам'");
			
			НовПроводка.КФО = Выборка.КФО;
			НовПроводка.ИФО = Выборка.ИФО;
			НовПроводка.ЖурналОпераций = Выборка.ЖурналОпераций; 

			
			Если Выборка.Сторона = "Дт" Тогда
				
				НовПроводка.Сумма = Выборка.СуммаОстатокДт;
				НовПроводка["КоличествоКт"] = Выборка.КоличествоОстатокДт;
				НовПроводка["ВалютнаяСуммаКт"] = Выборка.ВалютнаяСуммаОстатокДт;
				НовПроводка["ВалютаКт"] = Выборка.Валюта;
				
				НовПроводка.СчетКт = Выборка.Счет;
				НовПроводка.КПСКт = Выборка.КПС;
				НовПроводка.КЭККт = Выборка.КЭК;
				НовПроводка.ПодразделениеКт = Выборка.Подразделение;
				
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто1) Тогда
					НовПроводка["СубконтоКт1"] = Выборка.Субконто1;
					НовПроводка["ВидСубконтоКт1"] = СвойстваСчета.ВидСубконто1;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто2) Тогда
					НовПроводка["СубконтоКт2"] = Выборка.Субконто2;
					НовПроводка["ВидСубконтоКт2"] = СвойстваСчета.ВидСубконто2;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто3) Тогда
					НовПроводка["СубконтоКт3"] = Выборка.Субконто3;
					НовПроводка["ВидСубконтоКт3"] = СвойстваСчета.ВидСубконто3;
				КонецЕсли;
				
				НовПроводка.СчетДт = Счет000;
				
			КонецЕсли;
			
			Если Выборка.Сторона = "Кт" Тогда
				
				НовПроводка.Сумма = Выборка.СуммаОстатокКт;
				НовПроводка["КоличествоДт"] = Выборка.КоличествоОстатокКт;
				НовПроводка["ВалютнаяСуммаДт"] = Выборка.ВалютнаяСуммаОстатокКт;
				НовПроводка["ВалютаДт"] = Выборка.Валюта;
								
				НовПроводка.СчетДт = Выборка.Счет;
				НовПроводка.КПСДт = Выборка.КПС;
				НовПроводка.КЭКДт = Выборка.КЭК;
				НовПроводка.ПодразделениеДт = Выборка.Подразделение;
				
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто1)  Тогда
					НовПроводка["СубконтоДт1"] = Выборка.Субконто1;
					НовПроводка["ВидСубконтоДт1"] = СвойстваСчета.ВидСубконто1;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто2)  Тогда
					НовПроводка["СубконтоДт2"] = Выборка.Субконто2;
					НовПроводка["ВидСубконтоДт2"] = СвойстваСчета.ВидСубконто2;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто3)  Тогда
					НовПроводка["СубконтоДт3"] = Выборка.Субконто3;
					НовПроводка["ВидСубконтоДт3"] = СвойстваСчета.ВидСубконто3;
				КонецЕсли;
				
				НовПроводка.СчетКт = Счет000;
				
			КонецЕсли;
			
			Если МаксимальноеКоличествоПроводок > 0 И ТаблицаПроводок.Количество() >= МаксимальноеКоличествоПроводок Тогда
				
				//создаем очередной документ
				Если МассивНезадействованныхДокументовИзТЧ.Количество() > 0 Тогда
					
					ДокОбъект = МассивНезадействованныхДокументовИзТЧ[0].ДокСсылка.ПолучитьОбъект();
					Если ДокОбъект.ПометкаУдаления Тогда
						ДокОбъект.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
					
					МассивНезадействованныхДокументовИзТЧ.Удалить(0);
					ДобавитьСсылкуВТЧ = Ложь;
				Иначе
					ДокОбъект = Документы.ЗакрытиеГодаТехнологическое.СоздатьДокумент();
					ДобавитьСсылкуВТЧ = Истина;
				КонецЕсли;
				
				ЗаполнитьИПровестиДокументЗакрытиеГодаТехнологическое(ДокОбъект, ТаблицаПроводок, УстановленнаяОперация, ДополнительныеРеквизиты);
				
				Если ДобавитьСсылкуВТЧ Тогда
					НоваяСтрока = СписокДокументов.Добавить();
					НоваяСтрока.ДокСсылка = ДокОбъект.Ссылка;
				КонецЕсли;
				
				ТаблицаПроводок.Очистить();
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаПроводок.Количество() > 0 Тогда
			//создаем последний или единственный документ
			
			Если МассивНезадействованныхДокументовИзТЧ.Количество() > 0 Тогда
				
				ДокОбъект = МассивНезадействованныхДокументовИзТЧ[0].ДокСсылка.ПолучитьОбъект();
				Если ДокОбъект.ПометкаУдаления Тогда
					ДокОбъект.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
				
				МассивНезадействованныхДокументовИзТЧ.Удалить(0);
				ДобавитьСсылкуВТЧ = Ложь;
			Иначе
				ДокОбъект = Документы.ЗакрытиеГодаТехнологическое.СоздатьДокумент();
				ДобавитьСсылкуВТЧ = Истина;
			КонецЕсли;
			
			ЗаполнитьИПровестиДокументЗакрытиеГодаТехнологическое(ДокОбъект, ТаблицаПроводок, УстановленнаяОперация, ДополнительныеРеквизиты);
			
			Если ДобавитьСсылкуВТЧ Тогда
				НоваяСтрока = СписокДокументов.Добавить();
				НоваяСтрока.ДокСсылка = ДокОбъект.Ссылка;
			КонецЕсли;
			
			ТаблицаПроводок.Очистить();
			
		КонецЕсли;     
		
		ТаблицаПроводок.Очистить();
		
		Выборка = МассивРезультатов[1].Выбрать(); 
		Пока Выборка.Следующий() Цикл
			
			СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Выборка.Счет);
			
			// Вернем остаток со счета 000, но уже без номера журнала
			
			НовПроводка = ТаблицаПроводок.Добавить();
			
			НовПроводка.Активность = Истина;
			НовПроводка.Период = ДатаПроводки;
			НовПроводка.Организация = Организация;
			НовПроводка.УточнениеПериода = УточнениеПериода;
			НовПроводка.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.СлужебныеОперации");
						
			НовПроводка.Содержание = НСтр("ru = 'Закрытие остатков по журналам'");
			
			НовПроводка.КФО = Выборка.КФО;
			НовПроводка.ИФО = Выборка.ИФО;
			//НовПроводка.ЖурналОпераций = Выборка.ЖурналОпераций; 
			
			Если Выборка.Сторона = "Дт" Тогда
				
				НовПроводка.Сумма = Выборка.СуммаОстатокДт;
				НовПроводка["КоличествоДт"] = Выборка.КоличествоОстатокДт;
				НовПроводка["ВалютнаяСуммаДт"] = Выборка.ВалютнаяСуммаОстатокДт;
				НовПроводка["ВалютаДт"] = Выборка.Валюта;
								
				НовПроводка.СчетДт = Выборка.Счет;
				НовПроводка.КПСДт = Выборка.КПС;
				НовПроводка.КЭКДт = Выборка.КЭК;
				НовПроводка.ПодразделениеДт = Выборка.Подразделение;
				
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто1)  Тогда
					НовПроводка["СубконтоДт1"] = Выборка.Субконто1;
					НовПроводка["ВидСубконтоДт1"] = СвойстваСчета.ВидСубконто1;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто2)  Тогда
					НовПроводка["СубконтоДт2"] = Выборка.Субконто2;
					НовПроводка["ВидСубконтоДт2"] = СвойстваСчета.ВидСубконто2;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто3)  Тогда
					НовПроводка["СубконтоДт3"] = Выборка.Субконто3;
					НовПроводка["ВидСубконтоДт3"] = СвойстваСчета.ВидСубконто3;
				КонецЕсли;
				
				НовПроводка.СчетКт = Счет000;
				
			КонецЕсли;
			
			Если Выборка.Сторона = "Кт" Тогда
				
				НовПроводка.Сумма = Выборка.СуммаОстатокКт;
				НовПроводка["КоличествоКт"] = Выборка.КоличествоОстатокКт;
				НовПроводка["ВалютнаяСуммаКт"] = Выборка.ВалютнаяСуммаОстатокКт;
				НовПроводка["ВалютаКт"] = Выборка.Валюта;
				
				НовПроводка.СчетКт = Выборка.Счет;
				НовПроводка.КПСКт = Выборка.КПС;
				НовПроводка.КЭККт = Выборка.КЭК;
				НовПроводка.ПодразделениеКт = Выборка.Подразделение;
				
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто1) Тогда
					НовПроводка["СубконтоКт1"] = Выборка.Субконто1;
					НовПроводка["ВидСубконтоКт1"] = СвойстваСчета.ВидСубконто1;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто2) Тогда
					НовПроводка["СубконтоКт2"] = Выборка.Субконто2;
					НовПроводка["ВидСубконтоКт2"] = СвойстваСчета.ВидСубконто2;
				КонецЕсли;
				Если ЗначениеЗаполнено(СвойстваСчета.ВидСубконто3) Тогда
					НовПроводка["СубконтоКт3"] = Выборка.Субконто3;
					НовПроводка["ВидСубконтоКт3"] = СвойстваСчета.ВидСубконто3;
				КонецЕсли;
				
				НовПроводка.СчетДт = Счет000;
				
			КонецЕсли;
			
			Если МаксимальноеКоличествоПроводок > 0 И ТаблицаПроводок.Количество() >= МаксимальноеКоличествоПроводок Тогда
				
				//создаем очередной документ
				Если МассивНезадействованныхДокументовИзТЧ.Количество() > 0 Тогда
					
					ДокОбъект = МассивНезадействованныхДокументовИзТЧ[0].ДокСсылка.ПолучитьОбъект();
					Если ДокОбъект.ПометкаУдаления Тогда
						ДокОбъект.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
					
					МассивНезадействованныхДокументовИзТЧ.Удалить(0);
					ДобавитьСсылкуВТЧ = Ложь;
				Иначе
					ДокОбъект = Документы.ЗакрытиеГодаТехнологическое.СоздатьДокумент();
					ДобавитьСсылкуВТЧ = Истина;
				КонецЕсли;
				
				ЗаполнитьИПровестиДокументЗакрытиеГодаТехнологическое(ДокОбъект, ТаблицаПроводок, УстановленнаяОперация, ДополнительныеРеквизиты);
				
				Если ДобавитьСсылкуВТЧ Тогда
					НоваяСтрока = СписокДокументов.Добавить();
					НоваяСтрока.ДокСсылка = ДокОбъект.Ссылка;
				КонецЕсли;
				
				ТаблицаПроводок.Очистить();
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ТаблицаПроводок.Количество() > 0 Тогда
			//создаем последний или единственный документ
			
			Если МассивНезадействованныхДокументовИзТЧ.Количество() > 0 Тогда
				
				ДокОбъект = МассивНезадействованныхДокументовИзТЧ[0].ДокСсылка.ПолучитьОбъект();
				Если ДокОбъект.ПометкаУдаления Тогда
					ДокОбъект.УстановитьПометкуУдаления(Ложь);
				КонецЕсли;
				
				МассивНезадействованныхДокументовИзТЧ.Удалить(0);
				ДобавитьСсылкуВТЧ = Ложь;
			Иначе
				ДокОбъект = Документы.ЗакрытиеГодаТехнологическое.СоздатьДокумент();
				ДобавитьСсылкуВТЧ = Истина;
			КонецЕсли;
			
			ЗаполнитьИПровестиДокументЗакрытиеГодаТехнологическое(ДокОбъект, ТаблицаПроводок, УстановленнаяОперация, ДополнительныеРеквизиты);
			
			Если ДобавитьСсылкуВТЧ Тогда
				НоваяСтрока = СписокДокументов.Добавить();
				НоваяСтрока.ДокСсылка = ДокОбъект.Ссылка;
			КонецЕсли;
			
			ТаблицаПроводок.Очистить();
			
		КонецЕсли;
		

		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьДублиДокументаВЭтомПериоде()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗакрытиеОстатковПоЖурналамСлужебный.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеОстатковПоЖурналамСлужебный КАК ЗакрытиеОстатковПоЖурналамСлужебный
	|ГДЕ
	|	ЗакрытиеОстатковПоЖурналамСлужебный.Ссылка <> &Ссылка
	|	И ЗакрытиеОстатковПоЖурналамСлужебный.Организация = &Организация
	|	И ЗакрытиеОстатковПоЖурналамСлужебный.ФинансовыйГод = &ФинансовыйГод";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФинансовыйГод", ФинансовыйГод);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ЗаполнитьИПровестиДокументЗакрытиеГодаТехнологическое(ДокОбъект, ТаблицаПроводок, УстановленнаяОперация, ДополнительныеРеквизиты)
	
	ДокОбъект.Дата = Дата;
	ДокОбъект.Организация = Организация;
	ДокОбъект.ФинансовыйГод = ФинансовыйГод;
	ДокОбъект.Комментарий = Комментарий;
	ДокОбъект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.СлужебныеОперации");
	
	ДокОбъект.ДополнительныеСвойства.Вставить("ТаблицаПроводок", ТаблицаПроводок);
	ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", ИСТИНА);
	
	БухгалтерскиеОперацииСервер.ДобавитьДанныеДляПроведения(ДокОбъект, УстановленнаяОперация, ДополнительныеРеквизиты, Истина);
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
