#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьНаОсновании(Объект, ДанныеЗаполнения) Экспорт
	
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОПроведенииИнвентаризации")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИзменениеРешенияОПроведенииИнвентаризации") Тогда
		
		ЗаполнитьНаОсновании_РешениеОПроведенииИнвентаризации(Объект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОписьВПриложение(ДокументОбъект, Параметры, КоличествоДобавленныхСтрок) Экспорт
	
	Данные = ПолучитьДанныеЗаполненияПоОднойОписи(ДокументОбъект, Параметры);
	
	ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(Параметры.НомерПриложения, Параметры.НомерРаздела);
	
	ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
	
	ТаблицаДанных = Данные.ТабличныеЧасти[ИмяТЧПриложения];
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		НоваяСтрока = ТЧПриложения.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;
	
	КоличествоДобавленныхСтрок = ТаблицаДанных.Количество();
	
КонецПроцедуры

Процедура ПриИзмененииОписиВРазделе(ДокументОбъект, ИзмененаСсылкаОписи, СтрокаРаздела, ИменаПолей) Экспорт
	
	Опись = СтрокаРаздела.Опись;
	
	НомерРаздела = ИменаПолей.НомерРаздела;
	
	Если ИзмененаСсылкаОписи Тогда
		РеквизитыОписи = ПолучитьРеквизитыОписи(Опись);
	
		ЗаполнитьЗначенияСвойств(СтрокаРаздела, РеквизитыОписи);
	Иначе
		РеквизитыОписи = Новый Структура("Опись,НомерОписи,ДатаОписи");
		
		ЗаполнитьЗначенияСвойств(РеквизитыОписи, СтрокаРаздела);
	КонецЕсли;
	
	ОбновитьСведенияОбОписиВПриложениях(ДокументОбъект, НомерРаздела, СтрокаРаздела.ИдентификаторСтроки, РеквизитыОписи);
	
	Если ИзмененаСсылкаОписи Тогда
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("ТаблицаНастроек",	ТаблицаТиповОписейПоРазделам());
		ДополнительныеПараметры.Вставить("КодыФорм",		КодыФорм());
		
		ДополнительныеРеквизиты = ПолучитьКодФормыИНомерПриложения(Опись, НомерРаздела, ДополнительныеПараметры);
		
		ЗаполнитьЗначенияСвойств(СтрокаРаздела, ДополнительныеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКодыСтрокПриложенийПоИдентификатору(ДокументОбъект, Знач НомерРаздела = Неопределено) Экспорт
	
	Если НомерРаздела = Неопределено Тогда
		НомераРазделовСПриложениями = НомераРазделовСПриложениями();
	Иначе
		НомераРазделовСПриложениями = Новый Массив();
		НомераРазделовСПриложениями.Добавить(НомерРаздела);
	КонецЕсли;
	
	Для Каждого НомерРаздела Из НомераРазделовСПриложениями Цикл
		ЗаполнитьКодыСтрокПриложенийРазделаПоИдентификатору(ДокументОбъект, НомерРаздела);
	КонецЦикла;
	
КонецПроцедуры

Процедура УпорядочитьСтрокиПриложения(ФормаДокумента, ИмяТЧПриложения, ПараметрыУпорядочивания = Неопределено) Экспорт
	
	Документы.АктИнвентаризации.ИнициализироватьКэшКодыСтрокПриложений(ФормаДокумента);
	
	РассчитатьПеремещенияСтрокПриложения(ФормаДокумента, ИмяТЧПриложения, ПараметрыУпорядочивания);
	
	ПереместитьСтрокиПриложения(ФормаДокумента, ИмяТЧПриложения);
	
КонецПроцедуры

Функция ПолучитьОбобщенныеДанныеРешения(РешениеСсылка) Экспорт
	
	Результат = Новый Структура("
		|ПоследнееИзменение,
		|ТекстОшибки,
		|ДеревоДатИКомиссий,
		|ЕдинственноеЗначение,
		|Шапка");
	
	ЕдинственноеЗначение = Новый Структура("
		|ДатаИнвентаризации,
		|НомерКомиссии,
		|Комиссия,
		|ИФО,
		|Подразделение");
	
	Шапка = Новый Структура("
		|Решение,
		|Организация,
		|ИФО,
		|Подразделение");
	
	РезультатПроверки = ИнвентаризацияСервер.ПостроитьДеревоДокументовДляВводаНаОсновании(РешениеСсылка, Неопределено);
	
	Если РезультатПроверки.Дерево.ТаблицаОшибок.Количество() > 0 Тогда	
		Результат.ТекстОшибки = НСтр("ru='Обнаружены ошибки построения цепочки документов для выбранного Решения.'");
		
		Возврат Результат;
		
	ИначеЕсли РезультатПроверки.Дерево.Аннулирующее = Истина Тогда
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru='Выбранное Решение аннулировано документом
				|%1.'"),
			РезультатПроверки.Дерево.АннулирующееИзменениеСсылка);
			
		Результат.ПоследнееИзменение = РезультатПроверки.Дерево.АннулирующееИзменениеСсылка;
		
		Возврат Результат;
	КонецЕсли;	
	
	ПоследнийДокумент = РезультатПроверки.Дерево.ПоследнийДокумент;
	
	ЭтоИзменениеРешения = (ТипЗнч(ПоследнийДокумент) = Тип("ДокументСсылка.ИзменениеРешенияОПроведенииИнвентаризации"));
	
	Если ЭтоИзменениеРешения Тогда
		Результат.ПоследнееИзменение = ПоследнийДокумент;
	КонецЕсли;
	
	ДеревоДатИКомиссий = Новый ДеревоЗначений();
	ДеревоДатИКомиссий.Колонки.Добавить("ДатаИнвентаризации",	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ДеревоДатИКомиссий.Колонки.Добавить("НомерКомиссии",		ОбщегоНазначения.ОписаниеТипаЧисло(6,0,ДопустимыйЗнак.Неотрицательный));
	ДеревоДатИКомиссий.Колонки.Добавить("Комиссия",				Новый ОписаниеТипов("СправочникСсылка.ПостоянноДействующиеКомиссии"));
	ДеревоДатИКомиссий.Колонки.Добавить("ЭтоГруппа",			Новый ОписаниеТипов("Булево"));
	
	Данные = Документы.ИзменениеРешенияОПроведенииИнвентаризации.ПолучитьДанныеДляЗаполненияНаОсновании(РешениеСсылка, Неопределено);
	
	ЗаполнитьЗначенияСвойств(Шапка, Данные.Шапка);
	
	ТаблицаОбъекты	= Данные.ТаблицаОбъекты;
	ТаблицаКомиссии	= Данные.ТаблицаКомиссии;
	
	СвернутаяТаблицаОбъекты = ТаблицаОбъекты.Скопировать(, "ДатаИнвентаризации,НомерКомиссии");
	СвернутаяТаблицаОбъекты.Свернуть("ДатаИнвентаризации,НомерКомиссии");
	СвернутаяТаблицаОбъекты.Сортировать("ДатаИнвентаризации ВОЗР,НомерКомиссии ВОЗР");
	
	// Удалим строки с пустой датой
	Поиск = Новый Структура("ДатаИнвентаризации", '00010101');
	МассивСтрок = СвернутаяТаблицаОбъекты.НайтиСтроки(Поиск);
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		СвернутаяТаблицаОбъекты.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	// Единственное значение даты инвентаризации
	СвернутаяТаблицаПоДатам = СвернутаяТаблицаОбъекты.Скопировать(, "ДатаИнвентаризации");
	СвернутаяТаблицаПоДатам.Свернуть("ДатаИнвентаризации");
	
	Если СвернутаяТаблицаПоДатам.Количество() = 1 Тогда
		ЕдинственноеЗначение.ДатаИнвентаризации = СвернутаяТаблицаПоДатам[0].ДатаИнвентаризации;
	КонецЕсли;
	
	// Единственное значение номера комиссии
	ВремТаблицаПоКомиссиям = СвернутаяТаблицаОбъекты.Скопировать(, "НомерКомиссии");
	ВремТаблицаПоКомиссиям.Свернуть("НомерКомиссии");
	
	Если ВремТаблицаПоКомиссиям.Количество() = 1 Тогда
		НомерКомиссии = ВремТаблицаПоКомиссиям[0].НомерКомиссии;
		
		ЕдинственноеЗначение.НомерКомиссии = НомерКомиссии;
		ЕдинственноеЗначение.Комиссия = ТаблицаКомиссии[НомерКомиссии - 1].Комиссия;
	КонецЕсли;
	
	// Составляем дерево дат и комиссий
	ПредыдущаяСтрокаСвернутойТаблицы = Неопределено;
	
	Поиск = Новый Структура("ДатаИнвентаризации");
	
	Для Каждого СтрокаДаты Из СвернутаяТаблицаПоДатам Цикл
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаДаты);
		
		МассивСтрок = СвернутаяТаблицаОбъекты.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 1 Тогда
			// В дерево добавляем одну строку, без группировки по дате
			
			СтрокаСвернутойТаблицыОбъекты = МассивСтрок[0];
			
			НоваяСтрока = ДеревоДатИКомиссий.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСвернутойТаблицыОбъекты);
			
			НоваяСтрока.Комиссия = ТаблицаКомиссии[СтрокаСвернутойТаблицыОбъекты.НомерКомиссии - 1].Комиссия;
			
			Продолжить;
		КонецЕсли;
		
		// В дерево добавляем строку группировки по дате, и в нее добавляем дочерние строки
		
		НоваяСтрокаГруппы = ДеревоДатИКомиссий.Строки.Добавить();
		НоваяСтрокаГруппы.ДатаИнвентаризации	= СтрокаДаты.ДатаИнвентаризации;
		НоваяСтрокаГруппы.ЭтоГруппа				= Истина;
		
		Для Каждого СтрокаСвернутойТаблицыОбъекты Из МассивСтрок Цикл
			НоваяСтрока = НоваяСтрокаГруппы.Строки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСвернутойТаблицыОбъекты);
			
			НоваяСтрока.Комиссия = ТаблицаКомиссии[СтрокаСвернутойТаблицыОбъекты.НомерКомиссии - 1].Комиссия;
		КонецЦикла;
	КонецЦикла;
	
	Результат.ЕдинственноеЗначение = ЕдинственноеЗначение;
	Результат.ДеревоДатИКомиссий = ДеревоДатИКомиссий;
	Результат.Шапка = Шапка;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьНесопоставленныеСтрокиПриложений(ДокументОбъект, Знач НомерРаздела = Неопределено) Экспорт
	
	Если НомерРаздела = Неопределено Тогда
		НомераРазделовСПриложениями = НомераРазделовСПриложениями();
	Иначе
		НомераРазделовСПриложениями = Новый Массив();
		НомераРазделовСПриложениями.Добавить(НомерРаздела);
	КонецЕсли;
	
	Для Каждого НомерРаздела Из НомераРазделовСПриложениями Цикл
		УдалитьНесопоставленныеСтрокиПриложенийРаздела(ДокументОбъект, НомерРаздела);
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьОшибкиЗаполнения(ДокументОбъект) Экспорт
	
	ЕстьОшибки = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("МетаданныеТабличныхЧастей", Метаданные.Документы.АктИнвентаризации.ТабличныеЧасти);
	ДополнительныеПараметры.Вставить("КодыСтрокПриложений", Новый Соответствие());
	
	ПроверитьЗаполненностьКодовФормВРазделах(ДокументОбъект, ЕстьОшибки);
	
	// Коды строк приложений
	
	ПроверитьКорректностьКодовСтрокПриложений(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьНаличиеСтрокПриложений(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьДублиКодовСтрокПриложений(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	
	// Приложения к разделу 2
	
	ПроверитьПриложение1кРазделу2(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение3кРазделу2(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение4кРазделу2(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение5кРазделу2(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение6кРазделу2(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение7кРазделу2(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	
	// Приложения к разделу 3
	
	ПроверитьПриложение1кРазделу3(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение2кРазделу3(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение3кРазделу3(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	ПроверитьПриложение4кРазделу3(ДокументОбъект, ЕстьОшибки, ДополнительныеПараметры);
	
	ОбщегоНазначенияБГУ.ПроверитьЗаполнениеОтсутствияЧленовКомиссии(ДокументОбъект, ЕстьОшибки);
	
	Возврат ЕстьОшибки;
	
КонецФункции

Процедура ИнициализироватьФормуДокумента(ФормаДокумента) Экспорт
	
	ФормаДокумента.ВключатьОписи61н = Истина;
	
	ФормаДокумента.СчетаУстановкиКоличестваПоУмолчанию = Новый ФиксированныйМассив(ИнвентаризацияСервер.ПолучитьСчетаУстановкиКоличестваПоУмолчанию());
	
	ИнициализироватьНастройкиКодовФорм(ФормаДокумента);
	
	ИнициализироватьДопустимостьДобавленияСтрокТабличныхЧастей(ФормаДокумента);
	
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(ФормаДокумента.Элементы, ФормаДокумента.Объект,
		"Раздел1ПереместитьСтрокуВРаздел3,Раздел1ПереместитьСтрокуВРаздел2,"
		+ "ДобавитьОписьВПриложение2,ДобавитьОписьВПриложение3,"
		+ "ГрупповоеЗаполнениеСтрокПриложение1кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение2кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение3кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение4кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение5кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение6кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение7кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение8кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение9кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение10кРазделу2,"
		+ "ГрупповоеЗаполнениеСтрокПриложение1кРазделу3,"
		+ "ГрупповоеЗаполнениеСтрокПриложение2кРазделу3,"
		+ "ГрупповоеЗаполнениеСтрокПриложение3кРазделу3,"
		+ "ГрупповоеЗаполнениеСтрокПриложение4кРазделу3,"
		+ "ГрупповоеЗаполнениеСтрокПриложение5кРазделу3,"
		+ "ГрупповоеЗаполнениеСтрокПриложение6кРазделу3,"
		+ "ГрупповоеЗаполнениеСтрокПриложение7кРазделу3");

	// Разделы
	
	ИнициализироватьСписокВыбораКодФормы(ФормаДокумента);
	
	// Приложения
	
	ИнициализироватьЭлементыКолонокОписей(ФормаДокумента);
	
	ИнициализироватьЭлементыКолонокЗаключенияКомиссииПоОписи(ФормаДокумента);
	
	ИнициализироватьКэшКодыСтрокПриложений(ФормаДокумента);
	
	ИнициализироватьПриложение2КРазделу2(ФормаДокумента);
	ИнициализироватьПриложение4КРазделу2(ФормаДокумента);
	ИнициализироватьПриложение5КРазделу2(ФормаДокумента);
	ИнициализироватьПриложение6КРазделу2(ФормаДокумента);
	
	ИнициализироватьПриложение2КРазделу3(ФормаДокумента);
	ИнициализироватьПриложение3КРазделу3(ФормаДокумента);
	
	// Состав комиссии
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("СоставКомиссииСотрудник");
	
	ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ФормаДокумента, НедоступныеКолонки, Ложь);
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ФормаДокумента);
	// Конец ИндикаторКворумаПрисутствия
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиями.ИнициализироватьФормуДокументаЗамещениеЧленаКомиссии(ФормаДокумента);
	// Конец ЗамещениеЧленаКомиссии
	
	УстановитьУсловноеОформление(ФормаДокумента);
	
КонецПроцедуры

Процедура ИнициализироватьКэшКодыСтрокПриложений(ФормаДокумента, ОтборСтрокиРаздела = Неопределено) Экспорт
	
	// Структура
	//	* Ключ		- Строка	- имя табличной части приложения
	//	* Значение	- Структура	- кэшируемые сведения для указанной табличной части
	//
	//		** Ключ "МаксимальныеПорядковыеНомера"
	//		** Значение		- Соответствие - максимальные порядковые номера для каждого номера строки раздела
	//			*** Ключ		- Число	- номер строки раздела
	//			*** Значение	- Число	- максимальный номер для такого номера строки раздела
	//
	//		** Ключ "НоваяСтрока"
	//		** Значение		- СписокЗначений - список значений для кода строки приложения, выводимый для новой строки приложения
	//		
	//		** Предопределенный ключ "СуществующаяСтрока"
	//		** Значение		- Соответствие - списки значений для каждого номера строки раздела, выводимые для уже существующей строки приложения.
	//			*** Ключ		- Число	- номер строки раздела
	//			*** Значение	- СписокЗначений - список значений для кода строки приложения
	
	Если ОтборСтрокиРаздела <> Неопределено Тогда
		МаксимальныеПорядковыеНомера	= ФормаДокумента.КэшКодыСтрокПриложений.МаксимальныеПорядковыеНомера;
		СпискиВыбораНоваяСтрока			= ФормаДокумента.КэшКодыСтрокПриложений.СпискиВыбораНоваяСтрока;
		СпискиВыбораСуществующаяСтрока	= ФормаДокумента.КэшКодыСтрокПриложений.СпискиВыбораСуществующаяСтрока;
	Иначе
		МаксимальныеПорядковыеНомера	= Новый Структура();
		СпискиВыбораНоваяСтрока			= Новый Структура();
		СпискиВыбораСуществующаяСтрока	= Новый Структура();
	КонецЕсли;
		
	ДопустимостьДобавленияСтрок = ДопустимостьДобавленияСтрок();
	
	Для Каждого НомерРаздела Из НомераРазделовСПриложениями() Цикл
		
		Если ОтборСтрокиРаздела <> Неопределено И НомерРаздела <> ОтборСтрокиРаздела.НомерРаздела Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ТЧРаздела = ФормаДокумента.Объект[ИмяТЧРаздела];
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			Если ОтборСтрокиРаздела <> Неопределено И ЗначениеЗаполнено(ОтборСтрокиРаздела.НомерПриложения) И НомерПриложения <> ОтборСтрокиРаздела.НомерПриложения Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			Если Не ДопустимостьДобавленияСтрок.Свойство(ИмяТЧПриложения) Тогда
				Продолжить;
			КонецЕсли;
			
			ТЧПриложения = ФормаДокумента.Объект[ИмяТЧПриложения];
			
			МаксимальныеНомера = ПолучитьМаксимальныеПорядковыеНомера(ТЧПриложения);
			
			МаксимальныеПорядковыеНомера.Вставить(ИмяТЧПриложения, МаксимальныеНомера);
			
			СпискиВыбора = ПолучитьСпискиВыбораКодаСтрокиПриложения(ТЧРаздела, ТЧПриложения, НомерПриложения, МаксимальныеНомера);
			
			СпискиВыбораНоваяСтрока.Вставить(ИмяТЧПриложения, СпискиВыбора.НоваяСтрока);
			
			СпискиВыбораСуществующаяСтрока.Вставить(ИмяТЧПриложения, СпискиВыбора.СуществующаяСтрока);
			
		КонецЦикла;
		
	КонецЦикла;
	
	КэшКодыСтрокПриложений = Новый Структура();
	КэшКодыСтрокПриложений.Вставить("МаксимальныеПорядковыеНомера",		МаксимальныеПорядковыеНомера);
	КэшКодыСтрокПриложений.Вставить("СпискиВыбораНоваяСтрока",			СпискиВыбораНоваяСтрока);
	КэшКодыСтрокПриложений.Вставить("СпискиВыбораСуществующаяСтрока",	СпискиВыбораСуществующаяСтрока);
	
	ФормаДокумента.КэшКодыСтрокПриложений = КэшКодыСтрокПриложений;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонки(ФормаДокумента) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СчетаУстановкиКоличестваПоУмолчанию", ИнвентаризацияСервер.ПолучитьСчетаУстановкиКоличестваПоУмолчанию());
	
	ЗаполнитьСлужебныеКолонки_КодСтроки(ФормаДокумента);
	
	ЗаполнитьСлужебныеКолонки_Приложение6кРазделу2(ФормаДокумента);
	ЗаполнитьСлужебныеКолонки_Приложение7кРазделу2(ФормаДокумента, ДополнительныеПараметры);
	
	ЗаполнитьСлужебныеКолонки_Приложение4кРазделу3(ФормаДокумента, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонкиПриложенияКРазделу(ФормаДокумента, ПараметрыДляДобавленияОписиВПриложение) Экспорт
	
	НомерПриложения	= ПараметрыДляДобавленияОписиВПриложение.НомерПриложения;
	НомерРаздела	= ПараметрыДляДобавленияОписиВПриложение.НомерРаздела;
	
	Если НомерПриложения = 6 И НомерРаздела = 2 Тогда
		ЗаполнитьСлужебныеКолонки_Приложение6кРазделу2(ФормаДокумента);
		
	ИначеЕсли (НомерПриложения = 7 И НомерРаздела = 2) Или (НомерПриложения = 4 И НомерРаздела = 3) Тогда
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("СчетаУстановкиКоличестваПоУмолчанию", ИнвентаризацияСервер.ПолучитьСчетаУстановкиКоличестваПоУмолчанию());
		
		Если НомерПриложения = 7 И НомерРаздела = 2 Тогда
			ЗаполнитьСлужебныеКолонки_Приложение7кРазделу2(ФормаДокумента, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 4 И НомерРаздела = 3 Тогда
			ЗаполнитьСлужебныеКолонки_Приложение4кРазделу3(ФормаДокумента, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПервыйКодСтрокиОписиВПриложении(ДокументОбъект, Опись, НомерПриложения, НомерРаздела) Экспорт
	
	Поиск = Новый Структура("Опись", Опись);
	
	ТЧПриложения = ДокументОбъект[ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела)];
	
	МассивСтрок = ТЧПриложения.НайтиСтроки(Поиск);
	
	Если МассивСтрок.Количество() > 0 Тогда
		Возврат МассивСтрок[0].КодСтроки;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#Область ЗаполнениеПоВсемОписям

Функция ПолучитьШапкуДокумента(ДокументОбъект) Экспорт
	
	ШапкаДокумента = Новый Структура("
		|РешениеОПроведенииИнвентаризации,
		|ДатаИнвентаризации,
		|НомерКомиссии,
		|Организация,
		|Подразделение,
		|ИФО");
	
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, ДокументОбъект);
	
	Возврат ШапкаДокумента;
	
КонецФункции

Процедура ПолучитьДанныеЗаполненияПоОписям(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ДопустимыСтрокиРазделовБезПриложений = Истина;
	
	ШапкаДокумента = ПараметрыПроцедуры.ШапкаДокумента;
	
	ВключатьОписи52н = Истина;
	ВключатьОписи61н = ПараметрыПроцедуры.ВключатьОписи61н;
	
	ТаблицаОбъекты = ПрочитатьТаблицуОбъектыРешения(ШапкаДокумента.РешениеОПроведенииИнвентаризации, ПараметрыПроцедуры);
	
	ИнвентаризацияСервер.ЗаполнитьИменаДокументовВТаблицеОбъектыРешения(ТаблицаОбъекты);
	
	ДополнительныеПараметры = ПолучитьДополнительныеПараметрыДляЗаполненияПоОписям();
	
	НастройкиВключенияОписей = ПолучитьНастройкиВключенияОписейВАвтозаполнениеАкта(ДополнительныеПараметры, ВключатьОписи52н, ВключатьОписи61н);
	
	Если НастройкиВключенияОписей.ВключатьДокументыПриказа52н Тогда
		ОпределитьМестаРегистрацииОписей52н(ШапкаДокумента, ТаблицаОбъекты, ДополнительныеПараметры, , НастройкиВключенияОписей);
	КонецЕсли;
	
	Если НастройкиВключенияОписей.ВключатьДокументыПриказа61н Тогда
		ОпределитьМестаРегистрацииОписей61н(ШапкаДокумента, ТаблицаОбъекты, ДополнительныеПараметры, , НастройкиВключенияОписей);
	КонецЕсли;
	
	МестаРегистрацииОписей = ПолучитьПустуюТаблицуМестаРегистрацииОписей();
	
	Если НастройкиВключенияОписей.ВключатьДокументыПриказа52н Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеПараметры.Описи52н.МестаРегистрацииОписей, МестаРегистрацииОписей);
	КонецЕсли;
	
	Если НастройкиВключенияОписей.ВключатьДокументыПриказа61н Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеПараметры.Описи61н.РезультатыРасчета.МестаРегистрацииОписей, МестаРегистрацииОписей);
	КонецЕсли;
	
	Данные = ПолучитьПустуюСтруктуруДанныхДляЗаполненияПоОписям();
	
	Если НастройкиВключенияОписей.ВключатьДокументыПриказа52н Тогда
		ДобавитьДанныеОписей(Данные,
			ДополнительныеПараметры.Описи52н.ТаблицыОписей,
			ДополнительныеПараметры.Описи52н.МестаРегистрацииОписей,
			ДополнительныеПараметры);
	КонецЕсли;
	
	Если НастройкиВключенияОписей.ВключатьДокументыПриказа61н Тогда
		ДобавитьДанныеОписей(Данные,
			ДополнительныеПараметры.Описи61н.ТаблицыОписей,
			ДополнительныеПараметры.Описи61н.РезультатыРасчета.МестаРегистрацииОписей,
			ДополнительныеПараметры);
	КонецЕсли;
	
	Если Не ДопустимыСтрокиРазделовБезПриложений Тогда
		УдалитьСтрокиРазделовБезПриложений(Данные, ДополнительныеПараметры);
	КонецЕсли;
	
	УпорядочитьРазделыАкта(Данные);
	
	ЗаполнитьКодыСтрокПриложенийПоИдентификатору(Данные.ТабличныеЧасти);
	
	УпорядочитьПриложенияАкта(Данные);
	
	ПоместитьВоВременноеХранилище(Данные, АдресРезультата);
	
КонецПроцедуры

#КонецОбласти

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0510463";
	КомандаПечати.Представление = НСтр("ru='Акт о результатах инвентаризации (ф. 0510463)'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0510463") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0510463",
			"Акт о результатах инвентаризации (ф.0510463)",
			ПечатьФормы0510463(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода));
	КонецЕсли;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
		//чтобы при программном открытии формы выбора установился режим выбора
		Параметры.Вставить("РежимВыбора", Истина);
		ВыбраннаяФорма = Метаданные.Документы.АктИнвентаризации.Формы.ФормаСписка;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКодыСтрокПриложенийРазделаПоИдентификатору(ДокументОбъект, НомерРаздела)
	
	Поиск = Новый Структура("ИдентификаторСтроки");
	
	ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
	
	ТЧРаздела = ДокументОбъект[ИмяТЧРаздела];
	
	НомерСтрокиРаздела = 0;
	
	Для Каждого СтрокаРаздела Из ТЧРаздела Цикл
		НомерСтрокиРаздела = НомерСтрокиРаздела + 1;
		
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаРаздела);
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
			
			МассивСтрок = ТЧПриложения.НайтиСтроки(Поиск);
			
			Счетчик = 0;
			
			Для Каждого СтрокаПриложения Из МассивСтрок Цикл
				Счетчик = Счетчик + 1;
				
				СтрокаПриложения.КодСтроки			= ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(НомерСтрокиРаздела, Счетчик);
				СтрокаПриложения.НомерСтрокиРаздела	= НомерСтрокиРаздела;
				СтрокаПриложения.ПорядковыйНомер	= Счетчик;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьРеквизитыОписи(ОписьСсылка)
	
	РеквизитыОписи = Новый Структура("
		|Опись,
		|НомерОписи,
		|ДатаОписи,
		|ОтветственноеЛицо,
		|КФО,
		|Счет,
		|ДатаИнвентаризации,
		|ДатаНачала,
		|ДатаОкончания,
		|МестоИнвентаризации");
	
	РеквизитыОписи.Опись = ОписьСсылка;
	
	Если Не ЗначениеЗаполнено(ОписьСсылка) Тогда
		Возврат РеквизитыОписи;
	КонецЕсли;
	
	ИменаРеквизитов = СтрРазделить("Номер,Дата,ДатаИнвентаризации,ДатаНачала,ДатаОкончания", ", ", Ложь);
	
	ТаблицаНастроек = ИнвентаризацияСервер.ПолучитьТаблицуНастроекЗаполненияОписейПоРешению(ТипЗнч(ОписьСсылка));
	
	СтрокаТаблицыНастроек = ТаблицаНастроек[0];
	
	ОписаниеРеквизитов = ИнвентаризацияСервер.ПолучитьОписаниеРасположенияРеквизитовОписи(СтрокаТаблицыНастроек);
	
	Если ОписаниеРеквизитов.Счет.РасположенВШапке Тогда
		ИменаРеквизитов.Добавить(ОписаниеРеквизитов.Счет.ИмяПоля);
	КонецЕсли;
	
	Если ОписаниеРеквизитов.КФО.РасположенВШапке Тогда
		ИменаРеквизитов.Добавить(ОписаниеРеквизитов.КФО.ИмяПоля);
	КонецЕсли;
	
	Если ОписаниеРеквизитов.Сотрудник.РасположенВШапке Тогда
		ИменаРеквизитов.Добавить(ОписаниеРеквизитов.Сотрудник.ИмяПоля);
	КонецЕсли;
	
	Если ОписаниеРеквизитов.МестоИнвентаризации.РасположенВШапке Тогда
		ИменаРеквизитов.Добавить(ОписаниеРеквизитов.МестоИнвентаризации.ИмяПоля);
	КонецЕсли;
	
	Свойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОписьСсылка, СтрСоединить(ИменаРеквизитов, ","));
	
	ЗаполнитьЗначенияСвойств(РеквизитыОписи, Свойства);
	
	РеквизитыОписи.НомерОписи = РегистрыСведений.НастройкиПечатиПрефиксаНомера.ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(
		ОписьСсылка,
		Свойства.Номер);
		
	РеквизитыОписи.ДатаОписи = Свойства.Дата;
	
	Если ОписаниеРеквизитов.Счет.РасположенВШапке Тогда
		РеквизитыОписи.Счет = Свойства[ОписаниеРеквизитов.Счет.ИмяПоля];
	КонецЕсли;
	
	Если ОписаниеРеквизитов.КФО.РасположенВШапке Тогда
		РеквизитыОписи.КФО = Свойства[ОписаниеРеквизитов.КФО.ИмяПоля];
	КонецЕсли;
	
	Если ОписаниеРеквизитов.Сотрудник.РасположенВШапке Тогда
		РеквизитыОписи.ОтветственноеЛицо = Свойства[ОписаниеРеквизитов.Сотрудник.ИмяПоля];
	КонецЕсли;
	
	Если ОписаниеРеквизитов.МестоИнвентаризации.РасположенВШапке Тогда
		РеквизитыОписи.МестоИнвентаризации = Свойства[ОписаниеРеквизитов.МестоИнвентаризации.ИмяПоля];
	КонецЕсли;
	
	Возврат РеквизитыОписи;
	
КонецФункции

Процедура ОбновитьСведенияОбОписиВПриложениях(ДокументОбъект, НомерРаздела, ИдентификаторСтроки, РеквизитыОписи)
	
	Поиск = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	
	Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
		
		ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
		
		ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
		
		МассивСтрок = ТЧПриложения.НайтиСтроки(Поиск);
		
		Для Каждого СтрокаПриложения Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(СтрокаПриложения, РеквизитыОписи);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКодФормыИНомерПриложения(ОписьСсылка, НомерРаздела, ДополнительныеПараметры)
	
	Результат = Новый Структура("КодФормы,НомерПриложения");
	
	ИмяДокумента = ПолучитьИмяДокумента(ОписьСсылка, ДополнительныеПараметры);
	
	Результат.КодФормы = ОпределитьКодФормыОписи(ИмяДокумента, ДополнительныеПараметры);
	
	Если ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) > 0 Тогда
		Результат.НомерПриложения = ОпределитьНомерПриложенияПоКодуФормы(ИмяДокумента, НомерРаздела, ДополнительныеПараметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьИндексТаблицы(НомераТаблиц, ИмяТаблицы, СдвигОтносительноПервогоПодзапроса = 0)
	
	ИндексТаблицы = НомераТаблиц.ПоследнийДобавленныйИндекс + 1 + СдвигОтносительноПервогоПодзапроса;
	
	НомераТаблиц.Вставить(ИмяТаблицы, ИндексТаблицы);
	
	НомераТаблиц.ПоследнийДобавленныйИндекс = ИндексТаблицы;
	
КонецПроцедуры

Процедура УпорядочитьИндексыПодзапросов(ТекстЗапроса)
	
	МаксимальнаяДлинаИндекса = 3; // в символах строки
	
	НачалоПоиска = "// [";
	ОкончаниеПоиска = "].";
	
	ДлинаНачалаПоиска = СтрДлина(НачалоПоиска);
	ДлинаОкончанияПоиска = СтрДлина(ОкончаниеПоиска);
	
	ТекущийИндекс = 0;
	
	Пока Истина Цикл
		ПозицияНачалаПоиска = СтрНайти(ТекстЗапроса, НачалоПоиска,,, ТекущийИндекс + 1);
		
		Если ПозицияНачалаПоиска = 0 Тогда
			// Завершились искомые символы
			Прервать;
		КонецЕсли;
		
		ПозицияОкончанияПоиска = СтрНайти(ТекстЗапроса, ОкончаниеПоиска,, ПозицияНачалаПоиска);
		
		Если ПозицияОкончанияПоиска = 0 Тогда
			// Ошибка форматирования исходной строки
			Прервать;
		КонецЕсли;
		
		ПозицияНачалаИндекса = ПозицияНачалаПоиска + ДлинаНачалаПоиска;
		ПозицияОкончанияИндекса = ПозицияОкончанияПоиска - 1;
		
		ДлинаИндекса = ПозицияОкончанияИндекса - ПозицияНачалаИндекса + 1;
		
		Если ДлинаИндекса > МаксимальнаяДлинаИндекса Тогда
			// Ошибка форматирования исходной строки
			Прервать;
		КонецЕсли;
		
		ТекстИндекса = Сред(ТекстЗапроса, ПозицияНачалаИндекса, ДлинаИндекса);
		
		Если Не ОбщегоНазначенияКлиентСервер.ЭтоЧисло(ТекстИндекса) Тогда
			// Ошибка форматирования исходной строки
			Прервать;
		КонецЕсли;
		
		ТекстЗапроса = Лев(ТекстЗапроса, ПозицияНачалаИндекса - 1) + Формат(ТекущийИндекс, "ЧГ=;ЧН=") + Сред(ТекстЗапроса, ПозицияОкончанияИндекса + 1);
		
		ТекущийИндекс = ТекущийИндекс + 1;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДополнительныеПараметрыДляЗаполненияПоОписям61н(ДополнительныеПараметры, ТаблицыОписей)
	
	РезультатыРасчета = Новый Структура();
	
	Описи61н = Новый Структура();
	Описи61н.Вставить("ТаблицыОписей",					ТаблицыОписей);
	Описи61н.Вставить("РезультатыРасчета",				РезультатыРасчета);
	Описи61н.Вставить("СтатусыЗадолженностиНеАктив",	ПолучитьСтатусыЗадолженностиНеАктив0510468());
	
	ДополнительныеПараметры.Вставить("Описи61н", Описи61н);
	
КонецПроцедуры

Функция ОпределитьИмяДокумента(Опись, ДополнительныеПараметры)
	
	Возврат ДополнительныеПараметры.НастройкиИзТаблицыНастроекЗаполненияОписейПоРешению.СоответствиеТипДокументаИмяДокумента.Получить(ТипЗнч(Опись));
	
КонецФункции

Функция ПодготовитьНастройкиИзТаблицыНастроекЗаполненияОписейПоРешению()
	
	ТаблицаНастроек = ИнвентаризацияСервер.ПолучитьТаблицуНастроекЗаполненияОписейПоРешению();
	
	Приказ52н = Новый Массив();
	Приказ61н = Новый Массив();
	СоответствиеТипДокументаИмяДокумента = Новый Соответствие();
	СоответствиеИмяДокументаОписаниеРасположенияРеквизитовОписи = Новый Соответствие();
	СоответствиеИмяДокументаИменаТаблицОтбора = Новый Соответствие();
	СоответствиеИмяДокументаИменаПрочитанныхТаблицВыявленныхОтклонений = Новый Соответствие();
	
	Для Каждого СтрокаТаблицыНастроек Из ТаблицаНастроек Цикл
		ИмяДокумента = СтрокаТаблицыНастроек.ИмяДокумента;
		
		Если СтрокаТаблицыНастроек.Приказ52н Тогда
			Приказ52н.Добавить(ИмяДокумента);
		КонецЕсли;
		
		Если СтрокаТаблицыНастроек.Приказ61н Тогда
			Приказ61н.Добавить(ИмяДокумента);
		КонецЕсли;
		
		СоответствиеТипДокументаИмяДокумента.Вставить(СтрокаТаблицыНастроек.ТипОписи, ИмяДокумента);
		
		ОписаниеРасположенияРеквизитовОписи = ИнвентаризацияСервер.ПолучитьОписаниеРасположенияРеквизитовОписи(СтрокаТаблицыНастроек);
		
		СоответствиеИмяДокументаОписаниеРасположенияРеквизитовОписи.Вставить(ИмяДокумента, ОписаниеРасположенияРеквизитовОписи);
		
		ИменаТаблицОтбора = Новый Массив();
		
		Для Каждого Элемент Из ОписаниеРасположенияРеквизитовОписи Цикл
			ИмяПоля			= Элемент.Ключ;
			ОписаниеПоля	= Элемент.Значение;
			
			Если ОписаниеПоля.РасположенВТабличнойЧасти И ИменаТаблицОтбора.Найти(ОписаниеПоля.ИмяТабличнойЧасти) = Неопределено Тогда
				ИменаТаблицОтбора.Добавить(ОписаниеПоля.ИмяТабличнойЧасти);
			КонецЕсли;
		КонецЦикла;
		
		СоответствиеИмяДокументаИменаТаблицОтбора.Вставить(ИмяДокумента, ИменаТаблицОтбора);
		
		СоответствиеИмяДокументаИменаПрочитанныхТаблицВыявленныхОтклонений.Вставить(ИмяДокумента, ПолучитьИменаПрочитанныхТаблицВыявленныхОтклоненийОписи61н(ИмяДокумента));
	КонецЦикла;
	
	ПринадлежностьИменДокументовПриказам = Новый Структура();
	ПринадлежностьИменДокументовПриказам.Вставить("Приказ52н", Приказ52н);
	ПринадлежностьИменДокументовПриказам.Вставить("Приказ61н", Приказ61н);
	
	Результат = Новый Структура();
	Результат.Вставить("ПринадлежностьИменДокументовПриказам", ПринадлежностьИменДокументовПриказам);
	Результат.Вставить("СоответствиеТипДокументаИмяДокумента", СоответствиеТипДокументаИмяДокумента);
	Результат.Вставить("СоответствиеИмяДокументаОписаниеРасположенияРеквизитовОписи", СоответствиеИмяДокументаОписаниеРасположенияРеквизитовОписи);
	Результат.Вставить("СоответствиеИмяДокументаИменаТаблицОтбора", СоответствиеИмяДокументаИменаТаблицОтбора);
	Результат.Вставить("СоответствиеИмяДокументаИменаПрочитанныхТаблицВыявленныхОтклонений", СоответствиеИмяДокументаИменаПрочитанныхТаблицВыявленныхОтклонений);
	
	Возврат Результат;
	
КонецФункции

#Область ЗаполнениеНаОсновании

Процедура ЗаполнитьНаОсновании_РешениеОПроведенииИнвентаризации(ДокументОбъект, ОснованиеСсылка)
	
	ОбобщенныеДанныеРешения = Документы.АктИнвентаризации.ПолучитьОбобщенныеДанныеРешения(ОснованиеСсылка);
	
	ТекстОшибки = ОбобщенныеДанныеРешения.ТекстОшибки;
	
	ЗначенияПараметров = Новый Структура("РешениеОПроведенииИнвентаризации,Организация,ДатаИнвентаризации,НомерКомиссии,Комиссия,ИФО,Подразделение");
	
	ЗначенияПараметров.РешениеОПроведенииИнвентаризации = ОбобщенныеДанныеРешения.Шапка.Решение;
	
	ЗаполнитьЗначенияСвойств(ЗначенияПараметров, ОбобщенныеДанныеРешения.Шапка, "Организация,ИФО,Подразделение");
	
	Если ОбобщенныеДанныеРешения.ЕдинственноеЗначение <> Неопределено Тогда
		Если ЗначениеЗаполнено(ОбобщенныеДанныеРешения.ЕдинственноеЗначение.ДатаИнвентаризации) Тогда
			ЗаполнитьЗначенияСвойств(ЗначенияПараметров, ОбобщенныеДанныеРешения.ЕдинственноеЗначение, "ДатаИнвентаризации");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбобщенныеДанныеРешения.ЕдинственноеЗначение.НомерКомиссии) Тогда
			ЗаполнитьЗначенияСвойств(ЗначенияПараметров, ОбобщенныеДанныеРешения.ЕдинственноеЗначение, "НомерКомиссии,Комиссия");
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияПараметров);
	
	Если ЗначениеЗаполнено(ЗначенияПараметров.Комиссия) Тогда
		ТаблицаСостава = ОбщегоНазначенияБГУ.ПрочитатьТаблицуСоставаКомиссии(ЗначенияПараметров.Комиссия, Истина);
		
		ДокументОбъект.СоставКомиссии.Загрузить(ТаблицаСостава);
		
		ДокументОбъект.ОтветственныйИсполнитель = РаботаСКомиссиями.ПолучитьОтветственногоИсполнителяКомиссии(
			ЗначенияПараметров.Комиссия,, ЗначенияПараметров.ДатаИнвентаризации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеНастройки

Функция КоличествоРазделов()
	
	Возврат 3;
	
КонецФункции

Функция КоличествоПриложенийКРазделу2()
	
	Возврат 10;
	
КонецФункции

Функция КоличествоПриложенийКРазделу3()
	
	Возврат 7;
	
КонецФункции

Функция ДопустимостьДобавленияСтрок()
	
	Результат = Новый Структура();
	
	ДопустимоДобавлениеСтрок = Новый Массив();
	
	ДопустимоДобавлениеСтрок.Добавить("Раздел1");
	ДопустимоДобавлениеСтрок.Добавить("Раздел2");
	ДопустимоДобавлениеСтрок.Добавить("Раздел3");
	
	ДопустимоДобавлениеСтрок.Добавить("Приложение1кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение2кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение3кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение4кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение5кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение6кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение7кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение8кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение9кРазделу2");
	ДопустимоДобавлениеСтрок.Добавить("Приложение10кРазделу2");
	
	ДопустимоДобавлениеСтрок.Добавить("Приложение1кРазделу3");
	ДопустимоДобавлениеСтрок.Добавить("Приложение2кРазделу3");
	ДопустимоДобавлениеСтрок.Добавить("Приложение3кРазделу3");
	ДопустимоДобавлениеСтрок.Добавить("Приложение4кРазделу3");
	ДопустимоДобавлениеСтрок.Добавить("Приложение5кРазделу3");
	ДопустимоДобавлениеСтрок.Добавить("Приложение6кРазделу3");
	ДопустимоДобавлениеСтрок.Добавить("Приложение7кРазделу3");
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ДопустимоДобавление = (ДопустимоДобавлениеСтрок.Найти(ИмяТЧРаздела) <> Неопределено);
		
		Результат.Вставить(ИмяТЧРаздела, ДопустимоДобавление);
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			ДопустимоДобавление = (ДопустимоДобавлениеСтрок.Найти(ИмяТЧПриложения) <> Неопределено);
			
			Результат.Вставить(ИмяТЧПриложения, ДопустимоДобавление);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция КодыФорм()
	
	Раздел1 = Новый Массив();
	Раздел1.Добавить("0504081");
	Раздел1.Добавить("0504082");
	Раздел1.Добавить("0504083");
	Раздел1.Добавить("0504084");
	Раздел1.Добавить("0504085");
	Раздел1.Добавить("0504086");
	Раздел1.Добавить("0504087");
	Раздел1.Добавить("0504089");
	Раздел1.Добавить("0504091");
	Раздел1.Добавить("0510464");
	Раздел1.Добавить("0510465");
	Раздел1.Добавить("0510466");
	Раздел1.Добавить("0510468");
	
	Раздел2 = Новый Соответствие();
	Раздел2.Вставить(1, "0504081");
	Раздел2.Вставить(2, "0504082,0510464");
	Раздел2.Вставить(3, "0504083");
	Раздел2.Вставить(4, "0504084");
	Раздел2.Вставить(5, "0504085");
	Раздел2.Вставить(6, "0504086,0510465");
	Раздел2.Вставить(7, "0504087,0510466");
	Раздел2.Вставить(8, "0504089");
	Раздел2.Вставить(9, "0504091,0510468");

	Раздел3 = Новый Соответствие();
	Раздел3.Вставить(1, "0504083");
	Раздел3.Вставить(2, "0504084");
	Раздел3.Вставить(3, "0504085");
	Раздел3.Вставить(4, "0504087,0510466");
	Раздел3.Вставить(5, "0504089");
	Раздел3.Вставить(6, "0504089");
	Раздел3.Вставить(7, "0504091,0510468");
	
	ДокументыОписей = Новый Структура();
	ДокументыОписей.Вставить("ИнвентаризацияЦенныхБумаг",						"0504081");
	ДокументыОписей.Вставить("ИнвентаризацияОстатковНаСчетах",					"0504082");
	ДокументыОписей.Вставить("ИнвентаризацияКредитовИЗаймов",					"0504083");
	ДокументыОписей.Вставить("ИнвентаризацияГосдолгаВЦенныхБумагах",			"0504084");
	ДокументыОписей.Вставить("ИнвентаризацияГосдолгаПоКредитамИГарантиям",		"0504085");
	ДокументыОписей.Вставить("ИнвентаризацияКассы",								"0504086");
	ДокументыОписей.Вставить("ИнвентаризацияИК",								"0504087");
	ДокументыОписей.Вставить("ИнвентаризацияМЗ",								"0504087");
	ДокументыОписей.Вставить("ИнвентаризацияОС",								"0504087");
	ДокументыОписей.Вставить("ИнвентаризацияРасчетовСКонтрагентами",			"0504089");
	ДокументыОписей.Вставить("ИнвентаризацияРасчетовПоПоступлениям",			"0504091");
	ДокументыОписей.Вставить("ИнвентаризационнаяОписьОстатковНаСчетах",			"0510464");
	ДокументыОписей.Вставить("ИнвентаризационнаяОписьБСО",						"0510465");
	ДокументыОписей.Вставить("ИнвентаризационнаяОписьНФА",						"0510466");
	ДокументыОписей.Вставить("ИнвентаризационнаяОписьРасчетовПоПоступлениям",	"0510468");
	ДокументыОписей.Вставить("УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям",	"0510468");
	
	Результат = Новый Структура();
	Результат.Вставить("Раздел1", Раздел1);
	Результат.Вставить("Раздел2", Раздел2);
	Результат.Вставить("Раздел3", Раздел3);
	Результат.Вставить("ДокументыОписей", ДокументыОписей);
	
	Возврат Результат;
	
КонецФункции

Функция НаименованияОписей()
	
	Результат = Новый Соответствие();
	Результат.Вставить("0504081", НСтр("ru='Инвентаризационная опись ценных бумаг'"));
	Результат.Вставить("0504082", НСтр("ru='Инвентаризационная опись остатков на счетах учета денежных средств'"));
	Результат.Вставить("0504083", НСтр("ru='Инвентаризационная опись задолженности по кредитам, займам (ссудам)'"));
	Результат.Вставить("0504084", НСтр("ru='Инвентаризационная опись состояния государственного долга Российской Федерации в ценных бумагах'"));
	Результат.Вставить("0504085", НСтр("ru='Инвентаризационная опись состояния государственного долга Российской Федерации по полученным кредитам и предоставленным гарантиям'"));
	Результат.Вставить("0504086", НСтр("ru='Инвентаризационная опись (сличительная ведомость) бланков строгой отчетности и денежных документов'"));
	Результат.Вставить("0504087", НСтр("ru='Инвентаризационная опись (сличительная ведомость) по объектам нефинансовых активов'"));
	Результат.Вставить("0504089", НСтр("ru='Инвентаризационная опись расчетов с покупателями, поставщиками и прочими дебиторами и кредиторами'"));
	Результат.Вставить("0504091", НСтр("ru='Инвентаризационная опись расчетов по поступлениям'"));
	Результат.Вставить("0510464", НСтр("ru='Инвентаризационная опись остатков на счетах учета денежных средств'"));
	Результат.Вставить("0510465", НСтр("ru='Инвентаризационная опись (сличительная ведомость) бланков строгой отчетности и денежных документов'"));
	Результат.Вставить("0510466", НСтр("ru='Инвентаризационная опись (сличительная ведомость) по объектам нефинансовых активов'"));
	Результат.Вставить("0510468", НСтр("ru='Инвентаризационная опись расчетов по поступлениям'"));
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиВидЗадолженности0504084()
	
	Результат = Новый Структура();
	
	Представления = Новый Соответствие();
	Представления.Вставить(1, НСтр("ru='внутренний долг'"));
	Представления.Вставить(2, НСтр("ru='внешний долг'"));
	Представления.Вставить(0, " ");
	
	ПорядокСпискаВыбора = Новый Массив();
	ПорядокСпискаВыбора.Добавить(1);
	ПорядокСпискаВыбора.Добавить(2);
	ПорядокСпискаВыбора.Добавить(0);
	
	Счета = Новый Структура();
	Счета.Вставить("ВнутреннийДолг", БухгалтерскийУчет.СписокСчетов("301.12"));
	Счета.Вставить("ВнешнийДолг", БухгалтерскийУчет.СписокСчетов("301.42"));
	
	Результат.Вставить("Представления", Представления);
	Результат.Вставить("ПорядокСпискаВыбора", ПорядокСпискаВыбора);
	Результат.Вставить("Счета", Счета);
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиВидЗадолженности0504085()
	
	Результат = Новый Структура();
	
	Представления = Новый Соответствие();
	Представления.Вставить(1, НСтр("ru='внутренний долг'"));
	Представления.Вставить(2, НСтр("ru='внешний долг'"));
	Представления.Вставить(0, " ");
	
	ПорядокСпискаВыбора = Новый Массив();
	ПорядокСпискаВыбора.Добавить(1);
	ПорядокСпискаВыбора.Добавить(2);
	ПорядокСпискаВыбора.Добавить(0);
	
	Счета = Новый Структура();
	Счета.Вставить("ВнутреннийДолг", БухгалтерскийУчет.СписокСчетов("301.21"));
	
	Результат.Вставить("Представления", Представления);
	Результат.Вставить("ПорядокСпискаВыбора", ПорядокСпискаВыбора);
	Результат.Вставить("Счета", Счета);
	
	Возврат Результат;
	
КонецФункции

Функция НастройкиВидДокумента0504086()
	
	Результат = Новый Структура();
	
	Представления = Новый Соответствие();
	Представления.Вставить(1, НСтр("ru='бланки строгой отчетности'"));
	Представления.Вставить(2, НСтр("ru='денежные документы'"));
	
	ПорядокСпискаВыбора = Новый Массив();
	ПорядокСпискаВыбора.Добавить(1);
	ПорядокСпискаВыбора.Добавить(2);
	
	Результат.Вставить("Представления", Представления);
	Результат.Вставить("ПорядокСпискаВыбора", ПорядокСпискаВыбора);
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаТиповОписейПоРазделам()
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("ИмяДокумента",				Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("ТипДокумента",				Новый ОписаниеТипов("Тип"));
	Таблица.Колонки.Добавить("УказываетсяВРазделе2",		Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("УказываетсяВРазделе3",		Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("НомераПриложенийКРазделу2",	Новый ОписаниеТипов("Массив"));
	Таблица.Колонки.Добавить("НомераПриложенийКРазделу3",	Новый ОписаниеТипов("Массив"));
	
	ТабличныеЧасти = Метаданные.Документы.АктИнвентаризации.ТабличныеЧасти;
	
	// Раздел 2
	УстановитьИспользованиеТиповОписейВРазделе(2, Таблица, ТабличныеЧасти);
	
	// Раздел 3
	УстановитьИспользованиеТиповОписейВРазделе(3, Таблица, ТабличныеЧасти);
	
	// Приложения к разделу 2
	УстановитьИспользованиеТиповОписейВПриложенияхКРазделу(2, Таблица, ТабличныеЧасти);
	
	// Приложения к разделу 3
	УстановитьИспользованиеТиповОписейВПриложенияхКРазделу(3, Таблица, ТабличныеЧасти);
	
	Возврат Таблица;
	
КонецФункции

Процедура УстановитьИспользованиеТиповОписейВРазделе(НомерРаздела, Таблица, ТабличныеЧасти)
	
	ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
	
	ИмяКолонки = "УказываетсяВРазделе" + Формат(НомерРаздела, "ЧГ=0");
	
	Типы = ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты.Опись.Тип.Типы();
	
	Поиск = Новый Структура();
	
	Для Каждого Тип Из Типы Цикл
		Поиск.Вставить("ТипДокумента", Тип);
		
		МассивСтрок = Таблица.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 0 Тогда
			МетаданныеОписи = Метаданные.НайтиПоТипу(Тип);
			
			СтрокаТаблицы = Таблица.Добавить();
			СтрокаТаблицы.ИмяДокумента = МетаданныеОписи.Имя;
			СтрокаТаблицы.ТипДокумента = Тип;
			СтрокаТаблицы.НомераПриложенийКРазделу2 = Новый Массив();
			СтрокаТаблицы.НомераПриложенийКРазделу3 = Новый Массив();
		Иначе
			СтрокаТаблицы = МассивСтрок[0];
		КонецЕсли;
		
		СтрокаТаблицы[ИмяКолонки] = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьИспользованиеТиповОписейВПриложенияхКРазделу(НомерРаздела, Таблица, ТабличныеЧасти)
	
	ИмяКолонки = "НомераПриложенийКРазделу" + Формат(НомерРаздела, "ЧГ=0");
	
	Поиск = Новый Структура();
	
	Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
		ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
		
		Реквизиты = ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
		
		Если Реквизиты.Найти("Опись") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Типы = Реквизиты.Опись.Тип.Типы();
		
		Для Каждого Тип Из Типы Цикл
			Поиск.Вставить("ТипДокумента", Тип);
			
			МассивСтрок = Таблица.НайтиСтроки(Поиск);
			
			Если МассивСтрок.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы = МассивСтрок[0];
			
			СтрокаТаблицы[ИмяКолонки].Добавить(НомерПриложения);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#Область ПолучениеНастроек

Функция НомераРазделовСПриложениями()
	
	НомераРазделов = Новый Массив();
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		Если ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НомераРазделов.Добавить(НомерРаздела);
		
	КонецЦикла;
	
	Возврат НомераРазделов;
	
КонецФункции

Функция ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела)
	
	Возврат СтрШаблон("Раздел%1", Формат(НомерРаздела, "ЧГ=0"));
	
КонецФункции

Функция ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела)
	
	Возврат СтрШаблон("Приложение%1кРазделу%2", Формат(НомерПриложения, "ЧГ=0"), Формат(НомерРаздела, "ЧГ=0"));
	
КонецФункции

Функция ПолучитьКоличествоПриложенийКРазделу(НомерРаздела)
	
	Если НомерРаздела = 2 Тогда
		Возврат КоличествоПриложенийКРазделу2();
		
	ИначеЕсли НомерРаздела = 3 Тогда
		Возврат КоличествоПриложенийКРазделу3();
		
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьНомерПриложенияПоКодуФормы(ИмяДокумента, НомерРаздела, ДополнительныеПараметры)
	
	КодФормы = ОпределитьКодФормыОписи(ИмяДокумента, ДополнительныеПараметры);
	
	ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
	
	КодыФормРаздела = ДополнительныеПараметры.КодыФорм[ИмяТЧРаздела];
	
	НомераПриложений = Новый Массив();
	
	Для Каждого Элемент Из КодыФормРаздела Цикл
		Если СтрРазделить(Элемент.Значение, ", ", Ложь).Найти(КодФормы) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НомераПриложений.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Если НомераПриложений.Количество() = 1 Тогда
		Возврат НомераПриложений[0];
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ОпределитьКодФормыОписи(ИмяДокумента, ДополнительныеПараметры)
	
	Если ЗначениеЗаполнено(ИмяДокумента) Тогда
		Возврат ДополнительныеПараметры.КодыФорм.ДокументыОписей[ИмяДокумента];
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИмяДокумента(ОписьСсылка, ДополнительныеПараметры)
	
	СтрокаТаблицы = ДополнительныеПараметры.ТаблицаНастроек.Найти(ТипЗнч(ОписьСсылка), "ТипДокумента");
	
	Если СтрокаТаблицы = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтрокаТаблицы.ИмяДокумента;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область НастройкаФормы

#Область ИнициализацияФормыДокумента

Процедура ИнициализироватьДопустимостьДобавленияСтрокТабличныхЧастей(ФормаДокумента)
	
	Элементы = ФормаДокумента.Элементы;
	
	ДопустимостьДобавленияСтрок = ДопустимостьДобавленияСтрок();
	
	Для Каждого Элемент Из ДопустимостьДобавленияСтрок Цикл
		
		ИмяТЧ = Элемент.Ключ;
		Допустимость = Элемент.Значение;
		
		ЭлементТаблицы = Элементы[ИмяТЧ];
		
		ЭлементТаблицы.ИзменятьСоставСтрок		= Допустимость;
		ЭлементТаблицы.ИзменятьПорядокСтрок		= Ложь;
		ЭлементТаблицы.ПоложениеКоманднойПанели	= ?(Допустимость, ПоложениеКоманднойПанелиЭлементаФормы.Авто, ПоложениеКоманднойПанелиЭлементаФормы.Нет);
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ИнициализироватьСписокВыбораКодФормы(ФормаДокумента)
	
	ШаблонПредставления = "%1 (%2)";
	
	НаименованияОписей = НаименованияОписей();
	
	КодыФорм = КодыФорм();
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ЭлементФормы = ФормаДокумента.Элементы[ИмяТЧРаздела + "КодФормы"];
		
		ЭлементФормы.СписокВыбора.Очистить();
		
		СписокКодов = КодыФорм[ИмяТЧРаздела];
		
		Для Каждого Элемент Из СписокКодов Цикл
			
			Если ТипЗнч(Элемент) = Тип("Строка") Тогда
				КодФормы = Элемент;
			Иначе
				КодФормы = Элемент.Значение;
			КонецЕсли;
			
			МассивКодов = СтрРазделить(КодФормы, ", ", Ложь);
			
			Для Каждого КодФормы Из МассивКодов Цикл
				Если ЭлементФормы.СписокВыбора.НайтиПоЗначению(КодФормы) <> Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				НаименованиеФормы = НаименованияОписей.Получить(КодФормы);
				
				Если НаименованиеФормы = Неопределено Тогда
					НаименованиеФормы = "";
				КонецЕсли;
				
				ЭлементФормы.СписокВыбора.Добавить(КодФормы, СтрШаблон(ШаблонПредставления, КодФормы, НаименованиеФормы));
			КонецЦикла;
			
		КонецЦикла;
		
		ЭлементФормы.СписокВыбора.СортироватьПоПредставлению();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьЭлементыКолонокОписей(ФормаДокумента)
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КнопкаВыпадающегоСписка", Ложь);
	ЗначенияПараметров.Вставить("КнопкаВыбора", Ложь);
	ЗначенияПараметров.Вставить("КнопкаОчистки", Ложь);
	ЗначенияПараметров.Вставить("КнопкаОткрытия", Истина);
	ЗначенияПараметров.Вставить("КнопкаСоздания", Ложь);
	ЗначенияПараметров.Вставить("ВыбиратьТип", Ложь);
	ЗначенияПараметров.Вставить("РедактированиеТекста", Ложь);
	ЗначенияПараметров.Вставить("ИсторияВыбораПриВводе", ИсторияВыбораПриВводе.НеИспользовать);
	ЗначенияПараметров.Вставить("АвтоОтображениеКнопкиОткрытия", РежимАвтоОтображенияКнопкиОткрытия.ТолькоДляЗаполненного);
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			ЭлементКолонкиОпись = ФормаДокумента.Элементы[ИмяТЧПриложения + "Опись"];
			
			ЗаполнитьЗначенияСвойств(ЭлементКолонкиОпись, ЗначенияПараметров);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьЭлементыКолонокЗаключенияКомиссииПоОписи(ФормаДокумента)
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КнопкаВыпадающегоСписка", Ложь);
	ЗначенияПараметров.Вставить("КнопкаВыбора", Истина);
	ЗначенияПараметров.Вставить("КнопкаОчистки", Ложь);
	ЗначенияПараметров.Вставить("КнопкаОткрытия", Ложь);
	ЗначенияПараметров.Вставить("КнопкаСоздания", Ложь);
	ЗначенияПараметров.Вставить("ВыбиратьТип", Ложь);
	ЗначенияПараметров.Вставить("РедактированиеТекста", Ложь);
	ЗначенияПараметров.Вставить("ИсторияВыбораПриВводе", ИсторияВыбораПриВводе.НеИспользовать);
	ЗначенияПараметров.Вставить("АвтоОтображениеКнопкиОткрытия", РежимАвтоОтображенияКнопкиОткрытия.ТолькоДляЗаполненного);
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			ЭлементКолонкиОпись = ФормаДокумента.Элементы[ИмяТЧПриложения + "ЗаключениеКомиссии"];
			
			ЗаполнитьЗначенияСвойств(ЭлементКолонкиОпись, ЗначенияПараметров);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСпискиВыбораКодаСтрокиПриложения(ТЧРаздела, ТЧПриложения, НомерПриложения, МаксимальныеНомера)
	
	// Список выбора для уже существующей строки приложения.
	
	СоответствиеСуществующаяСтрока = Новый Соответствие();
	
	Для Каждого ЭлементНомера Из МаксимальныеНомера Цикл
		НомерСтрокиРаздела	= ЭлементНомера.Ключ;
		МаксимальныйНомер	= ЭлементНомера.Значение;
		
		СписокВыбораСуществующаяСтрока = Новый СписокЗначений();
		
		Для Счетчик = 1 По МаксимальныйНомер Цикл
			СписокВыбораСуществующаяСтрока.Добавить(ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(НомерСтрокиРаздела, Счетчик));
		КонецЦикла;
		
		СоответствиеСуществующаяСтрока.Вставить(НомерСтрокиРаздела, СписокВыбораСуществующаяСтрока);
	КонецЦикла;
	
	// Список выбора для новой строки приложения.
	
	СписокВыбораНоваяСтрока = Новый СписокЗначений();
	
	Поиск = Новый Структура("НомерПриложения");
	Поиск.НомерПриложения = НомерПриложения;
	
	МассивСтрокРаздела = ТЧРаздела.НайтиСтроки(Поиск);
	
	Для Каждого СтрокаРаздела Из МассивСтрокРаздела Цикл
		НомерСтрокиРаздела = СтрокаРаздела.НомерСтроки;
		
		МаксимальныйНомер = МаксимальныеНомера.Получить(НомерСтрокиРаздела);
		
		Если МаксимальныйНомер = Неопределено Тогда
			МаксимальныйНомер = 0;
		КонецЕсли;
		
		ПорядковыйНомер = МаксимальныйНомер + 1;
		
		КодСтрокиПриложения = ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(НомерСтрокиРаздела, ПорядковыйНомер);
		
		Представление = СтрШаблон(НСтр("ru='%1 (опись №%2 от %3)'"),
			КодСтрокиПриложения,
			СтрокаРаздела.НомерОписи,
			Формат(СтрокаРаздела.ДатаОписи, "ДФ=дд.ММ.гггг"));
		
		СписокВыбораНоваяСтрока.Добавить(КодСтрокиПриложения, Представление);
	КонецЦикла;
	
	СпискиВыбора = Новый Структура();
	СпискиВыбора.Вставить("НоваяСтрока", СписокВыбораНоваяСтрока);
	СпискиВыбора.Вставить("СуществующаяСтрока", СоответствиеСуществующаяСтрока);
	
	Возврат СпискиВыбора;
	
КонецФункции

Процедура ИнициализироватьНастройкиКодовФорм(ФормаДокумента)
	
	НастройкиКодовФорм = КодыФорм();
	
	Соответствия = Новый Структура();
	Соответствия.Вставить("НомераПриложенийРаздела2", ПолучитьСоответствиеКодФормыНомераПриложений(НастройкиКодовФорм, 2));
	Соответствия.Вставить("НомераПриложенийРаздела3", ПолучитьСоответствиеКодФормыНомераПриложений(НастройкиКодовФорм, 3));
	
	ФормаДокумента.НастройкиКодовФорм = Новый ФиксированнаяСтруктура(Соответствия);
	
КонецПроцедуры

Функция ПолучитьСоответствиеКодФормыНомераПриложений(НастройкиКодовФорм, НомерРаздела)
	
	Результат = Новый Соответствие();
	
	ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
	
	Для Каждого Элемент Из НастройкиКодовФорм[ИмяТЧРаздела] Цикл
		НомерПриложения = Элемент.Ключ;
		
		КодыФорм = СтрРазделить(Элемент.Значение, ", ", Ложь);
		
		Для Каждого КодФормы Из КодыФорм Цикл
			Список = Результат.Получить(КодФормы);
			
			Если Список = Неопределено Тогда
				Список = Новый СписокЗначений();
				Результат.Вставить(КодФормы, Список);
			КонецЕсли;
			
			Список.Добавить(НомерПриложения);
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Процедура ИнициализироватьПриложение2КРазделу2(ФормаДокумента)
	
	Элементы = ФормаДокумента.Элементы;
	
	СписокСчетов = Документы.ИнвентаризацияОстатковНаСчетах.ПолучитьСписокСчетовПоУмолчанию(Ложь);
	
	ЭлементСчета = Элементы.Приложение2кРазделу2Счет;
	
	ЭлементСчета.РежимВыбораИзСписка = Истина;
	ЭлементСчета.СписокВыбора.Очистить();
	
	ЭлементСчета.СписокВыбора.Добавить(ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	
	Для Каждого Элемент Из СписокСчетов Цикл
		Для Каждого Счет Из Элемент.Значение Цикл
			ЭлементСчета.СписокВыбора.Добавить(Счет);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьПриложение4КРазделу2(ФормаДокумента)
	
	Элементы = ФормаДокумента.Элементы;
	
	ЭлементФормы = Элементы.Приложение4кРазделу2ВидЗадолженности;
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Настройки = НастройкиВидЗадолженности0504084();
	
	Для Каждого Код Из Настройки.ПорядокСпискаВыбора Цикл
		ЭлементФормы.СписокВыбора.Добавить(Код, Настройки.Представления.Получить(Код));
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьПриложение5КРазделу2(ФормаДокумента)
	
	Элементы = ФормаДокумента.Элементы;
	
	ЭлементФормы = Элементы.Приложение5кРазделу2ВидЗадолженности;
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Настройки = НастройкиВидЗадолженности0504085();
	
	Для Каждого Код Из Настройки.ПорядокСпискаВыбора Цикл
		ЭлементФормы.СписокВыбора.Добавить(Код, Настройки.Представления.Получить(Код));
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьПриложение6КРазделу2(ФормаДокумента)
	
	Элементы = ФормаДокумента.Элементы;
	
	ЭлементФормы = Элементы.Приложение6кРазделу2ВидДокумента;
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Настройки = НастройкиВидДокумента0504086();
	
	Для Каждого Код Из Настройки.ПорядокСпискаВыбора Цикл
		ЭлементФормы.СписокВыбора.Добавить(Код, Настройки.Представления.Получить(Код));
	КонецЦикла;
	
КонецПроцедуры


Процедура ИнициализироватьПриложение2КРазделу3(ФормаДокумента)
	
	Элементы = ФормаДокумента.Элементы;
	
	// Колонка Вид задолженности
	
	ЭлементФормы = Элементы.Приложение2кРазделу3ВидЗадолженности;
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Настройки = НастройкиВидЗадолженности0504084();
	
	Для Каждого Код Из Настройки.ПорядокСпискаВыбора Цикл
		ЭлементФормы.СписокВыбора.Добавить(Код, Настройки.Представления.Получить(Код));
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьПриложение3КРазделу3(ФормаДокумента)
	
	Элементы = ФормаДокумента.Элементы;
	
	// Колонка Вид задолженности
	
	Элементы = ФормаДокумента.Элементы;
	
	ЭлементФормы = Элементы.Приложение3кРазделу3ВидЗадолженности;
	
	ЭлементФормы.СписокВыбора.Очистить();
	
	Настройки = НастройкиВидЗадолженности0504085();
	
	Для Каждого Код Из Настройки.ПорядокСпискаВыбора Цикл
		ЭлементФормы.СписокВыбора.Добавить(Код, Настройки.Представления.Получить(Код));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСлужебныхКолонок

Процедура ЗаполнитьСлужебныеКолонки_КодСтроки(ФормаДокумента)
	
	ДокументОбъект = ФормаДокумента.Объект;
	
	Для Каждого НомерРаздела Из НомераРазделовСПриложениями() Цикл
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];

			Для Каждого СтрокаТаблицы Из ТЧПриложения Цикл
				
				СтрокаТаблицы.КодСтроки = ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(СтрокаТаблицы.НомерСтрокиРаздела, СтрокаТаблицы.ПорядковыйНомер);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонки_Приложение6кРазделу2(ФормаДокумента)
	
	ИмяТЧПриложения = "Приложение6кРазделу2";
	
	ДокументОбъект = ФормаДокумента.Объект;
	
	ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
	
	Сведения = ПрочитатьСведенияБСОиДД(ТЧПриложения);
	
	Для Каждого СтрокаТаблицы Из ТЧПриложения Цикл
		
		Если СтрокаТаблицы.ВидДокумента = 1 Тогда
			СтрокаТаблицы.ДокументВладелец = СтрокаТаблицы.БСО;
			СтрокаТаблицы.ДокументПодчиненный = СтрокаТаблицы.Серия;
			
			ДлинаНомера = Сведения.ДлиныНомеровБСО.Получить(СтрокаТаблицы.БСО);
			
			СтрокаТаблицы.ДлинаНомера = ДлинаНомера;
			
			НедостачаНачальныйНомерПредставление = ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(СтрокаТаблицы.НедостачаНачальныйНомер, ДлинаНомера);
			НедостачаКонечныйНомерПредставление = ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(СтрокаТаблицы.НедостачаКонечныйНомер, ДлинаНомера);
			ИзлишекНачальныйНомерПредставление = ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(СтрокаТаблицы.ИзлишекНачальныйНомер, ДлинаНомера);
			ИзлишекКонечныйНомерПредставление = ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(СтрокаТаблицы.ИзлишекКонечныйНомер, ДлинаНомера);
			
		ИначеЕсли СтрокаТаблицы.ВидДокумента = 2 Тогда
			СтрокаТаблицы.ДокументВладелец = СтрокаТаблицы.ВидДенежногоДокумента;
			СтрокаТаблицы.ДокументПодчиненный = СтрокаТаблицы.ДенежныйДокумент;
			
			СведенияДД = Сведения.СведенияДенежныхДокументов.Получить(СтрокаТаблицы.ДенежныйДокумент);
			
			Если СведенияДД <> Неопределено Тогда
				НомерДД = СведенияДД.Номер;
				НомСтоимость = СведенияДД.НомСтоимость;
			Иначе
				НомерДД = "";
				НомСтоимость = 0;
			КонецЕсли;
			
			СтрокаТаблицы.НомерДенежногоДокумента = НомерДД;
			СтрокаТаблицы.НомСтоимость = НомСтоимость;
			
			НедостачаНомерПредставление = ?(СтрокаТаблицы.НедостачаКоличество = 0 И СтрокаТаблицы.НедостачаСумма = 0, "", НомерДД);
			ИзлишекНомерПредставление = ?(СтрокаТаблицы.ИзлишекКоличество = 0 И СтрокаТаблицы.ИзлишекСумма = 0, "", НомерДД);
			
			НедостачаНачальныйНомерПредставление = НедостачаНомерПредставление;
			НедостачаКонечныйНомерПредставление = НедостачаНомерПредставление;
			ИзлишекНачальныйНомерПредставление = ИзлишекНомерПредставление;
			ИзлишекКонечныйНомерПредставление = ИзлишекНомерПредставление;
			
		Иначе
			НедостачаНачальныйНомерПредставление = Формат(НедостачаНачальныйНомерПредставление, "ЧГ=;ЧН=");
			НедостачаКонечныйНомерПредставление = Формат(НедостачаКонечныйНомерПредставление, "ЧГ=;ЧН=");
			ИзлишекНачальныйНомерПредставление = Формат(ИзлишекНачальныйНомерПредставление, "ЧГ=;ЧН=");
			ИзлишекКонечныйНомерПредставление = Формат(ИзлишекКонечныйНомерПредставление, "ЧГ=;ЧН=");
		КонецЕсли;
		
		СтрокаТаблицы.НедостачаНачальныйНомерПредставление = НедостачаНачальныйНомерПредставление;
		СтрокаТаблицы.НедостачаКонечныйНомерПредставление = НедостачаКонечныйНомерПредставление;
		СтрокаТаблицы.ИзлишекНачальныйНомерПредставление = ИзлишекНачальныйНомерПредставление;
		СтрокаТаблицы.ИзлишекКонечныйНомерПредставление = ИзлишекКонечныйНомерПредставление;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонки_Приложение7кРазделу2(ФормаДокумента, ДополнительныеПараметры)
	
	ИмяТЧПриложения = "Приложение7кРазделу2";
	
	СчетаУстановкиКоличестваПоУмолчанию = ДополнительныеПараметры.СчетаУстановкиКоличестваПоУмолчанию;
	
	ТипОС = Тип("СправочникСсылка.ОсновныеСредства");
	
	ТипНоменклатура = Тип("СправочникСсылка.Номенклатура");
	
	ДокументОбъект = ФормаДокумента.Объект;
	
	ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
	
	Для Каждого СтрокаТаблицы Из ТЧПриложения Цикл
		СтрокаТаблицы.ТипНфаОС = (ТипЗнч(СтрокаТаблицы.НФА) = ТипОС);
		
		СтрокаТаблицы.ТипНфаНоменклатура = (ТипЗнч(СтрокаТаблицы.НФА) = ТипНоменклатура);
		
		СтрокаТаблицы.ЭтоСчетУстановкиКоличестваПоУмолчанию = (СчетаУстановкиКоличестваПоУмолчанию.Найти(СтрокаТаблицы.Счет) <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонки_Приложение4кРазделу3(ФормаДокумента, ДополнительныеПараметры)
	
	ИмяТЧПриложения = "Приложение4кРазделу3";
	
	СчетаУстановкиКоличестваПоУмолчанию = ДополнительныеПараметры.СчетаУстановкиКоличестваПоУмолчанию;
	
	ТипОС = Тип("СправочникСсылка.ОсновныеСредства");
	
	ТипНоменклатура = Тип("СправочникСсылка.Номенклатура");
	
	ДокументОбъект = ФормаДокумента.Объект;
	
	ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
	
	Для Каждого СтрокаТаблицы Из ТЧПриложения Цикл
		СтрокаТаблицы.ТипНфаОС = (ТипЗнч(СтрокаТаблицы.НФА) = ТипОС);
		
		СтрокаТаблицы.ТипНфаНоменклатура = (ТипЗнч(СтрокаТаблицы.НФА) = ТипНоменклатура);
		
		СтрокаТаблицы.ЭтоСчетУстановкиКоличестваПоУмолчанию = (СчетаУстановкиКоличестваПоУмолчанию.Найти(СтрокаТаблицы.Счет) <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры

Функция ПрочитатьСведенияБСОиДД(ТЧПриложения)
	
	СписокБСО = Новый Массив();
	СписокДД = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из ТЧПриложения Цикл
		БСО = СтрокаТаблицы.БСО;
		ДД = СтрокаТаблицы.ДенежныйДокумент;
		
		Если ЗначениеЗаполнено(БСО) И СписокБСО.Найти(БСО) = Неопределено Тогда
			СписокБСО.Добавить(БСО);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДД) И СписокДД.Найти(ДД) = Неопределено Тогда
			СписокДД.Добавить(ДД);
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("ДлиныНомеровБСО", ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокБСО, "ДлинаНомера"));
	Результат.Вставить("СведенияДенежныхДокументов", ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СписокДД, "Номер,НомСтоимость"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область УсловноеОформление

Процедура УстановитьУсловноеОформление(ФормаДокумента)
	
	ФормаДокумента.УсловноеОформление.Элементы.Очистить();
	
	// Разделы
	
	ДобавитьУсловноеОформление_НомерДатаОписиВРазделах(ФормаДокумента);
	
	ДобавитьУсловноеОформление_КФО0(ФормаДокумента);
	
	ДобавитьУсловноеОформление_БлокировкаКолонокРазделов(ФормаДокумента);
	
	// Приложения 
	
	ДобавитьУсловноеОформление_БлокировкаКолонокПриложений(ФормаДокумента);
	
	ДобавитьУсловноеОформление_НомерДатаОписиВПриложениях(ФормаДокумента);
	
	ДобавитьУсловноеОформление_ОтметкаНезаполненногоКодСтроки(ФормаДокумента);
	
	ДобавитьУсловноеОформление_Приложение1кРазделу2(ФормаДокумента);
	ДобавитьУсловноеОформление_Приложение2кРазделу2(ФормаДокумента);
	ДобавитьУсловноеОформление_Приложение4кРазделу2(ФормаДокумента);
	ДобавитьУсловноеОформление_Приложение5кРазделу2(ФормаДокумента);
	ДобавитьУсловноеОформление_Приложение6кРазделу2(ФормаДокумента);
	ДобавитьУсловноеОформление_Приложение7кРазделу2(ФормаДокумента);
	
 	ДобавитьУсловноеОформление_Приложение2кРазделу3(ФормаДокумента);
 	ДобавитьУсловноеОформление_Приложение3кРазделу3(ФормаДокумента);
	ДобавитьУсловноеОформление_Приложение4кРазделу3(ФормаДокумента);
	
	ИнвентаризацияСервер.ДобавитьУсловноеОформлениеСоставКомиссииПричинаОтсутствия(ФормаДокумента);
	
КонецПроцедуры

Функция ПолучитьИменаЭлементовБлокируемыхКолонокРазделов()
	
	Результат = Новый Структура();
	
	Результат.Вставить("Раздел1", Новый Структура("
		|НомерОписи,
		|ДатаОписи,
		|КодФормы,
		|ОтветственноеЛицо,
		|КФО,
		|Счет,
		|ДатаИнвентаризации,
		|ДатаНачала,
		|ДатаОкончания,
		|МестоИнвентаризации,
		|Примечание"));

	Результат.Вставить("Раздел2", Новый Структура("
		|НомерОписи,
		|ДатаОписи,
		|КодФормы,
		|ОтветственноеЛицо,
		|КФО,
		|Счет,
		|ДатаИнвентаризации,
		|ДатаНачала,
		|ДатаОкончания,
		|МестоИнвентаризации,
		|Примечание,
		|НомерПриложения"));
	
	Результат.Вставить("Раздел3", Новый Структура("
		|НомерОписи,
		|ДатаОписи,
		|КодФормы,
		|ОтветственноеЛицо,
		|КФО,
		|Счет,
		|ДатаИнвентаризации,
		|ДатаНачала,
		|ДатаОкончания,
		|МестоИнвентаризации,
		|Примечание,
		|НомерПриложения"));
	
	Возврат Результат;
	
КонецФункции
	
Функция ПолучитьИменаЭлементовБлокируемыхКолонокПриложений()
	
	Результат = Новый Структура();
	
	// Раздел 2
	
	Результат.Вставить("Приложение1кРазделу2", Новый Структура("
		|ВидЦеннойБумаги,
		|ЦеннаяБумага,
		|Валюта,
		|Курс,
		|Кратность,
		|КоличествоНедостача,
		|КоличествоИзлишки,
		|НоминальнаяСтоимостьНедостача,
		|НоминальнаяСтоимостьВалютнаяНедостача,
		|НоминальнаяСтоимостьИзлишки,
		|НоминальнаяСтоимостьВалютнаяИзлишки,
		|КурсНаДатуВалютирования,
		|КратностьНаДатуВалютирования,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение2кРазделу2", Новый Структура("
		|КФО,
		|Счет,
		|ЛицевойСчет,
		|РазделЛицевогоСчета,
		|РеквизитыЛицевогоСчета,
		|КассовыйОрган,
		|НомерЛицевогоСчета,
		|Валюта,
		|Курс,
		|Кратность,
		|СуммаОтклоненийВалютная,
		|СуммаОтклонений,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
		
	Результат.Вставить("Приложение3кРазделу2", Новый Структура("
		|НаименованиеЗадолженности,
		|Контрагент,
		|Договор,
		|Счет,
		|КФО,
		|КПС,
		|Валюта,
		|СуммаОДНеподтвержденнаяВалютная,
		|СуммаОДНеподтвержденная,
		|СуммаПроцентовНеподтвержденнаяВалютная,
		|СуммаПроцентовНеподтвержденная,
		|СуммаШтрафовНеподтвержденнаяВалютная,
		|СуммаШтрафовНеподтвержденная,
		|СуммаПенейНеподтвержденнаяВалютная,
		|СуммаПенейНеподтвержденная,
		|СуммаИтогоНеподтвержденная,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));

	Результат.Вставить("Приложение4кРазделу2", Новый Структура("
		|ВидЗадолженности,
		|Договор,
		|Счет,
		|КФО,
		|КПС,
		|Валюта,
		|СуммаОДНеподтвержденнаяВалютная,
		|СуммаОДНеподтвержденная,
		|СуммаПроцентовНеподтвержденнаяВалютная,
		|СуммаПроцентовНеподтвержденная,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение5кРазделу2", Новый Структура("
		|ВидЗадолженности,
		|Контрагент,
		|Договор,
		|ЗаемщикПоГарантии,
		|Счет,
		|КФО,
		|КПС,
		|Валюта,
		|СуммаОДНеподтвержденнаяВалютная,
		|СуммаОДНеподтвержденная,
		|СуммаПроцентовНеподтвержденнаяВалютная,
		|СуммаПроцентовНеподтвержденная,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));

	Результат.Вставить("Приложение6кРазделу2", Новый Структура("
		|ВидДокумента,
		|ДокументПодчиненный,
		|ДокументВладелец,
		|НедостачаКоличество,
		|НедостачаСумма,
		|ИзлишекКоличество,
		|ИзлишекСумма,
		|НедостачаКонечныйНомерПредставление,
		|ИзлишекНачальныйНомерПредставление,
		|ИзлишекКонечныйНомерПредставление,
		|НедостачаНачальныйНомерПредставление,
		|ИдентификаторСтроки,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение7кРазделу2", Новый Структура("
		|НФА,
		|НомерОбъекта,
		|ИнвентарныйНомер,
		|Субконто3,
		|ЕдИзм,
		|КФО,
		|Счет,
		|КПС,
		|НедостачаКоличество,
		|НедостачаСумма,
		|ИзлишекКоличество,
		|ИзлишекСумма,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));

	Результат.Вставить("Приложение8кРазделу2", Новый Структура("
		|ВидРасчетов,
		|Контрагент,
		|Договор,
		|КФО,
		|Счет,
		|КПС,
		|КЭК,
		|ВидЗадолженности,
		|СуммаОтклонений,
		|ИдентификаторСтроки,
		|СуммаОтклоненийДЗ,
		|СуммаОтклоненийКЗ,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение9кРазделу2", Новый Структура("
		|Контрагент,
		|Договор,
		|Счет,
		|КПС,
		|КЭК,
		|КФО,
		|СуммаОтклонений,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение10кРазделу2", Новый Структура("
		|Контрагент,
		|Договор,
		|КФО,
		|Счет,
		|КПС,
		|СуммаОтклонений,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	// Раздел 3
	
	Результат.Вставить("Приложение1кРазделу3", Новый Структура("
		|НаименованиеЗадолженности,
		|Контрагент,
		|Договор,
		|Счет,
		|КФО,
		|КПС,
		|Валюта,
		|СуммаОДПросроченнаяВалютная,
		|СуммаОДПросроченная,
		|СуммаПроцентовПросроченнаяВалютная,
		|СуммаПроцентовПросроченная,
		|СуммаШтрафовПросроченнаяВалютная,
		|СуммаШтрафовПросроченная,
		|СуммаПенейПросроченнаяВалютная,
		|СуммаПенейПросроченная,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение2кРазделу3", Новый Структура("
		|ВидЗадолженности,
		|Договор,
		|Счет,
		|КФО,
		|КПС,
		|Валюта,
		|СуммаОДПросроченнаяВалютная,
		|СуммаОДПросроченная,
		|СуммаПроцентовПросроченнаяВалютная,
		|СуммаПроцентовПросроченная,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение3кРазделу3", Новый Структура("
		|ВидЗадолженности,
		|Контрагент,
		|Договор,
		|ЗаемщикПоГарантии,
		|Счет,
		|КФО,
		|КПС,
		|Валюта,
		|СуммаОДПросроченнаяВалютная,
		|СуммаОДПросроченная,
		|СуммаПроцентовПросроченнаяВалютная,
		|СуммаПроцентовПросроченная,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение4кРазделу3", Новый Структура("
		|НФА,
		|НомерОбъекта,
		|ИнвентарныйНомер,
		|Субконто3,
		|ЕдИзм,
		|КФО,
		|Счет,
		|КПС,
		|КоличествоНеСоответствует,
		|СуммаНеСоответствует,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение5кРазделу3", Новый Структура("
		|ВидРасчетов,
		|Контрагент,
		|Договор,
		|КФО,
		|Счет,
		|КПС,
		|КЭК,
		|СуммаОтклонений,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение6кРазделу3", Новый Структура("
		|ВидРасчетов,
		|Контрагент,
		|Договор,
		|КФО,
		|Счет,
		|КПС,
		|КЭК,
		|СуммаОтклонений,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Результат.Вставить("Приложение7кРазделу3", Новый Структура("
		|Контрагент,
		|Договор,
		|Счет,
		|КПС,
		|КЭК,
		|КФО,
		|СуммаОтклонений,
		|ДатаОписи,
		|НомерОписи,
		|КодСтроки"));
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьУсловноеОформление_БлокировкаКолонокРазделов(ФормаДокумента)
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Блокировка колонок раздела (для автоматически добавленных строк) (%1)'");
	
	ИменаЭлементов = ПолучитьИменаЭлементовБлокируемыхКолонокРазделов();
	
	Для Каждого ЭлементТЧ Из ИменаЭлементов Цикл
		
		ИмяТЧ			= ЭлементТЧ.Ключ;
		СтруктураИмен	= ЭлементТЧ.Значение;
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ДобавленоВручную");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Ложь;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

		// Оформляемые поля
		Для Каждого Элемент Из СтруктураИмен Цикл
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + Элемент.Ключ);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_КФО0(ФормаДокумента)
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Представление КФО 0 (%1)'");
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		ИмяТЧ = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".КФО");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "КФО");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_БлокировкаКолонокПриложений(ФормаДокумента)
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Блокировка колонок приложения (для автоматически добавленных строк) (%1)'");
	
	ИменаЭлементов = ПолучитьИменаЭлементовБлокируемыхКолонокПриложений();
	
	Для Каждого ЭлементТЧ Из ИменаЭлементов Цикл
		
		ИмяТЧ			= ЭлементТЧ.Ключ;
		СтруктураИмен	= ЭлементТЧ.Значение;
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ДобавленоВручную");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Ложь;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

		// Оформляемые поля
		Для Каждого Элемент Из СтруктураИмен Цикл
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + Элемент.Ключ);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_НомерДатаОписиВРазделах(ФормаДокумента)
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Блокировка номера и даты описи при заполненной описи в разделе (%1)'");
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧРаздела);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧРаздела + ".Опись");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧРаздела + "НомерОписи");
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧРаздела + "ДатаОписи");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_НомерДатаОписиВПриложениях(ФормаДокумента)
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблонНомерОписи = НСтр("ru='Незаполненный номер описи в приложении (%1)'");
	ПредставлениеШаблонДатаОписи = НСтр("ru='Незаполненная дата описи в приложении (%1)'");
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		ТекстШаблон = НСтр("ru='см.раздел %1'");
		
		Текст = СтрШаблон(ТекстШаблон, НомерРаздела);
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			//
			// Номер описи
			//
			
			ЭлементУО = УсловноеОформление.Элементы.Добавить();
			ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблонНомерОписи, ИмяТЧПриложения);

			// Условия
			Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧПриложения + ".НомерОписи");
			Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧПриложения + ".ИдентификаторСтроки");
			Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			
			// Оформление
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Текст);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

			// Оформляемые поля
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧПриложения + "НомерОписи");
			
			//
			// Дата описи
			//
			
			ЭлементУО = УсловноеОформление.Элементы.Добавить();
			ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблонДатаОписи, ИмяТЧПриложения);

			// Условия
			Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧПриложения + ".ДатаОписи");
			Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧПриложения + ".ИдентификаторСтроки");
			Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
			
			// Оформление
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Текст);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

			// Оформляемые поля
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧПриложения + "ДатаОписи");
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_ОтметкаНезаполненногоКодСтроки(ФормаДокумента)
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Отметка незаполненного кода строки в приложении (%1)'");
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			//
			// Незаполнен НомерСтрокиРаздела
			//
			
			ЭлементУО = УсловноеОформление.Элементы.Добавить();
			ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧПриложения);

			// Условия
			Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧПриложения + ".НомерСтрокиРаздела");
			Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			// Оформление
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

			// Оформляемые поля
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧПриложения + "КодСтроки");
			
			//
			// Незаполнен ПорядковыйНомер
			//
			
			ЭлементУО = УсловноеОформление.Элементы.Добавить();
			ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧПриложения);

			// Условия
			Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧПриложения + ".ПорядковыйНомер");
			Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			// Оформление
			ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

			// Оформляемые поля
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧПриложения + "КодСтроки");
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ДобавитьУсловноеОформление_Приложение1кРазделу2(ФормаДокумента)
	
	ИмяТЧ = "Приложение1кРазделу2";
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	//---
	// надпись "на дату инвентаризации"
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись ""на дату инвентаризации"" (%1)'"));

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='на дату инвентаризации:'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЗаголовокНаДатуИнвентаризации");
	
	
	//---
	// надпись "на дату валютирования"
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись ""на дату валютирования"" (%1)'"));

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='на дату валютирования:'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЗаголовокНаДатуВалютирования");
	
	
	//---
	// надпись "количество"
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись ""количество"" (%1)'"));

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='количество:'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЗаголовокКоличество");
	
	
	//---
	// надпись "в рублях"
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись ""в рублях"" (%1)'"));

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях:'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЗаголовокВРублях");

	
	//---
	// надпись "в валюте"
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись ""в валюте"" (%1)'"));

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте:'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЗаголовокВВалюте");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение2кРазделу2(ФормаДокумента)
	
	ИмяТЧ = "Приложение2кРазделу2";
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Представление КФО 0 (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".КФО");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "КФО");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение4кРазделу2(ФормаДокумента)
	
	ИмяТЧ = "Приложение4кРазделу2";
	
	Настройки = НастройкиВидЗадолженности0504084();
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Представление колонки Вид задолженности (%1)'");
	
	Для Каждого Элемент Из Настройки.Представления Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ВидЗадолженности");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Элемент.Ключ;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Элемент.Значение);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ВидЗадолженности");
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение5кРазделу2(ФормаДокумента)
	
	ИмяТЧ = "Приложение5кРазделу2";
	
	Настройки = НастройкиВидЗадолженности0504085();
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Представление колонки Вид задолженности (%1)'");
	
	Для Каждого Элемент Из Настройки.Представления Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ВидЗадолженности");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Элемент.Ключ;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Элемент.Значение);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ВидЗадолженности");
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение6кРазделу2(ФормаДокумента)
	
	ИмяТЧ = "Приложение6кРазделу2";
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	//---
	// колонка ВидДокумента
	//---
	ПредставлениеШаблон = НСтр("ru='Представление колонки Вид документа (%1)'");
	
	Настройки = НастройкиВидДокумента0504086();
	
	Для Каждого Элемент Из Настройки.Представления Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ВидДокумента");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Элемент.Ключ;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Элемент.Значение);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ВидДокумента");
	КонецЦикла;
	
	
	//---
	// надпись "начальный №"
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""начальный №"" (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='начальный №, кол-во'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЗаголовокНомерНачальный");
	
	
	//---
	// надпись "конечный №"
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""конечный №"" (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".НомерСтроки");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='конечный №, сумма'"));

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЗаголовокНомерКонечный");
	
	
	//---
	// Редактирование номеров доступно только при виде документа "БСО"
	//---
	ПредставлениеШаблон = НСтр("ru='Редактирование номеров доступно только при виде документа ""БСО"" (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ВидДокумента");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = 1;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "НедостачаНачальныйНомерПредставление");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "НедостачаКонечныйНомерПредставление");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ИзлишекНачальныйНомерПредставление");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ИзлишекКонечныйНомерПредставление");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение7кРазделу2(ФормаДокумента)
	
	ИмяТЧ = "Приложение7кРазделу2";
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	//---
	// надпись "не применяется" для инвентарного номера
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""не применяется"" колонки Инвентарный номер для номенклатуры (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаОС");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ИнвентарныйНомер");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='не применяется'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ИнвентарныйНомер");
	
	
	//---
	// надпись "не применяется" для субконто 3
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""не применяется"" колонки Субконто3 для ОС (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаНоменклатура");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='не применяется'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "Субконто3");
	
	
	//---
	// Надпись "авто" для ед.изм. номенклатуры
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""авто"" для ед.изм. номенклатуры (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаНоменклатура");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='авто'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЕдИзм");
	
	
	//---
	// Надпись "авто" для ед.изм. ОС с авторасчетом ед.изм.
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""авто"" для ед.изм. ОС с авторасчетом ед.изм. (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаОС");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ЭтоСчетУстановкиКоличестваПоУмолчанию");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='авто'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЕдИзм");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение2кРазделу3(ФормаДокумента)
	
	ИмяТЧ = "Приложение2кРазделу3";
	
	Настройки = НастройкиВидЗадолженности0504084();
	
	ПредставлениеШаблон = НСтр("ru='Представление колонки Вид задолженности (%1)'");
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	Для Каждого Элемент Из Настройки.Представления Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ВидЗадолженности");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Элемент.Ключ;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Элемент.Значение);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ВидЗадолженности");
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение3кРазделу3(ФормаДокумента)
	
	ИмяТЧ = "Приложение3кРазделу3";
	
	Настройки = НастройкиВидЗадолженности0504085();
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ПредставлениеШаблон = НСтр("ru='Представление колонки Вид задолженности (%1)'");
	
	Для Каждого Элемент Из Настройки.Представления Цикл
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ВидЗадолженности");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Элемент.Ключ;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Элемент.Значение);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ВидЗадолженности");
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Приложение4кРазделу3(ФормаДокумента)
	
	ИмяТЧ = "Приложение4кРазделу3";
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	//---
	// надпись "не применяется" для инвентарного номера
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""не применяется"" колонки Инвентарный номер для номенклатуры (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаОС");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ИнвентарныйНомер");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='не применяется'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ИнвентарныйНомер");
	
	
	//---
	// надпись "не применяется" для субконто 3
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""не применяется"" колонки Субконто3 для ОС (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаНоменклатура");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='не применяется'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "Субконто3");
	
	
	//---
	// Надпись "авто" для ед.изм. номенклатуры
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""авто"" для ед.изм. номенклатуры (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаНоменклатура");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='авто'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЕдИзм");
	
	
	//---
	// Надпись "авто" для ед.изм. ОС с авторасчетом ед.изм.
	//---
	ПредставлениеШаблон = НСтр("ru='Надпись ""авто"" для ед.изм. ОС с авторасчетом ед.изм. (%1)'");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ТипНфаОС");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяТЧ + ".ЭтоСчетУстановкиКоличестваПоУмолчанию");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='авто'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "ЕдИзм");
	
КонецПроцедуры

#КонецОбласти

Процедура УдалитьНесопоставленныеСтрокиПриложенийРаздела(ДокументОбъект, НомерРаздела)
	
	Поиск = Новый Структура("ИдентификаторСтроки");
	
	ТЧРаздела = ДокументОбъект[ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела)];
	
	Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
		
		ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
		
		ТЧ = ДокументОбъект[ИмяТЧПриложения];
		
		КоличествоСтрок = ТЧ.Количество();
		
		Для Счетчик = 1 По КоличествоСтрок Цикл
			Индекс = КоличествоСтрок - Счетчик;
			
			СтрокаТаблицы = ТЧ[Индекс];
			
			ЗаполнитьЗначенияСвойств(Поиск, СтрокаТаблицы);
			
			МассивСтрок = ТЧРаздела.НайтиСтроки(Поиск);
			
			Если МассивСтрок.Количество() = 0 Тогда
				ТЧ.Удалить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область КодСтрокиПриложений

Функция ПолучитьМаксимальныеПорядковыеНомера(ТЧПриложения, ИсключитьСтрокуПриложения = Неопределено)
	
	СчетчикиПорядковыхНомеров = Новый Соответствие();
	
	Для Каждого СтрокаПриложения Из ТЧПриложения Цикл
		
		Если СтрокаПриложения = ИсключитьСтрокуПриложения Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиРаздела = СтрокаПриложения.НомерСтрокиРаздела;
		
		Счетчик = СчетчикиПорядковыхНомеров.Получить(НомерСтрокиРаздела);
		
		Если Счетчик = Неопределено Тогда
			Счетчик = 0;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
		СчетчикиПорядковыхНомеров.Вставить(НомерСтрокиРаздела, Счетчик);
		
	КонецЦикла;
	
	Возврат СчетчикиПорядковыхНомеров;
	
КонецФункции

Процедура РассчитатьПеремещенияСтрокПриложения(ФормаДокумента, ИмяТЧПриложения, ПараметрыУпорядочивания)
	
	Перем ТекущаяСтрокаПриложения;
	
	ПеремещениеСтрокПриложения = ФормаДокумента.ПеремещениеСтрокПриложения;
	
	ПеремещениеСтрокПриложения.Очистить();
	
	СчетчикиПорядковыхНомеров = Новый Соответствие();
	
	ЗаменыПорядковыхНомеров = Новый Массив();
	
	ТЧПриложения = ФормаДокумента.Объект[ИмяТЧПриложения];
	
	Если ПараметрыУпорядочивания <> Неопределено Тогда
		ТекущаяСтрокаПриложения = ТЧПриложения.НайтиПоИдентификатору(ПараметрыУпорядочивания.ИдТекущейСтрокиПриложения);
	КонецЕсли;
	
	Для Каждого СтрокаПриложения Из ТЧПриложения Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаПриложения.НомерСтрокиРаздела) Или Не ЗначениеЗаполнено(СтрокаПриложения.ПорядковыйНомер) Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиРаздела	= СтрокаПриложения.НомерСтрокиРаздела;
		ПорядковыйНомер		= СтрокаПриложения.ПорядковыйНомер;
		
		Счетчик = СчетчикиПорядковыхНомеров.Получить(НомерСтрокиРаздела);
		
		Если Счетчик = Неопределено Тогда
			Счетчик = 0;
		КонецЕсли;
		
		Если ПараметрыУпорядочивания <> Неопределено И ПараметрыУпорядочивания.ДобавленаНоваяСтрокаПриложения
			И СтрокаПриложения = ТекущаяСтрокаПриложения Тогда
			// Новую строку добавляем только в конец таблицы.
			
			МаксимальныйПорядковыйНомер = ФормаДокумента.КэшКодыСтрокПриложений.МаксимальныеПорядковыеНомера[ИмяТЧПриложения].Получить(НомерСтрокиРаздела);
			
			Если МаксимальныйПорядковыйНомер = Неопределено Тогда
				МаксимальныйПорядковыйНомер = 1;
			КонецЕсли;
			
			НовыйПорядковыйНомер = МаксимальныйПорядковыйНомер;// + 1;
		Иначе
			Счетчик = Счетчик + 1;
			
			СчетчикиПорядковыхНомеров.Вставить(НомерСтрокиРаздела, Счетчик);
			
			НовыйПорядковыйНомер = Счетчик;
		КонецЕсли;
		
		НоваяСтрока = ПеремещениеСтрокПриложения.Добавить();
		НоваяСтрока.НомерСтроки				= СтрокаПриложения.НомерСтроки;
		НоваяСтрока.НомерСтрокиРаздела		= НомерСтрокиРаздела;
		НоваяСтрока.ПорядковыйНомер			= ПорядковыйНомер;
		НоваяСтрока.НовыйПорядковыйНомер	= НовыйПорядковыйНомер;
		НоваяСтрока.ИдСтроки				= СтрокаПриложения.ПолучитьИдентификатор();
		
		Если ПараметрыУпорядочивания <> Неопределено И Не ПараметрыУпорядочивания.ДобавленаНоваяСтрокаПриложения
			И СтрокаПриложения = ТекущаяСтрокаПриложения
			И ПорядковыйНомер <> НовыйПорядковыйНомер Тогда
			// Изменение положения строки внутри группы строк для текущей строки раздела.
			
			ЗаменыПорядковыхНомеров.Добавить(НоваяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	ПеремещениеСтрокПриложения.Сортировать("НомерСтрокиРаздела,НовыйПорядковыйНомер");
	
	Если ЗаменыПорядковыхНомеров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПеремещенияТекущая = ЗаменыПорядковыхНомеров[0];
	
	// Если есть строки с такими же номерами, то меняем местами текущую строку с первой найденной строкой
	
	Поиск = Новый Структура("НомерСтрокиРаздела, ПорядковыйНомер");
	
	ЗаполнитьЗначенияСвойств(Поиск, СтрокаПеремещенияТекущая);
	
	МассивСтрок = ПеремещениеСтрокПриложения.НайтиСтроки(Поиск);
	
	СтрокаПеремещенияНовоеПоложение = Неопределено;
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл 
		Если СтрокаТаблицы = СтрокаПеремещенияТекущая Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПеремещенияНовоеПоложение = СтрокаТаблицы;
		
		Прервать;
	КонецЦикла;
	
	Если СтрокаПеремещенияНовоеПоложение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Перемещаем текущую строку
	
	ИндексПеремещенияТекущая		= ПеремещениеСтрокПриложения.Индекс(СтрокаПеремещенияТекущая);
	ИндексПеремещенияНовоеПоложение	= ПеремещениеСтрокПриложения.Индекс(СтрокаПеремещенияНовоеПоложение);
	
	Сдвиг = ИндексПеремещенияНовоеПоложение - ИндексПеремещенияТекущая;
	
	ПеремещениеСтрокПриложения.Сдвинуть(ИндексПеремещенияТекущая, Сдвиг);
	
	// Пересчитываем новые порядковые номера у всех последующих строк
	
	НачальныйИндексПересчета = Мин(ИндексПеремещенияТекущая, ИндексПеремещенияНовоеПоложение);
	
	НовыйПорядковыйНомер = Мин(СтрокаПеремещенияТекущая.НовыйПорядковыйНомер, СтрокаПеремещенияНовоеПоложение.НовыйПорядковыйНомер) - 1;
	
	НомерСтрокиРаздела = СтрокаПеремещенияТекущая.НомерСтрокиРаздела;
	
	Для Индекс = НачальныйИндексПересчета По ПеремещениеСтрокПриложения.Количество() - 1 Цикл
		НовыйПорядковыйНомер = НовыйПорядковыйНомер + 1;
		
		СтрокаПеремещения = ПеремещениеСтрокПриложения[Индекс];
		
		Если СтрокаПеремещения.НомерСтрокиРаздела <> НомерСтрокиРаздела Тогда
			Прервать;
		КонецЕсли;
		
		СтрокаПеремещения.НовыйПорядковыйНомер = НовыйПорядковыйНомер;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПереместитьСтрокиПриложения(ФормаДокумента, ИмяТЧПриложения, ПараметрыУпорядочивания = Неопределено)
	
	ПеремещениеСтрокПриложения = ФормаДокумента.ПеремещениеСтрокПриложения;
	
	ТЧПриложения = ФормаДокумента.Объект[ИмяТЧПриложения];

	Счетчик = 0;
	
	ПредыдущаяСтрокаТаблицы = Неопределено;
	
	Для Каждого СтрокаТаблицы Из ПеремещениеСтрокПриложения Цикл
		
		Счетчик = Счетчик + 1;
		
		СтрокаПриложения = ТЧПриложения.НайтиПоИдентификатору(СтрокаТаблицы.ИдСтроки);
		
		ИндексСтрокиПриложения = ТЧПриложения.Индекс(СтрокаПриложения);
		
		// Новый порядковый номер
		Если СтрокаТаблицы.ПорядковыйНомер <> СтрокаТаблицы.НовыйПорядковыйНомер Тогда
			НовыйКодСтроки = ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(СтрокаТаблицы.НомерСтрокиРаздела, СтрокаТаблицы.НовыйПорядковыйНомер);
			
			СтрокаПриложения.КодСтроки			= НовыйКодСтроки;
			СтрокаПриложения.НомерСтрокиРаздела	= СтрокаТаблицы.НомерСтрокиРаздела;
			СтрокаПриложения.ПорядковыйНомер	= СтрокаТаблицы.НовыйПорядковыйНомер;
		КонецЕсли;
		
		Сдвиг = Счетчик - (ИндексСтрокиПриложения + 1);
		
		Если Сдвиг = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТЧПриложения.Сдвинуть(ИндексСтрокиПриложения, Сдвиг);
		
		ПредыдущаяСтрокаТаблицы = СтрокаТаблицы;
		
	КонецЦикла;
	
	ПеремещениеСтрокПриложения.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеПоОписям

#Область ЗаполнениеПоВсемОписям

// Заполнение разделов и приложений по всем обнаруженным описям

Функция ПрочитатьТаблицуОбъектыРешения(РешениеСсылка, ПараметрыПроцедуры)
	
	ДанныеРешения = Документы.ИзменениеРешенияОПроведенииИнвентаризации.ПолучитьДанныеДляЗаполненияНаОсновании(РешениеСсылка, Неопределено);
	
	ТаблицаОбъекты = ДанныеРешения.ТаблицаОбъекты;
	
	Если ТаблицаОбъекты.Колонки.Найти("ТипИзменения") <> Неопределено Тогда
		УдалитьОтмененныеСтроки(ТаблицаОбъекты);
	КонецЕсли;
	
	КоличествоСтрок = ТаблицаОбъекты.Количество();
	
	// Отбор по дате инвентаризации и номеру комиссии.
	Для Счетчик = 1 По КоличествоСтрок Цикл
		Индекс = КоличествоСтрок - Счетчик;
		
		СтрокаТаблицы = ТаблицаОбъекты[Индекс];
		
		Если СтрокаТаблицы.ДатаИнвентаризации = ПараметрыПроцедуры.ШапкаДокумента.ДатаИнвентаризации
			И СтрокаТаблицы.НомерКомиссии = ПараметрыПроцедуры.ШапкаДокумента.НомерКомиссии Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаОбъекты.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
	Возврат ТаблицаОбъекты;
	
КонецФункции

Процедура УдалитьОтмененныеСтроки(ТаблицаОбъекты)
	
	ТипИзмененияОтмена = Перечисления.ТипыИзмененияСтрокиРешенияОПроведенииИнвентаризации.Отмена;
	
	КоличествоСтрок = ТаблицаОбъекты.Количество();
	
	Для Счетчик = 1 По КоличествоСтрок Цикл
		Индекс = КоличествоСтрок - Счетчик;
		
		СтрокаТаблицы = ТаблицаОбъекты[Индекс];
		
		Если СтрокаТаблицы.ТипИзменения = ТипИзмененияОтмена Тогда
			ТаблицаОбъекты.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПустуюСтруктуруДанныхДляЗаполненияПоОписям()
	
	Данные = Новый Структура();
	Данные.Вставить("ТабличныеЧасти", Новый Структура());
	Данные.Вставить("НесопоставленныеСтрокиОписей");
	
	// Разделы 1, 2, 3
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		Данные.ТабличныеЧасти.Вставить(ИмяТабличнойЧасти, ПолучитьПустуюТаблицуТабличнойЧасти(ИмяТабличнойЧасти));
	КонецЦикла;
	
	// Приложения к разделу 2
	
	НомерРаздела = 2;

	Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
		ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
		
		ПустаяТаблица = ПолучитьПустуюТаблицуТабличнойЧасти(ИмяТабличнойЧасти);
		
		ПустаяТаблица.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
		
		Данные.ТабличныеЧасти.Вставить(ИмяТабличнойЧасти, ПустаяТаблица);
	КонецЦикла;
	
	// Приложения к разделу 3
	
	НомерРаздела = 3;
	
	Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
		ИмяТабличнойЧасти = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
		
		ПустаяТаблица = ПолучитьПустуюТаблицуТабличнойЧасти(ИмяТабличнойЧасти);
		
		ПустаяТаблица.Колонки.Добавить("КодСтроки", Новый ОписаниеТипов("Строка"));
		
		Данные.ТабличныеЧасти.Вставить(ИмяТабличнойЧасти, ПустаяТаблица);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьПустуюТаблицуТабличнойЧасти(ИмяТабличнойЧасти)
	
	РеквизитыТЧ = Метаданные.Документы.АктИнвентаризации.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты;
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Реквизит Из РеквизитыТЧ Цикл
		Таблица.Колонки.Добавить(Реквизит.Имя, Новый ОписаниеТипов(Реквизит.Тип.Типы()));
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьДополнительныеПараметрыДляЗаполненияПоОписям()
	
	// Используется при добавлении строк в приложения
	ДобавленныеСтрокиОписей = Новый Соответствие();
	ДобавленныеСтрокиОписей.Вставить(2, Новый Массив());
	ДобавленныеСтрокиОписей.Вставить(3, Новый Массив());
	
	// Используется при добавлении строк в приложения
	СтрокиРазделовБезПриложения = Новый Соответствие();
	СтрокиРазделовБезПриложения.Вставить(2, Новый Массив());
	СтрокиРазделовБезПриложения.Вставить(3, Новый Массив());
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("КодыФорм", КодыФорм());
	ДополнительныеПараметры.Вставить("НастройкиИзТаблицыНастроекЗаполненияОписейПоРешению", ПодготовитьНастройкиИзТаблицыНастроекЗаполненияОписейПоРешению());
	
	ДополнительныеПараметры.Вставить("ДобавленныеСтрокиОписей",		ДобавленныеСтрокиОписей);
	ДополнительныеПараметры.Вставить("СтрокиРазделовБезПриложения",	СтрокиРазделовБезПриложения);
	
	ДополнительныеПараметры.Вставить("ИспользоватьУчетПоПодразделениям",	ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	ДополнительныеПараметры.Вставить("ИспользоватьУчетПоИФО",				ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Процедура ИсключитьСопоставленныеНомераСтрок(НесопоставленныеСтрокиОписей, ТаблицаОбъекты, Поиск)
	
	Для Каждого СтрокаТаблицыОбъекты Из ТаблицаОбъекты Цикл
		
		ТаблицаСопоставленияОписей = СтрокаТаблицыОбъекты.ТаблицаСопоставленияОписей;
		
		Для Каждого СопоставленнаяСтрока Из ТаблицаСопоставленияОписей Цикл
			ЗаполнитьЗначенияСвойств(Поиск, СопоставленнаяСтрока);
			
			МассивСтрок = НесопоставленныеСтрокиОписей.НайтиСтроки(Поиск);
			
			Если МассивСтрок.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого Элемент Из СопоставленнаяСтрока.НомераСтрок Цикл
				НомерСтроки = Элемент.Ключ;
				
				Для Каждого НесопоставленнаяСтрока Из МассивСтрок Цикл
					Если НесопоставленнаяСтрока.НомераСтрок.Получить(НомерСтроки) = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					НесопоставленнаяСтрока.НомераСтрок.Удалить(НомерСтроки);
				КонецЦикла;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДанныеОписей(Данные, ТаблицыОписей, МестаРегистрацииОписей, ДополнительныеПараметры)
	
	Параметры = ПолучитьПараметрыДобавленияОписиВПриложение();
	
	Для Каждого МестоРегистрацииОписи Из МестаРегистрацииОписей Цикл
		
		Опись = МестоРегистрацииОписи.Опись;
		
		ИмяДокумента = ОпределитьИмяДокумента(Опись, ДополнительныеПараметры);
		
		Для НомерРаздела = 1 По КоличествоРазделов() Цикл
			
			ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
			
			Если Не МестоРегистрацииОписи[ИмяТЧРаздела] Тогда
				Продолжить;
			КонецЕсли;
			
			// Для раздела 1 отсутствуют приложения.
			
			Если НомерРаздела = 1 Тогда
				Для Каждого СтрокаТаблицыОбъекты Из МестоРегистрацииОписи.МассивСтрокТаблицыОбъекты Цикл
					НоваяСтрокаРаздела = ДобавитьСтрокуОписиВРаздел(Данные, ИмяТЧРаздела, СтрокаТаблицыОбъекты, МестоРегистрацииОписи, ИмяДокумента, ДополнительныеПараметры);
				КонецЦикла;
				
				Продолжить;
			КонецЕсли;
			
			// Для разделов 2, 3 предусмотрены приложения.
			// Если одна строка Решения сопоставлена с несколькими строками описей из нескольких различных приложений,
			// то в раздел по такой строке Решения добавляется столько строк, сколько определено различных приложений.
			
			ИмяКолонки = ПолучитьИмяКолонкиНомерПриложенияРаздела(НомерРаздела);
			
			СтрокиТаблицыПриложений = ОпределитьСтрокиТаблицыПриложений(МестоРегистрацииОписи, ИмяКолонки);
			
			Для Каждого СтрокаТаблицыПриложений Из СтрокиТаблицыПриложений Цикл
				
				СтрокаТаблицыОбъекты = СтрокаТаблицыПриложений.СтрокаТаблицыОбъекты;
				
				// Добавляем строку в раздел
				
				НоваяСтрокаРаздела = ДобавитьСтрокуОписиВРаздел(Данные, ИмяТЧРаздела, СтрокаТаблицыОбъекты, МестоРегистрацииОписи, ИмяДокумента, ДополнительныеПараметры);
				
				// Добавляем строки в соответствующее приложение
				
				НомерПриложения = СтрокаТаблицыПриложений[ИмяКолонки];
				
				НоваяСтрокаРаздела.НомерПриложения = НомерПриложения;
				
				Параметры.ИмяДокумента			= ИмяДокумента;
				Параметры.ТаблицаОписей			= ТаблицыОписей[ИмяДокумента];
				Параметры.НомерРаздела			= НомерРаздела;
				Параметры.НомерПриложения		= НомерПриложения;
				Параметры.СтрокаРаздела			= НоваяСтрокаРаздела;
				Параметры.МестоРегистрацииОписи	= МестоРегистрацииОписи;
				Параметры.СтрокаТаблицыОбъекты	= СтрокаТаблицыОбъекты;
				
				ДобавитьСтрокиОписиВПриложение(Данные.ТабличныеЧасти, Параметры, ДополнительныеПараметры);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УпорядочитьРазделыАкта(Данные)
	
	ПоляСортировки = "КодФормы,ДатаОписи,НомерОписи";
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		Данные.ТабличныеЧасти[ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела)].Сортировать(ПоляСортировки);
	КонецЦикла;
	
КонецПроцедуры

Процедура УпорядочитьПриложенияАкта(Данные)
	
	ПоляСортировки = "НомерСтрокиРаздела,ПорядковыйНомер";
	
	Для НомерПриложения = 1 По КоличествоПриложенийКРазделу2() Цикл
		Данные.ТабличныеЧасти[ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, 2)].Сортировать(ПоляСортировки);
	КонецЦикла;
	
	Для НомерПриложения = 1 По КоличествоПриложенийКРазделу3() Цикл
		Данные.ТабличныеЧасти[ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, 3)].Сортировать(ПоляСортировки);
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьСтрокиТаблицыПриложений(МестоРегистрацииОписи, ИмяКолонки)
	
	КолонкиГруппировки = "СтрокаТаблицыОбъекты," + ИмяКолонки;
	
	ВремТаблица = МестоРегистрацииОписи.ТаблицаПриложений.Скопировать(, КолонкиГруппировки);
	ВремТаблица.Свернуть(КолонкиГруппировки);
	
	Поиск = Новый Структура(ИмяКолонки, 0);
	
	Пока Истина Цикл
		МассивСтрок = ВремТаблица.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ВремТаблица.Удалить(МассивСтрок[0]);
	КонецЦикла;
	
	Возврат ВремТаблица;
	
КонецФункции

Функция ПолучитьИмяКолонкиНомерПриложенияРаздела(НомерРаздела)
	
	Возврат СтрШаблон("НомерПриложенияРаздела%1", Формат(НомерРаздела, "ЧГ=0"));
	
КонецФункции

Функция ДобавитьСтрокуОписиВРаздел(Данные, ИмяТЧРаздела, СтрокаТаблицыОбъекты, МестоРегистрацииОписи, ИмяДокумента, ДополнительныеПараметры)
	
	КолонкиРешения = "КФО,Счет,ДатаИнвентаризации,ДатаНачала,ДатаОкончания,МестоИнвентаризации,Примечание";
	
	НоваяСтрокаРаздела = Данные.ТабличныеЧасти[ИмяТЧРаздела].Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрокаРаздела, СтрокаТаблицыОбъекты, КолонкиРешения);
	
	НоваяСтрокаРаздела.ОтветственноеЛицо = СтрокаТаблицыОбъекты.Сотрудник;
	
	ЗаполнитьЗначенияСвойств(НоваяСтрокаРаздела, МестоРегистрацииОписи, "Опись,ДатаОписи");
	
	НомерОписи = РегистрыСведений.НастройкиПечатиПрефиксаНомера.ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(
		МестоРегистрацииОписи.Опись,
		МестоРегистрацииОписи.НомерОписи);

	НоваяСтрокаРаздела.НомерОписи = НомерОписи;
	
	НоваяСтрокаРаздела.КодФормы = ОпределитьКодФормыОписи(ИмяДокумента, ДополнительныеПараметры);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрокаРаздела, "ИдентификаторСтроки") Тогда
		НоваяСтрокаРаздела.ИдентификаторСтроки = Новый УникальныйИдентификатор();
	КонецЕсли;
	
	Возврат НоваяСтрокаРаздела;
	
КонецФункции

Функция ПолучитьПараметрыДобавленияОписиВПриложение()
	
	Возврат Новый Структура("
		|ИмяДокумента,
		|ТаблицаОписей,
		|НомерРаздела,
		|НомерПриложения,
		|СтрокаРаздела,
		|МестоРегистрацииОписи,
		|СтрокаТаблицыОбъекты");
	
КонецФункции

Процедура ДобавитьСтрокиОписиВПриложение(ТабличныеЧасти, Параметры, ДополнительныеПараметры)
	
	ИмяДокумента			= Параметры.ИмяДокумента;
	ТаблицаОписей			= Параметры.ТаблицаОписей;
	НомерРаздела			= Параметры.НомерРаздела;
	НомерПриложения			= Параметры.НомерПриложения;
	СтрокаРаздела			= Параметры.СтрокаРаздела;
	МестоРегистрацииОписи	= Параметры.МестоРегистрацииОписи;
	СтрокаТаблицыОбъекты	= Параметры.СтрокаТаблицыОбъекты;
	
	ДобавленныеСтрокиОписейРаздела		= ДополнительныеПараметры.ДобавленныеСтрокиОписей.Получить(НомерРаздела);
	СтрокиРазделовБезПриложенияРаздела	= ДополнительныеПараметры.СтрокиРазделовБезПриложения.Получить(НомерРаздела);
	
	ИмяТабличнойЧастиПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
	
	ИмяКолонкиНомерПриложенияРаздела = ПолучитьИмяКолонкиНомерПриложенияРаздела(НомерРаздела);
	
	Поиск = Новый Структура(ИмяКолонкиНомерПриложенияРаздела, НомерПриложения);
	
	МассивСтрокРегистрации = МестоРегистрацииОписи.ТаблицаПриложений.НайтиСтроки(Поиск);
	
	Для Каждого СтрокаРегистрации Из МассивСтрокРегистрации Цикл
		
		Если СтрокаТаблицыОбъекты <> Неопределено И СтрокаРегистрации.СтрокаТаблицыОбъекты <> СтрокаТаблицыОбъекты Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОписи = СтрокаРегистрации.СтрокаОписи;
		
		Если ДобавленныеСтрокиОписейРаздела.Найти(СтрокаОписи) <> Неопределено Тогда
			Если СтрокиРазделовБезПриложенияРаздела.Найти(СтрокаРаздела) = Неопределено Тогда
				СтрокиРазделовБезПриложенияРаздела.Добавить(СтрокаРаздела);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		ДобавленныеСтрокиОписейРаздела.Добавить(СтрокаОписи);
		
		НоваяСтрокаПриложения = ТабличныеЧасти[ИмяТабличнойЧастиПриложения].Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПриложения, СтрокаОписи);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПриложения, СтрокаРаздела, "Опись,НомерОписи,ДатаОписи,ИдентификаторСтроки");
		
		ЗаполнитьНовуюСтрокуПриложения(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
		
	КонецЦикла;
	
	ДополнительныеПараметры.ДобавленныеСтрокиОписей.Вставить(НомерРаздела, ДобавленныеСтрокиОписейРаздела);
	ДополнительныеПараметры.СтрокиРазделовБезПриложения.Вставить(НомерРаздела, СтрокиРазделовБезПриложенияРаздела);
	
КонецПроцедуры

Процедура УдалитьСтрокиРазделовБезПриложений(Данные, ДополнительныеПараметры)
	
	СтрокиРазделовБезПриложения = ДополнительныеПараметры.СтрокиРазделовБезПриложения;
	
	Для Каждого НомерРаздела Из НомераРазделовСПриложениями() Цикл
		
		СтрокиРазделовБезПриложенияРаздела = СтрокиРазделовБезПриложения.Получить(НомерРаздела);
		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ТЧРаздела = Данные.ТабличныеЧасти[ИмяТЧРаздела];
		
		Количество = ТЧРаздела.Количество();
		
		Для Счетчик = 1 По Количество Цикл
			СтрокаРаздела = ТЧРаздела[Количество - Счетчик];
			
			Если СтрокиРазделовБезПриложенияРаздела.Найти(СтрокаРаздела) <> Неопределено Тогда
				ТЧРаздела.Удалить(СтрокаРаздела);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьНастройкиВключенияОписейВАвтозаполнениеАкта(ДополнительныеПараметры, ВключатьОписи52н = Истина, ВключатьОписи61н = Истина)
	
	ПринадлежностьИменДокументовПриказам = ДополнительныеПараметры.НастройкиИзТаблицыНастроекЗаполненияОписейПоРешению.ПринадлежностьИменДокументовПриказам;
	
	ДокументыОписей = КодыФорм().ДокументыОписей;
	
	ИменаДокументов = Новый Структура();
	
	ВключатьДокументыПриказа52н = Ложь;
	ВключатьДокументыПриказа61н = Ложь;
	
	Для Каждого Элемент Из ДокументыОписей Цикл
		ИмяДокумента = Элемент.Ключ;
		
		Если ПринадлежностьИменДокументовПриказам.Приказ52н.Найти(ИмяДокумента) <> Неопределено И ВключатьОписи52н Тогда
			ИменаДокументов.Вставить(ИмяДокумента, Истина);
			
			ВключатьДокументыПриказа52н = Истина;
		КонецЕсли;
		
		Если ПринадлежностьИменДокументовПриказам.Приказ61н.Найти(ИмяДокумента) <> Неопределено И ВключатьОписи61н Тогда
			ИменаДокументов.Вставить(ИмяДокумента, Истина);
			
			ВключатьДокументыПриказа61н = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Настройки = Новый Структура();
	Настройки.Вставить("ИменаДокументов", ИменаДокументов);
	Настройки.Вставить("ВключатьДокументыПриказа52н", ВключатьДокументыПриказа52н);
	Настройки.Вставить("ВключатьДокументыПриказа61н", ВключатьДокументыПриказа61н);
	
	Возврат Настройки;
	
КонецФункции

#Область Описи52н

Процедура ОпределитьМестаРегистрацииОписей52н(ШапкаДокумента, ТаблицаОбъекты, ДополнительныеПараметры, ОтборПоОписям = Неопределено, НастройкиВключенияОписей = Неопределено)
	
	ДобавитьТаблицыОписей52н(ШапкаДокумента, ДополнительныеПараметры, ОтборПоОписям, НастройкиВключенияОписей);
	
	СопоставитьСтрокиРешенияСОписями(ТаблицаОбъекты, ДополнительныеПараметры.Описи52н);
	
	ДобавитьМестаРегистрацииОписей(ТаблицаОбъекты, ДополнительныеПараметры.Описи52н);
	
КонецПроцедуры

Процедура ДобавитьТаблицыОписей52н(ШапкаДокумента, ДополнительныеПараметры, ОтборПоОписям = Неопределено, НастройкиВключенияОписей = Неопределено)
	
	Перем ДополнительныеТаблицы;
	
	ТаблицыОписей = ПрочитатьТаблицыОписей(ШапкаДокумента, ДополнительныеТаблицы, ДополнительныеПараметры, ОтборПоОписям, НастройкиВключенияОписей);
	
	ДобавитьДополнительныеПараметрыДляЗаполненияПоОписям52н(ДополнительныеПараметры, ТаблицыОписей, ШапкаДокумента.Организация);
	
	ОпределитьРодителейСчетовВТаблицах(ТаблицыОписей, ДополнительныеТаблицы);
	
	ДобавитьДополнительныеТаблицы(ДополнительныеПараметры.Описи52н, ДополнительныеТаблицы);

КонецПроцедуры

Процедура ДобавитьДополнительныеПараметрыДляЗаполненияПоОписям52н(ДополнительныеПараметры, ТаблицыОписей, Организация)
	
	ТаблицаНастроекЗаполненияОписейПоРешению = ИнвентаризацияСервер.ПолучитьТаблицуНастроекЗаполненияОписейПоРешению(, Истина);
	
	ТаблицаНастроекЗаполненияОписейПоРешению.Индексы.Добавить("ИмяДокумента");
	ТаблицаНастроекЗаполненияОписейПоРешению.Индексы.Добавить("ТипОписи");
	
	Описи52н = Новый Структура();
	Описи52н.Вставить("ТаблицыОписей",								ТаблицыОписей);
	Описи52н.Вставить("ТаблицаНастроек",							ТаблицаТиповОписейПоРазделам());
	Описи52н.Вставить("СоответствиеСотрудников",					ПолучитьСоответствующихСотрудников(ТаблицыОписей, Организация));
	Описи52н.Вставить("ТаблицаНастроекЗаполненияОписейПоРешению",	ТаблицаНастроекЗаполненияОписейПоРешению);
	
	Макет0504087 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ИнвентаризационнаяОписьНФА_0504087_194н");
	
	Описи52н.Вставить("Графа3_ВыводитьКодОС", ОбщегоНазначенияБГУ.ПолучитьНастройкуБулевоИзМакета(Макет0504087, "Графа3_ВыводитьКодОС", Ложь));
	Описи52н.Вставить("Графа3_ВыводитьКодМЗ", ОбщегоНазначенияБГУ.ПолучитьНастройкуБулевоИзМакета(Макет0504087, "Графа3_ВыводитьКодМЗ", Истина));
	
	// ИнвентаризацияГосдолгаВЦенныхБумагах
	Описи52н.Вставить("НастройкиВидЗадолженности0504084", НастройкиВидЗадолженности0504084());
	
	Поиск = Новый Структура();
	Поиск.Вставить("ИмяДокумента",	Новый Структура("ИмяДокумента"));
	Поиск.Вставить("ТипОписи",		Новый Структура("ТипОписи"));
	
	Описи52н.Вставить("Поиск", Поиск);
	Описи52н.Вставить("ТипыОписей", ПолучитьТипыОписей(ТаблицыОписей));
	
	ДополнительныеПараметры.Вставить("Описи52н", Описи52н);
	
КонецПроцедуры

Функция ПолучитьТипыОписей(ТаблицыОписей)
	
	ТипыОписей = Новый Соответствие();
	
	Для Каждого Элемент Из ТаблицыОписей Цикл
		
		ИмяДокумента	= Элемент.Ключ;
		ТаблицаОписей	= Элемент.Значение;
		
		ВремТаблица = ТаблицаОписей.Скопировать(, "Опись");
		ВремТаблица.Свернуть("Опись");
		
		Для Каждого СтрокаТаблицы Из ВремТаблица Цикл
			ТипыОписей.Вставить(СтрокаТаблицы.Опись, ТипЗнч(СтрокаТаблицы.Опись));
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТипыОписей;
	
КонецФункции

Функция ПолучитьСоответствующихСотрудников(ТаблицыОписей, Организация)
	
	Сотрудники = Новый Соответствие();
	
	ТипЦМО			= Тип("СправочникСсылка.ЦМО");
	ТипКонтрагент	= Тип("СправочникСсылка.Контрагенты");
	
	ЗначенияТипаЦМО			= Новый Массив();
	ЗначенияТипаКонтрагент	= Новый Массив();
	
	Для Каждого Элемент Из ТаблицыОписей Цикл
		ИмяДокумента = Элемент.Ключ;
		
		Таблица = Элемент.Значение;
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			ОтветственноеЛицо = СтрокаТаблицы.ОтветственноеЛицо;
			
			Если Не ЗначениеЗаполнено(ОтветственноеЛицо) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ОтветственноеЛицо) = ТипЦМО И ЗначенияТипаЦМО.Найти(ОтветственноеЛицо) = Неопределено Тогда
				ЗначенияТипаЦМО.Добавить(ОтветственноеЛицо);
				
			ИначеЕсли ТипЗнч(ОтветственноеЛицо) = ТипКонтрагент И ЗначенияТипаКонтрагент.Найти(ОтветственноеЛицо) = Неопределено Тогда
				ЗначенияТипаКонтрагент.Добавить(ОтветственноеЛицо);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначенияТипаЦМО.Количество() = 0 И ЗначенияТипаКонтрагент.Количество() = 0 Тогда
		Возврат Сотрудники;
	КонецЕсли;
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Организация",				Организация);
	ЗапросПоиск.УстановитьПараметр("ЗначенияТипаЦМО",			ЗначенияТипаЦМО);
	ЗапросПоиск.УстановитьПараметр("ЗначенияТипаКонтрагент",	ЗначенияТипаКонтрагент);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	Ссылка		КАК ТекущееЗначение,
	|	Сотрудник	КАК НовоеЗначение
	|ИЗ
	|	Справочник.ЦМО
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И Ссылка В(&ЗначенияТипаЦМО)
	|	И Владелец = &Организация
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагент		КАК ТекущееЗначение,
	|	МИНИМУМ(Ссылка)	КАК НовоеЗначение
	|ИЗ
	|	Справочник.Сотрудники
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И Контрагент В(&ЗначенияТипаКонтрагент)
	|	И Владелец = &Организация
	|СГРУППИРОВАТЬ ПО
	|	Контрагент";	
	
	Выборка = ЗапросПоиск.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сотрудники.Вставить(Выборка.ТекущееЗначение, Выборка.НовоеЗначение);
	КонецЦикла;
	
	Возврат Сотрудники;
	
КонецФункции

Процедура ОпределитьРодителейСчетовВТаблицах(ТаблицыОписей, ДополнительныеТаблицы)
	
	ОпределитьРодителейСчетов(ТаблицыОписей);
	
	ОпределитьРодителейСчетов(ДополнительныеТаблицы.ИнвентаризацияКассы,			"СписокСчетов");
	ОпределитьРодителейСчетов(ДополнительныеТаблицы.ИнвентаризацияОстатковНаСчетах,	"СписокСчетов");
	
КонецПроцедуры
	
Процедура ОпределитьРодителейСчетов(ТаблицыОписей, ИмяКлюча = Неопределено)
	
	МассивСчетов = ПолучитьСчетаИзОписей(ТаблицыОписей);
	
	КоличествоРодителейСчетов = 4;
	
	РодителиСчетов = ИнвентаризацияСервер.ПолучитьРодителейСчетов(МассивСчетов, КоличествоРодителейСчетов);
	
	Для Каждого Элемент Из ТаблицыОписей Цикл
		ИмяДокумента	= Элемент.Ключ;
		ТаблицаОписей	= Элемент.Значение;
		
		Если ИмяКлюча <> Неопределено И ИмяДокумента <> ИмяКлюча Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаОписей.Колонки.Добавить("СсылкиРодителейСчета", Новый ОписаниеТипов("Массив"));
		
		Поиск = Новый Структура();
		
		Для Каждого СтрокаТаблицы Из ТаблицаОписей Цикл
			
			Счет = СтрокаТаблицы.Счет;
			
			Если Не ЗначениеЗаполнено(Счет) Или ТипЗнч(Счет) <> Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
				Продолжить;
			КонецЕсли;
			
			Поиск.Вставить("Ссылка", Счет);
			
			МассивСтрок = РодителиСчетов.НайтиСтроки(Поиск);
			
			СвойстваСчета = МассивСтрок[0];
			
			МассивСсылок = Новый Массив();
			
			Для УровеньРодителя = 1 По КоличествоРодителейСчетов Цикл
				
				УровеньРодителяСтрокой = Формат(УровеньРодителя, "ЧГ=0");
				
				ИмяПоляСсылка = "Родитель" + УровеньРодителяСтрокой + "Ссылка";
				
				Ссылка = СвойстваСчета[ИмяПоляСсылка];
				
				Если Не ЗначениеЗаполнено(Ссылка) Тогда
					Продолжить;
				КонецЕсли;
				
				МассивСсылок.Добавить(Ссылка);
				
			КонецЦикла;
			
			СтрокаТаблицы["СсылкиРодителейСчета"] = МассивСсылок;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСчетаИзОписей(ТаблицыОписей)
	
	МассивСчетов = Новый Массив();
	
	Для Каждого Элемент Из ТаблицыОписей Цикл
		ИмяДокумента	= Элемент.Ключ;
		ТаблицаОписей	= Элемент.Значение;
		
		СчетаОписи = ТаблицаОписей.ВыгрузитьКолонку("Счет");
		
		Для Каждого Счет Из СчетаОписи Цикл
			Если Не ЗначениеЗаполнено(Счет) Или ТипЗнч(Счет) <> Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
				Продолжить;
			КонецЕсли;
			
			Если МассивСчетов.Найти(Счет) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСчетов.Добавить(Счет);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивСчетов;
	
КонецФункции

Процедура СопоставитьСтрокиРешенияСОписями(ТаблицаОбъекты, ДополнительныеПараметры)
	
	ТаблицыОписей = ДополнительныеПараметры.ТаблицыОписей;
	
	ИмяКолонки = "ТаблицаСопоставленияОписей";
	
	Если ТаблицаОбъекты.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		ТаблицаОбъекты.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("ТаблицаЗначений"));
	КонецЕсли;
	
	Поиск = Новый Структура("Опись,ИмяТабличнойЧасти");
	
	НесопоставленныеСтрокиОписей = ПолучитьПустуюТаблицуСопоставленияОписей();
	
	Для Каждого СтрокаТаблицыОбъекты Из ТаблицаОбъекты Цикл
		
		ТаблицаСопоставленияОписей = ПолучитьПустуюТаблицуСопоставленияОписей();
		
		Для Каждого Элемент Из ТаблицыОписей Цикл
			
			ИмяДокумента	= Элемент.Ключ;
			ТаблицаОписей	= Элемент.Значение;
			
			Если СтрокаТаблицыОбъекты.ИменаДокументов.Количество() > 0
				И СтрокаТаблицыОбъекты.ИменаДокументов.Найти(ИмяДокумента) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого СтрокаТаблицыОписей Из ТаблицаОписей Цикл
				
				Если СтрокаТаблицыОбъекты.МестоИнвентаризации = СтрокаТаблицыОписей.МестоИнвентаризации
					И СопоставленСчет(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей, ИмяДокумента, ДополнительныеПараметры)
					И СопоставленСотрудник(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей, ДополнительныеПараметры)
					И СопоставленКФО(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей) Тогда
					
					ДобавитьНомерСтрокиОписи(ТаблицаСопоставленияОписей, СтрокаТаблицыОписей, Поиск);
				Иначе
					ДобавитьНомерСтрокиОписи(НесопоставленныеСтрокиОписей, СтрокаТаблицыОписей, Поиск);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		СтрокаТаблицыОбъекты.ТаблицаСопоставленияОписей = ТаблицаСопоставленияОписей;
		
	КонецЦикла;
	
	ИсключитьСопоставленныеНомераСтрок(НесопоставленныеСтрокиОписей, ТаблицаОбъекты, Поиск);
	
	ДополнительныеПараметры.Вставить("НесопоставленныеСтрокиОписей", НесопоставленныеСтрокиОписей);
	
КонецПроцедуры

Функция ПолучитьПустуюТаблицуСопоставленияОписей()
	
	ТаблицаСопоставления = Новый ТаблицаЗначений();
	ТаблицаСопоставления.Колонки.Добавить("Опись");
	ТаблицаСопоставления.Колонки.Добавить("ДатаОписи",			ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаСопоставления.Колонки.Добавить("НомерОписи",			Новый ОписаниеТипов("Строка"));
	ТаблицаСопоставления.Колонки.Добавить("ИмяТабличнойЧасти",	Новый ОписаниеТипов("Строка"));
	ТаблицаСопоставления.Колонки.Добавить("НомераСтрок",		Новый ОписаниеТипов("Соответствие"));
	
	ТаблицаСопоставления.Колонки.Добавить("СопоставленыОтклонения",	Новый ОписаниеТипов("Булево"));
	ТаблицаСопоставления.Колонки.Добавить("СопоставленОтбор",		Новый ОписаниеТипов("Булево"));
	
	ТаблицаСопоставления.Индексы.Добавить("Опись,ИмяТабличнойЧасти");
	
	Возврат ТаблицаСопоставления;
	
КонецФункции

Функция СопоставленКФО(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей)
	
	Если СтрокаТаблицыОписей.КФО = Неопределено Тогда
		// В описи не указывается КФО.
		// Считаем, что в таком случае сопоставление успешно выполнено.
		Возврат Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицыОбъекты.КФО) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат (СтрокаТаблицыОбъекты.КФО = СтрокаТаблицыОписей.КФО);
	
КонецФункции

Функция СопоставленСчет(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей, ИмяДокумента, ДополнительныеПараметры)
	
	Если СтрокаТаблицыОписей.Счет = Неопределено Тогда
		// В описи не указывается счет.
		// Определяем соответствие вида документа описи и настройки счетов для такого вида документа описи.
		Возврат ДокументОписиСоответствуетСчетуИзРешения(СтрокаТаблицыОбъекты.Счет, ИмяДокумента, ДополнительныеПараметры);
	КонецЕсли;
	
	Если СтрокаТаблицыОписей.Счет = "Дополнительная таблица" Тогда
		// В описи счет указывается в отдельной табличной части.
		Возврат СписокСчетовОписиСоответствуетСчетуИзРешения(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей, ИмяДокумента, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицыОбъекты.Счет) Или Не ЗначениеЗаполнено(СтрокаТаблицыОписей.Счет) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрокаТаблицыОбъекты.Счет = СтрокаТаблицыОписей.Счет Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаТаблицыОписей.СсылкиРодителейСчета.Количество() > 0
		И СтрокаТаблицыОписей.СсылкиРодителейСчета.Найти(СтрокаТаблицыОбъекты.Счет) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ДокументОписиСоответствуетСчетуИзРешения(СчетИзРешения, ИмяДокумента, ДополнительныеПараметры)
	
	ДополнительныеПараметры.Поиск.ИмяДокумента.ИмяДокумента = ИмяДокумента;
	
	МассивСтрок = ДополнительныеПараметры.ТаблицаНастроекЗаполненияОписейПоРешению.НайтиСтроки(ДополнительныеПараметры.Поиск.ИмяДокумента);
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТаблицаКодовСчетов = МассивСтрок[0].ТаблицаКодовСчетов;
	
	// Сопоставление счета выполняется по аналогии с ИнвентаризацияСервер.СопоставитьТаблицыОбъектовИНастроек
	Для Каждого СтрокаТаблицыКодов Из ТаблицаКодовСчетов Цикл
		
		Если СтрокаТаблицыКодов.СсылкиСчетов.Найти(СчетИзРешения) <> Неопределено
			Или СтрокаТаблицыКодов.СсылкиРодителейСчетов.Найти(СчетИзРешения) <> Неопределено Тогда
			
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция СписокСчетовОписиСоответствуетСчетуИзРешения(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей, ИмяДокумента, ДополнительныеПараметры)
	
	СчетИзРешения = СтрокаТаблицыОбъекты.Счет;
	
	Поиск = Новый Структура("Опись", СтрокаТаблицыОписей.Опись);
	
	МассивСтрок = ДополнительныеПараметры.ДополнительныеТаблицы[ИмяДокумента].СписокСчетов.НайтиСтроки(Поиск);
	
	// Сопоставление счета выполняется по аналогии с ИнвентаризацияСервер.СопоставитьТаблицыОбъектовИНастроек
	Для Каждого СтрокаСпискаСчетов Из МассивСтрок Цикл
		
		Если СтрокаСпискаСчетов.Счет = СчетИзРешения
			Или СтрокаСпискаСчетов.СсылкиРодителейСчета.Найти(СчетИзРешения) <> Неопределено Тогда
			
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция СопоставленСотрудник(СтрокаТаблицыОбъекты, СтрокаТаблицыОписей, ДополнительныеПараметры)
	
	Если Не ЕстьРеквизитМОЛ(СтрокаТаблицыОписей, ДополнительныеПараметры) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицыОбъекты.Сотрудник) И Не ЗначениеЗаполнено(СтрокаТаблицыОписей.ОтветственноеЛицо) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицыОбъекты.Сотрудник) Или Не ЗначениеЗаполнено(СтрокаТаблицыОписей.ОтветственноеЛицо) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтрокаТаблицыОбъекты.Сотрудник = СтрокаТаблицыОписей.ОтветственноеЛицо Тогда
		Возврат Истина;
	КонецЕсли;
	
	Сотрудник = ДополнительныеПараметры.СоответствиеСотрудников.Получить(СтрокаТаблицыОписей.ОтветственноеЛицо);
	
	Если СтрокаТаблицыОбъекты.Сотрудник = Сотрудник Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьРеквизитМОЛ(СтрокаТаблицыОписей, ДополнительныеПараметры)
	
	ДополнительныеПараметры.Поиск.ТипОписи.ТипОписи = ДополнительныеПараметры.ТипыОписей.Получить(СтрокаТаблицыОписей.Опись);
	
	МассивСтрок = ДополнительныеПараметры.ТаблицаНастроекЗаполненияОписейПоРешению.НайтиСтроки(ДополнительныеПараметры.Поиск.ТипОписи);
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастройкаОписи = МассивСтрок[0];
	
	Возврат ЗначениеЗаполнено(НастройкаОписи.ИмяРеквизитаМОЛ);
	
КонецФункции	

Процедура ДобавитьНомерСтрокиОписи(ТаблицаСопоставленияОписей, СтрокаТаблицыОписей, Поиск)
	
	Если ТаблицаСопоставленияОписей.Количество() = 0 Тогда
		СтрокаТаблицы = ТаблицаСопоставленияОписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТаблицыОписей);
		
		СтрокаТаблицы.НомераСтрок = Новый Соответствие();
	Иначе
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаТаблицыОписей);
		
		МассивСтрок = ТаблицаСопоставленияОписей.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаТаблицы = ТаблицаСопоставленияОписей.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТаблицыОписей);
			
			СтрокаТаблицы.НомераСтрок = Новый Соответствие();
		Иначе
			СтрокаТаблицы = МассивСтрок[0];
		КонецЕсли;
	КонецЕсли;
	
	НомерСтроки = СтрокаТаблицыОписей.НомерСтроки;
	
	СтрокаТаблицы.НомераСтрок.Вставить(НомерСтроки);
		
КонецПроцедуры

Функция ПрочитатьТаблицыОписей(ДокументОбъект, ДополнительныеТаблицы, ДополнительныеПараметры, ОтборПоОписям = Неопределено, НастройкиВключенияОписей = Неопределено)
	
	Перем ЭлементыИмени, ДополнительноеЗначение;
	
	ПрименитьОтборПоОписям = (ОтборПоОписям <> Неопределено);
	
	ДополнительныеТаблицы = Новый Структура();
	
	ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаРУКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВалютаРУ, "Код");
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Решение",						ДокументОбъект.РешениеОПроведенииИнвентаризации);
	ЗапросПоиск.УстановитьПараметр("ДатаИнвентаризации",			ДокументОбъект.ДатаИнвентаризации);
	ЗапросПоиск.УстановитьПараметр("ПрименитьОтборПоОписям",		ПрименитьОтборПоОписям);
	ЗапросПоиск.УстановитьПараметр("ОтборПоОписям",					ОтборПоОписям);
	ЗапросПоиск.УстановитьПараметр("ПрименитьОтборПоПодразделению",	ДополнительныеПараметры.ИспользоватьУчетПоПодразделениям И ЗначениеЗаполнено(ДокументОбъект.Подразделение));
	ЗапросПоиск.УстановитьПараметр("Подразделение",					ДокументОбъект.Подразделение);
	
	// ИнвентаризацияОС, ИнвентаризацияИК
	ЗапросПоиск.УстановитьПараметр("ЕдИзмШт",	Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());
	ЗапросПоиск.УстановитьПараметр("СчетаМЗ",	Документы.ИнвентаризацияИК.ПолучитьСчетаУчетаМЗ());
	
	ЗапросПоиск.УстановитьПараметр("ВалютаРУ",		ВалютаРУ);
	ЗапросПоиск.УстановитьПараметр("ВалютаРУКод",	ВалютаРУКод);
	
	// ИнвентаризацияГосдолгаВЦенныхБумагах
	Настройки = НастройкиВидЗадолженности0504084();
	ЗапросПоиск.УстановитьПараметр("СчетаВнутреннийДолг0504084",	Настройки.Счета.ВнутреннийДолг);
	ЗапросПоиск.УстановитьПараметр("СчетаВнешнийДолг0504084",		Настройки.Счета.ВнешнийДолг);
	
	// ИнвентаризацияГосдолгаПоКредитамИГарантиям
	Настройки = НастройкиВидЗадолженности0504085();
	ЗапросПоиск.УстановитьПараметр("СчетаВнутреннийДолг0504085",	Настройки.Счета.ВнутреннийДолг);
	
	// ИнвентаризацияКассы
	ЗапросПоиск.УстановитьПараметр("Счет03",	БухгалтерскийУчет.СчетПоКоду("03"));
	ЗапросПоиск.УстановитьПараметр("Счет20135",	БухгалтерскийУчет.СчетПоКоду("201.35"));
	ЗапросПоиск.УстановитьПараметр("Счет08",	БухгалтерскийУчет.СчетПоКоду("08"));
	
	ИндексыТаблиц = Новый Структура();
	
	ИндексыТаблиц.Вставить("ПоследнийДобавленныйИндекс", -1);
	
	ЗапросПоиск.Текст = ПолучитьТекстЗапросаПоискОписей52н(ИндексыТаблиц, НастройкиВключенияОписей);
	
	УпорядочитьИндексыПодзапросов(ЗапросПоиск.Текст);
	
	ИндексыТаблиц.Удалить("ПоследнийДобавленныйИндекс");
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	
	ТаблицыОписей = Новый Структура();
	
	Для Каждого Элемент Из ИндексыТаблиц Цикл
		ИмяДокумента	= Элемент.Ключ;
		ИндексТаблицы	= Элемент.Значение;
		
		Таблица = РезультатыЗапроса[ИндексТаблицы].Выгрузить();
		
		Если ЭтоОбозначениеДополнительнойТаблицы(ИмяДокумента, ЭлементыИмени) Тогда
			
			ДополнительныеТаблицы.Свойство(ЭлементыИмени.ИмяДокумента, ДополнительноеЗначение);
			
			Если ДополнительноеЗначение = Неопределено Тогда
				ДополнительноеЗначение = Новый Структура();
			КонецЕсли;
			
			ДополнительноеЗначение.Вставить(ЭлементыИмени.ИмяТаблицы, Таблица);
			
			ДополнительныеТаблицы.Вставить(ЭлементыИмени.ИмяДокумента, ДополнительноеЗначение);
		Иначе
			ТаблицыОписей.Вставить(ИмяДокумента, Таблица);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицыОписей;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоискОписей52н(ИндексыТаблиц, НастройкиВключенияОписей = Неопределено)
	
	ВключатьВсеОписи = (НастройкиВключенияОписей = Неопределено);
	
	Тексты = Новый Массив();
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияЦенныхБумаг") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияЦенныхБумаг(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияОстатковНаСчетах") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияОстатковНаСчетах(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияКредитовИЗаймов") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияКредитовИЗаймов(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияГосдолгаВЦенныхБумагах") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияГосдолгаВЦенныхБумагах(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияГосдолгаПоКредитамИГарантиям") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияГосдолгаПоКредитамИГарантиям(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияКассы") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияКассы(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияИК") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияИК(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияМЗ") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияМЗ(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияОС") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияОС(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияРасчетовСКонтрагентами") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияРасчетовСКонтрагентами(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризацияРасчетовПоПоступлениям") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияРасчетовПоПоступлениям(ИндексыТаблиц));
	КонецЕсли;
	
	Возврат СтрСоединить(Тексты, "");
	
КонецФункции

Функция ЭтоОбозначениеДополнительнойТаблицы(ИмяКлюча, ЭлементыИмени = Неопределено)
	
	МассивИмен = СтрРазделить(ИмяКлюча, "_");
	
	Если МассивИмен.Количество() <> 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементыИмени = Новый Структура();
	ЭлементыИмени.Вставить("ИмяДокумента", МассивИмен[0]);
	ЭлементыИмени.Вставить("ИмяТаблицы", МассивИмен[1]);
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьДополнительныеТаблицы(ДополнительныеПараметры, ДополнительныеТаблицы)
	
	ДополнительныеПараметры.Вставить("ДополнительныеТаблицы", Новый Структура());
	
	Для Каждого Элемент Из ДополнительныеТаблицы Цикл
		ДополнительныеПараметры.ДополнительныеТаблицы.Вставить(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Описи61н

Процедура ОпределитьМестаРегистрацииОписей61н(ШапкаДокумента, ТаблицаОбъекты, ДополнительныеПараметры, ОтборПоОписям = Неопределено, НастройкиВключенияОписей = Неопределено)
	
	ДобавитьТаблицыОписей61н(ШапкаДокумента, ДополнительныеПараметры, ОтборПоОписям, НастройкиВключенияОписей);
	
	СопоставитьСтрокиРешенияСОписями61н(ТаблицаОбъекты, ДополнительныеПараметры);
	
	ДобавитьМестаРегистрацииОписей61н(ТаблицаОбъекты, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДобавитьТаблицыОписей61н(ШапкаДокумента, ДополнительныеПараметры, ОтборПоОписям = Неопределено, НастройкиВключенияОписей = Неопределено)
	
	ТаблицыОписей = ПрочитатьТаблицыОписей61н(ШапкаДокумента, ДополнительныеПараметры, ОтборПоОписям, НастройкиВключенияОписей);
	
	ДобавитьДополнительныеПараметрыДляЗаполненияПоОписям61н(ДополнительныеПараметры, ТаблицыОписей);
	
	ЗаполнитьРодителейСчетовВТаблицахВыявленныхОтклоненийОписей61н(ТаблицыОписей);
	
КонецПроцедуры

Функция ПрочитатьТаблицыОписей61н(ДокументОбъект, ДополнительныеПараметры, ОтборПоОписям = Неопределено, НастройкиВключенияОписей = Неопределено)
	
	//Перем ЭлементыИмени, ДополнительноеЗначение;
	Перем ТаблицыДокумента;
	
	ПрименитьОтборПоОписям = (ОтборПоОписям <> Неопределено);
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Решение",						ДокументОбъект.РешениеОПроведенииИнвентаризации);
	ЗапросПоиск.УстановитьПараметр("ДатаИнвентаризации",			ДокументОбъект.ДатаИнвентаризации);
	ЗапросПоиск.УстановитьПараметр("НомерКомиссии",					ДокументОбъект.НомерКомиссии);
	ЗапросПоиск.УстановитьПараметр("ПрименитьОтборПоОписям",		ПрименитьОтборПоОписям);
	ЗапросПоиск.УстановитьПараметр("ОтборПоОписям",					ОтборПоОписям);
	ЗапросПоиск.УстановитьПараметр("ПрименитьОтборПоПодразделению",	ДополнительныеПараметры.ИспользоватьУчетПоПодразделениям И ЗначениеЗаполнено(ДокументОбъект.Подразделение));
	ЗапросПоиск.УстановитьПараметр("Подразделение",					ДокументОбъект.Подразделение);
	
	// 0510468
	ЗапросПоиск.УстановитьПараметр("СтатусыЗадолженностиНеАктив", ПолучитьСтатусыЗадолженностиНеАктив0510468());
	
	ИндексыТаблиц = Новый Структура();
	
	ИндексыТаблиц.Вставить("ПоследнийДобавленныйИндекс", -1);
	
	ЗапросПоиск.Текст = ПолучитьТекстЗапросаПоискОписей61н(ИндексыТаблиц, НастройкиВключенияОписей);
	
	УпорядочитьИндексыПодзапросов(ЗапросПоиск.Текст);
	
	ИндексыТаблиц.Удалить("ПоследнийДобавленныйИндекс");
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	
	ТаблицыОписей = Новый Структура();
	
	Для Каждого Элемент Из ИндексыТаблиц Цикл
		МассивИмен = СтрРазделить(Элемент.Ключ, "_");
		
		ИмяДокумента	= МассивИмен[0];
		ИмяТаблицы		= МассивИмен[1];
		ИндексТаблицы	= Элемент.Значение;
		
		Таблица = РезультатыЗапроса[ИндексТаблицы].Выгрузить();
		
		Таблица.Индексы.Добавить("Ссылка");
		
		Если Не ТаблицыОписей.Свойство(ИмяДокумента, ТаблицыДокумента) Тогда
			ТаблицыДокумента = Новый Структура();
			
			ТаблицыОписей.Вставить(ИмяДокумента, ТаблицыДокумента);
		КонецЕсли;
		
		ТаблицыДокумента.Вставить(ИмяТаблицы, Таблица);
	КонецЦикла;
	
	Возврат ТаблицыОписей;
	
КонецФункции

Функция ПолучитьТекстЗапросаПоискОписей61н(ИндексыТаблиц, НастройкиВключенияОписей = Неопределено)
	
	ВключатьВсеОписи = (НастройкиВключенияОписей = Неопределено);
	
	Тексты = Новый Массив();
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризационнаяОписьБСО") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьБСО(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризационнаяОписьНФА") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьНФА(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризационнаяОписьОстатковНаСчетах") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьОстатковНаСчетах(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("ИнвентаризационнаяОписьРасчетовПоПоступлениям") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьРасчетовПоПоступлениям(ИндексыТаблиц));
	КонецЕсли;
	
	Если ВключатьВсеОписи Или НастройкиВключенияОписей.ИменаДокументов.Свойство("УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям") Тогда
		Тексты.Добавить(ПолучитьТекстЗапросаЗаполнение_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(ИндексыТаблиц));
	КонецЕсли;
	
	Возврат СтрСоединить(Тексты, "");
	
КонецФункции

Процедура ЗаполнитьРодителейСчетовВТаблицахВыявленныхОтклоненийОписей61н(ТаблицыОписей)
	
	ОбщийМассивСчетов = ПолучитьСчетаВыявленныхОтклоненийИзВсехОписей61н(ТаблицыОписей);
	
	Для Каждого Элемент Из ТаблицыОписей Цикл
		ИмяДокумента		= Элемент.Ключ;
		ТаблицыДокумента	= Элемент.Значение;
		
		Если ИмяДокумента = "ИнвентаризационнаяОписьНФА" Тогда
			ЗаполнитьРодителейСчетов61н(ТаблицыДокумента.ВыявленныеОтклонения, ОбщийМассивСчетов);
			
		ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
			ЗаполнитьРодителейСчетов61н(ТаблицыДокумента.ВыявленныеОтклоненияРаздел21, ОбщийМассивСчетов);
			ЗаполнитьРодителейСчетов61н(ТаблицыДокумента.ВыявленныеОтклоненияРаздел22, ОбщийМассивСчетов);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
Процедура ЗаполнитьРодителейСчетов61н(Таблица, ОбщийМассивСчетов)
	
	Таблица.Колонки.Добавить("СсылкиРодителейСчета", Новый ОписаниеТипов("Массив"));
	
	КоличествоРодителейСчетов = 4;
	
	РодителиСчетов = ИнвентаризацияСервер.ПолучитьРодителейСчетов(ОбщийМассивСчетов, КоличествоРодителейСчетов);
	
	Поиск = Новый Структура("Ссылка");
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Счет = СтрокаТаблицы.Счет;
		
		Если Не ЗначениеЗаполнено(Счет) Или ТипЗнч(Счет) <> Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
			Продолжить;
		КонецЕсли;
		
		Поиск.Ссылка = Счет;
		
		МассивСтрок = РодителиСчетов.НайтиСтроки(Поиск);
		
		СвойстваСчета = МассивСтрок[0];
		
		МассивСсылок = Новый Массив();
		
		Для УровеньРодителя = 1 По КоличествоРодителейСчетов Цикл
			УровеньРодителяСтрокой = Формат(УровеньРодителя, "ЧГ=0");
			
			ИмяПоляСсылка = "Родитель" + УровеньРодителяСтрокой + "Ссылка";
			
			Ссылка = СвойстваСчета[ИмяПоляСсылка];
			
			Если Не ЗначениеЗаполнено(Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСсылок.Добавить(Ссылка);
		КонецЦикла;
		
		СтрокаТаблицы.СсылкиРодителейСчета = МассивСсылок;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСчетаВыявленныхОтклоненийИзВсехОписей61н(ТаблицыОписей)
	
	МассивСчетов = Новый Массив();
	
	Для Каждого Элемент Из ТаблицыОписей Цикл
		ИмяДокумента		= Элемент.Ключ;
		ТаблицыДокумента	= Элемент.Значение;
		
		Если ИмяДокумента = "ИнвентаризационнаяОписьНФА" Тогда
			СчетаОписи = ТаблицыДокумента.ВыявленныеОтклонения.ВыгрузитьКолонку("Счет");
			
		ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
			СчетаОписи = ТаблицыДокумента.ВыявленныеОтклоненияРаздел21.ВыгрузитьКолонку("Счет");
			
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаОписи, ТаблицыДокумента.ВыявленныеОтклоненияРаздел22.ВыгрузитьКолонку("Счет"));
		Иначе
			Продолжить;
		КонецЕсли;
		
		Для Каждого Счет Из СчетаОписи Цикл
			Если Не ЗначениеЗаполнено(Счет) Или ТипЗнч(Счет) <> Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
				Продолжить;
			КонецЕсли;
			
			Если МассивСчетов.Найти(Счет) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивСчетов.Добавить(Счет);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивСчетов;
	
КонецФункции

Процедура ДобавитьНомерСтрокиОписи61н(ТаблицаСопоставленияОписей, СтрокаТаблицыОписи, ШапкаОписи, РезультатыСопоставления, ИмяТаблицыОтклонений = Неопределено, СопоставленыОтклонения = Ложь, СопоставленОтбор = Ложь)

	Если ТаблицаСопоставленияОписей.Количество() = 0 Тогда
		СтрокаТаблицы = ТаблицаСопоставленияОписей.Добавить();
		
		СтрокаТаблицы.Опись			= ШапкаОписи.Ссылка;
		СтрокаТаблицы.ДатаОписи		= ШапкаОписи.Дата;
		СтрокаТаблицы.НомерОписи	= ШапкаОписи.Номер;
		
		СтрокаТаблицы.НомераСтрок = Новый Соответствие();
	Иначе
		РезультатыСопоставления.ПоискОписиВТаблицеСопоставления.Опись = ШапкаОписи.Ссылка;
		РезультатыСопоставления.ПоискОписиВТаблицеСопоставления.ИмяТабличнойЧасти = ?(ЗначениеЗаполнено(ИмяТаблицыОтклонений), ИмяТаблицыОтклонений, "");
		
		МассивСтрок = ТаблицаСопоставленияОписей.НайтиСтроки(РезультатыСопоставления.ПоискОписиВТаблицеСопоставления);
		
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаТаблицы = ТаблицаСопоставленияОписей.Добавить();
			
			СтрокаТаблицы.Опись			= ШапкаОписи.Ссылка;
			СтрокаТаблицы.ДатаОписи		= ШапкаОписи.Дата;
			СтрокаТаблицы.НомерОписи	= ШапкаОписи.Номер;
			
			СтрокаТаблицы.НомераСтрок = Новый Соответствие();
		Иначе
			СтрокаТаблицы = МассивСтрок[0];
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТаблицы.ИмяТабличнойЧасти = ?(ЗначениеЗаполнено(ИмяТаблицыОтклонений), ИмяТаблицыОтклонений, "");
	
	НомерСтроки = СтрокаТаблицыОписи.НомерСтроки;
	
	СтрокаТаблицы.НомераСтрок.Вставить(НомерСтроки);
	
	Если СопоставленыОтклонения Тогда
		СтрокаТаблицы.СопоставленыОтклонения = Истина;
	КонецЕсли;
	
	Если СопоставленОтбор Тогда
		СтрокаТаблицы.СопоставленОтбор = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьШапкуОписи61нПриЗаполненииСтрокиПриложения(СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	Поиск = ДополнительныеПараметры.Описи61н.РезультатыРасчета.РезультатыСопоставления.ПоискОписиВДанныхОписей;
	
	Поиск.Ссылка = СтрокаОписи.Ссылка;
	
	Возврат Параметры.ТаблицаОписей.Шапки.НайтиСтроки(Поиск)[0];
	
КонецФункции

Процедура СопоставитьСтрокиРешенияСОписями61н(ТаблицаОбъекты, ДополнительныеПараметры)
	
	ТаблицыОписей = ДополнительныеПараметры.Описи61н.ТаблицыОписей;
	
	ИмяКолонки = "ТаблицаСопоставленияОписей";
	
	Если ТаблицаОбъекты.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
		ТаблицаОбъекты.Колонки.Добавить(ИмяКолонки, Новый ОписаниеТипов("ТаблицаЗначений"));
	КонецЕсли;
	
	РезультатыСопоставления = Новый Структура();
	РезультатыСопоставления.Вставить("СопоставленныеСтрокеРешения",		ПолучитьПустуюТаблицуСопоставленияОписей());
	РезультатыСопоставления.Вставить("Несопоставленные",				ПолучитьПустуюТаблицуСопоставленияОписей());
	РезультатыСопоставления.Вставить("ПоискОписиВТаблицеСопоставления",	Новый Структура("Опись,ИмяТабличнойЧасти"));
	РезультатыСопоставления.Вставить("ПоискОписиВДанныхОписей",			Новый Структура("Ссылка"));
	
	Для Каждого СтрокаТаблицыОбъекты Из ТаблицаОбъекты Цикл
		
		Для Каждого ЭлементТаблицыОписей Из ТаблицыОписей Цикл
			ИмяДокумента		= ЭлементТаблицыОписей.Ключ;
			ТаблицыДокумента	= ЭлементТаблицыОписей.Значение;
			
			Если СтрокаТаблицыОбъекты.ИменаДокументов.Количество() > 0
				И СтрокаТаблицыОбъекты.ИменаДокументов.Найти(ИмяДокумента) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИменаПрочитанныхТаблицВыявленныхОтклонений = ДополнительныеПараметры.НастройкиИзТаблицыНастроекЗаполненияОписейПоРешению.СоответствиеИмяДокументаИменаПрочитанныхТаблицВыявленныхОтклонений.Получить(ИмяДокумента);
			
			Для Каждого ИмяТаблицыОтклонений Из ИменаПрочитанныхТаблицВыявленныхОтклонений Цикл
				Если ТаблицыДокумента[ИмяТаблицыОтклонений].Количество() > 0 Тогда
					СопоставитьВыявленныеОтклоненияОписей61н(СтрокаТаблицыОбъекты, ТаблицыДокумента, ИмяДокумента, ИмяТаблицыОтклонений, РезультатыСопоставления);
				КонецЕсли;
			КонецЦикла;
			
			СопоставитьОтборыОписей61н(СтрокаТаблицыОбъекты, ТаблицыДокумента, ИмяДокумента, РезультатыСопоставления, ДополнительныеПараметры);
		КонецЦикла;
		
		СтрокаТаблицыОбъекты.ТаблицаСопоставленияОписей = РезультатыСопоставления.СопоставленныеСтрокеРешения;
		
		РезультатыСопоставления.Вставить("СопоставленныеСтрокеРешения", ПолучитьПустуюТаблицуСопоставленияОписей());
		
	КонецЦикла;
	
	ПоискОписи = Новый Структура("Опись");
	
	ИсключитьСопоставленныеНомераСтрок(РезультатыСопоставления.Несопоставленные, ТаблицаОбъекты, ПоискОписи);
	
	ДополнительныеПараметры.Описи61н.РезультатыРасчета.Вставить("РезультатыСопоставления", РезультатыСопоставления);
	
КонецПроцедуры

Функция ПолучитьИменаПрочитанныхТаблицВыявленныхОтклоненийОписи61н(ИмяДокумента)
	
	ИменаТаблиц = Новый Массив();
	
	Если ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		ИменаТаблиц.Добавить("ВыявленныеОтклоненияРаздел21");
		ИменаТаблиц.Добавить("ВыявленныеОтклоненияРаздел22");
		
	ИначеЕсли ИмяДокумента = "УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		ИменаТаблиц.Добавить("ВыявленныеОтклоненияРаздел21");
		ИменаТаблиц.Добавить("ВыявленныеОтклоненияРаздел22");
		
	Иначе
		ИменаТаблиц.Добавить("ВыявленныеОтклонения");
	КонецЕсли;
	
	Возврат ИменаТаблиц;
	
КонецФункции

Функция ПолучитьСтатусыЗадолженностиНеАктив0510468()
	
	СтатусыЗадолженностиНеАктив = Новый Массив();
	
	СтатусыЗадолженностиНеАктив.Добавить(Перечисления.СтатусыЗадолженности.СИстекшимСрокомДавности);
	
	Возврат СтатусыЗадолженностиНеАктив;
	
КонецФункции

// Сопоставление выявленных отклонений описей

Процедура СопоставитьВыявленныеОтклоненияОписей61н(СтрокаТаблицыОбъекты, ТаблицыДокумента, ИмяДокумента, ИмяТаблицыОтклонений, РезультатыСопоставления)
	
	ТекущаяОпись = Неопределено;
	
	ШапкаОписи = Неопределено;
	
	Для Каждого СтрокаОтклоненийОписей Из ТаблицыДокумента[ИмяТаблицыОтклонений] Цикл
		
		Если ТекущаяОпись <> СтрокаОтклоненийОписей.Ссылка Тогда
			ТекущаяОпись = СтрокаОтклоненийОписей.Ссылка;
			
			РезультатыСопоставления.ПоискОписиВДанныхОписей.Ссылка = ТекущаяОпись;
			
			ШапкаОписи = ТаблицыДокумента.Шапки.НайтиСтроки(РезультатыСопоставления.ПоискОписиВДанныхОписей)[0];
		КонецЕсли;
		
		Если СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н(ИмяДокумента, СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи) Тогда
			ДобавитьНомерСтрокиОписи61н(РезультатыСопоставления.СопоставленныеСтрокеРешения, СтрокаОтклоненийОписей, ШапкаОписи, РезультатыСопоставления, ИмяТаблицыОтклонений, Истина);
		Иначе
			ДобавитьНомерСтрокиОписи61н(РезультатыСопоставления.Несопоставленные, СтрокаОтклоненийОписей, ШапкаОписи, РезультатыСопоставления, ИмяТаблицыОтклонений);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н(ИмяДокумента, СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи)
	
	Если ИмяДокумента = "ИнвентаризационнаяОписьБСО" Тогда
		Возврат СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьБСО(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьНФА" Тогда
		Возврат СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьНФА(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьОстатковНаСчетах" Тогда
		Возврат СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьОстатковНаСчетах(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		Возврат СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи);
		
	ИначеЕсли ИмяДокумента = "УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		Возврат СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи);
		
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьБСО(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи)
	
	Возврат СтрокаТаблицыОбъекты.Сотрудник = ШапкаОписи.МОЛ
		И СтрокаТаблицыОбъекты.МестоИнвентаризации = ШапкаОписи.МестоИнвентаризации
		И СтрокаТаблицыОбъекты.Счет = ШапкаОписи.Счет
		И СтрокаТаблицыОбъекты.КФО = ШапкаОписи.КФО;
	
КонецФункции

Функция СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьНФА(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи)
	
	Возврат СтрокаТаблицыОбъекты.Сотрудник = ШапкаОписи.МОЛ
		И СтрокаТаблицыОбъекты.МестоИнвентаризации = СтрокаОтклоненийОписей.МестоИнвентаризации
		И СопоставленСчетВСтрокеОтклоненияОписи61н(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей)
		И СопоставленКФОВСтрокеОтклоненияОписи61н(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей);
	
КонецФункции

Функция СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьОстатковНаСчетах(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи)
	
	Возврат СтрокаТаблицыОбъекты.МестоИнвентаризации = ШапкаОписи.МестоИнвентаризации
		И СтрокаТаблицыОбъекты.КФО = ШапкаОписи.КФО
		И СтрокаТаблицыОбъекты.Счет = ШапкаОписи.Счет;
	
КонецФункции

Функция СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_ИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи)
	
	Возврат СтрокаТаблицыОбъекты.МестоИнвентаризации = ШапкаОписи.МестоИнвентаризации
		И СопоставленСчетВСтрокеОтклоненияОписи61н(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей)
		И СопоставленКФОВСтрокеОтклоненияОписи61н(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей);
	
КонецФункции

Функция СтрокаРешенияСопоставленаСВыявленнымОтклонениемОписи61н_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей, ШапкаОписи)
	
	Возврат СтрокаТаблицыОбъекты.МестоИнвентаризации = ШапкаОписи.МестоИнвентаризации
		И СтрокаТаблицыОбъекты.КФО = СтрокаТаблицыОбъекты.КФО
		И СтрокаТаблицыОбъекты.Счет = СтрокаТаблицыОбъекты.Счет;
	
КонецФункции

// Сопоставление отборов описей

Процедура СопоставитьОтборыОписей61н(СтрокаТаблицыОбъекты, ТаблицыДокумента, ИмяДокумента, РезультатыСопоставления, ДополнительныеПараметры)
	
	ФиктивнаяСтрокаОписи = Новый Структура("НомерСтроки", 0);
	
	Для Каждого ШапкаОписи Из ТаблицыДокумента.Шапки Цикл
		Если СтрокаРешенияСопоставленаСОтборомОписи61н(ИмяДокумента, СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры) Тогда
			ДобавитьНомерСтрокиОписи61н(РезультатыСопоставления.СопоставленныеСтрокеРешения, ФиктивнаяСтрокаОписи, ШапкаОписи, РезультатыСопоставления,,, Истина);
		Иначе
			ДобавитьНомерСтрокиОписи61н(РезультатыСопоставления.Несопоставленные, ФиктивнаяСтрокаОписи, ШапкаОписи, РезультатыСопоставления,,, Истина);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СтрокаРешенияСопоставленаСОтборомОписи61н(ИмяДокумента, СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры)
	
	// Опись считается сопоставленной, если поля связи в точности совпадают с полями строки Решения.
	// Если в описи поля связи указываются в табличной части, то сопоставление определяется
	// по наличию в табличной части значения из строки Решения.
	
	ТаблицыОтбораОписи = ПолучитьТаблицыОтбораОписи61н(ИмяДокумента, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры);
	
	РасположенияРеквизитовОписи = ДополнительныеПараметры.НастройкиИзТаблицыНастроекЗаполненияОписейПоРешению.СоответствиеИмяДокументаОписаниеРасположенияРеквизитовОписи.Получить(ИмяДокумента);
	
	Успех = СопоставленРеквизитОписи61н("Счет", СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыОтбораОписи, РасположенияРеквизитовОписи)
		И СопоставленРеквизитОписи61н("КФО", СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыОтбораОписи, РасположенияРеквизитовОписи)
		И СопоставленРеквизитОписи61н("Сотрудник", СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыОтбораОписи, РасположенияРеквизитовОписи)
		И СопоставленРеквизитОписи61н("МестоИнвентаризации", СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыОтбораОписи, РасположенияРеквизитовОписи);
	
	Если ИмяДокумента = "ИнвентаризационнаяОписьНФА" Тогда
		СтрокаРешенияСопоставленаСОтборомОписи61н_ИнвентаризационнаяОписьНФА(СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры, Успех);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		СтрокаРешенияСопоставленаСОтборомОписи61н_ИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры, Успех);
		
	ИначеЕсли ИмяДокумента = "УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		СтрокаРешенияСопоставленаСОтборомОписи61н_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры, Успех);
	КонецЕсли;
	
	Возврат Успех;
	
КонецФункции

Процедура СтрокаРешенияСопоставленаСОтборомОписи61н_ИнвентаризационнаяОписьНФА(СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры, Успех)
	
	// Заголовочные документы серии в акт инвентаризации не включаем.
	
	Если ЗначениеЗаполнено(ШапкаОписи.ИдентификаторСерииДокументов) И ШапкаОписи.ЭтоЗаголовочныйДокумент Тогда
		Успех = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура СтрокаРешенияСопоставленаСОтборомОписи61н_ИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры, Успех)
	
	// Заголовочные документы серии в акт инвентаризации не включаем.
	
	Если ЗначениеЗаполнено(ШапкаОписи.ИдентификаторСерииДокументов) И ШапкаОписи.ЭтоЗаголовочныйДокумент Тогда
		Успех = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура СтрокаРешенияСопоставленаСОтборомОписи61н_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры, Успех)
	
	// Заголовочные документы серии в акт инвентаризации не включаем.
	
	Если ЗначениеЗаполнено(ШапкаОписи.ИдентификаторСерииДокументов) И ШапкаОписи.ЭтоЗаголовочныйДокумент Тогда
		Успех = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицыОтбораОписи61н(ИмяДокумента, ШапкаОписи, ТаблицыДокумента, ДополнительныеПараметры)
	
	ИменаТаблицОтбора = ДополнительныеПараметры.НастройкиИзТаблицыНастроекЗаполненияОписейПоРешению.СоответствиеИмяДокументаИменаТаблицОтбора.Получить(ИмяДокумента);
	
	Поиск = Новый Структура("Ссылка", ШапкаОписи.Ссылка);
	
	ТаблицыОтбораОписи = Новый Структура();
	
	Для Каждого ИмяТаблицы Из ИменаТаблицОтбора Цикл
		ТаблицыОтбораОписи.Вставить(ИмяТаблицы, ТаблицыДокумента[ИмяТаблицы].Скопировать(Поиск));
	КонецЦикла;
	
	Возврат ТаблицыОтбораОписи;
	
КонецФункции

Функция СопоставленРеквизитОписи61н(ИмяРеквизита, СтрокаТаблицыОбъекты, ШапкаОписи, ТаблицыОтбораОписи, РасположенияРеквизитовОписи)
	
	ЗначениеРеквизитаВРешении = СтрокаТаблицыОбъекты[ИмяРеквизита];
	
	РасположениеРеквизита = РасположенияРеквизитовОписи[ИмяРеквизита];
	
	Если РасположениеРеквизита.РасположенВШапке Тогда
		Возврат ЗначениеРеквизитаВРешении = ШапкаОписи[РасположениеРеквизита.ИмяПоля];
		
	ИначеЕсли РасположениеРеквизита.РасположенВТабличнойЧасти Тогда
		Поиск = Новый Структура(РасположениеРеквизита.ИмяКолонки, ЗначениеРеквизитаВРешении);
		
		Если ЗначениеЗаполнено(РасположениеРеквизита.ИмяКолонкиПризнакИспользования) Тогда
			Поиск.Вставить(РасположениеРеквизита.ИмяКолонкиПризнакИспользования, "Истина");
		КонецЕсли;
		
		МассивСтрок = ТаблицыОтбораОписи[РасположениеРеквизита.ИмяТабличнойЧасти].НайтиСтроки(Поиск);
		
		Возврат (МассивСтрок.Количество() > 0);
		
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция СопоставленСчетВСтрокеОтклоненияОписи61н(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей)
	
	Если СтрокаТаблицыОбъекты.Счет = СтрокаОтклоненийОписей.Счет Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаОтклоненийОписей.СсылкиРодителейСчета.Количество() > 0
		И СтрокаОтклоненийОписей.СсылкиРодителейСчета.Найти(СтрокаТаблицыОбъекты.Счет) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СопоставленКФОВСтрокеОтклоненияОписи61н(СтрокаТаблицыОбъекты, СтрокаОтклоненийОписей)
	
	Если Не ЗначениеЗаполнено(СтрокаТаблицыОбъекты.КФО) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат (СтрокаТаблицыОбъекты.КФО = СтрокаОтклоненийОписей.КФО);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЗаполнениеПоОднойОписи

// Заполнение одного приложения по одной выбранной описи (при перемещении описи из раздела 1 в разделы 2, 3)

Функция ПолучитьДанныеЗаполненияПоОднойОписи(ДокументОбъект, Параметры)
	
	Перем ДополнительныеТаблицы;
	
	ОтборПоОписям = Новый Массив();
	ОтборПоОписям.Добавить(Параметры.Опись);
	
	ТЧРаздела = ДокументОбъект[ПолучитьИмяТабличнойЧастиРаздел(Параметры.НомерРаздела)];
	
	СтрокаРаздела = ТЧРаздела[Параметры.НомерСтрокиРаздела - 1];
	
	ТаблицаОбъекты = ПолучитьТаблицуОбъектыПриЗаполненииПоОднойОписи(СтрокаРаздела, ТЧРаздела);
	
	ДополнительныеПараметры = ПолучитьДополнительныеПараметрыДляЗаполненияПоОписям();
	
	ИмяДокумента = ОпределитьИмяДокумента(Параметры.Опись, ДополнительныеПараметры);
	
	ПринадлежностьОписиПриказам = ОпределитьПринадлежностьОписиПриказам(Параметры.Опись, ДополнительныеПараметры);
	
	Если ПринадлежностьОписиПриказам.Приказ52н Тогда
		ОпределитьМестаРегистрацииОписей52н(ДокументОбъект, ТаблицаОбъекты, ДополнительныеПараметры, ОтборПоОписям);
		
		МестаРегистрацииОписей = ДополнительныеПараметры.Описи52н.МестаРегистрацииОписей;
		
		ТаблицаОписей = ДополнительныеПараметры.Описи52н.ТаблицыОписей[ИмяДокумента];
		
	ИначеЕсли ПринадлежностьОписиПриказам.Приказ61н Тогда
		ОпределитьМестаРегистрацииОписей61н(ДокументОбъект, ТаблицаОбъекты, ДополнительныеПараметры, ОтборПоОписям);
		
		МестаРегистрацииОписей = ДополнительныеПараметры.Описи61н.РезультатыРасчета.МестаРегистрацииОписей;
		
		ТаблицаОписей = ДополнительныеПараметры.Описи61н.ТаблицыОписей[ИмяДокумента];
	КонецЕсли;
	
	УдалитьМестаРегистрацииОписейНеСоответствующиеНомеруПриложения(МестаРегистрацииОписей, Параметры.НомерРаздела, Параметры.НомерПриложения);
	
	ПараметрыДобавления = ПолучитьПараметрыДобавленияОписиВПриложение();
	
	ПараметрыДобавления.ИмяДокумента	= ИмяДокумента;
	ПараметрыДобавления.ТаблицаОписей	= ТаблицаОписей;
	ПараметрыДобавления.НомерРаздела	= Параметры.НомерРаздела;
	ПараметрыДобавления.НомерПриложения	= Параметры.НомерПриложения;
	ПараметрыДобавления.СтрокаРаздела	= СтрокаРаздела;
	
	Данные = ПолучитьПустуюСтруктуруДанныхДляЗаполненияПоОписям();
	
	Для Каждого МестоРегистрацииОписи Из МестаРегистрацииОписей Цикл
		ИмяКолонки = ПолучитьИмяКолонкиНомерПриложенияРаздела(Параметры.НомерРаздела);
		
		СтрокиТаблицыПриложений = ОпределитьСтрокиТаблицыПриложений(МестоРегистрацииОписи, ИмяКолонки);
		
		Для Каждого СтрокаТаблицыПриложений Из СтрокиТаблицыПриложений Цикл
			СтрокаТаблицыОбъекты = СтрокаТаблицыПриложений.СтрокаТаблицыОбъекты;
			
			// Добавляем строки в соответствующее приложение
			ПараметрыДобавления.МестоРегистрацииОписи	= МестоРегистрацииОписи;
			ПараметрыДобавления.СтрокаТаблицыОбъекты	= СтрокаТаблицыОбъекты;
			
			ДобавитьСтрокиОписиВПриложение(Данные.ТабличныеЧасти, ПараметрыДобавления, ДополнительныеПараметры);
		КонецЦикла;
	КонецЦикла;
	
	ЗаполнитьКодыСтрокДобавленныхСтрок(Данные.ТабличныеЧасти, СтрокаРаздела, Параметры.НомерРаздела, Параметры.НомерПриложения);
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьТаблицуОбъектыПриЗаполненииПоОднойОписи(СтрокаРаздела, ТЧРаздела)
	
	// При заполнении по одной описи считаем, что Решение представлено одной строкой.
	// Это текущая строка раздела. Считывать полность документ Решения не требуется.
	
	МассивСтрок = Новый Массив();
	МассивСтрок.Добавить(СтрокаРаздела);
	
	ТаблицаОбъекты = ТЧРаздела.Выгрузить(МассивСтрок);
	
	ТаблицаОбъекты.Колонки.ОтветственноеЛицо.Имя = "Сотрудник";
	
	ИнвентаризацияСервер.ЗаполнитьИменаДокументовВТаблицеОбъектыРешения(ТаблицаОбъекты);
	
	Возврат ТаблицаОбъекты;
	
КонецФункции

Функция ОпределитьПринадлежностьОписиПриказам(Опись, ДополнительныеПараметры)
	
	ИмяДокумента = ОпределитьИмяДокумента(Опись, ДополнительныеПараметры);
	
	ПринадлежностьИменДокументовПриказам = ДополнительныеПараметры.НастройкиИзТаблицыНастроекЗаполненияОписейПоРешению.ПринадлежностьИменДокументовПриказам;
	
	ПринадлежностьОписиПриказам = Новый Структура();
	ПринадлежностьОписиПриказам.Вставить("Приказ52н",	ПринадлежностьИменДокументовПриказам.Приказ52н.Найти(ИмяДокумента) <> Неопределено);
	ПринадлежностьОписиПриказам.Вставить("Приказ61н",	ПринадлежностьИменДокументовПриказам.Приказ61н.Найти(ИмяДокумента) <> Неопределено);
	
	Возврат ПринадлежностьОписиПриказам;
	
КонецФункции

Процедура УдалитьМестаРегистрацииОписейНеСоответствующиеНомеруПриложения(МестаРегистрацииОписей, НомерРаздела, НомерПриложения)
	
	Поиск = Новый Структура(ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела), Ложь);
	
	МассивСтрок = МестаРегистрацииОписей.НайтиСтроки(Поиск);
	
	Для Каждого УдаляемаяСтрока Из МассивСтрок Цикл
		МестаРегистрацииОписей.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
	Поиск = Новый Структура("НомерПриложенияРаздела" + НомерРаздела, НомерПриложения);
	
	Для Каждого СтрокаТаблицы Из МестаРегистрацииОписей Цикл
		СтрокаТаблицы.ТаблицаПриложений = СтрокаТаблицы.ТаблицаПриложений.Скопировать(Поиск);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКодыСтрокДобавленныхСтрок(ДокументОбъект, СтрокаРаздела, НомерРаздела, НомерПриложения)
	
	ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
	
	ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
	
	МаксимальныеПорядковыеНомера = ПолучитьМаксимальныеПорядковыеНомера(ТЧПриложения);
	
	МаксНомер = МаксимальныеПорядковыеНомера.Получить(СтрокаРаздела.НомерСтроки);
	
	Если МаксНомер = Неопределено Тогда
		МаксНомер = 0;
	КонецЕсли;
	
	ПорядковыйНомер = МаксНомер;
	
	Поиск = Новый Структура("ИдентификаторСтроки,ПорядковыйНомер",
		СтрокаРаздела.ИдентификаторСтроки,
		0);
	
	МассивСтрок = ТЧПриложения.НайтиСтроки(Поиск);
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
		СтрокаТаблицы.КодСтроки				= ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(СтрокаРаздела.НомерСтроки, ПорядковыйНомер);
		СтрокаТаблицы.НомерСтрокиРаздела	= СтрокаРаздела.НомерСтроки;
		СтрокаТаблицы.ПорядковыйНомер		= ПорядковыйНомер;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстыЗапросовЗаполнения

#Область Описи52н

//+подр
Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияЦенныхБумаг(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияЦенныхБумаг");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияЦенныхБумаг
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Ссылка.МОЛ					КАК ОтветственноеЛицо,
	|	Неопределено				КАК КФО,
	|	Неопределено				КАК Счет,
	|	Неопределено				КАК КПС,
	|	""ЦенныеБумаги""				КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|
	|	Ссылка.ВидЦеннойБумаги					КАК ВидЦеннойБумаги,
	|	ЦеннаяБумага							КАК ЦеннаяБумага,
	|	Валюта									КАК	Валюта,
	|	Курс									КАК	Курс,
	|	Кратность								КАК	Кратность,
	|	КоличествоНедостача						КАК	КоличествоНедостача,
	|	КоличествоИзлишки						КАК	КоличествоИзлишки,
	|	НоминальнаяСтоимостьНедостача			КАК НоминальнаяСтоимостьНедостача,
	|	НоминальнаяСтоимостьВалютнаяНедостача	КАК	НоминальнаяСтоимостьВалютнаяНедостача,
	|	НоминальнаяСтоимостьИзлишки				КАК	НоминальнаяСтоимостьИзлишки,
	|	НоминальнаяСтоимостьВалютнаяИзлишки		КАК	НоминальнаяСтоимостьВалютнаяИзлишки,
	|	КурсНаДатуВалютирования					КАК	КурсНаДатуВалютирования,
	|	КратностьНаДатуВалютирования			КАК	КратностьНаДатуВалютирования
	|ИЗ
	|	Документ.ИнвентаризацияЦенныхБумаг.ЦенныеБумаги
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияОстатковНаСчетах(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияОстатковНаСчетах");
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияОстатковНаСчетах_СписокСчетов");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияОстатковНаСчетах
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Неопределено				КАК ОтветственноеЛицо,
	|	Ссылка.КФО					КАК КФО,
	|	""Дополнительная таблица""	КАК Счет,
	|	Неопределено				КАК КПС,
	|	""Остатки""					КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|	
	|	ЛицевойСчет					КАК ЛицевойСчет,
	|	РазделЛицевогоСчета			КАК РазделЛицевогоСчета,
	|	РеквизитыЛицевогоСчета		КАК РеквизитыЛицевогоСчета,
	|	КассовыйОрган				КАК КассовыйОрган,
	|	НомерЛицевогоСчета			КАК НомерЛицевогоСчета,
	|	Валюта						КАК Валюта,
	|	СуммаВал					КАК СуммаВал,
	|	СуммаРУ						КАК СуммаРУ,
	|	Курс						КАК Курс,
	|	Кратность					КАК Кратность
	|ИЗ
	|	Документ.ИнвентаризацияОстатковНаСчетах.Остатки
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Список счетов документа ИнвентаризацияОстатковНаСчетах (дополнительная таблица СписокСчетов)
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Опись,
	|	Счет	КАК Счет
	|ИЗ
	|	Документ.ИнвентаризацияОстатковНаСчетах.СписокСчетов
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И УчаствуетВРасчетах
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

//+подр
Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияКредитовИЗаймов(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияКредитовИЗаймов");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияКредитовИЗаймов
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Неопределено				КАК ОтветственноеЛицо,
	|	КФО							КАК КФО,
	|	Счет						КАК Счет,
	|	КПС							КАК КПС,
	|	""Задолженность""				КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|
	|	Контрагент								КАК Контрагент,
	|	Договор									КАК Договор,
	|	Валюта									КАК Валюта,
	|	
	|	// Раздел 2
	|	Ссылка.НаименованиеЗадолженности		КАК НаименованиеЗадолженности,
	|	СуммаОДНеподтвержденнаяВалютная			КАК СуммаОДНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная					КАК СуммаОДНеподтвержденная,
	|	СуммаПроцентовНеподтвержденнаяВалютная	КАК СуммаПроцентовНеподтвержденнаяВалютная,
	|	СуммаПроцентовНеподтвержденная			КАК СуммаПроцентовНеподтвержденная,
	|	СуммаШтрафовНеподтвержденнаяВалютная	КАК СуммаШтрафовНеподтвержденнаяВалютная,
	|	СуммаШтрафовНеподтвержденная			КАК СуммаШтрафовНеподтвержденная,
	|	СуммаПенейНеподтвержденнаяВалютная		КАК СуммаПенейНеподтвержденнаяВалютная,
	|	СуммаПенейНеподтвержденная				КАК СуммаПенейНеподтвержденная,
	|	СуммаПроцентовНеподтвержденная
	|		+ СуммаШтрафовНеподтвержденная
	|		+ СуммаПенейНеподтвержденная		КАК СуммаИтогоНеподтвержденная,
	|	
	|	// Раздел 3
	|	СуммаОДПросроченнаяВалютная				КАК СуммаОДПросроченнаяВалютная,
	|	СуммаОДПросроченная						КАК СуммаОДПросроченная,
	|	СуммаПроцентовПросроченнаяВалютная		КАК СуммаПроцентовПросроченнаяВалютная,
	|	СуммаПроцентовПросроченная				КАК СуммаПроцентовПросроченная,
	|	СуммаШтрафовПросроченнаяВалютная		КАК СуммаШтрафовПросроченнаяВалютная,
	|	СуммаШтрафовПросроченная				КАК СуммаШтрафовПросроченная,
	|	СуммаПенейПросроченнаяВалютная			КАК СуммаПенейПросроченнаяВалютная,
	|	СуммаПенейПросроченная					КАК СуммаПенейПросроченная	
	|ИЗ
	|	Документ.ИнвентаризацияКредитовИЗаймов.Задолженность
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияГосдолгаВЦенныхБумагах(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияГосдолгаВЦенныхБумагах", 1);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Виды задолженности из табличной части (подготовка)
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Валюта = &ВалютаРУ ИЛИ Счет В (&СчетаВнутреннийДолг0504084) ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ)						КАК ВидЗадолженности,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|		КОГДА Валюта = &ВалютаРУ ИЛИ Счет В (&СчетаВнутреннийДолг0504084) ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ)						КАК КоличествоРазличныхЗначений
	|ПОМЕСТИТЬ
	|	ИнвентаризацияГосдолгаВЦенныхБумагахВидыЗадолженности
	|ИЗ
	|	Документ.ИнвентаризацияГосдолгаВЦенныхБумагах.Задолженность
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Табличные части документа ИнвентаризацияГосдолгаВЦенныхБумагах
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Задолженность.Ссылка						КАК Опись,
	|	Задолженность.Ссылка.Дата					КАК ДатаОписи,
	|	Задолженность.Ссылка.Номер					КАК НомерОписи,
	|	Задолженность.Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Задолженность.Ссылка.ЗаключениеКомиссии		КАК ЗаключениеКомиссии,
	|	Неопределено								КАК ОтветственноеЛицо,
	|	КФО											КАК КФО,
	|	Счет										КАК Счет,
	|	КПС											КАК КПС,
	|	""Задолженность""								КАК ИмяТабличнойЧасти,
	|	НомерСтроки									КАК НомерСтроки,
	|	
	|	Договор										КАК Договор,
	|	Валюта										КАК Валюта,
	|	
	|	// Раздел 2
	|	ВЫБОР
	|		КОГДА Ссылка.СчетУчета В(&СчетаВнутреннийДолг0504084) ТОГДА
	|			1
	|		КОГДА Ссылка.СчетУчета В(&СчетаВнешнийДолг0504084) ТОГДА
	|			2
	|		КОГДА ЕСТЬNULL(ВидыЗадолженности.КоличествоРазличныхЗначений, 0) = 1 ТОГДА
	|			ВидыЗадолженности.ВидЗадолженности
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ											КАК ВидЗадолженности,
	|	СуммаОДНеподтвержденнаяВалютная					КАК СуммаОДНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная							КАК СуммаОДНеподтвержденная,
	|	СуммаПроцентовНеподтвержденнаяВалютная			КАК СуммаПроцентовНеподтвержденнаяВалютная,
	|	СуммаПроцентовНеподтвержденная					КАК СуммаПроцентовНеподтвержденная,
	|	СуммаОДНеподтвержденнаяВалютная
	|		+ СуммаПроцентовНеподтвержденнаяВалютная	КАК СуммаИтогоНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная
	|		+ СуммаПроцентовНеподтвержденная			КАК СуммаИтогоНеподтвержденная,
	|	
	|	// Раздел 3
	|	СуммаОДПросроченнаяВалютная						КАК СуммаОДПросроченнаяВалютная,
	|	СуммаОДПросроченная								КАК СуммаОДПросроченная,
	|	СуммаПроцентовПросроченнаяВалютная				КАК СуммаПроцентовПросроченнаяВалютная,
	|	СуммаПроцентовПросроченная						КАК СуммаПроцентовПросроченная	
	|ИЗ
	|	Документ.ИнвентаризацияГосдолгаВЦенныхБумагах.Задолженность КАК Задолженность
	|	ЛЕВОЕ СОЕДИНЕНИЕ ИнвентаризацияГосдолгаВЦенныхБумагахВидыЗадолженности КАК ВидыЗадолженности
	|		ПО Задолженность.Ссылка = ВидыЗадолженности.Ссылка
	|ГДЕ
	|	Задолженность.Ссылка.Проведен
	|	И Задолженность.Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Задолженность.Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Задолженность.Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Задолженность.Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияГосдолгаПоКредитамИГарантиям(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияГосдолгаПоКредитамИГарантиям", 1);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Виды задолженности из табличной части (подготовка)
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА Валюта = &ВалютаРУ ИЛИ Счет В (&СчетаВнутреннийДолг0504085) ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ)						КАК ВидЗадолженности,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|		КОГДА Валюта = &ВалютаРУ ИЛИ Счет В (&СчетаВнутреннийДолг0504085) ТОГДА
	|			1
	|		ИНАЧЕ
	|			2
	|	КОНЕЦ)						КАК КоличествоРазличныхЗначений
	|ПОМЕСТИТЬ
	|	ИнвентаризацияГосдолгаПоКредитамИГарантиямВидыЗадолженности
	|ИЗ
	|	Документ.ИнвентаризацияГосдолгаПоКредитамИГарантиям.Задолженность
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Табличные части документа ИнвентаризацияГосдолгаПоКредитамИГарантиям
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Задолженность.Ссылка						КАК Опись,
	|	Задолженность.Ссылка.Дата					КАК ДатаОписи,
	|	Задолженность.Ссылка.Номер					КАК НомерОписи,
	|	Задолженность.Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Задолженность.Ссылка.ЗаключениеКомиссии		КАК ЗаключениеКомиссии,
	|	Неопределено								КАК ОтветственноеЛицо,
	|	КФО											КАК КФО,
	|	Счет										КАК Счет,
	|	КПС											КАК КПС,
	|	""Задолженность""								КАК ИмяТабличнойЧасти,
	|	НомерСтроки									КАК НомерСтроки,
	|	
	|	Контрагент										КАК Контрагент,
	|	Договор											КАК Договор,
	|	ЗаемщикПоГарантии								КАК ЗаемщикПоГарантии,
	|	Валюта											КАК Валюта,
	|	
	|	// Раздел 2
	|	ВЫБОР
	|		КОГДА Задолженность.Ссылка.ВидЗадолженности = 1 ТОГДА
	|			1
	|		КОГДА Задолженность.Ссылка.ВидЗадолженности = 2 ТОГДА
	|			2
	|		КОГДА ЕСТЬNULL(ВидыЗадолженности.КоличествоРазличныхЗначений, 0) = 1 ТОГДА
	|			ВидыЗадолженности.ВидЗадолженности
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ											КАК ВидЗадолженности,
	|	СуммаОДНеподтвержденнаяВалютная					КАК СуммаОДНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная							КАК СуммаОДНеподтвержденная,
	|	СуммаПроцентовНеподтвержденнаяВалютная			КАК СуммаПроцентовНеподтвержденнаяВалютная,
	|	СуммаПроцентовНеподтвержденная					КАК СуммаПроцентовНеподтвержденная,
	|	СуммаОДНеподтвержденнаяВалютная
	|		+ СуммаПроцентовНеподтвержденнаяВалютная	КАК СуммаИтогоНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная
	|		+ СуммаПроцентовНеподтвержденная			КАК СуммаИтогоНеподтвержденная,
	|	
	|	// Раздел 3
	|	СуммаОДПросроченнаяВалютная						КАК СуммаОДПросроченнаяВалютная,
	|	СуммаОДПросроченная								КАК СуммаОДПросроченная,
	|	СуммаПроцентовПросроченнаяВалютная				КАК СуммаПроцентовПросроченнаяВалютная,
	|	СуммаПроцентовПросроченная						КАК СуммаПроцентовПросроченная	
	|ИЗ
	|	Документ.ИнвентаризацияГосдолгаПоКредитамИГарантиям.Задолженность КАК Задолженность
	|	ЛЕВОЕ СОЕДИНЕНИЕ ИнвентаризацияГосдолгаПоКредитамИГарантиямВидыЗадолженности КАК ВидыЗадолженности
	|		ПО Задолженность.Ссылка = ВидыЗадолженности.Ссылка
	|ГДЕ
	|	Задолженность.Ссылка.Проведен
	|	И Задолженность.Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Задолженность.Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Задолженность.Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Задолженность.Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияКассы(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияКассы");
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияКассы_СписокСчетов");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияКассы
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Ссылка.МОЛ					КАК ОтветственноеЛицо,
	|	Неопределено				КАК КФО,
	|	""Дополнительная таблица""	КАК Счет,
	|	Неопределено				КАК КПС,
	|	""ДенежныеДокументы""			КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|	
	|	2							КАК ВидДокумента,
	|	
	|	ВидДенежногоДокумента		КАК ВидДенежногоДокумента,
	|	ДенежныйДокумент			КАК ДенежныйДокумент,
	|	
	|	Неопределено				КАК БСО,
	|	Неопределено				КАК Серия,
	|	
	|	НедостачаКоличество			КАК НедостачаКоличество,
	|	НедостачаСумма				КАК НедостачаСумма,
	|	ИзлишекКоличество			КАК ИзлишекКоличество,
	|	ИзлишекСумма				КАК ИзлишекСумма,
	|	
	|	0							КАК НедостачаНачальныйНомер,
	|	0							КАК НедостачаКонечныйНомер,
	|	0							КАК ИзлишекНачальныйНомер,
	|	0							КАК ИзлишекКонечныйНомер
	|ИЗ
	|	Документ.ИнвентаризацияКассы.ДенежныеДокументы
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Ссылка.МОЛ					КАК ОтветственноеЛицо,
	|	Неопределено				КАК КФО,
	|	ВЫБОР
	|		КОГДА Ссылка.СчетУчетаБСО <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка) ТОГДА
	|			Ссылка.СчетУчетаБСО
	|		ИНАЧЕ
	|			&Счет03
	|	КОНЕЦ						КАК Счет,
	|	Неопределено				КАК КПС,
	|	""СоставБСО""					КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|	
	|	1							КАК ВидДокумента,
	|	
	|	Неопределено				КАК ВидДенежногоДокумента,
	|	Неопределено				КАК ДенежныйДокумент,
	|	
	|	БСО							КАК БСО,
	|	Серия						КАК Серия,
	|	
	|	Недостача					КАК НедостачаКоличество,
	|	Недостача					КАК НедостачаСумма,
	|	Излишек						КАК ИзлишекКоличество,
	|	Излишек						КАК ИзлишекСумма,
	|	
	|	// Поля БСО
	|	ВЫБОР
	|		КОГДА Недостача <> 0 ТОГДА
	|			НачальныйНомерУчет
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ						КАК НедостачаНачальныйНомер,
	|	ВЫБОР
	|		КОГДА Недостача <> 0 ТОГДА
	|			КонечныйНомерУчет
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ						КАК НедостачаКонечныйНомер,
	|	ВЫБОР
	|		КОГДА Излишек <> 0 ТОГДА
	|			НачальныйНомерФакт
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ						КАК ИзлишекНачальныйНомер,
	|	ВЫБОР
	|		КОГДА Излишек <> 0 ТОГДА
	|			КонечныйНомерФакт
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ						КАК ИзлишекКонечныйНомер
	|ИЗ
	|	Документ.ИнвентаризацияКассы.СоставБСО
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Список счетов документа ИнвентаризацияКассы (дополнительная таблица СписокСчетов)
	|//
	|ВЫБРАТЬ
	|	Ссылка		КАК Опись,
	|	&Счет20135	КАК Счет
	|ИЗ
	|	Документ.ИнвентаризацияКассы
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ссылка		КАК Опись,
	|	&Счет08		КАК Счет
	|ИЗ
	|	Документ.ИнвентаризацияКассы
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияИК(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияИК");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияИК
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка								КАК Опись,
	|	Ссылка.Дата							КАК ДатаОписи,
	|	Ссылка.Номер						КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации			КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии			КАК ЗаключениеКомиссии,
	|	Ссылка.ЦМО							КАК ОтветственноеЛицо,
	|	ЗНАЧЕНИЕ(Перечисление.КВД.Бюджет)	КАК КФО,
	|	Счет								КАК Счет,
	|	КПС									КАК КПС,
	|	""Инвентаризация""					КАК ИмяТабличнойЧасти,
	|	НомерСтроки							КАК НомерСтроки,
	|
	|	ВЫБОР
	|		КОГДА Ссылка.Счет В(&СчетаМЗ) ТОГДА
	|			Номенклатура
	|		ИНАЧЕ
	|			ОсновноеСредство
	|	КОНЕЦ								КАК НФА,
	|	ВЫБОР
	|		КОГДА Ссылка.Счет В(&СчетаМЗ) ТОГДА
	|			ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|		ИНАЧЕ
	|			ИнвентарныйНомер
	|	КОНЕЦ								КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА Ссылка.Счет В(&СчетаМЗ) ТОГДА
	|			Номенклатура.ЕдиницаИзмерения.Представление
	|		ИНАЧЕ
	|			&ЕдИзмШт
	|	КОНЕЦ								КАК ЕдИзм,
	|	
	|	НедостачаКоличество					КАК НедостачаКоличество,
	|	НедостачаСумма						КАК НедостачаСумма,
	|	ИзлишекКоличество					КАК ИзлишекКоличество,
	|	ИзлишекСумма						КАК ИзлишекСумма,
	|	КоличествоНеСоответствует			КАК КоличествоНеСоответствует,
	|	СуммаНеСоответствует				КАК СуммаНеСоответствует
	|ИЗ
	|	Документ.ИнвентаризацияИК.Инвентаризация
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияМЗ(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияМЗ");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияМЗ
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Ссылка.ЦМО					КАК ОтветственноеЛицо,
	|	КФО							КАК КФО,
	|	Счет						КАК Счет,
	|	КПС							КАК КПС,
	|	""Материалы""					КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|
	|	// Аналогично печати 0504087
	|	Номенклатура									КАК НФА,
	|	ЕСТЬNULL(Номенклатура.НоменклатурныйНомер, """")	КАК НоменклатурныйНомер,
	|	ЕСТЬNULL(Номенклатура.Код, """")					КАК КодЭлемента,
	|	ЛОЖЬ											КАК НФАЭтоОС,
	|	Субконто3										КАК Субконто3,
	|	ЕдИзм											КАК ЕдИзм,
	|	
	|	НедостачаКоличество			КАК НедостачаКоличество,
	|	НедостачаСумма				КАК НедостачаСумма,
	|	ИзлишекКоличество			КАК ИзлишекКоличество,
	|	ИзлишекСумма				КАК ИзлишекСумма,
	|	КоличествоНеСоответствует	КАК КоличествоНеСоответствует,
	|	СуммаНеСоответствует		КАК СуммаНеСоответствует
	|ИЗ
	|	Документ.ИнвентаризацияМЗ.Материалы
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияОС(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияОС");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияОС
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Ссылка.ЦМО					КАК ОтветственноеЛицо,
	|	КФО							КАК КФО,
	|	Счет						КАК Счет,
	|	КПС							КАК КПС,
	|	""Инвентаризация""			КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|
	|	ОсновноеСредство			КАК НФА,
	|	ИнвентарныйНомер			КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА ЕдИзм <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) ТОГДА
	|			ЕдИзм
	|		ИНАЧЕ
	|			&ЕдИзмШт
	|	КОНЕЦ						КАК ЕдИзм,
	|	
	|	КоличествоНедостач			КАК НедостачаКоличество,
	|	СуммаНедостач				КАК НедостачаСумма,
	|	КоличествоИзлишков			КАК ИзлишекКоличество,
	|	СуммаИзлишков				КАК ИзлишекСумма,
	|	КоличествоНеСоответствует	КАК КоличествоНеСоответствует,
	|	СуммаНеСоответствует		КАК СуммаНеСоответствует
	|ИЗ
	|	Документ.ИнвентаризацияОС.Инвентаризация
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияРасчетовСКонтрагентами(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияРасчетовСКонтрагентами");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияРасчетовСКонтрагентами
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Неопределено				КАК ОтветственноеЛицо,
	|	КФО							КАК КФО,
	|	Счет						КАК Счет,
	|	КПС							КАК КПС,
	|	КЭК							КАК КЭК,
	|	""ДебиторскаяЗадолженность""	КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|	
	|	Ссылка.ВидРасчетов										КАК ВидРасчетов,
	|	Контрагент												КАК Контрагент,
	|	Договор													КАК Договор,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Дебиторская)	КАК ВидЗадолженности,
	|	НеПодтверждено											КАК НеПодтверждено,
	|	ИстекСрокДавности										КАК ИстекСрокДавности
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовСКонтрагентами.ДебиторскаяЗадолженность
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Неопределено				КАК ОтветственноеЛицо,
	|	КФО							КАК КФО,
	|	Счет						КАК Счет,
	|	КПС							КАК КПС,
	|	КЭК							КАК КЭК,
	|	""КредиторскаяЗадолженность""	КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|	
	|	Ссылка.ВидРасчетов										КАК ВидРасчетов,
	|	Контрагент												КАК Контрагент,
	|	Договор													КАК Договор,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская)	КАК ВидЗадолженности,
	|	НеПодтверждено											КАК НеПодтверждено,
	|	ИстекСрокДавности										КАК ИстекСрокДавности
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовСКонтрагентами.КредиторскаяЗадолженность
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризацияРасчетовПоПоступлениям(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "ИнвентаризацияРасчетовПоПоступлениям");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличные части документа ИнвентаризацияРасчетовПоПоступлениям
	|//
	|ВЫБРАТЬ
	|	// Стандартный блок полей (11)
	|	Ссылка						КАК Опись,
	|	Ссылка.Дата					КАК ДатаОписи,
	|	Ссылка.Номер				КАК НомерОписи,
	|	Ссылка.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Ссылка.ЗаключениеКомиссии	КАК ЗаключениеКомиссии,
	|	Неопределено				КАК ОтветственноеЛицо,
	|	КФО							КАК КФО,
	|	Счет						КАК Счет,
	|	КПС							КАК КПС,
	|	КЭК							КАК КЭК,
	|	""Задолженность""				КАК ИмяТабличнойЧасти,
	|	НомерСтроки					КАК НомерСтроки,
	|	
	|	Контрагент					КАК Контрагент,
	|	Договор						КАК Договор,
	|	НеПодтверждено				КАК НеПодтверждено,
	|	ИстекСрокДавности			КАК ИстекСрокДавности
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям.Задолженность
	|ГДЕ
	|	Ссылка.Проведен
	|	И Ссылка.РешениеОПроведенииИнвентаризации = &Решение
	|	И Ссылка.ДатаИнвентаризации = &ДатаИнвентаризации
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Ссылка.Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|";
	
КонецФункции

#КонецОбласти

#Область Описи61н

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьБСО(ИндексыТаблиц)
	
	ПрефиксИмениТаблицы = "ИнвентаризационнаяОписьБСО_";
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "Шапки", 1);				// [1].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "ВыявленныеОтклонения");	// [2].
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Подходящие документы описей ИнвентаризационнаяОписьБСО
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	ПодходящиеДокументыИнвентаризационнаяОписьБСО
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьБСО
	|ГДЕ
	|	// Стандартный отбор
	|	Проведен
	|	И РешениеОПроведенииИнвентаризации = &Решение
	|	И ДатаИнвентаризации = &ДатаИнвентаризации
	|	И НомерКомиссии = &НомерКомиссии
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Шапки документов ИнвентаризационнаяОписьБСО
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка					КАК Ссылка,
	|	Док.Номер					КАК Номер,
	|	Док.Дата					КАК Дата,
	|	Док.МОЛ						КАК МОЛ,
	|	Док.КФО						КАК КФО,
	|	Док.Счет					КАК Счет,
	|	Док.МестоИнвентаризации		КАК МестоИнвентаризации,
	|	Док.ВидДокумента			КАК ВидДокумента,
	|	Док.ВыявленыОтклонения		КАК ВыявленыОтклонения,
	|	Док.ВыявленыОшибкиУчета		КАК ВыявленыОшибкиУчета
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьБСО КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьБСО КАК ПодходящиеДокументы
	|		ПО	Док.Ссылка = ПодходящиеДокументы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Выявленные отклонения документов ИнвентаризационнаяОписьБСО
	|//
	|ВЫБРАТЬ
	|	ТЧРаздел4.Ссылка								КАК Ссылка,
	|	ТЧРаздел4.НомерСтроки							КАК НомерСтроки,
	|	ТЧРаздел4.КодСтроки								КАК КодСтроки,
	|	ТЧРаздел4.ВидДенежногоДокумента					КАК ВидДенежногоДокумента,
	|	ТЧРаздел4.ДенежныйДокумент						КАК ДенежныйДокумент,
	|	ТЧРаздел4.БСО									КАК БСО,
	|	ТЧРаздел4.Серия									КАК Серия,
	|	ТЧРаздел4.ЕдИзм									КАК ЕдИзм,
	|	ТЧРаздел4.Цена									КАК Цена,
	|	ТЧРаздел4.НачальныйНомерНеСоответствует			КАК НачальныйНомерНеСоответствует,
	|	ТЧРаздел4.КонечныйНомерНеСоответствует			КАК КонечныйНомерНеСоответствует,
	|	ТЧРаздел4.КоличествоНеСоответствует				КАК КоличествоНеСоответствует,
	|	ТЧРаздел4.СуммаНеСоответствует					КАК СуммаНеСоответствует,
	|	ТЧРаздел4.Статус								КАК Статус,
	|	ТЧРаздел4.СтатусОбъяснения						КАК СтатусОбъяснения,
	|	ТЧРаздел4.НачальныйНомерИзлишкиНеПодтверждено	КАК НачальныйНомерИзлишкиНеПодтверждено,
	|	ТЧРаздел4.КонечныйНомерИзлишкиНеПодтверждено	КАК КонечныйНомерИзлишкиНеПодтверждено,
	|	ТЧРаздел4.КоличествоИзлишкиНеПодтверждено		КАК КоличествоИзлишкиНеПодтверждено,
	|	ТЧРаздел4.СуммаИзлишкиНеПодтверждено			КАК СуммаИзлишкиНеПодтверждено,
	|	ТЧРаздел4.НачальныйНомерНедостачаНеПодтверждено	КАК НачальныйНомерНедостачаНеПодтверждено,
	|	ТЧРаздел4.КонечныйНомерНедостачаНеПодтверждено	КАК КонечныйНомерНедостачаНеПодтверждено,
	|	ТЧРаздел4.КоличествоНедостачаНеПодтверждено		КАК КоличествоНедостачаНеПодтверждено,
	|	ТЧРаздел4.СуммаНедостачаНеПодтверждено			КАК СуммаНедостачаНеПодтверждено,
	|	ТЧРаздел4.ЗаключениеКомиссии					КАК ЗаключениеКомиссии
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьБСО КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьБСО КАК ПодходящиеДокументы
	|		ПО	Док.ВыявленыОтклонения
	|		И	Док.Ссылка = ПодходящиеДокументы.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнвентаризационнаяОписьБСО.Раздел4 КАК ТЧРаздел4
	|		ПО	Док.Ссылка = ТЧРаздел4.Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьНФА(ИндексыТаблиц)
	
	ПрефиксИмениТаблицы = "ИнвентаризационнаяОписьНФА_";
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "Шапки", 2);				// [2].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "ВыявленныеОтклонения");	// [3].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "СписокСчетов");			// [4].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "МестаИнвентаризации");	// [5].
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Подходящие документы описей ИнвентаризационнаяОписьНФА
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	ПодходящиеДокументыИнвентаризационнаяОписьНФА
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьНФА
	|ГДЕ
	|	// Стандартный отбор
	|	Проведен
	|	И РешениеОПроведенииИнвентаризации = &Решение
	|	И ДатаИнвентаризации = &ДатаИнвентаризации
	|	И НомерКомиссии = &НомерКомиссии
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Связь разделов 1 и 4 документов ИнвентаризационнаяОписьНФА
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка									КАК Ссылка,
	|	ТЧРаздел4.НомерСтроки						КАК НомерСтрокиРаздела4,
	|	ЕСТЬNULL(МИНИМУМ(ТЧРаздел1.НомерСтроки), 0)	КАК НомерСтрокиРаздела1
	|ПОМЕСТИТЬ
	|	СвязьРазделов1и4ИнвентаризационнаяОписьНФА
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьНФА КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьНФА КАК ПодходящиеДокументы
	|		ПО	Док.ВыявленыОтклонения
	|		И	Док.Ссылка	= ПодходящиеДокументы.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнвентаризационнаяОписьНФА.Раздел4 КАК ТЧРаздел4
	|		ПО	Док.ВыявленыОтклонения
	|		И	Док.Ссылка	= ТЧРаздел4.Ссылка
	|	// Левое соединение применяется для выбора излишков, отсутствующих в разделе 1.
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризационнаяОписьНФА.Раздел1 КАК ТЧРаздел1
	|		ПО	ТЧРаздел4.Ссылка				= ТЧРаздел1.Ссылка
	|		И	ТЧРаздел4.НФА					= ТЧРаздел1.НФА
	|		И	ТЧРаздел4.ИнвентарныйНомер		= ТЧРаздел1.ИнвентарныйНомер
	|		И	ТЧРаздел4.МестоИнвентаризации	= ТЧРаздел1.МестоИнвентаризации
	|СГРУППИРОВАТЬ ПО
	|	Док.Ссылка,
	|	ТЧРаздел4.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Шапки документов ИнвентаризационнаяОписьНФА
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка										КАК Ссылка,
	|	Док.Номер										КАК Номер,
	|	Док.Дата										КАК Дата,
	|	Док.МОЛ											КАК МОЛ,
	|	Док.ВыявленыОтклонения							КАК ВыявленыОтклонения,
	|	// Серии документов.
	|	Док.ИдентификаторСерииДокументов				КАК ИдентификаторСерииДокументов,
	|	Док.ЭтоЗаголовочныйДокумент						КАК ЭтоЗаголовочныйДокумент,
	|	Док.НомерЗаголовочногоДокумента					КАК НомерЗаголовочногоДокумента,
	|	Док.ПорядковыйНомерДокументаВСерииДокументов	КАК ПорядковыйНомерДокументаВСерииДокументов,
	|	Док.КоличествоДокументовВСерииДокументов		КАК КоличествоДокументовВСерииДокументов
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьНФА КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьНФА КАК ПодходящиеДокументы
	|		ПО	Док.Ссылка = ПодходящиеДокументы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Выявленные отклонения документов ИнвентаризационнаяОписьНФА
	|//
	|ВЫБРАТЬ
	|	СвязьРазделов1и4.Ссылка						КАК Ссылка,
	|	СвязьРазделов1и4.НомерСтрокиРаздела4		КАК НомерСтроки,
	|	СвязьРазделов1и4.НомерСтрокиРаздела1		КАК НомерСтрокиРаздела1,
	|	
	|	ТЧРаздел1.Счет								КАК Счет,
	|	ТЧРаздел1.КФО								КАК КФО,
	|	ТЧРаздел1.КПС								КАК КПС,
	|	
	|	ТЧРаздел4.КодСтроки							КАК КодСтроки,
	|	ТЧРаздел4.НФА								КАК НФА,
	|	ТЧРаздел4.ИнвентарныйНомер					КАК ИнвентарныйНомер,
	|	ТЧРаздел4.ЕдИзм								КАК ЕдИзм,
	|	ТЧРаздел4.МестоИнвентаризации				КАК МестоИнвентаризации,
	|	ТЧРаздел4.СтатусОбъяснения					КАК СтатусОбъяснения,
	|	ТЧРаздел4.КоличествоНедостачаНеПодтверждено	КАК КоличествоНедостачаНеПодтверждено,
	|	ТЧРаздел4.СуммаНедостачаНеПодтверждено		КАК СуммаНедостачаНеПодтверждено,
	|	ТЧРаздел4.КоличествоИзлишкиНеПодтверждено	КАК КоличествоИзлишкиНеПодтверждено,
	|	ТЧРаздел4.КоличествоНеСоответствует			КАК КоличествоНеСоответствует,
	|	ТЧРаздел4.СуммаНеСоответствует				КАК СуммаНеСоответствует,
	|	ТЧРаздел4.КоличествоОбесценение				КАК КоличествоОбесценение,
	|	ТЧРаздел4.СуммаОбесценение					КАК СуммаОбесценение,
	|	ТЧРаздел4.ЗаключениеКомиссии				КАК ЗаключениеКомиссии
	|ИЗ
	|	СвязьРазделов1и4ИнвентаризационнаяОписьНФА КАК СвязьРазделов1И4
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнвентаризационнаяОписьНФА.Раздел4 КАК ТЧРаздел4
	|		ПО	СвязьРазделов1и4.Ссылка					= ТЧРаздел4.Ссылка
	|		И	СвязьРазделов1и4.НомерСтрокиРаздела4	= ТЧРаздел4.НомерСтроки
	|	// Левое соединение применяется для выбора излишков, отсутствующих в разделе 1.
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИнвентаризационнаяОписьНФА.Раздел1 КАК ТЧРаздел1
	|		ПО	СвязьРазделов1и4.Ссылка					= ТЧРаздел1.Ссылка
	|		И	СвязьРазделов1и4.НомерСтрокиРаздела1	= ТЧРаздел1.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Табличные части СписокСчетов документов ИнвентаризационнаяОписьНФА
	|//
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодходящиеДокументы.Ссылка	КАК Ссылка,
	|	ТЧСписокСчетов.Счет			КАК Счет,
	|	ТЧСписокСчетов.КФО			КАК КФО
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьНФА.СписокСчетов КАК ТЧСписокСчетов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьНФА КАК ПодходящиеДокументы
	|		ПО	ТЧСписокСчетов.Ссылка	= ПодходящиеДокументы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [5]. Табличные части МестаИнвентаризации документов ИнвентаризационнаяОписьНФА
	|//
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодходящиеДокументы.Ссылка					КАК Ссылка,
	|	ТЧМестаИнвентаризации.МестоИнвентаризации	КАК МестоИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьНФА.МестаИнвентаризации КАК ТЧМестаИнвентаризации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьНФА КАК ПодходящиеДокументы
	|		ПО	ТЧМестаИнвентаризации.Ссылка	= ПодходящиеДокументы.Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьОстатковНаСчетах(ИндексыТаблиц)
	
	ПрефиксИмениТаблицы = "ИнвентаризационнаяОписьОстатковНаСчетах_";
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "Шапки", 1);				// [1].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "ВыявленныеОтклонения");	// [2].
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Подходящие документы описей ИнвентаризационнаяОписьОстатковНаСчетах
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	ПодходящиеДокументыИнвентаризационнаяОписьОстатковНаСчетах
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьОстатковНаСчетах				
	|ГДЕ
	|	// Стандартный отбор
	|	Проведен
	|	И РешениеОПроведенииИнвентаризации = &Решение
	|	И ДатаИнвентаризации = &ДатаИнвентаризации
	|	И НомерКомиссии = &НомерКомиссии
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Шапки документов ИнвентаризационнаяОписьОстатковНаСчетах
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка				КАК Ссылка,
	|	Док.Номер				КАК Номер,
	|	Док.Дата				КАК Дата,
	|	Док.МестоИнвентаризации	КАК МестоИнвентаризации,
	|	Док.КФО					КАК КФО,
	|	Док.Счет				КАК Счет
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьОстатковНаСчетах КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьОстатковНаСчетах КАК ПодходящиеДокументы
	|		ПО	Док.Ссылка = ПодходящиеДокументы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Выявленные отклонения документов ИнвентаризационнаяОписьОстатковНаСчетах
	|//
	|ВЫБРАТЬ
	|	ТЧРаздел3.Ссылка						КАК Ссылка,
	|	ТЧРаздел3.НомерСтроки					КАК НомерСтроки,
	|	
	|	ТЧРаздел1.ДатаВыписки					КАК ДатаВыписки,
	|	ТЧРаздел1.СуммаПоВыпискеВал				КАК СуммаПоВыпискеВал,
	|	
	|	ТЧРаздел2.Курс							КАК Курс,
	|	
	|	ТЧРаздел3.КассовыйОрган					КАК КассовыйОрган,
	|	ТЧРаздел3.ЛицевойСчет					КАК ЛицевойСчет,
	|	ЕСТЬNULL(ТЧРаздел3.ЛицевойСчет.Код, """")	КАК НомерЛицевогоСчета,
	|	ТЧРаздел3.ВалютаСчета					КАК ВалютаСчета,
	|	ТЧРаздел3.СуммаОтклоненийВал			КАК СуммаОтклоненийВал,
	|	ТЧРаздел3.СуммаОтклоненийРуб			КАК СуммаОтклоненийРуб,
	|	ТЧРаздел3.ЗаключениеКомиссии			КАК ЗаключениеКомиссии
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьОстатковНаСчетах.Раздел3 КАК ТЧРаздел3
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьОстатковНаСчетах КАК ПодходящиеДокументы
	|		ПО	ТЧРаздел3.Ссылка = ПодходящиеДокументы.Ссылка
	|		И	НЕ (ТЧРаздел3.СуммаОтклоненийВал = 0 И ТЧРаздел3.СуммаОтклоненийРуб = 0)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнвентаризационнаяОписьОстатковНаСчетах.Раздел2 КАК ТЧРаздел2
	|		ПО	ТЧРаздел3.Ссылка		= ТЧРаздел2.Ссылка
	|		И	ТЧРаздел3.НомерСтроки	= ТЧРаздел2.НомерСтроки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИнвентаризационнаяОписьОстатковНаСчетах.Раздел1 КАК ТЧРаздел1
	|		ПО	ТЧРаздел3.Ссылка		= ТЧРаздел1.Ссылка
	|		И	ТЧРаздел3.НомерСтроки	= ТЧРаздел1.НомерСтроки
	|УПОРЯДОЧИТЬ ПО
	|	ТЧРаздел3.Ссылка,
	|	ТЧРаздел3.НомерСтроки
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_ИнвентаризационнаяОписьРасчетовПоПоступлениям(ИндексыТаблиц)
	
	ПрефиксИмениТаблицы = "ИнвентаризационнаяОписьРасчетовПоПоступлениям_";
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "Шапки", 1);						// [1].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "ВыявленныеОтклоненияРаздел21");	// [2].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "ВыявленныеОтклоненияРаздел22");	// [3].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "СписокСчетов");					// [4].
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Подходящие документы описей ИнвентаризационнаяОписьРасчетовПоПоступлениям
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	ПодходящиеДокументыИнвентаризационнаяОписьРасчетовПоПоступлениям
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям
	|ГДЕ
	|	// Стандартный отбор
	|	Проведен
	|	И РешениеОПроведенииИнвентаризации = &Решение
	|	И ДатаИнвентаризации = &ДатаИнвентаризации
	|	И НомерКомиссии = &НомерКомиссии
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Шапки документов ИнвентаризационнаяОписьРасчетовПоПоступлениям
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка										КАК Ссылка,
	|	Док.Номер										КАК Номер,
	|	Док.Дата										КАК Дата,
	|	Док.МестоИнвентаризации							КАК МестоИнвентаризации,
	|	// Серии документов.
	|	Док.ИдентификаторСерииДокументов				КАК ИдентификаторСерииДокументов,
	|	Док.ЭтоЗаголовочныйДокумент						КАК ЭтоЗаголовочныйДокумент,
	|	Док.НомерЗаголовочногоДокумента					КАК НомерЗаголовочногоДокумента,
	|	Док.ПорядковыйНомерДокументаВСерииДокументов	КАК ПорядковыйНомерДокументаВСерииДокументов,
	|	Док.КоличествоДокументовВСерииДокументов		КАК КоличествоДокументовВСерииДокументов
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	Док.Ссылка = ПодходящиеДокументы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Выявленные отклонения документов ИнвентаризационнаяОписьРасчетовПоПоступлениям, Раздел 2.1
	|//
	|ВЫБРАТЬ
	|	ТЧРаздел21.Ссылка								КАК Ссылка,
	|	ТЧРаздел21.НомерСтроки							КАК НомерСтроки,
	|	ТЧРаздел21.Контрагент							КАК Контрагент,
	|	ТЧРаздел21.Договор								КАК Договор,
	|	ТЧРаздел21.Счет									КАК Счет,
	|	ТЧРаздел21.КПС									КАК КПС,
	|	ТЧРаздел21.КЭК									КАК КЭК,
	|	ТЧРаздел21.КФО									КАК КФО,
	|	ТЧРаздел21.ИФО									КАК ИФО,
	|	ТЧРаздел21.Валюта								КАК Валюта,
	|	ТЧРаздел21.СуммаРуб								КАК СуммаРуб,
	|	ТЧРаздел21.СуммаВал								КАК СуммаВал,
	|	ТЧРаздел21.ИдентификаторКонтрагента				КАК ИдентификаторКонтрагента,
	|	ТЧРаздел21.ДатаИсполнения						КАК ДатаИсполнения,
	|	ТЧРаздел21.СуммаПодтвержденаАктомСверкиРуб		КАК СуммаПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел21.СуммаПодтвержденаАктомСверкиВал		КАК СуммаПодтвержденаАктомСверкиВал,
	|	ТЧРаздел21.НомерАктаСверки						КАК НомерАктаСверки,
	|	ТЧРаздел21.ДатаАктаСверки						КАК ДатаАктаСверки,
	|	ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиРуб	КАК СуммаНеПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиВал	КАК СуммаНеПодтвержденаАктомСверкиВал,
	|	ТЧРаздел21.СуммаРубТекущая						КАК СуммаРубТекущая,
	|	ТЧРаздел21.СуммаРубПросроченная					КАК СуммаРубПросроченная,
	|	ТЧРаздел21.СуммаРубДолгосрочная					КАК СуммаРубДолгосрочная,
	|	ТЧРаздел21.СуммаРубСомнительная					КАК СуммаРубСомнительная,
	|	ТЧРаздел21.СуммаРубСИстекшимСрокомДавности		КАК СуммаРубСИстекшимСрокомДавности,
	|	ТЧРаздел21.СуммаРубБезнадежная					КАК СуммаРубБезнадежная,
	|	ТЧРаздел21.СуммаРубИная							КАК СуммаРубИная,
	|	ТЧРаздел21.СуммаВалТекущая						КАК СуммаВалТекущая,
	|	ТЧРаздел21.СуммаВалПросроченная					КАК СуммаВалПросроченная,
	|	ТЧРаздел21.СуммаВалДолгосрочная					КАК СуммаВалДолгосрочная,
	|	ТЧРаздел21.СуммаВалСомнительная					КАК СуммаВалСомнительная,
	|	ТЧРаздел21.СуммаВалСИстекшимСрокомДавности		КАК СуммаВалСИстекшимСрокомДавности,
	|	ТЧРаздел21.СуммаВалБезнадежная					КАК СуммаВалБезнадежная,
	|	ТЧРаздел21.СуммаВалИная							КАК СуммаВалИная,
	|	ТЧРаздел21.ЗаключениеКомиссии					КАК ЗаключениеКомиссии
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям.Раздел21 КАК ТЧРаздел21
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	ТЧРаздел21.Ссылка = ПодходящиеДокументы.Ссылка
	|		// Считаем отклонением такое условие: Есть сумма с истекшим сроком давности Или есть неподтвержденная сумма.
	|		И НЕ (ТЧРаздел21.СуммаРубСИстекшимСрокомДавности = 0
	|			И ТЧРаздел21.СуммаВалСИстекшимСрокомДавности = 0
	|			И ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиРуб = 0
	|			И ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиВал = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Выявленные отклонения документов ИнвентаризационнаяОписьРасчетовПоПоступлениям, Раздел 2.2
	|//
	|ВЫБРАТЬ
	|	ТЧРаздел22.Ссылка								КАК Ссылка,
	|	ТЧРаздел22.НомерСтроки							КАК НомерСтроки,
	|	ТЧРаздел22.Контрагент							КАК Контрагент,
	|	ТЧРаздел22.Договор								КАК Договор,
	|	ТЧРаздел22.Счет									КАК Счет,
	|	ТЧРаздел22.КПС									КАК КПС,
	|	ТЧРаздел22.КЭК									КАК КЭК,
	|	ТЧРаздел22.КФО									КАК КФО,
	|	ТЧРаздел22.ИФО									КАК ИФО,
	|	ТЧРаздел22.Валюта								КАК Валюта,
	|	ТЧРаздел22.СуммаРуб								КАК СуммаРуб,
	|	ТЧРаздел22.СуммаВал								КАК СуммаВал,
	|	ТЧРаздел22.ИдентификаторКонтрагента				КАК ИдентификаторКонтрагента,
	|	ТЧРаздел22.ДатаИсполнения						КАК ДатаИсполнения,
	|	ТЧРаздел22.СуммаПодтвержденаАктомСверкиРуб		КАК СуммаПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел22.СуммаПодтвержденаАктомСверкиВал		КАК СуммаПодтвержденаАктомСверкиВал,
	|	ТЧРаздел22.НомерАктаСверки						КАК НомерАктаСверки,
	|	ТЧРаздел22.ДатаАктаСверки						КАК ДатаАктаСверки,
	|	ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиРуб	КАК СуммаНеПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиВал	КАК СуммаНеПодтвержденаАктомСверкиВал,
	|	ТЧРаздел22.СуммаРубТекущая						КАК СуммаРубТекущая,
	|	ТЧРаздел22.СуммаРубПросроченная					КАК СуммаРубПросроченная,
	|	ТЧРаздел22.СуммаРубДолгосрочная					КАК СуммаРубДолгосрочная,
	|	ТЧРаздел22.СуммаРубСомнительная					КАК СуммаРубСомнительная,
	|	ТЧРаздел22.СуммаРубСИстекшимСрокомДавности		КАК СуммаРубСИстекшимСрокомДавности,
	|	ТЧРаздел22.СуммаРубБезнадежная					КАК СуммаРубБезнадежная,
	|	ТЧРаздел22.СуммаРубИная							КАК СуммаРубИная,
	|	ТЧРаздел22.СуммаВалТекущая						КАК СуммаВалТекущая,
	|	ТЧРаздел22.СуммаВалПросроченная					КАК СуммаВалПросроченная,
	|	ТЧРаздел22.СуммаВалДолгосрочная					КАК СуммаВалДолгосрочная,
	|	ТЧРаздел22.СуммаВалСомнительная					КАК СуммаВалСомнительная,
	|	ТЧРаздел22.СуммаВалСИстекшимСрокомДавности		КАК СуммаВалСИстекшимСрокомДавности,
	|	ТЧРаздел22.СуммаВалБезнадежная					КАК СуммаВалБезнадежная,
	|	ТЧРаздел22.СуммаВалИная							КАК СуммаВалИная,
	|	ТЧРаздел22.ЗаключениеКомиссии					КАК ЗаключениеКомиссии
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям.Раздел22 КАК ТЧРаздел22
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	ТЧРаздел22.Ссылка = ПодходящиеДокументы.Ссылка
	|		// Считаем отклонением такое условие: Есть сумма с истекшим сроком давности Или есть неподтвержденная сумма.
	|		И НЕ (ТЧРаздел22.СуммаРубСИстекшимСрокомДавности = 0
	|			И ТЧРаздел22.СуммаВалСИстекшимСрокомДавности = 0
	|			И ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиРуб = 0
	|			И ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиВал = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Табличные части СписокСчетов документов ИнвентаризационнаяОписьРасчетовПоПоступлениям
	|//
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодходящиеДокументы.Ссылка	КАК Ссылка,
	|	ТЧСписокСчетов.Счет			КАК Счет,
	|	ТЧСписокСчетов.КФО			КАК КФО
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям.СписокСчетов КАК ТЧСписокСчетов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	ТЧСписокСчетов.Ссылка	= ПодходящиеДокументы.Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнение_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(ИндексыТаблиц)
	
	ПрефиксИмениТаблицы = "УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям_";
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "Шапки", 1);						// [1].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "ВыявленныеОтклоненияРаздел21");	// [2].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "ВыявленныеОтклоненияРаздел22");	// [3].
	ДобавитьИндексТаблицы(ИндексыТаблиц, ПрефиксИмениТаблицы + "СписокСчетов");					// [4].
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Подходящие документы описей УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	ПодходящиеДокументыУдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям
	|ИЗ
	|	Документ.УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям
	|ГДЕ
	|	// Стандартный отбор
	|	Проведен
	|	И РешениеОПроведенииИнвентаризации = &Решение
	|	И ДатаИнвентаризации = &ДатаИнвентаризации
	|	И НомерКомиссии = &НомерКомиссии
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоОписям ТОГДА
	|			Ссылка В(&ОтборПоОписям)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ПрименитьОтборПоПодразделению ТОГДА
	|			Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Шапки документов УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка										КАК Ссылка,
	|	Док.Номер										КАК Номер,
	|	Док.Дата										КАК Дата,
	|	Док.МестоИнвентаризации							КАК МестоИнвентаризации,
	|	// Серии документов.
	|	Док.ИдентификаторСерииДокументов				КАК ИдентификаторСерииДокументов,
	|	Док.ЭтоЗаголовочныйДокумент						КАК ЭтоЗаголовочныйДокумент,
	|	Док.НомерЗаголовочногоДокумента					КАК НомерЗаголовочногоДокумента,
	|	Док.ПорядковыйНомерДокументаВСерииДокументов	КАК ПорядковыйНомерДокументаВСерииДокументов,
	|	Док.КоличествоДокументовВСерииДокументов		КАК КоличествоДокументовВСерииДокументов
	|ИЗ
	|	Документ.УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыУдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	Док.Ссылка = ПодходящиеДокументы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Выявленные отклонения документов УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям, Раздел 2.1
	|//
	|ВЫБРАТЬ
	|	ТЧРаздел21.Ссылка								КАК Ссылка,
	|	ТЧРаздел21.НомерСтроки							КАК НомерСтроки,
	|	ТЧРаздел21.Контрагент							КАК Контрагент,
	|	ТЧРаздел21.Договор								КАК Договор,
	|	ТЧРаздел21.Счет									КАК Счет,
	|	ТЧРаздел21.КПС									КАК КПС,
	|	ТЧРаздел21.КЭК									КАК КЭК,
	|	ТЧРаздел21.КФО									КАК КФО,
	|	ТЧРаздел21.ИФО									КАК ИФО,
	|	ТЧРаздел21.Валюта								КАК Валюта,
	|	ТЧРаздел21.СуммаРуб								КАК СуммаРуб,
	|	ТЧРаздел21.СуммаВал								КАК СуммаВал,
	|	ТЧРаздел21.ИдентификаторКонтрагента				КАК ИдентификаторКонтрагента,
	|	ТЧРаздел21.ИдентификаторСтроки					КАК ИдентификаторСтроки,
	|	ТЧРаздел21.ДатаИсполнения						КАК ДатаИсполнения,
	|	ТЧРаздел21.СтатусЗадолженности					КАК СтатусЗадолженности,
	|	ТЧРаздел21.СуммаПодтвержденаАктомСверкиРуб		КАК СуммаПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел21.СуммаПодтвержденаАктомСверкиВал		КАК СуммаПодтвержденаАктомСверкиВал,
	|	ТЧРаздел21.НомерАктаСверки						КАК НомерАктаСверки,
	|	ТЧРаздел21.ДатаАктаСверки						КАК ДатаАктаСверки,
	|	ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиРуб	КАК СуммаНеПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиВал	КАК СуммаНеПодтвержденаАктомСверкиВал,
	|	ТЧРаздел21.ЗаключениеКомиссии					КАК ЗаключениеКомиссии
	|ИЗ
	|	Документ.УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям.Раздел21 КАК ТЧРаздел21
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыУдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	ТЧРаздел21.Ссылка = ПодходящиеДокументы.Ссылка
	|		// Считаем отклонением такое условие: Статус=СИстекшимСрокомДавности Или заполнена любая сумма.
	|		И НЕ (НЕ ТЧРаздел21.СтатусЗадолженности В(&СтатусыЗадолженностиНеАктив)
	|			И ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиРуб = 0
	|			И ТЧРаздел21.СуммаНеПодтвержденаАктомСверкиВал = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Выявленные отклонения документов УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям, Раздел 2.2
	|//
	|ВЫБРАТЬ
	|	ТЧРаздел22.Ссылка								КАК Ссылка,
	|	ТЧРаздел22.НомерСтроки							КАК НомерСтроки,
	|	ТЧРаздел22.Контрагент							КАК Контрагент,
	|	ТЧРаздел22.Договор								КАК Договор,
	|	ТЧРаздел22.Счет									КАК Счет,
	|	ТЧРаздел22.КПС									КАК КПС,
	|	ТЧРаздел22.КЭК									КАК КЭК,
	|	ТЧРаздел22.КФО									КАК КФО,
	|	ТЧРаздел22.ИФО									КАК ИФО,
	|	ТЧРаздел22.Валюта								КАК Валюта,
	|	ТЧРаздел22.СуммаРуб								КАК СуммаРуб,
	|	ТЧРаздел22.СуммаВал								КАК СуммаВал,
	|	ТЧРаздел22.ИдентификаторКонтрагента				КАК ИдентификаторКонтрагента,
	|	ТЧРаздел22.ИдентификаторСтроки					КАК ИдентификаторСтроки,
	|	ТЧРаздел22.ДатаИсполнения						КАК ДатаИсполнения,
	|	ТЧРаздел22.СтатусЗадолженности					КАК СтатусЗадолженности,
	|	ТЧРаздел22.СуммаПодтвержденаАктомСверкиРуб		КАК СуммаПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел22.СуммаПодтвержденаАктомСверкиВал		КАК СуммаПодтвержденаАктомСверкиВал,
	|	ТЧРаздел22.НомерАктаСверки						КАК НомерАктаСверки,
	|	ТЧРаздел22.ДатаАктаСверки						КАК ДатаАктаСверки,
	|	ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиРуб	КАК СуммаНеПодтвержденаАктомСверкиРуб,
	|	ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиВал	КАК СуммаНеПодтвержденаАктомСверкиВал,
	|	ТЧРаздел22.ЗаключениеКомиссии					КАК ЗаключениеКомиссии
	|ИЗ
	|	Документ.УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям.Раздел22 КАК ТЧРаздел22
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыУдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	ТЧРаздел22.Ссылка = ПодходящиеДокументы.Ссылка
	|		// Считаем отклонением такое условие: Статус=СИстекшимСрокомДавности Или заполнена любая сумма.
	|		И НЕ (НЕ ТЧРаздел22.СтатусЗадолженности В(&СтатусыЗадолженностиНеАктив)
	|			И ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиРуб = 0
	|			И ТЧРаздел22.СуммаНеПодтвержденаАктомСверкиВал = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Табличные части СписокСчетов документов УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям
	|//
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПодходящиеДокументы.Ссылка	КАК Ссылка,
	|	ТЧСписокСчетов.Счет			КАК Счет,
	|	ТЧСписокСчетов.КФО			КАК КФО
	|ИЗ
	|	Документ.УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям.СписокСчетов КАК ТЧСписокСчетов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодходящиеДокументыУдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям КАК ПодходящиеДокументы
	|		ПО	ТЧСписокСчетов.Ссылка	= ПодходящиеДокументы.Ссылка
	|;";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОпределениеМестРегистрацииОписи

Функция ПолучитьПустуюТаблицуМестаРегистрацииОписей()
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Опись");
	Таблица.Колонки.Добавить("ДатаОписи",					ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("НомерОписи",					Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Раздел1",						ТипБулево);
	Таблица.Колонки.Добавить("Раздел2",						ТипБулево);
	Таблица.Колонки.Добавить("Раздел3",						ТипБулево);
	Таблица.Колонки.Добавить("ТаблицаПриложений",			Новый ОписаниеТипов("ТаблицаЗначений"));
	Таблица.Колонки.Добавить("МассивСтрокТаблицыОбъекты",	Новый ОписаниеТипов("Массив"));
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьПустуюТаблицуПриложений()
	
	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(6,0,ДопустимыйЗнак.Неотрицательный);
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	ТаблицаПриложений = Новый ТаблицаЗначений();
	ТаблицаПриложений.Колонки.Добавить("СтрокаТаблицыОбъекты");
	ТаблицаПриложений.Колонки.Добавить("СтрокаОписи");
	ТаблицаПриложений.Колонки.Добавить("НомерПриложенияРаздела2",	ТипЧисло);
	ТаблицаПриложений.Колонки.Добавить("НомерПриложенияРаздела3",	ТипЧисло);
	
	Возврат ТаблицаПриложений;
	
КонецФункции

Процедура ИсключитьНекорректныеНастройкиМестРегистрации(ТаблицаМестаРегистрации)
	
	Поиск = Новый Структура("Раздел2,Раздел3", Ложь, Ложь);
	
	МассивСтрок = ТаблицаМестаРегистрации.НайтиСтроки(Поиск);
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		СтрокаТаблицы.Раздел1 = Истина;
	КонецЦикла;
	
	Поиск = Новый Структура("Раздел1", Истина);
	
	МассивСтрок = ТаблицаМестаРегистрации.НайтиСтроки(Поиск);
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		Если СтрокаТаблицы.Раздел2 Или СтрокаТаблицы.Раздел3 Тогда
			СтрокаТаблицы.Раздел1 = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция УпорядочитьНомераСтрок(НомераСтрок)
	
	ВремСписок = Новый СписокЗначений();
	
	Для Каждого Элемент Из НомераСтрок Цикл
		ВремСписок.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	ВремСписок.СортироватьПоЗначению();
	
	Возврат ВремСписок.ВыгрузитьЗначения();
	
КонецФункции

#Область Описи52н

Процедура ДобавитьМестаРегистрацииОписей(ТаблицаОбъекты, ДополнительныеПараметры)
	
	Перем ДобавитьВРаздел2, ДобавитьВРаздел3;
	
	ТаблицыОписей = ДополнительныеПараметры.ТаблицыОписей;
	
	ТаблицаМестаРегистрации = ПолучитьПустуюТаблицуМестаРегистрацииОписей();
	
	ПоискОписьСсылка= Новый Структура("Опись");
	
	ПоискОписьНомерСтроки = Новый Структура("Опись,ИмяТабличнойЧасти,НомерСтроки");
	
	Для Каждого СтрокаТаблицыОбъекты Из ТаблицаОбъекты Цикл
		
		Для Каждого СтрокаСопоставления Из СтрокаТаблицыОбъекты.ТаблицаСопоставленияОписей Цикл
			
			Опись = СтрокаСопоставления.Опись;
			
			ИмяДокумента = ПолучитьИмяДокумента(Опись, ДополнительныеПараметры);
			
			ДополнительныеПараметры.Вставить("ИмяДокумента", ИмяДокумента);
			
			ТаблицаОписей = ТаблицыОписей[ИмяДокумента];
			
			ПоискОписьСсылка.Опись = Опись;
			
			МассивСтрок = ТаблицаМестаРегистрации.НайтиСтроки(ПоискОписьСсылка);
			
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаМестаРегистрации = ТаблицаМестаРегистрации.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаМестаРегистрации, СтрокаСопоставления, "Опись,НомерОписи,ДатаОписи");
				
				СтрокаМестаРегистрации.ТаблицаПриложений = ПолучитьПустуюТаблицуПриложений();
				
				СтрокаМестаРегистрации.МассивСтрокТаблицыОбъекты = Новый Массив();
			Иначе
				СтрокаМестаРегистрации = МассивСтрок[0];
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ПоискОписьНомерСтроки, СтрокаСопоставления, "Опись,ИмяТабличнойЧасти");
			
			Если СтрокаМестаРегистрации.МассивСтрокТаблицыОбъекты.Найти(СтрокаТаблицыОбъекты) = Неопределено Тогда
				СтрокаМестаРегистрации.МассивСтрокТаблицыОбъекты.Добавить(СтрокаТаблицыОбъекты);
			КонецЕсли;
			
			НомераСтрок = УпорядочитьНомераСтрок(СтрокаСопоставления.НомераСтрок);
			
			Для Каждого НомерСтроки Из НомераСтрок Цикл
				ПоискОписьНомерСтроки.НомерСтроки = НомерСтроки;
				
				МассивСтрок = ТаблицаОписей.НайтиСтроки(ПоискОписьНомерСтроки);
				
				СтрокаОписи = МассивСтрок[0];
				
				ОпределитьМестоРегистрацииСтрокиОписи(ИмяДокумента, СтрокаТаблицыОбъекты, СтрокаОписи, СтрокаМестаРегистрации);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ИсключитьНекорректныеНастройкиМестРегистрации(ТаблицаМестаРегистрации);
	
	ДополнительныеПараметры.Вставить("МестаРегистрацииОписей", ТаблицаМестаРегистрации);
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрацииСтрокиОписи(ИмяДокумента, СтрокаТаблицыОбъекты, СтрокаОписи, СтрокаМестаРегистрации)

	Перем НомерПриложенияРаздела2, НомерПриложенияРаздела3;
	
	Если ИмяДокумента = "ИнвентаризацияЦенныхБумаг" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияЦенныхБумаг(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияОстатковНаСчетах" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияОстатковНаСчетах(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияКредитовИЗаймов" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияКредитовИЗаймов(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияГосдолгаВЦенныхБумагах" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаВЦенныхБумагах(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияГосдолгаПоКредитамИГарантиям" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаПоКредитамИГарантиям(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияКассы" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияКассы(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияИК" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияИК(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияМЗ" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияМЗ(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияОС" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияОС(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияРасчетовСКонтрагентами" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияРасчетовСКонтрагентами(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризацияРасчетовПоПоступлениям" Тогда
		ОпределитьМестоРегистрации_ИнвентаризацияРасчетовПоПоступлениям(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерПриложенияРаздела2) И Не ЗначениеЗаполнено(НомерПриложенияРаздела3) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПриложения = СтрокаМестаРегистрации.ТаблицаПриложений.Добавить();
	СтрокаПриложения.СтрокаТаблицыОбъекты = СтрокаТаблицыОбъекты;
	СтрокаПриложения.СтрокаОписи = СтрокаОписи;
	
	Если ЗначениеЗаполнено(НомерПриложенияРаздела2) Тогда
		СтрокаМестаРегистрации.Раздел2 = Истина;
		
		СтрокаПриложения.НомерПриложенияРаздела2 = НомерПриложенияРаздела2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерПриложенияРаздела3) Тогда
		СтрокаМестаРегистрации.Раздел3 = Истина;
		
		СтрокаПриложения.НомерПриложенияРаздела3 = НомерПриложенияРаздела3;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияЦенныхБумаг(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.КоличествоНедостача <> 0
		Или СтрокаОписи.КоличествоИзлишки <> 0
		Или СтрокаОписи.НоминальнаяСтоимостьНедостача <> 0
		Или СтрокаОписи.НоминальнаяСтоимостьВалютнаяНедостача <> 0
		Или СтрокаОписи.НоминальнаяСтоимостьИзлишки <> 0
		Или СтрокаОписи.НоминальнаяСтоимостьВалютнаяИзлишки <> 0 Тогда
		
		НомерПриложенияРаздела2 = 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияОстатковНаСчетах(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияКредитовИЗаймов(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.СуммаОДНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаОДНеподтвержденная <> 0
		Или СтрокаОписи.СуммаПроцентовНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаПроцентовНеподтвержденная <> 0
		Или СтрокаОписи.СуммаШтрафовНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаШтрафовНеподтвержденная <> 0
		Или СтрокаОписи.СуммаПенейНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаПенейНеподтвержденная <> 0 Тогда
		
		НомерПриложенияРаздела2 = 3;
	КонецЕсли;
	
	Если СтрокаОписи.СуммаОДПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаОДПросроченная <> 0
		Или СтрокаОписи.СуммаПроцентовПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаПроцентовПросроченная <> 0
		Или СтрокаОписи.СуммаШтрафовПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаШтрафовПросроченная <> 0
		Или СтрокаОписи.СуммаПенейПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаПенейПросроченная <> 0 Тогда
		
		НомерПриложенияРаздела3 = 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаВЦенныхБумагах(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.СуммаОДНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаОДНеподтвержденная <> 0
		Или СтрокаОписи.СуммаПроцентовНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаПроцентовНеподтвержденная <> 0 Тогда
		
		НомерПриложенияРаздела2 = 4;
	КонецЕсли;
	
	Если СтрокаОписи.СуммаОДПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаОДПросроченная <> 0
		Или СтрокаОписи.СуммаПроцентовПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаПроцентовПросроченная <> 0 Тогда
		
		НомерПриложенияРаздела3 = 2;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаПоКредитамИГарантиям(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.СуммаОДНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаОДНеподтвержденная <> 0
		Или СтрокаОписи.СуммаПроцентовНеподтвержденнаяВалютная <> 0
		Или СтрокаОписи.СуммаПроцентовНеподтвержденная <> 0 Тогда
		
		НомерПриложенияРаздела2 = 5;
	КонецЕсли;
	
	Если СтрокаОписи.СуммаОДПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаОДПросроченная <> 0
		Или СтрокаОписи.СуммаПроцентовПросроченнаяВалютная <> 0
		Или СтрокаОписи.СуммаПроцентовПросроченная <> 0 Тогда
		
		НомерПриложенияРаздела3 = 3;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияКассы(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.НедостачаКоличество <> 0
		Или СтрокаОписи.НедостачаСумма <> 0
		Или СтрокаОписи.ИзлишекКоличество <> 0
		Или СтрокаОписи.ИзлишекСумма <> 0 Тогда
		
		НомерПриложенияРаздела2 = 6;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияИК(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.НедостачаКоличество > 0 Или СтрокаОписи.ИзлишекКоличество > 0 Тогда
		НомерПриложенияРаздела2 = 7;
	КонецЕсли;
	
	Если СтрокаОписи.КоличествоНеСоответствует > 0 Или СтрокаОписи.СуммаНеСоответствует > 0 Тогда
		НомерПриложенияРаздела3 = 4;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияМЗ(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.НедостачаКоличество > 0 Или СтрокаОписи.ИзлишекКоличество > 0 Тогда
		НомерПриложенияРаздела2 = 7;
	КонецЕсли;
	
	Если СтрокаОписи.КоличествоНеСоответствует > 0 Или СтрокаОписи.СуммаНеСоответствует > 0 Тогда
		НомерПриложенияРаздела3 = 4;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияОС(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.НедостачаКоличество > 0 Или СтрокаОписи.ИзлишекКоличество > 0 Тогда
		НомерПриложенияРаздела2 = 7;
	КонецЕсли;
	
	Если СтрокаОписи.КоличествоНеСоответствует > 0 Или СтрокаОписи.СуммаНеСоответствует > 0 Тогда
		НомерПриложенияРаздела3 = 4;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияРасчетовСКонтрагентами(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.НеПодтверждено <> 0 Тогда
		НомерПриложенияРаздела2 = 8;
	КонецЕсли;
	
	Если СтрокаОписи.ИстекСрокДавности <> 0 Тогда
		Если СтрокаОписи.ИмяТабличнойЧасти = "ДебиторскаяЗадолженность" Тогда
			НомерПриложенияРаздела3 = 5;
		ИначеЕсли СтрокаОписи.ИмяТабличнойЧасти = "КредиторскаяЗадолженность" Тогда
			НомерПриложенияРаздела3 = 6;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризацияРасчетовПоПоступлениям(СтрокаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3)
	
	Если СтрокаОписи.НеПодтверждено <> 0 Тогда
		НомерПриложенияРаздела2 = 9;
	КонецЕсли;
	
	Если СтрокаОписи.ИстекСрокДавности <> 0 Тогда
		НомерПриложенияРаздела3 = 7;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Описи61н

Процедура ДобавитьМестаРегистрацииОписей61н(ТаблицаОбъекты, ДополнительныеПараметры)
	
	Перем ДобавитьВРаздел2, ДобавитьВРаздел3;
	
	ТаблицыОписей = ДополнительныеПараметры.Описи61н.ТаблицыОписей;
	
	РезультатыРасчета = ДополнительныеПараметры.Описи61н.РезультатыРасчета;
	
	ТаблицаМестаРегистрации = ПолучитьПустуюТаблицуМестаРегистрацииОписей();
	
	ПоискРегистрацииОпиcи = Новый Структура("Опись");
	
	ПоискВыявленногоОтклонения = Новый Структура("Ссылка,НомерСтроки");
	
	Для Каждого СтрокаТаблицыОбъекты Из ТаблицаОбъекты Цикл
		
		Для Каждого СтрокаСопоставления Из СтрокаТаблицыОбъекты.ТаблицаСопоставленияОписей Цикл
			
			Опись = СтрокаСопоставления.Опись;
			
			ПоискРегистрацииОпиcи.Опись = Опись;
			
			МассивСтрок = ТаблицаМестаРегистрации.НайтиСтроки(ПоискРегистрацииОпиcи);
			
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаМестаРегистрации = ТаблицаМестаРегистрации.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаМестаРегистрации, СтрокаСопоставления, "Опись,НомерОписи,ДатаОписи");
				
				СтрокаМестаРегистрации.ТаблицаПриложений = ПолучитьПустуюТаблицуПриложений();
				
				СтрокаМестаРегистрации.МассивСтрокТаблицыОбъекты = Новый Массив();
			Иначе
				СтрокаМестаРегистрации = МассивСтрок[0];
			КонецЕсли;
			
			Если СтрокаМестаРегистрации.МассивСтрокТаблицыОбъекты.Найти(СтрокаТаблицыОбъекты) = Неопределено Тогда
				СтрокаМестаРегистрации.МассивСтрокТаблицыОбъекты.Добавить(СтрокаТаблицыОбъекты);
			КонецЕсли;
			
			Если СтрокаСопоставления.СопоставленыОтклонения Тогда
				// Имеются сопоставленные отклонения, необходимо определить место их отражения.
				ИмяДокумента = ОпределитьИмяДокумента(Опись, ДополнительныеПараметры);
				
				ТаблицыДокумента = ТаблицыОписей[ИмяДокумента];
				
				ТаблицаОтклоненийОписей = ТаблицыДокумента[СтрокаСопоставления.ИмяТабличнойЧасти];
				
				ПоискВыявленногоОтклонения.Ссылка = СтрокаСопоставления.Опись;
				
				РезультатыРасчета.РезультатыСопоставления.ПоискОписиВДанныхОписей.Ссылка = Опись;
				
				ШапкаОписи = ТаблицыДокумента.Шапки.НайтиСтроки(РезультатыРасчета.РезультатыСопоставления.ПоискОписиВДанныхОписей)[0];
				
				НомераСтрок = УпорядочитьНомераСтрок(СтрокаСопоставления.НомераСтрок);
				
				Для Каждого НомерСтроки Из НомераСтрок Цикл
					Если НомерСтроки = 0 Тогда
						// Это строка не сопоставленного отклонения, а сопоставленного отбора.
						Продолжить;
					КонецЕсли;
					
					ПоискВыявленногоОтклонения.НомерСтроки = НомерСтроки;
					
					МассивСтрок = ТаблицаОтклоненийОписей.НайтиСтроки(ПоискВыявленногоОтклонения);
					
					СтрокаОписи = МассивСтрок[0];
					
					ОпределитьМестоРегистрацииСтрокиОписи61н(ИмяДокумента, СтрокаТаблицыОбъекты, СтрокаОписи, ШапкаОписи, СтрокаМестаРегистрации, ДополнительныеПараметры);
				КонецЦикла;
				
			ИначеЕсли СтрокаСопоставления.СопоставленОтбор Тогда
				// Отсутствуют выявленные отклонения, но опись сопоставлена строке Решения по отбору.
				СтрокаМестаРегистрации.Раздел1 = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	ИсключитьНекорректныеНастройкиМестРегистрации(ТаблицаМестаРегистрации);
	
	РезультатыРасчета.Вставить("МестаРегистрацииОписей", ТаблицаМестаРегистрации);
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрацииСтрокиОписи61н(ИмяДокумента, СтрокаТаблицыОбъекты, СтрокаОписи, ШапкаОписи, СтрокаМестаРегистрации, ДополнительныеПараметры)

	Перем НомерПриложенияРаздела2, НомерПриложенияРаздела3;
	
	Если ИмяДокумента = "ИнвентаризационнаяОписьБСО" Тогда
		ОпределитьМестоРегистрации_ИнвентаризационнаяОписьБСО(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьНФА" Тогда
		ОпределитьМестоРегистрации_ИнвентаризационнаяОписьНФА(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьОстатковНаСчетах" Тогда
		ОпределитьМестоРегистрации_ИнвентаризационнаяОписьОстатковНаСчетах(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры);
		
	ИначеЕсли ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		ОпределитьМестоРегистрации_ИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры);
		
	ИначеЕсли ИмяДокумента = "УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		ОпределитьМестоРегистрации_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерПриложенияРаздела2) И Не ЗначениеЗаполнено(НомерПриложенияРаздела3) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПриложения = СтрокаМестаРегистрации.ТаблицаПриложений.Добавить();
	СтрокаПриложения.СтрокаТаблицыОбъекты = СтрокаТаблицыОбъекты;
	СтрокаПриложения.СтрокаОписи = СтрокаОписи;
	
	Если ЗначениеЗаполнено(НомерПриложенияРаздела2) Тогда
		СтрокаМестаРегистрации.Раздел2 = Истина;
		
		СтрокаПриложения.НомерПриложенияРаздела2 = НомерПриложенияРаздела2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерПриложенияРаздела3) Тогда
		СтрокаМестаРегистрации.Раздел3 = Истина;
		
		СтрокаПриложения.НомерПриложенияРаздела3 = НомерПриложенияРаздела3;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризационнаяОписьБСО(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры)
	
	Если СтрокаОписи.КоличествоИзлишкиНеПодтверждено <> 0
		Или СтрокаОписи.СуммаИзлишкиНеПодтверждено <> 0
		Или СтрокаОписи.КоличествоНедостачаНеПодтверждено <> 0
		Или СтрокаОписи.СуммаНедостачаНеПодтверждено <> 0 Тогда
		
		НомерПриложенияРаздела2 = 6;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризационнаяОписьНФА(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры)
	
	Если СтрокаОписи.КоличествоНедостачаНеПодтверждено <> 0
		Или СтрокаОписи.СуммаНедостачаНеПодтверждено <> 0
		Или СтрокаОписи.КоличествоИзлишкиНеПодтверждено <> 0 Тогда
		
		НомерПриложенияРаздела2 = 7;
	КонецЕсли;
	
	Если СтрокаОписи.КоличествоНеСоответствует <> 0
		Или СтрокаОписи.СуммаНеСоответствует <> 0
		Или СтрокаОписи.КоличествоОбесценение <> 0
		Или СтрокаОписи.СуммаОбесценение <> 0 Тогда
		
		НомерПриложенияРаздела3 = 4;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризационнаяОписьОстатковНаСчетах(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры)
	
	Если СтрокаОписи.СуммаОтклоненийВал <> 0 Или СтрокаОписи.СуммаОтклоненийРуб <> 0 Тогда
		НомерПриложенияРаздела2 = 2;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_ИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры)
	
	Если СтрокаОписи.СуммаНеПодтвержденаАктомСверкиРуб <> 0
		Или СтрокаОписи.СуммаНеПодтвержденаАктомСверкиВал <> 0 Тогда
		
		НомерПриложенияРаздела2 = 9;
	КонецЕсли;
	
	Если СтрокаОписи.СуммаРубСИстекшимСрокомДавности <> 0
		Или СтрокаОписи.СуммаВалСИстекшимСрокомДавности <> 0 Тогда
		
		НомерПриложенияРаздела3 = 7;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьМестоРегистрации_УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям(СтрокаОписи, ШапкаОписи, НомерПриложенияРаздела2, НомерПриложенияРаздела3, ДополнительныеПараметры)
	
	Если СтрокаОписи.СуммаНеПодтвержденаАктомСверкиРуб <> 0
		Или СтрокаОписи.СуммаНеПодтвержденаАктомСверкиВал <> 0 Тогда
		
		НомерПриложенияРаздела2 = 9;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Описи61н.СтатусыЗадолженностиНеАктив.Найти(СтрокаОписи.СтатусЗадолженности) <> Неопределено
		И (СтрокаОписи.СуммаРуб <> 0 Или СтрокаОписи.СуммаВал <> 0) Тогда
		
		НомерПриложенияРаздела3 = 7;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ЗаполнениеПриложений

Процедура ЗаполнитьНовуюСтрокуПриложения(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	НомерРаздела	= Параметры.НомерРаздела;
	НомерПриложения	= Параметры.НомерПриложения;
	
	Если НомерРаздела = 2 Тогда
		
		// Приложения к разделу 2
		
		Если НомерПриложения = 2 Тогда
			ЗаполнитьНовуюСтроку_Приложение2кРазделу2(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 6 Тогда
			ЗаполнитьНовуюСтроку_Приложение6кРазделу2(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 7 Тогда
			ЗаполнитьНовуюСтроку_Приложение7кРазделу2(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 8 Тогда
			ЗаполнитьНовуюСтроку_Приложение8кРазделу2(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 9 Тогда
			ЗаполнитьНовуюСтроку_Приложение9кРазделу2(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
		КонецЕсли;
		
	ИначеЕсли НомерРаздела = 3 Тогда
		
		// Приложения к разделу 3
		
		Если НомерПриложения = 4 Тогда
			ЗаполнитьНовуюСтроку_Приложение4кРазделу3(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 5 Тогда
			ЗаполнитьНовуюСтроку_Приложение5кРазделу3(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 6 Тогда
			ЗаполнитьНовуюСтроку_Приложение6кРазделу3(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
			
		ИначеЕсли НомерПриложения = 7 Тогда
			ЗаполнитьНовуюСтроку_Приложение7кРазделу3(НоваяСтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение2кРазделу2(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	Если Параметры.ИмяДокумента = "ИнвентаризацияОстатковНаСчетах" Тогда
		СписокСчетов = ДополнительныеПараметры.ДополнительныеТаблицы.ИнвентаризацияОстатковНаСчетах.СписокСчетов;
		
		Поиск = Новый Структура("Опись", СтрокаОписи.Опись);
		
		МассивСтрок = СписокСчетов.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 1 Тогда
			Счет = МассивСтрок[0].Счет;
		Иначе
			Счет = Параметры.СтрокаРаздела.Счет;//ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		КонецЕсли;
		
		СтрокаПриложения.Счет = Счет;
		
	ИначеЕсли Параметры.ИмяДокумента = "ИнвентаризационнаяОписьОстатковНаСчетах" Тогда
		ШапкаОписи = ПолучитьШапкуОписи61нПриЗаполненииСтрокиПриложения(СтрокаОписи, Параметры, ДополнительныеПараметры);
		
		СтрокаПриложения.КФО						= ШапкаОписи.КФО;
		СтрокаПриложения.Счет						= ШапкаОписи.Счет;
		СтрокаПриложения.Валюта						= СтрокаОписи.ВалютаСчета;
		СтрокаПриложения.СуммаОтклоненийВалютная	= СтрокаОписи.СуммаОтклоненийВал;
		СтрокаПриложения.СуммаОтклонений			= СтрокаОписи.СуммаОтклоненийРуб;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение6кРазделу2(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	Если Параметры.ИмяДокумента = "ИнвентаризационнаяОписьБСО" Тогда
		ШапкаОписи = ПолучитьШапкуОписи61нПриЗаполненииСтрокиПриложения(СтрокаОписи, Параметры, ДополнительныеПараметры);
		
		Если ШапкаОписи.ВидДокумента = Перечисления.ВидыДокументовСтрогойОтчетности.БСО Тогда
			ВидДокумента = 1;
		ИначеЕсли ШапкаОписи.ВидДокумента = Перечисления.ВидыДокументовСтрогойОтчетности.ДенежныеДокументы Тогда
			ВидДокумента = 2;
		Иначе
			ВидДокумента = 0;
		КонецЕсли;
		
		СтрокаПриложения.ВидДокумента			= ВидДокумента;
		СтрокаПриложения.ВидДенежногоДокумента	= СтрокаОписи.ВидДенежногоДокумента;
		СтрокаПриложения.ДенежныйДокумент		= СтрокаОписи.ДенежныйДокумент;
		СтрокаПриложения.БСО					= СтрокаОписи.БСО;
		СтрокаПриложения.Серия					= СтрокаОписи.Серия;
		
		СтрокаПриложения.НедостачаНачальныйНомер	= СтрокаОписи.НачальныйНомерНедостачаНеПодтверждено;
		СтрокаПриложения.НедостачаКонечныйНомер		= СтрокаОписи.КонечныйНомерНедостачаНеПодтверждено;
		СтрокаПриложения.НедостачаКоличество		= СтрокаОписи.КоличествоНедостачаНеПодтверждено;
		СтрокаПриложения.НедостачаСумма				= СтрокаОписи.СуммаНедостачаНеПодтверждено;
		
		СтрокаПриложения.ИзлишекНачальныйНомер	= СтрокаОписи.НачальныйНомерИзлишкиНеПодтверждено;
		СтрокаПриложения.ИзлишекКонечныйНомер	= СтрокаОписи.КонечныйНомерИзлишкиНеПодтверждено;
		СтрокаПриложения.ИзлишекКоличество		= СтрокаОписи.КоличествоИзлишкиНеПодтверждено;
		СтрокаПриложения.ИзлишекСумма			= СтрокаОписи.СуммаИзлишкиНеПодтверждено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение7кРазделу2(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	Если Параметры.ИмяДокумента = "ИнвентаризационнаяОписьНФА" Тогда
		СтрокаПриложения.НедостачаКоличество	= СтрокаОписи.КоличествоНедостачаНеПодтверждено;
		СтрокаПриложения.НедостачаСумма			= СтрокаОписи.СуммаНедостачаНеПодтверждено;
		СтрокаПриложения.ИзлишекКоличество		= СтрокаОписи.КоличествоИзлишкиНеПодтверждено;
		СтрокаПриложения.ИзлишекСумма			= 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение8кРазделу2(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	СтрокаПриложения.СуммаОтклонений = СтрокаОписи.НеПодтверждено;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение9кРазделу2(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	Если Параметры.ИмяДокумента = "ИнвентаризацияРасчетовПоПоступлениям" Тогда
		СтрокаПриложения.СуммаОтклонений = СтрокаОписи.НеПодтверждено;
		
	ИначеЕсли Параметры.ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		СтрокаПриложения.СуммаОтклонений = СтрокаОписи.СуммаНеПодтвержденаАктомСверкиРуб;
		
	ИначеЕсли Параметры.ИмяДокумента = "УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		СтрокаПриложения.СуммаОтклонений = СтрокаОписи.СуммаНеПодтвержденаАктомСверкиРуб;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение4кРазделу3(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	Если Параметры.ИмяДокумента = "ИнвентаризационнаяОписьНФА" Тогда
		СтрокаПриложения.КоличествоНеСоответствует		= СтрокаОписи.КоличествоНеСоответствует;
		СтрокаПриложения.СуммаНеСоответствует			= СтрокаОписи.СуммаНеСоответствует;
		СтрокаПриложения.КоличествоПодлежитОбесценению	= СтрокаОписи.КоличествоОбесценение;
		СтрокаПриложения.СуммаПодлежитОбесценению		= СтрокаОписи.СуммаОбесценение;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение5кРазделу3(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	СтрокаПриложения.СуммаОтклонений = СтрокаОписи.ИстекСрокДавности;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение6кРазделу3(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	СтрокаПриложения.СуммаОтклонений = СтрокаОписи.ИстекСрокДавности;
	
КонецПроцедуры

Процедура ЗаполнитьНовуюСтроку_Приложение7кРазделу3(СтрокаПриложения, СтрокаОписи, Параметры, ДополнительныеПараметры)
	
	Если Параметры.ИмяДокумента = "ИнвентаризацияРасчетовПоПоступлениям" Тогда
		СтрокаПриложения.СуммаОтклонений = СтрокаОписи.ИстекСрокДавности;
		
	ИначеЕсли Параметры.ИмяДокумента = "ИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		СтрокаПриложения.СуммаОтклонений = СтрокаОписи.СуммаРубСИстекшимСрокомДавности;
		
	ИначеЕсли Параметры.ИмяДокумента = "УдалитьИнвентаризационнаяОписьРасчетовПоПоступлениям" Тогда
		СтрокаПриложения.СуммаОтклонений = СтрокаОписи.СуммаРуб;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПроверкаЗаполнения

Процедура ПроверитьКорректностьКодовСтрокПриложений(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ТЧРаздела = ДокументОбъект[ИмяТЧРаздела];
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
			
			СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
			
			Для Каждого СтрокаПриложения Из ТЧПриложения Цикл
				
				НомерСтроки = СтрокаПриложения.НомерСтроки;
				
				ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
				
				Если Не ЗначениеЗаполнено(СтрокаПриложения.НомерСтрокиРаздела) Или Не ЗначениеЗаполнено(СтрокаПриложения.ПорядковыйНомер) Тогда
					// Код строки незаполнен
					
					ЕстьОшибкиЗаполнения = Истина;
					
					ОбщегоНазначения.СообщитьПользователю(
						ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность", "Код cтроки", НомерСтроки, СинонимТЧПриложения),
						ДокументОбъект.Ссылка,
						"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].КодСтроки");
						
					Продолжить;
				КонецЕсли;
				
				ДобавитьЭлементыКодаСтроки(СтрокаПриложения, НомерРаздела, НомерПриложения, ДополнительныеПараметры);
				
				Если СтрокаПриложения.НомерСтрокиРаздела > ТЧРаздела.Количество() Тогда
					
					ЕстьОшибкиЗаполнения = Истина;
					
					ТекстШаблон = НСтр("ru='Код строки раздела превышает количество строк раздела %1 в строке %2 списка ""%3""'");
					
					ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон(ТекстШаблон, НомерРаздела, НомерСтроки, СинонимТЧПриложения),
						ДокументОбъект.Ссылка,
						"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].КодСтроки");
						
					Продолжить;
				КонецЕсли;
				
				НомерПриложенияВРазделе = ТЧРаздела[СтрокаПриложения.НомерСтрокиРаздела - 1].НомерПриложения;
				
				Если НомерПриложения <> НомерПриложенияВРазделе Тогда
					
					ЕстьОшибкиЗаполнения = Истина;
					
					ТекстШаблон = НСтр("ru='Строка %1 списка ""%2"" ошибочно расположена в приложении №%3. Ожидается отражение этой строки в приложении №%4'");
					
					ОбщегоНазначения.СообщитьПользователю(
						СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения, НомерПриложения, НомерПриложенияВРазделе),
						ДокументОбъект.Ссылка,
						"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].КодСтроки");
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЭлементыКодаСтроки(СтрокаПриложения, НомерРаздела, НомерПриложения, ДополнительныеПараметры)
	
	// ДополнительныеПараметры.КодыСтрокПриложений - соответствие
	//	* НомерРаздела					- ключ	- соответствие
	//		** НомерПриложения			- ключ	- соответствие
	//			*** КодСтрокиРаздела	- ключ	- соответствие
	//				<Порядковые номера>	- значение	- массив чисел
	
	КодыСтрокПриложений = ДополнительныеПараметры.КодыСтрокПриложений;
	
	КодыСтрокПриложенийРаздела = КодыСтрокПриложений.Получить(НомерРаздела);
	
	Если КодыСтрокПриложенийРаздела = Неопределено Тогда
		КодыСтрокПриложенийРаздела = Новый Соответствие();
	КонецЕсли;
	
	КодыСтрокПриложения = КодыСтрокПриложенийРаздела.Получить(НомерПриложения);
	
	Если КодыСтрокПриложения = Неопределено Тогда
		КодыСтрокПриложения = Новый Соответствие();
	КонецЕсли;
	
	ПорядковыеНомера = КодыСтрокПриложения.Получить(СтрокаПриложения.НомерСтрокиРаздела);
	
	Если ПорядковыеНомера = Неопределено Тогда
		ПорядковыеНомера = Новый Массив();
	КонецЕсли;
	
	ПорядковыеНомера.Добавить(СтрокаПриложения.ПорядковыйНомер);
	
	КодыСтрокПриложения.Вставить(СтрокаПриложения.НомерСтрокиРаздела, ПорядковыеНомера);
	
	КодыСтрокПриложенийРаздела.Вставить(НомерПриложения, КодыСтрокПриложения);
	
	КодыСтрокПриложений.Вставить(НомерРаздела, КодыСтрокПриложенийРаздела);
	
КонецПроцедуры

Процедура ПроверитьНаличиеСтрокПриложений(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	КодыСтрокПриложений = ДополнительныеПараметры.КодыСтрокПриложений;
	
	СинонимыТЧРазделов = Новый Соответствие();
	СинонимыТЧРазделов.Вставить(1, НСтр("ru='Раздел 1'"));
	СинонимыТЧРазделов.Вставить(2, НСтр("ru='Раздел 2'"));
	СинонимыТЧРазделов.Вставить(3, НСтр("ru='Раздел 3'"));
	
	НомераРазделов = НомераРазделовСПриложениями();
	
	Для Каждого НомерРаздела Из НомераРазделов Цикл
		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ТЧРаздела = ДокументОбъект[ИмяТЧРаздела];
		
		СинонимТЧРаздела = СинонимыТЧРазделов.Получить(НомерРаздела);
		
		Для Каждого СтрокаРаздела Из ТЧРаздела Цикл
			
			НомерПриложения = СтрокаРаздела.НомерПриложения;
			
			Если Не ЗначениеЗаполнено(НомерПриложения) Тогда
				Продолжить;
			КонецЕсли;
			
			КодСтрокиРаздела = СтрокаРаздела.НомерСтроки;
			
			Если КодыСтрокПриложений.Получить(НомерРаздела) <> Неопределено
				И КодыСтрокПриложений.Получить(НомерРаздела).Получить(НомерПриложения) <> Неопределено
				И КодыСтрокПриложений.Получить(НомерРаздела).Получить(НомерПриложения).Получить(КодСтрокиРаздела) <> Неопределено Тогда
				
				Продолжить;
			КонецЕсли;
			
			Если НомерРаздела = 2 И НомерПриложения = 1 Тогда
				ТекстШаблон = НСтр("ru='Справочно: В приложении №%1 отсутствует строка с соответствующим кодом строки (строка %2 списка ""%3"")'");
			Иначе
				ТекстШаблон = НСтр("ru='В приложении №%1 отсутствует строка с соответствующим кодом строки (строка %2 списка ""%3"")'");
				
				ЕстьОшибкиЗаполнения = Истина;
			КонецЕсли;
			
			ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(КодСтрокиРаздела - 1);
			
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ТекстШаблон, НомерПриложения, КодСтрокиРаздела, СинонимТЧРаздела),
				ДокументОбъект.Ссылка,
				"Объект." + ИмяТЧРаздела + "[" + ИндексСтроки + "].НомерПриложения");
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьДублиКодовСтрокПриложений(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	ПараметрыВывода = Новый Структура();
	ПараметрыВывода.Вставить("ОбъектСсылка", ДокументОбъект["Ссылка"]);
	ПараметрыВывода.Вставить("ИмяПоляДляВыводаСообщений", "КодСтроки");
	
	ШаблонСинонимТЧ = НСтр("ru='Приложение %1 к разделу %2'");
	
	НомераРазделов = НомераРазделовСПриложениями();
	
	Для Каждого НомерРаздела Из НомераРазделов Цикл
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
			
			ТЧПриложения = ДокументОбъект[ИмяТЧПриложения];
			
			КолонкиДублей = "НомерСтрокиРаздела,ПорядковыйНомер";
			
			ТаблицаДублиСтрок = ОбщегоНазначенияБГУ.НайтиДублиСтрок(ТЧПриложения, КолонкиДублей);
			
			Если ТаблицаДублиСтрок.Количество() > 0 Тогда
				ЕстьОшибкиЗаполнения = Истина;
				
				ПараметрыВывода.Вставить("ТаблицаИмя",				ИмяТЧПриложения);
				ПараметрыВывода.Вставить("ТаблицаПредставление",	СинонимТЧПриложения);
				
				ОбщегоНазначенияБГУ.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполненностьКодовФормВРазделах(ДокументОбъект, ЕстьОшибкиЗаполнения)
	
	СписокСчетовБезКодаФормы = БухгалтерскийУчет.СписокСчетов("401.50,401.60", ДокументОбъект.ДатаИнвентаризации);
	
	СинонимыТЧРазделов = Новый Соответствие();
	СинонимыТЧРазделов.Вставить(1, НСтр("ru='Раздел 1'"));
	СинонимыТЧРазделов.Вставить(2, НСтр("ru='Раздел 2'"));
	СинонимыТЧРазделов.Вставить(3, НСтр("ru='Раздел 3'"));

	Для НомерРаздела = 1 По КоличествоРазделов() Цикл
 		
		ИмяТЧРаздела = ПолучитьИмяТабличнойЧастиРаздел(НомерРаздела);
		
		ТЧРаздела = ДокументОбъект[ИмяТЧРаздела];
		
		СинонимТЧРаздела = СинонимыТЧРазделов.Получить(НомерРаздела);
		
		Для Каждого СтрокаРаздела Из ТЧРаздела Цикл
			
			Если ЗначениеЗаполнено(СтрокаРаздела.КодФормы) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаРаздела.Счет) Тогда
				Продолжить;
			КонецЕсли;
			
			Если СписокСчетовБезКодаФормы.Найти(СтрокаРаздела.Счет) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьОшибкиЗаполнения = Истина;
			
			ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(СтрокаРаздела.НомерСтроки - 1);
			
			ОбщегоНазначения.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение", НСтр("ru='Код формы'"), СтрокаРаздела.НомерСтроки, СинонимТЧРаздела),
				ДокументОбъект.Ссылка,
				"Объект." + ИмяТЧРаздела + "[" + ИндексСтроки + "].КодФормы");
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПроверитьПриложение1кРазделу2(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	// Проверки аналогичные ОпределитьМестоРегистрации_ИнвентаризацияЦенныхБумаг
	
	ИмяТЧПриложения = "Приложение1кРазделу2";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все суммы отклонений нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.КоличествоНедостача <> 0
			Или СтрокаПриложения.КоличествоИзлишки <> 0
			Или СтрокаПриложения.НоминальнаяСтоимостьНедостача <> 0
			Или СтрокаПриложения.НоминальнаяСтоимостьВалютнаяНедостача <> 0
			Или СтрокаПриложения.НоминальнаяСтоимостьИзлишки <> 0
			Или СтрокаПриложения.НоминальнаяСтоимостьВалютнаяИзлишки <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].КоличествоНедостача");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПриложение3кРазделу2(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	// Проверки аналогичные ОпределитьМестоРегистрации_ИнвентаризацияКредитовИЗаймов
	
	ИмяТЧПриложения = "Приложение3кРазделу2";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все суммы отклонений нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.СуммаОДНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаОДНеподтвержденная <> 0
			Или СтрокаПриложения.СуммаПроцентовНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПроцентовНеподтвержденная <> 0
			Или СтрокаПриложения.СуммаШтрафовНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаШтрафовНеподтвержденная <> 0
			Или СтрокаПриложения.СуммаПенейНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПенейНеподтвержденная <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].СуммаИтогоНеподтвержденная");
			
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьПриложение4кРазделу2(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	// Проверки аналогичные ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаВЦенныхБумагах
	
	ИмяТЧПриложения = "Приложение4кРазделу2";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все суммы отклонений нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.СуммаОДНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаОДНеподтвержденная <> 0
			Или СтрокаПриложения.СуммаПроцентовНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПроцентовНеподтвержденная <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].СуммаИтогоНеподтвержденная");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПриложение5кРазделу2(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	// Проверки аналогичные ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаПоКредитамИГарантиям
	
	ИмяТЧПриложения = "Приложение5кРазделу2";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все суммы отклонений нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.СуммаОДНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаОДНеподтвержденная <> 0
			Или СтрокаПриложения.СуммаПроцентовНеподтвержденнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПроцентовНеподтвержденная <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].СуммаИтогоНеподтвержденная");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПриложение6кРазделу2(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	ИмяТЧПриложения = "Приложение6кРазделу2";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Не указана недостача или излишек'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.НедостачаНачальныйНомер <> 0
			Или СтрокаПриложения.НедостачаКонечныйНомер <> 0
			Или СтрокаПриложения.НедостачаКоличество <> 0
			Или СтрокаПриложения.НедостачаСумма <> 0
			Или СтрокаПриложения.ИзлишекНачальныйНомер <> 0
			Или СтрокаПриложения.ИзлишекКонечныйНомер <> 0
			Или СтрокаПриложения.ИзлишекКоличество <> 0
			Или СтрокаПриложения.ИзлишекСумма <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].НедостачаКоличество");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПриложение7кРазделу2(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	ИмяТЧПриложения = "Приложение7кРазделу2";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Не указана недостача или излишек'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.НедостачаКоличество <> 0
			Или СтрокаПриложения.НедостачаСумма <> 0
			Или СтрокаПриложения.ИзлишекКоличество <> 0
			Или СтрокаПриложения.ИзлишекСумма <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].НедостачаКоличество");
			
	КонецЦикла;
	
КонецПроцедуры


Процедура ПроверитьПриложение1кРазделу3(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	// Проверки аналогичные ОпределитьМестоРегистрации_ИнвентаризацияКредитовИЗаймов
	
	ИмяТЧПриложения = "Приложение1кРазделу3";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все суммы качественных характеристик нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.СуммаОДПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаОДПросроченная <> 0
			Или СтрокаПриложения.СуммаПроцентовПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПроцентовПросроченная <> 0
			Или СтрокаПриложения.СуммаШтрафовПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаШтрафовПросроченная <> 0
			Или СтрокаПриложения.СуммаПенейПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПенейПросроченная <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].СуммаОДПросроченная");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПриложение2кРазделу3(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	// Проверки аналогичные ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаВЦенныхБумагах
	
	ИмяТЧПриложения = "Приложение2кРазделу3";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все суммы качественных характеристик нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.СуммаОДПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаОДПросроченная <> 0
			Или СтрокаПриложения.СуммаПроцентовПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПроцентовПросроченная <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].СуммаОДПросроченная");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПриложение3кРазделу3(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	// Проверки аналогичные ОпределитьМестоРегистрации_ИнвентаризацияГосдолгаПоКредитамИГарантиям
	
	ИмяТЧПриложения = "Приложение3кРазделу3";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все суммы качественных характеристик нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.СуммаОДПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаОДПросроченная <> 0
			Или СтрокаПриложения.СуммаПроцентовПросроченнаяВалютная <> 0
			Или СтрокаПриложения.СуммаПроцентовПросроченная <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].СуммаОДПросроченная");
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПриложение4кРазделу3(ДокументОбъект, ЕстьОшибкиЗаполнения, ДополнительныеПараметры)
	
	ИмяТЧПриложения = "Приложение4кРазделу3";
	
	ТекстШаблон = НСтр("ru='Некорректно заполнена строка %1 списка ""%2"". Все показатели качественных характеристик нулевые'");
	
	СинонимТЧПриложения = ДополнительныеПараметры.МетаданныеТабличныхЧастей[ИмяТЧПриложения].Синоним;
				
	Для Каждого СтрокаПриложения Из ДокументОбъект[ИмяТЧПриложения] Цикл
		
		Если СтрокаПриложения.КоличествоНеСоответствует <> 0
			Или СтрокаПриложения.СуммаНеСоответствует <> 0
			Или СтрокаПриложения.КоличествоПодлежитОбесценению <> 0
			Или СтрокаПриложения.СуммаПодлежитОбесценению <> 0 Тогда
			
			Продолжить;
		КонецЕсли;
		
		ЕстьОшибкиЗаполнения = Истина;
		
		НомерСтроки = СтрокаПриложения.НомерСтроки;
		ИндексСтроки = ИнвентаризацияСервер.ФорматироватьИндексСтрокиТаблицыДляВыводаСообщения(НомерСтроки - 1);
		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстШаблон, НомерСтроки, СинонимТЧПриложения),
			ДокументОбъект.Ссылка,
			"Объект." + ИмяТЧПриложения + "[" + ИндексСтроки + "].КоличествоНеСоответствует");
			
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

#Область ПечатнаяФорма0510463

Функция ПечатьФормы0510463(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	КлючПараметровПечати = "ПечатьФормы0510463";
	
	ОбщийТабДокумент = Новый ТабличныйДокумент();
	ОбщийТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ОбщийТабДокумент.Автомасштаб = Истина;
	ОбщийТабДокумент.КлючПараметровПечати = КлючПараметровПечати;
	
	ТиповыеПараметры = Новый Структура();
	ТиповыеПараметры.Вставить("МассивОбъектов",			МассивОбъектов);
	ТиповыеПараметры.Вставить("ПараметрыПечати",		ПараметрыПечати);
	ТиповыеПараметры.Вставить("КоллекцияПечатныхФорм",	КоллекцияПечатныхФорм);
	ТиповыеПараметры.Вставить("ОбъектыПечати",			ОбъектыПечати);
	ТиповыеПараметры.Вставить("ПараметрыВывода",		ПараметрыВывода);
	
	Данные = ПолучитьДанныеДляПечати(МассивОбъектов);
	
	Данные.Вставить("ДополнительныеПараметры",	ПолучитьДополнительныеПараметрыДляПечатиФормы0510463(КлючПараметровПечати));
	
	ОбластиМакетов = ПолучитьОбластиМакетов();
	
	ПервыйДокумент = Истина;
	
	ВыборкаШапка = Данные.Выборки.Шапки;
	
	Пока ВыборкаШапка.Следующий() Цикл
		ТабДокумент = Новый ТабличныйДокумент();
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент.Автомасштаб = Истина;
		ТабДокумент.КлючПараметровПечати = КлючПараметровПечати;
		
		ПечатьФормы0510463_Титул(ТабДокумент, Данные, ВыборкаШапка, ОбластиМакетов, ТиповыеПараметры);
		
		ПечатьФормы0510463_Приложения(ТабДокумент, Данные, ВыборкаШапка, ОбластиМакетов, ТиповыеПараметры);
		
		Если Не ПервыйДокумент Тогда
			ОбщийТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ОбщийТабДокумент.ВысотаТаблицы + 1;
		
		ОбщийТабДокумент.Вывести(ТабДокумент);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ОбщийТабДокумент, 
			НомерСтрокиНачало,
			ОбъектыПечати,
			ВыборкаШапка.Ссылка);
			
		ПервыйДокумент = Ложь;
	КонецЦикла;
	
	// Колонтитулы
	ОбщийТабДокумент.ВерхнийКолонтитул.Выводить				= Истина;
	ОбщийТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница	= 2;
	ОбщийТабДокумент.ВерхнийКолонтитул.ТекстСправа			= НСтр("ru='Форма 0510463 с.[&НомерСтраницы]'");
	
	Возврат ОбщийТабДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечати(МассивОбъектов)
	
	ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаРУКод = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВалютаРУ, "Код");
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	
	ЗапросПоиск.УстановитьПараметр("ВалютаРУ",		ВалютаРУ);
	ЗапросПоиск.УстановитьПараметр("ВалютаРУКод",	ВалютаРУКод);
	ЗапросПоиск.УстановитьПараметр("ЕдИзмШт",		Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());

	Настройки = НастройкиВидЗадолженности0504084();
	ЗапросПоиск.УстановитьПараметр("ВидЗадолженности0504084ВнутреннийДолг",	Настройки.Представления.Получить(1));
	ЗапросПоиск.УстановитьПараметр("ВидЗадолженности0504084ВнешнийДолг",	Настройки.Представления.Получить(2));
	ЗапросПоиск.УстановитьПараметр("ВидЗадолженности0504084Пустой",			Настройки.Представления.Получить(0));
	
	Настройки = НастройкиВидЗадолженности0504085();
	ЗапросПоиск.УстановитьПараметр("ВидЗадолженности0504085ВнутреннийДолг",	Настройки.Представления.Получить(1));
	ЗапросПоиск.УстановитьПараметр("ВидЗадолженности0504085ВнешнийДолг",	Настройки.Представления.Получить(2));
	ЗапросПоиск.УстановитьПараметр("ВидЗадолженности0504085Пустой",			Настройки.Представления.Получить(0));
	
	ИндексыТаблиц = Новый Структура();
	
	ИндексыТаблиц.Вставить("ПоследнийДобавленныйИндекс", -1);
	
	ЗапросПоиск.Текст = ""
		+ ПолучитьТекстЗапросаПечать_Титул(ИндексыТаблиц)
		
		+ ПолучитьТекстЗапросаПечать_Приложение1кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение2кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение3кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение4кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение5кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение6кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение7кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение8кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение9кРазделу2(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение10кРазделу2(ИндексыТаблиц)
		
		+ ПолучитьТекстЗапросаПечать_Приложение1кРазделу3(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение2кРазделу3(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение3кРазделу3(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение4кРазделу3(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение5кРазделу3(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение6кРазделу3(ИндексыТаблиц)
		+ ПолучитьТекстЗапросаПечать_Приложение7кРазделу3(ИндексыТаблиц)
	;
	
	УпорядочитьИндексыПодзапросов(ЗапросПоиск.Текст);
	
	ИндексыТаблиц.Удалить("ПоследнийДобавленныйИндекс");
	
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	
	Данные = Новый Структура();
	Данные.Вставить("Выборки", Новый Структура());
	
	Для Каждого Элемент Из ИндексыТаблиц Цикл
		ОбозначениеВыборки	= Элемент.Ключ;
		ИндексТаблицы		= Элемент.Значение;
		
		Если ОбозначениеВыборки = "Шапки" Тогда
			ОбходРезультата = ОбходРезультатаЗапроса.Прямой;
		Иначе
			ОбходРезультата = ОбходРезультатаЗапроса.ПоГруппировкам;
		КонецЕсли;
		
		Данные.Выборки.Вставить(ОбозначениеВыборки, РезультатыЗапроса[ИндексТаблицы].Выбрать(ОбходРезультата));
	КонецЦикла;
	
	Данные.Вставить("СоставКомиссий", ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов));
	Данные.Вставить("ДанныеСотрудников", ПолучитьДанныеСотрудников(МассивОбъектов, "Объекты,Комиссии"));
	Данные.Вставить("СведенияУчреждений", УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов));
	Данные.Вставить("НаименованияОписей", НаименованияОписей());
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьДополнительныеПараметрыДляПечатиФормы0510463(КлючПараметровПечати)
	
	Макет0504087 = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ИнвентаризационнаяОписьНФА_0504087_194н");
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("КлючПараметровПечати", КлючПараметровПечати);
	
	ДополнительныеПараметры.Вставить("НастройкиВидДокумента0504086", НастройкиВидДокумента0504086());
	
	ДополнительныеПараметры.Вставить("Графа3_ВыводитьКодОС",		ОбщегоНазначенияБГУ.ПолучитьНастройкуБулевоИзМакета(Макет0504087, "Графа3_ВыводитьКодОС", Ложь));
	ДополнительныеПараметры.Вставить("Графа3_ВыводитьКодМЗ",		ОбщегоНазначенияБГУ.ПолучитьНастройкуБулевоИзМакета(Макет0504087, "Графа3_ВыводитьКодМЗ", Истина));
	ДополнительныеПараметры.Вставить("Графа2_ВыводитьСубконто3",	ОбщегоНазначенияБГУ.ПолучитьНастройкуБулевоИзМакета(Макет0504087, "Графа2_ВыводитьСубконто3", Истина));
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Процедура ПечатьФормы0510463_Титул(ТабДокумент, Данные, СтрокаШапки, ОбластиМакетов, ТиповыеПараметры)
	
	ОбластиМакета = ОбластиМакетов.Титул;
	
	// УТВЕРЖДАЮ
	
	ЗначенияПараметров = Новый Структура();
	
	ЗаполнитьПараметрыТитулУтверждаю(ЗначенияПараметров, СтрокаШапки);
	
	Область = ОбластиМакетов.Титул.Утверждаю;
	Область.Параметры.Заполнить(ЗначенияПараметров);
	ТабДокумент.Вывести(Область);
	
	// ЗАГОЛОВОК
	
	ЗначенияПараметров = Новый Структура();
	
	УправлениеПечатьюБГУ.ЗаполнитьПараметрыСведенийУчреждения(ЗначенияПараметров, СтрокаШапки.Ссылка, Данные.СведенияУчреждений);
	
	НомерАкта = РегистрыСведений.НастройкиПечатиПрефиксаНомера.ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(
		СтрокаШапки.Ссылка,
		СтрокаШапки.Номер);
		
	Данные.ДополнительныеПараметры.Вставить("НомерАкта", НомерАкта);
	
	ЗначенияПараметров.Вставить("Дата",	СтрокаШапки.Дата);
	ЗначенияПараметров.Вставить("Номер", Данные.ДополнительныеПараметры.НомерАкта);
	
	Область = ОбластиМакета["Заголовок"];
	Область.Параметры.Заполнить(СтрокаШапки);
	Область.Параметры.Заполнить(ЗначенияПараметров);
	Область.Параметры.Заполнить(ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(СтрокаШапки.Дата, Истина));
	ТабДокумент.Вывести(Область);
	
	// РАЗДЕЛЫ 1, 2, 3
	
	ВывестиРаздел("1", ТабДокумент, Данные, СтрокаШапки, ОбластиМакетов);
	
	ВывестиРаздел("2", ТабДокумент, Данные, СтрокаШапки, ОбластиМакетов);
	
	ВывестиРаздел("3", ТабДокумент, Данные, СтрокаШапки, ОбластиМакетов);
	
	// КОМИССИЯ
	
	ПараметрыВывода = УправлениеПечатьюБГУ.ПараметрыВыводаСоставаКомиссииПриПечати();
	ПараметрыВывода.ЗаголовокПервогоРядовогоЧлена = НСтр("ru='Член комиссии'");
	ПараметрыВывода.ЗаголовокПоследующихРядовыхЧленов = НСтр("ru='Член комиссии'");
	ПараметрыВывода.ВыводитьДополнительныеСведения = Истина;
	ПараметрыВывода.НастройкиДополнительныхСведений.ВыводитьПричинуОтсутствия = Истина;
	ПараметрыВывода.НастройкиДополнительныхСведений.ВыводитьЗамещающегоСотрудника = Истина;
	
	УправлениеПечатьюБГУ.ВывестиСоставКомиссииПриПечати(ТабДокумент, СтрокаШапки.Ссылка, ОбластиМакетов.Титул.ЧленКомиссии, Данные.СоставКомиссий, ПараметрыВывода);
	
	// ПОДВАЛ
	
	ЗначенияПараметров = Новый Структура();
	
	ЗаполнитьПараметрыОтветственногоИсполнителя(ЗначенияПараметров, СтрокаШапки);
	
	ОбластьПодвал = ОбластиМакетов.Титул.Подвал;
	ОбластьПодвал.Параметры.Заполнить(ЗначенияПараметров);
	
	Если Не ТабДокумент.ПроверитьВывод(ОбластьПодвал) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвал);	
	
КонецПроцедуры

Процедура ПечатьФормы0510463_Приложения(ТабДокумент, Данные, СтрокаШапки, ОбластиМакетов, ТиповыеПараметры)
	
	// Приложения к разделу 2
	
	НомераРазделов = НомераРазделовСПриложениями();
	
	Для Каждого НомерРаздела Из НомераРазделов Цикл
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ИмяТЧ = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
			
			ОбщаяВыборка = Данные.Выборки[ИмяТЧ];
			
			Выборка = ПолучитьВыборкуПоДокументу(ОбщаяВыборка, СтрокаШапки.Ссылка);
			
			Если Выборка.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если НомерРаздела = 2 И НомерПриложения = 10 Тогда
				ТабДокументПриложение = ВывестиПриложение10кРазделу2(Данные, СтрокаШапки, ОбластиМакетов);
			Иначе
				ТабДокументПриложение = ВывестиПриложение(НомерПриложения, НомерРаздела, Данные, СтрокаШапки, ОбластиМакетов);
			КонецЕсли;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабДокумент.Вывести(ТабДокументПриложение);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиРаздел(НомерРазделаСтрокой, ТабДокумент, Данные, СтрокаШапки, ОбластиМакетов)
	
	ОбщаяВыборка = Данные.Выборки["Раздел" + НомерРазделаСтрокой];
	
	Выборка = ПолучитьВыборкуПоДокументу(ОбщаяВыборка, СтрокаШапки.Ссылка);
	
	// В случае отсутствия информации по разделам 2 и 3 указанные разделы не формируются
	Если Выборка.Количество() = 0 И (НомерРазделаСтрокой = "2" Или НомерРазделаСтрокой = "3") Тогда
		Возврат;
	КонецЕсли;
	
	// ЗАГОЛОВОК И ТАБЛИЦА
	
	ПараметрыВыводаТаблицы = ИнвентаризацияСервер.ПолучитьПараметрыВыводаТаблицы();
	
	ПараметрыВыводаТаблицы.Области.Заголовок		= ОбластиМакетов.Титул["Раздел" + НомерРазделаСтрокой + "Заголовок"];
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы		= ОбластиМакетов.Титул["Раздел" + НомерРазделаСтрокой + "Шапка"];
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы	= ОбластиМакетов.Титул["Раздел" + НомерРазделаСтрокой + "Строка"];
	
	ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Разделы123";
	
	ПараметрыВыводаТаблицы.ТабличныйДокумент = ТабДокумент;
	
	ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоТаблице = Ложь;
	ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоСтранице = Ложь;
	
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("НаименованияОписей", Данные.НаименованияОписей);
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("СтрокаШапки", СтрокаШапки);
	ПараметрыВыводаТаблицы.ДополнительныеПараметры.Вставить("ДанныеСотрудников", Данные.ДанныеСотрудников);
	
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = Выборка;
	
	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
	НастроитьНижнююГраницу(ТабДокумент, ОбластиМакетов.Титул["Раздел" + НомерРазделаСтрокой + "Строка"]);

КонецПроцедуры

Функция ВывестиПриложение(НомерПриложения, НомерРаздела, Данные, СтрокаШапки, ОбластиМакетов)
	
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати = Данные.ДополнительныеПараметры.КлючПараметровПечати;
	
	ИмяТЧ = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
	
	// ОПИСАНИЕ
	
	Область = ОбластиМакетов[ИмяТЧ].Описание;
	
	ЗначенияПараметров = Новый Структура("Номер", Данные.ДополнительныеПараметры.НомерАкта);
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	Область.Параметры.Заполнить(ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(СтрокаШапки.Дата, Истина));
	
	ТабДокумент.Вывести(Область);
	
	// ЗАГОЛОВОК
	
	ТабДокумент.Вывести(ОбластиМакетов[ИмяТЧ].Заголовок);
	
	// ТАБЛИЦА
	
	ОбщаяВыборка = Данные.Выборки[ИмяТЧ];
	
	ПараметрыВыводаТаблицы = ИнвентаризацияСервер.ПолучитьПараметрыВыводаТаблицы();
	
	ПараметрыВыводаТаблицы.ДополнительныеПараметры = Данные.ДополнительныеПараметры;
	
	// Шапка таблицы
	
	Если НомерПриложения = 2 И НомерРаздела = 2 Тогда
		
		ЗначенияПараметров = Новый Структура();
		
		ЗначенияПараметров.Вставить("ДатаТаб", Формат(СтрокаШапки.ДатаИнвентаризации, "ДФ=dd.MM.yyyy"));

		ОбластиМакетов[ИмяТЧ].Шапка.Параметры.Заполнить(ЗначенияПараметров);
		
	ИначеЕсли НомерПриложения = 4 И НомерРаздела = 2
		Или НомерПриложения = 5 И НомерРаздела = 2
		Или НомерПриложения = 1 И НомерРаздела = 3
		Или НомерПриложения = 2 И НомерРаздела = 3
		Или НомерПриложения = 3 И НомерРаздела = 3 Тогда
		
		ЗначенияПараметров = Новый Структура();
		
		ЗначенияПараметров.Вставить("ДатаТаб", Формат(СтрокаШапки.ДатаИнвентаризации, "ДФ=dd.MM.yyyy"));

		ОбластиМакетов[ИмяТЧ].Шапка2.Параметры.Заполнить(ЗначенияПараметров);
	КонецЕсли;
	
	// Обработчики заполнения строки макета
	
	Если НомерПриложения = 1 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение1кРазделу2";
		
	ИначеЕсли НомерПриложения = 2 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение2кРазделу2";
		
	ИначеЕсли НомерПриложения = 3 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение3кРазделу2";
		
	ИначеЕсли НомерПриложения = 4 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение4кРазделу2";
		
	ИначеЕсли НомерПриложения = 5 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение5кРазделу2";
		
	ИначеЕсли НомерПриложения = 6 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение6кРазделу2";
		
	ИначеЕсли НомерПриложения = 7 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение7кРазделу2";
		
	ИначеЕсли НомерПриложения = 8 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение8кРазделу2";
		
	ИначеЕсли НомерПриложения = 9 И НомерРаздела = 2 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение9кРазделу2";
		
	ИначеЕсли НомерПриложения = 1 И НомерРаздела = 3 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение1кРазделу3";
		
	ИначеЕсли НомерПриложения = 2 И НомерРаздела = 3 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение2кРазделу3";
		
	ИначеЕсли НомерПриложения = 3 И НомерРаздела = 3 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение3кРазделу3";
		
	ИначеЕсли НомерПриложения = 4 И НомерРаздела = 3 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение4кРазделу3";
		
	ИначеЕсли НомерПриложения = 5 И НомерРаздела = 3 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение5кРазделу3";
		
	ИначеЕсли НомерПриложения = 6 И НомерРаздела = 3 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение6кРазделу3";
		
	ИначеЕсли НомерПриложения = 7 И НомерРаздела = 3 Тогда
		ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение7кРазделу3";
	КонецЕсли;
	
	// Формирование табличного документа
	
	Если НомерПриложения = 3 И НомерРаздела = 2
		Или НомерПриложения = 4 И НомерРаздела = 2
		Или НомерПриложения = 5 И НомерРаздела = 2
		Или НомерПриложения = 1 И НомерРаздела = 3
		Или НомерПриложения = 2 И НомерРаздела = 3
		Или НомерПриложения = 3 И НомерРаздела = 3 Тогда
		
		// Два набора колонок
		
		// Набор колонок №1
		
		ПараметрыВыводаТаблицы.Области.ШапкаТаблицы				= ОбластиМакетов[ИмяТЧ].Шапка1;
		ПараметрыВыводаТаблицы.Области.СтрокаТаблицы			= ОбластиМакетов[ИмяТЧ].Строка1;
		ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами	= ОбластиМакетов[ИмяТЧ].Итого1;
		
		ПараметрыВыводаТаблицы.ТабличныйДокумент = ТабДокумент;
		
		ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоТаблице = Истина;
		ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоСтранице = Ложь;
		
		Выборка = ПолучитьВыборкуПоДокументу(ОбщаяВыборка, СтрокаШапки.Ссылка);
		
		ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = Выборка;
		ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ОбщаяВыборка;
		
		ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
		
		ИнвентаризацияСервер.ОчиститьИтогиИСтатистикуВывода(ПараметрыВыводаТаблицы);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		// Набор колонок №2
		
		ПараметрыВыводаТаблицы.Области.ШапкаТаблицы				= ОбластиМакетов[ИмяТЧ].Шапка2;
		ПараметрыВыводаТаблицы.Области.СтрокаТаблицы			= ОбластиМакетов[ИмяТЧ].Строка2;
		ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами	= ОбластиМакетов[ИмяТЧ].Итого2;
		
		ПараметрыВыводаТаблицы.ТабличныйДокумент = ТабДокумент;
		
		ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоСтранице = Ложь;
		
		Выборка = ПолучитьВыборкуПоДокументу(ОбщаяВыборка, СтрокаШапки.Ссылка);
		
		ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = Выборка;
		ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ОбщаяВыборка;
		
		ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
		
	Иначе
		
		// Всего один-единственный набор колонок
		
		ПараметрыВыводаТаблицы.Области.ШапкаТаблицы				= ОбластиМакетов[ИмяТЧ].Шапка;
		ПараметрыВыводаТаблицы.Области.СтрокаТаблицы			= ОбластиМакетов[ИмяТЧ].Строка;
		ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами	= ОбластиМакетов[ИмяТЧ].Итого;
		//ПараметрыВыводаТаблицы.Области.ИтогиПоСтраницеЧислами	= ОбластиМакетов[ИмяТЧ].ИтогоПоСтранице;
		
		ПараметрыВыводаТаблицы.ТабличныйДокумент = ТабДокумент;
		
		ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоСтранице = Ложь;
		
		Выборка = ПолучитьВыборкуПоДокументу(ОбщаяВыборка, СтрокаШапки.Ссылка);
		
		ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = Выборка;
		ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ОбщаяВыборка;

		ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции


Функция ПолучитьОбластиМакетов()
	
	Результат = Новый Структура();
	
	// Титул и разделы
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктИнвентаризации.ПФ_MXL_Ф0510463_Титул");
	ОбластиМакета = Новый Структура();
	ОбластиМакета.Вставить("Утверждаю",				Макет.ПолучитьОбласть("Утверждаю"));
	ОбластиМакета.Вставить("Заголовок",				Макет.ПолучитьОбласть("Заголовок"));
	ОбластиМакета.Вставить("Раздел1Заголовок",		Макет.ПолучитьОбласть("Раздел1Заголовок"));
	ОбластиМакета.Вставить("Раздел1Шапка",			Макет.ПолучитьОбласть("Раздел1Шапка"));
	ОбластиМакета.Вставить("Раздел1Строка",			Макет.ПолучитьОбласть("Раздел1Строка"));
	ОбластиМакета.Вставить("Раздел2Заголовок",		Макет.ПолучитьОбласть("Раздел2Заголовок"));
	ОбластиМакета.Вставить("Раздел2Шапка",			Макет.ПолучитьОбласть("Раздел2Шапка"));
	ОбластиМакета.Вставить("Раздел2Строка",			Макет.ПолучитьОбласть("Раздел2Строка"));
	ОбластиМакета.Вставить("Раздел3Заголовок",		Макет.ПолучитьОбласть("Раздел3Заголовок"));
	ОбластиМакета.Вставить("Раздел3Шапка",			Макет.ПолучитьОбласть("Раздел3Шапка"));
	ОбластиМакета.Вставить("Раздел3Строка",			Макет.ПолучитьОбласть("Раздел3Строка"));
	ОбластиМакета.Вставить("ЧленКомиссии",			Макет.ПолучитьОбласть("ЧленКомиссии"));
	ОбластиМакета.Вставить("Подвал",				Макет.ПолучитьОбласть("Подвал"));
	Результат.Вставить("Титул", ОбластиМакета);
	
	// Приложения
	
	НомераРазделов = НомераРазделовСПриложениями();
	
	Для Каждого НомерРаздела Из НомераРазделов Цикл
		
		Для НомерПриложения = 1 По ПолучитьКоличествоПриложенийКРазделу(НомерРаздела) Цикл
			
			ДобавитьОбластиМакетаПриложения(Результат, НомерПриложения, НомерРаздела);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьОбластиМакетаПриложения(Приемник, НомерПриложения, НомерРаздела)
	
	ИмяТЧПриложения = ПолучитьИмяТабличнойЧастиПриложениеКРазделу(НомерПриложения, НомерРаздела);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктИнвентаризации.ПФ_MXL_Ф0510463_" + ИмяТЧПриложения);
	
	ОбластиМакета = Новый Структура();
	
	ОбластиМакета.Вставить("Описание",	Макет.ПолучитьОбласть("Описание"));
	ОбластиМакета.Вставить("Заголовок",	Макет.ПолучитьОбласть("Заголовок"));
	
	Если НомерПриложения = 3 И НомерРаздела = 2
		Или НомерПриложения = 4 И НомерРаздела = 2
		Или НомерПриложения = 5 И НомерРаздела = 2
		Или НомерПриложения = 1 И НомерРаздела = 3
		Или НомерПриложения = 2 И НомерРаздела = 3
		Или НомерПриложения = 3 И НомерРаздела = 3 Тогда
		
		// Набор колонок №1
		ОбластиМакета.Вставить("Шапка1",			Макет.ПолучитьОбласть("Шапка1"));
		ОбластиМакета.Вставить("Строка1",			Макет.ПолучитьОбласть("Строка1"));
		ОбластиМакета.Вставить("Итого1",			Макет.ПолучитьОбласть("Итого1"));
		
		// Набор колонок №2
		ОбластиМакета.Вставить("Шапка2",			Макет.ПолучитьОбласть("Шапка2"));
		ОбластиМакета.Вставить("Строка2",			Макет.ПолучитьОбласть("Строка2"));
		ОбластиМакета.Вставить("Итого2",			Макет.ПолучитьОбласть("Итого2"));
		
	ИначеЕсли НомерПриложения = 10 И НомерРаздела = 2 Тогда
		ОбластиМакета.Вставить("Шапка",						Макет.ПолучитьОбласть("Шапка"));
		ОбластиМакета.Вставить("Строка",					Макет.ПолучитьОбласть("Строка"));
		ОбластиМакета.Вставить("ИтогоЕдинственнаяСтрока",	Макет.ПолучитьОбласть("ИтогоЕдинственнаяСтрока"));
		ОбластиМакета.Вставить("ИтогоПерваяСтрока",			Макет.ПолучитьОбласть("ИтогоПерваяСтрока"));
		ОбластиМакета.Вставить("ИтогоОчереднаяСтрока",		Макет.ПолучитьОбласть("ИтогоОчереднаяСтрока"));
		ОбластиМакета.Вставить("ИтогоПоследняяСтрока",		Макет.ПолучитьОбласть("ИтогоПоследняяСтрока"));
		
	Иначе
		ОбластиМакета.Вставить("Шапка",				Макет.ПолучитьОбласть("Шапка"));
		ОбластиМакета.Вставить("Строка",			Макет.ПолучитьОбласть("Строка"));
		ОбластиМакета.Вставить("Итого",				Макет.ПолучитьОбласть("Итого"));
	КонецЕсли;
	
	Приемник.Вставить(ИмяТЧПриложения, ОбластиМакета);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыТитулУтверждаю(ЗначенияПараметров, СтрокаШапки)
	
	ДанныеПодписанта = Новый Структура("СсылкаНаОбъект, Период, Должность", СтрокаШапки.Руководитель, СтрокаШапки.Дата);
	
	Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПодписанта);
	
	ДолжностьУтверждаю = ДанныеПодписанта.Должность;
	
	ФИОУтверждаю = Справочники.Сотрудники.ФамилияИО(СтрокаШапки.Руководитель, Ложь, СтрокаШапки.Дата);
	
	ЗначенияПараметров.Вставить("Должность",	ДолжностьУтверждаю);
	ЗначенияПараметров.Вставить("ФИО",			ФИОУтверждаю);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыОтветственногоИсполнителя(ЗначенияПараметров, СтрокаШапки)
	
	ДанныеСотрудника = Новый Структура();
	ДанныеСотрудника.Вставить("СсылкаНаОбъект",	СтрокаШапки.ОтветственныйИсполнитель);
	ДанныеСотрудника.Вставить("Период",			СтрокаШапки.Дата);
	ДанныеСотрудника.Вставить("ДолжностьНаименование");
	ДанныеСотрудника.Вставить("Фамилия");
	ДанныеСотрудника.Вставить("Имя");
	ДанныеСотрудника.Вставить("Отчество");
	
	ПолучатьКИдляПечати = Истина;
	
	Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника,, ПолучатьКИдляПечати);
	
	ЗначенияПараметров.Вставить("ДолжностьНаименование",	ДанныеСотрудника.ДолжностьНаименование);
	ЗначенияПараметров.Вставить("ФИО",						КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
	ЗначенияПараметров.Вставить("НомерТелефона",			ДанныеСотрудника.ТелефонРабочийФизическиеЛица);
	ЗначенияПараметров.Вставить("ЭлектроннаяПочта",			ДанныеСотрудника.EmailФизическиеЛица);
	
КонецПроцедуры

Функция ПолучитьНаименованиеОписи(КодОписи, НаименованияОписей)

	НаименованиеОписи = НаименованияОписей.Получить(КодОписи);
	
	Если НаименованиеОписи = Неопределено Тогда
		НаименованиеОписи = "";
	КонецЕсли;
	
	Возврат НаименованиеОписи;
	
КонецФункции

Процедура НастроитьНижнююГраницу(ТабДокумент, ОбластьСтрокаТаблицы)
	
	// За образец линии берем левую границу самой первой ячейки указанной области
	
	ОбразецЛинии = ОбластьСтрокаТаблицы.Область(1, 1, 1, 1).ГраницаСлева;
	
	НомерПоследнейСтроки = ТабДокумент.ВысотаТаблицы;
	
	НомерПоследнейКолонки = ОбластьСтрокаТаблицы.ШиринаТаблицы;
	
	ТабДокумент.Область(НомерПоследнейСтроки, 1, НомерПоследнейСтроки, НомерПоследнейКолонки).ГраницаСнизу = ОбразецЛинии;
	
КонецПроцедуры

Функция ПолучитьВыборкуПоДокументу(ОбщаяВыборка, ДокументСсылка)
	
	ПоискТекущегоДокумента = Новый Структура("Ссылка", ДокументСсылка);
	
	ОбщаяВыборка.Сбросить();
	
	ОбщаяВыборка.НайтиСледующий(ПоискТекущегоДокумента);
	
	Возврат ОбщаяВыборка.Выбрать();
	
КонецФункции

Функция ПолучитьДанныеСотрудников(МассивДокументов, ИменаТабличныхЧастей)
	
	СписокСотрудников = ПолучитьСписокСотрудников(МассивДокументов);
	
	Результат = Новый Соответствие();
	
	Поиск = Новый Структура();
	
	ТребуемыеДанные = "НаименованиеПолное,ДолжностьНаименование,Подразделение";
	
	Для Каждого Дата Из СписокСотрудников["ДатыОпределенияСведений"] Цикл
		ПорцияСведений = ИнвентаризацияСервер.ПолучитьПорциюСведенийСотрудниковНаДату(СписокСотрудников["ТаблицаСотрудников"], Дата);
		
		Результат.Вставить(Дата, ПорцияСведений);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокСотрудников(МассивДокументов)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("МассивСсылок", МассивДокументов);
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Полный список всех ответственных лиц из разделов 1, 2, 3
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка					КАК ДокументСсылка,
	|	Док.Дата					КАК ДатаОпределенияСведений,
	|	ТЧ.ОтветственноеЛицо		КАК Сотрудник
	|ИЗ
	|	Документ.АктИнвентаризации КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктИнвентаризации.Раздел1 КАК ТЧ
	|		ПО Док.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	Док.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка					КАК ДокументСсылка,
	|	Док.Дата					КАК ДатаОпределенияСведений,
	|	ТЧ.ОтветственноеЛицо		КАК Сотрудник
	|ИЗ
	|	Документ.АктИнвентаризации КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктИнвентаризации.Раздел2 КАК ТЧ
	|		ПО Док.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	Док.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка					КАК ДокументСсылка,
	|	Док.Дата					КАК ДатаОпределенияСведений,
	|	ТЧ.ОтветственноеЛицо		КАК Сотрудник
	|ИЗ
	|	Документ.АктИнвентаризации КАК Док
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктИнвентаризации.Раздел3 КАК ТЧ
	|		ПО Док.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	Док.Ссылка В(&МассивСсылок)
	|;";
	
	ТаблицаСотрудников = ЗапросПоиск.Выполнить().Выгрузить();
	
	ВремТаблица = ТаблицаСотрудников.Скопировать(, "ДатаОпределенияСведений");
	ВремТаблица.Свернуть("ДатаОпределенияСведений");
	
	ДатыОпределенияСведений = ВремТаблица.ВыгрузитьКолонку("ДатаОпределенияСведений");
	
	Результат = Новый Структура();
	Результат.Вставить("ТаблицаСотрудников",		ТаблицаСотрудников);
	Результат.Вставить("ДатыОпределенияСведений",	ДатыОпределенияСведений);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеСотрудника(ДанныеСотрудников, Сотрудник, Дата, ПолучитьДолжность = Ложь, ПолучитьПодразделение = Ложь)
	
	Перем Должность, ФИО, Подразделение;
	
	ТаблицаДанныеСотрудников = ДанныеСотрудников.Получить(Дата);
	
	Если ЗначениеЗаполнено(Сотрудник) И ТаблицаДанныеСотрудников <> Неопределено Тогда
		
		Поиск = Новый Структура("Ссылка", Сотрудник);
		
		МассивСтрок = ТаблицаДанныеСотрудников.НайтиСтроки(Поиск);
		
		СтрокаДанных = МассивСтрок[0];
		
		ФИО = СтрокаДанных.Фамилия + " " + СтрокаДанных.Имя + " " + СтрокаДанных.Отчество;
		
		Если ПолучитьДолжность Тогда
			Должность = СтрокаДанных.ДолжностьНаименование;
		КонецЕсли;
		
		Если ПолучитьПодразделение Тогда
			Подразделение = СтрокаДанных.Подразделение;
		КонецЕсли;
		
		Если ПолучитьДолжность ИЛИ ПолучитьПодразделение Тогда
			ДолжностьПодразделение = Должность + ?(ЗначениеЗаполнено(Подразделение), ", " + Подразделение,	"");
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Новый Структура();
	
	Результат.Вставить("ФИО", ФИО);
	
	Если ПолучитьДолжность Тогда
		Результат.Вставить("Должность", Должность);
	КонецЕсли;
	
	Если ПолучитьПодразделение Тогда
		Результат.Вставить("Подразделение", Подразделение);
	КонецЕсли;
	
	Если ПолучитьДолжность ИЛИ ПолучитьПодразделение Тогда
		Результат.Вставить("ДолжностьПодразделение", ДолжностьПодразделение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Печать приложение №10 к разделу 2

Функция ВывестиПриложение10кРазделу2(Данные, СтрокаШапки, ОбластиМакетов)
	
	Перем ПревышенРазмерСтраницы;
	
	КлючПараметровПечати = Данные.ДополнительныеПараметры.КлючПараметровПечати;
	
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати = КлючПараметровПечати;
	
	ИмяТЧ = "Приложение10кРазделу2";
	
	// Расчет итогов
	
	ОбщаяВыборка = Данные.Выборки[ИмяТЧ];
	
	ОбщаяТаблицаИтогов = ПолучитьТаблицуИтоговПриложение10кРазделу2(ОбщаяВыборка);
	
	ТабДокументИтогов = ПолучитьТабДокументИтоговПриложение10кРазделу2(ОбщаяТаблицаИтогов, СтрокаШапки, ОбластиМакетов, КлючПараметровПечати, ПревышенРазмерСтраницы);
	
	// Вывод печатной формы
	
	// ОПИСАНИЕ
	
	Область = ОбластиМакетов[ИмяТЧ].Описание;
	
	ЗначенияПараметров = Новый Структура("Номер", Данные.ДополнительныеПараметры.НомерАкта);
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	Область.Параметры.Заполнить(ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(СтрокаШапки.Дата, Истина));
	
	ТабДокумент.Вывести(Область);
	
	// ЗАГОЛОВОК
	
	ТабДокумент.Вывести(ОбластиМакетов[ИмяТЧ].Заголовок);
	
	// ТАБЛИЦА
	
	ОбщаяВыборка = Данные.Выборки[ИмяТЧ];
	
	ПараметрыВыводаТаблицы = ИнвентаризацияСервер.ПолучитьПараметрыВыводаТаблицы();
	
	ПараметрыВыводаТаблицы.ДополнительныеПараметры = Данные.ДополнительныеПараметры;
	
	ПараметрыВыводаТаблицы.Области.ШапкаТаблицы		= ОбластиМакетов[ИмяТЧ].Шапка;
	ПараметрыВыводаТаблицы.Области.СтрокаТаблицы	= ОбластиМакетов[ИмяТЧ].Строка;
	
	ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоСтранице = Ложь;
	
	Если ПревышенРазмерСтраницы Тогда
		ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоТаблице = Ложь;
	Иначе
		ПараметрыВыводаТаблицы.Области.ИтогиПоТаблицеЧислами = ТабДокументИтогов;
		
		ПараметрыВыводаТаблицы.НастройкиВывода.ВыводитьИтогиПоТаблице = Истина;
	КонецЕсли;
	
	ПараметрыВыводаТаблицы.ИменаПроцедур.ЗаполнитьОбластьСтрокаТаблицы = "Документы.АктИнвентаризации.ЗаполнитьОбластьСтрокаТаблицы_Приложение10кРазделу2";
	
	ПараметрыВыводаТаблицы.ТабличныйДокумент = ТабДокумент;
	
	Выборка = ПолучитьВыборкуПоДокументу(ОбщаяВыборка, СтрокаШапки.Ссылка);
	
	ПараметрыВыводаТаблицы.Выборки.ДетальныеЗаписи = Выборка;
	ПараметрыВыводаТаблицы.Выборки.ИтогиТаблицы = ОбщаяВыборка;

	ИнвентаризацияСервер.ВывестиТаблицуСРазбивкойНаСтраницы(ПараметрыВыводаТаблицы);
	
	Если ПревышенРазмерСтраницы Тогда
		ТабДокумент.Вывести(ТабДокументИтогов);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьТаблицуИтоговПриложение10кРазделу2(ОбщаяВыборка)
	
	ОчищающаяСтруктура = Новый Структура("КПС,КФО,КЭК");
	
	ОбщаяТаблица = Новый ТаблицаЗначений();
	ОбщаяТаблица.Колонки.Добавить("Ссылка",				Новый ОписаниеТипов("ДокументСсылка.АктИнвентаризации"));
	ОбщаяТаблица.Колонки.Добавить("СуммаОтклонений",	ОбщегоНазначения.ОписаниеТипаЧисло(18,2,ДопустимыйЗнак.Любой));
	ОбщаяТаблица.Колонки.Добавить("ТаблицаИтогов",		Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Поиск = Новый Структура("Ссылка");
	
	ОбщаяВыборка.Сбросить();
	
	Пока ОбщаяВыборка.Следующий() Цикл
		
		Ссылка = ОбщаяВыборка.Ссылка;
		
		Поиск.Ссылка = Ссылка;
		
		МассивСтрок = ОбщаяТаблица.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() = 0 Тогда
			СтрокаОбщейТаблицы = ОбщаяТаблица.Добавить();
			СтрокаОбщейТаблицы.Ссылка = Ссылка;
			
			ТаблицаИтогов = ПолучитьПустуюТаблицуИтоговОписиПриложение10кРазделу2();
		Иначе
			СтрокаОбщейТаблицы = МассивСтрок[0];
			
			ТаблицаИтогов = СтрокаОбщейТаблицы.ТаблицаИтогов;
		КонецЕсли;
		
		Выборка = ОбщаяВыборка.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаИтогов.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОчищающаяСтруктура);
		КонецЦикла;
		
		ТаблицаИтогов.Свернуть("КПС,КФО,Счет,КЭК", "СуммаОтклонений");
		
		СтрокаОбщейТаблицы.ТаблицаИтогов = ТаблицаИтогов;
		СтрокаОбщейТаблицы.СуммаОтклонений = ТаблицаИтогов.Итог("СуммаОтклонений");
	КонецЦикла;
	
	ОбщаяВыборка.Сбросить();
	
	Возврат ОбщаяТаблица;
	
КонецФункции

Функция ПолучитьПустуюТаблицуИтоговОписиПриложение10кРазделу2()
	
	ТаблицаИтогов = Новый ТаблицаЗначений();
	ТаблицаИтогов.Колонки.Добавить("КПС",				Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаИтогов.Колонки.Добавить("КФО",				Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаИтогов.Колонки.Добавить("Счет",				Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаИтогов.Колонки.Добавить("КЭК",				Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ТаблицаИтогов.Колонки.Добавить("СуммаОтклонений",	ОбщегоНазначения.ОписаниеТипаЧисло(18,2,ДопустимыйЗнак.Любой));
	
	Возврат ТаблицаИтогов;
	
КонецФункции

Функция ПолучитьТабДокументИтоговПриложение10кРазделу2(ОбщаяТаблицаИтогов, СтрокаШапки, ОбластиМакетов, КлючПараметровПечати, ПревышенРазмерСтраницы)
	
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати = КлючПараметровПечати;
	
	ПревышенРазмерСтраницы = Ложь;
	
	Области = ОбластиМакетов.Приложение10кРазделу2;
	
	Поиск = Новый Структура("Ссылка", СтрокаШапки.Ссылка);
	
	МассивСтрок = ОбщаяТаблицаИтогов.НайтиСтроки(Поиск);
	
	СтрокаИтоговОписи = МассивСтрок[0];
	
	ТаблицаИтогов = СтрокаИтоговОписи.ТаблицаИтогов;
	
	КоличествоСтрок = ТаблицаИтогов.Количество();
	
	ЗначенияПараметров = Новый Структура("НомерСчета");
	
	Если КоличествоСтрок = 1 Тогда
		СтрокаИтогов = ТаблицаИтогов[0];
		ЗначенияПараметров.НомерСчета = ПолучитьПолныйНомерСчета(СтрокаИтогов.КПС, СтрокаИтогов.КФО, СтрокаИтогов.Счет, СтрокаИтогов.КЭК);
		Область = Области.ИтогоЕдинственнаяСтрока;
		Область.Параметры.Заполнить(СтрокаИтогов);
		Область.Параметры.Заполнить(ЗначенияПараметров);
		
		ТабДокумент.Вывести(Область);
		
	ИначеЕсли КоличествоСтрок = 2 Тогда
		СтрокаИтогов = ТаблицаИтогов[0];
		ЗначенияПараметров.НомерСчета = ПолучитьПолныйНомерСчета(СтрокаИтогов.КПС, СтрокаИтогов.КФО, СтрокаИтогов.Счет, СтрокаИтогов.КЭК);
		Область = Области.ИтогоПерваяСтрока;
		Область.Параметры.Заполнить(СтрокаИтогов);
		Область.Параметры.Заполнить(ЗначенияПараметров);
		ТабДокумент.Вывести(Область);
		
		СтрокаИтогов = ТаблицаИтогов[1];
		ЗначенияПараметров.НомерСчета = ПолучитьПолныйНомерСчета(СтрокаИтогов.КПС, СтрокаИтогов.КФО, СтрокаИтогов.Счет, СтрокаИтогов.КЭК);
		Область = Области.ИтогоПоследняяСтрока;
		Область.Параметры.Заполнить(СтрокаИтогов);
		Область.Параметры.Заполнить(ЗначенияПараметров);
		ТабДокумент.Вывести(Область);
		
	ИначеЕсли КоличествоСтрок > 2 Тогда
		СтрокаИтогов = ТаблицаИтогов[0];
		ЗначенияПараметров.НомерСчета = ПолучитьПолныйНомерСчета(СтрокаИтогов.КПС, СтрокаИтогов.КФО, СтрокаИтогов.Счет, СтрокаИтогов.КЭК);
		Область = Области.ИтогоПерваяСтрока;
		Область.Параметры.Заполнить(СтрокаИтогов);
		Область.Параметры.Заполнить(ЗначенияПараметров);
		ТабДокумент.Вывести(Область);
		
		// Заполняем, но не выводим. Нужно для дальнейшей проверки вывода. Выводим позже.
		СтрокаИтогов = ТаблицаИтогов[КоличествоСтрок - 1];
		ЗначенияПараметров.НомерСчета = ПолучитьПолныйНомерСчета(СтрокаИтогов.КПС, СтрокаИтогов.КФО, СтрокаИтогов.Счет, СтрокаИтогов.КЭК);
		ОбластьПоследняяСтрока = Области.ИтогоПоследняяСтрока;
		ОбластьПоследняяСтрока.Параметры.Заполнить(СтрокаИтогов);
		ОбластьПоследняяСтрока.Параметры.Заполнить(ЗначенияПараметров);
		
		ОбластиПроверкиВывода = Новый Массив();
		ОбластиПроверкиВывода.Добавить(Неопределено);
		ОбластиПроверкиВывода.Добавить(ОбластьПоследняяСтрока);
		
		Для Счетчик = 1 По КоличествоСтрок - 2 Цикл
			СтрокаИтогов = ТаблицаИтогов[Счетчик];
			ЗначенияПараметров.НомерСчета = ПолучитьПолныйНомерСчета(СтрокаИтогов.КПС, СтрокаИтогов.КФО, СтрокаИтогов.Счет, СтрокаИтогов.КЭК);
			Область = Области.ИтогоОчереднаяСтрока;
			Область.Параметры.Заполнить(СтрокаИтогов);
			Область.Параметры.Заполнить(ЗначенияПараметров);
			
			ОбластиПроверкиВывода[0] = Область;
			
			Если Не ТабДокумент.ПроверитьВывод(ОбластиПроверкиВывода) Тогда
				ПревышенРазмерСтраницы = Истина;
			КонецЕсли;
			
			ТабДокумент.Вывести(Область);
		КонецЦикла;
		
		ТабДокумент.Вывести(ОбластьПоследняяСтрока);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область ТекстыЗапросовПечати

Функция ПолучитьТекстЗапросаПечать_Титул(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Шапки");
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Раздел1");
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Раздел2");
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Раздел3");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные шапок
	|//
	|ВЫБРАТЬ
	|	Ссылка									КАК Ссылка,
	|	Номер									КАК Номер,
	|	Дата									КАК Дата,
	|	Организация								КАК Организация,
	|	Подразделение							КАК Подразделение,
	|	РешениеОПроведенииИнвентаризации		КАК РешениеОПроведенииИнвентаризации,
	|	РешениеОПроведенииИнвентаризации.Дата	КАК ДатаРешения,
	|	РешениеОПроведенииИнвентаризации.Номер	КАК НомерРешения,
	|	ДатаИнвентаризации						КАК ДатаИнвентаризации,
	|	Комиссия								КАК Комиссия,
	|	Ответственный							КАК Ответственный,
	|	ОтветственныйИсполнитель				КАК ОтветственныйИсполнитель,
	|	Руководитель							КАК Руководитель,
	|	НомерКомиссии							КАК НомерКомиссии,
	|	Комментарий								КАК Комментарий
	|ИЗ
	|	Документ.АктИнвентаризации
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные табличных частей Раздел1
	|//
	|ВЫБРАТЬ
	|	Ссылка								КАК Ссылка,
	|	НомерСтроки							КАК КодСтроки,
	|	Опись								КАК Опись,
	|	НомерОписи							КАК НомерОписи,
	|	ДатаОписи							КАК ДатаОписи,
	|	КодФормы							КАК КодФормы,
	|	ОтветственноеЛицо					КАК ОтветственноеЛицо,
	|	КФО									КАК КФО,
	|	ПРЕДСТАВЛЕНИЕ(КФО)					КАК КФОНаименование,
	|	Счет								КАК Счет,
	|	ЕСТЬNULL(Счет.Код, """")				КАК СчетКод,
	|	ЕСТЬNULL(Счет.Наименование, """")		КАК СчетНаименование,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, ЛОЖЬ)		КАК СчетУчетПоКЭК,
	|	ЕСТЬNULL(Счет.Забалансовый, ЛОЖЬ)	КАК СчетЗабалансовый,
	|	ДатаИнвентаризации					КАК ДатаИнвентаризации,
	|	ДатаНачала							КАК ДатаНачала,
	|	ДатаОкончания						КАК ДатаОкончания,
	|	МестоИнвентаризации					КАК МестоИнвентаризации,
	|	Примечание							КАК Примечание
	|ИЗ
	|	Документ.АктИнвентаризации.Раздел1
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Данные табличных частей Раздел2
	|//
	|ВЫБРАТЬ
	|	Ссылка								КАК Ссылка,
	|	НомерСтроки							КАК КодСтроки,
	|	Опись								КАК Опись,
	|	НомерОписи							КАК НомерОписи,
	|	ДатаОписи							КАК ДатаОписи,
	|	КодФормы							КАК КодФормы,
	|	ОтветственноеЛицо					КАК ОтветственноеЛицо,
	|	КФО									КАК КФО,
	|	ПРЕДСТАВЛЕНИЕ(КФО)					КАК КФОНаименование,
	|	Счет								КАК Счет,
	|	ЕСТЬNULL(Счет.Код, """")				КАК СчетКод,
	|	ЕСТЬNULL(Счет.Наименование, """")		КАК СчетНаименование,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, ЛОЖЬ)		КАК СчетУчетПоКЭК,
	|	ЕСТЬNULL(Счет.Забалансовый, ЛОЖЬ)	КАК СчетЗабалансовый,
	|	ДатаИнвентаризации					КАК ДатаИнвентаризации,
	|	ДатаНачала							КАК ДатаНачала,
	|	ДатаОкончания						КАК ДатаОкончания,
	|	МестоИнвентаризации					КАК МестоИнвентаризации,
	|	Примечание							КАК Примечание,
	|	НомерПриложения						КАК НомерПриложения
	|ИЗ
	|	Документ.АктИнвентаризации.Раздел2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Данные табличных частей Раздел3
	|//
	|ВЫБРАТЬ
	|	Ссылка								КАК Ссылка,
	|	НомерСтроки							КАК КодСтроки,
	|	Опись								КАК Опись,
	|	НомерОписи							КАК НомерОписи,
	|	ДатаОписи							КАК ДатаОписи,
	|	КодФормы							КАК КодФормы,
	|	ОтветственноеЛицо					КАК ОтветственноеЛицо,
	|	КФО									КАК КФО,
	|	ПРЕДСТАВЛЕНИЕ(КФО)					КАК КФОНаименование,
	|	Счет								КАК Счет,
	|	ЕСТЬNULL(Счет.Код, """")				КАК СчетКод,
	|	ЕСТЬNULL(Счет.Наименование, """")		КАК СчетНаименование,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, ЛОЖЬ)		КАК СчетУчетПоКЭК,
	|	ЕСТЬNULL(Счет.Забалансовый, ЛОЖЬ)	КАК СчетЗабалансовый,
	|	ДатаИнвентаризации					КАК ДатаИнвентаризации,
	|	ДатаНачала							КАК ДатаНачала,
	|	ДатаОкончания						КАК ДатаОкончания,
	|	МестоИнвентаризации					КАК МестоИнвентаризации,
	|	Примечание							КАК Примечание,
	|	НомерПриложения						КАК НомерПриложения
	|ИЗ
	|	Документ.АктИнвентаризации.Раздел3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение1кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение1кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение1кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка									КАК Ссылка,
	|	НомерСтрокиРаздела						КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер							КАК ПорядковыйНомер,
	|	НомерОписи								КАК НомерОписи,
	|	ДатаОписи								КАК ДатаОписи,
	|	ВидЦеннойБумаги							КАК ВидЦеннойБумаги,
	|	ЦеннаяБумага.Наименование				КАК Наименование,
	|	ЦеннаяБумага.Код						КАК Код,
	|	ЦеннаяБумага.Серия						КАК Серия,
	|	ЦеннаяБумага.Номер						КАК Номер,
	|	ЦеннаяБумага.НоминальнаяСтоимость		КАК Номинал,
	|	Валюта.Код								КАК КодВалюты,
	|	Курс									КАК Курс,
	|	Кратность								КАК Кратность,
	|	КоличествоНедостача						КАК КоличествоНедостача,
	|	КоличествоИзлишки						КАК КоличествоИзлишки,
	|	НоминальнаяСтоимостьНедостача			КАК НоминальнаяСтоимостьНедостача,
	|	НоминальнаяСтоимостьВалютнаяНедостача	КАК НоминальнаяСтоимостьВалютнаяНедостача,
	|	НоминальнаяСтоимостьИзлишки				КАК НоминальнаяСтоимостьИзлишки,
	|	НоминальнаяСтоимостьВалютнаяИзлишки		КАК НоминальнаяСтоимостьВалютнаяИзлишки,
	|	КурсНаДатуВалютирования					КАК КурсНаДатуВалютирования,
	|	КратностьНаДатуВалютирования			КАК КратностьНаДатуВалютирования,
	|	ЗаключениеКомиссии						КАК ЗаключениеКомиссии,
	|	РешениеКомиссии							КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение1кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(КоличествоНедостача),
	|	СУММА(НоминальнаяСтоимостьНедостача),
	|	СУММА(КоличествоИзлишки),
	|	СУММА(НоминальнаяСтоимостьИзлишки)
	|ПО
	|	Ссылка
	|;";

КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение2кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение2кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение2кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка								КАК Ссылка,
	|	НомерСтрокиРаздела					КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер						КАК ПорядковыйНомер,
	|	НомерОписи							КАК НомерОписи,
	|	ДатаОписи							КАК ДатаОписи,
	|	Ссылка.ДатаИнвентаризации			КАК ДатаИнвентаризации,
	|	КФО									КАК КФО,
	|	ЕСТЬNULL(Счет.Код, ""000"")			КАК СчетКод,
	|	ЛицевойСчет							КАК ЛицевойСчет,
	|	КассовыйОрган.Наименование			КАК НаименованиеБанка,
	|	НомерЛицевогоСчета					КАК НомерЛицевогоСчета,
	|	РазделЛицевогоСчета.Наименование	КАК РазделЛицевогоСчета,
	|	ВЫБОР
	|		КОГДА Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ИЛИ Валюта = &ВалютаРУ ТОГДА
	|			&ВалютаРУКод
	|		ИНАЧЕ
	|			Валюта.Код
	|	КОНЕЦ								КАК КодВалюты,
	|	Курс								КАК Курс,
	|	Кратность							КАК Кратность,
	|	СуммаОтклоненийВалютная				КАК СуммаОтклоненийВалютная,
	|	СуммаОтклонений						КАК СуммаОтклонений,
	|	ЗаключениеКомиссии					КАК ЗаключениеКомиссии,
	|	РешениеКомиссии						КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение2кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОтклонений)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение3кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение3кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение3кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка									КАК Ссылка,
	|	
	|	// Набор колонок №1
	|	НомерСтрокиРаздела						КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер							КАК ПорядковыйНомер,
	|	НомерОписи								КАК НомерОписи,
	|	ДатаОписи								КАК ДатаОписи,
	|	НаименованиеЗадолженности				КАК НаименованиеЗадолженности,
	|	ВЫБОР
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ
	|			Контрагент.Наименование
	|	КОНЕЦ									КАК НаименованиеЗаемщика, // Аналогично ИнвентаризацияКредитовИЗаймов.ПечатьФормы0504083
	|	Договор.ДатаДоговора					КАК ДатаДоговора,
	|	Договор.НомерДоговора					КАК НомерДоговора,
	|	Счет.Код								КАК СчетКод,
	|	Представление(КФО)						КАК КФО,
	|	Представление(КПС)						КАК КПС,
	|	ВЫБОР
	|		КОГДА Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			&ВалютаРУКод
	|		ИНАЧЕ
	|			Валюта.Код
	|	КОНЕЦ									КАК КодВалюты,
	|	
	|	// Набор колонок №2
	|	СуммаОДНеподтвержденнаяВалютная			КАК СуммаОДНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная					КАК СуммаОДНеподтвержденная,
	|	СуммаПроцентовНеподтвержденнаяВалютная	КАК СуммаПроцентовНеподтвержденнаяВалютная,
	|	СуммаПроцентовНеподтвержденная			КАК СуммаПроцентовНеподтвержденная,
	|	СуммаШтрафовНеподтвержденнаяВалютная	КАК СуммаШтрафовНеподтвержденнаяВалютная,
	|	СуммаШтрафовНеподтвержденная			КАК СуммаШтрафовНеподтвержденная,
	|	СуммаПенейНеподтвержденнаяВалютная		КАК СуммаПенейНеподтвержденнаяВалютная,
	|	СуммаПенейНеподтвержденная				КАК СуммаПенейНеподтвержденная,
	|	СуммаИтогоНеподтвержденная				КАК СуммаИтогоНеподтвержденная,
	|	ЗаключениеКомиссии						КАК ЗаключениеКомиссии,
	|	РешениеКомиссии							КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение3кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОДНеподтвержденная),
	|	СУММА(СуммаПроцентовНеподтвержденная),
	|	СУММА(СуммаШтрафовНеподтвержденная),
	|	СУММА(СуммаПенейНеподтвержденная),
	|	СУММА(СуммаИтогоНеподтвержденная)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение4кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение4кРазделу2", 3);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Договоры и даты среза (подготовка)
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Ссылка.ДатаИнвентаризации	КАК ДатаИнвентаризации,
	|	Договор						КАК Договор
	|ПОМЕСТИТЬ
	|	Приложение4кРазделу2СтрокиДоговоров
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение4кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Срезы последних на дату инвентаризации (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор КАК Договор,
	|	МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Регистратор) КАК МаксРегистратор
	|ПОМЕСТИТЬ
	|	Приложение4кРазделу2СтрокиДоговоровСоСрокамиМаксРегистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтрокиДоговоров.Ссылка КАК Ссылка,
	|		СтрокиДоговоров.Договор КАК Договор,
	|		МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Период) КАК МаксПериод
	|	ИЗ
	|		Приложение4кРазделу2СтрокиДоговоров КАК СтрокиДоговоров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО СтрокиДоговоров.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|				И СтрокиДоговоров.ДатаИнвентаризации >= СрокиИсполненияИСуммыОбязательств.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтрокиДоговоров.Ссылка,
	|		СтрокиДоговоров.Договор) КАК СтрокиДоговоровСоСрокамиМаксПериод
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|	ПО СтрокиДоговоровСоСрокамиМаксПериод.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|		И СтрокиДоговоровСоСрокамиМаксПериод.МаксПериод = СрокиИсполненияИСуммыОбязательств.Период
	|СГРУППИРОВАТЬ ПО
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Коды периодов обращения (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА СрокиИсполненияИСуммыОбязательств.СрокИсполнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ СрокиИсполненияИСуммыОбязательств.СрокИсполнения ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 1
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 5
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК КодСрока
	|ПОМЕСТИТЬ Приложение4кРазделу2СтрокиДоговоровСоСроками
	|ИЗ
	|	Приложение4кРазделу2СтрокиДоговоровСоСрокамиМаксРегистратор КАК СтрокиДоговоровСоСрокамиМаксРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|		ПО СтрокиДоговоровСоСрокамиМаксРегистратор.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|			И СтрокиДоговоровСоСрокамиМаксРегистратор.МаксРегистратор = СрокиИсполненияИСуммыОбязательств.Регистратор
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Данные для печати табличных частей Приложение4кРазделу2
	|//
	|ВЫБРАТЬ
	|	ТабЧасть.Ссылка							КАК Ссылка,
	|	ТабЧасть.Ссылка.ДатаИнвентаризации		КАК ДатаИнвентаризации,
	|	
	|	// Набор колонок №1
	|	НомерСтрокиРаздела						КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер							КАК ПорядковыйНомер,
	|	НомерОписи								КАК НомерОписи,
	|	ДатаОписи								КАК ДатаОписи,
	|	ВЫБОР
	|		КОГДА ВидЗадолженности = 1 ТОГДА
	|			&ВидЗадолженности0504084ВнутреннийДолг
	|			
	|		КОГДА ВидЗадолженности = 2 ТОГДА
	|			&ВидЗадолженности0504084ВнешнийДолг
	|			
	|		ИНАЧЕ
	|			&ВидЗадолженности0504084Пустой
	|	КОНЕЦ									КАК ВидЗадолженности,
	|	Договор.ДатаДоговора					КАК ДатаДокумента,
	|	Договор.НомерДоговора					КАК НомерДокумента,
	|	Договор.ВидОбязательства				КАК НаименованиеДолга,
	|	ЕСТЬNULL(Счет.Код, ""000"")				КАК СчетКод,
	|	Представление(КФО)						КАК КФО,
	|	Представление(КПС)						КАК КПС,
	|	Договор.СерияЦеннойБумаги				КАК СерияЦеннойБумаги,
	|	Договор.НомерЦеннойБумаги				КАК НомерЦеннойБумаги,
	|	ВЫБОР
	|		КОГДА Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			&ВалютаРУКод
	|		ИНАЧЕ
	|			Валюта.Код
	|	КОНЕЦ									КАК КодВалюты,
	|	ВЫБОР
	|		КОГДА Валюта = &ВалютаРУ ТОГДА
	|			Договор.НоминальнаяСтоимость
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ									КАК Номинал,
	|	ВЫБОР
	|		КОГДА Валюта <> &ВалютаРУ ТОГДА
	|			Договор.НоминальнаяСтоимость
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ									КАК НоминалВалютная,		
	|	СтрокиДоговоровСоСроками.КодСрока		КАК КодСрока,
	|	
	|	// Набор колонок №2
	|	СуммаОДНеподтвержденнаяВалютная			КАК СуммаОДНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная					КАК СуммаОДНеподтвержденная,
	|	СуммаПроцентовНеподтвержденнаяВалютная	КАК СуммаПроцентовНеподтвержденнаяВалютная,
	|	СуммаПроцентовНеподтвержденная			КАК СуммаПроцентовНеподтвержденная,
	|	СуммаИтогоНеподтвержденнаяВалютная		КАК СуммаИтогоНеподтвержденнаяВалютная,
	|	СуммаИтогоНеподтвержденная				КАК СуммаИтогоНеподтвержденная,
	|	ЗаключениеКомиссии						КАК ЗаключениеКомиссии,
	|	РешениеКомиссии							КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение4кРазделу2 КАК ТабЧасть
	|	ЛЕВОЕ СОЕДИНЕНИЕ Приложение4кРазделу2СтрокиДоговоровСоСроками КАК СтрокиДоговоровСоСроками
	|		ПО	ТабЧасть.Ссылка = СтрокиДоговоровСоСроками.Ссылка
	|		И	ТабЧасть.Договор = СтрокиДоговоровСоСроками.Договор
	|ГДЕ
	|	ТабЧасть.Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	ТабЧасть.Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОДНеподтвержденная),
	|	СУММА(СуммаПроцентовНеподтвержденная),
	|	СУММА(СуммаИтогоНеподтвержденная)
	|ПО
	|	ТабЧасть.Ссылка
	|;";

КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение5кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение5кРазделу2", 3);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Договоры и даты среза (подготовка)
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Ссылка.ДатаИнвентаризации	КАК ДатаИнвентаризации,
	|	Договор						КАК Договор
	|ПОМЕСТИТЬ
	|	Приложение5кРазделу2СтрокиДоговоров
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение5кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Срезы последних на дату инвентаризации (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор КАК Договор,
	|	МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Регистратор) КАК МаксРегистратор
	|ПОМЕСТИТЬ
	|	Приложение5кРазделу2СтрокиДоговоровСоСрокамиМаксРегистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтрокиДоговоров.Ссылка КАК Ссылка,
	|		СтрокиДоговоров.Договор КАК Договор,
	|		МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Период) КАК МаксПериод
	|	ИЗ
	|		Приложение5кРазделу2СтрокиДоговоров КАК СтрокиДоговоров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО СтрокиДоговоров.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|				И СтрокиДоговоров.ДатаИнвентаризации >= СрокиИсполненияИСуммыОбязательств.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтрокиДоговоров.Ссылка,
	|		СтрокиДоговоров.Договор) КАК СтрокиДоговоровСоСрокамиМаксПериод
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|	ПО СтрокиДоговоровСоСрокамиМаксПериод.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|		И СтрокиДоговоровСоСрокамиМаксПериод.МаксПериод = СрокиИсполненияИСуммыОбязательств.Период
	|СГРУППИРОВАТЬ ПО
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Коды периодов обращения (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА СрокиИсполненияИСуммыОбязательств.СрокИсполнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ СрокиИсполненияИСуммыОбязательств.СрокИсполнения ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 1
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 5
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК КодСрока
	|ПОМЕСТИТЬ Приложение5кРазделу2СтрокиДоговоровСоСроками
	|ИЗ
	|	Приложение5кРазделу2СтрокиДоговоровСоСрокамиМаксРегистратор КАК СтрокиДоговоровСоСрокамиМаксРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|		ПО СтрокиДоговоровСоСрокамиМаксРегистратор.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|			И СтрокиДоговоровСоСрокамиМаксРегистратор.МаксРегистратор = СрокиИсполненияИСуммыОбязательств.Регистратор
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Данные для печати табличных частей Приложение5кРазделу2
	|//
	|ВЫБРАТЬ
	|	ТабЧасть.Ссылка							КАК Ссылка,
	|	ТабЧасть.Ссылка.ДатаИнвентаризации		КАК ДатаИнвентаризации,
	|	
	|	// Набор колонок №1
	|	НомерСтрокиРаздела						КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер							КАК ПорядковыйНомер,
	|	НомерОписи								КАК НомерОписи,
	|	ДатаОписи								КАК ДатаОписи,
	|	ВЫБОР
	|		КОГДА ВидЗадолженности = 1 ТОГДА
	|			&ВидЗадолженности0504085ВнутреннийДолг
	|			
	|		КОГДА ВидЗадолженности = 2 ТОГДА
	|			&ВидЗадолженности0504085ВнешнийДолг
	|			
	|		ИНАЧЕ
	|			&ВидЗадолженности0504085Пустой
	|	КОНЕЦ									КАК ВидЗадолженности,
	|	Договор.ДатаДоговора					КАК ДатаДокумента,
	|	Договор.НомерДоговора					КАК НомерДокумента,
	|	Договор.ВидОбязательства				КАК НаименованиеДокумента,
	|	ВЫБОР
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ
	|			Контрагент.Наименование
	|	КОНЕЦ									КАК НаименованиеКредитора, // Аналогично ИнвентаризацияГосдолгаПоКредитамИГарантиям.ПечатьФормы0504085
	|	ВЫБОР
	|		КОГДА ЗаемщикПоГарантии = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		КОГДА НЕ ЗаемщикПоГарантии.НаименованиеСокращенное = """" ТОГДА
	|			ЗаемщикПоГарантии.НаименованиеСокращенное
	|		КОГДА ЗаемщикПоГарантии.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И НЕ ЗаемщикПоГарантии.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(ЗаемщикПоГарантии.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ
	|			ЗаемщикПоГарантии.Наименование
	|	КОНЕЦ									КАК НаименованиеЗаемщика, // Аналогично ИнвентаризацияГосдолгаПоКредитамИГарантиям.ПечатьФормы0504085
	|	ЕСТЬNULL(Счет.Код, ""000"")				КАК СчетКод,
	|	ЕСТЬNULL(Счет.УчетПоКПС, Ложь)			КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, Ложь)			КАК СчетУчетПоКЭК,
	|	Представление(КФО)						КАК КФО,
	|	Представление(КПС)						КАК КПС,
	|	СтрокиДоговоровСоСроками.КодСрока		КАК КодСрока,
	|	ВЫБОР
	|		КОГДА Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			&ВалютаРУКод
	|		ИНАЧЕ
	|			Валюта.Код
	|	КОНЕЦ									КАК КодВалюты,
	|	
	|	// Набор колонок №2
	|	СуммаОДНеподтвержденнаяВалютная			КАК СуммаОДНеподтвержденнаяВалютная,
	|	СуммаОДНеподтвержденная					КАК СуммаОДНеподтвержденная,
	|	СуммаПроцентовНеподтвержденнаяВалютная	КАК СуммаПроцентовНеподтвержденнаяВалютная,
	|	СуммаПроцентовНеподтвержденная			КАК СуммаПроцентовНеподтвержденная,
	|	СуммаИтогоНеподтвержденнаяВалютная		КАК СуммаИтогоНеподтвержденнаяВалютная,
	|	СуммаИтогоНеподтвержденная				КАК СуммаИтогоНеподтвержденная,
	|	ЗаключениеКомиссии						КАК ЗаключениеКомиссии,
	|	РешениеКомиссии							КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение5кРазделу2 КАК ТабЧасть
	|	ЛЕВОЕ СОЕДИНЕНИЕ Приложение5кРазделу2СтрокиДоговоровСоСроками КАК СтрокиДоговоровСоСроками
	|		ПО	ТабЧасть.Ссылка = СтрокиДоговоровСоСроками.Ссылка
	|		И	ТабЧасть.Договор = СтрокиДоговоровСоСроками.Договор
	|ГДЕ
	|	ТабЧасть.Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	ТабЧасть.Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОДНеподтвержденная),
	|	СУММА(СуммаПроцентовНеподтвержденная),
	|	СУММА(СуммаИтогоНеподтвержденная)
	|ПО
	|	ТабЧасть.Ссылка
	|;";

КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение6кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение6кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение6кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка								КАК Ссылка,
	|	НомерСтрокиРаздела					КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер						КАК ПорядковыйНомер,
	|	НомерОписи							КАК НомерОписи,
	|	ДатаОписи							КАК ДатаОписи,
	|	
	|	ВидДокумента						КАК ВидДокумента,
	|	
	|	// Поля БСО
	|	БСО.Наименование					КАК БСОНаименование,
	|	БСО.Код								КАК БСОКод,
	|	БСО.ЕдиницаИзмерения				КАК БСОЕдИзм,
	|	БСО.ДлинаНомера						КАК БСОДлинаНомера,
	|	Серия								КАК БСОСерия,
	|	
	|	// Поля денежного документа
	|	ВЫБОР
	|		КОГДА ДенежныйДокумент <> ЗНАЧЕНИЕ(Справочник.ДенежныеДокументы.ПустаяСсылка) ТОГДА
	|			ДенежныйДокумент.Наименование
	|		ИНАЧЕ
	|			ВидДенежногоДокумента.Наименование
	|	КОНЕЦ								КАК ДенежныйДокументНаименование,
	|	ВЫБОР
	|		КОГДА ДенежныйДокумент <> ЗНАЧЕНИЕ(Справочник.ДенежныеДокументы.ПустаяСсылка) ТОГДА
	|			ДенежныйДокумент.Код
	|		ИНАЧЕ
	|			ВидДенежногоДокумента.Код
	|	КОНЕЦ								КАК ДенежныйДокументКод,
	|	ВЫБОР
	|		КОГДА ДенежныйДокумент <> ЗНАЧЕНИЕ(Справочник.ДенежныеДокументы.ПустаяСсылка) ТОГДА
	|			ДенежныйДокумент.ЕдиницаИзмерения
	|		ИНАЧЕ
	|			&ЕдИзмШт
	|	КОНЕЦ								КАК ДенежныйДокументЕдИзм,
	|	ДенежныйДокумент.Номер				КАК ДенежныйДокументНомер,
	|	ДенежныйДокумент.Серия				КАК ДенежныйДокументСерия,
	|	ДенежныйДокумент.НомСтоимость		КАК ДенежныйДокументНомСтоимость,
	|	
	|	НедостачаНачальныйНомер				КАК НедостачаНачальныйНомер,
	|	НедостачаКонечныйНомер				КАК НедостачаКонечныйНомер,
	|	НедостачаКоличество					КАК НедостачаКоличество,
	|	НедостачаСумма						КАК НедостачаСумма,
	|	
	|	ИзлишекНачальныйНомер				КАК ИзлишекНачальныйНомер,
	|	ИзлишекКонечныйНомер				КАК ИзлишекКонечныйНомер,
	|	ИзлишекКоличество					КАК ИзлишекКоличество,
	|	ИзлишекСумма						КАК ИзлишекСумма,
	|	
	|	ЗаключениеКомиссии					КАК ЗаключениеКомиссии,
	|	РешениеКомиссии						КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение6кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(НедостачаКоличество),
	|	СУММА(НедостачаСумма),
	|	СУММА(ИзлишекКоличество),
	|	СУММА(ИзлишекСумма)
	|ПО
	|	Ссылка
	|;";

КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение7кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение7кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение7кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	
	|	НФА											КАК НФА,
	|	(НФА ССЫЛКА Справочник.ОсновныеСредства)	КАК НФАЭтоОС,
	|	ВЫБОР
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ЕСТЬNULL(ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).НаименованиеПолное <> """" ТОГДА
	|					ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).НаименованиеПолное
	|				ИНАЧЕ
	|					ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).Наименование
	|			КОНЕЦ, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).НаименованиеПолное <> """" ТОГДА
	|					ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).НаименованиеПолное
	|				ИНАЧЕ
	|					ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).Наименование
	|			КОНЕЦ, """")
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК НаименованиеНФА,
	|	ЕСТЬNULL(ИнвентарныйНомер.Код, """")			КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).НоменклатурныйНомер, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).НоменклатурныйНомер, """")
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).Код, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).Код, """")
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК КодЭлемента,
	|	ПРЕДСТАВЛЕНИЕ(Субконто3)					КАК Субконто3Представление,
	|	ВЫБОР
	|		КОГДА ЕдИзм <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) ТОГДА
	|			ЕдИзм
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).ЕдиницаИзмерения.Представление, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			&ЕдИзмШт
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК ЕдИзм,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФО,
	|	Счет.Представление							КАК Счет,
	|	ЕСТЬNULL(Счет.УчетПоКПС, Ложь)				КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, Ложь)				КАК СчетУчетПоКЭК,
	|	КПС.Представление							КАК КПС,
	|	НедостачаКоличество							КАК НедостачаКоличество,
	|	НедостачаСумма								КАК НедостачаСумма,
	|	ИзлишекКоличество							КАК ИзлишекКоличество,
	|	ИзлишекСумма								КАК ИзлишекСумма,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение7кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(НедостачаКоличество),
	|	СУММА(НедостачаСумма),
	|	СУММА(ИзлишекКоличество),
	|	СУММА(ИзлишекСумма)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение8кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение8кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение8кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	ВидРасчетов									КАК ВидРасчетов,
	|	Контрагент									КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Контрагент) = ТИП(Строка) ТОГДА
	|			Контрагент
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			ЕСТЬNULL(Контрагент.Наименование, """")
	|	КОНЕЦ										КАК КонтрагентНаименование, // Аналогично ИнвентаризацияРасчетовСКонтрагентами.ПечатьФормы0504089
	|	Договор										КАК Договор,
	|	ЕСТЬNULL(Договор.Наименование, """")			КАК ДоговорНаименование,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФО,
	|	Счет.Представление							КАК Счет,
	|	ЕСТЬNULL(Счет.УчетПоКПС, Ложь)				КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, Ложь)				КАК СчетУчетПоКЭК,
	|	КПС.Представление							КАК КПС,
	|	КЭК.Представление							КАК КЭК,
	|	ПРЕДСТАВЛЕНИЕ(ВидЗадолженности)				КАК ВидЗадолженности,
	|	СуммаОтклонений								КАК СуммаОтклонений,
	|	ВЫБОР
	|		КОГДА ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Дебиторская) ТОГДА
	|			СуммаОтклонений
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ										КАК СуммаОтклоненийД,
	|	ВЫБОР
	|		КОГДА ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Кредиторская) ТОГДА
	|			СуммаОтклонений
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ										КАК СуммаОтклоненийК,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение8кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОтклоненийД),
	|	СУММА(СуммаОтклоненийК)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение9кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение9кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение9кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	Контрагент									КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его:
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное:
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			ЕСТЬNULL(Контрагент.Наименование, """")
	|	КОНЕЦ										КАК КонтрагентНаименование, // Аналогично ИнвентаризацияРасчетовПоПоступлениям.ПечатьФормы0504091
	|	Договор										КАК Договор,
	|	ЕСТЬNULL(Договор.Наименование, """")			КАК ДоговорНаименование,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФО,
	|	Счет.Представление							КАК Счет,
	|	КПС.Представление							КАК КПС,
	|	КЭК.Представление							КАК КЭК,
	|	СуммаОтклонений								КАК СуммаОтклонений,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение9кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОтклонений)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение10кРазделу2(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение10кРазделу2");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение10кРазделу2
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	Контрагент									КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его:
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное:
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			Контрагент.Наименование
	|	КОНЕЦ										КАК НаименованиеКонтрагента,
	|	Договор										КАК Договор,
	|	ЕСТЬNULL(Договор.ВидОбязательства, """")		КАК НаименованиеОснования,
	|	ЕСТЬNULL(Договор.НомерДоговора, """")			КАК НомерОснования,
	|	ЕСТЬNULL(Договор.ДатаДоговора, """")			КАК ДатаОснования,
	|	КФО											КАК КФО,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФОПредставление,
	|	Счет										КАК Счет,
	|	Счет.Представление							КАК СчетПредставление,
	|	КПС											КАК КПС,
	|	КПС.Представление							КАК КПСПредставление,
	|	КЭК											КАК КЭК,
	|	КЭК.Представление							КАК КЭКПредставление,
	|	СуммаОтклонений								КАК СуммаОтклонений,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение10кРазделу2
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОтклонений)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение1кРазделу3(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение1кРазделу3");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение1кРазделу3
	|//
	|ВЫБРАТЬ
	|	Ссылка									КАК Ссылка,
	|	
	|	// Набор колонок №1
	|	НомерСтрокиРаздела						КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер							КАК ПорядковыйНомер,
	|	НомерОписи								КАК НомерОписи,
	|	ДатаОписи								КАК ДатаОписи,
	|	НаименованиеЗадолженности				КАК НаименованиеЗадолженности,
	|	ВЫБОР
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ
	|			Контрагент.Наименование
	|	КОНЕЦ									КАК НаименованиеЗаемщика, // Аналогично ИнвентаризацияКредитовИЗаймов.ПечатьФормы0504083
	|	Договор.ДатаДоговора					КАК ДатаДоговора,
	|	Договор.НомерДоговора					КАК НомерДоговора,
	|	Счет.Код								КАК СчетКод,
	|	Представление(КФО)						КАК КФО,
	|	Представление(КПС)						КАК КПС,
	|	ВЫБОР
	|		КОГДА Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			&ВалютаРУКод
	|		ИНАЧЕ
	|			Валюта.Код
	|	КОНЕЦ									КАК КодВалюты,
	|	
	|	// Набор колонок №2
	|	ТипКачественнойХарактеристики			КАК ТипКачественнойХарактеристики,
	|	СуммаОДПросроченнаяВалютная				КАК СуммаОДПросроченнаяВалютная,
	|	СуммаОДПросроченная						КАК СуммаОДПросроченная,
	|	СуммаПроцентовПросроченнаяВалютная		КАК СуммаПроцентовПросроченнаяВалютная,
	|	СуммаПроцентовПросроченная				КАК СуммаПроцентовПросроченная,
	|	СуммаШтрафовПросроченнаяВалютная		КАК СуммаШтрафовПросроченнаяВалютная,
	|	СуммаШтрафовПросроченная				КАК СуммаШтрафовПросроченная,
	|	СуммаПенейПросроченнаяВалютная			КАК СуммаПенейПросроченнаяВалютная,
	|	СуммаПенейПросроченная					КАК СуммаПенейПросроченная,
	|	ЗаключениеКомиссии						КАК ЗаключениеКомиссии,
	|	РешениеКомиссии							КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение1кРазделу3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОДПросроченная),
	|	СУММА(СуммаПроцентовПросроченная),
	|	СУММА(СуммаШтрафовПросроченная),
	|	СУММА(СуммаПенейПросроченная)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение2кРазделу3(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение2кРазделу3", 3);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Договоры и даты среза (подготовка)
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Ссылка.ДатаИнвентаризации	КАК ДатаИнвентаризации,
	|	Договор						КАК Договор
	|ПОМЕСТИТЬ
	|	Приложение2кРазделу3СтрокиДоговоров
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение2кРазделу3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Срезы последних на дату инвентаризации (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор КАК Договор,
	|	МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Регистратор) КАК МаксРегистратор
	|ПОМЕСТИТЬ
	|	Приложение2кРазделу3СтрокиДоговоровСоСрокамиМаксРегистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтрокиДоговоров.Ссылка КАК Ссылка,
	|		СтрокиДоговоров.Договор КАК Договор,
	|		МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Период) КАК МаксПериод
	|	ИЗ
	|		Приложение2кРазделу3СтрокиДоговоров КАК СтрокиДоговоров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО СтрокиДоговоров.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|				И СтрокиДоговоров.ДатаИнвентаризации >= СрокиИсполненияИСуммыОбязательств.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтрокиДоговоров.Ссылка,
	|		СтрокиДоговоров.Договор) КАК СтрокиДоговоровСоСрокамиМаксПериод
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|	ПО СтрокиДоговоровСоСрокамиМаксПериод.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|		И СтрокиДоговоровСоСрокамиМаксПериод.МаксПериод = СрокиИсполненияИСуммыОбязательств.Период
	|СГРУППИРОВАТЬ ПО
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Коды периодов обращения (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА СрокиИсполненияИСуммыОбязательств.СрокИсполнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ СрокиИсполненияИСуммыОбязательств.СрокИсполнения ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 1
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 5
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК КодСрока
	|ПОМЕСТИТЬ Приложение2кРазделу3СтрокиДоговоровСоСроками
	|ИЗ
	|	Приложение2кРазделу3СтрокиДоговоровСоСрокамиМаксРегистратор КАК СтрокиДоговоровСоСрокамиМаксРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|		ПО СтрокиДоговоровСоСрокамиМаксРегистратор.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|			И СтрокиДоговоровСоСрокамиМаксРегистратор.МаксРегистратор = СрокиИсполненияИСуммыОбязательств.Регистратор
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Данные для печати табличных частей Приложение2кРазделу3
	|//
	|ВЫБРАТЬ
	|	ТабЧасть.Ссылка							КАК Ссылка,
	|	ТабЧасть.Ссылка.ДатаИнвентаризации		КАК ДатаИнвентаризации,
	|	
	|	// Набор колонок №1
	|	НомерСтрокиРаздела						КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер							КАК ПорядковыйНомер,
	|	НомерОписи								КАК НомерОписи,
	|	ДатаОписи								КАК ДатаОписи,
	|	ВЫБОР
	|		КОГДА ВидЗадолженности = 1 ТОГДА
	|			&ВидЗадолженности0504084ВнутреннийДолг
	|			
	|		КОГДА ВидЗадолженности = 2 ТОГДА
	|			&ВидЗадолженности0504084ВнешнийДолг
	|			
	|		ИНАЧЕ
	|			&ВидЗадолженности0504084Пустой
	|	КОНЕЦ									КАК ВидЗадолженности,
	|	Договор.ДатаДоговора					КАК ДатаДокумента,
	|	Договор.НомерДоговора					КАК НомерДокумента,
	|	Договор.ВидОбязательства				КАК НаименованиеДолга,
	|	ЕСТЬNULL(Счет.Код, ""000"")				КАК СчетКод,
	|	Представление(КФО)						КАК КФО,
	|	Представление(КПС)						КАК КПС,
	|	Договор.СерияЦеннойБумаги				КАК СерияЦеннойБумаги,
	|	Договор.НомерЦеннойБумаги				КАК НомерЦеннойБумаги,
	|	ВЫБОР
	|		КОГДА Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			&ВалютаРУКод
	|		ИНАЧЕ
	|			Валюта.Код
	|	КОНЕЦ									КАК КодВалюты,
	|	ВЫБОР
	|		КОГДА Валюта = &ВалютаРУ ТОГДА
	|			Договор.НоминальнаяСтоимость
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ									КАК Номинал,
	|	ВЫБОР
	|		КОГДА Валюта <> &ВалютаРУ ТОГДА
	|			Договор.НоминальнаяСтоимость
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ									КАК НоминалВалютная,		
	|	СтрокиДоговоровСоСроками.КодСрока		КАК КодСрока,
	|	
	|	// Набор колонок №2
	|	ТипКачественнойХарактеристики			КАК ТипКачественнойХарактеристики,
	|	СуммаОДПросроченнаяВалютная				КАК СуммаОДПросроченнаяВалютная,
	|	СуммаОДПросроченная						КАК СуммаОДПросроченная,
	|	СуммаПроцентовПросроченнаяВалютная		КАК СуммаПроцентовПросроченнаяВалютная,
	|	СуммаПроцентовПросроченная				КАК СуммаПроцентовПросроченная,
	|	ЗаключениеКомиссии						КАК ЗаключениеКомиссии,
	|	РешениеКомиссии							КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение2кРазделу3 КАК ТабЧасть
	|	ЛЕВОЕ СОЕДИНЕНИЕ Приложение2кРазделу3СтрокиДоговоровСоСроками КАК СтрокиДоговоровСоСроками
	|		ПО	ТабЧасть.Ссылка = СтрокиДоговоровСоСроками.Ссылка
	|		И	ТабЧасть.Договор = СтрокиДоговоровСоСроками.Договор
	|ГДЕ
	|	ТабЧасть.Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	ТабЧасть.Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОДПросроченная),
	|	СУММА(СуммаПроцентовПросроченная)
	|ПО
	|	ТабЧасть.Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение3кРазделу3(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение3кРазделу3", 3);
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Договоры и даты среза (подготовка)
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Ссылка.ДатаИнвентаризации	КАК ДатаИнвентаризации,
	|	Договор						КАК Договор
	|ПОМЕСТИТЬ
	|	Приложение3кРазделу3СтрокиДоговоров
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение3кРазделу3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Срезы последних на дату инвентаризации (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор КАК Договор,
	|	МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Регистратор) КАК МаксРегистратор
	|ПОМЕСТИТЬ
	|	Приложение3кРазделу3СтрокиДоговоровСоСрокамиМаксРегистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтрокиДоговоров.Ссылка КАК Ссылка,
	|		СтрокиДоговоров.Договор КАК Договор,
	|		МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Период) КАК МаксПериод
	|	ИЗ
	|		Приложение3кРазделу3СтрокиДоговоров КАК СтрокиДоговоров
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО СтрокиДоговоров.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|				И СтрокиДоговоров.ДатаИнвентаризации >= СрокиИсполненияИСуммыОбязательств.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		СтрокиДоговоров.Ссылка,
	|		СтрокиДоговоров.Договор) КАК СтрокиДоговоровСоСрокамиМаксПериод
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|	ПО СтрокиДоговоровСоСрокамиМаксПериод.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|		И СтрокиДоговоровСоСрокамиМаксПериод.МаксПериод = СрокиИсполненияИСуммыОбязательств.Период
	|СГРУППИРОВАТЬ ПО
	|	СтрокиДоговоровСоСрокамиМаксПериод.Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксПериод.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Коды периодов обращения (подготовка)
	|//
	|ВЫБРАТЬ
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Ссылка КАК Ссылка,
	|	СтрокиДоговоровСоСрокамиМаксРегистратор.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА СрокиИсполненияИСуммыОбязательств.СрокИсполнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ИЛИ СрокиИсполненияИСуммыОбязательств.СрокИсполнения ЕСТЬ NULL
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 1
	|			ТОГДА 1
	|		КОГДА РАЗНОСТЬДАТ(СтрокиДоговоровСоСрокамиМаксРегистратор.Договор.ДатаДоговора, СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ГОД) <= 5
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК КодСрока
	|ПОМЕСТИТЬ Приложение3кРазделу3СтрокиДоговоровСоСроками
	|ИЗ
	|	Приложение3кРазделу3СтрокиДоговоровСоСрокамиМаксРегистратор КАК СтрокиДоговоровСоСрокамиМаксРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|		ПО СтрокиДоговоровСоСрокамиМаксРегистратор.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|			И СтрокиДоговоровСоСрокамиМаксРегистратор.МаксРегистратор = СрокиИсполненияИСуммыОбязательств.Регистратор
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Данные для печати табличных частей Приложение3кРазделу3
	|//
	|ВЫБРАТЬ
	|	ТабЧасть.Ссылка							КАК Ссылка,
	|	ТабЧасть.Ссылка.ДатаИнвентаризации		КАК ДатаИнвентаризации,
	|	
	|	// Набор колонок №1
	|	НомерСтрокиРаздела						КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер							КАК ПорядковыйНомер,
	|	НомерОписи								КАК НомерОписи,
	|	ДатаОписи								КАК ДатаОписи,
	|	ВЫБОР
	|		КОГДА ВидЗадолженности = 1 ТОГДА
	|			&ВидЗадолженности0504085ВнутреннийДолг
	|			
	|		КОГДА ВидЗадолженности = 2 ТОГДА
	|			&ВидЗадолженности0504085ВнешнийДолг
	|			
	|		ИНАЧЕ
	|			&ВидЗадолженности0504085Пустой
	|	КОНЕЦ									КАК ВидЗадолженности,
	|	Договор.ДатаДоговора					КАК ДатаДокумента,
	|	Договор.НомерДоговора					КАК НомерДокумента,
	|	Договор.ВидОбязательства				КАК НаименованиеДокумента,
	|	ВЫБОР
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ
	|			Контрагент.Наименование
	|	КОНЕЦ									КАК НаименованиеКредитора, // Аналогично ИнвентаризацияГосдолгаПоКредитамИГарантиям.ПечатьФормы0504085
	|	ВЫБОР
	|		КОГДА ЗаемщикПоГарантии = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		КОГДА НЕ ЗаемщикПоГарантии.НаименованиеСокращенное = """" ТОГДА
	|			ЗаемщикПоГарантии.НаименованиеСокращенное
	|		КОГДА ЗаемщикПоГарантии.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо) И НЕ ЗаемщикПоГарантии.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(ЗаемщикПоГарантии.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ
	|			ЗаемщикПоГарантии.Наименование
	|	КОНЕЦ									КАК НаименованиеЗаемщика, // Аналогично ИнвентаризацияГосдолгаПоКредитамИГарантиям.ПечатьФормы0504085
	|	ЕСТЬNULL(Счет.Код, ""000"")				КАК СчетКод,
	|	ЕСТЬNULL(Счет.УчетПоКПС, Ложь)			КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, Ложь)			КАК СчетУчетПоКЭК,
	|	Представление(КФО)						КАК КФО,
	|	Представление(КПС)						КАК КПС,
	|	СтрокиДоговоровСоСроками.КодСрока		КАК КодСрока,
	|	ВЫБОР
	|		КОГДА Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			&ВалютаРУКод
	|		ИНАЧЕ
	|			Валюта.Код
	|	КОНЕЦ									КАК КодВалюты,
	|	
	|	// Набор колонок №2
	|	ТипКачественнойХарактеристики			КАК ТипКачественнойХарактеристики,
	|	СуммаОДПросроченнаяВалютная				КАК СуммаОДПросроченнаяВалютная,
	|	СуммаОДПросроченная						КАК СуммаОДПросроченная,
	|	СуммаПроцентовПросроченнаяВалютная		КАК СуммаПроцентовПросроченнаяВалютная,
	|	СуммаПроцентовПросроченная				КАК СуммаПроцентовПросроченная,
	|	ЗаключениеКомиссии						КАК ЗаключениеКомиссии,
	|	РешениеКомиссии							КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение3кРазделу3 КАК ТабЧасть
	|	ЛЕВОЕ СОЕДИНЕНИЕ Приложение3кРазделу3СтрокиДоговоровСоСроками КАК СтрокиДоговоровСоСроками
	|		ПО	ТабЧасть.Ссылка = СтрокиДоговоровСоСроками.Ссылка
	|		И	ТабЧасть.Договор = СтрокиДоговоровСоСроками.Договор
	|ГДЕ
	|	ТабЧасть.Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	ТабЧасть.Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОДПросроченная),
	|	СУММА(СуммаПроцентовПросроченная)
	|ПО
	|	ТабЧасть.Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение4кРазделу3(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение4кРазделу3");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение4кРазделу3
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	
	|	НФА											КАК НФА,
	|	(НФА ССЫЛКА Справочник.ОсновныеСредства)	КАК НФАЭтоОС,
	|	ВЫБОР
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ЕСТЬNULL(ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).НаименованиеПолное <> """" ТОГДА
	|					ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).НаименованиеПолное
	|				ИНАЧЕ
	|					ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).Наименование
	|			КОНЕЦ, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).НаименованиеПолное <> """" ТОГДА
	|					ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).НаименованиеПолное
	|				ИНАЧЕ
	|					ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).Наименование
	|			КОНЕЦ, """")
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК НаименованиеНФА,
	|	ЕСТЬNULL(ИнвентарныйНомер.Код, """")			КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).НоменклатурныйНомер, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).НоменклатурныйНомер, """")
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.ОсновныеСредства).Код, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).Код, """")
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК КодЭлемента,
	|	ПРЕДСТАВЛЕНИЕ(Субконто3)					КАК Субконто3Представление,
	|	ВЫБОР
	|		КОГДА ЕдИзм <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) ТОГДА
	|			ЕдИзм
	|			
	|		КОГДА НФА ССЫЛКА Справочник.Номенклатура ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(НФА КАК Справочник.Номенклатура).ЕдиницаИзмерения.Представление, """")
	|			
	|		КОГДА НФА ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			&ЕдИзмШт
	|			
	|		ИНАЧЕ
	|			""""
	|	КОНЕЦ										КАК ЕдИзм,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФО,
	|	Счет.Представление							КАК Счет,
	|	ЕСТЬNULL(Счет.УчетПоКПС, Ложь)				КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, Ложь)				КАК СчетУчетПоКЭК,
	|	КПС.Представление							КАК КПС,
	|	КоличествоНеСоответствует					КАК КоличествоНеСоответствует,
	|	СуммаНеСоответствует						КАК СуммаНеСоответствует,
	|	КоличествоПодлежитОбесценению				КАК КоличествоПодлежитОбесценению,
	|	СуммаПодлежитОбесценению					КАК СуммаПодлежитОбесценению,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение4кРазделу3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(КоличествоНеСоответствует),
	|	СУММА(СуммаНеСоответствует),
	|	СУММА(КоличествоПодлежитОбесценению),
	|	СУММА(СуммаПодлежитОбесценению)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение5кРазделу3(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение5кРазделу3");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение5кРазделу3
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	ВидРасчетов									КАК ВидРасчетов,
	|	Контрагент									КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Контрагент) = ТИП(Строка) ТОГДА
	|			Контрагент
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			ЕСТЬNULL(Контрагент.Наименование, """")
	|	КОНЕЦ										КАК КонтрагентНаименование, // Аналогично ИнвентаризацияРасчетовСКонтрагентами.ПечатьФормы0504089
	|	Договор										КАК Договор,
	|	ЕСТЬNULL(Договор.Наименование, """")			КАК ДоговорНаименование,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФО,
	|	Счет.Представление							КАК Счет,
	|	ЕСТЬNULL(Счет.УчетПоКПС, Ложь)				КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, Ложь)				КАК СчетУчетПоКЭК,
	|	КПС.Представление							КАК КПС,
	|	КЭК.Представление							КАК КЭК,
	|	ТипКачественнойХарактеристики				КАК ТипКачественнойХарактеристики,
	|	СуммаОтклонений								КАК СуммаОтклонений,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение5кРазделу3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОтклонений)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение6кРазделу3(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение6кРазделу3");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение6кРазделу3
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	ВидРасчетов									КАК ВидРасчетов,
	|	Контрагент									КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Контрагент) = ТИП(Строка) ТОГДА
	|			Контрагент
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			ЕСТЬNULL(Контрагент.Наименование, """")
	|	КОНЕЦ										КАК КонтрагентНаименование, // Аналогично ИнвентаризацияРасчетовСКонтрагентами.ПечатьФормы0504089
	|	Договор										КАК Договор,
	|	ЕСТЬNULL(Договор.Наименование, """")			КАК ДоговорНаименование,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФО,
	|	Счет.Представление							КАК Счет,
	|	ЕСТЬNULL(Счет.УчетПоКПС, Ложь)				КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, Ложь)				КАК СчетУчетПоКЭК,
	|	КПС.Представление							КАК КПС,
	|	КЭК.Представление							КАК КЭК,
	|	ТипКачественнойХарактеристики				КАК ТипКачественнойХарактеристики,
	|	СуммаОтклонений								КАК СуммаОтклонений,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение6кРазделу3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОтклонений)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать_Приложение7кРазделу3(ИндексыТаблиц)
	
	ДобавитьИндексТаблицы(ИндексыТаблиц, "Приложение7кРазделу3");
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для печати табличных частей Приложение7кРазделу3
	|//
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	НомерСтрокиРаздела							КАК НомерСтрокиРаздела,
	|	ПорядковыйНомер								КАК ПорядковыйНомер,
	|	НомерОписи									КАК НомерОписи,
	|	ДатаОписи									КАК ДатаОписи,
	|	Контрагент									КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его:
	|		КОГДА НЕ Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное:
	|		КОГДА Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			ЕСТЬNULL(Контрагент.Наименование, """")
	|	КОНЕЦ										КАК КонтрагентНаименование, // Аналогично ИнвентаризацияРасчетовПоПоступлениям.ПечатьФормы0504091
	|	Договор										КАК Договор,
	|	ЕСТЬNULL(Договор.Наименование, """")			КАК ДоговорНаименование,
	|	ПРЕДСТАВЛЕНИЕ(КФО)							КАК КФО,
	|	Счет.Представление							КАК Счет,
	|	КПС.Представление							КАК КПС,
	|	КЭК.Представление							КАК КЭК,
	|	ТипКачественнойХарактеристики				КАК ТипКачественнойХарактеристики,
	|	СуммаОтклонений								КАК СуммаОтклонений,
	|	ЗаключениеКомиссии							КАК ЗаключениеКомиссии,
	|	РешениеКомиссии								КАК РешениеКомиссии
	|ИЗ
	|	Документ.АктИнвентаризации.Приложение7кРазделу3
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|	СУММА(СуммаОтклонений)
	|ПО
	|	Ссылка
	|;";
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеСтрокПриПечати

Процедура ЗаполнитьОбластьСтрокаТаблицы_Разделы123(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("НаименованиеОписи",	ПолучитьНаименованиеОписи(Выборка.КодФормы, ДополнительныеПараметры.НаименованияОписей));
	ЗначенияПараметров.Вставить("Наименование",			Выборка.СчетНаименование);
	
	ПредставлениеСчета = ИнвентаризацияСервер.ПолучитьПредставлениеСчетаДляРешения(Выборка);
	
	Если ЗначениеЗаполнено(Выборка.ОтветственноеЛицо) Тогда
		ДанныеСотрудника = ПолучитьДанныеСотрудника(
			ДополнительныеПараметры.ДанныеСотрудников,
			Выборка.ОтветственноеЛицо,
			ДополнительныеПараметры.СтрокаШапки.Дата,
			Истина); // ПолучитьДолжность
	Иначе
		ДанныеСотрудника = Новый Структура("ФИО,Должность", "х", "х");
	КонецЕсли;
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ПредставлениеСчета);
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ДанныеСотрудника);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение1кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение2кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(,Выборка.КФО, Выборка.СчетКод,));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение3кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.СчетКод));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение4кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.СчетКод));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение5кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.СчетКод,,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение6кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура("
		|ВидДокумента,
		|НаименованиеДокумента,
		|КодДокумента,
		|ЕдИзм,
		|НедостачаСерия,
		|НедостачаНомер,
		|НедостачаЦена,
		|ИзлишекСерия,
		|ИзлишекНомер,
		|ИзлишекЦена");
	
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.ВидДокумента = ДополнительныеПараметры.НастройкиВидДокумента0504086.Представления.Получить(Выборка.ВидДокумента);
	
	ЗаполнитьНедостачу	= (Выборка.НедостачаКоличество <> 0 Или Выборка.НедостачаСумма <> 0);
	ЗаполнитьИзлишек	= (Выборка.ИзлишекКоличество <> 0 Или Выборка.ИзлишекСумма <> 0);
	
	Если Выборка.ВидДокумента = 1 Тогда
		// БСО
		
		ЗначенияПараметров.НаименованиеДокумента	= Выборка.БСОНаименование;
		ЗначенияПараметров.КодДокумента				= Выборка.БСОКод;
		ЗначенияПараметров.ЕдИзм					= Выборка.БСОЕдИзм;
		
		Цена = 1;
		Серия = Выборка.БСОСерия;
		ДлинаНомера = Выборка.БСОДлинаНомера;
		
		Если ЗаполнитьНедостачу Тогда
			ЗначенияПараметров.НедостачаЦена = Цена;
			ЗначенияПараметров.НедостачаСерия = Серия;
			ЗначенияПараметров.НедостачаНомер = ПолучитьПредставлениеДиапазонаНомеровБСО(Выборка.НедостачаНачальныйНомер, Выборка.НедостачаКонечныйНомер, ДлинаНомера);
		КонецЕсли;
		
		Если ЗаполнитьИзлишек Тогда
			ЗначенияПараметров.ИзлишекЦена = Цена;
			ЗначенияПараметров.ИзлишекСерия = Серия;
			ЗначенияПараметров.ИзлишекНомер = ПолучитьПредставлениеДиапазонаНомеровБСО(Выборка.ИзлишекНачальныйНомер, Выборка.ИзлишекКонечныйНомер, ДлинаНомера);
		КонецЕсли;
		
	ИначеЕсли Выборка.ВидДокумента = 2 Тогда
		// Денежный документ
		
		ЗначенияПараметров.НаименованиеДокумента	= Выборка.ДенежныйДокументНаименование;
		ЗначенияПараметров.КодДокумента				= Выборка.ДенежныйДокументКод;
		ЗначенияПараметров.ЕдИзм					= Выборка.ДенежныйДокументЕдИзм;
		
		НомСтоимость = Выборка.ДенежныйДокументНомСтоимость;
		Серия = Выборка.ДенежныйДокументСерия;
		Номер = Выборка.ДенежныйДокументНомер;
		
		Если ЗаполнитьНедостачу Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДенежныйДокументНаименование) Тогда
				Цена = НомСтоимость;
			ИначеЕсли Выборка.НедостачаКоличество <> 0 Тогда
				Цена = Окр(Выборка.НедостачаСумма/Выборка.НедостачаКоличество, 2);
			Иначе
				Цена = 0;
			КонецЕсли;
			
			ЗначенияПараметров.НедостачаЦена = Цена;
			ЗначенияПараметров.НедостачаСерия = Серия;
			ЗначенияПараметров.НедостачаНомер = Номер;
			
		КонецЕсли;
		
		Если ЗаполнитьИзлишек Тогда
			
			Если ЗначениеЗаполнено(Выборка.ДенежныйДокументНаименование) Тогда
				Цена = НомСтоимость;
			ИначеЕсли Выборка.ИзлишекКоличество <> 0 Тогда
				Цена = Окр(Выборка.ИзлишекСумма/Выборка.ИзлишекКоличество, 2);
			Иначе
				Цена = 0;
			КонецЕсли;
			
			ЗначенияПараметров.ИзлишекЦена = Цена;
			ЗначенияПараметров.ИзлишекСерия = Серия;
			ЗначенияПараметров.ИзлишекНомер = Номер;
			
		КонецЕсли;
		
	Иначе
		// Ошибка данных
		
		ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
		
		Возврат;
	КонецЕсли;
	
	СимволПрочерка = НСтр("ru='—'");
	
	Если Не ЗначениеЗаполнено(ЗначенияПараметров.НедостачаСерия) Тогда
		ЗначенияПараметров.НедостачаСерия = СимволПрочерка;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗначенияПараметров.НедостачаНомер) Тогда
		ЗначенияПараметров.НедостачаНомер = СимволПрочерка;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗначенияПараметров.НедостачаЦена) Тогда
		ЗначенияПараметров.НедостачаЦена = СимволПрочерка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияПараметров.ИзлишекСерия) Тогда
		ЗначенияПараметров.ИзлишекСерия = СимволПрочерка;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗначенияПараметров.ИзлишекНомер) Тогда
		ЗначенияПараметров.ИзлишекНомер = СимволПрочерка;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ЗначенияПараметров.ИзлишекЦена) Тогда
		ЗначенияПараметров.ИзлишекЦена = СимволПрочерка;
	КонецЕсли;
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Функция ПолучитьПредставлениеДиапазонаНомеровБСО(НомерНач, НомерКон, ДлинаНомера)
	
	СимволПрочерка = НСтр("ru='—'");
	
	Если НомерНач > 0 И НомерКон > 0 И НомерНач = НомерКон Тогда
		
		Возврат ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(НомерНач, ДлинаНомера);
		
	ИначеЕсли НомерНач > 0 И НомерКон > 0 Тогда
		
		Возврат ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(НомерНач, ДлинаНомера) + СимволПрочерка + ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(НомерКон, ДлинаНомера);
		
	ИначеЕсли НомерНач > 0 Тогда
		
		Возврат ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(НомерНач, ДлинаНомера);
		
	ИначеЕсли НомерКон > 0 Тогда
		
		Возврат ИнвентаризацияКлиентСервер.ПолучитьПредставлениеНомераБСО(НомерКон, ДлинаНомера);
		
	КонецЕсли;
	
	Возврат СимволПрочерка;
	
КонецФункции

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение7кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.Счет,,,Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
	
	Если ТипЗнч(Выборка.НФА) = Тип("СправочникСсылка.Номенклатура") Тогда
		КоличествоЗнаковПослеЗапятойДляКоличества = 3;
	Иначе
		КоличествоЗнаковПослеЗапятойДляКоличества = 0;
	КонецЕсли;
		
	ФорматнаяСтрока = СтрШаблон(НСтр("ru='ЧЦ=15; ЧДЦ=%1; ЧН=—'"), КоличествоЗнаковПослеЗапятойДляКоличества);
	
	ЗначенияПараметров.Вставить("НедостачаКоличество", Формат(Выборка.НедостачаКоличество, ФорматнаяСтрока));
	ЗначенияПараметров.Вставить("ИзлишекКоличество", Формат(Выборка.ИзлишекКоличество, ФорматнаяСтрока));
	
	ЗначенияПараметров.Вставить("НаименованиеНФА",	ИнвентаризацияСервер.ПолучитьНаименованиеНФА(Выборка, ДополнительныеПараметры));
	ЗначенияПараметров.Вставить("КодНФА",			ИнвентаризацияСервер.ПолучитьКодНФА(Выборка, ДополнительныеПараметры));
	
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение8кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	НаименованиеДК = Выборка.КонтрагентНаименование
		+ ?(ЗначениеЗаполнено(Выборка.ДоговорНаименование), ", " + Выборка.ДоговорНаименование, "");
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("ВидЗадолженности",	НРег(Выборка.ВидЗадолженности));
	ЗначенияПараметров.Вставить("НомерСчета",		ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.Счет, Выборка.КЭК,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
	ЗначенияПараметров.Вставить("НаименованиеДК",	НаименованиеДК);
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение9кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	НаименованиеКонтрагента = Выборка.КонтрагентНаименование
		+ ?(ЗначениеЗаполнено(Выборка.ДоговорНаименование), ", " + Выборка.ДоговорНаименование, "");
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета",				ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.Счет, Выборка.КЭК));
	ЗначенияПараметров.Вставить("НаименованиеКонтрагента",	НаименованиеКонтрагента);
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение10кРазделу2(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПСПредставление, Выборка.КФОПредставление, Выборка.СчетПредставление, Выборка.КЭКПредставление));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение1кРазделу3(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.СчетКод));
	
	ДобавитьКодНаименованиеТипаКачественнойХарактеристики(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение2кРазделу3(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.СчетКод));
	
	ДобавитьКодНаименованиеТипаКачественнойХарактеристики(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение3кРазделу3(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.СчетКод,,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
	
	ДобавитьКодНаименованиеТипаКачественнойХарактеристики(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение4кРазделу3(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	ЗначенияПараметров.Вставить("НомерСчета", ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.Счет,,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
	
	Если ТипЗнч(Выборка.НФА) = Тип("СправочникСсылка.Номенклатура") Тогда
		КоличествоЗнаковПослеЗапятойДляКоличества = 3;
	Иначе
		КоличествоЗнаковПослеЗапятойДляКоличества = 0;
	КонецЕсли;
		
	ФорматнаяСтрока = СтрШаблон(НСтр("ru='ЧЦ=15; ЧДЦ=%1; ЧН=—'"), КоличествоЗнаковПослеЗапятойДляКоличества);
	
	ЗначенияПараметров.Вставить("КоличествоНеСоответствует", Формат(Выборка.КоличествоНеСоответствует, ФорматнаяСтрока));
	ЗначенияПараметров.Вставить("КоличествоПодлежитОбесценению", Формат(Выборка.КоличествоПодлежитОбесценению, ФорматнаяСтрока));

	ЗначенияПараметров.Вставить("НаименованиеНФА",	ИнвентаризацияСервер.ПолучитьНаименованиеНФА(Выборка, ДополнительныеПараметры));
	ЗначенияПараметров.Вставить("КодНФА",			ИнвентаризацияСервер.ПолучитьКодНФА(Выборка, ДополнительныеПараметры));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение5кРазделу3(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	
	ДобавитьКодНаименованиеТипаКачественнойХарактеристики(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	
	НаименованиеДебитора = Выборка.КонтрагентНаименование
		+ ?(ЗначениеЗаполнено(Выборка.ДоговорНаименование), ", " + Выборка.ДоговорНаименование, "");
	
	ЗначенияПараметров.Вставить("НаименованиеДебитора",	НаименованиеДебитора);
	ЗначенияПараметров.Вставить("НомерСчета",			ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.Счет, Выборка.КЭК,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение6кРазделу3(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	
	ДобавитьКодНаименованиеТипаКачественнойХарактеристики(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	
	НаименованиеКредитора = Выборка.КонтрагентНаименование
		+ ?(ЗначениеЗаполнено(Выборка.ДоговорНаименование), ", " + Выборка.ДоговорНаименование, "");
	
	ЗначенияПараметров.Вставить("НаименованиеКредитора",	НаименованиеКредитора);
	ЗначенияПараметров.Вставить("НомерСчета",				ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.Счет, Выборка.КЭК,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ЗаполнитьОбластьСтрокаТаблицы_Приложение7кРазделу3(ОбластьСтрокаТаблицы, Выборка, СтатистикаВывода, ДополнительныеПараметры) Экспорт
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КодСтроки", ИнвентаризацияКлиентСервер.ПолучитьКодСтрокиПриложения(Выборка.НомерСтрокиРаздела, Выборка.ПорядковыйНомер));
	
	ДобавитьКодНаименованиеТипаКачественнойХарактеристики(ЗначенияПараметров, Выборка, ДополнительныеПараметры);
	
	НаименованиеКонтрагента = Выборка.КонтрагентНаименование
		+ ?(ЗначениеЗаполнено(Выборка.ДоговорНаименование), ", " + Выборка.ДоговорНаименование, "");
	
	ЗначенияПараметров.Вставить("НаименованиеКонтрагента",	НаименованиеКонтрагента);
	ЗначенияПараметров.Вставить("НомерСчета",				ПолучитьПолныйНомерСчета(Выборка.КПС, Выборка.КФО, Выборка.Счет, Выборка.КЭК));
	
	ОбластьСтрокаТаблицы.Параметры.Заполнить(ЗначенияПараметров);
	
КонецПроцедуры

Процедура ДобавитьКодНаименованиеТипаКачественнойХарактеристики(ЗначенияПараметров, Выборка, ДополнительныеПараметры)
	
	ЗначенияСвойств = Перечисления.ТипыКачественныхХарактеристик.ПолучитьКодНаименованиеПредставление(Выборка.ТипКачественнойХарактеристики);
	
	ЗначенияПараметров.Вставить("КодХарактеристики", ЗначенияСвойств.Код);
	ЗначенияПараметров.Вставить("НаименованиеХарактеристики", ЗначенияСвойств.Наименование);
	
КонецПроцедуры

Функция ПолучитьПолныйНомерСчета(Знач КПС = Неопределено, Знач КФО = Неопределено, Знач Счет = Неопределено, Знач КЭК = Неопределено,
	Знач ВыводитьНулиПриДляПустогоЗначения = Истина, Знач СчетУчетПоКПС = Истина, Знач СчетУчетПоКЭК = Истина)
	
	Если ВыводитьНулиПриДляПустогоЗначения Тогда
		Если Не ЗначениеЗаполнено(КПС) Тогда
			КПС = "00000000000000000";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КФО) Тогда
			КФО = "0";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Счет) Тогда
			Счет = "000.00";
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КЭК) Тогда
			КЭК = "000";
		КонецЕсли;
	КонецЕсли;
	
	Если СчетУчетПоКПС И СчетУчетПоКЭК Тогда
		Возврат СтрШаблон("%1.%2.%3.%4", КПС, КФО, Счет, КЭК);
		
	ИначеЕсли СчетУчетПоКПС И Не СчетУчетПоКЭК Тогда
		Возврат СтрШаблон("%1.%2.%3", КПС, КФО, Счет);
		
	ИначеЕсли Не СчетУчетПоКПС И СчетУчетПоКЭК Тогда
		Возврат СтрШаблон("%1.%2.%3", КФО, Счет, КЭК);
	Иначе
		Возврат СтрШаблон("%1.%2", КФО, Счет);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолучитьДанныеЗаполненияПоОписям", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
