
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользуетсяУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	
	Если Параметры.Свойство("АдресТаблицыРеквизитов", АдресТаблицыРеквизитов) Тогда
		ТабРеквизитов = ПолучитьИзВременногоХранилища(АдресТаблицыРеквизитов);
		
		Если Не ИспользуетсяУчетПоИФО Тогда
			Стр = ТабРеквизитов.Найти("ИФО", "ИмяРеквизита");
			Если Стр <> Неопределено Тогда
				ТабРеквизитов.Удалить(Стр);
			КонецЕсли;
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(ТабРеквизитов, "ТаблицаЗаполняемыхРеквизитов");
	КонецЕсли;
	
	УстановитьУсловноеОформление();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗаполняемыхРеквизитов

&НаКлиенте
Процедура ТаблицаЗаполняемыхРеквизитовПередНачаломИзменения(Элемент, Отказ)
	ТекущиеДанные = Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущиеДанные;
	
	ТипРеквизита = ТекущиеДанные.ТипЗначенияРеквизита;
	ТекущееЗначениеРеквизита = ТекущиеДанные.ЗначениеРеквизита;
	
	Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент.ОграничениеТипа = ТипРеквизита;
	
	Если ТекущиеДанные.ИмяРеквизита = "КПС" Тогда
		ВидыПоказателя = Новый СписокЗначений;
		ВидыПоказателя.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
		ВидыПоказателя.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.Произвольный"));
		
		Отбор = Новый Структура;
		Отбор.Вставить("ВидПоказателя", ВидыПоказателя);
		
		ОткрытьФорму("Справочник.КлассификационныеПризнакиСчетов.Форма.ФормаВыбора", Новый Структура("Отбор", Отбор), Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаполняемыхРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные.ЗначениеРеквизита <> ТекущееЗначениеРеквизита Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗначениеРеквизита) Тогда
			ТекущиеДанные.ЗначениеЗаполнено = Истина;
			ТекущиеДанные.Отметка = Истина;
		Иначе
			ТекущиеДанные.ЗначениеЗаполнено = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные.ИмяРеквизита = "КФО" Тогда
		СтандартнаяОбработка = Ложь;
		
		ВыборкаКФО = КФОПоУчетнойПолитике();
		
		Если ВыборкаКФО.Количество() > 0 Тогда
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.ЗагрузитьЗначения(ВыборкаКФО);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьИЗаполнить(Команда)
	ПоместитьТаблицуРеквизитовВХранилище();	
	Закрыть(АдресТаблицыРеквизитов);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КФОПоУчетнойПолитике()
	
	ИФО = Неопределено;
	Если ИспользуетсяУчетПоИФО Тогда
		ИФО = ПолучитьЗначениеРеквизита("ИФО");
	КонецЕсли;
	
	Организация = ПолучитьЗначениеРеквизита("Организация");
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Организация = ОрганизацияПоУмолчанию;
	КонецЕсли;
	
	НаДату = ПолучитьЗначениеРеквизита("Период");
	
	Возврат БухгалтерскийУчетПовтИсп.КФОПоУчетнойПолитике(Организация, ИФО, НаДату);
	
КонецФункции


&НаСервере
Функция ПолучитьЗначениеРеквизита(ИмяРеквизита)
	ТабРеквизитов = РеквизитФормыВЗначение("ТаблицаЗаполняемыхРеквизитов");
	
	Стр = ТабРеквизитов.Найти(ИмяРеквизита, "ИмяРеквизита");
	
	Если Стр <> Неопределено Тогда
		Возврат Стр.ЗначениеРеквизита;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПоместитьТаблицуРеквизитовВХранилище()
	ТабРеквизитов = РеквизитФормыВЗначение("ТаблицаЗаполняемыхРеквизитов");
	Результат = ТабРеквизитов.НайтиСтроки(Новый Структура("Отметка", Истина));
	
	Если Результат.Количество() > 0 Тогда
		АдресТаблицыРеквизитов = ПоместитьВоВременноеХранилище(Результат, АдресТаблицыРеквизитов);
	Иначе
		АдресТаблицыРеквизитов = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
 
	УсловноеОформление.Элементы.Очистить();
	
 	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СинонимРеквизита.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗаполняемыхРеквизитов.Отметка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ЗначениеРеквизита.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаЗаполняемыхРеквизитов.ЗначениеЗаполнено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(128, 128, 128));
    Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не установлено>'"));

КонецПроцедуры

#КонецОбласти