
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Элементы.ГруппаДоговоры.Доступность = Ложь;
		
		СтудентСсылка = Справочники.Студенты.ПолучитьСсылку();
		
		Если Объект.Контрагент.Пустая() Тогда
			
			КонтрагентСсылка 		= Справочники.Контрагенты.ПолучитьСсылку();
			ФизическоеЛицоСсылка 	= Справочники.ФизическиеЛица.ПолучитьСсылку();
			
			Корреспонденты.ИнициализироватьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);
		
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ФИОФизическихЛиц", Новый Структура("ФизическоеЛицо",  ФизическоеЛицоСсылка));
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо",  ФизическоеЛицоСсылка));
		
		ФИОФизическихЛиц.Период = '19800101';
			
		Иначе
			
			КонтрагентСсылка 		= Объект.Контрагент;
			ФизическоеЛицоСсылка 	= Объект.Контрагент.ЮридическоеФизическоеЛицо;
			ПрочитатьДанныеКонтрагента();
			ПрочитатьДанныеФизЛица();
						
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьДоговорыСтудента();
	
	ИспользоватьКонтрольИсполненияДоговоров = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	
	УстановитьВидимостьПредупреждения();
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	ДополнительныеПараметры.Вставить("Объект", Объект);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, ФизическоеЛицо, "КонтактнаяИнформация");	
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПолеПериодУдостоверениеЛичности();
	КорреспондентыКлиент.ОбновитьОтображениеПолейВводаГражданства(ЭтаФорма);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененоФИО" Тогда
		
		Если Параметр = ФизическоеЛицоСсылка Тогда
			ПрочитатьФИО();
			Объект.Наименование = ФизическоеЛицо.Наименование;
			Модифицированность = Истина;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОбщегоНазначенияБГУКлиент_РезультатОтветаНаЗапросИзмененияРегистраФИОФизическихЛиц"
		И Источник = СтудентСсылка Тогда
		
		Если Параметр = КодВозвратаДиалога.Да Тогда
			ФИОФизическихЛиц.Период = ТекущаяДата();
		ИначеЕсли Параметр = КодВозвратаДиалога.Отмена Тогда
			ПрочитатьФИО();
			Объект.Наименование = ФизическоеЛицо.Наименование;
			Модифицированность = Истина;
		КонецЕсли;	
		
	ИначеЕсли ИмяСобытия = "ОбновитьДанныеСтудента" Тогда	
		
		ОбновитьДоговорыСтудента();
		
	КонецЕсли;
	
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
 		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.Студенты.Форма.РазблокированиеРеквизитов") Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект, ВыбранноеЗначение);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	СтудентСсылка = ТекущийОбъект.Ссылка;
	
	КонтрагентСсылка = СтудентСсылка.Контрагент;
	ФизическоеЛицоСсылка = КонтрагентСсылка.ЮридическоеФизическоеЛицо;
	
	ПрочитатьДанныеКонтрагента();
	ПрочитатьДанныеФизЛица();
		
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ФизическоеЛицо, "КонтактнаяИнформация");
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	ПроверитьФизическоеЛицоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ПустаяСтрока(ДокументыФизическихЛиц.ВидДокумента) Тогда
		Если НЕ ЗначениеЗаполнено(ДокументыФизическихЛиц.Период) Тогда
			ТекстСообщения = НСтр("ru='Не заполнена дата начала действия сведений о документе удостоверяющем личность'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДокументыФизическихЛиц.Период",, Отказ);
		КонецЕсли;  
		ТекстОшибки = "";
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Серия) 
			И НЕ ДокументыФизическихЛицКлиентСервер.СерияДокументаУказанаПравильно(ДокументыФизическихЛиц.ВидДокумента,
			ДокументыФизическихЛиц.Серия, ТекстОшибки) Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ДокументыФизическихЛиц.Серия",, Отказ);
		КонецЕсли; 
		ТекстОшибки = "";
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Номер) 
			И НЕ ДокументыФизическихЛицКлиентСервер.НомерДокументаУказанПравильно(ДокументыФизическихЛиц.ВидДокумента,
			ДокументыФизическихЛиц.Номер, ТекстОшибки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "ДокументыФизическихЛиц.Номер",, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ФИО	
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ФИОФизическихЛиц");

	// документ удостоверяющий личность
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ДокументыФизическихЛиц");
	
	// гражданство
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "ГражданствоФизическихЛиц");

	ПараметрыЗаписи.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЗаписьСтуденты");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы "Контактная информация"
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ФизическоеЛицо, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(СтудентСсылка);
	КонецЕсли;
	
	Если ТекущийОбъект.Контрагент.Пустая() Тогда
		ТекущийОбъект.Контрагент = КонтрагентСсылка;
	КонецЕсли;
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// записать физическое лицо
	ФизическоеЛицоОбъект = РеквизитФормыВЗначение("ФизическоеЛицо");
	
	Если ФизическоеЛицоОбъект.Ссылка.Пустая() Тогда
		
		ФизическоеЛицоОбъект.УстановитьСсылкуНового(ФизическоеЛицоСсылка);
		ФизическоеЛицоОбъект.Наименование = ФИОФизическихЛиц.Фамилия + " " + ФИОФизическихЛиц.Имя + " " + ФИОФизическихЛиц.Отчество;
		
	Иначе
		
		Попытка
			ФизическоеЛицоОбъект.Заблокировать();
		Исключение
			
			ТекстСообщения = НСтр("ru='Учащийся не записан. Возможно данные физического лица редактируются другим пользователем'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		
		КонецПопытки;
		
	КонецЕсли;
		
	Попытка
		ФизическоеЛицоОбъект.Записать();
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось записать физическое лицо по причине: '" + ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	
	КонецПопытки;
	
	// записать контрагента
	КонтрагентОбъект = РеквизитФормыВЗначение("Контрагент");
	
	Если КонтрагентОбъект.Ссылка.Пустая() Тогда
		КонтрагентОбъект.УстановитьСсылкуНового(КонтрагентСсылка);
		КонтрагентОбъект.ВидКонтрагента 			= Перечисления.ЮрФизЛицо.ФизЛицо;
		КонтрагентОбъект.ТипКонтрагента				= Справочники.ТипыКонтрагентов.НайтиПоКоду("7");
		КонтрагентОбъект.ЮридическоеФизическоеЛицо 	= ФизическоеЛицоОбъект.Ссылка;
		КонтрагентОбъект.Наименование 				= ФизическоеЛицоОбъект.Наименование;
	Иначе
		
		Попытка
			КонтрагентОбъект.Заблокировать();
		Исключение
			
			ТекстСообщения = НСтр("ru='Учащийся не записан. Возможно данные контрагента редактируются другим пользователем'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		
		КонецПопытки;
		
	КонецЕсли;
	
	Попытка
		КонтрагентОбъект.Записать();
	Исключение
		
		ТекстСообщения = НСтр("ru='Не удалось записать контрагента по причине: '" + ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		Возврат;
	
	КонецПопытки;

	ЗаписатьУдостоверениеЛичности();
	ЗаписатьФИО();
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо",  ФизическоеЛицоСсылка));
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	ПрочитатьДанныеКонтрагента();
	ПрочитатьДанныеФизЛица();
	
	ОбновитьДоговорыСтудента();
	Элементы.ГруппаДоговоры.Доступность = Истина;
	
	УстановитьВидимостьПредупреждения();

	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтаФорма, ФизическоеЛицо);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ОбщегоНазначенияБГУ.ПроверитьЗаписьВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка), Отказ);
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, ФизическоеЛицо, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОповеститьОбИзменении(КонтрагентСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииСервер();
	
	Если Объект.Контрагент.Пустая() Тогда
		ЗаполнитьФИО();		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ЗаполнитьФИО();
	
	ЗапроситьРежимИзмененияФИО(ЭтотОбъект, ФИОФизическихЛиц.Период);
	
	ПроверитьФизическоеЛицоНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоИННПриИзменении(Элемент)
	ПроверитьФизическоеЛицоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоДатаРожденияПриИзменении(Элемент)
	ПроверитьФизическоеЛицоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоСтраховойНомерПФРПриИзменении(Элемент)
	ПроверитьФизическоеЛицоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицВидДокументаПриИзменении(Элемент)
	
	ОбновитьПолеПериодУдостоверениеЛичности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицСерияПриИзменении(Элемент)
	
	ОбновитьПолеПериодУдостоверениеЛичности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицНомерПриИзменении(Элемент)
	
	ОбновитьПолеПериодУдостоверениеЛичности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицКемВыданПриИзменении(Элемент)
	
	ОбновитьПолеПериодУдостоверениеЛичности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицДатаВыдачиПриИзменении(Элемент)
	
	ОбновитьПолеПериодУдостоверениеЛичности();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыФизическихЛицКодПодразделенияПриИзменении(Элемент)
	
	ОбновитьПолеПериодУдостоверениеЛичности();
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛицСтранаПриИзменении(Элемент)
	
	КорреспондентыКлиент.ГражданствоФизическихЛицСтранаПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛицЛицоБезГражданстваПриИзменении(Элемент)
	
	КорреспондентыКлиент.ГражданствоФизическихЛицЛицоБезГражданстваПриИзменении(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоФизическихЛицПериодПриИзменении(Элемент)
	
	КорреспондентыКлиент.ОбновитьОтображениеПолейВводаГражданства(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДоговорыСтудентаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Ссылки = Новый Массив;
	Для Каждого Ключ Из Ключи Цикл
		Ссылки.Добавить(Ключ.Ссылка);
	КонецЦикла;
	
	// Получение учащегося по списку договоров.
	СтудентСсылка = Справочники.Студенты.ПустаяСсылка();
	Для Каждого Строка Из Строки Цикл
		Строка = Строки[Строка.Ключ];
		СтудентСсылка = Строка.Данные["Студент"];
		Прервать;
	КонецЦикла;			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияОСтудентахСрезПоследних.Студент КАК Студент,
		|	МАКСИМУМ(СведенияОСтудентахСрезПоследних.Факультет) КАК ОсновнойФакультет,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СведенияОСтудентахСрезПоследних.Факультет) КАК КоличествоФакультетов
		|ПОМЕСТИТЬ ВТ_КоличествоОсновныхФакультетов
		|ИЗ
		|	РегистрСведений.СведенияОСтудентах.СрезПоследних(
		|			,
		|			Студент = &СтудентСсылка
		|				И Договор В (&Ссылки)
		|				И Поле = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПоляПриказовОбразование.СостояниеСтудента)
		|				И Значение В (&СостояниеЗачислен)) КАК СведенияОСтудентахСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОСтудентахСрезПоследних.Студент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОСтудентахСрезПоследних.Договор КАК Ссылка,
		|	1 КАК ВидНачислений,
		|	МАКСИМУМ(СведенияОСтудентахСрезПоследних.Факультет) КАК Факультет,
		|	МИНИМУМ(СведенияОСтудентахСрезПоследних.Период) КАК ДатаНачала,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА СведенияОСтудентахОтчисление.Период > СведенияОСтудентахСрезПоследних.Период
		|				ТОГДА СведенияОСтудентахОтчисление.Период
		|			ИНАЧЕ НЕОПРЕДЕЛЕНО
		|		КОНЕЦ) КАК ДатаОкончания,
		|	НЕОПРЕДЕЛЕНО КАК Плательщик,
		|	НЕОПРЕДЕЛЕНО КАК ОсновнойФакультет,
		|	0 КАК КоличествоФакультетов
		|ПОМЕСТИТЬ СтудентыДляГруппировкиПоДоговорам
		|ИЗ
		|	РегистрСведений.СведенияОСтудентах.СрезПоследних(
		|			,
		|			Студент = &СтудентСсылка
		|				И Договор В (&Ссылки)
		|				И Поле = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПоляПриказовОбразование.СостояниеСтудента)
		|				И Значение В (&СостояниеЗачислен)) КАК СведенияОСтудентахСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОСтудентах.СрезПоследних(
		|				,
		|				Студент = &СтудентСсылка
		|					И Договор В (&Ссылки)
		|					И Поле = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПоляПриказовОбразование.СостояниеСтудента)
		|					И Значение В (&СостояниеОтчислен)) КАК СведенияОСтудентахОтчисление
		|		ПО СведенияОСтудентахСрезПоследних.Студент = СведенияОСтудентахОтчисление.Студент
		|			И СведенияОСтудентахСрезПоследних.Договор = СведенияОСтудентахОтчисление.Договор
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОСтудентахСрезПоследних.Договор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СведенияОПрочихУслугахСтудентам.Договор,
		|	2,
		|	СведенияОПрочихУслугахСтудентам.Факультет,
		|	СведенияОПрочихУслугахСтудентам.НачалоНачисления,
		|	СведенияОПрочихУслугахСтудентам.ОкончаниеНачисления,
		|	СведенияОПрочихУслугахСтудентам.Плательщик,
		|	ВТ_КоличествоОсновныхФакультетов.ОсновнойФакультет,
		|	ВТ_КоличествоОсновныхФакультетов.КоличествоФакультетов
		|ИЗ
		|	РегистрСведений.СведенияОПрочихУслугахСтудентам КАК СведенияОПрочихУслугахСтудентам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоОсновныхФакультетов КАК ВТ_КоличествоОсновныхФакультетов
		|		ПО СведенияОПрочихУслугахСтудентам.Студент = ВТ_КоличествоОсновныхФакультетов.Студент
		|ГДЕ
		|	СведенияОПрочихУслугахСтудентам.Активность = ИСТИНА
		|	И СведенияОПрочихУслугахСтудентам.Студент = &СтудентСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтудентыДляГруппировкиПоДоговорам.Ссылка КАК Ссылка,
		|	СтудентыДляГруппировкиПоДоговорам.ВидНачислений КАК ВидНачислений,
		|	МАКСИМУМ(СтудентыДляГруппировкиПоДоговорам.Факультет) КАК Факультет,
		|	МИНИМУМ(СтудентыДляГруппировкиПоДоговорам.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СтудентыДляГруппировкиПоДоговорам.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА ДАТАВРЕМЯ(2999, 12, 31)
		|			ИНАЧЕ СтудентыДляГруппировкиПоДоговорам.ДатаОкончания
		|		КОНЕЦ) КАК ДатаОкончания,
		|	МАКСИМУМ(СтудентыДляГруппировкиПоДоговорам.Плательщик) КАК Плательщик,
		|	МАКСИМУМ(СтудентыДляГруппировкиПоДоговорам.ОсновнойФакультет) КАК ОсновнойФакультет,
		|	МАКСИМУМ(СтудентыДляГруппировкиПоДоговорам.КоличествоФакультетов) КАК КоличествоФакультетов
		|ИЗ
		|	СтудентыДляГруппировкиПоДоговорам КАК СтудентыДляГруппировкиПоДоговорам
		|
		|СГРУППИРОВАТЬ ПО
		|	СтудентыДляГруппировкиПоДоговорам.Ссылка,
		|	СтудентыДляГруппировкиПоДоговорам.ВидНачислений";
	
	Запрос.УстановитьПараметр("СостояниеЗачислен", РаботаСоСтудентамиПовтИсп.ПолучитьСостоянияПоВидуДействия(Истина));
	Запрос.УстановитьПараметр("СостояниеОтчислен", РаботаСоСтудентамиПовтИсп.ПолучитьСостоянияПоВидуДействия(Ложь));
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Запрос.УстановитьПараметр("СтудентСсылка", СтудентСсылка);
	
	ТекущаяДата = ТекущаяДата();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Для Каждого Строка Из Строки Цикл
		Строка = Строки[Строка.Ключ];
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Строка.Данные["Договор"], "Ссылка") Тогда 
			
			ВидНачислений = Выборка.ВидНачислений;
			ДатаНачала = Выборка.ДатаНачала;
			ДатаОкончания = ?(Выборка.ДатаОкончания = Дата(2999,12,31), Дата(1,1,1), Выборка.ДатаОкончания);
			
			Строка.Данные["ВидНачислений"] = ВидНачислений;
			
			Если ВидНачислений = 2 И НЕ ЗначениеЗаполнено(Выборка.Факультет) Тогда
				Строка.Данные["Факультет"] = Выборка.ОсновнойФакультет;
				Если Выборка.КоличествоФакультетов <> 1 Тогда
					Строка.Данные["ОшибкаФакультет"] = Истина;
				КонецЕсли;	
			Иначе
				Строка.Данные["Факультет"] = Выборка.Факультет;
			КонецЕсли;
			
			Строка.Данные["ДатаНачала"] = ДатаНачала;
			Строка.Данные["ДатаОкончания"] = ДатаОкончания;
			
			ДоговорЗавершен = ЗначениеЗаполнено(ДатаОкончания) И (ДатаОкончания < ТекущаяДата);
			ДоговорДействует = ЗначениеЗаполнено(ДатаНачала) И (ДатаНачала <= ТекущаяДата) И НЕ ДоговорЗавершен;
						
			Если ДоговорДействует Тогда
				Строка.Данные["СостояниеДоговора"] = 1;
			ИначеЕсли ДоговорЗавершен Тогда
				Строка.Данные["СостояниеДоговора"] = 2;
			Иначе
				Строка.Данные["СостояниеДоговора"] = 0;
			КонецЕсли;
			
			Если ВидНачислений = 2 Тогда
				ПлательщикПоДоговору = Выборка.Плательщик;
				Если ЗначениеЗаполнено(ПлательщикПоДоговору) Тогда
					Строка.Данные["Плательщики"] = СокрЛП(ПлательщикПоДоговору);
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	// Дополнение списка данными плательщиков.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПлательщикиПоДоговоруОбразование.Договор КАК Ссылка,
		|	МАКСИМУМ(ПлательщикиПоДоговоруОбразование.Период) КАК Период
		|ПОМЕСТИТЬ ДатыНазначенияПлательщиков
		|ИЗ
		|	РегистрСведений.ПлательщикиПоДоговоруОбразование КАК ПлательщикиПоДоговоруОбразование
		|ГДЕ
		|	ПлательщикиПоДоговоруОбразование.Договор В (&Ссылки)
		|	И ПлательщикиПоДоговоруОбразование.Студент = &Студент
		|
		|СГРУППИРОВАТЬ ПО
		|	ПлательщикиПоДоговоруОбразование.Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПлательщикиПоДоговоруОбразование.Договор КАК Ссылка,
		|	ПлательщикиПоДоговоруОбразование.Контрагент КАК Плательщик
		|ИЗ
		|	ДатыНазначенияПлательщиков КАК ДатыНазначенияПлательщиков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлательщикиПоДоговоруОбразование КАК ПлательщикиПоДоговоруОбразование
		|		ПО ДатыНазначенияПлательщиков.Ссылка = ПлательщикиПоДоговоруОбразование.Договор
		|			И ДатыНазначенияПлательщиков.Период = ПлательщикиПоДоговоруОбразование.Период
		|ГДЕ
		|	ПлательщикиПоДоговоруОбразование.Студент = &Студент
		|	И ПлательщикиПоДоговоруОбразование.Договор В(&Ссылки)
		|ИТОГИ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Плательщик)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Запрос.УстановитьПараметр("Студент", СтудентСсылка);
	
	ШаблонПлательщик = НСтр("ru='%1; и еще %2 ...'");
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Для Каждого Строка Из Строки Цикл
		Строка = Строки[Строка.Ключ];
		
		Если Строка.Данные["ВидНачислений"] = 2 Тогда
			Продолжить;
		КонецЕсли;	
		
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Строка.Данные["Договор"], "Ссылка") Тогда 
			ТекстПлательщики = "";
			КоличествоДопПлательщиков = Выборка.Плательщик - 1;
			СчПлательщиков = 0;
			
			ВыборкаПлательщики = Выборка.Выбрать();
			Пока ВыборкаПлательщики.Следующий() Цикл
				СчПлательщиков = СчПлательщиков+1;
				
				Если СчПлательщиков = 1 Тогда
					ТекстПлательщики = СокрЛП(ВыборкаПлательщики.Плательщик);
				Иначе
					ТекстПлательщики = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПлательщик,
					СокрЛП(ВыборкаПлательщики.Плательщик), 
					КоличествоДопПлательщиков);
				КонецЕсли;
			КонецЦикла;
			
			Строка.Данные["Плательщики"] = ТекстПлательщики;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыСтудентаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДоговорыСтудентаДоговор" Тогда
		СтандартнаяОбработка = Истина;
		
	ИначеЕсли Поле.Имя = "ДоговорыСтудентаПлательщики" Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ДоговорыСтудента.ТекущиеДанные;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Организация", Объект.Организация);
		ПараметрыФормы.Вставить("Студент",     ТекущиеДанные.Студент);
		ПараметрыФормы.Вставить("Договор",     ТекущиеДанные.Договор);
		
		ОткрытьФорму("Справочник.Студенты.Форма.ФормаПлательщики", ПараметрыФормы,
			ЭтотОбъект, Объект.Ссылка, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыСтудентаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
	
		Отказ = Истина;
		ОшибкиЗаполнения = Ложь;
		
		Если Объект.Организация.Пустая() Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не заполнено поле ""%1"".'"), "Организация"); 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,	"Объект.Организация", , ОшибкиЗаполнения);
			
		КонецЕсли;
		
		Если СтудентСсылка.Пустая() Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не заполнено поле ""%1"".'"), "Студент"); 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,	"Объект.Студент", , ОшибкиЗаполнения);
			
		КонецЕсли; 
			
		Если НЕ ОшибкиЗаполнения Тогда
			
			ОткрытьФормуСозданиеДоговора();

		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// список дублей контрагентов

&НаКлиенте
Процедура НадписьПоясненияНекорректногоИННОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПередачи = Новый Структура;
	ПараметрыПередачи.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	ПараметрыПередачи.Вставить("ТекущаяСтрока", Контрагент.Ссылка);
	ПараметрыПередачи.Вставить("Отбор", Новый Структура);
	ПараметрыПередачи.Отбор.Вставить("ВидКонтрагента", Контрагент.ВидКонтрагента);
	
	Если Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоФИО") > 0 Тогда
		ПараметрыПередачи.Отбор.Вставить("Наименование", Объект.Наименование);
		ПараметрыПередачи.Отбор.Вставить("ДатаРождения", ФизическоеЛицо.ДатаРождения);
	ИначеЕсли Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоИНН") > 0 Тогда
	    ПараметрыПередачи.Отбор.Вставить("ИНН", ФизическоеЛицо.ИНН);
    ИначеЕсли Найти(НавигационнаяСсылка, "ЕстьДублиФизЛицоСНИЛС") > 0 Тогда
	    ПараметрыПередачи.Отбор.Вставить("СНИЛС", ФизическоеЛицо.СтраховойНомерПФР);
	Иначе
		Возврат;
	КонецЕсли;
	
	ЧтоВыполнитьПослеЗакрытия = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСпискаДублей", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаСпискаДублей",
		ПараметрыПередачи,
		Элемент,
		,
		,
		,
		ЧтоВыполнитьПослеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры   
	
&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСпискаДублей(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	ПроверитьФизическоеЛицоНаСервере();
КонецПроцедуры	 

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗаблокированныеРеквизиты = ЗапретРедактированияРеквизитовОбъектовКлиент.Реквизиты(ЭтотОбъект);
	 
	 Если ЗаблокированныеРеквизиты.Количество() > 0 Тогда
		
		ПараметрыФормы = Новый Структура;		
		ПараметрыФормы.Вставить("Ссылка", 					Объект.Ссылка);
		ПараметрыФормы.Вставить("ЗаблокированныеРеквизиты", ЗаблокированныеРеквизиты);
		
		ОткрытьФорму("Справочник.Студенты.Форма.РазблокированиеРеквизитов", ПараметрыФормы, ЭтотОбъект);
		
	Иначе
		
		ЗапретРедактированияРеквизитовОбъектовКлиент.ПоказатьПредупреждениеВсеВидимыеРеквизитыРазблокированы();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Объект.Контрагент = ВыбранноеЗначение;
		
        КонтрагентПриИзмененииСервер();
		
	КонецЕсли;
	  	  
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтрагента(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", Ложь);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ВидКонтрагента", ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо")));

	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элементы.Наименование);

КонецПроцедуры

&НаКлиенте
Процедура ФИОИстория(Команда)
	
	Отбор = Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка);
	ПараметрыФормы = Новый Структура("Отбор, ФизическоеЛицо, ЗакрыватьПриЗакрытииВладельца" , Отбор, ФизическоеЛицоСсылка, Истина);
	ОткрытьФорму("РегистрСведений.ФИОФизическихЛиц.ФормаСписка", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияУдостоверение(Команда)
	
	Отбор = Новый Структура("ФизЛицо, ЯвляетсяДокументомУдостоверяющимЛичность", ФизическоеЛицоСсылка, Истина);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГражданствоИстория(Команда)
	
	КорреспондентыКлиент.ГражданствоИстория(ФизическоеЛицоСсылка, ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПадежи(Команда)
	
	ТекущееНаименованиеДП = Контрагент.НаименованиеДП;
	ТекущееНаименованиеРП = Контрагент.НаименованиеРП;
	
	ИсходныйТекст = ФизическоеЛицо.Наименование;
	ПолФЛ = ФизическоеЛицо.Пол;
	
	ЗаполнитьПадежиНаСервере(ИсходныйТекст, ПолФЛ, Контрагент.НаименованиеДП, Контрагент.НаименованиеРП);
	
	Если ТекущееНаименованиеДП <> Контрагент.НаименованиеДП Или ТекущееНаименованиеРП <> Контрагент.НаименованиеРП Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриказПоДоговору(Команда)
	
	ВидПриказа = ПредопределенноеЗначение("Справочник.ВидыПриказовОбразование.ПустаяСсылка");
	
	Если Элементы.ДоговорыСтудента.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для ввода приказа необходимо предварительно выбрать существующий договор в списке.'"), 10);
	Иначе
		Оповещение = Новый ОписаниеОповещения("СоздатьПриказПоДоговоруЗавершение", ЭтотОбъект, Параметры);
		ПоказатьВводЗначения(Оповещение, ВидПриказа, "Выберите вид приказа");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриказПоДоговоруЗавершение(ВыбранноеЗначение, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ТекущиеДанные = Элементы.ДоговорыСтудента.ТекущиеДанные;
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
		ЗначенияЗаполнения.Вставить("ВидПриказа",  ВыбранноеЗначение);
		ЗначенияЗаполнения.Вставить("Студент",     ТекущиеДанные.Студент);
		ЗначенияЗаполнения.Вставить("Договор",     ТекущиеДанные.Договор);
		ЗначенияЗаполнения.Вставить("Факультет",   ТекущиеДанные.Факультет);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.ПриказОбразование.ФормаОбъекта", ПараметрыФормы,
			ЭтотОбъект, Объект.Ссылка, , , , РежимОткрытияОкнаФормы.Независимый);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговорЧерезПомощникЗавершение(ПараметрыНовогоДоговора, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыНовогоДоговора) Тогда
		
		Если ПараметрыНовогоДоговора.ВвестиПриказОЗачислении Тогда
		
			ТекущиеДанные = Элементы.ДоговорыСтудента.ТекущиеДанные;
			
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
			ЗначенияЗаполнения.Вставить("Студент",     Объект.Ссылка);
			
			ЗначенияЗаполнения.Вставить("Договор",     ПараметрыНовогоДоговора.ДоговорСсылка);
			ЗначенияЗаполнения.Вставить("Факультет",   ПараметрыНовогоДоговора.Факультет);
			ЗначенияЗаполнения.Вставить("ВидПриказа",  ПараметрыНовогоДоговора.ВидПриказа);
			ЗначенияЗаполнения.Вставить("НачислениеСтудентамЗаПрочиеУслуги", ПараметрыНовогоДоговора.НачислениеСтудентамЗаПрочиеУслуги);
			ЗначенияЗаполнения.Вставить("ДатаНачалаДействия", ПараметрыНовогоДоговора.ДатаПриказа);
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
			ОткрытьФорму("Документ.ПриказОбразование.ФормаОбъекта", ПараметрыФормы,
				ЭтотОбъект, Объект.Ссылка, , , , РежимОткрытияОкнаФормы.Независимый);
				
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРегистрациюПлательщиковПоДоговору(Команда)
	
	ТекущиеДанные = Элементы.ДоговорыСтудента.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Для ввода регистрации плательщиков необходимо предварительно выбрать существующий договор в списке.'"), 10);
		Возврат;
	ИначеЕсли ТекущиеДанные.ВидНачислений = 2 Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Возможность указать нескольких плательщиков для договоров за прочие услуги не предусмотрена.'"));
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	ЗначенияЗаполнения.Вставить("Студент",     ТекущиеДанные.Студент);
	ЗначенияЗаполнения.Вставить("Договор",     ТекущиеДанные.Договор);
	ЗначенияЗаполнения.Вставить("Факультет",   ТекущиеДанные.Факультет);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.РегистрацияПлательщиковПоДоговоруОбразование.ФормаОбъекта", ПараметрыФормы,
		ЭтотОбъект, Объект.Ссылка, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияПлательщиковПоДоговорам(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Студент", СтудентСсылка);
	
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, ТолькоПросмотр", Отбор, Истина);
	ОткрытьФорму("Документ.РегистрацияПлательщиковПоДоговоруОбразование.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорСПлательщиком(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Студент",     Объект.Ссылка);
	ПараметрыФормы.Вставить("КонтрагентСтудента", КонтрагентСсылка);
	
	ДополнительныеЗначенияЗаполнения = Новый Структура("ВидОбязательства, Наименование, КонтрольЗаполненияРабочегоНаименования");
	ДополнительныеЗначенияЗаполнения.ВидОбязательства = "Договор на оплату за обучение";
	ДополнительныеЗначенияЗаполнения.Наименование = "Договор на оплату за обучение";
	ДополнительныеЗначенияЗаполнения.КонтрольЗаполненияРабочегоНаименования = Ложь;
	ПараметрыФормы.Вставить("ДополнительныеЗначенияЗаполнения", ДополнительныеЗначенияЗаполнения);
	
	Оповещение = Новый ОписаниеОповещения("СоздатьДоговорЧерезПомощникЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Студенты.Форма.ПомощникВводаДоговора", ПараметрыФормы,
		ЭтотОбъект, Объект.Ссылка, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервереБезКонтекста
Процедура ЗаполнитьПадежиНаСервере(Исходныйтекст, ПолФЛ, НаименованиеДП, НаименованиеРП)
	
	Корреспонденты.Просклонять(Исходныйтекст, 3, НаименованиеДП, ПолФЛ);
	Корреспонденты.Просклонять(Исходныйтекст, 2, НаименованиеРП, ПолФЛ);

КонецПроцедуры

&наСервере
Процедура КонтрагентПриИзмененииСервер()
	
	Если Объект.Контрагент.Пустая() Тогда
		
		КонтрагентСсылка = Справочники.Контрагенты.ПолучитьСсылку();
		ФизическоеЛицоСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку();
		ЗначениеВРеквизитФормы(Справочники.Контрагенты.СоздатьЭлемент(), "Контрагент");
		ЗначениеВРеквизитФормы(Справочники.ФизическиеЛица.СоздатьЭлемент(), "ФизическоеЛицо");
		
		Корреспонденты.ИнициализироватьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);
		
		ОбщегоНазначенияБГУ.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтаФорма, "ФИОФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
		
	Иначе
		
		КонтрагентОбъект = Объект.Контрагент.ПолучитьОбъект();
		
		Объект.Наименование = КонтрагентОбъект.Наименование;
		КонтрагентСсылка = КонтрагентОбъект.Ссылка;
		ФизическоеЛицоСсылка	= КонтрагентОбъект.ЮридическоеФизическоеЛицо;
		
		ЗначениеВРеквизитФормы(КонтрагентОбъект, "Контрагент");
		ЗначениеВРеквизитФормы(ФизическоеЛицоСсылка.ПолучитьОбъект(), "ФизическоеЛицо");
		
		ПрочитатьДанныеФизЛица();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ФизическоеЛицо);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация 
	
	ПроверитьФизическоеЛицоНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеФизЛица()

	Если ЗначениеЗаполнено(ФизическоеЛицоСсылка) Тогда
		ЗначениеВРеквизитФормы(ФизическоеЛицоСсылка.ПолучитьОбъект(), "ФизическоеЛицо");
	Иначе
		ФизическоеЛицоСсылка 	= Справочники.ФизическиеЛица.ПолучитьСсылку();
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ГражданствоФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));

	ГражданствоФизическихЛицЛицоБезГражданства = НЕ ЗначениеЗаполнено(ГражданствоФизическихЛиц.Страна);
	
	ПрочитатьУдостоверениеЛичности();
	
	ПрочитатьФИО();

КонецПроцедуры // ПрочитатьДанныеФизЛица()

&НаСервере
Процедура ПрочитатьУдостоверениеЛичности()

	Корреспонденты.ПрочитатьДокументУдостоверяющийЛичностьДляРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);	

КонецПроцедуры // ПрочитатьУдостоверениеЛичности()

&НаСервере
Процедура ЗаписатьУдостоверениеЛичности()

	Корреспонденты.ЗаписатьДокументУдостоверяющийЛичностьПослеРедактированияВФорме(ЭтаФорма, ФизическоеЛицоСсылка);

КонецПроцедуры // ЗаписатьУдостоверениеЛичности()

&НаСервере
Процедура ПрочитатьФИО()

	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтаФорма, "ФИОФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));
	
	ФизическоеЛицо.Наименование = СокрЛП(ФИОФизическихЛиц.Фамилия + " " + ФИОФизическихЛиц.Имя + " " + ФИОФизическихЛиц.Отчество);
	
	Контрагент.Наименование = ФизическоеЛицо.Наименование;
	
КонецПроцедуры // ПрочитатьФИО()

&НаСервере
Процедура ЗаписатьФИО()

	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "ФИОФизическихЛиц", Новый Структура("ФизическоеЛицо", ФизическоеЛицоСсылка));

КонецПроцедуры // ЗаписатьФИО()

&НаСервере
Процедура ПрочитатьДанныеКонтрагента()

	Если ЗначениеЗаполнено(КонтрагентСсылка) Тогда	
    	ЗначениеВРеквизитФормы(КонтрагентСсылка.ПолучитьОбъект(),"Контрагент");
	Иначе
		КонтрагентСсылка = Справочники.Контрагенты.ПолучитьСсылку();
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;		
	
КонецПроцедуры // ПрочитатьДанныеКонтрагента()

&НаСервере
Процедура УстановитьВидимостьПредупреждения()
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить("ФИОИстория");
	МассивЭлементов.Добавить("ИсторияУдостоверение");
	МассивЭлементов.Добавить("ГражданствоИстория");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", НЕ Объект.Ссылка.Пустая());
	
	Если Объект.Контрагент.Пустая() Тогда
		Элементы.Наименование.УстановитьДействие("ОбработкаВыбора", "Подключаемый_НаименованиеОбработкаВыбора");
		Элементы.КнопкаВыбораКонтрагента.Видимость = Истина;
	Иначе
		Элементы.КнопкаВыбораКонтрагента.Видимость = Ложь;
    КонецЕсли;
	
КонецПроцедуры

// Устанавливает отметку незаполненного у поля период удостоверения личности
//
&НаКлиенте
Процедура ОбновитьПолеПериодУдостоверениеЛичности()

	Если  НЕ (ЗначениеЗаполнено(ДокументыФизическихЛиц.ВидДокумента) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.Серия) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.Номер) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.КемВыдан) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.ДатаВыдачи) или
		ЗначениеЗаполнено(ДокументыФизическихЛиц.КодПодразделения)) Тогда
		
		Элементы.ДокументыФизическихЛицПериод.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
		Элементы.ДокументыФизическихЛицВидДокумента.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ДокументыФизическихЛицВидДокумента.ОтметкаНезаполненного = Ложь;
	Иначе		
		Элементы.ДокументыФизическихЛицПериод.АвтоОтметкаНезаполненного = Истина;
		Элементы.ДокументыФизическихЛицВидДокумента.АвтоОтметкаНезаполненного = Истина;
		Если ЗначениеЗаполнено(ДокументыФизическихЛиц.Период) Тогда
			Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Ложь;
			Элементы.ДокументыФизическихЛицВидДокумента.ОтметкаНезаполненного = Ложь;
		Иначе
			Элементы.ДокументыФизическихЛицПериод.ОтметкаНезаполненного = Истина;
			Элементы.ДокументыФизическихЛицВидДокумента.ОтметкаНезаполненного = Истина;
		КонецЕсли;
	КонецЕсли;
		

КонецПроцедуры // ОбновитьПолеПериодУдостоверениеЛичности()

&НаКлиенте
Процедура ЗапроситьРежимИзмененияФИО(ФормаИсточник, ДатаИзменения)
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru =  'При редактировании Вы изменили полное имя учащегося. 
						|Если Вы просто исправили прежние данные (они были ошибочны), нажмите ""Исправлена ошибка"".
						|Если у учащегося сменилась фамилия, имя или отчество с %1, нажмите ""Изменилось имя""'"), 
			Формат(ТекущаяДата(), "ДФ='д ММММ гггг ""г""'"));
	ТекстКнопкиДа = НСтр("ru = 'Изменилось имя'");
	
	ОбщегоНазначенияБГУКлиент.ЗапроситьРежимИзмененияРегистра(ФормаИсточник, "ФИОФизическихЛиц", ТекстВопроса, ТекстКнопкиДа, Ложь,, СтудентСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФИО()
	
	СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Объект.Наименование);
	
	ФИОФизическихЛиц.Фамилия  	= СтруктураФИО.Фамилия;
	ФИОФизическихЛиц.Имя 		= СтруктураФИО.Имя;		
	ФИОФизическихЛиц.Отчество 	= СтруктураФИО.Отчество;

	Если НЕ ЗначениеЗаполнено(ФИОФизическихЛиц.Период) Тогда
		Если ЗначениеЗаполнено(ФизическоеЛицо.ДатаРождения) Тогда
			ФИОФизическихЛиц.Период = ФизическоеЛицо.ДатаРождения;
		Иначе
			ФИОФизическихЛиц.Период = '19800101';
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ФИОФизическихЛиц.Отчество) Тогда
		ФизическоеЛицо.Пол = КорреспондентыКлиентСервер.ОпределитьПолПоОтчеству(ФИОФизическихЛиц.Отчество);
	КонецЕсли;
	
	Контрагент.Наименование 	= Объект.Наименование; 
	ФизическоеЛицо.Наименование = Объект.Наименование; 

КонецПроцедуры

&НаСервере
Процедура ПроверитьФизическоеЛицоНаСервере()
	
	ТекстСообщения = "";
	МассивРезультатовПроверки = Новый Массив;
	Элементы.ГруппаОшибки.Видимость = Ложь;
		
	Если ЗначениеЗаполнено(ФизическоеЛицо.ИНН) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ФизическоеЛицо.ИНН, Ложь, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));  
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
		Дубли = Корреспонденты.ПроверитьДублиФизЛицаПоРегДанным("ИНН", ФизическоеЛицо.ИНН, КонтрагентСсылка);
		Если Дубли > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В справочние ""Контрагенты"" обнаружено еще записей с тем же ИНН: %1'"), Дубли);
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоИНН")); 
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФизическоеЛицо.СтраховойНомерПФР) Тогда
		
		Если НЕ РегламентированныеДанныеКлиентСервер.СтраховойНомерПФРСоответствуетТребованиям(ФизическоеЛицо.СтраховойНомерПФР, ТекстСообщения) Тогда
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения));  
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;

		Дубли = Корреспонденты.ПроверитьДублиФизЛицаПоРегДанным("СтраховойНомерПФР", ФизическоеЛицо.СтраховойНомерПФР, КонтрагентСсылка);
		Если Дубли > 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В справочние ""Контрагенты"" обнаружено еще записей с тем же СНИЛС: %1'"), Дубли);
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоСНИЛС")); 
			МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(Символы.ПС));
		КонецЕсли;
		
	КонецЕсли;
	
	Дубли = Корреспонденты.ПроверитьДублиКонтрагентаФизЛица(Объект.Наименование, ФизическоеЛицо.ДатаРождения, КонтрагентСсылка);
	Если Дубли > 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В справочние ""Контрагенты"" обнаружено еще записей с теми же ФИО и датой рождения: %1'"), Дубли);
		МассивРезультатовПроверки.Добавить(Новый ФорматированнаяСтрока(ТекстСообщения,,,,"ЕстьДублиФизЛицоФИО"));
	КонецЕсли;
	
	Если МассивРезультатовПроверки.Количество() > 0 Тогда
		МассивРезультатовПроверки.Вставить(0, Новый ФорматированнаяСтрока(Символы.ПС));
		НадписьПоясненияНекорректногоИНН = Новый ФорматированнаяСтрока(МассивРезультатовПроверки);
		Элементы.ГруппаОшибки.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ СВОЙСТВ

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

#Область ПроцедурыПодсистемыКонтактнаяИнформация

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
        УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
    УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//1. Отображение текста ВидНачислений в таблице ДоговорыСтудента.	
	//НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	//НовыйЭлементУО.Представление = НСтр("ru = 'Вид начислений, не определен'");
	//// Условие
	//Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ДоговорыСтудента.ВидНачислений");
	//Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	//Условие.ПравоеЗначение	= 0;
	//// Оформление
	//НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не определено>'"));
	//// Оформляемые поля
	//ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДоговорыСтудентаВидНачислений");
	
	//2. Отображение текста ВидНачислений в таблице ДействующиеДоговоры.	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru = 'Вид начислений, образовательная деятельность'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ДоговорыСтудента.ВидНачислений");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= 1;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'за услуги образования'"));
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДоговорыСтудентаВидНачислений");
	
	//3. Отображение текста ВидНачислений в таблице ДействующиеДоговоры.	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru = 'Вид начислений, прочие услуги'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ДоговорыСтудента.ВидНачислений");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= 2;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'за прочие услуги'"));
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДоговорыСтудентаВидНачислений");
	
	//4. Отображение текста Факультет в таблице ДействующиеДоговоры.	
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru = 'Факультет, по факультету обучения'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ДоговорыСтудента.Факультет");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ДоговорыСтудента.ВидНачислений");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= 2;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<по факультету обучения>'"));
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДоговорыСтудентаФакультет");	
	
	//3. Выделение договоров по прочим услугам с некорректным основным факультетом.
	НовыйЭлементУО = УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru = 'Некорректные факультеты по прочим услугам'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ДоговорыСтудента.ОшибкаФакультет");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаДокументаСНекорректнымиКонтрагентамиВСпискеДокументов);
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДоговорыСтудентаФакультет");
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСозданиеДоговора()
	
	ЗначенияЗаполнения = Новый Структура("Организация, Контрагент, ВидДоговора");
	ЗначенияЗаполнения.Организация = Объект.Организация;
	ЗначенияЗаполнения.Контрагент = КонтрагентСсылка;
	ЗначенияЗаполнения.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");
	ДополнительныеЗначенияЗаполнения = Новый Структура("ВидОбязательства, Наименование, КонтрольЗаполненияРабочегоНаименования");
	ДополнительныеЗначенияЗаполнения.ВидОбязательства = "Договор на оплату за обучение";
	ДополнительныеЗначенияЗаполнения.Наименование = "Договор на обучение " + СтудентСсылка;
	ДополнительныеЗначенияЗаполнения.КонтрольЗаполненияРабочегоНаименования = Ложь;
	Если ИспользоватьКонтрольИсполненияДоговоров Тогда
		// По долгосрочным договорам студентов графики ведутся автоматически, не нужно вводить дополнительных данных,
		// поэтому по умолчанию в договоре со студентом установим ведение графиков.
		ДополнительныеЗначенияЗаполнения.Вставить("ВестиГрафикПлатежей", Истина);
		ДополнительныеЗначенияЗаполнения.Вставить("ВестиПланГрафикИсполнения", Истина);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",						ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ДополнительныеЗначенияЗаполнения",			ДополнительныеЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ЗаполнятьДополнительныеЗначенияЗаполнения",Истина);
	ПараметрыФормы.Вставить("ИменаНедоступныхРеквизитов",				"Организация,ВидДоговора");
	ПараметрыФормы.Вставить("ИменаНевидимыхЭлементов",					"ВвестиИзменитьГрафикиИсполнения");
	
	ОткрытьФорму("Справочник.Договоры.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоговорыСтудента()
	
	ДоговорыСтудента.Параметры.УстановитьЗначениеПараметра("Контрагент", КонтрагентСсылка);
	ДоговорыСтудента.Параметры.УстановитьЗначениеПараметра("СпособОтображенияДоговоров", СпособОтображенияДоговоров);
	ДоговорыСтудента.Параметры.УстановитьЗначениеПараметра("Студент", СтудентСсылка);
		
КонецПроцедуры

&НаКлиенте
Процедура СпособОтображенияДоговоровПриИзменении(Элемент)	
	
	ОбновитьДоговорыСтудента();
	
КонецПроцедуры

#КонецОбласти
