#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.СправкаОбОплатеУслугДляНалоговогоВычета";
	КомандаПечати.Обработчик     = "СправкаОбОплатеУслугКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Идентификатор  = "СправкаОбОплатеУслуг";
	КомандаПечати.Представление  = НСтр("ru = 'Справка об оплате услуг для налогового вычета'");
	КомандаПечати.Порядок        = 10;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.СправкаОбОплатеУслугДляНалоговогоВычета";
	КомандаПечати.Обработчик     = "СправкаОбОплатеУслугКлиент.ВыполнитьКомандуПечатиPDF417";
	КомандаПечати.Идентификатор  = "СправкаОбОплатеУслугPDF417";
	КомандаПечати.Представление  = НСтр("ru = 'Справка об оплате услуг для налогового вычета (PDF417)'");
	КомандаПечати.СписокФорм     = "ФормаДокумента";
	КомандаПечати.Порядок        = 20;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"СправкаОбОплатеУслуг") Тогда
		
		РезультатПечати = СправкаОбОплатеУслугВызовСервера.ПечатьСправкиБРО(МассивОбъектов[0]);
		Если ЗначениеЗаполнено(РезультатПечати) Тогда
		
			ТабличныйДокументПечати = Неопределено;
			Если РезультатПечати.Свойство("СписокПечатаемыхЛистов") Тогда
				Для Каждого ЛистПечати Из РезультатПечати.СписокПечатаемыхЛистов Цикл
					Для Каждого ЭлементПечати Из ЛистПечати.Значение Цикл
						Если ЭтоАдресВременногоХранилища(ЭлементПечати) Тогда
							Если ТабличныйДокументПечати = Неопределено Тогда
								ТабличныйДокументПечати = ПолучитьИзВременногоХранилища(ЭлементПечати);
							Иначе
								ТабличныйДокументПечати.Присоединить(ПолучитьИзВременногоХранилища(ЭлементПечати));
							КонецЕсли;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокументПечати, 1, ОбъектыПечати, МассивОбъектов[0]);
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СправкаОбОплатеУслуг", "Справка об оплате услуг",
				ТабличныйДокументПечати);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СправкаОбОплатеУслугДляНалоговогоВычета.Дата КАК Период,
	|	СправкаОбОплатеУслугДляНалоговогоВычета.Организация КАК Организация,
	|	СправкаОбОплатеУслугДляНалоговогоВычета.Налогоплательщик КАК Налогоплательщик,
	|	СправкаОбОплатеУслугДляНалоговогоВычета.Получатель КАК Получатель,
	|	СправкаОбОплатеУслугДляНалоговогоВычета.ВидСправки КАК ВидСправки,
	|	СправкаОбОплатеУслугДляНалоговогоВычета.ОтчетныйГод КАК ОтчетныйГод,
	|	ВЫБОР
	|		КОГДА СправкаОбОплатеУслугДляНалоговогоВычета.ВидСправки = ЗНАЧЕНИЕ(Перечисление.ВидыСправокДляНалоговогоВычета.ОбразовательныеУслуги)
	|			ТОГДА СправкаОбОплатеУслугДляНалоговогоВычета.ОбразованиеСуммаРасходов
	|		КОГДА СправкаОбОплатеУслугДляНалоговогоВычета.ВидСправки = ЗНАЧЕНИЕ(Перечисление.ВидыСправокДляНалоговогоВычета.МедицинскиеУслуги)
	|			ТОГДА СправкаОбОплатеУслугДляНалоговогоВычета.МедицинаСуммаРасходов1 + СправкаОбОплатеУслугДляНалоговогоВычета.МедицинаСуммаРасходов2
	|		КОГДА СправкаОбОплатеУслугДляНалоговогоВычета.ВидСправки = ЗНАЧЕНИЕ(Перечисление.ВидыСправокДляНалоговогоВычета.ФизкультурноОздоровительныеУслуги)
	|			ТОГДА СправкаОбОплатеУслугДляНалоговогоВычета.ФизкультураСуммаРасходов
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.СправкаОбОплатеУслугДляНалоговогоВычета КАК СправкаОбОплатеУслугДляНалоговогоВычета
	|ГДЕ
	|	СправкаОбОплатеУслугДляНалоговогоВычета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений.Вставить("ВыданныеСправкиОбОплатеУслуг", Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
