
#Область СлужебныйПрограммныйИнтерфейс

// Зарегистрировать изменения справочников.
//
Процедура ЗарегистрироватьИзмененияСправочникаДляОфлайнОборудования(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ БиблиотекаФункцийОбменаПовтИсп.ЕстьОбменСОфлайнОборудованием() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("СправочникОбъект.Прейскурант") Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ФискальныеРегистраторы.Организация КАК Организация,
		                      |	ФискальныеРегистраторы.Ссылка КАК КассаККМ,
		                      |	ФискальныеРегистраторы.ПравилоОбменаСОборудованием КАК ПравилоОбмена,
		                      |	ФискальныеРегистраторы.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		                      |ПОМЕСТИТЬ КассыККМ
		                      |ИЗ
		                      |	Справочник.ФискальныеРегистраторы КАК ФискальныеРегистраторы
		                      |ГДЕ
		                      |	ФискальныеРегистраторы.ТипОборудования = 1
		                      |	И ФискальныеРегистраторы.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованием.ПустаяСсылка)
		                      |	И ФискальныеРегистраторы.Организация = &Организация
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Прейскурант.Код КАК Код,
		                      |	Прейскурант.Организация КАК Организация,
		                      |	Прейскурант.Ссылка КАК Номенклатура
		                      |ПОМЕСТИТЬ НоменклатураПрейскуранта
		                      |ИЗ
		                      |	Справочник.Прейскурант КАК Прейскурант
		                      |ГДЕ
		                      |	Прейскурант.Ссылка = &Значение
		                      |	И Прейскурант.Организация = &Организация
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	КассыККМ.КассаККМ КАК КассаККМ,
		                      |	ЕСТЬNULL(НоменклатураПрейскуранта.Номенклатура, ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)) КАК НоменклатураПрейскуранта,
		                      |	КассыККМ.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		                      |ПОМЕСТИТЬ КассыИНоменклатура
		                      |ИЗ
		                      |	КассыККМ КАК КассыККМ
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПрейскуранта КАК НоменклатураПрейскуранта
		                      |		ПО (НоменклатураПрейскуранта.Организация = КассыККМ.Организация)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	КассыИНоменклатура.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта,
		                      |	КассыИНоменклатура.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		                      |ИЗ
		                      |	КассыИНоменклатура КАК КассыИНоменклатура
		                      |ГДЕ
		                      |	КассыИНоменклатура.НоменклатураПрейскуранта <> ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)");		
			Запрос.УстановитьПараметр("Организация", Источник.Организация);
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.Номенклатура") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ФискальныеРегистраторы.Организация КАК Организация,
		                      |	ФискальныеРегистраторы.Ссылка КАК КассаККМ,
		                      |	ФискальныеРегистраторы.ПравилоОбменаСОборудованием КАК ПравилоОбмена,
		                      |	ФискальныеРегистраторы.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		                      |ПОМЕСТИТЬ КассыККМ
		                      |ИЗ
		                      |	Справочник.ФискальныеРегистраторы КАК ФискальныеРегистраторы
		                      |ГДЕ
		                      |	ФискальныеРегистраторы.ТипОборудования = 1
		                      |	И ФискальныеРегистраторы.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованием.ПустаяСсылка)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Прейскурант.Код КАК Код,
		                      |	Прейскурант.Организация КАК Организация,
		                      |	Прейскурант.Ссылка КАК Номенклатура
		                      |ПОМЕСТИТЬ НоменклатураПрейскуранта
		                      |ИЗ
		                      |	Справочник.Прейскурант КАК Прейскурант
		                      |ГДЕ
		                      |	Прейскурант.Номенклатура = &Значение
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	КассыККМ.КассаККМ КАК КассаККМ,
		                      |	ЕСТЬNULL(НоменклатураПрейскуранта.Номенклатура, ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)) КАК НоменклатураПрейскуранта,
		                      |	КассыККМ.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		                      |ПОМЕСТИТЬ КассыИНоменклатура
		                      |ИЗ
		                      |	КассыККМ КАК КассыККМ
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПрейскуранта КАК НоменклатураПрейскуранта
		                      |		ПО (НоменклатураПрейскуранта.Организация = КассыККМ.Организация)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	КассыИНоменклатура.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта,
		                      |	КассыИНоменклатура.УзелИнформационнойБазы КАК УзелИнформационнойБазы
		                      |ИЗ
		                      |	КассыИНоменклатура КАК КассыИНоменклатура
		                      |ГДЕ
		                      |	КассыИНоменклатура.НоменклатураПрейскуранта <> ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)");		
							  
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.ФискальныеРегистраторы") Тогда
		Если  ЗначениеЗаполнено(Источник.УзелИнформационнойБазы)
			И ЗначениеЗаполнено(Источник.ПравилоОбменаСОборудованием)
			И Источник.ПравилоОбменаСОборудованием <> Источник.Ссылка.ПравилоОбменаСОборудованием
			И (Источник.ТипОборудования = 1) Тогда
			
			ПланыОбмена.УдалитьРегистрациюИзменений(Источник.УзелИнформационнойБазы);
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ФискальныеРегистраторы.Организация КАК Организация,
			                      |	ФискальныеРегистраторы.Ссылка КАК КассаККМ,
			                      |	ФискальныеРегистраторы.ПравилоОбменаСОборудованием КАК ПравилоОбмена,
			                      |	ФискальныеРегистраторы.УзелИнформационнойБазы КАК УзелИнформационнойБазы
			                      |ПОМЕСТИТЬ КассыККМ
			                      |ИЗ
			                      |	Справочник.ФискальныеРегистраторы КАК ФискальныеРегистраторы
			                      |ГДЕ
			                      |	ФискальныеРегистраторы.Ссылка = &Значение
			                      |	И ФискальныеРегистраторы.ТипОборудования = 1
			                      |	И ФискальныеРегистраторы.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованием.ПустаяСсылка)
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ
			                      |	Прейскурант.Код КАК Код,
			                      |	Прейскурант.Организация КАК Организация,
			                      |	Прейскурант.Ссылка КАК Номенклатура
			                      |ПОМЕСТИТЬ НоменклатураПрейскуранта
			                      |ИЗ
			                      |	Справочник.Прейскурант КАК Прейскурант
			                      |ГДЕ
			                      |	Прейскурант.Организация = &Организация
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                      |	КассыККМ.КассаККМ КАК КассаККМ,
			                      |	ЕСТЬNULL(НоменклатураПрейскуранта.Номенклатура, ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)) КАК НоменклатураПрейскуранта,
			                      |	КассыККМ.УзелИнформационнойБазы КАК УзелИнформационнойБазы
			                      |ПОМЕСТИТЬ КассыИНоменклатура
			                      |ИЗ
			                      |	КассыККМ КАК КассыККМ
			                      |		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураПрейскуранта КАК НоменклатураПрейскуранта
			                      |		ПО (НоменклатураПрейскуранта.Организация = КассыККМ.Организация)
			                      |;
			                      |
			                      |////////////////////////////////////////////////////////////////////////////////
			                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                      |	КассыИНоменклатура.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта,
			                      |	КассыИНоменклатура.УзелИнформационнойБазы КАК УзелИнформационнойБазы
			                      |ИЗ
			                      |	КассыИНоменклатура КАК КассыИНоменклатура
			                      |ГДЕ
			                      |	КассыИНоменклатура.НоменклатураПрейскуранта <> ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)");		
			
			Запрос.УстановитьПараметр("Организация", Источник.Организация);
		Иначе
			Возврат;
		КонецЕсли;
		
	Иначе
		Возврат;
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Значение", Источник.Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.НоменклатураПрейскуранта) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.УзелИнформационнойБазы, Выборка.НоменклатураПрейскуранта);
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Зарегистрировать изменения в документах.
//
Процедура ЗарегистрироватьИзмененияДокументаДляОфлайнОборудования(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ БиблиотекаФункцийОбменаПовтИсп.ЕстьОбменСОфлайнОборудованием() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("ДокументОбъект.УстановкаЦенНоменклатуры") Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыМатериалы.Ссылка.Организация КАК Организация,
		|	УстановкаЦенНоменклатурыМатериалы.Номенклатура КАК Номенклатура,
		|	УстановкаЦенНоменклатурыМатериалы.Цена КАК Цена
		|ПОМЕСТИТЬ НоменклатураДокумента
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Материалы КАК УстановкаЦенНоменклатурыМатериалы
		|ГДЕ
		|	УстановкаЦенНоменклатурыМатериалы.Ссылка = &Значение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Прейскурант.Ссылка КАК НоменклатураПрейскуранта,
		|	Прейскурант.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ОтборПрейскуранта
		|ИЗ
		|	Справочник.Прейскурант КАК Прейскурант
		|ГДЕ
		|	Прейскурант.СнятаСПродажи = ЛОЖЬ
		|	И Прейскурант.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтборПрейскуранта.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта,
		|	НоменклатураДокумента.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	НоменклатураДокумента КАК НоменклатураДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОтборПрейскуранта КАК ОтборПрейскуранта
		|		ПО (НоменклатураДокумента.Организация = НоменклатураДокумента.Организация)
		|			И НоменклатураДокумента.Номенклатура = ОтборПрейскуранта.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.НоменклатураПрейскуранта.Организация КАК Организация,
		|	ИтоговаяТаблица.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта
		|ПОМЕСТИТЬ СписокНоменклатурыПрейскуранта
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|ГДЕ
		|	ИтоговаяТаблица.НоменклатураПрейскуранта <> ЗНАЧЕНИЕ(Справочник.Прейскурант.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФискальныеРегистраторы.Организация КАК Организация,
		|	ФискальныеРегистраторы.Ссылка КАК КассаККМ,
		|	ФискальныеРегистраторы.УзелИнформационнойБазы КАК УзелИнформационнойБазы,
		|	ФискальныеРегистраторы.ПравилоОбменаСОборудованием КАК ПравилоОбмена
		|ПОМЕСТИТЬ КассыККМ
		|ИЗ
		|	Справочник.ФискальныеРегистраторы КАК ФискальныеРегистраторы
		|ГДЕ
		|	ФискальныеРегистраторы.ТипОборудования = 1
		|	И ФискальныеРегистраторы.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованием.ПустаяСсылка)
		|	И ФискальныеРегистраторы.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КассыККМ.УзелИнформационнойБазы КАК УзелИнформационнойБазы,
		|	СписокНоменклатурыПрейскуранта.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта
		|ИЗ
		|	КассыККМ КАК КассыККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписокНоменклатурыПрейскуранта КАК СписокНоменклатурыПрейскуранта
		|		ПО КассыККМ.Организация = СписокНоменклатурыПрейскуранта.Организация");		
		
		Запрос.УстановитьПараметр("Значение", Источник.Ссылка);
		Запрос.УстановитьПараметр("Организация", Источник.Организация);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.НоменклатураПрейскуранта) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Выборка.УзелИнформационнойБазы, Выборка.НоменклатураПрейскуранта);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли 	ТипИсточника = Тип("ДокументОбъект.ЗаявлениеНаВозвратПоЧекуККМ")
		Или 	ТипИсточника = Тип("ДокументОбъект.ЧекККМ") 
		Или		ТипИсточника = Тип("ДокументОбъект.ЧекККМНаВозврат") Тогда	
		Если ЗначениеЗаполнено(Источник.КассаККМ) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.КассаККМ, "ВестиКонтрольОстатковТоваровНаСкладеТорговойТочки") Тогда 
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ФискальныеРегистраторы.Организация КАК Организация,
			               |	ФискальныеРегистраторы.УзелИнформационнойБазы КАК УзелИнформационнойБазы
			               |ПОМЕСТИТЬ ВТУзлыОбмена
			               |ИЗ
			               |	Справочник.ФискальныеРегистраторы КАК ФискальныеРегистраторы
			               |ГДЕ
			               |	ФискальныеРегистраторы.ТипОборудования = 1
			               |	И ФискальныеРегистраторы.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованием.ПустаяСсылка)
			               |	И ФискальныеРегистраторы.Организация = &Организация
			               |	И ФискальныеРегистраторы.ЦМО = &ЦМО
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	Прейскурант.Ссылка КАК НоменклатураПрейскуранта,
			               |	Прейскурант.Организация КАК Организация
			               |ПОМЕСТИТЬ ВТПрейскурант
			               |ИЗ
			               |	Справочник.Прейскурант КАК Прейскурант
			               |ГДЕ
			               |	Прейскурант.СнятаСПродажи = ЛОЖЬ
			               |	И Прейскурант.Ссылка В(&НоменклатураПрейскуранта)
			               |	И НЕ Прейскурант.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслугРабот)
			               |	И Прейскурант.Организация = &Организация
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТПрейскурант.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта,
			               |	ВТУзлыОбмена.УзелИнформационнойБазы КАК УзелИнформационнойБазы
			               |ИЗ
			               |	ВТУзлыОбмена КАК ВТУзлыОбмена
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрейскурант КАК ВТПрейскурант
			               |		ПО ВТУзлыОбмена.Организация = ВТПрейскурант.Организация";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Организация"					, Источник.Организация);
			Запрос.УстановитьПараметр("НоменклатураПрейскуранта"	, Источник.ТоварыРаботыУслуги.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("ТипыНоменклатурыУслугРабот"	, РозничныеПродажиБГУ.ТипыУслугРабот());
			Запрос.УстановитьПараметр("ЦМО"							, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.КассаККМ, "ЦМО"));
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			Пока РезультатЗапроса.Следующий() Цикл 
				Если ЗначениеЗаполнено(РезультатЗапроса.НоменклатураПрейскуранта) Тогда 
					ПланыОбмена.ЗарегистрироватьИзменения(РезультатЗапроса.УзелИнформационнойБазы, РезультатЗапроса.НоменклатураПрейскуранта);	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос();
		ЦМО = Новый СписокЗначений;
		Если 		ТипИсточника = Тип("ДокументОбъект.АктПриемкиМ7")
			Или		ТипИсточника = Тип("ДокументОбъект.ПоступлениеМЗ") Тогда 
			РегистрироватьИзменения = Источник.ПоступлениеТоваровНаСкладТорговойТочки;
			ЦМО.Добавить(Источник.ЦМО);
			Запрос.УстановитьПараметр("Номенклатура", Источник.Материалы.ВыгрузитьКолонку("Номенклатура"));
		ИначеЕсли	ТипИсточника = Тип("ДокументОбъект.ТребованиеНакладная0315006") Тогда  
			РегистрироватьИзменения = Источник.ПоступлениеТоваровНаСкладТорговойТочки Или Источник.ВыбытиеТоваровСоСкладаТорговойТочки;
			Если Источник.ПоступлениеТоваровНаСкладТорговойТочки Тогда 
				ЦМО.Добавить(Источник.ЦМОПолучатель);
			КонецЕсли;	
			Если Источник.ВыбытиеТоваровСоСкладаТорговойТочки Тогда 
				ЦМО.Добавить(Источник.ЦМООтправитель);
			КонецЕсли;	
			Запрос.УстановитьПараметр("Номенклатура", Источник.Материалы.ВыгрузитьКолонку("Номенклатура"));
		ИначеЕсли	ТипИсточника = Тип("ДокументОбъект.ИзмененияОстатковТоваровВТорговойТочке") Тогда  
			РегистрироватьИзменения = Истина;
			ЦМО.Добавить(Источник.ЦМО);
			Запрос.УстановитьПараметр("Номенклатура", Источник.Товары.ВыгрузитьКолонку("Номенклатура"));
		Иначе
			Возврат;
		КонецЕсли;	
		
		Если РегистрироватьИзменения Тогда 
			ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	ФискальныеРегистраторы.Организация КАК Организация,
			               |	ФискальныеРегистраторы.УзелИнформационнойБазы КАК УзелИнформационнойБазы
			               |ПОМЕСТИТЬ ВТУзлыОбмена
			               |ИЗ
			               |	Справочник.ФискальныеРегистраторы КАК ФискальныеРегистраторы
			               |ГДЕ
			               |	ФискальныеРегистраторы.ТипОборудования = 1
			               |	И ФискальныеРегистраторы.УзелИнформационнойБазы <> ЗНАЧЕНИЕ(ПланОбмена.ОбменСПодключаемымОборудованием.ПустаяСсылка)
			               |	И ФискальныеРегистраторы.Организация = &Организация
			               |	И ФискальныеРегистраторы.ЦМО В(&ЦМО)
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	Прейскурант.Ссылка КАК НоменклатураПрейскуранта,
			               |	Прейскурант.Организация КАК Организация
			               |ПОМЕСТИТЬ ВТПрейскурант
			               |ИЗ
			               |	Справочник.Прейскурант КАК Прейскурант
			               |ГДЕ
			               |	Прейскурант.СнятаСПродажи = ЛОЖЬ
			               |	И Прейскурант.Номенклатура В(&Номенклатура)
			               |	И НЕ Прейскурант.Номенклатура.ТипНоменклатуры В (&ТипыНоменклатурыУслугРабот)
			               |	И Прейскурант.Организация = &Организация
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ВТПрейскурант.НоменклатураПрейскуранта КАК НоменклатураПрейскуранта,
			               |	ВТУзлыОбмена.УзелИнформационнойБазы КАК УзелИнформационнойБазы
			               |ИЗ
			               |	ВТУзлыОбмена КАК ВТУзлыОбмена
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПрейскурант КАК ВТПрейскурант
			               |		ПО ВТУзлыОбмена.Организация = ВТПрейскурант.Организация";
			
			Запрос.Текст = ТекстЗапроса;
			Запрос.УстановитьПараметр("Организация"					, Источник.Организация);
			Запрос.УстановитьПараметр("ТипыНоменклатурыУслугРабот"	, РозничныеПродажиБГУ.ТипыУслугРабот());
			Запрос.УстановитьПараметр("ЦМО"							, ЦМО);
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			Пока РезультатЗапроса.Следующий() Цикл 
				Если ЗначениеЗаполнено(РезультатЗапроса.НоменклатураПрейскуранта) Тогда 
					ПланыОбмена.ЗарегистрироватьИзменения(РезультатЗапроса.УзелИнформационнойБазы, РезультатЗапроса.НоменклатураПрейскуранта);	
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Создать узел обмена с подключаемым оборудованием Offline.
//
Процедура СоздатьУзелОбменаСОфлайнОборудованием(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.УзелИнформационнойБазы)
		И (Источник.ТипОборудования = 1) Тогда
		Источник.УзелИнформационнойБазы = ПолучитьУзелРИБ(Источник);
	КонецЕсли;
	
	Источник.ДополнительныеСвойства.Вставить("ИзмененоПравилоОбмена", Источник.ПравилоОбменаСОборудованием <> Источник.Ссылка.ПравилоОбменаСОборудованием);
	
КонецПроцедуры

// Очистить узел обмена с подключаемым оборудованием Offline.
//
Процедура ОчиститьУзелОбменаСОфлайнОборудованием(Источник, ОбъектКопирования) Экспорт
	
	Источник.УзелИнформационнойБазы = ПланыОбмена.ОбменСПодключаемымОборудованием.ПустаяСсылка();
	
КонецПроцедуры

// Зарегистрировать изменения при смене правила обмена подключаемого оборудования.
//
Процедура ЗарегистрироватьИзмененияПриСменеПравилаОбменаСОфлайнОборудованием(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если (Источник.ТипОборудования = 1)
		И Источник.ДополнительныеСвойства.ИзмененоПравилоОбмена Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ПланыОбмена.ЗарегистрироватьИзменения(Источник.УзелИнформационнойБазы, Метаданные.Справочники.Прейскурант);
		
	КонецЕсли;
	
КонецПроцедуры

// Функция создает узел для данного экземпляра подключаемого оборудования и возвращает ссылку на него.
// Применяется перед записью элемента справочника Подключаемое оборудование.
//
Функция ПолучитьУзелРИБ(ПодключаемоеОборудованиеОбъект) Экспорт
	
	УзелОбъект = ПланыОбмена.ОбменСПодключаемымОборудованием.СоздатьУзел();
	УзелОбъект.УстановитьНовыйКод();
	УзелОбъект.Наименование = ПодключаемоеОборудованиеОбъект.Наименование;
	УзелОбъект.Записать();
	
	Возврат УзелОбъект.Ссылка;
	
КонецФункции

#КонецОбласти