#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	ИнициализироватьЗапросыТаблиц(Запрос, НомераТаблиц);
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

КонецПроцедуры

Процедура ИнициализироватьЗапросыТаблиц(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("ПрослеживаемыеТовары", НомераТаблиц.Количество());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка.Организация КАК Организация,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.НФА КАК Номенклатура,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Комплектующее КАК Комплектующее,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.СтранаПроисхождения КАК СтранаПроисхождения,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.ВариантКомплекта КАК ВариантКомплекта,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.РНПТ КАК РНПТ,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Количество КАК Количество,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.СуммаБезНДС КАК СуммаБезНДС,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка.Дата КАК Период,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	Документ.СписаниеПрослеживаемыхНФА.ПрослеживаемыеНФА КАК СписаниеПрослеживаемыхНФАПрослеживаемыеНФА
	|ГДЕ
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка = &Ссылка
	|	И СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.НФА ССЫЛКА Справочник.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.НомерСтроки";
	
	НомераТаблиц.Вставить("ПрослеживаемыеОС", НомераТаблиц.Количество());
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка.Организация КАК Организация,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.НФА КАК ОсновноеСредство,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Комплектующее КАК Комплектующее,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.СтранаПроисхождения КАК СтранаПроисхождения,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.РНПТ КАК РНПТ,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Количество КАК Количество,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.СуммаБезНДС КАК СуммаБезНДС,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка.Дата КАК Период,
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка КАК Регистратор,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	Документ.СписаниеПрослеживаемыхНФА.ПрослеживаемыеНФА КАК СписаниеПрослеживаемыхНФАПрослеживаемыеНФА
	|ГДЕ
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.Ссылка = &Ссылка
	|	И СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.НФА ССЫЛКА Справочник.ОсновныеСредства
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписаниеПрослеживаемыхНФАПрослеживаемыеНФА.НомерСтроки";
	
КонецПроцедуры
	
#КонецОбласти

#Область ПрограммныйИнтерфейс   

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

#КонецОбласти

// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецЕсли
