
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	МассивКПС = Новый Массив;
	
	Для Каждого Стр Из Параметры.Объект.Перерегистрация Цикл
		МассивКПС.Добавить(Стр.КПСДт);
		МассивКПС.Добавить(Стр.КПСКт);
	КонецЦикла;
	
	МассивКПС = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивКПС);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КлассификационныеПризнакиСчетов.Ссылка КАК Ссылка,
	|	КлассификационныеПризнакиСчетов.Наименование КАК Наименование,
	|	КлассификационныеПризнакиСчетов.ВидПоказателя КАК ВидПоказателя,
	|	КлассификационныеПризнакиСчетов.УточнениеПоказателя КАК УточнениеПоказателя,
	|	КлассификационныеПризнакиСчетов.ДатаНачалаДействия КАК ДатаНачалаДействия,
	|	КлассификационныеПризнакиСчетов.ОкончаниеДействия КАК ОкончаниеДействия
	|ИЗ
	|	Справочник.КлассификационныеПризнакиСчетов КАК КлассификационныеПризнакиСчетов
	|ГДЕ
	|	КлассификационныеПризнакиСчетов.Ссылка В(&Ссылки)");
	
	Запрос.УстановитьПараметр("Ссылки", МассивКПС); 

	ТаблицаКПС.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ДатаЗамены = Дата(Год(Параметры.Объект.ФинансовыйГод) + 1, 1, 1);
	Организация = Параметры.Объект.Организация;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ПодборЗамены = Новый Соответствие;
	
	Для Каждого Стр Из ТаблицаКПС Цикл
		Если ЗначениеЗаполнено(Стр.СсылкаНовая) Тогда
			ПодборЗамены.Вставить(Стр.Ссылка, Стр.СсылкаНовая);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(ПодборЗамены);
	
КонецПроцедуры
