#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИспользоватьКонтрольИсполненияДоговоров = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	
	Если ИспользоватьКонтрольИсполненияДоговоров И Не Групповая Тогда
		
		РеквизитыДоговоров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
			ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(Начисления.ВыгрузитьКолонку("ДоговорКонтрагента")),
				"ВидДоговора,ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
		
		Для Каждого СтрокаТаблицы Из Начисления Цикл
			
			Если СтрокаТаблицы.АвтоматическиОтразитьВГрафикахИсполненияДоговоров Тогда
				
				ПризнакиСтатусаОперации = УчетДоходовРасходов.КлассифицироватьСтатусОперацииНачисленияДоходов(СтрокаТаблицы.СтатусОперации);
				Если ПризнакиСтатусаОперации.ЭтоНачислениеДоходовБудущихПериодов
					ИЛИ ПризнакиСтатусаОперации.ЭтоУточнениеДатыПризнанияДоходов
					ИЛИ ПризнакиСтатусаОперации.ЭтоУточнениеПредельнойДатыИсполнения
					ИЛИ ПризнакиСтатусаОперации.ЭтоУточнениеДатИсполнения
					ИЛИ ПризнакиСтатусаОперации.ЭтоНачислениеДоходовТекущегоПериода
					ИЛИ ПризнакиСтатусаОперации.ЭтоПризнаниеДоходовТекущегоПериода Тогда
					
					ВидДоговора = РеквизитыДоговоров[СтрокаТаблицы.ДоговорКонтрагента].ВидДоговора;
					ВестиГрафикПлатежей = РеквизитыДоговоров[СтрокаТаблицы.ДоговорКонтрагента].ВестиГрафикПлатежей;
					ВестиПланГрафикИсполнения = РеквизитыДоговоров[СтрокаТаблицы.ДоговорКонтрагента].ВестиПланГрафикИсполнения;
					
					Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПредоставленныйКредит Тогда
						Если НЕ (ВестиГрафикПлатежей) Тогда
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Для автоматического отражения в графиках исполнения, в том числе, учета задолженности в разрезе дат исполнения, следует установить признак ""График платежей"" в группе ""Вести графики исполнения"" в карточке договора ""%1"".'"),
									СтрокаТаблицы.ДоговорКонтрагента);
							ПолеКолонки = "Начисления[" + Формат(СтрокаТаблицы.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ДоговорКонтрагента";
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПолеКолонки, "Объект", Отказ);
						КонецЕсли;
					Иначе // С покупателем
						Если НЕ (ВестиГрафикПлатежей И ВестиПланГрафикИсполнения) Тогда
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Для автоматического отражения в графиках исполнения, в том числе, учета задолженности в разрезе дат исполнения, следует установить признаки ""График платежей"" и ""План-график реализации"" в группе ""Вести графики исполнения"" в карточке договора ""%1"".'"),
									СтрокаТаблицы.ДоговорКонтрагента);
							ПолеКолонки = "Начисления[" + Формат(СтрокаТаблицы.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ДоговорКонтрагента";
							ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПолеКолонки, "Объект", Отказ);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = Начисления.Итог("Сумма");
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Для Каждого Начисление Из Начисления Цикл
		Если Не ИспользоватьВалютныйУчет Тогда
			Начисление.Валюта = ВалютаРегламентированногоУчета;
		КонецЕсли;
		Если Начисление.Валюта = ВалютаРегламентированногоУчета Тогда
			Начисление.СуммаВВалюте = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли