
#Область ПрограммныйИнтерфейс

// Предназначена для внесения изменений в форму Обслуживание обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура ОбслуживаниеПриСозданииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы; 
	Команды = Форма.Команды;
	
	Элементы.ПравилаПроверкиУчета.Заголовок = НСтр("ru = 'Правила проверки состояния системы'");
	
	Команда = Команды.Добавить("ОбработкаЗаменаЗначенийОткрыть");
	Команда.Заголовок = НСтр("ru = 'Поиск и замена значений'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ОбработкаЗаменаЗначений", Тип("КнопкаФормы"), Элементы.ГруппаОбработкаГрупповоеИзменениеОбъектов);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ОбработкаЗаменаЗначенийОткрыть";
	
	
	Команда = Команды.Добавить("ОбработкаСверткаИнформационнойБазыОткрыть");
	Команда.Заголовок = НСтр("ru = 'Свертка информационной базы'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ОбработкаСверткаИнформационнойБазы", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ОбработкаСверткаИнформационнойБазыОткрыть";
	
	
	Команда = Команды.Добавить("ОбработкаЗаменаТиповыхОперацийДопРеквизитовОткрыть");
	Команда.Заголовок = НСтр("ru = 'Замена типовых операций и реквизитов операций'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ОбработкаЗаменаТиповыхОперацийДопРеквизитов", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ОбработкаЗаменаТиповыхОперацийДопРеквизитовОткрыть";
	
	
	Команда = Команды.Добавить("ПомощникПереносаОстатковМеждуСчетамиОткрыть");
	Команда.Заголовок = НСтр("ru = 'Помощник переноса остатков между счетами'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ПомощникПереносаОстатковМеждуСчетами", Тип("КнопкаФормы"), Элементы.ГруппаОбработкаГрупповоеИзменениеОбъектов);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ПомощникПереносаОстатковМеждуСчетамиОткрыть";
	
	
	Команда = Команды.Добавить("ПомощникПереносаОстатковУстаревшихСчетовОткрыть");
	Команда.Заголовок = НСтр("ru = 'Помощник переноса остатков с устаревших счетов'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";	 
	
	Элемент = Элементы.Добавить("ПомощникПереносаОстатковУстаревшихСчетов", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ПомощникПереносаОстатковУстаревшихСчетовОткрыть";
	
	
	Команда = Команды.Добавить("ЗаполнениеРегистровОСОткрыть");
	Команда.Заголовок = НСтр("ru = 'Заполнение регистров ОС'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ЗаполнениеРегистровОС", Тип("КнопкаФормы"), Элементы.ГруппаОбработкаГрупповоеИзменениеОбъектов);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ЗаполнениеРегистровОСОткрыть";
	
	
	Команда = Команды.Добавить("КорректировкаНезаполненныхСубконтоВПроводкахОткрыть");
	Команда.Заголовок = НСтр("ru = 'Корректировка незаполненных субконто в проводках'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("КорректировкаНезаполненныхСубконтоВПроводках", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "КорректировкаНезаполненныхСубконтоВПроводкахОткрыть";
	
	
	Команда = Команды.Добавить("ПроверкаИспользованияПодразделенийВалютыОткрыть");
	Команда.Заголовок = НСтр("ru = 'Проверка учета по подразделениям и валютного учета'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ПроверкаИспользованияПодразделенийВалюты", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ПроверкаИспользованияПодразделенийВалютыОткрыть";

	
	Команда = Команды.Добавить("КорректировкаАналитикиНалоговогоУчетаОткрыть");
	Команда.Заголовок = НСтр("ru = 'Корректировка аналитики учета материальных запасов (НУ)'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("КорректировкаАналитикиНалоговогоУчета", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "КорректировкаАналитикиНалоговогоУчетаОткрыть";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		
		Команда = Команды.Добавить("ПомощникЗаполненияПодразделенийВПроводкахОткрыть");
		Команда.Заголовок = НСтр("ru = 'Помощник заполнения подразделений в проводках'");
		Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
		
		Элемент = Элементы.Добавить("ПомощникЗаполненияПодразделенийВПроводках", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = "ПомощникЗаполненияПодразделенийВПроводкахОткрыть";
		
	КонецЕсли;
	
	Команда = Команды.Добавить("ЗаменаУстаревших205ВАвансовыхСчетахФактурахОткрыть");
	Команда.Заголовок = НСтр("ru = 'Замена устаревших счетов 205.00 в авансовых счетах-фактурах'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ЗаменаУстаревших205ВАвансовыхСчетахФактурах", Тип("КнопкаФормы"), Элементы.ГруппаПоискИУдалениеДублей);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ЗаменаУстаревших205ВАвансовыхСчетахФактурахОткрыть";
	
	Команда = Команды.Добавить("КонсольЗапросовОткрыть");
	Команда.Заголовок = НСтр("ru = 'Консоль запросов'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	Команда.Подсказка = "Выполнение запросов и просмотр результатов выполнения в режиме 1С:Предприятие.";
	
	Элемент = Элементы.Добавить("КонсольЗапросов", Тип("КнопкаФормы"), Элементы.ГруппаОтчетыАдминистратора);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "КонсольЗапросовОткрыть";
	Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ОбщиеНастройки обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура ОбщиеНастройкиПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму Обслуживание обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы; 
	
	ЭлементГруппа = Элементы.Найти("РасширеннаяНастройка");
	Если ЭлементГруппа = Неопределено Тогда
		ЭлементГруппа = Элементы.Вставить("РасширеннаяНастройка", Тип("ГруппаФормы"),, Элементы.ГруппаПользователи);
	КонецЕсли;	
	ЭлементГруппа.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементГруппа.РастягиватьПоГоризонтали 	= Истина;
	ЭлементГруппа.Отображение 				= ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ЭлементГруппа.ОтображатьЗаголовок 		= Ложь;
	
	Элемент = Элементы.Найти("РасширеннаяНастройкаПравДоступа");
	Если Элемент = Неопределено Тогда
		Элемент = Элементы.Добавить("РасширеннаяНастройкаПравДоступа", Тип("ПолеФормы"), ЭлементГруппа);
	КонецЕсли;	
	Элемент.Вид = ВидПоляФормы.ПолеФлажка;
	Элемент.ПутьКДанным = "НаборКонстант.РасширеннаяНастройкаПравДоступа";
	Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
	Элемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииРеквизита");
	Элемент.ОтображениеПодсказки =ОтображениеПодсказки.ОтображатьСнизу; 
	
	Подсказка = Элемент.РасширеннаяПодсказка;
	Подсказка.Заголовок = НСтр("ru = 'Объединение пользователей в группы, назначение прав
	|доступа по группам пользователей, выполняющих однотипные функции.'");
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ИнтернетПоддержкаИСервисы обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура ИнтернетПоддержкаИСервисыПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму Органайзер обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура ОрганайзерПриСозданииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		
		ЭлементГруппа = Элементы.Найти("ГруппаПроцессыОбработкиДокументов");
		Если ЭлементГруппа = Неопределено Тогда
			ЭлементГруппа = Элементы.Вставить("ГруппаПроцессыОбработкиДокументов", Тип("ГруппаФормы"));
		КонецЕсли;
		
		ЭлементГруппа.Заголовок = НСтр("ru = 'Процессы обработки документов'");
		ЭлементГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		ЭлементГруппа.ОтображатьОтступСлева = Истина;
		ЭлементГруппа.ОтображатьЗаголовок = Истина;
		ЭлементГруппа.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		ЭлементГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ЭлементГруппа.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		
		ЭлементГруппаЛевая = Элементы.Вставить("ГруппаПроцессыОбработкиДокументовЛевая", Тип("ГруппаФормы"), ЭлементГруппа);
		ЭлементГруппаЛевая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГруппаЛевая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ЭлементГруппаЛевая.ОтображатьЗаголовок = Ложь;
		ЭлементГруппаЛевая.РастягиватьПоГоризонтали = Ложь;
		ЭлементГруппаЛевая.Ширина = 43;
		
		// В версии КОРП константа всегда включена
		Если НЕ ВариантыПриложений.ЭтоВерсияКОРП() Тогда
			
			Элемент = Элементы.Добавить("ИспользоватьПроцессыОбработкиДокументов", Тип("ПолеФормы"), ЭлементГруппаЛевая);
			Элемент.Заголовок = НСтр("ru = 'Процессы обработки документов'");
			Элемент.Вид = ВидПоляФормы.ПолеФлажка;
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			Элемент.ПутьКДанным = "НаборКонстант.ИспользоватьПроцессыОбработкиДокументов";
			Элемент.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
			Элемент.РасширеннаяПодсказка.Заголовок = НСтр(
				"ru = 'Организация поэтапной обработки документов в соответствии с настроенными шаблонами процессов'");
			
			Элемент.УстановитьДействие("ПриИзменении","Подключаемый_ПриИзмененииРеквизита");
			
		Иначе
			
			ЭлементГруппаЛевая.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
			ЭлементГруппаЛевая.РасширеннаяПодсказка.Заголовок = НСтр(
				"ru = 'Организация поэтапной обработки документов в соответствии с настроенными шаблонами процессов'");
			
		КонецЕсли;
		
		Команда = Команды.Добавить("НастройкиПроцессовОбработкиДокументов");
		Команда.Заголовок = НСтр("ru = 'Настройки процессов обработки документов'");
		Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
		
		Элемент = Элементы.Добавить("НастройкиПроцессовОбработкиДокументов", Тип("КнопкаФормы"), ЭлементГруппаЛевая);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = "НастройкиПроцессовОбработкиДокументов";
		Элемент.Доступность = Форма.НаборКонстант.ИспользоватьПроцессыОбработкиДокументов;
		
		// В версии КОРП для этих объектов есть отдельная подсистема
		Если НЕ ВариантыПриложений.ЭтоВерсияКОРП() Тогда
			
			ЭлементГруппаПравая = Элементы.Вставить("ГруппаПроцессыОбработкиДокументовПравая", Тип("ГруппаФормы"), ЭлементГруппа);
			ЭлементГруппаПравая.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ЭлементГруппаПравая.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			ЭлементГруппаПравая.ОтображатьЗаголовок = Ложь;
			ЭлементГруппаПравая.РастягиватьПоГоризонтали = Ложь;
			ЭлементГруппаПравая.Ширина = 43;
			
			Команда = Команды.Добавить("ОткрытьСправочникСтатусыДокументов");
			Команда.Заголовок = НСтр("ru = 'Статусы документов'");
			Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
			
			Элемент = Элементы.Добавить("ОткрытьСправочникСтатусыДокументов", Тип("КнопкаФормы"), ЭлементГруппаПравая);
			Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
			Элемент.ИмяКоманды = "ОткрытьСправочникСтатусыДокументов";
			Элемент.Доступность = Форма.НаборКонстант.ИспользоватьПроцессыОбработкиДокументов;
			
			Команда = Команды.Добавить("ОткрытьСправочникЭтапыПроцессов");
			Команда.Заголовок = НСтр("ru = 'Этапы процессов'");
			Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
			
			Элемент = Элементы.Добавить("ОткрытьСправочникЭтапыПроцессов", Тип("КнопкаФормы"), ЭлементГруппаПравая);
			Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
			Элемент.ИмяКоманды = "ОткрытьСправочникЭтапыПроцессов";
			Элемент.Доступность = Форма.НаборКонстант.ИспользоватьПроцессыОбработкиДокументов;
			
			Команда = Команды.Добавить("ОткрытьСправочникШаблоныПроцессов");
			Команда.Заголовок = НСтр("ru = 'Шаблоны процессов'");
			Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
			
			Элемент = Элементы.Добавить("ОткрытьСправочникШаблоныПроцессов", Тип("КнопкаФормы"), ЭлементГруппаПравая);
			Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
			Элемент.ИмяКоманды = "ОткрытьСправочникШаблоныПроцессов";
			Элемент.Доступность = Форма.НаборКонстант.ИспользоватьПроцессыОбработкиДокументов;
			
			Команда = Команды.Добавить("ОткрытьСправочникВидыДополнительныхЗаданий");
			Команда.Заголовок = НСтр("ru = 'Виды дополнительных заданий'");
			Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
			
			Элемент = Элементы.Добавить("ОткрытьСправочникВидыДополнительныхЗаданий", Тип("КнопкаФормы"), ЭлементГруппаПравая);
			Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
			Элемент.ИмяКоманды = "ОткрытьСправочникВидыДополнительныхЗаданий";
			Элемент.Доступность = Форма.НаборКонстант.ИспользоватьПроцессыОбработкиДокументов;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Предназначена для внесения изменений в форму СинхронизацияДанных обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура СинхронизацияДанныхПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму НастройкиРаботыСФайлами обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура НастройкиРаботыСФайламиПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Предназначена для внесения изменений в форму ПечатныеФормыОтчетыИОбработки обработки
// ПанельАдминистрированияБСП без снятия формы с поддержки.
//
// Параметры:
//  Форма - УправляемаяФорма - для внесения изменений.
//
Процедура ПечатныеФормыОтчетыИОбработкиПриСозданииНаСервере(Форма) Экспорт
	
	Элементы = Форма.Элементы; 
	Команды = Форма.Команды;
	
	ЭлементГруппа = Элементы.Найти("ГруппаНастройкаКолонтитулов");
	Если НЕ ЭлементГруппа = Неопределено Тогда
		ЭлементГруппа.Видимость = Ложь;
	КонецЕсли;	
	
	Команда = Команды.Добавить("ИнструкцияПоСозданиюФаксимильнойПодписиИПечатиБГУ");
	Команда.Заголовок = НСтр("ru = 'Как сделать факсимильную подпись и печать'");
	Команда.Действие = "Подключаемый_ВыполнитьКомандуБГУ";
	
	Элемент = Элементы.Добавить("ИнструкцияПоСозданиюФаксимильнойПодписиИПечатиБГУ", Тип("КнопкаФормы"), Элементы.ГруппаМакетыПечатныхФорм);
	Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
	Элемент.ИмяКоманды = "ИнструкцияПоСозданиюФаксимильнойПодписиИПечатиБГУ";
	Элемент.Шрифт = Новый Шрифт(,,,Истина,,,);
	Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
	
	ЭлементЯзыки = Элементы.Найти("СправочникЯзыкиПечатныхФормОткрытьСписок");
	ЭлементЯзыки.Видимость = Ложь; 
	
	ЭлементПеревод = Элементы.Найти("ГруппаАвтоматическийПеревод");
	ЭлементПеревод.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти