
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Сообщение.Заголовок = Новый ФорматированнаяСтрока(СообщениеПользователю());
	
	Если Параметры.Событие <> "ТребуютсяДопДействияПодробнее" Тогда // Общее сообщение о необходимости доп.действий.
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, Период, ИФО, КФО");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НавигационнаяСсылка = "ИзменениеСтоимостиАмортизацииОСГрупповойУчет_КорректировкаРегистров" Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		ЗначенияЗаполнения.Вставить("Дата",        Период);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.КорректировкаРегистров.ФормаОбъекта", ПараметрыФормы);
		
	ИначеЕсли НавигационнаяСсылка = "ИзменениеСтоимостиАмортизацииОСГрупповойУчет_ИзменениеПараметровАмортизации" Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		ЗначенияЗаполнения.Вставить("Дата",        Период);
		ЗначенияЗаполнения.Вставить("ИФО",         ИФО);
		ЗначенияЗаполнения.Вставить("КФО",         КФО);
		
		ЗначенияЗаполнения.Вставить("ОтражатьВБухгалтерскомУчете", Истина);
		ЗначенияЗаполнения.Вставить("ОтражатьВНалоговомУчете",     Ложь);
		ЗначенияЗаполнения.Вставить("ИзменятьРасчетАмортизации",   Истина);
		
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ИзменениеПараметровАмортизации.ФормаОбъекта", ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СообщениеПользователю()
	
	СообщениеПользователю = Новый Массив;
	
	Если Параметры.Событие = "ТребуютсяДопДействияПодробнее" Тогда // Общее сообщение о необходимости доп.действий.
		
		// Заголовок формы.
		Заголовок = НСтр("ru='Требуются дополнительные действия'");
		
		// Описание проблемы.
		СтрокиПроблемы = Новый Массив;
		СтрокиПроблемы.Добавить(Новый ФорматированнаяСтрока(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Для корректного отражения %1 № %2 в учете требуется выполнить дополнительные действия.'"),
			?(Параметры.КоличествоСтрокСДопДействиями = 1, НСтр("ru='проводки'"), НСтр("ru='проводок'")),
			Параметры.СписокСтрокСДопДействиями)));
		ТекстПроблемы = Новый ФорматированнаяСтрока(СтрокиПроблемы);
		
		// Описание решения проблемы.
		СтрокиРешения = Новый Массив;
		СтрокиРешения.Добавить(Новый ФорматированнаяСтрока(
			НСтр("ru='Подробное описание необходимых действий можно получить, нажав на восклицательный знак в соответствующей проводке.'")));
		ТекстРешения = Новый ФорматированнаяСтрока(СтрокиРешения);
		
	ИначеЕсли Параметры.Событие = "ИзменениеСтоимостиАмортизацииОСГрупповойУчет" Тогда
		
		// Заголовок формы.
		Заголовок = НСтр("ru='Необходимо скорректировать регистры учета ОС'");
		
		ОсновноеСредство = Параметры["Субконто" + Параметры.ДтКт + "1"];
		
		// Описание проблемы.
		СтрокиПроблемы = Новый Массив;
		СтрокиПроблемы.Добавить(Новый ФорматированнаяСтрока(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='В проводке № %1 указан объект ""%2"", по которому ведется групповой учет.
				|Изменение стоимости и/или начисленной амортизации и/или обесценения по таким объектам не отражается в регистрах учета ОС автоматически.'"),
			Параметры.НомерСтроки, ОсновноеСредство)));
		ТекстПроблемы = Новый ФорматированнаяСтрока(СтрокиПроблемы);
		
		// Описание решения проблемы.
		СтрокиРешения = Новый Массив;
		СтрокиРешения.Добавить(Новый ФорматированнаяСтрока(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Необходимо самостоятельно скорректировать стоимость и/или сумму начисленной амортизации и/или сумму обесценения по объекту ""%1"" в регистрах:
				| - Стоимость объектов ОС, НМА, НПА
				| - Амортизация, обесценение объектов ОС, НМА, НПА
				|документом'"),
			ОсновноеСредство)));
		СтрокиРешения.Добавить(НСтр("ru=' '"));
		СтрокиРешения.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Корректировка регистров'"),,,,
			"ИзменениеСтоимостиАмортизацииОСГрупповойУчет_КорректировкаРегистров"));
		СтрокиРешения.Добавить(НСтр("ru='.'"));
		ТекстРешения = Новый ФорматированнаяСтрока(СтрокиРешения);
		
	ИначеЕсли Параметры.Событие = "ИзменениеСтоимостиАмортизацииОСЛинейныйМетод" Тогда
		
		// Заголовок формы.
		Заголовок = НСтр("ru='Необходимо скорректировать параметры начисления амортизации'");
		
		ОсновноеСредство = Параметры["Субконто" + Параметры.ДтКт + "1"];
		
		// Описание проблемы.
		СтрокиПроблемы = Новый Массив;
		СтрокиПроблемы.Добавить(Новый ФорматированнаяСтрока(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='В проводке № %1 указан объект ""%2"", по которому производится начисление амортизации по норме амортизации.
				|При изменении стоимости и/или начисленной амортизации и/или суммы обесценения норма амортизации не корректируется автоматически.'"),
			Параметры.НомерСтроки, ОсновноеСредство)));
		ТекстПроблемы = Новый ФорматированнаяСтрока(СтрокиПроблемы);
		
		// Описание решения проблемы.
		СтрокиРешения = Новый Массив;
		СтрокиРешения.Добавить(Новый ФорматированнаяСтрока(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Необходимо скорректировать параметры начисления амортизации по объекту ""%1"" в регистре ""Расчет амортизации ОС"" самостоятельно, документом'"),
			ОсновноеСредство)));
		СтрокиРешения.Добавить(НСтр("ru=' '"));
		СтрокиРешения.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Изменение параметров амортизации ОС и НМА'"),,,,
			"ИзменениеСтоимостиАмортизацииОСГрупповойУчет_ИзменениеПараметровАмортизации"));
		СтрокиРешения.Добавить(НСтр("ru='.'"));
		ТекстРешения = Новый ФорматированнаяСтрока(СтрокиРешения);
		
	Иначе
		Возврат СообщениеПользователю;
	КонецЕсли;
	
	СообщениеПользователю.Добавить(Новый ФорматированнаяСтрока(ТекстПроблемы, ШрифтыСтиля.ШрифтТекста));
	СообщениеПользователю.Добавить(Символы.ПС);
	СообщениеПользователю.Добавить(Символы.ПС);
	СообщениеПользователю.Добавить(Новый ФорматированнаяСтрока(ТекстРешения, ШрифтыСтиля.ШрифтТекста));
	Возврат СообщениеПользователю;
	
КонецФункции

#КонецОбласти
