////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	УстановитьПредставление();
	
	ЗаполнитьДеревоОперандов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВыполнитьНастройкуЭлементовФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.РедактированиеСвязейПараметровВыбора" Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
			Объект.СвязиПараметровВыбора		= ВыбранноеЗначение[0].Значение;
			ПредставлениеСвязиПараметровВыбора	= ВыбранноеЗначение[0].Представление;
			Модифицированность = Истина;
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаНастройкиОтбора" Тогда 	
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			Объект.ОтборЭлементов	= ВыбранноеЗначение.НастройкиОтбора;
			ПредставлениеОтбора		= ВыбранноеЗначение.ПредставлениеОтбора;
			Модифицированность = Истина;			
		КонецЕсли;
		
		СписокВыбораСвязи();
				
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.РеквизитыСведенийОбИмуществе.Форма.ФормаСвязейЗначений" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			Объект.ОтборЗначений = ВыбранноеЗначение.Отбор;
			ПредставлениеОтбораЗначений = ВыбранноеЗначение.Представление;
			Модифицированность = Истина;			
		КонецЕсли;		
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Элементы.СтраницаСписокВыбора.Доступность И Объект.СписокВыбора.Количество() > 0 Тогда
		Объект.СписокВыбора.Очистить();
	КонецЕсли;
	
	Если Не Элементы.СтраницаФормулы.Доступность Тогда
		Объект.ФормулаЗаполнение	 = "";
		Объект.ФормулаОбязательность = "";
		Объект.ФормулаНедоступность	 = "";
		Объект.ФормулаКомментарий	 = "";
		Объект.Обязательное			 = Ложь;
		Объект.Недоступное			 = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не Элементы.ТипРеквизита.ТолькоПросмотр И Не ЗначениеЗаполнено(Объект.ТипРеквизита) Тогда
		
		Отказ = Истина;
		
		ТекстСообщения = Нстр("ru = 'Поле ""%1"" не заполнено.'");
		ИмяРеквизита = ?(ЗначениеЗаполнено(Элементы.ТипРеквизита.Заголовок), Элементы.ТипРеквизита.Заголовок, Метаданные.Справочники.РеквизитыСведенийОбИмуществе.Реквизиты.ТипРеквизита.Синоним);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ИмяРеквизита);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ТипРеквизита");
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Закладка "Основные сведения"

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	РеестрИмуществаКлиентСервер.УстановитьИмяДляФормулы(Объект.ИмяДляФормулы, Объект.Наименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяДляФормулыПриИзменении(Элемент)
	
	РеестрИмуществаКлиентСервер.УстановитьИмяДляФормулы(Объект.ИмяДляФормулы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРеквизитаПриИзменении(Элемент)
	
	ТипРеквизита = ПолучитьТип(Объект.ТипРеквизита);
	
	РастягиватьПоВертикалиСписокВыбора();
	РастягиватьПоГоризонталиСписокВыбора();
	ТипРеквизитаДоступность();
	СписокВыбораОграничение(ТипРеквизита);
	ФормулыОграничение();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРеквизитаПриИзменении(Элемент)
	
	ТипРеквизита = ПолучитьТип(Объект.ТипРеквизита);
	
	ВидРеквизитаСписокВыбора(ТипРеквизита);
	СписокВыбораОграничение(ТипРеквизита);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеСвязиПараметровВыбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ТипРеквизита.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Связи параметров выбора указываются после выбора типа реквизита'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ТипРеквизита");
		Возврат;
	КонецЕсли;
		
	ПараметрыФормы = ПолучитьПараметрыФормы(); 										
	ОткрытьФорму("ОбщаяФорма.РедактированиеСвязейПараметровВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

 &НаКлиенте
Процедура ПредставлениеСвязиПараметровВыбораОчистка(Элемент, СтандартнаяОбработка)
	Объект.СвязиПараметровВыбора = "";
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭлементовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ТипРеквизита.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Отбор элементов указывается после выбора типа реквизита'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ТипРеквизита");
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый Массив;
	СписокПолей.Добавить("ВерсияДанных");
	СписокПолей.Добавить("Предопределенный");
	СписокПолей.Добавить("ИмяПредопределенныхДанных");
	
	ПараметрыФормы = Новый Структура("Реквизит, НастройкиОтбора, ИсключенныеПоля", Объект.ТипРеквизита, Объект.ОтборЭлементов, СписокПолей);	
	ОткрытьФорму("ОбщаяФорма.ФормаНастройкиОтбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЭлементовОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ОтборЭлементов = "";
	СписокВыбораСвязи();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЗначенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ТипРеквизита.Пустая() Тогда
		ТекстСообщения = НСтр("ru = 'Отбор значений указывается после выбора типа реквизита'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ТипРеквизита");
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Реквизит,Настройки,ОтборЭлементов", Объект.ТипРеквизита, Объект.ОтборЗначений,  Объект.ОтборЭлементов);
	
	ОткрытьФорму("Справочник.РеквизитыСведенийОбИмуществе.Форма.ФормаСвязейЗначений", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОтборЗначенийОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ОтборЗначений = "";
	Модифицированность = Истина;

КонецПроцедуры

// Закладка "Формулы"

&НаКлиенте
Процедура ОбязательноеПриИзменении(Элемент)
	
	УправлениеДоступностьюФормулойОбязательность();
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура НедоступноеПриИзменении(Элемент)
	
	УправлениеДоступностьюФормулойНедоступность();
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперандыФормулНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	#Если ВебКлиент Тогда
		Выполнение = Ложь;
		Возврат;
	#КонецЕсли
	
	ЗначениеПеретаскивания = ПараметрыПеретаскивания.Значение;
	Если ТипЗнч(ЗначениеПеретаскивания) = Тип("Массив") И ЗначениеПеретаскивания.Количество()>0 Тогда
		ТекущееЗначение = ОперандыФормул.НайтиПоИдентификатору(ЗначениеПеретаскивания[0]);
	ИначеЕсли ТипЗнч(ЗначениеПеретаскивания) = Тип("Число") Тогда
		ТекущееЗначение = ОперандыФормул.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
	Иначе
		Выполнение = Ложь;	
	КонецЕсли;
	Если ТекущееЗначение <> Неопределено Тогда
		ПараметрыПеретаскивания.Значение = ТекущееЗначение.ИмяДляФормулы;
	Иначе
		Выполнение = Ложь;
	КонецЕсли;                                                                        
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСтраницыФормулыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ДобавитьВФормулу(Команда)
	
	ТекущиеДанные = Элементы.ОперандыФормул.ТекущиеДанные;
	ИмяЭлемента = Сред(Элементы.СтраницаСтраницыФормулы.ТекущаяСтраница.Имя, 9);
	Если ТекущиеДанные <> Неопределено Тогда
		Объект[ИмяЭлемента] = Объект[ИмяЭлемента] + ТекущиеДанные.ИмяДляФормулы;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПустоеЗначение(Команда)
	
	ТекущиеДанные = Элементы.СписокВыбора.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Значение = Неопределено;	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Справочники.РеквизитыСведенийОбИмуществе.УстановитьУсловноеОформлениеФормы(УсловноеОформление);
		
	// Представление пустого значения элемента списка выбора
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокВыбораЗначение");
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.СписокВыбора.Значение");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Неопределено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "<Пустое значение>");
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоОперандов()
	
	//Дерево = РеквизитФормыВЗначение("ОперандыФормул");
	Дерево = Справочники.РеквизитыСведенийОбИмуществе.ЗаполнитьДеревоОперандов(Объект); //Объект.Ссылка, Объект.Владелец);	
	ЗначениеВРеквизитФормы(Дерево, "ОперандыФормул");
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТип(СсылкаОбъекта)
	
	ТипРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаОбъекта, "ТипЗначения");
	
	Возврат ТипРеквизита;
	
КонецФункции

&НаСервере
Процедура УстановитьПредставление()
	
	Если НЕ ПустаяСтрока(Объект.СвязиПараметровВыбора) Тогда
		
		Попытка	
			СвязиПараметровВыбораЗначение = ЗначениеИзСтрокиВнутр(Объект.СвязиПараметровВыбора);	
		Исключение		
			СвязиПараметровВыбораЗначение = Неопределено;		
		КонецПопытки;
		
		ТекстСвязиПараметровВыбора = "";
		Если ТипЗнч(СвязиПараметровВыбораЗначение) = Тип("Массив") Тогда
			Для Каждого ТекСвязь Из СвязиПараметровВыбораЗначение Цикл			
				ТекстСвязиПараметровВыбора = ТекстСвязиПараметровВыбора + ТекСвязь.Имя+"("+ТекСвязь.Реквизит+"), ";		
			КонецЦикла; 
			Если СтрДлина(ТекстСвязиПараметровВыбора)>2 Тогда
				ТекстСвязиПараметровВыбора = Лев(ТекстСвязиПараметровВыбора, СтрДлина(ТекстСвязиПараметровВыбора)-2);
			КонецЕсли;
		КонецЕсли;	
		
		ПредставлениеСвязиПараметровВыбора = ТекстСвязиПараметровВыбора;
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.ОтборЭлементов) Тогда
		ПараметрыНастройки = Новый Структура("Реквизит,НастройкиОтбора", Объект.ТипРеквизита, Объект.ОтборЭлементов);
		ОбщегоНазначенияБГУ.ИнициализироватьОтборКомпоновщикаНастроек(ПараметрыНастройки, ПредставлениеОтбора);		
	КонецЕсли;
	
	Если Не ПустаяСтрока(Объект.ОтборЗначений) Тогда
		//ПредставлениеОтбораЗначений = ПолучитьПредставлениеСвязей(Объект.ОтборЗначений);
		ПараметрыСвязей = Новый Структура("Реквизит,Настройки,ОтборЭлементов", Объект.ТипРеквизита, Объект.ОтборЗначений, Объект.ОтборЭлементов);
		ПредставлениеОтбораЗначений = Справочники.РеквизитыСведенийОбИмуществе.ПолучитьПредставлениеСвязей(ПараметрыСвязей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуЭлементовФормы()
	
	ТипЗначения = ПолучитьТип(Объект.ТипРеквизита);
	
	ВидРеквизитаСписокВыбора(ТипЗначения);
	ПоложениеЗаголовкаСписокВыбора();
	РастягиватьПоВертикалиСписокВыбора();
	РастягиватьПоГоризонталиСписокВыбора();
	ТипРеквизитаДоступность();
	КнопкаРегулированияСписокВыбора();
	КнопкаОткрытияСписокВыбора();	
	БыстрыйВыборСписокВыбора();
	СписокВыбораОграничение(ТипЗначения);
	ФормулыОграничение();
	СписокВыбораСвязи();	
	
	УправлениеДоступностьюФормулойОбязательность();
	УправлениеДоступностьюФормулойНедоступность();
	УправлениеДоступностьюКнопкиДобавитьВФормулу();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидРеквизитаСписокВыбора(ТипЗначения)
	
	Список = Новый СписокЗначений;
	
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеВвода"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеНадписи"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеФлажка"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеПереключателя"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ДекорацияНадпись"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.СписокЗначенийПолеВвода"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.СписокЗначенийПолеНадписи"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.СписокЗначенийТаблица"));
	
	Если ТипЗначения <> Неопределено И ТипЗначения.СодержитТип(Тип("Строка")) Тогда
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Адрес"));
		Список.Добавить(ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Идентификатор"));
	КонецЕсли;
	
	РеестрИмуществаКлиентСервер.УстановитьСписокВыбораИЗначениеПоСписку(Элементы.ВидРеквизита, Объект.ВидРеквизита, Список, Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоложениеЗаголовкаСписокВыбора() Экспорт
	
	Список = Новый СписокЗначений;	
	
	Список.Добавить(1, "Нет");
	Список.Добавить(0, "Авто");
	
	Если Объект.ВидРеквизита <> ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ДекорацияНадпись") Тогда
		Список.Добавить(2, "Лево");
		Список.Добавить(3, "Верх");
		Список.Добавить(4, "Право");
		Список.Добавить(5, "Низ");
	КонецЕсли;
	
	РеестрИмуществаКлиентСервер.УстановитьСписокВыбораИЗначениеПоСписку(Элементы.ПоложениеЗаголовка, Объект.ПоложениеЗаголовка, Список);	
	
КонецПроцедуры

&НаКлиенте
Процедура РастягиватьПоВертикалиСписокВыбора() Экспорт
	
	Список = Новый СписокЗначений;
	
	Если Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеФлажка")  
		Или Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Идентификатор") Тогда
		// Пустой список		
	ИначеЕсли Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.СписокЗначенийТаблица") Тогда
		Список.Добавить(0, "Да");
		Список.Добавить(1, "Нет");	
	Иначе
		Список.Добавить(1, "Да");
		Список.Добавить(2, "Нет");
		Список.Добавить(0, "Авто");
	КонецЕсли;
	                                                    
	РеестрИмуществаКлиентСервер.УстановитьСписокВыбораИЗначениеПоСписку(Элементы.РастягиватьПоВертикали, Объект.РастягиватьПоВертикали, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура РастягиватьПоГоризонталиСписокВыбора() Экспорт
	
	Список = Новый СписокЗначений;
	
	Если Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеФлажка")  
		Или Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.Идентификатор") Тогда
		// Пустой список		
	ИначеЕсли Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.СписокЗначенийТаблица") Тогда
		Список.Добавить(0, "Да");
		Список.Добавить(1, "Нет");	
	Иначе
		Список.Добавить(1, "Да");
		Список.Добавить(2, "Нет");
		Список.Добавить(0, "Авто");
	КонецЕсли;
	                                                    	
	РеестрИмуществаКлиентСервер.УстановитьСписокВыбораИЗначениеПоСписку(Элементы.РастягиватьПоГоризонтали, Объект.РастягиватьПоГоризонтали, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипРеквизитаДоступность()
	
	ЭтоНадпись = (Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ДекорацияНадпись"));
	
	Элементы.ТипРеквизита.ТолькоПросмотр = ЭтоНадпись;
	Элементы.ТипРеквизита.АвтоОтметкаНезаполненного = Не ЭтоНадпись;
	
	Если ЭтоНадпись Тогда
		Объект.ТипРеквизита = Неопределено;
		Элементы.ТипРеквизита.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораОграничение(ТипЗначения);
	
	СписокДоступен = (Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеВвода")
						Или Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.СписокЗначенийПолеВвода")
						Или Объект.ВидРеквизита = ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеПереключателя"));
	
	Если СписокДоступен Тогда
		Элементы.СписокВыбораЗначение.ОграничениеТипа = ?(ТипЗначения = Неопределено, Новый ОписаниеТипов("Неопределено"), ТипЗначения);
	КонецЕсли;
	
	Элементы.СтраницаСписокВыбора.Доступность = СписокДоступен;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулыОграничение()
	
	ФормулыДоступны = (Объект.ВидРеквизита <> ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеНадписи")
						И Объект.ВидРеквизита <> ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ДекорацияНадпись")
	                    И Объект.ВидРеквизита <> ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.СписокЗначенийПолеНадписи"));
						
	Элементы.СтраницаФормулы.Доступность = ФормулыДоступны;
	
	Если ФормулыДоступны Тогда
		ФормулаОбязательностьДоступна = (Объект.ВидРеквизита <> ПредопределенноеЗначение("Перечисление.ВидыРеквизитовСведенийОбИмуществе.ПолеФлажка"));
		Элементы.СтраницаФормулаОбязательность.Доступность = ФормулаОбязательностьДоступна;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбораСвязи()
	
	НовыйМассив = Новый Массив();	
	
	Если Не ПустаяСтрока(Объект.ОтборЭлементов) Тогда 
		НовыйПараметр = Новый ПараметрВыбора("ПредустановленныйОтбор", Объект.ОтборЭлементов);
		НовыйМассив.Добавить(НовыйПараметр);
	КонецЕсли;
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.СписокВыбораЗначение.ПараметрыВыбора = НовыеПараметры; 
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаРегулированияСписокВыбора()
	
	Список = Элементы.КнопкаРегулирования.СписокВыбора;
	
	Список.Добавить(1, "Да");
	Список.Добавить(2, "Нет");
	Список.Добавить(0, "Авто");
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОткрытияСписокВыбора()
	
	Список = Элементы.КнопкаОткрытия.СписокВыбора;
	
	Список.Добавить(1, "Да");
	Список.Добавить(2, "Нет");
	Список.Добавить(0, "Авто");
	
КонецПроцедуры

&НаКлиенте
Процедура БыстрыйВыборСписокВыбора()
	
	Список = Элементы.БыстрыйВыбор.СписокВыбора;
	
	Список.Добавить(1, "Да");
	Список.Добавить(2, "Нет");
	Список.Добавить(0, "Авто");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыФормы()
	
	ПараметрыФормы = Новый Структура;
		
	ПараметрыФормы.Вставить("ИдентификаторОбъекта"	, ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.РегистрацияСведенийОбИмуществе"));	
	ПараметрыФормы.Вставить("ДоступныеТипыРеквизита", Объект.ТипРеквизита.ТипЗначения);
	ПараметрыФормы.Вставить("ВыбранныеСвязи"		, Объект.СвязиПараметровВыбора);

	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура УправлениеДоступностьюФормулойОбязательность()
	
	Элементы.ФормулаОбязательность.ТолькоПросмотр = Объект.Обязательное;	
	Элементы.ДекорацияОбязательность.Заголовок = ?(Объект.Обязательное, "Поле обязательно для заполения", "Обязательность заполнения поля определяется по формуле");		
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюФормулойНедоступность()
	
	Элементы.ФормулаНедоступность.ТолькоПросмотр = Объект.Недоступное;
	Элементы.ДекорацияНедоступность.Заголовок = ?(Объект.Недоступное, "Поле ограничено для редактирования", "Доступность редактирования поля определяется по формуле");
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеДоступностьюКнопкиДобавитьВФормулу()
	
	КнопкаДоступна = Истина;
	
	Если Элементы.СтраницаСтраницыФормулы.ТекущаяСтраница = Элементы.СтраницаФормулаОбязательность Тогда
		КнопкаДоступна = Не Объект.Обязательное;
	ИначеЕсли Элементы.СтраницаСтраницыФормулы.ТекущаяСтраница = Элементы.СтраницаФормулаНедоступность Тогда
		КнопкаДоступна = Не Объект.Недоступное;
	КонецЕсли;
	
	Элементы.ДобавитьВФормулу.Доступность = КнопкаДоступна;
	
КонецПроцедуры
