#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
	ПриИзмененииОрганизации();
	ОтображениеТестовогоОбмена();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	Если ЗначениеЗаполнено(Организация) Тогда
		ПриИзмененииОрганизации();
	КонецЕсли;
	ИзменитьОтборажениеПанелиОтборовНаСервере();
	Элементы.ФормаОтображатьВыполнениеПоШагам.Пометка = Тестирование;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновленаНастройкаОрганизацийДляЗагрузкиДанныхИзЕИС"
		И Параметр = Организация Тогда
		ЗаполнитьНастройкиОбменаОрганизации();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоТекущемуОбменуПриИзменении(Элемент)
	ПриАктивизацииСтрокиСообщенияОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтбораПриИзменении(Элемент)
	ПриИзмененииЭлементаОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаЗагрузкиОтборПриИзменении(Элемент)
	ПриИзмененииЭлементаОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОтборПриИзменении(Элемент)
	ПриИзмененииЭлементаОтбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПериодОтбораУсловиеПриИзменении(Элемент)
	ОбновитьЭлементыОтбораЗагруженныхДанных();
КонецПроцедуры

&НаКлиенте
Процедура ОшибкаЗагрузкиОтборУсловиеПриИзменении(Элемент)
	ОбновитьЭлементыОтбораЗагруженныхДанных();
КонецПроцедуры

&НаКлиенте
Процедура СтатусДокументаОтборУсловиеПриИзменении(Элемент)
	ОбновитьЭлементыОтбораЗагруженныхДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОтбора(ИмяЭлемента)
	ЭтотОбъект[ИмяЭлемента+"Условие"] = ЗначениеЗаполнено(ЭтотОбъект[ИмяЭлемента]);
	
	ОбновитьЭлементыОтбораЗагруженныхДанных();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыОтбораЗагруженныхДанных()
	
	// отбор по периоду
	НайденныеЭлементы = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ЗагруженныеДанныеЕИС.Отбор,,"ГруппаДатаНачала");
	Если НайденныеЭлементы.Количество() Тогда
		ГруппаДатаНачала = НайденныеЭлементы[0];
	Иначе
		ГруппаДатаНачала = ЗагруженныеДанныеЕИС.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаДатаНачала.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаДатаНачала.Представление = "ГруппаДатаНачала";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаДатаНачала,"ДатаОбмена",ПериодОтбора.ДатаНачала,ВидСравненияКомпоновкиДанных.БольшеИлиРавно,,ПериодОтбораУсловие И ЗначениеЗаполнено(ПериодОтбора.ДатаНачала));
	
	НайденныеЭлементы = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ЗагруженныеДанныеЕИС.Отбор,,"ГруппаДатаОкончания");
	Если НайденныеЭлементы.Количество() Тогда
		ГруппаДатаОкончания = НайденныеЭлементы[0];
	Иначе
		ГруппаДатаОкончания = ЗагруженныеДанныеЕИС.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаДатаОкончания.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		ГруппаДатаОкончания.Представление = "ГруппаДатаОкончания";
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаДатаОкончания,"ДатаОбмена",ПериодОтбора.ДатаОкончания,ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,,ПериодОтбораУсловие И ЗначениеЗаполнено(ПериодОтбора.ДатаОкончания));
	
	//обычные отборы
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗагруженныеДанныеЕИС,"ЕстьОшибка",ОшибкаЗагрузкиОтбор,,,ОшибкаЗагрузкиОтборУсловие);	
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗагруженныеДанныеЕИС,"ТипДокументаСообщения",СтатусДокументаОтбор,,,СтатусДокументаОтборУсловие);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗагруженныеДанныеЕИС

&НаКлиенте
Процедура ЗагруженныеДанныеЕИСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ЗагруженныеДанныеЕИС.ТекущиеДанные;
	Если Поле.Имя = "ЗагруженныеДанныеЕИСЗагруженныйОбъект" Тогда
		Если ЗначениеЗаполнено(ТекДанные.ЗагруженныйОбъект) Тогда
			ПоказатьЗначение(,ТекДанные.ЗагруженныйОбъект);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "ЗагруженныеДанныеЕИСРезультатОбработки" Тогда
		Если ЗначениеЗаполнено(ТекДанные.РезультатОбработки) Тогда
			ПоказатьЗначение(,ТекДанные.РезультатОбработки);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСообщенияОбменаДаннымиЕИС

&НаКлиенте
Процедура СообщенияОбменаДаннымиЕИСПриАктивизацииСтроки(Элемент)
	
	Если ДокументыПоТекущемуОбмену Тогда
		ПодключитьОбработчикОжидания("ПриАктивизацииСтрокиСообщенияОбмена",0.3,Истина);
	Иначе
		ИнформатцияТекущегоОбмена = "Все записи";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияОбменаДаннымиЕИСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПриАктивизацииСтрокиСообщенияОбмена()
		
	ТекДанные = Элементы.СообщенияОбменаДаннымиЕИС.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ТекИдентификаторЕИС = "";
		ИнформатцияТекущегоОбмена = "";	
	Иначе
		ТекИдентификаторЕИС = ТекДанные.ИдентификаторСообщенияЕИС;
		Если ДокументыПоТекущемуОбмену Тогда
			ИнформатцияТекущегоОбмена = "Обмен от " + Формат(ТекДанные.ДатаОбмена,"ДЛФ=DT");
		Иначе
			ИнформатцияТекущегоОбмена = "Все записи";
		КонецЕсли;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗагруженныеДанныеЕИС,"ИдентификаторСообщенияЕИС",ТекИдентификаторЕИС,,,ДокументыПоТекущемуОбмену);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапроситьДанные(Команда)
	
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		ТекстСообщения = НСтр("ru='Укажите организацию, данные по которой требуется получить из ЕИС.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Организация");
		Возврат;
	КонецЕсли;
	
	КоличествоОбъектовВОчередиСервиса = 0;
	ФайлыСформированы = Ложь;
	ФайлыОтправлены = Ложь;
	ПодтверждениеСформировано = Ложь;
	ПодтверждениеОтправлено = Ложь;
	
	//проверим, что в базе есть форматы по заданной настройке форматов
	Если ПроверитьВозможностьФормирования() = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьДействиеОбменаНаКлиенте();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВозможностьФормирования()
		
	НастройкиУчастника = БиблиотекаФункцийОбмена.ПолучитьНастройкиОрганизацииДляЗагрузкиИзЕИС(Организация);
		
	МассивФорматов = Новый Массив;
	МассивФорматов.Добавить("getObjectsRequest");
	МассивФорматов.Добавить("ackRequest");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаФормата", НастройкиУчастника.НастройкаФорматов);
	Запрос.УстановитьПараметр("ПолноеИмя", "Документ.ЗаданиеНаЭкспортДанныхВБанкиКС");
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	СписокФорматовНастройкиОбменаБанкиКС.Формат КАК ФорматЭкспорта
			|ИЗ
			|	РегистрСведений.СписокФорматовНастройкиОбменаБанкиКС КАК СписокФорматовНастройкиОбменаБанкиКС
			|ГДЕ
			|	СписокФорматовНастройкиОбменаБанкиКС.НастройкаФормата = &НастройкаФормата
			|	И СписокФорматовНастройкиОбменаБанкиКС.Формат.ИдентификаторОбъекта.ПолноеИмя = &ПолноеИмя
			|	И СписокФорматовНастройкиОбменаБанкиКС.Формат.Наименование = &ИмяФормата";
	
	Для Каждого ТекИмяФормата Из МассивФорматов Цикл
						
		Запрос.УстановитьПараметр("ИмяФормата", ТекИмяФормата);
	    ТекФормат = Неопределено;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекФормат = Выборка.ФорматЭкспорта;
		КонецЕсли;
	
		Если НЕ ЗначениеЗаполнено(ТекФормат) Тогда
			ЕстьОшибки = Истина;
			ТекстСообщения = НСтр("ru='Отсутствует формат обмена ""%1"". Обмен не возможен.
				|Обновите форматы обмена с ЕИС из файла поставки и заполните настройку форматов.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ТекИмяФормата);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьДействияОтправкиСообщенийНаКлиенте()
	
	ЕстьОшибки = Ложь;
	ТекстОшибки = "";
	
	Если ФайлыСформированы = Ложь Тогда
		
		ВыполнитьДействияОтправкиСообщенийНаСервере(ЕстьОшибки,ТекстОшибки);
		
		Если ЕстьОшибки
			ИЛИ Тестирование Тогда
			ОбработатьОшибки(ЕстьОшибки,ТекстОшибки);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
			
	Если ФайлыСформированы
		И НЕ ФайлыОтправлены Тогда
		
		ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();		
		ВыполнятьОбменНаСервере = (ПараметрыНастройкиОбмена.ОбменНаКлиенте = Ложь);
	
		Если ПараметрыНастройкиОбмена.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис") Тогда
			Если ВыполнятьОбменНаСервере 
				ИЛИ ЭтоВебКлиент Тогда
				
				ВыполнитьДействияОтправкиСообщенийНаСервере(ЕстьОшибки,ТекстОшибки);
				
			Иначе						
				ОтправитьФайлыВСервисНаКлиенте(ЕстьОшибки,ТекстОшибки); 
				ОбработатьОтветыОбменаЕИС(ЕстьОшибки);
				ФайлыОтправлены = Истина;
			КонецЕсли;
			
			Если ЕстьОшибки
				ИЛИ Тестирование Тогда
				ОбработатьОшибки(ЕстьОшибки,ТекстОшибки);
				Возврат;
			КонецЕсли;
			
		Иначе
			ТекстОшибки = НСтр("ru='В настройке обмена выбран не корректный способ обмена. Для обмена с ЕИС следует указать способ обмена web-сервис.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ФайлыСформированы
		И ФайлыОтправлены
		И НЕ ПодтверждениеСформировано Тогда
		Если ТаблицаПодтвержденияПолученияСообщений.Количество() <> 0 Тогда
			
			ВыполнитьДействияОтправкиСообщенийНаСервере(ЕстьОшибки,ТекстОшибки);
			
			Если ЕстьОшибки
				ИЛИ Тестирование Тогда
				ОбработатьОшибки(ЕстьОшибки,ТекстОшибки);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ФайлыСформированы
		И ФайлыОтправлены
		И ПодтверждениеСформировано
		И НЕ ПодтверждениеОтправлено Тогда
		
		ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();		
		ВыполнятьОбменНаСервере = (ПараметрыНастройкиОбмена.ОбменНаКлиенте = Ложь);
		
		Если ВыполнятьОбменНаСервере 
			ИЛИ ЭтоВебКлиент Тогда
			
			ВыполнитьДействияОтправкиСообщенийНаСервере(ЕстьОшибки,ТекстОшибки);
			
			
		Иначе						
			ОтправитьФайлыВСервисНаКлиенте(ЕстьОшибки,ТекстОшибки); 
			ОбработатьПодтверждениеПолучениеСообщений(ЕстьОшибки,ТекстОшибки);
			ПодтверждениеОтправлено = Истина;
		КонецЕсли;
		
		Если ЕстьОшибки
			ИЛИ Тестирование Тогда
			ОбработатьОшибки(ЕстьОшибки,ТекстОшибки);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ФайлыСформированы
		И ФайлыОтправлены
		И ПодтверждениеСформировано
		И ПодтверждениеОтправлено
		И КоличествоОбъектовВОчередиСервиса>0 Тогда 
		
		ОписаниеОпов = Новый ОписаниеОповещения("ПослеОтветаНаВопросОЗапросеДанныхИзОчереди",ЭтотОбъект);
		ТекстВопроса = НСтр("ru='В сервисе для данной организации есть еще данные: %1 шт. Запросить данные из сервиса?'");
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса,КоличествоОбъектовВОчередиСервиса);
		
		
		ПоказатьВопрос(ОписаниеОпов,ТекстВопроса,РежимДиалогаВопрос.ОКОтмена);
		Возврат;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОЗапросеДанныхИзОчереди(Результат, ДопПараметры) Экспорт
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗапроситьДанные(Неопределено);	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияОтправкиСообщенийНаСервере(ЕстьОшибки,ТекстОшибки)
	
	ЕстьОшибки = Ложь;
	
	Если ФайлыСформированы = Ложь Тогда
		
		СформироватьФайлЗапросаНаСервере(ЕстьОшибки);				
		
		Если ЕстьОшибки
			ИЛИ Тестирование Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если ФайлыСформированы = Истина
		И ФайлыОтправлены = Ложь Тогда
		
		ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
		
		ВыполнятьОбменНаСервере = (ПараметрыНастройкиОбмена.ОбменНаКлиенте = Ложь);
		
		Если ПараметрыНастройкиОбмена.СпособОбмена = ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис")
			И (ВыполнятьОбменНаСервере 
				ИЛИ ЭтоВебКлиент) Тогда
				
			ОтправитьФайлыВСервисНаСервере(ЕстьОшибки,ТекстОшибки);
			ОбработатьОтветыОбменаЕИС(ЕстьОшибки);
			ФайлыОтправлены = Истина;	
				
			Если ЕстьОшибки 
				ИЛИ Тестирование Тогда
				Возврат;
			КонецЕсли;
		Иначе
			Возврат;//выполним отправку на клиенте
		КонецЕсли;
	КонецЕсли;
	
	
	Если ФайлыСформированы
		И ФайлыОтправлены
		И НЕ ПодтверждениеСформировано Тогда
			
		Если ТаблицаПодтвержденияПолученияСообщений.Количество() <> 0 Тогда
			СформироватьФайлПодтвержденияНаСервере(ЕстьОшибки);
		КонецЕсли;
		
		Если ЕстьОшибки 
			ИЛИ Тестирование Тогда
			Возврат;
		КонецЕсли;
			
	КонецЕсли;
	
	Если ФайлыСформированы
		И ФайлыОтправлены
		И ПодтверждениеСформировано
		И НЕ ПодтверждениеОтправлено Тогда
		
		ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
		
		ВыполнятьОбменНаСервере = (ПараметрыНастройкиОбмена.ОбменНаКлиенте = Ложь);
		
		Если ВыполнятьОбменНаСервере 
			ИЛИ ЭтоВебКлиент Тогда
			
			ОтправитьФайлыВСервисНаСервере(ЕстьОшибки,ТекстОшибки);
			ОбработатьПодтверждениеПолучениеСообщений(ЕстьОшибки,ТекстОшибки);
			ПодтверждениеОтправлено = Истина;
			
			Если ЕстьОшибки 
				ИЛИ Тестирование Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Вернем управление на клиент. Если возникнет необходимость посылать новые запросы, будем вызывать их с клиента.
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТекстЗагружаемогоДокумента(Команда)
	ТекДанные = Элементы.ЗагруженныеДанныеЕИС.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекстДокумента = ПолучитьТекстДокумента(Организация,ТекДанные.ИдентификаторСообщенияЕИС,ТекДанные.ИдентификаторДокументаВСообщенииЕИС);
	
	ОткрытьФорму("Обработка.ЗагрузкаСведенийЕИС.Форма.ФормаПросмотраТекстаДокумента",Новый Структура("ТекстФайла",ТекстДокумента),ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументПовторно(Команда)
	
	ОчиститьСообщения();
	
	ТекДанные = Элементы.ЗагруженныеДанныеЕИС.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидОбмена) Тогда
		ТекстСообщения = НСтр("ru='Для организации %1 не заданы настройки участника, не заполнен вид обмена.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Организация);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Организация");
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("ИдентификаторСообщенияЕИС,ИдентификаторДокументаВСообщенииЕИС,ДатаОбмена");
	ЗаполнитьЗначенияСвойств(ДопПараметры,ТекДанные);
	ОписаниеОпов = Новый ОписаниеОповещения("ПослеОтветаНаВопросОПовторонойЗагрузке",ЭтотОбъект,ДопПараметры);
	ПоказатьВопрос(ОписаниеОпов,НСтр("ru='Загрузить файл повторно?'"),РежимДиалогаВопрос.ОКОтмена,,КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОПовторонойЗагрузке(Результат,ДопПараметры) Экспорт
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьДокументПовторноНаСервере(ДопПараметры.ИдентификаторСообщенияЕИС,ДопПараметры.ИдентификаторДокументаВСообщенииЕИС,ДопПараметры.ДатаОбмена);
КонецПроцедуры
	
&НаКлиенте
Процедура ОбновитьНастройки(Команда)
	ЗаполнитьНастройкиОбменаОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеПанелиОтборов(Команда)
	
	ОтображатьПанельОтборов = НЕ Элементы.ОтображениеПанелиОтборов.Пометка;
	ИзменитьОтборажениеПанелиОтборовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиУчастника(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",Организация); 
	ОткрытьФорму("РегистрСведений.НастройкаОрганизацийДляЗагрузкиДанныхИзЕИС.Форма.ФормаЗаписи",ПараметрыФормы,ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыОбмена(Команда)
	ТекДанные = Элементы.СообщенияОбменаДаннымиЕИС.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивИдентификаторов = Новый Массив;
		
	Для Каждого ТекВыд Из Элементы.СообщенияОбменаДаннымиЕИС.ВыделенныеСтроки Цикл
		ТекДанные = Элементы.СообщенияОбменаДаннымиЕИС.ДанныеСтроки(ТекВыд);
		МассивИдентификаторов.Добавить(ТекДанные.ГУИД);
	КонецЦикла;
		
	ОбработкаСохраненияФайловОбмена(Неопределено, Новый Структура("Этап,Список","Начало",МассивИдентификаторов));
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьТестовыйОбмен(Команда)
	ТестовыйОбмен = НЕ ТестовыйОбмен;
	ОтображениеТестовогоОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьВыполнениеПоШагам(Команда)
	Тестирование = НЕ Тестирование;
	Элементы.ФормаОтображатьВыполнениеПоШагам.Пометка = Тестирование;
КонецПроцедуры

&НаКлиенте
Процедура УдалениеИсторииОбмена(Команда)
	ОписаниеОпов = Новый ОписаниеОповещения("ПослеУдаленияИсторииОбмена",ЭтотОбъект);
	ОткрытьФорму("Обработка.ЗагрузкаСведенийЕИС.Форма.ФормаУдалениеИсторииОбмена",,,,,,ОписаниеОпов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУдаленияИсторииОбмена(Результат,ДополнительныеПараметры) Экспорт
	Элементы.ЗагруженныеДанныеЕИС.Обновить();
	Если ОтображатьПанельОтборов Тогда
		Элементы.СообщенияОбменаДаннымиЕИС.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьОшибки(ЕстьОшибки,ТекстОшибки)
	
	ТекстПользовательскогоСообщения = "";
	
	Если (ФайлыСформированы = Истина
			И ФайлыОтправлены = Ложь)
		ИЛИ (ФайлыСформированы = Истина
			И ФайлыОтправлены = Истина
			И ПодтверждениеСформировано = Истина
			И ПодтверждениеОтправлено = Ложь) Тогда
		
		ПараметрыФормы = ПолучитьСтруктуруПараметровОшибок();
		//ошибка этапа формирования файлов	
		
		Если ЕстьОшибки Тогда		
			ТекстПользовательскогоСообщения = Нстр("ru='При формировании файлов произошли ошибки'");
		Иначе
			ТекстПользовательскогоСообщения = Нстр("ru='Файлы сформированы успешно'");
		КонецЕсли;
				
		ПараметрыФормы.Вставить("Заголовок",ТекстПользовательскогоСообщения);
		ПараметрыФормы.Вставить("ЕстьОшибки",ЕстьОшибки);
		
		ОписаниеОп = Новый ОписаниеОповещения("ПослеЗакрытияФормыОшибок",ЭтотОбъект);
		ОткрытьФорму("Обработка.ЗагрузкаСведенийЕИС.Форма.ФормаОтображенияОшибок",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Возврат;		
		
	ИначеЕсли (ФайлыСформированы = Истина
			И ФайлыОтправлены = Истина
			И ПодтверждениеСформировано = Ложь)
		ИЛИ (ФайлыСформированы = Истина
			И ФайлыОтправлены = Истина
			И ПодтверждениеСформировано = Истина
			И ПодтверждениеОтправлено = Истина) Тогда
		//ошибка этапа отправки файлов
		
		ПараметрыФормы = ПолучитьСтруктуруПараметровОшибок();
		ПараметрыФормы.Вставить("ЕстьОшибки",ЕстьОшибки);
		
		Если ЕстьОшибки Тогда		
			ТекстПользовательскогоСообщения = Нстр("ru='При отправке файлов произошли ошибки.'");
		Иначе
			ТекстПользовательскогоСообщения = Нстр("ru='Файлы отправлены успешно.'");
		КонецЕсли;
		
		ПараметрыФормы.Вставить("Заголовок",ТекстПользовательскогоСообщения);
		
		ОписаниеОп = Новый ОписаниеОповещения("ПослеЗакрытияФормыОшибок",ЭтотОбъект);
		ОткрытьФорму("Обработка.ЗагрузкаСведенийЕИС.Форма.ФормаОтображенияОшибок",ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруПараметровОшибок()
	
	СтруктураПараметров = Новый Структура;
	//СтруктураПараметров.Вставить("ТекущееДействие",ТекущееДействие);
	СтруктураПараметров.Вставить("ТребуетсяПодтверждение",Ложь);
	Если (ФайлыСформированы = Истина
			И ФайлыОтправлены = Ложь)
		ИЛИ (ФайлыСформированы = Истина
			И ФайлыОтправлены = Истина
			И ПодтверждениеСформировано = Истина
			И ПодтверждениеОтправлено = Ложь) Тогда
		
		СтруктураПараметров.Вставить("АдресОбъектыОбмена", ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("РезультатФормирования"),УникальныйИдентификатор));
		СтруктураПараметров.Вставить("ЭтапОбмена","Формирование");
				
	ИначеЕсли (ФайлыСформированы = Истина
			И ФайлыОтправлены = Истина
			И ПодтверждениеСформировано = Ложь)
		ИЛИ (ФайлыСформированы = Истина
			И ФайлыОтправлены = Истина
			И ПодтверждениеСформировано = Истина
			И ПодтверждениеОтправлено = Истина) Тогда
		
		СтруктураПараметров.Вставить("ЭтапОбмена","Отправка");		
	    СтруктураПараметров.Вставить("АдресОбъектыОбмена", ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("РезультатФормирования"),УникальныйИдентификатор));		
		СтруктураПараметров.Вставить("АдресСообщенияОбмена", ПоместитьВоВременноеХранилище(РеквизитФормыВЗначение("ФайлыРезультатаФормирования"),УникальныйИдентификатор));
		
		ТребуетсяПодтверждение = Ложь;
		Если ТаблицаПодтвержденияПолученияСообщений.Количество() Тогда
			ТребуетсяПодтверждение = Истина;
		КонецЕсли;
		
		СтруктураПараметров.Вставить("ТребуетсяПодтверждение",ТребуетсяПодтверждение);
		
	КонецЕсли;
		
	Возврат СтруктураПараметров;	
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияФормыОшибок(Результат,ДопПараметры)Экспорт
	
	ПрерватьОбмен = Ложь;
	Если Результат = Неопределено Тогда
		ПрерватьОбмен = Истина;
	КонецЕсли;
	
	Если Результат = "Прервать" Тогда
		ПрерватьОбмен = Истина;
	КонецЕсли;
	
	Если ПрерватьОбмен Тогда
		РезультатФормирования.Очистить();
		ФайлыРезультатаФормирования.Очистить();
		ТаблицаПодтвержденияПолученияСообщений.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ФайлыСформированы = Истина
		И ФайлыОтправлены = Ложь Тогда
		
		МассивСтрок = Новый Массив;
		Для Каждого СтрТЧ Из РезультатФормирования Цикл
			Если ЗначениеЗаполнено(СтрТЧ.ОписаниеОшибки) Тогда
				МассивСтрок.Добавить(СтрТЧ);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлМас Из МассивСтрок Цикл
			РезультатФормирования.Удалить(ЭлМас);
		КонецЦикла;
		
		Если РезультатФормирования.Количество() = 0 Тогда
			Возврат;//нет файлов для продолжения
		КонецЕсли;
		
	КонецЕсли;
	
	//Вернемся в главную процедуру
	ВыполнитьДействиеОбменаНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеОбменаНаКлиенте()
		
	Если ПараметрыНастройкиОбмена = Неопределено Тогда
		ТекстСообщения = Нстр("ru='Для организации ""%1"" в настройках участника не задана настройка обмена с сервисом.
		|Обмен с сервисом не возможен.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Организация);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыНастройкиОбмена.СпособОбмена <> ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайловПередачи.WebСервис") Тогда
		ТекстСообщения = Нстр("ru='Для организации ""%1"" в настройках участника в настройке обмена задан способ обмена ""%2"".
		|Для обмена с сервисом следует указать способ обмена ""Web-сервис"" и указать адрес сервиса загрузки данных из ЕИС для внешних бухгалтерских систем.
		|Адрес:'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Организация,ПараметрыНастройкиОбмена.СпособОбмена);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		ТекстСообщения = Нстр("ru='https://int44.zakupki.gov.ru/eis-integration/services-vbs/financial-docs?wsdl'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;		
	КонецЕсли;
	
	ВыполнитьДействияОтправкиСообщенийНаКлиенте();
			
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизации()
	
	ЗаполнитьНастройкиОбменаОрганизации();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СообщенияОбменаДаннымиЕИС,"Организация",Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗагруженныеДанныеЕИС,"Организация",Организация);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиОбменаОрганизации()
		
	НастройкиУчастника = БиблиотекаФункцийОбмена.ПолучитьНастройкиОрганизацииДляЗагрузкиИзЕИС(Организация);
	НастройкаОбмена = НастройкиУчастника.НастройкаОбмена;
	НастройкаФорматов = НастройкиУчастника.НастройкаФорматов;
	ВидОбмена = НастройкиУчастника.ВидОбмена;
	
	Если Не ЗначениеЗаполнено(НастройкаОбмена) Тогда
		ТекстСообщения = Нстр("ru='Для организации ""%1"" в настройках участника не задана настройка обмена с сервисом.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,Организация);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ПараметрыНастройкиОбмена = Неопределено;
	Иначе
		ПараметрыНастройкиОбмена = Новый ФиксированнаяСтруктура(ЭкспортФайлов.ПолучитьДанныеНастройкиОбмена(НастройкаОбмена));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьФайлЗапросаНаСервере(ЕстьОшибки)
	
	РезультатФормирования.Очистить();
	ТаблицаПодтвержденияПолученияСообщений.Очистить();
	ФайлыРезультатаФормирования.Очистить();
			
	ФорматЭкспорта = Справочники.ФорматыОбменаБанкиКС.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокФорматовНастройкиОбменаБанкиКС.Формат КАК ФорматЭкспорта
		|ИЗ
		|	РегистрСведений.СписокФорматовНастройкиОбменаБанкиКС КАК СписокФорматовНастройкиОбменаБанкиКС
		|ГДЕ
		|	СписокФорматовНастройкиОбменаБанкиКС.НастройкаФормата = &НастройкаФормата
		|	И СписокФорматовНастройкиОбменаБанкиКС.Формат.ИдентификаторОбъекта.ПолноеИмя = &ПолноеИмя
		|	И СписокФорматовНастройкиОбменаБанкиКС.Формат.Наименование = &ИмяФормата";

	Запрос.УстановитьПараметр("НастройкаФормата", НастройкаФорматов);
	Запрос.УстановитьПараметр("ПолноеИмя", "Документ.ЗаданиеНаЭкспортДанныхВБанкиКС");
	Запрос.УстановитьПараметр("ИмяФормата", "getObjectsRequest");
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ФорматЭкспорта = Выборка.ФорматЭкспорта;
	КонецЕсли;
		
	СтруктураДляФормирования = Новый Структура("КассовыйОрган");//выпилить?
	СтруктураДляФормирования.Вставить("Дата", ТекущаяДатаСеанса());
	СтруктураДляФормирования.Вставить("ВидОбмена", ВидОбмена);
	СтруктураДляФормирования.Вставить("НастройкаОбмена", НастройкаОбмена);
	СтруктураДляФормирования.Вставить("Организация", Организация);
	СтруктураДляФормирования.Вставить("Ссылка",Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка());
	//СтруктураДляФормирования.Вставить("РезультатФормирования",Новый Соответствие);
	
	ОбщОбъектыОбмена = РеквизитФормыВЗначение("РезультатФормирования");
	ТекОбъектыОбмена = ОбщОбъектыОбмена.СкопироватьКолонки();
	ТекОбъектыОбмена.Колонки.Добавить("РезультатФормирования");

	СтрокаОбмена = ТекОбъектыОбмена.Добавить();
	СтрокаОбмена.Объект = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка();
	СтрокаОбмена.Формат = ФорматЭкспорта;			

    СтруктураДляФормирования.Вставить("ОбъектыОбмена",ТекОбъектыОбмена);
	
	
	ОбработкаФормирования = Обработки.ОбменВФорматахУФК_УФЭБС.Создать();
	ОбработкаФормирования.ИдентификаторСообщения = Строка(Новый УникальныйИдентификатор);
	ОбработкаФормирования.мОрганизация = Организация;
	ОбработкаФормирования.ТестовыйОбмен = ТестовыйОбмен;	
	ОбработкаФормирования.СоответствиеОбработанныхФорматов = Неопределено;
	ОбработкаФормирования.СформироватьФайлы(СтруктураДляФормирования);
	
	Для Каждого СтрокаОбмена Из СтруктураДляФормирования.ОбъектыОбмена Цикл 
		СтрФайлов = ФайлыРезультатаФормирования.Добавить();
		СтрФайлов.СодержимоеФайла = СтрокаОбмена.РезультатФормирования;
		СтрФайлов.ИдентификаторСообщения = ОбработкаФормирования.ИдентификаторСообщения;
		СтрФайлов.ФорматОбмена = СтрокаОбмена.Формат;
		СтрФайлов.ТестовыйОбмен = ТестовыйОбмен;
		
		НовСтр = РезультатФормирования.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрокаОбмена);
		НовСтр.СодержимоеФайла = СтрокаОбмена.РезультатФормирования;
		ЕстьОшибки = ЕстьОшибки ИЛИ ЗначениеЗаполнено(НовСтр.ОписаниеОшибки);
	КонецЦикла;
	МассивФ = Новый Массив;
	МассивФ.Добавить(ФорматЭкспорта);
	СоответствиеЗаголовковФорматов = Новый ФиксированноеСоответствие(ЭкспортФайлов.ПолучитьЗаголовкиМассиваФорматов(НастройкаОбмена, МассивФ));
	
	ФайлыСформированы = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьФайлПодтвержденияНаСервере(ЕстьОшибки)
	
	РезультатФормирования.Очистить();
	ФайлыРезультатаФормирования.Очистить();
	
	Если ТаблицаПодтвержденияПолученияСообщений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ФорматЭкспорта = Справочники.ФорматыОбменаБанкиКС.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокФорматовНастройкиОбменаБанкиКС.Формат КАК ФорматЭкспорта
		|ИЗ
		|	РегистрСведений.СписокФорматовНастройкиОбменаБанкиКС КАК СписокФорматовНастройкиОбменаБанкиКС
		|ГДЕ
		|	СписокФорматовНастройкиОбменаБанкиКС.НастройкаФормата = &НастройкаФормата
		|	И СписокФорматовНастройкиОбменаБанкиКС.Формат.ИдентификаторОбъекта.ПолноеИмя = &ПолноеИмя
		|	И СписокФорматовНастройкиОбменаБанкиКС.Формат.Наименование = &ИмяФормата";

	Запрос.УстановитьПараметр("НастройкаФормата", НастройкаФорматов);
	Запрос.УстановитьПараметр("ПолноеИмя", "Документ.ЗаданиеНаЭкспортДанныхВБанкиКС");
	Запрос.УстановитьПараметр("ИмяФормата", "ackRequest");
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		ФорматЭкспорта = Выборка.ФорматЭкспорта;
	КонецЕсли;
	
	СтруктураДляФормирования = Новый Структура("КассовыйОрган");//выпилить?
	СтруктураДляФормирования.Вставить("Дата", ТекущаяДатаСеанса());
	СтруктураДляФормирования.Вставить("ВидОбмена", ВидОбмена);
	СтруктураДляФормирования.Вставить("НастройкаОбмена", НастройкаОбмена);
	СтруктураДляФормирования.Вставить("Организация", Организация);
	СтруктураДляФормирования.Вставить("Ссылка",Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка());
	//СтруктураДляФормирования.Вставить("РезультатФормирования",Новый Соответствие);
	
	ОбщОбъектыОбмена = РеквизитФормыВЗначение("РезультатФормирования");
	ТекОбъектыОбмена = ОбщОбъектыОбмена.СкопироватьКолонки();
	ТекОбъектыОбмена.Колонки.Добавить("РезультатФормирования");

	СтрокаОбмена = ТекОбъектыОбмена.Добавить();
	СтрокаОбмена.Объект = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка();
	СтрокаОбмена.Формат = ФорматЭкспорта;			

    СтруктураДляФормирования.Вставить("ОбъектыОбмена",ТекОбъектыОбмена);
	
	МассивИдентификаторов = ТаблицаПодтвержденияПолученияСообщений.Выгрузить().ВыгрузитьКолонку("ИдентификаторСообщенияДокумента");
	
	ОбработкаФормирования = Обработки.ОбменВФорматахУФК_УФЭБС.Создать();
	ОбработкаФормирования.ИдентификаторСообщения = ТаблицаПодтвержденияПолученияСообщений[0].ИдентификаторСообщенияЕИС;
	ОбработкаФормирования.ТестовыйОбмен = ТаблицаПодтвержденияПолученияСообщений[0].ЭтоТестовыйОбмен;
	ОбработкаФормирования.МассивИдентификаторовСообщений = МассивИдентификаторов;
		
	ОбработкаФормирования.мОрганизация = Организация;
	ОбработкаФормирования.СоответствиеОбработанныхФорматов = Неопределено;
	ОбработкаФормирования.СформироватьФайлы(СтруктураДляФормирования);	
	
	Для Каждого СтрокаОбмена Из СтруктураДляФормирования.ОбъектыОбмена Цикл 
		СтрФайлов = ФайлыРезультатаФормирования.Добавить();
		СтрФайлов.СодержимоеФайла = СтрокаОбмена.РезультатФормирования;
		СтрФайлов.ИдентификаторСообщения = ТаблицаПодтвержденияПолученияСообщений[0].ИдентификаторСообщенияЕИС;
		СтрФайлов.ФорматОбмена = СтрокаОбмена.Формат;
		
		НовСтр = РезультатФормирования.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрокаОбмена);
		НовСтр.СодержимоеФайла = СтрокаОбмена.РезультатФормирования;
		ЕстьОшибки = ЕстьОшибки ИЛИ ЗначениеЗаполнено(НовСтр.ОписаниеОшибки);
	КонецЦикла;
	МассивФ = Новый Массив;
	МассивФ.Добавить(ФорматЭкспорта);
	СоответствиеЗаголовковФорматов = Новый ФиксированноеСоответствие(ЭкспортФайлов.ПолучитьЗаголовкиМассиваФорматов(НастройкаОбмена, МассивФ));
	
	ПодтверждениеСформировано = Истина;
	
	ТаблицаПодтвержденияПолученияСообщений.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьФайлыВСервисНаКлиенте(ЕстьОшибки,ТекстОшибки)
	ОтправитьФайлыВСервисОбщаяПроцедура(ФайлыРезультатаФормирования,СоответствиеЗаголовковФорматов,ПараметрыНастройкиОбмена,ЕстьОшибки,ТекстОшибки);	
КонецПроцедуры

&НаСервере
Процедура ОтправитьФайлыВСервисНаСервере(ЕстьОшибки,ТекстОшибки)
	ОтправитьФайлыВСервисОбщаяПроцедура(ФайлыРезультатаФормирования,СоответствиеЗаголовковФорматов,ПараметрыНастройкиОбмена,ЕстьОшибки,ТекстОшибки);		
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодтверждениеПолучениеСообщений(ЕстьОшибки,ТекстОшибки)
		
	Для Каждого СтрТЧ Из ФайлыРезультатаФормирования Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрТЧ.СтатусОтправки)
			ИЛИ СтрТЧ.СтатусОтправки = Перечисления.РезультатыОтправкиСообщенийВЕИС.НеОтправлен Тогда
			//Обмен с сервисом не выполнялся
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(СтрТЧ.СообщениеОтвет) Тогда
			ДобавитьОшибку(СтрТЧ.ТаблицаОшибок, "Сервис дал пустой ответ", "");
			Продолжить;
		КонецЕсли;
		
		//РС СообщенияПодтвержденияПолученияДанныхЕИС
		ЗаписьРС = РегистрыСведений.СообщенияПодтвержденияПолученияДанныхЕИС.СоздатьМенеджерЗаписи();
		ЗаписьРС.Организация = Организация;
		ЗаписьРС.ИдентификаторСообщенияЕИС = СтрТЧ.ИдентификаторСообщения;
		ЗаписьРС.СообщениеЗапросПодтверждения = Новый ХранилищеЗначения(СтрТЧ.СодержимоеФайла);
		ЗаписьРС.СообщениеОтветПодтверждения = Новый ХранилищеЗначения(СтрТЧ.СообщениеОтвет);
		ЗаписьРС.ДатаОбмена = СтрТЧ.ДатаОбмена;
		
		ЗаписьРС.Записать();
	КонецЦикла;
	
	ТаблицаПодтвержденияПолученияСообщений.Очистить();
	
	Если ОтображатьПанельОтборов Тогда
		Элементы.СообщенияОбменаДаннымиЕИС.Обновить();
	КонецЕсли;
	
	КоличествоСообщенийОтправлено = 0;
	ОбщееКолВо = 0;
	Для Каждого СтрТЧ Из ФайлыРезультатаФормирования Цикл
		ОбщееКолВо = ОбщееКолВо + 1;
		Если НЕ ЗначениеЗаполнено(СтрТЧ.СтатусОтправки)
			ИЛИ СтрТЧ.СтатусОтправки = ПредопределенноеЗначение("Перечисление.РезультатыОтправкиСообщенийВЕИС.НеОтправлен") Тогда
			//Обмен не выполнялся
			Продолжить;
		КонецЕсли;
		КоличествоСообщенийОтправлено = КоличествоСообщенийОтправлено+1;
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru='Обмен %1. Подтверждено получение сообщений %2 из %3.'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ТекущаяДата(),КоличествоСообщенийОтправлено,ОбщееКолВо);
    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтправитьФайлыВСервисОбщаяПроцедура(ТаблицаСообщений,Знач ЗаголовкиФорматов,ПараметрыНастройки,ЕстьОшибки,ТекстОшибки) Экспорт
	
#Если Не ВебКлиент Тогда
		
	НастройкаОбменаСтруктурой = ПараметрыНастройки;
	
	ИспользоватьBOM = ?(НастройкаОбменаСтруктурой.ИспользоватьBOM,ИспользованиеByteOrderMark.Использовать,ИспользованиеByteOrderMark.НеИспользовать);
								
	АдресРесурса = "";
	СоединениеHTTP = ЭкспортФайловКлиентСервер.ПолучитьСоединениеСИнтернет(НастройкаОбменаСтруктурой, АдресРесурса);
	СоответствиеОтветов = Новый Соответствие;	
		
	//Выполняем обмен с сервисом.
	//Если это запрос данных из очереди, то при получении в ответе данных,
	//копируем строку запроса и выполняем запрос следующего сообщения из очереди.
	ОтправитьВыбранныеФайлыВСервис(ТаблицаСообщений,ЗаголовкиФорматов,СоединениеHTTP,АдресРесурса,ИспользоватьBOM);
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов метода в веб-клиенте.'");
#КонецЕсли
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтправитьВыбранныеФайлыВСервис(ТаблицаСообщений,ЗаголовкиФорматов,СоединениеHTTP,АдресРесурса,ИспользоватьBOM)
	
	МассивНовыхСтрокКОбработке = Новый Массив;
		
	Для Каждого СтрТЧ Из ТаблицаСообщений Цикл	
				
		Попытка
			
			Заголовки = ЗаголовкиФорматов[СтрТЧ.ФорматОбмена];			
			ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса, Заголовки);
			
			ЗапросHTTP.УстановитьТелоИзСтроки(СтрТЧ.СодержимоеФайла,КодировкаТекста.UTF8,ИспользоватьBOM);
			
			ОтветHTTP = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
			
			СтрТЧ.КодСостояния = ОтветHTTP.КодСостояния;
			
			Ответ = ОтветHTTP.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			СтрТЧ.СообщениеОтвет = Ответ;
			
			Если ОтветHTTP.КодСостояния <> 200 Тогда
				СтрТЧ.СтатусОтправки = ПредопределенноеЗначение("Перечисление.РезультатыОтправкиСообщенийВЕИС.Ошибка");
				ЕстьОшибки = Истина;
			Иначе	
				СтрТЧ.СтатусОтправки = ПредопределенноеЗначение("Перечисление.РезультатыОтправкиСообщенийВЕИС.Отправлен");
			КонецЕсли;
			
			СтрТЧ.ДатаОбмена = ТекущаяДата();

		Исключение
			
			СтрТЧ.СтатусОтправки = ПредопределенноеЗначение("Перечисление.РезультатыОтправкиСообщенийВЕИС.НеОтправлен");
						
			ЕстьОшибки = Истина;
			ТекстОшибки = Нстр("ru='Не удалось отправить сообщение в сервис по причине: %1'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ОписаниеОшибки());
			
			ДобавитьОшибку(СтрТЧ.ТаблицаОшибок, ТекстОшибки, "");
			
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеЛокальнойВыгрузкиФайлов(Результат,ДопПараметры) Экспорт
	//ничего не делаем
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветыОбменаЕИС(ЕстьОшибки)
	КоличествоОбъектовВОчередиСервиса = 0;
		
	ОбработатьОтветыИзСервисаЕИС(ФайлыРезультатаФормирования,РезультатФормирования,ТаблицаПодтвержденияПолученияСообщений,КоличествоОбъектовВОчередиСервиса,ЕстьОшибки);
	
	Если ОтображатьПанельОтборов Тогда
		Элементы.СообщенияОбменаДаннымиЕИС.Обновить();
	КонецЕсли;
	
	Элементы.ЗагруженныеДанныеЕИС.Обновить();
	
	Если ФайлыРезультатаФормирования.Количество() Тогда
		СтруктураКлюча = Новый Структура("Организация,ГУИД",Организация,ФайлыРезультатаФормирования[0].ИдентификаторЗаписиРегистра);
		КлючЗаписи = РегистрыСведений.СообщенияОбменаДаннымиЕИС.СоздатьКлючЗаписи(СтруктураКлюча);
		
		Элементы.СообщенияОбменаДаннымиЕИС.ТекущаяСтрока = КлючЗаписи;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ЗагруженныеДанныеЕИС,"ИдентификаторСообщенияЕИС",ФайлыРезультатаФормирования[0].ИдентификаторСообщенияЕИС,,,ДокументыПоТекущемуОбмену);
		
		Если ДокументыПоТекущемуОбмену Тогда
			ИнформатцияТекущегоОбмена = "Обмен от " + Формат(ФайлыРезультатаФормирования[0].ДатаОбмена,"ДЛФ=DT");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветыИзСервисаЕИС(ТаблицаСообщений, ТаблицаОбъектов, ТаблицаПодтвержденияПолученияСообщений, КоличествоОбъектовВОчередиСервиса,ЕстьОшибки) Экспорт
	
	ОбщаяИнформацияЗагружаемыхДанных = Новый Структура;
	ОбщаяИнформацияЗагружаемыхДанных.Вставить("Id",Неопределено);//идентификатор пакета, нужен для подтверждения загрузки всех сообщений пакета
	ОбщаяИнформацияЗагружаемыхДанных.Вставить("mode",Неопределено);//Режим передачи информации PROD - промышленная эксплуатация TEST - тестовые данные
	ОбщаяИнформацияЗагружаемыхДанных.Вставить("quantityInQueue",Неопределено);//Количество оставшихся в очереди документов по данной организации, 
																			  //если 0, то запрашивать еще раз не надо
	ОбщаяИнформацияЗагружаемыхДанных.Вставить("createDateTime",Неопределено); //дата и время формирования ответа из сервиса
	
	ТаблицаЗагружаемыхФайлов = Новый ТаблицаЗначений;
	
	ТаблицаЗагружаемыхФайлов.Колонки.Добавить("Организация");
	
	//идентификатор документа в очереди, нужен для подтверждения загрузки данного документа
	ТаблицаЗагружаемыхФайлов.Колонки.Добавить("qeueId");
	
	//Кодовое наименование объекта информационного обмена, информация о котором содержится в данном блоке:
	//BO - Бюджетные обязательства;
	//MO - Денежные обязательства;
	//ZKR - Заявки на кассовый расход
	ТаблицаЗагружаемыхФайлов.Колонки.Добавить("objectType");
	
	//Тип сообщения:
	//boProject - Проект сведений о бюджетном обязательстве (БО);
	//boSentForVerification - Сведения о бюджетном обязательстве (БО), направленные на проверку в ТОФК;
	//boRegistred - Сведения о бюджетном обязательстве (БО), поставленные на учет;
	//boDeniedRegistration - Сведения о бюджетном обязательстве (БО), отказанные в постановке на учет;
	//boNotificationPublish - Сведения о бюджетном обязательстве (БО), включенные в размещенное извещение о проведении процедуры закупки;
	//moSentForVerification - Сведения о денежном обязательстве (ДО), направленные на проверку в ТОФК;
	//moRegistred - Сведения о денежном обязательстве (ДО), поставленные на учет;
	//moDeniedRegistration - Сведения о денежном обязательстве (ДО), отказанные в постановке на учет;
	//zkrSentForVerification - Сведения о направленной в ПУР/АСФК заявке на кассовый расход (ЗКР);
	//zkrRegistred - Сведения о зарегистрированной заявке на кассовый расход (ЗКР);
	//zkrDeniedRegistration - Сведения об отказанной заявке на кассовый расход (ЗКР);
	//zkrCanceled - Сведения об аннулированной заявке на кассовый расход (ЗКР);
	//zkrExecuted - Сведения об исполненной заявке на кассовый расход (ЗКР)
	
	//какие типы сообщения будут выгружаться в очередь участника настраивается в личном кабинете ЕИС
	//для коррректной работы стоит загружать только boRegistred, moRegistred, zkrRegistred
	ТаблицаЗагружаемыхФайлов.Колонки.Добавить("messageType");
	
	ТаблицаЗагружаемыхФайлов.Колонки.Добавить("ТекстФайла");//узел export
	ТаблицаЗагружаемыхФайлов.Колонки.Добавить("РезультатОбработки");// 
	ТаблицаЗагружаемыхФайлов.Колонки.Добавить("ТекстОшибки");
		
	СтруктураНужныхПолей = Новый Структура("qeueId,objectType,messageType");
		
	Для Каждого СтрТЧ Из ТаблицаСообщений Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрТЧ.СтатусОтправки)
			ИЛИ СтрТЧ.СтатусОтправки = Перечисления.РезультатыОтправкиСообщенийВЕИС.НеОтправлен Тогда
			//Обмен с сервисом не выполнялся
			Продолжить;
		КонецЕсли;
				
		Если ПустаяСтрока(СтрТЧ.СообщениеОтвет) Тогда
			ДобавитьОшибку(СтрТЧ.ТаблицаОшибок, "Сервис дал пустой ответ", "");
			ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;
		
		ЧитаемыйОтвет = СтрТЧ.СообщениеОтвет;
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ЧитаемыйОтвет);//СтрТЧ.СообщениеОтвет);
		
		ПостроительDOM = Новый ПостроительDOM;
		Попытка
			ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		Исключение
			ДобавитьОшибку(СтрТЧ.ТаблицаОшибок, "Не удалось разобрать ответ", "");
			ЕстьОшибки = Истина;
			Продолжить;
		КонецПопытки;
		
		//проверим, что ответ соответствует формату ЕИС
		//проверяем 2 наименования, потому что в ответе ЕИС есть ошибка - если возвращается сообщение, что записей нет, то имя без "s"
		//getObjectsResponse
		//getObjectResponse
		
		Объект_getObjectsResponse = ДокументDOM.ПолучитьЭлементыПоИмени("getObjectsResponse");
		Объект_getObjectResponse = ДокументDOM.ПолучитьЭлементыПоИмени("getObjectResponse");
		
		Если Объект_getObjectsResponse.Количество() = 0
			И Объект_getObjectResponse.Количество() = 0 Тогда
			
			СтроковоеОписаниеОшибки = Нстр("ru='Ответ из сервиса не соответствует формату. 
				|В ответе отсутствует элемент c данными ""getObjectsResponse"".'");
			
			ДобавитьОшибку(СтрТЧ.ТаблицаОшибок, СтроковоеОписаниеОшибки, "Ошибка обмена с ЕИС.");
									
			СтрТЧ.СтатусОтправки = Перечисления.РезультатыОтправкиСообщенийВЕИС.Ошибка;
			
			Продолжить;
		КонецЕсли;
		
		//Ошибка ЕИС:
		ОбъектСхемы = ДокументDOM.ПолучитьЭлементыПоИмени("errorInfo");
				
		Если ОбъектСхемы.Количество()>0 Тогда
							
			КодОшибки = "";
			УзелСтроковойОшибки = ОбъектСхемы[0].ПолучитьЭлементыПоИмени("code");
			Если УзелСтроковойОшибки.Количество()>0 Тогда
				КодОшибки = УзелСтроковойОшибки[0].ТекстовоеСодержимое;
			КонецЕсли;
			
			ОписаниеОшибки = "";
			УзелСтроковойОшибки = ОбъектСхемы[0].ПолучитьЭлементыПоИмени("message");
			Если УзелСтроковойОшибки.Количество()>0 Тогда
				ОписаниеОшибки = УзелСтроковойОшибки[0].ТекстовоеСодержимое;
			КонецЕсли;
			
			СтроковоеОписаниеОшибки = НСтр("ru='Ошибка ЕИС. Код ошибки: %1, Описание ошибки: %2'");
			
			СтроковоеОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтроковоеОписаниеОшибки,КодОшибки,ОписаниеОшибки);
			
			ДобавитьОшибку(СтрТЧ.ТаблицаОшибок, СтроковоеОписаниеОшибки, "Ошибка обмена с ЕИС.");
									
			Если СтрТЧ.СтатусОтправки <> Перечисления.РезультатыОтправкиСообщенийВЕИС.Ошибка Тогда
				//если ранее не была установлена ошибка, то установим, что не принят 
				СтрТЧ.СтатусОтправки = Перечисления.РезультатыОтправкиСообщенийВЕИС.НеПринятЕИС;
			КонецЕсли;
			
			ЕстьОшибки = Истина;
			
			Продолжить;//в ответе ошибка - запрос не принят
		КонецЕсли;
		
		//Отсутствуют записи в очереди.
		//При получении ВБС данного признака повторный вызов сервиса возможен через 5 минут
		
		ОбъектСхемы = ДокументDOM.ПолучитьЭлементыПоИмени("noRecords");
				
		Если ОбъектСхемы.Количество()>0 Тогда
			//нет смысла смотреть дальше, повторный запрос возможен через 5 минут
			СтроковоеОписаниеОшибки = НСтр("ru='В очереди ЕИС нет данных для данной организации.
				|Попробуйте повторить запрос через 5 минут.'");
			
			ДобавитьОшибку(СтрТЧ.ТаблицаОшибок, "", СтроковоеОписаниеОшибки, Ложь);
			
			СтрТЧ.СтатусОтправки = Перечисления.РезультатыОтправкиСообщенийВЕИС.ДанныхНет;
			
			ОбщегоНазначения.СообщитьПользователю(СтроковоеОписаниеОшибки);
			
			Продолжить;
		КонецЕсли;
		
		ОбъектыСхемы = ДокументDOM.ПолучитьЭлементыПоИмени("index");//основная информация пакета Id, mode, createDateTime
		Если ОбъектыСхемы.Количество() Тогда
			Для Каждого ТекущийУзел Из ОбъектыСхемы[0].ДочерниеУзлы Цикл
					
				ИмяУзла = ?(ЗначениеЗаполнено(ТекущийУзел.ЛокальноеИмя),ТекущийУзел.ЛокальноеИмя,ТекущийУзел.ИмяУзла);
				Если ОбщаяИнформацияЗагружаемыхДанных.Свойство(ИмяУзла) Тогда
					ОбщаяИнформацияЗагружаемыхДанных[ИмяУзла] = ТекущийУзел.ТекстовоеСодержимое; 
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ОбъектыСхемы = ДокументDOM.ПолучитьЭлементыПоИмени("quantityInQueue");//осталось в очереди
		Если ОбъектыСхемы.Количество() Тогда
			Попытка
				ОбщаяИнформацияЗагружаемыхДанных.quantityInQueue = Число(ОбъектыСхемы[0].ТекстовоеСодержимое);
			Исключение
				ОбщаяИнформацияЗагружаемыхДанных.quantityInQueue = 0;
			КонецПопытки;
		КонецЕсли;
		
		//данные загружаемых документов, всегда загружаем данные по одной организации в одном пакете, поэтому не анализируем данные организации
		
		ОбъектыСхемы = ДокументDOM.ПолучитьЭлементыПоИмени("export");
				
		Если ОбъектыСхемы.Количество()>0 Тогда
			Для Каждого ТекОбъектСхемы Из ОбъектыСхемы Цикл
				НоваяСтрокаЗагружаемогоФайла = ТаблицаЗагружаемыхФайлов.Добавить();
				Для Каждого ТекущийУзел Из ТекОбъектСхемы.РодительскийУзел.ДочерниеУзлы Цикл
					
					ИмяУзла = ?(ЗначениеЗаполнено(ТекущийУзел.ЛокальноеИмя),ТекущийУзел.ЛокальноеИмя,ТекущийУзел.ИмяУзла);
					Если СтруктураНужныхПолей.Свойство(ИмяУзла) Тогда
						НоваяСтрокаЗагружаемогоФайла[ИмяУзла] = ТекущийУзел.ТекстовоеСодержимое; 
					ИначеЕсли ИмяУзла = "export" Тогда						
						ЗаписьХМЛ = Новый ЗаписьXML;
			            ЗаписьХМЛ.УстановитьСтроку();						
						ЗаписьDOM = Новый ЗаписьDOM();
						ЗаписьDOM.Записать(ТекущийУзел, ЗаписьХМЛ);
						ТекстФайла = ЗаписьХМЛ.Закрыть();
						НоваяСтрокаЗагружаемогоФайла.ТекстФайла = ТекстФайла;
					КонецЕсли;
				КонецЦикла;		
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
		
	ДатаОбмена = ТаблицаСообщений[0].ДатаОбмена;
		
	СоответствияТипыДокументов = Новый Соответствие;
	Для Каждого ТекЗначение Из Метаданные.Перечисления.ТипыДокументовСообщенийЕИС.ЗначенияПеречисления Цикл
		СоответствияТипыДокументов.Вставить(ТекЗначение.Имя, Истина);	
	КонецЦикла;
	
	ЭтоТестовыйОбмен = (ОбщаяИнформацияЗагружаемыхДанных.mode = "TEST");
	
	ВсеИдентификаторыЗагружены = Истина;
	МассивУспешноОбработанныхИдентификаторов = Новый Массив;
	
	СтатусОтправки = ТаблицаСообщений[0].СтатусОтправки;
	
	Если ТаблицаЗагружаемыхФайлов.Количество() Тогда
		ОбработкаЗагрузки = Обработки.ЗагрузкаСведенийЕИС.Создать();
		ОбработкаЗагрузки.ВидОбмена = ВидОбмена;
			
		БылиОшибки = Ложь;
		Для Каждого СтрТЧ Из ТаблицаЗагружаемыхФайлов Цикл
			
			Результат = Ложь;
			
			ИнформацияОбОшибке = "";
			Если НЕ ЭтоТестовыйОбмен Тогда //если это тестовый обмен, то не загружаем
				ДанныеЗагрузки = Неопределено;
				ТипФайла = "";
				ТипДанных = "";				
				
				Попытка
					ДанныеЗагрузки = ОбработкаЗагрузки.ЗагрузитьДанныеИзТекста(СтрТЧ.ТекстФайла,ТипДанных,ТипФайла,ИнформацияОбОшибке);
				Исключение
					ДанныеЗагрузки = Неопределено;
					ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
				КонецПопытки;
				
				Если ДанныеЗагрузки = Неопределено 
					Или ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
					Результат = Ложь;
				Иначе	
					
					Попытка
						Результат = ОбработкаЗагрузки.ПроверитьЗагрузитьДанные(ДанныеЗагрузки, ИнформацияОбОшибке);
					Исключение
						Результат = Ложь;
						ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
					КонецПопытки;						
					
					//РС ЗагруженныеДанныеЕИС
					Для Каждого ТекОбъект Из ОбработкаЗагрузки.ЗагруженныеОбъекты Цикл
						ЗаписьРС = РегистрыСведений.ЗагруженныеДанныеЕИС.СоздатьМенеджерЗаписи();
						ЗаписьРС.Организация = Организация;
						ЗаписьРС.ИдентификаторСообщенияЕИС = ОбщаяИнформацияЗагружаемыхДанных.Id;
						ЗаписьРС.ИдентификаторДокументаВСообщенииЕИС = СтрТЧ.qeueId;
						ЗаписьРС.ГУИД = Строка(Новый УникальныйИдентификатор);
						ЗаписьРС.ДатаОбмена = ДатаОбмена;
						ЗаписьРС.ЗагруженныйОбъект = ТекОбъект.ЗагруженныйОбъект;					
						ЗаписьРС.Записать();
					КонецЦикла;
					
					ОбработкаЗагрузки.ЗагруженныеОбъекты.Очистить();
					
				КонецЕсли;
			Иначе
				Результат = Истина;
				ИнформацияОбОшибке = НСтр("ru='Это тестовый обмен. При тестовом обмене загрузка объектов не выполняется.'");
			КонецЕсли;
		
			ВсеИдентификаторыЗагружены = ВсеИдентификаторыЗагружены ИЛИ Результат;
			
			Если Результат Тогда
				СтрПодтверждения = ТаблицаПодтвержденияПолученияСообщений.Добавить();
				СтрПодтверждения.ИдентификаторСообщенияЕИС = ОбщаяИнформацияЗагружаемыхДанных.Id;
				СтрПодтверждения.ИдентификаторСообщенияДокумента = СтрТЧ.qeueId;
				СтрПодтверждения.ЭтоТестовыйОбмен = ЭтоТестовыйОбмен;
			Иначе
				БылиОшибки = Истина;
			КонецЕсли;
						
			//РС РазобранныеОтветыЕИС
			ЗаписьРС = РегистрыСведений.РазобранныеОтветыЕИС.СоздатьМенеджерЗаписи();
			ЗаписьРС.Организация = Организация;
			ЗаписьРС.ИдентификаторСообщенияЕИС = ОбщаяИнформацияЗагружаемыхДанных.Id;
			ЗаписьРС.ИдентификаторДокументаВСообщенииЕИС = СтрТЧ.qeueId;
			
			ЗаписьРС.ДанныеДокумента = Новый ХранилищеЗначения(СтрТЧ.ТекстФайла);
			ЗаписьРС.ЕстьОшибка = (Результат = Ложь);
			ЗаписьРС.РезультатОбработки = СокрЛП(ИнформацияОбОшибке);	
			
			ТипДокументаСообщения = Неопределено;
			Если СоответствияТипыДокументов[СтрТЧ.messageType] = Истина Тогда
				ТипДокументаСообщения = Перечисления.ТипыДокументовСообщенийЕИС[СтрТЧ.messageType];
			КонецЕсли;
			ЗаписьРС.ТипДокументаСообщения = ТипДокументаСообщения;
			ЗаписьРС.ДатаОбмена = ДатаОбмена;
			ЗаписьРС.Записать();
		КонецЦикла;
		
		Если БылиОшибки Тогда
			СтатусОтправки = Перечисления.РезультатыОтправкиСообщенийВЕИС.ОбработанЕстьОшибки;	
		Иначе
			СтатусОтправки = Перечисления.РезультатыОтправкиСообщенийВЕИС.ОбработанБезОшибок;	
		КонецЕсли;
	КонецЕсли;
		
	Для Каждого СтрТЧ Из ТаблицаСообщений Цикл
		//РС СообщенияОбменаДаннымиЕИС
		ЗаписьРС = РегистрыСведений.СообщенияОбменаДаннымиЕИС.СоздатьМенеджерЗаписи();
		ЗаписьРС.Организация = Организация;
		ЗаписьРС.ГУИД = Строка(Новый УникальныйИдентификатор);
		
		СтрТЧ.ИдентификаторЗаписиРегистра = ЗаписьРС.ГУИД;
				
		ЗаписьРС.СообщениеЗапрос = Новый ХранилищеЗначения(СтрТЧ.СодержимоеФайла);
		ЗаписьРС.СообщениеОтвет = Новый ХранилищеЗначения(СтрТЧ.СообщениеОтвет);
		ЗаписьРС.ДатаОбмена = СтрТЧ.ДатаОбмена;
		
		ЗаписьРС.ЕстьДанные = ТаблицаЗагружаемыхФайлов.Количество();
		
		СтрТЧ.ЕстьДанные = ЗаписьРС.ЕстьДанные;
		
		ЗаписьРС.ИдентификаторСообщенияЕИС = ОбщаяИнформацияЗагружаемыхДанных.Id;
		
		СтрТЧ.ИдентификаторСообщенияЕИС = ЗаписьРС.ИдентификаторСообщенияЕИС;
		
		ЗаписьРС.ИдентификаторСообщенияИБ = СтрТЧ.ИдентификаторСообщения;
		
		ЗаписьРС.СтатусОтправки = СтатусОтправки;
		
		ЗаписьРС.ТестовыйОбмен = СтрТЧ.ТестовыйОбмен;		
			
		ЗаписьРС.ЕстьОшибка = СтрТЧ.ТаблицаОшибок.НайтиСтроки(Новый Структура("ЭтоОшибка",Истина)).Количество();
		ЗаписьРС.РезультатОбработки = ПолучитьТекстОшибкиИзТаблицы(СтрТЧ.ТаблицаОшибок);
		
		ЗаписьРС.Записать();
		
	КонецЦикла;
	
	Если ОбщаяИнформацияЗагружаемыхДанных.quantityInQueue <> Неопределено
		И ОбщаяИнформацияЗагружаемыхДанных.quantityInQueue>0 Тогда 
		КоличествоОбъектовВОчередиСервиса = ОбщаяИнформацияЗагружаемыхДанных.quantityInQueue;//получили не все данные, можно запросить еще раз
	КонецЕсли;
	
	
	КоличествоСообщенийПолучено = ТаблицаЗагружаемыхФайлов.Количество();
	КоличествоСообщенийОтправлено = 0;
	ОбщееКолВо = 0;
	Для Каждого СтрТЧ Из ФайлыРезультатаФормирования Цикл
		ОбщееКолВо = ОбщееКолВо + 1;
		Если НЕ ЗначениеЗаполнено(СтрТЧ.СтатусОтправки)
			ИЛИ СтрТЧ.СтатусОтправки = ПредопределенноеЗначение("Перечисление.РезультатыОтправкиСообщенийВЕИС.НеОтправлен") Тогда
			//Обмен не выполнялся
			Продолжить;
		КонецЕсли;
		КоличествоСообщенийОтправлено = КоличествоСообщенийОтправлено+1;
	КонецЦикла;
			
	ТекстСообщения = НСтр("ru='Обмен %1. Отправлено сообщений %2 из %3, получено объектов с данными %4.'");
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ТекущаяДата(),КоличествоСообщенийОтправлено,ОбщееКолВо,КоличествоСообщенийПолучено);
    ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьОшибку(ТаблицаОшибок, ТекстОшибки, ПолеФайла = "",ЭтоОшибка = Истина)
	
	Ошибка = ТаблицаОшибок.Добавить();
	Ошибка.ПолеФайла = ПолеФайла;
	Ошибка.Ошибка = ТекстОшибки;
	Ошибка.ЭтоОшибка = ЭтоОшибка;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстОшибкиИзТаблицы(ТаблицаОшибок)
	Если ТаблицаОшибок.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	МассивСтрок = Новый Массив;
	Для Каждого СтрТЧ Из ТаблицаОшибок Цикл
		ТекстОшибки = СтрШаблон("%1%2",?(ЗначениеЗаполнено(СтрТЧ.ПолеФайла),СтрТЧ.ПолеФайла+": ",""),СтрТЧ.Ошибка);
		МассивСтрок.Добавить(ТекстОшибки);
	КонецЦикла;
	Возврат СтрСоединить(МассивСтрок,Символы.ПС);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстДокумента(Организация,Знач ИдентификаторСообщенияЕИС,Знач ИдентификаторДокументаВСообщенииЕИС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РазобранныеОтветыЕИС.ДанныеДокумента КАК ДанныеДокумента
		|ИЗ
		|	РегистрСведений.РазобранныеОтветыЕИС КАК РазобранныеОтветыЕИС
		|ГДЕ
		|	РазобранныеОтветыЕИС.Организация = &Организация
		|	И РазобранныеОтветыЕИС.ИдентификаторСообщенияЕИС = &ИдентификаторСообщенияЕИС
		|	И РазобранныеОтветыЕИС.ИдентификаторДокументаВСообщенииЕИС = &ИдентификаторДокументаВСообщенииЕИС";
	
	Запрос.УстановитьПараметр("ИдентификаторДокументаВСообщенииЕИС", ИдентификаторДокументаВСообщенииЕИС);
	Запрос.УстановитьПараметр("ИдентификаторСообщенияЕИС", ИдентификаторСообщенияЕИС);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстДокумента = "";
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекстДокумента = ВыборкаДетальныеЗаписи.ДанныеДокумента.Получить();
	КонецЕсли;
	
	Возврат ТекстДокумента;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаСохраненияФайловОбмена(Результат, ДополнительныеПараметры) Экспорт 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаСохраненияФайловОбмена", ЭтотОбъект, ДополнительныеПараметры);
	Если ДополнительныеПараметры.Этап = "Начало" Тогда
		
		ДополнительныеПараметры.Вставить("ВыгруженныеФайлы",Новый Массив);
		
		ДополнительныеПараметры.Этап = "РезультатПодключенияРасширения";
		БюджетнаяОтчетностьКлиентПереопределяемый.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "РезультатПодключенияРасширения" Тогда
		
		ПоместитьВАрхив = Результат = Ложь и ДополнительныеПараметры.Список.Количество() > 1;
		РезультатВыгрузки = СформироватьВыгрузку(ДополнительныеПараметры.Список, ПоместитьВАрхив);
		
		
		ДополнительныеПараметры.Вставить("РасширениеПодключено",Результат);
		ДополнительныеПараметры.Вставить("ПоместитьВАрхив",ПоместитьВАрхив);
	    ДополнительныеПараметры.Вставить("РезультатВыгрузки", РезультатВыгрузки);
		
		Если РезультатВыгрузки.Количество() <> 0 Тогда
			
			Если Результат Тогда 
				
				ДополнительныеПараметры.Этап = "ВыгрузкаСРасширением";
				ВыполнитьОбработкуОповещения(ОписаниеОповещения);
				
			Иначе 
				
				ДополнительныеПараметры.Этап = "ВыгрузкаБезРасширения";
				ВыполнитьОбработкуОповещения(ОписаниеОповещения);
				
			КонецЕсли;
			
		Иначе 
			
			ДополнительныеПараметры.Этап = "Завершение";
			ВыполнитьОбработкуОповещения(ОписаниеОповещения);
			
		КонецЕсли;
		
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "ВыгрузкаСРасширением" Тогда 	
		
		Если ДополнительныеПараметры.РезультатВыгрузки.Количество() = 1 Тогда
			РежимДиалога = РежимДиалогаВыбораФайла.Сохранение;
		Иначе
			РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
		КонецЕсли;
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалога);
		Диалог.Фильтр = НСтр("ru = '(*.zip)|*.zip'");
		
		ПолучаемыеФайлы = Новый Массив;
		Для Каждого ОписаниеФайла Из ДополнительныеПараметры.РезультатВыгрузки Цикл
			ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ОписаниеФайла.ИмяФайла, ОписаниеФайла.Адрес));
		КонецЦикла;
		
		ДополнительныеПараметры.Этап = "ВыгрузкаСРасширениемЗавершение";
		НачатьПолучениеФайлов(ОписаниеОповещения,ПолучаемыеФайлы,Диалог, Истина);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "ВыгрузкаСРасширениемЗавершение" Тогда 	
		
		Если Результат <> Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеПараметры.ВыгруженныеФайлы, Результат);
		КонецЕсли;
		
		ДополнительныеПараметры.Этап = "Завершение";
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "ВыгрузкаБезРасширения" Тогда 
		
		
		ПолучаемыйФайл = ДополнительныеПараметры.РезультатВыгрузки[0];
		ПолучитьФайл(ПолучаемыйФайл.Адрес, ПолучаемыйФайл.ИмяФайла, Истина);
		
		ДополнительныеПараметры.ВыгруженныеФайлы.Добавить(ПолучаемыйФайл);
		
		ДополнительныеПараметры.Этап = "Завершение";
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "Завершение" Тогда 
		
		Если ДополнительныеПараметры.ВыгруженныеФайлы.Количество() > 0 Тогда 
			
			ТекстОповещения = НСтр("ru = 'Выгрузка файлов обмена'");
			
			ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выгружено: %1'"),
			СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(ДополнительныеПараметры.ВыгруженныеФайлы.Количество(),НСтр("ru = 'файл,файла,файлов'")));
			
			ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснения, БиблиотекаКартинок.Успешно32);
			
		Иначе 
			
			ТекстОповещения = НСтр("ru = 'Выгрузка файлов обмена'");
			ТекстПояснения = НСтр("ru = 'Не удалось выгрузить файлы обмена'");
			
			ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснения, БиблиотекаКартинок.Ошибка32);

		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьВыгрузку(Знач ВыгружаемыеОбъекты, Знач ПоместитьВАрхив = Ложь)

	ВыгруженныеФайлы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СообщенияОбменаДаннымиЕИС.ГУИД КАК ГУИД,
	|	СообщенияОбменаДаннымиЕИС.ДатаОбмена КАК ДатаОтправкиСообщенияВСервис,
	|	СообщенияОбменаДаннымиЕИС.СообщениеЗапрос КАК getObjectRequest,
	|	СообщенияОбменаДаннымиЕИС.СообщениеОтвет КАК getObjectsResponse,
	|	СообщенияПодтвержденияПолученияДанныхЕИС.СообщениеЗапросПодтверждения КАК ackRequest,
	|	СообщенияПодтвержденияПолученияДанныхЕИС.СообщениеОтветПодтверждения КАК ackResponse
	|ИЗ
	|	РегистрСведений.СообщенияОбменаДаннымиЕИС КАК СообщенияОбменаДаннымиЕИС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СообщенияПодтвержденияПолученияДанныхЕИС КАК СообщенияПодтвержденияПолученияДанныхЕИС
	|		ПО СообщенияОбменаДаннымиЕИС.ИдентификаторСообщенияЕИС = СообщенияПодтвержденияПолученияДанныхЕИС.ИдентификаторСообщенияЕИС
	|ГДЕ
	|	СообщенияОбменаДаннымиЕИС.ГУИД В(&ИдентификаторыСообщения)";
	
	Запрос.УстановитьПараметр("ИдентификаторыСообщения", ВыгружаемыеОбъекты);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если ПоместитьВАрхив Тогда
		ИмяАрхива     = ПолучитьИмяВременногоФайла("zip");
		КаталогАрхива = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
		СоздатьКаталог(КаталогАрхива);
		АрхиваторОбщий= Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	ТаблицаИменИПояснений = Новый ТаблицаЗначений;
	ТаблицаИменИПояснений.Колонки.Добавить("ИмяЗначения");
	ТаблицаИменИПояснений.Колонки.Добавить("ИмяФайла");
	
	НовСтр = ТаблицаИменИПояснений.Добавить();
	НовСтр.ИмяЗначения = "getObjectRequest";
	НовСтр.ИмяФайла = "1. getObjectRequest (запрос).txt";
	
	НовСтр = ТаблицаИменИПояснений.Добавить();
	НовСтр.ИмяЗначения = "getObjectsResponse";
	НовСтр.ИмяФайла = "2. getObjectsResponse (ответ).txt";
		
	НовСтр = ТаблицаИменИПояснений.Добавить();
	НовСтр.ИмяЗначения = "ackRequest";
	НовСтр.ИмяФайла = "3. ackRequest (запрос).txt";
	
	НовСтр = ТаблицаИменИПояснений.Добавить();
	НовСтр.ИмяЗначения = "ackResponse";
	НовСтр.ИмяФайла = "4. ackResponse (ответ).txt";
	
	
	Пока Выборка.Следующий() Цикл
		ТекИмяАрхива     = ПолучитьИмяВременногоФайла("zip");
		ТекКаталогАрхива = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
		СоздатьКаталог(ТекКаталогАрхива);
		ТекАрхиватор = Новый ЗаписьZipФайла(ТекИмяАрхива);
		
		СохраняемоеИмяОтдельногоАрхива = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла("Обмен с ЕИС от "+Выборка.ДатаОтправкиСообщенияВСервис +".zip"," ");
		
		Для Каждого СтрТЧ Из ТаблицаИменИПояснений Цикл
			Если ТипЗнч(Выборка[СтрТЧ.ИмяЗначения]) = Тип("ХранилищеЗначения") Тогда
				ЗаписываемоеЗначение = Выборка[СтрТЧ.ИмяЗначения].Получить();
				Если ЗначениеЗаполнено(ЗаписываемоеЗначение) Тогда
					ТекИмя = ПолучитьИмяВременногоФайла("txt");
					ЗаписьТекста = Новый ЗаписьТекста(ТекИмя,КодировкаТекста.UTF8);
					ЗаписьТекста.Записать(ЗаписываемоеЗначение);
					ЗаписьТекста.Закрыть();
					
					ДДанные = Новый ДвоичныеДанные(ТекИмя);				
					Если Сред(ДДанные, 1, 8) = "EF BB BF" Тогда
						Строка64 = Base64Строка(ДДанные);
						Строка64 = Прав(Строка64,СтрДлина(Строка64)-4); // Удаляем 3 символа BOM
						ДДанные = Base64Значение(Строка64);
						ДДанные.Записать(ТекИмя);
						
						Строка64 = Неопределено
					КонецЕсли;
					ДДанные = Неопределено;
					
					ПереместитьФайл(ТекИмя, ТекКаталогАрхива + СтрТЧ.ИмяФайла);
					ТекАрхиватор.Добавить(ТекКаталогАрхива + СтрТЧ.ИмяФайла);
			
				КонецЕсли;
			//ИначеЕсли СтрТЧ.ИмяЗначения = "GetResponseRequest" Тогда
			//	//если ответа с данными на запрос нет (сервис еще не прислал или потерял),
			//	//то выгрузим файлы запросов и ответов по всем форматам запроса данных "GetResponseRequest",
			//	//чтобы предоставить в тех.поддержку все возможные файлы.
			//	
			//	ВыгрузитьПустыеФайлыЗапросаОчередиИОтвета(ТекКаталогАрхива,ТекАрхиватор);
				
			КонецЕсли;
				
		КонецЦикла;
		
		ТекАрхиватор.Записать();
		
		Если ПоместитьВАрхив Тогда
			
			ПереместитьФайл(ТекИмяАрхива, КаталогАрхива + СохраняемоеИмяОтдельногоАрхива);
			АрхиваторОбщий.Добавить(КаталогАрхива + СохраняемоеИмяОтдельногоАрхива);
			
		Иначе
			
			ОписаниеФайла = ОписаниеВыгруженногоФайла(ТекИмяАрхива, СохраняемоеИмяОтдельногоАрхива);
			ВыгруженныеФайлы.Добавить(ОписаниеФайла);
			УдалитьФайлы(ТекИмяАрхива);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПоместитьВАрхив Тогда
		
		АрхиваторОбщий.Записать();
		ДанныеФайла   = Новый ДвоичныеДанные(ИмяАрхива);
		ОписаниеФайла = ОписаниеВыгруженногоФайла(ИмяАрхива, "Файлы обмена "+Формат(ТекущаяДатаСеанса(),"ДФ=yyyyMMdd")+".zip");
			
		ВыгруженныеФайлы.Добавить(ОписаниеФайла);
		УдалитьФайлы(ИмяАрхива);
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ВыгруженныеФайлы);

КонецФункции // СформироватьВыгрузку()

&НаСервере
Функция ОписаниеВыгруженногоФайла(Знач ПолноеИмя, Знач ХранимоеИмя = "")

	Описание = Новый Структура;
	
	Файл = Новый Файл(ПолноеИмя);
	
	Описание.Вставить("ИмяФайла", ?(ПустаяСтрока(ХранимоеИмя),Файл.Имя,ХранимоеИмя));
	
	Если Файл.Существует() Тогда
		ДанныеФайла = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		Описание.Вставить("Адрес", ПоместитьВоВременноеХранилище(ДанныеФайла,УникальныйИдентификатор));
	Иначе
		Описание.Вставить("Адрес", Неопределено);
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции // ОписаниеВыгруженногоФайла()

&НаСервере
Процедура ОтображениеТестовогоОбмена()
	Элементы.ФормаВыполнятьТестовыйОбмен.Пометка = ТестовыйОбмен;
	Элементы.ГруппаТестовыйОбмен.Видимость = ТестовыйОбмен;	
КонецПроцедуры

&НаСервере
Процедура ИзменитьОтборажениеПанелиОтборовНаСервере()
	
	Элементы.ОтображениеПанелиОтборов.Пометка = ОтображатьПанельОтборов;
	Элементы.ГруппаОтборИИстория.Видимость = ОтображатьПанельОтборов;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДокументПовторноНаСервере(Знач ИдентификаторСообщенияЕИС,Знач ИдентификаторДокументаВСообщенииЕИС,ДатаОбмена)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	РазобранныеОтветыЕИС.ДанныеДокумента КАК ДанныеДокумента
		|ИЗ
		|	РегистрСведений.РазобранныеОтветыЕИС КАК РазобранныеОтветыЕИС
		|ГДЕ
		|	РазобранныеОтветыЕИС.Организация = &Организация
		|	И РазобранныеОтветыЕИС.ИдентификаторСообщенияЕИС = &ИдентификаторСообщенияЕИС
		|	И РазобранныеОтветыЕИС.ИдентификаторДокументаВСообщенииЕИС = &ИдентификаторДокументаВСообщенииЕИС";
	
	Запрос.УстановитьПараметр("ИдентификаторДокументаВСообщенииЕИС", ИдентификаторДокументаВСообщенииЕИС);
	Запрос.УстановитьПараметр("ИдентификаторСообщенияЕИС", ИдентификаторСообщенияЕИС);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТекстФайла = "";
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекстФайла = ВыборкаДетальныеЗаписи.ДанныеДокумента.Получить();
	КонецЕсли;
	
    ОбработкаЗагрузки = Обработки.ЗагрузкаСведенийЕИС.Создать();
	ОбработкаЗагрузки.ВидОбмена = ВидОбмена;
				
	Результат = Ложь;
		
	ИнформацияОбОшибке = "";
	ДанныеЗагрузки = Неопределено;
	ТипФайла = "";
	ТипДанных = "";				
				
	Попытка
		ДанныеЗагрузки = ОбработкаЗагрузки.ЗагрузитьДанныеИзТекста(ТекстФайла,ТипДанных,ТипФайла,ИнформацияОбОшибке);
	Исключение
		ДанныеЗагрузки = Неопределено;
		ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
	КонецПопытки;
	
	Если ДанныеЗагрузки = Неопределено 
		Или ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
		Результат = Ложь;
	Иначе	
		
		Попытка
			Результат = ОбработкаЗагрузки.ПроверитьЗагрузитьДанные(ДанныеЗагрузки, ИнформацияОбОшибке);
		Исключение
			Результат = Ложь;
			ИнформацияОбОшибке = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());	
		КонецПопытки;						
		
		//РС ЗагруженныеДанныеЕИС
		Для Каждого ТекОбъект Из ОбработкаЗагрузки.ЗагруженныеОбъекты Цикл
			ЗаписьРС = РегистрыСведений.ЗагруженныеДанныеЕИС.СоздатьМенеджерЗаписи();
			ЗаписьРС.Организация = Организация;
			ЗаписьРС.ИдентификаторСообщенияЕИС = ИдентификаторСообщенияЕИС;
			ЗаписьРС.ИдентификаторДокументаВСообщенииЕИС = ИдентификаторДокументаВСообщенииЕИС;
			ЗаписьРС.ГУИД = Строка(Новый УникальныйИдентификатор);
			ЗаписьРС.ДатаОбмена = ДатаОбмена;
			ЗаписьРС.ЗагруженныйОбъект = ТекОбъект.ЗагруженныйОбъект;					
			ЗаписьРС.Записать();
		КонецЦикла;
		
		ОбработкаЗагрузки.ЗагруженныеОбъекты.Очистить();
		
	КонецЕсли;
											
	//РС РазобранныеОтветыЕИС
	ЗаписьРС = РегистрыСведений.РазобранныеОтветыЕИС.СоздатьМенеджерЗаписи();
	ЗаписьРС.Организация = Организация;
	ЗаписьРС.ИдентификаторСообщенияЕИС = ИдентификаторСообщенияЕИС;
	ЗаписьРС.ИдентификаторДокументаВСообщенииЕИС = ИдентификаторДокументаВСообщенииЕИС;
	
	ЗаписьРС.Прочитать();
	Если ЗаписьРС.Выбран() Тогда
		ЗаписьРС.ЕстьОшибка = (Результат = Ложь);
		ЗаписьРС.РезультатОбработки = СокрЛП(ИнформацияОбОшибке);	
	
		ЗаписьРС.Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
		ТекстСообщения = НСтр("ru='Не удалось загрузить данные из файла по причине:
			|%1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,ИнформацияОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Элементы.ЗагруженныеДанныеЕИС.Обновить();
КонецПроцедуры


#КонецОбласти