
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Результат = Новый Структура;
	Результат.Вставить("Ключ", НаборЗаписей.Отбор.Ключ.Значение);
	Результат.Вставить("ЕстьАктивныеРазрезы", Ложь);
		
	ЕстьАктивныеРазрезы(Результат);
		
	Оповестить("ИзменениеНастроекКонтроляСанкционирования", Результат);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Стр Из НаборЗаписей Цикл
		Стр.Использовать = Истина;
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	Для Каждого Стр Из НаборЗаписей Цикл
		Стр.Использовать = Ложь;
	КонецЦикла;
	
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЕстьАктивныеРазрезы(Результат)
	Для Каждого Стр Из НаборЗаписей Цикл
		Если Стр.Использовать Тогда
			Результат.ЕстьАктивныеРазрезы = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецФункции

#КонецОбласти
