
#Область ПрограммныйИнтерфейс

// Устанавливает условное оформление полей БСО в документах учета МЗ.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура УстановитьУсловноеОформлениеПолейБСОвДокументахМЗ(Форма) Экспорт

	УсловноеОформление = Форма.УсловноеОформление;
	
	// Текст подсказки полей БСО
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыСерияБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.СерияБСО", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Серия'"));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыНачальныйНомерБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.НачальныйНомерБСО", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '№ начальный'"));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыКонечныйНомерБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.КонечныйНомерБСО", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '№ конечный'"));
	
	// Видимость полей БСО
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыСерияБСО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыНачальныйНомерБСО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыКонечныйНомерБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.ЭтоБСО", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

// Сохранить параметры выбора КЭК.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ЭлементИлиЭлементы - ПолеВвода
//                     - Массив из ПолеВвода
Процедура СохранитьПараметрыВыбораКЭК(Форма, Знач ЭлементИлиЭлементы) Экспорт
	
	СтруктураПроверки = Новый Структура("НастройкиСвязейПараметровВыбораИзМетаданных", "РеквизитНеЗадан");
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, Форма);
	
	Если СтруктураПроверки.НастройкиСвязейПараметровВыбораИзМетаданных = "РеквизитНеЗадан" Тогда
		НовыйРеквизит = Новый РеквизитФормы("НастройкиСвязейПараметровВыбораИзМетаданных",
			Новый ОписаниеТипов("Неопределено"));
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	
	СохраненныеЗначения = Новый Структура;
	Если ТипЗнч(ЭлементИлиЭлементы) <> Тип("Массив") Тогда
		ЭлементИлиЭлементы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЭлементИлиЭлементы); // Массив из ПолеВвода
	КонецЕсли;
	
	Для Каждого Элемент Из ЭлементИлиЭлементы Цикл
		Настройки = Новый Структура("СвязиПараметровВыбора, ПараметрыВыбора");
		Настройки.СвязиПараметровВыбора = СвязиПараметровВыбораВМассив(Элемент.СвязиПараметровВыбора);
		Настройки.ПараметрыВыбора = ПараметрыВыбораВМассив(Элемент.ПараметрыВыбора);
		СохраненныеЗначения.Вставить(Элемент.Имя, Новый ФиксированнаяСтруктура(Настройки));
	КонецЦикла;
	
	Форма["НастройкиСвязейПараметровВыбораИзМетаданных"] = Новый ФиксированнаяСтруктура(СохраненныеЗначения);
	
КонецПроцедуры

// Установить параметры выбора КЭК.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ПолеВвода
//  СчетУчета - ПланСчетовСсылка.ЕПСБУ
//  Дата - Дата
//  Организация - СправочникСсылка.Организации
Процедура УстановитьПараметрыВыбораКЭК(Форма, Элемент, СчетУчета, Дата, Организация) Экспорт
	
	СтруктураПроверки = Новый Структура("НастройкиСвязейПараметровВыбораИзМетаданных", "РеквизитНеЗадан");
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, Форма);
	Если СтруктураПроверки.НастройкиСвязейПараметровВыбораИзМетаданных = "РеквизитНеЗадан"
		Или СтруктураПроверки.НастройкиСвязейПараметровВыбораИзМетаданных = Неопределено Тогда
		// Параметры из метаданных еще не сохранены.
		Возврат;
	КонецЕсли;

	Если СчетУчета = БухгалтерскийУчет.СчетПоКоду("01.33", Дата, Организация) Тогда
		СписокКЭК = Новый СписокЗначений;
		СписокКЭК.ЗагрузитьЗначения(КЭКДляСчета_01_33(Дата, Организация));
		Параметры = Новый Массив;
		Параметры.Добавить(Новый ПараметрВыбора("ДополнительныйОтбор.ОграниченияКЭК", СписокКЭК));
		СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
		ПараметрыВыбора = Новый ФиксированныйМассив(Параметры);
	Иначе
		
		Настройки = Неопределено;
		Форма.НастройкиСвязейПараметровВыбораИзМетаданных.Свойство(Элемент.Имя, Настройки);
		Если ТипЗнч(Настройки) = Тип("ФиксированнаяСтруктура") Тогда
			СвязиПараметровВыбора = СвязиПараметровВыбораИзМассива(Настройки.СвязиПараметровВыбора);
			ПараметрыВыбора = ПараметрыВыбораИзМассива(Настройки.ПараметрыВыбора);
		Иначе
			СвязиПараметровВыбора = Новый ФиксированныйМассив(Новый Массив);
			ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		КонецЕсли;
	КонецЕсли;

	Элемент.СвязиПараметровВыбора = СвязиПараметровВыбора;
	Элемент.ПараметрыВыбора = ПараметрыВыбора;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполнить данные счетов учета МЗВФорме.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ПараметрыЗаполнения - см. УправлениеМатериальнымиЗапасами.ПараметрыЗаполненияДанныхСчетовУчетаМЗВФорме
//  ДанныеСчетов - Неопределено
//               - см. УправлениеМатериальнымиЗапасами.СчетаУчетаМатериальныхЗапасов
Процедура ЗаполнитьДанныеСчетовУчетаМЗВФорме(Форма, ПараметрыЗаполнения, ДанныеСчетов = Неопределено) Экспорт
	
	Если ДанныеСчетов = Неопределено Тогда
		ДанныеСчетов = УправлениеМатериальнымиЗапасами.СчетаУчетаМатериальныхЗапасов(ПараметрыЗаполнения);
	КонецЕсли;
	ШаблонСчета = НСтр("ru = '%1.%2'");
	
	НаименованиеСчета105 = "";
	НаименованияСчетов = Новый Массив;
	КодыСчетов = Новый Массив;
	
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.ДатаСчета) Тогда
		ДатаСчета = ПараметрыЗаполнения.ДатаСчета;
	Иначе
		ДатаСчета = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	ДополнитьНаименованиеСчета(НаименованияСчетов, КодыСчетов, "105.00", ДатаСчета, ПараметрыЗаполнения.Организация);
	
	Если ПараметрыЗаполнения.Включать113 Тогда
		ДополнитьНаименованиеСчета(НаименованияСчетов, КодыСчетов, "113.00", ДатаСчета, ПараметрыЗаполнения.Организация);
	КонецЕсли;
	
	ВестиУчетПоРеализацииКомиссионныхТРУ = ПолучитьФункциональнуюОпцию("ВестиУчетПоРеализацииТоваровУслугКомитентов");
	
	Если ВестиУчетПоРеализацииКомиссионныхТРУ И ПараметрыЗаполнения.Включать0233 Тогда
		ДополнитьНаименованиеСчета(НаименованияСчетов, КодыСчетов, "02.33", ДатаСчета, ПараметрыЗаполнения.Организация);
	КонецЕсли;
	
	ВестиУчетПоЗакупкеКомиссионныхТРУ = ПолучитьФункциональнуюОпцию("ВестиУчетПоЗакупкеТоваровУслугДляКомитентов");
	
	Если ВестиУчетПоЗакупкеКомиссионныхТРУ И ПараметрыЗаполнения.Включать0234 Тогда
		ДополнитьНаименованиеСчета(НаименованияСчетов, КодыСчетов, "02.34", ДатаСчета, ПараметрыЗаполнения.Организация);
	КонецЕсли;
	
	НаименованиеСчета105 = СтрШаблон(НСтр("ru = '%1. %2'"),
										 СтрСоединить(КодыСчетов, ", "),
										 СтрСоединить(НаименованияСчетов, ", "));
	
	Счет105 = БухгалтерскийУчет.СчетПоКоду("105.00", ДатаСчета, ПараметрыЗаполнения.Организация);
	
	Для каждого ТекДанныеСчета Из ДанныеСчетов Цикл
		Если ПараметрыЗаполнения.СписокВыбора.НайтиПоЗначению(ТекДанныеСчета.Счет) = Неопределено Тогда
			Если (ПараметрыЗаполнения.Включать113 ИЛИ ПараметрыЗаполнения.Включать0233) И ТекДанныеСчета.Счет = Счет105 Тогда
				НаименованиеСчета = НаименованиеСчета105;
			Иначе
				НаименованиеСчета = СтрШаблон(ШаблонСчета, ТекДанныеСчета.Код, ТекДанныеСчета.Наименование);
			КонецЕсли;
			ПараметрыЗаполнения.СписокВыбора.Добавить(ТекДанныеСчета.Счет, НаименованиеСчета);
		КонецЕсли;
		Если ТекДанныеСчета.ДополнительноеСубконто <> Неопределено Тогда
			ПараметрыЗаполнения.ВидыСубконтоСчетов.Вставить(ТекДанныеСчета.ТекущийСчет, ТекДанныеСчета.ДополнительноеСубконто);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НаименованиеСчета105_113(Знач Дата, Организация) Экспорт
	Счет105 = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	Счет113 = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	НаименованиеСчета105 = "";
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;

	Счет105 = БухгалтерскийУчет.СчетПоКоду("105.00", Дата, Организация);
	Свойства105 = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет105);
	КодыСчетов = Новый Массив;
	НаименованияСчетов = Новый Массив;
	КодыСчетов.Добавить(Свойства105.Код);
	НаименованияСчетов.Добавить(Свойства105.Наименование);
	
	Счет113 = БухгалтерскийУчет.СчетПоКоду("113.00", Дата, Организация);
	Если ЗначениеЗаполнено(Счет113) Тогда
		Свойства113 = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет113);
		КодыСчетов.Добавить(Свойства113.Код);
		НаименованияСчетов.Добавить(Свойства113.Наименование);
	КонецЕсли;
		
	НаименованиеСчета105 = СтрШаблон(НСтр("ru = '%1. %2'"),
									 СтрСоединить(КодыСчетов, ", "),
									 СтрСоединить(НаименованияСчетов, ", "));
	
	Возврат НаименованиеСчета105;
КонецФункции

Процедура ДокументПриЧтенииНаСервере(Форма) Экспорт
	
	
	
КонецПроцедуры

// Документ при создании на сервере.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура ДокументПриСозданииНаСервере(Форма) Экспорт
	ПроверитьЗаполнениеДатыВНовомОбъекте(Форма.Объект);
	РезервированиеНФА.ПриСозданииНаСервере(Форма);
КонецПроцедуры

// Устанавливает свойства (автоотметка незаполненного) реквизитов ЦМО и Подразделение.
// Если на форме есть реквизиты "УчетИмуществаКазныПоЦМО" и "УчетИмуществаКазныПоПодразделениям", то они будут
// установлены.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//   * Объект - ДанныеФормыСтруктура:
//    ** Организация - СправочникСсылка.Организации
//    ** Дата - Дата
//    ** СчетУчета - ПланСчетовСсылка.ЕПСБУ
//   РеквизитыЦМО - Строка
//                  - Массив из Строка
//   РеквизитыПодразделение - Строка
//                  - Массив из Строка
//
Процедура УстановитьПараметрыУчетаИКПоЦМОиПодразделениям(Форма, Знач РеквизитыЦМО, Знач РеквизитыПодразделение) Экспорт
	Если ТипЗнч(РеквизитыЦМО) <> Тип("Массив") Тогда
		РеквизитыЦМО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(РеквизитыЦМО);
	КонецЕсли;
	Если ТипЗнч(РеквизитыПодразделение) <> Тип("Массив") Тогда
		РеквизитыПодразделение = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(РеквизитыПодразделение);
	КонецЕсли;
	
	ПараметрыУчетаИК = УправлениеМатериальнымиЗапасами.ПараметрыУчетаИКпоЦМОиПодразделениям(Форма.Объект.СчетУчета,
		Форма.Объект.Организация, Форма.Объект.Дата);

	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, РеквизитыЦМО,
		"АвтоотметкаНезаполненного", ПараметрыУчетаИК.УчетПоЦМО);
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, РеквизитыПодразделение,
		"АвтоотметкаНезаполненного", ПараметрыУчетаИК.УчетПоПодразделениям);
		
	ПараметрыФормы = Новый Структура("УчетИмуществаКазныПоЦМО, УчетИмуществаКазныПоПодразделениям",
		ПараметрыУчетаИК.УчетПоЦМО, ПараметрыУчетаИК.УчетПоПодразделениям);
	ЗаполнитьЗначенияСвойств(Форма, ПараметрыФормы);
	
КонецПроцедуры

// Устанавливает значение реквизита КФО.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//  * КэшПараметров - Структура:
//   ** УчетнаяПолитика - Структура:
//    *** ДатаПоследнегоИзменения - Дата
//  Объект - ДанныеФормыСтруктура:
//  * Организация - СправочникСсылка.Организации
//  * ИФО - СправочникСсылка.ИсточникиФинансовогоОбеспечения
//  * КФО - ПеречислениеСсылка.КВД
Процедура УстановитьКФОИмуществоКазны(Форма, Объект) Экспорт
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ДопустимыеКФО = БухгалтерскийУчетПовтИсп.КФОПоУчетнойПолитике(
			Объект.Организация, Объект.ИФО, Форма.КэшПараметров.УчетнаяПолитика.ДатаПоследнегоИзменения);
		Если ДопустимыеКФО.Найти(ПредопределенноеЗначение("Перечисление.КВД.Бюджет")) <> Неопределено Тогда
			Объект.КФО = ПредопределенноеЗначение("Перечисление.КВД.Бюджет");
		Иначе
			Объект.КФО = ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
		КонецЕсли;
	Иначе
		Объект.КФО = ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

// Установить свойства поля КЭК.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
Процедура УстановитьСвойстваПоляКЭК(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КЭКДляСчета_01_33(Дата, Организация)
	
	КЭК340 = БухгалтерскийУчетПовтИсп.КЭКПоКоду("340");
	
	Если БухгалтерскийУчетКлиентСервер.ПрименяетсяДетальныйКЭК340и440(Дата, Организация) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОСГУ.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КОСГУ КАК КОСГУ
		|ГДЕ
		|	НЕ КОСГУ.ПометкаУдаления
		|	И КОСГУ.Родитель = &КЭК340";
		Запрос.УстановитьПараметр("КЭК340", КЭК340);
		СписокКЭК = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе
		СписокКЭК = Новый Массив;
		СписокКЭК.Добавить(БухгалтерскийУчетПовтИсп.КЭКПоКоду("340"));
	КонецЕсли;
	Возврат СписокКЭК;
	
КонецФункции

Функция СвязиПараметровВыбораВМассив(СвязиПараметровВыбора)
	Результат = Новый Массив;
	Если ТипЗнч(СвязиПараметровВыбора) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Связь Из СвязиПараметровВыбора Цикл
			Результат.Добавить(Новый ФиксированнаяСтруктура("Имя, ПутьКДанным, ИзменениеЗначения",
				Связь.Имя, Связь.ПутьКДанным, Связь.ИзменениеЗначения));
		КонецЦикла;
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(Результат);
КонецФункции

Функция СвязиПараметровВыбораИзМассива(СвязиПараметровВыбора)
	Результат = Новый Массив;
	Для Каждого Связь Из СвязиПараметровВыбора Цикл
		Результат.Добавить(Новый СвязьПараметраВыбора(Связь.Имя, Связь.ПутьКДанным, Связь.ИзменениеЗначения));
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
КонецФункции

Функция ПараметрыВыбораВМассив(ПараметрыВыбора)
	Результат = Новый Массив;
	Если ТипЗнч(ПараметрыВыбора) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Параметр Из ПараметрыВыбора Цикл
			Результат.Добавить(Новый ФиксированнаяСтруктура("Имя, Значение",
				Параметр.Имя, Параметр.Значение));
		КонецЦикла;
	КонецЕсли;
	Возврат Новый ФиксированныйМассив(Результат);
КонецФункции

Функция ПараметрыВыбораИзМассива(ПараметрыВыбора)
	Результат = Новый Массив;
	Для Каждого Параметр Из ПараметрыВыбора Цикл
		Результат.Добавить(Новый ПараметрВыбора(Параметр.Имя, Параметр.Значение));
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
КонецФункции

Процедура ПроверитьЗаполнениеДатыВНовомОбъекте(Объект)
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		ЗаполнениеРеквизитовОбъектов.ЗаполнитьДатуПриКопировании(Объект, Неопределено);
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДополнитьНаименованиеСчета(НаименованияСчетов, КодыСчетов, СчетУчета, ДатаСчета, Организация)
	
	СчетУчетаПланаСчетов = БухгалтерскийУчет.СчетПоКоду(СчетУчета, ДатаСчета, Организация);
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаПланаСчетов) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваСчетаУчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетУчетаПланаСчетов);
	КодыСчетов.Добавить(СвойстваСчетаУчета.Код);
	Если НЕ СвойстваСчетаУчета.Код = "02.34" Тогда
		НаименованияСчетов.Добавить(СвойстваСчетаУчета.Наименование);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти