#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 1 Тогда
		Если Не ЗначениеЗаполнено(ЭтотОбъект[0].ФормулаДата) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
					Метаданные.РегистрыСведений.ДанныеТиповыхОпераций.Ресурсы.Найти("ФормулаДата").Синоним),,
				"ФормулаДата", "Запись",Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ЭтотОбъект[0].ФормулаОрганизация) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
					Метаданные.РегистрыСведений.ДанныеТиповыхОпераций.Ресурсы.Найти("ФормулаОрганизация").Синоним),,
				"ФормулаОрганизация", "Запись",Отказ);
		КонецЕсли;
		Если ЭтотОбъект[0].ИспользуетсяВнешняяПроцедура
			И Не ЗначениеЗаполнено(ЭтотОбъект[0].ИмяВнешнейПроцедуры) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,
					Метаданные.РегистрыСведений.ДанныеТиповыхОпераций.Ресурсы.Найти("ИмяВнешнейПроцедуры").Синоним),,
				"ИмяВнешнейПроцедуры", "Запись",Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
