#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьСпособыРазмещенияЗаказов() Экспорт
	
	Макет = ПолучитьМакет("СпособыРазмещения");
	
	ВысотаМакета = Макет.ВысотаТаблицы;
	
	Спр = Справочники.СпособыРазмещенияЗаказов;

	Для ТекСтрока=1 По ВысотаМакета Цикл
		
		Код = СокрЛП(Макет.Область("R"+ТекСтрока+"C1").Текст);
		Наименование = Макет.Область("R"+ТекСтрока+"C2").Текст;
		
		Если НЕ ЗначениеЗаполнено(Код) Тогда
			Продолжить;
		КонецЕсли;	
		
		НайденныйЭлемент = Спр.НайтиПоКоду(Код);
			
		Если НайденныйЭлемент.Пустая() Тогда
			ЭлементОбъект = Спр.СоздатьЭлемент();
		Иначе
			ЭлементОбъект = НайденныйЭлемент.ПолучитьОбъект();
		КонецЕсли;	 
		
		ЭлементОбъект.Код 					= Код;
		ЭлементОбъект.Наименование 			= Наименование;
		ЭлементОбъект.НаименованиеПолное 	= Наименование;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ЭлементОбъект);
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
