#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает в пустом справочнике элементы Завтрак, Обед, Ужин.
// Вызывается при первоначальном заполнении
//
Процедура ЗаполнитьПоУмолчанию() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ПриемыПищи.Ссылка
	                      |ИЗ
	                      |	Справочник.ПриемыПищи КАК ПриемыПищи");
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		ПриемПищи = Справочники.ПриемыПищи.СоздатьЭлемент();
		ПриемПищи.Наименование = "Завтрак";
		ПриемПищи.Записать();
		
		ПриемПищи = Справочники.ПриемыПищи.СоздатьЭлемент();
		ПриемПищи.Наименование = "Обед";
		ПриемПищи.Записать();
		
		ПриемПищи = Справочники.ПриемыПищи.СоздатьЭлемент();
		ПриемПищи.Наименование = "Ужин";
		ПриемПищи.Записать();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Перем КатегорияДовольствующихся;
	Перем СтрокаПоиска;
	
	Если Параметры.Отбор.Свойство("КатегорияДовольствующихся", КатегорияДовольствующихся)
		И ЗначениеЗаполнено(КатегорияДовольствующихся) Тогда
		СтандартнаяОбработка = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 51
		|	ПриемыПищи.Ссылка,
		|	ПриемыПищи.Код,
		|	ПриемыПищи.Наименование
		|ИЗ
		|	Справочник.ПриемыПищи КАК ПриемыПищи
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК Поле1
		|			ИЗ
		|				Справочник.КатегорииДовольствующихся.ПриемыПищи КАК КатегорииДовольствующихсяПриемыПищи
		|			ГДЕ
		|				КатегорииДовольствующихсяПриемыПищи.Ссылка = &КатегорияДовольствующихся
		|				И КатегорииДовольствующихсяПриемыПищи.Используется = ИСТИНА
		|				И КатегорииДовольствующихсяПриемыПищи.ПриемПищи = ПриемыПищи.Ссылка)
		|	И &УсловиеСтрокаПоиска
		|АВТОУПОРЯДОЧИВАНИЕ";
		Если Параметры.Свойство("СтрокаПоиска", СтрокаПоиска) И ЗначениеЗаполнено(СтрокаПоиска) Тогда
			Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска + "%");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтрокаПоиска", "ПриемыПищи.Наименование ПОДОБНО &СтрокаПоиска");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСтрокаПоиска", "ИСТИНА");
		КонецЕсли;
		Запрос.УстановитьПараметр("КатегорияДовольствующихся", КатегорияДовольствующихся);
		ДанныеВыбора = Новый СписокЗначений;
		Если Параметры.Свойство("ПолучатьКодИСсылку") Тогда
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ДанныеВыбора.Добавить(Новый Структура("Код, Ссылка", Выборка.Код, Выборка.Ссылка), Выборка.Наименование);
			КонецЦикла;
		Иначе
			ДанныеВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти

#КонецЕсли
