#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.Ребенок.Организация <> Запись.ГруппаДетскогоУчреждения.Владелец Тогда
			Отказ = Истина;
			СтрокаОтказа = СтрШаблон(НСтр("ru = 'Ребенок не может быть включен в эту группу!
				|Группа ""%1"" относится к другой организации.'"), Запись.ГруппаДетскогоУчреждения);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(СтрокаОтказа);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
