#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура первоначальной загрузки соответствия счетов ОС
//
// Параметры:
//  ИмяМакета	 - Строка	 - имя макета, из которого будут загружены счета.
//								Если не указан, то будут загружены счета из всех макетов.
//  Очищать		 - Булево	 - если Истина, то записи, у которых счет учета отсутствует в загружаемых макетах, будут удалены.
//
Процедура ЗаполнитьПоУмолчанию(ИмяМакета = "", Очищать = Ложь, Регистрировать = Истина, ИмяОбласти = Неопределено) Экспорт
	
	Данные = РегистрыСведений.СоответствиеСчетовОС.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Если ИмяМакета = "" Тогда
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию"		, '20171231', ИмяОбласти);
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию2018"	, '20180101', ИмяОбласти);
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию2021"	, '20210101', ИмяОбласти);
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию2023"	, '20230101', ИмяОбласти);
	ИначеЕсли ИмяМакета = "ЗначенияПоУмолчанию" Тогда
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию"		, '20171231', ИмяОбласти);
	ИначеЕсли ИмяМакета = "ЗначенияПоУмолчанию2018" Тогда
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию2018"	, '20180101', ИмяОбласти);
	ИначеЕсли ИмяМакета = "ЗначенияПоУмолчанию2021" Тогда
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию2021"	, '20210101', ИмяОбласти);
	ИначеЕсли ИмяМакета = "ЗначенияПоУмолчанию2023" Тогда
		ЗагрузитьЭлементы(Данные, "ЗначенияПоУмолчанию2023"	, '20230101', ИмяОбласти);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Не Очищать Тогда
		// Получаем текущие данные регистра
		ТекущиеДанные = РегистрыСведений.СоответствиеСчетовОС.СоздатьНаборЗаписей();
		ТекущиеДанные.Прочитать();
		// Добавляем данные по счетам, не предусмотренных по умолчанию
		Для Каждого Запись Из ТекущиеДанные Цикл
			Если Данные.Найти(Запись.СчетОС, "СчетОС") = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Данные.Добавить(), Запись);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Сохраняем данные
	Данные.Сортировать("СчетОС");
	НаборЗаписей = РегистрыСведений.СоответствиеСчетовОС.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Данные);
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей,, Регистрировать);
	
КонецПроцедуры

Процедура ЗагрузитьЭлементы(Данные, ИмяМакета, НаДату, ИмяОбласти) Экспорт
	
	СпСчетов = ПолучитьМакет(ИмяМакета);
	
	Если ИмяОбласти <> Неопределено Тогда
		СпСчетов = СпСчетов.ПолучитьОбласть(ИмяОбласти);
	КонецЕсли;
	
	Для Сч = 1 По СпСчетов.ВысотаТаблицы Цикл
		
		Если ЗначениеЗаполнено(СпСчетов.Область(Сч,1).Текст) Тогда
			Продолжить;
		КонецЕсли;
		
		СчетУчета = ПолучитьСчетИзМакета(СпСчетов, Сч, 2, НаДату);
		
		Если Не ЗначениеЗаполнено(СчетУчета) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = Данные.Найти(СчетУчета, "СчетОС");
		Если НоваяЗапись = Неопределено Тогда
			НоваяЗапись = Данные.Добавить();
		КонецЕсли;
		
		НоваяЗапись.СчетОС						= СчетУчета;
		НоваяЗапись.СчетАмортизации				= ПолучитьСчетИзМакета(СпСчетов, Сч, 3, НаДату);
		НоваяЗапись.СчетОбесценения				= ПолучитьСчетИзМакета(СпСчетов, Сч, 4, НаДату);
		НоваяЗапись.ЗабалансовыйСчет			= ПолучитьСчетИзМакета(СпСчетов, Сч, 5, НаДату);
		НоваяЗапись.СчетПередачиВАренду			= ПолучитьСчетИзМакета(СпСчетов, Сч, 6, НаДату);
		НоваяЗапись.СчетПередачиВПользование	= ПолучитьСчетИзМакета(СпСчетов, Сч, 7, НаДату);
		НоваяЗапись.СчетПередачиВУправление		= ПолучитьСчетИзМакета(СпСчетов, Сч, 8, НаДату);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает структуру, содержащую соответствующие значения для переданного счета ОС.
// Если соответствующая строка не найдена, то структура содержит пустые ссылки счетов
// Если записей несколько, то возвращаются значения любой из них
//
// Параметры:
//	СчетОС - ПланСчетовСсылка
//	
// Возвращаемое значение:
//	Структура - ключи соответствуют именам измерений и ресурсов регистра
//
Функция ПолучитьСоответствиеСчетов(СчетОС) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СчетОС"						, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	Результат.Вставить("СчетАмортизации"			, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	Результат.Вставить("ЗабалансовыйСчет"			, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	Результат.Вставить("СчетПередачиВАренду"		, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	Результат.Вставить("СчетПередачиВПользование"	, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	Результат.Вставить("СчетПередачиВУправление"	, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеСчетовОС.СчетОС КАК СчетОС,
	|	СоответствиеСчетовОС.СчетАмортизации КАК СчетАмортизации,
	|	СоответствиеСчетовОС.ЗабалансовыйСчет КАК ЗабалансовыйСчет,
	|	СоответствиеСчетовОС.СчетПередачиВАренду КАК СчетПередачиВАренду,
	|	СоответствиеСчетовОС.СчетПередачиВПользование КАК СчетПередачиВПользование,
	|	СоответствиеСчетовОС.СчетПередачиВУправление КАК СчетПередачиВУправление
	|ИЗ
	|	РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|ГДЕ
	|	СоответствиеСчетовОС.СчетОС = &СчетОС";
	
	Запрос.УстановитьПараметр("СчетОС", СчетОС);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСчетИзМакета(ТабДок, НомерСтроки, НомерКолонки, НаДату)
	
	СчетТекст = ТабДок.Область(НомерСтроки,НомерКолонки).Текст;
	Если ПустаяСтрока(СчетТекст) Тогда
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	
	Счет = БухгалтерскийУчет.СчетПоКоду(СчетТекст, НаДату);
	
	Возврат Счет;
	
КонецФункции

Процедура СкорректироватьСчета(ТаблицаПроводок) Экспорт
	
	Если ТаблицаПроводок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Период		= ТаблицаПроводок[0].Период;
	Организация	= ТаблицаПроводок[0].Организация;
	Межотчет	= ТаблицаПроводок[0].ВидМежотчетногоПериода;
	
	Если ЗначениеЗаполнено(Межотчет) Тогда
		Возврат;
	КонецЕсли;
	
	Если Период >= '20210101' Тогда
		Возврат;
	КонецЕсли;
	
	Если КонецДня(Период) = КонецГода('20200101') Тогда
		ТипДок = ТипЗнч(ТаблицаПроводок[0].Регистратор);
		Если ТипДок = Тип("ДокументСсылка.ВводНачальныхОстатков")
			Или ТипДок = Тип("ДокументСсылка.ВводНачальныхОстатковОС") тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// 198н
	
	СписокЗамены = Новый Массив;
	СписокЗамены.Добавить("114.71:20210101-114.61:20180101");
	СписокЗамены.Добавить("114.72:20210101-114.62:20180101");
	СписокЗамены.Добавить("114.73:20210101-114.63:20180101");
	
	СписокЗамены.Добавить("25.11:20210101-25.11:00010101");
	СписокЗамены.Добавить("25.13:20210101-25.13:00010101");
	СписокЗамены.Добавить("25.21:20210101-25.21:00010101");
	СписокЗамены.Добавить("25.22:20210101-25.22:00010101");
	СписокЗамены.Добавить("25.31:20210101-25.31:00010101");
	СписокЗамены.Добавить("25.32:20210101-25.32:00010101");
	СписокЗамены.Добавить("25.51:20210101-25.51:00010101");
	СписокЗамены.Добавить("25.52:20210101-25.52:00010101");
	СписокЗамены.Добавить("25.54:20210101-25.54:00010101");
	СписокЗамены.Добавить("25.55:20210101-25.55:00010101");
	СписокЗамены.Добавить("25.57:20210101-25.57:20180101");
	
	СписокЗамены.Добавить("26.11:20210101-26.11:00010101");
	СписокЗамены.Добавить("26.13:20210101-26.13:00010101");
	СписокЗамены.Добавить("26.21:20210101-26.21:00010101");
	СписокЗамены.Добавить("26.22:20210101-26.22:00010101");
	СписокЗамены.Добавить("26.31:20210101-26.31:00010101");
	СписокЗамены.Добавить("26.32:20210101-26.32:00010101");
	СписокЗамены.Добавить("26.51:20210101-26.51:00010101");
	СписокЗамены.Добавить("26.52:20210101-26.52:00010101");
	СписокЗамены.Добавить("26.54:20210101-26.54:00010101");
	СписокЗамены.Добавить("26.55:20210101-26.55:00010101");
	СписокЗамены.Добавить("26.57:20210101-26.57:20180101");
	
	ЗаменитьСчетаВПроводках(ТаблицаПроводок, СписокЗамены);
	
	// 64н
	
	ДатаПерехода = БухгалтерскийУчет.ДатаПереходаНаРедакциюПС(Организация, '20180101');
	Если Не ЗначениеЗаполнено(ДатаПерехода) Или Период > ДатаПерехода Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗамены = Новый Массив;
	СписокЗамены.Добавить("104.52:20180101-104.58:00010101");
	СписокЗамены.Добавить("104.54:20180101-104.59:00010101");
	
	ЗаменитьСчетаВПроводках(ТаблицаПроводок, СписокЗамены);
	
КонецПроцедуры

Процедура ЗаменитьСчетаВПроводках(ТаблицаПроводок, СписокЗамены)
	
	СчетаЗамены = Новый Соответствие;
	
	Для Каждого СтрокаЗамены Из СписокЗамены Цикл
		
		ЧастиСчетов = СтрРазделить(СтрокаЗамены, "-", Ложь);
		ЧастиСчета1 = СтрРазделить(ЧастиСчетов[0], ":", Ложь);
		ЧастиСчета2 = СтрРазделить(ЧастиСчетов[1], ":", Ложь);
		
		СчетНовый   = БухгалтерскийУчет.СчетПоКоду(ЧастиСчета1[0], Дата(ЧастиСчета1[1]));
		СчетСтарый  = БухгалтерскийУчет.СчетПоКоду(ЧастиСчета2[0], Дата(ЧастиСчета2[1]));
		
		Если ЗначениеЗаполнено(СчетНовый) И ЗначениеЗаполнено(СчетСтарый) Тогда
			СчетаЗамены.Вставить(СчетНовый, СчетСтарый);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Проводка Из ТаблицаПроводок Цикл
		
		СчетСтарый = СчетаЗамены[Проводка.СчетДт];
		Если ЗначениеЗаполнено(СчетСтарый) Тогда
			Проводка.СчетДт = СчетСтарый;
		КонецЕсли;
		
		СчетСтарый = СчетаЗамены[Проводка.СчетКт];
		Если ЗначениеЗаполнено(СчетСтарый) Тогда
			Проводка.СчетКт = СчетСтарый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли