#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ТабельУчетаПосещаемостиДетей.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	// Движения по регистрам сведений
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "ТабельУчетаПосещаемостиДетей");
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЭтотОбъект.ВидТабеля = 0 Тогда
		НевыходыСводно.Очистить();
		ОчиститьНекорректныеНепосещения();
	ИначеЕсли ЭтотОбъект.ВидТабеля = 1 Тогда
		Невыходы.Очистить();
		ЕстьОшибкиВТаблицеНевыходов(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.Невыходы.Очистить();
	ЭтотОбъект.НевыходыСводно.Очистить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЕстьОшибкиВТаблицеНевыходов(Отказ)
	КолРабДней = ЭтотОбъект.КоличествоРабочихДней;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.НомерСтроки КАК НомерСтроки,
	               |	Таб.ОплНевыходы КАК ОплНевыходы,
	               |	Таб.НеоплНевыходы КАК НеоплНевыходы
	               |ПОМЕСТИТЬ втТаб
	               |ИЗ
	               |	&Таб КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таб.НомерСтроки КАК НомерСтроки,
				   |	Таб.ОплНевыходы КАК ОплНевыходы,
				   |	Таб.НеоплНевыходы КАК НеоплНевыходы,
	               |	Таб.ОплНевыходы + Таб.НеоплНевыходы КАК Невыходы
	               |ИЗ
	               |	втТаб КАК Таб
	               |ГДЕ
	               |	Таб.ОплНевыходы + Таб.НеоплНевыходы > &КолРабДней";
	Запрос.УстановитьПараметр("Таб", ЭтотОбъект.НевыходыСводно.Выгрузить());
	Запрос.УстановитьПараметр("КолРабДней", КолРабДней);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		
		Для Каждого Стр Из Результат Цикл
			ТекстСообщения = НСтр("ru='Суммарное количество непосещений (%1) превышает количество рабочих дней в месяце (%2)!'");
			ОбщегоНазначения.СообщитьПользователю(
											СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Стр.Невыходы, КолРабДней), , 
											"НевыходыСводно[" + (Стр.НомерСтроки - 1) + "]." + ?(Стр.НеоплНевыходы = 0, "ОплНевыходы", "НеоплНевыходы"),
											"Объект");
		КонецЦикла;                                  
	КонецЕсли;	
КонецПроцедуры

Процедура ОчиститьНекорректныеНепосещения()
	
	 // В таблице непосещений могут быть отмечены только дети, зачисленные в этот момент в группу.
	Если ЭтотОбъект.РодительскаяПлатаДопУслуги = 0 Тогда
		ТаблицаДетей = РодительскаяПлата.СписокДетейДляТабеляОсновнаяПрограмма(НачалоМесяца(ЭтотОбъект.НачалоПериода), КонецМесяца(ЭтотОбъект.КонецПериода),
																				?(ЗначениеЗаполнено(ЭтотОбъект.Группа), ЭтотОбъект.Группа, ЭтотОбъект.Организация));
	Иначе
		ТаблицаДетей = РодительскаяПлата.СписокДетейДляТабеляДополнительнаяПрограмма(НачалоМесяца(ЭтотОбъект.НачалоПериода), КонецМесяца(ЭтотОбъект.КонецПериода),
																				?(ЗначениеЗаполнено(ЭтотОбъект.Группа), ЭтотОбъект.Группа, ЭтотОбъект.Организация));															
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДетей.Ребенок КАК Ребенок,
	|	ТаблицаДетей.НачалоПериода КАК НачалоПериода,
	|	ТаблицаДетей.ОкончаниеПериода КАК ОкончаниеПериода
	|ПОМЕСТИТЬ ВТ_ТаблицаДетей
	|ИЗ
	|	&ТаблицаДетей КАК ТаблицаДетей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНевыходы.Ребенок КАК Ребенок,
	|	ТаблицаНевыходы.ДатаНевыхода КАК ДатаНевыхода,
	|	ТаблицаНевыходы.ПричиныНепосещения КАК ПричиныНепосещения,
	|	ТаблицаНевыходы.ВидНевыхода КАК ВидНевыхода
	|ПОМЕСТИТЬ ВТ_ТаблицаНевыходы
	|ИЗ
	|	&ТаблицаНевыходы КАК ТаблицаНевыходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаНевыходы.Ребенок КАК Ребенок,
	|	ВТ_ТаблицаНевыходы.ДатаНевыхода КАК ДатаНевыхода,
	|	ВТ_ТаблицаНевыходы.ПричиныНепосещения КАК ПричиныНепосещения,
	|	ВТ_ТаблицаНевыходы.ВидНевыхода КАК ВидНевыхода,
	|	ВТ_ТаблицаДетей.НачалоПериода КАК НачалоПериода,
	|	ВТ_ТаблицаДетей.ОкончаниеПериода КАК ОкончаниеПериода
	|ПОМЕСТИТЬ ВТ_ВсеНепосещения
	|ИЗ
	|	ВТ_ТаблицаНевыходы КАК ВТ_ТаблицаНевыходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДетей КАК ВТ_ТаблицаДетей
	|		ПО ВТ_ТаблицаНевыходы.Ребенок = ВТ_ТаблицаДетей.Ребенок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ВсеНепосещения.Ребенок КАК Ребенок,
	|	ВТ_ВсеНепосещения.ДатаНевыхода КАК ДатаНевыхода,
	|	ВТ_ВсеНепосещения.ПричиныНепосещения КАК ПричиныНепосещения,
	|	ВТ_ВсеНепосещения.ВидНевыхода КАК ВидНевыхода
	|ИЗ
	|	ВТ_ВсеНепосещения КАК ВТ_ВсеНепосещения
	|ГДЕ
	|	ВТ_ВсеНепосещения.ДатаНевыхода >= ВТ_ВсеНепосещения.НачалоПериода
	|	И ВТ_ВсеНепосещения.ДатаНевыхода <= ВТ_ВсеНепосещения.ОкончаниеПериода";
		
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("ТаблицаДетей", ТаблицаДетей);
	Запрос.УстановитьПараметр("ТаблицаНевыходы", ЭтотОбъект.Невыходы.Выгрузить());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.Невыходы.Загрузить(Результат);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли