
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
	ОбновитьОформлениеПоляКод();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("КлассификаторИсточниковФинансирования.ИзменениеЭлемента",Объект.Ссылка,ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ОбновитьОформлениеПоляКод();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	
	ПриИзмененииЭлементаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	ПриИзмененииКодаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПриказыОБК.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ПриказыОБК.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ДатаНачалаДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеДействияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОкончаниеДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииЭлементаСервер()

	Если НЕ ЗначениеЗаполнено(Объект.Элемент) Тогда
		СуффиксКода = "00"
	Иначе
		СуффиксКода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Элемент,"Код");
	КонецЕсли;

	ОбновитьСуффиксКода(СуффиксКода);
	
КонецПроцедуры // ПриИзмененииЭлементаСервер()

&НаСервере
Процедура ОбновитьСуффиксКода(СуффиксКода)

	Если СтрДлина(Объект.Код) >= 4 Тогда
		Объект.Код = Лев(Объект.Код, 4) + СуффиксКода;
	КонецЕсли;

КонецПроцедуры // ОбновитьСуффиксКода()

&НаСервере
Процедура ПриИзмененииКодаСервер()

	КодЭлемента = Сред(Объект.Код, 5, 2);
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЭлементыБюджета.Ссылка
		|ИЗ
		|	Справочник.ЭлементыБюджета КАК ЭлементыБюджета
		|ГДЕ
		|	ЭлементыБюджета.ПометкаУдаления = ЛОЖЬ
		|	И ЭлементыБюджета.Код = &Код");
	Запрос.УстановитьПараметр("Код", КодЭлемента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Объект.Элемент <> Выборка.Получить(0) Тогда
			Объект.Элемент = Выборка.Получить(0);
			ОбновитьСуффиксКода(КодЭлемента);
		КонецЕсли;
	Иначе
		Объект.Элемент = Неопределено;
		ОбновитьСуффиксКода("00");
	КонецЕсли;
	
	ОбновитьОформлениеПоляКод();
	
КонецПроцедуры // ПриИзмененииКода()

&НаСервере
Процедура ДатаНачалаДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПриказыОБК") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ДатаНачалаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ДатаНачала");
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОкончаниеДействияОбработкаВыбораНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПриказыОБК") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ОкончаниеДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ДатаНачала") - 86400;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьОформлениеПоляКод()
		
	Латиница = БюджетнаяКлассификацияКлиентСервер.СимволыЛатиницы();
	Кириллица = БюджетнаяКлассификацияКлиентСервер.СимволыКириллицы();
	ЦветЛатиницы = Новый Цвет(0,0,255);
	ЦветКириллицы = WebЦвета.ЗеленыйЛес; 
	
	МассивСтрок = Новый Массив;
	
	ЕстьОформление = Ложь;
	
	ЖирныйШрифт = Новый Шрифт(,,Истина);
	
	ПолныйКод = "";	
	КодГруппыПодгруппы = "0000";
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		КодГруппыПодгруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец,"Код");		
	КонецЕсли;
	
	ПолныйКод = КодГруппыПодгруппы + " " +?(ЗначениеЗаполнено(Объект.Код),Объект.Код,"000000");
	
	Если ЗначениеЗаполнено(ПолныйКод) Тогда
				
		Для Инд = 1 По СтрДлина(ПолныйКод) Цикл
			ТекБлок = Сред(ПолныйКод,Инд,1);
			
			Если Найти(Латиница,ВРег(ТекБлок))>0 Тогда
				ЕстьОформление = Истина;
				ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока(ТекБлок,ЖирныйШрифт,ЦветЛатиницы);
				МассивСтрок.Добавить(ТекущийФорматированныйБлок);
			ИначеЕсли Найти(Кириллица,ВРег(ТекБлок))>0 Тогда
				ЕстьОформление = Истина;
				ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока(ТекБлок,ЖирныйШрифт,ЦветКириллицы);
				МассивСтрок.Добавить(ТекущийФорматированныйБлок);				
			Иначе
				МассивСтрок.Добавить(ТекБлок);	
			КонецЕсли;
			
		КонецЦикла;
		
		МассивСтрок.Добавить(" хххх ххх");
		
		ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока("  Кир.",ЖирныйШрифт,ЦветКириллицы);
		МассивСтрок.Добавить(ТекущийФорматированныйБлок);
		МассивСтрок.Добавить("/");
		ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока("Лат.",ЖирныйШрифт,ЦветЛатиницы);
		МассивСтрок.Добавить(ТекущийФорматированныйБлок);
	КонецЕсли;
	
	Если ЕстьОформление Тогда
		Элементы.ГруппаСтраницыОформления.ТекущаяСтраница = Элементы.ГруппаОформление;
	Иначе
		Элементы.ГруппаСтраницыОформления.ТекущаяСтраница = Элементы.ГруппаПустая;	
	КонецЕсли;
	
	Элементы.ДекорацияКод.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
КонецПроцедуры

#КонецОбласти