#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Дата = Параметры.Дата;
	ИФО = Параметры.ИФО;
	ВидПеремещения = Параметры.ВидПеремещения;
	Если ТипЗнч(Параметры.МассивСчетов) = Тип("Массив") Тогда
		СписокСчетов.ЗагрузитьЗначения(Параметры.МассивСчетов);
	КонецЕсли;
	
	ЗаполнитьСтрокиТаблицы();
	Если ТипЗнч(Параметры.НачальныеЗначения) = Тип("Структура") Тогда
		УстановитьНачальныеЗначения(Параметры.НачальныеЗначения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРеквизитов

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	ТекущиеДанные.ИзменятьРеквизит = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	ТипРеквизита = ?(ТекущиеДанные.ТипРеквизита.Типы().Количество() = 1, ТекущиеДанные.ТипРеквизита.Типы()[0], Неопределено);
	
	Если ТипРеквизита = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		
		ПараметрыФормы = ПараметрыФормыДляВыбораСчета();
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.ЗначениеРеквизита);
		ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ТипРеквизита = Тип("СправочникСсылка.КлассификационныеПризнакиСчетов") Тогда
		
		ПараметрыФормы = ПараметрыФормыДляВыбораКПС();
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.ЗначениеРеквизита);
		ОткрытьФорму("Справочник.КлассификационныеПризнакиСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ТипРеквизита = Неопределено Тогда
		
		СчетУчета = Неопределено;
		Если ТекущиеДанные.ИмяРеквизита = "ДополнительнаяАналитикаСчета"
			ИЛИ ТекущиеДанные.ИмяРеквизита = "ДополнительнаяАналитикаСчетаДебета" Тогда
			Для каждого ТекСтр Из ТаблицаРеквизитов Цикл
			
				Если ТекущиеДанные.ИмяРеквизита = "ДополнительнаяАналитикаСчета" И ТекСтр.ИмяРеквизита = "СчетУчета" Тогда
					СчетУчета = ТекСтр.ЗначениеРеквизита;
					Прервать;
				КонецЕсли;
			
				Если ТекущиеДанные.ИмяРеквизита = "ДополнительнаяАналитикаСчетаДебета" И ТекСтр.ИмяРеквизита = "СчетДебета" Тогда
					СчетУчета = ТекСтр.ЗначениеРеквизита;
					Прервать;
				КонецЕсли;
			
			КонецЦикла;
			
			Если СчетУчета = Неопределено Тогда
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если СчетУчета = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ДопСубконто = УправлениеМатериальнымиЗапасамиКлиентСервер.ДополнительнаяАналитикаСчетаУчетаМатериалов(СчетУчета, Организация);
		
		Если (ТекущиеДанные.ИмяРеквизита = "ДополнительнаяАналитикаСчета"
			ИЛИ ТекущиеДанные.ИмяРеквизита = "ДополнительнаяАналитикаСчетаДебета")
			И Не ЗначениеЗаполнено(ДопСубконто) Тогда
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
		
		ТипСубконто = ПолучитьТипСубконто(ДопСубконто);
		
		СтандартнаяОбработка = Ложь;
		ДополнительныеПараметры = Новый Структура("Элемент, ТекущиеДанные", Элемент, ТекущиеДанные);
		
		Если ТипСубконто.Типы().Количество() = 1 Тогда
			
			ПродолжитьВыборДопСубконто(ТипСубконто.Типы()[0], ДополнительныеПараметры);
			
		Иначе
			
			СписокТипов = Новый СписокЗначений;
			СписокТипов.ЗагрузитьЗначения(ТипСубконто.Типы());
			СписокТипов.СортироватьПоЗначению();
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыборДопСубконто", ЭтотОбъект, ДополнительныеПараметры);
			СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещения, НСтр("ru='Выбор типа данных'"));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ВыполнитьАвтоподборЗначенияРеквизита(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ВыполнитьАвтоподборЗначенияРеквизита(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВозвращаемоеЗначение = Новый Структура;
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
	
		Если СтрокаТаблицы.ИзменятьРеквизит Тогда
			ВозвращаемоеЗначение.Вставить(СтрокаТаблицы.ИмяРеквизита, СтрокаТаблицы.ЗначениеРеквизита);
		КонецЕсли;
	
	КонецЦикла;
	ОповеститьОВыборе(ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПродолжитьВыборДопСубконто(Знач ВыбранноеЗначение, ДополнительныеПараметры) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений") Тогда
		ВыбранноеЗначение = ВыбранноеЗначение.Значение;
	КонецЕсли;
	
	Элемент = ДополнительныеПараметры.Элемент;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ПолноеИмяТипа = БухгалтерскийУчетКлиент.ПолноеИмяПоТипуЗначения(ВыбранноеЗначение);
	Если Не ЗначениеЗаполнено(ПолноеИмяТипа) Тогда
		// Используется стандартное открытие формы выбора
		Возврат;
	КонецЕсли;
	
	ИмяОткрываемойФормы = ПолноеИмяТипа + ".ФормаВыбора";
	ПараметрыФормы = Новый Структура("Отбор, РежимВыбора", Новый Структура, Истина);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.ЗначениеРеквизита);
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтоподборЗначенияРеквизита(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	
	ТипРеквизита = ?(ТекущиеДанные.ТипРеквизита.Типы().Количество() = 1, ТекущиеДанные.ТипРеквизита.Типы()[0], Неопределено);
	
	Если ТипРеквизита = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		
		ПараметрыФормы = ПараметрыФормыДляВыбораСчета();
		ПараметрыФормы.Вставить("СтрокаПоиска", Текст);
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ЭлементГруппа", Ложь));
		ДанныеВыбора = ПолучитьДанныеВыбора(ТипРеквизита, ПараметрыФормы);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ТипРеквизита = Тип("СправочникСсылка.КлассификационныеПризнакиСчетов") Тогда
		
		ПараметрыФормы = ПараметрыФормыДляВыбораКПС();
		ПараметрыФормы.Вставить("СтрокаПоиска", Текст);
		ДанныеВыбора = ПолучитьДанныеВыбора(ТипРеквизита, ПараметрыФормы);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьНачальныеЗначения(НачальныеЗначения)
	ЗначениеСвойства = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
		Если НачальныеЗначения.Свойство(СтрокаТаблицы.ИмяРеквизита, ЗначениеСвойства) Тогда
			СтрокаТаблицы.ЗначениеРеквизита = ЗначениеСвойства;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиТаблицы()

	ЭтоИзменениеСчетов = ВидПеремещения = ПредопределенноеЗначение("Перечисление.ВидыПеремещенияМЗ.ДвижениеМатериаловСИзменениемСчета");
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита           = "КФО";
	НоваяСтрока.ПредставлениеРеквизита = НСтр("ru = 'КФО'");
	НоваяСтрока.ТипРеквизита           = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");

	Если ВидПеремещения <> Перечисления.ВидыПеремещенияМЗ.ПеремещениеМеждуНТТ Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита           = "СчетУчета";
		НоваяСтрока.ПредставлениеРеквизита = СтрШаблон(НСтр("ru = 'Счет учета%1'"), ?(ЭтоИзменениеСчетов, НСтр("ru = ' (до изм.)'"), ""));
		НоваяСтрока.ТипРеквизита           = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	КонецЕсли;

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита           = "КПС";
	НоваяСтрока.ПредставлениеРеквизита = СтрШаблон(НСтр("ru = 'КПС%1'"), ?(ЭтоИзменениеСчетов, НСтр("ru = ' (до изм.)'"), ""));
	НоваяСтрока.ТипРеквизита           = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
	
	Если Параметры.ЕстьПрослеживаемыеТовары Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита           = "СтранаПроисхождения";
		НоваяСтрока.ПредставлениеРеквизита = НСтр("ru = 'Страна происхождения'");
		НоваяСтрока.ТипРеквизита           = Новый ОписаниеТипов("СправочникСсылка.СтраныМира");
	КонецЕсли;

	Если ВидПеремещения <> Перечисления.ВидыПеремещенияМЗ.ПеремещениеМеждуНТТ Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита           = "ДополнительнаяАналитикаСчета";
		НоваяСтрока.ПредставлениеРеквизита = СтрШаблон(НСтр("ru = 'Доп. аналитика%1'"), ?(ЭтоИзменениеСчетов, НСтр("ru = ' (до изм.)'"), ""));
		НоваяСтрока.ТипРеквизита           = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	КонецЕсли;
	
	Если ЭтоИзменениеСчетов Тогда
		
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита           = "СчетДебета";
		НоваяСтрока.ПредставлениеРеквизита = НСтр("ru = 'Счет учета (после изм.)'");
		НоваяСтрока.ТипРеквизита           = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");

		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита           = "КПСДебета";
		НоваяСтрока.ПредставлениеРеквизита = НСтр("ru = 'КПС (после изм.)'");
		НоваяСтрока.ТипРеквизита           = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");

		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита           = "ДополнительнаяАналитикаСчетаДебета";
		НоваяСтрока.ПредставлениеРеквизита = НСтр("ru = 'Доп. аналитика (после изм.)'");
		НоваяСтрока.ТипРеквизита           = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
		
	КонецЕсли;

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита           = "Примечание";
	НоваяСтрока.ПредставлениеРеквизита = НСтр("ru = 'Примечание'");
	НоваяСтрока.ТипРеквизита           = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0));

КонецПроцедуры

&НаКлиенте
Функция ПараметрыФормыДляВыбораСчета()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОграниченияСписокСчетов", СписокСчетов);
	ПараметрыФормы.Вставить("ВидСравненияВСписке",     Истина);
	ПараметрыФормы.Вставить("НаДату",                  Дата);
	ПараметрыФормы.Вставить("Организация", Организация);
	
	Возврат ПараметрыФормы;

КонецФункции

&НаКлиенте
Функция ПараметрыФормыДляВыбораКПС()

	ВидыПоказателей = Новый Массив;
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.Произвольный"));
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.АУИБУ"));
	
	Отбор = Новый Структура;
	Отбор.Вставить("НаДату",          Дата);
	Отбор.Вставить("Организация",     Организация);
	Отбор.Вставить("ИФО",             ИФО);
	Отбор.Вставить("ВидПоказателя", ВидыПоказателей);
	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	Возврат ПараметрыФормы;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТипСубконто(Знач ВидСубконто)

	Возврат ВидСубконто.ТипЗначения;

КонецФункции

#КонецОбласти

