#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы.
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ОсновноеСредство");
	ИменаРеквизитов.Добавить("Сумма");
	ИменаРеквизитов.Добавить("Количество");
	Результат.Вставить("ОсновныеСредства", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

// Формирует таблицу двдижений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - Таблица значений. Таблица проводок, которые будут сформированы
//  ДокументОбъект - Документ объект. Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура. Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - Таблица значений. Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка. Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт

	ОперацииКапвложений = Новый Массив;
	ОперацииКапвложений.Добавить(Перечисления.ВидыОперацийПризнанияОС.Изготовление);
	ОперацииКапвложений.Добавить(Перечисления.ВидыОперацийПризнанияОС.Приобретение);
	ВО_Модернизация = Перечисления.ВидыОперацийПризнанияОС.Модернизация;
	ОперацииКапвложений.Добавить(ВО_Модернизация);

	Если ОперацииКапвложений.Найти(ДокументОбъект.ВидОперации) = Неопределено
		ИЛИ НЕ ДокументОбъект.ОтразитьВКарточкеКапвложений 
		ИЛИ НЕ ОбслуживаниеКарточекКапвложенийВызовСервера.ЭтоСчетКапвложений(ДокументОбъект.СчетВложений)
		ИЛИ ДокументОбъект.ВидОперации = ВО_Модернизация И НЕ ДокументОбъект.ФормироватьДвиженияПоМодернизации Тогда
			
		Возврат Истина;	
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокументОбъект.КарточкаКапвложений) Тогда
		ТекстОшибки = НСтр("ru = 'На закладке документа ""Стоимость вложений"" включен флажок 
		|""Отражать в карточке капвложений"", но не заполнена Карточка капвложений'");
		Возврат Ложь;
	КонецЕсли;	
	
	НоваяСтрока = ТабДвижений.Добавить();
	НоваяСтрока.Организация         = ДокументОбъект.Организация;
	НоваяСтрока.КарточкаКапвложений = ДокументОбъект.КарточкаКапвложений;
	НоваяСтрока.Период              = ДокументОбъект.Дата;

	Возврат Истина;
КонецФункции	

// Определяет, возможны ли гарантийные обязательства для указанной операции.
//
// Параметры:
//   ВидОперации - ПеречислениеСсылка.ВидыОперацийПризнанияОС - вид поступления для проверки возможности 
//   	гарантийных обязательств поставщика для переданного вида поступления.
//
// Возвращаемое значение:
//   Булево - Истина, если возможны гарантийные обязательства, иначе Ложь
Функция ВозможныГарантийныеОбязательства(ВидОперации) Экспорт
	ВО_Приобретение = ПредопределенноеЗначение("Перечисление.ВидыОперацийПризнанияОС.Приобретение");	
	ВО_Модернизация = ПредопределенноеЗначение("Перечисление.ВидыОперацийПризнанияОС.Модернизация");	

	МассивВО = Новый Массив;
	МассивВО.Добавить(ВО_Приобретение);
	МассивВО.Добавить(ВО_Модернизация);
	Возврат(МассивВО.Найти(ВидОперации) <> Неопределено);
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ГолосованиеКомиссии

Процедура ЗаполнитьРезультатГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ЗаполнитьРезультатыГолосования = Не Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	Если ЗаполнитьРезультатыГолосования Тогда
		РезультатГолосованияСотрудника = ОбщегоНазначенияБГУ.РезультатыГолосованияСотрудникаПоДокументу(
			Форма.Сотрудник, Объект.Ссылка, Объект.Комиссия, Объект.Организация);
		РезультатГолосованияКомиссии = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(
			Объект.Ссылка, Объект.Комиссия, Объект.Организация);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		
		СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Неопределено;
		СтрокаТаблицы.ИтогГолосования = 0;
		СтрокаТаблицы.РезолюцияКомиссииОдобрена = Ложь;
		Если ЗаполнитьРезультатыГолосования Тогда
			
			Если РезультатГолосованияСотрудника.Количество() > 0 Тогда
				Результаты = РезультатГолосованияСотрудника.Найти(СтрокаТаблицы.ИдентификаторСтроки, "ИдентификаторСтроки");
				Если Результаты <> Неопределено Тогда
					СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Результаты.РезультатГолосования;
				КонецЕсли;
			КонецЕсли;
			
			Если РезультатГолосованияКомиссии.Количество() > 0 Тогда
				ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
					Объект.Ссылка, СтрокаТаблицы.ИдентификаторСтроки);
				РезультатыГолосованияПоСтроке = РезультатГолосованияКомиссии.НайтиСтроки(ОтборПоИдентификаторуСтроки);
				Если РезультатыГолосованияПоСтроке.Количество() > 0 Тогда
					СтрокаТаблицы.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
					СтрокаТаблицы.РезолюцияКомиссииОдобрена = РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеЭлементамиГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ДоступностьГолосования = Не Объект.Ссылка.Пустая() И Не Объект.Проведен
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("Сотрудник");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Доступность", ДоступностьГолосования);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноПротивВоВсехСтроках");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И Не ЗначениеЗаполнено(Форма.Сотрудник));
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваРешениеСотрудникаПоРезолюции");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник));
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("СохранитьРезультатыГолосования");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Доступность", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РешениеОПризнанииОбъектовОС";
	КомандаПечати.Идентификатор		= "Решение";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Решение о признании объектов НФА'"), "0510441", "61н", "142н");
	КомандаПечати.Порядок			= 1;
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериалов", 2);
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Решение") Тогда
	//	
	//	ТабличныйДокумент = НапечататьРешение(МассивОбъектов, ОбъектыПечати);
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
	//		"Решение","Решение о признании объектов НФА (ф. 0510441)", ТабличныйДокумент);
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, 
		"Организация, Дата, Номер, КапитальноеВложение, КФО, ВидОперации, ФормироватьДвиженияПоМодернизации");
	ЗначенияРеквизитов.Вставить("ИмяДокумента", НСтр("ru = 'Решение о признании объектов нефинансовых активов'"));
	
	Модернизация = (ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийПризнанияОС.Модернизация);
	Если Модернизация Тогда 
		Если ЗначенияРеквизитов.ФормироватьДвиженияПоМодернизации Тогда
			ИнициализироватьДанныеДокумента_Модернизация(
				ДокументСсылка, СтруктураДополнительныеСвойства, ЗначенияРеквизитов);
		Иначе
			Возврат;
		КонецЕсли;		
	Иначе		
		ИнициализироватьДанныеДокумента_НеМодернизация(
			ДокументСсылка, СтруктураДополнительныеСвойства, ЗначенияРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

#Область Инициализация_НеМодернизация

Процедура ИнициализироватьДанныеДокумента_НеМодернизация(
	ДокументСсылка, СтруктураДополнительныеСвойства, ЗначенияРеквизитов)
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийПризнанияОС.Модернизация Тогда
		Возврат;
	КонецЕсли;
	
	МассивСчетовМЦ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляКапвложенийСМЦ();
	МассивСчетовМЦ = УчетДрагМатериалов.ДополнитьМассивСчетовДМДляМЦ(ЗначенияРеквизитов.Организация, МассивСчетовМЦ, "Основные средства");
	МассивСчетовМЦ = УчетДрагМатериалов.ДополнитьМассивСчетовДМДляМЦ(ЗначенияРеквизитов.Организация, МассивСчетовМЦ, "Номенклатура");
	
	МассивСубконтоМЦ = Новый Массив;
	МассивСубконтоМЦ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.МатериальнаяЦенность);
	
	МассивСубконтоМЗ = Новый Массив;
	МассивСубконтоМЗ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	
	УчетнаяПолитика = БухгалтерскийУчетПовтИсп.УчетнаяПолитикаОрганизации(ЗначенияРеквизитов.Организация, ЗначенияРеквизитов.Дата);
	УчетНаСчете21ВУсловнойОценке = УчетнаяПолитика.УчетНаСчете21ВУсловнойОценке;
	НачислятьАмортизацию = УчетнаяПолитика.НачислятьАмортизациюИмуществаКазны;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"               , ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента"         , НСтр("ru = 'Решение о признании объектов нефинансовых активов'"));
	Запрос.УстановитьПараметр("УчетПоПодразделениям" , ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Запрос.УстановитьПараметр("НомерДокумента"       , ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, ЗначенияРеквизитов.Номер));
	Запрос.УстановитьПараметр("Учет21Условно"        , УчетНаСчете21ВУсловнойОценке);
	Запрос.УстановитьПараметр("ГраницаДокумента"     , Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация"          , ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("ВнеоборотныйАктив"    , ЗначенияРеквизитов.КапитальноеВложение);
	Запрос.УстановитьПараметр("Одобренные"           , ОбщегоНазначенияБГУ.ОдобренныеОбъектыГолосования(ДокументСсылка));
	Запрос.УстановитьПараметр("НачислятьАмортизацию" , НачислятьАмортизацию);
	Запрос.УстановитьПараметр("ВозможныГарантийныеОбязательства", 
		ВозможныГарантийныеОбязательства(ЗначенияРеквизитов.ВидОперации));
	Запрос.УстановитьПараметр("Период"           	, ЗначенияРеквизитов.Дата);	
	Запрос.УстановитьПараметр("МассивСчетовМЦ"		, МассивСчетовМЦ);
	Запрос.УстановитьПараметр("МассивСубконтоМЦ"	, МассивСубконтоМЦ);
	Запрос.УстановитьПараметр("МассивСубконтоМЗ"	, МассивСубконтоМЗ);
	ТаблицыЗапроса = Новый Массив;
	
	ТаблицыЗапроса.Добавить("ТаблицаОсновныеСредства");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Дата,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.СчетУчета КАК СчетУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Договор КАК Договор,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|				И ТаблицаОсновныеСредства.Ссылка.СчетУчета.УчетПоПодразделениям
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ЛОЖЬ КАК ПринятиеСВводом,
	|	ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ТаблицаОсновныеСредства.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	ТаблицаОсновныеСредства.НомерИнвентарнойКарточки КАК НомерИнвентарнойКарточки,
	|	ТаблицаОсновныеСредства.СоздатьИнвентарнуюКарточку КАК СоздатьИнвентарнуюКарточку,
	|	&ИмяДокумента КАК ИмяДокумента,
	|	&НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НаименованиеГТ КАК НаименованиеГТ,
	|	ТаблицаОсновныеСредства.ДатаГТ КАК ДатаГТ,
	|	ТаблицаОсновныеСредства.НомерГТ КАК НомерГТ,
	|	ТаблицаОсновныеСредства.СрокДействияГТ КАК СрокДействияГТ,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ТаблицаОсновныеСредства.Ссылка)
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|	И ТаблицаОсновныеСредства.ИдентификаторСтроки В(&Одобренные)";
	
	// Бухгалтерский учет
	ИнициализироватьЗапросыБУ(Запрос, ТаблицыЗапроса, ЗначенияРеквизитов, СтруктураДополнительныеСвойства);
	
	// Учет драг. материалов
	ИнициализироватьЗапросыДМ(Запрос, ТаблицыЗапроса);
	
	//// Учет прослеживаемости
	//ИнициализироватьЗапросыПрослеживаемости(Запрос, ТаблицыЗапроса, ЗначенияРеквизитов);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыБУ(Запрос, ТаблицыЗапроса, ЗначенияРеквизитов, СтруктураДополнительныеСвойства)
	
	ТаблицыЗапроса.Добавить("СобытияОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету) КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК Порядок1,
	|	1 КАК Порядок2
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Дата,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию),
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента,
	|	ТаблицаОсновныеСредства.НомерСтроки,
	|	2
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ПообъектныйУчет
	|	И (ТаблицаОсновныеСредства.ПринятиеСВводом
	|			ИЛИ ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Дата,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Дата > ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента,
	|	ТаблицаОсновныеСредства.НомерСтроки,
	|	3
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ПообъектныйУчет
	|	И (ТаблицаОсновныеСредства.ПринятиеСВводом
	|			ИЛИ ТаблицаОсновныеСредства.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1))
	|	И ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок1,
	|	Порядок2";
	
	ТаблицыЗапроса.Добавить("ВТ_Стоимость");
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА СубконтоЦМО.ВидСубконто ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаОсновныеСредства.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Договор КАК Договор,
	|	ТаблицаОсновныеСредства.Сумма КАК Стоимость,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.НаименованиеГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК НаименованиеГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.НомерГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК НомерГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.ДатаГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК ДатаГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТаблицаОсновныеСредства.СрокДействияГТ
	|		ИНАЧЕ """"	
	|	КОНЕЦ КАК СрокДействияГТ,
	|	ВЫБОР
	|		КОГДА СубконтоДоговоры.ВидСубконто ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|		ИНАЧЕ ТаблицаОсновныеСредства.Договор
	|	КОНЕЦ КАК ДоговорБаланс,
	|	ВЫБОР
	|		КОГДА
	|			ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|		И ТаблицаОсновныеСредства.ПринятиеСВводом
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПоступлениеОперУчет
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК СубконтоДоговоры
	|		ПО ТаблицаОсновныеСредства.СчетУчета = СубконтоДоговоры.Ссылка
	|		И (СубконтоДоговоры.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК СубконтоЦМО
	|		ПО ТаблицаОсновныеСредства.СчетУчета = СубконтоЦМО.Ссылка
	|		И (СубконтоЦМО.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|ГДЕ
	|	ТаблицаОсновныеСредства.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК ВидРаспоряжения,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Таблица.ЦМО КАК ЦМО,
	|	Таблица.ДоговорБаланс КАК Договор,
	|	Таблица.Подразделение КАК Подразделение,
	|	Таблица.Стоимость КАК Стоимость,
	|	Таблица.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету) КАК Событие,
	|	Таблица.НазваниеДокумента КАК НазваниеДокумента,
	|	Таблица.НомерДокумента КАК НомерДокумента,
	|	Таблица.ДатаДокумента КАК ДатаДокумента,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.НаименованиеГТ КАК НаименованиеГТ,
	|	Таблица.НомерГТ КАК НомерГТ,
	|	Таблица.ДатаГТ КАК ДатаГТ,
	|	Таблица.СрокДействияГТ КАК СрокДействияГТ,
	|	1 КАК НомерТаблицы
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.ДоговорБаланс,
	|	Таблица.Подразделение,
	|	Таблица.Стоимость,
	|	Таблица.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	2
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеОперУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет),
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.ДоговорБаланс,
	|	Таблица.Подразделение,
	|	ВЫБОР
	|		КОГДА &Учет21Условно
	|			ТОГДА Таблица.Количество
	|		ИНАЧЕ Таблица.Стоимость
	|	КОНЕЦ,
	|	Таблица.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету),
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	"""",
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	3
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеОперУчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерТаблицы";
	
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Таблица.Дата КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА Таблица.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|				И Таблица.ПринятиеСВводом
	|			ТОГДА Таблица.Сумма
	|		ИНАЧЕ Таблица.СуммаАмортизации
	|	КОНЕЦ КАК СуммаАмортизации,
	|	Таблица.СуммаОбесценения КАК СуммаОбесценения,
	|	ЛОЖЬ КАК ЭтоСписание
	|ИЗ
	|	ТаблицаОсновныеСредства КАК Таблица
	|ГДЕ
	|	(ВЫБОР
	|				КОГДА Таблица.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|						И Таблица.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|						И Таблица.ПринятиеСВводом
	|					ТОГДА Таблица.Сумма
	|				ИНАЧЕ Таблица.СуммаАмортизации
	|			КОНЕЦ <> 0
	|			ИЛИ Таблица.СуммаОбесценения <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Таблица.Дата,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.СуммаАмортизации,
	|	Таблица.СуммаОбесценения,
	|	ИСТИНА
	|ИЗ
	|	ТаблицаОсновныеСредства КАК Таблица
	|ГДЕ
	|	Таблица.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|	И Таблица.ПринятиеСВводом
	|	И (Таблица.СуммаАмортизации <> 0
	|			ИЛИ Таблица.СуммаОбесценения <> 0)";
	
	ТаблицыЗапроса.Добавить("ПервоначальныеСведенияОСБухгалтерскийУчет");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Дата КАК Период,
	|	ОсновныеСредства.Организация КАК Организация,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.Сумма
	|		ИНАЧЕ ОсновныеСредства.Сумма / ОсновныеСредства.Количество
	|	КОНЕЦ КАК ПервоначальнаяСтоимость,
	|	СУММА(ОсновныеСредства.СуммаАмортизации) КАК ПервоначальнаяСуммаАмортизации,
	|	СУММА(ОсновныеСредства.СуммаОбесценения) КАК ПервоначальнаяСуммаОбесценения,
	|	СУММА(ОсновныеСредства.Количество) КАК Количество
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ОсновныеСредства
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеСредства.Дата,
	|	ОсновныеСредства.Организация,
	|	ОсновныеСредства.ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Количество = 0
	|			ТОГДА ОсновныеСредства.Сумма
	|		ИНАЧЕ ОсновныеСредства.Сумма / ОсновныеСредства.Количество
	|	КОНЕЦ";
	
	ТаблицыЗапроса.Добавить("НомераИнвентарныхКарточек");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.НомерИнвентарнойКарточки КАК НомерИнвентарнойКарточки,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаИнвентарнойКарточки
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.СоздатьИнвентарнуюКарточку";
	
	Если Не Запрос.Параметры.НачислятьАмортизацию Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыЗапроса.Добавить("ПараметрыАмортизацииОСБухгалтерскийУчет");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ТаблицаОсновныеСредства.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	ТаблицыЗапроса.Добавить("АмортизацияОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ОсновныеСредства.КЭКЗатрат КАК КЭК,
	|	ОсновныеСредства.СубконтоЗатрат1 КАК Субконто1,
	|	ОсновныеСредства.СубконтоЗатрат2 КАК Субконто2,
	|	ОсновныеСредства.СубконтоЗатрат3 КАК Субконто3,
	|	ОсновныеСредства.КПСЗатрат КАК КПС,
	|	ОсновныеСредства.ПодразделениеЗатрат КАК Подразделение
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И ОсновныеСредства.ПорядокПогашенияСтоимости <> ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается)
	|	И ОсновныеСредства.ИдентификаторСтроки В(&Одобренные)";
	
	ТаблицыЗапроса.Добавить("РасчетАмортизацииОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И (ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка))
	|			ТОГДА ОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И (ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|					ИЛИ ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции))
	|			ТОГДА ОсновныеСредства.Сумма - ОсновныеСредства.СуммаАмортизации - ОсновныеСредства.СуммаОбесценения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|			ТОГДА ОсновныеСредства.КоэффициентУскорения
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоэффициентУскорения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|			ТОГДА ОсновныеСредства.ПараметрВыработки
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК ПараметрВыработки,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ОсновныеСредства.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|			ТОГДА ОсновныеСредства.ПредполагаемыйОбъемВыработки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПредполагаемыйОбъемВыработки
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И ОсновныеСредства.ИдентификаторСтроки В(&Одобренные)
	|	И (ОсновныеСредства.СрокПолезногоИспользования <> 0
	|			ИЛИ ОсновныеСредства.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации))";
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыДМ(Запрос, ТаблицыЗапроса)
	
	ТаблицыЗапроса.Добавить("ВТ_ОстаткиМЦКапвложения");
	ТаблицыЗапроса.Добавить("ВТ_ОстаткиМЦНаСчетах");
	ТаблицыЗапроса.Добавить("ВТ_ОстаткиМЦВсего");
	ТаблицыЗапроса.Добавить("НаличиеДрагМатериаловВОбъектахНФА");
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() + 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МЦСДрагоценнымиМатериалами.Ссылка КАК ДокументСсылка,
	|	МЦСДрагоценнымиМатериалами.ОбъектМЦ КАК ОбъектМЦ,
	|	МЦСДрагоценнымиМатериалами.Количество КАК КоличествоМЦ,
	|	ВЫРАЗИТЬ(МЦСДрагоценнымиМатериалами.Ссылка КАК Документ.РешениеОПризнанииОбъектовОСИК).Организация КАК Организация
	|ПОМЕСТИТЬ ОстаткиМЦКапвложения
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.МЦСДрагоценнымиМатериалами КАК МЦСДрагоценнымиМатериалами
	|ГДЕ
	|	МЦСДрагоценнымиМатериалами.Ссылка = &Ссылка
	|	И МЦСДрагоценнымиМатериалами.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОбъектМЦ,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиМЦНаСчетах
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&МассивСчетовМЦ),
	|			&МассивСубконтоМЦ,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)) КАК ЖурналПроводокЕПСБУОстатки
	|ГДЕ
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&МассивСчетовМЦ),
	|			&МассивСубконтоМЗ,
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)) КАК ЖурналПроводокЕПСБУОстатки
	|ГДЕ
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт > 0
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ 
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация 
	|				И ИнвентарныйНомер = Значение(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) 
	|				И ОсновноеСредство В (ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)) КАК СтоимостьОбъектовОСОстатки 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.ОсновноеСредство,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (ВЫБРАТЬ
	|						ОстаткиМЦКапвложения.ОбъектМЦ
	|					ИЗ
	|						ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения)
	|               И ИнвентарныйНомер = Значение(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				И (ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|					ИЛИ ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении))) КАК СтоимостьОбъектовОСПоКонтрагентамОстатки
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиМЦНаСчетах.ОбъектМЦ КАК ОбъектМЦ,
	|	СУММА(ОстаткиМЦНаСчетах.КоличествоОстаток) КАК КоличествоОстатокВсего
	|ПОМЕСТИТЬ ОстаткиМЦВсего
	|ИЗ
	|	ОстаткиМЦНаСчетах КАК ОстаткиМЦНаСчетах
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиМЦНаСчетах.ОбъектМЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ДрагоценныеМатериалы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ДрагоценныеМатериалы.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ДрагоценныеМатериалы.Ссылка КАК Регистратор,
	|	ДрагоценныеМатериалы.Ссылка.Организация КАК Организация,
	|	ДрагоценныеМатериалы.ОсновноеСредство КАК ОбъектНФА,
	|	ДрагоценныеМатериалы.ИнвентарныйНомер КАК ИнвНомер,
	|	ДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	|	ДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	|	ДрагоценныеМатериалы.КоличествоДМ КАК КоличествоДМ,
	|	&ИмяДокумента КАК Основание,
	|	&НомерДокумента КАК НомерОснования,
	|	ДрагоценныеМатериалы.Ссылка.Дата КАК ДатаОснования,
	|	ДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК ОсновныеСредства
	|		ПО ДрагоценныеМатериалы.Ссылка = ОсновныеСредства.Ссылка
	|			И ДрагоценныеМатериалы.ОсновноеСредство = ОсновныеСредства.ОсновноеСредство
	|			И ДрагоценныеМатериалы.ИнвентарныйНомер = ОсновныеСредства.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ДрагоценныеМатериалы.Ссылка)
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка = &Ссылка
	|	И ДрагоценныеМатериалы.МассаДМ > 0
	|	И ОсновныеСредства.ИдентификаторСтроки В(&Одобренные)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	0,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОстаткиМЦКапвложения.ДокументСсылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ, 
	|	ОстаткиМЦКапвложения.ДокументСсылка,
	|	ОстаткиМЦКапвложения.Организация,
	|	ОстаткиМЦКапвложения.ОбъектМЦ,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	|	НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала,
	|	ВЫБОР
	|		КОГДА ОстаткиМЦКапвложения.КоличествоМЦ = ОстаткиМЦВсего.КоличествоОстатокВсего
	|			ТОГДА НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток
	|		ИНАЧЕ НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток * ОстаткиМЦКапвложения.КоличествоМЦ / ОстаткиМЦВсего.КоличествоОстатокВсего
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОстаткиМЦКапвложения.КоличествоМЦ = ОстаткиМЦВсего.КоличествоОстатокВсего
	|			ТОГДА НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток
	|		ИНАЧЕ НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток * ОстаткиМЦКапвложения.КоличествоМЦ / ОстаткиМЦВсего.КоличествоОстатокВсего
	|	КОНЕЦ,    
	|	&ИмяДокумента,
	|	&НомерДокумента,
	|	ОстаткиМЦКапвложения.ДокументСсылка.Дата,
	|	НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм
	|ИЗ
	|	ОстаткиМЦКапвложения КАК ОстаткиМЦКапвложения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки(&Период, Организация = &Организация) КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	|		ПО ОстаткиМЦКапвложения.ОбъектМЦ = НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА
	|			И (НаличиеДрагМатериаловВОбъектахНФАОстатки.Организация = ОстаткиМЦКапвложения.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиМЦВсего КАК ОстаткиМЦВсего
	|		ПО (ОстаткиМЦВсего.ОбъектМЦ = ОстаткиМЦКапвложения.ОбъектМЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОстаткиМЦКапвложения.ДокументСсылка)
	|ГДЕ
	|	ОстаткиМЦКапвложения.ДокументСсылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	
КонецПроцедуры

//Процедура ИнициализироватьЗапросыПрослеживаемости(Запрос, ТаблицыЗапроса, ЗначенияРеквизитов)
//	
//	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийПризнанияОС.Приобретение
//		Или ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийПризнанияОС.Изготовление Тогда
//		ИнициализироватьЗапросыПрослеживаемыеОС(Запрос, ТаблицыЗапроса);
//	Иначе
//		ИнициализироватьЗапросыПрослеживаемыеОСПоТаблице(Запрос, ТаблицыЗапроса);
//	КонецЕсли;
//	
//	ТаблицыЗапроса.Добавить("ТаблицаРНПТ");
//	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	СведенияПрослеживаемости.Ссылка.Организация КАК Организация,
//	|	СведенияПрослеживаемости.РНПТ КАК РНПТ,
//	|	СведенияПрослеживаемости.Ссылка.Дата КАК ДатаПоступления
//	|ИЗ
//	|	Документ.РешениеОПризнанииОбъектовОСИК.СведенияПрослеживаемости КАК СведенияПрослеживаемости
//	|ГДЕ
//	|	СведенияПрослеживаемости.Ссылка = &Ссылка";
//	
//КонецПроцедуры

//Процедура ИнициализироватьЗапросыПрослеживаемыеОСПоТаблице(Запрос, ТаблицыЗапроса)
//	
//	ТаблицыЗапроса.Добавить("ПрослеживаемыеОС");
//	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
//	"ВЫБРАТЬ
//	|	РешениеОсновныеСредства.Ссылка.Дата КАК Период,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
//	|	РешениеОсновныеСредства.Ссылка.Организация КАК Организация,
//	|	РешениеСведенияПрослеживаемости.РНПТ КАК РНПТ,
//	|	РешениеОсновныеСредства.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	РешениеОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
//	|	РешениеСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
//	|	РешениеСведенияПрослеживаемости.Количество КАК Количество,
//	|	РешениеСведенияПрослеживаемости.Количество * РешениеОсновныеСредства.Сумма / РешениеОсновныеСредства.Количество КАК СуммаБезНДС
//	|ИЗ
//	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК РешениеОсновныеСредства
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РешениеОПризнанииОбъектовОСИК.СведенияПрослеживаемости КАК РешениеСведенияПрослеживаемости
//	|		ПО РешениеОсновныеСредства.ИдентификаторСтроки = РешениеСведенияПрослеживаемости.ИдентификаторСтроки
//	|ГДЕ
//	|	РешениеОсновныеСредства.Ссылка = &Ссылка
//	|	И РешениеСведенияПрослеживаемости.Ссылка = &Ссылка";
//	
//КонецПроцедуры

//Процедура ИнициализироватьЗапросыПрослеживаемыеОС(Запрос, ТаблицыЗапроса)
//	
//	ТаблицыЗапроса.Добавить("ВТ_ОстаткиСоСтраной");
//	ТаблицыЗапроса.Добавить("ПрослеживаемыеОС");
//	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ПрослеживаемыеОСОстатки.РНПТ КАК РНПТ,
//	|	ПрослеживаемыеОСОстатки.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	ПрослеживаемыеОСОстатки.Комплектующее КАК Комплектующее,
//	|	ПрослеживаемыеОСОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток,
//	|	ПрослеживаемыеОСОстатки.КоличествоОстаток КАК КоличествоОстаток
//	|ПОМЕСТИТЬ ОстаткиСоСтраной
//	|ИЗ
//	|	РегистрНакопления.ПрослеживаемыеОС.Остатки(
//	|			&ГраницаДокумента,
//	|			Организация = &Организация
//	|				И ОсновноеСредство = &ВнеоборотныйАктив) КАК ПрослеживаемыеОСОстатки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Дата КАК Период,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Организация КАК Организация,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.РНПТ КАК РНПТ,
//	|	ОстаткиСоСтраной.СтранаПроисхождения КАК СтранаПроисхождения,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.КапитальноеВложение КАК ОсновноеСредство,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Комплектующее КАК Комплектующее,
//	|	СУММА(РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Количество) КАК Количество,
//	|	СУММА(РешениеОПризнанииОбъектовОССведенияПрослеживаемости.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
//	|	СУММА(ВЫБОР
//	|			КОГДА ЕСТЬNULL(ОстаткиСоСтраной.КоличествоОстаток, 0) = 0
//	|				ТОГДА 0
//	|			ИНАЧЕ РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Количество * ОстаткиСоСтраной.СуммаБезНДСОстаток / ОстаткиСоСтраной.КоличествоОстаток
//	|		КОНЕЦ) КАК СуммаБезНДС
//	|ИЗ
//	|	Документ.РешениеОПризнанииОбъектовОСИК.СведенияПрослеживаемости КАК РешениеОПризнанииОбъектовОССведенияПрослеживаемости
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК РешениеОПризнанииОбъектовОСОсновныеСредства
//	|		ПО РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка = РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка
//	|			И РешениеОПризнанииОбъектовОССведенияПрослеживаемости.ИдентификаторСтроки = РешениеОПризнанииОбъектовОСОсновныеСредства.ИдентификаторСтроки
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиСоСтраной КАК ОстаткиСоСтраной
//	|		ПО РешениеОПризнанииОбъектовОССведенияПрослеживаемости.РНПТ = ОстаткиСоСтраной.РНПТ
//	|			И РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Комплектующее = ОстаткиСоСтраной.Комплектующее
//	|ГДЕ
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка = &Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Дата,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Организация,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.РНПТ,
//	|	ОстаткиСоСтраной.СтранаПроисхождения,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.КапитальноеВложение,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Комплектующее
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Дата,
//	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Организация,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.РНПТ,
//	|	ОстаткиСоСтраной.СтранаПроисхождения,
//	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ОсновноеСредство,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Комплектующее,
//	|	СУММА(РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Количество),
//	|	СУММА(РешениеОПризнанииОбъектовОССведенияПрослеживаемости.КоличествоПрослеживаемости),
//	|	СУММА(ВЫБОР
//	|			КОГДА ЕСТЬNULL(ОстаткиСоСтраной.КоличествоОстаток, 0) = 0
//	|				ТОГДА 0
//	|			ИНАЧЕ РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Количество * ОстаткиСоСтраной.СуммаБезНДСОстаток / ОстаткиСоСтраной.КоличествоОстаток
//	|		КОНЕЦ)
//	|ИЗ
//	|	Документ.РешениеОПризнанииОбъектовОСИК.СведенияПрослеживаемости КАК РешениеОПризнанииОбъектовОССведенияПрослеживаемости
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК РешениеОПризнанииОбъектовОСОсновныеСредства
//	|		ПО РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка = РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка
//	|			И РешениеОПризнанииОбъектовОССведенияПрослеживаемости.ИдентификаторСтроки = РешениеОПризнанииОбъектовОСОсновныеСредства.ИдентификаторСтроки
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиСоСтраной КАК ОстаткиСоСтраной
//	|		ПО РешениеОПризнанииОбъектовОССведенияПрослеживаемости.РНПТ = ОстаткиСоСтраной.РНПТ
//	|			И РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Комплектующее = ОстаткиСоСтраной.Комплектующее
//	|ГДЕ
//	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка = &Ссылка
//	|	И РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка = &Ссылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Дата,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Ссылка.Организация,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.РНПТ,
//	|	ОстаткиСоСтраной.СтранаПроисхождения,
//	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ОсновноеСредство,
//	|	РешениеОПризнанииОбъектовОССведенияПрослеживаемости.Комплектующее";
//	
//КонецПроцедуры

#КонецОбласти

#Область Инициализация_Модернизация

Процедура ИнициализироватьДанныеДокумента_Модернизация(
	ДокументСсылка, СтруктураДополнительныеСвойства, ЗначенияРеквизитов)

	// Делать движения по регистру сведений "Учетные данные ОС" при отражении операции модернизиции не надо
	СтруктураДополнительныеСвойства.Вставить("НеФормироватьУчетныеДанныеИзПроводок");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Организация", ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("УчетПоПодразделениям", 
		УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям());
	Запрос.УстановитьПараметр("ВозможныГарантийныеОбязательства", 
		ВозможныГарантийныеОбязательства(ЗначенияРеквизитов.ВидОперации));
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ОСДокумента", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ОСДокумента
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК ТЧОсновныеСредства
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	НомераТаблиц.Вставить("ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБУ.ОсновноеСредство,
	|	ПараметрыАмортизацииОСБУ.ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизацииОСБУ.СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ПараметрыАмортизацииОСБУ
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОСДокумента.ОсновноеСредство
	|					ИЗ
	|						ОСДокумента КАК ОСДокумента)) КАК ПараметрыАмортизацииОСБУ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПараметрыАмортизацииОСБУ.ОсновноеСредство";
	
	НомераТаблиц.Вставить("ВидыРабот", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ТЧВидыРабот.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЧВидыРабот.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТЧВидыРабот.ВидРаботы КАК ВидРаботы,
	|	СУММА(ТЧВидыРабот.СуммаМодернизации + ТЧВидыРабот.СуммаДемонтажа + ТЧВидыРабот.СуммаТранспортировки) КАК
	|		СуммаМодернизации
	|ПОМЕСТИТЬ ВидыРабот
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.СведенияОВидахРабот КАК ТЧВидыРабот
	|ГДЕ
	|	ТЧВидыРабот.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ТЧВидыРабот.ОсновноеСредство,
	|	ТЧВидыРабот.ИнвентарныйНомер,
	|	ТЧВидыРабот.ВидРаботы";
	
	НомераТаблиц.Вставить("ДанныеДокумента", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТЧОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Дата,
	|	ТЧОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТЧОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТЧОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.Ссылка.ДокументОснование ССЫЛКА Документ.РеконструкцияИК
	|				И ТЧОсновныеСредства.Ссылка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.РеконструкцияИК.ПустаяСсылка)
	|			ТОГДА ТЧОсновныеСредства.Ссылка.ДокументОснование.ВидПервичногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НазваниеДокумента,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.Ссылка.ДокументОснование ССЫЛКА Документ.РеконструкцияИК
	|				И ТЧОсновныеСредства.Ссылка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.РеконструкцияИК.ПустаяСсылка)
	|			ТОГДА ТЧОсновныеСредства.Ссылка.ДокументОснование.НомерПервичногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.Ссылка.ДокументОснование ССЫЛКА Документ.РеконструкцияИК
	|				И ТЧОсновныеСредства.Ссылка.ДокументОснование <> ЗНАЧЕНИЕ(Документ.РеконструкцияИК.ПустаяСсылка)
	|			ТОГДА ТЧОсновныеСредства.Ссылка.ДокументОснование.ДатаПервичногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТЧОсновныеСредства.НаименованиеГТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НаименованиеГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТЧОсновныеСредства.НомерГТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТЧОсновныеСредства.ДатаГТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаГТ,
	|	ВЫБОР
	|		КОГДА &ВозможныГарантийныеОбязательства
	|			ТОГДА ТЧОсновныеСредства.СрокДействияГТ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СрокДействияГТ,
	|	ТЧОсновныеСредства.Ссылка.Договор КАК ДоговорИсполнителя,
	|	ЕСТЬNULL(ВидыРабот.ВидРаботы, """") КАК ВидРаботы,
	|	ТЧОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТЧОсновныеСредства.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	ТЧОсновныеСредства.ФактическийСрокЭксплуатации КАК СрокЭксплуатацииФакт,
	|	ТЧОсновныеСредства.СрокПолезногоИспользования КАК СрокПолезногоИспользованияПослеМодернизации,
	|	ТЧОсновныеСредства.Сумма КАК СуммаМодернизации,
	|	ПараметрыАмортизацииОСБУ.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизацииОСБУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ТЧОсновныеСредства.Ссылка.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК ТЧОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБУ КАК ПараметрыАмортизацииОСБУ
	|		ПО ТЧОсновныеСредства.ОсновноеСредство = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыРабот КАК ВидыРабот
	|		ПО ТЧОсновныеСредства.ОсновноеСредство = ВидыРабот.ОсновноеСредство
	|			И ТЧОсновныеСредства.ИнвентарныйНомер = ВидыРабот.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ТЧОсновныеСредства.Ссылка)
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка = &Ссылка";
	
	ИнициализироватьЗапросыБУ_Модернизация(Запрос, НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры	

Процедура ИнициализироватьЗапросыБУ_Модернизация(Запрос, НомераТаблиц)
	НомераТаблиц.Вставить("ОстаткиРН_СтоимостьОбъектовОС", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтоимостьОбъектовОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(СтоимостьОбъектовОСОстатки.Договор) КАК Договор
	|ПОМЕСТИТЬ ОстаткиРН_СтоимостьОбъектовОС
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(&МоментВремени, Организация = &Организация
	|	И ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			Таб.ОсновноеСредство
	|		ИЗ
	|			ДанныеДокумента КАК Таб)
	|	И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК ВидРаспоряжения,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеДокумента.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА СубконтоЦМО.ВидСубконто ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|		ИНАЧЕ ДанныеДокумента.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ДанныеДокумента.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ДанныеДокумента.СуммаМодернизации КАК Стоимость,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Реконструкция) КАК Событие,
	|	ДанныеДокумента.НазваниеДокумента КАК НазваниеДокумента,
	|	ДанныеДокумента.НомерДокумента КАК НомерДокумента,
	|	ДанныеДокумента.ДатаДокумента КАК ДатаДокумента,
	|	ДанныеДокумента.ДоговорИсполнителя КАК ДоговорИсполнителя,
	|	ДанныеДокумента.ВидРаботы КАК ВидРаботы,
	|	ВЫБОР
	|		КОГДА НЕ СубконтоДоговоры.ВидСубконто ЕСТЬ NULL 
	|			И НЕ ОстаткиРН_СтоимостьОбъектовОС.Договор ЕСТЬ NULL
	|			ТОГДА ОстаткиРН_СтоимостьОбъектовОС.Договор
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договор
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК СубконтоЦМО
	|		ПО ДанныеДокумента.СчетУчета = СубконтоЦМО.Ссылка
	|		И (СубконтоЦМО.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК СубконтоДоговоры
	|		ПО ДанныеДокумента.СчетУчета = СубконтоДоговоры.Ссылка
	|		И (СубконтоДоговоры.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Договоры))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиРН_СтоимостьОбъектовОС КАК ОстаткиРН_СтоимостьОбъектовОС
	|		ПО ДанныеДокумента.ОсновноеСредство = ОстаткиРН_СтоимостьОбъектовОС.ОсновноеСредство
	|		И ДанныеДокумента.ИнвентарныйНомер = ОстаткиРН_СтоимостьОбъектовОС.ИнвентарныйНомер
	|ГДЕ
	|	ДанныеДокумента.СуммаМодернизации <> 0";
	
	НомераТаблиц.Вставить("РасчетАмортизацииОС", НомераТаблиц.Количество());              
	// группировка в запросе, на случай, если модернизируются ОС с групповым инвентарным учетом,
	// тогда в ДанныеДокумента будет столько строк, сколько инвентарных номеров, но в регистре "РасчетАмортизацииОС"
	// данные хранятся для объекта в целом, без инвентарных номеров.
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ДанныеДокумента.СрокПолезногоИспользованияПослеМодернизации) КАК СрокПолезногоИспользования,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДокумента.СрокПолезногоИспользованияПослеМодернизации > ДанныеДокумента.СрокЭксплуатацииФакт
	|							ТОГДА ДанныеДокумента.СрокПолезногоИспользованияПослеМодернизации - ДанныеДокумента.СрокЭксплуатацииФакт
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СрокИспользованияДляВычисленияАмортизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|					ИЛИ ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|				ТОГДА ДанныеДокумента.ОстаточнаяСтоимость + ДанныеДокумента.СуммаМодернизации
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СтоимостьДляВычисленияАмортизации,
	|	МИНИМУМ(ДанныеДокумента.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	МИНИМУМ(ДанныеДокумента.НомерСтроки)";

	НомераТаблиц.Вставить("КапРемонтОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.ОсновноеСредство КАК ОС,
	|	ДанныеДокумента.ИнвентарныйНомер КАК ИнвНомер,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.СуммаМодернизации КАК СуммаНаКапРемонт,
	|	ДанныеДокумента.СуммаМодернизации КАК Сумма1,
	|	0 КАК Сумма2,
	|	0 КАК Сумма4,
	|	0 КАК Сумма5,
	|	0 КАК Сумма6,
	|	0 КАК Сумма7,
	|	ДанныеДокумента.НазваниеДокумента КАК НазваниеДокумента,
	|	ДанныеДокумента.НомерДокумента КАК НомерДокумента,
	|	ДанныеДокумента.ДатаДокумента КАК ДатаДокумента,
	|	ДанныеДокумента.НаименованиеГТ КАК НаименованиеГТ,
	|	ДанныеДокумента.НомерГТ КАК НомерГТ,
	|	ДанныеДокумента.ДатаГТ КАК ДатаГТ,
	|	ДанныеДокумента.СрокДействияГТ КАК СрокДействияГТ,
	|	ДанныеДокумента.ДоговорИсполнителя КАК ДоговорИсполнителя,
	|	ДанныеДокумента.ВидРаботы КАК ВидРаботы
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.НомерСтроки";
	
КонецПроцедуры

#КонецОбласти

Процедура ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, ДокументСсылка, Параметры) Экспорт
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧОсновныеСредства.Ссылка.ВидОперации КАК ВидОперации,
	|	ТЧОсновныеСредства.Ссылка.ИФО КАК ИФО,
	|	ТЧОсновныеСредства.Ссылка.КФО КАК КФО,
	|	ТЧОсновныеСредства.КПС КАК КПС,
	|	ТЧОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТЧОсновныеСредства.Ссылка.СчетВложений КАК СчетКредита,
	|	ТЧОсновныеСредства.Ссылка.КапитальноеВложение КАК ВнеоборотныйАктив,
	|	&ВидЗатрат КАК ВидЗатрат,
	|	ТЧОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТЧОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТЧОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТЧОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТЧОсновныеСредства.Ссылка.СчетУчета КАК СчетУчета,
	|	ТЧОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ЕСТЬNULL(ТЧСведенияОВидахРабот.СуммаДемонтажа, 0) КАК СуммаДемонтажа,
	|	ЕСТЬNULL(ТЧСведенияОВидахРабот.СуммаТранспортировки, 0) КАК СуммаТранспортировки,
	|	ЕСТЬNULL(ТЧСведенияОВидахРабот.СуммаМодернизации, ТЧОсновныеСредства.Сумма) КАК СуммаМодернизации,
	|	&ПустойСчет КАК СчетУчетаЗатратПоАмортизационнойПремии,
	|	&ПустойВидСубконто КАК СубконтоПоАмортизационнойПремии1,
	|	&ПустойВидСубконто КАК СубконтоПоАмортизационнойПремии2,
	|	&ПустойВидСубконто КАК СубконтоПоАмортизационнойПремии3,
	|	0 КАК СуммаКапитальныхВложенийВключаемыхВРасходыНУ,
	|	0 КАК СуммаМодернизацииНУ,
	|	0 КАК СуммаМодернизацииНеУчитываетсяНУ,
	|	0 КАК СуммаМодернизацииЕНВД
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОСИК.ОсновныеСредства КАК ТЧОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РешениеОПризнанииОбъектовОСИК.СведенияОВидахРабот КАК ТЧСведенияОВидахРабот
	|		ПО ТЧОсновныеСредства.ОсновноеСредство = ТЧСведенияОВидахРабот.ОсновноеСредство
	|		И ТЧОсновныеСредства.ИнвентарныйНомер = ТЧСведенияОВидахРабот.ИнвентарныйНомер
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка = &Ссылка
	|	И ТЧСведенияОВидахРабот.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидЗатрат", 
		?(Параметры.Свойство("ВидЗатрат"), Параметры.ВидЗатрат, Справочники.ВидыЗатрат.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ПустойСчет", ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
	Запрос.УстановитьПараметр("ПустойВидСубконто", 
		ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка"));
	
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов();
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#КонецЕсли
