#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем Основание;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("Основание", Основание);
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеОСИК") Тогда
			СтандартнаяОбработка = Ложь;
			ЗаполнитьПоПоступлениюОСИК(ДанныеЗаполнения);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеконструкцияИК") Тогда	
		
		СтандартнаяОбработка = Ложь;
		ЗаполнитьПоРеконструкцииИК(ДанныеЗаполнения);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УправлениеОсновнымиСредствами.ПроверитьДублиИнвентарныхНомеровВТабЧасти(ЭтотОбъект, "ОсновныеСредства", Отказ);
	
	ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ);
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	ВО_Приобретение = Перечисления.ВидыОперацийПризнанияОС.Приобретение;
	ВО_Изготовление = Перечисления.ВидыОперацийПризнанияОС.Изготовление;
	
	Если ВидОперации <> ВО_Приобретение ИЛИ ПоступлениеБиблиотечногоФонда Тогда
		НеПроверяемыеРеквизиты.Добавить("КоличествоВложений");
	КонецЕсли;

	СуммаТЧ = ОсновныеСредства.Итог("Сумма"); 
	Если ВидОперации = ВО_Приобретение Тогда
		КоличествоТЧ = ОсновныеСредства.Итог("Количество"); 
		Если ВидОперации = ВО_Приобретение Тогда
			Если КоличествоТЧ > КоличествоВложений Тогда
				ТекстОшибки = 
					УправлениеОсновнымиСредствами.ТекстПревышенияКоличестваОбъектовНадКоличествомВложения(
					КоличествоТЧ, КоличествоВложений);	
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Количество", "Объект", Отказ);
			ИначеЕсли СуммаТЧ = СуммаВложений И КоличествоТЧ <> КоличествоВложений Тогда
				ТекстОшибки = 
					УправлениеОсновнымиСредствами.ТекстНеравнстваКоличествОбъектовИВложенийПриРавенствеСумм(
					КоличествоТЧ, КоличествоВложений);	
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,, "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если СуммаТЧ > СуммаВложений Тогда
		ТекстОшибки = 
			УправлениеОсновнымиСредствами.ТекстПревышенияСуммыОбъектвоНадСуммойВложения(СуммаТЧ, СуммаВложений);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "СуммаВложений", "Объект", Отказ);
	КонецЕсли;
	
	НеПроверяемыеРеквизиты.Добавить("ОсновныеСредства.СтранаПроисхождения");
	ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ПрослеживаемоеОсновноеСредство(КапитальноеВложение, ЭтотОбъект);
	Если ЕстьПрослеживаемыеТовары Тогда
		ПрослеживаемостьБГУ.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, "ОсновныеСредства");
	КонецЕсли;

	// Уберем проверку заполненности карточки капвложений из стандартной проверки. Проверим сами
	ОперацииКапвложений = Новый Массив;
	ОперацииКапвложений.Добавить(ВО_Изготовление);
	ОперацииКапвложений.Добавить(ВО_Приобретение);
	Если ОперацииКапвложений.Найти(ВидОперации) = Неопределено
		ИЛИ НЕ ОбслуживаниеКарточекКапвложенийВызовСервера.ЭтоСчетКапвложений(СчетВложений) 
		ИЛИ НЕ ОтразитьВКарточкеКапвложений Тогда
		НепроверяемыеРеквизиты.Добавить("КарточкаКапвложений");
	КонецЕсли;		    
	
	Если ОперацииКапвложений.Найти(ВидОперации) <> Неопределено Тогда
		УправлениеОсновнымиСредствами.ЕстьОСПринятыеКУчету(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетУчета) 
		И БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(
		СчетУчета, ПланыВидовХарактеристик.ВидыСубконто["ЦМО"]) 
		И ПроверяемыеРеквизиты.Найти("ЦМО") = Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить("ЦМО");
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	ПрослеживаемостьБГУ.СформироватьДвижения(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	ПрослеживаемостьБГУ.УдалениеПроведенияПервичногоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.ВидыОперацийПризнанияОС.Модернизация Тогда
		ДрагоценныеМатериалы.Очистить();
	Иначе
		СведенияОВидахРабот.Очистить();
	КонецЕсли;
	
	СуммаДокумента = ОсновныеСредства.Итог("Сумма");
	
	ПрослеживаемостьБГУ.УдалитьНеиспользуемыеСтрокиСведенийПрослеживаемости(ЭтотОбъект, "ОсновныеСредства");
	ПрослеживаемостьБГУ.СписаниеОСПриЗаписи(ЭтотОбъект, Отказ, РежимЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ)
	
	ДрагМатериалы = ДрагоценныеМатериалы.Выгрузить(,"НомерСтроки, ОсновноеСредство, ИнвентарныйНомер");
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить(,"ОсновноеСредство, ИнвентарныйНомер");
	ОбъектыДМ.Свернуть("ОсновноеСредство, ИнвентарныйНомер");
	
	ТаблицаВсехОбъектов = ОсновныеСредства.Выгрузить(,"ОсновноеСредство, ИнвентарныйНомер");
	
	Для Каждого ТекСтрока Из ОбъектыДМ Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ОсновноеСредство", ТекСтрока.ОсновноеСредство);
		ПараметрыОтбора.Вставить("ИнвентарныйНомер", ТекСтрока.ИнвентарныйНомер);
		НайденныеСтроки = ТаблицаВсехОбъектов.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			ПараметрыОтбораОбъекта = Новый Структура;
			ПараметрыОтбораОбъекта.Вставить("ОсновноеСредство", ТекСтрока.ОсновноеСредство);
			ПараметрыОтбораОбъекта.Вставить("ИнвентарныйНомер", ТекСтрока.ИнвентарныйНомер);
			СтрокиСпискаДМ = ДрагМатериалы.НайтиСтроки(ПараметрыОтбораОбъекта);
			
			НомераСтрок = Новый Массив;
			Для Каждого ТекСтрокаДМ Из СтрокиСпискаДМ Цикл
				НомераСтрок.Добавить(Формат(ТекСтрокаДМ.НомерСтроки, "ЧЦ=10"));
			КонецЦикла;
			
			ЧастиСообщения = Новый Массив;
			ЧастиСообщения.Добавить(?(СтрокиСпискаДМ.Количество() = 1, НСтр("ru = 'В строке'"), НСтр("ru = 'В строках'")));
			ЧастиСообщения.Добавить(СтрСоединить(НомераСтрок, ", "));
			ЧастиСообщения.Добавить(НСтр("ru = 'списка ""Содержание драг. материалов"" указана информация по объекту, которого нет в списке ""Основные средства"":'"));
			ЧастиСообщения.Добавить(СтрШаблон("""%1""", ТекСтрока.ОсновноеСредство));
			Если ЗначениеЗаполнено(ТекСтрока.ИнвентарныйНомер) Тогда
				ЧастиСообщения.Добавить(СтрШаблон(НСтр("ru = '(инв.№: %1)'"), ТекСтрока.ИнвентарныйНомер));
			КонецЕсли;
			ТекстОшибки = СтрСоединить(ЧастиСообщения, " ");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить();
	Для Каждого ТекСтрока Из ОбъектыДМ Цикл
		//заполнение количества драг. камней
		Если Не (ТекСтрока.ВидДрагМатериала.ТипДрагМатериала = Перечисления.ТипыДрагМатериалов.ДрагоценныеКамни)И(ТекСтрока.КоличествоДМ > 0) Тогда
			Шаблон = НСтр("ru='В строке %2 списка ""Содержание драг. материалов"" значение реквизита ""Количество (шт)"" указывается только для драгоценных камней: ""%1""'");
			ТекстОшибки = СтрШаблон(Шаблон, ТекСтрока.ОсновноеСредство, ТекСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоПоступлениюОСИК(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.РеквизитыШапки);
	
	// Заполним данные о капитальных вложениях по остаткам.
	УправлениеОсновнымиСредствами.ЗаполнитьКапитальныеВложенияПоОстаткам(ЭтотОбъект, "РешениеОПризнанииОбъектовОСИК");
	
	СоставКомиссии.Очистить();
	ОсновныеСредства.Очистить();
	
//	СоставКомиссии.Загрузить(ДанныеЗаполнения.Комиссия);
	Для каждого ТекСотрудник из ДанныеЗаполнения.Комиссия Цикл
		НоваяСтрока = СоставКомиссии.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСотрудник);
	КонецЦикла;	
	
	НачислятьАмортизациюИК = Истина;
	Если ДанныеЗаполнения.Свойство("РеквизитыШапки") 
		И ДанныеЗаполнения.РеквизитыШапки.Свойство("Организация")
		И ЗначениеЗаполнено(ДанныеЗаполнения.РеквизитыШапки.Организация) Тогда
	 
		УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(
			ДанныеЗаполнения.РеквизитыШапки.Организация, ДанныеЗаполнения.РеквизитыШапки.Дата);
		НачислятьАмортизациюИК = УчетнаяПолитика.НачислятьАмортизациюИмуществаКазны;
	КонецЕсли;		
	
	Для каждого НовыйОС Из ДанныеЗаполнения.СозданныеОС Цикл
		Для каждого НовыйИнвНомер из НовыйОС.ИнвентарныйНомер Цикл
			НоваяСтрока = ОсновныеСредства.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйОС,, "ИнвентарныйНомер");
			Если НачислятьАмортизациюИК Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеЗаполнения.РеквизитыПорядкаАмортизации);
			КонецЕсли;	
			НоваяСтрока.ИнвентарныйНомер           = НовыйИнвНомер;

			ТекКоличество = ?(НоваяСтрока.Количество = 0, 1, НоваяСтрока.Количество);
			НоваяСтрока.Сумма = ДанныеЗаполнения.ПервоначальнаяСтоимость * ТекКоличество;

			НоваяСтрока.КПС                        = ДанныеЗаполнения.КПС;
			НоваяСтрока.СрокПолезногоИспользования = ДанныеЗаполнения.СрокПолезногоИспользования;
			//НоваяСтрока.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию = 
			//	ДанныеЗаполнения.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию;
			НоваяСтрока.ПрослеживаемыйТовар        = ДанныеЗаполнения.ПрослеживаемыйТовар;
			НоваяСтрока.СтранаПроисхождения        = ДанныеЗаполнения.СтранаПроисхождения;
			НоваяСтрока.ИдентификаторСтроки        = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки
			НоваяСтрока.РезолюцияКомиссии = 
				УправлениеНФАКлиентСервер.ТекстРезолюцииКомиссииПоУмолчанию("РешениеОПризнанииОбъектовОС");
				
			// Рассчитаем суммы переданных амортизации и обесценения, если они есть
			Если ЗначениеЗаполнено(ДанныеЗаполнения.РеквизитыШапки.СуммаОбесценения) Тогда
				НоваяСтрока.СуммаОбесценения = Окр(ДанныеЗаполнения.РеквизитыШапки.СуммаОбесценения 
					* ТекКоличество 
					/ ?(ДанныеЗаполнения.РеквизитыШапки.КоличествоВложений = 0, 1, 
					ДанныеЗаполнения.РеквизитыШапки.КоличествоВложений), 2);
			КонецЕсли;	
			Если ЗначениеЗаполнено(ДанныеЗаполнения.РеквизитыШапки.СуммаАмортизации) Тогда
				НоваяСтрока.СуммаАмортизации = Мин(НоваяСтрока.Сумма - НоваяСтрока.СуммаОбесценения,
					Окр(ДанныеЗаполнения.РеквизитыШапки.СуммаАмортизации * ТекКоличество 
					/ ?(ДанныеЗаполнения.РеквизитыШапки.КоличествоВложений = 0, 1, 
					ДанныеЗаполнения.РеквизитыШапки.КоличествоВложений), 2));
			КонецЕсли;	
				
			Если ДанныеЗаполнения.ДрагМатериалыОдногоОбъекта.Количество() > 0 Тогда
				Для каждого ДМ Из ДанныеЗаполнения.ДрагМатериалыОдногоОбъекта Цикл
					НоваяСтрокаДМ                  = ДрагоценныеМатериалы.Добавить();
					НоваяСтрокаДМ.ОсновноеСредство = НоваяСтрока.ОсновноеСредство;
					НоваяСтрокаДМ.ИнвентарныйНомер = НоваяСтрока.ИнвентарныйНомер;
					НоваяСтрокаДМ.ВидДрагМатериала = ДМ.ВидДрагМатериала;
					НоваяСтрокаДМ.МассаДМ          = ДМ.Масса;
					НоваяСтрокаДМ.ЕдИзм            = ДМ.ЕдИзм;
					НоваяСтрокаДМ.КоличествоДМ     = ДМ.КоличествоДМ;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры	

Процедура ЗаполнитьПоРеконструкцииИК(ДанныеЗаполнения)
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат;
	КонецЕсли;	
	
	ОсновныеСредства.Очистить();
	КапитальныеВложения.Очистить();
	СведенияОВидахРабот.Очистить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Шапка.Организация,
	|	Шапка.ИФО,
	|	Шапка.КФО,
	|	Шапка.Подразделение,
	|	Шапка.Договор,
	|	Шапка.Контрагент,
	|	Шапка.ВнеоборотныйАктив КАК КапитальноеВложение,
	|	Шапка.СчетКредита КАК СчетВложений,
	|	Шапка.СуммаДокумента КАК СуммаВложений,
	|	ТЧОсновныеСредства.ЦМО,
	|	ТЧОсновныеСредства.СчетУчета
	|ИЗ
	|	Документ.РеконструкцияИК КАК Шапка,
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		РеконструкцияИКОсновныеСредства.ЦМО,
	|		РеконструкцияИКОсновныеСредства.СчетУчета
	|	ИЗ
	|		Документ.РеконструкцияИК.ОсновныеСредства КАК РеконструкцияИКОсновныеСредства
	|	ГДЕ
	|		РеконструкцияИКОсновныеСредства.Ссылка = &Ссылка) КАК ТЧОсновныеСредства
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧОсновныеСредства.ОсновноеСредство,
	|	ТЧОсновныеСредства.ИнвентарныйНомер,
	|	ТЧОсновныеСредства.СуммаДемонтажа + ТЧОсновныеСредства.СуммаТранспортировки + ТЧОсновныеСредства.СуммаРемонта +
	|		ТЧОсновныеСредства.СуммаМодернизации КАК Сумма,
	|	ТЧОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации КАК СрокПолезногоИспользования,
	|	ТЧОсновныеСредства.Ссылка.КПСУчетаИК КАК КПС,
	|	ТЧОсновныеСредства.СрокЭксплуатацииФакт КАК ФактическийСрокЭксплуатации,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации < ТЧОсновныеСредства.СрокЭксплуатацииФакт
	|			ТОГДА 0
	|		ИНАЧЕ ТЧОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации - ТЧОсновныеСредства.СрокЭксплуатацииФакт
	|	КОНЕЦ КАК ОставшийсяСрокПолезногоИспользования,
	|	ТЧОсновныеСредства.Ссылка.НаименованиеГарантийногоТалона КАК НаименованиеГТ,
	|	ТЧОсновныеСредства.Ссылка.НомерГарантийногоТалона КАК НомерГТ,
	|	ТЧОсновныеСредства.Ссылка.ДатаГарантийногоТалона КАК ДатаГТ,
	|	ТЧОсновныеСредства.Ссылка.СрокДействияГарантийногоТалона КАК СрокДействияГТ
	|ИЗ
	|	Документ.РеконструкцияИК.ОсновныеСредства КАК ТЧОсновныеСредства
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧКапитальныеВложения.Договор,
	|	ТЧКапитальныеВложения.ЦМО,
	|	ТЧКапитальныеВложения.КПС,
	|	ТЧКапитальныеВложения.Сумма
	|ИЗ
	|	Документ.РеконструкцияИК.КапитальныеВложения КАК ТЧКапитальныеВложения
	|ГДЕ
	|	ТЧКапитальныеВложения.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧОсновныеСредства.ОсновноеСредство,
	|	ТЧОсновныеСредства.ИнвентарныйНомер,
	|	ТЧОсновныеСредства.ВидРаботы,
	|	ТЧОсновныеСредства.СуммаДемонтажа,
	|	ТЧОсновныеСредства.СуммаТранспортировки,
	|	ТЧОсновныеСредства.СуммаРемонта,
	|	ТЧОсновныеСредства.СуммаМодернизации,
	|	ТЧОсновныеСредства.СтоимостьПоОкончанииРабот
	|ИЗ
	|	Документ.РеконструкцияИК.ОсновныеСредства КАК ТЧОсновныеСредства
	|ГДЕ
	|	ТЧОсновныеСредства.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаОС = РезультатЗапроса[1].Выбрать();
	ВыборкаКВ = РезультатЗапроса[2].Выбрать();
	ВыборкаРаботы = РезультатЗапроса[3].Выбрать();
	
	ДокументОснование = ДанныеЗаполнения;
	Дата = НачалоДня(ТекущаяДатаСеанса());
	
	Если ВыборкаШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	КонецЕсли;	
	
	Пока ВыборкаКВ.Следующий() Цикл
		СтрокаТЧ = КапитальныеВложения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаКВ);
	КонецЦикла;	

	Пока ВыборкаОС.Следующий() Цикл
		СтрокаТЧ = ОсновныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаОС);
		СтрокаТЧ.РезолюцияКомиссии = НСтр("ru = 'Готов к эксплуатации'");
		СтрокаТЧ.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки
	КонецЦикла;	

	Пока ВыборкаРаботы.Следующий() Цикл
		СтрокаТЧ = СведенияОВидахРабот.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаРаботы);
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
