&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Инициализация.
	МаксимальноеКоличествоСтрокТаблицыЦенностей = Документы.АктИнвентаризацииНаличныхДенежныхСредств.ПолучитьМаксимальноеКоличествоСтрокТаблицыЦенностей();
	// Различные типы у поля "ПоследнийРКО":
	ВремСписок = Новый СписокЗначений();
	ВремСписок.Добавить("Документ.ВедомостьНаВыдачуДенегИзКассы.ФормаВыбора",	Метаданные.Документы.ВедомостьНаВыдачуДенегИзКассы.Синоним);
	ВремСписок.Добавить("Документ.РасходныйКассовыйОрдер.ФормаВыбора",			Метаданные.Документы.РасходныйКассовыйОрдер.Синоним);
	// Имена открываемых форм документов:
	ВремСоответствие = Новый Соответствие();
	ВремСоответствие.Вставить("ПоследнийПКОНомер", "Документ.ПриходныйКассовыйОрдер.ФормаВыбора");
	ВремСоответствие.Вставить("ПоследнийРКОНомер", ВремСписок);
	ВремСоответствие.Вставить("ПоследнийПОФНомер", "Документ.ПриходныйОрдерФондовый.ФормаВыбора");
	ВремСоответствие.Вставить("ПоследнийРОФНомер", "Документ.РасходныйОрдерФондовый.ФормаВыбора");
	ИменаФормДокументов = Новый ФиксированноеСоответствие(ВремСоответствие);
	
	// Заполняем по возможности новый документ:
	Если Объект.Ссылка.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Этот документ создан копированием.
			
		ИначеЕсли ЗначениеЗаполнено(Параметры.Основание) Тогда
			// Этот документ создан на основании.
			
		Иначе
			// Это совсем новый документ.
			СтрокаТЧ = Объект["ЦенностиФакт"].Добавить();
			СтрокаТЧ["ВидЦенности"] = НСтр("ru='Наличных денег'");
		КонецЕсли;
		
	КонецЕсли;
	
	// Кэшируем сведения:
	ОбновитьКэшФормы();
	
	// Результаты инвентаризации:
	Расхождения = ВычислитьНедостачуИИзлишек(
		Объект["ЦенностиФакт"].Итог("Сумма"),
		Объект["ИтогоУчет"]);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Расхождения);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаПодвал);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекстЗаголовкаСообщений = НСтр("ru='Акт инвентаризации д/с (Инв-15)'");
	
	НастроитьФормуКлиент();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	//---
	// Поддержка выбора инвентаризационной комиссии.
	//---
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПостоянноДействующиеКомиссии.Форма.ФормаВыбора" Тогда
		
		УправлениеОсновнымиСредствамиКлиент.УстановитьКомиссиюВДокументОС(	ВыбранноеЗначение, 
																			Объект, 
																			ЭтаФорма, 
																			Объект.НомерПриказаКомиссии, 
																			Объект.ДатаПриказаКомиссии);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.Сотрудники.ФормаВыбора"
		ИЛИ ИсточникВыбора.ИмяФормы = "Справочник.Сотрудники.Форма.ФормаВыбора" Тогда
		
		УправлениеОсновнымиСредствамиКлиент.ОбработатьВыборПредседателяКомиссии(
			ЭтаФорма,
			ВыбранноеЗначение,
			,
			Объект.ДолжностьПредседателяКомиссии,
			Объект.ФамилияПредседателяКомиссии,
			Объект.ИмяПредседателяКомиссии,
			Объект.ОтчествоПредседателяКомиссии);
	//---
	
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ИнвентаризацияКассы.ФормаВыбора" Тогда
		// Выбран документ-основание "Инвентаризация кассы".
		// Обработчик формы (вместо обработчика элемента) используется для корректной установки фокуса (далее).
		Объект["ДокументОснование"] = ВыбранноеЗначение;
		ЗаполнитьПоДокументуИнвентаризацииКассыСервер();
		
		ЭтаФорма.ТекущийЭлемент = Элементы["СтраницаЦенности"];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти(НСтр("ru='При изменении даты акта инвентаризации'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииКлиент();
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура МОЛПриИзменении(Элемент)
	
	ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти(НСтр("ru='При изменении МОЛ'"));
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПолучитьКонтрагента(Объект["МОЛ"]));
	
КонецПроцедуры

&НаКлиенте
Процедура ИтогоУчетПриИзменении(Элемент)
	
	// Результаты инвентаризации:
	Расхождения = ВычислитьНедостачуИИзлишек(
		Объект["ЦенностиФакт"].Итог("Сумма"),
		Объект["ИтогоУчет"]);
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Расхождения);
	
КонецПроцедуры

//---
// Редактирование номеров последних кассовых документов

&НаКлиенте
Процедура НомерПКОПриИзменении(Элемент)
	НомерКассовогоДокумента_ПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура НомерПКОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НомерКассовогоДокумента_ПриНачалеВыбора(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура НомерПКООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НомерКассовогоДокумента_ОбработкаВыбора(Элемент, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПоследнийРКОНомерПриИзменении(Элемент)
	НомерКассовогоДокумента_ПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура НомерРКОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НомерКассовогоДокумента_ПриНачалеВыбора(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура ПоследнийРКОНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НомерКассовогоДокумента_ОбработкаВыбора(Элемент, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПоследнийПОФНомерПриИзменении(Элемент)
	НомерКассовогоДокумента_ПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура НомерПОФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НомерКассовогоДокумента_ПриНачалеВыбора(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура ПоследнийПОФНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НомерКассовогоДокумента_ОбработкаВыбора(Элемент, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура ПоследнийРОФНомерПриИзменении(Элемент)
	НомерКассовогоДокумента_ПриИзменении(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура НомерРОФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	НомерКассовогоДокумента_ПриНачалеВыбора(Элемент);
КонецПроцедуры
&НаКлиенте
Процедура ПоследнийРОФНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НомерКассовогоДокумента_ОбработкаВыбора(Элемент, ВыбранноеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьФКПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииУчитыватьФК();
	
	ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти(НСтр("ru='При изменении флажка ""Учитывать фондовую кассу""'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект["ДокументОснование"]) Тогда
		ПроверитьИЗаполнитьПоДокументуИнвентаризацииКассы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ФактическоеНаличиеЦенностей
&НаКлиенте
Процедура ЦенностиФактПриИзменении(Элемент)
	
	// Результаты инвентаризации:
	Расхождения = ВычислитьНедостачуИИзлишек(
		Объект["ЦенностиФакт"].Итог("Сумма"),
		Объект["ИтогоУчет"]);
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Расхождения);

КонецПроцедуры
&НаКлиенте
Процедура ЦенностиФактПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Объект["ЦенностиФакт"].Количество() >= МаксимальноеКоличествоСтрокТаблицыЦенностей Тогда
		Отказ = Истина;
		
		// Категории для русского языка:
		//	Ноль	(-);
		//	Один	(1 шт);
		//	Два		(-);
		//	Немного	(2 шт);
		//	Много	(5 шт);
		//	Другое	(-)
		НадписьКоличество = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 показателя;;%1 показателей;%1 показателей;'"),
			МаксимальноеКоличествоСтрокТаблицыЦенностей);
		
		Текст = НСтр("ru='Печатной формой предусмотрено не более %1.
			|Добавление новой строки отменено (в таблице ""Фактическое наличие ценностей"").'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, НадписьКоличество);
		
		ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии
&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьИЗаполнитьПоДокументуИнвентаризацииКассы(Команда)
	
	ТекстСообщения = НСтр("ru='Редактируемый документ будет перезаполнен по документу-основанию ""Инвентаризация кассы"".
		|
		|Продолжить и выбрать документ-основание?'");
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВыбратьИЗаполнитьПоДокументуИнвентаризацииКассы_Выбор", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры
&НаКлиенте
Процедура ВыбратьИЗаполнитьПоДокументуИнвентаризацииКассы_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		// Открываем форму выбора документа-основания:
		Отбор = Новый Структура("МОЛ, Организация",
			Объект["МОЛ"],
			Объект["Организация"]);
		ПараметрыФормы = Новый Структура("Отбор, ТекущаяСтрока",
			Отбор,
			Объект["ДокументОснование"]);
		ОткрытьФорму("Документ.ИнвентаризацияКассы.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументуИнвентаризацииКассы(Команда)
	
	Если ЗначениеЗаполнено(Объект["ДокументОснование"]) Тогда
		
		ПроверитьИЗаполнитьПоДокументуИнвентаризацииКассы();
		
	Иначе
		ТекстСообщения = НСтр("ru='Укажите документ-основание ""Инвентаризация кассы""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.ДокументОснование");
	КонецЕсли;
	
КонецПроцедуры

// Страница "Комиссия":
	
&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",	Объект["ДатаНачала"]);
	СтруктураПараметров.Вставить("КонецПериода",	Объект["ДатаОкончания"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["ДатаНачала"]	= РезультатВыбора["НачалоПериода"];
		Объект["ДатаОкончания"]	= РезультатВыбора["КонецПериода"];
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ТекстСообщения = НСтр("ru='Сначала необходимо выбрать организацию'");
		ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма, Объект.Организация, Объект.Дата);
	
КонецПроцедуры
&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект.Организация, Объект.Дата);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ОбновитьКэшФормы()
	
	МОЛ_Контрагент = ПолучитьКонтрагента(Объект["МОЛ"]);
	ПоследнийПКО_Номер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект["ПоследнийПКО"], "Номер");
	ПоследнийРКО_Номер = ?(ЗначениеЗаполнено(Объект["ПоследнийРКО"]),	// доп.проверка для реквизита составного типа.
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект["ПоследнийРКО"], "Номер"),
		"");
	ПоследнийПОФ_Номер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект["ПоследнийПОФ"], "Номер");
	ПоследнийРОФ_Номер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект["ПоследнийРОФ"], "Номер");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуКлиент()
	
	НовДоступностьКомиссия			= ЗначениеЗаполнено(Объект.Организация);
	
	// Инвентаризационная комиссия:
	Элементы["СтраницаИнвентаризация"].ТолькоПросмотр			= НЕ НовДоступностьКомиссия;
	Элементы["УстановитьПериод"].Доступность					= НовДоступностьКомиссия;
	Элементы["КомандаВыбратьКомиссию"].Доступность				= НовДоступностьКомиссия;
	Элементы["ВыбратьПредседателяКомиссии"].Доступность			= НовДоступностьКомиссия;
	Элементы["СоставКомиссииПодобратьСотрудников"].Доступность	= НовДоступностьКомиссия;
	
	НастроитьФормуКлиент_ПриИзмененииУчитыватьФК();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуКлиент_ПриИзмененииУчитыватьФК()
	
	НовДоступность = Объект["УчитыватьФК"];
	
	Элементы["ГруппаНомераДокументовДД"].Доступность = НовДоступность;
	
	ДополнительныйЗаголовокПоследнихДенежныхДокументов = ?(НовДоступность,
		"",
		НСтр("ru='фондовая касса не учитывается'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	
	ТекстСообщения = НСтр("ru='Изменение организации вызовет полную очистку
		|табличной части документа и некоторых полей шапки.
		|
		|Продолжить и сменить организацию?'");
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОрганизацияПередИзменениемКлиент_Ответ", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		Объект["Организация"] = ПараметрыОповещения["ВыбранноеЗначение"];
		ЭтаФорма.Модифицированность = Истина;
		ОрганизацияПриИзмененииКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзмененииКлиент()
	
	ОчиститьРеквизитыНесоответствующиеОрганизацииКлиент();
	
	НастроитьФормуКлиент();
	
КонецПроцедуры
&НаКлиенте
Процедура ОчиститьРеквизитыНесоответствующиеОрганизацииКлиент()
	
	// Сначала очищаем все, кроме комиссии:
	ОчиститьРеквизитыКромеКомиссии();
	
	// Дополнительно очищаем сведения об инв.комиссии и о проводимой инв.:
	Объект["СоставКомиссии"].Очистить();
	ОчищающаяСтруктура = Новый Структура("
		|ДолжностьПредседателяКомиссии,
		|ФамилияПредседателяКомиссии,
		|ИмяПредседателяКомиссии,
		|ОтчествоПредседателяКомиссии,
		|НомерПриказаИнвентаризации,
		|ДатаПриказаИнвентаризации,
		|НомерПриказаКомиссии,
		|ДатаПриказаКомиссии,
		|МестоИнвентаризации,
		|ПричинаИнвентаризации");
	ЗаполнитьЗначенияСвойств(Объект, ОчищающаяСтруктура);
	
КонецПроцедуры
&НаКлиенте
Процедура ОчиститьРеквизитыКромеКомиссии()
	
	// Очищаем данные:
	Объект["ЦенностиФакт"].Очистить();
	Объект["ИтогоУчет"] = Неопределено;
		
	// Реквизиты документа:
	ОчищающаяСтруктура = Новый Структура("
		|ПоследнийРКО,
		|ПоследнийРКОНомер,
		|ПоследнийПКО,
		|ПоследнийПКОНомер,
		|ПоследнийРОФ,
		|ПоследнийРОФНомер,
		|ПоследнийПОФ,
		|ПоследнийПОФНомер");
	ЗаполнитьЗначенияСвойств(Объект, ОчищающаяСтруктура);
		
	// Реквизиты формы:
	ОчищающаяСтруктура = Новый Структура("
		|ПоследнийПКО_Номер,
		|ПоследнийПОФ_Номер,
		|ПоследнийРКО_Номер,
		|ПоследнийРОФ_Номер,
		|СуммаИзлишек,
		|СуммаНедостача");
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ОчищающаяСтруктура);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти(ТекстЧтоИзменилось)
	
	Если Объект["ЦенностиФакт"].Количество() > 0 Тогда
		ТекстСообщения = ТекстЧтоИзменилось
			+ НСтр("ru='рекомендуется очистить табличную часть ""Фактическое наличие ценностей"".
				|
				|Если эта табличная часть заполнялась по данным учета, то сведения в ней могут уже не соответствовать данным учета.
				|
				|Продолжить и очистить?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 40, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриИзмененииПоляВлияющегоНаЗаполнениеТаблЧасти_Выбор(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		// Очищаем все сведения, кроме инв.комиссии и сведений о проводимой инв.:
		ОчиститьРеквизитыКромеКомиссии();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВычислитьНедостачуИИзлишек(ИтогоФакт, ИтогоУчет)
	
	Разница = ИтогоФакт - ИтогоУчет;
	
	Недостача	= ?(Разница < 0, -Разница, 0);
	Излишек		= ?(Разница > 0, Разница, 0);
	
	Возврат Новый Структура("СуммаНедостача, СуммаИзлишек",
		Недостача,
		Излишек);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтрагента(МОЛСсылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МОЛСсылка, "Контрагент");
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерДокумента(ДокСсылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "Номер");
		
КонецФункции

//---
// Редактирование номеров последних кассовых документов

&НаКлиенте
Функция НомерКассовогоДокумента_ПолучитьИменаСвязанныхЭлементов(ИмяЭлемента)
	
	ИмяРеквизитаДокСсылка	= СтрЗаменить(ИмяЭлемента, "Номер", "");
	ИмяРеквизитаКэшНомер	= СтрЗаменить(ИмяЭлемента, "Номер", "_Номер");
	ИмяРеквизитаНомер		= ИмяЭлемента;
	
	Возврат Новый Структура("ДокСсылка, КэшНомер, Номер",
		ИмяРеквизитаДокСсылка,
		ИмяРеквизитаКэшНомер,
		ИмяРеквизитаНомер);
	
КонецФункции
&НаКлиенте
Процедура НомерКассовогоДокумента_ПриИзменении(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	// Имена связанных реквизитов:
	ИменаРеквизитов = НомерКассовогоДокумента_ПолучитьИменаСвязанныхЭлементов(ИмяЭлемента);
	ИмяРеквизитаДокСсылка	= ИменаРеквизитов["ДокСсылка"];
	ИмяРеквизитаКэшНомер	= ИменаРеквизитов["КэшНомер"];
	ИмяРеквизитаНомер		= ИменаРеквизитов["Номер"];
	
	// Очищаем ссылку на документ:
	ОчиститьСсылку = ПустаяСтрока(Объект[ИмяРеквизитаНомер])
		ИЛИ НЕ НомерКассовогоДокумента_НомераОдинаковые(ЭтаФорма[ИмяРеквизитаКэшНомер], Объект[ИмяРеквизитаНомер]);
	Если ОчиститьСсылку Тогда
		Объект[ИмяРеквизитаДокСсылка]	= Неопределено;
		ЭтаФорма[ИмяРеквизитаКэшНомер]	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НомерКассовогоДокумента_ПриНачалеВыбора(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	
	// Имена связанных реквизитов:
	ИменаРеквизитов = НомерКассовогоДокумента_ПолучитьИменаСвязанныхЭлементов(ИмяЭлемента);
	ИмяРеквизитаДокСсылка	= ИменаРеквизитов["ДокСсылка"];
	ИмяРеквизитаКэшНомер	= ИменаРеквизитов["КэшНомер"];
	КассовыйДокументСсылка	= Объект[ИмяРеквизитаДокСсылка];
	
	ИмяОткрываемойФормы = ИменаФормДокументов.Получить(ИмяЭлемента);
	
	Если ТипЗнч(ИмяОткрываемойФормы) = Тип("СписокЗначений") Тогда
		ЗаголовокДиалога = НСтр("ru='Выбор типа данных'");
		
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("КассовыйДокументСсылка",	КассовыйДокументСсылка);
		ПараметрыОповещения.Вставить("Элемент",					Элемент);
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("НомерКассовогоДокумента_ПриНачалеВыбора_Выбор", ЭтотОбъект, ПараметрыОповещения);
		ИмяОткрываемойФормы.ПоказатьВыборЭлемента(ОписаниеОповещенияОЗавершении, ЗаголовокДиалога);
	Иначе
		НомерКассовогоДокумента_ОткрытьФормуВыбораДокумента(ИмяОткрываемойФормы, КассовыйДокументСсылка, Элемент);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НомерКассовогоДокумента_ПриНачалеВыбора_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("ЭлементСпискаЗначений") Тогда
		ИмяОткрываемойФормы = РезультатВыбора.Значение;
		
		НомерКассовогоДокумента_ОткрытьФормуВыбораДокумента(ИмяОткрываемойФормы, ПараметрыОповещения["КассовыйДокументСсылка"], ПараметрыОповещения["Элемент"]);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НомерКассовогоДокумента_ОткрытьФормуВыбораДокумента(ИмяОткрываемойФормы, КассовыйДокументСсылка, Элемент)
	
	ПериодДляСписка = Новый СтандартныйПериод();
	ПериодДляСписка.ДатаОкончания = Объект["Дата"];
	
	Отбор = Новый Структура("Организация, Контрагент",
		Объект["Организация"],
		МОЛ_Контрагент);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор",			Отбор);
	ПараметрыФормы.Вставить("ТекущаяСтрока",	КассовыйДокументСсылка);
	
	ОткрытьФорму(ИмяОткрываемойФормы, ПараметрыФормы, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура НомерКассовогоДокумента_ОбработкаВыбора(Элемент, ВыбранноеЗначение)
	
	ИмяЭлемента = Элемент.Имя;
	
	// Имена связанных реквизитов:
	ИменаРеквизитов			= НомерКассовогоДокумента_ПолучитьИменаСвязанныхЭлементов(ИмяЭлемента);
	ИмяРеквизитаДокСсылка	= ИменаРеквизитов["ДокСсылка"];
	ИмяРеквизитаКэшНомер	= ИменаРеквизитов["КэшНомер"];
	
	// Запоминаем выбранный документ:
	Объект[ИмяРеквизитаДокСсылка] = ВыбранноеЗначение;
	
	// Получаем номер документа для печати:
	НомерДокумента = ПолучитьНомерДокумента(ВыбранноеЗначение);
	ВыбранноеЗначение = ПолучитьНомерНаПечать(НомерДокумента);
	
	// Кэшируем номер выбранного документа:
	ЭтаФорма[ИмяРеквизитаКэшНомер] = НомерДокумента;
	
КонецПроцедуры
&НаКлиентеНаСервереБезКонтекста
Функция НомерКассовогоДокумента_НомераОдинаковые(Знач НомерДокумента, Знач НомерУказанныйВручную)
	
	Результат = Ложь;
	
	НомерДокумента = СокрЛП(НомерДокумента);
	НомерУказанныйВручную = СокрЛП(НомерУказанныйВручную);
	
	Если НомерДокумента = НомерУказанныйВручную Тогда
		Результат = Истина;
		
	Иначе
		// Почти одинаковые, если <НомерУказанныйВручную>=[0\s]*<НомерНаПечать(НомерДокумента)>
		
		НомерНаПечать = ПолучитьНомерНаПечать(НомерДокумента);
		
		ПозицияОкончания = Найти(НомерУказанныйВручную, НомерНаПечать);
		ОкончаниеСовпадает = (ПозицияОкончания > 0
			И ПозицияОкончания = СтрДлина(НомерУказанныйВручную) - СтрДлина(НомерНаПечать) + 1);
		
		Если ОкончаниеСовпадает Тогда
			ЛеваяЧасть = Лев(НомерУказанныйВручную, ПозицияОкончания - 1);
			ЛеваяЧасть = СтрЗаменить(ЛеваяЧасть, "0", "");
			ЛеваяЧасть = СтрЗаменить(ЛеваяЧасть, " ", "");
			Если ЛеваяЧасть = "" Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьНомерНаПечать(НомерДокумента)
	Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерДокумента)
КонецФункции

//---
// Заполнение документа

&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДокументуИнвентаризацииКассы()
	
	ТекстСообщения = НСтр("ru='Редактируемый документ будет перезаполнен по выбранному документу-основанию.
		|
		|Продолжить и перезаполнить?'");
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьПоДокументуИнвентаризацииКассы_Экспорт", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДокументуИнвентаризацииКассы_Экспорт(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументуИнвентаризацииКассыСервер();
	КонецЕсли;
	
КонецПроцедуры


// Заполнение по документу "Инвентаризация кассы".
&НаСервере
Процедура ЗаполнитьПоДокументуИнвентаризацииКассыСервер()
	
	Документы.ИнвентаризацияКассы.ЗаполнитьДокумент_АктИнвентаризацияНаличныхДС(
		Объект,
		Объект["ДокументОснование"]);
		
	// Результаты инвентаризации:
	Расхождения = ВычислитьНедостачуИИзлишек(
		Объект["ЦенностиФакт"].Итог("Сумма"),
		Объект["ИтогоУчет"]);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Расхождения);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
