#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

Функция РасчетТорговойНаценки(ДокументОбъект, ТиповаяОперация, ДополнительныеРеквизиты, Отказ) Экспорт
	
	ДокументОбъект.Движения.ЖурналПроводокЕПСБУ.Записывать = Истина;
	ДокументОбъект.Движения.ЖурналПроводокЕПСБУ.Очистить();
	ДокументОбъект.Движения.ЖурналПроводокЕПСБУ.Записать();
	
	ТаблицаПроводок = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	КЭКРозницы = БухгалтерскиеОперацииПовтИсп.ЗначениеДопРеквизита(ДополнительныеРеквизиты, "КЭКРозницы");
	
	// Расчет торговой наценки.
	ТаблицыТорговойНаценки = УправлениеМатериальнымиЗапасами.РассчитатьТорговуюНаценку(ДокументОбъект, КЭКРозницы, Отказ);
	
	Если Отказ = Истина Тогда
		ТаблицаПроводок.Очистить();
		Возврат ТаблицаПроводок;
	КонецЕсли;
	
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	// Бухгалтерский учет.
	Для каждого СтрокаБУ Из ТаблицыТорговойНаценки["ТаблицаТорговойНаценкиБУ"] Цикл
		
		Если СтрокаБУ.СуммаНаценки = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяПроводка = ТаблицаПроводок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПроводка, СтрокаБУ, "ИФО, КФО");
		
		НоваяПроводка.СчетДт = СтрокаБУ.СчетДоходов;
		НоваяПроводка.КПСДт  = СтрокаБУ.КПСДоходов;
		НоваяПроводка.КЭКДт  = СтрокаБУ.КЭКДоходов;
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", 1, СтрокаБУ.СубконтоДоходов1);
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", 2, СтрокаБУ.СубконтоДоходов2);
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", 3, СтрокаБУ.СубконтоДоходов3);
		
		СвойстваСчетаДт = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетДт);
		Если ИспользоватьУчетПоПодразделениям И СвойстваСчетаДт.УчетПоПодразделениям Тогда
			НоваяПроводка.ПодразделениеДт = СтрокаБУ.ПодразделениеДоходов;
		КонецЕсли;
		
		НоваяПроводка.СчетКт        = СтрокаБУ.СчетНаценки;
		НоваяПроводка.КПСКт         = СтрокаБУ.КПСРозницы;
		НоваяПроводка.КЭККт         = СтрокаБУ.КЭКРозницы;
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Кт", "ЦМО", СтрокаБУ.ЦМО);
		
		СвойстваСчетаКт = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетКт);
		Если ИспользоватьУчетПоПодразделениям И СвойстваСчетаКт.УчетПоПодразделениям Тогда
			НоваяПроводка.ПодразделениеКт = СтрокаБУ.ПодразделениеРозницы;
		КонецЕсли;
		
		НоваяПроводка.Сумма = - СтрокаБУ.СуммаНаценки;
		
		НоваяПроводка.ЖурналОпераций = БухгалтерскийУчетПовтИсп.НомерЖурнала(НоваяПроводка.СчетДт, НоваяПроводка.СчетКт);
		
	КонецЦикла;
	
	// Налоговый учет.
	Для каждого СтрокаНУ Из ТаблицыТорговойНаценки["ТаблицаТорговойНаценкиНУ"] Цикл
		
		Если СтрокаНУ.СуммаНаценки = 0 И СтрокаНУ.СуммаНаценкиНеУчитываетсяНУ = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяПроводка = ТаблицаПроводок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяПроводка, СтрокаНУ, "ИФО, КФО");
		
		НоваяПроводка.СчетДт = СтрокаНУ.СчетДоходов;
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", 1, СтрокаНУ.СубконтоДоходов1);
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", 2, СтрокаНУ.СубконтоДоходов2);
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", 3, СтрокаНУ.СубконтоДоходов3);
		
		НоваяПроводка.СчетКт        = СтрокаНУ.СчетНаценки;
		
		БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Кт", "ЦМО", СтрокаНУ.ЦМО);
		
		НоваяПроводка.Сумма                = - СтрокаНУ.СуммаНаценки;
		НоваяПроводка.СуммаНеУчитываетсяНУ = - СтрокаНУ.СуммаНаценкиНеУчитываетсяНУ;
		
		НоваяПроводка.ЖурналОпераций = БухгалтерскийУчетПовтИсп.НомерЖурнала(НоваяПроводка.СчетДт, НоваяПроводка.СчетКт);
		
	КонецЦикла;
	
	ТаблицаПроводок.ЗаполнитьЗначения(Истина, "Активность");
	ТаблицаПроводок.ЗаполнитьЗначения(ДокументОбъект.Организация, "Организация");
	ТаблицаПроводок.ЗаполнитьЗначения(ДокументОбъект.Дата, "Период");
	ТаблицаПроводок.ЗаполнитьЗначения("Расчет торговой наценки", "ВидПервичногоДокумента");
	ТаблицаПроводок.ЗаполнитьЗначения(ДокументОбъект.Дата, "ДатаПервичногоДокумента");
	ТаблицаПроводок.ЗаполнитьЗначения(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОбъект.Номер, Истина, Истина), "НомерПервичногоДокумента");
	ТаблицаПроводок.ЗаполнитьЗначения("Расчет торговой наценки по проданным товарам", "Содержание");
	
	Возврат ТаблицаПроводок;

КонецФункции

#КонецЕсли
