#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УправлениеОсновнымиСредствами.ПроверитьДублиИнвентарныхНомеровВТабЧасти(ЭтотОбъект, "ОсновныеСредства", Отказ);
	
	ШаблонТекста = "По объекту ""%1"" есть накопленное обесценение, переценка возможна после восстановления обесценения";
	ШаблонПоля = "Объект.ОсновныеСредства[%1].СуммаОбесценения";
	Для Каждого СтрокаТаблицы Из ОсновныеСредства Цикл
		Если СтрокаТаблицы.СуммаОбесценения <> 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, СтрокаТаблицы.ОсновноеСредство);
			Поле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПоля, СтрокаТаблицы.НомерСтроки - 1);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, Поле,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если Не БухгалтерскийУчет.ПодразделениеОбязательно(ОсновныеСредства.ВыгрузитьКолонку("СчетУчета")) Тогда
		НеПроверяемыеРеквизиты.Добавить("Подразделение");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = ОсновныеСредства.Итог("ПереоцененнаяСтоимость")
		- (ОсновныеСредства.Итог("БалансоваяСтоимость") - ОсновныеСредства.Итог("СуммаАмортизации"));
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ВводНаОсновании") И ДанныеЗаполнения.ВводНаОсновании
			И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			
			СтандартнаяОбработка = Ложь;
			Если ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
				ЗаполнитьНаОсновании_ИнвентаризационнаяОписьНФА(ДанныеЗаполнения);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОсновании_ИнвентаризационнаяОписьНФА(ДанныеЗаполнения)
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	Разделитель = ДанныеЗаполнения.Разделитель;   
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Разделитель);
	
	СсылкаЦелевогоДокумента = Неопределено;
	Если ДанныеЗаполнения.Свойство("СсылкаЦелевогоДокумента") Тогда
		СсылкаЦелевогоДокумента = ДанныеЗаполнения.СсылкаЦелевогоДокумента;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Документы.ИнвентаризационнаяОписьНФА.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокументОснование, СсылкаЦелевогоДокумента);
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеИнвентаризации.НФА КАК ОсновноеСредство,
	|	ДанныеИнвентаризации.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ДанныеИнвентаризации.СуммаОбесценение КАК ПереоцененнаяСтоимость
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации = &Ссылка
	|	И ДанныеИнвентаризации.ИФО = &ИФО
	|	И ДанныеИнвентаризации.КФО = &КФО
	|	И ДанныеИнвентаризации.ВидОбъекта В (2, 3)
	|	И (ДанныеИнвентаризации.КоличествоОбесценение <> 0
	|			ИЛИ ДанныеИнвентаризации.СуммаОбесценение <> 0)
	|	И ДанныеИнвентаризации.Счет = &СчетЗемли";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ИФО", Разделитель.ИФО);
	Запрос.УстановитьПараметр("КФО", Разделитель.КФО);
	Запрос.УстановитьПараметр("СчетЗемли", БухгалтерскийУчет.СчетПоКоду("103.11"));
	Выборка = Запрос.Выполнить().Выбрать();    
	
	ДанныеДокОснование = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация, Дата");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокОснование);
	Дата = НачалоДня(Дата);
	СпособПереоценки = Перечисления.СпособыПереоценкиОС.СписатьАмортизацию;
	
	ОсновныеСредства.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ОсновныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли