
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьРасчетаПоСредней(ЭтотОбъект);
	УстановитьОтметкуНезаполненногоПоляКонтрагент(ЭтотОбъект);
	ОбщегоНазначенияБГУ.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "СтавкаКомпенсацииРодительскойПлаты", Новый Структура);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтаФорма, "СтавкаКомпенсацииРодительскойПлаты", Новый Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ПроверитьЗаполнениеКонтрагента() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "СтавкаКомпенсацииРодительскойПлаты");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособРасчетаРодительскойПлатыПриИзменении(Элемент)
	
	УстановитьВидимостьРасчетаПоСредней(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетСПриИзменении(Элемент)
	СтавкаКомпенсацииРодительскойПлаты.Период = НачалоМесяца(СтавкаКомпенсацииРодительскойПлаты.Период);
КонецПроцедуры

&НаКлиенте
Процедура НачислятьКомпенсациюРодительскойПлатыСводноПриИзменении(Элемент)
	УстановитьОтметкуНезаполненногоПоляКонтрагент(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикКомандФормы

&НаКлиенте
Процедура ИсторияИзмененияСтавки(Команда)
	ОткрытьФорму("РегистрСведений.СтавкаКомпенсацииРодительскойПлаты.Форма.ФормаНабораЗаписей",
		Новый Структура("ТолькоПросмотр", ТолькоПросмотр),
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРасчетаПоСредней(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаРасчетПоСредней", "Видимость",
		Форма.НаборКонстант.СпособРасчетаКомпенсацииРодительскойПлаты = ПредопределенноеЗначение("Перечисление.СпособыРасчетаКомпенсацииРП.ПоСреднемесячной"));

КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеКонтрагента()

	Если НаборКонстант.НачислятьКомпенсациюРодительскойПлатыСводно
		И Не ЗначениеЗаполнено(НаборКонстант.КонтрагентДляНачисленияКомпенсацииРодительскойПлаты) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Контрагент для начисления компенсации родительской платы'")),,
			"НаборКонстант.КонтрагентДляНачисленияКомпенсацииРодительскойПлаты");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтметкуНезаполненногоПоляКонтрагент(Форма)

	Обязательность = Форма.НаборКонстант.НачислятьКомпенсациюРодительскойПлатыСводно;
	КонтрагентВыбран = ЗначениеЗаполнено(Форма.НаборКонстант.КонтрагентДляНачисленияКомпенсацииРодительскойПлаты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КонтрагентДляНачисленияКомпенсацииРодительскойПлаты",
		"АвтоотметкаНезаполненного",
		Обязательность);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КонтрагентДляНачисленияКомпенсацииРодительскойПлаты",
		"ОтметкаНезаполненного",
		Обязательность И НЕ КонтрагентВыбран);

КонецПроцедуры

#КонецОбласти
