#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьДвиженияПоРегистру(ДокументСсылка, ПроводкиДокумента, ТаблицыДляДвижений = Неопределено) Экспорт
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	Если Не МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыСведений.УчетныеДанныеОбъектаОС)
		Или ПроводкиДокумента.ДополнительныеСвойства.Свойство("НеФормироватьУчетныеДанныеИзПроводок") Тогда
		Возврат;
	КонецЕсли;
	
	// Список счетов учета внеоборотных активов, для которых будет фиксироваться информация в регистре
	СчетаУчетаВнеоборотныхАктивов = "101.00,102.00,103.00,106.00,107.00,108.00,111.60,01,02,21";
	
	ПоследниеПроводки = Новый ТаблицаЗначений;
	ПоследниеПроводки.Колонки.Добавить("Период"				, Новый ОписаниеТипов("Дата"));
	ПоследниеПроводки.Колонки.Добавить("Организация"		, Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ПоследниеПроводки.Колонки.Добавить("ОсновноеСредство"	, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ПоследниеПроводки.Колонки.Добавить("ВидУчета"			, Новый ОписаниеТипов("ПеречислениеСсылка.ВидыУчетаНФА"));
	ПоследниеПроводки.Колонки.Добавить("НомерПроводки"		, Новый ОписаниеТипов("Число"));
	ПоследниеПроводки.Колонки.Добавить("НомерПроводкиБ"		, Новый ОписаниеТипов("Число"));
	
	Для НомерПроводки = 1 По ПроводкиДокумента.Количество() Цикл
		
		Проводка = ПроводкиДокумента[НомерПроводки-1];
		
		Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, СчетаУчетаВнеоборотныхАктивов)
			И ЗначениеЗаполнено(Проводка.СубконтоДт.ОсновныеСредства) Тогда
			
			Если Проводка.СчетДт = Проводка.СчетКт
				И Проводка.СубконтоДт.ОсновныеСредства = Проводка.СубконтоКт.ОсновныеСредства
				И Проводка.КПСДт = Проводка.КПСКт
				И Проводка.КЭКДт = Проводка.КЭККт Тогда
				Продолжить; // Перемещение без изменения счета, КПС, КЭК и объекта учета не фиксируем.
			КонецЕсли;
			
			Сумма = ?(ЗначениеЗаполнено(Проводка.Сумма), Проводка.Сумма, 0);
			Если Сумма <= 0 Тогда
				Продолжить; // Фиксируем только положительные суммы, отраженные по дебету счетов учета ВНА.
			КонецЕсли;
			
			Отбор = Новый Структура("Период,Организация,ОсновноеСредство,ВидУчета", Проводка.Период,
				Проводка.Организация, Проводка.СубконтоДт.ОсновныеСредства, Перечисления.ВидыУчетаНФА.ПоСчету(Проводка.СчетДт));
			СтрокиПроводок = ПоследниеПроводки.НайтиСтроки(Отбор);
			
			Если СтрокиПроводок.Количество() = 0 Тогда
				СтрокаПроводки = ПоследниеПроводки.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаПроводки, Отбор);
				СтрокаПроводки.НомерПроводки = НомерПроводки;
			Иначе
				СтрокаПроводки = СтрокиПроводок[0];
				СтрокаПроводки.НомерПроводки = Макс(НомерПроводки, СтрокаПроводки.НомерПроводки);
			КонецЕсли;
			
			Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "101.00") Тогда
				СтрокаПроводки.НомерПроводкиБ = Макс(НомерПроводки, СтрокаПроводки.НомерПроводкиБ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПоследниеПроводки.Сортировать("НомерПроводки");
	
	// Подготовим набор записей к записи движений
	НаборЗаписей = РегистрыСведений.УчетныеДанныеОбъектаОС.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого ПоследняяПроводка Из ПоследниеПроводки Цикл
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ПоследняяПроводка);
		
		Проводка = ПроводкиДокумента[ПоследняяПроводка.НомерПроводки-1];
		
		СчетУчета = ?(БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "21"),
			УправлениеОсновнымиСредствамиПовтИсп.СчетУчетаПоЗабалансовомуСчетуОС(Проводка.СчетДт),
			Проводка.СчетДт);
		
		Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "106.00") Тогда
			// При списании материалов, расходов на услуги сторонних организаций и пр. на один объект кап. вложений
			// может быть несколько проводок по дебету с одним и тем же счетом и объектом ВНА.
			КФО = Перечисления.КВД.ПустаяСсылка();
			КПС = Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
		Иначе
			КФО = Проводка.КФО;
			КПС = Проводка.КПСДт;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(КПС) И ЗначениеЗаполнено(ПоследняяПроводка.НомерПроводкиБ)
			И ПоследняяПроводка.НомерПроводкиБ <> ПоследняяПроводка.НомерПроводки Тогда
			КПС = ПроводкиДокумента[ПоследняяПроводка.НомерПроводкиБ-1].КПСДт;
		КонецЕсли;
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПоступлениеУслугРабот")
				Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПоступлениеУслугРаботПоСчетамУчетаЗатрат") Тогда
			
			КЭК = Проводка.КЭКДт;
			
		Иначе
			
			ДанныеПроводки = БухгалтерскийУчетКлиентСервер.ПараметрыРасчетаКЭКПроводки();
			ДанныеПроводки.Организация	= Проводка.Организация;
			ДанныеПроводки.ИФО			= Проводка.ИФО;
			ДанныеПроводки.КФО			= Проводка.КФО;
			ДанныеПроводки.Дата			= Проводка.Период;
			ДанныеПроводки.Счет			= СчетУчета;
			ДанныеПроводки.Субконто1	= Запись.ОсновноеСредство;
			ДанныеПроводки.ДтКт			= "Дт";
			
			КЭК = БухгалтерскийУчет.КЭКПроводки(ДанныеПроводки);
			
		КонецЕсли;
		
		Запись.СчетУчета	= СчетУчета;
		Запись.КФО			= КФО;
		Запись.КПС			= КПС;
		Запись.ИФО			= Проводка.ИФО;
		Запись.КЭК			= КЭК;
		Запись.ВидИмущества	= УправлениеОсновнымиСредствамиКлиентСервер.ВидИмуществаПоСчетуУчета(СчетУчета);
		
	КонецЦикла;
	
	Если ТаблицыДляДвижений = Неопределено Тогда
		
		ИмяСвойства = "ПропуститьПроверкуЗапретаИзменения";
		ЗначениеСвойства = Неопределено;
		Если ПроводкиДокумента.ДополнительныеСвойства.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
			НаборЗаписей.ДополнительныеСвойства.Вставить(ИмяСвойства, ЗначениеСвойства);
		КонецЕсли;
		
		НаборЗаписей.Записать(Истина);
		
	Иначе
		
		ТаблицыДляДвижений.Вставить("УчетныеДанныеОбъектаОС", НаборЗаписей.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли