
////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбменДаннымиБГУ2_БГУ2_ГИСГМП_ЗарегистрироватьИзменениеДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("ОбменБГУ2_БГУ2_ГИСГМП", Источник, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ОбменДаннымиБГУ2_БГУ2_ГИСГМПЗарегистрироватьИзменениеНабораЗаписейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменБГУ2_БГУ2_ГИСГМП", Источник, Отказ, Замещение);
	
КонецПроцедуры

Процедура ОбменДаннымиБГУ2_БГУ2_ГИСГМПЗарегистрироватьУдалениеПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменБГУ2_БГУ2_ГИСГМП", Источник, Отказ);
	
КонецПроцедуры
