
/////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// В соответствии с текущим режимом запуска возвращает значение перечисления,
// соответствующее этому режиму запуска.
//
Функция ТекущийРежимИспользования() Экспорт

	Перем Результат;
	
	РежимЗапуска       = ТекущийРежимЗапуска();
	СкоростьСоединения = ПолучитьСкоростьКлиентскогоСоединения();
	
	Если РежимЗапуска = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
		
		Результат = НеИспользовать;
		
	ИначеЕсли РежимЗапуска = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		
		Если СкоростьСоединения = СкоростьКлиентскогоСоединения.Низкая Тогда
			
			Результат = МедленноеСоединение;
			
		Иначе
			
			ТекущийСеанс = ТекущийСеансРаботы();
		
			Если ТекущийСеанс.ИмяПриложения = "WebClient" Тогда
				Результат = ВебКлиент;
			ИначеЕсли ТекущийСеанс.ИмяПриложения = "1CV8C" Тогда
				Результат = ТонкийКлиент;
			Иначе
				Результат = НеИспользовать;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции // ТекущийРежимИспользования()


/////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ТекущийСеансРаботы()

	УстановитьПривилегированныйРежим(Истина);
	СеансыИБ    = ПолучитьСеансыИнформационнойБазы();
	НомерСеанса = НомерСеансаИнформационнойБазы();

	Для Каждого Сеанс Из СеансыИБ Цикл
		Если Сеанс.НомерСеанса = НомерСеанса Тогда
			Возврат Сеанс;
		КонецЕсли;
	КонецЦикла;
	
	ВызватьИсключение НСтр("ru = 'Не найден текущий сеанс информационной базы'");
	
КонецФункции // ТекущийСеансИБ()

