
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоответствиеОтборов = Новый Соответствие;
	СоответствиеОтборов.Вставить("НаДату"			,"НаДату");
	СоответствиеОтборов.Вставить("Бюджет"			,"Бюджет");
	СоответствиеОтборов.Вставить("ЦелеваяСтатья"	,"ЦелеваяСтатья");
	
	БюджетнаяКлассификация.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, Отказ, СоответствиеОтборов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список, 
	"ПризнакНацПроекта", 
	"___[" + БюджетнаяКлассификацияКлиентСервер.СтрокаКодовНацПроектов('20241231') + "]_");
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список, 
	"ПризнакНацПроекта2025", 
	"___[" + БюджетнаяКлассификацияКлиентСервер.СтрокаКодовНацПроектов() + "]_");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БюджетОтборПриИзменении(Элемент)
	БюджетнаяКлассификацияКлиентСервер.УстановитьОтборПоБюджету(ЭтаФорма,Бюджет);
КонецПроцедуры

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	БюджетнаяКлассификацияКлиентСервер.УстановитьОтборНаДату(ЭтаФорма,НаДату);
КонецПроцедуры

&НаКлиенте
Процедура ЦелеваяСтатьяОтборПриИзменении(Элемент)
	
	Для Каждого Элемент Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если ТипЗнч(Элемент) = Тип("ОтборКомпоновкиДанных") Тогда
			
			Для Каждого ЭлементОтбора Из Элемент.Элементы Цикл
				
				Если ЭлементОтбора.Использование  
					И ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦелеваяСтатья") Тогда
					
					Элемент.Элементы.Удалить(ЭлементОтбора);
					
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли	
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ЦелеваяСтатья) Тогда
		Отбор = Новый СписокЗначений;
		Отбор.Добавить(ЦелеваяСтатья);
		Отбор.Добавить(ПредопределенноеЗначение("Справочник.ЦелевыеСтатьиКРБ.ПустаяСсылка"));
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"ЦелеваяСтатья",Отбор,ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.Отбор,"ЦелеваяСтатья");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	БюджетнаяКлассификацияКлиентСервер.ПриОбновленииСоставаПользовательскихНастроек(СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
