#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Организация", Организация);
	
	Если НЕ ЗначениеЗаполнено(Организация)
		И Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Организация") Тогда
		Организация = Параметры.Отбор.Организация;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Организация", "ТолькоПросмотр", ЗначениеЗаполнено(Организация));
	
	ЗаполнитьНастройку();
	
	ИдентификаторСтроки = -1;
	Если Параметры.Свойство("ИдентификаторДокумента") Тогда
		УстановитьТекущуюСтроку(Параметры.ИдентификаторДокумента, ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ИдентификаторСтроки <> -1 Тогда
		Элементы.Настройки.Развернуть(ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = НСтр("ru = 'Настройки внутреннего электронного документооборота не сохранены.
				|Завершить работу с программой?'")
		Иначе
			Описание = Новый ОписаниеОповещения("ПередЗакрытиемОкнаФормы", ЭтотОбъект);
			ПоказатьВопрос(Описание, НСтр("ru = 'Настройки внутреннего электронного документооборота изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "РегистрСведений.НастройкиВнутреннегоЭДОБГУ.Форма.КопированиеНастроек" Тогда
		
		ЗаполнитьНастройку(ВыбранноеЗначение);
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьНастройку();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройки

&НаКлиенте
Процедура НастройкиФормироватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанные.Формировать = 1 И ТекущиеДанные.НеИспользуется Тогда 
		ТекущиеДанные.Формировать = 0;
		ПричинаИсключения = ТекущиеДанные.ПричинаНеИспользования;
		ТекстПодсказки = НСтр("ru='Данную печатную форму запрещено использовать в сценариях внутреннего ЭДО.'");
		ПоказатьПредупреждение(Новый ОписаниеОповещения(), ТекстПодсказки + Символы.ПС + ПричинаИсключения);
	КонецЕсли;
	
	Если ТекущиеДанные.Формировать = 2 Тогда
		ТекущиеДанные.Формировать = 0;
	КонецЕсли;
	
	Если ТекущиеДанные.Формировать = 0 Тогда
		ТекущиеДанные.ОсновнаяПечатнаяФорма = Ложь;
		ТекущиеДанные.МаршрутПодписания = ПредопределенноеЗначение("Справочник.МаршрутыПодписанияБГУ.ПустаяСсылка");
	КонецЕсли;
	
	ЗаполнитьОтметкуУРодителя(ТекущиеДанные.ПолучитьРодителя());
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОсновнаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанные.ОсновнаяПечатнаяФорма Тогда
		Идентификатор = ТекущиеДанные.ПолучитьИдентификатор();
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
			Если Строка.ОсновнаяПечатнаяФорма И Строка.ПолучитьИдентификатор() <> Идентификатор Тогда
				Строка.ОсновнаяПечатнаяФорма = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	
	ВыполнитьКомандуЗаписать();
	
	ЗакрыватьПриВыборе = Ложь;
	
	ОповеститьОВыборе(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ВыполнитьКомандуЗаписать();
	
	ЗакрыватьПриВыборе = Истина;
	
	ОповеститьОВыборе(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеНастройки(Команда)
	
	Параметрыформы = Новый Структура;
	
	Если ЕстьНастройкаЭДОБГУ(Организация) Тогда
		СтруктураЗаписи = Новый Структура("Организация", Организация);
		МассивСтруктураЗаписи = Новый Массив;
		МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
		КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.НастройкиЭДОБГУ", МассивСтруктураЗаписи);
		Параметрыформы.Вставить("Ключ", КлючЗаписи);
	Иначе
		Параметрыформы.Вставить("Организация", Организация);
	КонецЕсли;
	
	Параметрыформы.Вставить("ТолькоВнутреннийЭДО", Истина);
	
	ОткрытьФорму("РегистрСведений.НастройкиЭДОБГУ.Форма.ФормаЗаписи", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьОт(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОрганизацияКуда", Организация);
	
	ОткрытьФорму("РегистрСведений.НастройкиВнутреннегоЭДОБГУ.Форма.КопированиеНастроек", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьСоглашенияССотрудниками(Команда)
	
	ТекущиеДанные = Элементы.Настройки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВнутреннийЭДОКлиент.ОткрытьФормуФормированияУведомленияОбИспользованииПЭП(
		Организация, СписокПодписантовМаршрута(ТекущиеДанные.МаршрутПодписания), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПоложениеОбИспользованииПЭП(Команда)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	ВнутреннийЭДОКлиент.ОткрытьФормуФормированияПоложенияОбИспользованииПЭП(Организация, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрКлючейПЭП(Команда)
	
	Параметрыформы = Новый Структура;
	Параметрыформы.Вставить("Отбор", Новый Структура("Организация", Организация));
	
	ОткрытьФорму("РегистрСведений.РеестрКлючейПростыхЭлектронныхПодписей.Форма.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНастройку(АдресНастройки = Неопределено)
	
	Если АдресНастройки = Неопределено Тогда
		ТекущаяНастройка = РегистрыСведений.НастройкиВнутреннегоЭДОБГУ.ТекущаяНастройкаВнутреннегоЭДОБГУ(Организация);
	Иначе
		ТекущаяНастройка = ПолучитьИзВременногоХранилища(АдресНастройки);
	КонецЕсли;
	
	ДеревоНастроек = РеквизитФормыВЗначение("Настройки");
	ДеревоНастроек.Строки.Очистить();
	
	ОбъектыСоСпециальнымиКомандамиПечати = ВнутреннийЭДОПереопределяемый.ОбъектыСоСпециальнымиКомандамиПечати();
	
	ИсточникиКомандПечати = УправлениеПечатью.ИсточникиКомандПечати();
	
	ОтсутствующиеИдентификаторыИКоманды = Новый Массив;
	
	ТаблицаКомандПечатиИсключений = ВнутреннийЭДО.ПодготовитьТаблицуИсключенийКомандПечати();
	ВнутреннийЭДОПереопределяемый.ПриЗаполненииТаблицыИсключенийКомандПечатиЭДО(ТаблицаКомандПечатиИсключений);
	
	Для Каждого Тип Из Метаданные.ОпределяемыеТипы.ОснованиеВнутреннегоЭлектронногоДокумента.Тип.Типы() Цикл
		
		ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип);
		МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
		
		ДокументВНастройке = ТекущаяНастройка[ИдентификаторДокумента];
		
		Если ОбъектыСоСпециальнымиКомандамиПечати[Тип] <> Неопределено Тогда
			КомандыПечати = ОбъектыСоСпециальнымиКомандамиПечати[Тип];
		ИначеЕсли ИсточникиКомандПечати.Найти(МетаданныеОбъекта) = Неопределено Тогда
			Продолжить;
		Иначе
			КомандыПечати = ВнутреннийЭДО.КомандыПечатиОбъекта(МетаданныеОбъекта);
		КонецЕсли;
		
		Если КомандыПечати.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДокумент = ДеревоНастроек.Строки.Добавить();
		СтрокаДокумент.ИдентификаторДокумента = ИдентификаторДокумента;
		СтрокаДокумент.Представление = МетаданныеОбъекта.Синоним;
		
		Для Каждого КомандаПечати Из КомандыПечати Цикл
			
			// для внешних печатных форм добавляем уникальный идентификатор
			Если КомандаПечати.МенеджерПечати = "СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки" Тогда
				КомандаПечати.Идентификатор = КомандаПечати.Идентификатор + КомандаПечати.УникальныйИдентификатор;
			КонецЕсли;
			
			НоваяКоманда = СтрокаДокумент.Строки.Добавить();
			НоваяКоманда.ИдентификаторДокумента = ИдентификаторДокумента;
			НоваяКоманда.ИдентификаторКомандыПечати = КомандаПечати.Идентификатор;
			НоваяКоманда.Представление = КомандаПечати.Представление; 
			
			ЗначениеПустойСсылки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентификаторДокумента,"ЗначениеПустойСсылки");
			СтруктураОтбора = Новый Структура;  
			СтруктураОтбора.Вставить("УчетныйДокумент", ЗначениеПустойСсылки);  
			СтруктураОтбора.Вставить("ИдентификаторКомандыПечати", КомандаПечати.Идентификатор);  
			
			КомандаПечатиИсключение=ТаблицаКомандПечатиИсключений.НайтиСтроки(СтруктураОтбора);
			
			Если КомандаПечатиИсключение.Количество() > 0  Тогда
				НоваяКоманда.НеИспользуется=Истина; 
				НоваяКоманда.ПричинаНеИспользования=КомандаПечатиИсключение[0].ПричинаИсключенияКомандыПечати;			
			КонецЕсли;
			
			Если ДокументВНастройке <> Неопределено И ДокументВНастройке[КомандаПечати.Идентификатор] <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(НоваяКоманда, ДокументВНастройке[КомандаПечати.Идентификатор]);
				Если НоваяКоманда.Формировать = 1 Тогда
					СтрокаДокумент.Формировать = 1;
				КонецЕсли;
				ДокументВНастройке.Удалить(КомандаПечати.Идентификатор);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДокументВНастройке <> Неопределено Тогда
			Для Каждого Команда Из ДокументВНастройке Цикл
				ОтсутствующиеИдентификаторыИКоманды.Добавить(
					Новый Структура("ИдентификаторДокумента, ИдентификаторКомандыПечати",
						ИдентификаторДокумента, Команда.Ключ));
			КонецЦикла;
			ТекущаяНастройка.Удалить(ИдентификаторДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	// Если такого типа документа или команды уже нет, то очищаем регистр
	Для Каждого ДокументВНастройке Из ТекущаяНастройка Цикл
		НаборЗаписей = РегистрыСведений.НастройкиВнутреннегоЭДОБГУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.ИдентификаторДокумента.Установить(ДокументВНастройке.Ключ);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	Для Каждого ИдентификаторИКоманда Из ОтсутствующиеИдентификаторыИКоманды Цикл
		НаборЗаписей = РегистрыСведений.НастройкиВнутреннегоЭДОБГУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Отбор.ИдентификаторДокумента.Установить(ИдентификаторИКоманда.ИдентификаторДокумента);
		НаборЗаписей.Отбор.ИдентификаторКомандыПечати.Установить(ИдентификаторИКоманда.ИдентификаторКомандыПечати);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	ДеревоНастроек.Строки.Сортировать("Представление");
	
	ЗначениеВРеквизитФормы(ДеревоНастроек, "Настройки");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтроку(ИдентификаторДокумента, ИдентификаторСтроки)
	
	Для Каждого Настройка Из Настройки.ПолучитьЭлементы() Цикл
		Если Настройка.ИдентификаторДокумента = ИдентификаторДокумента Тогда
			Элементы.Настройки.ТекущаяСтрока = Настройка.ПолучитьИдентификатор();
			ИдентификаторСтроки = Элементы.Настройки.ТекущаяСтрока;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Настройки.Формировать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиМаршрутПодписания");
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиОсновная");
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Настройки.ИдентификаторКомандыПечати");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиФормировать");
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиМаршрутПодписания");
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиОсновная");
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<указывается при создании документа>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Настройки.ИдентификаторКомандыПечати");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ОтборЭлемента.ПравоеЗначение = "";
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Настройки.Формировать");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Настройки.МаршрутПодписания");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиМаршрутПодписания");
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(Новый Шрифт,,,Истина,,,,));
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Настройки.ОсновнаяПечатнаяФорма");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиПредставление");
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////

	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
    ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле); 
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Настройки.НеИспользуется");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиПредставление");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиМаршрутПодписания");
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("НастройкиОсновная");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтметкуУРодителя(Родитель)
	
	Формировать = Ложь;
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл
		Формировать = Формировать ИЛИ Строка.Формировать;
	КонецЦикла;
	Родитель.Формировать = Формировать;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьКомандуЗаписать()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	НастройкиДляЗаписиВРегистр = РегистрыСведений.НастройкиВнутреннегоЭДОБГУ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	Для Каждого СтрокаДокумент Из Настройки.ПолучитьЭлементы() Цикл
		Для Каждого СтрокаПечать Из СтрокаДокумент.ПолучитьЭлементы() Цикл
			НоваяСтрока = НастройкиДляЗаписиВРегистр.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПечать);
			НоваяСтрока.Организация = Организация;
		КонецЦикла;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиВнутреннегоЭДОБГУ");
		ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.НастройкиВнутреннегоЭДОБГУ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Загрузить(НастройкиДляЗаписиВРегистр);
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИмяСобытия = НСтр("ru = 'Запись настроек внутреннего электронного документооборота БГУ'",
			ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(ИмяСобытия,
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемОкнаФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьКомандуЗаписать();
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНастройкаЭДОБГУ(ОрганизацияДляПоиска)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НастройкиЭДОБГУ.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.НастройкиЭДОБГУ КАК НастройкиЭДОБГУ
	|ГДЕ
	|	НастройкиЭДОБГУ.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ОрганизацияДляПоиска);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокПодписантовМаршрута(Маршрут)
	
	Возврат ВнутреннийЭДО.ПодписантыМаршрутаПодписания(Маршрут);
	
КонецФункции 

#КонецОбласти
