
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);

	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если Параметры.Ключ.Пустая()
		И ЗначениеЗаполнено(Объект.Дата)
		И ЗначениеЗаполнено(Объект.Организация)
		И ЗначениеЗаполнено(Объект.ИФО)
		И ЗначениеЗаполнено(Объект.Контрагент)
		И ЗначениеЗаполнено(Объект.Договор) Тогда
		
		ПараметрыВопроса = ЗаполнитьДокументПараметрыВопроса();
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокОплаты", Истина);
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДокументОбработкаОтвета", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ПараметрыВопроса.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	Если Не (Параметры.Ключ.Пустая()
		ИЛИ ЗначениеЗаполнено(Объект.ПроцентИндексации)
		ИЛИ ЗначениеЗаполнено(Объект.СуммаРаспределенная) ) Тогда
		Элементы.ГруппаКорректировкаСтоимостиОбразовательныхУслуг.Скрыть();
	КонецЕсли;
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса");
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ); 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ИнформационныеСсылки

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ОтразитьВМежотчетномПериоде", ОтразитьВМежотчетномПериоде);
	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ПересчитатьСуммыПриИзмененииВидаОперации();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
		УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
		
	КонецЕсли;
	
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	Иначе
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	КонецЕсли;
	
	ОтразитьВМежотчетномПериодеПриИзмененииНаСервере();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьВМежотчетномПериодеПриИзмененииНаСервере()
	
	// Может измениться дата определения параметров учетной политики.
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Студент) Тогда
		
		Объект.Контрагент = Неопределено;
		Объект.Договор = Неопределено;
		
		Отбор = Новый Структура;
		Отбор.Вставить("НаДату", Объект.Дата);
		
		ПараметрыАвтоподстановки = ПараметрыАвтоподстановкиДанныхПоСтуденту(Объект.Студент, Отбор);
		
		Если ПараметрыАвтоподстановки.Договоры.Количество() = 1 Тогда
			Объект.Договор = ПараметрыАвтоподстановки.Договоры[0];
		КонецЕсли;
		Если ПараметрыАвтоподстановки.Плательщики.Количество() = 1 Тогда
			Объект.Контрагент = ПараметрыАвтоподстановки.Плательщики[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбязательныеПоляДляЗаполненияЗаполнены() Тогда
		
		ПараметрыВопроса = ЗаполнитьДокументПараметрыВопроса();
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокОплаты", Истина);
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДокументОбработкаОтвета", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ПараметрыВопроса.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если ОбязательныеПоляДляЗаполненияЗаполнены() Тогда
		
		ПараметрыВопроса = ЗаполнитьДокументПараметрыВопроса();
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокОплаты", Истина);
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДокументОбработкаОтвета", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ПараметрыВопроса.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	Если ОбязательныеПоляДляЗаполненияЗаполнены() Тогда
		
		ПараметрыВопроса = ЗаполнитьДокументПараметрыВопроса();
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокОплаты", Истина);
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДокументОбработкаОтвета", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ПараметрыВопроса.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение(
			"Перечисление.ВидыОперацийКорректировкиДБП.ДосрочноеПрекрашение") Тогда
		
		Если НЕ Объект.ИзменитьСуммыДоходов Тогда
			Объект.ИзменитьСуммыДоходов = Истина;
		КонецЕсли;
		
		Если Объект.ИзменитьПорядокУчетаДоходов Тогда
		
			// Не имеет смысла менять порядок учета доходов при прекращении договора.
			Объект.ИзменитьПорядокУчетаДоходов = Ложь;
			
			ПараметрыЗаполнения = Новый Структура;
			ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Ложь);
			ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
			ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокОплаты", Истина);
			ЗаполнитьДокументНаСервере(
				ПараметрыЗаполнения.ЗаполнитьСуммыДоходов,
				ПараметрыЗаполнения.ЗаполнитьПорядокУчетаДоходов,
				ПараметрыЗаполнения.ЗаполнитьПорядокОплаты);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПересчитатьСуммыПриИзмененииВидаОперации();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСуммыДоходовПриИзменении(Элемент)
	
	Если НЕ Объект.ИзменитьСуммыДоходов И НЕ Объект.ИзменитьПорядокУчетаДоходов Тогда
		Объект.ИзменитьПорядокУчетаДоходов = Истина;
	КонецЕсли;
	
	ПересчитатьСуммыПриИзмененииВидаОперации();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПорядокУчетаДоходовПриИзменении(Элемент)
	
	Если НЕ Объект.ИзменитьСуммыДоходов И НЕ Объект.ИзменитьПорядокУчетаДоходов Тогда
		Объект.ИзменитьСуммыДоходов = Истина;
	КонецЕсли;
	
	Если НЕ Объект.ИзменитьПорядокУчетаДоходов Тогда
		// Сбролили флаг "Изменить порядок учета доходов" - перезаполним порядок учета доходов.
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Ложь);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Истина);
		ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокОплаты", Ложь);
		ЗаполнитьДокументНаСервере(
			ПараметрыЗаполнения.ЗаполнитьСуммыДоходов,
			ПараметрыЗаполнения.ЗаполнитьПорядокУчетаДоходов,
			ПараметрыЗаполнения.ЗаполнитьПорядокОплаты);
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьПорядокОплатыПриИзменении(Элемент)
	
	ПересчитатьСуммыПриИзмененииВидаОперации();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПризнанияДоходовПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтотОбъект, Объект, "СчетДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовНУПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСуммыНаПроцентПриИзменении(Элемент)
	
	Если ИзменитьСуммыНаПроцент Тогда
		Если РаспределитьСуммуПоПериодам Тогда
			РаспределитьСуммуПоПериодам = Ложь;
			Объект.СуммаРаспределенная = 0;
			ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
		КонецЕсли;
	Иначе
		Объект.ПроцентИндексации = 0;
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентИндексацииПриИзменении(Элемент)
	
	ИзменитьСуммыНаПроцент = ЗначениеЗаполнено(Объект.ПроцентИндексации);
	
	ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммуПриИзменении(Элемент)
	
	Если РаспределитьСуммуПоПериодам Тогда
		Если ИзменитьСуммыНаПроцент Тогда
			ИзменитьСуммыНаПроцент = Ложь;
			Объект.ПроцентИндексации = 0;
			ПересчитатьСуммыПриИзмененииПроцентаИндексации();
		КонецЕсли;
	Иначе
		Объект.СуммаРаспределенная = 0;
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРаспределеннаяПриИзменении(Элемент)
	
	РаспределитьСуммуПоПериодам = ЗначениеЗаполнено(Объект.СуммаРаспределенная);
	
	ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПериодуОбученияПриИзменении(Элемент)
	
	Если ВидОтбораПоПериодуОбучения = 0 Тогда // За незавершенные периоды обучения.
		Объект.НачалоПериодаОбучения = Неопределено;
		Объект.КонецПериодаОбучения = Неопределено;
	КонецЕсли;
	
	Если ИзменитьСуммыНаПроцент Тогда
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	Если РаспределитьСуммуПоПериодам Тогда
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаОбученияПриИзменении(Элемент)
	
	Если ИзменитьСуммыНаПроцент Тогда
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	Если РаспределитьСуммуПоПериодам Тогда
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаОбученияПриИзменении(Элемент)
	
	Если ИзменитьСуммыНаПроцент Тогда
		ПересчитатьСуммыПриИзмененииПроцентаИндексации();
	КонецЕсли;
	Если РаспределитьСуммуПоПериодам Тогда
		ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДоходыБудущихПериодов

&НаКлиенте
Процедура ДоходыБудущихПериодовПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	Отказ = (ТекущаяСтрока.ОстатокДБП <> 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
		
		Если Копирование Тогда
			ТекущиеДанные.ОстатокДБП = 0;
		КонецЕсли;
		
		ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовСчетДБППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		ТекущиеДанные, ТекущиеДанные.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовКЭКПриИзменении(Элемент)
	
	ДоходыБудущихПериодовКЭКПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоходыБудущихПериодовКЭКПриИзмененииНаСервере()
	
	ДанныеСтроки = Объект.ДоходыБудущихПериодов.НайтиПоИдентификатору(Элементы.ДоходыБудущихПериодов.ТекущаяСтрока);
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(ДанныеСтроки,
		ДанныеСтроки.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовСчетРасчетовПриИзменении(Элемент)
	
	ДоходыБудущихПериодовСчетРасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоходыБудущихПериодовСчетРасчетовПриИзмененииНаСервере()
	
	ДанныеСтроки = Объект.ДоходыБудущихПериодов.НайтиПоИдентификатору(Элементы.ДоходыБудущихПериодов.ТекущаяСтрока);
	
	ДанныеСтроки.ДопСубконтоРасчетов = Неопределено;
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(ДанныеСтроки,
		ДанныеСтроки.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовДопСубконтоРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДопСубконтоРасчетовВид) Тогда
		ПараметрыВыбораДопСубконто = Новый Структура;
		ПараметрыВыбораДопСубконто.Вставить("Организация",   Объект.Организация);
		ПараметрыВыбораДопСубконто.Вставить("Счет",          ТекущиеДанные.СчетРасчетов);
		ПараметрыВыбораДопСубконто.Вставить("НомерСубконто", ТекущиеДанные.ДопСубконтоРасчетовНомер);
		ПараметрыВыбораДопСубконто.Вставить("Субконто" + ТекущиеДанные.ДопСубконтоРасчетовНомер, ТекущиеДанные.ДопСубконтоРасчетов);
		БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, ПараметрыВыбораДопСубконто);
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодовВсегоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходыБудущихПериодов.ТекущиеДанные;
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки()
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	
	Для Каждого СтрокаТаблицы Из Объект.ДоходыБудущихПериодов Цикл
		
		УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(СтрокаТаблицы,
			СтрокаТаблицы.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО, Истина);
		
		ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, СтрокаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДоходыБудущихПериодовПоляАналитикиСчетаДБП()

	// Пути к данным полей аналитики счета, выбираемого в таблице формы.
	Возврат Новый Структура("Счет, КПС, КЭК, Подразделение",
		"Объект.ДоходыБудущихПериодов.СчетДБП",
		"Объект.ДоходыБудущихПериодов.КПС",
		"Объект.ДоходыБудущихПериодов.КЭК",
		"Объект.ДоходыБудущихПериодов.Подразделение");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(Форма, СтрокаТаблицы)
	
	НастройкиСчетовУчетаДБП = Форма.КэшПараметров.Локальные.НастройкиСчетовУчетаДБП;
	Если ТипЗнч(НастройкиСчетовУчетаДБП) = Тип("Соответствие")
		И НастройкиСчетовУчетаДБП[СтрокаТаблицы.СчетДБП] <> Неопределено Тогда
		СтрокаТаблицы.СчетДБПВалютный = НастройкиСчетовУчетаДБП[СтрокаТаблицы.СчетДБП].Валютный;
	Иначе
		СтрокаТаблицы.СчетДБПВалютный = Ложь;
	КонецЕсли;
	СтрокаТаблицы.ВалютаРеглУчета = Форма.КэшПараметров.ВалютаРегламентированногоУчета;
	
	Если Форма.КэшПараметров.ИспользоватьВалютныйУчет
	И СтрокаТаблицы.СчетДБПВалютный
	И ЗначениеЗаполнено(СтрокаТаблицы.Валюта)
	И СтрокаТаблицы.Валюта <> СтрокаТаблицы.ВалютаРеглУчета Тогда
		СтрокаТаблицы.ПослеИзмененияВсего = СтрокаТаблицы.ОстатокДБПВВалюте + СтрокаТаблицы.Всего;
	Иначе // В рублях.
		СтрокаТаблицы.ПослеИзмененияВсего = СтрокаТаблицы.ОстатокДБП + СтрокаТаблицы.Всего;
	КонецЕсли;
	
	// Поля СуммаРуб и ВсегоРуб отображаются информационно, рассчитываются по курсу, определяемому по остатку 401.4х.
	КурсПересчета = ?(СтрокаТаблицы.ОстатокДБПВВалюте = 0, 1, СтрокаТаблицы.ОстатокДБП / СтрокаТаблицы.ОстатокДБПВВалюте);
	СтрокаТаблицы.ВсегоРуб = СтрокаТаблицы.Всего * КурсПересчета;
	СтрокаТаблицы.ПослеИзмененияВсегоРуб = СтрокаТаблицы.ПослеИзмененияВсего * КурсПересчета;
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		СтрокаТаблицы, СтрокаТаблицы.СчетДБП, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПорядокОплаты

&НаКлиенте
Процедура ПорядокОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		
		ТекущаяСтрока = Элементы.ПорядокОплаты.ТекущиеДанные;
		ТекущаяСтрока.СуммаВВалютеДоИзменений = 0;
		ТекущаяСтрока.СуммаВВалюте = ТекущаяСтрока.СуммаВВалютеПослеИзменений;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.ПорядокОплаты.ТекущиеДанные;
	Отказ = (ТекущаяСтрока.СуммаВВалютеДоИзменений <> 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыСуммаВВалютеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалютеПослеИзменений = ТекущиеДанные.СуммаВВалютеДоИзменений + ТекущиеДанные.СуммаВВалюте;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыСуммаВВалютеПослеИзмененийПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	ТекущиеДанные.СуммаВВалюте = ТекущиеДанные.СуммаВВалютеПослеИзменений - ТекущиеДанные.СуммаВВалютеДоИзменений;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыКонецПериодаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ТекущиеДанные, Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ПорядокОплатыЗаполнитьДобавленныеКолонки()
	
	Для Каждого СтрокаТаблицы Из Объект.ПорядокОплаты Цикл
		
		ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(СтрокаТаблицы, Объект.Дата);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(СтрокаТаблицы, ДатаДокумента)
	
	СтрокаТаблицы.ПериодЗавершен = ( КонецДня(СтрокаТаблицы.КонецПериода) <= КонецДня(ДатаДокумента) );
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	СообщатьОбОшибках = Истина;
	Если Не ОбязательныеПоляДляЗаполненияЗаполнены(СообщатьОбОшибках) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗаполнитьСуммыДоходов", Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокУчетаДоходов", Ложь);
	ПараметрыЗаполнения.Вставить("ЗаполнитьПорядокОплаты", Истина);
	
	ПараметрыВопроса = ЗаполнитьДокументПараметрыВопроса();
	Если ЗначениеЗаполнено(ПараметрыВопроса.ЗадатьВопрос) Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДокументОбработкаОтвета", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ПараметрыВопроса.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДокументНаСервере(
			ПараметрыЗаполнения.ЗаполнитьСуммыДоходов,
			ПараметрыЗаполнения.ЗаполнитьПорядокУчетаДоходов,
			ПараметрыЗаполнения.ЗаполнитьПорядокОплаты);
		ПересчитатьСуммыПриИзмененииВидаОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериодуОбучения(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Объект.НачалоПериодаОбучения;
	Диалог.Период.ДатаОкончания = Объект.КонецПериодаОбучения;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьОтборПоПериодуОбученияЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериодуОбученияЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		
		Объект.НачалоПериодаОбучения = Период.ДатаНачала;
		Объект.КонецПериодаОбучения  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
		Если ИзменитьСуммыНаПроцент Тогда
			ПересчитатьСуммыПриИзмененииПроцентаИндексации();
		КонецЕсли;
		Если РаспределитьСуммуПоПериодам Тогда
			ПересчитатьСуммыПриИзмененииСуммыРаспределенная();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом  

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("НастройкиСчетовУчетаДБП",
		УчетДоходовРасходов.НастройкиСчетовУчетаДБП());
	
	// Увеличение (уменьшение) стоимости образовательных услуг.
	ИзменитьСуммыНаПроцент = ЗначениеЗаполнено(Объект.ПроцентИндексации);
	РаспределитьСуммуПоПериодам = ЗначениеЗаполнено(Объект.СуммаРаспределенная);
	ВидОтбораПоПериодуОбучения = ЗначениеЗаполнено(Объект.НачалоПериодаОбучения) ИЛИ ЗначениеЗаполнено(Объект.КонецПериодаОбучения);
	
	Элементы.СпособПризнанияДоходов.ПараметрыВыбора =
		Перечисления.СпособыПризнанияРасходов.ПараметрыВыбораСпособаПризнанияДоходов(Перечисления.ВидыОперацийНачисленияДБП.ДолгосрочныйДоговорОбразование);
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтотОбъект, Объект, "СчетДоходов");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоДосрочноеПрекрашение = (Объект.ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийКорректировкиДБП.ДосрочноеПрекрашение"));
	ЭтоКорректировка = (Объект.ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийКорректировкиДБП.КорректировкаДоходовБудущихПериодов"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ИзменитьСуммыДоходов", "Доступность", ЭтоКорректировка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ИзменитьПорядокУчетаДоходов", "Видимость", ЭтоКорректировка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СкорректироватьПорядокОплаты", "Видимость", ЭтоДосрочноеПрекрашение);
	
	// Увеличение (уменьшение) стоимости образовательных услуг.
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПроцентИндексации", "Доступность", Форма.ИзменитьСуммыНаПроцент);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СуммаРаспределенная", "Доступность", Форма.РаспределитьСуммуПоПериодам);
	
	ЭлементыОтборПоПериодуОбучения = Новый Массив;
	ЭлементыОтборПоПериодуОбучения.Добавить("НачалоПериодаОбучения");
	ЭлементыОтборПоПериодуОбучения.Добавить("КонецПериодаОбучения");
	ЭлементыОтборПоПериодуОбучения.Добавить("УстановитьОтборПоПериодуОбучения");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыОтборПоПериодуОбучения, "Доступность", Форма.ВидОтбораПоПериодуОбучения <> 0);
	
	// Закладка "Доходы будущих периодов".
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДоходыБудущихПериодов", "ИзменятьСоставСтрок", ЭтоКорректировка И Объект.ИзменитьСуммыДоходов);
	КорректировкаСуммДоходов = Новый Массив;
	КорректировкаСуммДоходов.Добавить("ДоходыБудущихПериодовИзменитьСуммы");
	КорректировкаСуммДоходов.Добавить("ДоходыБудущихПериодовДобавить");
	КорректировкаСуммДоходов.Добавить("ДоходыБудущихПериодовПереместитьВверх");
	КорректировкаСуммДоходов.Добавить("ДоходыБудущихПериодовПереместитьВниз");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		КорректировкаСуммДоходов, "Доступность", Объект.ИзменитьСуммыДоходов);
	
	// Закладка "Порядок учета доходов".
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтраницаПорядокУчетаДоходов", "Видимость", ЭтоКорректировка);
	КорректировкаПорядкаУчетаДоходов = Новый Массив;
	КорректировкаПорядкаУчетаДоходов.Добавить("ГруппаПараметрыСписания");
	КорректировкаПорядкаУчетаДоходов.Добавить("ГруппаОтражениеВДоходахТекущегоПериода");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		КорректировкаПорядкаУчетаДоходов, "Доступность", ЭтоКорректировка И Объект.ИзменитьПорядокУчетаДоходов);

	ОсобыйПорядокПризнанияДоходовТекущегоПериода =
		(Объект.СпособПризнанияДоходов = ПредопределенноеЗначение("Перечисление.СпособыПризнанияРасходов.ВОсобомПорядке"));
	ПризнаниеДоходовТекущегоПериодаПоГрафику =
		(Объект.СпособПризнанияДоходов = ПредопределенноеЗначение("Перечисление.СпособыПризнанияРасходов.ПоГрафику"));
	
	СрокСписания = Новый Массив;
	СрокСписания.Добавить("ДатаНачалаСписания");
	СрокСписания.Добавить("ДатаОкончанияСписания");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		СрокСписания, "Видимость", НЕ ПризнаниеДоходовТекущегоПериодаПоГрафику);
	
	Если ОсобыйПорядокПризнанияДоходовТекущегоПериода Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "ОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "ОтметкаНезаполненного", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "ОтметкаНезаполненного", Не ЗначениеЗаполнено(Объект.ДатаНачалаСписания));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "ОтметкаНезаполненного", Не ЗначениеЗаполнено(Объект.ДатаОкончанияСписания));
	КонецЕсли;
	
	Если ПризнаниеДоходовТекущегоПериодаПоГрафику Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'Доходы будущих периодов относятся на финансовый результат текущего периода согласно графику, установленному на закладке ""Порядок оплаты"".'"));
	ИначеЕсли ОсобыйПорядокПризнанияДоходовТекущегоПериода Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'Суммы списания доходов будущих периодов указывается вручную в документе начисления доходов текущего периода.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'В течение указанного срока доходы будущих периодов относятся на финансовый результат текущего периода.'"));
	КонецЕсли;
	
	// Закладка "Порядок оплаты".
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПорядокОплаты", "Видимость", НЕ ЭтоДосрочноеПрекрашение Или Объект.СкорректироватьПорядокОплаты);
	
	// Закладка "Бухгалтерская операция".
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"БухгалтерскаяОперация", "Видимость", Объект.ИзменитьСуммыДоходов);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовНалоговогоУчета(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОтражатьВНалоговомУчете = Форма.КэшПараметров.УчетнаяПолитика.ПлательщикНалогаНаПрибыль;
	ОтражатьВНалоговомУчетеУСН = (Форма.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходы
		ИЛИ Форма.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНалоговыйУчет", "Видимость", ОтражатьВНалоговомУчете ИЛИ ОтражатьВНалоговомУчетеУСН);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаБухгалтерскийУчет", "ОтображатьЗаголовок", ОтражатьВНалоговомУчете ИЛИ ОтражатьВНалоговомУчетеУСН);
	
	ЭтоПрочиеДоходы = БухгалтерскийУчетКлиентСервер.СчетВИерархии(Объект.СчетДоходовНУ, "Н91.01");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтатьяПрочихДоходовНУ", "Видимость", ЗначениеЗаполнено(Объект.СчетДоходовНУ) И ЭтоПрочиеДоходы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Объект, ИмяРеквизитаСчет)
	Перем МассивПолей;
	
	Если ИмяРеквизитаСчет = "СчетДоходов" Тогда
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто1", "СубконтоДоходов1", "СубконтоДоходов1", Истина, "СубконтоДоходов1", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто2", "СубконтоДоходов2", "СубконтоДоходов2", Истина, "СубконтоДоходов2", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто3", "СубконтоДоходов3", "СубконтоДоходов3", Истина, "СубконтоДоходов3", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Объект.СчетДоходов, Форма, Объект, МассивПолей);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Доходы будущих периодов в валюте.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовОстатокДБПВВалюте");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовВалюта");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовВалютаРеглУчета");
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ЭлементУО.Отбор,, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Объект.ДоходыБудущихПериодов.СчетДБПВалютный", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Объект.ДоходыБудущихПериодов.Валюта", ВидСравненияКомпоновкиДанных.Равно, ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ,
		"Объект.ДоходыБудущихПериодов.Валюта", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Счета учета доступны для редактирования только в строках, введенных вручную.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовКПС");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовКФО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовСчетДБП");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовКЭК");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовПодразделение");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДоходыБудущихПериодовНоменклатура");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ДоходыБудущихПериодов.ОстатокДБП", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Реквизиты порядка оплаты доступны для редактирования только в строках, введенных вручную.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыФакультет");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыОплатитьДо");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыСуммаВВалютеДоИзменений");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыСуммаВВалютеПослеИзменений");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыВалюта");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыНачалоПериода");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПорядокОплатыКонецПериода");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ПорядокОплаты.СуммаВВалютеДоИзменений", ВидСравненияКомпоновкиДанных.НеРавно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	БухгалтерскийУчет.УстановитьУсловноеОформлениеПолейАналитикиСчета(
		УсловноеОформление, ДоходыБудущихПериодовПоляАналитикиСчетаДБП());
	УчетРасчетов.УстановитьУсловноеОформлениеСчетаИДопСубконтоРасчетов(
		УсловноеОформление, "ДоходыБудущихПериодов");
	
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеПоляДляЗаполненияЗаполнены(СообщатьОбОшибках = Ложь)
	
	Результат = Истина;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Организация'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Организация");
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Студент) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Учащийся'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Студент");
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Контрагент'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Контрагент");
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Если СообщатьОбОшибках Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле", "Заполнение", НСтр("ru = 'Договор'"));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Договор");
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ЗаполнитьДокументПараметрыВопроса()
	
	ПараметрыВопроса = Новый Структура;
	ПараметрыВопроса.Вставить("ЗадатьВопрос", Ложь);
	ПараметрыВопроса.Вставить("ТекстВопроса",
		НСтр("ru = 'Заполнить документ по остаткам на счетах бухгалтерского учета?'") );
	
	ЕстьДанныеВДокументе = (Объект.ДоходыБудущихПериодов.Количество() > 0);
	Если Объект.Проведен И ЕстьДанныеВДокументе Тогда
		ПараметрыВопроса.ТекстВопроса = ПараметрыВопроса.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Проведение документа будет отменено, а данные будут очищены.'");
		ПараметрыВопроса.ЗадатьВопрос = Истина;
	ИначеЕсли Объект.Проведен Тогда
		ПараметрыВопроса.ТекстВопроса = ПараметрыВопроса.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Проведение документа будет отменено.'");
		ПараметрыВопроса.ЗадатьВопрос = Истина;
	ИначеЕсли ЕстьДанныеВДокументе Тогда
		ПараметрыВопроса.ТекстВопроса = ПараметрыВопроса.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Данные документа будут очищены.'");
		ПараметрыВопроса.ЗадатьВопрос = Истина;
	КонецЕсли;
	
	Возврат ПараметрыВопроса;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДокументОбработкаОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументНаСервере(
			ДополнительныеПараметры.ЗаполнитьСуммыДоходов,
			ДополнительныеПараметры.ЗаполнитьПорядокУчетаДоходов,
			ДополнительныеПараметры.ЗаполнитьПорядокОплаты);
		ПересчитатьСуммыПриИзмененииВидаОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере(ЗаполнитьСуммыДоходов = Истина, ЗаполнитьПорядокУчетаДоходов = Истина, ЗаполнитьПорядокОплаты = Истина)
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьДокумент(ЗаполнитьСуммыДоходов, ЗаполнитьПорядокУчетаДоходов, ЗаполнитьПорядокОплаты);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	ПорядокОплатыЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммыПриИзмененииВидаОперации()
	
	ЭтоДосрочноеПрекрашение = (Объект.ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийКорректировкиДБП.ДосрочноеПрекрашение"));
	
	Для Каждого СтрокаТаблицы Из Объект.ПорядокОплаты Цикл
		
		Если ЭтоДосрочноеПрекрашение Тогда
			
			Если НЕ Объект.СкорректироватьПорядокОплаты Тогда
				СтрокаТаблицы.СуммаВВалюте = 0;
				СтрокаТаблицы.СуммаВВалютеПослеИзменений = СтрокаТаблицы.СуммаВВалютеДоИзменений;
			ИначеЕсли НЕ СтрокаТаблицы.ПериодЗавершен Тогда // Отменяем оплаты по графику за незавершенные периоды обучения.
				СтрокаТаблицы.СуммаВВалюте = (-1) * СтрокаТаблицы.СуммаВВалютеДоИзменений;
				СтрокаТаблицы.СуммаВВалютеПослеИзменений = 0;
			Иначе // Завершенные периоды обучения не меняем.
				СтрокаТаблицы.СуммаВВалюте = 0;
				СтрокаТаблицы.СуммаВВалютеПослеИзменений = СтрокаТаблицы.СуммаВВалютеДоИзменений;
			КонецЕсли;
			
		Иначе // КорректировкаДоходовБудущихПериодов
			
			СтрокаТаблицы.СуммаВВалюте = 0;
			СтрокаТаблицы.СуммаВВалютеПослеИзменений = СтрокаТаблицы.СуммаВВалютеДоИзменений;
			
		КонецЕсли;
		
		ПорядокОплатыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(СтрокаТаблицы, Объект.Дата);
		
	КонецЦикла;
	
	Если Объект.ДоходыБудущихПериодов.Количество() > 0 Тогда
		
		Если ЭтоДосрочноеПрекрашение И НЕ Объект.СкорректироватьПорядокОплаты Тогда
			// Таб.часть ПорядокОплаты не используется, рассчитываем на базе остатков доходов будущих периодов.
			Для Каждого СтрокаДоходовБудущихПериодов Из Объект.ДоходыБудущихПериодов Цикл
				Если ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет
				И СтрокаДоходовБудущихПериодов.СчетДБПВалютный
				И ЗначениеЗаполнено(СтрокаДоходовБудущихПериодов.Валюта)
				И СтрокаДоходовБудущихПериодов.Валюта <> СтрокаДоходовБудущихПериодов.ВалютаРеглУчета Тогда
					СтрокаДоходовБудущихПериодов.Всего = (-1) * СтрокаДоходовБудущихПериодов.ОстатокДБПВВалюте;
				Иначе // В рублях.
					СтрокаДоходовБудущихПериодов.Всего = (-1) * СтрокаДоходовБудущихПериодов.ОстатокДБП;
				КонецЕсли;
				ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, СтрокаДоходовБудущихПериодов);
			КонецЦикла;
		Иначе
			// Итоговые суммы по таб.части ДоходыБудущихПериодов и ПорядокОплаты должны совпадать.
			// По умолчанию фиксируем изменение в первой строке, при необходимости можно изменить вручную.
			СтрокаДоходовБудущихПериодов = Объект.ДоходыБудущихПериодов[0];
			СтрокаДоходовБудущихПериодов.Всего = Объект.ПорядокОплаты.Итог("СуммаВВалюте");
			ДоходыБудущихПериодовЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, СтрокаДоходовБудущихПериодов);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыПриИзмененииПроцентаИндексации()
	
	Документы.КорректировкаДоходовБудущихПериодовОбразование.ИзменитьСуммыНаПроцент(Объект);
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммыПриИзмененииСуммыРаспределенная()
	
	Документы.КорректировкаДоходовБудущихПериодовОбразование.РаспределитьСуммуПоПериодам(Объект);
	
	ДоходыБудущихПериодовЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыАвтоподстановкиДанныхПоСтуденту(Студент, Отбор)
	
	Возврат РаботаСоСтудентами.ПараметрыАвтоподстановкиДанныхПоСтуденту(Студент, "", Отбор);
	
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
