#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоЗаполнениеНаОснованииПоступленияНФАПоЦС(ДанныеЗаполнения) Тогда
		Документы.ИзвещениеВходящее.ЗаполнитьНаОснованииПоступленияНФАПоЦС(ЭтотОбъект, ДанныеЗаполнения);
		ВидИзвещения = Перечисления.ВидыОперацийВходящееИзвещение.ПолучениеНФА;
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНФАпоЦС") Тогда
			ДокументОснование = ДанныеЗаполнения;
		Иначе
			ДокументыОснования.Очистить();
			Для Каждого Документ Из ДанныеЗаполнения Цикл
				ДокументыОснования.Добавить().ДокументОснование = Документ;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИзвещениеИсходящее") Тогда
		Документы.ИзвещениеВходящее.ЗаполнитьНаОснованииИсходящегоИзвещения(ЭтотОбъект, ДанныеЗаполнения, Истина);
		ВидИзвещения = Перечисления.ВидыОперацийВходящееИзвещение.ПодтверждениеПолученияНФА;
		ДокументОснование = ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив;
	Если ВидИзвещения <> Перечисления.ВидыОперацийВходящееИзвещение.ПодтверждениеПолученияНФА Тогда
		НепроверяемыеРеквизиты.Добавить("ДокументОснование");
	Иначе
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "Дата") > Дата Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр(
					"ru = 'Дата подтверждения получения НФА не может быть меньше даты извещения'"), , "Дата", "Объект",
					Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = ПередаваемыеПроводки.Итог("Сумма");
	
	Если СуммаДокумента = 0 Тогда
		СуммаДокумента = ОсновныеСредства.Итог("Сумма") + Материалы.Итог("Сумма") + ВозвратнаяТара.Итог("Сумма");
	КонецЕсли;

	Если СуммаДокумента = 0 Тогда
		Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
			ДанныеЭДИзвещения = ЭлектронныеДокументыБГУ.СведенияЭДИзвещенияПоДокументу(ЭтотОбъект.Ссылка);
			Если ЗначениеЗаполнено(ДанныеЭДИзвещения) Тогда
				ТаблицаПроводок = ДанныеЭДИзвещения.ТаблицаПроводок;
				СуммаДокумента = ТаблицаПроводок.Итог("пСуммаОтправитель");
				Если СуммаДокумента = 0 Тогда
					СуммаДокумента = ТаблицаПроводок.Итог("пСуммаПолучатель");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Это заполнение на основании поступления НФАПо ЦС.
// 
// Параметры:
//  ДанныеЗаполнения - Произвольный, Массив из ДокументСсылка - Данные заполнения
// 
// Возвращаемое значение:
//  Булево - Это заполнение на основании поступления НФАПо ЦС
Функция ЭтоЗаполнениеНаОснованииПоступленияНФАПоЦС(ДанныеЗаполнения)
	Возврат ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеНФАпоЦС")
		Или (ТипЗнч(ДанныеЗаполнения) = Тип("Массив")
			И ДанныеЗаполнения.Количество() > 0
			И ТипЗнч(ДанныеЗаполнения[0]) = Тип("ДокументСсылка.ПоступлениеНФАпоЦС"));
КонецФункции

#КонецОбласти

#КонецЕсли
