#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляЗапускаИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьОперацииИзМакетаПоставщика", Истина);
	Методы.Вставить("ЗагрузитьЭлементыВФоне", Истина);
	Методы.Вставить("ОбновлениеТиповыхОпераций");
	Методы.Вставить("УстановитьПометкуУдаленияСнятымСПоддержки");
КонецПроцедуры

#КонецОбласти

Процедура ЗагрузитьЭлементы(МассивМакетов = Неопределено, ВыводитьПрогресс = Ложь) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Обработка = Обработки.ИмпортЭкспортТиповыхОперацийВФормате20.Создать();
	
	Обработка.УстановитьРежимЗагрузкиПользовательскихОпераций(Ложь);
	
	Если МассивМакетов = Неопределено Тогда
		МассивМакетов = Новый Массив;
		
		Для каждого ИмяМакета Из Метаданные.Обработки.ИмпортЭкспортТиповыхОпераций.Макеты Цикл
			
			МассивМакетов.Добавить(ИмяМакета.Имя);
			
		КонецЦикла;
	КонецЕсли;
	
	КоличествоМакетов = МассивМакетов.Количество();
	НомерМакета = 0;
	Для каждого ИмяМакета Из МассивМакетов Цикл
		
		ТекстМакета = Обработки.ИмпортЭкспортТиповыхОпераций.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
		
		Обработка.ВыполнитьЗагрузкуДанных(ТекстМакета);
		НомерМакета = НомерМакета + 1;
		Если ВыводитьПрогресс Тогда
		
			ДлительныеОперации.СообщитьПрогресс(Цел(НомерМакета / КоличествоМакетов * 100));
		
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПризнакИспользованияНесколькихПоставщиковОпераций();
	
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьЭлементыВФоне(Параметры, АдресРезультата) Экспорт

	ЗагрузитьЭлементы(,Истина);

КонецПроцедуры

Процедура ЗагрузитьОперацииИзМакетаПоставщика(Параметры, АдресРезультата) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// В модели сервиса удалим задание обновления типовых операций из очереди заданий во всех областях
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		БухгалтерскиеОперацииСервер.ОстановитьФоновоеОбновлениеТиповыхОперацийВОбластиДанных();
		
	КонецЕсли;
	
	// Инициализация обработки
	
	Обработка = Обработки.ИмпортЭкспортТиповыхОперацийВФормате20.Создать();
	Обработка.УстановитьРежимЗагрузкиПользовательскихОпераций(Ложь);
	
	// Загрузка поставляемых типовых операций
	
	ТекстМакета = Параметры.ТекстМакета;
	ЗагружаемыеОперации = Параметры.ЗагружаемыеОперации;
	Обработка.ВыполнитьЗагрузкуДанных(ТекстМакета);
	
	УстановитьПризнакИспользованияНесколькихПоставщиковОпераций();
	
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		
		// В локальном режиме сразу запускается обновление типовых операций.
		
		Справочники.ТиповыеОперации.ОбновлениеТиповыхОпераций();
		
	Иначе
		
		// В модели сервиса обновление типовых операций выполняется регламентным заданием.
		
		БухгалтерскиеОперацииСервер.НачатьФоновоеОбновлениеТиповыхОперацийВОбластяхДанных(Истина);
		
	КонецЕсли;

КонецПроцедуры

Функция СформироватьСхемыДляТиповойОперации(ТиповаяОперация) Экспорт
	
	ДанныеТиповойОперации = ДанныеТиповойОперации(ТиповаяОперация);
	ПараметрыТиповойОперации = Новый Структура("ТиповаяОперация", ТиповаяОперация);
	ПараметрыТиповойОперации.Вставить("Проводки", ДанныеТиповойОперации[0].Выгрузить());
	ПараметрыТиповойОперации.Вставить("ДополнительныеРеквизиты", ДанныеТиповойОперации[1].Выгрузить());
	ПараметрыТиповойОперации.Вставить("ДанныеОперации", ДанныеТиповойОперации[2].Выгрузить()[0]);
	ПараметрыТиповойОперации.Вставить("ДополнительныеИсточникиДанных", ДанныеТиповойОперации[3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Если ОбщегоНазначения.СсылкаСуществует(ПараметрыТиповойОперации.ДанныеОперации.ИдентификаторДокумента) Тогда
		Если ПараметрыТиповойОперации.ДанныеОперации.ИспользуетсяВнешняяПроцедура Тогда
			СхемаКомпоновки = Новый СхемаКомпоновкиДанных;
		Иначе
			СхемаКомпоновки = БухгалтерскиеОперацииСервер.СформироватьСхемуФормированияПроводок(ПараметрыТиповойОперации);
			
			Запрос = СхемаКомпоновки.НаборыДанных.НастройкаПроводок;
			Запрос.Запрос = ТекстЗапросаНастройкиПроводок();
		КонецЕсли;
		СхемаУсловие = БухгалтерскиеОперацииСервер.СформироватьСхемуУсловияТиповойОперации(ПараметрыТиповойОперации);
 	Иначе
		СхемаКомпоновки	= Новый СхемаКомпоновкиДанных;
		СхемаУсловие 	= Новый СхемаКомпоновкиДанных;
	КонецЕсли;
	
	Возврат Новый Структура("СхемаФормированияПроводок, СхемаПроверкиУсловия", СхемаКомпоновки, СхемаУсловие);
	
КонецФункции

Функция ПолучитьДанныеТиповойОперации(ТиповаяОперация, ВключатьОтключенныеПроводки = Ложь) Экспорт
	
	ДанныеТиповойОперации = ДанныеТиповойОперации(ТиповаяОперация, Ложь, ВключатьОтключенныеПроводки);
	
	Результат = Новый Структура;
	Результат.Вставить("Проводки", 					ДанныеТиповойОперации[0].Выгрузить());
	Результат.Вставить("ДополнительныеРеквизиты", 	ДанныеТиповойОперации[1].Выгрузить());
	Результат.Вставить("ДанныеОперации", 			ДанныеТиповойОперации[2].Выгрузить()[0]);
	
	Возврат Результат;
	
КонецФункции

Функция СохраненныеДанныеТиповойОперации(ТиповаяОперация) Экспорт
	
	Возврат БухгалтерскиеОперацииПовтИспНаВремяСеанса.СохраненныеДанныеПоставляемойТиповойОперации(ТиповаяОперация);
	
КонецФункции

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив();
	
	Результат.Добавить("ИмяПредопределеннойОперации");
	Результат.Добавить("ИдентификаторПоддержкиСтрокой");
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПометкуУдаленияПодчиненнымЭлементам(ПоставляемаяТиповаяОперация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставляемыеПроводкиТиповыхОпераций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПоставляемыеПроводкиТиповыхОпераций КАК ПоставляемыеПроводкиТиповыхОпераций
	|ГДЕ
	|	ПоставляемыеПроводкиТиповыхОпераций.Владелец = &ПоставляемаяТиповаяОперация
	|	И ПоставляемыеПроводкиТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций
	|ГДЕ
	|	ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = &ПоставляемаяТиповаяОперация
	|	И ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоставляемыеРеквизитыТиповыхОпераций.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
	|ГДЕ
	|	ПоставляемыеРеквизитыТиповыхОпераций.Владелец = &ПоставляемаяТиповаяОперация
	|	И ПоставляемыеРеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ПоставляемаяТиповаяОперация", ПоставляемаяТиповаяОперация);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Для Индекс = 0 По РезультатЗапроса.ВГраница() Цикл
	
		Выборка = РезультатЗапроса[Индекс].Выбрать();
		Пока Выборка.Следующий() Цикл
		
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.УстановитьПометкуУдаления(Истина);
		
		КонецЦикла;
	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПризнакИспользованияНесколькихПоставщиковОпераций()

	// Исключаем из запроса пустых поставщиков. Они могут остаться в снятых с поддержки
	// поставляемых типовых операциях и не должны влиять на результат.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
	|	ПоставляемыеТиповыеОперации.Поставщик КАК Поставщик
	|ИЗ
	|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|ГДЕ
	|	ПоставляемыеТиповыеОперации.Поставщик <> """"";
	Выборка = Запрос.Выполнить().Выбрать();
	
	НовоеЗначение = Выборка.Количество() = 2;
	
	Если НовоеЗначение <> Константы.ИспользуютсяНесколькоПоставщиковТиповыхОпераций.Получить() Тогда
		Константы.ИспользуютсяНесколькоПоставщиковТиповыхОпераций.Установить(НовоеЗначение);
	КонецЕсли;

КонецПроцедуры

Функция ДанныеТиповойОперации(ТиповаяОперация, БезГруппРеквизитов = Истина, ВключатьОтключенныеПроводки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставляемыеПроводкиТиповыхОпераций.Ссылка КАК Ссылка,
	|	ПоставляемыеПроводкиТиповыхОпераций.Код КАК Код,
	|	ПоставляемыеПроводкиТиповыхОпераций.Наименование КАК Наименование,
	|	ПоставляемыеПроводкиТиповыхОпераций.ВидПланаСчетов КАК ВидПланаСчетов,
	|	ПоставляемыеПроводкиТиповыхОпераций.НеИспользовать КАК НеИспользовать,
	|	ПоставляемыеПроводкиТиповыхОпераций.Условие КАК Условие,
	|	ПоставляемыеПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента КАК ИмяТабличнойЧастиДокумента,
	|	НЕОПРЕДЕЛЕНО КАК КФО,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКФО КАК ФормулаКФО,
	|	0 КАК Сумма,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСумма КАК ФормулаСумма,
	|	0 КАК СуммаНеУчитываетсяНУ,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаНеУчитываетсяНУ КАК ФормулаСуммаНеУчитываетсяНУ,
	|	0 КАК СуммаЕНВД,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаЕНВД КАК ФормулаСуммаЕНВД,
	|	0 КАК СуммаНДС,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСуммаНДС КАК ФормулаСуммаНДС,
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетДт КАК ФормулаСчетДт,
	|	НЕОПРЕДЕЛЕНО КАК КПСДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСДт КАК ФормулаКПСДт,
	|	НЕОПРЕДЕЛЕНО КАК КЭКДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭКДт КАК ФормулаКЭКДт,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт1 КАК ФормулаСубконтоДт1,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт2 КАК ФормулаСубконтоДт2,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт3,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт3 КАК ФормулаСубконтоДт3,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаДвиженияДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияДт КАК ФормулаХарактеристикаДвиженияДт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеДт КАК ФормулаПодразделениеДт,
	|	0 КАК КоличествоДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоДт КАК ФормулаКоличествоДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаДт КАК ФормулаВалютаДт,
	|	0 КАК ВалютнаяСуммаДт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаДт КАК ФормулаВалютнаяСуммаДт,
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетКт КАК ФормулаСчетКт,
	|	НЕОПРЕДЕЛЕНО КАК КПСКт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСКт КАК ФормулаКПСКт,
	|	НЕОПРЕДЕЛЕНО КАК КЭККт,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт1,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭККт КАК ФормулаКЭККт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт1 КАК ФормулаСубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт2 КАК ФормулаСубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт3,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт3 КАК ФормулаСубконтоКт3,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаДвиженияКт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияКт КАК ФормулаХарактеристикаДвиженияКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеКт КАК ФормулаПодразделениеКт,
	|	0 КАК КоличествоКт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоКт КАК ФормулаКоличествоКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаКт КАК ФормулаВалютаКт,
	|	0 КАК ВалютнаяСуммаКт,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаКт КАК ФормулаВалютнаяСуммаКт,
	|	НЕОПРЕДЕЛЕНО КАК ИФО,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаИФО КАК ФормулаИФО,
	|	"""" КАК ВидПервичногоДокумента,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВидПервичногоДокумента КАК ФормулаВидПервичногоДокумента,
	|	НЕОПРЕДЕЛЕНО КАК ДатаПервичногоДокумента,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаДатаПервичногоДокумента КАК ФормулаДатаПервичногоДокумента,
	|	"""" КАК НомерПервичногоДокумента,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаНомерПервичногоДокумента КАК ФормулаНомерПервичногоДокумента,
	|	"""" КАК Содержание,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСодержание КАК ФормулаСодержание,
	|	НЕОПРЕДЕЛЕНО КАК НомерЖурнала,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаНомерЖурнала КАК ФормулаНомерЖурнала,
	|	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПериод КАК ФормулаПериод,
	|	ПоставляемыеПроводкиТиповыхОпераций.НеПересчитыватьСумму КАК НеПересчитыватьСумму,
	|	ПоставляемыеПроводкиТиповыхОпераций.Владелец КАК ТиповаяОперация,
	|	ПоставляемыеПроводкиТиповыхОпераций.Владелец.Наименование КАК ТиповаяОперацияНаименование,
	|	ПоставляемыеПроводкиТиповыхОпераций.ПорядковыйНомерГруппы КАК ПорядковыйНомерГруппы,
	|	ПоставляемыеПроводкиТиповыхОпераций.ПорядковыйНомерВГруппе КАК ПорядковыйНомерВГруппе
	|ИЗ
	|	Справочник.ПоставляемыеПроводкиТиповыхОпераций КАК ПоставляемыеПроводкиТиповыхОпераций
	|ГДЕ
	|	ПоставляемыеПроводкиТиповыхОпераций.Владелец = &Владелец
	|	И НЕ ПоставляемыеПроводкиТиповыхОпераций.ПометкаУдаления
	|	И (&ВключатьОтключенныеПроводки
	|		ИЛИ НЕ ПоставляемыеПроводкиТиповыхОпераций.НеИспользовать)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоставляемыеРеквизитыТиповыхОпераций.Ссылка КАК Ссылка,
	|	ПоставляемыеРеквизитыТиповыхОпераций.Код КАК Код,
	|	ПоставляемыеРеквизитыТиповыхОпераций.Наименование КАК Наименование,
	|	ПоставляемыеРеквизитыТиповыхОпераций.РеквизитПроводки КАК РеквизитПроводки,
	|	НЕОПРЕДЕЛЕНО КАК РеквизитПроводкиТипЗначения,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	ПоставляемыеРеквизитыТиповыхОпераций.Обязательный КАК Обязательный,
	|	ПоставляемыеРеквизитыТиповыхОпераций.СвязиПараметровВыбора КАК СвязиПараметровВыбора,
	|	ПоставляемыеРеквизитыТиповыхОпераций.СвязиПоТипу КАК СвязиПоТипу,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ОтборЭлементов КАК ОтборЭлементов,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ВидЭлемента КАК ВидЭлемента,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ГруппировкаЭлементов КАК ГруппировкаЭлементов,
	|	ПоставляемыеРеквизитыТиповыхОпераций.Отображение КАК Отображение,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ОтображатьЗаголовок КАК ОтображатьЗаголовок,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ШиринаПодчиненныхЭлементов КАК ШиринаПодчиненныхЭлементов,
	|	ПоставляемыеРеквизитыТиповыхОпераций.РастягиватьПоГоризонтали КАК РастягиватьПоГоризонтали,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ПоложениеЗаголовка КАК ПоложениеЗаголовка,
	|	ПоставляемыеРеквизитыТиповыхОпераций.Родитель КАК Родитель,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ЭтоГруппа КАК ЭтоГруппа,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ЗапретитьИзменение КАК ЗапретитьИзменение,
	|	ПоставляемыеРеквизитыТиповыхОпераций.НевидимыйЭлемент КАК НевидимыйЭлемент,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ФункциональныеОпции.(
	|		ИмяФункциональнойОпции КАК ИмяФункциональнойОпции
	|	) КАК ФункциональныеОпции,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
	|	ПоставляемыеРеквизитыТиповыхОпераций.УпакованныеНастройки КАК УпакованныеНастройки
	|ИЗ
	|	Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
	|ГДЕ
	|	ПоставляемыеРеквизитыТиповыхОпераций.Владелец = &Владелец
	|	И НЕ ПоставляемыеРеквизитыТиповыхОпераций.ПометкаУдаления
	|	И (НЕ ПоставляемыеРеквизитыТиповыхОпераций.ЭтоГруппа
	|			ИЛИ &БезГруппРеквизитов = ЛОЖЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.ФормулаДата, """") КАК ФормулаДата,
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.ФормулаОрганизация, """") КАК ФормулаОрганизация,
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.Условие, """") КАК Условие,
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.ИспользуетсяВнешняяПроцедура, ЛОЖЬ) КАК ИспользуетсяВнешняяПроцедура,
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.ИмяВнешнейПроцедуры, """") КАК ИмяВнешнейПроцедуры,
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.НастройкаПредставления, """") КАК НастройкаПредставления,
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.ТекстСообщенияПриОшибке, """") КАК ТекстСообщенияПриОшибке,
	|	ЕСТЬNULL(ПоставляемыеДанныеТиповыхОпераций.ОбработчикПослеФормирования, """") КАК ОбработчикПослеФормирования,
	|	ПоставляемыеТиповыеОперации.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ПоставляемыеТиповыеОперации.УстанавливатьБлокировку КАК УстанавливатьБлокировку,
	|	ПоставляемыеТиповыеОперации.Наименование КАК Наименование,
	|	ЛОЖЬ КАК НеИспользуется,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется) КАК СостояниеПоддержки
	|ИЗ
	|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоставляемыхТиповыхОпераций КАК ПоставляемыеДанныеТиповыхОпераций
	|		ПО ПоставляемыеТиповыеОперации.Ссылка = ПоставляемыеДанныеТиповыхОпераций.ТиповаяОперация
	|ГДЕ
	|	ПоставляемыеТиповыеОперации.Ссылка = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяИсточника КАК ИмяИсточника,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.ИмяКолонки КАК ИмяКолонки,
	|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ресурс КАК Ресурс
	|ИЗ
	|	Справочник.ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.КолонкиИсточника КАК ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ДополнительныеИсточникиДанныхДляТиповыхОпераций
	|		ПО ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка = ДополнительныеИсточникиДанныхДляТиповыхОпераций.Ссылка
	|ГДЕ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|	И ДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = &Владелец
	|ИТОГИ ПО
	|	ИмяИсточника";
	Запрос.УстановитьПараметр("Владелец", 			ТиповаяОперация);
	Запрос.УстановитьПараметр("БезГруппРеквизитов",	БезГруппРеквизитов);
	Запрос.УстановитьПараметр("ВключатьОтключенныеПроводки", ВключатьОтключенныеПроводки);
	Возврат Запрос.ВыполнитьПакет();
КонецФункции

Функция ТекстЗапросаНастройкиПроводок() Экспорт
	Возврат "ВЫБРАТЬ
	        |	&Документ КАК Регистратор,
	        |	ПоставляемыеПроводкиТиповыхОпераций.Владелец КАК ТиповаяОперация,
	        |	ПоставляемыеПроводкиТиповыхОпераций.Ссылка,
	        |	ПоставляемыеПроводкиТиповыхОпераций.Код,
	        |	ПоставляемыеПроводкиТиповыхОпераций.Наименование,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ВидПланаСчетов,
	        |	ПоставляемыеПроводкиТиповыхОпераций.НеИспользовать,
	        |	ПоставляемыеПроводкиТиповыхОпераций.Условие,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента,
	        |	НЕОПРЕДЕЛЕНО КАК КФО,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКФО,
	        |	НЕОПРЕДЕЛЕНО КАК Сумма,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСумма,
	        |	НЕОПРЕДЕЛЕНО КАК СчетДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетДт,
	        |	НЕОПРЕДЕЛЕНО КАК КПСДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСДт,
	        |	НЕОПРЕДЕЛЕНО КАК КЭКДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭКДт,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт1,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт1,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт1,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК ХарактеристикаДвиженияДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияДт,
	        |	НЕОПРЕДЕЛЕНО КАК ПодразделениеДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеДт,
	        |	НЕОПРЕДЕЛЕНО КАК КоличествоДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоДт,
	        |	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаДт,
	        |	НЕОПРЕДЕЛЕНО КАК ВалютнаяСуммаДт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаДт,
	        |	НЕОПРЕДЕЛЕНО КАК СчетКт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСчетКт,
	        |	НЕОПРЕДЕЛЕНО КАК КПСКт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКПСКт,
	        |	НЕОПРЕДЕЛЕНО КАК КЭККт,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт1,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКЭККт,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт1,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт2,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСубконтоКт3,
	        |	НЕОПРЕДЕЛЕНО КАК ХарактеристикаДвиженияКт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаХарактеристикаДвиженияКт,
	        |	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаПодразделениеКт,
	        |	НЕОПРЕДЕЛЕНО КАК КоличествоКт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаКоличествоКт,
	        |	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютаКт,
	        |	НЕОПРЕДЕЛЕНО КАК ВалютнаяСуммаКт,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВалютнаяСуммаКт,
	        |	НЕОПРЕДЕЛЕНО КАК ИФО,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаИФО,
	        |	НЕОПРЕДЕЛЕНО КАК ВидПервичногоДокумента,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаВидПервичногоДокумента,
	        |	НЕОПРЕДЕЛЕНО КАК ДатаПервичногоДокумента,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаДатаПервичногоДокумента,
	        |	НЕОПРЕДЕЛЕНО КАК НомерПервичногоДокумента,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаНомерПервичногоДокумента,
	        |	НЕОПРЕДЕЛЕНО КАК Содержание,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ФормулаСодержание,
	        |	НЕОПРЕДЕЛЕНО КАК НомерЖурнала,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ПорядковыйНомерГруппы,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ПорядковыйНомерВГруппе,
	        |	ПоставляемыеПроводкиТиповыхОпераций.ИспользоватьФормулуПервичногоДокумента
	        |ИЗ
	        |	Справочник.ПоставляемыеПроводкиТиповыхОпераций КАК ПоставляемыеПроводкиТиповыхОпераций
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТиповыеОперации КАК ТиповыеОперации
	        |		ПО ПоставляемыеПроводкиТиповыхОпераций.Владелец = ТиповыеОперации.ПоставляемаяТиповаяОперация
	        |ГДЕ
	        |	НЕ ПоставляемыеПроводкиТиповыхОпераций.НеИспользовать
	        |	И НЕ ПоставляемыеПроводкиТиповыхОпераций.ПометкаУдаления
	        |	И ТиповыеОперации.Ссылка = &ТиповаяОперация";
КонецФункции

Процедура УстановитьИдентификаторПоддержкиВПоставляемыеТиповыеОперации()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|ГДЕ
	|	ПоставляемыеТиповыеОперации.ИдентификаторПоддержки = &ПустойИд";
	Запрос.УстановитьПараметр("ПустойИд", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Если Запрос.Выполнить().Пустой() Тогда
		// Обработка уже выполнялась
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставляемыеТиповыеОперации.Ссылка КАК Ссылка,
	|	ПоставляемыеТиповыеОперации.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ПоставляемыеТиповыеОперации.ИдентификаторДокумента.Имя КАК ИмяМакета,
	|	ПоставляемыеТиповыеОперации.ИмяПредопределеннойОперации КАК ИмяПредопределеннойОперации
	|ИЗ
	|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|ИТОГИ ПО
	|	ИдентификаторДокумента";
	
	МакетыОбработки = Метаданные.Обработки.ИмпортЭкспортТиповыхОпераций.Макеты;
	
	ВыборкаИОМ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИОМ.Следующий() Цикл
		
		Если ВыборкаИОМ.ИмяМакета = "ЗакрытиеГодаТехнологическоеГрупповое" Тогда
			ИспользуемоеИмяМакета = "ЗакрытиеГодаТехнологическое";
		Иначе
			ИспользуемоеИмяМакета = ВыборкаИОМ.ИмяМакета;
		КонецЕсли;
		
		Если МакетыОбработки.Найти(ИспользуемоеИмяМакета) = Неопределено Тогда
			// Такого макета нет в конфигурации
			Продолжить;
		КонецЕсли;
		
		Макет = Обработки.ИмпортЭкспортТиповыхОпераций.ПолучитьМакет(ИспользуемоеИмяМакета);
		ТекстМакета = Макет.ПолучитьТекст();
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(ТекстМакета);
		
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		
		СоответствиеОпераций = Новый Соответствие;
		Операции = ДокументDOM.ПолучитьЭлементыПоИмени("ТиповаяОперация");
		Для каждого ТекОперация Из Операции Цикл
			
			ИдентификаторПоддержкиСтрокой = ТекОперация.ПолучитьАтрибут("ИдентификаторПоддержки");
			ЗначенияПоддержки = Новый Структура("ИдентификаторПоддержки, ИдентификаторПоддержкиСтрокой, Поставщик");
			ЗначенияПоддержки.ИдентификаторПоддержки        = Новый УникальныйИдентификатор(ИдентификаторПоддержкиСтрокой);
			ЗначенияПоддержки.ИдентификаторПоддержкиСтрокой = ИдентификаторПоддержкиСтрокой;
			ЗначенияПоддержки.Поставщик                     = ТекОперация.ПолучитьАтрибут("Поставщик");
			
			СоответствиеОпераций.Вставить(ВРЕГ(ТекОперация.ПолучитьАтрибут("ИмяПредопределенного")), ЗначенияПоддержки);
			
		КонецЦикла;
		
		ВыборкаОперации = ВыборкаИОМ.Выбрать();
		Пока ВыборкаОперации.Следующий() Цикл
			
			ЗначенияПоддержки = СоответствиеОпераций.Получить(ВРЕГ(ВыборкаОперации.ИмяПредопределеннойОперации));
			
			ОперацияОбъект = ВыборкаОперации.Ссылка.ПолучитьОбъект();
			Если ЗначенияПоддержки <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ОперацияОбъект, ЗначенияПоддержки);
			Иначе
				// Операция не найдена в макетах. Используем идентификатор ссылки.
				ОперацияОбъект.ИдентификаторПоддержки        = ОперацияОбъект.Ссылка.УникальныйИдентификатор();
				ОперацияОбъект.ИдентификаторПоддержкиСтрокой = Строка(ОперацияОбъект.ИдентификаторПоддержки);
			КонецЕсли;
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОперацияОбъект, Истина);
			
		КонецЦикла;
	
	КонецЦикла;
	

КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

Процедура ОбновлениеТиповыхОпераций(ПараметрОбработчика = Неопределено) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя) = "0.0.0.0" Тогда
		Возврат;
	КонецЕсли;
	
	// При переходе 2.0.56 необходимо предварительно заполнить новые данные
	РегистрыСведений.ВерсииПоставляемыхТиповыхОпераций.ЗаполнитьПоставляемуюТиповуюОперациюВРегистре();
	УстановитьИдентификаторПоддержкиВПоставляемыеТиповыеОперации();
	
	ОбработкаИмпорта = Обработки.ИмпортЭкспортТиповыхОпераций;
	ТаблицаВерсий = РегистрыСведений.ВерсииПоставляемыхТиповыхОпераций.ПрочитатьВерсииПоставляемыхТиповыхОпераций();
	ТаблицаВерсий.Индексы.Добавить("ИдентификаторПоддержки");
	МассивМакетов = Новый Массив;
	ИдентификаторыТиповыхОпераций = Новый Соответствие;
	ДублирующиесяИдентификаторы = Новый Массив;
	
	Для каждого МетаданныеМакета Из Метаданные.Обработки.ИмпортЭкспортТиповыхОпераций.Макеты Цикл
	
		ТекстМакета = ОбработкаИмпорта.ПолучитьМакет(МетаданныеМакета.Имя).ПолучитьТекст();
		
		ДатаВМакете = Обработки.ИмпортЭкспортТиповыхОперацийВФормате20.ДатаВерсииИзТекстаМакета(ТекстМакета);
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Обработки.ИмпортЭкспортТиповыхОпераций.ПолучитьМакет(МетаданныеМакета.Имя).ПолучитьТекст());
		
		Построитель = Новый ПостроительDOM;
		ДокументДом = Построитель.Прочитать(Чтение);
		
		ОписанияОпераций = ДокументДом.ПолучитьЭлементыПоИмени("ТиповаяОперация");
		
		Для каждого ТекОписаниеОперации Из ОписанияОпераций Цикл
			ИдентификаторПоддержки = ТекОписаниеОперации.ПолучитьАтрибут("ИдентификаторПоддержки");
			СтрокаДатыВБазе = ТаблицаВерсий.Найти(ИдентификаторПоддержки, "ИдентификаторПоддержки");
			Если СтрокаДатыВБазе = Неопределено
				ИЛИ СтрокаДатыВБазе.ДатаВерсии < ДатаВМакете
				И МассивМакетов.Найти(МетаданныеМакета.Имя) = Неопределено Тогда
				
				МассивМакетов.Добавить(МетаданныеМакета.Имя);
			КонецЕсли;
			
			Если ИдентификаторыТиповыхОпераций.Получить(ИдентификаторПоддержки) <> Неопределено Тогда
				
				ТекстИсключения = НСтр("ru = 'Дублируется идентификатор поддержки ""%ИдентификаторПоддержки%""
					|в макетах ""%Макет1%"" и ""%Макет2%""'");
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ИдентификаторПоддержки%", ИдентификаторПоддержки);
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Макет1%", ИдентификаторыТиповыхОпераций.Получить(ИдентификаторПоддержки));
				ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Макет2%", МетаданныеМакета.Имя);
					
				ДублирующиесяИдентификаторы.Добавить(ТекстИсключения);
				
			Иначе
				
				ИдентификаторыТиповыхОпераций.Вставить(ИдентификаторПоддержки, МетаданныеМакета.Имя);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Чтение.Закрыть();
		
	КонецЦикла;
	
	Если ДублирующиесяИдентификаторы.Количество() > 0 Тогда
		
		ТекстИсключения = СтрШаблон(НСтр("ru = 'При проверке макетов типовых операций обнаружены критические ошибки.
			|%1.'"), СтрСоединить(ДублирующиесяИдентификаторы, ";" + Символы.ПС));
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	Если МассивМакетов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// в режиме запуска, как обработчика обновления (*) выполняем только в монопольном режиме
	Если ПараметрОбработчика <> Неопределено И ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
		// установим признак необходимости монопольного режима
		ПараметрОбработчика.МонопольныйРежим = Истина;
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Обновляются поставляемые типовые операции документов из макетов:
		|%СписокДокументов%.'");
	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СписокДокументов%",
		СтрСоединить(МассивМакетов, "," + Символы.ПС));
	ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
		УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.ПоставляемыеТиповыеОперации,,
		ТекстСообщения);
	
	ЗагрузитьЭлементы(МассивМакетов);

КонецПроцедуры

// Проверяет состояние поддержки поставляемой типовой операции.
// Если типовая операция с задаными именем предопределенной операции отсутствует в Предопределенных элементах
// справочника ТиповыеОперации, то такая типовая операция будет помечена на удаление (со всеми подчиненными данными)
// и имя предопределенной типовой операции будет заменено на уникальную строку.
Процедура УстановитьПометкуУдаленияСнятымСПоддержки(ПараметрОбработчика = Неопределено) Экспорт

	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.ВерсииПоставляемыхТиповыхОпераций.ЗаполнитьПоставляемуюТиповуюОперациюВРегистре();
	УстановитьИдентификаторПоддержкиВПоставляемыеТиповыеОперации();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставляемыеТиповыеОперации.Ссылка КАК Ссылка,
	|	ПоставляемыеТиповыеОперации.ИмяПредопределеннойОперации КАК ИмяПредопределеннойОперации,
	|	ПоставляемыеТиповыеОперации.ПометкаУдаления КАК ПометкаУдаления,
	|	ПоставляемыеТиповыеОперации.ИдентификаторПоддержки КАК ИдентификаторПоддержки
	|ИЗ
	|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
	|ГДЕ
	|	ПоставляемыеТиповыеОперации.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		// справочник пустой
		Возврат;
	КонецЕсли;
	
	// собрать имена и ссылки поставляемых типовых операций
	
	ОперацииИзПоставки = Новый Соответствие;
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	Для каждого ОписаниеМакета Из Метаданные.Обработки.ИмпортЭкспортТиповыхОпераций.Макеты Цикл
		
		Чтение = Новый ЧтениеXML;
		Чтение.УстановитьСтроку(Обработки.ИмпортЭкспортТиповыхОпераций.ПолучитьМакет(ОписаниеМакета.Имя).ПолучитьТекст());
		
		Построитель = Новый ПостроительDOM;
		ДокументДом = Построитель.Прочитать(Чтение);
		
		ОписанияОпераций = ДокументДом.ПолучитьЭлементыПоИмени("ТиповаяОперация");
		
		Для каждого ТекОписаниеОперации Из ОписанияОпераций Цикл
			
			Если ТипБулево.ПривестиЗначение(ТекОписаниеОперации.ПолучитьАтрибут("Предопределенный")) = ИСТИНА Тогда
				
				// Если есть реквизит "ИдентификаторПоддержки", то используем его, иначе - ссылку
				ИдентификаторПоддержки = ТекОписаниеОперации.ПолучитьАтрибут("ИдентификаторПоддержки");
				Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИдентификаторПоддержки)
					И ИдентификаторПоддержки <> "00000000-0000-0000-0000-000000000000" Тогда
					
					ИспользуемыйИдентификатор = ИдентификаторПоддержки;
					
				Иначе
					
					ИспользуемыйИдентификатор = ТекОписаниеОперации.ПолучитьАтрибут("Ссылка");
					
				КонецЕсли;
			
				ОперацииИзПоставки.Вставить(ИспользуемыйИдентификатор,
					ВРЕГ(ТекОписаниеОперации.ПолучитьАтрибут("ИмяПредопределенного")));
					
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЦикла;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.ИмяПредопределеннойОперации) Тогда
			// Если не заполнено ИмяПредопределеннойОперации, то это не наша операция
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ИдентификаторПоддержки) Тогда
			
			ИмяПредопределеннойОперации = ОперацииИзПоставки.Получить(Строка(Выборка.ИдентификаторПоддержки));
			
		Иначе
			
			ИмяПредопределеннойОперации = ОперацииИзПоставки.Получить(Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			
		КонецЕсли;
		
		Если ИмяПредопределеннойОперации = Неопределено Тогда
			ПометкаУдаления = Истина;
			ИмяПредопределеннойОперации = ?(СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(
				СтрЗаменить(Выборка.ИмяПредопределеннойОперации, "_", "-")),
				Выборка.ИмяПредопределеннойОперации,
				СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_"));
		ИначеЕсли СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ИмяПредопределеннойОперации) Тогда
			ПометкаУдаления = Истина;
		Иначе
			ПометкаУдаления = Ложь;
		КонецЕсли;
		
		Если ИмяПредопределеннойОперации <> Выборка.ИмяПредопределеннойОперации
			ИЛИ ПометкаУдаления <> Выборка.ПометкаУдаления Тогда
			
			// в режиме запуска, как обработчика обновления (*) выполняем только в монопольном режиме
			Если ПараметрОбработчика <> Неопределено И ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
				// установим признак необходимости монопольного режима
				ПараметрОбработчика.МонопольныйРежим = Истина;
				Возврат;
			КонецЕсли;
			
			ОперацияОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ТекстЗаписи = НСтр("ru = 'Изменилось состояние поддержки поставляемой типовой операции:
					|Идентификатор документа: %Документ%,
					|Наименование: %Наименование%,
					|Пометка удаления (стало): %ПометкаУдаленияСтало%,
					|Имя предопределенного (стало): %ИмяПредопределенногоСтало%,
					|Пометка удаления (было): %ПометкаУдаленияБыло%,
					|Имя предопределенного (было): %ИмяПредопределенногоБыло%.'");
			ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%Документ%",                  ОперацияОбъект.ИдентификаторДокумента);
			ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%Наименование%",              ОперацияОбъект.Наименование);
			ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%ПометкаУдаленияБыло%",       ОперацияОбъект.ПометкаУдаления);
			ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%ПометкаУдаленияСтало%",      ПометкаУдаления);
			ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%ИмяПредопределенногоБыло%",  ОперацияОбъект.ИмяПредопределеннойОперации);
			ТекстЗаписи = СтрЗаменить(ТекстЗаписи, "%ИмяПредопределенногоСтало%", ИмяПредопределеннойОперации);
			
			ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииУдалениеИзПоставки(),
				УровеньЖурналаРегистрации.Информация, Выборка.Ссылка.Метаданные(), Выборка.Ссылка, ТекстЗаписи);
			
			Если ОперацияОбъект.ПометкаУдаления <> ПометкаУдаления Тогда
				ОперацияОбъект.УстановитьПометкуУдаления(ПометкаУдаления, НЕ ПометкаУдаления);
			КонецЕсли;
			Если ОперацияОбъект.ИмяПредопределеннойОперации <> ИмяПредопределеннойОперации Тогда
				ОперацияОбъект.ИмяПредопределеннойОперации = ИмяПредопределеннойОперации;
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОперацияОбъект, Истина);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли