////////////////////////////////////////////////////////////////////////////////
//	Форма "Ввод нескольких документов на основании одного документа"
////////////////////////////////////////////////////////////////////////////////
//
// Параметры формы:
//	Адрес									- Строка		-
//												адрес в хранилище, по которому расположены
//												результаты работы механизма Ввода на основании,
//												требующиеся этой форме.
//												Обязательный параметр.
//												
//		В этих данных ожидается наличие таблицы "Отметки", для работы с которой и предназначена эта форма.
//		
//		Таблица "Отметки" должна быть заполнена и иметь колонки:
//			ВидДокумента (можно переопределить имя)
//				Если в сроках таблицы в этом поле указаны различные значения,
//				то таблица отображается в виде дерева и строки сгруппированы по виду документа.
//				Если вид документа один и тот же, то группировка строк не применяется.
//			ДокСсылка (можно переопределить имя)
//				Содержит ссылку на документ, уже введенный на основании и имеющий совпадающие значения
//				реквизитов шапки со значениями полей этой же строки таблицы.
//			<Прочие колонки>
//				Произвольные колонки, предназначенные для вывода реквизитов шапки планируемых к созданию документов.
//
//	ВидДокумента							- Строка		-
//												указывается один единственный вид документов для всех строк.
//												Данный параметр имеет приоритет над колонкой ВидДокумента
//												в таблице ТаблицаОтметки.
//												В случае указания этого параметра колонка ВидДокумента
//												становится необязательной и игнорируется.
//												Опциональный параметр.
//
//	ДокументОснованиеСсылка					- Ссылка		-
//												ссылка на документ-основание. Выводится на форме для справки.
//												Обязательный параметр.
//
//	РазрешитьОтметкуСуществующихДокументов	- Булево		-
//												разрешает устанавливать флажок в такой строке таблице,
//												для которой обнаружен существующий документ (заполнено поле ДокСсылка).
//												Значение по умолчанию: Ложь
//
//	СвойстваКолонок							- Структура		-
//												настройки для оформления элемента колонки на форме.
//												Ключ		- имя колонки
//												Значение	- Структура	- устанавливаемые свойства колонки
//												Опциональный параметр.
//		
//	СинонимыВидовДокументов					- Список значений	-
//												представления видов документов, которые будут выводиться в форме.
//												Пример:	("ПринятиеКУчетуИК", "Принятие к учету объекта ИК (кроме зданий и сооружений) (ОС-1)")
//												Если список пустой, или не содержит значений для используемых видов документов,
//												то будут выводиться виды документов как есть (в примере "ПринятиеКУчетуИК").
//												Опциональный параметр.
//
//	ИменаСкрываемыхКолонок					- Строка		-
//												имена колонок таблицы Отметки, которые нужно принудительно скрыть
//												по эстетическим соображениям.
//												Например, колонка "Организация", если во всех строках
//												повторяется одно и то же значение
//												Опциональный параметр.
//
//	ИмяКолонкиДокСсылка						- Строка		-
//												имя колонки в переданной таблице Отметки для ссылок
//												на уже существующие документы.
//												Значение по умолчанию: "ДокСсылка"
//												Опциональный параметр.
//
//	ИмяКолонкиВидДокумента 					- Строка		-
//												имя колонки в переданной таблице Отметки
//												для указания вида создаваемых документов.
//												Значение по умолчанию: "ВидДокумента"
//												Опциональный параметр.
//
//	ИменаКолонокТиповойОперации				 - Массив или Строка	-
//												имена колонок таблицы Отметки, которые используются
//												для вывода реквизитов типовых операций.
//												Все остальные колонки таблицы, кроме колонок для реквизитов
//												типовых операций и служебных колонок ДокСсылка и ВидДокумента,
//												считаются колонками для реквизитов шапки документов
//												Опциональный параметр.
//
// Возвращаемое значение:
//	При закрытии формы возвращается результат функции ПолучитьОтмеченныеСтроки()
//	Тип значения	- Структура	-
//						индексы отмеченных строк в переданной таблице Отметки
//						для каждого из видов документов
//						Ключ:		<ВидДокумента>
//						Значение:	Массив	- индексы отмеченных строк

&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инициализация();
	
	НастроитьФормуПоТаблицеОтметки();
	
	УстановитьУсловноеОформление();
	
	Если БлокироватьРаботуФормы Тогда
		Элементы["КомандаСнятьВсе"].Доступность					= Ложь;
		Элементы["КомандаУстановитьВсе"].Доступность			= Ложь;
		Элементы["КомандаУстановитьПоУмолчанию"].Доступность	= Ложь;
		Элементы["КомандаСоздать"].Доступность					= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовкаСообщений = НСтр("ru='Ввод документов на основании'");
	
	ОбновитьНадписьОКоличествеДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы["Список"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Если щелкнули на флажке, а он недоступен, то сообщим, почему именно
	ПоказатьСообщение = НЕ Параметры["РазрешитьОтметкуСуществующихДокументов"]
		И Поле.Имя = "СписокОтметка"
		И ЗначениеЗаполнено(ТекДанные[ПредопределеннаяКолонкаДокСсылка]);
	Если ПоказатьСообщение Тогда
		ТекстСообщения = НСтр("ru='Установить флажок нельзя - на основании данной строки уже создан документ'");
		ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокОтметкаПриИзменении(Элемент)
	
	ТекДанные = Элементы["Список"].ТекущиеДанные;
	
	Отметка = ТекДанные[ПредопределеннаяКолонкаОтметка];
	
	Если ТекДанные[ПредопределеннаяКолонкаГруппировкаВидДокумента] Тогда
		// Это строка группировки ВидДокумента
		
		// Настраиваем все флажки конкретных документов этого вида
		СтрокиДерева = ТекДанные.ПолучитьЭлементы();
		Для Каждого СтрокаДерева Из СтрокиДерева Цикл
			МожноИзменитьОтметку = ОтметкаДоступна(
				СтрокаДерева,
				Параметры["РазрешитьОтметкуСуществующихДокументов"],
				ПредопределеннаяКолонкаДокСсылка)
				И НЕ СтрокаДерева[ПредопределеннаяКолонкаОтметка] = Отметка;
			Если МожноИзменитьОтметку Тогда
				СтрокаДерева[ПредопределеннаяКолонкаОтметка] = Отметка;
				КоличествоДокументов = КоличествоДокументов + ?(Отметка, 1, -1);
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Это строка конкретного документа
		
		КоличествоДокументов = КоличествоДокументов + ?(Отметка, 1, -1);
		
		// Обновим при возможности отметку групповой строки для этого вида документов
		Если ГруппироватьПоВидуДокумента Тогда
			ОтметкиДочернихСтрокРазличаются = Ложь;
			СтрокаРодитель = ТекДанные.ПолучитьРодителя();
			СтрокиДерева = СтрокаРодитель.ПолучитьЭлементы();
			Для Каждого СтрокаДерева Из СтрокиДерева Цикл
				Если НЕ СтрокаДерева[ПредопределеннаяКолонкаОтметка] = Отметка Тогда
					ОтметкиДочернихСтрокРазличаются = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ОтметкиДочернихСтрокРазличаются Тогда
				СтрокаРодитель[ПредопределеннаяКолонкаОтметка] = Истина;
			Иначе
				СтрокаРодитель[ПредопределеннаяКолонкаОтметка] = Отметка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьНадписьОКоличествеДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокСсылкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
&НаКлиенте
Процедура СписокДокСсылкаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСоздать(Команда)
	
	Если КоличествоДокументов > 0 Тогда
		ЭтаФорма.Закрыть(ПолучитьОтмеченныеСтроки());
	Иначе
		ТекстСообщения = НСтр("ru='Отметьте хотя бы одну строку'");
		ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсе(Команда)
	
	УстановитьЗначениеФлажковКлиент(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсе(Команда)
	
	УстановитьЗначениеФлажковКлиент(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьПоУмолчанию(Команда)
	
	УстановитьЗначениеФлажковКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура Инициализация()
	
	ИменаДобавленныхКолонок = Новый ФиксированныйМассив(Новый Массив());
	
	// Скрываем элементы сообщения об ошибке, пока ее не обнаружим
	ВывестиПояснение();
	
КонецПроцедуры


&НаСервере
Процедура НастроитьФормуПоТаблицеОтметки()
	
	ПереданнаяТаблицаОтметки = ПолучитьИзВременногоХранилища(Параметры["АдресТаблицыОтметки"]);
	
	ПредопределеннаяКолонкаГруппировкаВидДокумента	= "_ГруппировкаВидДокумента";
	ПредопределеннаяКолонкаВидДокумента				= "_ВидДокумента";
	ПредопределеннаяКолонкаДокСсылка				= "_ДокСсылка";
	ПредопределеннаяКолонкаОтметка					= "_Отметка";
	
	ИмяТаблицыФормы									= "Список";
	
	//---
	// Входная проверка
	//---
	
	// Опциональный параметр ВидДокумента
	ЕдиныйВидДокумента = СокрЛП(Параметры["ВидДокумента"]);
	// Предварительная настройка, на случай наличия ошибок при дальнейшей входной проверке.
	// По окончании проверки будет выполнена окончательная настройка.
	ВидДокументовПредставление = ПолучитьПредставлениеВидаДокументов(ЕдиныйВидДокумента);
	
	// Обязательный параметр ДокументОснованиеСсылка
	ДокументОснованиеСсылка = Параметры["ДокументОснованиеСсылка"];
	Если НЕ ЗначениеЗаполнено(ДокументОснованиеСсылка) Тогда
		БлокироватьРаботуФормы = Истина;
		ТекстСообщения = НСтр("ru='Ошибка в переданных параметрах формы: не заполнен обязательный параметр ДокументОснованиеСсылка'");
		ВывестиПояснение(ТекстСообщения, Истина);
		// Выходим
		Возврат;
	КонецЕсли;
	
	// Обязательный параметр ТаблицаОтметки
	Если НЕ ТипЗнч(ПереданнаяТаблицаОтметки) = Тип("ТаблицаЗначений") Тогда
		БлокироватьРаботуФормы = Истина;
		ТекстСообщения = НСтр("ru='Ошибка в переданных параметрах формы: в ТаблицаОтметки передан параметр недопустимого типа. Ожидается таблица значений'");
		ВывестиПояснение(ТекстСообщения, Истина);
		// Выходим
		Возврат;
	КонецЕсли;
	Если ПереданнаяТаблицаОтметки.Количество() = 0 Тогда
		БлокироватьРаботуФормы = Истина;
		ТекстСообщения = НСтр("ru='Отсутствуют данные для ввода на основании'");
		ВывестиПояснение(ТекстСообщения);
		// Выходим
		Возврат;
	КонецЕсли;
	
	// Опциональный параметр ИмяКолонкиДокСсылка
	ИмяКолонкиДокСсылка = Параметры["ИмяКолонкиДокСсылка"];
	Если НЕ ЗначениеЗаполнено(ИмяКолонкиДокСсылка) Тогда
		ЗначениеПоУмолчанию = "ДокСсылка";
		ИмяКолонкиДокСсылка = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	// Опциональный параметр ИмяКолонкиВидДокумента 
	ИмяКолонкиВидДокумента  = Параметры["ИмяКолонкиВидДокумента"];
	Если НЕ ЗначениеЗаполнено(ИмяКолонкиВидДокумента) Тогда
		ЗначениеПоУмолчанию = "ВидДокумента";
		ИмяКолонкиВидДокумента = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	// Опциональный параметр ИменаКолонокТиповойОперации
	ИменаКолонокТиповойОперации = Параметры["ИменаКолонокТиповойОперации"];
	Если ТипЗнч(ИменаКолонокТиповойОперации) = Тип("Строка") Тогда
		ИменаКолонокТиповойОперации = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаКолонокТиповойОперации);
	ИначеЕсли НЕ ТипЗнч(ИменаКолонокТиповойОперации) = Тип("Массив") Тогда
		ЗначениеПоУмолчанию = Новый Массив();
		ИменаКолонокТиповойОперации = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	// Опциональный параметр СвойстваКолонок
	СвойстваКолонок = Параметры["СвойстваКолонок"];
	Если НЕ ТипЗнч(СвойстваКолонок) = Тип("Структура") Тогда
		ЗначениеПоУмолчанию = Новый Структура();
		СвойстваКолонок = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	// Опциональный параметр ИменаСкрываемыхКолонок
	ИменаСкрываемыхКолонок = СокрЛП(Параметры["ИменаСкрываемыхКолонок"]);
	
	// Проверяем колонки переданной таблицы ТаблицаОтметки
	ЕстьКолонкаВидДокумента	= Ложь;
	ЕстьКолонкаДокСсылка	= Ложь;
	ЕстьКолонкиДанных		= Ложь;
	ДобавляемыеРеквизиты					= Новый Массив();
	ВремМассивИменаДобавленныхКолонок		= Новый Массив();
	ИменаДобавленныхКолонокШапкиДокумента	= Новый Массив();
	ИменаДобавленныхКолонокТиповойОперации	= Новый Массив();
	Для Каждого Колонка Из ПереданнаяТаблицаОтметки.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если ИмяКолонки = ИмяКолонкиДокСсылка Тогда
			ЕстьКолонкаДокСсылка = Истина;
		ИначеЕсли ИмяКолонки = ИмяКолонкиВидДокумента Тогда
			ЕстьКолонкаВидДокумента	= Истина;
		Иначе
			// Это или колонка шапки документа, или типовой операции.
			
			ЭтоКолонкаТиповойОперации	= НЕ (ИменаКолонокТиповойОперации.Найти(ИмяКолонки) = Неопределено);
			ЭтоКолонкаШапкиДокумента	= НЕ ЭтоКолонкаТиповойОперации;
			
			Если ЭтоКолонкаШапкиДокумента ИЛИ ЭтоКолонкаТиповойОперации Тогда
				ЕстьКолонкиДанных = Истина;
				
				НовыйРеквизит = Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов(""), ИмяТаблицыФормы);
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
				ВремМассивИменаДобавленныхКолонок.Добавить(ИмяКолонки);
				Если ЭтоКолонкаШапкиДокумента Тогда
					ИменаДобавленныхКолонокШапкиДокумента.Добавить(ИмяКолонки);
				ИначеЕсли ЭтоКолонкаТиповойОперации Тогда
					ИменаДобавленныхКолонокТиповойОперации.Добавить(ИмяКолонки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Обязательная колонка ДокСсылка в ТаблицаОтметки
	Если НЕ ЕстьКолонкаДокСсылка Тогда
		БлокироватьРаботуФормы = Истина;
		ТекстШаблон = НСтр("ru='Ошибка в переданных параметрах формы: в таблице не найдена обязательная колонка %1'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблон, ИмяКолонкиДокСсылка);
		ВывестиПояснение(ТекстСообщения, Истина);
		// Выходим
		Возврат;
	КонецЕсли;
	
	// Корректность указания вида документов
	ВидДокументаЗаданВКолонке = НЕ ЗначениеЗаполнено(ЕдиныйВидДокумента);
	Если ВидДокументаЗаданВКолонке Тогда
		Если НЕ ЕстьКолонкаВидДокумента Тогда
			БлокироватьРаботуФормы = Истина;
			ТекстШаблон = НСтр("ru='Ошибка в переданных параметрах формы: в таблице не найдена обязательная колонка %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблон, ИмяКолонкиВидДокумента);
			ВывестиПояснение(ТекстСообщения, Истина);
			// Выходим
			Возврат;
		КонецЕсли;
		
		// Сколько различных видов документов указано?
		ВремТаблица = ПереданнаяТаблицаОтметки.Скопировать(, ИмяКолонкиВидДокумента);
		ВремТаблица.Свернуть(ИмяКолонкиВидДокумента);
		ВидыДокументов = ВремТаблица.ВыгрузитьКолонку(ИмяКолонкиВидДокумента);
		ВидДокументаЕдинственный = (ВидыДокументов.Количество() = 1);
		Если ВидДокументаЕдинственный Тогда
			ЕдиныйВидДокумента = ВидыДокументов[0];
		КонецЕсли;
		
		Для Каждого ВидДокумента Из ВидыДокументов Цикл
			Если ПустаяСтрока(ВидДокумента) Тогда
				БлокироватьРаботуФормы = Истина;
				ТекстШаблон = НСтр("ru='Ошибка в переданных параметрах формы: не заполнено поле %1 в таблице ТаблицаОтметки'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблон, ИмяКолонкиВидДокумента);
				ВывестиПояснение(ТекстСообщения, Истина);
				// Выходим
				Возврат;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ВидДокументаЕдинственный = Истина;
	КонецЕсли;
	
	//---
	// Все входные проверки пройдены успешно
	//---
	
	ГруппироватьПоВидуДокумента = НЕ ВидДокументаЕдинственный;
	
	ВидДокументовПредставление = ПолучитьПредставлениеВидаДокументов(ЕдиныйВидДокумента);
	
	//---
	// Добавляем реквизиты формы (колонки)
	//---
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ИменаДобавленныхКолонок = Новый ФиксированныйМассив(ВремМассивИменаДобавленныхКолонок);
	
	//---
	// Заполняем таблицу Отметки
	//---
	КоличествоДокументов = 0;
	ДеревоСписок = РеквизитФормыВЗначение("Список");
	СтрокаРодитель = ДеревоСписок;
	Для Каждого СтрокаТаблицы Из ПереданнаяТаблицаОтметки Цикл
		Если ВидДокументаЗаданВКолонке Тогда
			ВидДокумента = СтрокаТаблицы[ИмяКолонкиВидДокумента];
		Иначе
			ВидДокумента = ЕдиныйВидДокумента;
		КонецЕсли;
		
		ДокСсылка = СтрокаТаблицы[ИмяКолонкиДокСсылка];
		
		// Строка группировки по виду документа
		Если ГруппироватьПоВидуДокумента Тогда
			Поиск = Новый Структура();
			Поиск.Вставить(ПредопределеннаяКолонкаВидДокумента, ВидДокумента);
			
			МассивСтрок = ДеревоСписок.Строки.НайтиСтроки(Поиск, Ложь); // ВключатьПодчиненные=Ложь
			Если МассивСтрок.Количество() = 0 Тогда
				СтрокаРодитель = ДеревоСписок.Строки.Добавить();
				СтрокаРодитель[ПредопределеннаяКолонкаВидДокумента]				= ВидДокумента;
				СтрокаРодитель[ПредопределеннаяКолонкаГруппировкаВидДокумента]	= Истина;
			Иначе
				СтрокаРодитель = МассивСтрок[0];
			КонецЕсли;
		КонецЕсли;
		
		// Строка нового документа
		Отметка = НЕ ЗначениеЗаполнено(ДокСсылка);
		НоваяСтрока = СтрокаРодитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		НоваяСтрока[ПредопределеннаяКолонкаВидДокумента]	= ВидДокумента;
		НоваяСтрока[ПредопределеннаяКолонкаОтметка]			= Отметка;
		НоваяСтрока[ПредопределеннаяКолонкаДокСсылка]		= ДокСсылка;
		Если Отметка Тогда
			Если ГруппироватьПоВидуДокумента Тогда
				СтрокаРодитель[ПредопределеннаяКолонкаОтметка]		= Истина;
			КонецЕсли;
			КоличествоДокументов = КоличествоДокументов + 1;
		КонецЕсли;
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДеревоСписок, "Список");
	
	//---
	// Создаем новые элементы формы (колонки)
	//---
	УстановитьБезопасныйРежим(Истина);
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
	Иначе
		МассивРазделителей = Новый Массив;
	КонецЕсли;
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
	КонецЦикла;
	
	ПоддерживаемыеСвойстваЭлементаФормы = ПолучитьСписокПоддерживаемыхСвойствЭлементовФормы();
	ГруппаРеквизитовДокумента = Элементы["СписокГруппаРеквизитыДокумента"];
	ГруппаРеквизитовОперации = Элементы["СписокГруппаРеквизитыОперации"];
	Для Каждого ИмяРеквизита Из ИменаДобавленныхКолонок Цикл
		ЭтоКолонкаШапкиДокумента	= НЕ (ИменаДобавленныхКолонокШапкиДокумента.Найти(ИмяРеквизита) = Неопределено);
		ЭтоКолонкаТиповойОперации	= НЕ (ИменаДобавленныхКолонокТиповойОперации.Найти(ИмяРеквизита) = Неопределено);
		
		Если ЭтоКолонкаШапкиДокумента Тогда
			РодительскаяГруппа = ГруппаРеквизитовДокумента;
		ИначеЕсли ЭтоКолонкаТиповойОперации Тогда
			РодительскаяГруппа = ГруппаРеквизитовОперации;
		Иначе
			Продолжить;
		КонецЕсли;
		
		// Создаем новый элемент (колонку)
		НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), РодительскаяГруппа);
		НовыйЭлемент.ПутьКДанным = ИмяТаблицыФормы + "." + ИмяРеквизита;
		
		// Свойства колонки по умолчанию
		СвойстваКолонки = Неопределено;
		Если НЕ СвойстваКолонок.Свойство(ИмяРеквизита, СвойстваКолонки) Тогда
			СвойстваКолонки = Новый Структура();
			СвойстваКолонки.Вставить("ТолькоПросмотр",				Истина);
			СвойстваКолонки.Вставить("Ширина",						4);
			СвойстваКолонки.Вставить("РастягиватьПоГоризонтали",	Истина);
		КонецЕсли;
		
		// Заголовок колонки
		УстановитьЗаголовок = НЕ СвойстваКолонки.Свойство("Заголовок");
		Если УстановитьЗаголовок Тогда
			НовоеЗначение = ПереданнаяТаблицаОтметки.Колонки.Найти(ИмяРеквизита).Заголовок;
			Если НЕ ЗначениеЗаполнено(НовоеЗначение) Тогда
				НовоеЗначение = ИмяРеквизита;
			КонецЕсли;
			
			СвойстваКолонки.Вставить("Заголовок", НовоеЗначение);
		КонецЕсли;
		
		// Настраиваем явно заданные свойства элемента
		Для Каждого СвойствоКолонки Из СвойстваКолонки Цикл
			ИмяСвойства = СвойствоКолонки.Ключ;
			ЗначениеСвойства = СвойствоКолонки.Значение;
			ИмяСистемногоПеречисления = Неопределено;
			Если ПоддерживаемыеСвойстваЭлементаФормы.Свойство(ИмяСвойства, ИмяСистемногоПеречисления) Тогда
				Если ТипЗнч(ЗначениеСвойства) = Тип("Строка")
					И ЗначениеЗаполнено(ЗначениеСвойства)
					И ЗначениеЗаполнено(ИмяСистемногоПеречисления) Тогда
					// Значение свойства указано строкой.
					// Преобразуем в значение перечисления:
					ЗначениеСвойства = Вычислить(ИмяСистемногоПеречисления + "." + ЗначениеСвойства); // АПК:488 Код выполняется в безопасном режиме.
				КонецЕсли;
				НовыйЭлемент[ИмяСвойства] = ЗначениеСвойства;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Скрываем неиспользуемые колонки, созданные для примера
	Элементы[ИмяТаблицыФормы + "ПримерРеквизитаШапкиДокументаНеУдалять"].Видимость = Ложь;
	Элементы[ИмяТаблицыФормы + "ПримерРеквизитаТиповойОперацииНеУдалять"].Видимость = Ложь;
	
	// Колонка ВидДокумента
	Если ГруппироватьПоВидуДокумента Тогда
		// Несколько различных видов документов
		Элементы["Список"].Отображение						= ОтображениеТаблицы.Дерево;
		Элементы["ВидДокументовПредставление"].Видимость	= Ложь;
		Элементы["СписокВидДокумента"].Видимость			= Истина;
		//Элементы["СписокОтметка"].ФиксацияВТаблице			= ФиксацияВТаблице.Лево;
		//Элементы["ВидДокумента"].ФиксацияВТаблице			= ФиксацияВТаблице.Лево;
	Иначе
		// Всего 1 вид документов
		Элементы["Список"].Отображение						= ОтображениеТаблицы.Список;
		Элементы["ВидДокументовПредставление"].Видимость	= Истина;
		Элементы["СписокВидДокумента"].Видимость			= Ложь;
		//Элементы["СписокОтметка"].ФиксацияВТаблице			= ФиксацияВТаблице.Лево;
	КонецЕсли;
	
	// Скрываем принудительно указанные колонки
	МассивИмен = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаСкрываемыхКолонок);
	Для Каждого ИмяКолонки Из МассивИмен Цикл
		Если ИменаДобавленныхКолонок.Найти(ИмяКолонки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Элементы[ИмяКолонки].Видимость = Ложь;
	КонецЦикла;
	
	// Определим количество документов к созданию
	Если КоличествоДокументов = 0 И НЕ Параметры.РазрешитьОтметкуСуществующихДокументов Тогда
		// Нельзя создать ни одного нового документа.
		БлокироватьРаботуФормы = Истина;
		ТекстСообщения = НСтр("ru='На основании этого документа уже введены все допустимые документы'");
		ВывестиПояснение(ТекстСообщения);
		// Выходим
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОбозначениеНесколькихЗначений = "<таблица>";
	
	//
	// 1. Колонка ВидДокумента - вывод синонимов
	//
	Для Каждого Элем Из Параметры["СинонимыВидовДокументов"] Цикл
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Колонка ВидДокумента - представление при значении " + Элем.Значение;
		// Условие:
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ПредопределеннаяКолонкаВидДокумента);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Элем.Значение;
		// Оформление:
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Элем.Представление);
		// Оформляемые поля:
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокВидДокумента");
	КонецЦикла;
	
	//
	// 2. Колонка ВидДокумента - строка документа
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Колонка ВидДокумента - строка документа";
	// Условие:
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ПредопределеннаяКолонкаГруппировкаВидДокумента);
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	// Оформление:
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",		Новый Цвет(120, 120, 120));
	// Оформляемые поля:
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокВидДокумента");
	
	//
	// 3. Колонка Отметка - Флажок в строке недоступен, если есть документ
	//
	Если НЕ Параметры["РазрешитьОтметкуСуществующихДокументов"] Тогда
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Флажок в строке недоступен, если есть документ";
		// Условие:
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ПредопределеннаяКолонкаДокСсылка);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		// Оформление:
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",	Истина);
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",		Новый Цвет(240, 240, 240));
		// Оформляемые поля:
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокОтметка");
	КонецЕсли;
	
	//
	// 4. Колонка Документ - текст <будет создан новый документ>
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Колонка Документ - текст <будет создан новый документ>";
	// Условие:
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ПредопределеннаяКолонкаОтметка);
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ПредопределеннаяКолонкаГруппировкаВидДокумента);
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	// Оформление:
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",			НСтр("ru='<будет создан новый документ>'"));
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт",			Новый Шрифт(,,Истина));
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",		Новый Цвет());
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",	Истина);
	// Оформляемые поля:
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДокСсылка");
	
	//
	// Колонки реквизитов шапки и типовой операции
	//
	Для Каждого ИмяРеквизита Из ИменаДобавленныхКолонок Цикл
		//
		// 5. Все колонки - оформление при пустом значении
		//
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Колонка " + ИмяРеквизита + " - оформление при пустом значении";
		// Условие:
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ИмяРеквизита);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ПредопределеннаяКолонкаГруппировкаВидДокумента);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Ложь;
		// Оформление:
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "-");
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(120, 120, 120));
		// Оформляемые поля:
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяРеквизита);
		
		//
		// 6. Все колонки - оформление при значении <таблица>
		//
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Колонка " + ИмяРеквизита + " - оформление при значении " + ОбозначениеНесколькихЗначений;
		// Условие:
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список." + ИмяРеквизита);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = ОбозначениеНесколькихЗначений;
		// Оформление:
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(120, 120, 120));
		// Оформляемые поля:
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяРеквизита);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОтмеченныеСтроки()
	
	Перем	СтруктураДанных;
	
	ОтмеченныеСтроки = Новый Структура();
	
	ДеревоСписок = РеквизитФормыВЗначение("Список");
	Поиск = Новый Структура(ПредопределеннаяКолонкаОтметка, Истина);
	МассивСтрок = ДеревоСписок.Строки.НайтиСтроки(Поиск, Истина);
	Для Каждого СтрокаДерева Из МассивСтрок Цикл
		Если НЕ СтрокаДерева[ПредопределеннаяКолонкаГруппировкаВидДокумента] Тогда
			ВидДокумента = СтрокаДерева[ПредопределеннаяКолонкаВидДокумента];
			Если НЕ ОтмеченныеСтроки.Свойство(ВидДокумента, СтруктураДанных) Тогда
				СтруктураДанных = Новый Структура();
				СтруктураДанных.Вставить("Индексы",					Новый Массив());
			КонецЕсли;
			
			Если ГруппироватьПоВидуДокумента Тогда
				СтрокаГруппировки = СтрокаДерева.Родитель;
				Индекс = СтрокаГруппировки.Строки.Индекс(СтрокаДерева);
			Иначе
				Индекс = ДеревоСписок.Строки.Индекс(СтрокаДерева);
			КонецЕсли;
			
			СтруктураДанных["Индексы"].Добавить(Индекс);
			ОтмеченныеСтроки.Вставить(ВидДокумента, СтруктураДанных);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОтмеченныеСтроки;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПоддерживаемыхСвойствЭлементовФормы()
	
	//					Имя свойства					Имя системного перечисления
	Результат = Новый Структура();
	Результат.Вставить("Заголовок");
	Результат.Вставить("Вид",							"ВидПоляФормы");
	Результат.Вставить("ГоризонтальноеПоложение",		"ГоризонтальноеПоложениеЭлемента");
	Результат.Вставить("ГоризонтальноеПоложениеВШапке",	"ГоризонтальноеПоложениеЭлемента");
	Результат.Вставить("КартинкаШапки");
	Результат.Вставить("Подсказка");
	Результат.Вставить("РастягиватьПоГоризонтали");
	Результат.Вставить("ЦветРамки");
	Результат.Вставить("ЦветТекста");
	Результат.Вставить("ЦветТекстаЗаголовка");
	Результат.Вставить("ЦветФона");
	Результат.Вставить("ЦветФонаЗаголовка");
	Результат.Вставить("Ширина");
	Результат.Вставить("Шрифт");
	Результат.Вставить("ШрифтЗаголовка");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВывестиПояснение(ТекстСообщения = "", ЭтоОшибка = Ложь)
	
	ВыводитьПояснение = ЗначениеЗаполнено(ТекстСообщения);
	ИменаВсехКартинок = Новый Структура("ДекорацияОшибка,ДекорацияИнформация");
	
	Если ЭтоОшибка Тогда
		ИмяОтображаемойКартинки = "ДекорацияОшибка";
	Иначе
		ИмяОтображаемойКартинки = "ДекорацияИнформация";
	КонецЕсли;
	
	Если ВыводитьПояснение Тогда
		ТекстПояснения = ТекстСообщения;
		Для Каждого ЭлемИмяКартинки Из ИменаВсехКартинок Цикл
			ИмяКартинки = ЭлемИмяКартинки.Ключ;
			Элементы[ИмяКартинки].Видимость = (ИмяКартинки = ИмяОтображаемойКартинки);
		КонецЦикла;
		
	Иначе
		ТекстПояснения = "";
	КонецЕсли;
	
	Элементы["ГруппаПояснение"].Видимость = ВыводитьПояснение;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеФлажковКлиент(НовоеЗначение = Неопределено)
	
	УстановитьЗначениеПоУмолчанию = (НовоеЗначение = Неопределено);
	
	КоличествоДокументов = 0;
	
	Для Каждого СтрокаГруппировкиВидДокумента Из Список.ПолучитьЭлементы() Цикл
		
		Если ГруппироватьПоВидуДокумента Тогда
			
			ЕстьСброшенныйФлажок	= Ложь;
			ЕстьУстановленныйФлажок	= Ложь;
			
			// Настраиваем флажки детальных строк
			Для Каждого СтрокаДерева Из СтрокаГруппировкиВидДокумента.ПолучитьЭлементы() Цикл
				МожноИзменитьОтметку = ОтметкаДоступна(
					СтрокаДерева,
					Параметры["РазрешитьОтметкуСуществующихДокументов"],
					ПредопределеннаяКолонкаДокСсылка);
					
				Если МожноИзменитьОтметку Тогда
					УстанавливаемоеЗначение = ?(УстановитьЗначениеПоУмолчанию,
						НЕ ЗначениеЗаполнено(СтрокаДерева[ПредопределеннаяКолонкаДокСсылка]),
						НовоеЗначение);
					
					СтрокаДерева[ПредопределеннаяКолонкаОтметка] = УстанавливаемоеЗначение;
					
					Если УстанавливаемоеЗначение = Истина Тогда
						КоличествоДокументов = КоличествоДокументов + 1;
					КонецЕсли;
				КонецЕсли;
				
				ЕстьУстановленныйФлажок	= (СтрокаДерева[ПредопределеннаяКолонкаОтметка] = Истина);
				ЕстьСброшенныйФлажок	= (СтрокаДерева[ПредопределеннаяКолонкаОтметка] = Ложь);
			КонецЦикла;
			
			// Настраиваем флажок строки группировки
			СтрокаГруппировкиВидДокумента[ПредопределеннаяКолонкаОтметка] = ЕстьУстановленныйФлажок;
			
		Иначе
			УстанавливаемоеЗначение = ?(УстановитьЗначениеПоУмолчанию,
				НЕ ЗначениеЗаполнено(СтрокаГруппировкиВидДокумента[ПредопределеннаяКолонкаДокСсылка]),
				НовоеЗначение);
			
			СтрокаГруппировкиВидДокумента[ПредопределеннаяКолонкаОтметка] = УстанавливаемоеЗначение;
			
			Если УстанавливаемоеЗначение = Истина Тогда
				КоличествоДокументов = КоличествоДокументов + 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьНадписьОКоличествеДокументов();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОтметкаДоступна(СтрокаДерева, РазрешитьОтметкуСуществующихДокументов, ИмяКолонкиДокСсылка)
	
	Если ЗначениеЗаполнено(СтрокаДерева[ИмяКолонкиДокСсылка]) Тогда
		Результат = РазрешитьОтметкуСуществующихДокументов;
	Иначе
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьПредставлениеВидаДокументов(ВидДокумента)
	
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		Элем = Параметры["СинонимыВидовДокументов"].НайтиПоЗначению(ВидДокумента);
		
		Если Элем = Неопределено Тогда
			ПредставлениеВидаДокументов = ВидДокумента;
		Иначе
			ПредставлениеВидаДокументов = Элем.Представление;
		КонецЕсли;
	Иначе
		ПредставлениеВидаДокументов = "-";
	КонецЕсли;
	
	Возврат ПредставлениеВидаДокументов;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьНадписьОКоличествеДокументов()
	
	МассивЕдИзмДокументов = Новый Массив();
	МассивЕдИзмДокументов.Добавить(НСтр("ru='документ'")); // 1 документ
	МассивЕдИзмДокументов.Добавить(НСтр("ru='документа'")); // 2 документа
	МассивЕдИзмДокументов.Добавить(НСтр("ru='документов'")); // 5 документов
	
	МассивКоличествоДокументовНадпись = Новый Массив();
	МассивКоличествоДокументовНадпись.Добавить(НСтр("ru='%1 будет создан'")); // 1 (документ) будет создан
	МассивКоличествоДокументовНадпись.Добавить(НСтр("ru='%1 будет создано'")); // 2 (документа) будет создано
	МассивКоличествоДокументовНадпись.Добавить(НСтр("ru='%1 будет создано'")); // 5 (документов) будет создано
	
	Индекс = ПредметИсчисленияПрописьюИндекс(КоличествоДокументов);
	
	КоличествоДокументовНадпись = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		МассивКоличествоДокументовНадпись[Индекс],
		МассивЕдИзмДокументов[Индекс]);
		
КонецПроцедуры

&НаКлиенте
Функция ПредметИсчисленияПрописьюИндекс(Знач Число)
	
	Если Число >= 100 Тогда
		Число = Число - Цел(Число / 100)*100;
	КонецЕсли;
	
	Если Число > 20 Тогда
		Число = Число - Цел(Число/10)*10;
	КонецЕсли;
	
	Если Число = 1 Тогда
		Результат = 0
	ИначеЕсли Число > 1 И Число < 5 Тогда
		Результат = 1
	Иначе
		Результат = 2
	КонецЕсли;
	
	Возврат Результат;	
	
КонецФункции

#КонецОбласти
