/////////////////////////////////////////////////////////////////////////////////
// ПЛАТЕЖНО-РАСЧЕТНЫЕ ДОКУМЕНТЫ, ПРОЦЕДУРЫ И ФУНКЦИИ ПОВТОРНОГО ИСПОЛЬЗОВАНИЯ  //
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьСвойстваЛицевогоСчета(ЛицевойСчет, Дата = Неопределено, СоставДанных = Неопределено) Экспорт
	Возврат Справочники.ЛицевыеСчета.ПолучитьСвойстваЛицевогоСчета(ЛицевойСчет, Дата, СоставДанных);
КонецФункции	

// Возвращает массив, содержащий ссылки на элементы справочника Казначейства
// или Банки для заданного лицевого счета
//
// Параметры:
//	ЛицевойСчет (СправочникСсылка.ЛицевыеСчета)
//
Функция ПолучитьКазначействаЛицевогоСчета(ЛицевойСчет) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЛицевойСчет);
	Запрос.Текст = "
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеквизитыЛицевыхСчетов.КассовыйОрган.Ссылка КАК ОФК
	|ИЗ
	|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|ГДЕ
	|	РеквизитыЛицевыхСчетов.Владелец.Ссылка = &Ссылка
	|";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОФК");
	
КонецФункции	

// Возвращает массив, содержащий ссылки на элементы справочника Лицевые счета для выбранной Организации
//
// Параметры:
//	Организация (СправочникСсылка.Организации)
//
Функция ПолучитьЛицевыеСчетаОрганизации(Организация) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Организация);
	Запрос.Текст = "
    |ВЫБРАТЬ 
	|	ЛицевыеСчета.Ссылка КАК ЛС
	|ИЗ
	|	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|ГДЕ
	|	ЛицевыеСчета.Владелец.Ссылка = &Ссылка
	|";
		
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЛС");
	
КонецФункции	

// Возвращает массив, содержащий ссылки на кассовые органы (казначейства или банки),
// в которых организации открыты счета
Функция ПолучитьКассовыеОрганыОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	 |	РеквизитыЛицевыхСчетов.КассовыйОрган КАК КассовыйОрган
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ЛицевыеСчета.Ссылка КАК Ссылка
	 |	ИЗ
	 |		Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	 |	ГДЕ
	 |		ЛицевыеСчета.Владелец = &Владелец) КАК ВложенныйЗапрос
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	 |		ПО (РеквизитыЛицевыхСчетов.Владелец = ВложенныйЗапрос.Ссылка)
	 |ГДЕ
	 |	НЕ РеквизитыЛицевыхСчетов.КассовыйОрган = ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)
	 |	И НЕ РеквизитыЛицевыхСчетов.КассовыйОрган = ЗНАЧЕНИЕ(Справочник.Казначейства.ПустаяСсылка)");
	 
	 Запрос.УстановитьПараметр("Владелец", Организация);
	 
	 Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КассовыйОрган");
	
КонецФункции	


// Возвращает массив налоговых реквизитов документа
//	ЗаявкаНаКассовыйРасход
//	ЗаявкаНаКассовыйРасходСокращенная
Функция ПолучитьСписокНалоговыхРеквизитов() экспорт
	Результат = Новый Массив;
	Результат.Добавить("СтатусСоставителя");					
	Результат.Добавить("КодБКНалога");					
	Результат.Добавить("КодОКАТО");			
	Результат.Добавить("ПоказательОснования");				
	Результат.Добавить("ПоказательПериода");				
	Результат.Добавить("ПоказательНомера");				
	Результат.Добавить("ПоказательДаты");			
	Результат.Добавить("ПоказательТипа");
	возврат  Результат;
КонецФункции	

Функция ДопустимыеКФО(ИсточникСредств = Неопределено, ЛицевойСчет) экспорт
	
	Если ИсточникСредств = Неопределено Тогда
		ИсточникСредств = ПредопределенноеЗначение("Справочник.ИсточникиСредств.ПустаяСсылка");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазделыЛицевыхСчетовДопустимыеКФО.КФО КАК КФО
	|ИЗ
	|	Справочник.РазделыЛицевыхСчетов.ДопустимыеКФО КАК РазделыЛицевыхСчетовДопустимыеКФО
	|ГДЕ
	|	(РазделыЛицевыхСчетовДопустимыеКФО.Ссылка.ИсточникСредств = &ИсточникСредств
	|			ИЛИ &ИсточникСредств = ЗНАЧЕНИЕ(Справочник.ИсточникиСредств.ПустаяСсылка))
	|	И РазделыЛицевыхСчетовДопустимыеКФО.Ссылка.Владелец = &ЛицевойСчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	РазделыЛицевыхСчетовДопустимыеКФО.КФО.Порядок";
	
	Запрос.УстановитьПараметр("ИсточникСредств",ИсточникСредств);
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КФО");
	
КонецФункции

Функция ДопустимыеИсточникиСредств(ЛицевойСчет,КФО = Неопределено) экспорт
	
	Если КФО = Неопределено Тогда
		КФО = ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазделыЛицевыхСчетовДопустимыеКФО.Ссылка.ИсточникСредств КАК ИС
	|ИЗ
	|	Справочник.РазделыЛицевыхСчетов.ДопустимыеКФО КАК РазделыЛицевыхСчетовДопустимыеКФО
	|ГДЕ
	|	РазделыЛицевыхСчетовДопустимыеКФО.Ссылка.Владелец = &ЛС
	|   И НЕ РазделыЛицевыхСчетовДопустимыеКФО.Ссылка.ПометкаУдаления 
	|	И (РазделыЛицевыхСчетовДопустимыеКФО.КФО = &КФО
	|			ИЛИ &КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка))";
	
	Запрос.УстановитьПараметр("ЛС",ЛицевойСчет);
	Запрос.УстановитьПараметр("КФО",КФО);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИС");
	
КонецФункции

//  Возвращает Казначейство и ЛицевойСчет по Реквизиту лицевого счета
//	Входящие параметры:	РеквизитЛС - справочник РеквизитыЛицевыхСчетов
//	Исходящие параметры: Структура
Функция ПолучитьЛицевойСчетОрганКазначейства(РеквизитЛС) экспорт
	Возврат Новый Структура("Лицевойсчет,Казначейство",РеквизитЛС.Владелец,РеквизитЛС.КассовыйОрган)
КонецФункции

//     Процедура возвращает должность сотрудника 
//   Входящие параметры:  Сотрудник - ссылка справочника сотрудники
//						  ПечататьДолжность - булево
//						  Дата - дата, дана на которую нужно получить должность
//   
Функция ПолучитьДолжностьСотрудника(Сотрудник, ПечататьДолжность, Дата) Экспорт
	Если ЗначениеЗаполнено(Сотрудник) и ПечататьДолжность ТОгда
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект,Период,Должность", Сотрудник,Дата);	
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
		Должность = ДанныеСотрудника.Должность;
	Иначе
		Должность = "";
	КонецЕсли;
	Возврат Должность;
КонецФункции

////////////////////////////////////////////////////////////////////
//			Процедуры работы справвояника "Шаблоны "Назначения платежа"
//  
Функция ПолучитьОбслуживаемыеОбъектыМетаданных() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Документы.ПлатежноеПоручение);
	Результат.Добавить(Метаданные.Документы.ЗаявкаНаКассовыйРасход);
	Результат.Добавить(Метаданные.Документы.ЗаявкаНаКассовыйРасходСокращенная);
	Результат.Добавить(Метаданные.Документы.ИнкассовоеПоручение);
	Результат.Добавить(Метаданные.Документы.ПлатежноеТребование);
	Результат.Добавить(Метаданные.Документы.Аккредитив);
	Результат.Добавить(Метаданные.Документы.ОбъявлениеНаВзносНаличными);
	Результат.Добавить(Метаданные.Документы.СводнаяЗаявкаНаКассовыйРасход);

	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////
//			Процедуры журнала "Платежно расчетные документы"
Функция ПолучитьСписокТиповЗаявок() экспорт
	СписокТипов = Новый СписокЗначений();
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаявкаНаВозврат"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаявкаНаКассовыйРасходСокращенная"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗаявкаНаНаличные"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ЗапросНаАннулированиеЗаявки"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ПлатежноеПоручение"));
	Возврат СписокТипов;
КонецФункции	

Функция ПолучитьСписокТиповПоступлений() экспорт
	СписокТипов = Новый СписокЗначений();
	СписокТипов.Добавить(Тип("ДокументСсылка.КассовоеПоступление"));
	Возврат СписокТипов;
КонецФункции	

//Устарела. Не используется. Следует использовать УчетНДСКлиентСервер.ЗначениеСтавкиНДС.
// В модуле УчетНДС есть ссылка на НСИ пока вынесу сюда
// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат 20;

	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат 10;

	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 ИЛИ СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат 18;

	КонецЕсли;

	Возврат 0;

КонецФункции // ПолучитьСтавкуНДС()

/////////////////////////////////////////////////////////////////////
// ЗАПОЛНЕНИЕ НАЛОГОВЫХ РЕКВИЗИТОВ
//

Функция ОснованиеПлатежаДляНалогов() Экспорт
	
	ОснованиеПлатежаНалоги = Новый СписокЗначений;
	
	ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.ТП);  // "ТП" - платежи текущего года;
	ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.ЗД);  // "ЗД" - добровольное погашение задолженности по истекшим налоговым периодам при отсутствии требования об уплате налогов (сборов) от налогового органа;
    ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.ТР);  // "ТР" - погашение задолженности по требованию налогового органа об уплате налогов (сборов);
	ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.РС);  // "РС" - погашение рассроченной задолженности;
    ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.ОТ);  // "ОТ" - погашение отсроченной задолженности;
	ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.РТ);  // "РТ" - погашение реструктурируемой задолженности;
    ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.ВУ);  // "ВУ" - погашение отсроченной задолженности в связи с введением внешнего управления;
    ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.ПР);  // "ПР" - погашение задолженности, приостановленной к взысканию;
    ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.АП);  // "АП" - погашение задолженности по акту проверки;
    ОснованиеПлатежаНалоги.Добавить(Перечисления.ОснованияПлатежа.АР);  // "АР" - погашение задолженности по исполнительному документу.

	Возврат ОснованиеПлатежаНалоги;
	
КонецФункции	

Функция ОснованиеПлатежаДляТаможни() Экспорт
	
	ОснованиеПлатежаТаможня = Новый СписокЗначений;
	
	ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.ДЕ);  // "ДЕ" - таможенная декларация;
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.ПО);  // "ПО" - таможенный приходный ордер;
	ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.КВ);  // "КВ" - постановление-квитанция (при уплате штрафа);
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.КТ);  // "КТ" - форма корректировки таможенной стоимости и таможенных платежей;
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.ИД);  // "ИД" - исполнительный документ;
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.ИП);  // "ИП" - инкассовое поручение;
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.ТУ);  // "ТУ" - требование об уплате таможенных платежей;
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.БД);  // "БД" - документы бухгалтерских служб таможенных органов;
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.ИН);  // "ИН" - документ инкассации;
    ОснованиеПлатежаТаможня.Добавить(Перечисления.ОснованияПлатежа.КП);  // "КП" - соглашение о взаимодействии при уплате крупными плательщиками суммарных платежей в централизованном порядке.
	
	Возврат ОснованиеПлатежаТаможня;
	
КонецФункции

///////////////////////////////////////////////////////////////////
//		ДАННЫЕ ПО СОТРУДНИКУ ДЛЯ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ
//
Функция ПолучитьДанныеСотрудника(Сотрудник,Дата) экспорт
	
	РеквизитыСотрудника = Новый Структура("Фамилия,Имя,Отчество,ВидДокумента,Серия,Номер,ДатаВыдачи,КемВыдан,КодПодразделения,Должность,ПолучитьОтКого,ВыдатьКому");
	
	Если ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") тогда
		Возврат РеквизитыСотрудника;
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(Дата) тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ФИО.Фамилия КАК Фамилия,
	               |	ФИО.Имя КАК Имя,
	               |	ФИО.Отчество КАК Отчество,
	               |	ДокументыФизЛиц.ВидДокумента КАК ВидДокумента,
	               |	ДокументыФизЛиц.Серия КАК Серия,
	               |	ДокументыФизЛиц.Номер КАК Номер,
	               |	ДокументыФизЛиц.ДатаВыдачи КАК ДатаВыдачи,
	               |	ДокументыФизЛиц.КемВыдан КАК КемВыдан,
	               |	ДокументыФизЛиц.КодПодразделения КАК КодПодразделения,
	               |	ДанныеСотрудников.Должность КАК Должность,
	               |	Сотрудники.Контрагент.НаименованиеРП КАК ПолучитьОтКого,
	               |	Сотрудники.Контрагент.НаименованиеДП КАК ВыдатьКому
	               |ИЗ
	               |	Справочник.Сотрудники КАК Сотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&Дата, ) КАК ФИО
	               |		ПО Сотрудники.Контрагент.ЮридическоеФизическоеЛицо = ФИО.ФизическоеЛицо
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников.СрезПоследних(&Дата, ) КАК ДанныеСотрудников
	               |		ПО Сотрудники.Ссылка = ДанныеСотрудников.Сотрудник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Дата, ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ)) КАК ДокументыФизЛиц
	               |		ПО Сотрудники.Контрагент.ЮридическоеФизическоеЛицо = ДокументыФизЛиц.Физлицо
	               |ГДЕ
	               |	Сотрудники.Ссылка = &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",Сотрудник);
	Запрос.УстановитьПараметр("Дата",Дата);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Для каждого КлючЗначение из РеквизитыСотрудника Цикл
		ТекРеквизит = КлючЗначение.Ключ;
		РеквизитыСотрудника.Вставить(ТекРеквизит, Выборка[ТекРеквизит]);
	КонецЦикла;	
	
	Возврат РеквизитыСотрудника;
	
КонецФункции	

функция ПолучитьУчетнуюПолитикуОрганизации(Организация,Дата = неопределено) экспорт
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(Организация,Дата);
		
	Для каждого Ресурс из Метаданные.РегистрыСведений.УчетнаяПолитикаОрганизаций.Ресурсы цикл
		Если Ресурс.Тип.СодержитТип(Тип("Булево")) тогда 
			Значение = Неопределено;
			УчетнаяПолитика.Свойство(Ресурс.Имя,Значение);
			УчетнаяПолитика.Вставить(Ресурс.Имя,?(Значение = Неопределено,Ложь,Значение));
		КонецЕсли;	
	КонецЦикла;	
		
	УчетнаяПолитика.Вставить("РБСКакПБС", 		УчетнаяПолитика.ПолномочияРБС);
	УчетнаяПолитика.Вставить("АИФКакГАИФ", 		УчетнаяПолитика.ПолномочияГАИВФ ИЛИ УчетнаяПолитика.ПолномочияГАИВнФ);
		
	ДополнительныеРеквизиты	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Распорядитель,КодПоППП");
	
	Для каждого КлючЗначение из ДополнительныеРеквизиты Цикл
		УчетнаяПолитика.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;	
	
	Возврат УчетнаяПолитика; 
	
КонецФункции	

// Формирует список ссылок на объекты из строки кодов, разделенных запятыми
//
// Параметры:
//	ВидОбъекта (Строка). Строка типа объекта для запроса. Например, "Справочник.КБК"
//	СтрокаОбъектов (Строка). Строка кодов объектов, разделенных запятыми
//
// Возвращает массив ссылок на объекты
Функция СформироватьСписокСсылокПоКодуОбъекта(ВидОбъекта, СтрокаОбъектов, ВключатьПодчиненные = Ложь) Экспорт
	ВыбранныеЗначения = Новый СписокЗначений;
	ВыбранныеЗначения.ЗагрузитьЗначения(ПлатежноРасчетныеДокументы.СформироватьСписокСсылокПоКодуОбъекта(ВидОбъекта, СтрокаОбъектов, ВключатьПодчиненные));
	Возврат ВыбранныеЗначения;
КонецФункции


#КонецОбласти
	

