
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Картинки = Новый Соответствие;
	Картинки.Вставить("Справочинк", БиблиотекаКартинок.СправочникОбъект);
	Картинки.Вставить("Документ",   БиблиотекаКартинок.ДокументОбъект);
	
	Макет = Справочники.ШаблоныЗаполненияНПКвитанцииНаОплату.ПолучитьМакет("HTMLТекстШаблона");
	
	текстШаблона = Макет.ПолучитьТекст();
	
	ПлатежноРасчетныеДокументы.ИнициализироватьДоступныеПоля("КвитанцияНаОплатуГосуслуг",ДоступныеПоля);	
	Массив = Новый Массив;
	
	Для Каждого ТекЭлемент Из ДоступныеПоля.ПолучитьЭлементы() Цикл
		Если ТекЭлемент.Таблица Тогда
			Массив.Добавить(ТекЭлемент);
		КонецЕсли;
	КонецЦикла;
	
	ЭлементыДП = ДоступныеПоля.ПолучитьЭлементы();
	
	Для Каждого ЭлМас Из Массив Цикл
		ЭлементыДП.Удалить(ЭлМас);
	КонецЦикла;
	
	Элементы.СтраницыВидов.ТекущаяСтраница = ?(Объект.РасширенныйШаблон,Элементы.ШаблонСКД,Элементы.ШаблонТЧ);
	Элементы.ФормаЗаполнитьПримером.Видимость = Объект.РасширенныйШаблон;
	
	Если Объект.Последовательность.Количество() Тогда
		ТекущаяСтрока = 1;//выделение первого элемента в шаблоне
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЭлементНазначенияПлатежаКвитанция" Тогда
		Если Параметр.ЭтоНоваяСтрока тогда
			НоваяСтрока = Объект.Последовательность.Добавить();
		Иначе	
			НоваяСтрока = Объект.Последовательность.Получить(Параметр.НомерСтроки);
		КонецЕсли;	
		Если Параметр.Свойство("АдресВХранилище") Тогда
			ЗагрузитьДопПоля(Параметр.АдресВХранилище);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметр);
		Если Параметр.УдаленоДопПоле Тогда
			//Необходима проверка на то, что в шаблоне нет ссылок на реквизиты удаленного дополнительного реквизита
			ПроверитьНаличиеСсылокНаУдаленныеДопРеквизиты();
		КонецЕсли;	

		ЭтаФорма.Модифицированность = Истина;
		ОтрисоватьШаблон(НоваяСтрока.НомерСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.РасширенныйШаблон И НЕ ЗначениеЗаполнено(Объект.Выражение) Тогда
		Текст = Нстр("ru='Не заполнено выражение для формирования назначения платежа'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура текстШаблонаДокументСформирован(Элемент)
	Если (Элемент.Документ <> неопределено) и  (Элемент.Документ.readyState = "complete")тогда
		ОтрисоватьШаблон(ТекущаяСтрока);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура текстШаблонаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Если ДанныеСобытия.Element.id <> "" Тогда
		Попытка
			ТекущаяСтрока = Число(ДанныеСобытия.Element.id); //-1
		Исключение
			ТекущаяСтрока = Объект.Последовательность.Количество() - 1;
		КонецПопытки;
		ОтрисоватьШаблон(ТекущаяСтрока);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляДопРеквизитовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	// Определить перетаскиваемое поле
	ПолеРеквизита = ДоступныеПоля.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
			
	ПараметрыПеретаскивания.Значение = "Объект."+ПолеРеквизита.ПутьКДанным;

КонецПроцедуры

&НаКлиенте
Процедура РасширенныйШаблонПриИзменении(Элемент)
	Элементы.СтраницыВидов.ТекущаяСтраница = ?(Объект.РасширенныйШаблон,Элементы.ШаблонСКД,Элементы.ШаблонТЧ);
	Элементы.ФормаЗаполнитьПримером.Видимость = Объект.РасширенныйШаблон;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Добавить(Команда)
	ТекущаяСтрока = Объект.Последовательность.Количество()+1;
	ВызватьФормуРедактированияДляHTML(Истина,ТекущаяСтрока-1); 
	ОтрисоватьШаблон(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	Если ТекущаяСтрока - 1 >= 0 тогда
		ВызватьФормуРедактированияДляHTML(Ложь,ТекущаяСтрока-1); 
		ОтрисоватьШаблон(ТекущаяСтрока);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Если (Объект.Последовательность.Количество() >= ТекущаяСтрока) и (ТекущаяСтрока > 0)тогда
		Объект.Последовательность.Удалить(ТекущаяСтрока-1);
		СтароеНачало = 0;
		ТекущаяСтрока = 0;
		ОтрисоватьШаблон(ТекущаяСтрока);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеПлюс(Команда)
	Если (ТекущаяСтрока > 0) и (ТекущаяСтрока < Объект.Последовательность.Количество())тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока-1,1);
		ТекущаяСтрока = ТекущаяСтрока +1;
		ОтрисоватьШаблон(ТекущаяСтрока);
	ИначеЕсли (ТекущаяСтрока > 0) и (ТекущаяСтрока = Объект.Последовательность.Количество()) тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока-1, - (Объект.Последовательность.Количество()-1));
		ТекущаяСтрока = 1;
		ОтрисоватьШаблон(ТекущаяСтрока);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеМинус(Команда)
	Если (ТекущаяСтрока > 1)тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока-1,-1);
		ТекущаяСтрока = ТекущаяСтрока -1;
		ОтрисоватьШаблон(ТекущаяСтрока);
	ИначеЕсли ТекущаяСтрока = 1  тогда
		Объект.Последовательность.Сдвинуть(ТекущаяСтрока-1, Объект.Последовательность.Количество()-1);
		ТекущаяСтрока = Объект.Последовательность.Количество();
		ОтрисоватьШаблон(ТекущаяСтрока);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Пример(Команда)
	
	Если Объект.Последовательность.Количество() > 0 тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПримерЗавершение", ЭтотОбъект), НСтр("ru='Текущий шаблон будет очищен. Продолжить?'"),РежимДиалогаВопрос.ДаНет);
	Иначе	
		ЗаполнитьШаблонПримером();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстШаблонаДляКопирования(Команда)
	
	ПараметрыТекстШаблона = Новый Структура;
	ПараметрыТекстШаблона.Вставить("ТекстШаблонаДляЭкспорта", ТекстШаблонаДляЭкспорта());
	ПараметрыТекстШаблона.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	Оповещение = Новый ОписаниеОповещения("ТекстШаблонаДляКопированияЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ШаблоныЗаполненияНПКвитанцииНаОплату.Форма.ФормаТекстШаблонаДляКопирования",
		ПараметрыТекстШаблона, ЭтотОбъект, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(ОписаниеОповещения, "", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьВФайлЗавершение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПодключитьРасширениеДляРаботыСФайлами(ОписаниеОповещения, "", Ложь);
	
КонецПроцедуры

&НаКлиенте                                           
Процедура ДобавитьПолеВВыражение(Команда)
	ТекДанные = Элементы.ДоступныеПоляДопРеквизитов.ТекущиеДанные;
	Если ТекДанные=Неопределено Тогда                                 
		Возврат;
	КонецЕсли;
	ПутьКДанным	= "Объект."+ТекДанные.ПутьКДанным;
	Объект.Выражение = Объект.Выражение + ПутьКДанным;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПримеромПоГруппе(Команда)
	Объект.Выражение = "Выбор 
	|Когда ЭтоДокументРП(Объект.ДокументОснование) 
	|Тогда
	|	Выбор Когда Объект.ДокументОснование.РодительскаяПлатаДопУслуги = 0 Тогда
	|		""Оплата за присмотр и уход ""+Строка(Объект.Учащийся)+"" от ""+Формат(Объект.Дата,""ДЛФ='DD'"")+"" НДС не облагается."" 
	|	Иначе
	|		""Платные образовательные услуги. ""+Строка(Объект.Учащийся)+"", ""+Строка(Объект.ГруппаДетскогоУчреждения)+ "" от ""+Формат(Объект.Дата,""ДЛФ='DD'"")+"" НДС не облагается.""
	|	Конец
	|Иначе
	|	""Оплата за "" + Объект.Номенклатура.НаименованиеПолное + ""."" + 
	|	Выбор Когда ЗначениеЗаполнено(Объект.СтавкаНДС) 
	|		И Объект.СтавкаНДС<>Значение(Перечисление.СтавкиНДС.НДС0)
	|		И Объект.СтавкаНДС<>Значение(Перечисление.СтавкиНДС.БезНДС)
	|	Тогда "" В т.ч. НДС (""+Строка(ПолучитьСтавкуНДС(Объект.СтавкаНДС))+""%) ""+Формат(Объект.СуммаНДС,""ЧЦ=15; ЧДЦ=2; ЧРД=-"")
	|	Иначе "" НДС не облагается.""
	|	Конец
	|Конец";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПримеромОбщим(Команда)
	Объект.Выражение = """Оплата за "" + Объект.Номенклатура.НаименованиеПолное + ""."" + 
	|Выбор Когда ЗначениеЗаполнено(Объект.СтавкаНДС) 
	|	И Объект.СтавкаНДС<>Значение(Перечисление.СтавкиНДС.НДС0)
	|	И Объект.СтавкаНДС<>Значение(Перечисление.СтавкиНДС.БезНДС)
	|Тогда "" В т.ч. НДС (""+Строка(ПолучитьСтавкуНДС(Объект.СтавкаНДС))+""%) ""+Формат(Объект.СуммаНДС,""ЧЦ=15; ЧДЦ=2; ЧРД=-"")
	|Иначе "" НДС не облагается.""
	|Конец";
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ПримерЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Да тогда
        Объект.Последовательность.Очистить();
        ЗаполнитьШаблонПримером();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТекстШаблонаДляКопированияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	Попытка
		ЗаполнитьШаблонИзТекста(Результат);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка распознования текста шаблона'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
 		ОтрисоватьШаблон(0);
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ЗаполнитьШаблонПримером()
	
	НоваяСтрока = Объект.Последовательность.Добавить();
	НоваяСтрока.ПредставлениеПример = Нстр("ru='Оплата за '");
	
	НоваяСтрока = Объект.Последовательность.Добавить();
	НоваяСтрока.ЭтоПутьКДанным = Истина;
	НоваяСтрока.Данные = "Ссылка.Номенклатура.НаименованиеПолное";
	НоваяСтрока.ПредставлениеПример = Нстр("ru='[Наименование полное]'");
	
	НоваяСтрока = Объект.Последовательность.Добавить();
	НоваяСтрока.ПредставлениеПример = Нстр("ru='. '");
	
	НоваяСтрока = Объект.Последовательность.Добавить();
	НоваяСтрока.ПредставлениеПример = Нстр("ru='[Сумма НДС]'");
	НоваяСтрока.Данные = "Ссылка.СуммаНДС";
	НоваяСтрока.ЭтоПутьКДанным = Истина;
	НоваяСтрока.Формат = "Текст1=В т.ч. НДС (
						|Ставка
						|Текст2=). 
						|Сумма=ЧЦ=15; ЧДЦ=2; ЧРД=-
						|ТекстБезНДС=НДС не облагается.";	
	ОтрисоватьШаблон(0)
КонецПроцедуры	

&НаКлиенте
Процедура ВызватьФормуРедактированияДляHTML(НоваяСтрока = ложь,НомерСтроки = 0) 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОбъектМетаданных","КвитанцияНаОплатуГосуслуг");
	СтруктураПараметров.Вставить("НоваяСтрока",НоваяСтрока);
	СтруктураПараметров.Вставить("НомерСтроки",НомерСтроки);
	
	Если Не НоваяСтрока Тогда
		СтруктураПараметров.Вставить("ЭтоПутьКДанным",Объект.Последовательность.Получить(НомерСтроки).ЭтоПутьКДанным);
		СтруктураПараметров.Вставить("Данные",Объект.Последовательность.Получить(НомерСтроки).Данные);
		СтруктураПараметров.Вставить("ПредставлениеПример",Объект.Последовательность.Получить(НомерСтроки).ПредставлениеПример);
		СтруктураПараметров.Вставить("ЭтоДополнительноеПоле",Объект.Последовательность.Получить(НомерСтроки).ЭтоДополнительноеПоле);
		СтруктураПараметров.Вставить("Формат",Объект.Последовательность.Получить(НомерСтроки).Формат);
		СтруктураПараметров.Вставить("ИмяТаблицы",Объект.Последовательность.Получить(НомерСтроки).ИмяТаблицы);
		СтруктураПараметров.Вставить("КлючУсловнойЧасти",Объект.Последовательность.Получить(НомерСтроки).КлючУсловнойЧасти);
	КонецЕсли;	
	
	ОткрытьФорму("Справочник.ШаблоныЗаполненияНПКвитанцииНаОплату.Форма.ФормаВвода", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры
    
&НаКлиенте
Функция Док()
	Возврат Элементы.текстШаблона.Документ;
КонецФункции	

&НаКлиенте
Процедура ДобавитьУзлы(Док,ТекУзел,ТекСтрока)
	ТекущаяПозиция = 0;
	Для каждого Строка из  Объект.Последовательность цикл
		ТекущаяПозиция = ТекущаяПозиция + 1;
		Узел = Док.createElement("SPAN");
		Узел.dataFld = Строка.Данные;
		Если Строка.ЭтоПутьКДанным и (ТекСтрока <> ТекущаяПозиция) тогда
			Узел.className = "fieldReference";
		КонецЕсли;	
		Если Строка.ЭтоДополнительноеПоле и (ТекСтрока <> ТекущаяПозиция)тогда
			Узел.className = "addPart";
		КонецЕсли;	
		Если Строка.КлючУсловнойЧасти и (ТекСтрока <> ТекущаяПозиция)тогда
			Узел.className = "conditionalPart";
		КонецЕсли;	
		
		Если ТекСтрока = ТекущаяПозиция тогда
			Узел.className = "selectPart";		
		КонецЕсли;	
		Если Строка.ЭтоПутьКДанным тогда
			Узел.contentEditable = "false";
		КонецЕсли;	
		Узел.id = Строка.НомерСтроки;
		Если Строка.ЭтоПутьКДанным = Ложь Тогда
			Узел.title = """"+Строка.ПредставлениеПример+"""";
			Узел.innerText = """"+Строка.ПредставлениеПример+"""";
		Иначе
			Узел.title = Строка.ПредставлениеПример;
			Узел.innerText = Строка.ПредставлениеПример;
		КонецЕсли;
		
		ТекУзел.appendChild(Узел);
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьДочерниеУзлы(Узел)
	Если Узел.lastChild = Неопределено 
		ИЛИ Узел.children = Неопределено тогда
		Возврат;
	КонецЕсли;	
	УдалитьДочерниеУзлы(Узел.lastChild);
	Узел.parentNode.removeChild(Узел);	
КонецПроцедуры	

&НаКлиенте
Процедура ОтрисоватьШаблон(НомерСтроки)
	Док = Док();
	МастерУзел = Док().getElementById("templateContainer");
	КонтрольныйУзел = Док().getElementById("deldef");
	Если КонтрольныйУзел.childNodes.length = 0 тогда
		ДобавитьУзлы(Док,КонтрольныйУзел,0);
		СтароеНачало = НомерСтроки;
	Иначе
		УдалитьДочерниеУзлы(КонтрольныйУзел);
		Узел = Док.createElement("DIV");
		Узел.id = "deldef";
		МастерУзел.appendChild(Узел);
		КонтрольныйУзел    = Док().getElementById("deldef");
		ДобавитьУзлы(Док,КонтрольныйУзел,НомерСтроки)	
	КонецЕсли;	
	
КонецПРоцедуры	

&НаСервере
Процедура ПроверитьНаличиеСсылокНаУдаленныеДопРеквизиты()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Имя КАК Имя
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.Ссылка В(&СсылкиИОМ)";

	Запрос.УстановитьПараметр("СсылкиИОМ", Объект.ДополнительныеПоля.Выгрузить().ВыгрузитьКолонку("ИдентификаторПоля"));

	Результат = Запрос.Выполнить();

	МассивИмен = Результат.Выгрузить().ВыгрузитьКолонку("Имя");

	МассивДопПолей = Объект.Последовательность.НайтиСтроки(Новый Структура("ЭтоДополнительноеПоле",Истина));
	
	МассивКУдалению = Новый Массив;
	
	Для Каждого ЭлМас Из МассивДопПолей Цикл
		ИмяПроверяемое = Сред(ЭлМас.Данные,16);
		ПозицияТочки = Найти(ИмяПроверяемое,".");
		Если ПозицияТочки <> 0 Тогда
			ИмяПроверяемое = Лев(ИмяПроверяемое,ПозицияТочки-1);
		КонецЕсли;
		Если МассивИмен.Найти(ИмяПроверяемое) = Неопределено Тогда
			МассивКУдалению.Добавить(ЭлМас);
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого ЭлМас Из МассивКУдалению Цикл
		Объект.Последовательность.Удалить(ЭлМас);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДопПоля(АдресВХранилище)
	
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		ТаблицаИзХранилища = ПолучитьИзВременногоХранилища(АдресВХранилище);
		Объект.ДополнительныеПоля.Загрузить(ТаблицаИзХранилища);
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(ПодключеноРасширениеРаботыСФайлами, ДополнительныеПараметры) Экспорт
	
	Если ПодключеноРасширениеРаботыСФайлами Тогда
		ВыбратьФайлИЗагрузитьТекстШаблонаАсинх();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайлЗавершение(ПодключеноРасширениеРаботыСФайлами, ДополнительныеПараметры) Экспорт
	
	Если ПодключеноРасширениеРаботыСФайлами Тогда
		ВыбратьФайлИСохранитьТекстШаблонаАсинх();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлИЗагрузитьТекстШаблонаАсинх()
	
	Если Объект.Последовательность.Количество() > 0 тогда
		ТекстВопроса = НСтр("ru = 'Текущий шаблон будет очищен. Продолжить?'");
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр                      = НСтр("ru = 'Текстовый файл'") + " (*.txt)|*.txt";
	ДиалогВыбора.Заголовок                   = НСтр("ru = 'Выберите файл с текстом шаблона'");
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.Расширение                  = "txt";
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	ВыбранныеФайлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ПрочитатьТекстШаблонаИзФайлаАсинх(ВыбранныеФайлы[0]);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПрочитатьТекстШаблонаИзФайлаАсинх(ИмяФайла)

	ТекстШаблонаДляФайла = Новый ТекстовыйДокумент;
	Ждать ТекстШаблонаДляФайла.ПрочитатьАсинх(ИмяФайла);
	
	ТекстШаблонаДляЭкспорта = ТекстШаблонаДляФайла.ПолучитьТекст();
	
	Попытка
		ЗаполнитьШаблонИзТекста(ТекстШаблонаДляЭкспорта);
	Исключение
		ТекстСообщения = НСтр("ru = 'Ошибка распознования текста шаблона'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
 		ОтрисоватьШаблон(0);
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШаблонИзТекста(ТекстШаблонаДляЭкспорта)

	Если Объект.Последовательность.Количество() > 0 тогда
		Объект.Последовательность.Очистить();
	КонецЕсли;

	Модифицированность = Истина;
	
	Если ПустаяСтрока(ТекстШаблонаДляЭкспорта) Тогда
	 	ОтрисоватьШаблон(0);
		Возврат;
	КонецЕсли;
	
	ПоследовательностьКакМассив = ПрочитатьЗначениеJSON(ТекстШаблонаДляЭкспорта);
	
	Для каждого Строка Из ПоследовательностьКакМассив Цикл
		НоваяСтрока = Объект.Последовательность.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);	
	КонецЦикла;
	
 	ОтрисоватьШаблон(0);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлИСохранитьТекстШаблонаАсинх()
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбора.Фильтр                      = НСтр("ru = 'Текстовый файл'") + " (*.txt)|*.txt";
	ДиалогВыбора.Заголовок                   = НСтр("ru = 'Выберите файл для сохранения текста шаблона'");
	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.Расширение                  = "txt";
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПолноеИмяФайла              = СтрШаблон(НСтр("ru = '%1.txt'"), СокрЛП(Объект.Наименование));
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	ВыбранныеФайлы = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ТекстШаблонаДляФайла = Новый ТекстовыйДокумент;
		ТекстШаблонаДляФайла.УстановитьТекст(ТекстШаблонаДляЭкспорта());
		Ждать ТекстШаблонаДляФайла.ЗаписатьАсинх(ВыбранныеФайлы[0]);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТекстШаблонаДляЭкспорта()
	
	Если Объект.Последовательность.Количество() = 0 Тогда
		Возврат "";	
	КонецЕсли;
	
	СписокКолонок = "КлючУсловнойЧасти,ЭтоДополнительноеПоле,ЭтоПутьКДанным,Данные,Формат,ПредставлениеПример,ИмяТаблицы";
	
	ПоследовательностьКакМассив = ОбщегоНазначения.ТаблицаЗначенийВМассив(
		Объект.Последовательность.Выгрузить(, СписокКолонок));
	
	Возврат ЗаписатьЗначениеJSON(ПоследовательностьКакМассив);

КонецФункции

#КонецОбласти
