#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура очищает неиспользуемые реквизиты.
//
// Параметры:
//	ДокументОбъект - ДокументОбъект - Текущий документ
//	МассивВсехРеквизитов - Массив - Массив всех реквизитов документа, которые необходимо очищать
//	МассивРеквизитовОперации - Массив - Массив реквизитов документа, которые относятся к хозяйственной операции документа
//
Процедура ОчиститьНеиспользуемыеРеквизиты(ДокументОбъект, Знач МассивВсехРеквизитов, Знач МассивРеквизитовОперации) Экспорт
	Перем Номер;
	
	// Удалим из массива реквизиты, относящиеся к хозяйственной операции.
	Для Каждого ЭлементМассива Из МассивРеквизитовОперации Цикл
		Номер = МассивВсехРеквизитов.Найти(ЭлементМассива);
		Если Номер <> Неопределено Тогда
			МассивВсехРеквизитов.Удалить(Номер);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураТабличныхЧастей = Новый Структура;
	
	Для Каждого ЭлементМассива Из МассивВсехРеквизитов Цикл
		
		Позиция = Найти(ЭлементМассива, ".");
		
		// Реквизит табличной части.
		Если Позиция <> 0 Тогда
			ИмяТабличнойЧасти = Лев(ЭлементМассива, Позиция - 1);
			РеквизитыТабличнойЧасти = Неопределено;
			Если Не СтруктураТабличныхЧастей.Свойство(ИмяТабличнойЧасти, РеквизитыТабличнойЧасти) Тогда
				СтруктураТабличныхЧастей.Вставить(ИмяТабличнойЧасти, Новый Массив);
				РеквизитыТабличнойЧасти = СтруктураТабличныхЧастей[ИмяТабличнойЧасти];
			КонецЕсли;
			РеквизитыТабличнойЧасти.Добавить(Сред(ЭлементМассива, Позиция + 1));
			
		// Реквизит шапки.	
		Иначе
			Если ЗначениеЗаполнено(ДокументОбъект[СокрЛП(ЭлементМассива)]) Тогда
				ДокументОбъект[СокрЛП(ЭлементМассива)] = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Очистим необходимые реквизиты табличной части.
	Если СтруктураТабличныхЧастей.Количество() > 0 Тогда
		Для Каждого ТабличнаяЧасть ИЗ СтруктураТабличныхЧастей Цикл
			Для Каждого СтрокаТаблицы Из ДокументОбъект[ТабличнаяЧасть.Ключ] Цикл
				Для Каждого ЭлементМассива Из ТабличнаяЧасть.Значение Цикл
					Если ЗначениеЗаполнено(СтрокаТаблицы[СокрЛП(ЭлементМассива)]) Тогда
						СтрокаТаблицы[СокрЛП(ЭлементМассива)] = Неопределено;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОчиститьНеиспользуемыеРеквизиты()

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Договоры") Тогда
		ПроверитьДопустимостьЗаполненияПоДоговору(ДанныеЗаполнения);
		
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Контрагент");
		Договор = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураРеквизитов);
		Руководитель = ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(Организация, ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"), Дата).ОтветственноеЛицоСсылка; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СтруктураДокумента = Новый Структура;
	Если РаботаСОбязательствами.ЕстьДокументИсполненияРасторжения(Договор, СтруктураДокумента) И СтруктураДокумента.Ссылка <> Ссылка Тогда
		
		ТекстОшибки = НСтр("ru='Для договора %Договор% уже создан документ %Документ%.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Договор);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", СтруктураДокумента.Представление);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Договор",, Отказ);
		
	КонецЕсли;
 
	
	// Очистим реквизиты документа не используемые для вида обязательства
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	
	Документы.ИсполнениеРасторжениеДоговора.ПолучитьМассивыРеквизитов(ЭтоРасторжение, МассивВсехРеквизитов, МассивРеквизитовОперации);
	ОчиститьНеиспользуемыеРеквизиты(ЭтотОбъект, МассивВсехРеквизитов,	МассивРеквизитовОперации);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запись = РегистрыСведений.ХарактеристикиОбязательств.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.Договор = Договор;
	Запись.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.СтатусИсполненияГК;
	Запись.ЗначениеХарактеристики = ?(ЭтоРасторжение, Перечисления.СтатусыИсполненияДоговоров.Аннулирован, Перечисления.СтатусыИсполненияДоговоров.Завершен);
	Запись.АвторИзменения = Пользователи.ТекущийПользователь();
	Запись.Записать();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запись = РегистрыСведений.ХарактеристикиОбязательств.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.Договор = Договор;
	Запись.ВидХарактеристики = ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.СтатусИсполненияГК;
	//Запись.ЗначениеХарактеристики = // не заполняется
	Запись.АвторИзменения = Пользователи.ТекущийПользователь();
	Запись.Записать();
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДопустимостьЗаполненияПоДоговору(Обязательство)
	
	Если НЕ Обязательство.Пустая() Тогда
		Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Обязательство, "ВидДоговора, Наименование, ПометкаУдаления, УчетПредметаДоговора");
		Если Результат.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			
			ТекстОшибки = НСтр("ru='Договор %Договор% должен быть вида ""С поставщиком"". Ввод на основании других видов запрещен.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Результат.Наименование);
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли Результат.ПометкаУдаления Тогда
			ТекстОшибки = НСтр("ru='Договор %Договор% помечен на удаление. Ввод на основании невозможен.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Результат.Наименование);
			ВызватьИсключение ТекстОшибки;
			
		ИначеЕсли НЕ Результат.УчетПредметаДоговора Тогда
			
			ТекстОшибки = НСтр("ru='По договору %Договор% не ведется учет по предметам контракта. Ввод на основании невозможен.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Результат.Наименование);
			ВызватьИсключение ТекстОшибки;
			
		Иначе
			
			СтруктураДокумента = Новый Структура;
			Если РаботаСОбязательствами.ЕстьДокументИсполненияРасторжения(Обязательство, СтруктураДокумента) Тогда
				
				ТекстОшибки = НСтр("ru='Для договора %Договор% уже создан документ %Документ%.'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Договор%", Результат.Наименование);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", СтруктураДокумента.Представление);
				ВызватьИсключение ТекстОшибки;

			КонецЕсли; 
			
		КонецЕсли; 		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
