////////////////////////////////////////////////////////////////////////////////
// Применяется для ввода начальных остатков
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// По виду документа определяет обслуживаемые разделы учета для ввода остатков.
//
// Параметры:
//	ВидДокумента	- Строка	- одна из строк:	"ВводНачальныхОстатков"
//													"ВводНачальныхОстатковОС"
// Возвращаемое значение:
//	Массив		- массив значений перечисления РазделыУчетаДляВводаОстатков
//
Функция ПолучитьРазделыУчетаДляВводаОстатков(ВидДокумента, ИсключитьУстаревшие = Ложь) Экспорт
	
	РазделыУчета = Новый Массив();
	
	Если ВидДокумента = "ВводНачальныхОстатков" Тогда
		
		// Актуальные (12)
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ОсновныеСредстваНаЗабалансе"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ИмуществоКазныМЗ"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ПраваПользованияАктивами"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ДенежныеСредства"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.Материалы"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ПоСчету106хП"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ДенежныеДокументы"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.БСО"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.НДС"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.Студенты"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.РодительскаяПлата"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ДоходыБудущихПериодов"));
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ПрочиеСчетаБухгалтерскогоУчета"));
		
		// Устаревшие (4)
		Если ИсключитьУстаревшие = Ложь Тогда
			РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ОсновныеСредства"));
			РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.НПА"));
			РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ИмуществоКазны"));
			РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ОсновныеСредстваВОперативномУчете"));
		КонецЕсли;
		
	ИначеЕсли ВидДокумента = "ВводНачальныхОстатковОС" Тогда
		
		// Актуальные (1)
		РазделыУчета.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ИсторияОС"));
		
	КонецЕсли;
	
	Возврат РазделыУчета;
	
КонецФункции

// По разделу учета для ввода остатков определяет обслуживающий документ.
//
// Параметры:
//	РазделУчета	- ПеречислениеСсылка.РазделыУчетаДляВводаОстатков	- проверяемый раздел учета
//
// Возвращаемое значение:
//	Строка, Неопределено	- одна из строк:	"ВводНачальныхОстатков"
//												"ВводНачальныхОстатковОС"
//
Функция ПолучитьВидДокумента(РазделУчета, ИсключитьУстаревшие = Ложь) Экспорт
	
	ВидДокумента = "ВводНачальныхОстатков";
	РазделыУчета = ПолучитьРазделыУчетаДляВводаОстатков(ВидДокумента, ИсключитьУстаревшие);
	СодержитРазделУчета = (РазделыУчета.Найти(РазделУчета) <> Неопределено);
	Если СодержитРазделУчета Тогда
		Возврат ВидДокумента;
	КонецЕсли;
	
	ВидДокумента = "ВводНачальныхОстатковОС";
	РазделыУчета = ПолучитьРазделыУчетаДляВводаОстатков(ВидДокумента, ИсключитьУстаревшие);
	СодержитРазделУчета = (РазделыУчета.Найти(РазделУчета) <> Неопределено);
	Если СодержитРазделУчета Тогда
		Возврат ВидДокумента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция УстаревшиеРазделыУчетаДляВводаОстатков() Экспорт
	
	СписокРазделов = Новый Массив;
	
	СписокРазделов.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ОсновныеСредства"));
	СписокРазделов.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.НПА"));
	СписокРазделов.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ИмуществоКазны"));
	СписокРазделов.Добавить(ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ОсновныеСредстваВОперативномУчете"));
	
	Возврат СписокРазделов;
	
КонецФункции

// Возвращает признак того, что раздел учета для ввода остатков устарел.
//
// Параметры:
//	РазделУчета	- ПеречислениеСсылка.РазделыУчетаДляВводаОстатков	- проверяемый раздел учета
//
// Возвращаемое значение:
//	Булево
//
Функция РазделУчетаДляВводаОстатковУстарел(РазделУчета) Экспорт
	
	УстаревшиеРазделы = УстаревшиеРазделыУчетаДляВводаОстатков();	
	Возврат (УстаревшиеРазделы.Найти(РазделУчета) <> Неопределено);
	
КонецФункции

// Определяет возможность проведения документов с устаревшим разделом учета.
Функция ЗапретитьПроведениеДокументовСУстаревшимРазделомУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДатуНачалаВеденияУчета(ДатаДокументаВводаОстатков) Экспорт
	
	Если ЗначениеЗаполнено(ДатаДокументаВводаОстатков) Тогда
		ВремДата = ДатаДокументаВводаОстатков;
	Иначе
		#Если Сервер Тогда
			ВремДата = ТекущаяДатаСеанса();
		#Иначе
			ВремДата = ТекущаяДата();
		#КонецЕсли
	КонецЕсли;
	
	Возврат КонецДня(ВремДата) + 1;
	
КонецФункции

Функция ИспользоватьКЭК0(ДатаДокументаВводаОстатков) Экспорт
	
	ДатаНачалаВеденияУчета = ПолучитьДатуНачалаВеденияУчета(ДатаДокументаВводаОстатков);
	
	Возврат (НачалоДня(ДатаНачалаВеденияУчета) = НачалоГода(ДатаНачалаВеденияУчета));
	
КонецФункции

Процедура ОбновитьКэшДатаДокумента(Форма) Экспорт
	
	Форма["КэшДатаДокумента"] = Форма.Объект["Дата"];
	
КонецПроцедуры

Процедура ВосстановитьИзКэшаДатаДокумента(Форма) Экспорт
	
	Форма.Объект["Дата"] = Форма["КэшДатаДокумента"];
	
КонецПроцедуры

Функция ПолучитьДатыИзмененияСоставаГруппСчетов_ОСЗабаланс() Экспорт
	
	// Здесь указываются даты, в которые начинают действовать новые счета учета НФА.
	// Эти счета учета используются в шапке, составляют группы счетов,
	// и используются для отбора при заполнении по данным учета.
	
	// При пересечении указанных здесь временных границ меняется состав групп счетов.
	// Заканчивают действие одни группы счетов, начинают действовать другие.
	
	// см. процедуры составления списка групп счетов в документах ввода остатков.
	// Даты в условиях этих процедур совпадают с датами, указанными здесь.
	
	ДатыИзменений = Новый СписокЗначений();
	ДатыИзменений.Добавить('20210101');
	
	ДатыИзменений.СортироватьПоЗначению();
	
	Возврат Новый ФиксированныйМассив(ДатыИзменений.ВыгрузитьЗначения());
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
