////////////////////////////////////////////////////////////////////////////////
// Подсистема "Префиксация объектов". Особенности обособленных подразделений 
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устанавливает префикс источника подписки в соответствии с префиксом информационной базы и префиксом организации
// или обособленнного подразделения.
//
// Источник подписки должен содержать
// обязательный реквизит шапки "Организация", тип: "СправочникСсылка.Организации"
// реквизит шапки "Подразделение", тип: "СправочникСсылка.Подразделения"
//
// Параметры:
//  Источник - Источник события подписки, ДокументОбъект.
// СтандартнаяОбработка - Булево - флаг стандартной обработки подписки
// Префикс - Строка - префикс объекта, который нужно изменить
//
Процедура УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Перем ПрефиксПодразделения;
	
	Если Метаданные.ПодпискиНаСобытия.РегламентированнаяОтчетностьПриУстановкеНовогоНомераДокументаПоОрганизации.Источник.СодержитТип(ТипЗнч(Источник)) 
		ИЛИ Метаданные.ПодпискиНаСобытия.УстановитьПрефиксИнформационнойБазыИОрганизацииНомеруДокументаЗащитаПДн.Источник.СодержитТип(ТипЗнч(Источник))  
		ИЛИ Метаданные.ПодпискиНаСобытия.УстановитьПрефиксИнформационнойБазыИОрганизацииНомеруДокументаБРО.Источник.СодержитТип(ТипЗнч(Источник)) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ОрганизацияДоступна(Источник) Тогда 
		
		Если ПодразделениеДоступно(Источник, ПрефиксПодразделения) Тогда
			
			УстановитьПрефикс(Источник, Префикс, Истина, Истина, ПрефиксПодразделения);
			
		Иначе	
			// Используем стандартный механизм БСП, префикс по подразделению не устанавливается
			
			ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Источник, СтандартнаяОбработка, Префикс);
			
		КонецЕсли;	
		
	Иначе
		
		ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазы(Источник, СтандартнаяОбработка, Префикс);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Для документов

// Выполняет проверку модифицированности Даты и Подразделения документа
// Если дата не входит в предыдущий период или изменен реквизит Организация, то номер документа обнуляется.
// Это необходимо для назначения нового номера документу
//
// Параметры:
//  Источник - ДокументОбъект - источник события подписки
//  Отказ    - Булево - флаг отказа
// 
Процедура ПроверитьНомерДокументаПоДатеИОрганизации(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Перем ДатаНовая;
	Перем СтарыеРеквизиты;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	ИначеЕсли Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксПодразделенияНовый = "";
	
	Если ПодразделениеДоступно(Источник, ПрефиксПодразделенияНовый, ДатаНовая, Истина, СтарыеРеквизиты) Тогда
				
		Если ПрефиксПодразделенияНовый <> СтарыеРеквизиты.Префикс
			ИЛИ НЕ ПрефиксацияОбъектовСлужебный.ДатыОбъектаОдногоПериода(
			СтарыеРеквизиты.Дата, 
			ДатаНовая, 
			Источник.Ссылка) Тогда
			
			Источник.Номер = "";
			
		КонецЕсли;
		
	Иначе
		
		// Используем стандартный механизм БСП, префикс по подразделению не устанавливается
		
		ПрефиксацияОбъектовСобытия.ПроверитьНомерДокументаПоДатеИОрганизации(Источник, Отказ, РежимЗаписи, РежимПроведения);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодразделениеДоступно(Источник, ПрефиксПодразделения, ДатаДокумента = Неопределено, ПолучитьСтарыеРеквизиты = Ложь, СтарыеРеквизиты = Неопределено) 
	
	ИмяПрефиксообразующегоРеквизита = "";
	
	СтатусВозврата = Ложь;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		
		Если НЕ Источник.Метаданные().Реквизиты.Найти("Подразделение") = Неопределено Тогда
			
			ИмяПрефиксообразующегоРеквизита = "Подразделение";
			
		ИначеЕсли НЕ Источник.Метаданные().Реквизиты.Найти("ПодразделениеОтправитель") = Неопределено Тогда	
			
			ИмяПрефиксообразующегоРеквизита = "ПодразделениеОтправитель";
			
		КонецЕсли;
		
		ДатаДокумента =  Источник.Дата;
		
		Если ЗначениеЗаполнено(ИмяПрефиксообразующегоРеквизита) Тогда 
			
			Если ЗначениеЗаполнено(Источник[ИмяПрефиксообразующегоРеквизита]) Тогда
				
				РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник[ИмяПрефиксообразующегоРеквизита], "ОбособленноеПодразделение, ОбособленнаяНумерацияДокументов, Префикс");
				
				Если РеквизитыПодразделения.ОбособленноеПодразделение И РеквизитыПодразделения.ОбособленнаяНумерацияДокументов Тогда
					
					ПрефиксПодразделения = РеквизитыПодразделения.Префикс;
					
					СтатусВозврата = Истина;
					
				КонецЕсли;
			КонецЕсли;
			
			Если ПолучитьСтарыеРеквизиты Тогда
				
				СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, "Дата" + "," + ИмяПрефиксообразующегоРеквизита);
				СтарыеРеквизиты.Вставить("Префикс", "");
				
				Если ЗначениеЗаполнено(СтарыеРеквизиты[ИмяПрефиксообразующегоРеквизита]) Тогда
					
					РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтарыеРеквизиты[ИмяПрефиксообразующегоРеквизита], "ОбособленноеПодразделение, ОбособленнаяНумерацияДокументов, Префикс");
					
					Если РеквизитыПодразделения.ОбособленноеПодразделение И РеквизитыПодразделения.ОбособленнаяНумерацияДокументов Тогда
						
						СтарыйПрефикс = РеквизитыПодразделения.Префикс;
						
						СтарыеРеквизиты.Вставить("Префикс", ?(СтарыйПрефикс = Неопределено, "", СтарыйПрефикс)); 
						
						СтатусВозврата = Истина;
						
					КонецЕсли;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтатусВозврата;
	
КонецФункции	

Функция ОрганизацияДоступна(Источник)
	
	Возврат НЕ Источник.Метаданные().Реквизиты.Найти("Организация") = Неопределено;
	
КонецФункции

Процедура УстановитьПрефикс(Источник, Префикс, УстановитьПрефиксИнформационнойБазы, УстановитьПрефиксОрганизации, ПрефиксОрганизации)
	
	ПрефиксИнформационнойБазы = "";
	
	Если УстановитьПрефиксИнформационнойБазы Тогда
		
		ПрефиксацияОбъектовСобытия.ПриОпределенииПрефиксаИнформационнойБазы(ПрефиксИнформационнойБазы);
		
		ПрефиксИнформационнойБазы = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПрефиксИнформационнойБазы, 2, "0", "Слева");
		
	КонецЕсли;
	
	Если УстановитьПрефиксОрганизации Тогда
		
		ПрефиксОрганизации = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ПрефиксОрганизации, 2, "0", "Слева");
		
	КонецЕсли;
	
	ШаблонПрефикса = "[ОР][ИБ]-[Префикс]";
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ОР]", ПрефиксОрганизации);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[ИБ]", ПрефиксИнформационнойБазы);
	ШаблонПрефикса = СтрЗаменить(ШаблонПрефикса, "[Префикс]", Префикс);
	
	Префикс = ШаблонПрефикса;
	
КонецПроцедуры

#КонецОбласти