#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	ПлательщикНалогаНаПрибыль = ПолучитьФункциональнуюОпцию("ПлательщикНалогаНаПрибыль"); // Хотя бы одна организация в ИБ.
	Если ОтражатьВБухгалтерскомУчете ИЛИ НЕ ПлательщикНалогаНаПрибыль Тогда
		
		РеквизитыСчетаРасходов = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
			"СчетРасходов", "СубконтоРасходов1", "СубконтоРасходов2", "СубконтоРасходов3");
		БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРасходов,
			ЭтотОбъект, , Отказ);
		
	КонецЕсли;
	
	Если ОтражатьВНалоговомУчете Тогда
		
		Если НЕ ОтражатьВБухгалтерскомУчете
		 ИЛИ ОтражатьВБухгалтерскомУчете И БухгалтерскийУчетКлиентСервер.СчетВИерархии(СчетРасходов, "401.20") Тогда
			
			РеквизитыСчетаРасходовНУ = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
				"СчетРасходовНУ", "СубконтоРасходовНУ1", "СубконтоРасходовНУ2", "СубконтоРасходовНУ3");
			БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРасходовНУ,
				ЭтотОбъект, , Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли