
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПоляВида(Вид) Экспорт

	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВидыПриказовОбразованиеПоля.НомерСтроки,
	               |	ВидыПриказовОбразованиеПоля.Поле,
	               |	ВидыПриказовОбразованиеПоля.Заполнять,
	               |	ВидыПриказовОбразованиеПоля.ЗаполнениеОбязательно,
	               |	ВидыПриказовОбразованиеПоля.ПоказыватьПредыдущееЗначение,
	               |	ВидыПриказовОбразованиеПоля.Поле.ТипЗначения КАК ТипЗначения,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВидыПриказовОбразованиеПоля.Поле) КАК Заголовок
	               |ИЗ
	               |	Справочник.ВидыПриказовОбразование.Поля КАК ВидыПриказовОбразованиеПоля
	               |ГДЕ
	               |	ВидыПриказовОбразованиеПоля.Ссылка = &Ссылка";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Вид);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Проверяет наличия поля в виде приказа
//
// Параметры
//  Вид - СправочникСсылка.ВидыПриказовОбразование - проверяемый вид приказа
//      - ТаблицаЗначений - таблица значений, содержащая колонку "Поле" (например, результат функции ПолучитьПоляВида)
//  Поле - ПланВидовХарактеристикСсылка.ПоляПриказовОбразование - проверяемое поле
//
// Возвращаемое значение:
//  Булево - есть или нет поле в виде приказа
//
Функция ЕстьПолеПоВидуПриказа(Вид, Поле) Экспорт 
	
	Результат = Ложь;
	
	Если ТипЗнч(Вид) = Тип("СправочникСсылка.ВидыПриказовОбразование") Тогда
		
		ТаблицаПолей = ПолучитьПоляВида(Вид);
		
	ИначеЕсли ТипЗнч(Вид) = Тип("ТаблицаЗначений") Тогда
		
		ТаблицаПолей = Вид.Скопировать();
		
	Иначе
		
		ВызватьИсключение "В фукнцию ЕстьПолеПоВидуПриказа передан неизвестный тип (первый параметр)";
		                  
	КонецЕсли; 
	
	Если ТаблицаПолей.Найти(Поле, "Поле") <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьВсеПоля() Экспорт 

	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПоляПриказовОбразование.Ссылка,
	               |	ПоляПриказовОбразование.ПометкаУдаления,
	               |	ПоляПриказовОбразование.Предопределенный,
	               |	ПоляПриказовОбразование.Наименование,
	               |	ПоляПриказовОбразование.ТипЗначения
	               |ИЗ
	               |	ПланВидовХарактеристик.ПоляПриказовОбразование КАК ПоляПриказовОбразование";
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("СостояниеСтудента; УстановитьСостояниеСтудента");
	Результат.Добавить("Поля");
	Результат.Добавить("УправлениеДополнительнойУслугой; ЗначениеПоУмолчанию, Заполнять, ЗаполнениеОбязательно, ПоказыватьПредыдущееЗначение");
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли