	   
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		
		Запись.Организация = Справочники.Организации.ПустаяСсылка();
				
		Элементы.Организация.СписокВыбора.ЗагрузитьЗначения(ОрганизацииБезНастройки());
		
	КонецЕсли;  
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Организация", "РежимВыбораИзСписка", НЕ ЗначениеЗаполнено(Запись.Организация));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "Организация", "Доступность", НЕ ЗначениеЗаполнено(Запись.Организация));
		
	УстановитьВидимостьЭлементовМедосмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьРеквизитыПредрейсовогоМедосмотра();
	ИзменитьРеквизитыПослерейсовогоМедосмотра();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СторонняяОрганизацияПроводитПредрейсовыйМедосмотрПриИзменении(Элемент)
	
	ИзменитьРеквизитыПредрейсовогоМедосмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура СторонняяОрганизацияПроводитПослерейсовыйМедосмотрПриИзменении(Элемент)
	
	ИзменитьРеквизитыПослерейсовогоМедосмотра();
	
КонецПроцедуры    

&НаКлиенте
Процедура ОрганизацияПроводящаяПредрейсовыйМедосмотрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ОрганизацияПроводящаяПредрейсовыйМедосмотр)Тогда  
				
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.ОрганизацияПроводящаяПредрейсовыйМедосмотр);  
		Запись.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = ЛицензияОрганизации; 
		
	КонецЕсли;
                                                                                    
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПроводящаяПослерейсовыйМедосмотрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ОрганизацияПроводящаяПослерейсовыйМедосмотр) Тогда 
				
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.ОрганизацияПроводящаяПослерейсовыйМедосмотр);
		Запись.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
             
КонецПроцедуры

&НаКлиенте
Процедура ЛицоДопускающееВодителяПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.Организация);
		Запись.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицоДопускающееВторогоВодителяПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.Организация);
		Запись.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
		
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.Организация);
		Запись.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
		
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.Организация);
		Запись.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.ОрганизацияПроводящаяПредрейсовыйМедосмотр);
		Запись.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.ОрганизацияПроводящаяПослерейсовыйМедосмотр);
		Запись.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СтороннееЛицоДопускающееВторогоВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.ОрганизацияПроводящаяПредрейсовыйМедосмотр);
		Запись.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура СтороннееЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Запись.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Запись.ОрганизацияПроводящаяПослерейсовыйМедосмотр);
		Запись.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиКомандФормы
  	   
&НаКлиенте
Процедура ЗаполнитьПослерейсовыйМедосмотр(Команда)
	
	Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр 		= Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр;
	Запись.ЗаполнятьОтметкуОПослерейсовомМедосмотре					= Запись.ЗаполнятьОтметкуОПредрейсовомМедосмотре;
	Запись.ЗаполнятьОтметкуОПослерейсовомМедосмотреВторогоВодителя	= Запись.ЗаполнятьОтметкуОПредрейсовомМедосмотреВторогоВодителя;
	
	Если Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда 
		
		Запись.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 		= Запись.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Запись.СтороннееЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровья = Запись.СтороннееЛицоДопускающееВторогоВодителяПоСостояниюЗдоровья;
		Запись.ОрганизацияПроводящаяПослерейсовыйМедосмотр 							= Запись.ОрганизацияПроводящаяПредрейсовыйМедосмотр;
        Запись.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр 				= Запись.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр;
	Иначе 
		
		Запись.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 		= Запись.ЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Запись.ЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровья 	= Запись.ЛицоДопускающееВторогоВодителяПоСостояниюЗдоровья;
		Запись.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр 			= Запись.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр;
		
	КонецЕсли;
	
	ИзменитьРеквизитыПослерейсовогоМедосмотра();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовМедосмотра()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОрганизацияПроводящаяПредрейсовыйМедосмотр", "Видимость", Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья", "Видимость", Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоДопускающееВторогоВодителяПоСостояниюЗдоровья", "Видимость", Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоДопускающееВодителяПоСостояниюЗдоровья", "Видимость", НЕ Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоДопускающееВторогоВодителяПоСостояниюЗдоровья", "Видимость", НЕ Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр", "Видимость", Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр", "Видимость", НЕ Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОрганизацияПроводящаяПослерейсовыйМедосмотр", "Видимость", Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр); 	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", НЕ Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", НЕ Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр", "Видимость", Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр", "Видимость", НЕ Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);	
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыПредрейсовогоМедосмотра()
	
	Если Запись.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр  ИЛИ НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		
		Запись.ЛицоДопускающееВодителяПоСостояниюЗдоровья 			= Неопределено;
		Запись.ЛицоДопускающееВторогоВодителяПоСостояниюЗдоровья	= Неопределено;
		Запись.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр 	= Неопределено;
		
	Иначе

		Запись.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья 			= Неопределено;
		Запись.СтороннееЛицоДопускающееВторогоВодителяПоСостояниюЗдоровья 	= Неопределено;
		Запись.ОрганизацияПроводящаяПредрейсовыйМедосмотр 					= Неопределено;
		Запись.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр 			= Неопределено;
		
	КонецЕсли; 
	
	УстановитьВидимостьЭлементовМедосмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыПослерейсовогоМедосмотра()
	
	Если Запись.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр  ИЛИ НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		
		Запись.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 		= Неопределено; 
		Запись.ЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровья 	= Неопределено;
		Запись.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр 			= Неопределено;
		
	Иначе

		Запись.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 			= Неопределено; 
		Запись.СтороннееЛицоПринимающееВторогоВодителяПослеРейсаПоСостояниюЗдоровья 	= Неопределено;
		Запись.ОрганизацияПроводящаяПослерейсовыйМедосмотр 								= Неопределено; 
		Запись.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр						= Неопределено;
						
	КонецЕсли;  
	
	УстановитьВидимостьЭлементовМедосмотра();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛицензияМедОрганизации(Организация)
	
	МетаданныеОрганизации = Метаданные.НайтиПоТипу(ТипЗнч(Организация));
	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛицензииНаПроведениеМедосмотров.Ссылка КАК Ссылка
	               |ИЗ
	               |	&Справочник КАК ЛицензииНаПроведениеМедосмотров
	               |ГДЕ
	               |	ЛицензииНаПроведениеМедосмотров.Владелец = &Владелец
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛицензииНаПроведениеМедосмотров.ДатаНачала УБЫВ"; 
	
	Если МетаданныеОрганизации.Имя = "Организации" Тогда
		
		СправочникЛицензий = "Справочник.ЛицензииНаПроведениеМедосмотровОрганизаций";
		
	ИначеЕсли МетаданныеОрганизации.Имя = "Контрагенты" Тогда
		
		СправочникЛицензий = "Справочник.ЛицензииНаПроведениеМедосмотровКонтрагентов";	

	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(Текст,"&Справочник", СправочникЛицензий);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса; 
	Запрос.УстановитьПараметр("Владелец", Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из Результат Цикл 
		Возврат ТекСтрока.Ссылка;
	КонецЦикла;
	
КонецФункции  

&НаСервереБезКонтекста
Функция ОрганизацииБезНастройки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					НастройкиМедосмотровДокументовУчетаГСМ.Организация КАК Организация
	|				ИЗ
	|					РегистрСведений.НастройкиМедосмотровДокументовУчетаГСМ КАК НастройкиМедосмотровДокументовУчетаГСМ)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти

