//---
// Параметры формы
//---
//
//	<обязательные>
//		СвязиПараметровВыбора	- Структура	- Набор значений, используемых для установки параметров выбора
//											различных элементов этой формы;
//		ЗначенияЗаполнения		- Структура	- Набор значений, присваиваемых реквизитам этой формы;
//		КоличествоСтрок			- Число		- Число строк, выводимое для справки в шапке формы;
//
//	<опциональные>
//		НеиспользуемыеПоля			- Строка или массив	- Имена скрываемых реквизитов;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры["СвязиПараметровВыбора"]);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры["ЗначенияЗаполнения"]);
	
	ОпределитьИменаПолей();
	
	НастроитьФормуПриСтарте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаключениеКомиссииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОписи", Объект.Ссылка);
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытаФормаВыбораЗаключенияКомиссии", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.ЗаключенияКомиссииПоИнвентаризационнымОписям.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаключениеКомиссииОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытаФормаРедактированияТекстаЗаключенияКомиссии", ЭтотОбъект);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, ЗаключениеКомиссии, НСтр("ru='Заключение комиссии по результатам инвентаризации'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъяснениеПричинРасхожденийНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытаФормаРедактированияТекстаОбъяснениеПричинРасхождений", ЭтотОбъект);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, ОбъяснениеПричинРасхождений, НСтр("ru='Объяснение причин расхождений'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ПроверитьЗаполнениеИЗакрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьИменаВсехПолей()
	
	Возврат Новый Структура("
		|МестоИнвентаризации,
		|СтатусОбъекта,
		|ЦелеваяФункцияАктива,
		|Примечание,
		|ЗаключениеКомиссии,
		|СтатусОбъяснения,
		|ОбъяснениеПричинРасхождений");
	
КонецФункции

&НаСервере
Процедура НастроитьФормуПриСтарте()
	
	Перем ЗначениеПараметра;
	
	Объект = Новый Структура("Ссылка", Параметры.ОписьСсылка);
	Объект = Новый ФиксированнаяСтруктура(Объект);
	
	// Скрываем неиспользуемые поля
	Для Каждого Элемент Из НеиспользуемыеПоля Цикл
		ИмяЭлементаФормы = Элемент.Ключ;
		
		Элементы[ИмяЭлементаФормы].Видимость = Ложь;
		
		Элементы["Флажок" + ИмяЭлементаФормы].Видимость = Ложь;
	КонецЦикла;
	
	Если Параметры["СвязиПараметровВыбора"].Свойство("МассивМестИнвентаризации", ЗначениеПараметра) Тогда
		Элементы.МестоИнвентаризации.СписокВыбора.ЗагрузитьЗначения(ЗначениеПараметра);
	КонецЕсли;
	
	ИнвентаризацияСервер.ЗаполнитьСписокВыбораЭлементаСтатусОбъяснения(Элементы.СтатусОбъяснения);
	
	// Категории для русского языка:
	//	Ноль	(-);
	//	Один	(1 шт);
	//	Два		(-);
	//	Немного	(2 шт);
	//	Много	(5 шт);
	//	Другое	(-)
	НадписьКоличествоСтрок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
		НСтр("ru=';%1 строку;;%1 строки;%1 строк;'"),
		Параметры.КоличествоСтрок);
	
	Элементы["ЗакрытьФорму"].Заголовок = СтрШаблон(
		НСтр("ru='Заполнить %1'"),
		НадписьКоличествоСтрок);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Для Каждого Элемент Из ИспользуемыеПоля Цикл
		ИмяПоля = Элемент.Ключ;
		
		ИмяПоляФлажок = "Флажок" + ИмяПоля;
		
		//
		// N. Поле при сброшенном флажке
		//
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Поле " + ИмяПоля + " при сброшенном флажке";
		
		// Условие
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляФлажок);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Ложь;
		
		// Оформление
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",				ЦветаСтиля.НедоступныеДанныеЦвет);
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",				Новый Цвет(250, 250, 250));
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного",	Ложь);
		
		// Оформляемые поля
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
		
		//
		// N+1. Поле пустое при установленном флажке
		//
		НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
		НовыйЭлементУО.Представление = "Поле " + ИмяПоля + " пустое при установленном флажке";
		
		// Условие
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		Условие.ПравоеЗначение = Истина;
		
		Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоляФлажок);
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;
		
		// Оформление
		НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
		
		// Оформляемые поля
		ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИменаПолей()
	
	Перем ПереданноеЗначение;
	
	ИменаВсехПолей = ПолучитьИменаВсехПолей();
	
	ВремИспользуемыеПоля = ИменаВсехПолей;
	
	ВремНеиспользуемыеПоля = Новый Структура();
	
	МассивИмен = СтрРазделить(Параметры.НеиспользуемыеПоля, ", ", Ложь);
	
	Для Каждого ИмяПоля Из МассивИмен Цикл
		Если ИменаВсехПолей.Свойство(ИмяПоля) Тогда
			ВремНеиспользуемыеПоля.Вставить(ИмяПоля);
			ВремИспользуемыеПоля.Удалить(ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	ИспользуемыеПоля = Новый ФиксированнаяСтруктура(ВремИспользуемыеПоля);
	
	НеиспользуемыеПоля = Новый ФиксированнаяСтруктура(ВремНеиспользуемыеПоля);
	
КонецФункции

&НаКлиенте
Процедура ПолеПриИзменении(Элемент)
	
	ИмяПоляФлажок = "Флажок" + Элемент.Имя;
	
	ЭтаФорма[ИмяПоляФлажок] = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаРедактированияТекстаЗаключенияКомиссии(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаключениеКомиссии = ВыбранноеЗначение;
	
	ПолеПриИзменении(Элементы.ЗаключениеКомиссии);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаВыбораЗаключенияКомиссии(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗаключения = ИнвентаризацияВызовСервера.ПолучитьТекстЗаключенияКомиссииПоОписи(ВыбранноеЗначение);
	
	ЗаключениеКомиссии = ТекстЗаключения;
	
	ПолеПриИзменении(Элементы.ЗаключениеКомиссии);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытаФормаРедактированияТекстаОбъяснениеПричинРасхождений(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъяснениеПричинРасхождений = ВыбранноеЗначение;
	
	ПолеПриИзменении(Элементы.ОбъяснениеПричинРасхождений);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеИЗакрыть()
	
	ВозвращаемоеЗначение = ПолучитьВозвращаемоеЗначение();
	
	Этаформа.Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВозвращаемоеЗначение()
	
	// Возвращаем лишь значения, которые отмечены флажком
	
	ВозвращаемоеЗначение = Новый Структура();
	
	Для Каждого Элемент Из ИспользуемыеПоля Цикл
		ИмяРеквизита = Элемент.Ключ;
		
		Если ЭтаФорма["Флажок" + ИмяРеквизита] Тогда
			ЗначениеРеквизита = ЭтаФорма[ИмяРеквизита];
			
			ВозвращаемоеЗначение.Вставить(ИмяРеквизита, ЗначениеРеквизита);
		КонецЕсли;
	КонецЦикла;
	
	Если ВозвращаемоеЗначение.Количество() = 0 Тогда
		ВозвращаемоеЗначение = Неопределено;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти
