
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.РеквизитыОперации);
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ОбщегоНазначения.ТекущаяДатаПользователя());
		Объект.ГлБухгалтер = ПолучитьГлБухгалтера(Объект.Организация, Объект.Дата);
		Если НЕ Объект.Дата = КонецГода(Объект.Дата) И ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
			Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка");
		КонецЕсли;	
		ПодготовитьФормуНаСервере();
		УстановитьСостояниеДокумента("НезаписанныйДокумент");
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
 	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);

	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом 
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.РеквизитыОперации);
	
	ПодготовитьФормуНаСервере();
	УстановитьСостояниеДокумента();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект); 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстФинансовыйГод = Год(Объект.ФинансовыйГод);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами"
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
	Если Объект.ИспользоватьТиповыеОперации Тогда
		
		ИмяРеквизитаТиповыеОперации = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыТиповаяОперация();
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаТиповыеОперации]) Тогда
			ТекстСообщения = НСтр("ru='Не заполнена типовая операция'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ИмяРеквизитаТиповыеОперации,,Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ПроведениеОперацияБух");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьДопДействияВсехСтрокТаблицыПроводок(ЭтотОбъект);
//	УстановитьВидимостьПредупрежденияОДопДействиях(ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	УстановитьСостояниеДокумента();

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ОтразитьВМежотчетномПериоде И НЕ ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Вид межотчетного периода'")),,
		"Объект.ВидМежотчетногоПериода",,Отказ);
	КонецЕсли;  
	Если ОтразитьВМежотчетномПериоде И НЕ ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Финансовый год'")),,
		"Объект.ФинансовыйГод",,Отказ);
	КонецЕсли; 
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства    
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник); 
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтотОбъект, Объект);
	Объект.ГлБухгалтер = ПолучитьГлБухгалтера(Объект.Организация, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Общие проверки условий по датам.
	ТребуетсяУстановитьПараметрыФО = ОбщегоНазначенияБГУКлиент.ТребуетсяВызовСервераПриИзмененииДатыДокумента(Объект.Дата, ТекущаяДатаДокумента);

	// Если определили, что изменение даты может повлиять на какие-либо параметры, 
	// то установим параметры функциональных опций.
	Если ТребуетсяУстановитьПараметрыФО Тогда
		ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	КонецЕсли;
	
	// Запомним новую дату документа.
	ТекущаяДатаДокумента = Объект.Дата;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ЭтотОбъект.ОтразитьВМежотчетномПериоде Тогда	
		Объект.ФинансовыйГод = НачалоГода(Объект.Дата) - 1;
		ТекстФинансовыйГод = Год(Объект.ФинансовыйГод);  
	Иначе
		Объект.ФинансовыйГод = "";
		ТекстФинансовыйГод = 0; 
	КонецЕсли;
	
	БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТиповыеОперацииПриИзменении(Элемент)
	ВидимостьТиповойОперации(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТребуютсяДопДействияПодробнееНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Событие", "ТребуютсяДопДействияПодробнее");
	
	Отбор = Новый Структура("ДопДействияТребуются", Истина);
	СтрокиСДопДействиями = Объект.Движения.ЖурналПроводокЕПСБУ.НайтиСтроки(Отбор);
	ПараметрыФормы.Вставить("КоличествоСтрокСДопДействиями", СтрокиСДопДействиями.Количество());
	ПараметрыФормы.Вставить("СписокСтрокСДопДействиями", "");
	Для Каждого Строка Из СтрокиСДопДействиями Цикл
		ПараметрыФормы.СписокСтрокСДопДействиями = ПараметрыФормы.СписокСтрокСДопДействиями +
			?(ПустаяСтрока(ПараметрыФормы.СписокСтрокСДопДействиями), Строка.НомерСтроки, ", " + Строка.НомерСтроки);
	КонецЦикла;
	
	ОткрытьФорму("Документ.ОперацияБух.Форма.ДополнительныеДействия", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура ФинансовыйГодПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ТекстФинансовыйГод) Тогда
		Объект.ФинансовыйГод = Дата(ТекстФинансовыйГод, 12, 31, 23, 59, 59); 
	Иначе  
		Объект.ФинансовыйГод = '00010101';
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

// Обработчики элементов дополнительных реквизитов операции.

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПроводок

&НаКлиенте
Процедура ДвиженияЖурналПроводокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		// Заполним Организацию и Период в проводке, т.к. в дальнейшем их значения используются
		// для проверки необходимости доп. действий.
		ТекущиеДанные.Организация = Объект.Организация;
		ТекущиеДанные.Период = Объект.Дата;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ДвиженияЖурналПроводокДопДействияТребуются" Тогда
		
		Если ТекущиеДанные.ДопДействияТребуются Тогда
			
			ПараметрыФормы = Новый Структура("НомерСтроки,Организация,Период,КФО,
				|Событие,ДтКт,
				|СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,
				|СчетКт,СубконтоКт1,СубконтоКт2,СубконтоКт3");
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, ТекущиеДанные);
			ПараметрыФормы.Вставить("ИФО", Объект.ИФО);
			
			// Код события и сторона проводки, по которой возникло событие.
			ПараметрыФормы.Событие = ТекущиеДанные.ДопДействияСобытие;
			ПараметрыФормы.ДтКт    = ТекущиеДанные.ДопДействияДтКт;
			
			ОткрытьФорму("Документ.ОперацияБух.Форма.ДополнительныеДействия", ПараметрыФормы, ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элементы.ДвиженияЖурналПроводок.ТекущиеДанные <> Неопределено Тогда
		ОбновитьДопДействияВСтрокеТаблицыПроводок(Элементы.ДвиженияЖурналПроводок.ТекущиеДанные);
	КонецЕсли;
	
	УстановитьВидимостьПредупрежденияОДопДействиях(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокПослеУдаления(Элемент)
	
	УстановитьВидимостьПредупрежденияОДопДействиях(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ДвиженияЖурналПроводокСодержаниеНачалоВыбораЗавершение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение,
		Элемент.ТекстРедактирования, "Содержание проводки");
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСодержаниеНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.Содержание = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКФОПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(Объект.Организация,
											   Объект.ИФО,
											   ТекущиеДанные.КФО,
											   Объект.Дата,
											   ТекущиеДанные.КПСДт,
											   ТекущиеДанные.КПСКт);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

// ДЕБЕТ

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СчетКт) Тогда
		ТекущиеДанные.ЖурналОпераций = БухгалтерскийУчетВызовСервераПовтИсп.НомерЖурнала(ТекущиеДанные.СчетДт, ТекущиеДанные.СчетКт);
	КонецЕсли;
	
	ОчиститьНеиспользуемыеПоляПоПризнакамУчета(ТекущиеДанные, "Дт");
	
	// Уточняем КОСГУ по контрагентами или МЗ
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элементы.ДвиженияЖурналПроводокСубконтоДт1,,, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.СчетДт, 
																			ТекущиеДанные.КПСДт, 
																			ТекущиеДанные.КФО), 
															Объект.Организация,
															Объект.ИФО,
															,
															ТекущиеДанные.КФО,
															,
															Объект.Дата,
															Новый Структура("КорреспонденцияКт", ТекущиеДанные.СчетКт));
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПСДт,
															ТекущиеДанные.КФО,
															ТекущиеДанные.КЭКДт,);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКПСДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПСДт, 
													Объект.Организация,
													Объект.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.СчетДт,
													Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭКДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные; 
	
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетаСконтролем.Найти(ТекущиеДанные.СчетДт) = Неопределено Тогда
		КПС = Неопределено;
	Иначе
		КПС = ТекущиеДанные.КПСДт;
	КонецЕсли;	
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекущиеДанные.КЭКДт,
								Объект.Организация, 
								Объект.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетДт,
								Объект.Дата,
								,,,,
								КПС,
								ИСТИНА,
								ОтразитьВМежотчетномПериоде);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭКДтАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)  
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные; 
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетаСконтролем.Найти(ТекущиеДанные.СчетДт) = Неопределено Тогда
		КПС = Неопределено;
	Иначе
		КПС = ТекущиеДанные.КПСДт;
	КонецЕсли;	
	ПараметрыВыбораКЭК = БухгалтерскийУчетКлиент.ПолучитьПараметрыВыбораКОСГУ(ТекущиеДанные.КЭКДт,
								Объект.Организация, 
								Объект.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетДт,
								Объект.Дата,
								,,,,
								КПС,
								ИСТИНА,
								ОтразитьВМежотчетномПериоде);

	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КОСГУ"), ПараметрыВыбораКЭК);
		
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭКДтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные; 
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетаСконтролем.Найти(ТекущиеДанные.СчетДт) = Неопределено Тогда
		КПС = Неопределено;
	Иначе
		КПС = ТекущиеДанные.КПСКт;
	КонецЕсли;	
	ПараметрыВыбораКЭК = БухгалтерскийУчетКлиент.ПолучитьПараметрыВыбораКОСГУ(ТекущиеДанные.КЭКДт,
								Объект.Организация, 
								Объект.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетДт,
								Объект.Дата,
								,,,,
								КПС,
								ИСТИНА,
								ОтразитьВМежотчетномПериоде);

    ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КОСГУ"), ПараметрыВыбораКЭК);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт1);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт2);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт3);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютаДтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаДт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаДт, ТекущиеДанные.ВалютаДт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютнаяСуммаДтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаДт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаДт, ТекущиеДанные.ВалютаДт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

// КРЕДИТ

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СчетДт) Тогда
		ТекущиеДанные.ЖурналОпераций = БухгалтерскийУчетВызовСервераПовтИсп.НомерЖурнала(ТекущиеДанные.СчетДт, ТекущиеДанные.СчетКт);
	КонецЕсли;
	
	ОчиститьНеиспользуемыеПоляПоПризнакамУчета(ТекущиеДанные, "Кт");
	
	// Уточняем КОСГУ по контрагентами или МЗ
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элементы.ДвиженияЖурналПроводокСубконтоКт1,,, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.СчетКт, 
																			ТекущиеДанные.КПСКт, 
																			ТекущиеДанные.КФО), 
															Объект.Организация,
															Объект.ИФО,
															,
															ТекущиеДанные.КФО,
															,
															Объект.Дата,
															Новый Структура("КорреспонденцияДт", ТекущиеДанные.СчетДт));
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПСКт,
															ТекущиеДанные.КФО,
															,
															ТекущиеДанные.КЭККт);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКПСКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПСКт, 
													Объект.Организация,
													Объект.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.СчетКт,
													Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭККтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные; 
	
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетаСконтролем.Найти(ТекущиеДанные.СчетКт) = Неопределено Тогда
		КПС = Неопределено;
	Иначе
		КПС = ТекущиеДанные.КПСКт;
	КонецЕсли;	
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекущиеДанные.КЭККт,
								Объект.Организация, 
								Объект.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетКт,
								Объект.Дата,
								,,,,
								КПС,
								ИСТИНА,
								ОтразитьВМежотчетномПериоде);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭККтАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)  
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные; 
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетаСконтролем.Найти(ТекущиеДанные.СчетКт) = Неопределено Тогда
		КПС = Неопределено;
	Иначе
		КПС = ТекущиеДанные.КПСКт;
	КонецЕсли;	
	ПараметрыВыбораКЭК = БухгалтерскийУчетКлиент.ПолучитьПараметрыВыбораКОСГУ(ТекущиеДанные.КЭККт,
								Объект.Организация, 
								Объект.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетКт,
								Объект.Дата,
								,,,,
								КПС,
								ИСТИНА,
								ОтразитьВМежотчетномПериоде);

	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КОСГУ"), ПараметрыВыбораКЭК);
		
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭККтОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные; 
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетаСконтролем.Найти(ТекущиеДанные.СчетКт) = Неопределено Тогда
		КПС = Неопределено;
	Иначе
		КПС = ТекущиеДанные.КПСКт;
	КонецЕсли;	
	ПараметрыВыбораКЭК = БухгалтерскийУчетКлиент.ПолучитьПараметрыВыбораКОСГУ(ТекущиеДанные.КЭККт,
								Объект.Организация, 
								Объект.ИФО,
								ТекущиеДанные.КФО, 
                                ТекущиеДанные.СчетКт,
								Объект.Дата,
								,,,,
								КПС,
								ИСТИНА,
								ОтразитьВМежотчетномПериоде);

    ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КОСГУ"), ПараметрыВыбораКЭК);

КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация, 
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт1);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт2);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт3);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютаКтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаКт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаКт, ТекущиеДанные.ВалютаКт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютнаяСуммаКтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаКт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаКт, ТекущиеДанные.ВалютаКт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3АвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоТиповойОперации(Команда)
	
	ИмяРеквизитаТиповыеОперации = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыТиповаяОперация();
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[ИмяРеквизитаТиповыеОперации]) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Типовая операция'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, ИмяРеквизитаТиповыеОперации);
		Возврат;
	КонецЕсли;
	
	Если НЕ БухгалтерскиеОперацииКлиентСервер.ОбязательныеРеквизитыЗаполнены(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоТиповойОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПроводкиНУ(Команда)
	
	НомераПроводокНУ = ПолучитьНомераПроводокНУ();
	
	Если НомераПроводокНУ.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьПроводкиНУЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Существующие проводки налогового учета будут очищены. Заполнить?'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьПроводкиНУНаСервере(НомераПроводокНУ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьПроводкиНУЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПроводкиНУНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПроводкиНУНаСервере(НомераПроводокНУ = Неопределено)
	
	Если НомераПроводокНУ = Неопределено Тогда
		НомераПроводокНУ = ПолучитьНомераПроводокНУ();
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	НаборДвижений = ДокументОбъект.Движения.ЖурналПроводокЕПСБУ;
	
	// Удаляем существующие проводки НУ.
	КоличествоПроводокНУ = НомераПроводокНУ.Количество();
	Для Сч=1 По КоличествоПроводокНУ Цикл
		НомерПроводкиНУ = НомераПроводокНУ.Получить(КоличествоПроводокНУ - Сч);
		НаборДвижений.Удалить(НомерПроводкиНУ - 1);
	КонецЦикла;
	
	// Сформируем таблицу проводок БУ.
	// В новых проводках могут быть не заполнены Организация и Период.
	ТаблицаПроводок = НаборДвижений.Выгрузить();
	ТаблицаПроводок.ЗаполнитьЗначения(ДокументОбъект.Организация, "Организация");
	ТаблицаПроводок.ЗаполнитьЗначения(ДокументОбъект.Дата, "Период");
	
	// Сформируем таблицу проводок НУ по таблице проводок БУ.
	ТаблицаПроводокНУ = НалоговыйУчет.СформироватьПроводкиНУпоБУ(ДокументОбъект, ТаблицаПроводок);
	
	// Загрузим проводки БУ и НУ в табличную часть операции.
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПроводокНУ, ТаблицаПроводок);
	НаборДвижений.Загрузить(ТаблицаПроводок);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьНаОбратнуюПроводку(Команда)
	
	Для Каждого ВыделеннаяСтрока Из Элементы.ДвиженияЖурналПроводок.ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Объект.Движения.ЖурналПроводокЕПСБУ.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		БуферДт = Новый Структура("СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,КПСДт,КЭКДт,
									|ВалютаДт,ПодразделениеДт,ВалютнаяСуммаДт,КоличествоДт,ХарактеристикаДвиженияДт");
		ЗаполнитьЗначенияСвойств(БуферДт, ТекущиеДанные);
		
		Для Каждого КлючЗначение Из БуферДт Цикл
			КлючКт = СтрЗаменить(КлючЗначение.Ключ,"Дт","Кт");
			ТекущиеДанные[КлючЗначение.Ключ] = ТекущиеДанные[КлючКт];
			ТекущиеДанные[КлючКт] = КлючЗначение.Значение;
		КонецЦикла;
		
		ОбновитьДопДействияВСтрокеТаблицыПроводок(ТекущиеДанные);
		
		Если ЗначениеЗаполнено(ТекущиеДанные["СчетДт"]) Тогда
			СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные["СчетДт"]);
			Если ЗначениеЗаполнено(СвойстваСчета.КОСГУДт) Тогда
				ТекущиеДанные["КЭКДт"] = СвойстваСчета.КОСГУДт; 
				// Уточняем КОСГУ по контрагентами или МЗ  
				ТипЗначения = ТипЗнч(ТекущиеДанные.СубконтоДт1);
				Если ТипЗначения = Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗначения = Тип("СправочникСсылка.Номенклатура") Тогда
					ПараметрыКЭК = БухгалтерскийУчетКлиентСервер.ПараметрыРасчетаКЭКПроводки();
					ПараметрыКЭК.Дата = Объект.Дата;
					ПараметрыКЭК.ИФО = ТекущиеДанные.ИФО;
					ПараметрыКЭК.КФО = ТекущиеДанные.КФО;
					ПараметрыКЭК.Организация =ТекущиеДанные.Организация;
					ПараметрыКЭК.Субконто1 = ТекущиеДанные.СубконтоДт1;
					ПараметрыКЭК.Субконто2 = ТекущиеДанные.СубконтоДт2;
					ПараметрыКЭК.Субконто3 = ТекущиеДанные.СубконтоДт3;
					ПараметрыКЭК.Счет = ТекущиеДанные["СчетДт"];
					ПараметрыКЭК.ДтКт = "Дт";
					КЭКПроводки = БухгалтерскийУчетВызовСервера.КЭКПроводки(ПараметрыКЭК);
					Если ЗначениеЗаполнено(КЭКПроводки) Тогда
						ТекущиеДанные["КЭКДт"] = КЭКПроводки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ТекущиеДанные["СчетКт"]) Тогда
			СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные["СчетКт"]);
			Если ЗначениеЗаполнено(СвойстваСчета.КОСГУКт) Тогда
				ТекущиеДанные["КЭККт"] = СвойстваСчета.КОСГУКт; 
				ТипЗначения = ТипЗнч(ТекущиеДанные.СубконтоКт1);
				Если ТипЗначения = Тип("СправочникСсылка.Контрагенты") ИЛИ ТипЗначения = Тип("СправочникСсылка.Номенклатура") Тогда
					ПараметрыКЭК = БухгалтерскийУчетКлиентСервер.ПараметрыРасчетаКЭКПроводки();
					ПараметрыКЭК.Дата = Объект.Дата;
					ПараметрыКЭК.ИФО = ТекущиеДанные.ИФО;
					ПараметрыКЭК.КФО = ТекущиеДанные.КФО;
					ПараметрыКЭК.Организация =ТекущиеДанные.Организация;
					ПараметрыКЭК.Субконто1 = ТекущиеДанные.СубконтоКт1;
					ПараметрыКЭК.Субконто2 = ТекущиеДанные.СубконтоКт2;
					ПараметрыКЭК.Субконто3 = ТекущиеДанные.СубконтоКт3;
					ПараметрыКЭК.Счет = ТекущиеДанные["СчетКт"];
					ПараметрыКЭК.ДтКт = "Кт";
					КЭКПроводки = БухгалтерскийУчетВызовСервера.КЭКПроводки(ПараметрыКЭК);
					Если ЗначениеЗаполнено(КЭКПроводки) Тогда
						ТекущиеДанные["КЭККт"] = КЭКПроводки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ТекущиеДанные.ЖурналОпераций = БухгалтерскийУчетВызовСервераПовтИсп.НомерЖурнала(ТекущиеДанные["СчетДт"], ТекущиеДанные["СчетКт"]);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьАктивностьДвижений(Команда)

	Если Объект.ПометкаУдаления Тогда
		ПоказатьПредупреждение( , 
			НСтр("ru = 'Операция помечена на удаление, поэтому переключить активность нельзя.
        	|Снимите пометку удаления.'"));
		Возврат;
	КонецЕсли;
	
	ПереключитьАктивностьДвиженийНаСервере();

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	ТекущаяДатаДокумента = Объект.Дата;
	
	ОбновитьДопДействияВсехСтрокТаблицыПроводок(ЭтотОбъект);
	УстановитьВидимостьПредупрежденияОДопДействиях(ЭтотОбъект);
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтотОбъект, Объект);
	
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	//БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект);
	
	ВидимостьТиповойОперации(ЭтотОбъект, Объект); 
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Сторно.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Сторно КАК Сторно
	|ГДЕ
	|	Сторно.ДокументОснование = &ДокументОснование");
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	ДокументСторнирован = НЕ Запрос.Выполнить().Пустой();
	
	// переключатель активности движений
	АктивностьДвижений = Истина;
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого Движение Из ДокументОбъект.Движения Цикл 
		Движение.Прочитать();
		Если Движение.Количество() > 0 Тогда
			АктивностьДвижений = АктивностьДвижений И Движение[0].Активность;
		КонецЕсли;	
	КонецЦикла;
	Элементы.ФормаПереключитьАктивностьДвижений.Заголовок = ?(АктивностьДвижений, 
		НСтр("ru='Выключить активность движений'"), НСтр("ru='Включить активность движений'"));   
		
	// Счета с контролем КПС и КЭК	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СчетаСконтролем", ПланыСчетов.ЕПСБУ.СчетаСНеоборотнымиКЭК());
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоТиповойОперацииНаСервере()
	
	Объект.Движения.ЖурналПроводокЕПСБУ.Очистить();
	
	ДопРеквизиты = Новый Структура;
	ЗаполнитьСписокДопРеквизитов(Элементы.РеквизитыОперации, ДопРеквизиты);
	
	ИмяРеквизитаТиповыеОперации = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыТиповаяОперация();
	ФормированиеПроводок = Обработки.ФормированиеБухгалтерскихПроводок.Создать();
	ФормированиеПроводок.ДокументОснование = Объект.Ссылка;
	ФормированиеПроводок.ТиповаяОперация   = ЭтотОбъект[ИмяРеквизитаТиповыеОперации];

	ТаблицаПроводок = Неопределено;
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ПараметрыАвтоФормированияПроводок = ФормированиеПроводок.ПараметрыАвтоФормированияПроводок();
	ПараметрыАвтоФормированияПроводок.ДопРеквизиты 		= ДопРеквизиты;
	ПараметрыАвтоФормированияПроводок.ТаблицаПроводок	= ТаблицаПроводок;
	ПараметрыАвтоФормированияПроводок.ТекущийОбъект 	= ДокументОбъект;
	ФормированиеПроводок.АвтоФормированиеПроводок(ПараметрыАвтоФормированияПроводок);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Модифицированность = ДокументОбъект.Модифицированность();
	
	Если ПараметрыАвтоФормированияПроводок.ТаблицаПроводок <> Неопределено Тогда  
		ПараметрыАвтоФормированияПроводок.ТаблицаПроводок.ЗаполнитьЗначения(ИСТИНА, "Активность");
		Для каждого ТекПроводка Из ПараметрыАвтоФормированияПроводок.ТаблицаПроводок Цикл
			ЗаполнитьЗначенияСвойств(Объект.Движения.ЖурналПроводокЕПСБУ.Добавить(), ТекПроводка);
		КонецЦикла;
		АктивностьДвижений = Истина;
		УстановитьСостояниеДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДопРеквизитов(ТекЭлемент, ДопРеквизиты)
	
	Для каждого ДопРеквизитОперации Из ЭтотОбъект["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"] Цикл
	
		Если ДопРеквизитОперации.ЭтоГруппа
			ИЛИ ЗначениеЗаполнено(ДопРеквизитОперации.ИмяТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопРеквизитОперации.ИмяДляФормулы)
			И ЗначениеЗаполнено(ДопРеквизитОперации.ИмяРеквизита) Тогда
			
			ДопРеквизиты.Вставить(ДопРеквизитОперации.ИмяДляФормулы,
				ЭтотОбъект[ДопРеквизитОперации.ИмяРеквизита]);
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНомераПроводокНУ()
	
	Возврат НалоговыйУчет.ПолучитьНомераПроводокНУ(Объект.Движения.ЖурналПроводокЕПСБУ);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПересчитатьСуммуВРублях(ВалютнаяСумма, Валюта, Дата)
	
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
		
	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		ВалютнаяСумма, 
		Новый Структура("Валюта, Курс, Кратность", Валюта, КурсВалюты.Курс, КурсВалюты.Кратность),
		Новый Структура("Валюта, Курс, Кратность", Константы.ВалютаРегламентированногоУчета.Получить(), 1, 1));	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма, Объект)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГлБухгалтер",
		"Доступность", ЗначениеЗаполнено(Объект.Организация));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьГлБухгалтера(Организация, Дата)

	Если ЗначениеЗаполнено(Организация) Тогда
		Возврат ОрганизационнаяСтруктураВызовСервераПовтИсп.ОтветственноеЛицоОрганизации(Организация,
			ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер"),
			Дата).ОтветственноеЛицоСсылка;
	Иначе
		Возврат ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОчиститьНеиспользуемыеПоляПоПризнакамУчета(ТекущиеДанные, СторонаПроводки)

	Количественный = Ложь;
	Валютный = Ложь;
	Если ЗначениеЗаполнено(ТекущиеДанные["Счет" + СторонаПроводки]) Тогда
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные["Счет" + СторонаПроводки]);
		Количественный = СвойстваСчета.Количественный;
		Валютный = СвойстваСчета.Валютный;
	КонецЕсли;
	
	Если Не Количественный И ЗначениеЗаполнено(ТекущиеДанные["Количество" + СторонаПроводки]) Тогда
		ТекущиеДанные["Количество" + СторонаПроводки] = Неопределено;
	КонецЕсли;
	
	Если Не Валютный Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные["Валюта" + СторонаПроводки]) Тогда
			ТекущиеДанные["Валюта" + СторонаПроводки] = Неопределено;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекущиеДанные["ВалютнаяСумма" + СторонаПроводки]) Тогда
			ТекущиеДанные["ВалютнаяСумма" + СторонаПроводки] = Неопределено;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьТиповойОперации(Форма, Объект)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "РеквизитыОперации",
		"Видимость", Объект.ИспользоватьТиповыеОперации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ФормаЗаполнитьПоТиповойОперации",
		"Видимость", Объект.ИспользоватьТиповыеОперации);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДопДействияВсехСтрокТаблицыПроводок(Форма)

	ТаблицаПроводок = Форма.Объект.Движения.ЖурналПроводокЕПСБУ;
	
	Для Каждого Проводка Из ТаблицаПроводок Цикл
		ОбновитьДопДействияВСтрокеТаблицыПроводок(Проводка);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДопДействияВСтрокеТаблицыПроводок(Проводка)
	
	Проводка.ДопДействияТребуются = Ложь;
	Проводка.ДопДействияСобытие = "";
	Проводка.ДопДействияДтКт = "";
	
	// Список обрабатываемых операций.
	ИзмениласьСтоимостьОС = Ложь;
	ИзмениласьАмортизацияОС = Ложь;
	ИзменилосьОбесценениеОС = Ложь;
	
	СчетДтЭтоСчетУчета = БухгалтерскийУчетВызовСервера.СчетВИерархии(Проводка.СчетДт, "101.00,102.00,103.00,108.00,21");
	СчетКтЭтоСчетУчета = БухгалтерскийУчетВызовСервера.СчетВИерархии(Проводка.СчетКт, "101.00,102.00,103.00,108.00,21");
	
	// Дт 101,102,103,108 - Кт 401.10,303.04,...
	Если СчетДтЭтоСчетУчета И Не СчетКтЭтоСчетУчета Тогда
		ИзмениласьСтоимостьОС = Истина;
		ДтКт = "Дт";
	// Дт 401.20,303.04,... - Кт 101,102,103,108.
	ИначеЕсли Не СчетДтЭтоСчетУчета И СчетКтЭтоСчетУчета Тогда
		ИзмениласьСтоимостьОС = Истина;
		ДтКт = "Кт";
	КонецЕсли;
	
	СчетДтЭтоСчетАмортизации = БухгалтерскийУчетВызовСервера.СчетВИерархии(Проводка.СчетДт, "104.00");
	СчетКтЭтоСчетАмортизации = БухгалтерскийУчетВызовСервера.СчетВИерархии(Проводка.СчетКт, "104.00");
	
	// Дт ... - Кт 104.
	Если Не СчетДтЭтоСчетАмортизации И СчетКтЭтоСчетАмортизации Тогда
		ИзмениласьАмортизацияОС = Истина;
		ДтКт = "Кт";
	// Дт 104 - Кт ...
	ИначеЕсли СчетДтЭтоСчетАмортизации И Не СчетКтЭтоСчетАмортизации Тогда
		ИзмениласьАмортизацияОС = Истина;
		ДтКт = "Дт";
	КонецЕсли;
	
	СчетДтЭтоСчетОбесценения = БухгалтерскийУчетВызовСервера.СчетВИерархии(Проводка.СчетДт, "114.00");
	СчетКтЭтоСчетОбесценения = БухгалтерскийУчетВызовСервера.СчетВИерархии(Проводка.СчетКт, "114.00");
	
	// Дт ... - Кт 114.
	Если Не СчетДтЭтоСчетОбесценения И СчетКтЭтоСчетОбесценения Тогда
		ИзменилосьОбесценениеОС = Истина;
		ДтКт = "Кт";
	// Дт 114 - Кт ...
	ИначеЕсли СчетДтЭтоСчетОбесценения И Не СчетКтЭтоСчетОбесценения Тогда
		ИзменилосьОбесценениеОС = Истина;
		ДтКт = "Дт";
	КонецЕсли;
	
	Если ИзмениласьСтоимостьОС Или ИзмениласьАмортизацияОС Или ИзменилосьОбесценениеОС Тогда
		
		РеквизитыПроводки = Новый Структура("Организация,Период,СчетДт,СчетКт,
			|СубконтоДт1,СубконтоДт2,СубконтоДт3,СубконтоКт1,СубконтоКт2,СубконтоКт3");
		ЗаполнитьЗначенияСвойств(РеквизитыПроводки, Проводка);
		ДанныеОбъектаОС = ПолучитьДанныеОбъектаОСизПроводки(РеквизитыПроводки, ДтКт);
		
		ПоНорме = ДанныеОбъектаОС.ПорядокПогашенияСтоимости =
			ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации")
			И (ДанныеОбъектаОС.СпособНачисленияАмортизации =
					ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.Линейный")
				Или ДанныеОбъектаОС.СпособНачисленияАмортизации =
					ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка")
				Или ДанныеОбъектаОС.СпособНачисленияАмортизации =
					ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции"));
					
		Если ПоНорме Тогда
			Проводка.ДопДействияТребуются = Истина;
			Проводка.ДопДействияСобытие = "ИзменениеСтоимостиАмортизацииОСЛинейныйМетод";
			Проводка.ДопДействияДтКт = ДтКт;
		ИначеЕсли ДанныеОбъектаОС.ГрупповойУчет Тогда
			Проводка.ДопДействияТребуются = Истина;
			Проводка.ДопДействияСобытие = "ИзменениеСтоимостиАмортизацииОСГрупповойУчет";
			Проводка.ДопДействияДтКт = ДтКт;			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОбъектаОСизПроводки(Проводка, ДтКт)
	
	ДанныеОбъектаОС = Новый Структура;
	ДанныеОбъектаОС.Вставить("ОсновноеСредство", Справочники.ОсновныеСредства.ПустаяСсылка());
	ДанныеОбъектаОС.Вставить("ГрупповойУчет", Ложь);
	ДанныеОбъектаОС.Вставить("ПорядокПогашенияСтоимости", Перечисления.ПорядокПогашенияСтоимостиОС.ПустаяСсылка());
	ДанныеОбъектаОС.Вставить("СпособНачисленияАмортизации", Перечисления.СпособНачисленияАмортизации.ПустаяСсылка());
	
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Проводка["Счет" + ДтКт]);
	Если СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
		ДанныеОбъектаОС.Вставить("ОсновноеСредство", Проводка["Субконто" + ДтКт + "1"]);
	ИначеЕсли СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
		ДанныеОбъектаОС.Вставить("ОсновноеСредство", Проводка["Субконто" + ДтКт + "2"]);
	ИначеЕсли СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
		ДанныеОбъектаОС.Вставить("ОсновноеСредство", Проводка["Субконто" + ДтКт + "3"]);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеОбъектаОС.ОсновноеСредство) Тогда
		Возврат ДанныеОбъектаОС; // Возвращаем структуру с пустыми значениями.
	КонецЕсли;
	
	ГрупповойУчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъектаОС.ОсновноеСредство, "ГрупповойУчет");
	ДанныеОбъектаОС.Вставить("ГрупповойУчет", ГрупповойУчет);
	
	Отбор = Новый Структура("ОсновноеСредство, Организация", ДанныеОбъектаОС.ОсновноеСредство, Проводка.Организация);
	ПараметрыАмортизации = РегистрыСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.ПолучитьПоследнее(Проводка.Период, Отбор);
	ДанныеОбъектаОС.Вставить("ПорядокПогашенияСтоимости", ПараметрыАмортизации.ПорядокПогашенияСтоимости);
	ДанныеОбъектаОС.Вставить("СпособНачисленияАмортизации", ПараметрыАмортизации.СпособНачисленияАмортизации);
	
	Возврат ДанныеОбъектаОС;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПредупрежденияОДопДействиях(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Отбор = Новый Структура("ДопДействияТребуются", Истина);
	ЕстьСтрокиСДопДействиями = (Объект.Движения.ЖурналПроводокЕПСБУ.НайтиСтроки(Отбор).Количество() > 0);
	
	ЭлементыПредупрежденияОДопДействиях = Новый Массив;
	ЭлементыПредупрежденияОДопДействиях.Добавить("ГруппаТребуютсяДопДействия");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыПредупрежденияОДопДействиях, "Видимость", ЕстьСтрокиСДопДействиями);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	ДлинаТекста = СтрДлина(Элемент.Имя);
	СторонаПроводки = Сред(Элемент.Имя, ДлинаТекста - 2, 2);
	НомерСубконто = Прав(Элемент.Имя, 1);
	
	ПараметрыДляВыбора = Новый Структура;
	ПараметрыДляВыбора.Вставить("НомерСубконто",   	Число(НомерСубконто));
	ПараметрыДляВыбора.Вставить("Организация",     	Объект.Организация);
	ПараметрыДляВыбора.Вставить("ИФО",				ТекущиеДанные.ИФО);
	ПараметрыДляВыбора.Вставить("КФО", 				ТекущиеДанные.КФО);
	ПараметрыДляВыбора.Вставить("Счет",            	ТекущиеДанные["Счет" + СторонаПроводки]);
	ПараметрыДляВыбора.Вставить("КПС",            	ТекущиеДанные["КПС" + СторонаПроводки]);
	ПараметрыДляВыбора.Вставить("КЭК",            	ТекущиеДанные["КЭК" + СторонаПроводки]);
	ПараметрыДляВыбора.Вставить("Субконто1",       	ТекущиеДанные["Субконто" + СторонаПроводки + "1"]);
	ПараметрыДляВыбора.Вставить("Субконто2",       	ТекущиеДанные["Субконто" + СторонаПроводки + "2"]);
	ПараметрыДляВыбора.Вставить("Субконто3",       	ТекущиеДанные["Субконто" + СторонаПроводки + "3"]);
	
	БухгалтерскийУчетКлиент.ОкончаниеВводаТекстаСубконто(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, ПараметрыДляВыбора);

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
&НаСервере
Процедура УстановитьСостояниеДокумента(СтрокаУказаниеСтатуса = Неопределено) 
	
	Если СтрокаУказаниеСтатуса = "НезаписанныйДокумент" Тогда
		СостояниеДокумента = 0;	
	ИначеЕсли Объект.ПометкаУдаления Тогда
		СостояниеДокумента = 2;
	ИначеЕсли НЕ АктивностьДвижений Тогда
		СостояниеДокумента = 11; 
	ИначеЕсли ДокументСторнирован Тогда
		СостояниеДокумента = 10;
	Иначе
		СостояниеДокумента = 1;
	КонецЕсли; 
	
	Элементы.ФормаПереключитьАктивностьДвижений.Заголовок = ?(АктивностьДвижений, 
		НСтр("ru='Выключить активность движений'"), НСтр("ru='Включить активность движений'"));

КонецПроцедуры

&НаСервере
Процедура ПереключитьАктивностьДвиженийНаСервере()
	
	НоваяАктивность = НЕ АктивностьДвижений;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого Движение Из ДокументОбъект.Движения Цикл 
		Движение.УстановитьАктивность(НоваяАктивность);
	КонецЦикла;
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
		
	АктивностьДвижений = НоваяАктивность;
	УстановитьСостояниеДокумента();
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

