#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает контактную информацию юридического лица в виде структуры,
// где ключ - имя вида контактной информации (предопределенного элемента справочника
// "Виды контактной информации".
//
// Параметры:
//  ЮрЛицо - СправочникСсылка.ЮридическиеЛица
//  СтруктураДанных - структура, где ключ - вид контактной информации
//
Процедура ПолучитьКИЮрЛица(ЮрЛицо,ТребуемыеДанные) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЮрЛицо) Тогда
		Возврат;
	КонецЕсли;
	
	СписокВидовКИ = Новый СписокЗначений;
	Для каждого КлючЗначение из ТребуемыеДанные Цикл
		ТекПараметр = КлючЗначение.Ключ;
		СписокВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации[ТекПараметр],ТекПараметр);
	КонецЦикла;
	
	ОтборПоВидам = Ложь;
	Если СписокВидовКИ.Количество() > 0 Тогда
		ОтборПоВидам = Истина;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбъектСсылка", ЮрЛицо); 
	Запрос.УстановитьПараметр("СписокВидовКИ", СписокВидовКИ);
	Запрос.УстановитьПараметр("ОтборПоВидам", Истина);
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	КонтактнаяИнформация.Вид,
	               |	КонтактнаяИнформация.Представление
	               |ИЗ
	               |	Справочник.ЮридическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |ГДЕ
	               |	КонтактнаяИнформация.Ссылка = &ОбъектСсылка
	               |	И ВЫБОР
	               |			КОГДА &ОтборПоВидам
	               |				ТОГДА КонтактнаяИнформация.Вид В (&СписокВидовКИ)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ" ;
			
	Запрос.Текст = ТекстЗапроса;		
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если ОтборПоВидам Тогда
		Для Каждого СтрокаСписка Из СписокВидовКИ Цикл
			ТекВидКИ    = СтрокаСписка.Значение;
			ТекПараметр = СтрокаСписка.Представление;
			
			НайденнаяСтрока = ТаблицаЗапроса.Найти(ТекВидКИ,"Вид");
			Если НайденнаяСтрока <> Неопределено Тогда
				ТребуемыеДанные.Вставить(ТекПараметр, НайденнаяСтрока.Представление);
			КонецЕсли;	
		КонецЦикла;	
	Иначе
		Для Каждого СтрокаТаблицы Из ТаблицаЗапроса Цикл
			ТребуемыеДанные.Вставить(СтрокаТаблицы.Вид, СтрокаТаблицы.Представление);		
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	МассивРедактируемыхРеквизитов = Новый Массив;
	МассивРедактируемыхРеквизитов.Добавить("КодПоППП");
	МассивРедактируемыхРеквизитов.Добавить("Бюджет");
	Возврат МассивРедактируемыхРеквизитов;	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.НаименованиеПолное) Тогда
		Представление = Данные.НаименованиеПолное;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеПолное");
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

#КонецОбласти
