
#Область ПрограммныйИнтерфейс

#Область ДанныеИнформационнойБазы

// Найти создать единицу измерения для КТРУ.
// 
// Параметры:
//  КодЕдиницыИзмерения - Строка - Код единицы измерения
//  НаименованиеЕдиницыИзмерения - Строка - Наименование единицы измерения
//  ЕдиницаИзмерения - СправочникСсылка.КлассификаторЕдиницИзмерения - Единица измерения
Процедура НайтиСоздатьЕдиницуИзмеренияКТРУ(КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения, ЕдиницаИзмерения) Экспорт
	
	Если ЗначениеЗаполнено(КодЕдиницыИзмерения) Тогда
		ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения); 
	ИначеЕсли ЗначениеЗаполнено(НаименованиеЕдиницыИзмерения) Тогда
		ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(НаименованиеЕдиницыИзмерения, Истина);
	Иначе
		ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормами

// Процедура, вызываемая из обработчика события формы ПриСозданииНаСервере.
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ                - Булево - признак отказа от создания формы. Если установить
//                                  данному параметру значение Истина, то форма создана не будет.
//  СтандартнаяОбработка - Булево - в данный параметр передается признак выполнения стандартной (системной) обработки
//                                  события. Если установить данному параметру значение Ложь, 
//                                  стандартная обработка события производиться не будет.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из обработчика ПриЗагрузкеДанныхИзНастроекНаСервере формы.
//
// Параметры:
//  Форма     - ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//  Настройки - Соответствие - значения реквизитов формы.
//
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Форма, Настройки) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДочернихКлассификаторов

// Процедура, вызываемая для конвертации исходные данные дочерних классификаторов текущего элемента КТРУ
// во внутренний формат, для дальнейшей записи в объект
// (см. ЗаполнитьОбъектДаннымиДочернихКлассификаторов).
//
// Параметры:
//  ИсходныеДанные - Структура - исходные данные дочерних классификаторов текущего элемента КТРУ.
//  ДанныеДочернихКлассификаторовЭлемента - Структура - результат конвертации исходных данных дочерних классификаторов текущего элемента КТРУ.
//
Процедура КонвертироватьДанныеДочернихКлассификаторовЭлемента(ИсходныеДанные, ДанныеДочернихКлассификаторовЭлемента) Экспорт
	
	ЗагружаемыеКодыМедицинскихИзделий = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ИсходныеДанные, "nomen");
	Если ЗагружаемыеКодыМедицинскихИзделий <> Неопределено Тогда
		КодыМедИзделий = Новый Массив;
		Для Каждого ЗагружаемыйКодМедицинскогоИзделия Из ЗагружаемыеКодыМедицинскихИзделий Цикл
			КодыМедИзделий.Добавить(Формат(ЗагружаемыйКодМедицинскогоИзделия, "ЧГ=0"));
		КонецЦикла;
		ДанныеДочернихКлассификаторовЭлемента.Вставить("ДанныеМедицинскихИзделий", КодыМедИзделий);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, вызываемая для загрузки данных дочерних классификаторов из дополнительных источников данных,
// например, из сервиса интернет-поддержки.
// Полученные данные загружаются в процедуре ЗагрузитьДанныеДочернихКлассификаторовИзДополнительныхИсточников.
//
// Параметры:
//  ДанныеДочернихКлассификаторов - Структура - результат загрузки данных дочерних классификаторов из дополнительных источников данных.
//
Процедура ПолучитьДанныеДочернихКлассификаторовИзДополнительныхИсточников(ДанныеДочернихКлассификаторов) Экспорт
	
	
	
КонецПроцедуры

// Процедура, выполняющая загрузку данных дочерних классификаторов по данным КТРУ.
//
// Параметры:
//  ДанныеОсновногоКлассификатора - ТаблицаЗначений - данные загружаемых элементов классификатора КТРУ.
//  ДанныеДочернихКлассификаторов - Структура - результат, полученный из процедуры ПолучитьДанныеДочернихКлассификаторовИзДополнительныхИсточников.
//  РезультатЗагрузкиДочернихКлассификаторов - Структура со свойствами
//   * Создано  - Число - число созданных объектов дочерних классификаторов.
//   * Обновлен - Число - число обновленных объектов дочерних классификаторов.
//   * Ошибки   - Массив - массив ошибок.
//   * Объекты  - Соответствие - соответствие ссылок загруженных дочерних классификаторов идентификаторам, по которым в дальнейшем можно получить ссылку.
//
Процедура ЗагрузитьДанныеДочернихКлассификаторовИзДополнительныхИсточников(ДанныеОсновногоКлассификатора, ДанныеДочернихКлассификаторов, РезультатЗагрузкиДочернихКлассификаторов) Экспорт
	
	КодыМедИзделий = Новый Массив;
	
	Для Каждого СтрокаЭлемента Из ДанныеОсновногоКлассификатора Цикл
		Если СтрокаЭлемента.ДочерниеКлассификаторы.Свойство("ДанныеМедицинскихИзделий") Тогда
			Для Каждого КодМедИзделия Из СтрокаЭлемента.ДочерниеКлассификаторы.ДанныеМедицинскихИзделий Цикл
				КодыМедИзделий.Добавить(КодМедИзделия);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если КодыМедИзделий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам.Код КАК Код,
	|	НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам КАК НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам
	|ГДЕ
	|	НоменклатурнаяКлассификацияМедицинскихИзделийПоВидам.Код В (&Коды)";
	Запрос.УстановитьПараметр("Коды", КодыМедИзделий);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Данные = Новый Соответствие;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Данные.Вставить(Выборка.Код, Выборка.Ссылка);
	КонецЦикла;
	
	РезультатЗагрузкиДочернихКлассификаторов.Объекты = Данные;
	
КонецПроцедуры

// Заполняет объект КТРУ данными загруженных дочерних классификаторов.
//
// Параметры:
//  Объект - СправочникОбъект - объект справочника КТРУ, данные дочерних классификаторов которого необходимо дозаполнить.
//  ДанныеДочернихКлассификаторовЭлемента - Структура - результат конвертации исходных данных дочерних классификаторов текущего элемента КТРУ
//                                          (см. КонвертироватьДанныеДочернихКлассификаторовЭлемента).
//  ДанныеЗагруженыхДочернихКлассификаторов - Соответствие - данные всех загруженных дочерних классификаторов
//                                            РезультатЗагрузкиДочернихКлассификаторов.Объекты
//                                            (см. ЗагрузитьДанныеДочернихКлассификаторовИзДополнительныхИсточников).
//
Процедура ЗаполнитьОбъектДаннымиДочернихКлассификаторов(Объект, ДанныеДочернихКлассификаторовЭлемента, ДанныеЗагруженныхДочернихКлассификаторов) Экспорт
	
	Объект.Классификаторы.Очистить();
	
	Если ДанныеДочернихКлассификаторовЭлемента.Свойство("ДанныеМедицинскихИзделий") Тогда
		Для Каждого КодМедИзделия Из ДанныеДочернихКлассификаторовЭлемента.ДанныеМедицинскихИзделий Цикл
			ЭлементДанных = ДанныеЗагруженныхДочернихКлассификаторов.Получить(КодМедИзделия);
			Если ЭлементДанных <> Неопределено Тогда
				ДобавляемыйКлассификатор = Объект.Классификаторы.Добавить();
				ДобавляемыйКлассификатор.Классификатор = ЭлементДанных;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаКлассификаторов

// Переопределяет необходимость загрузки и обновления всего классификатора без учета ранее загруженных данных.
//
// Параметры:
//  ЗагружатьПолностью - Булево - признак необходимости загрузки и обновления всего классификатора.
//                       Истина - весь классификатор загружается и обновляется без учета ранее загруженных данных.
//                       Ложь   - (по умолчанию) значения загружаются пользователем интерактивно,
//                                 обновляются только те значения, которые были загружены ранее.
//
Процедура ЗагружатьКлассификаторПолностью(ЗагружатьПолностью) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

