
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.КодТекущейСтроки) Тогда 
		
		Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Параметры.КодТекущейСтроки) 
			И ТипЗнч(Параметры.КодТекущейСтроки) = Тип("СправочникСсылка.ОбщероссийскийКлассификаторОсновныхФондов") Тогда
			
			ТекущийОКОФ = Параметры.КодТекущейСтроки;
			
		ИначеЕсли ТипЗнч(Параметры.КодТекущейСтроки) = Тип("Строка") Тогда
			
			ТекущийОКОФ = Справочники.ОбщероссийскийКлассификаторОсновныхФондов.НайтиПоКоду(Параметры.КодТекущейСтроки);
			
		КонецЕсли;	
		
		Элементы.Список.ТекущаяСтрока = ТекущийОКОФ;
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти