
Функция ВедетсяУчетПоДокументамРасчетов(Организация, Период, КФО, Валюта, Счет) Экспорт

	Если БухгалтерскийУчетВызовСервераПовтИсп.НаСчетеВедетсяУчетПоДокументамРасчетов(Счет) Тогда
		
		// По договорам аренды, при учете по СГС Аренда, учет по документам расчетов не имеет смысла,
		// т.к. вся задолженность начисляется при заключении договора.
		ДатаПереходаНаРедакцию64н = БухгалтерскийУчетВызовСервераПовтИсп.ДатаПереходаНаРедакциюПС(Организация, Дата('20180101'));
		Если НЕ ЗначениеЗаполнено(ДатаПереходаНаРедакцию64н) Тогда
			ДатаПереходаНаРедакцию64н = КонецГода('20180101');
		КонецЕсли;
		Если Период >= ДатаПереходаНаРедакцию64н // Начало применения СГС "Аренда" совпадает с переходом на 64н.
			И БухгалтерскийУчетКлиентСервер.СчетВИерархии(Счет, "205.21,205.22,206.24,206.29,302.24,302.29") Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если БухгалтерскийУчетВызовСервераПовтИсп.ВидСубконтоОбязательный(Счет, "ДокументыРасчетов") Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьВалютныйУчет") И
			ЗначениеЗаполнено(Валюта) И (Валюта <> БухгалтерскийУчетВызовСервераПовтИсп.ВалютаРегламентированногоУчета()) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Если УчетУСНВызовСервера.ПрименяетсяУСН(Организация, Период)
		  И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(КФО) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ВедетсяУчетОбязательств(ВидДоговора) Экспорт
	
	Возврат ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем")
		И ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СОтправителемТрансферта");
	
КонецФункции

Функция ДопустимыеСчетаРасчетовПоВидуДоговора(ВидДоговора) Экспорт
	
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВыпускЦенныхБумаг") Тогда
		Возврат "301.12,301.42";
	ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ПолученныйКредит") Тогда
		Возврат "301.00";
	ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ПредоставленныйКредит") Тогда
		Возврат "207.00";
	ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком") Тогда
		Возврат "302.00,304.01";
	ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СоглашениеОСубсидии") Тогда
		Возврат "302.00";
	ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем")
		ИЛИ ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СОтправителемТрансферта") Тогда
		Возврат "205.00,209.00";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ЗАЧЕТ АВАНСОВ ПО ДОКУМЕНТАМ
//

Процедура УправлениеЭлементамиЗачетаАвансов(Форма, Знач Объект = Неопределено) Экспорт

	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	Элементы = Форма.Элементы;
	
	Если Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументу") Тогда
		Элементы.ЗачетАвансов_Страницы.ТекущаяСтраница = Элементы.ЗачетАвансов_Страница;
		Элементы.ЗачетАванса.Доступность = Истина;
		Элементы.ЗачетАвансов_Страницы.ТолькоПросмотр = Ложь;
	ИначеЕсли Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически") Тогда
		Элементы.ЗачетАвансов_Страницы.ТекущаяСтраница = Элементы.ЗачетАвансов_ПустаяСтраница;
		Элементы.ЗачетАванса.Доступность = Истина;
		Элементы.ЗачетАвансов_Страницы.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ЗачетАванса.Доступность = ЛОЖЬ;
		Элементы.ЗачетАвансов_Страницы.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры


#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать функцию УчетРасчетов.ПараметрыДопСубконтоРасчетов().
// 
Функция ВидДопСубконтоПоСчетуРасчетов(СчетРасчетов) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СчетРасчетов)
		ИЛИ НЕ БухгалтерскийУчетКлиентСервер.СчетВИерархии(СчетРасчетов, "205.00,209.00,206.00,302.00") Тогда
		Возврат ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка");
	КонецЕсли;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетРасчетов);
	Для НомерСубконто = 1 По СвойстваСчета.КоличествоСубконто Цикл
	
		ВидСубконто = СвойстваСчета["ВидСубконто" + НомерСубконто];
		Если ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Контрагенты")
		 ИЛИ ВидСубконто = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Договоры") Тогда
			Продолжить; // Пропускаем.
		Иначе
			Возврат ВидСубконто;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка");
	
КонецФункции

// Устарела. Следует использовать функцию УчетРасчетов.ЗаполнитьПараметрыСчетаРасчетовВРасшифровкеПлатежа().
// 
Процедура ЗаполнитьПараметрыСчетаРасчетовВРасшифровкеПлатежа(Расшифровка, КЭК, ДопустимыеСчета, Знач НаДату, Знач Организация) Экспорт
	
	Если Расшифровка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСчетаРасчетов = УчетРасчетовВызовСервера.ПараметрыСчетаРасчетовПоКЭК(КЭК, ДопустимыеСчета, НаДату, Организация);
	ЗаполнитьЗначенияСвойств(Расшифровка, ПараметрыСчетаРасчетов, "СчетРасчетов,ДопСубконтоРасчетовВид,ДопСубконтоРасчетовНомер");
	
	Если Не ЗначениеЗаполнено(Расшифровка.ДопСубконтоРасчетовВид) Тогда
		Расшифровка.ДопСубконтоРасчетовДоступность = 0; // Не показывать.
	ИначеЕсли ПараметрыСчетаРасчетов.ДопСубконтоРасчетовОбязательный Тогда
		Расшифровка.ДопСубконтоРасчетовДоступность = 1; // Обязательное субконто.
	Иначе
		Расшифровка.ДопСубконтоРасчетовДоступность = 2; // Необязательное субконто.
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Следует использовать функцию УчетРасчетов.ИспользуетсяНастройкаПогашенияЗадолженности().
// 
Функция ИспользуетсяНастройкаПогашенияЗадолженности(СчетРасчетов) Экспорт
	
	Возврат БухгалтерскийУчетКлиентСервер.СчетВИерархии(СчетРасчетов, "205.00,209.00,206.00,302.00")
		И НЕ БухгалтерскийУчетКлиентСервер.СчетВИерархии(СчетРасчетов, "205.2А,205.3А,205.7А,205.8А,209.7А,209.8А");
	
КонецФункции

// Устарела. Следует использовать функцию УчетРасчетов.УчетАгентскогоНДС().
// 
Функция УчетАгентскогоНДС(Договор) Экспорт
	
	Возврат ЗначениеЗаполнено(Договор)
		И Договор.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком")
		И (Договор.ТипДоговораНДС = ПредопределенноеЗначение("Перечисление.ТипыДоговоровДляНДС.АгентскийДоговор")
		ИЛИ Договор.ТипДоговораНДС = ПредопределенноеЗначение("Перечисление.ТипыДоговоровДляНДС.АгентскийДоговорНерезидент"));
	
КонецФункции

#КонецОбласти
