#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЗаполнитьНаОсновании(ОснованиеСсылка, Объект, ОписаниеОшибки = "", ВозвратТиповаяОперация = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОснованиеСсылка) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен документ основания'");
		Возврат Ложь;
	КонецЕсли;	
	
	Если НЕ ЗаполнитьПоТипуДокументаОснования(ОснованиеСсылка, Объект, ОписаниеОшибки, ВозвратТиповаяОперация) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_ГТДИмпорт(ОснованиеСсылка, ВозвратДанные) Экспорт
	
	ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ВалютыНДС = ПолучитьВалютыНДСГТДИмпорт(ОснованиеСсылка);
	
	Если ВалютыНДС.Количество() = 1 Тогда
		// Одинаковая валюта НДС во всех строках табличной части.
		// Применяем указанную валюту.
		
		ВалютаНДС = ВалютыНДС[0];
	Иначе
		// Две различные валюты НДС в различных строках табличной части.
		// Применяем рубли. Валютные суммы переводим в рубли.
		
		ВалютаНДС = ВалютаРУ;
	КонецЕсли;
	
	НДСВВалюте = (ВалютаНДС <> ВалютаРУ);
	
	Данные = ПрочитатьДокументГТДИмпорт(ОснованиеСсылка, НДСВВалюте);
	
	ТаблицаШапка		= Данные["Шапка"];
	ТаблицаСоставНФА	= Данные["СоставНФА"];
	
	// Шапка
	
	СтруктураШапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	
	СтруктураШапка.Вставить("ВалютаДокумента", ВалютаНДС);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ТекущаяДатаСеанса());
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(СтруктураШапка, ДополнительныеПараметры);
	
	СтруктураШапка.Вставить("КодВидаОперации", КодВидаОперации);
	
	СтруктураШапка.Вставить("Дата", ТекущаяДатаСеанса());
	
	// Табличная часть
	
	ТипСчет	= Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	ТипКПС	= Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
	ТипЧисло= Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2));
	
	ТаблицаСоставНФА.Колонки.Добавить("Счет30304",	ТипСчет);
	ТаблицаСоставНФА.Колонки.Добавить("КПС30304",	ТипКПС);
	ТаблицаСоставНФА.Колонки.Добавить("КПСВычетКт",	ТипКПС);
	ТаблицаСоставНФА.Колонки.Добавить("Сумма",		ТипЧисло);
	ТаблицаСоставНФА.Колонки.Добавить("Всего",		ТипЧисло);
	
	Основание_ТиповаяОперация = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ОснованиеСсылка,
		"КПСОперации");
	
	КПСВычетКт = Основание_ТиповаяОперация["КПСОперации"];
	
	СтруктураШапкиДокументаДляАвтозаполнения = УчетНДС.ПолучитьСтруктуруШапкиДокументаДляАвтозаполнения();
	
	ЗаполнитьЗначенияСвойств(СтруктураШапкиДокументаДляАвтозаполнения, СтруктураШапка);
	
	ЗначенияДляАвтозаполнения = УчетНДС.ПолучитьЗначенияДляАвтозаполнения(СтруктураШапкиДокументаДляАвтозаполнения);
	
	Счет30304	= ЗначенияДляАвтозаполнения["КэшНДС_Счет30304"];
	КПС30304	= ЗначенияДляАвтозаполнения["КэшНДС_КПС30304"];
	
	ТаблицаСоставНФА.ЗаполнитьЗначения(КПСВычетКт,	"КПСВычетКт");
	ТаблицаСоставНФА.ЗаполнитьЗначения(Счет30304,	"Счет30304");
	ТаблицаСоставНФА.ЗаполнитьЗначения(КПС30304,	"КПС30304");
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	ВозвратДанные = Новый Структура();
	ВозвратДанные.Вставить("Шапка",				СтруктураШапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	// Приводим все суммы табличной части к одной валюте
	
	ПривестиСуммыКОднойВалютеГТДИмпорт(ВозвратДанные, ВалютаНДС);
	
	// Удаление лишних свойств - обязательно последним действием
	
	УдалитьЛишниеСвойстваИКолонкиГТДИмпорт(ВозвратДанные);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_СчетФактураВыданный(ОснованиеСсылка, Объект, ВозвратДанные) Экспорт
	
	// Возвращаемое значение:
	ВозвратДанные = ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата();
	
	// Получаем данные:
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокументОснованиеСсылка",	ОснованиеСсылка);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ДокументОснованиеСсылка	КАК ДокументОснование,
	|	Организация					КАК Организация,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	Контрагент					КАК Контрагент,
	|	Договор						КАК Договор,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	ВалютаДокумента				КАК ВалютаДокумента,
	|	РегистрацияВДопЛисте		КАК ДопЛист,
	|	КорректируемыйПериод		КАК КорректируемыйПериод,
	|	ДатаДокументаОплаты			КАК ДатаОплаты
	|ИЗ
	|	Документ.СчетФактураВыданный	КАК СчетФактураВыданный
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НФА					КАК НФА,
	|	ВЫБОР
	|		КОГДА НЕ Ссылка.ДокументОснование = НЕОПРЕДЕЛЕНО ТОГДА
	|			Ссылка.ДокументОснование
	|		ИНАЧЕ
	|			Ссылка
	|	КОНЕЦ				КАК ОбъектНалогообложения,
	|	Ссылка.КФО			КАК КФО,
	|	СчетВычетКт			КАК СчетВычетКт,
	|	КПСВычетКт			КАК КПСВычетКт,
	|	Счет30304			КАК Счет30304,
	|	КПС30304			КАК КПС30304,
	|	СтавкаНДС			КАК СтавкаНДС,
	|	Сумма				КАК Сумма,
	|	СуммаНДС			КАК СуммаНДС,
	|	Всего				КАК Всего
	|ИЗ
	|	Документ.СчетФактураВыданный.СоставНФА	КАК СоставНФА
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;";
	
	РезультатыЗаполнения = ЗапросЗаполнение.ВыполнитьПакет();
	
	ТаблицаШапка		= РезультатыЗаполнения[0].Выгрузить();
	ТаблицаСоставНФА	= РезультатыЗаполнения[1].Выгрузить();
	
	Если ТаблицаШапка.Количество() > 0 Тогда
		Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	Иначе
		Шапка = Новый Структура();
	КонецЕсли;
	
	УчетНДС.ЗаполнитьВидЦенности(ТаблицаСоставНФА, Шапка["ПричинаНалогообложения"]);
	
	КолонкиГруппировок = "
		|ВидЦенности,
		|ОбъектНалогообложения,
		|КФО,
		|СчетВычетКт,
		|КПСВычетКт,
		|Счет30304,
		|КПС30304,
		|СтавкаНДС";
		
	КолонкиСуммирования = "
		|Сумма,
		|СуммаНДС,
		|Всего";
	
	ТаблицаСоставНФА.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	ДатаСоВременем = ТекущаяДатаСеанса();
	ДатаБезВремени = НачалоДня(ДатаСоВременем);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ДатаСоВременем);
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(Шапка, ДополнительныеПараметры);
	
	Шапка.Вставить("КодВидаОперации",		КодВидаОперации);
	Шапка.Вставить("Дата",					ДатаСоВременем);
	Шапка.Вставить("ДатаПринятияКУчету",	ДатаБезВремени);
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	ЭтоОбработкаПроверкиЗаполнения = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ЭтоОбработкаПроверкиЗаполнения");
	
	Если УчетНДСКлиентСервер.ДоступноУказаниеСчетовФактурНаОтгрузку(Шапка.ПричинаНалогообложения)
		И Не ЭтоОбработкаПроверкиЗаполнения Тогда
		Отбор = ПолучитьОтборОстаткиВходящийНДСАвансыПолученные(Шапка, ТаблицаСоставНФА, Объект.Ссылка);
		
		ТаблицаДокументов = УчетНДС.ПолучитьТаблицуДокументовСчетовФактурНаОтгрузку(Отбор, Объект.Ссылка);
		
		ТаблицаДокументов.Свернуть("СчетФактура,Дата,Номер");
		
		ТабличныеЧасти.Вставить("СчетаФактурыНаОтгрузку", ТаблицаДокументов);
	КонецЕсли;
	
	// Искомые данные:
	ВозвратДанные.Вставить("Шапка",				Шапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_СчетФактураПолученный(ОснованиеСсылка, ВозвратДанные) Экспорт
	
	// Возвращаемое значение:
	ВозвратДанные = ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата();
	
	// Значения реквизитов типовой операции документа-основания:
	Основание_ТиповаяОперацияСсылка		= БухгалтерскиеОперацииСервер.БухгалтерскаяОперацияДокумента(ОснованиеСсылка);
	Основание_РеквизитыТиповойОперации	= Справочники.ТиповыеОперации.ПустаяСтруктураДопРеквизитовОперации(Основание_ТиповаяОперацияСсылка);
	Основание_РеквизитыТиповойОперации	= БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ОснованиеСсылка, Основание_РеквизитыТиповойОперации);
	
	// Каноническая типовая операция документа-основания:
	Основание_ТиповаяОперация = Новый Структура();
	Основание_ТиповаяОперация.Вставить("КПС30304");
	СинонимыРеквизитов = Новый Структура();
	СинонимыРеквизитов.Вставить("КПС30304", "КПС_30304");
	УчетНДС.ЗаполнитьЗначенияСвойствТиповойОперации(Основание_ТиповаяОперация, Основание_РеквизитыТиповойОперации, СинонимыРеквизитов);
	
	// Получаем данные:
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокументОснованиеСсылка",	ОснованиеСсылка);
	ЗапросЗаполнение.УстановитьПараметр("КПС30304",					Основание_ТиповаяОперация["КПС30304"]);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ДокументОснованиеСсылка	КАК ДокументОснование,
	|	Организация					КАК Организация,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	Контрагент					КАК Контрагент,
	|	Договор						КАК Договор,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	ВалютаДокумента				КАК ВалютаДокумента,
	|	РегистрацияВДопЛисте		КАК ДопЛист,
	|	КорректируемыйПериод		КАК КорректируемыйПериод,
	|	ДатаДокументаОплаты			КАК ДатаОплаты
	|ИЗ
	|	Документ.СчетФактураПолученный	КАК СчетФактураПолученный
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НФА					КАК НФА,
	|	ВЫБОР
	|		КОГДА НЕ ДокументОснование = НЕОПРЕДЕЛЕНО ТОГДА
	|			ДокументОснование
	|		ИНАЧЕ
	|			Ссылка
	|	КОНЕЦ				КАК ОбъектНалогообложения,
	|	КФО					КАК КФО,
	|	СчетВычетКт			КАК СчетВычетКт,
	|	КПСВычетКт			КАК КПСВычетКт,
	|	Счет30304			КАК Счет30304,
	|	&КПС30304			КАК КПС30304,
	|	СтавкаНДС			КАК СтавкаНДС,
	|	Сумма				КАК Сумма,
	|	СуммаНДС			КАК СуммаНДС,
	|	Всего				КАК Всего
	|ИЗ
	|	Документ.СчетФактураПолученный.СоставНФА	КАК СоставНФА
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|	И НДСКВычету
	|;";
	
	РезультатыЗаполнения = ЗапросЗаполнение.ВыполнитьПакет();
	
	ТаблицаШапка		= РезультатыЗаполнения[0].Выгрузить();
	ТаблицаСоставНФА	= РезультатыЗаполнения[1].Выгрузить();
	
	Если ТаблицаШапка.Количество() > 0 Тогда
		Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	Иначе
		Шапка = Новый Структура();
	КонецЕсли;
	
	УчетНДС.ЗаполнитьВидЦенности(ТаблицаСоставНФА, Шапка["ПричинаНалогообложения"]);
	
	КолонкиГруппировок = "
		|ВидЦенности,
		|ОбъектНалогообложения,
		|КФО,
		|СчетВычетКт,
		|КПСВычетКт,
		|Счет30304,
		|КПС30304,
		|СтавкаНДС";
		
	КолонкиСуммирования = "
		|Сумма,
		|СуммаНДС,
		|Всего";
	
	ТаблицаСоставНФА.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ТекущаяДатаСеанса());
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(Шапка, ДополнительныеПараметры);
	
	Шапка.Вставить("КодВидаОперации", КодВидаОперации);
	
	Шапка.Вставить("Дата", ТекущаяДатаСеанса());
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	// Искомые данные:
	ВозвратДанные.Вставить("Шапка",				Шапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_ИсправительныйСчетФактураВыданный(ОснованиеСсылка, ВозвратДанные) Экспорт
	
	Основание_ТиповаяОперация = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ОснованиеСсылка,
		"КФО,КПС,КПС_30304");
	
	НаДату = Неопределено;
	Счет30304 = БухгалтерскийУчетКлиентСервер.СчетПоКоду("303.04", НаДату);
	
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокументОснованиеСсылка",	ОснованиеСсылка);
	ЗапросЗаполнение.УстановитьПараметр("КФО",						Основание_ТиповаяОперация["КФО"]);
	ЗапросЗаполнение.УстановитьПараметр("КПС",						Основание_ТиповаяОперация["КПС"]);
	ЗапросЗаполнение.УстановитьПараметр("Счет30304",				Счет30304);
	ЗапросЗаполнение.УстановитьПараметр("КПС30304",					Основание_ТиповаяОперация["КПС_30304"]);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организация					КАК Организация,
	|	Подразделение				КАК Подразделение,
	|	ВалютаДокумента				КАК ВалютаДокумента,
	|	Договор						КАК Договор,
	|	&ДокументОснованиеСсылка	КАК ДокументОснование,
	|	ИФО							КАК ИФО,
	|	КодВидаОперации				КАК КодВидаОперации,
	|	Контрагент					КАК Контрагент,
	|	КорректируемыйПериод		КАК КорректируемыйПериод,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	Ответственный				КАК Ответственный
	|ИЗ
	|	Документ.ИсправительныйСчетФактураВыданный	КАК ИсправительныйСчетФактураВыданный
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НФА												КАК НФА,
	|	НЕОПРЕДЕЛЕНО									КАК ОбъектНалогообложения,
	|	&КФО											КАК КФО,
	|	ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)			КАК СчетВычетКт,
	|	&КПС											КАК КПСВычетКт,
	|	&Счет30304										КАК Счет30304,
	|	&КПС30304										КАК КПС30304,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	Сумма											КАК Сумма,
	|	СуммаНДС										КАК СуммаНДС,
	|	Всего											КАК Всего
	|ИЗ
	|	Документ.ИсправительныйСчетФактураВыданный.СоставНФА	КАК СоставНФА
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;";
	
	РезультатыЗаполнения = ЗапросЗаполнение.ВыполнитьПакет();
	
	// [0]. Данные для реквизитов шапки
	ТаблицаШапка = РезультатыЗаполнения[0].Выгрузить();
	
	// [1]. Данные для табличной части СоставНФА
	ТаблицаСоставНФА = РезультатыЗаполнения[1].Выгрузить();
	
	Если ТаблицаШапка.Количество() > 0 Тогда
		Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	Иначе
		Шапка = Новый Структура();
	КонецЕсли;
	
	УчетНДС.ЗаполнитьВидЦенности(ТаблицаСоставНФА, Шапка["ПричинаНалогообложения"]);
	
	КолонкиГруппировок = "
		|ВидЦенности,
		|ОбъектНалогообложения,
		|КФО,
		|СчетВычетКт,
		|КПСВычетКт,
		|Счет30304,
		|КПС30304,
		|СтавкаНДС";
		
	КолонкиСуммирования = "
		|Сумма,
		|СуммаНДС,
		|Всего";
	
	ТаблицаСоставНФА.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ТекущаяДатаСеанса());
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(Шапка, ДополнительныеПараметры);
	
	Шапка.Вставить("КодВидаОперации", КодВидаОперации);
	
	Шапка.Вставить("Дата", ТекущаяДатаСеанса());
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	// Искомые данные
	ВозвратДанные = ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата();
	ВозвратДанные.Вставить("Шапка",				Шапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_ИсправительныйСчетФактураПолученный(ОснованиеСсылка, ВозвратДанные) Экспорт
	
	Основание_ТиповаяОперация = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ОснованиеСсылка,
		"КПС_30304");
	
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокументОснованиеСсылка",	ОснованиеСсылка);
	ЗапросЗаполнение.УстановитьПараметр("КПС30304",					Основание_ТиповаяОперация["КПС_30304"]);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организация					КАК Организация,
	|	Подразделение				КАК Подразделение,
	|	ВалютаДокумента				КАК ВалютаДокумента,
	|	Договор						КАК Договор,
	|	&ДокументОснованиеСсылка	КАК ДокументОснование,
	|	ИФО							КАК ИФО,
	|	КодВидаОперации				КАК КодВидаОперации,
	|	Контрагент					КАК Контрагент,
	|	КорректируемыйПериод		КАК КорректируемыйПериод,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	Ответственный				КАК Ответственный
	|ИЗ
	|	Документ.ИсправительныйСчетФактураПолученный	КАК ИсправительныйСчетФактураПолученный
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НФА												КАК НФА,
	|	ДокументОснование								КАК ОбъектНалогообложения,
	|	КФО												КАК КФО,
	|	СчетВычетКт										КАК СчетВычетКт,
	|	КПСВычетКт										КАК КПСВычетКт,
	|	Счет30304										КАК Счет30304,
	|	&КПС30304										КАК КПС30304,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	Сумма											КАК Сумма,
	|	СуммаНДС										КАК СуммаНДС,
	|	Всего											КАК Всего
	|ИЗ
	|	Документ.ИсправительныйСчетФактураПолученный.СоставНФА	КАК СоставНФА
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|	И НДСКВычету
	|;";
	
	РезультатыЗаполнения = ЗапросЗаполнение.ВыполнитьПакет();
	
	// [0]. Данные для реквизитов шапки
	ТаблицаШапка = РезультатыЗаполнения[0].Выгрузить();
	
	// [1]. Данные для табличной части СоставНФА
	ТаблицаСоставНФА = РезультатыЗаполнения[1].Выгрузить();
	
	Если ТаблицаШапка.Количество() > 0 Тогда
		Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	Иначе
		Шапка = Новый Структура();
	КонецЕсли;
	
	УчетНДС.ЗаполнитьВидЦенности(ТаблицаСоставНФА, Шапка["ПричинаНалогообложения"]);
	
	КолонкиГруппировок = "
		|ВидЦенности,
		|ОбъектНалогообложения,
		|КФО,
		|СчетВычетКт,
		|КПСВычетКт,
		|Счет30304,
		|КПС30304,
		|СтавкаНДС";
		
	КолонкиСуммирования = "
		|Сумма,
		|СуммаНДС,
		|Всего";
	
	ТаблицаСоставНФА.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ТекущаяДатаСеанса());
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(Шапка, ДополнительныеПараметры);
	
	Шапка.Вставить("КодВидаОперации", КодВидаОперации);
	
	Шапка.Вставить("Дата", ТекущаяДатаСеанса());
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	// Искомые данные
	ВозвратДанные = ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата();
	ВозвратДанные.Вставить("Шапка",				Шапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_КорректировочныйСчетФактураВыданный(ОснованиеСсылка, ВозвратДанные) Экспорт
	
	Основание_ТиповаяОперация = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ОснованиеСсылка,
		"КФО,КПС,КПС_30304");
	
	НаДату = Неопределено;
	Счет30304 = БухгалтерскийУчетКлиентСервер.СчетПоКоду("303.04", НаДату);
	
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокументОснованиеСсылка",	ОснованиеСсылка);
	ЗапросЗаполнение.УстановитьПараметр("КФО",						Основание_ТиповаяОперация["КФО"]);
	ЗапросЗаполнение.УстановитьПараметр("КПС",						Основание_ТиповаяОперация["КПС"]);
	ЗапросЗаполнение.УстановитьПараметр("Счет30304",				Счет30304);
	ЗапросЗаполнение.УстановитьПараметр("КПС30304",					Основание_ТиповаяОперация["КПС_30304"]);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организация					КАК Организация,
	|	Подразделение				КАК Подразделение,
	|	ВалютаДокумента				КАК ВалютаДокумента,
	|	Договор						КАК Договор,
	|	&ДокументОснованиеСсылка	КАК ДокументОснование,
	|	ИФО							КАК ИФО,
	|	КодВидаОперации				КАК КодВидаОперации,
	|	Контрагент					КАК Контрагент,
	|	КорректируемыйПериод		КАК КорректируемыйПериод,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	Ответственный				КАК Ответственный
	|ИЗ
	|	Документ.КорректировочныйСчетФактураВыданный	КАК КорректировочныйСчетФактураВыданный
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НФА												КАК НФА,
	|	Ссылка.ДокументОснование						КАК ОбъектНалогообложения,
	|	&КФО											КАК КФО,
	|	ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)			КАК СчетВычетКт,
	|	&КПС											КАК КПСВычетКт,
	|	&Счет30304										КАК Счет30304,
	|	&КПС30304										КАК КПС30304,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	Сумма											КАК Сумма,
	|	СуммаНДС										КАК СуммаНДС,
	|	Всего											КАК Всего
	|ИЗ
	|	Документ.КорректировочныйСчетФактураВыданный.СоставНФА	КАК СоставНФА
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;";
	
	РезультатыЗаполнения = ЗапросЗаполнение.ВыполнитьПакет();
	
	// [0]. Данные для реквизитов шапки
	ТаблицаШапка = РезультатыЗаполнения[0].Выгрузить();
	
	// [1]. Данные для табличной части СоставНФА
	ТаблицаСоставНФА = РезультатыЗаполнения[1].Выгрузить();
	
	Если ТаблицаШапка.Количество() > 0 Тогда
		Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	Иначе
		Шапка = Новый Структура();
	КонецЕсли;
	
	УчетНДС.ЗаполнитьВидЦенности(ТаблицаСоставНФА, Шапка["ПричинаНалогообложения"]);
	
	КолонкиГруппировок = "
		|ВидЦенности,
		|ОбъектНалогообложения,
		|КФО,
		|СчетВычетКт,
		|КПСВычетКт,
		|Счет30304,
		|КПС30304,
		|СтавкаНДС";
		
	КолонкиСуммирования = "
		|Сумма,
		|СуммаНДС,
		|Всего";
	
	ТаблицаСоставНФА.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ТекущаяДатаСеанса());
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(Шапка, ДополнительныеПараметры);
	
	Шапка.Вставить("КодВидаОперации", КодВидаОперации);
	
	Шапка.Вставить("Дата", ТекущаяДатаСеанса());
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	// Искомые данные
	ВозвратДанные = ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата();
	ВозвратДанные.Вставить("Шапка",				Шапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_КорректировочныйСчетФактураПолученный(ОснованиеСсылка, ВозвратДанные) Экспорт
	
	Основание_ТиповаяОперация = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ОснованиеСсылка,
		"КПС_30304");
	
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокументОснованиеСсылка",	ОснованиеСсылка);
	ЗапросЗаполнение.УстановитьПараметр("КПС30304",					Основание_ТиповаяОперация["КПС_30304"]);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организация					КАК Организация,
	|	Подразделение				КАК Подразделение,
	|	ВалютаДокумента				КАК ВалютаДокумента,
	|	Договор						КАК Договор,
	|	&ДокументОснованиеСсылка	КАК ДокументОснование,
	|	ИФО							КАК ИФО,
	|	КодВидаОперации				КАК КодВидаОперации,
	|	Контрагент					КАК Контрагент,
	|	КорректируемыйПериод		КАК КорректируемыйПериод,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	Ответственный				КАК Ответственный
	|ИЗ
	|	Документ.КорректировочныйСчетФактураПолученный	КАК КорректировочныйСчетФактураПолученный
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НФА												КАК НФА,
	|	ВЫБОР
	|		КОГДА ДокументОснование <> НЕОПРЕДЕЛЕНО ТОГДА
	|			ДокументОснование
	|		ИНАЧЕ
	|			Ссылка
	|	КОНЕЦ											КАК ОбъектНалогообложения,
	|	КФО												КАК КФО,
	|	СчетВычетКт										КАК СчетВычетКт,
	|	КПСВычетКт										КАК КПСВычетКт,
	|	Счет30304										КАК Счет30304,
	|	&КПС30304										КАК КПС30304,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	Сумма											КАК Сумма,
	|	СуммаНДС										КАК СуммаНДС,
	|	Всего											КАК Всего
	|ИЗ
	|	Документ.КорректировочныйСчетФактураПолученный.СоставНФА	КАК СоставНФА
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|	И НДСКВычету
	|;";
	
	РезультатыЗаполнения = ЗапросЗаполнение.ВыполнитьПакет();
	
	// [0]. Данные для реквизитов шапки
	ТаблицаШапка = РезультатыЗаполнения[0].Выгрузить();
	
	// [1]. Данные для табличной части СоставНФА
	ТаблицаСоставНФА = РезультатыЗаполнения[1].Выгрузить();
	
	Если ТаблицаШапка.Количество() > 0 Тогда
		Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	Иначе
		Шапка = Новый Структура();
	КонецЕсли;
	
	УчетНДС.ЗаполнитьВидЦенности(ТаблицаСоставНФА, Шапка["ПричинаНалогообложения"]);
	
	КолонкиГруппировок = "
		|ВидЦенности,
		|ОбъектНалогообложения,
		|КФО,
		|СчетВычетКт,
		|КПСВычетКт,
		|Счет30304,
		|КПС30304,
		|СтавкаНДС";
		
	КолонкиСуммирования = "
		|Сумма,
		|СуммаНДС,
		|Всего";
	
	ТаблицаСоставНФА.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ТекущаяДатаСеанса());
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(Шапка, ДополнительныеПараметры);
	
	Шапка.Вставить("КодВидаОперации", КодВидаОперации);
	
	Шапка.Вставить("Дата", ТекущаяДатаСеанса());
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	// Искомые данные
	ВозвратДанные = ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата();
	ВозвратДанные.Вставить("Шапка",				Шапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_РегистрацияСтрокиКнигиПродаж(ОснованиеСсылка, ВозвратДанные) Экспорт
	
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокументОснованиеСсылка", ОснованиеСсылка);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организация					КАК Организация,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	ДопЛист						КАК ДопЛист,
	|	КорректируемыйПериод		КАК КорректируемыйПериод,
	|	ДатаОплаты					КАК ДатаОплаты,
	|	Комментарий					КАК Комментарий,
	|	&ДокументОснованиеСсылка	КАК ДокументОснование,
	|	Контрагент					КАК Контрагент,
	|	Договор						КАК Договор,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	ВалютаДокумента				КАК ВалютаДокумента,
	|	КодВидаОперации				КАК КодВидаОперации,
	|	Ответственный				КАК Ответственный
	|ИЗ
	|	Документ.РегистрацияСтрокиКнигиПродаж	КАК РегистрацияСтрокиКнигиПродаж
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сумма													КАК Сумма,
	|	СтавкаНДС												КАК СтавкаНДС,
	|	СуммаНДС												КАК СуммаНДС,
	|	Всего													КАК Всего,
	|	КФО														КАК КФО,
	|	Счет30304												КАК Счет30304,
	|	КПС30304												КАК КПС30304,
	|	ОбъектНалогообложения									КАК ОбъектНалогообложения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.ПустаяСсылка)	КАК ВидЦенности
	|ИЗ
	|	Документ.РегистрацияСтрокиКнигиПродаж.СуммыНДС	КАК СуммыНДС
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;";
	
	РезультатыЗаполнения = ЗапросЗаполнение.ВыполнитьПакет();
	
	// [0]. Данные для реквизитов шапки
	ТаблицаШапка = РезультатыЗаполнения[0].Выгрузить();
	
	// [1]. Данные для табличной части СоставНФА
	ТаблицаСоставНФА = РезультатыЗаполнения[1].Выгрузить();
	
	Если ТаблицаШапка.Количество() > 0 Тогда
		Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаШапка[0]);
	Иначе
		Шапка = Новый Структура();
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"РегистрацияСтрокиКнигиПокупок");
	ДополнительныеПараметры.Вставить("Дата",						ТекущаяДатаСеанса());
	КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(Шапка, ДополнительныеПараметры);
	
	Шапка.Вставить("КодВидаОперации", КодВидаОперации);
	
	Шапка.Вставить("Дата", ТекущаяДатаСеанса());
	
	ТабличныеЧасти = Новый Структура("СоставНФА", ТаблицаСоставНФА);
	
	// Искомые данные
	ВозвратДанные = ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата();
	ВозвратДанные.Вставить("Шапка",				Шапка);
	ВозвратДанные.Вставить("ТабличныеЧасти",	ТабличныеЧасти);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьОтборОстаткиВходящийНДСАвансыПолученные(Шапка, СоставНФА, ОбъектСсылка) Экспорт
	
	Отбор = УчетНДС.НовыйОтборОстаткиВходящийНДСАвансыПолученные();
	
	УчетНДС.УстановитьДатуОтбораОстатковВходящийНДСАвансыПолученныеДляТаблицыСФНаОтгрузку(Отбор,
			Шапка.ДатаПринятияКУчету, Шапка.Дата, ОбъектСсылка);
			
	Отбор.Организация	= Шапка.Организация;
	
	Отбор.СписокКонтрагентов.Добавить(Шапка.Контрагент);
	Отбор.СписокДоговоров.Добавить(Шапка.Договор);
	
	Если ТипЗнч(СоставНФА) = Тип("ТаблицаЗначений") Тогда
		ВремТаблица = СоставНФА.Скопировать(, "КФО");
	ИначеЕсли ТипЗнч(СоставНФА) = Тип("ДанныеФормыКоллекция") Тогда
		ВремТаблица = СоставНФА.Выгрузить(, "КФО");
	КонецЕсли;
	ВремТаблица.Свернуть("КФО");
	СписокКФО = ВремТаблица.ВыгрузитьКолонку("КФО");
	Отбор.СписокКФО = СписокКФО;
	
	Если ЗначениеЗаполнено(Шапка.ДокументОснование) Тогда
		Отбор.СписокСчетовФактурНаАванс.Добавить(Шапка.ДокументОснование);
	КонецЕсли;
	
	Возврат Отбор;
	
КонецФункции

Функция ЕстьОшибкиЗаполнения(ДокументОбъект) Экспорт
	
	Перем ОписаниеОшибки;
	
	Если НЕ ЗначениеЗаполнено(ДокументОбъект["ДокументОснование"]) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	// Проверяемые реквизиты шапки документа:
	СравниваемыеРеквизитыШапки = Новый Структура("
		|Организация,
		|Контрагент,
		|Договор,
		|ПричинаНалогообложения,
		|ВалютаДокумента");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		СравниваемыеРеквизитыШапки.Вставить("ИФО");
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		СравниваемыеРеквизитыШапки.Вставить("Подразделение");
	КонецЕсли;
	
	// Сравниваем реквизиты документа и счета-фактуры:
	ДанныеЗаполненияНаОсновании = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СравниваемыеРеквизитыШапки);
	ДанныеЗаполненияНаОсновании.Вставить("СоставНФА", ДокументОбъект["СоставНФА"].ВыгрузитьКолонки());
	ДанныеЗаполненияНаОсновании.Вставить("ЭтоОбработкаПроверкиЗаполнения", Истина);
	
	Если ЗаполнитьНаОсновании(ДокументОбъект["ДокументОснование"], ДанныеЗаполненияНаОсновании, ОписаниеОшибки) Тогда
		// 1) Реквизиты шапки:
		ЗапрашиваемыеСведения = "РазличныеЗначения, ЗначенияСовпадаютПолностью";
		РезультатСравнения = ОбщегоНазначенияБГУ.СравнитьЭлементыКоллекций(ДокументОбъект, ДанныеЗаполненияНаОсновании, СравниваемыеРеквизитыШапки, ЗапрашиваемыеСведения);
		Если НЕ РезультатСравнения["ЗначенияСовпадаютПолностью"] Тогда
			ЕстьОшибкиЗаполнения = Истина;
			
			Для Каждого ИмяРеквизита Из РезультатСравнения["РазличныеЗначения"] Цикл
				ИмяПоляДляВыводаСообщений = ИмяРеквизита;
				ТекстШаблон = НСтр("ru='Значение поля %1 отличается от значения в счете-фактуре'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблон, ИмяРеквизита);
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					ДокументОбъект["Ссылка"],
					"Объект." + ИмяПоляДляВыводаСообщений);
			КонецЦикла;
		КонецЕсли;
		
		// 2) Таблица СоставНФА:
		ИмяТаблЧастиДляВыводаСообщений		= "СоставНФА";
		КоллекцияИменКолонокСвязи			= "ВидЦенности, СтавкаНДС, КФО";
		ЭтоАванс = УчетНДСПовтИсп.Аванс(ДокументОбъект["ПричинаНалогообложения"]);
		Если ЭтоАванс Тогда
			КоллекцияИменКолонокПоказателей	= "СуммаНДС, Всего";
		Иначе
			КоллекцияИменКолонокПоказателей	= "Сумма, СуммаНДС";
		КонецЕсли;
		
		Если ДокументОбъект["Аннулирование"] Тогда
			// Аннулирование.
			// Требуем равенства сумм в табличных частях документа и основания.
			
			Таблица1 = ДокументОбъект["СоставНФА"].Выгрузить();
			Таблица2 = ДанныеЗаполненияНаОсновании["СоставНФА"];
			ЗапрашиваемыеСведения = "ПолноеВзаимноеСписаниеПоказателей";
			РезультатСравнения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
				Таблица1,
				Таблица2,
				КоллекцияИменКолонокСвязи,
				КоллекцияИменКолонокПоказателей,
				ЗапрашиваемыеСведения);
			
			Если НЕ РезультатСравнения["ПолноеВзаимноеСписаниеПоказателей"] Тогда
				//ЕстьОшибкиЗаполнения = Истина;
				
				ТекстСообщения = НСтр("ru='Таблица ""Состав НФА"" отличается от таблицы счета-фактуры.
					|При аннулировании счета-фактуры таблицы должны совпадать.
					|
					|Чтобы заполнить таблицу актуальными данными, можно нажать кнопку ""Заполнить по счету-фактуре""'");
				ОбщегоНазначения.СообщитьПользователю(
					ТекстСообщения,
					ДокументОбъект["Ссылка"],
					"Объект." + ИмяТаблЧастиДляВыводаСообщений);
			КонецЕсли;
			
		Иначе
			// Регистрация.
			// Информируем о превышении сумм из табличной части документа
			// показателей из основания.
			
			ПредставленияПолей = Новый Соответствие();
			ПредставленияПолей.Вставить("Сумма",	"Сумма без НДС");
			ПредставленияПолей.Вставить("СуммаНДС",	"НДС");
			ПредставленияПолей.Вставить("Всего",	"Всего");
			
			Таблица1 = ДокументОбъект["СоставНФА"].Выгрузить();
			
			ПривестиПоказателиКНеотрицательнымЗначениям(Таблица1, КоллекцияИменКолонокПоказателей);
			
			Таблица2 = ДанныеЗаполненияНаОсновании["СоставНФА"];
			ЗапрашиваемыеСведения = "ПревышенияТаблицы1НадТаблицей2";
			РезультатСравнения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
				Таблица1,
				Таблица2,
				КоллекцияИменКолонокСвязи,
				КоллекцияИменКолонокПоказателей,
				ЗапрашиваемыеСведения);
			
			ТаблицаПревышения = РезультатСравнения["ПревышенияТаблицы1НадТаблицей2"];
			ТекстШаблон = НСтр("ru='Справочно: поле ""%1"" превышает значение из счета-фактуры на %2 (строка %3)'");
			Для Каждого СтрокаТаблицы Из ТаблицаПревышения Цикл
				//ЕстьОшибкиЗаполнения = Истина;
				
				НомерСтроки	= СтрокаТаблицы["НомерСтроки"];
				Превышения	= СтрокаТаблицы["Превышения"];
				ИндексСтроки = НомерСтроки - 1;
				
				ИндексСтрокиТекст = Формат(ИндексСтроки, "ЧГ=0");
				
				Для Каждого ДетальнаяСтрока Из Превышения Цикл
					ИмяПоляДляВыводаСообщений = ДетальнаяСтрока["ИмяКолонки"];
					ВеличинаПревышения = ДетальнаяСтрока["Превышение"];
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстШаблон,
						ПредставленияПолей.Получить(ИмяПоляДляВыводаСообщений),
						Формат(ВеличинаПревышения, "ЧДЦ=2"),
						НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						ДокументОбъект["Ссылка"],
						"Объект." + ИмяТаблЧастиДляВыводаСообщений + "[" + ИндексСтрокиТекст + "]." + ИмяПоляДляВыводаСообщений);
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		// Не удалось получить данные для сравнения.
		ЕстьОшибкиЗаполнения = Истина;
		
		ИмяПоляДляВыводаСообщений = "ДокументОснование";
		ОбщегоНазначения.СообщитьПользователю(
			ОписаниеОшибки,
			ДокументОбъект["Ссылка"],
			"Объект." + ИмяПоляДляВыводаСообщений);
	КонецЕсли;
	
	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Перем Курс, Кратность;
	
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	ТаблицаВходящийНДС						= РегистрыНакопления.ВходящийНДС.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаВходящийНДСКРаспределению		= РегистрыНакопления.ВходящийНДСКРаспределению.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаКнигаПокупок						= РегистрыНакопления.КнигаПокупок.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаДополнительныеЛистыКнигиПокупок	= РегистрыНакопления.ДополнительныеЛистыКнигиПокупок.СоздатьНаборЗаписей().Выгрузить();
	
	// Подготовка:
	ШапкаДокумента			= ОбщегоНазначенияБГУ.СформироватьСтруктуруШапкиДокументаПоСсылке(ДокументСсылка);
	Период					= ШапкаДокумента["Дата"];
	ДокументОснование		= ШапкаДокумента["ДокументОснование"];
	Аннулирование			= ШапкаДокумента["Аннулирование"];
	Событие					= Перечисления.СобытияНДС.ПустаяСсылка();
	Если ШапкаДокумента["ПричинаНалогообложения"] = Перечисления.ПричиныНалогообложенияНДС.АвансПолученный
		И ШапкаДокумента["ВозвратАвансаПолученного"] Тогда
		Событие				= Перечисления.СобытияНДС.ВозвратАвансаПолученного;
	КонецЕсли;	
	ЗаполнитьВалютныеСуммы	= УчетНДС.СледуетЗаполнитьВалютныеСуммы();
	// Значения реквизитов типовой операции документа-основания:
	Основание_ТиповаяОперацияСсылка		= БухгалтерскиеОперацииСервер.БухгалтерскаяОперацияДокумента(ДокументОснование);
	Основание_РеквизитыТиповойОперации	= Справочники.ТиповыеОперации.ПустаяСтруктураДопРеквизитовОперации(Основание_ТиповаяОперацияСсылка);
	Основание_РеквизитыТиповойОперации	= БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ДокументОснование, Основание_РеквизитыТиповойОперации);
	Если ЗаполнитьВалютныеСуммы Тогда
		Основание_РеквизитыТиповойОперации.Свойство("Курс",			Курс);
		Основание_РеквизитыТиповойОперации.Свойство("Кратность",	Кратность);
		Если НЕ ЗначениеЗаполнено(Курс) Тогда
			Курс = 1;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Кратность) Тогда
			Кратность = 1;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаСоставНФА = ДокументСсылка["СоставНФА"].Выгрузить();
	
	ОбъектыНалогообложения = ТаблицаСоставНФА.ВыгрузитьКолонку("ОбъектНалогообложения");
	
	// Оставляем только заполненные ссылки
	КоличествоДокументов = ОбъектыНалогообложения.Количество();
	Для Счетчик = 1 По КоличествоДокументов Цикл
		Индекс = КоличествоДокументов - Счетчик;
		Если НЕ ЗначениеЗаполнено(ОбъектыНалогообложения[Индекс]) Тогда
			ОбъектыНалогообложения.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
	ОстаткиПоОбъектуНалогообложения	= УчетНДС.ПолучитьОстаткиПоОбъектуНалогообложения(
		ОбъектыНалогообложения,
		"ВходящийНДС, ВходящийНДСКРаспределению",
		ШапкаДокумента["Дата"],
		ДокументСсылка,
		ШапкаДокумента.ДокументОснование);
	
	// Настраиваем колонки для дальнейшей совместной обработки:
	ТаблицаСоставНФА.Колонки.Найти("Сумма").Имя = "СуммаБезНДС";
	ТипСумма = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	ТаблицаСоставНФА.Колонки.Добавить("СуммаБезНДСВалютная", ТипСумма);
	ТаблицаСоставНФА.Колонки.Добавить("СуммаНДСВалютная", ТипСумма);
	Если ЗаполнитьВалютныеСуммы Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаСоставНФА Цикл
			СтрокаТаблицы["СуммаБезНДСВалютная"] = СтрокаТаблицы["СуммаБезНДС"];
			СтрокаТаблицы["СуммаБезНДС"] = СтрокаТаблицы["СуммаБезНДСВалютная"] * Курс / Кратность;
			СтрокаТаблицы["СуммаНДСВалютная"] = СтрокаТаблицы["СуммаНДС"];
			СтрокаТаблицы["СуммаНДС"] = СтрокаТаблицы["СуммаНДСВалютная"] * Курс / Кратность;
		КонецЦикла;
	КонецЕсли;
	
	//---
	// КнигаПокупок, ДополнительныеЛистыКнигиПокупок
	//---
	Если ШапкаДокумента["ДопЛист"] Тогда
		ЗаполняемаяТаблица	= ТаблицаДополнительныеЛистыКнигиПокупок;
		УчетНДС.ДобавитьВТаблицу(ЗаполняемаяТаблица, ТаблицаСоставНФА);
		ЗаполняемаяТаблица.ЗаполнитьЗначения(ШапкаДокумента["КорректируемыйПериод"], "КорректируемыйПериод");
	Иначе
		ЗаполняемаяТаблица	= ТаблицаКнигаПокупок;
		УчетНДС.ДобавитьВТаблицу(ЗаполняемаяТаблица, ТаблицаСоставНФА);
	КонецЕсли;
	ЗаполняемаяТаблица.ЗаполнитьЗначения(ШапкаДокумента["Организация"],				"Организация");
	ЗаполняемаяТаблица.ЗаполнитьЗначения(ШапкаДокумента["ПричинаНалогообложения"],	"ПричинаНалогообложения");
	ЗаполняемаяТаблица.ЗаполнитьЗначения(ШапкаДокумента["ДатаОплаты"],				"ДатаОплаты");
	ЗаполняемаяТаблица.ЗаполнитьЗначения(ШапкаДокумента["ДатаПринятияКУчету"],		"ДатаСобытия");
	ЗаполняемаяТаблица.ЗаполнитьЗначения(Истина,									"Активность");
	ЗаполняемаяТаблица.ЗаполнитьЗначения(Период,									"Период");
	ЗаполняемаяТаблица.ЗаполнитьЗначения(ШапкаДокумента["КодВидаОперации"],			"КодВидаОперации");
	ЗаполняемаяТаблица.ЗаполнитьЗначения(Событие,									"Событие");
	Если Аннулирование Тогда
		Для Каждого СтрокаТаблицы Из ЗаполняемаяТаблица Цикл
			СтрокаТаблицы["СуммаБезНДС"]			= -СтрокаТаблицы["СуммаБезНДС"];
			СтрокаТаблицы["СуммаНДС"]				= -СтрокаТаблицы["СуммаНДС"];
			СтрокаТаблицы["СуммаБезНДСВалютная"]	= -СтрокаТаблицы["СуммаБезНДСВалютная"];
			СтрокаТаблицы["СуммаНДСВалютная"]		= -СтрокаТаблицы["СуммаНДСВалютная"];
		КонецЦикла;
	КонецЕсли;
	
	СчетФактура = ?(ЗначениеЗаполнено(ДокументОснование), ДокументОснование, ДокументСсылка);
	ЗаполняемаяТаблица.ЗаполнитьЗначения(СчетФактура, "СчетФактура");
	
	КолонкиСвязи = "ОбъектНалогообложения, ВидЦенности, КФО, СтавкаНДС";
	
	Если ЗаполнитьВалютныеСуммы Тогда
		КолонкиПоказателей = "СуммаБезНДС, СуммаНДС, СуммаБезНДСВалютная, СуммаНДСВалютная";
	Иначе
		КолонкиПоказателей = "СуммаБезНДС, СуммаНДС";
	КонецЕсли;
	
	//---
	// ВходящийНДС
	//---
	РезультатСравнения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
		ТаблицаСоставНФА,
		ОстаткиПоОбъектуНалогообложения["ВходящийНДС"],
		КолонкиСвязи,
		КолонкиПоказателей,
		"ОстаткиВТаблице1, СписанияВТаблице2ВРазмереСоответствия");
		
	ТаблицаСоставНФА = РезультатСравнения["ОстаткиВТаблице1"];
	ТаблицаВходящийНДС = РезультатСравнения["СписанияВТаблице2ВРазмереСоответствия"];
	
	УчетНДС.УдалитьСтрокиСНулевымиСуммами(ТаблицаВходящийНДС);
	
	ТаблицаВходящийНДС.Колонки.Добавить("ВидДвижения",	Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаВходящийНДС.Колонки.Добавить("Период",		Новый ОписаниеТипов("Дата"));
	
	ТаблицаВходящийНДС.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,	"ВидДвижения");
	ТаблицаВходящийНДС.ЗаполнитьЗначения(Период,						"Период");
	
	//---
	// ВходящийНДСКРаспределению
	//---
	РезультатСравнения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
		ТаблицаСоставНФА,
		ОстаткиПоОбъектуНалогообложения["ВходящийНДСКРаспределению"],
		КолонкиСвязи,
		КолонкиПоказателей,
		"СписанияВТаблице2ВРазмереСоответствия");
		
	ТаблицаВходящийНДСКРаспределению = РезультатСравнения["СписанияВТаблице2ВРазмереСоответствия"];
	
	УчетНДС.УдалитьСтрокиСНулевымиСуммами(ТаблицаВходящийНДСКРаспределению);
	
	ТаблицаВходящийНДСКРаспределению.Колонки.Добавить("ВидДвижения",	Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаВходящийНДСКРаспределению.Колонки.Добавить("Период",			Новый ОписаниеТипов("Дата"));
	
	ТаблицаВходящийНДСКРаспределению.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,	"ВидДвижения");
	ТаблицаВходящийНДСКРаспределению.ЗаполнитьЗначения(Период,							"Период");
	
	// Финальные таблицы движений:
	ТаблицыДляДвижений.Вставить("ВходящийНДС",						ТаблицаВходящийНДС);
	ТаблицыДляДвижений.Вставить("ВходящийНДСКРаспределению",		ТаблицаВходящийНДСКРаспределению);
	ТаблицыДляДвижений.Вставить("КнигаПокупок",						ТаблицаКнигаПокупок);
	ТаблицыДляДвижений.Вставить("ДополнительныеЛистыКнигиПокупок",	ТаблицаДополнительныеЛистыКнигиПокупок);
	
	ДобавитьДвиженияСчетаФактурыНаОтгрузкуДляКнигиПокупок(ТаблицыДляДвижений, ШапкаДокумента);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати	= "Документ.СчетФактураВыданный";
	//КомандаПечати.Идентификатор		= "СчетФактура1137";
	//КомандаПечати.Представление		= НСтр("ru='Счет-фактура'");
	////КомандаПечати.Порядок			= 1;
	//КомандаПечати.СписокФорм		= "ФормаСписка,ФормаДокумента";
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура1137") Тогда
	//	СтруктураПараметровОбработчика = Новый Структура();
	//	СтруктураПараметровОбработчика.Вставить("МассивОбъектов",	МассивОбъектов);
	//	СтруктураПараметровОбработчика.Вставить("ПараметрыПечати",	ПараметрыПечати);
	//	СтруктураПараметровОбработчика.Вставить("ОбъектыПечати",	ОбъектыПечати);
	//	СтруктураПараметровОбработчика.Вставить("ПараметрыВывода",	ПараметрыВывода);
	//	
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
	//		КоллекцияПечатныхФорм,
	//		"СчетФактура1137",
	//		"Счет-фактура выданный",
	//		ПечатьСчетФактураВыданный(СтруктураПараметровОбработчика));
	//КонецЕсли;

КонецПроцедуры

Процедура ИнициализироватьНовуюКолонку_2_0_32() Экспорт
	
	// Сведения для вывода в журнал регистрации
	ИмяСобытия					= НСтр("ru='Данные. Изменение'");
	КомментарийОК 				= НСтр("ru='Успешно обработано документов: %1 - Инициализация новой колонки ОбъектНалогообложения в документах Регистрация строки книги покупок'");
	КомментарийОшибка			= НСтр("ru='Ошибок при обработке документов: %1 - Инициализация новой колонки ОбъектНалогообложения в документах Регистрация строки книги покупок'");
	КомментарийПропуск			= НСтр("ru='Документов, подлежащих обработке, не обнаружено - Инициализация новой колонки ОбъектНалогообложения в документах Регистрация строки книги покупок'");
	КомментарийБлокировка		= НСтр("ru='Не удалось заблокировать документы для модификации - Инициализация новой колонки ОбъектНалогообложения в документах Регистрация строки книги покупок'");
	КомментарийОшибкаДокумент	= НСтр("ru='Ошибка при обработке документа (%1) - Инициализация новой колонки ОбъектНалогообложения в документах Регистрация строки книги покупок'");
	
	// Настраиваем запрос
	ЗапросЗаполнение = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка						КАК Ссылка,
	|	Ссылка.ДокументОснование	КАК ДокументОснование
	|ИЗ
	|	Документ.РегистрацияСтрокиКнигиПокупок.СоставНФА	КАК СоставНФА
	|ГДЕ
	|	ОбъектНалогообложения = НЕОПРЕДЕЛЕНО
	|;");
	
	Выборка = ЗапросЗаполнение.Выполнить().Выбрать();
	
	СчетчикДокументовВсего	= Выборка.Количество();
	СчетчикДокументовОК		= 0;
	СчетчикДокументовОшибка	= 0;
	
	Пока Выборка.Следующий() Цикл
		Попытка
			ДокументОбъект = Выборка["Ссылка"].ПолучитьОбъект();
			Если ДокументОбъект = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ТЧСоставНФА = ДокументОбъект["СоставНФА"];
			
			Для Каждого СтрокаТЧ Из ТЧСоставНФА Цикл
				СтрокаТЧ["ОбъектНалогообложения"] = Выборка["ДокументОснование"];
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			
			СчетчикДокументовОК = СчетчикДокументовОК + 1;
			
		Исключение
			СчетчикДокументовОшибка = СчетчикДокументовОшибка + 1;
			ПоследняяОшибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КомментарийОшибкаДокумент,
				Строка(Выборка["Ссылка"])) + ". " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				ИмяСобытия,							// имя события
				УровеньЖурналаРегистрации.Ошибка,	// уровень
				,									// объект метаданных
				,									// данные
				Комментарий);						// комментарий
			
			// Выходим:
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	// Сообщения в журнале регистрации
	
	Если СчетчикДокументовВсего = 0 Тогда
		Комментарий = КомментарийПропуск;
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,								// имя события
			УровеньЖурналаРегистрации.Информация,	// уровень
			,										// объект метаданных
			,										// данные
			Комментарий);							// комментарий
	КонецЕсли;
	
	Если СчетчикДокументовОК > 0 Тогда
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КомментарийОК, Строка(СчетчикДокументовОК));
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,								// имя события
			УровеньЖурналаРегистрации.Информация,	// уровень
			,										// объект метаданных
			,										// данные
			Комментарий);							// комментарий
	КонецЕсли;
	
	Если СчетчикДокументовОшибка > 0 Тогда
		Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(КомментарийОшибка, Строка(СчетчикДокументовОшибка))
			+ ". Последняя ошибка: " + ПоследняяОшибка;
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,								// имя события
			УровеньЖурналаРегистрации.Ошибка,		// уровень
			,										// объект метаданных
			,										// данные
			Комментарий);							// комментарий
	КонецЕсли;
	
КонецПроцедуры

//---
// Применяемая инструкция
//---

Процедура ПрименяемаяИнструкция_ОбновитьСтруктурыСвойств(ШапкаДокумента, ЗаполняемаяТаблица, ИдентификаторИнструкции = Неопределено, СтрокаТаблицы = Неопределено) Экспорт
	
	СтруктураСвойств = Новый Структура("
		|СчетВычетКт,
		|СчетВычетКтЕдинственный,
		|СчетВычетКтКРаспределениюПоУмолчанию,
		|СчетВычетКтБезРаспределенияПоУмолчанию,
		|ВидыПоказателяКПСВычетКт,
		|Счет30304,
		|Счет30304Единственный,
		|ВидыПоказателяКПС30304,
			|ИзменилсяСчетВычетКт,
			|ИзменилсяСчет30304");
		
	// Структура для определения применяемой инструкции
	// (эти реквизиты берем из шапки)
	ОбъектСтруктура = Новый Структура("
		|Организация,
		|ПричинаНалогообложения,
		|Дата,
		|ИФО,
		|Действие");
	ЗаполнитьЗначенияСвойств(ОбъектСтруктура, ШапкаДокумента);
	
	Если СтрокаТаблицы = Неопределено Тогда
		// Обрабатываем все строки таблицы
		МассивСтрок = ЗаполняемаяТаблица;
		Если ТипЗнч(ЗаполняемаяТаблица) = Тип("ТаблицаЗначений") Тогда
			МассивСчетВычетКт = ЗаполняемаяТаблица.ВыгрузитьКолонку("СчетВычетКт");
		Иначе
			МассивСчетВычетКт = ЗаполняемаяТаблица.Выгрузить(, "СчетВычетКт").ВыгрузитьКолонку("СчетВычетКт");
		КонецЕсли;
	Иначе
		// Обрабатываем только одну указанную строку таблицы
		МассивСтрок = Новый Массив();
		МассивСтрок.Добавить(СтрокаТаблицы);
		МассивСчетВычетКт = Новый Массив();
		МассивСчетВычетКт.Добавить(СтрокаТаблицы["СчетВычетКт"]);
	КонецЕсли;
	
	// Определим счета-родители и запомним их
	// (нужно для дальнейшего очищения счетов, если они не соответствуют инструкции)
	РезультатЗапросаРодители = ПолучитьРодителейСчетов(МассивСчетВычетКт);
	ВыборкаСчет = РезультатЗапросаРодители.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		// Эти реквизиты берем из таблицы
		ОбъектСтруктура.Вставить("КФО", СтрокаТЧ["КФО"]);
		
		// Одноименные свойства инструкции
		ПрименяемаяИнструкцияСтруктура = УчетНДС.ПрименяемаяИнструкция_СтруктураСвойств(ОбъектСтруктура, , ИдентификаторИнструкции);
		ЗаполнитьЗначенияСвойств(СтруктураСвойств, ПрименяемаяИнструкцияСтруктура);
		
		// Дополнительные рассчитанные свойства
		ТекущаяСтруктураСвойств = СтрокаТЧ["ПрименяемаяИнструкция_СтруктураСвойств"];
		ТекущиеЗначенияСчетов = Новый Структура("СчетВычетКт, Счет30304");
		Если ЗначениеЗаполнено(ТекущаяСтруктураСвойств) Тогда
			ЗаполнитьЗначенияСвойств(ТекущиеЗначенияСчетов, ТекущаяСтруктураСвойств);
		КонецЕсли;
		ИзменилсяСчетВычетКт	= НЕ (ТекущиеЗначенияСчетов["СчетВычетКт"] = СтруктураСвойств["СчетВычетКт"]);
		ИзменилсяСчет30304			= НЕ (ТекущиеЗначенияСчетов["Счет30304"] = СтруктураСвойств["Счет30304"]);
		СтруктураСвойств.Вставить("Счет30304Единственный",		Истина);
		СтруктураСвойств.Вставить("ИзменилсяСчетВычетКт",	ИзменилсяСчетВычетКт);
		СтруктураСвойств.Вставить("ИзменилсяСчет30304",			ИзменилсяСчет30304);
		
		// Родители счета из текущей строки
		СчетВычетКтРодители = Новый Массив();
		// Продвигаемся в выборке до текущего счета
		ПоискТекущегоСчета = Новый Структура("Счет", СтрокаТЧ["СчетВычетКт"]);
		ВыборкаСчет.Сбросить();
		ВыборкаСчет.НайтиСледующий(ПоискТекущегоСчета);
		ВыборкаСчетРодители = ВыборкаСчет.Выбрать();
		Пока ВыборкаСчетРодители.Следующий() Цикл
			СчетВычетКтРодители.Добавить(ВыборкаСчетРодители["Родитель"]);
		КонецЦикла;
		СтруктураСвойств.Вставить("СчетВычетКтРодители",	СчетВычетКтРодители);
		
		СтрокаТЧ["ПрименяемаяИнструкция_СтруктураСвойств"] = СтруктураСвойств; //Новый ФиксированнаяСтруктура(СтруктураСвойств);
	КонецЦикла;
	
КонецПроцедуры

// В таблице должна быть заранее заполнена колонка ПрименяемаяИнструкция_СтруктураСвойств.
Процедура ПрименяемаяИнструкция_ЗаполнитьКолонкиСчетов(ЗаполняемаяТаблица, ПараметрыПодбораКПС, ПараметрыЗаполнения = Неопределено) Экспорт
	
	// Параметры заполнения
	Перем	ЗаполнитьСчетВычетКт,
			ЗаполнитьСчет30304,
			СтрокаТаблицы;
	
	Если ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") Тогда
		ПараметрыЗаполнения.Свойство("ЗаполнитьСчетВычетКт",	ЗаполнитьСчетВычетКт);
		ПараметрыЗаполнения.Свойство("ЗаполнитьСчет30304",		ЗаполнитьСчет30304);
		ПараметрыЗаполнения.Свойство("СтрокаТаблицы",			СтрокаТаблицы);
	КонецЕсли;
	Если НЕ ЗаполнитьСчетВычетКт = Ложь Тогда
		ЗаполнитьСчетВычетКт = Истина; // Значение по умолчанию
	КонецЕсли;
	Если НЕ ЗаполнитьСчет30304 = Ложь Тогда
		ЗаполнитьСчет30304 = Истина; // Значение по умолчанию
	КонецЕсли;
	
	Если СтрокаТаблицы = Неопределено Тогда
		// Обрабатываем все строки таблицы
		МассивСтрок	= ЗаполняемаяТаблица;
	Иначе
		// Обрабатываем только одну указанную строку таблицы
		МассивСтрок = Новый Массив();
		МассивСтрок.Добавить(СтрокаТаблицы);
	КонецЕсли;
	
	// Устанавливаем счета
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		СтруктураСвойств = СтрокаТЧ["ПрименяемаяИнструкция_СтруктураСвойств"];
		
		ЗаполняющаяСтруктура = Новый Структура();
		
		//
		// СчетВычетКт
		//
		Если ЗаполнитьСчетВычетКт Тогда
			Если СтруктураСвойств["СчетВычетКтЕдинственный"] = Истина Тогда
				СчетВычетКт = СтруктураСвойств["СчетВычетКт"];
				ИзменилсяСчетВычетКт = СтруктураСвойств["ИзменилсяСчетВычетКт"];
				
			ИначеЕсли ПрименяемаяИнструкция_СчетСоответствуетИнструкции(СтрокаТЧ) Тогда
				СчетВычетКт = СтрокаТЧ["СчетВычетКт"];
				ИзменилсяСчетВычетКт = Ложь;
				
			Иначе
				СчетВычетКт = Неопределено;
				ИзменилсяСчетВычетКт = Истина;
				
			КонецЕсли;
			
			Если ИзменилсяСчетВычетКт Тогда
				ЗаполняющаяСтруктура.Вставить("СчетВычетКт",	СчетВычетКт);
				ЗаполняющаяСтруктура.Вставить("КПСВычетКт",		Неопределено);
			КонецЕсли;
			
			// Обновляем при необходимости
			Если НЕ ИзменилсяСчетВычетКт = СтруктураСвойств["ИзменилсяСчетВычетКт"] Тогда
				СтруктураСвойств["ИзменилсяСчетВычетКт"] = ИзменилсяСчетВычетКт;
			КонецЕсли;
		КонецЕсли;
		
		//
		// Счет30304
		//
		Если ЗаполнитьСчет30304 Тогда
			Если СтруктураСвойств["Счет30304Единственный"] = Истина Тогда
				Счет30304 = СтруктураСвойств["Счет30304"];
				ИзменилсяСчет30304 = СтруктураСвойств["ИзменилсяСчет30304"];
				
			Иначе
				Счет30304 = Неопределено;
				ИзменилсяСчет30304 = Истина;
				
			КонецЕсли;
			
			Если ИзменилсяСчет30304 Тогда
				ЗаполняющаяСтруктура.Вставить("Счет30304",				Счет30304);
				ЗаполняющаяСтруктура.Вставить("КПС30304",				Неопределено);
			КонецЕсли;
			
			// Обновляем при необходимости
			Если НЕ ИзменилсяСчет30304 = СтруктураСвойств["ИзменилсяСчет30304"] Тогда
				СтруктураСвойств["ИзменилсяСчет30304"] = ИзменилсяСчет30304;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЗаполняющаяСтруктура);
	КонецЦикла;
	
	// Устанавливаем КПС из рабочих счетов
	Если СтрокаТаблицы = Неопределено Тогда
		// Обрабатываем все строки таблицы
		ТаблицаДляЗаполнениеКПС = ЗаполняемаяТаблица;
	Иначе
		// Обрабатываем только одну указанную строку таблицы
		ТаблицаДляЗаполнениеКПС = ЗаполняемаяТаблица.Выгрузить(Новый Массив());
		НоваяСтрока = ТаблицаДляЗаполнениеКПС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЕсли;
	Если ТаблицаДляЗаполнениеКПС.Количество() > 0 Тогда
		// Фактически виды показателя КПС являются одинаковыми для всех строк таблицы
		// (для любого КФО), поэтому определяем их из любой строки, например, самой первой
		СтруктураСвойств = ТаблицаДляЗаполнениеКПС[0]["ПрименяемаяИнструкция_СтруктураСвойств"];
		
		Если ЗаполнитьСчетВычетКт Тогда
			ОписаниеТаблицы = Новый Структура();
			ОписаниеТаблицы.Вставить("ИмяКолонкиСчет",		"СчетВычетКт");
			ОписаниеТаблицы.Вставить("ИмяКолонкиКПС",		"КПСВычетКт");
			ПараметрыЗаполнения = Новый Структура();
			ПараметрыЗаполнения.Вставить("Организация",							ПараметрыПодбораКПС["Организация"]);
			ПараметрыЗаполнения.Вставить("Дата",								ПараметрыПодбораКПС["Дата"]);
			ПараметрыЗаполнения.Вставить("ИФО",									ПараметрыПодбораКПС["ИФО"]);
			ПараметрыЗаполнения.Вставить("ЗаполнитьКолонкуКПС",					Истина);
			ПараметрыЗаполнения.Вставить("ЗаполнитьТолькоПустыеПоля",			Ложь);
			ПараметрыЗаполнения.Вставить("ВидыПоказателяКПС",					СтруктураСвойств["ВидыПоказателяКПСВычетКт"]);
			ПараметрыЗаполнения.Вставить("СторонаПроводки",						"Кт");
			УчетНДС.ЗаполнитьТаблицуПоРабочемуПлануСчетов(ТаблицаДляЗаполнениеКПС, ОписаниеТаблицы, ПараметрыЗаполнения);
		КонецЕсли;
		
		Если ЗаполнитьСчет30304 Тогда
			ОписаниеТаблицы = Новый Структура();
			ОписаниеТаблицы.Вставить("ИмяКолонкиСчет",		"Счет30304");
			ОписаниеТаблицы.Вставить("ИмяКолонкиКПС",		"КПС30304");
			ПараметрыЗаполнения = Новый Структура();
			ПараметрыЗаполнения.Вставить("Организация",							ПараметрыПодбораКПС["Организация"]);
			ПараметрыЗаполнения.Вставить("Дата",								ПараметрыПодбораКПС["Дата"]);
			ПараметрыЗаполнения.Вставить("ИФО",									ПараметрыПодбораКПС["ИФО"]);
			ПараметрыЗаполнения.Вставить("ЗаполнитьКолонкуКПС",					Истина);
			ПараметрыЗаполнения.Вставить("ЗаполнитьТолькоПустыеПоля",			Ложь);
			ПараметрыЗаполнения.Вставить("ВидыПоказателяКПС",					СтруктураСвойств["ВидыПоказателяКПС30304"]);
			УчетНДС.ЗаполнитьТаблицуПоРабочемуПлануСчетов(ТаблицаДляЗаполнениеКПС, ОписаниеТаблицы, ПараметрыЗаполнения);
		КонецЕсли;
		
		Если НЕ СтрокаТаблицы = Неопределено Тогда
			// Обрабатываем только одну указанную строку таблицы
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ТаблицаДляЗаполнениеКПС[0]);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПрименяемаяИнструкция_СчетСоответствуетИнструкции(СтрокаТаблицы)
	
	СтруктураСвойств		= СтрокаТаблицы["ПрименяемаяИнструкция_СтруктураСвойств"];
	СчетВИнструкции			= СтруктураСвойств["СчетВычетКт"];
	СчетВСтроке				= СтрокаТаблицы["СчетВычетКт"];
	РодителиСчетаВСтроке	= СтруктураСвойств["СчетВычетКтРодители"];
	
	Если ТипЗнч(СчетВИнструкции) = Тип("Массив") Тогда
		// Несколько значений счетов
		Для Каждого Счет Из СчетВИнструкции Цикл
			Если (СчетВСтроке = Счет) ИЛИ НЕ (РодителиСчетаВСтроке.Найти(Счет) = Неопределено) Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		// Одно значение счета
		Если (СчетВСтроке = СчетВИнструкции) ИЛИ НЕ (РодителиСчетаВСтроке.Найти(СчетВИнструкции) = Неопределено) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьПоТипуДокументаОснования(ОснованиеСсылка, Объект, ОписаниеОшибки, ВозвратТиповаяОперация = Неопределено)
	
	Перем НовыеДанные;
	
	ЗаполнениеВыполнено = Неопределено;
	
	ТипДанныхЗаполнения = ТипЗнч(ОснованиеСсылка);
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_СчетФактураПолученный(ОснованиеСсылка, НовыеДанные);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_СчетФактураВыданный(ОснованиеСсылка, Объект, НовыеДанные);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ГТДИмпорт") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_ГТДИмпорт(ОснованиеСсылка, НовыеДанные);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИсправительныйСчетФактураВыданный") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_ИсправительныйСчетФактураВыданный(ОснованиеСсылка, НовыеДанные);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИсправительныйСчетФактураПолученный") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_ИсправительныйСчетФактураПолученный(ОснованиеСсылка, НовыеДанные);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.КорректировочныйСчетФактураВыданный") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_КорректировочныйСчетФактураВыданный(ОснованиеСсылка, НовыеДанные);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.КорректировочныйСчетФактураПолученный") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_КорректировочныйСчетФактураПолученный(ОснованиеСсылка, НовыеДанные);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.РегистрацияСтрокиКнигиПродаж") Тогда
		ЗаполнениеВыполнено = ПолучитьДанныеДляЗаполненияНаОсновании_РегистрацияСтрокиКнигиПродаж(ОснованиеСсылка, НовыеДанные);
	КонецЕсли;
	
	Если ЗаполнениеВыполнено = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Неподдерживаемый тип документа-основания'");
		Возврат Ложь;
		
	ИначеЕсли Не ЗаполнениеВыполнено Тогда
		ОписаниеОшибки = НовыеДанные.ОписаниеОшибки;
		Возврат Ложь;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, НовыеДанные.Шапка);
	
	УстанавливатьВместоЗагрузки = (ТипЗнч(Объект.СоставНФА) = Тип("ТаблицаЗначений"));
	
	ТабличныеЧасти = НовыеДанные.ТабличныеЧасти;
	
	Если УстанавливатьВместоЗагрузки Тогда
		Объект.СоставНФА = ТабличныеЧасти.СоставНФА;
	Иначе
		Объект.СоставНФА.Загрузить(ТабличныеЧасти.СоставНФА);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "СчетаФактурыНаОтгрузку")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТабличныеЧасти, "СчетаФактурыНаОтгрузку") Тогда
		Если УстанавливатьВместоЗагрузки Тогда
			Объект.СчетаФактурыНаОтгрузку = ТабличныеЧасти.СчетаФактурыНаОтгрузку;
		Иначе
			Объект.СчетаФактурыНаОтгрузку.Загрузить(ТабличныеЧасти.СчетаФактурыНаОтгрузку);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗаполнениеВыполнено;
	
КонецФункции

Функция ПолучитьДанныеДляЗаполненияНаОсновании_ПустаяСтруктураРезультата()
	
	Возврат Новый Структура("
		|Шапка,
		|ТабличныеЧасти,
		|ТиповаяОперация,
		|ОписаниеОшибки");
	
КонецФункции

Функция ПолучитьРодителейСчетов(МассивСчетов)
	
	ЗапросРодители = Новый Запрос();
	ЗапросРодители.УстановитьПараметр("Счета", МассивСчетов);
	ЗапросРодители.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Родители первого уровня
	|//
	|ВЫБРАТЬ
	|	Ссылка		КАК Счет,
	|	Родитель	КАК Родитель
	|ПОМЕСТИТЬ
	|	РодителиПервогоУровня
	|ИЗ
	|	ПланСчетов.ЕПСБУ
	|ГДЕ
	|	Ссылка В (&Счета)
	|	И	НЕ Родитель = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Родители второго уровня
	|//
	|ВЫБРАТЬ
	|	Счет				КАК Счет,
	|	Родитель.Родитель	КАК Родитель
	|ПОМЕСТИТЬ
	|	РодителиВторогоУровня
	|ИЗ
	|	РодителиПервогоУровня
	|ГДЕ
	|	НЕ Родитель.Родитель = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Родители первого и второго уровней
	|//
	|ВЫБРАТЬ
	|	Счет		КАК Счет,
	|	Родитель	КАК Родитель
	|ИЗ
	|	РодителиПервогоУровня
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Счет		КАК Счет,
	|	Родитель	КАК Родитель
	|ИЗ
	|	РодителиВторогоУровня
	|	
	|ИТОГИ
	|ПО
	|	Счет
	|;";
	
	Возврат ЗапросРодители.Выполнить();
	
КонецФункции


Функция ПолучитьВалютыНДСГТДИмпорт(ДокументОснованиеСсылка)
	
	// Часть 1 из 2
	// Проверка возможности заполнения на основании
	// Для заполнения на основании необходимы одинаковые настройки валюты НДС во всех строках табличной части Разделы
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("ДокументОснованиеСсылка",	ДокументОснованиеСсылка);
	ЗапросПоиск.УстановитьПараметр("ВалютаРУ",					Константы.ВалютаРегламентированногоУчета.Получить());
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Указанные валюты НДС
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НомерСтроки	КАК НомерРаздела,
	|	ВЫБОР
	|		КОГДА НДСВВалюте ТОГДА
	|			Ссылка.ВалютаДокумента
	|		ИНАЧЕ
	|			&ВалютаРУ
	|	КОНЕЦ		КАК ВалютаНДС
	|ПОМЕСТИТЬ
	|	ВалютыНДС
	|ИЗ
	|	Документ.ГТДИмпорт.Разделы
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Различные валюты НДС
	|//
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВалютаНДС	КАК ВалютаНДС
	|ИЗ
	|	ВалютыНДС
	|;";
	
	Возврат ЗапросПоиск.Выполнить().Выгрузить().ВыгрузитьКолонку("ВалютаНДС");
	
КонецФункции

Функция ПрочитатьДокументГТДИмпорт(ДокументСсылка, НДСВВалюте)
	
	// Часть 2 из 2
	// Заполнение на основании
	// Выбираем только строки табличной части Разделы
	// с одинаковой настройкой валюты НДС
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("ДокументОснованиеСсылка",	ДокументСсылка);
	ЗапросПоиск.УстановитьПараметр("НДСВВалюте",				НДСВВалюте);
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные для реквизитов шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ДокументОснованиеСсылка											КАК ДокументОснование,
	|	Организация															КАК Организация,
	|	ИФО																	КАК ИФО,
	|	Подразделение														КАК Подразделение,
	|	Контрагент															КАК Контрагент,
	|	Договор																КАК Договор,
	|	ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.ТаможенныеПлатежи)	КАК ПричинаНалогообложения,
	|	ЛОЖЬ																КАК ДопЛист,
	|	
	|	// Валюта таможенной стоимости
	|	ВалютаТаможеннойСтоимости											КАК ВалютаТаможеннойСтоимости,
	|	КурсВалютыТаможеннойСтоимости										КАК КурсВалютыТаможеннойСтоимости,
	|	КратностьВалютыТаможеннойСтоимости									КАК КратностьВалютыТаможеннойСтоимости,
	|	
	|	// Валюта пошлины и НДС
	|	ВалютаДокумента														КАК ВалютаПошлиныИНДС,
	|	Курс																КАК КурсПошлиныИНДС,
	|	Кратность															КАК КратностьПошлиныИНДС
	|ИЗ
	|	Документ.ГТДИмпорт	КАК ГТДИмпорт
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для табличной части СоставНФА
	|//		
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектНалогообложения	КАК ОбъектНалогообложения,
	|	ВидЦенности				КАК ВидЦенности,
	|	КФО						КАК КФО,
	|	СчетВычетКт				КАК СчетВычетКт,
	|	ФактурнаяСтоимость		КАК ФактурнаяСтоимость,
	|	СуммаПошлины			КАК СуммаПошлины,
	|	СуммаНДС				КАК СуммаНДС,
	|		
	|	СтавкаНДС				КАК СтавкаНДС,
	|	ПошлинаВВалюте			КАК ПошлинаВВалюте,
	|	НДСВВалюте				КАК НДСВВалюте
	|ИЗ
	|	(
	|	// Материалы
	|	ВЫБРАТЬ
	|		Материалы.НомерРаздела														КАК НомерРаздела,
	|		1																			КАК НомерТабличнойЧасти,
	|		Материалы.НомерСтроки														КАК НомерВТабличнойЧасти,
	|		Материалы.ДокументПартии													КАК ОбъектНалогообложения,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Материалы)							КАК ВидЦенности,
	|		Материалы.Ссылка.КФО														КАК КФО,
	|		Материалы.СчетНДС															КАК СчетВычетКт,
	|		Материалы.ФактурнаяСтоимость						 						КАК ФактурнаяСтоимость,
	|		Материалы.СуммаПошлины														КАК СуммаПошлины,
	|		Материалы.СуммаНДС															КАК СуммаНДС,
	|		
	|		ЕСТЬNULL(Разделы.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка))	КАК СтавкаНДС,
	|		ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)										КАК ПошлинаВВалюте,
	|		ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)											КАК НДСВВалюте
	|
	|	ИЗ
	|		Документ.ГТДИмпорт.Материалы	КАК Материалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ	Документ.ГТДИмпорт.Разделы	КАК Разделы
	|			ПО	Материалы.НомерРаздела = Разделы.НомерСтроки
	|	ГДЕ 
	|		Материалы.Ссылка = &ДокументОснованиеСсылка
	|		И Разделы.Ссылка = &ДокументОснованиеСсылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	// Основные средства
	|	ВЫБРАТЬ
	|		ОсновныеСредства.НомерРаздела												КАК НомерРаздела,
	|		2																			КАК НомерТабличнойЧасти,
	|		ОсновныеСредства.НомерСтроки												КАК НомерВТабличнойЧасти,
	|		ОсновныеСредства.ДокументПартии												КАК ОбъектНалогообложения,
	|		ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.ОС)									КАК ВидЦенности,
	|		ОсновныеСредства.Ссылка.КФО													КАК КФО,
	|		ОсновныеСредства.СчетНДС													КАК СчетВычетКт,
	|		ОсновныеСредства.ФактурнаяСтоимость						 					КАК ФактурнаяСтоимость,
	|		ОсновныеСредства.СуммаПошлины												КАК СуммаПошлины,
	|		ОсновныеСредства.СуммаНДС													КАК СуммаНДС,
	|		
	|		ЕСТЬNULL(Разделы.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка))	КАК СтавкаНДС,
	|		ЕСТЬNULL(Разделы.ПошлинаВВалюте, ЛОЖЬ)										КАК ПошлинаВВалюте,
	|		ЕСТЬNULL(Разделы.НДСВВалюте, ЛОЖЬ)											КАК НДСВВалюте
	|	ИЗ
	|		Документ.ГТДИмпорт.ОсновныеСредства	КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ	Документ.ГТДИмпорт.Разделы	КАК Разделы
	|			ПО	ОсновныеСредства.НомерРаздела = Разделы.НомерСтроки
	|	ГДЕ 
	|		ОсновныеСредства.Ссылка = &ДокументОснованиеСсылка
	|		И Разделы.Ссылка = &ДокументОснованиеСсылка
	|    )	КАК ОбщаяТабличнаяЧасть
	|УПОРЯДОЧИТЬ ПО
	|	НомерРаздела,
	|	НомерТабличнойЧасти,
	|	НомерВТабличнойЧасти
	|;";
	
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	
	Данные = Новый Структура();
	
	// [0]. Данные для реквизитов шапки
	Данные.Вставить("Шапка", РезультатыЗапроса[0].Выгрузить());
	
	// [1]. Данные для табличной части СоставНФА
	Данные.Вставить("СоставНФА", РезультатыЗапроса[1].Выгрузить());
	
	Возврат Данные;
	
КонецФункции

Процедура ПривестиСуммыКОднойВалютеГТДИмпорт(Данные, ПрименяемаяВалютаНДССсылка)
	
	// Сумма = БазаНДС = ФактурнаяСтоимость + СуммаПошлины
	//					(привести к			(привести к
	//					применяемой			применяемой
	//					валюте НДС)			валюте НДС)
	//
	// СуммаНДС = СуммаНДС
	//			(привести к
	//			применяемой
	//			валюте НДС)
	//
	// Всего = Сумма + СуммаНДС
	
	Шапка				= Данные["Шапка"];
	ТаблицаСоставНФА	= Данные["ТабличныеЧасти"]["СоставНФА"];
	
	ВалютаРУ = Новый Структура();
	ВалютаРУ.Вставить("Валюта",		Константы.ВалютаРегламентированногоУчета.Получить());
	ВалютаРУ.Вставить("Курс",		1);
	ВалютаРУ.Вставить("Кратность",	1);
	
	// Валюта таможенной стоимости
	Если ЗначениеЗаполнено(Шапка.ВалютаТаможеннойСтоимости) Тогда
		ВалютаТС = Новый Структура();
		ВалютаТС.Вставить("Валюта",		Шапка.ВалютаТаможеннойСтоимости);
		ВалютаТС.Вставить("Курс",		Шапка.КурсВалютыТаможеннойСтоимости);
		ВалютаТС.Вставить("Кратность",	Шапка.КратностьВалютыТаможеннойСтоимости);
	Иначе
		ВалютаТС = ВалютаРУ;
	КонецЕсли;
	
	// Валюта пошлины и НДС
	Если ЗначениеЗаполнено(Шапка.ВалютаПошлиныИНДС) Тогда
		ВалютаПошлины = Новый Структура();
		ВалютаПошлины.Вставить("Валюта",	Шапка.ВалютаПошлиныИНДС);
		ВалютаПошлины.Вставить("Курс",		Шапка.КурсПошлиныИНДС);
		ВалютаПошлины.Вставить("Кратность",	Шапка.КратностьПошлиныИНДС);
	Иначе
		ВалютаПошлины = ВалютаРУ;
	КонецЕсли;
	
	СовпадаютВалютыПошлиныНДС = (ВалютаПошлины.Валюта = ПрименяемаяВалютаНДССсылка);
	
	// Применяемая валюта НДС
	Если СовпадаютВалютыПошлиныНДС Тогда
		ПрименяемаяВалютаНДС = ВалютаПошлины;
	Иначе
		ПрименяемаяВалютаНДС = ВалютаРУ;
	КонецЕсли;
	
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоставНФА Цикл
		
		ТаможеннаяСтоимость = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			СтрокаТаблицы.ФактурнаяСтоимость,
			ВалютаТС,
			ПрименяемаяВалютаНДС);
			
		ВалютаПошлиныВТекущейСтроке = ?(СтрокаТаблицы.ПошлинаВВалюте, ВалютаПошлины, ВалютаРУ);
		
		Пошлина = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			СтрокаТаблицы.СуммаПошлины,
			ВалютаПошлиныВТекущейСтроке,
			ПрименяемаяВалютаНДС);
			
		ВалютаНДСВТекущейСтроке = ?(СтрокаТаблицы.НДСВВалюте, ВалютаПошлины, ВалютаРУ);
		
		СуммаНДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
			СтрокаТаблицы.СуммаНДС,
			ВалютаНДСВТекущейСтроке,
			ПрименяемаяВалютаНДС);
			
		БазаНДС = ТаможеннаяСтоимость + Пошлина;
		
		СтрокаТаблицы["Сумма"] = БазаНДС;
		СтрокаТаблицы["Всего"] = БазаНДС + СуммаНДС;
		СтрокаТаблицы["СуммаНДС"] = СуммаНДС;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЛишниеСвойстваИКолонкиГТДИмпорт(Данные)
	
	УдаляемыеРеквизитыШапки = Новый Структура("
		|ВалютаТаможеннойСтоимости,
		|КурсВалютыТаможеннойСтоимости,
		|КратностьВалютыТаможеннойСтоимости,
		|ВалютаПошлиныИНДС,
		|КурсПошлиныИНДС,
		|КратностьПошлиныИНДС");
	
	УдаляемыеКолонкиТаблицы = Новый Структура("
		|ФактурнаяСтоимость,
		|СуммаПошлины,
		|ПошлинаВВалюте,
		|НДСВВалюте");
	
	Для Каждого Элемент Из УдаляемыеРеквизитыШапки Цикл
		
		ИмяРеквизита = Элемент.Ключ;
		
		Данные["Шапка"].Удалить(ИмяРеквизита);
		
	КонецЦикла;
	
	Для Каждого Элемент Из УдаляемыеКолонкиТаблицы Цикл
		
		ИмяКолонки = Элемент.Ключ;
		
		Данные["ТабличныеЧасти"]["СоставНФА"].Колонки.Удалить(ИмяКолонки);
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПривестиПоказателиКНеотрицательнымЗначениям(Таблица, ИменаКолонокПоказателей)
	
	МассивИмен = СтрРазделить(ИменаКолонокПоказателей, ", ", Ложь);
	
	Для Каждого СтрокаТаблица Из Таблица Цикл
		
		Для Каждого ИмяКолонки Из МассивИмен Цикл
			
			Если СтрокаТаблица[ИмяКолонки] >= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблица[ИмяКолонки] = -СтрокаТаблица[ИмяКолонки];
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДвиженияСчетаФактурыНаОтгрузкуДляКнигиПокупок(ТаблицыДляДвижений, ШапкаДокумента)
	
	ТаблицаДвижений	= РегистрыНакопления.СчетаФактурыНаОтгрузкуДляКнигиПокупок.СоздатьНаборЗаписей().Выгрузить();
	
	СчетФактураНаАванс = ШапкаДокумента.ДокументОснование;
	
	Если ЗначениеЗаполнено(СчетФактураНаАванс) Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", ШапкаДокумента.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	РегистрацияСтрокиКнигиПокупокСчетаФактурыНаОтгрузку.СчетФактура КАК СчетФактура,
		               |	РегистрацияСтрокиКнигиПокупокСчетаФактурыНаОтгрузку.Дата КАК Дата,
		               |	РегистрацияСтрокиКнигиПокупокСчетаФактурыНаОтгрузку.Номер КАК Номер
		               |ИЗ
		               |	Документ.РегистрацияСтрокиКнигиПокупок.СчетаФактурыНаОтгрузку КАК РегистрацияСтрокиКнигиПокупокСчетаФактурыНаОтгрузку
		               |ГДЕ
		               |	Ссылка = &Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДатаЗачета = ?(ЗначениеЗаполнено(ШапкаДокумента.ДатаПринятияКУчету), ШапкаДокумента.ДатаПринятияКУчету, ШапкаДокумента.Дата);
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаДвижений.Добавить();
			
			НоваяСтрока.Период					= ШапкаДокумента.Дата;
			НоваяСтрока.Активность				= Истина;
			НоваяСтрока.Организация				= ШапкаДокумента.Организация;
			НоваяСтрока.СчетФактураНаАванс		= СчетФактураНаАванс;
			НоваяСтрока.ДатаЗачета				= ДатаЗачета;
			Если ШапкаДокумента.ДопЛист Тогда
				НоваяСтрока.КорректируемыйПериод = ШапкаДокумента.КорректируемыйПериод;
			КонецЕсли;
			
			НоваяСтрока.СчетФактураНаОтгрузку	= Выборка.СчетФактура;
			НоваяСтрока.НомерСчетаФактуры		= Выборка.Номер;
			НоваяСтрока.ДатаСчетаФактуры		= Выборка.Дата;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицыДляДвижений.Вставить("СчетаФактурыНаОтгрузкуДляКнигиПокупок", ТаблицаДвижений);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
