//////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ МАТЕРИАЛЬНЫМИ ЗАПАСАМИ, КЛИЕНСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ             //
//////////////////////////////////////////////////////////////////////////////////
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

#Область СлужебныйПрограммныйИнтерфейс

//Вызывается при выборе номенклатуры в табличную часть. Процедура проверяет, если вводится
// не первая строка в табличную часть, то окрывает форму выбора номенклатуры с установленным
// начальным значением выбора. Начальное значение выбора берется из предыдущей строки.
// Такое поведение программы, позволяет открывать справочник "Номенклатура" в той же группе, в которой
// был произведен предыдущий выбор.
//
// Параметры:
// ТабПоле - ТаблицаФормы - табличное поле, которое содержит табличную часть
// Элемент - ПолеВвода - поле ввода, в которое производится выбор. Это будет владелец, открываемой формы
// СтандартнаяОбработка - Булево - параментр обработчика "НачалоВыбора", из которого производится вызов процедуры
Процедура ВыборНоменклатурыИзТабличнойЧастиДокументов(ТабПоле, Элемент, СтандартнаяОбработка) Экспорт
	Если ТипЗнч(Элемент.Значение) <> Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = ТабПоле.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИндексСтроки = ТабПоле.Значение.Индекс(ТекущиеДанные);
	Если ИндексСтроки = 0 Тогда
		Возврат;
	ИначеЕсли ТабПоле.ТекущаяКолонка = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Элемент.Значение.ПолучитьФормуВыбора(, Элемент);
	
	НачальноеЗначениеВыбора = ?(ЗначениеЗаполнено(Элемент.Значение), Элемент.Значение, ТабПоле.Значение[ИндексСтроки-1][ТабПоле.ТекущаяКолонка.Имя]);
	ФормаВыбора.НачальноеЗначениеВыбора = НачальноеЗначениеВыбора;
	
	ФормаВыбора.Открыть();
КонецПроцедуры

Процедура УстановитьКомиссиюВДокументМЗ(КомиссияСсылка, Объект, Форма, НомерПриказа=Неопределено, ДатаПриказа = Неопределено) Экспорт
    Объект.СоставКомиссии.Очистить();
	Объект.ДолжностьПредседательКомиссии	= "";	
	Объект.ФамилияПредседательКомиссии	    = "";
	Объект.ИмяПредседательКомиссии	        = "";
	Объект.ОтчествоПредседательКомиссии	    = "";
	НомерПриказа						= "";
	ДатаПриказа						= Дата('00010101');
	
	ТекущаяКомиссия = ОбщегоНазначенияБГУВызовСервера.ПолучитьДанныеКомиссии(КомиссияСсылка, Объект.Дата);
	НомерПриказа	= ТекущаяКомиссия.НомерПриказа;
	ДатаПриказа		= ТекущаяКомиссия.ДатаПриказа;
	ДанныеКомиссии	= ТекущаяКомиссия.ДанныеКомиссии;
	Для каждого ТекСтрокаКомиссии Из ДанныеКомиссии Цикл
		
		Если ТекСтрокаКомиссии.Председатель Тогда
			Объект.ДолжностьПредседательКомиссии	= ТекСтрокаКомиссии.ДолжностьЧленаКомиссии;	
			Объект.ФамилияПредседательКомиссии	    = ТекСтрокаКомиссии.ФамилияЧленаКомиссии;
			Объект.ИмяПредседательКомиссии	        = ТекСтрокаКомиссии.ИмяЧленаКомиссии;
			Объект.ОтчествоПредседательКомиссии	    = ТекСтрокаКомиссии.ОтчествоЧленаКомиссии;
		Иначе
			ЗаполнитьЗначенияСвойств(Объект.СоставКомиссии.Добавить(), ТекСтрокаКомиссии);
		КонецЕсли;			
	
	КонецЦикла; 
    Форма.Модифицированность = Истина;
КонецПроцедуры

// Используется в событии ОбработкаВыбора реквизита шапки "Счет учета". Задается вопрос об очистке таблицы "Материалы".
// В зависимости от ответа либо будет отмена выбора, либо изменение значения.
// ВНИМАНИЕ!!! Событие ПриИзменении в любом случае не произойдет. Если требуется выполнить действие при изменении, то его следует
// передать как объект "ОписаниеОповещение" в параметр "ДействиеПриИзменении".
//
// Параметры:
//	ВыбранноеЗначение - Произвольный - выбранное значение (пробрасывается из вызывающего обработчика),
//	СтандартнаяОбработка - Булево - флаг стандартной обработки (пробрасывается из вызывающего обработчика),
//	Форма - ФормаКлиентскогоПриложения - форма, из которой вызывается процедура,
//	ДействиеПриИзменении - ОписаниеОповещения - после выбора значения будет выполнена обработка оповещения.
//
Процедура НачатьОбработкуВыбораСчетаУчета(ВыбранноеЗначение, СтандартнаяОбработка, Форма, ДействиеПриИзменении = Неопределено) Экспорт

	СтандартнаяОбработка = Ложь;
	Объект = Форма.Объект;
	
	Если ВыбранноеЗначение <> Объект.СчетУчета И Объект.Материалы.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'При изменении счета учета будет очищена таблица ""Материалы"".
								|Изменить счет учета?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить счет учета и очистить таблицу ""Материалы""'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять счет учета'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		ДополнительныеПараметры.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
		ДополнительныеПараметры.Вставить("ДействиеПриИзменении", ДействиеПриИзменении);
		
		Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораСчетаУчетаЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, 20,КодВозвратаДиалога.Нет);
		
		Возврат;
		
	КонецЕсли;
	
	Объект.СчетУчета = ВыбранноеЗначение;
	Форма.Модифицированность = Истина;
	
	Если ДействиеПриИзменении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДействиеПриИзменении);
	КонецЕсли;

КонецПроцедуры

// Завершающая процедура асинхронной процедуры НачатьОбработкуВыбораСчетаУчета
// 
// Параметры:
//  РезультатВопроса - КодВозвратаДиалога
//  ДополнительныеПараметры - Структура:
//  * Форма - ФормаКлиентскогоПриложения
//  * ВыбранноеЗначение - ПланСчетовСсылка.ЕПСБУ
//  * ДействиеПриИзменении - ОписаниеОповещения
Процедура ОбработкаВыбораСчетаУчетаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Форма = ДополнительныеПараметры.Форма;
	Объект = Форма.Объект;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.СчетУчета = ДополнительныеПараметры.ВыбранноеЗначение;
	Объект.Материалы.Очистить();
	Форма.Модифицированность = Истина;
	
	Если ДополнительныеПараметры.ДействиеПриИзменении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ДействиеПриИзменении);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ УЧЕТА БСО	
//

// Открывает форму подбора БСО. Параметр "Отбор" инициализируется функцией ПолучитьСтруктуруПараметровПодбораБСО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  АдресВХранилище - Строка
//  Отбор - Структура:
//  * СчетУчета - ПланСчетовСсылка.ЕПСБУ
Процедура ОткрытьПодборБСО(Форма, АдресВХранилище, Отбор) Экспорт
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("ИФО") И НЕ ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
			Отбор.Удалить("ИФО");
		КонецЕсли;
	КонецЕсли;
	Объект = Форма.Объект;
	
	ПараметрыФормы = Новый Структура("Отбор, ДатаОстатков, АдресВХранилище", Отбор, ?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата), АдресВХранилище);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ВнутреннееПеремещениеБСО") Тогда
		ПараметрыФормы.Вставить("ЦМО", Объект.ЦМООтправитель);
		ПараметрыФормы.Вставить("Подразделение", Объект.ПодразделениеОтправитель);
	Иначе
		ПараметрыФормы.Вставить("ЦМО", Объект.ЦМО);
		ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;		
	ПараметрыФормы.Вставить("ИФО", Объект.ИФО);
	ПараметрыФормы.Вставить("КФО", Объект.КФО);
	ПараметрыФормы.Вставить("СчетУчета", Отбор.СчетУчета);
    ОткрытьФорму("Справочник.БСО.Форма.ФормаПодбора", ПараметрыФормы, Форма);
КонецПроцедуры

// Возвращает структуру для заполнения параметров для передачи в форму подбора БСО в процедуре ОткрытьПодборБСО
// 
// Возвращаемое значение:
//  Структура - Получить структуру параметров подбора БСО:
// * ТолькоИмеющиеОстатки - Булево - 
// * Организация
// * ЦМО 
// * КФО 
// * ИФО 
// * СчетУчета 
Функция ПолучитьСтруктуруПараметровПодбораБСО() Экспорт

	ОтборПодбора = Новый Структура("ТолькоИмеющиеОстатки, Организация, ЦМО, КФО, ИФО, СчетУчета", Истина);
	Возврат ОтборПодбора;

КонецФункции // ПолучитьСтруктуруПараметровПодбораБСО()

Процедура ОбработатьВыборБСО(ВыбранноеЗначение, ТекущиеДанные, ВыборБСООбработан) Экспорт

	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ДлинаНомера = ВыбранноеЗначение.ДлинаНомера;
	ВыбранноеЗначение = ВыбранноеЗначение.Ссылка;
	ВыборБСООбработан = Истина;

КонецПроцедуры

Процедура УстановитьМаскуПолейПорядковогоНомера(ДлинаНомера, НомерНачальный, НомерКонечный) Экспорт

	Маска = МаскаПорядковогоНомера(ДлинаНомера);
	НомерНачальный.Маска = Маска;
	НомерКонечный.Маска = Маска;

КонецПроцедуры

Процедура ОтформатироватьВведенныйНомерБСО(ТекущиеДанные, ИмяПоля, ЗаполнитьКоличество=Ложь, ИмяТабличнойЧасти = "СоставБСО") Экспорт
	
	Номер = ТекущиеДанные[ИмяПоля];
	Если НЕ ЗначениеЗаполнено(Номер) Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ДлинаНомера <> 0 Тогда
		ДлинаНомера = ТекущиеДанные.ДлинаНомера;
	Иначе
		ДлинаНомера = ОбщегоНазначенияБГУКлиентСервер.МаксимальнаяДлинаНомераБСО();
	КонецЕсли;
	
	НомерСтрокой = УправлениеМатериальнымиЗапасамиКлиентСервер.НомерБСОСтрокой(Номер, ДлинаНомера);
	ДлинаЧисла   = СтрДлина(НомерСтрокой);
	
	#Если ВебКлиент Тогда
	Если ДлинаЧисла > ДлинаНомера Тогда
		Попытка		
			НомерСтроки	= ТекущиеДанные.НомерСтроки;
		 	ОбщегоНазначенияКлиент.СообщитьПользователю(
		 		НСтр("ru='Длина введенного порядкового номера больше, чем допустимая 
					|для выбранного БСО'"),,
					"Объект." + ИмяТабличнойЧасти + "[" + НомерСтроки + "]." + ИмяПоля);
		Исключение
	 		ОбщегоНазначенияКлиент.СообщитьПользователю(
	 			НСтр("ru='Длина введенного порядкового номера больше, чем допустимая 
					|для выбранного БСО'"),,"ИмяПоля");
		КонецПопытки;
		Возврат;																
	КонецЕсли; 
	#КонецЕсли
	
	ТекущиеДанные[ИмяПоля] = НомерСтрокой;
	
	Если ЗаполнитьКоличество Тогда
		ЗаполнитьКоличествоВТЧПоНомерамБСО(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

// Рассчитывает и заполняет реквизит "Количество" табличной части документов
// по учету БСО
//
// Параметры:
// СтрокаТЧ - СтрокаТабличнойЧасти
Процедура ЗаполнитьКоличествоВТЧПоНомерамБСО(СтрокаТЧ) Экспорт
	Если ЗначениеЗаполнено(СтрокаТЧ.НомерНачальный) И ЗначениеЗаполнено(СтрокаТЧ.НомерКонечный) Тогда
		ТипЧисло = Новый ОписаниеТипов("Число");
		НомерНЧисло = ТипЧисло.ПривестиЗначение(СтрокаТЧ.НомерНачальный);
		НомерКЧисло = ТипЧисло.ПривестиЗначение(СтрокаТЧ.НомерКонечный);
		СтрокаТЧ.Количество = НомерКЧисло - НомерНЧисло + 1;
	ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТЧ.НомерНачальный) И НЕ ЗначениеЗаполнено(СтрокаТЧ.НомерКонечный) Тогда
		СтрокаТЧ.Количество = 0;
	Иначе	
		СтрокаТЧ.Количество = 1;
	КонецЕсли;	
КонецПроцедуры	
 
// Рассчитывает и заполняет реквизит "НомерКонечный" табличной части документов
// по учету БСО
// 
// Параметры:
// СтрокаТЧ - СтрокаТабличнойЧасти
Процедура ЗаполнитьНомерКонечныйПоНомеруНачальномуИКоличеству(СтрокаТЧ) Экспорт
	ДлинаНомера = ?(СтрокаТЧ.ДлинаНомера = 0, ОбщегоНазначенияБГУКлиентСервер.МаксимальнаяДлинаНомераБСО(), СтрокаТЧ.ДлинаНомера);
	УстановитьНомерКонечныйПоНомеруНачальномуИКоличеству(СтрокаТЧ.НомерНачальный, СтрокаТЧ.НомерКонечный, СтрокаТЧ.Количество, ДлинаНомера);
КонецПроцедуры	

// Рассчитывает и заполняет реквизит "НомерКонечный" табличной части документов
// по учету БСО
// 
// Параметры:
//  НомерНачальный - Строка - Строковое значение начального номера бланка 
//  НомерКонечный - Строка - Строковое значение конечного номера бланка
//  Количество - Число - Количество бланков
//  ДлинаНомера - Число - Длина номера
Процедура УстановитьНомерКонечныйПоНомеруНачальномуИКоличеству(НомерНачальный, НомерКонечный, Количество, ДлинаНомера) Экспорт
	Если НомерНачальный = "" Тогда
		Возврат;
	КонецЕсли;
	Если Количество <= 1 Тогда
		НомерКонечный = "";
	Иначе	
		НомерНЧисло   = Число(НомерНачальный);
		НомерКЧисло   = НомерНЧисло + Количество - 1;
		НомерКСтрокой = СформироватьСтроковыйНомерБСО(НомерКЧисло, ДлинаНомера);
		НомерКонечный = НомерКСтрокой;
	КонецЕсли;	
КонецПроцедуры	
 
// Преобразует номер БСО из числового в строковый, дополняя его нулями до длины номера,
// заданного в карточке БСО.
// 
// Параметры:
//  НомерЧислом - Число - Числовой номер БСО
//  ДлинаНомера - Число - Длина номера БСО
// 
// Возвращаемое значение:
//  Строка - Строковый номер БСО
Функция СформироватьСтроковыйНомерБСО(НомерЧислом, ДлинаНомера) Экспорт 
	НомерСтрокой = Формат(НомерЧислом, "ЧГ=0");
	ДлинаЧисла   = СтрДлина(НомерСтрокой);
	КоличествоСимволов = ДлинаНомера - ДлинаЧисла;
	Для к = 1 по КоличествоСимволов Цикл 
		НомерСтрокой = "0" + НомерСтрокой;
	КонецЦикла;	
	
	Возврат НомерСтрокой;
КонецФункции	

// Производит проверку таблицы БСО на правильность заполнения номеров БСО.
// 
// Параметры:
//  ТабБСО - ДанныеФормыКоллекция:
//  * НомерСтроки - Число
//  * НомерНачальный - Строка
//  * НомерКонечный - Строка
//  Отказ - Булево - Флаг проверки. Если Истина, то есть ошибки
//  ТекстСообщения - Строка - Текст, который вернет процедура, если обнаружит ошибки
Процедура ПроверитьПравильностьЗаполненияНомеров(ТабБСО, Отказ, ТекстСообщения = "") Экспорт
	Для каждого СтрокаБСО из ТабБСО Цикл
		Если СокрЛП(СтрокаБСО.НомерНачальный) = "" Тогда
			ТекстСообщения = "В строке """ + СтрокаБСО.НомерСтроки + """ номер начальный не заполнен";
			Отказ = Истина;
			Прервать;
		ИначеЕсли СокрЛП(СтрокаБСО.НомерКонечный) = "" Тогда
			Продолжить;
		КонецЕсли;	
		
		НомерНачальныйЧисло = Число(СтрокаБСО.НомерНачальный);
		НомерКонечныйЧисло  = Число(СтрокаБСО.НомерКонечный);
		Если НомерНачальныйЧисло > НомерКонечныйЧисло Тогда
			ТекстСообщения = "В строке """ + СтрокаБСО.НомерСтроки + """ номер начальный меньше номера конечного";
			Отказ = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПОДСИСТЕМЫ УЧЕТА ПИТАНИЯ
//

// Возвращает наименование дня недели по номеру дня недели
// 
// Параметры:
//  НомерДня - Число
// 
// Возвращаемое значение:
//  Строка - Сформировать надпись дня
Функция СформироватьНадписьДня(НомерДня) Экспорт
	НадписьДня = "";
	Если НомерДня = 1 Тогда
		НадписьДня = "Понедельник";
	ИначеЕсли НомерДня = 2 Тогда
		НадписьДня = "Вторник";
	ИначеЕсли НомерДня = 3 Тогда
		НадписьДня = "Среда";
	ИначеЕсли НомерДня = 4 Тогда
		НадписьДня = "Четверг";
	ИначеЕсли НомерДня = 5 Тогда
		НадписьДня = "Пятница";
	ИначеЕсли НомерДня = 6 Тогда
		НадписьДня = "Суббота";
	ИначеЕсли НомерДня = 7 Тогда
		НадписьДня = "Воскресенье";
	КонецЕсли;	
	
	Возврат(НадписьДня);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТОВ ИНВЕНТАРИЗАЦИИ
//

Процедура ЗаполнитьОтборБаланса(ЭлементФормы_Баланс, СписокБалансов) Экспорт
	ЭлементФормы_Баланс.СписокВыбора = СписокБалансов;
КонецПроцедуры	

Процедура УстановитьЗначениеВСпискеБалансов(ЭлементФормы_Баланс, БалансОтбор, УчитыватьБаланс) Экспорт
	Если НЕ ЗначениеЗаполнено(БалансОтбор) И НЕ УчитыватьБаланс Тогда
		ЭлементФормы_Баланс.Значение = ЭлементФормы_Баланс.СписокВыбора[0].Значение;
	ИначеЕсли НЕ ЗначениеЗаполнено(БалансОтбор) И УчитыватьБаланс Тогда
		ЭлементФормы_Баланс.Значение = ЭлементФормы_Баланс.СписокВыбора[1].Значение;
	Иначе	
		ЭлементФормы_Баланс.Значение = ЭлементФормы_Баланс.СписокВыбора.НайтиПоЗначению(БалансОтбор).Значение;
	КонецЕсли;	
КонецПроцедуры	

Процедура УстановитьБалансПоЗначениюСписка(ЭлементФормы_Баланс, БалансОтбор, УчитыватьБаланс) Экспорт
	Если ЭлементФормы_Баланс.Значение = Неопределено Тогда
		БалансОтбор = "";
		УчитыватьБаланс = Ложь;
	Иначе
		БалансОтбор = ЭлементФормы_Баланс.Значение;
		УчитыватьБаланс = Истина;
	КонецЕсли;	
КонецПроцедуры	

/////////////////////////////////////////////////

Процедура НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(Форма, СчетУчета, Элемент, ДанныеВыбора,
	СтандартнаяОбработка) Экспорт
	
	Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	ТекущиеДанные = Таблица.ТекущиеДанные;
	
	ТипНоменклатуры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "ТипНоменклатуры");
	РеквизитыКПСиКФО = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "КПС")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "КФО");
		
	Если РеквизитыКПСиКФО Тогда
		УчетПоКПС = НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "УчетПоКПС")
			ИЛИ ТекущиеДанные.УчетПоКПС = Истина;
	КонецЕсли;
	
	Если РеквизитыКПСиКФО И УчетПоКПС Тогда
	
		ТекущийСчет = Новый Структура("Счет, КПС, КФО");
		ТекущийСчет.Счет = ТекущиеДанные.СчетУчета;
		ТекущийСчет.КПС  = ТекущиеДанные.КПС;
		ТекущийСчет.КФО  = ТекущиеДанные.КФО;
		
		ОграниченияСчетов = ОграничениеВыбораСчетовИзДокумента(Форма, Элемент, СчетУчета, ТипНоменклатуры);
		ОграниченияКПС = Новый Массив;
		ОграниченияКПС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.АУИБУ"));
		ОграниченияКПС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
		ОграниченияКПС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.Произвольный"));
		
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, СтандартнаяОбработка, ТекущийСчет,
			Объект.Организация, Объект.ИФО, ОграниченияСчетов, ТекущиеДанные.КФО, ОграниченияКПС, Объект.Дата);
		
	Иначе
		
		Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
		ИмяЭлемента = Элемент.Имя;
		Если СтрНачинаетсяС(ИмяЭлемента, Таблица.Имя) Тогда
			ИмяЭлемента = Сред(ИмяЭлемента, СтрДлина(Таблица.Имя) + 1);
		КонецЕсли;
		
		Если ИмяЭлемента = "СчетУчета" Тогда
			НачалоВыбораСчетаМатериалаВТаблицеДокумента(Форма, СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Дата);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(Форма, Элемент, ВыбранноеЗначение,
	СтандартнаяОбработка, ИмяРеквизитаКЭК = "", ДтКт = "") Экспорт
	
	Перем КОСГУДт, КОСГУКт;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Структура") Тогда
		// Стандартная обработка
		Возврат;
	КонецЕсли;
	
	Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Таблица.ТекущиеДанные;
	
	// Получить из структуры КПС, КФО и Счет и заполнить их в колонки строки
	ДанныеСтроки = Новый Структура("КПС, КФО, СчетУчета");
	
	ВыбранныеДанные = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ВыбранноеЗначение);
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(ВыбранныеДанные,
		ДанныеСтроки.КПС, ДанныеСтроки.КФО, КОСГУДт, КОСГУКт);
	ДанныеСтроки.СчетУчета = ВыбранныеДанные;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтроки);
	
	Если ЗначениеЗаполнено(ИмяРеквизитаКЭК) И ЗначениеЗаполнено(ДтКт) Тогда
		ТекущиеДанные[ИмяРеквизитаКЭК] = ?(ДтКт = "Дт", КОСГУДт, КОСГУКт);
	КонецЕсли;
	
	// Определить имя элемента для установки параметра ВыбранноеЗначение
	ИмяЭлемента = Элемент.Имя;
	Если СтрНачинаетсяС(ИмяЭлемента, Таблица.Имя) Тогда
		ИмяЭлемента = Сред(ИмяЭлемента, СтрДлина(Таблица.Имя) + 1);
	КонецЕсли;
	Если ИмяЭлемента = "СчетУчета" Тогда
		ВыбранноеЗначение.Свойство("Счет", ВыбранноеЗначение);
	Иначе
		ВыбранноеЗначение.Свойство(ИмяЭлемента, ВыбранноеЗначение);
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТекущейСтрокиМатериалов(
			Форма.Объект, ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

// Открывает форму выбора счета. Используется в документах учета Материальных запасов и Биологических активов
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения - 
//  СчетУчета			 - ПланСчетовСсылка.ЕПСБУ - счет, выбранный в документе
//  Элемент				 - ПолеФормы - поле формы, в которое выбирается счет
//  ДанныеВыбора		 - Неопределено - Стандартный параметр обреботчика "НачалоВыбора"
//  СтандартнаяОбработка - Булево - Стандартный параметр обреботчика "НачалоВыбора"
//  НаДату				 - Дата - Дата отбора счетов
//  ТипНоменклатуры		 - ПеречислениеСсылка.ТипыНоменклатуры - тип номенклатуры, используется при выборе счетов БА
//
Процедура НачалоВыбораСчетаМатериалаВТаблицеДокумента(Форма, СчетУчета, Элемент, ДанныеВыбора,
	СтандартнаяОбработка, НаДату = '00010101', Знач ТипНоменклатуры = Неопределено) Экспорт

	Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Таблица.ТекущиеДанные;
	Параметры = Новый Структура;
	Если ТекущиеДанные <> Неопределено Тогда
		Параметры.Вставить("ТекущаяСтрока", ТекущиеДанные.СчетУчета);
		Если ТипНоменклатуры = Неопределено Тогда
			ТипНоменклатуры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "ТипНоменклатуры");
		КонецЕсли;
	КонецЕсли;
	
	ОграниченияСчетов = ОграничениеВыбораСчетовИзДокумента(Форма, Элемент, СчетУчета, ТипНоменклатуры);
	Если ТипЗнч(ОграниченияСчетов) = Тип("СписокЗначений") Тогда
		Параметры.Вставить("ОграниченияСписокСчетов", ОграниченияСчетов);
		Параметры.Вставить("ВидСравненияВСписке", Истина);
	Иначе
		Параметры.Вставить("ОграниченияСчета", ОграниченияСчетов);
	КонецЕсли;
	Параметры.Вставить("НаДату", НаДату);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
			И ТипЗнч(Форма.Объект) = Тип("ДанныеФормыСтруктура") Тогда
		Организация = Неопределено;
		Форма.Объект.Свойство("Организация", Организация);
		Если ЗначениеЗаполнено(Организация) Тогда
			Параметры.Вставить("Организация", Организация);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НаДату) Тогда
			Дата = Неопределено;
			Форма.Объект.Свойство("Дата", Дата);
			Если ЗначениеЗаполнено(Дата) Тогда
				Параметры.Вставить("НаДату", Дата);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", Параметры, Элемент);
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура АвтоПодборСчетаМатериалаВТаблицеДокумента(Форма, СчетУчета, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка) Экспорт

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;

	Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Параметры = Новый Структура("СтрокаПоиска", Текст);
	ТекущиеДанные = Таблица.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Параметры.Вставить("ТекущаяСтрока", ТекущиеДанные.СчетУчета);
		ТипНоменклатуры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "ТипНоменклатуры");
	Иначе
		ТипНоменклатуры = Неопределено;
	КонецЕсли;
	Параметры.Вставить("Отбор", Новый Структура("ЭлементГруппа", Ложь));
	ОграниченияСчетов = ОграничениеВыбораСчетовИзДокумента(Форма, Элемент, СчетУчета, ТипНоменклатуры);
	Если ТипЗнч(ОграниченияСчетов) = Тип("СписокЗначений") Тогда
		Параметры.Вставить("ОграниченияСписокСчетов", ОграниченияСчетов);
		Параметры.Вставить("ВидСравненияВСписке", Истина);
	Иначе
		Параметры.Вставить("ОграниченияСчета", ОграниченияСчетов);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
			И ТипЗнч(Форма.Объект) = Тип("ДанныеФормыСтруктура") Тогда
		Организация = Неопределено;
		Форма.Объект.Свойство("Организация", Организация);
		Если ЗначениеЗаполнено(Организация) Тогда
			Параметры.Вставить("Организация", Организация);
		КонецЕсли;
		Дата = Неопределено;
		Форма.Объект.Свойство("Дата", Дата);
		Если ЗначениеЗаполнено(Дата) Тогда
			Параметры.Вставить("НаДату", Дата);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), Параметры);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОкончаниеВводаТекстаСчетаМатериалаВТаблицеДокумента(Форма, СчетУчета, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка) Экспорт

	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;

	Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
	Если Таблица = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Параметры = Новый Структура("СтрокаПоиска", Текст);
	ТекущиеДанные = Таблица.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Параметры.Вставить("ТекущаяСтрока", ТекущиеДанные.СчетУчета);
		ТипНоменклатуры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "ТипНоменклатуры");
	Иначе
		ТипНоменклатуры = Неопределено;
	КонецЕсли;
	Параметры.Вставить("Отбор", Новый Структура("ЭлементГруппа", Ложь));
	ОграниченияСчетов = ОграничениеВыбораСчетовИзДокумента(Форма, Элемент, СчетУчета, ТипНоменклатуры);
	Если ТипЗнч(ОграниченияСчетов) = Тип("СписокЗначений") Тогда
		Параметры.Вставить("ОграниченияСписокСчетов", ОграниченияСчетов);
		Параметры.Вставить("ВидСравненияВСписке", Истина);
	Иначе
		Параметры.Вставить("ОграниченияСчета", ОграниченияСчетов);
	КонецЕсли;
	
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), Параметры);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОткрытьПодборМатериалов(Форма, Объект, ДополнительныйПараметр = Неопределено, ПараметрыОтбора = Неопределено, ПараметрыТчИсточника = Неопределено) Экспорт

	Параметры = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыОткрытияФормыПодбора();
	
	ДатаРасчетов = ?(НачалоДня(Объект.Дата) = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса()) И Объект.Ссылка.Пустая(), Неопределено, Объект.Дата);
	Параметры.ДатаРасчетов = ДатаРасчетов;
	Если Объект.Свойство("ИФО") Тогда
		Параметры.ИФО = Объект.ИФО;
	КонецЕсли;
	Параметры.Организация = Объект.Организация;
	Параметры.ДокументСсылка = Объект.Ссылка;   
	
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда 
		Для Каждого КлючИЗначение Из ПараметрыОтбора Цикл
			Параметры.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	Иначе
		Форма.ДополнитьСтруктуруПодбора(Параметры, ДополнительныйПараметр);
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Заголовок") Тогда
		ПредставлениеТаблицы = ?(Параметры.Свойство("ПредставлениеТаблицы"), Параметры.ПредставлениеТаблицы, Параметры.ИмяТаблицы);
		ЗаголовокПодбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подбор номенклатуры в %1 (%2)'"), Объект.Ссылка, ПредставлениеТаблицы);
		Параметры.Вставить("Заголовок",		ЗаголовокПодбора);	
	КонецЕсли;
	
	Если ЭтоПодборУстаревшегоСчета106(Объект, Параметры) Тогда
		ИмяФормыПодбора = "Обработка.ПодборНоменклатуры.Форма.ФормаПодбораСтарая";
	Иначе
		ИмяФормыПодбора = "Обработка.ПодборНоменклатуры.Форма.ФормаПодбора";
	КонецЕсли;
	
	Если ПараметрыТчИсточника <> Неопределено Тогда
		Параметры.Вставить("ПараметрыТчИсточника",ПараметрыТчИсточника);
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормыПодборНоменклатуры");
	ОткрытьФорму(ИмяФормыПодбора, Параметры, Форма, Форма.УникальныйИдентификатор);

КонецПроцедуры

Процедура ОткрытьПодборМатериаловРасширенный(Форма, Объект, ДополнительныйПараметр = Неопределено, ПараметрыОтбора = Неопределено, ПараметрыТчИсточника = Неопределено) Экспорт

	Параметры = Новый Структура;
	
	ДатаРасчетов 	 = ?(НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()), Неопределено, Объект.Дата);
	Параметры.Вставить("ДатаРасчетов",	ДатаРасчетов);
	Если Объект.Свойство("ИФО") Тогда
		Параметры.Вставить("ИФО",		Объект.ИФО);
	КонецЕсли;
	Параметры.Вставить("Организация",	Объект.Организация);
	Параметры.Вставить("ДокументСсылка",Объект.Ссылка);
	Параметры.Вставить("РасширенныйПодборНоменклатуры",	Истина);
	Если Объект.Свойство("МОЛ") Тогда
		Параметры.Вставить("СотрудникОтбора",	Объект.МОЛ);
	Иначе	
		Параметры.Вставить("СотрудникОтбора",	Неопределено);
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыОтбора) = Тип("Структура") Тогда 
		Для Каждого КлючИЗначение Из ПараметрыОтбора Цикл
			Параметры.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	Иначе
		Форма.ДополнитьСтруктуруПодбора(Параметры, ДополнительныйПараметр);
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Заголовок") Тогда
		ПредставлениеТаблицы = ?(Параметры.Свойство("ПредставлениеТаблицы"), Параметры.ПредставлениеТаблицы, Параметры.ИмяТаблицы);
		ЗаголовокПодбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Подбор номенклатуры в %1 (%2)'"), Объект.Ссылка, ПредставлениеТаблицы);
		Параметры.Вставить("Заголовок",		ЗаголовокПодбора);	
	КонецЕсли;
	
	Если ПараметрыТчИсточника <> Неопределено Тогда
		Параметры.Вставить("ПараметрыТчИсточника",ПараметрыТчИсточника);
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормыПодборНоменклатуры");
	ОткрытьФорму("Обработка.ПодборНоменклатуры.Форма.ФормаПодбора", Параметры, Форма, Форма.УникальныйИдентификатор);

КонецПроцедуры

// Проверяет, что источник выбора - это форма подбора номенклатуры
//
// Параметры:
//  ИсточникВыбора	 - Произвольный - параметр ИсточникВыбора обработчика "ОбработкаВыбора"
// 
// Возвращаемое значение:
// Булево - 
//
Функция ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Экспорт
	Возврат ИсточникВыбора.ИмяФормы = "Обработка.ПодборНоменклатуры.Форма.ФормаПодбора";
КонецФункции

Процедура УстановитьСчетУчетПоНоменклатуреВСтрокеМатериалов(ТекущиеДанные, Объект, СчетУчета) Экспорт
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Если СчетУчета = Неопределено ИЛИ СчетУчета = БухгалтерскийУчетКлиентСервер.СчетПоКоду("105.00", Неопределено) Тогда
			ТекущиеДанные.СчетУчета = УправлениеМатериальнымиЗапасамиВызовСервера.СчетУчетаНоменклатуры(ТекущиеДанные.Номенклатура);
		Иначе
			ТекущиеДанные.СчетУчета = СчетУчета;
		КонецЕсли;
	Иначе
		ТекущиеДанные.СчетУчета = Неопределено;
	КонецЕсли;

КонецПроцедуры

Процедура ПриИзмененииНастройкиИспользованияКФО(Параметры) Экспорт
	
	Форма = Параметры.Форма;
	Объект = Форма.Объект;
	
	Если Объект.КФОВТабличнойЧасти Тогда
		Если ЗначениеЗаполнено(Объект.КФО) Тогда
			ВыполнитьОбработкуОповещения(Параметры.ОбработчикЗаполненияКФО);
			Объект.КФО = ПредопределенноеЗначение("Перечисление.КВД.ПустаяСсылка");
		КонецЕсли;
	Иначе
		ВыполнитьОбработкуОповещения(Параметры.ОбработчикПроверкиКФО);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКФОШапкиПриИзмененииНастройкиИспользования(Форма, МассивКФО) Экспорт
	
	Если МассивКФО.Количество() = 1 Тогда
		Форма.Объект.КФО = МассивКФО[0];
	КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МаскаПорядковогоНомера(Знач ДлинаНомера)
	
	Если ДлинаНомера = 0 Тогда
		ДлинаНомера = ОбщегоНазначенияБГУКлиентСервер.МаксимальнаяДлинаНомераБСО();
	Иначе
		ДлинаНомера = Мин(ДлинаНомера, ОбщегоНазначенияБГУКлиентСервер.МаксимальнаяДлинаНомераБСО());	
	КонецЕсли;
	
	Маска = "";
	Для к = 1 по ДлинаНомера Цикл
		Маска = Маска + "9";
	КонецЦикла;	
	
	Возврат Маска;
	
КонецФункции

Функция ЭтоПодборУстаревшегоСчета106(Объект, Параметры)
	
	ЭтоПодборСчета106 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЭтоПодборСчета106", Ложь);
	
	Возврат ЭтоПодборСчета106 И Объект.Дата < '20210101';
	
КонецФункции

Функция ОграничениеВыбораСчетовИзДокумента(Форма, Элемент, СчетУчета, ТипНоменклатуры = Неопределено)

	ОграниченияСписокСчетов = Новый СписокЗначений;
	
	Если ИспользоватьРеквизитВсеСчета105(Форма, СчетУчета) Тогда
		Если ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы")
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВсеСчета113") Тогда
			Возврат Форма.ВсеСчета113;
		Иначе
			Возврат Форма.ВсеСчета105;
		КонецЕсли;
	ИначеЕсли ИспользоватьРеквизитВсеСчета106(Форма, СчетУчета) Тогда
		Возврат Форма.ВсеСчета106;
	Иначе
		ОграниченияСписокСчетов = ОграничениеВыбораСчетовИзЭлемента(Форма, Элемент);
		Если ОграниченияСписокСчетов.Количество() > 0 Тогда
			Возврат ОграниченияСписокСчетов;
		Иначе
			Возврат СчетУчета;
		КонецЕсли;
	КонецЕсли;

КонецФункции

Функция ИспользоватьРеквизитВсеСчета105(Форма, СчетУчета)
	СчетИзФормы = ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(Форма, "Счет105", "105.00");
	Возврат ИспользоватьРеквизитСписокСчетов(Форма, "ВсеСчета105", СчетУчета, СчетИзФормы);
КонецФункции

Функция ИспользоватьРеквизитВсеСчета106(Форма, СчетУчета)
	СчетИзФормы = ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(Форма, "Счет106", "106.00");
	Возврат ИспользоватьРеквизитСписокСчетов(Форма, "ВсеСчета106", СчетУчета, СчетИзФормы);
КонецФункции

Функция ИспользоватьРеквизитСписокСчетов(Форма, ИмяРеквизита, СчетУчета, Знач ТребуемыйСчет)
	Если НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизита)
		ИЛИ Форма[ИмяРеквизита].Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ТребуемыйСчет) = Тип("Строка") Тогда
		ТребуемыйСчет = БухгалтерскийУчетВызовСервера.СчетПоКоду(ТребуемыйСчет);
	КонецЕсли;
	
	Возврат СчетУчета = Неопределено ИЛИ СчетУчета = ТребуемыйСчет; 
КонецФункции

Функция ОграничениеВыбораСчетовИзЭлемента(Форма, Элемент)
	ПараметрыВыбора = Неопределено;
	Если СтрЗаканчиваетсяНа(Элемент.Имя, "СчетУчета") Тогда
		ПараметрыВыбора = Элемент.ПараметрыВыбора;
	Иначе
		Таблица = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(Элемент, Тип("ТаблицаФормы"));
		Если Таблица <> Неопределено Тогда
			ЭлементСчет = Форма.Элементы.Найти(Таблица.Имя + "СчетУчета");
			Если ЭлементСчет <> Неопределено Тогда
				ПараметрыВыбора = ЭлементСчет.ПараметрыВыбора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыВыбора = Неопределено Тогда
		Возврат Новый СписокЗначений;
	КонецЕсли;
	
	ОграниченияСписокСчетов = Новый СписокЗначений;
	Для каждого ПараметрВыбора Из ПараметрыВыбора Цикл
	
		Если ПараметрВыбора.Имя = "ОграниченияСписокСчетов" Тогда
			ОграниченияСписокСчетов.ЗагрузитьЗначения(Новый Массив(ПараметрВыбора.Значение));
		КонецЕсли;
	
	КонецЦикла;

	Возврат ОграниченияСписокСчетов;
	
КонецФункции

#КонецОбласти
