#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;
&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ИмяИсходногоФайла;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПротоколОбмена = "";
	ЗагружатьДанныеВРежимеОбмена = Истина;
	ЗаписыватьВИнформационнуюБазуТолькоИзмененныеОбъекты = Истина;
	ОбъектыПоСсылкеЗагружатьБезПометкиУдаления = Истина;
	ОптимизированнаяЗаписьОбъектов = Истина;
	ЗаписыватьРегистрыНаборамиЗаписей = Истина;
	НастройкаАвтоматическойЗагрузкиДанных = 0;
	ИспользоватьТранзакции = Ложь;
	Элементы.КоличествоОбъектовНаТранзакцию.Доступность = ИспользоватьТранзакции;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьТранзакцииПриИзменении(Элемент)
	Элементы.КоличествоОбъектовНаТранзакцию.Доступность = ИспользоватьТранзакции;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ПроверкаЗаполненностиРеквизитов() Тогда
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Выполняется перенос данных. Пожалуйста, подождите.'"));
	
	ПротоколОбмена = "";
	
	ИмяИсходногоФайла = "";
	
	МассивЗагрузки = Новый Массив;
	ПодготовитьФайлы(МассивЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	#Если ВебКлиент Тогда 
		ТекИмяФайла = "";
		ТекАдрес = "";
		ОписаниеОповещения = Новый ОписаниеОповещения("ПоместитьФайлНаКлиенте", ЭтотОбъект);
		НачатьПомещениеФайла(ОписаниеОповещения, ТекАдрес,, Истина, УникальныйИдентификатор); 	
	#Иначе	
		ВыборФайла();
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыборФайла()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);

	ДиалогВыбораФайла.Заголовок = НСтр("ru = 'Выберите файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСтроку", ЭтотОбъект);
	
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтроку(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекИмяФайла = ВыбранныеФайлы[0];

	СтруктураОчищаемыхПолей = Новый Структура("ИмяФайла,РасширениеФайла","","");
	МассивСтрок = СписокЗагружаемыхФайлов.НайтиСтроки(СтруктураОчищаемыхПолей);
	Если МассивСтрок.Количество()>0 Тогда
		Для Каждого ЭлементМассива Из МассивСтрок Цикл 
			СписокЗагружаемыхФайлов.Удалить(ЭлементМассива);				
		КонецЦикла;
	КонецЕсли;
	СтруктураПоиска = Новый Структура("ИмяФайла",ТекИмяФайла);
	Если СписокЗагружаемыхФайлов.НайтиСтроки(СтруктураПоиска).Количество()=0 Тогда
		ТекФайл	 = Новый Файл(ТекИмяФайла);
		ТекДанные = СписокЗагружаемыхФайлов.Добавить();
		ТекДанные.ИмяФайла = ТекИмяФайла;
		ТекДанные.РасширениеФайла = ТекФайл.Расширение;
		ДлинаПрефикса = 0;	
		Если ПроверитьФайлНаРазделенность(ТекИмяФайла,ДлинаПрефикса) Тогда
			ОбщееИмяФайлов = Лев(ТекФайл.ПолноеИмя,СтрДлина(ТекФайл.ПолноеИмя)-ДлинаПрефикса-1);
			НачальныйНеРазделенныйФайл = Новый Файл(ОбщееИмяФайлов);
			ТекДанные.РасширениеИсходногоФайла = НачальныйНеРазделенныйФайл.Расширение;
			ТекДанные.ИмяИсходногоФайла = НачальныйНеРазделенныйФайл.ИмяБезРасширения;
		Иначе
			ТекДанные.РасширениеИсходногоФайла = ТекФайл.Расширение;
			ТекДанные.ИмяИсходногоФайла = ТекФайл.ИмяБезРасширения;
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл с таким именем уже присутствует в списке загружаемых файлов.'"));
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПроверкаЗаполненностиРеквизитов()
	
	Если СписокЗагружаемыхФайлов.Количество()=0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбраны файлы обмена данными.'"));
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПроверитьФайлНаРазделенность(ИмяФайла,ДлинаПрефикса)
	ДлинаИмени = СтрДлина(ИмяФайла);
	СтрокаЧ = "0123456789";
	Для Инд = 1 По ДлинаИмени Цикл
		Если Найти(СтрокаЧ,Сред(ИмяФайла,ДлинаИмени-Инд+1,1))>0 Тогда
			ДлинаПрефикса = ДлинаПрефикса + 1;
		Иначе
			Если Сред(ИмяФайла,ДлинаИмени-Инд+1,1) = "." Тогда 
				Возврат Истина;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ПоместитьФайлНаКлиенте(Результат, Адрес, ИмяФайла, ДополнительныеПараметры) Экспорт

	Если Не Результат Тогда
		Возврат;
	КонецЕсли;

	ПоместитьФайлНаСервере(Адрес, ИмяФайла);	
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьФайлНаСервере(ТекАдрес, ТекИмяФайла) 
	
	СтруктураОчищаемыхПолей = Новый Структура("ИмяФайла,РасширениеФайла","","");
	МассивСтрок = СписокЗагружаемыхФайлов.НайтиСтроки(СтруктураОчищаемыхПолей);
	Если МассивСтрок.Количество()>0 Тогда
		Для Каждого ЭлементМассива Из МассивСтрок Цикл 
			СписокЗагружаемыхФайлов.Удалить(ЭлементМассива);				
		КонецЦикла;
	КонецЕсли;
	СтруктураПоиска = Новый Структура("ИмяФайла",ТекИмяФайла);
	Если СписокЗагружаемыхФайлов.НайтиСтроки(СтруктураПоиска).Количество()=0 Тогда
		ТекФайл = Новый Файл(ТекИмяФайла);
		ТекДанные = СписокЗагружаемыхФайлов.Добавить();
		ТекДанные.ИмяФайла = ТекИмяФайла;
		ТекДанные.АдресВХранилище = ТекАдрес;
		ТекДанные.РасширениеФайла = ТекФайл.Расширение;
		ДлинаПрефикса = 0;	
		Если ПроверитьФайлНаРазделенность(ТекИмяФайла,ДлинаПрефикса) Тогда
			ОбщееИмяФайлов = Лев(ТекФайл.ПолноеИмя,СтрДлина(ТекФайл.ПолноеИмя)-ДлинаПрефикса-1);
			НачальныйНеРазделенныйФайл = Новый Файл(ОбщееИмяФайлов);
			ТекДанные.РасширениеИсходногоФайла = НачальныйНеРазделенныйФайл.Расширение;
			ТекДанные.ИмяИсходногоФайла = НачальныйНеРазделенныйФайл.ИмяБезРасширения;
		Иначе
			ТекДанные.РасширениеИсходногоФайла = ТекФайл.Расширение; 
			ТекДанные.ИмяИсходногоФайла = ТекФайл.ИмяБезРасширения;
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл с таким именем уже присутствует в списке загружаемых файлов.'"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатус(Ид, ВОбработке = Ложь)
	
	ТекущаяСтрока = СписокЗагружаемыхФайлов.НайтиПоИдентификатору(Ид);
	Если ВОбработке Тогда
		ТекущаяСтрока.Статус = БиблиотекаКартинок.ЗолотойШар;  
	ИначеЕсли ТекущаяСтрока.Загружен Тогда
		ТекущаяСтрока.Статус = БиблиотекаКартинок.ЗеленыйШар;	
	Иначе
		ТекущаяСтрока.Статус = БиблиотекаКартинок.КрасныйШар;	
	КонецЕсли;
	
КонецПроцедуры

// Длительные операции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			ЗагрузитьПодготовленныеДанные();
			
			Отбор = Новый Структура("Загружен,ВОбработке", Ложь,Ложь);
			
			Если СписокЗагружаемыхФайлов.НайтиСтроки(Отбор).Количество() = 0 Тогда  
				ОткрытьПротоколОбмена();
				Возврат;
			Иначе
				ИмяИсходногоФайла = "";	
				МассивЗагрузки = Новый Массив;
				ПодготовитьФайлы(МассивЗагрузки);
				Возврат;
			КонецЕсли;
		КонецЕсли;

	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания(
		"Подключаемый_ПроверитьВыполнениеЗадания", 
		ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
		Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФайлы(МассивЗагрузки)
		
	Для Каждого СтрокаСписка Из СписокЗагружаемыхФайлов Цикл
		Если СтрокаСписка.Загружен Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаСписка.ВОбработке Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ИмяИсходногоФайла) Тогда
			ИмяИсходногоФайла = СтрокаСписка.ИмяИсходногоФайла;
		КонецЕсли;
		
		Если СтрокаСписка.ИмяИсходногоФайла = ИмяИсходногоФайла Тогда
			Если ПустаяСтрока(СтрокаСписка.АдресВХранилище) Тогда
				ДополнительныеПараметры = Новый Структура("Ид,МассивЗагрузки",СтрокаСписка.ПолучитьИдентификатор(),МассивЗагрузки);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПомещенияФайла",ЭтотОбъект,ДополнительныеПараметры);
				НачатьПомещениеФайла(ОписаниеОповещения, "", СтрокаСписка.ИмяФайла, Ложь, УникальныйИдентификатор);
				Возврат;
			Иначе
				СтрокаСписка.ВОбработке = Истина;
				МассивЗагрузки.Добавить(СтрокаСписка.ПолучитьИдентификатор());
				ОбновитьСтатус(СтрокаСписка.ПолучитьИдентификатор(), Истина);
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
	Если МассивЗагрузки.Количество() Тогда	
		ВыполнитьЗагрузку(МассивЗагрузки); 
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайла(Результат, Адрес, ИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ТекСтрока = СписокЗагружаемыхФайлов.НайтиПоИдентификатору(ДополнительныеПараметры.Ид);
		ТекСтрока.АдресВХранилище = Адрес;
		ТекСтрока.ВОбработке = Истина;
		ДополнительныеПараметры.МассивЗагрузки.Добавить(ДополнительныеПараметры.Ид);
		ОбновитьСтатус(ДополнительныеПараметры.Ид, Истина);
	КонецЕсли;
	
	ПодготовитьФайлы(ДополнительныеПараметры.МассивЗагрузки);
	
КонецПроцедуры
	
&НаСервере
Функция ПроизвестиЗагрузкуИзФайла(МассивЗагрузки)
	
	МассивФайлов = Новый Массив;
	Если МассивЗагрузки.Количество()>1 Тогда
		Для Каждого ТекИд Из МассивЗагрузки Цикл
			ЗагружаемыйФайл = СписокЗагружаемыхФайлов.НайтиПоИдентификатору(ТекИд);
			Если ЭтоАдресВременногоХранилища(ЗагружаемыйФайл.АдресВХранилище) Тогда
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(ЗагружаемыйФайл.АдресВХранилище);
				ДвоичныеДанные.Записать(ИмяВременногоФайла);
				ДвоичныеДанные = Неопределено;
				МассивФайлов.Добавить(ИмяВременногоФайла);
			Иначе
				ТекстПредупреждения = НСтр("ru = 'При чтении файла произошли ошибки.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		ИмяФайлаОбмена = ПолучитьИмяВременногоФайла(ЗагружаемыйФайл.РасширениеИсходногоФайла);
		
		ОбъединитьФайлы(МассивФайлов,ИмяФайлаОбмена);
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			УдалитьФайлы(ИмяФайла);
		КонецЦикла;
		ДвоичныеДанныеФайлаОбмена = Новый ДвоичныеДанные(ИмяФайлаОбмена);
	Иначе
		ЗагружаемыйФайл = СписокЗагружаемыхФайлов.НайтиПоИдентификатору(МассивЗагрузки[0]);
		ДвоичныеДанныеФайлаОбмена = ПолучитьИзВременногоХранилища(ЗагружаемыйФайл.АдресВХранилище);
	КонецЕсли;
	
	СписокСвойствПереноса = Новый Структура("ПарольДляРаспаковкиФайлаОбмена,
											|ИспользоватьТранзакции,
											|КоличествоОбъектовНаТранзакцию,
											|ЗагружатьДанныеВРежимеОбмена,
											|ЗаписыватьВИнформационнуюБазуТолькоИзмененныеОбъекты,
											|ОбъектыПоСсылкеЗагружатьБезПометкиУдаления,
											|ОптимизированнаяЗаписьОбъектов,
											|ЗаписыватьРегистрыНаборамиЗаписей,
											|ОбрезатьСтрокиСправа,
											|НастройкаАвтоматическойЗагрузкиДанных");
	ЗаполнитьЗначенияСвойств(СписокСвойствПереноса,ЭтаФорма);

	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("СписокСвойствПереноса",		СписокСвойствПереноса);
	ПараметрыОбработки.Вставить("ДвоичныеДанныеФайлаОбмена",	ДвоичныеДанныеФайлаОбмена);
	ПараметрыОбработки.Вставить("РасширениеФайла",				ЗагружаемыйФайл.РасширениеИсходногоФайла);
	ПараметрыОбработки.Вставить("УникальныйИдентификатор",		УникальныйИдентификатор);
	ПараметрыОбработки.Вставить("ИмяИсходногоФайла",			ЗагружаемыйФайл.ИмяИсходногоФайла);

	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ЗаданиеВыполнено = Ложь;	
   	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда

		ФоновыеЗаданияОбменДанными.ЗагрузкаДанныхВФорматеXMLВОбщемМодуле(ПараметрыОбработки, АдресХранилища);
		ЗагрузитьПодготовленныеДанные();
      Возврат Истина;	
	
	КонецЕсли;		
		
	НаименованиеЗадания = НСтр("ru = 'Загрузка форматов обмена с банками и казначейскими системами'");
		
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);

		
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 6;
	Иначе
		ВремяОжидания = 4;
	КонецЕсли;
		
	Задание = ФоновыеЗадания.Выполнить(
	"ФоновыеЗаданияОбменДанными.ЗагрузкаДанныхВФорматеXMLВОбщемМодуле", 
		ПараметрыЭкспортнойПроцедуры, , НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
		
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗаданиеВыполнено = Истина; 
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗагрузку(МассивЗагрузки)
	
	ЗаданиеВыполнено = ПроизвестиЗагрузкуИзФайла(МассивЗагрузки);
	Если ЗаданиеВыполнено Тогда
				
		ИмяИсходногоФайла = "";	
		МассивЗагрузки = Новый Массив;
		ПодготовитьФайлы(МассивЗагрузки);
		
		Возврат;
	КонецЕсли;

	ПараметрыОбработчикаОжидания = Новый Структура();
	ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал",			1);
	ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал",			15);
	ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал",				1);
	ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала",	1.4);
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
		Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтаФорма);
	
	
КонецПроцедуры
	
&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИмяИсходногоФайла", Результат.ИмяИсходногоФайла);
	МассивФайлов = СписокЗагружаемыхФайлов.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаМассива Из МассивФайлов Цикл
		Если Результат.ФайлЗагружен Тогда 
			СтрокаМассива.Загружен = Истина;
			УдалитьИзВременногоХранилища(СтрокаМассива.АдресВХранилище);
		КонецЕсли;
		ОбновитьСтатус(СтрокаМассива.ПолучитьИдентификатор())
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Результат);
	
	ПротоколОбмена = ПротоколОбмена + Символы.ПС + Результат.ПротоколОбмена;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПротоколОбмена()
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.ДобавитьСтроку(ПротоколОбмена);
	ТекстДок.Показать(НСтр("ru = 'Протокол обмена'"));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПротокол(Команда)
	ОткрытьПротоколОбмена();
КонецПроцедуры

// Длительные операции конец
#КонецОбласти


