////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Владелец", ОтборВладелец) Тогда
		Элементы.ОтборВладелец.ТолькоПросмотр = Истина;
		Элементы.ОтборВладелец.КнопкаОткрытия = Ложь;
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборВладелец) Тогда
		Параметры.Отбор.Удалить("Владелец");
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
											"Владелец",
											ОтборВладелец,
											ВидСравненияКомпоновкиДанных.Равно,
											НСтр("ru = 'Отбор по владельцу'"),
											Истина,
											РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборВладелецПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ОтборВладелец,,, ЗначениеЗаполнено(ОтборВладелец));
	Элементы.Владелец.Видимость = НЕ ЗначениеЗаполнено(ОтборВладелец);
КонецПроцедуры
