////////////////////////////////////////////////////////////////////////////////
// Подсистема «Аудит состояния системы».
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Функция определяет имя регистрируемых событий журнала регистрации, 
// используется при отборе
//
// Возвращаемое значение - строка с именем события.
//
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	Возврат НСтр("ru = 'Аудит состояния системы'");
КонецФункции

#КонецОбласти
