#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация,Дата,ВидМежотчетногоПериода,ВидОперации,ТипДоговораДБП,ИзменитьПорядокУчетаДоходов,СчетДоходовНУ");
	
	Если НЕ (ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийКорректировкиДБП.КорректировкаДоходовБудущихПериодов
		И ЗначенияРеквизитов.ИзменитьПорядокУчетаДоходов) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаУчетнойПолитики = ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ВидМежотчетногоПериода),
		КонецГода(ЗначенияРеквизитов.Дата) + 1, ЗначенияРеквизитов.Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ОтражатьВНалоговомУчете",
		НалоговыйУчет.ПлательщикНалогаНаПрибыль(ЗначенияРеквизитов.Организация, ДатаУчетнойПолитики)
		И НЕ ЗначенияРеквизитов.ВидОперации = Перечисления.ВидыОперацийНачисленияДБП.ПередачаВБезвозмездноеПользование);
	Запрос.УстановитьПараметр("ЭтоПрочиеДоходы",
		БухгалтерскийУчет.СчетВИерархии(ЗначенияРеквизитов.СчетДоходовНУ, "Н91.01"));
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ПараметрыСписанияДоходовБудущихПериодов", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	КорректировкаДоходовБудущихПериодов.Дата КАК Период,
	|	КорректировкаДоходовБудущихПериодов.Договор КАК Договор,
	|	КорректировкаДоходовБудущихПериодов.Организация КАК Организация,
	|	КорректировкаДоходовБудущихПериодов.ТипДоговораДБП КАК ВидОперации,
	|	КорректировкаДоходовБудущихПериодов.СпособПризнанияДоходов КАК СпособПризнанияДоходов,
	|	КорректировкаДоходовБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	КорректировкаДоходовБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	КорректировкаДоходовБудущихПериодов.СчетДоходов КАК СчетДоходов,
	|	КорректировкаДоходовБудущихПериодов.СубконтоДоходов1 КАК СубконтоДоходов1,
	|	КорректировкаДоходовБудущихПериодов.СубконтоДоходов2 КАК СубконтоДоходов2,
	|	КорректировкаДоходовБудущихПериодов.СубконтоДоходов3 КАК СубконтоДоходов3,
	|	ВЫБОР
	|		КОГДА &ОтражатьВНалоговомУчете
	|			ТОГДА КорректировкаДоходовБудущихПериодов.ВидДеятельностиНУ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПустаяСсылка)
	|	КОНЕЦ КАК ВидДеятельностиНУ,
	|	ВЫБОР
	|		КОГДА &ОтражатьВНалоговомУчете
	|			ТОГДА КорректировкаДоходовБудущихПериодов.СчетДоходовНУ
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|	КОНЕЦ КАК СчетДоходовНУ,
	|	ВЫБОР
	|		КОГДА &ОтражатьВНалоговомУчете
	|				И &ЭтоПрочиеДоходы
	|			ТОГДА КорректировкаДоходовБудущихПериодов.СтатьяПрочихДоходовНУ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПрочиеДоходыИРасходы.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяПрочихДоходовНУ
	|ИЗ
	|	Документ.КорректировкаДоходовБудущихПериодов КАК КорректировкаДоходовБудущихПериодов
	|ГДЕ
	|	КорректировкаДоходовБудущихПериодов.Ссылка = &Ссылка";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

КонецПроцедуры

#КонецОбласти

#Область СписаниеДоходовБудущихПериодов

Функция РеквизитыПодчиненногоДокументаСписаниеДБП(ДокументКорректировкаДБП, ПометкаУдаления = Ложь) Экспорт
	
	Результат = Новый Структура("Номер, Дата, Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументКорректировкаДБП", ДокументКорректировкаДБП);
	Запрос.УстановитьПараметр("ПометкаУдаления",   ПометкаУдаления);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СписаниеДоходовБудущихПериодов.ДокументОснование КАК ДокументОснование,
	|	СписаниеДоходовБудущихПериодов.Ссылка КАК Ссылка,
	|	СписаниеДоходовБудущихПериодов.Номер КАК Номер,
	|	СписаниеДоходовБудущихПериодов.Дата КАК Дата
	|ИЗ
	|	Документ.СписаниеДоходовБудущихПериодов КАК СписаниеДоходовБудущихПериодов
	|ГДЕ
	|	СписаниеДоходовБудущихПериодов.ДокументОснование = &ДокументКорректировкаДБП
	|	И СписаниеДоходовБудущихПериодов.Ссылка.ПометкаУдаления = &ПометкаУдаления";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
