
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если Модифицированность Тогда
		Отказ = Истина;
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗакрытием", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Данные были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) И ВыбранДокумент(ВыбранноеЗначение) Тогда
		Если ВыбранноеЗначение = Объект.Документ Тогда
			Возврат;
		КонецЕсли;
		НачалоРаботы();
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовСтраницыТоварноТранспортнаяНакладная

&НаКлиенте
Процедура ВодительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить("Справочник.Сотрудники", Нстр("ru='Справочник ""Сотрудники""'"));
	Список.Добавить("Справочник.Контрагенты", Нстр("ru='Справочник ""Контрагенты""'"));
	
	Оповещение = Новый ОписаниеОповещения("ВыборСправочникаПриВыбореВодителя", ЭтотОбъект);
	Список.ПоказатьВыборЭлемента(Оповещение, НСтр("ru='Выберите справочник'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахТН, Водитель, "Водитель", "СторонаВодитель");
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахСВ, Водитель, "Водитель", "СторонаВодитель");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПеревозчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", , Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПеревозчикОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТекущийМакетСВ = "ПФ_MXL_Приложение8" Тогда
		Если ВыбраноФизЛицо(ВыбранноеЗначение) Тогда
			РеквизитыВПараметрахСВ.Перевозчик = "П8_1";
		Иначе
			РеквизитыВПараметрахСВ.Перевозчик = "П8_2";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПеревозчикПриИзменении(Элемент)
	
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахТН, КонтрагентПеревозчик, "Перевозчик", "СторонаПеревозчик");
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахСВ, КонтрагентПеревозчик, "Перевозчик", "СторонаПеревозчик");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентЗаказчикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", , Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентЗаказчикПриИзменении(Элемент)
	
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахТН, КонтрагентЗаказчик, "Заказчик", "СторонаЗаказчик");
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТТНРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	НомерТТН = УстановитьНомерТТН(НомерТТН, ?(Направление=1, ИСТИНА, ЛОЖЬ));
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаАвтомобиляПриИзменении(Элемент)
	
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахТН, МаркаАвтомобиля, "МаркаАвтомобиля", "СторонаМаркаАвтомобиля");
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахСВ, МаркаАвтомобиля, "МаркаАвтомобиля", "СторонаМаркаАвтомобиля");

КонецПроцедуры

&НаКлиенте
Процедура ГосНомерАвтомобиляПриИзменении(Элемент)
	
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахТН, ГосНомерАвтомобиля, "ГосНомерАвтомобиля", "СторонаГосНомерАвтомобиля");
	УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахСВ, ГосНомерАвтомобиля, "ГосНомерАвтомобиля", "СторонаГосНомерАвтомобиля");
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктПогрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Элемент", Элемент);
	ДопПараметры.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);

	ПараметрыФормы = Новый Структура;
	ЗаполнитьПараметрыФормы(ПараметрыФормы, ПунктПогрузки);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораАдресаВПолеВвода", ЭтотОбъект, ДопПараметры);
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктПогрузкиПриИзменении(Элемент)
	
	Если ПунктПогрузки <> "Структура" Тогда
		УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахТН, ПунктПогрузки, "ПунктПогрузки", "СторонаПунктПогрузки");
		УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахСВ, ПунктПогрузки, "ПунктПогрузки", "СторонаПунктПогрузки");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктРазгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Элемент", Элемент);
	ДопПараметры.Вставить("СтандартнаяОбработка", СтандартнаяОбработка);

	ПараметрыФормы = Новый Структура;
	ЗаполнитьПараметрыФормы(ПараметрыФормы, ПунктРазгрузки);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораАдресаВПолеВвода", ЭтотОбъект, ДопПараметры);
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктРазгрузкиПриИзменении(Элемент)
	
	Если ПунктРазгрузки <> "Структура" Тогда
		УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахТН, ПунктРазгрузки, "ПунктРазгрузки", "СторонаПунктРазгрузки");
		УстановитьЗначениеОбластиИзРеквизитов(РеквизитыВПараметрахСВ, ПунктРазгрузки, "ПунктРазгрузки", "СторонаПунктРазгрузки");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовСтраницыТранспортнаяНакладная

&НаКлиенте
Процедура ЛицеваяСторонаТНВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработатьВыбор(Элемент, Область, СтандартнаяОбработка,"ТН");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицеваяСторонаТНПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбработатьИзменениеСодержимого(Элемент, Область,"ТН");
	Модифицированность = Истина;
	
	ВставитьОбласть(Элемент.Имя, Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотнаяСторонаТНВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработатьВыбор(Элемент, Область, СтандартнаяОбработка,"ТН"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотнаяСторонаТНПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбработатьИзменениеСодержимого(Элемент, Область,"ТН");
	Модифицированность = Истина;
	
	ВставитьОбласть(Элемент.Имя, Область.Имя);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовСтраницыСопроводительнаяВедомость

&НаКлиенте
Процедура ЛицеваяСторонаСВВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработатьВыбор(Элемент, Область, СтандартнаяОбработка,"СВ"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицеваяСторонаСВПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбработатьИзменениеСодержимого(Элемент, Область,"СВ");
	Модифицированность = Истина;
	
	ВставитьОбласть(Элемент.Имя, Область.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотнаяСторонаСВВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбработатьВыбор(Элемент, Область, СтандартнаяОбработка,"СВ");
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотнаяСторонаСВПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ОбработатьИзменениеСодержимого(Элемент, Область,"СВ");
	Модифицированность = Истина;
	
	ВставитьОбласть(Элемент.Имя, Область.Имя);
	
КонецПроцедуры

#КонецОбласти


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	СохранитьЗаписи();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьЗаписи();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"Документ","Доступность", НЕ ЗначениеЗаполнено(Объект.Документ));
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если Элементы.ГруппаДокументы.ТекущаяСтраница = Элементы.ГруппаСтраницаТТН Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьТТН", "ПФ_MXL_Форма1Т", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Документ), ЭтаФорма, СформироватьПараметрТТН());
	ИначеЕсли Элементы.ГруппаДокументы.ТекущаяСтраница = Элементы.ГруппаСтраницаТН Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьТТН", "ПФ_MXL_Приложение4", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Документ), ЭтаФорма, СформироватьПараметрТН());
	ИначеЕсли Элементы.ГруппаДокументы.ТекущаяСтраница = Элементы.ГруппаСтраницаСВ Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.ПечатьТТН", "ПФ_MXL_Приложение8", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Документ), ЭтаФорма, СформироватьПараметрСВ());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура УстановитьЗначениеОбластиИзРеквизитов(Реквизиты, ЗначениеРеквизита, ИмяРеквизита, ИмяСтороны)
	
	Область = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Реквизиты, ИмяРеквизита, Неопределено);
	ИмяРеквизитаФормыТабДок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Реквизиты, ИмяСтороны, Неопределено);
	Если Область <> Неопределено И ИмяРеквизитаФормыТабДок <> Неопределено Тогда
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтотОбъект, ИмяРеквизитаФормыТабДок) Тогда
			ТабДок = ЭтотОбъект[ИмяРеквизитаФормыТабДок];
			ТабДок.Области[Область].Значение = ЗначениеРеквизита;
			ТабДок.Области[Область].ЦветФона = Новый Цвет(255,255,255);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗакрытием(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СохранитьЗаписи();
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборВодителя(Выбор, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Выбор) Тогда
		Водитель = Выбор;
		ВодительПриИзменении(Элементы.Водитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСправочникаПриВыбореВодителя(ВыбранныйСправочник, ДопПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныйСправочник) = Тип("Неопределено") Или ВыбранныйСправочник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоВидуКонтрагента", ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо"));
	ПараметрыФормы.Вставить("Владелец", Организация);
	
	Оповещение = Новый ОписаниеОповещения("ВыборВодителя", ЭтотОбъект);
	ОткрытьФорму(ВыбранныйСправочник.Значение + ".ФормаВыбора", ПараметрыФормы, Элементы.Водитель);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСпособаВводаЗначения(Выбор, ДопПараметры) Экспорт
	
	Если (ТипЗнч(Выбор) <> Тип("Неопределено")) И Выбор.Значение = "ДОПОГ" Тогда
		Оповещение = Новый ОписаниеОповещения("ОткрытиеФормыВыбораГруппыТоваров", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Обработка.ПечатьТТН.Форма.ФормаВыборГруппыТоваров", , ДопПараметры.Элемент, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФормыВыбораГруппыТоваров(ДанныеВыбора, ДопПараметры) Экспорт
	
	Если ДанныеВыбора <> Неопределено Тогда
		ДопПараметры.Область.Значение = ДанныеВыбора;
		Выполнить(ДопПараметры.Элемент.Имя+"ПриИзмененииСодержимогоОбласти(ДопПараметры.Элемент, ДопПараметры.Область)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСпособаВводаКонтрагента(Выбор, ДопПараметры) Экспорт
	
	Область = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "Область", Неопределено);
	Элемент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "Элемент", Неопределено);
	
	Если Область = Неопределено Или Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (ТипЗнч(Выбор) <> Тип("Неопределено")) И (Выбор.Значение = "Контрагенты" Или Выбор.Значение = "Организации") Тогда
		ДопПараметры.Вставить("ВидСправочника", Выбор.Значение);
		Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораКонтрагента", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Справочник." + Выбор.Значение + ".ФормаВыбора", , , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораКонтрагента(Выбор, ДопПараметры) Экспорт
	
	НастройкиОбласти = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "НастройкиОбласти", Неопределено);
	
	ФизЛицо = Неопределено;
	ПараметрыПредставления = Неопределено;
	
	Если НастройкиОбласти <> Неопределено Тогда
		
		НастройкиОбласти.ДопСвойства.Свойство("ФизЛицо", ФизЛицо);
		НастройкиОбласти.ДопСвойства.Свойство("ПараметрыПредставления", ПараметрыПредставления);
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ВидСправочника = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ВидСправочника", Неопределено);
	
	Если НЕ ЗначениеЗаполнено(Выбор) Тогда
		ДопПараметры.Область.Значение = "";
		Возврат;
	КонецЕсли;
	
	Если ВидСправочника = "Контрагенты" Тогда
		Если ФизЛицо = 1 Тогда
			Если НЕ ВыбраноФизЛицо(Выбор) Тогда
				ДопПараметры.Вставить("Выбор", Выбор);
				Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораКонтрагента", ЭтотОбъект, ДопПараметры);
				ПоказатьВопрос(Оповещение, Нстр("ru='В данном пункте должны выводиться сведения о физическом лице, но выбрано юридическое лицо. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
		ИначеЕсли ФизЛицо = 0 Тогда 
			Если ВыбраноФизЛицо(Выбор) Тогда
				ДопПараметры.Вставить("Выбор", Выбор);
				Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораКонтрагента", ЭтотОбъект, ДопПараметры);
				ПоказатьВопрос(Оповещение, Нстр("ru='В данном пункте должны выводиться сведения о юридическом лице, но выбрано физическое лицо. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	ДопПараметры.Область.Значение = ПредставлениеУчастника(Выбор,ПараметрыПредставления);
	Выполнить(ДопПараметры.Элемент.Имя+"ПриИзмененииСодержимогоОбласти(ДопПараметры.Элемент, ДопПараметры.Область)");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАдреса(Выбор, ДопПараметры) Экспорт
	
	Если ТипЗнч(Выбор) = Тип("Структура") Тогда
		
		Адрес = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Выбор, "Представление", "");
		Если ЗначениеЗаполнено(Адрес) Тогда
			
			Если НЕ ЛицеваяСторонаТН.Области.Найти(ДопПараметры.Область.Имя) = Неопределено Тогда
				ЛицеваяСторонаТН.Области[ДопПараметры.Область.Имя].Значение = Адрес;
				ЛицеваяСторонаТН.Области[ДопПараметры.Область.Имя].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаТНПриИзмененииСодержимогоОбласти(ДопПараметры.Элемент, ЛицеваяСторонаТН.Области[ДопПараметры.Область.Имя]);
			КонецЕсли;
			
			Если НЕ ОборотнаяСторонаТН.Области.Найти(ДопПараметры.Область.Имя) = Неопределено Тогда
				ОборотнаяСторонаТН.Области[ДопПараметры.Область.Имя].Значение = Адрес;
				ОборотнаяСторонаТН.Области[ДопПараметры.Область.Имя].ЦветФона = Новый Цвет(255,255,255);
				ОборотнаяСторонаТНПриИзмененииСодержимогоОбласти(ДопПараметры.Элемент, ОборотнаяСторонаТН.Области[ДопПараметры.Область.Имя]);
			КонецЕсли;
			
			Если НЕ ОборотнаяСторонаСВ.Области.Найти(ДопПараметры.Область.Имя) = Неопределено Тогда
				ОборотнаяСторонаСВ.Области[ДопПараметры.Область.Имя].Значение = Адрес;
				ОборотнаяСторонаСВ.Области[ДопПараметры.Область.Имя].ЦветФона = Новый Цвет(255,255,255);
				ОборотнаяСторонаСВПриИзмененииСодержимогоОбласти(ДопПараметры.Элемент, ОборотнаяСторонаСВ.Области[ДопПараметры.Область.Имя]);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборАдреса(Выбор, ДопПараметры) Экспорт
	
	Если Выбор = Неопределено Или ТипЗнч(Выбор) = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;

	Если Выбор.Значение <> "КЛАДР" Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ЗаполнитьПараметрыФормы(ПараметрыФормы, ДопПараметры.Область.Значение);
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораАдреса", ЭтотОбъект, ДопПараметры);
	
	УправлениеКонтактнойИнформациейКлиент.ОткрытьФормуКонтактнойИнформации(ПараметрыФормы, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКонтрагента(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ДопПараметры.Область.Значение = "";
		Возврат;
	КонецЕсли;
	
	Выбор = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "Выбор", Неопределено);
	
	Если Выбор <> Неопределено Тогда
		ДопПараметры.Область.Значение = ПредставлениеУчастника(Выбор, ДопПараметры.НастройкиОбласти.ДопСвойства.ПараметрыПредставления);
		Выполнить(ДопПараметры.Элемент.Имя+"ПриИзмененииСодержимогоОбласти(ДопПараметры.Элемент, ДопПараметры.Область)");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораАдресаВПолеВвода(Результат, ДопПараметры) Экспорт
	
	Элемент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "Элемент", Неопределено);
	
	Если Результат = Неопределено Или Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[Элемент.Имя] = Результат.Представление;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработатьВыбор(Элемент, Область, СтанадртнаяОбработка, ТипМакета)
	
	Отбор = Новый Структура("ИмяОбласти,ТипМакета",Область.Имя,ТипМакета); 
	СтрокаНастроекОбласти = НастройкиЗначимыхОбластейМакетов.НайтиСтроки(Отбор);
	Если СтрокаНастроекОбласти.Количество() Тогда
		НастройкиОбласти = СтрокаНастроекОбласти[0];
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Область", Область);
		ДопПараметры.Вставить("Элемент", Элемент);
		ДопПараметры.Вставить("НастройкиОбласти", НастройкиОбласти);
		ДопПараметры.Вставить("СтандартнаяОбработка", СтанадртнаяОбработка);
		Оповещение = Новый ОписаниеОповещения(НастройкиОбласти.ИмяОповещения, ЭтотОбъект, ДопПараметры);
		СтрокаНастроекОбласти[0].СписокВыбора.ПоказатьВыборЭлемента(Оповещение, Нстр("ru='Выберите способ ввода'"));
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСодержимого(Элемент, Область, ТипМакета)
	
	Если ЗначениеЗаполнено(Область.Имя)  Тогда	
		
		Если ЗначениеЗаполнено(Область.Значение) Тогда
			Область.ЦветФона = Новый Цвет(255,255,255);
		Иначе
			Область.ЦветФона = Новый Цвет(255,255,192);
		КонецЕсли;
		
		Отбор = Новый Структура("ИмяОбласти,ТипМакета", Область.Имя, ТипМакета);
		СтрокаНастроекОбласти = НастройкиЗначимыхОбластейМакетов.НайтиСтроки(Отбор);
		Если СтрокаНастроекОбласти.Количество() Тогда
			СвязаннаяОбласть = Неопределено;
			СтрокаНастроекОбласти[0].ДопСвойства.Свойство("СвязаннаяОбласть", СвязаннаяОбласть);
			Если ЗначениеЗаполнено(СвязаннаяОбласть) Тогда 
				ЭтаФорма[Элемент.Имя].Области[СвязаннаяОбласть].Значение = "";
				ЭтаФорма[Элемент.Имя].Области[СвязаннаяОбласть].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыбраноФизЛицо(Выбор)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выбор, "ВидКонтрагента") = Перечисления.ЮрФизЛицо.ФизЛицо;
	
КонецФункции

//переопределение ЭлектронныеДокументыБГУ.ПолучениеОписанияОрганизации
&НаСервере
Функция ПолучениеОписанияУчастника(СписокСведений, Список = "")

	Если ПустаяСтрока(Список) Тогда
		Список = "Наименование,ИНН,ЮридическийАдрес,Телефоны";
	КонецЕсли;

	Результат = "";

	СоответствиеПараметров = Новый Соответствие();
	СоответствиеПараметров.Вставить("Наименование", " ");
	СоответствиеПараметров.Вставить("ИНН",                " ИНН ");
	СоответствиеПараметров.Вставить("ЮридическийАдрес",   " ");
	СоответствиеПараметров.Вставить("ФактическийАдрес",   " ");
	СоответствиеПараметров.Вставить("Телефоны",           " тел.: ");
	
	Список          = Список + ?(Прав(Список, 1) = ",", "", ",");
	ЧислоПараметров = СтрЧислоВхождений(Список, ",");

	Для Счетчик = 1 по ЧислоПараметров Цикл

		ПозЗапятой = Найти(Список, ",");

		Если ПозЗапятой > 0  Тогда
			
			ИмяПараметра = Лев(Список, ПозЗапятой - 1);
			Список       = Сред(Список, ПозЗапятой + 1, СтрДлина(Список));

			Попытка
				СтрокаДополнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СписокСведений, ИмяПараметра, "");

				Если ПустаяСтрока(СтрокаДополнения) Тогда
					Продолжить;
				КонецЕсли;

				Префикс = СоответствиеПараметров[ИмяПараметра];
				Если Не ПустаяСтрока(Результат)  Тогда
					Результат = Результат + ",";
				КонецЕсли; 

				Результат = Результат + СтрокаДополнения;
			Исключение
				
				ТекстСообщения  = НСтр("ru='Не удалось определить значение параметра организации: %ИмяПараметра%'");
				ТекстСообщения  = СтрЗаменить(ТекстСообщения,"%ИмяПараметра%",ИмяПараметра);
				Сообщение       = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
				
			КонецПопытки;

		КонецЕсли;

	КонецЦикла;

	Возврат СокрЛП(Результат);

КонецФункции 

&НаСервере
Функция ПредставлениеУчастника(Участник, ПараметрыПредставления)
	Возврат ПолучениеОписанияУчастника(Обработки.ПечатьТТН.ПолучитьДанныеЮрФизЛицаТТН(Участник), ПараметрыПредставления);
КонецФункции

&НаСервере
Процедура СформироватьИнтерфейсТН()
	
	МакетТН = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ТекущийМакетТН);
	
	ОбластьЛицеваяСторона = МакетТН.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона|ВертикальнаяОбласть");
	ОбластьОборотнаяСторона = МакетТН.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона|ВертикальнаяОбласть");
	
	ЛицеваяСторонаТН.Очистить();
	ОборотнаяСторонаТН.Очистить();
	
	ЛицеваяСторонаТН.Вывести(ОбластьЛицеваяСторона);
	ОборотнаяСторонаТН.Вывести(ОбластьОборотнаяСторона);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИнтерфейсСВ()
	
	МакетСВ = РеквизитФормыВЗначение("Объект").ПолучитьМакет(ТекущийМакетСВ);
	
	ОбластьЛицеваяСторона = МакетСВ.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона|ВертикальнаяОбласть");
	ОбластьОборотнаяСторона = МакетСВ.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона|ВертикальнаяОбласть");
	
	ЛицеваяСторонаСВ.Очистить();
	ОборотнаяСторонаСВ.Очистить();
	
	ЛицеваяСторонаСВ.Вывести(ОбластьЛицеваяСторона);
	ОборотнаяСторонаСВ.Вывести(ОбластьОборотнаяСторона);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьНомерТТН(ТекущийНомер, Увеличить=ИСТИНА)
	
	Результат = "";
	
	ЦифроваяЧасть = "";
	СимвольнаяЧасть = "";
	
	К = СтрДлина(ТекущийНомер);
	
	Пока К > 0 Цикл
		С = Сред(ТекущийНомер, К, 1);
		
		Если КодСимвола(С) >= 48 И КодСимвола(С) <=57 Тогда
			ЦифроваяЧасть = С + ЦифроваяЧасть;
			
			К = К - 1;
		Иначе
			СимвольнаяЧасть = Лев(ТекущийНомер, СтрДлина(ТекущийНомер) - СтрДлина(ЦифроваяЧасть));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ЦифроваяЧасть) Тогда
		ЦифроваяЧасть = "0";
	КонецЕсли;
	
	Если НЕ Увеличить И Число(ЦифроваяЧасть) = 1 Тогда
		НовыйНомер = СтроковыеФункцииКлиентСервер.ДополнитьСтроку("1", СтрДлина(ТекущийНомер) - СтрДлина(СимвольнаяЧасть));
	Иначе
		НовыйНомер = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Формат(Число(ЦифроваяЧасть)+?(Увеличить, 1, -1), "ЧРГ=''"), СтрДлина(ТекущийНомер) - СтрДлина(СимвольнаяЧасть));
	КонецЕсли;
	
	Возврат СимвольнаяЧасть + НовыйНомер;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПараметрыФормы(ПараметрыФормы, Адрес)
	
	ПараметрыФормы.Вставить("ВидКонтактнойИнформации", Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты);
	ПараметрыФормы.Вставить("Представление", Адрес);
	
КонецПроцедуры

&НаСервере
Функция ВыбранДокумент(ПроверяемоеЗначение)
	
	Возврат Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ПроверяемоеЗначение));
	
КонецФункции

&НаСервере
Процедура ПрочитатьДанныеДокумента(ДокСсылка = Неопределено)
	
	Если ДокСсылка = Неопределено Тогда
		ДокСсылка = Объект.Документ;
	Иначе	
		ОчиститьСодержимое();
	КонецЕсли;
		
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "Организация");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварноТранспортныеИСопроводительныеДокументы.СерияТТН,
	|	ТоварноТранспортныеИСопроводительныеДокументы.НомерТТН,
	|	ТоварноТранспортныеИСопроводительныеДокументы.ДатаТТН,
	|	ТоварноТранспортныеИСопроводительныеДокументы.ДанныеТТН,
	|	ТоварноТранспортныеИСопроводительныеДокументы.ДанныеТН,
	|	ТоварноТранспортныеИСопроводительныеДокументы.МакетТН,
	|	ТоварноТранспортныеИСопроводительныеДокументы.ДанныеСВ
	|ИЗ
	|	РегистрСведений.ТоварноТранспортныеИСопроводительныеДокументы КАК ТоварноТранспортныеИСопроводительныеДокументы
	|ГДЕ
	|	ТоварноТранспортныеИСопроводительныеДокументы.Документ = &ДокСсылка";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ПервичноеЗаполнение = РезультатЗапроса.Пустой();
	Если НЕ ПервичноеЗаполнение Тогда
		
		Результат = РезультатЗапроса.Выбрать();
		Результат.Следующий();
		
		ДанныеТТН = Результат.ДанныеТТН.Получить();
		
		АдресДанныхТН  = Результат.ДанныеТН;
		ТекущийМакетТН = Результат.МакетТН;
		АдресДанныхСВ  = Результат.ДанныеСВ;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат, "ДатаТТН,НомерТТН,СерияТТН");
		
		Для Каждого КлючИЗначение Из ДанныеТТН Цикл
			Ключ = КлючИЗначение.Ключ;
			Значение = КлючИЗначение.Значение;
			ЭтаФорма[Ключ] = Значение;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПараметры(ТабДок, Данные)
	
	Для Каждого Область Из ТабДок.Области Цикл
		Если Лев(Область.Имя, 1) = "П" Тогда
			Область.Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Данные, Область.Имя, "");
			Если ЗначениеЗаполнено(Область.Значение) Тогда
				Область.ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьЗаписи()
	
	Если НЕ ЗначениеЗаполнено(Объект.Документ) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Документ";
		Сообщение.ПутьКДанным = "Документ";
		Сообщение.Текст = Нстр("ru='Перед сохранением необходимо выбрать документ!'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	ДанныеТТН = СформироватьСтруктуруТТН();
	ДанныеТН = СформироватьСтруктуруТН();
	ДанныеСВ = СформироватьСтруктуруСВ();
	
	ДанныеРегистра = РегистрыСведений.ТоварноТранспортныеИСопроводительныеДокументы.СоздатьНаборЗаписей();
	ДанныеРегистра.Отбор.Документ.Установить(Объект.Документ);
	ДанныеРегистра.Прочитать();
	
	Если ДанныеРегистра.Количество() > 0 Тогда
		Стр = ДанныеРегистра[0];
	Иначе
		Стр = ДанныеРегистра.Добавить();
	КонецЕсли;
	
	Стр.Документ = Объект.Документ;
	Стр.Период = Объект.Документ.Дата;
	Стр.СерияТТН = СерияТТН;
	Стр.НомерТТН = НомерТТН;
	Стр.ДатаТТН = ДатаТТН;
	Стр.МакетТН = ТекущийМакетТН;
	Стр.ДанныеТТН = Новый ХранилищеЗначения(ДанныеТТН, Новый СжатиеДанных(9));
	Стр.ДанныеТН = Новый ХранилищеЗначения(ДанныеТН, Новый СжатиеДанных(9));
	Стр.ДанныеСВ = Новый ХранилищеЗначения(ДанныеСВ, Новый СжатиеДанных(9));
	
	ДанныеРегистра.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруТТН()
	
	Результат = Новый Структура;
	
	Результат.Вставить("МаркаАвтомобиля", МаркаАвтомобиля);
	Результат.Вставить("ГосНомерАвтомобиля", ГосНомерАвтомобиля);
	Результат.Вставить("МаркаПрицепа", МаркаПрицепа);
	Результат.Вставить("ГосНомерПрицепа", ГосНомерПрицепа);
	Результат.Вставить("Водитель", Водитель);
	Результат.Вставить("УдостоверениеВодителя", УдостоверениеВодителя);
	Результат.Вставить("КонтрагентПеревозчик", КонтрагентПеревозчик);
	Результат.Вставить("КонтрагентЗаказчик", КонтрагентЗаказчик);
	Результат.Вставить("ПунктПогрузки", ПунктПогрузки);
	Результат.Вставить("ПунктРазгрузки", ПунктРазгрузки);
	Результат.Вставить("СрокДоставки", СрокДоставки);
	Результат.Вставить("ЛицензионнаяКарточка", ЛицензионнаяКарточка);
	Результат.Вставить("ВидПеревозки", ВидПеревозки);
		
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СформироватьСтруктуруТН()
	Результат = Новый Структура;

	Для Каждого Область Из ЛицеваяСторонаТН.Области Цикл
		Если Лев(Область.Имя, 1) = "П" Тогда
			Результат.Вставить(Область.Имя, Область.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Область Из ОборотнаяСторонаТН.Области Цикл
		Если Лев(Область.Имя, 1) = "П" Тогда
			Результат.Вставить(Область.Имя, Область.Значение);
		КонецЕсли;
	КонецЦикла;
		
	Возврат Результат;
КонецФункции

&НаСервере
Функция СформироватьСтруктуруСВ()
	Результат = Новый Структура;
		
	Для Каждого Область Из ЛицеваяСторонаСВ.Области Цикл
		Если Лев(Область.Имя, 1) = "П" Тогда
			Результат.Вставить(Область.Имя, Область.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Область Из ОборотнаяСторонаСВ.Области Цикл
		Если Лев(Область.Имя, 1) = "П" Тогда
			Результат.Вставить(Область.Имя, Область.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПроизвестиПервоначальноеЗаполнение(ДокСсылка)
	ДокИмя = ДокСсылка.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДанныеРегистра.СерияТТН КАК СерияТТН,
		|	ДанныеРегистра.НомерТТН КАК НомерТТН,
		|	&ПолеУпорядочивания КАК ПолеУпорядочивания
		|ИЗ
		|	РегистрСведений.ТоварноТранспортныеИСопроводительныеДокументы КАК ДанныеРегистра
		|ГДЕ
		|	&УсловиеТипа
		|	И &ПолеОрганизация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПолеУпорядочивания УБЫВ";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ПолеУпорядочивания",
		СтрШаблон("ВЫРАЗИТЬ(ДанныеРегистра.Документ КАК Документ.%1).Дата", ДокИмя));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&УсловиеТипа",
		СтрШаблон("ДанныеРегистра.Документ ССЫЛКА Документ.%1", ДокИмя));
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ПолеОрганизация",
		СтрШаблон("ВЫРАЗИТЬ(ДанныеРегистра.Документ КАК Документ.%1).Организация", ДокИмя));
	Запрос.УстановитьПараметр("Организация", ДокСсылка.Организация);
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		СерияТТН = Выборка.СерияТТН;
		НомерТТН = УстановитьНомерТТН(Выборка.НомерТТН);
	КонецЕсли;
	
	ДатаТТН = ДокСсылка.Дата;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСодержимое()
	РеквизитыТТН = СформироватьСтруктуруТТН();

	Для Каждого КлючИЗначение Из РеквизитыТТН Цикл
		Если ТипЗнч(ЭтаФорма[КлючИЗначение.Ключ]) = Тип("Строка") Тогда
			ЭтаФорма[КлючИЗначение.Ключ] = "";
		ИначеЕсли ТипЗнч(ЭтаФорма[КлючИЗначение.Ключ]) = Тип("Число") Тогда
			ЭтаФорма[КлючИЗначение.Ключ] = 0;
		ИначеЕсли ТипЗнч(ЭтаФорма[КлючИЗначение.Ключ]) = Тип("Булево") Тогда
			ЭтаФорма[КлючИЗначение.Ключ] = Ложь;
		ИначеЕсли ТипЗнч(ЭтаФорма[КлючИЗначение.Ключ]) = Тип("Дата") Тогда
			ЭтаФорма[КлючИЗначение.Ключ] = '00010101000000';
		КонецЕсли;
	КонецЦикла;
		
	ЛицеваяСторонаТН.Очистить();
	ОборотнаяСторонаТН.Очистить();
	АдресДанныхТН = "";
	ТекущийМакетТН = "ПФ_MXL_Приложение4"; 
	
	ЛицеваяСторонаСВ.Очистить();
	ОборотнаяСторонаСВ.Очистить();
	АдресДанныхСВ = "";
	ТекущийМакетТН = "ПФ_MXL_Приложение8";

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Функции подготовки данных для печати

&НаСервере
Функция СформироватьПараметрТТН()
	
	СтруктураПараметров = СформироватьСтруктуруТТН();
	СтруктураПараметров.Вставить("СерияТТН", СерияТТН);
	СтруктураПараметров.Вставить("НомерТТН", НомерТТН);
	СтруктураПараметров.Вставить("ДатаТТН", ДатаТТН);
	СтруктураПараметров.Вставить("Ссылка", Объект.Документ);
	
	Возврат СтруктураПараметров;
КонецФункции

&НаСервере
Функция СформироватьПараметрТН()
	
	ПечататьПолныйКомплект = НЕ ЗначениеЗаполнено(ЛицеваяСторонаТН.Области["П0_1"].Значение);

	ЛицеваяСторона = ЛицеваяСторонаТН.ПолучитьОбласть();
	ЛицеваяСторона.Область().ЦветФона = Новый Цвет(255,255,255);
	ОборотнаяСторона = ОборотнаяСторонаТН.ПолучитьОбласть();
	ОборотнаяСторона.Область().ЦветФона = Новый Цвет(255,255,255);
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ПечататьПолныйКомплект Тогда
		Для К = 1 По 4 Цикл
			ЛицеваяСторона.Области["П0_1"].Значение = К;
			ТабДок.Вывести(ЛицеваяСторона);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДок.Вывести(ОборотнаяСторона);
			Если К < 4 Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТабДок.Вывести(ЛицеваяСторона);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДок.Вывести(ОборотнаяСторона);
	КонецЕсли;
	
	АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТабДок", АдресВХ);
	СтруктураПараметров.Вставить("Ссылка", Объект.Документ);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Функция СформироватьПараметрСВ()
	
	ПечататьПолныйКомплект = НЕ ЗначениеЗаполнено(ЛицеваяСторонаСВ.Области["П0_1"].Значение);
	
	ЛицеваяСторона = ЛицеваяСторонаСВ.ПолучитьОбласть();
	ЛицеваяСторона.Область().ЦветФона = Новый Цвет(255,255,255);
	ОборотнаяСторона = ОборотнаяСторонаСВ.ПолучитьОбласть();
	ОборотнаяСторона.Область().ЦветФона = Новый Цвет(255,255,255);
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ПечататьПолныйКомплект Тогда
		Для К = 1 По 4 Цикл
			ЛицеваяСторона.Области["П0_1"].Значение = К;
			ТабДок.Вывести(ЛицеваяСторона);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДок.Вывести(ОборотнаяСторона);
			Если К < 4 Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТабДок.Вывести(ЛицеваяСторона);
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		ТабДок.Вывести(ОборотнаяСторона);
	КонецЕсли;
	
	АдресВХ = ПоместитьВоВременноеХранилище(ТабДок);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТабДок", АдресВХ);
	СтруктураПараметров.Вставить("Ссылка", Объект.Документ);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура ВставитьОбласть(ИмяРеквизита, ИмяОбласти)
	
	Область = ЭтаФорма[ИмяРеквизита].Область(ИмяОбласти);
	ЭтаФорма[ИмяРеквизита].ВставитьОбласть(Область, Область, ТипСмещенияТабличногоДокумента.БезСмещения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиНастроек(МассивОбластей, ИмяОповещения, ВидСпискаВыбора, ТипМакета, ДопСвойства = Неопределено)
	
	СписокВыбора = Новый СписокЗначений;
	Если ВидСпискаВыбора = "ДопГруппа" Тогда	
		СписокВыбора.Добавить("ДОПОГ", Нстр("ru='Выбрать из классификатор ДОПОГ'"));
		СписокВыбора.Добавить("Вручную", Нстр("ru='Ввести содержание пункта вручную'"));	
	ИначеЕсли ВидСпискаВыбора = "Контрагенты" Тогда	
		СписокВыбора.Добавить("Контрагенты", Нстр("ru='Выбрать из справочника ""Контрагенты""'"));
		СписокВыбора.Добавить("Вручную", Нстр("ru='Ввести содержание пункта вручную'"));
	ИначеЕсли ВидСпискаВыбора = "КонтрагентыОрганизации" Тогда
		СписокВыбора.Добавить("Контрагенты", Нстр("ru='Выбрать из справочника ""Контрагенты""'"));
		СписокВыбора.Добавить("Организации", Нстр("ru='Выбрать из справочника ""Организации""'"));
		СписокВыбора.Добавить("Вручную", Нстр("ru='Ввести содержание пункта вручную'"));
	ИначеЕсли ВидСпискаВыбора = "КЛАДР" Тогда
		СписокВыбора.Добавить("КЛАДР", Нстр("ru='Выбрать из классификатора адресов'"));
		СписокВыбора.Добавить("Вручную", Нстр("ru='Ввести вручную'"));
	КонецЕсли;
	
	Для Каждого ЭлементМ Из МассивОбластей Цикл
		ТекущаяСтрока = НастройкиЗначимыхОбластейМакетов.Добавить();
		ТекущаяСтрока.ИмяОбласти = ЭлементМ;
		ТекущаяСтрока.СписокВыбора = ОбщегоНазначения.СкопироватьРекурсивно(СписокВыбора);
		ТекущаяСтрока.ИмяОповещения = ИмяОповещения;
		ТекущаяСтрока.ТипМакета = ТипМакета;
		ТекущаяСтрока.ДопСвойства = ?(ДопСвойства = Неопределено,Новый Структура,ОбщегоНазначения.СкопироватьРекурсивно(ДопСвойства));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЗначимыхОбластейТНСВ(ТипМакета)
		
		ЗаполнитьСтрокиНастроек(СтрРазделить("П3_1",";"),"ВыборСпособаВводаЗначения","ДопГруппа",ТипМакета);
			
		Если ТипМакета = "ТН" Тогда
			 СтрокаОбластейКонтрагентов = "П1_1;П2_1;П10_1;П10_3";
		Иначе
			 СтрокаОбластейКонтрагентов = "П1_1;П2_1;П1_3;П2_3;П8_1;П8_3;П8_4";
		КонецЕсли;	
		МассивИменКонтрагенты = СтрРазделить(СтрокаОбластейКонтрагентов,";");
		ДопСвойстваК = Новый Структура("ФизЛицо",0);
		ДопСвойстваК.Вставить("ПараметрыПредставления","Наименование,ФактическийАдрес,Телефоны");
		ЗаполнитьСтрокиНастроек(МассивИменКонтрагенты,"ВыборСпособаВводаКонтрагента","Контрагенты",ТипМакета,ДопСвойстваК);
				
		СтрокаОбластейОрганизаций = "П1_2;П2_2";
		Если ТипМакета = "ТН" Тогда
			 СтрокаОбластейОрганизаций = СтрокаОбластейОрганизаций + ";П10_2";
		Иначе	
			 СтрокаОбластейОрганизаций = СтрокаОбластейОрганизаций + ";П10_1;П10_3;П8_2;";
		КонецЕсли;
		МассивИменКонтрагентыОрганизации = СтрРазделить(СтрокаОбластейОрганизаций,";");
		ЗаполнитьСтрокиНастроек(МассивИменКонтрагентыОрганизации,"ВыборСпособаВводаКонтрагента","КонтрагентыОрганизации",ТипМакета,ДопСвойстваК);
				
		Если ТипМакета = "ТН" Тогда
			 СтрокаОбластейБезАдреса = "П1_3;П10_3";
		Иначе
			 СтрокаОбластейБезАдреса = "П1_3;П2_3";
		КонецЕсли;
		
		МассивИменБезАдреса = СтрРазделить(СтрокаОбластейБезАдреса,";");
		Для Каждого ДопНастройка Из МассивИменБезАдреса Цикл
			Отбор = Новый Структура("ИмяОбласти,ТипМакета",ДопНастройка,ТипМакета);
			СтрокиНастроек = НастройкиЗначимыхОбластейМакетов.НайтиСтроки(Отбор);
			Если СтрокиНастроек.Количество() Тогда
				СтрокиНастроек[0].ДопСвойства.ПараметрыПредставления = "ПолноеНаименование,Телефоны";
			КонецЕсли;
		КонецЦикла;
		
		Если ТипМакета = "ТН" Тогда
			МассивИменФЛ =  СтрРазделить("П1_1;П2_1;П10_3",";");
		Иначе
			МассивИменФЛ =  СтрРазделить("П1_1;П2_1;П1_3;П2_3;П8_1;П8_3;П8_4",";");
		КонецЕсли;
		
		Для Каждого ДопНастройка Из МассивИменФЛ Цикл
			Отбор = Новый Структура("ИмяОбласти,ТипМакета",ДопНастройка,ТипМакета);
			СтрокиНастроек = НастройкиЗначимыхОбластейМакетов.НайтиСтроки(Отбор);
			Если СтрокиНастроек.Количество() Тогда
				СтрокиНастроек[0].ДопСвойства.ФизЛицо = 1;
			КонецЕсли;
		КонецЦикла;
				
		МассивИменКладр = СтрРазделить("П6_1;П7_1;П14_3",";");
		ЗаполнитьСтрокиНастроек(МассивИменКладр,"ВыборАдреса","КЛАДР",ТипМакета);
		
		ЗависимыеЯчейки = Новый Структура;
		ЗависимыеЯчейки.Вставить("П1_1","П1_2");
		ЗависимыеЯчейки.Вставить("П2_1","П2_2");
		ЗависимыеЯчейки.Вставить("П1_2","П1_1");
		ЗависимыеЯчейки.Вставить("П2_2","П2_1");
		Если ТипМакета = "ТН" Тогда
			ЗависимыеЯчейки.Вставить("П10_1","П10_2");
			ЗависимыеЯчейки.Вставить("П10_2","П10_1");
		Иначе
			ЗависимыеЯчейки.Вставить("П8_1","П8_2");
			ЗависимыеЯчейки.Вставить("П8_2","П8_1");
		КонецЕсли;
		Для Каждого Зависимость Из ЗависимыеЯчейки Цикл
			Отбор = Новый Структура("ИмяОбласти,ТипМакета",Зависимость.Ключ,ТипМакета);
			СтрокиНастроек = НастройкиЗначимыхОбластейМакетов.НайтиСтроки(Отбор);
			Если СтрокиНастроек.Количество() Тогда
				СтрокиНастроек[0].ДопСвойства.Вставить("СвязаннаяОбласть",Зависимость.Значение); 
			КонецЕсли;
		КонецЦикла;
				
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЗначимыхОбластейТН2116(ТипМакета = "ТН")
	
		ЗаполнитьСтрокиНастроек(СтрРазделить("П3_1",";"),"ВыборСпособаВводаЗначения","ДопГруппа",ТипМакета);
		
		МассивИменКонтрагенты = СтрРазделить("П6_2;П9_3",";");
		ДопСвойстваК = Новый Структура("ФизЛицо",1);
		ДопСвойстваК.Вставить("ПараметрыПредставления","Наименование,ФактическийАдрес,Телефоны");
		ЗаполнитьСтрокиНастроек(МассивИменКонтрагенты,"ВыборСпособаВводаКонтрагента","Контрагенты",ТипМакета,ДопСвойстваК);
		
		МассивИменКонтрагентыОрганизации = СтрРазделить("П1_1;П2_1;П1а_1;П2_1;П6_1;П8_1;П12_6",";");
		ДопСвойстваК = Новый Структура("ФизЛицо",2);
		ДопСвойстваК.Вставить("ПараметрыПредставления","Наименование,ФактическийАдрес,ИНН,Телефоны");
		ЗаполнитьСтрокиНастроек(МассивИменКонтрагентыОрганизации,"ВыборСпособаВводаКонтрагента","КонтрагентыОрганизации",ТипМакета,ДопСвойстваК);

		МассивИменКладр = СтрРазделить("П2_2;П10_1;П14_3",";");
		ЗаполнитьСтрокиНастроек(МассивИменКладр,"ВыборАдреса","КЛАДР",ТипМакета);
		
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЗначимыеОбластиМакетов()
	
	РеквизитыВПараметрахТН ="";
	РеквизитыВПараметрахСВ ="";
	НастройкиЗначимыхОбластейМакетов.Очистить();
	
	Если ТекущийМакетТН = "ПФ_MXL_Приложение4" Тогда
		ЗаполнитьНастройкиЗначимыхОбластейТНСВ("ТН");
		РеквизитыВПараметрахТН = Новый Структура;
		РеквизитыВПараметрахТН.Вставить("Водитель", "П10_3");
		РеквизитыВПараметрахТН.Вставить("СторонаВодитель", "ОборотнаяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("МаркаАвтомобиля", "П11_1");
		РеквизитыВПараметрахТН.Вставить("СторонаМаркаАвтомобиля", "ОборотнаяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("ГосНомерАвтомобиля", "П11_2");
		РеквизитыВПараметрахТН.Вставить("СторонаГосНомерАвтомобиля", "ОборотнаяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("ПунктПогрузки", "П6_1");
		РеквизитыВПараметрахТН.Вставить("СторонаПунктПогрузки", "ЛицеваяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("ПунктРазгрузки", "П7_1");
		РеквизитыВПараметрахТН.Вставить("СторонаПунктРазгрузки", "ЛицеваяСторонаТН");
	ИначеЕсли ТекущийМакетТН = "ПФ_MXL_Приложение4_2116" Тогда
		ЗаполнитьНастройкиЗначимыхОбластейТН2116();
		РеквизитыВПараметрахТН = Новый Структура;
		РеквизитыВПараметрахТН.Вставить("Водитель", "П6_2");
		РеквизитыВПараметрахТН.Вставить("СторонаВодитель", "ЛицеваяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("Перевозчик", "П6_1");
		РеквизитыВПараметрахТН.Вставить("СторонаПеревозчик", "ЛицеваяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("Заказчик", "П1а_1");
		РеквизитыВПараметрахТН.Вставить("СторонаЗаказчик", "ЛицеваяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("МаркаАвтомобиля", "П7_1");
		РеквизитыВПараметрахТН.Вставить("СторонаМаркаАвтомобиля", "ЛицеваяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("ГосНомерАвтомобиля", "П7_2");
		РеквизитыВПараметрахТН.Вставить("СторонаГосНомерАвтомобиля", "ЛицеваяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("ПунктПогрузки", "П8_2");
		РеквизитыВПараметрахТН.Вставить("СторонаПунктПогрузки", "ОборотнаяСторонаТН");
		РеквизитыВПараметрахТН.Вставить("ПунктРазгрузки", "П8_3");
		РеквизитыВПараметрахТН.Вставить("СторонаПунктРазгрузки", "ОборотнаяСторонаТН");
	КонецЕсли;
	
	Если ТекущийМакетСВ = "ПФ_MXL_Приложение8" Тогда
		ЗаполнитьНастройкиЗначимыхОбластейТНСВ("СВ");
		РеквизитыВПараметрахСВ = Новый Структура;
		РеквизитыВПараметрахСВ.Вставить("Водитель", "П8_4");
		РеквизитыВПараметрахСВ.Вставить("СторонаВодитель", "ОборотнаяСторонаСВ");
		РеквизитыВПараметрахСВ.Вставить("Перевозчик", "П8_2");
		РеквизитыВПараметрахСВ.Вставить("СторонаПеревозчик", "ОборотнаяСторонаСВ");
		РеквизитыВПараметрахСВ.Вставить("МаркаАвтомобиля", "П9_1");
		РеквизитыВПараметрахСВ.Вставить("СторонаМаркаАвтомобиля", "ОборотнаяСторонаСВ");
		РеквизитыВПараметрахСВ.Вставить("ГосНомерАвтомобиля", "П9_2");
		РеквизитыВПараметрахСВ.Вставить("СторонаГосНомерАвтомобиля", "ОборотнаяСторонаСВ");
		РеквизитыВПараметрахСВ.Вставить("ПунктПогрузки", "П6_1");
		РеквизитыВПараметрахСВ.Вставить("СторонаПунктПогрузки", "ОборотнаяСторонаСВ");
		РеквизитыВПараметрахСВ.Вставить("ПунктРазгрузки", "П7_1");
		РеквизитыВПараметрахСВ.Вставить("СторонаПунктРазгрузки", "ОборотнаяСторонаСВ");
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьРеквизиты()
	
	Если Параметры.Свойство("Документ", Объект.Документ) Тогда
		ПрочитатьДанныеДокумента();
	Иначе
		ДатаТТН = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ПервичноеЗаполнение Тогда
		ПроизвестиПервоначальноеЗаполнение(Объект.Документ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущийМакетТН) Тогда
		Если ДатаТТН < '20211130' Тогда
			ТекущийМакетТН = "ПФ_MXL_Приложение4";
		Иначе
			ТекущийМакетТН = "ПФ_MXL_Приложение4_2116";
		КонецЕсли;
	КонецЕсли;
		
	ТекущийМакетСВ = "ПФ_MXL_Приложение8";

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Документ", "Доступность", НЕ ЗначениеЗаполнено(Объект.Документ));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументТН(ДанныеДляЗаполнения, ПервичноеЗаполнение)
			
	Если ПервичноеЗаполнение Тогда
			
		Если ТекущийМакетТН = "ПФ_MXL_Приложение4" Тогда
			
			ПредставлениеГрузоотправителя = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "Наименование,ФактическийАдрес,Телефоны");
			ПредставлениеГрузополучателя  = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОГрузополучателе,  "Наименование,ФактическийАдрес,Телефоны");
			
			ФизЛицоОтправитель = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "ВидКонтрагента") = Перечисления.ЮрФизЛицо.ФизЛицо;
			ФизЛицоПолучатель  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузополучателе, "ВидКонтрагента") = Перечисления.ЮрФизЛицо.ФизЛицо;
			
			ЛицеваяСторонаТН.Области["П3_2"].Значение = "Всего мест: " + ДанныеДляЗаполнения.КоличествоМест;
			ЛицеваяСторонаТН.Области["П3_2"].ЦветФона = Новый Цвет(255,255,255);
			
			Если ФизЛицоОтправитель Тогда
				ЛицеваяСторонаТН.Области["П1_1"].Значение = ПредставлениеГрузоотправителя;
			Иначе
				ЛицеваяСторонаТН.Области["П1_2"].Значение = ПредставлениеГрузоотправителя;
			КонецЕсли;
			ОборотнаяСторонаТН.Области["П16_1"].Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "Наименование", "");
			
			Если ФизЛицоПолучатель Тогда
				ЛицеваяСторонаТН.Области["П2_1"].Значение = ПредставлениеГрузополучателя;
			Иначе
				ЛицеваяСторонаТН.Области["П2_2"].Значение = ПредставлениеГрузополучателя;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЛицеваяСторонаТН.Области["П1_1"].Значение) Тогда
				ЛицеваяСторонаТН.Области["П1_1"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаТН.Области["П1_2"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЛицеваяСторонаТН.Области["П2_1"].Значение) Тогда
				ЛицеваяСторонаТН.Области["П2_1"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаТН.Области["П2_2"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЛицеваяСторонаТН.Области["П1_2"].Значение) Тогда
				ЛицеваяСторонаТН.Области["П1_2"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаТН.Области["П1_1"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЛицеваяСторонаТН.Области["П2_2"].Значение) Тогда
				ЛицеваяСторонаТН.Области["П2_2"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаТН.Области["П2_1"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ОборотнаяСторонаТН.Области["П16_1"].Значение) Тогда
				ОборотнаяСторонаТН.Области["П16_1"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			
		ИначеЕсли ТекущийМакетТН = "ПФ_MXL_Приложение4_2116" Тогда
			
			ЛицеваяСторонаТН.Области["П0_2"].Значение = ДатаТТН;
			ЛицеваяСторонаТН.Области["П0_22"].Значение = ДатаТТН;
			ЛицеваяСторонаТН.Области["П0_2"].ЦветФона = Новый Цвет(255,255,255);
			ЛицеваяСторонаТН.Области["П0_22"].ЦветФона = Новый Цвет(255,255,255);
			
			ЛицеваяСторонаТН.Области["П0_5"].Значение = НомерТТН;
			ЛицеваяСторонаТН.Области["П0_3"].Значение = НомерТТН;
			ЛицеваяСторонаТН.Области["П0_5"].ЦветФона = Новый Цвет(255,255,255);
			ЛицеваяСторонаТН.Области["П0_3"].ЦветФона = Новый Цвет(255,255,255);
			
			ПредставлениеГрузоотправителя = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "Наименование,ИНН,ФактическийАдрес,Телефоны");
			ПредставлениеГрузополучателя  = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОГрузополучателе,  "Наименование,ИНН,ФактическийАдрес,Телефоны");
			ПредставлениеПеревозчика  = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОПеревозчике,  "Наименование,ИНН,ФактическийАдрес,Телефоны");
			
			ЛицеваяСторонаТН.Области["П1_1"].Значение = ПредставлениеГрузоотправителя; 
			ЛицеваяСторонаТН.Области["П2_1"].Значение = ПредставлениеГрузополучателя;
			ЛицеваяСторонаТН.Области["П6_1"].Значение = ПредставлениеПеревозчика;
			ЛицеваяСторонаТН.Области["П1_1"].ЦветФона = Новый Цвет(255,255,255);
			ЛицеваяСторонаТН.Области["П2_1"].ЦветФона = Новый Цвет(255,255,255);
			ЛицеваяСторонаТН.Области["П6_1"].ЦветФона = Новый Цвет(255,255,255);
			
			ЛицеваяСторонаТН.Области["П3_2"].Значение = "Всего мест: " + ДанныеДляЗаполнения.КоличествоМест;
			ЛицеваяСторонаТН.Области["П3_2"].ЦветФона = Новый Цвет(255,255,255);
			
			ОборотнаяСторонаТН.Области["П8_1"].Значение = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "Наименование,ИНН");
			ОборотнаяСторонаТН.Области["П8_1"].ЦветФона = Новый Цвет(255,255,255);
			
			ОборотнаяСторонаТН.Области["П8_2"].Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "ФактическийАдрес", "");
			ОборотнаяСторонаТН.Области["П8_2"].ЦветФона = Новый Цвет(255,255,255);
			
			ОборотнаяСторонаТН.Области["П12_7"].Значение = ПредставлениеГрузоотправителя;
			ОборотнаяСторонаТН.Области["П12_7"].ЦветФона = Новый Цвет(255,255,255);
			
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(АдресДанныхТН) Тогда
			ДанныеТН = АдресДанныхТН.Получить();
			ЗаполнитьПараметры(ЛицеваяСторонаТН, ДанныеТН);
			ЗаполнитьПараметры(ОборотнаяСторонаТН, ДанныеТН);
			Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументСВ(ДанныеДляЗаполнения, ПервичноеЗаполнение)
	
	Если ПервичноеЗаполнение Тогда
		
		Если ТекущийМакетСВ = "ПФ_MXL_Приложение8" Тогда
			
			ПредставлениеГрузоотправителя = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "Наименование,ФактическийАдрес,Телефоны");
			ПредставлениеГрузополучателя  = ПолучениеОписанияУчастника(ДанныеДляЗаполнения.СведенияОГрузополучателе,  "Наименование,ФактическийАдрес,Телефоны");
			
			ФизЛицоОтправитель = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "ВидКонтрагента") = Перечисления.ЮрФизЛицо.ФизЛицо;
			ФизЛицоПолучатель  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузополучателе, "ВидКонтрагента") = Перечисления.ЮрФизЛицо.ФизЛицо;
			
			ЛицеваяСторонаСВ.Области["П3_2"].Значение = "Всего мест: " + ДанныеДляЗаполнения.КоличествоМест;
			ЛицеваяСторонаСВ.Области["П3_2"].ЦветФона = Новый Цвет(255,255,255);
			
			Если ФизЛицоОтправитель Тогда
				ЛицеваяСторонаСВ.Области["П1_1"].Значение = ПредставлениеГрузоотправителя;
			Иначе
				ЛицеваяСторонаСВ.Области["П1_2"].Значение = ПредставлениеГрузоотправителя;
			КонецЕсли;
			ОборотнаяСторонаСВ.Области["П10_1"].Значение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузоотправителе, "Наименование", "");
			
			Если ФизЛицоПолучатель Тогда
				ЛицеваяСторонаСВ.Области["П2_1"].Значение = ПредставлениеГрузополучателя;
			Иначе
				ЛицеваяСторонаСВ.Области["П2_2"].Значение = ПредставлениеГрузополучателя;
			КонецЕсли;
			ОборотнаяСторонаСВ.Области["П10_3"].Значение =ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДляЗаполнения.СведенияОГрузополучателе, "Наименование", "");
			
			Если ЗначениеЗаполнено(ЛицеваяСторонаСВ.Области["П1_1"].Значение) Тогда
				ЛицеваяСторонаСВ.Области["П1_1"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаСВ.Области["П1_2"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЛицеваяСторонаСВ.Области["П2_1"].Значение) Тогда
				ЛицеваяСторонаСВ.Области["П2_1"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаСВ.Области["П2_2"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЛицеваяСторонаСВ.Области["П1_2"].Значение) Тогда
				ЛицеваяСторонаСВ.Области["П1_2"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаСВ.Области["П1_1"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ЛицеваяСторонаСВ.Области["П2_2"].Значение) Тогда
				ЛицеваяСторонаСВ.Области["П2_2"].ЦветФона = Новый Цвет(255,255,255);
				ЛицеваяСторонаСВ.Области["П2_1"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ОборотнаяСторонаСВ.Области["П10_1"].Значение) Тогда
				ОборотнаяСторонаСВ.Области["П10_1"].ЦветФона = Новый Цвет(255,255,255);
				ОборотнаяСторонаСВ.Области["П10_2"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			Если ЗначениеЗаполнено(ОборотнаяСторонаСВ.Области["П10_3"].Значение) Тогда
				ОборотнаяСторонаСВ.Области["П10_3"].ЦветФона = Новый Цвет(255,255,255);
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(АдресДанныхСВ) Тогда
			ДанныеСВ = АдресДанныхСВ.Получить();
			ЗаполнитьПараметры(ЛицеваяСторонаСВ, ДанныеСВ);
			ЗаполнитьПараметры(ОборотнаяСторонаСВ, ДанныеСВ);
			Модифицированность = Ложь;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция СтруктураДанныхДляЗаполненияТНСВ()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Грузоотправитель");
	СтруктураДанных.Вставить("Грузополучатель");
	СтруктураДанных.Вставить("Перевозчик");
	СтруктураДанных.Вставить("СведенияОГрузоотправителе");
	СтруктураДанных.Вставить("СведенияОГрузополучателе");
	СтруктураДанных.Вставить("СведенияОПеревозчике");
	СтруктураДанных.Вставить("КоличествоМест");
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеДляЗаполненияТНСВ(ДокСсылка)
	
	СтруктураВозврата = СтруктураДанныхДляЗаполненияТНСВ();
		
	ПолноеИмяОбъекта = СтандартныеПодсистемыВызовСервера.ПолноеИмяОбъектаМетаданных(ТипЗнч(ДокСсылка));
	
	РезультатЗапроса = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).ДанныеДляТТН(ДокСсылка, Истина);
	
	РеквизитыШапки = РезультатЗапроса[0].Выбрать();
	РеквизитыШапки.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата,РеквизитыШапки);

	СтруктураВозврата.СведенияОГрузоотправителе = Обработки.ПечатьТТН.ПолучитьДанныеЮрФизЛицаТТН(РеквизитыШапки.Грузоотправитель);
	СтруктураВозврата.СведенияОГрузополучателе  = Обработки.ПечатьТТН.ПолучитьДанныеЮрФизЛицаТТН(РеквизитыШапки.Грузополучатель);
	СтруктураВозврата.СведенияОПеревозчике = Обработки.ПечатьТТН.ПолучитьДанныеЮрФизЛицаТТН(РеквизитыШапки.Перевозчик);

	Если Не РезультатЗапроса[1].Пустой() Тогда
		ИтогиТЧ = РезультатЗапроса[1].Выбрать();
		ИтогиТЧ.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ИтогиТЧ);
	КонецЕсли;

	Возврат СтруктураВозврата;
	
КонецФункции

Процедура НачалоРаботы()
	
	ИнициализироватьРеквизиты();
	СформироватьИнтерфейсТН();
	СформироватьИнтерфейсСВ();
	ИнициализироватьЗначимыеОбластиМакетов();
	ДанныеДляЗаполнения = ПодготовитьДанныеДляЗаполненияТНСВ(Объект.Документ);
	ЗаполнитьТабличныйДокументТН(ДанныеДляЗаполнения,ПервичноеЗаполнение);
	ЗаполнитьТабличныйДокументСВ(ДанныеДляЗаполнения,ПервичноеЗаполнение);
	
КонецПроцедуры

#КонецОбласти