#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = '(устарел) В редакции постановления Правительства РФ от 24.10.2013 г. № 952'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьОтчет(Знач ПараметрыОтчета, ВозвратАдресХранилищаРезультата) Экспорт
	
	// Установленные параметры отчета:
	Если ЗначениеЗаполнено(ПараметрыОтчета["НачалоПериода"]) Тогда
		ПараметрыОтчета["НачалоПериода"] = НачалоДня(ПараметрыОтчета["НачалоПериода"]);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета["КонецПериода"]) Тогда
		ПараметрыОтчета["КонецПериода"] = КонецДня(ПараметрыОтчета["КонецПериода"]);
	КонецЕсли;
	УникальныйИдентификаторФормы	= ПараметрыОтчета["УникальныйИдентификаторФормы"];
	
	// Результаты отчета:
	СписокСформированныхЛистов = Новый СписокЗначений();
	ТаблицаСформированныхЛистов = Новый ТаблицаЗначений();
	КЧ = Новый КвалификаторыЧисла(4, 0, ДопустимыйЗнак.Любой);
	ТаблицаСформированныхЛистов.Колонки.Добавить("Картинка",							Новый ОписаниеТипов("Картинка"));
	ТаблицаСформированныхЛистов.Колонки.Добавить("Наименование",						Новый ОписаниеТипов("Строка"));
	ТаблицаСформированныхЛистов.Колонки.Добавить("ИндексСоответствующейСтрокиСписка",	Новый ОписаниеТипов("Число", КЧ));
	ТаблицаСформированныхЛистов.Колонки.Добавить("ДатаНачалаПериода",					Новый ОписаниеТипов("Дата"));
	ТаблицаСформированныхЛистов.Колонки.Добавить("АдресХранилищаСДаннымиЛиста",			Новый ОписаниеТипов("Строка"));
	ТаблицаСформированныхЛистов.Колонки.Добавить("ЭтоДанныеОднимСписком",				Новый ОписаниеТипов("Булево"));
	ТаблицаСформированныхЛистов.Колонки.Добавить("ЭтоПустойЛист",						Новый ОписаниеТипов("Булево"));
	
	СформироватьЖурналУчета(ПараметрыОтчета, СписокСформированныхЛистов, ТаблицаСформированныхЛистов);
	
	ДозаполнитьДеревоСформированныхЛистов(ПараметрыОтчета, СписокСформированныхЛистов, ТаблицаСформированныхЛистов, УникальныйИдентификаторФормы);
	
	РезультатыОтчета = Новый Структура();
	РезультатыОтчета.Вставить("ТаблицаСформированныхЛистов",	ТаблицаСформированныхЛистов);
	ВозвратАдресХранилищаРезультата = ПоместитьВоВременноеХранилище(РезультатыОтчета, УникальныйИдентификаторФормы);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура СформироватьЖурналУчета(ПараметрыОтчета, СписокСформированныхЛистов, ТаблицаСформированныхЛистов)
	
	РезультатДерево											= Новый ДеревоЗначений();
	ИспользуемаяКартинкаВДеревеЛистовПоНалоговымПериодам	= Неопределено;
	ИспользуемаяКартинкаВДеревеЛистовОднимСписком			= БиблиотекаКартинок.РежимПросмотраСпискаСписок;
	
	УникальныйИдентификаторФормы		= ПараметрыОтчета["УникальныйИдентификаторФормы"];
	
    // Настраиваем схему КД:
	НастройкиСКД = ПолучитьНастройкиСКД(ПараметрыОтчета);
	ИспользуемаяСхемаКомпоновкиДанных	= НастройкиСКД["ИспользуемаяСхемаКомпоновкиДанных"];
	НовыйКомпоновщикНастроек			= НастройкиСКД["НовыйКомпоновщикНастроек"];
	
	// Выполняем схему:
	Попытка
		// Выводим результат в дерево:
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
			ИспользуемаяСхемаКомпоновкиДанных,				// 1
			НовыйКомпоновщикНастроек.ПолучитьНастройки(),	// 2
			,												// 3
			,												// 4
			Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));// 5
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных();
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ПроцессорВывода.УстановитьОбъект(РезультатДерево);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		УчетНДС.СвернутьОдноименныеКолонкиДерева(РезультатДерево);
		
		Для Каждого СтрокаГруппировки Из РезультатДерево.Строки Цикл
			
			Если СтрокаГруппировки["ЭтоГруппировкаНалоговыйПериод"] = Истина Тогда
				// Выводим в табличный документ:
				ТабДокумент = ВывестиЖурналЗаНалоговыйПериод(ПараметрыОтчета, СтрокаГруппировки);
				
				// СПИСОК СФОРМИРОВАННЫХ ЛИСТОВ:
				ДанныеЛиста = Новый Структура();
				ДанныеЛиста.Вставить("ТабличныйДокумент", ТабДокумент);
				НовыйЭлементСписка = СписокСформированныхЛистов.Добавить(ДанныеЛиста);
				ИндексСоответствующейСтрокиСписка = СписокСформированныхЛистов.Индекс(НовыйЭлементСписка);
				
				// ДЕРЕВО СФОРМИРОВАНЫХ ЛИСТОВ:
				// Строка налогового периода:
				Наименование = ПредставлениеПериода(
					СтрокаГруппировки["ДатаНачалаПериода"],
					СтрокаГруппировки["ДатаОкончанияПериода"],
					"ФП");
				СтрокаНалоговогоПериода = ТаблицаСформированныхЛистов.Добавить();
				СтрокаНалоговогоПериода["Наименование"]						= Наименование;
				СтрокаНалоговогоПериода["Картинка"]							= ИспользуемаяКартинкаВДеревеЛистовПоНалоговымПериодам;
				СтрокаНалоговогоПериода["ДатаНачалаПериода"]				= СтрокаГруппировки["ДатаНачалаПериода"];
				СтрокаНалоговогоПериода["ИндексСоответствующейСтрокиСписка"] = ИндексСоответствующейСтрокиСписка;
				
			ИначеЕсли СтрокаГруппировки["ЭтоГруппировкаОднимСписком"] = Истина Тогда
				// Выводим в табличный документ:
				ТабДокумент = ВывестиЖурналЗаВсеПериодыОднимСписком(ПараметрыОтчета, СтрокаГруппировки);
				
				// СПИСОК СФОРМИРОВАННЫХ ЛИСТОВ:
				ДанныеЛиста = Новый Структура();
				ДанныеЛиста.Вставить("ТабличныйДокумент", ТабДокумент);
				НовыйЭлементСписка = СписокСформированныхЛистов.Добавить(ДанныеЛиста);
				ИндексСоответствующейСтрокиСписка = СписокСформированныхЛистов.Индекс(НовыйЭлементСписка);
				
				// ДЕРЕВО СФОРМИРОВАНЫХ ЛИСТОВ:
				// Строка самого верхнего уровня:
				СтрокаОднимСписком = ТаблицаСформированныхЛистов.Добавить();
				СтрокаОднимСписком["Наименование"]						= НСтр("ru='Журнал учета одним списком'");
				СтрокаОднимСписком["Картинка"]							= ИспользуемаяКартинкаВДеревеЛистовОднимСписком;
				СтрокаОднимСписком["ДатаНачалаПериода"]					= '00010101';
				СтрокаОднимСписком["ИндексСоответствующейСтрокиСписка"]	= ИндексСоответствующейСтрокиСписка;
				СтрокаОднимСписком["ЭтоДанныеОднимСписком"]				= Истина;
				Если СтрокаГруппировки.Строки.Количество() = 0 Тогда
					СтрокаОднимСписком["ЭтоПустойЛист"]					= Истина;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
	Исключение
		СообщитьОбОшибке(ИнформацияОбОшибке());
		
	КонецПопытки;
		
КонецПроцедуры

Процедура ДозаполнитьДеревоСформированныхЛистов(ПараметрыОтчета, СписокСформированныхЛистов, ТаблицаСформированныхЛистов, УникальныйИдентификаторФормы)
	
	Если ТаблицаСформированныхЛистов.Количество() = 0 Тогда
		// Добавляем служебную информационную строку:
		СтрокаВерхнегоУровня = ТаблицаСформированныхЛистов.Добавить();
		СтрокаВерхнегоУровня["Наименование"]	= НСтр("ru='поиск не дал результатов'");
		СтрокаВерхнегоУровня["Картинка"]		= БиблиотекаКартинок.Информация;
		СтрокаВерхнегоУровня["ЭтоПустойЛист"]	= Истина;
		
		ТабДокумент = РегламентированныеРегистры.ПолучитьПредставлениеОтчетаСПустымРезультатом(ПараметрыОтчета);
		ДанныеЛиста = Новый Структура("ТабличныйДокумент", ТабДокумент);
		СтрокаВерхнегоУровня["АдресХранилищаСДаннымиЛиста"] = ПоместитьВоВременноеХранилище(
			ДанныеЛиста,
			УникальныйИдентификаторФормы);
			
	Иначе
		// Упорядочиваем дерево листов по дате:
		ТаблицаСформированныхЛистов.Сортировать("ДатаНачалаПериода");
		
		// Размещаем отдельно данные каждого листа в хранилище:
		Для Каждого СтрокаВерхнегоУровня Из ТаблицаСформированныхЛистов Цикл
			СтрокаВерхнегоУровня["АдресХранилищаСДаннымиЛиста"] = ПоместитьВоВременноеХранилище(
				СписокСформированныхЛистов.Получить(СтрокаВерхнегоУровня["ИндексСоответствующейСтрокиСписка"]).Значение,
				УникальныйИдентификаторФормы);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


Функция ПолучитьНастройкиСКД(ПараметрыОтчета)
	
	Результат = Новый Структура("
		|ИспользуемаяСхемаКомпоновкиДанных,
		|НовыйКомпоновщикНастроек");
	
	// Возвращаемые объекты:
	ИспользуемаяСхемаКомпоновкиДанных	= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НовыйКомпоновщикНастроек			= Новый КомпоновщикНастроекКомпоновкиДанных();
	НовыйКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ИспользуемаяСхемаКомпоновкиДанных));
	НовыйКомпоновщикНастроек.ЗагрузитьНастройки(ИспользуемаяСхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
	
	// Настраиваем схему.
	
	// Значения параметров схемы:
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыйКомпоновщикНастроек, "ДатаНачала",	ПараметрыОтчета["НачалоПериода"]);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыйКомпоновщикНастроек, "ДатаКонца",		ПараметрыОтчета["КонецПериода"]);
	ВыводимыеЧастиЖурнала = Новый СписокЗначений();
	Если ПараметрыОтчета["ВыводитьЧасть1"] Тогда
		ВыводимыеЧастиЖурнала.Добавить(Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры);
	КонецЕсли;
	Если ПараметрыОтчета["ВыводитьЧасть2"] Тогда
		ВыводимыеЧастиЖурнала.Добавить(Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры);
	КонецЕсли;
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(НовыйКомпоновщикНастроек, "ВыводимыеЧастиЖурнала",	ВыводимыеЧастиЖурнала);
	
	// Копируем отбор, установленный в форме отчета:
	СтандартныеОтчетыКлиентСервер.СкопироватьОтбор(
		НовыйКомпоновщикНастроек.Настройки.Отбор,
		ПараметрыОтчета["КомпоновщикНастроек"].Настройки.Отбор);
	
	// Настройки группировок:
	Настройки = НовыйКомпоновщикНастроек.Настройки;
	СтруктураПоНалоговымПериодам			= Настройки.Структура[0];
	СтруктураПоНалоговымПериодамКонтрагент	= Настройки.Структура[1];
	СтруктураОднимСписком					= Настройки.Структура[2];
	СтруктураОднимСпискомКонтрагент			= Настройки.Структура[3];
	Если ПараметрыОтчета["ГруппироватьПоКонтрагентам"] Тогда
		// Используем только группировку по контрагенту:
		СтруктураПоНалоговымПериодам.Использование				= Ложь;
		СтруктураПоНалоговымПериодамКонтрагент.Использование	= Истина;
		СтруктураОднимСписком.Использование						= Ложь;
		СтруктураОднимСпискомКонтрагент.Использование			= Истина;
	Иначе
		// Используем только детальные записи:
		СтруктураПоНалоговымПериодам.Использование				= Истина;
		СтруктураПоНалоговымПериодамКонтрагент.Использование	= Ложь;
		СтруктураОднимСписком.Использование						= Истина;
		СтруктураОднимСпискомКонтрагент.Использование			= Ложь;
	КонецЕсли;
	
	Результат["ИспользуемаяСхемаКомпоновкиДанных"]	= ИспользуемаяСхемаКомпоновкиДанных;
	Результат["НовыйКомпоновщикНастроек"]			= НовыйКомпоновщикНастроек;
	
	Возврат Результат;
	
КонецФункции


Функция ВывестиЖурналЗаНалоговыйПериод(ПараметрыОтчета, ГруппировкаНалоговыйПериод)
	
	// Возвращаемое значение:
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ЖурналУчетаСчетовФактур";
	ТабДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ЖурналУчетаПолученныхВыставленныхСчетовФактур1137");
	
	//---
	// Заголовок
	//---
	ПараметрыОбласти = Новый Структура();
	ПараметрыОбласти.Вставить("Организация",			ПараметрыОтчета["Организация"]);
	ПараметрыОбласти.Вставить("ДатаНачалаПериода",		ГруппировкаНалоговыйПериод["ДатаНачалаПериода"]);
	ПараметрыОбласти.Вставить("ДатаОкончанияПериода",	ГруппировкаНалоговыйПериод["ДатаОкончанияПериода"]);
	ПараметрыОбласти.Вставить("ВыводитьОтбор",			ПараметрыОтчета["ВыводитьОтбор"]);
	ПараметрыОбласти.Вставить("Отбор",					Строка(ПараметрыОтчета["КомпоновщикНастроек"].Настройки.Отбор));
	ПараметрыОбласти.Вставить("ВыводитьЧасть1",			ПараметрыОтчета["ВыводитьЧасть1"]);
	ПараметрыОбласти.Вставить("ВыводитьЧасть2",			ПараметрыОтчета["ВыводитьЧасть2"]);
	ВывестиЗаголовок(ТабДокумент, ПараметрыОбласти, Макет);	
	
	//---
	// Таблицы частей 1 и 2
	//---
	ВывестиЧастиЖурнала(ТабДокумент, Макет, ГруппировкаНалоговыйПериод, ПараметрыОтчета);
	
	//---
	// Подвал
	//---
	ПараметрыОбласти = Новый Структура();
	ПараметрыОбласти.Вставить("Организация",	ПараметрыОтчета["Организация"]);
	ПараметрыОбласти.Вставить("Дата",			ГруппировкаНалоговыйПериод["ДатаОкончанияПериода"]);
	ВывестиПодвал(ТабДокумент, ПараметрыОбласти, Макет);
	
	// Колонтитулы:
	СтандартныеОтчеты.УстановитьКолонтитулыПоУмолчанию(ТабДокумент,
		ПараметрыОтчета["Колонтитулы_НаименованиеОтчета"],
		ПараметрыОтчета["Колонтитулы_ТекущийПользователь"],
		ПараметрыОтчета["Организация"]);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВывестиЖурналЗаВсеПериодыОднимСписком(ПараметрыОтчета, ГруппировкаОднимСписком)
	
	// Возвращаемое значение:
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ЖурналУчетаСчетовФактур";
	ТабДокумент.АвтоМасштаб = Истина;
	
	// Используемый макет:
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ЖурналУчетаПолученныхВыставленныхСчетовФактур1137");
	
	//---
	// Заголовок
	//---
	ПараметрыОбласти = Новый Структура();
	ПараметрыОбласти.Вставить("Организация",			ПараметрыОтчета["Организация"]);
	ПараметрыОбласти.Вставить("ДатаНачалаПериода",		ПараметрыОтчета["НачалоПериода"]);
	ПараметрыОбласти.Вставить("ДатаОкончанияПериода",	ПараметрыОтчета["КонецПериода"]);
	ПараметрыОбласти.Вставить("ВыводитьОтбор",			ПараметрыОтчета["ВыводитьОтбор"]);
	ПараметрыОбласти.Вставить("Отбор",					Строка(ПараметрыОтчета["КомпоновщикНастроек"].Настройки.Отбор));
	ПараметрыОбласти.Вставить("ВыводитьЧасть1",			ПараметрыОтчета["ВыводитьЧасть1"]);
	ПараметрыОбласти.Вставить("ВыводитьЧасть2",			ПараметрыОтчета["ВыводитьЧасть2"]);
	ВывестиЗаголовок(ТабДокумент, ПараметрыОбласти, Макет);	
	
	//---
	// Таблицы частей 1 и 2
	//---
	ВывестиЧастиЖурнала(ТабДокумент, Макет, ГруппировкаОднимСписком, ПараметрыОтчета);
	
	//---
	// Подвал
	//---
	ПараметрыОбласти = Новый Структура();
	ПараметрыОбласти.Вставить("Организация",	ПараметрыОтчета["Организация"]);
	ПараметрыОбласти.Вставить("Дата",			ПараметрыОтчета["КонецПериода"]);
	ВывестиПодвал(ТабДокумент, ПараметрыОбласти, Макет);
	
	// Колонтитулы:
	СтандартныеОтчеты.УстановитьКолонтитулыПоУмолчанию(ТабДокумент,
		ПараметрыОтчета["Колонтитулы_НаименованиеОтчета"],
		ПараметрыОтчета["Колонтитулы_ТекущийПользователь"],
		ПараметрыОтчета["Организация"]);
	
	Возврат ТабДокумент;
	
КонецФункции


Процедура ВывестиЗаголовок(ЗаполняемыйТабличныйДокумент, ПараметрыОбласти, ИспользуемыйМакет)
	
	// Используемый макет:
	ОбластьЗаголовок	= ИспользуемыйМакет.ПолучитьОбласть("Заголовок");
	ОбластьОтбор		= ИспользуемыйМакет.ПолучитьОбласть("Отбор");
	
	// Подготовка:
	СвойстваОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыОбласти["Организация"],
		"Наименование,НаименованиеПолное,НаименованиеСокращенное,ИНН,КПП");
	Наименование1 = СвойстваОрганизации["НаименованиеПолное"];
	Наименование2 = СвойстваОрганизации["НаименованиеСокращенное"];
	Наименование3 = СвойстваОрганизации["Наименование"];
	Если ЗначениеЗаполнено(Наименование1) Тогда
		ОрганизацияПредставление = Наименование1;
	ИначеЕсли ЗначениеЗаполнено(Наименование2) Тогда
		ОрганизацияПредставление = Наименование2;
	Иначе
		ОрганизацияПредставление = Наименование3;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОбласти["ДатаНачалаПериода"])
		ИЛИ ЗначениеЗаполнено(ПараметрыОбласти["ДатаОкончанияПериода"]) Тогда
		ПериодПредставление = ПредставлениеПериода(ПараметрыОбласти["ДатаНачалаПериода"], ПараметрыОбласти["ДатаОкончанияПериода"], "ФП");
	Иначе
		ПериодПредставление = "... - ...";
	КонецЕсли;
	
	// Заполняем параметры области:
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("ОрганизацияПредставление",	ОрганизацияПредставление);
	ЗначенияПараметров.Вставить("ИНН",						СвойстваОрганизации["ИНН"]);
	ЗначенияПараметров.Вставить("КПП",						СвойстваОрганизации["КПП"]);
	ЗначенияПараметров.Вставить("ПериодПредставление",		ПериодПредставление);
	ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
	// Выводим область:
	ЗаполняемыйТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// Отбор:
	Если ПараметрыОбласти["ВыводитьОтбор"] Тогда
		ОтборВТаблице = ПараметрыОбласти["Отбор"];
		ОтборЧастиЖурнала = "";
		Если НЕ ПараметрыОбласти["ВыводитьЧасть1"] Тогда
			ОтборЧастиЖурнала = ОтборЧастиЖурнала
				+ ?(ПустаяСтрока(ОтборЧастиЖурнала), "", " И ")
				+ НСтр("ru='Не выводить часть 1 журнала'");
		КонецЕсли;
		Если НЕ ПараметрыОбласти["ВыводитьЧасть2"] Тогда
			ОтборЧастиЖурнала = ОтборЧастиЖурнала
				+ ?(ПустаяСтрока(ОтборЧастиЖурнала), "", " И ")
				+ НСтр("ru='Не выводить часть 2 журнала'");
		КонецЕсли;
		
		Отбор = ОтборЧастиЖурнала
			+ ?(ПустаяСтрока(ОтборЧастиЖурнала) ИЛИ ПустаяСтрока(ОтборВТаблице), "", " И ")
			+ ОтборВТаблице;
		
		Если ПустаяСтрока(Отбор) Тогда
			Отбор = НСтр("ru='(отбор не установлен)'");
		КонецЕсли;
		
		ЗначенияПараметров = Новый Структура();
		ЗначенияПараметров.Вставить("Отбор", Отбор);
		ОбластьОтбор.Параметры.Заполнить(ЗначенияПараметров);
		ЗаполняемыйТабличныйДокумент.Вывести(ОбластьОтбор);
	КонецЕсли;
	
КонецПроцедуры


Процедура ВывестиЧастиЖурнала(ЗаполняемыйТабличныйДокумент, ИспользуемыйМакет, СтрокаВерхнейГруппировки, ПараметрыОтчета)
	
	// Определяем заполненность частей журнала:
	СтатусыЧастейЖурнала = ПолучитьТаблицуСтатусовЧастейЖурнала();
	ИндексВВерхнейГруппировке = 0;
	Для Каждого СтрокаГруппировкаЧастьЖурнала Из СтрокаВерхнейГруппировки.Строки Цикл
		СтрокаСтатуса = СтатусыЧастейЖурнала.Найти(СтрокаГруппировкаЧастьЖурнала["ЧастьЖурнала"], "ЧастьЖурнала");
		Если НЕ СтрокаСтатуса = Неопределено Тогда
			СтрокаСтатуса["ИндексВВерхнейГруппировке"] = ИндексВВерхнейГруппировке;
		КонецЕсли;
		ИндексВВерхнейГруппировке = ИндексВВерхнейГруппировке + 1;
	КонецЦикла;
	
	// Выводим части журнала (таблицу, если есть данные)
	// или только шапки таблиц (если данных в этих частях журнала нет):
	Для Каждого СтрокаСтатуса Из СтатусыЧастейЖурнала Цикл
		ИндексВВерхнейГруппировке = СтрокаСтатуса["ИндексВВерхнейГруппировке"];
		Если ИндексВВерхнейГруппировке >= 0 Тогда
			СтрокаГруппировкаЧастьЖурнала = СтрокаВерхнейГруппировки.Строки[ИндексВВерхнейГруппировке];
		Иначе
			СтрокаГруппировкаЧастьЖурнала = Неопределено;
		КонецЕсли;
		
		ПараметрыВыводаТаблицы = Новый Структура();
		ПараметрыВыводаТаблицы.Вставить("НПП",							1);
		ПараметрыВыводаТаблицы.Вставить("НомерЧастиЖурнала",			СтрокаСтатуса["НомерЧастиЖурнала"]);
		ПараметрыВыводаТаблицы.Вставить("ЗаполняемыйТабличныйДокумент",	ЗаполняемыйТабличныйДокумент);
		ПараметрыВыводаТаблицы.Вставить("ИспользуемыйМакет",			ИспользуемыйМакет);
		ПараметрыВыводаТаблицы.Вставить("СтрокаГруппировки",			СтрокаГруппировкаЧастьЖурнала);
		ПараметрыВыводаТаблицы.Вставить("ВыводитьИтоги",				ПараметрыОтчета["ВыводитьИтоги"]);
		ПараметрыВыводаТаблицы.Вставить("ГруппироватьПоКонтрагентам",	ПараметрыОтчета["ГруппироватьПоКонтрагентам"]);
		ПараметрыВыводаТаблицы.Вставить("НумероватьВнутриКонтрагента",	ПараметрыОтчета["НумероватьВнутриКонтрагента"]);

		//ВывестиЧастьЖурнала(СтрокаСтатуса["НомерЧастиЖурнала"], ЗаполняемыйТабличныйДокумент, ИспользуемыйМакет, СтрокаГруппировкаЧастьЖурнала, ВыводитьИтоги);
		ВывестиЧастьЖурнала(ПараметрыВыводаТаблицы);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиЧастьЖурнала(ПараметрыВыводаТаблицы)
	
	НомерЧастиЖурнала				= ПараметрыВыводаТаблицы["НомерЧастиЖурнала"];
	СтрокаГруппировкаЧастьЖурнала	= ПараметрыВыводаТаблицы["СтрокаГруппировки"];
	ВыводитьИтоги					= ПараметрыВыводаТаблицы["ВыводитьИтоги"];
	ЗаполняемыйТабличныйДокумент	= ПараметрыВыводаТаблицы["ЗаполняемыйТабличныйДокумент"];
	ИспользуемыйМакет				= ПараметрыВыводаТаблицы["ИспользуемыйМакет"];
	
	//---
	// Шапка таблицы
	//---
	Если НомерЧастиЖурнала = 1 Тогда
		ОбластьШапка = ИспользуемыйМакет.ПолучитьОбласть("Шапка1");
	Иначе
		ОбластьШапка = ИспользуемыйМакет.ПолучитьОбласть("Шапка2");
	КонецЕсли;
	ЗаполняемыйТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Если часть журнала пустая, то выводим только шапку таблицы, и больше ничего:
	Если СтрокаГруппировкаЧастьЖурнала = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//---
	// Строки таблицы
	//---
	ВывестиСтрокиЧастиЖурнала(ПараметрыВыводаТаблицы);
	//ВывестиСтрокиЧастиЖурнала(НомерЧастиЖурнала, ЗаполняемыйТабличныйДокумент, ИспользуемыйМакет, СтрокаГруппировкаЧастьЖурнала, ВыводитьИтоги);
	
	//---
	// Итоги
	//---
	Если ВыводитьИтоги Тогда
		Если СтрокаГруппировкаЧастьЖурнала["ВалютыРазличные"] Тогда
			ОбластьИтого = ИспользуемыйМакет.ПолучитьОбласть("ИтогоВалютыРазличные");
		Иначе
			ОбластьИтого = ИспользуемыйМакет.ПолучитьОбласть("Итого");
			ОбластьИтого.Параметры.Заполнить(СтрокаГруппировкаЧастьЖурнала);
		КонецЕсли;
		ЗаполняемыйТабличныйДокумент.Вывести(ОбластьИтого);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиГруппировкуКонтрагент(ПараметрыВыводаТаблицы)
	
	ВыводитьПолныеНаименования = Истина;
	
	СтрокаГруппировкаКонтрагент		= ПараметрыВыводаТаблицы["СтрокаГруппировки"];
	ЗаполняемыйТабличныйДокумент	= ПараметрыВыводаТаблицы["ЗаполняемыйТабличныйДокумент"];
	ИспользуемыйМакет				= ПараметрыВыводаТаблицы["ИспользуемыйМакет"];
	ВыводитьИтоги					= ПараметрыВыводаТаблицы["ВыводитьИтоги"];
	
	//---
	// Итого по контрагенту
	//---
	Если СтрокаГруппировкаКонтрагент["ВалютыРазличные"] Тогда
		ОбластьКонтрагент = ИспользуемыйМакет.ПолучитьОбласть("КонтрагентВалютыРазличные");
	Иначе
		ОбластьКонтрагент = ИспользуемыйМакет.ПолучитьОбласть("Контрагент");
	КонецЕсли;
	ОбластьКонтрагент.Параметры.Заполнить(СтрокаГруппировкаКонтрагент);
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("КонтрагентПредставление", ?(ВыводитьПолныеНаименования,
		СтрокаГруппировкаКонтрагент["КонтрагентПредставлениеПолное"],
		СтрокаГруппировкаКонтрагент["КонтрагентПредставлениеСокращенное"]));
	ОбластьКонтрагент.Параметры.Заполнить(ЗначенияПараметров);
	ЗаполняемыйТабличныйДокумент.Вывести(ОбластьКонтрагент);
	
	//---
	// Детальные строки
	//---
	ВывестиСтрокиЧастиЖурнала(ПараметрыВыводаТаблицы); //НомерЧастиЖурнала, ЗаполняемыйТабличныйДокумент, ИспользуемыйМакет, СтрокаГруппировкаКонтрагент, ВыводитьИтоги, НППСтроки);
	
КонецПроцедуры

Процедура ВывестиСтрокиЧастиЖурнала(ПараметрыВыводаТаблицы)
	
	СтрокаГруппировки				= ПараметрыВыводаТаблицы["СтрокаГруппировки"];
	
	СимволПрочерка = "---";
	ВыводитьПолныеНаименования = Истина;
	
	Для Каждого СтрокаДерева Из СтрокаГруппировки.Строки Цикл
		Если СтрокаДерева["ЭтоГруппировкаКонтрагент"] Тогда
			
			ПараметрыВыводаТаблицы["СтрокаГруппировки"] = СтрокаДерева;
			ВывестиГруппировкуКонтрагент(ПараметрыВыводаТаблицы); //НомерЧастиЖурнала, ЗаполняемыйТабличныйДокумент, ИспользуемыйМакет, СтрокаДерева, ВыводитьИтоги, НППСтроки);
			
		Иначе
			НПП								= ПараметрыВыводаТаблицы["НПП"];
			НомерЧастиЖурнала				= ПараметрыВыводаТаблицы["НомерЧастиЖурнала"];
			ВыводитьИтоги					= ПараметрыВыводаТаблицы["ВыводитьИтоги"];
			ЗаполняемыйТабличныйДокумент	= ПараметрыВыводаТаблицы["ЗаполняемыйТабличныйДокумент"];
			ИспользуемыйМакет				= ПараметрыВыводаТаблицы["ИспользуемыйМакет"];
			ГруппироватьПоКонтрагентам		= ПараметрыВыводаТаблицы["ГруппироватьПоКонтрагентам"];
			НумероватьВнутриКонтрагента		= ПараметрыВыводаТаблицы["НумероватьВнутриКонтрагента"];
			
			//---
			// Строка таблицы
			//---
			ОбластьСтрока = ИспользуемыйМакет.ПолучитьОбласть("Строка");
			
			// Подготовка:
			ЭтоНалоговыйАгентП2 = (СтрокаДерева["ПричинаНалогообложения"] = Перечисления.ПричиныНалогообложенияНДС.ПокупкаУНерезидентаНалоговыйАгент);
			СтороныОперации = УчетНДС.ОпределитьПродавцаПокупателяИНомерДокумента(СтрокаДерева);
			Параметр_НомерСчетаФактуры	= СтороныОперации["НомерДокумента"];
			// Сторона операции:
			ИмяРеквизита = СтороныОперации[?(НомерЧастиЖурнала = 1, "Покупатель", "Продавец")];
			Если ИмяРеквизита = "Организация" Тогда
				Параметр_ПокупательПродавецПредставление	= ?(ВыводитьПолныеНаименования,
					СтрокаДерева["ОрганизацияПредставлениеПолное"],
					СтрокаДерева["ОрганизацияПредставлениеСокращенное"]);
				Параметр_ПокупательПродавецИНН				= СтрокаДерева["ОрганизацияИНН"];
				Параметр_ПокупательПродавецКПП				= СтрокаДерева["ОрганизацияКПП"];
				Параметр_ПокупательПродавецСсылка			= СтрокаДерева["Организация"];
			ИначеЕсли ИмяРеквизита = "ГоловнаяОрганизация" Тогда
				Параметр_ПокупательПродавецПредставление	= ?(ВыводитьПолныеНаименования,
					СтрокаДерева["ГоловнаяОрганизацияПредставлениеПолное"],
					СтрокаДерева["ГоловнаяОрганизацияПредставлениеСокращенное"]);
				Параметр_ПокупательПродавецИНН				= СтрокаДерева["ГоловнаяОрганизацияИНН"];
				Параметр_ПокупательПродавецКПП				= СтрокаДерева["ГоловнаяОрганизацияКПП"];
				Параметр_ПокупательПродавецСсылка			= СтрокаДерева["ГоловнаяОрганизация"];
			Иначе
				// Здесь ИмяРеквизита = "Контрагент"
				Параметр_ПокупательПродавецПредставление	= ?(ВыводитьПолныеНаименования,
					СтрокаДерева["КонтрагентПредставлениеПолное"],
					СтрокаДерева["КонтрагентПредставлениеСокращенное"]);
				Параметр_ПокупательПродавецИНН				= СтрокаДерева["КонтрагентИНН"];
				Параметр_ПокупательПродавецКПП				= СтрокаДерева["КонтрагентКПП"];
				Параметр_ПокупательПродавецСсылка			= СтрокаДерева["Контрагент"];
				Если ЭтоНалоговыйАгентП2 Тогда
					Параметр_ПокупательПродавецИНН			= СимволПрочерка;
					Параметр_ПокупательПродавецКПП			= СимволПрочерка;
				КонецЕсли;
			КонецЕсли;
			
			// Графы с уже готовыми данными:
			ОбластьСтрока.Параметры.Заполнить(СтрокаДерева);
			
			// Графы с особенным выводом:
			ЗначенияПараметров = Новый Структура();
			
			// 1
			Если ГруппироватьПоКонтрагентам И НумероватьВнутриКонтрагента Тогда
				Параметр_НПП = Строка(СтрокаДерева["СистемныеПоляНомерПоПорядкуВГруппировке"])
					+ " (" + Строка(НПП) + ")";
			Иначе
				Параметр_НПП = Строка(НПП);
			КонецЕсли;
			ЗначенияПараметров.Вставить("НПП",					Параметр_НПП);
			НПП = НПП + 1;
			ПараметрыВыводаТаблицы["НПП"] = НПП;
			
			// 5
			ЗначенияПараметров.Вставить("НомерСчетаФактуры",	Параметр_НомерСчетаФактуры);
			
			// 11
			ЗначенияПараметров.Вставить("ПокупательПродавецПредставление",	Параметр_ПокупательПродавецПредставление);
			ЗначенияПараметров.Вставить("ПокупательПродавецСсылка",			Параметр_ПокупательПродавецСсылка);
			
			// 12
			ЗначенияПараметров.Вставить("ИНН",					Параметр_ПокупательПродавецИНН);
			ЗначенияПараметров.Вставить("КПП",					Параметр_ПокупательПродавецКПП);
			
			// Выводим область:
			ОбластьСтрока.Параметры.Заполнить(ЗначенияПараметров);
			ЗаполняемыйТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиПодвал(ЗаполняемыйТабличныйДокумент, ПараметрыОбласти, ИспользуемыйМакет)
	
	ОбластьПодвал = ИспользуемыйМакет.ПолучитьОбласть("Подвал");
	
	ЗначенияПараметров = Новый Структура();
	Если ЗначениеЗаполнено(ПараметрыОбласти["Организация"]) Тогда
		ОтветственныеЛица = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
			ПараметрыОбласти["Организация"],
			ПараметрыОбласти["Дата"]);
		
		ЗначенияПараметров.Вставить("РуководительФИО", Справочники.Сотрудники.ФамилияИО(
			ОтветственныеЛица["ОтветственноеЛицоСсылка"],, ПараметрыОбласти["Дата"]));
    КонецЕсли;
	// Выводим область:
	ОбластьПодвал.Параметры.Заполнить(ЗначенияПараметров);
	ЗаполняемыйТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры	

Функция ПолучитьТаблицуСтатусовЧастейЖурнала()
	
	СтатусЧастейЖурнала = Новый ТаблицаЗначений();
	СтатусЧастейЖурнала.Колонки.Добавить("НомерЧастиЖурнала",			Новый ОписаниеТипов("Число"));
	СтатусЧастейЖурнала.Колонки.Добавить("ЧастьЖурнала",				Новый ОписаниеТипов("ПеречислениеСсылка.ЧастиЖурналаУчетаСчетовФактур"));
	СтатусЧастейЖурнала.Колонки.Добавить("ИндексВВерхнейГруппировке",	Новый ОписаниеТипов("Число"));
	НоваяСтрока = СтатусЧастейЖурнала.Добавить();
	НоваяСтрока["НомерЧастиЖурнала"]			= 1;
	НоваяСтрока["ЧастьЖурнала"]					= Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры;
	НоваяСтрока["ИндексВВерхнейГруппировке"]	= -1;
	НоваяСтрока = СтатусЧастейЖурнала.Добавить();
	НоваяСтрока["НомерЧастиЖурнала"]			= 2;
	НоваяСтрока["ЧастьЖурнала"]					= Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры;
	НоваяСтрока["ИндексВВерхнейГруппировке"]	= -1;
	
	Возврат СтатусЧастейЖурнала;
	
КонецФункции

Процедура СообщитьОбОшибке(ИнформацияОбОшибке)
	
	Пока НЕ ИнформацияОбОшибке.Причина = Неопределено Цикл
		ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
	КонецЦикла;
	ТекстСообщения = НСтр("ru='Отчет не сформирован!'") + Символы.ПС + ИнформацияОбОшибке.Описание;
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецЕсли