#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗагрузитьПереданныеЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ЗапрещеноРедактированиеОперации Тогда
		Закрыть();
	КонецЕсли;
	
	Если Не ПроверитьЗаполнениеТаблицы() Тогда
		Возврат;
	КонецЕсли;
	
	ВозвращаемоеЗначение = НовыеПараметрыВыбора();
	Модифицированность = Ложь;
	Закрыть(ВозвращаемоеЗначение);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьЗаполнениеТаблицы()
	Отказ = Ложь;
	ШаблонТекстаОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение", "%1", "%2", НСтр("ru = 'Параметры выбора'"));
	ИндексСтроки = 0;
	Для Каждого Строка Из ПараметрыВыбораРеквизита Цикл
		ИндексСтроки = ИндексСтроки + 1;
		Если Не ЗначениеЗаполнено(Строка.ИмяПараметра) Тогда
			ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, НСтр("ru = 'Имя'"), ИндексСтроки);
			ИмяПоля = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПараметрыВыбораРеквизита", ИндексСтроки, "Имя");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, , ИмяПоля, , Отказ);
		КонецЕсли;
	КонецЦикла;
	Возврат Не Отказ;
КонецФункции

&НаСервере
Процедура ЗагрузитьПереданныеЗначения()
	
	Если Лев(Параметры.ВыбранныеПараметрыВыбора, 4) = "{""#""" Тогда
		Попытка
			НачальныеЗначения = ЗначениеИзСтрокиВнутр(Параметры.ВыбранныеПараметрыВыбора);
		Исключение
			НачальныеЗначения = Новый Массив;
		КонецПопытки;
	Иначе
		НачальныеЗначения = Новый Массив;
	КонецЕсли;
	
	Для Каждого Значение Из НачальныеЗначения Цикл
		НоваяСтрока = ПараметрыВыбораРеквизита.Добавить();
		НоваяСтрока.ИмяПараметра = Значение.Имя;
		НоваяСтрока.ЗначениеПараметра = Значение.Значение;
	КонецЦикла;
	ЗапрещеноРедактированиеОперации = Параметры.ЗапрещеноРедактированиеОперации;
КонецПроцедуры

&НаСервере
Функция НовыеПараметрыВыбора()
	Результат = Новый Массив;
	Для Каждого Строка Из ПараметрыВыбораРеквизита Цикл
		Результат.Добавить(Новый Структура("Имя, Значение", Строка.ИмяПараметра, Строка.ЗначениеПараметра));
	КонецЦикла;
	
	ПредставлениеРезультата = БухгалтерскиеОперацииКлиентСервер.ПредставлениеПараметровВыбора(Результат);
	Рез = Новый СписокЗначений;
	Если Результат.Количество() = 0 Тогда
		Рез.Добавить("", ПредставлениеРезультата);
	Иначе
		Рез.Добавить(ЗначениеВСтрокуВнутр(Результат), ПредставлениеРезультата);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

#КонецОбласти
