
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФормуСервер();
	
	ПроверитьЗаполненностьСводногоКонтрагента(Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФормуКлиент_ВидОтбораСтрокДокументаОснования();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СохранитьНастройкиВХранилище();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверяемыеРеквизиты.Очистить();
	
	ПроверяемыеРеквизиты.Добавить("Счет30304");
	
	Если ВидимостьВыданный Тогда
		ПроверяемыеРеквизиты.Добавить("КПС30304");
		ПроверяемыеРеквизиты.Добавить("ТиповаяОперацияСФ");
		
		Если ЕстьКФО1 Тогда
			ПроверяемыеРеквизиты.Добавить("КПС40120");
		КонецЕсли;
	КонецЕсли;
	
	Если ВидимостьПолученный Тогда
		ПроверяемыеРеквизиты.Добавить("КПС30304Полученный");
		ПроверяемыеРеквизиты.Добавить("ТиповаяОперацияСФПолученный");
	КонецЕсли;
	
	Если НЕ ПроверитьОбязательныеРеквизитыОперации() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(Неопределено, Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура МодифицироватьСуществующиеСФПриИзменении(Элемент)
	
	ОбновитьСписокИНастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиНДСПриИзменении(Элемент)
	
	НастроитьАктуальностьСписка(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если Поле.Имя = "СписокСчетФактура" Тогда
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.СчетФактура) Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ПоказатьЗначение(Неопределено, ТекущаяСтрока.СчетФактура);			
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьСчетаФактуры(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() Тогда
		
		СформироватьСчетаФактурыСервер();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	
	ОбновитьСписокИНастроитьФорму();
	
	НастроитьАктуальностьСписка(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАкт(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		
		МассивСсылок = Новый Массив;
		
		Для каждого Идентификатор Из Элементы.Список.ВыделенныеСтроки Цикл
			
			Строка = Список.НайтиПоИдентификатору(Идентификатор);
			Если Строка <> Неопределено И ЗначениеЗаполнено(Строка.СчетФактура) Тогда
				МассивСсылок.Добавить(Строка.СчетФактура);
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если МассивСсылок.Количество() > 0 Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ."+ИмяДок, "АктОбОказанииУслуг", МассивСсылок, Неопределено, Новый Структура("ДокументОснование",Параметры.Документ));
		Иначе
			ПоказатьПредупреждение(, НСтр("ru='Печать не выполнена, так как во всех выделенных строках отсутствует счет-фактура'"), 20);
		КонецЕсли; 
			
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетФактура(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 0 Тогда
		
		МассивСсылок = Новый Массив;
		
		Для каждого Идентификатор Из Элементы.Список.ВыделенныеСтроки Цикл
			
			Строка = Список.НайтиПоИдентификатору(Идентификатор);
			Если Строка <> Неопределено И ЗначениеЗаполнено(Строка.СчетФактура) Тогда
				МассивСсылок.Добавить(Строка.СчетФактура);
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если МассивСсылок.Количество() > 0 Тогда
			УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.СчетФактураВыданный", "СчетФактураАвто", МассивСсылок, Неопределено, Неопределено);
		Иначе
			ПоказатьПредупреждение(, НСтр("ru='Печать не выполнена, так как во всех выделенных строках отсутствует счет-фактура'"), 20);
		КонецЕсли; 
			
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	УстановитьЗначениеВсехОтметок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсеОтметки(Команда)
	
	УстановитьЗначениеВсехОтметок(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокСервер()
	
	Если ИмяДок = "НачислениеЗаУслугиОбразования"
		ИЛИ ИмяДок = "НачислениеСтудентамЗаПрочиеУслуги" Тогда 
		Список.Загрузить(РаботаСоСтудентами.ПолучитьТаблицуСчетовФактурПоНачислениюСКомментариями(Параметры.Документ));
		
		ЕстьКФО1 = ЕстьКФО1ВТабличнойЧасти();
		
	ИначеЕсли ИмяДок = "НачислениеРодительскойПлаты" Тогда 
	    Список.Загрузить(РаботаСоСтудентами.ПолучитьТаблицуСчетовФактурПоНачислениюРодительскойПлатыСКомментариями(Параметры.Документ));
		
		ЕстьКФО1 = ЕстьКФО1ВТиповойОперации();
		
	ИначеЕсли ИмяДок = "НачислениеДоходов" Тогда
		Список.Загрузить(РаботаСоСтудентами.ПолучитьТаблицуСчетовФактурПоНачислениюДоходовСКомментариями(Параметры.Документ));
		
		ЕстьКФО1 = ЕстьКФО1ВТиповойОперации();
		
	ИначеЕсли ИмяДок = "СписаниеДоходовБудущихПериодов" Тогда
		Список.Загрузить(Документы.СписаниеДоходовБудущихПериодов.ПолучитьТаблицуУправлениеСчетамиФактурамиИПечать(Параметры.Документ, МодифицироватьСуществующиеСФ));
		
		ЕстьКФО1 = ЕстьКФО1ВТабличнойЧасти();
		
	ИначеЕсли ИмяДок = "НачислениеАмортизацииПравПользованияОС" Тогда
		Список.Загрузить(Документы.НачислениеАмортизацииПравПользованияОС.ПолучитьТаблицуУправлениеСчетамиФактурамиИПечать(Параметры.Документ, МодифицироватьСуществующиеСФ, ПолучитьНастройкиОтбораСтрокДокументаОснования()));
		
		ЕстьКФО1 = Ложь; // Налоговый агент по КФО 2.
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьКФО1ВТабличнойЧасти()
	
	Если ИмяДок = "СписаниеДоходовБудущихПериодов" Тогда
		ИмяТабличнойЧасти = "ДоходыБудущихПериодов";
	Иначе
		ИмяТабличнойЧасти = "Начисления";
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументСсылка", Параметры.Документ);
	Запрос.УстановитьПараметр("КФО1", Перечисления.КВД.Бюджет);
	
	ТекстЗапроса = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Ссылка
		|ИЗ
		|	&ДокументТабличнаяЧастьПоТипу
		|ГДЕ
		|	Ссылка = &ДокументСсылка
		|	И КФО = &КФО1";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументТабличнаяЧастьПоТипу", СтрШаблон("Документ.%1.%2", ИмяДок, ИмяТабличнойЧасти));
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервере
Функция ЕстьКФО1ВТиповойОперации()
	
	ДопРеквизитыОснования = БухгалтерскиеОперацииСервер.ЗаполнитьДополнительныеРеквизиты(Параметры.Документ, ТиповаяОперацияДокументОснование);
	
	Если ДопРеквизитыОснования.Свойство("КФО") Тогда
		Возврат ДопРеквизитыОснования.КФО = Перечисления.КВД.Бюджет;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписокИНастроитьФорму()
	
	ОбновитьСписокСервер();
	
	НастроитьФормуПослеЗаполненияСписка();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьСчетаФактурыСервер()
	
	Если НЕ ПроверитьОбязательныеРеквизитыОперации() Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяДок = "НачислениеЗаУслугиОбразования"
		ИЛИ ИмяДок = "НачислениеСтудентамЗаПрочиеУслуги" Тогда
		РаботаСоСтудентами.СформироватьСчетаФактурыНачисления(Параметры.Документ, ЭтотОбъект);
		
	ИначеЕсли ИмяДок = "НачислениеРодительскойПлаты" Тогда
		РаботаСоСтудентами.СформироватьСчетаФактурыНачисленияРодительскойПлаты(Параметры.Документ, ЭтотОбъект);
		
	ИначеЕсли ИмяДок = "НачислениеДоходов" Тогда
		РаботаСоСтудентами.СформироватьСчетаФактурыНачисленияДоходов(Параметры.Документ, ЭтотОбъект);
		
	ИначеЕсли ИмяДок = "СписаниеДоходовБудущихПериодов" Тогда
		Документы.СписаниеДоходовБудущихПериодов.СформироватьСчетаФактурыНачисления(Параметры.Документ, ЭтотОбъект);
		
	ИначеЕсли ИмяДок = "НачислениеАмортизацииПравПользованияОС" Тогда
		Документы.НачислениеАмортизацииПравПользованияОС.СформироватьСчетаФактуры(Параметры.Документ, ЭтотОбъект);
		
	КонецЕсли;
	
	ОбновитьСписокСервер();
	
	НастроитьФормуПослеЗаполненияСписка();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьОбязательныеРеквизитыОперации()
	
	Перем ТекстОшибки;
	
	ДопРеквизитыОснования = БухгалтерскиеОперацииСервер.ЗаполнитьДополнительныеРеквизиты(Параметры.Документ, ТиповаяОперацияДокументОснование);
	ШаблонНеЗаполненРеквизит = НСтр("ru = 'Реквизит бухгалтерской операции документа начисления ""%1"" не заполнен!'");
	ШаблонНетРеквизита = НСтр("ru = 'В бухгалтерской операции документа начисления не найден реквизит ""%1""'");
	Отказ = Ложь;
	
	Если Справочники.ТиповыеОперации.ТиповаяОперацияНаПоддержке(ТиповаяОперацияСФ) Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РеквизитыТиповыхОпераций.ИмяДляФормулы
		               |ИЗ
		               |	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		               |ГДЕ
		               |	РеквизитыТиповыхОпераций.Владелец = &ОперацияСФ
		               |	И НЕ РеквизитыТиповыхОпераций.ЭтоГруппа
		               |	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
		               |	И ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.Обязательный, ЛОЖЬ)";
	Иначе
					   
		ТекстЗапроса = "ВЫБРАТЬ
		               |	РеквизитыТиповыхОпераций.ИмяДляФормулы
		               |ИЗ
		               |	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
		               |		ПО РеквизитыТиповыхОпераций.Ссылка = ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации
		               |ГДЕ
		               |	РеквизитыТиповыхОпераций.Владелец = &ОперацияСФ
		               |	И НЕ РеквизитыТиповыхОпераций.ЭтоГруппа
		               |	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
		               |	И ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.Обязательный, ЛОЖЬ)";
	КонецЕсли;					   
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ОперацияСФ", ТиповаяОперацияСФ);
	
	ВыборкаОбязательныхРеквизитов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОбязательныхРеквизитов.Следующий() Цикл
		
		ЗначениеДопРеквизита = Неопределено;
		Если ДопРеквизитыОснования.Свойство(ВыборкаОбязательныхРеквизитов.ИмяДляФормулы, ЗначениеДопРеквизита) Тогда
			
			Если НЕ ЗначениеЗаполнено(ЗначениеДопРеквизита) Тогда
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНеЗаполненРеквизит, ВыборкаОбязательныхРеквизитов.ИмяДляФормулы);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
				
			КонецЕсли; 
			
		Иначе
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНетРеквизита, ВыборкаОбязательныхРеквизитов.ИмяДляФормулы);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат НЕ Отказ;
	
КонецФункции


&НаСервере
Процедура ИнициализироватьФормуСервер()
	
	ЗагрузитьНастройкиИзХранилища();
	
	НастроитьДоступностьОтбораСтрокДокументаОснования();
	
	УстановитьЗаголовокОтбораСтрокДокументаОснования(ЭтаФорма);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Организация, ИФО, КФО, Дата");
	
	МодифицироватьСуществующиеСФ = Истина;
	
	Если ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.НачислениеЗаУслугиОбразования") Тогда 
		ИмяДок = "НачислениеЗаУслугиОбразования";
		
	ИначеЕсли ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.НачислениеРодительскойПлаты") Тогда 
		ИмяДок = "НачислениеРодительскойПлаты";			
		
	ИначеЕсли ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.НачислениеДоходов") Тогда
		ИмяДок = "НачислениеДоходов";
		
	ИначеЕсли ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.НачислениеСтудентамЗаПрочиеУслуги") Тогда
		ИмяДок = "НачислениеСтудентамЗаПрочиеУслуги";
		
	ИначеЕсли ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.СписаниеДоходовБудущихПериодов") Тогда
		ИмяДок = "СписаниеДоходовБудущихПериодов";
	
		ЭтоАренда = Истина;
		
	ИначеЕсли ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.НачислениеАмортизацииПравПользованияОС") Тогда
		ИмяДок = "НачислениеАмортизацииПравПользованияОС";
		
		ЭтоАренда = Истина;
		
	КонецЕсли;
	
	Счет30304 = БухгалтерскийУчет.СчетПоКоду("303.04", Дата, Организация);
	
	КПС30304 = БухгалтерскиеОперацииПовтИсп.КПССчета(Организация, ИФО, КФО, Дата, Счет30304,
		Новый Структура("а,б,в,г",
			Перечисления.ВидыКБК.КДБ,
			Перечисления.ВидыКБК.КРБ,
			Перечисления.ВидыКБК.Произвольный,
			Перечисления.ВидыКБК.АУИБУ));

	КПС30304Полученный = БухгалтерскиеОперацииПовтИсп.КПССчета(Организация, ИФО, КФО, Дата, Счет30304,
		Новый Структура("а,б,в",
			Перечисления.ВидыКБК.КДБ,
			Перечисления.ВидыКБК.Произвольный,
			Перечисления.ВидыКБК.АУИБУ));
	
	НастроитьФормуПоРежимуРаботы();
	
	ОбновитьСписокСервер();
	
	НастроитьФормуПослеЗаполненияСписка();
	
	ТиповаяОперацияСФ = БухгалтерскиеОперацииСервер.ТиповаяОперацияПоУмолчанию(
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.СчетФактураВыданный"));
	
	ТиповаяОперацияСФПолученный = БухгалтерскиеОперацииСервер.ТиповаяОперацияПоУмолчанию(
		ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.СчетФактураПолученный"));
		
	ТиповаяОперацияДокументОснование = БухгалтерскиеОперацииСервер.БухгалтерскаяОперацияДокумента(Параметры.Документ);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоРежимуРаботы()
	
	// Режим 1 (прежний)
	
	Элементы["Контрагент"].Видимость = НЕ ЭтоАренда;
	
	// Режим 2 (аренда)
	
	Элементы["МодифицироватьСуществующиеСФ"].Видимость = ЭтоАренда;
	
	Элементы["СписокДействие"].Видимость = ЭтоАренда;
	Элементы["СписокНоменклатура"].Видимость = ЭтоАренда;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПослеЗаполненияСписка()
	
	//
	// Типовые операции
	//
	Поиск = Новый Структура("ЭтоСчетФактураПолученный", Истина);
	МассивСтрок = Список.НайтиСтроки(Поиск);
	
	КоличествоПолученных = МассивСтрок.Количество();
	КоличествоВыданных = (Список.Количество() - КоличествоПолученных);
	
	ВидимостьПолученный = (КоличествоПолученных > 0);
	ВидимостьВыданный = (КоличествоВыданных > 0);
	
	// Для выданных счетов-фактур
	Элементы["КПС30304"].Видимость			= ВидимостьВыданный;
	Элементы["ТиповаяОперацияСФ"].Видимость	= ВидимостьВыданный;
	
	Элементы.КПС40120.Видимость = ВидимостьВыданный И ЕстьКФО1;
	
	// Для полученных счетов-фактур
	Элементы["КПС30304Полученный"].Видимость			= ВидимостьПолученный;
	Элементы["ТиповаяОперацияСФПолученный"].Видимость	= ВидимостьПолученный;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПриСоздании()
	
	Элементы["Контрагент"].Видимость					= НЕ ЭтоАренда;
	
	Элементы["МодифицироватьСуществующиеСФ"].Видимость	= ЭтоАренда;
	
	Элементы["СписокДействие"].Видимость				= ЭтоАренда;
	Элементы["СписокНоменклатура"].Видимость			= ЭтоАренда;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ДобавитьУсловноеОформлениеНедоступностьОтметки();
	
	Если ЭтоАренда Тогда
		//---
		// 1. Вывод сч.-ф. красным цветом при обнаружении ошибки
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Вывод сч.-ф. красным цветом при обнаружении ошибки'");

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ВыделитьСчетФактуру");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетФактура");

		
		//---
		// 2. Отсутствует соответствующее начисление для счета-фактуры
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Отсутствует соответствующее начисление для счета-фактуры'");

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ОтсутствуетНачисление");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокКонтрагент");
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокНоменклатура");
		
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДоговорКонтрагента");

		
		//---
		// 3. Номенклатура "-" при пустой ТЧ СоставНФА
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Номенклатура ""-"" при пустой ТЧ СоставНФА'");

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ОтсутствуетНачисление");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Истина;

		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.КоличествоСтрокНФА");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = 0;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "-");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокНоменклатура");


		//---
		// 4. Номенклатура <несколько> при ТЧ СоставНФА >= 2 строк
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Номенклатура <несколько> при ТЧ СоставНФА >= 2 строк'");

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.КоличествоСтрокНФА");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		Условие.ПравоеЗначение = 2;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<несколько>");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокНоменклатура");


		//---
		// 5. Текст <будет создан> для сч.-ф.
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Текст <будет создан> для сч.-ф.'");

		// Условия

		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.СчетФактура");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		Условие.ПравоеЗначение = Неопределено;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню, , , Истина, Ложь, Ложь, Ложь));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<будет создан>");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокСчетФактура");
		
		
		//---
		// 6. Текст "+" для действия
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Текст ""+"" для действия'");

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Действие");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = 1;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "+");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДействие");
		
		
		//---
		// 7. Текст "и" для действия
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Текст ""и"" для действия'");

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Действие");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = 2;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "и");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДействие");
		
		
		//---
		// 8. Текст "х" для действия
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Текст ""х"" для действия'");

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Действие");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = 3;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "x");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДействие");
		
	Иначе
		//---
		// 1. 
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Ошибка");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		Условие.ПравоеЗначение = Ложь;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Список");


		//---
		// 2. 
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Контрагент");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Счет30304");

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Центр);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "---");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокДоговорКонтрагента");


		//---
		// 3. 
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();

		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Ошибка");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		Условие.ПравоеЗначение = Ложь;

		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "");

		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокТекстСообщения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеНедоступностьОтметки()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Недоступность колонки Отметка при отсутствии допустимого действия'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Действие");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СписокОтметка");
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполненностьСводногоКонтрагента(Отказ)
	
	Если НЕ ЭтоАренда Тогда
		Контрагент = РаботаСоСтудентамиПовтИсп.ПолучитьКонтрагентаДляСводнойСчетФактуры();	
		
		Если Контрагент.Пустая() Тогда		
			ТекстОшибки = НСтр("ru = 'Не установлен контрагент для формирования сводной счет-фактуры. Требуется выполнить установку в настройках учета!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьОтбораСтрокДокументаОснования()
	
	ДоступностьОтбораСтрок = (ТипЗнч(Параметры.Документ) = Тип("ДокументСсылка.НачислениеАмортизацииПравПользованияОС"));
	
	Элементы.Список.ПоложениеКоманднойПанели = ?(ДоступностьОтбораСтрок,
		ПоложениеКоманднойПанелиЭлементаФормы.Авто, // на панели выводятся кнопки Установить/сбросить отметки
		ПоложениеКоманднойПанелиЭлементаФормы.Нет);
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ГруппаОтборСтрокДокументаОснования");
	ИменаЭлементов.Добавить("СписокУстановитьВсеОтметки");
	ИменаЭлементов.Добавить("СписокСброситьВсеОтметки");
	ИменаЭлементов.Добавить("СписокОтметка");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов,
		"Видимость",
		ДоступностьОтбораСтрок);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючОбъектаХранилища()
	
	Возврат "ОбщаяФорма_ФормаУправлениеСчетФактурамиПечати";
	
КонецФункции

&НаСервере
Функция ПолучитьКлючаНастроекХранилища()
	
	Возврат "НастройкиОтбораСтрокДокументаОснования";
	
КонецФункции
	
&НаСервере
Процедура ЗагрузитьНастройкиИзХранилища()
	
	ЗагруженныеНастройки = ХранилищеОбщихНастроек.Загрузить(ПолучитьКлючОбъектаХранилища(), ПолучитьКлючаНастроекХранилища());
	
	Если ТипЗнч(ЗагруженныеНастройки) = Тип("Структура")
		И ЗагруженныеНастройки.Свойство("ВидОтбораСтрокДокументаОснования")
		И ЗагруженныеНастройки.Свойство("СтавкиНДС") Тогда
		
		ВидОтбораСтрокДокументаОснования = ЗагруженныеНастройки.ВидОтбораСтрокДокументаОснования;
		СтавкиНДС.Загрузить(ЗагруженныеНастройки.СтавкиНДС);
	Иначе
		ВидОтбораСтрокДокументаОснования = 0;
		
		ИнициализироватьТаблицуСтавкиНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВХранилище()
	
	СохраняемыеНастройки = Новый Структура();
	СохраняемыеНастройки.Вставить("ВидОтбораСтрокДокументаОснования", ВидОтбораСтрокДокументаОснования);
	СохраняемыеНастройки.Вставить("СтавкиНДС", СтавкиНДС.Выгрузить());
	
	ХранилищеОбщихНастроек.Сохранить(ПолучитьКлючОбъектаХранилища(), ПолучитьКлючаНастроекХранилища(), СохраняемыеНастройки);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьТаблицуСтавкиНДС()
	
	СтавкиНДС.Очистить();
	
	Для Каждого Значение Из Перечисления.СтавкиНДС Цикл
		НоваяСтрока = СтавкиНДС.Добавить();
		
		НоваяСтрока.СтавкаНДС = Значение;
		
		Если Значение = Перечисления.СтавкиНДС.НДС0
			Или Значение = Перечисления.СтавкиНДС.НДС18
			Или Значение = Перечисления.СтавкиНДС.НДС18_118 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.Отметка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОтбораСтрокДокументаОснования()
	
	НастройкиОтбораСтрок = Новый Структура();
	НастройкиОтбораСтрок.Вставить("ВидОтбораСтрок",	ВидОтбораСтрокДокументаОснования);
	НастройкиОтбораСтрок.Вставить("ОтмеченныеСтавкиНДС",	СтавкиНДС.Выгрузить(Новый Структура("Отметка", Истина), "СтавкаНДС").ВыгрузитьКолонку("СтавкаНДС"));
	
	Возврат НастройкиОтбораСтрок;
	
КонецФункции

&НаКлиенте
Процедура НастроитьФормуКлиент_ВидОтбораСтрокДокументаОснования()
	
	Элементы.СтавкиНДС.Доступность = (ВидОтбораСтрокДокументаОснования = 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораСтрокДокументаОснованияПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ВидОтбораСтрокДокументаОснования();
	
	УстановитьЗаголовокОтбораСтрокДокументаОснования(ЭтаФорма);
	
	НастроитьАктуальностьСписка(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеВсехОтметок(Значение)
	
	Для Каждого СтрокаТаблицы Из Список Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Действие) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.Отметка = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАктуальностьСписка(Значение)
	
	Элементы.ГруппаСписокСФ.Доступность = Значение;
	
	Элементы.СформироватьСчетаФактуры.Доступность = Значение;
	
	ЗаголовокСписка = ?(Значение, "", НСтр("ru='обновите список'"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьЗаголовокОтбораСтрокДокументаОснования(Форма)
	
	ВидОтбораСтрокДокументаОснования = Форма.ВидОтбораСтрокДокументаОснования;
	
	КраткоеПредставление = "";
	
	Если ВидОтбораСтрокДокументаОснования = 0 Тогда
		КраткоеПредставление = НСтр("ru='без отбора'");
		
	ИначеЕсли ВидОтбораСтрокДокументаОснования = 1 Тогда
		КраткоеПредставление = НСтр("ru='выделен налог'");
		
	ИначеЕсли ВидОтбораСтрокДокументаОснования = 2 Тогда
		КраткоеПредставление = НСтр("ru='указана ставка'");
	КонецЕсли;
	
	ЭлементГруппы = Форма.Элементы.ГруппаОтборСтрокДокументаОснования;
	
	ЭлементГруппы.ЗаголовокСвернутогоОтображения = СтрШаблон("%1 (%2)", ЭлементГруппы.Заголовок, КраткоеПредставление);
	
КонецФункции

#КонецОбласти
