#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции	

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	СвойстваРегистраУчета.Вставить("Организация", 	ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Значение);
	СвойстваРегистраУчета.Вставить("НачалоПериода", ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаНачала);
	СвойстваРегистраУчета.Вставить("КонецПериода", 	ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].Значение.ДатаОкончания);
	
КонецПроцедуры	
	
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РеализацияОСиНМА");
	НастройкиВарианта.Описание = НСтр("ru = 'Доходы от реализации амортизируемого имущества'");
КонецПроцедуры

//Процедура используется подсистемой варианты отчетов
//
Процедура НастройкиОтчета(Настройки) Экспорт
	
	Схема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Для Каждого Вариант из Схема.ВариантыНастроек Цикл
		 Настройки.ОписаниеВариантов.Вставить(Вариант.Имя,Вариант.Представление);
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли	