
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
	НастроитьФорму();
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	Если ЗначениеЗаполнено(ДанныеПанелиРасписки.Расписка) Тогда
		// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПанельРасписки
	Если ИмяСобытия = "ЗаписанДокументРаспискиИнвентаризации" И Объект.Ссылка = Параметр.ДокументОписи Тогда
		НастроитьФормуПоРасписке();
	КонецЕсли;
	// Конец ПанельРасписки
	
	// Внутренний ЭДО
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец Внутренний ЭДО
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ИнициализацияФормыВыполнена Тогда
		НастроитьФорму();
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом 
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НастроитьФорму();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	Если ЗначениеЗаполнено(ДанныеПанелиРасписки.Расписка) Тогда
		// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
		ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов 
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РешениеОПроведенииИнвентаризацииПриИзменении(Элемент)
	
	// РешениеОПроведенииИнвентаризации
	ИнвентаризацияКлиент.ВыбраноРешениеОПроведенииИнвентаризации(ЭтаФорма);
	// Конец РешениеОПроведенииИнвентаризации
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеМестаПроведенияНажатие(Элемент, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.ПоказатьМестоПроведенияИнвентаризации(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры

#Область ПанельРасписки

&НаКлиенте
Процедура ДекорацияРаспискаНадписьНажатие(Элемент)
	
	ИнвентаризацияКлиент.ПриНажатииНадписиРасписка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРаспискаКомментарийГиперссылкаНадписьНажатие(Элемент)
	
	ИнвентаризацияКлиент.ПриНажатииГиперссылкиКомментарияПанелиРасписки(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОтборПоПодразделению

&НаКлиенте
Процедура ДекорацияПодразделениеНажатие(Элемент)
	
	ИнвентаризацияКлиент.ПриНажатииНаДекорациюПодразделение(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	НастроитьОтборПоПодразделению();
	
КонецПроцедуры

#КонецОбласти

// Внутренний ЭДО
&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец Внутренний ЭДО

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
	УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект);
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел2

&НаКлиенте
Процедура Раздел2ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.Раздел2.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		СтруктураИнициализации = Новый Структура();
		СтруктураИнициализации.Вставить("ДобавленоВручную", Истина);
		
		ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураИнициализации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел2СуммаОтклоненийВалПриИзменении(Элемент)
	
	РассчитатьСуммуОтклоненийРуб();
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел2КурсПриИзменении(Элемент)
	
	РассчитатьСуммуОтклоненийРуб();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Раздел3

&НаКлиенте
Процедура Раздел3ЗаключениеКомиссииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.НачатьВыборЗаключенияКомиссииПоИнвОписи(ЭтаФорма, Элементы.Раздел3.ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Раздел3ЗаключениеКомиссииОткрытие(Элемент, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.НачатьВводТекстовойСтрокиЗаключенияКомиссии(ЭтаФорма, СтандартнаяОбработка, "Раздел3");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии

&НаКлиенте
Процедура СоставКомиссииПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиямиКлиент.ЗаполнитьСписокВыбораЗамещающийСотрудник(ЭтотОбъект, Элемент);
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииЗамещающийСотрудникПриИзменении(Элемент)
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиямиКлиент.ЗаполнитьСведенияЗамещающегоСотрудникаВСтрокеТаблицы(ЭтотОбъект, Элемент);
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.СоставКомиссииОтсутствуетПриИзменении(ЭтаФорма, Элемент);
	
	// ЗамещениеЧленаКомиссии
	ОбновитьЗамещенияПриОтсутствииСервер();
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.СоставКомиссииПричинаОтсутствияПриИзменении(ЭтаФорма, Элемент);
	
	// ЗамещениеЧленаКомиссии
	ОбновитьЗамещенияПриОтсутствииСервер();
	// Конец ЗамещениеЧленаКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.СоставКомиссииПричинаОтсутствияНачалоВыбора(ЭтаФорма, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьРаздел1(Команда)
	
	ПроверитьИЗаполнитьРаздел1Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел2(Команда)
	
	ПроверитьИЗаполнитьРаздел2Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел3(Команда)
	
	ПроверитьИЗаполнитьРаздел3Клиент();
	
КонецПроцедуры

// Внутренний ЭДО
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец Внутренний ЭДО

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
    РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом 

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
    ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиями.ИнициализироватьФормуДокументаЗамещениеЧленаКомиссии(ЭтотОбъект);
	// Конец ЗамещениеЧленаКомиссии
	
	НастроитьНедоступностьИзмененияКолонок();
	
	УстановитьУсловноеОформление();
	
	ИнициализацияФормыВыполнена = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	// ПанельРасписки
	НастроитьФормуПоРасписке();
	// Конец ПанельРасписки
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиями.ЗаполнитьСлужебныеКолонкиЗамещениеЧленаКомиссии(ЭтотОбъект);
	// Конец ЗамещениеЧленаКомиссии
	
	УстановитьПредставлениеСчета();
	
	УстановитьПредставлениеНомераКомиссии();
	
	УстановитьПредставлениеМестаПроведения();
	
	НастроитьОтборПоПодразделению();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ИнвентаризацияСервер.ДобавитьУсловноеОформлениеСоставКомиссииПричинаОтсутствия(ЭтаФорма);
	
КонецПроцедуры
	
&НаСервере
Процедура УстановитьПредставлениеСчета()
	
	ПредставлениеСчета = "";
	
	Если ЗначениеЗаполнено(Объект.КФО) Или ЗначениеЗаполнено(Объект.Счет) Тогда
		ПредставлениеСчета = СтрШаблон("%1.%2",
			?(ЗначениеЗаполнено(Объект.КФО), Строка(Объект.КФО), "0"),
			?(ЗначениеЗаполнено(Объект.Счет), Строка(Объект.Счет), "000"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеНомераКомиссии()
	
	ИнвентаризацияКлиентСервер.УстановитьПредставлениеНомераКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеМестаПроведения()
	
	ИнвентаризацияКлиентСервер.УстановитьПредставлениеМестаПроведения(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьНедоступностьИзмененияКолонок()
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("Раздел1КассовыйОрган");
	НедоступныеКолонки.Добавить("Раздел1ЛицевойСчет");
	НедоступныеКолонки.Добавить("Раздел1ВалютаСчета");
	НедоступныеКолонки.Добавить("Раздел1СуммаПоУчетуВал");
	НедоступныеКолонки.Добавить("Раздел1СуммаПоУчетуРуб");
	
	НедоступныеКолонки.Добавить("Раздел2КассовыйОрган");
	НедоступныеКолонки.Добавить("Раздел2ЛицевойСчет");
	НедоступныеКолонки.Добавить("Раздел2ВалютаСчета");
	НедоступныеКолонки.Добавить("Раздел2СуммаОтклоненийВал");
	
	НедоступныеКолонки.Добавить("Раздел3КассовыйОрган");
	НедоступныеКолонки.Добавить("Раздел3ЛицевойСчет");
	НедоступныеКолонки.Добавить("Раздел3ВалютаСчета");
	НедоступныеКолонки.Добавить("Раздел3СуммаОтклоненийВал");
	НедоступныеКолонки.Добавить("Раздел3СуммаОтклоненийРуб");
	
	ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтаФорма, НедоступныеКолонки);
	
	НедоступныеКолонки = Новый Массив();
	НедоступныеКолонки.Добавить("СоставКомиссииСотрудник");
	
	ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки, Ложь);
	
КонецПроцедуры

// НедоступныеКолонки
&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_Очистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
// Конец НедоступныеКолонки

// ЗамещениеЧленаКомиссии
&НаСервере
Процедура ОбновитьЗамещенияПриОтсутствииСервер(ИмяТабличнойЧасти = "СоставКомиссии")
	
	РаботаСКомиссиями.ОбновитьЗамещенияПриОтсутствии(ЭтотОбъект, ИмяТабличнойЧасти);
	
КонецПроцедуры
// Конец ЗамещениеЧленаКомиссии

#Область ПанельРасписки

&НаСервере
Процедура НастроитьФормуПоРасписке()
	
	НастроитьПанельРаспискиИнвентаризацииСервер();
	
	НастроитьДоступностьРазделов();

КонецПроцедуры

&НаСервере
Процедура НастроитьПанельРаспискиИнвентаризацииСервер()
	
	ИнвентаризацияСервер.НастроитьПанельРаспискиНаФормеОписи(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьРазделов()
	
	ДоступностьРазделов = ЗначениеЗаполнено(ДанныеПанелиРасписки.Расписка) И ДанныеПанелиРасписки.РаспискаПроведена;
		
	Элементы.ГруппаРаздел1Заголовок.Доступность = ДоступностьРазделов;
	Элементы.ГруппаРаздел2Заголовок.Доступность = ДоступностьРазделов;
	Элементы.ГруппаРаздел3Заголовок.Доступность = ДоступностьРазделов;
	
КонецПроцедуры

#КонецОбласти

#Область РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура ЗакрытаФормаВыбораДанныхИзРешенияОПроведенииИнвентаризации(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора);
	
	ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора)
	
	ИнвентаризацияСервер.ЗаполнитьОписьПоРешениюИзФормыОписи(ЭтаФорма, РезультатВыбора);
	
	УстановитьПредставлениеСчета();
	УстановитьПредставлениеНомераКомиссии();
	УстановитьПредставлениеМестаПроведения();
	
	Объект.Раздел1.Очистить();
	Объект.Раздел2.Очистить();
	Объект.Раздел3.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ЗамещениеЧленаКомиссии
	РаботаСКомиссиями.ПриИзмененииКомиссииЗамещениеЧленаКомиссии(ЭтотОбъект);
	// Конец ЗамещениеЧленаКомиссии
	
	РаботаСКомиссиями.ЗаполнитьОтветственногоИсполнителяКомиссииВДокументеОписи(ЭтотОбъект);
	
	НастроитьОтборПоПодразделению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора)
	
	ИнвентаризацияКлиент.СообщитьОЗаполненииНаОснованииРешенияОПроведенииИнвентаризации();
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРазделов

#Область Раздел1

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел1Клиент()
	
	Если Объект.Раздел1.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением по данным учета все табличные части документа будут очищены.
			|
			|Продолжить и заполнить по данным учета?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел1КлиентЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Возврат;
	КонецЕсли;
	
	ПроверитьПередЗаполнениемРаздела1Клиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел1КлиентЗавершение(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ПроверитьПередЗаполнениемРаздела1Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПередЗаполнениемРаздела1Клиент()
	
	Отказ = Ложь;
	
	ПроверитьПередЗаполнениемРаздела1Сервер(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРаздел1Клиент();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПередЗаполнениемРаздела1Сервер(Отказ)
	
	Документы.ИнвентаризационнаяОписьОстатковНаСчетах.ПроверитьПередЗаполнениемРаздела1(Объект, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел1Клиент()
	
	Объект.Раздел1.Очистить();
	Объект.Раздел2.Очистить();
	Объект.Раздел3.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	РезультатЗадания = ЗаполнитьРаздел1Сервер();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("ЗавершениеЗаполненияРаздел1Клиент", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРаздел1Сервер()
	
	ПараметрыФункции = Новый Структура("
		|ДатаИнвентаризации,
		|Организация,
		|Подразделение,
		|КФО,
		|ИФО,
		|Счет");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФункции, Объект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Заполнение раздела 1 инвентаризационной описи 0510464'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Документы.ИнвентаризационнаяОписьОстатковНаСчетах.ПолучитьДанныеУчета",
		ПараметрыФункции)
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеЗаполненияРаздел1Клиент(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗавершениеЗаполненияРаздел1Сервер(Результат.АдресРезультата);
		
		Если Объект.Раздел1.Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='После заполнения раздел 1 оказался пустым'");
			
			ПоказатьПредупреждение(, ТекстСообщения, 10);
		КонецЕсли;
		
		Модифицированность = Истина;
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='При заполнении раздела 1 возникла ошибка.
			|Подробности см. в журнале регистрации.'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершениеЗаполненияРаздел1Сервер(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Объект.Раздел1.Загрузить(Результат.ТаблицаРаздела1);
	
КонецПроцедуры

#КонецОбласти

#Область Раздел2

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел2Клиент()
	
	Если Объект.Раздел2.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением будет очищена табличная часть документа.
			|
			|Продолжить и заполнить раздел 2?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел2КлиентЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьРаздел2Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел2КлиентЗавершение(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьРаздел2Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел2Клиент()
	
	Объект.Раздел2.Очистить();
	Объект.Раздел3.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	ЗаполнитьРаздел2Сервер();
	
	Если Объект.Раздел2.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В разделе 1 отсутствуют строки'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 10);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел2Сервер()
	
	Документы.ИнвентаризационнаяОписьОстатковНаСчетах.ЗаполнитьРаздел2(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуОтклоненийРуб()
	
	ТекДанные = Элементы.Раздел2.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.СуммаОтклоненийРуб = ТекДанные.СуммаОтклоненийВал * ТекДанные.Курс;
	
КонецПроцедуры

#КонецОбласти

#Область Раздел3

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел3Клиент()
	
	Если Объект.Раздел3.Количество() > 0 Тогда 
		ТекстВопроса = НСтр("ru='Перед заполнением будет очищена табличная часть документа.
			|
			|Продолжить и заполнить раздел 3?'");
		Оповещение = Новый ОписаниеОповещения("ПроверитьИЗаполнитьРаздел3КлиентЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьРаздел3Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьРаздел3КлиентЗавершение(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьРаздел3Клиент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаздел3Клиент()
	
	Объект.Раздел3.Очистить();
	Объект.ВыявленыОтклонения = Ложь;
	
	ЗаполнитьРаздел3Сервер();
	
	Если Объект.Раздел3.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В разделе 3 отсутствуют строки'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 10);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаздел3Сервер()
	
	Документы.ИнвентаризационнаяОписьОстатковНаСчетах.ЗаполнитьРаздел3(Объект);
	
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОтборПоПодразделению

&НаСервере
Процедура НастроитьОтборПоПодразделению()
	
	ИнвентаризацияСервер.НастроитьОтборПоПодразделениюНаФормеОписи(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
