#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(ОсновноеСредство) Тогда
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("ОсновноеСредство");
		Возврат;
	КонецЕсли;
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	СчетУчетаОС = УправлениеОсновнымиСредствами.СчетУчетаОС(ОсновноеСредство, Ссылка);
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетУчетаОС);
	
	Если СвойстваСчета = Неопределено Тогда
		ПроверяемыеРеквизиты.Очистить();
		ТекстСообщения = НСтр("ru='В выбранном объекте не указан счет учета'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство",,Отказ);
		Возврат;
	КонецЕсли;
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВПользование(ВидОперации) Тогда
		
		УправлениеОсновнымиСредствами.ПроверитьСобытиеОСвПользовании(
			УправлениеОсновнымиСредствами.НоваяТаблицаОСИнвНомер(ОсновноеСредство, ИнвентарныйНомер),
			Организация,
			Дата,
			Ссылка,
			,
			,
			Отказ);
			
		Если Отказ Тогда
			ПроверяемыеРеквизиты.Очистить();
			Возврат;
		КонецЕсли;
		
	Иначе
			
		НеПроверяемыеРеквизиты.Добавить("ЦМОПолучатель");
		НеПроверяемыеРеквизиты.Добавить("ПодразделениеПолучатель");
				
	КонецЕсли;
	
	УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
						И СвойстваСчета.УчетПоПодразделениям;
	Если Не УчетПоПодразделениям Тогда
		НеПроверяемыеРеквизиты.Добавить("Подразделение");
		НеПроверяемыеРеквизиты.Добавить("ПодразделениеПолучатель");
	КонецЕсли;
	Если ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
		НеПроверяемыеРеквизиты.Добавить("ЦМО");
	КонецЕсли;
	Если НЕ СвойстваСчета.УчетПоКПС Тогда
		НеПроверяемыеРеквизиты.Добавить("КПС");
	КонецЕсли;
	Если НЕ (СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты
			ИЛИ СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты
			ИЛИ СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) Тогда
		НеПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
			
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
	Если ЗначениеЗаполнено(ОсновноеСредство) И ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.ОС Тогда
		ТекстСообщения = НСтр("ru='Документ предназначен для отражения передачи объекта ОС (кроме зданий, сооружений и библиотечного фонда)'");
		Если ОсновноеСредство.ВидНФА <> Перечисления.ВидыНФА.ОС Тогда
			Отказ = Истина;
		Иначе
			МассивСчетов = УправлениеОсновнымиСредствамиПовтИсп.ПолучитьМассивСчетовОС(	Неопределено,
																						Ложь,
																						Ложь,
																						Ложь,
																						Истина,
																						Истина,
																						Истина,
																						Ложь,
																						Истина,
																						Истина,
																						Истина);
			Если МассивСчетов.Найти(СчетУчетаОС) = Неопределено Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Отказ Тогда
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.ОсновноеСредство");
			Возврат;
		КонецЕсли;
		
		ПараметрыУчетаОС = УправлениеОсновнымиСредствамиПовтИсп.ПолучитьПределыОС(НачалоГода(Дата));
		Если Сумма <= ПараметрыУчетаОС.ПервыйПределОС Тогда
			ТекстСообщения = НСтр("ru='Документ предназначен для отражения передачи объекта ОС стоимостью более %1 рублей'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПараметрыУчетаОС.ПервыйПределОС);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Объект.ОсновноеСредство",,Отказ);
			Возврат;
		КонецЕсли;			
	ИначеЕсли ЗначениеЗаполнено(ОсновноеСредство) И ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ИнвентарныйНомер"));	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(ДатаСписанияСБухУчета) Тогда
		ДатаСписанияСБухУчета = Дата;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли