////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТаблицаСсылокСГруппировкойПоОрганизацииВалюте(МассивСсылок) Экспорт
	
	ТабСсылок = Документы.ЗаявлениеНаВыдачуАванса.СписокСсылокСГруппировкой(МассивСсылок);
	
	МассивСтруктур = Новый Массив;
	
	Для Каждого Стр Из ТабСсылок Цикл
		
		МассивСтруктур.Добавить(Новый Структура("Организация, Валюта, Ключ, МассивСсылок",
			Стр.Организация, Стр.Валюта, Стр.Ключ, Стр.МассивСсылок));
		
	КонецЦикла;
	
	Возврат МассивСтруктур;
	
КонецФункции

Функция ДанныеПоРешениямОКомандированииДляВедомостиНаВыдачуДенегИзКассы(МассивСсылок) Экспорт
	
	Возврат Документы.РешениеОКомандировании.ДанныеДляВводаВедомостиНаВыдачуДенегИзКассы(МассивСсылок);
	
КонецФункции

Функция ДанныеПоРешениямОКомпенсацииДляВедомостиНаВыдачуДенегИзКассы(МассивСсылок) Экспорт
	
	Возврат Документы.РешениеОКомпенсацииРасходовДляКрайнегоСевера.ДанныеДляВводаВедомостиНаВыдачуДенегИзКассы(МассивСсылок);
	
КонецФункции

Функция ДанныеПоЗаявкамОбоснованиямДляВедомостиНаВыдачуДенегИзКассы(МассивСсылок) Экспорт
	
	Возврат Документы.ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ДанныеДляВводаВедомостиНаВыдачуДенегИзКассы(МассивСсылок);
	
КонецФункции

Функция ДанныеПоЗаявкамОбоснованиямЧерезПодотчетноеЛицоДляВедомостиНаВыдачуДенегИзКассы(МассивСсылок) Экспорт
	
	Возврат Документы.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо.ДанныеДляВводаВедомостиНаВыдачуДенегИзКассы(МассивСсылок);
	
КонецФункции
