#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, СписокРеквизитовДокумента());
	ЗагрузитьПереданыйСписокПлатежей(Параметры.АдресСпискаПлатежейВХранилище);
	
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	НастройкиОборудования = ЭквайрингВызовСервера.ПолучитьНастройкиОборудованияЭквайринга(РабочееМесто, Организация);
	ПараметрыДоговораПлатежногоАгента = НастройкиОборудования.ПараметрыДоговораПлатежногоАгента;
	
	Если Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкиОборудования.ПДЭ, "Организация") Тогда
		ПараметрыДоговораЭквайринга = НастройкиОборудования.ПДЭ;
	КонецЕсли;
	
	КассовоеПоступление = ДокументЧекиККМ.ДокументОснование;
	Если ЗначениеЗаполнено(КассовоеПоступление) Тогда
		ДанныеПервичногоДокумента = ДанныеКассовогоПоступления(КассовоеПоступление);
		ДатаПервичногоДокумента = ДанныеПервичногоДокумента.ДатаПервичногоДокумента;
		НомерПервичногоДокумента = ДанныеПервичногоДокумента.НомерПервичногоДокумента;
		ВидПервичногоДокумента = ДанныеПервичногоДокумента.ВидПервичногоДокумента;
		Дата = НачалоДня(ДанныеПервичногоДокумента.Дата);
	Иначе
		Дата = НачалоДня(ДокументЧекиККМ.Дата);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапки

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументыЭквайринговаяОперация(Команда)
	СоздатьДокументыЭквайринговаяОперацияНаСервере();
	
	Оповестить("ЭквайринговыеОперацииЭСПБГУИзменение");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция СписокРеквизитовДокумента()
	
	Возврат "КассаККМ, Организация, ВалютаРубли, ДокументЧекиККМ";
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПереданыйСписокПлатежей(АдресСпискаПлатежейВХранилище)

	Если ЭтоАдресВременногоХранилища(АдресСпискаПлатежейВХранилище) Тогда
		ТаблицаОплатыЭСП = ПолучитьИзВременногоХранилища(АдресСпискаПлатежейВХранилище);
		РасшифровкаОплаты.Загрузить(ТаблицаОплатыЭСП);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ДанныеКассовогоПоступления(ДокументСсылкаКассовоеПоступление) Экспорт
	СтруктураРезультат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылкаКассовоеПоступление,
		"ВидПервичногоДокумента, ДатаПервичногоДокумента, НомерПервичногоДокумента, Дата");
	
	Возврат СтруктураРезультат;
КонецФункции

&НаСервере
Процедура СоздатьДокументыЭквайринговаяОперацияНаСервере()
	РежимЗаписи = РежимЗаписиДокумента.Проведение;
	Счет20531 = БухгалтерскийУчет.СчетПоКоду("205.31", Дата, Организация);
	РеквизитыТиповойОперацииЭО = Новый Структура();
	РеквизитыТиповойОперацииЭО.Вставить("СчетПоступления",			БухгалтерскийУчет.СчетПоКоду("201.23", Дата, Организация));
	РеквизитыТиповойОперацииЭО.Вставить("СчетРасчетовСЭквайером",	БухгалтерскийУчет.СчетПоКоду("302.26", Дата, Организация));
	РеквизитыТиповойОперацииЭО.Вставить("ПроводкиИсполненияПлана",	Истина);
	
	ДокументыЭО = ПолучитьДокументыЭквайринговаяОперация();
	
	сч = 1;
	Для каждого ТекСтрока Из РасшифровкаОплаты Цикл
		
		ПараметрыОтбораДанных = Новый Структура("ДокументОснование, КлючСтроки", ДокументЧекиККМ, ТекСтрока.КлючСтроки); 	
		МассивДанныхОтобранныхЭО = ДокументыЭО.НайтиСтроки(ПараметрыОтбораДанных);
		ДокументСсылкаЭО = Документы.ЭквайринговаяОперация.ПустаяСсылка();
		Для каждого ТекСтрокаЭО Из МассивДанныхОтобранныхЭО Цикл
			ДокументСсылкаЭО = ТекСтрокаЭО.Ссылка;
			
			Прервать;
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(ДокументСсылкаЭО) Тогда
			НовыйДокументЭквайринговаяОперация = ДокументСсылкаЭО.ПолучитьОбъект();
		Иначе
			НовыйДокументЭквайринговаяОперация = Документы.ЭквайринговаяОперация.СоздатьДокумент();
		Конецесли;	
		
		НовыйДокументЭквайринговаяОперация.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаЭлектроннымиСредствамиПлатежаПоРеестру;
		НовыйДокументЭквайринговаяОперация.Дата = НачалоДня(Дата);
		НовыйДокументЭквайринговаяОперация.Организация = Организация;
		НовыйДокументЭквайринговаяОперация.УстановитьНовыйНомер();
		НовыйДокументЭквайринговаяОперация.ДокументОснование = ДокументЧекиККМ;
		
		НовыйДокументЭквайринговаяОперация.ПараметрыДоговораЭквайринга = ПараметрыДоговораЭквайринга;
		НовыйДокументЭквайринговаяОперация.ПараметрыДоговораПлатежногоАгента = ПараметрыДоговораПлатежногоАгента;
		
		ЗаполнитьЗначенияСвойств(НовыйДокументЭквайринговаяОперация, ПараметрыДоговораЭквайринга);
		
		НовыйДокументЭквайринговаяОперация.КлючСтрокиЧековККМДляРеестраПлатежей = ТекСтрока.КлючСтроки;
		
		ЗаполнитьЗначенияСвойств(НовыйДокументЭквайринговаяОперация, ТекСтрока);
		
		НовыйДокументЭквайринговаяОперация.СуммаДокумента = ТекСтрока.Сумма + ТекСтрока.СуммаКомиссииЭСП;
		НовыйДокументЭквайринговаяОперация.СуммаКомиссииБанка = ТекСтрока.СуммаКомиссииЭСП;
		НовыйДокументЭквайринговаяОперация.СчетРасчетов = Счет20531;
		
		НовыйДокументЭквайринговаяОперация.ВидПервичногоДокумента = ВидПервичногоДокумента;
		НовыйДокументЭквайринговаяОперация.НомерПервичногоДокумента = НомерПервичногоДокумента;
		НовыйДокументЭквайринговаяОперация.ДатаПервичногоДокумента = ДатаПервичногоДокумента;
		
		Попытка
			ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(НовыйДокументЭквайринговаяОперация));
			ТиповаяОперация = БухгалтерскиеОперацииСервер.ТиповаяОперацияПоУмолчанию(ИдентификаторДокумента);
			
			БухгалтерскиеОперацииСервер.ДобавитьДанныеДляПроведения(
				НовыйДокументЭквайринговаяОперация,
				ТиповаяОперация,
				РеквизитыТиповойОперацииЭО);
			
			НовыйДокументЭквайринговаяОперация.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ ""Эквайринговая операция"" для строки %1 не проведен: %2'"), СокрЛП(сч), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			РозничныеПродажиБГУ.ВыполнитьЗаписьСобытияПоВЖурналРегистрации(ТекстСообщения,
				"ЭквайринговаяОперация", УровеньЖурналаРегистрации.Ошибка);
		КонецПопытки;
		
		сч = сч + 1;
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru = 'Операция создания документов ""Эквайринговая операция"" для оплаты ЭСП завершена.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументыЭквайринговаяОперация()
	Данные = РасшифровкаОплаты.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ДокументОснование КАК ДокументОснование,
	               |	Таб.КлючСтроки КАК КлючСтроки
	               |ПОМЕСТИТЬ ДанныеПлатежей
	               |ИЗ
	               |	&Данные КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеПлатежей.ДокументОснование КАК ДокументОснование,
	               |	ДанныеПлатежей.КлючСтроки КАК КлючСтроки,
	               |	ЭквайринговаяОперация.Ссылка КАК Ссылка
	               |ИЗ
	               |	ДанныеПлатежей КАК ДанныеПлатежей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭквайринговаяОперация КАК ЭквайринговаяОперация
	               |		ПО ДанныеПлатежей.ДокументОснование = ЭквайринговаяОперация.ДокументОснование
	               |			И ДанныеПлатежей.КлючСтроки = ЭквайринговаяОперация.КлючСтрокиЧековККМДляРеестраПлатежей
	               |ГДЕ
	               |	ЭквайринговаяОперация.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументЧекиККМ);
	Запрос.УстановитьПараметр("Данные", Данные);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

#КонецОбласти