
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДополнитьРезультатВыбора(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ДополнитьРезультатВыбора(СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьРезультатВыбора(СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Результат = Новый Структура("Ссылка, КодТНВЭД, ЕдиницаИзмерения");
	ЗаполнитьЗначенияСвойств(Результат, ТекущиеДанные);
	ОповеститьОВыборе(Результат);

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЕдиницаИзмеренияШтука = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
	Список.Параметры.УстановитьЗначениеПараметра("ЕдиницаИзмеренияШтука", ЕдиницаИзмеренияШтука);
КонецПроцедуры
 
