#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ПредставлениеНалоговогоПериода = СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(//***БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		НачалоКвартала(НалоговыйПериод), 
		КонецКвартала(НалоговыйПериод),
		Истина);
	
	Если ПометкаУдаления И ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		РегистрыСведений.СтатусыЗапросовРеестровСчетовФактур.ПослеУстановкиПометкиУдаленияНаРеестрСчетовФактур(ИдентификаторЗапроса);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли