#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ОстаткиПоМОЛ");
	НастройкиВарианта.Описание = НСтр("ru = 'Остатки НФА по материально ответственному лицу'");
	НастройкиВарианта.Включен = Истина;
	
КонецПроцедуры

Функция ДобавитьКомандуОтчетОстакиНФАПоМОЛ(КомандыОтчетов, Параметры) Экспорт
	
	Если Не ПравоДоступа("Просмотр", Метаданные.Отчеты.ОстаткиНФАПоМОЛ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Команда                    = КомандыОтчетов.Добавить();
	Команда.Представление      = НСтр("ru = 'Остатки НФА по материально ответственному лицу'");
	Команда.МножественныйВыбор = Ложь;
	Команда.Важность           = "СмТакже";
	Команда.ТипПараметра       = Тип("ДокументСсылка.ПрекращениеДоговорМОЛ");
	Команда.Менеджер           = "Отчет.ОстаткиНФАПоМОЛ";
	
	Возврат Команда;
	
КонецФункции

Функция СвойстваОбъектаДляРасшифровкиСтандартнымиОтчетами(ОтчетОбъект) Экспорт
	
	СвойстваОбъекта = Новый Структура;
	Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрДатаОстатков = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОстатков"));
	Если ПараметрДатаОстатков <> Неопределено И ЗначениеЗаполнено(ПараметрДатаОстатков.Значение) Тогда
		СвойстваОбъекта.Вставить("НачалоПериода", НачалоГода(ПараметрДатаОстатков.Значение));
		СвойстваОбъекта.Вставить("КонецПериода", КонецДня(ПараметрДатаОстатков.Значение));
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
	ПараметрОрганизация = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если ПараметрОрганизация <> Неопределено Тогда
		СвойстваОбъекта.Вставить("Организация", ПараметрОрганизация.Значение);
	КонецЕсли;
	
	МассивОтчетов = Новый Массив;
	МассивОтчетов.Добавить("ОборотноСальдоваяВедомостьПоСчету");
	МассивОтчетов.Добавить("КарточкаСчета");
	МассивОтчетов.Добавить("АнализСчета");
	МассивОтчетов.Добавить("ОборотыСчета");
	
	СвойстваОбъекта.Вставить("ОтчетыРасшифровки", МассивОтчетов);
	
	МассивОсновныхДействий = Новый Массив;
	СвойстваОбъекта.Вставить("МассивОсновныхДействий", МассивОсновныхДействий);
	
	Возврат СвойстваОбъекта;
	
КонецФункции

#КонецОбласти

#КонецОбласти



#КонецЕсли
