
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.УникальныйИдентификаторИсточника) Тогда
		УникальныйИдентификаторИсточника = Параметры.УникальныйИдентификаторИсточника;
		ЗаполнитьПоИдентификаторуИсточника();
	КонецЕсли;
	УстановитьЗначенияФлагов();
	УстановитьЗаголовки();
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры   

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗагруженныеОбъекты

&НаКлиенте
Процедура ЗагруженныеОбъектыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекущиеДанные = Элементы.ЗагруженныеОбъекты.ТекущиеДанные;
	ОткрытьФорму(ИмяФормыДокумента(ТекущиеДанные.ЗагруженныйДокумент),
		Новый Структура("Ключ, ТолькоПросмотр", ТекущиеДанные.ЗагруженныйДокумент, Истина));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	ЗаписатьИзмененияНаКлиенте();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	ЗаписатьИзмененияНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовки()
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияУстановленЗапрет",
		"Заголовок",
		РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.НаименованиеПричины("УстановленЗапрет"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияРучнаяКорректировка",
		"Заголовок",
		РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.НаименованиеПричины("РучнаяКорректировка"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияНачатПроцессВнутреннегоЭДО",
		"Заголовок",
		РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.НаименованиеПричины("НачатПроцессВнутреннегоЭДО"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияНачатПроцессПОД",
		"Заголовок",
		РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.НаименованиеПричины("НачатПроцессПОД"));
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияФлагов()
	СостояниеЗапрета = РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.СостояниеЗапретаЗагрузкиДокументов(
		ЗагруженныеДокументы());
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СостояниеЗапрета);
КонецПроцедуры

&НаСервере
Функция ЗагруженныеДокументы()
	Результат = Новый Массив;
	Для Каждого Строка Из ЗагруженныеОбъекты Цикл
		Результат.Добавить(Строка.ЗагруженныйДокумент);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	ДокументНеМожетБытьЗагружен = УстановленЗапрет Или РучнаяКорректировка;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияДокументМожетБытьЗагружен",
		"Видимость", Не ДокументНеМожетБытьЗагружен); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияДокументНеМожетБытьЗагружен",
		"Видимость", ДокументНеМожетБытьЗагружен); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияУстановленЗапрет",
		"Видимость", УстановленЗапрет); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияРучнаяКорректировка",
		"Видимость", РучнаяКорректировка); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияНачатПроцессВнутреннегоЭДО",
		"Видимость", НачатПроцессВнутреннегоЭДО); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияНачатПроцессПОД",
		"Видимость", НачатПроцессПОД); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыДокумента(Знач ЗагруженныйДокумент)
	Возврат ЗагруженныйДокумент.Метаданные().ПолноеИмя() + ".ФормаОбъекта";
КонецФункции

&НаСервере
Процедура ЗаполнитьПоИдентификаторуИсточника()
	ЗагруженныеОбъекты.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияОбъектов.УникальныйИдентификаторИсточника КАК ЗагруженныйДокумент,
	|	ВЫБОР
	|		КОГДА Запрещенные.ЗагруженныйОбъект ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК УстановленЗапрет,
	|	&ПолеДата КАК Дата,
	|	&ПолеНомер КАК Номер,
	|	&ПолеОрганизация КАК Организация,
	|	&ПолеПометкаУдаления КАК ПометкаУдаления,
	|	&ПолеПроведен КАК Проведен,
	|	&ПолеКонтрагент КАК Контрагент,
	|	&ПолеЦМООтправитель КАК ЦМООтправитель,
	|	&ПолеЦМОПолучатель КАК ЦМОПолучатель,
	|	&ПолеКомментарий КАК Комментарий,
	|	ТИПЗНАЧЕНИЯ(СоответствияОбъектов.УникальныйИдентификаторИсточника) КАК ТипДокумента,
	|	ОперацииДокументов.ЕстьПроводки КАК ЕстьПроводки,
	|	ЕСТЬNULL(ОперацииДокументов.ДокументСторнирован, ЛОЖЬ) КАК ДокументСторнирован,
	|	ЕСТЬNULL(ОперацииДокументов.РучнаяКорректировка, ЛОЖЬ) КАК РучнаяКорректировка,
	|	ЕСТЬNULL(ОперацииДокументов.ИсправлениеОшибки, ЛОЖЬ) КАК ИсправлениеОшибки
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД КАК Запрещенные
	|		ПО СоответствияОбъектов.УникальныйИдентификаторПриемника = Запрещенные.УникальныйИдентификаторИсточника
	|		И СоответствияОбъектов.УникальныйИдентификаторИсточника = Запрещенные.ЗагруженныйОбъект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО СоответствияОбъектов.УникальныйИдентификаторИсточника = ОперацииДокументов.Документ
	|ГДЕ
	|	СоответствияОбъектов.УникальныйИдентификаторПриемника = &УникальныйИдентификаторПриемника";
	РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.ЗаполнитьПоляДокументовВТекстеЗапроса(
		Запрос.Текст, "СоответствияОбъектов.УникальныйИдентификаторИсточника");
	Запрос.УстановитьПараметр("УникальныйИдентификаторПриемника", УникальныйИдентификаторИсточника);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЗагруженныеОбъекты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.СостояниеДокумента = СостояниеДокумента(Выборка);
		НоваяСтрока.СостояниеОперации = СостояниеОперацииКод(Выборка);
		НоваяСтрока.ТипДокумента = Новый ОписаниеТипов(
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Выборка.ТипДокумента));
		УстановленЗапрет = УстановленЗапрет Или Выборка.УстановленЗапрет;
		РезультатыПоиска = СтрНайтиВсеПоРегулярномуВыражению(НоваяСтрока.Комментарий,
			"//(.*\d+ от \d{2}\.\d{2}\.\d{4} \d{2}\:\d{2}\:\d{2})");
		Если РезультатыПоиска.Количество() > 0 Тогда
			Группы = РезультатыПоиска[РезультатыПоиска.ВГраница()].ПолучитьГруппы();
			ПредставлениеИсходногоДокумента = Группы[Группы.ВГраница()].Значение;
		КонецЕсли;
		РучнаяКорректировка = РучнаяКорректировка Или Выборка.РучнаяКорректировка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СостояниеОперацииКод(Выборка)
	Если Выборка.ЕстьПроводки = NULL Тогда
		Возврат 0;
	ИначеЕсли Не Выборка.ЕстьПроводки Тогда
		Возврат 1;
	ИначеЕсли Выборка.ДокументСторнирован = Истина Тогда
		Возврат 4
	ИначеЕсли Выборка.РучнаяКорректировка = Истина Тогда
		Возврат 3;
	ИначеЕсли Выборка.ИсправлениеОшибки = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаПрошлогоГода
			Или Выборка.ИсправлениеОшибки = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаРанееПрошлогоГода Тогда
		Возврат 5;
	Иначе
		Возврат 2;
	КонецЕсли;	
КонецФункции

&НаСервере
Функция СостояниеДокумента(Выборка)

	Если Выборка.Проведен Тогда
		Возврат 1;
	ИначеЕсли Выборка.ПометкаУдаления Тогда
		Возврат 2
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаписатьИзмененияНаКлиенте()
	ЗаписатьИзменения();
	Оповестить("РегистрацияЗапретаПовторнойЗагрузкиОбъектаВД", УникальныйИдентификаторИсточника, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменения()
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД");
		ЭлементБлокировки.УстановитьЗначение("УникальныйИдентификаторИсточника", УникальныйИдентификаторИсточника);
		Блокировка.Заблокировать();
		
		Если УстановленЗапрет Тогда
			ЗаписатьЗапрет();
		Иначе
			УдалитьЗапрет();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗапрет()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточника КАК ЗагруженныйОбъект
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	|ГДЕ
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника = &УникальныйИдентификаторПриемника";
	Запрос.УстановитьПараметр("УникальныйИдентификаторПриемника", УникальныйИдентификаторИсточника);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗагруженныйОбъект.Установить(Выборка.ЗагруженныйОбъект);
		НаборЗаписей.Записать();
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ЗагруженныйОбъект = Выборка.ЗагруженныйОбъект;
		НоваяЗапись.УникальныйИдентификаторИсточника = УникальныйИдентификаторИсточника;
		НаборЗаписей.Записать(Истина);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьЗапрет()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.ЗагруженныйОбъект
	|ИЗ
	|	РегистрСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД КАК ОбъектыЗапрещенныеКПовторнойЗагрузкеВД
	|ГДЕ
	|	ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.УникальныйИдентификаторИсточника = &УникальныйИдентификаторИсточника";
	Запрос.УстановитьПараметр("УникальныйИдентификаторИсточника", УникальныйИдентификаторИсточника);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ОбъектыЗапрещенныеКПовторнойЗагрузкеВД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗагруженныйОбъект.Установить(Выборка.ЗагруженныйОбъект);
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
