/////////////////////////////////////////////////////////////////////////////////
// РАБОТА С ОБЯЗАТЕЛЬСТВАМИ, ПРОЦЕДУРЫ И ФУНКЦИИ ПОВТОРНОГО ИСПОЛЬЗОВАНИЯ      //
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПолучитьБюджетВнебюджетПоКФО() Экспорт 
	
	БюджетВнебюджетПоКФО = Новый Соответствие;
	БюджетВнебюджетПоКФО[Перечисления.КВД.Бюджет] 				= "Бюджет";
	БюджетВнебюджетПоКФО[Перечисления.КВД.СубсидииНаГосзадание] = "Внебюджет";
	БюджетВнебюджетПоКФО[Перечисления.КВД.СубсидииНаИныеЦели] 	= "Внебюджет";
	БюджетВнебюджетПоКФО[Перечисления.КВД.БюджетныеИнвестиции] 	= "Внебюджет";
	БюджетВнебюджетПоКФО[Перечисления.КВД.Внебюджет] 			= "Внебюджет";
	БюджетВнебюджетПоКФО[Перечисления.КВД.СредстваОМС] 			= "Внебюджет";
	
	Возврат БюджетВнебюджетПоКФО;
	
КонецФункции 

#КонецОбласти


