#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтключитьПроверку") Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьДетализациюПоКОСГУ = ПолучитьФункциональнуюОпцию("ИспользоватьДетализациюПоКОСГУВГрафикахСПокупателями");
	Если Не ИспользоватьДетализациюПоКОСГУ Тогда
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			Запись.КЭК = Справочники.КОСГУ.ПустаяСсылка();
		КонецЦикла;
		
	КонецЕсли;
	
	КонтрольИсполненияДоговоров.ЗаполнитьДатуИзмененияГрафиков(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли