#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Обновление на версию 2.0.110
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реестр.Организация КАК Организация,
	|	Реестр.ОсновноеСредство КАК ОсновноеСредство,
	|	Реестр.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	РегистрСведений.МедицинскоеОборудованиеФРМО КАК Реестр
	|ГДЕ
	|	(ВЫРАЗИТЬ(Реестр.Наименование КАК СТРОКА(1))) = """"";
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить(), ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	
	ПолноеИмяРегистра = ПолноеИмяРегистра();
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	РезультатВыборки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуИзмеренийНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь, ПолноеИмяРегистра, МенеджерВременныхТаблиц);
	
	Если Не РезультатВыборки.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	ИначеЕсли Не РезультатВыборки.ЕстьЗаписиВоВременнойТаблице Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПустойНомер", ИнтеграцияФРМОКлиентСервер.ПустойНомерПоУмолчанию());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	СобытияОССрезПоследних.Событие КАК Событие,
	|	НАЧАЛОПЕРИОДА(СобытияОССрезПоследних.ДатаСобытия, ДЕНЬ) КАК ДатаСобытия,
	|	СобытияОССрезПоследних.ПричинаСписания КАК ПричинаСписания
	|ПОМЕСТИТЬ ВТСобытия
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство, ИнвНомер) В
	|				(ВЫБРАТЬ
	|					Реестр.Организация,
	|					Реестр.ОсновноеСредство,
	|					Реестр.ИнвентарныйНомер
	|				ИЗ
	|					ВТ_Реестр КАК Реестр)) КАК СобытияОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ОКР(РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования / 12) КАК СрокСлужбы
	|ПОМЕСТИТЬ ВТСПИ
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					Реестр.Организация,
	|					Реестр.ОсновноеСредство
	|				ИЗ
	|					ВТ_Реестр КАК Реестр)) КАК РасчетАмортизацииОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реестр.Организация КАК Организация,
	|	Реестр.ОсновноеСредство КАК ОсновноеСредство,
	|	Реестр.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА Реестр.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА Реестр.ОсновноеСредство.Наименование
	|		ИНАЧЕ Реестр.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК Наименование,
	|	ВЫБОР
	|		КОГДА Реестр.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА &ПустойНомер
	|		ИНАЧЕ СОКРП(Реестр.ИнвентарныйНомер.Код)
	|	КОНЕЦ КАК ИнвентарныйНомерКод,
	|	ВЫБОР
	|		КОГДА Реестр.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА &ПустойНомер
	|		ИНАЧЕ Реестр.ИнвентарныйНомер.ЗаводскойНомер
	|	КОНЕЦ КАК СерийныйНомер,
	|	Реестр.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	|	ОсновныеСредстваКонтактнаяИнформация.Значение КАК Адрес,
	|	ВТВвод.ДатаСобытия КАК ДатаВводаВЭксплуатацию,
	|	ВТВывод.ДатаСобытия КАК ДатаВыводаИзЭксплуатации,
	|	ВТВывод.ПричинаСписания КАК ПричинаВыводаИзЭксплуатации,
	|	ВТСПИ.СрокСлужбы КАК СрокСлужбы
	|ИЗ
	|	ВТ_Реестр КАК Реестр
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства.КонтактнаяИнформация КАК ОсновныеСредстваКонтактнаяИнформация
	|		ПО Реестр.ОсновноеСредство = ОсновныеСредстваКонтактнаяИнформация.Ссылка
	|			И (ОсновныеСредстваКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестонахожденияОбъектаОС))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСПИ КАК ВТСПИ
	|		ПО Реестр.ОсновноеСредство = ВТСПИ.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСобытия КАК ВТВвод
	|		ПО Реестр.ОсновноеСредство = ВТВвод.ОсновноеСредство
	|			И Реестр.ИнвентарныйНомер = ВТВвод.ИнвентарныйНомер
	|			И (ВТВвод.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСобытия КАК ВТВывод
	|		ПО Реестр.ОсновноеСредство = ВТВывод.ОсновноеСредство
	|			И Реестр.ИнвентарныйНомер = ВТВывод.ИнвентарныйНомер
	|			И (ВТВывод.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание))";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_Реестр", РезультатВыборки.ИмяВременнойТаблицы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ДатаВыводаИзЭксплуатации) Тогда
			Если ЗначениеЗаполнено(Выборка.ПричинаВыводаИзЭксплуатации) Тогда
				ПричинаВыводаИзЭксплуатации = Выборка.ПричинаВыводаИзЭксплуатации;
			Иначе
				ПричинаВыводаИзЭксплуатации = "Неизвестно";
			КонецЕсли;
		Иначе
			ПричинаВыводаИзЭксплуатации = "";
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.МедицинскоеОборудованиеФРМО.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
		НаборЗаписей.Отбор.ОсновноеСредство.Установить(Выборка.ОсновноеСредство);
		НаборЗаписей.Отбор.ИнвентарныйНомер.Установить(Выборка.ИнвентарныйНомер);
		
		НаборЗаписей.Прочитать(); 
		
		Для Каждого Запись Из НаборЗаписей Цикл
			
			Если Запись.ИнойАдрес Тогда
				СвойстваАдреса = ИнтеграцияФРМО.АдресБГУвФРМО(Выборка.Адрес);
				Адрес = СвойстваАдреса.Значение;
			Иначе
				Адрес = "";
			КонецЕсли;
			
			Запись.Наименование					= Выборка.Наименование;
			Запись.ИнвентарныйНомерКод			= Выборка.ИнвентарныйНомерКод;
			Запись.СерийныйНомер				= Выборка.СерийныйНомер;
			Запись.СрокСлужбы					= Выборка.СрокСлужбы;
			Запись.ДатаВыпуска					= Выборка.ДатаВыпуска;
			Запись.ДатаВводаВЭксплуатацию		= Выборка.ДатаВводаВЭксплуатацию;
			Запись.ДатаВыводаИзЭксплуатации		= Выборка.ДатаВыводаИзЭксплуатации;
			Запись.ПричинаВыводаИзЭксплуатации	= ПричинаВыводаИзЭксплуатации;
			Запись.ЭксплуатацияЗавершена		= ЗначениеЗаполнено(Выборка.ДатаВыводаИзЭксплуатации);
			Запись.Адрес						= Адрес;
			Запись.Количество					= 1;
			
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

Функция ПолноеИмяРегистра()
	
	Возврат Метаданные.РегистрыСведений.МедицинскоеОборудованиеФРМО.ПолноеИмя();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли