
#Область ПрограммныйИнтерфейс

Процедура ОбработатьРезультатОперацииСервиса(РезультатОперации, ПервичнаяОбработка, ОповещениеПриЗавершении = Неопределено) Экспорт
	
	Если НЕ ПервичнаяОбработка
			И НЕ РезультатОперации.ОперацияВыполненаУспешно
			И РезультатОперации.ТребуетсяОбновлениеКлючаСессии
			И ЗначениеЗаполнено(РезультатОперации.ПараметрыОбновленияКлючаСессии) Тогда
		
		ТекстСообщения = НСтр("ru = '""Честный знак"" отказал в обработке запроса из-за нехватки прав.
									|Если ошибка повторяется, обратитесь в техническую поддержку.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РезультатОперации.ТекстСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОперации.ТекстСообщения);
	КонецЕсли;
	
	Если ПервичнаяОбработка
			И НЕ РезультатОперации.ОперацияВыполненаУспешно
			И РезультатОперации.ТребуетсяОбновлениеКлючаСессии
			И ЗначениеЗаполнено(РезультатОперации.ПараметрыОбновленияКлючаСессии) Тогда
		
		ЗапроситьУстановитьКлючСессииШаг1(РезультатОперации, Ложь, ОповещениеПриЗавершении);
		
	ИначеЕсли ПервичнаяОбработка
			И НЕ РезультатОперации.ОперацияВыполненаУспешно
			И НЕ РезультатОперации.ТребуетсяОбновлениеКлючаСессии
			И РезультатОперации.ТребуетсяПодписание
			И ЗначениеЗаполнено(РезультатОперации.ПараметрыПодписания) Тогда
		
		РезультатОбработкиОшибки = ОбменИСМПБГУКлиентСервер.НовыйРезультатОбработкиОшибкиОперацииСервиса();
		ПодписатьОткрепленнойПодписьюШаг1(РезультатОперации, РезультатОбработкиОшибки, ОповещениеПриЗавершении);
		
	ИначеЕсли ОповещениеПриЗавершении <> Неопределено Тогда
		
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапроситьУстановитьКлючСессииШаг1(РезультатОперации, ПоказыватьДанныеНаПодпись, ОповещениеПриЗавершении = Неопределено) Экспорт
	
	ПараметрыОбновленияКлючаСессии = РезультатОперации.ПараметрыОбновленияКлючаСессии;
	
	// Для авторизации требуется прикрепленная подпись
	ПараметрыCMS = ЭлектроннаяПодписьКлиент.ПараметрыCMS();
	ПараметрыCMS.Открепленная = Ложь;
	
	Данные = Новый Структура;
	Данные.Вставить("Данные",       ПараметрыОбновленияКлючаСессии.ПараметрыАвторизации.Данные);
	Данные.Вставить("Сообщение",    ПараметрыОбновленияКлючаСессии);
	Данные.Вставить("ПараметрыCMS", ПараметрыCMS);
	
	Если ПоказыватьДанныеНаПодпись Тогда
		
		ОповещениеПредставления = Новый ОписаниеОповещения(
			"ПоказатьПодписываемоеСообщение",
			ЭтотОбъект,
			ПараметрыОбновленияКлючаСессии);
		
		ПредставлениеДанных = Новый Структура;
		ПредставлениеДанных.Вставить("Значение",      ОповещениеПредставления);
		ПредставлениеДанных.Вставить("Представление", НСтр("ru = 'Показать'"));
		
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция",            НСтр("ru = 'Вход по электронной подписи'"));
	ОписаниеДанных.Вставить("ЗаголовокДанных",     НСтр("ru = 'Ключ сессии'"));
	ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	ОписаниеДанных.Вставить("ОтборСертификатов",   ПараметрыОбновленияКлючаСессии.Сертификаты);
	ОписаниеДанных.Вставить("БезПодтверждения",    Истина);
	ОписаниеДанных.Вставить("ВыполнятьНаСервере",  Неопределено);
	ОписаниеДанных.Вставить("Данные",              Данные);
	Если ПоказыватьДанныеНаПодпись Тогда
		ОписаниеДанных.Вставить("Представление",   ПредставлениеДанных);
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Контекст.Вставить("РезультатОперации", РезультатОперации);
	
	ОповещениеСледующегоШага = Новый ОписаниеОповещения("ЗапроситьУстановитьКлючСессииШаг2", ЭтотОбъект, Контекст);
	
	ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, ЭтотОбъект, ОповещениеСледующегоШага);
	
КонецПроцедуры

Процедура ЗапроситьУстановитьКлючСессииШаг2(Результат, ДополнительныеПараметры) Экспорт
	
	ВыполнятьОповещение = Ложь;
	
	ОповещениеПриЗавершении = Неопределено;
	Если ДополнительныеПараметры <> Неопределено
			И ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		ДополнительныеПараметры.Свойство("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
		ВыполнятьОповещение = Истина;
		
	КонецЕсли;
	
	РезультатОбработкиОшибки = ОбменИСМПБГУКлиентСервер.НовыйРезультатОбработкиОшибкиОперацииСервиса();
	
	Если Результат <> Неопределено И Результат.Успех Тогда
		
		РезультатОперации = Неопределено;
		Если ДополнительныеПараметры <> Неопределено
				И ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
				И ДополнительныеПараметры.Свойство("РезультатОперации", РезультатОперации) Тогда
			
			ПараметрыОбновленияКлючаСессии = РезультатОперации.ПараметрыОбновленияКлючаСессии;
			
			ПараметрыЗапроса = ПараметрыОбновленияКлючаСессии.ПараметрыЗапросаКлючаСессии;
			ПараметрыАвторизации = ПараметрыОбновленияКлючаСессии.ПараметрыАвторизации;
			Подпись = Результат.СвойстваПодписи.Подпись;
			
			РезультатЗапросаКлючаСессии
				= ОбменИСМПБГУВызовСервера.ЗапроситьУстановитьКлючСессии(ПараметрыЗапроса, ПараметрыАвторизации, Подпись);
			
			РезультатОбработкиОшибки.КлючСессииУстановлен = РезультатЗапросаКлючаСессии.КлючСессииУстановлен;
			РезультатОбработкиОшибки.ТекстОшибки = РезультатЗапросаКлючаСессии.ТекстОшибки;
			
			Если РезультатОперации.ТребуетсяПодписание И ЗначениеЗаполнено(РезультатОперации.ПараметрыПодписания) Тогда
				ПодписатьОткрепленнойПодписьюШаг1(РезультатОперации, РезультатОбработкиОшибки, ОповещениеПриЗавершении);
				ВыполнятьОповещение = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыполнятьОповещение Тогда
		
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОбработкиОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодписатьОткрепленнойПодписьюШаг1(РезультатОперации, РезультатОбработкиОшибки, ОповещениеПриЗавершении = Неопределено) Экспорт
	
	Если ТипЗнч(РезультатОперации.ПараметрыПодписания) = Тип("Структура") Тогда
		
		ПараметрыПодписания = РезультатОперации.ПараметрыПодписания;
		
		ДанныеНаПодпись = ПараметрыПодписания.ДанныеНаПодпись;
		ПоказыватьДанныеНаПодпись = ПараметрыПодписания.ПоказыватьДанныеНаПодпись;
		
		ПараметрыCMS = ЭлектроннаяПодписьКлиент.ПараметрыCMS();
		ПараметрыCMS.Открепленная = Истина;
		
		Данные = Новый Структура;
		Данные.Вставить("Данные",       ДанныеНаПодпись);
		Данные.Вставить("ПараметрыCMS", ПараметрыCMS);
		
		Если ПоказыватьДанныеНаПодпись Тогда
			
			ОповещениеПредставления = Новый ОписаниеОповещения(
				"ПоказатьПодписываемоеСообщение",
				ЭтотОбъект,
				ДанныеНаПодпись);
			
			ПредставлениеДанных = Новый Структура;
			ПредставлениеДанных.Вставить("Значение",      ОповещениеПредставления);
			ПредставлениеДанных.Вставить("Представление", НСтр("ru = 'Документ для ""Честного Знака""'"));
			
		КонецЕсли;
		
		ОписаниеДанных = Новый Структура;
		ОписаниеДанных.Вставить("Операция",            НСтр("ru = 'Подписание отправляемого документа'"));
		ОписаниеДанных.Вставить("ЗаголовокДанных",     НСтр("ru = 'Документ к отправке'"));
		ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
		ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
		ОписаниеДанных.Вставить("ОтборСертификатов",   ПараметрыПодписания.Сертификаты);
		ОписаниеДанных.Вставить("БезПодтверждения",    Истина);
		ОписаниеДанных.Вставить("ВыполнятьНаСервере",  Неопределено);
		ОписаниеДанных.Вставить("Данные",              Данные);
		Если ПоказыватьДанныеНаПодпись Тогда
			ОписаниеДанных.Вставить("Представление",   ПредставлениеДанных);
		КонецЕсли;
		
		Контекст = Новый Структура;
		Контекст.Вставить("РезультатОбработкиОшибки", РезультатОбработкиОшибки);
		Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
		
		ОповещениеСледующегоШага = Новый ОписаниеОповещения("ПодписатьОткрепленнойПодписьюШаг2", ЭтотОбъект, Контекст);
		
		ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, ЭтотОбъект, ОповещениеСледующегоШага);
		
	ИначеЕсли ОповещениеПриЗавершении <> Неопределено Тогда
		
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОбработкиОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодписатьОткрепленнойПодписьюШаг2(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатОбработкиОшибки = Неопределено;
	Если ДополнительныеПараметры <> Неопределено
			И ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		ДополнительныеПараметры.Свойство("РезультатОбработкиОшибки", РезультатОбработкиОшибки);
		
	Иначе
		
		РезультатОбработкиОшибки = ОбменИСМПБГУКлиентСервер.НовыйРезультатОбработкиОшибкиОперацииСервиса();
		
	КонецЕсли;
	
	Если Результат <> Неопределено И Результат.Успех Тогда
		
		ПодписанныеДанные = Результат.СвойстваПодписи.Подпись;
		ПодписанныйДокумент = ОбменИСМПБГУКлиентСервер.ДвоичныеДанныеBase64(ПодписанныеДанные);
		
		РезультатОбработкиОшибки.ПодписаниеУспешно = Истина;
		РезультатОбработкиОшибки.ПодписанныйДокумент = ПодписанныйДокумент;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено
			И ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			И ДополнительныеПараметры.Свойство("ОповещениеПриЗавершении") Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, РезультатОбработкиОшибки);
		
	КонецЕсли;
	
КонецПроцедуры

Функция КлючСессииУстановлен(ДанныеДляПроверки, ВыводитьСообщенияОбОшибках = Истина) Экспорт
	
	КлючУстановлен = Ложь;
	
	Если ДанныеДляПроверки <> Неопределено И ТипЗнч(ДанныеДляПроверки) = Тип("Структура") Тогда
		Если ДанныеДляПроверки.Свойство("КлючСессииУстановлен") И ДанныеДляПроверки.КлючСессииУстановлен Тогда
			КлючУстановлен = Истина;
		КонецЕсли;
		Если ВыводитьСообщенияОбОшибках Тогда
			Если ДанныеДляПроверки.Свойство("ТекстОшибки") И ЗначениеЗаполнено(ДанныеДляПроверки.ТекстОшибки) Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеДляПроверки.ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлючУстановлен;
	
КонецФункции

Функция ПодписаниеУспешно(ДанныеДляПроверки) Экспорт
	
	ПодписаниеУспешно = Ложь;
	
	Если ДанныеДляПроверки <> Неопределено И ТипЗнч(ДанныеДляПроверки) = Тип("Структура") Тогда
		Если ДанныеДляПроверки.Свойство("ПодписаниеУспешно") И ДанныеДляПроверки.ПодписаниеУспешно Тогда
			ПодписаниеУспешно = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПодписаниеУспешно;
	
КонецФункции

Процедура ЗаписатьКодыМарикровкиВЛокальныйМодуль(РезультатВыполнения) Экспорт 
	
	ОперацииПоРаботеСКодамиМаркировки = ИнтерфейсИСМПОбщегоНазначенияКлиентСервер.ОперацииПриРаботеСКодамиМаркировки();
	
	ОперацииВыбытияМарок = Новый Массив;
	ОперацииВыбытияМарок.Добавить(ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств"));
	ОперацииВыбытияМарок.Добавить(ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств"));
	
	Операция = ?(ОперацииВыбытияМарок.Найти(РезультатВыполнения.ПараметрыФискализации.ТипРасчета) = Неопределено, ОперацииПоРаботеСКодамиМаркировки.Возврат, ОперацииПоРаботеСКодамиМаркировки.Продажа);
	
	ПараметрыПробитияЧека          = ИнтеграцияТСПИоТКлиент.ПараметрыПробитияЧека();
	ПараметрыПробитияЧека.ККТ      = РезультатВыполнения.ИдентификаторУстройства;
	ПараметрыПробитияЧека.Операция = Операция;

	Для Каждого СтрокаМаркировки Из РезультатВыполнения.ОтчетВыбытииМТ.ПозицииЧека Цикл 
		Если ЗначениеЗаполнено(СтрокаМаркировки.НормализованныйКодМаркировки) Тогда
			
			СтрокаЗаписи = ИнтеграцияТСПИоТКлиент.ДанныеКодовИдентификации();
			
			СтрокаЗаписи.КодИдентификации             = СтрокаМаркировки.НормализованныйКодМаркировки;
			СтрокаЗаписи.ДробноеКоличествоЧислитель   = СтрокаМаркировки.ДробноеКоличество.Числитель;
			СтрокаЗаписи.ДробноеКоличествоЗнаменатель = СтрокаМаркировки.ДробноеКоличество.Знаменатель;
			СтрокаЗаписи.Количество                   = СтрокаМаркировки.Количество;
			
			ПараметрыПробитияЧека.ДанныеКИ.Добавить(СтрокаЗаписи);
		КонецЕсли;
	КонецЦикла;	
	ИнтеграцияТСПИоТКлиент.ПослеФискализацииЧекаСМаркированнымиТоварами(ПараметрыПробитияЧека);
	
КонецПроцедуры

#КонецОбласти
