#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Определяет является ли правило заполнения основным
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Истина - правило заполнения основное
//  Ложь - правило заполнения дополнительное
//
Функция ОсновноеПравило() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.ОсновныеПравилаЗаполнения КАК ОсновныеПравилаЗаполнения
		|ГДЕ
		|	ОсновныеПравилаЗаполнения.ВидОтчета = &ВидОтчета
		|	И ОсновныеПравилаЗаполнения.ПравилоЗаполнения = &ПравилоЗаполнения";
		
	Запрос.УстановитьПараметр("ВидОтчета", ЭтотОбъект.Владелец);
	Запрос.УстановитьПараметр("ПравилоЗаполнения", ЭтотОбъект.Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования.Ссылка);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ПометкаУдаления И ОсновноеПравило() Тогда
		
		РегистрыСведений.ОсновныеПравилаЗаполнения.УдалитьОсновноеПравило(Ссылка);
		
	КонецЕсли;
	
	Значение = Неопределено;
	Если ДополнительныеСвойства.Свойство("ОбъектКопирования", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения") И ЗначениеЗаполнено(Значение) Тогда
		
		СписокОбластей = Справочники.ПравилаЗаполнения.ПолучитьСписокОбластей(Значение);
		Для каждого ЭлементСписка Из СписокОбластей Цикл
			
			НоваяОбласть = ЭлементСписка.Значение.Скопировать();
			
			НоваяОбласть.ДополнительныеСвойства.Вставить("Инициализировать", Истина);
			НоваяОбласть.ДополнительныеСвойства.Вставить("ВосстанавливатьНаборы", Истина);
			НоваяОбласть.ДополнительныеСвойства.Вставить("ПроверятьСхемуЗаполнения", Истина);
			
			НоваяОбласть.Владелец = ЭтотОбъект.Ссылка;
			
			Попытка
				
				НоваяОбласть.Записать();
				
				Значение = Неопределено;
				Если НоваяОбласть.ДополнительныеСвойства.Свойство("ОшибкаИнициализации", Значение) И ТипЗнч(Значение) = Тип("Булево") И Значение = Истина Тогда
					
					ДополнительныеСвойства.Вставить("ОшибкаИнициализации", Истина);
					
				КонецЕсли;
				
			Исключение
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Правило заполнения ""%1"" не может быть записано. Ошибка: %2'"), Ссылка, ОписаниеОшибки());
				
				ЗаписьЖурналаРегистрации("Данные.Изменение",УровеньЖурналаРегистрации.Ошибка, Метаданные(), Ссылка, ТекстСообщения);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Отказ = Истина;
				Возврат;
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли