#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

Функция ЗаполнитьНаОсновании(Знач Основание, Объект, ОписаниеОшибки = "", ЗаполнятьШапкуПоОснованию = Истина, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен документ основания.'");
		Возврат Ложь;
	КонецЕсли;	
	
	ТипДокументаОснования = ТипЗнч(Основание);
	
	Если ТипДокументаОснования = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		Если НЕ ЭлектронныеДокументыБГУ.ДляДокументаСуществуетЭД(Объект.Ссылка) Тогда
			ЗаполнитьНаОснованииСчетФактураПолученный(Основание,Объект,ЗаполнятьШапкуПоОснованию);
			Объект.ДокументОснование = Основание;
		КонецЕсли;
		
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.КорректировочныйСчетФактураПолученный") Тогда
		Если НЕ ЭлектронныеДокументыБГУ.ДляДокументаСуществуетЭД(Объект.Ссылка) Тогда
			ЗаполнитьНаОснованииКорректировочныйСчетФактураПолученный(Основание,Объект,ЗаполнятьШапкуПоОснованию);
			Объект.ДокументОснование = Основание;
		КонецЕсли;
		
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ИсправительныйСчетФактураПолученный") Тогда
		Если НЕ ЭлектронныеДокументыБГУ.ДляДокументаСуществуетЭД(Объект.Ссылка) Тогда
			ЗаполнитьНаОснованииИсправительныйСчетФактураПолученный(Основание,Объект,ЗаполнятьШапкуПоОснованию);
			Объект.ДокументОснование = Основание;
		КонецЕсли;
		
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		Если НЕ УчетНДС.ДопустимВводИСФНаОснованииПоступления(Основание, ОписаниеОшибки) Тогда
			ОписаниеОшибки = НСтр("ru='Ввод исправительного счета-фактуры на основании отменен.
				|'") + ОписаниеОшибки;
			
			Возврат Ложь;
		КонецЕсли;
		
		ЗаполнитьНаОснованииПоступлениеМЗ(Основание, Объект, ДополнительныеПараметры);
	КонецЕсли;
	
	Объект.ДатаИсправления = ТекущаяДатаСеанса();
	
	ЗаполнитьРеквизитыСторонСделки(Объект);
	
	Если не ЗначениеЗаполнено(Объект.ВалютаДокумента) тогда
		Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура СформироватьДвиженияПоРегистрам(ДокументОбъект, Отказ) Экспорт
	Движения = ДокументОбъект.Движения;
	Для каждого РегистрДвижения из Движения цикл
		Если ТипЗнч(РегистрДвижения) <> Тип("РегистрБухгалтерииНаборЗаписей.ЖурналПроводокЕПСБУ")
			И ТипЗнч(РегистрДвижения) <> Тип("РегистрСведенийНаборЗаписей.ОперацииСПрослеживаемымиТоварами") Тогда
			РегистрДвижения.Записывать = Истина;
			РегистрДвижения.Очистить();
		КонецЕсли;	
	КонецЦикла;
	
	ОперацияДокумента = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ДокументОбъект.Ссылка,Новый Структура("КФО,Операция,Курс,Кратность"));
	//
	Если ЗначениеЗаполнено(ОперацияДокумента.Операция) тогда
		СтруктураШапкиДокумента = ОбщегоНазначенияБГУ.СформироватьСтруктуруШапкиДокументаПоСсылке(ДокументОбъект.Ссылка);
		
		СтруктураШапкиДокумента.Вставить("Ссылка",				ДокументОбъект.Ссылка);
		СтруктураШапкиДокумента.Вставить("КФО",					ОперацияДокумента.КФО);
		СтруктураШапкиДокумента.Вставить("Дата",				ДокументОбъект.Дата);
		СтруктураШапкиДокумента.Вставить("ДокументОснование",	ДокументОбъект.ДокументОснование);
		СтруктураШапкиДокумента.Вставить("КорректируемыйПериод",ДокументОбъект.КорректируемыйПериод);
		СтруктураШапкиДокумента.Вставить("ИсправляемыйДокумент",ДокументОбъект.ИсправляемыйДокумент);  
		
		СтруктураШапкиДокумента.Вставить("ЭтоКорректировка",	УчетНДС.ЭтоКорректировка(, ДокументОбъект.ИсправляемыйДокумент));
		СтруктураШапкиДокумента.Вставить("Курс",				ОперацияДокумента.Курс);
		СтруктураШапкиДокумента.Вставить("Кратность",			ОперацияДокумента.Кратность);
		
		ЭтоДопЛист = (СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок);
		
		СтруктураШапкиДокумента.Вставить("РегистрацияВДопЛисте", ЭтоДопЛист);
		
		УчетНДС.АннулироватьОстаткиВходящегоНДС(
			СтруктураШапкиДокумента["ДокументОснование"],
			СтруктураШапкиДокумента["Дата"],
			Движения);
		
		ТабОснования = ПолучитьДанныеДляВходящегоНДСпоДокументу(СтруктураШапкиДокумента);
		
		Отказ = не СформироватьДвижения(СтруктураШапкиДокумента, ТабОснования, Движения);	
		
		Если не Отказ тогда
			УчетНДС.ЗарегестрироватьСчетФактуру(ДокументОбъект.Ссылка,Движения);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
				
КонецПроцедуры

Процедура ОчиститьПоляДоКорректировки(ДокументОбъект) Экспорт
	
	ОчищающаяСтруктура = Новый Структура();
	
	ОчищающаяСтруктура.Вставить("КоличествоДоКорректировки",	0);
	ОчищающаяСтруктура.Вставить("СуммаДоКорректировки",			0);
	ОчищающаяСтруктура.Вставить("СуммаНДСДоКорректировки",		0);
	ОчищающаяСтруктура.Вставить("ВсегоДоКорректировки",			0);
	
	ОчищающаяСтруктура.Вставить("СуммаНДСУвеличение",			0);
	ОчищающаяСтруктура.Вставить("СуммаНДСУменьшение",			0);
	ОчищающаяСтруктура.Вставить("ВсегоУвеличение",				0);
	ОчищающаяСтруктура.Вставить("ВсегоУменьшение",				0);
	
	ОчищающаяСтруктура.Вставить("СтавкаНДСДоКорректировки",		Перечисления.СтавкиНДС.ПустаяСсылка());
	
	Для Каждого СтрокаТаблицы Из ДокументОбъект.СоставНФА Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ОчищающаяСтруктура);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьАналитикуЗатрат(ДокументОбъект) Экспорт
	
	ОчищающаяСтруктура = Новый Структура("
		|СчетДт,
		|КЭКСчетаДебета,
		|КПССчетаДебета,
		|СубконтоДт1,
		|СубконтоДт2,
		|СубконтоДт3");
	
	ОчищающаяСтруктура.Вставить("ПроцентНДСкВычету", 100);
	
	Для Каждого СтрокаТаблицы Из ДокументОбъект.СоставНФА Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ОчищающаяСтруктура);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.РаботаСКонтрагентами
Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписание(
		Описание, 
		ДокументСсылка, 
		Форма.Элементы["Контрагент"],
		ДокументОбъект["Контрагент"],
		Форма.Элементы["ГруппаКонтрагент"]);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами 

//---
// Заполнение на основании

Процедура ЗаполнитьНаОснованииСчетФактураПолученный(Знач ДокументОснования, Объект, ЗаполнятьШапкуПоОснованию)
	
	ПричинаНалогообложения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснования, "ПричинаНалогообложения");
	
	ЭтоАванс = УчетНДСПовтИсп.Аванс(ПричинаНалогообложения);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",		ДокументОснования);
	Запрос.УстановитьПараметр("ЭтоАванс",	ЭтоАванс);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1														КАК НомерИсправления,
	|	СчетФактураПолученный.Организация,
	|	СчетФактураПолученный.ИФО,
	|	СчетФактураПолученный.Подразделение,
	|	СчетФактураПолученный.Контрагент,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его:
	|		КОГДА НЕ СчетФактураПолученный.Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			СчетФактураПолученный.Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное:
	|		КОГДА СчетФактураПолученный.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			СчетФактураПолученный.Контрагент.Наименование
	|	КОНЕЦ													КАК НаименованиеПродавца,
	|	СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.ИНН	КАК ИННПродавца,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица) ТОГДА
	|			СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.КПП
	|		ИНАЧЕ """"
	|	КОНЕЦ													КАК КПППродавца,
	|	СчетФактураПолученный.НомерПервичногоДокумента			КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.ДатаПервичногоДокумента			КАК ДатаСчетаФактуры,
	|	СчетФактураПолученный.Ссылка							КАК ИсправляемыйДокумент,
	|	СчетФактураПолученный.Договор,
	|	СчетФактураПолученный.СуммаДокумента,
	|	СчетФактураПолученный.СуммаНДС,
	|	СчетФактураПолученный.ПричинаНалогообложения,
	|	СчетФактураПолученный.ВидЦенности,
	|	СчетФактураПолученный.ВалютаДокумента,
	|	СчетФактураПолученный.КодВидаОперации,
	|	СчетФактураПолученный.СоставНФА.(
	|		НомерСтроки,
	|		НФА,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Количество											КАК КоличествоДоИзменения,
	|		СтавкаНДС,
	|		СтавкаНДС											КАК СтавкаНДСДоИзменения,
	|		СуммаНДС,
    |		СуммаНДС											КАК СуммаНДСДоИзменения,
	|		Сумма,
    |		Сумма												КАК СуммаДоИзменения,
	|		Всего,
    |		Всего 												КАК ВсегоДоИзменения,
    |		СуммаАкциза,
    |		СуммаАкциза											КАК СуммаАкцизаДоИзменения,
	|		НДСКВычету,
	|		КПСВычетКт,
	|       КФО,
	|       СчетВычетКт,
	|		Счет30304,
	|       ВЫБОР
	|			КОГДА ДокументОснование = НЕОПРЕДЕЛЕНО ТОГДА
	|				Ссылка
	|			ИНАЧЕ
	|				ДокументОснование
	|		КОНЕЦ	КАК ДокументОснование,
	|
	|		Ссылка.ВидЦенности	КАК ВидЦенности
	// Пока в документе применяется реквизит шапки
	//|		ВЫБОР
	//|			КОГДА &ЭтоАванс ТОГДА
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	//|				
	//|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) И НФА.ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ПраваПользованияИмуществом) ТОГДА
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	//|				
	//|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) ТОГДА
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.ОС)
	//|				
	//|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.Номенклатура) ТОГДА
	//|				ВЫБОР
	//|					КОГДА НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ИЛИ НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
	//|						ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	//|					ИНАЧЕ
	//|						ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Материалы)
	//|				КОНЕЦ
	//|				
	//|			ИНАЧЕ
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Прочее)
	//|				
	//|		КОНЕЦ										КАК ВидЦенности
	|	)  Как ОснованиеСоставНФА,
	|	СчетФактураПолученный.ПлатежноРасчетныеДокументы.(
    |		ДатаДокумента	КАК ДатаДокумента,
    |		НомерДокумента	КАК НомерДокумента
	|	) КАК ОснованиеПлатежноРасчетныеДокументы
	|ИЗ
	|	Документ.СчетФактураПолученный 							КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка = &Ссылка";
	
	ДанныеЗаполнения = Запрос.Выполнить().Выгрузить();
	
	Шапка		= ДанныеЗаполнения[0];
	СоставНФА	= ДанныеЗаполнения[0]["ОснованиеСоставНФА"];
	ОснованиеПлатежноРасчетныеДокументы	= ДанныеЗаполнения[0]["ОснованиеПлатежноРасчетныеДокументы"];
	
	Объект.ПлатежноРасчетныеДокументы.Загрузить(ОснованиеПлатежноРасчетныеДокументы);
	
	//
	// Аналитика затрат
	//
	Переименование = Новый Структура();
	Переименование.Вставить("ДокументОснование", "ОбъектНалогообложения");
	
	УчетНДС.ПереименоватьКолонки(СоставНФА, Переименование, "вперед");
	
	УчетНДС.ЗаполнитьАналитикуЗатрат(СоставНФА);
	
	УчетНДС.ПереименоватьКолонки(СоставНФА, Переименование, "назад");
	
	СоставНФА.Колонки.Добавить("ПроцентНДСкВычетуДоИзменения", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(6,2,ДопустимыйЗнак.Неотрицательный)));
	Колонка = СоставНФА.ВыгрузитьКолонку("ПроцентНДСкВычету");
	СоставНФА.ЗагрузитьКолонку(Колонка, "ПроцентНДСкВычетуДоИзменения");
	
	//
	// Счет расчетов
	//
	УчетНДС.ЗаполнитьСчетРасчетов(СоставНФА);
	
	
	ЗаполнитьЗначенияСвойств(Объект, Шапка);
	
	Объект.СоставНФА.Загрузить(СоставНФА);
	
КонецПРоцедуры

Процедура ЗаполнитьНаОснованииКорректировочныйСчетФактураПолученный(Знач ДокументОснования, Объект, ЗаполнятьШапкуПоОснованию)
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	1														КАК НомерИсправления,
	|	Организация				КАК Организация,
	|	ИФО						КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	Контрагент				КАК Контрагент,
	|	НаименованиеПродавца		КАК НаименованиеПродавца,
	|	ИННПродавца				КАК ИННПродавца,
	|	КПППродавца				КАК КПППродавца,
	|	НомерСчетаФактуры			КАК НомерСчетаФактуры,
	|	ДатаСчетаФактуры			КАК ДатаСчетаФактуры,
	|	Договор					КАК Договор,
	|	ПричинаНалогообложения	КАК ПричинаНалогообложения,
	|	ВалютаДокумента			КАК ВалютаДокумента,
	|	КодВидаОперации,
	|	Ссылка		КАК ИсправляемыйДокумент,
	|	СоставНФА.(
	|		НФА,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Количество				 	КАК КоличествоДоИзменения,
	|		КоличествоДоИзменения	 	КАК КоличествоДоКорректировки,
	|		Сумма,
    |		Сумма					 	КАК СуммаДоИзменения,
    |		СуммаДоИзменения		 	КАК СуммаДоКорректировки,
	|		СтавкаНДС,
	|		СтавкаНДС					КАК СтавкаНДСДоИзменения,
	|		СтавкаНДСДоИзменения	 	КАК СтавкаНДСДоКорректировки,
	|		СуммаНДС,
    |		СуммаНДС 				 	КАК СуммаНДСДоИзменения,
    |		СуммаНДСДоИзменения 	 	КАК СуммаНДСДоКорректировки,
	|		Всего,
    |		Всего					 	КАК ВсегоДоИзменения,
    |		ВсегоДоИзменения		 	КАК ВсегоДоКорректировки,
    |		СуммаАкциза,
    |		СуммаАкциза	 				КАК СуммаАкцизаДоИзменения,
    |		СуммаАкцизаДоИзменения	 	КАК СуммаАкцизаДоКорректировки,
	|		НДСКВычету,
	|		КПСВычетКт,
	|       КФО,
	|       СчетВычетКт,
	|		Счет30304,
	|       ДокументОснование,
	|
	|		ПроцентНДСкВычету	КАК ПроцентНДСкВычетуДоИзменения,
	|		ПроцентНДСкВычету,
	|		СчетДт,
	|		КЭКСчетаДебета,
	|		КПССчетаДебета,
	|		СубконтоДт1,
	|		СубконтоДт2,
	|		СубконтоДт3,
	|
	|		СчетРасчетов
	|	)  Как ОснованиеСоставНФА,
	|	ПлатежноРасчетныеДокументы.(
    |		ДатаДокумента	КАК ДатаДокумента,
    |		НомерДокумента	КАК НомерДокумента
	|	) КАК ОснованиеПлатежноРасчетныеДокументы
	|ИЗ
	|	Документ.КорректировочныйСчетФактураПолученный
	|ГДЕ
	|	Ссылка = &Ссылка";
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ДокументОснования);
	
	Основание = Запрос.Выполнить().Выбрать();
	Основание.Следующий();
	Объект.СоставНФА.Очистить();
	Если ЗаполнятьШапкуПоОснованию тогда
		ЗаполнитьЗначенияСвойств(Объект, Основание);
	КонецЕсли;	
	
	НФА = Основание.ОснованиеСоставНФА.Выбрать();
	
	Пока НФА.Следующий() Цикл
		СтрокаНФА = Объект.СоставНФА.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНФА, НФА);
	КонецЦикла;	
	
	ИменаПолей = Новый Массив();
	ИменаПолей.Добавить("СуммаНДС");
	ИменаПолей.Добавить("Всего");
	
	УчетНДС.ЗаполнитьСуммыУвеличенияУменьшения(Объект.СоставНФА, ИменаПолей);
	
	Объект.ПлатежноРасчетныеДокументы.Очистить();
	Выборка = Основание.ОснованиеПлатежноРасчетныеДокументы.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПлатежноРасчетныеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПРоцедуры

Процедура ЗаполнитьНаОснованииИсправительныйСчетФактураПолученный(Знач ДокументОснования, Объект, ЗаполнятьШапкуПоОснованию)
	
	ЭтоКорректировка = УчетНДС.ЭтоКорректировка(ДокументОснования);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураПолученный.Организация				КАК Организация,
	|	СчетФактураПолученный.ИФО						КАК ИФО,
	|	СчетФактураПолученный.Подразделение				КАК Подразделение,
	|	СчетФактураПолученный.Контрагент				КАК Контрагент,
	|	СчетФактураПолученный.НаименованиеПродавца		КАК НаименованиеПродавца,
	|	СчетФактураПолученный.ИННПродавца				КАК ИННПродавца,
	|	СчетФактураПолученный.КПППродавца				КАК КПППродавца,
	|	СчетФактураПолученный.НомерСчетаФактуры			КАК НомерСчетаФактуры,
	|	СчетФактураПолученный.ДатаСчетаФактуры			КАК ДатаСчетаФактуры,
	|	СчетФактураПолученный.Договор					КАК Договор,
	|	СчетФактураПолученный.ПричинаНалогообложения	КАК ПричинаНалогообложения,
	|	СчетФактураПолученный.ВалютаДокумента			КАК ВалютаДокумента,
	|	СчетФактураПолученный.НомерИсправления + 1		КАК НомерИсправления,
	|	СчетФактураПолученный.ИсправляемыйДокумент		КАК ИсправляемыйДокумент,
	|	КодВидаОперации,
	|	СчетФактураПолученный.СоставНФА.(
	|		НФА,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		Всего,
	|		СуммаАкциза,
	
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				КоличествоДоИзменения
	|			ИНАЧЕ
	|				Количество
	|		КОНЕЦ							КАК КоличествоДоИзменения,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СуммаДоИзменения
	|			ИНАЧЕ
	|				Сумма
	|		КОНЕЦ							КАК СуммаДоИзменения,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СтавкаНДСДоИзменения
	|			ИНАЧЕ
	|				СтавкаНДС
	|		КОНЕЦ							КАК СтавкаНДСДоИзменения,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СуммаНДСДоИзменения
	|			ИНАЧЕ
	|				СуммаНДС
	|		КОНЕЦ							КАК СуммаНДСДоИзменения,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				ВсегоДоИзменения
	|			ИНАЧЕ
	|				Всего
	|		КОНЕЦ							КАК ВсегоДоИзменения,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СуммаАкцизаДоИзменения
	|			ИНАЧЕ
	|				СуммаАкциза
	|		КОНЕЦ							КАК СуммаАкцизаДоИзменения,
	|
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				КоличествоДоКорректировки
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ							КАК КоличествоДоКорректировки,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СуммаДоКорректировки
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ							КАК СуммаДоКорректировки,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СтавкаНДСДоКорректировки
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|		КОНЕЦ							КАК СтавкаНДСДоКорректировки,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СуммаНДСДоКорректировки
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ							КАК СуммаНДСДоКорректировки,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				ВсегоДоКорректировки
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ							КАК ВсегоДоКорректировки,
	|		ВЫБОР
	|			КОГДА &ЭтоКорректировка ТОГДА
	|				СуммаАкцизаДоКорректировки
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ							КАК СуммаАкцизаДоКорректировки,
	|
	|		НДСКВычету,
	|		КПСВычетКт,
	|       КФО,
	|       СчетВычетКт,
	|		Счет30304,
	|       ДокументОснование,
	|
	|		ПроцентНДСкВычетуДоИзменения,
	|		ПроцентНДСкВычету,
	|		СчетДт,
	|		КЭКСчетаДебета,
	|		КПССчетаДебета,
	|		СубконтоДт1,
	|		СубконтоДт2,
	|		СубконтоДт3,
	|
	|		СчетРасчетов
	|	)  Как ОснованиеСоставНФА,
	|	ПлатежноРасчетныеДокументы.(
    |		ДатаДокумента	КАК ДатаДокумента,
    |		НомерДокумента	КАК НомерДокумента
	|	) КАК ОснованиеПлатежноРасчетныеДокументы
	|ИЗ
	|	Документ.ИсправительныйСчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка = &Ссылка";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка",ДокументОснования);
	Запрос.УстановитьПараметр("ЭтоКорректировка", ЭтоКорректировка);
	
	Основание = Запрос.Выполнить().Выбрать();
	Основание.Следующий();
	Объект.СоставНФА.Очистить();
	Если ЗаполнятьШапкуПоОснованию тогда
		ЗаполнитьЗначенияСвойств(Объект, Основание);
	КонецЕсли;	
	
	НФА = Основание.ОснованиеСоставНФА.Выбрать();
	
	Пока НФА.Следующий() Цикл
		СтрокаНФА = Объект.СоставНФА.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНФА, НФА);
	КонецЦикла;
	
	Если ЭтоКорректировка Тогда
		ИменаПолей = Новый Массив();
		ИменаПолей.Добавить("СуммаНДС");
		ИменаПолей.Добавить("Всего");
		
		УчетНДС.ЗаполнитьСуммыУвеличенияУменьшения(Объект.СоставНФА, ИменаПолей);
	КонецЕсли;
	
	Объект.ПлатежноРасчетныеДокументы.Очистить();
	Выборка = Основание.ОснованиеПлатежноРасчетныеДокументы.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПлатежноРасчетныеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПРоцедуры

Процедура ЗаполнитьНаОснованииПоступлениеМЗ(Знач ДокументОснования, Объект, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры = "ТолькоДозаполнитьПоСчетуФактуре" Тогда
		ДозаполнитьПоСчетуФактуре(Объект, Объект.ДокументОснование);
		
		Возврат;
	КонецЕсли;
	
	ЭтоКорректировка = Ложь;
	
	РезультатыПоиска = УчетНДС.НайтиПредыдущийСчетФактуруПоступления(ДокументОснования);
	
	Если РезультатыПоиска <> Неопределено Тогда
		ЭтоКорректировка = УчетНДС.ЭтоКорректировка(РезультатыПоиска.Ссылка);
	КонецЕсли;
	
	РеквизитыОперацииОснования = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(
		ДокументОснования,
		"СчетУчетаНДСКРаспределению,СчетУчетаНДС");
	
	Счет30304 = ПланыСчетов.ЕПСБУ.НайтиПоКоду("303.04");
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("ДокументОснованиеСсылка",		ДокументОснования);
	ЗапросПоиск.УстановитьПараметр("СчетУчетаНДСКРаспределению",	РеквизитыОперацииОснования["СчетУчетаНДСКРаспределению"]);
	ЗапросПоиск.УстановитьПараметр("СчетУчетаНДС",					РеквизитыОперацииОснования["СчетУчетаНДС"]);
	ЗапросПоиск.УстановитьПараметр("Счет30304",						Счет30304);
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка											КАК ДокументКорректировки,
	|	Дата											КАК Дата,
	|	Организация										КАК Организация,
	|	ИФО												КАК ИФО,
	|	Подразделение									КАК Подразделение,
	|	Контрагент										КАК Контрагент,
	|	Договор											КАК Договор,
	|	ВалютаДокумента									КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Договор.ТипДоговораНДС = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровДляНДС.АгентскийДоговор) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.ПокупкаНалоговыйАгент)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.Покупка)
	|	КОНЕЦ											КАК ПричинаНалогообложения,
	|	ВЫБОР
	|		КОГДА Договор.ТипДоговораНДС = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровДляНДС.АгентскийДоговор) ТОГДА
	|			""06""
	|		ИНАЧЕ
	|			""01""
	|	КОНЕЦ											КАК КодВидаОперации
	|ИЗ
	|	Документ.ПоступлениеМЗ
	|ГДЕ 
	|	Ссылка = &ДокументОснованиеСсылка
	|;";
	
	Если ЭтоКорректировка Тогда
		// Вариант 2. Заполнение ИСФ(к)
		//
		// Заполняем три набора полей:
		//	- Поле<ДоКорректировки>
		//	- Поле<ДоИзменения>
		//	- Поле
		
		ЗапросПоиск.Текст = ЗапросПоиск.Текст + "
		|////////////////////////////////////////////////////////////////////////////////
		|// [1](2). Данные табличной части СоставНФА
		|//
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка 											КАК ДокументОснование,
		|	Номенклатура									КАК НФА,
		|	ЕдиницаИзмерения								КАК ЕдиницаИзмерения,
		|	Ссылка.ПринятьНДСКВычету						КАК НДСКВычету,
		|	НДСКРаспределению								КАК НДСКРаспределению,
		|	КФО												КАК КФО,
		|	ВЫБОР
		|		КОГДА Ссылка.КПСРасчетов <> ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка) ТОГДА
		|			Ссылка.КПСРасчетов
		|		ИНАЧЕ
		|			КПС
		|	КОНЕЦ											КАК КПСВычетКт,
		|	ВЫБОР
		|		КОГДА НДСКРаспределению ТОГДА
		|			&СчетУчетаНДСКРаспределению
		|		ИНАЧЕ
		|			&СчетУчетаНДС
		|	КОНЕЦ											КАК СчетВычетКт,
		|	&Счет30304										КАК Счет30304,
		|	
		|	// До корректировки
		|	СтавкаНДС										КАК СтавкаНДСДоКорректировки,
		|	КоличествоДоКорректировки						КАК КоличествоДоКорректировки,
		|	ВЫБОР
		|		КОГДА КоличествоДоКорректировки <> 0 И Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ((СуммаДоКорректировки - СуммаНДСДоКорректировки) / КоличествоДоКорректировки КАК Число(15,2))
		|			
		|		КОГДА КоличествоДоКорректировки <> 0 И НЕ Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ(СуммаДоКорректировки / КоличествоДоКорректировки КАК Число(15,2))
		|			
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ											КАК ЦенаДоКорректировки,
		|	ВЫБОР
		|		КОГДА Ссылка.СуммаВключаетНДС ТОГДА
		|			СуммаДоКорректировки - СуммаНДСДоКорректировки
		|		ИНАЧЕ
		|			СуммаДоКорректировки
		|	КОНЕЦ											КАК СуммаДоКорректировки,
		|	СуммаНДСДоКорректировки							КАК СуммаНДСДоКорректировки,
		|	ВсегоДоКорректировки							КАК ВсегоДоКорректировки,
		|	
		|	// После корректировки
		|	СтавкаНДС										КАК СтавкаНДСДоИзменения,
		|	Количество										КАК КоличествоДоИзменения,
		|	ВЫБОР
		|		КОГДА Количество <> 0 И Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ((Сумма - СуммаНДС) / Количество КАК Число(15,2))
		|			
		|		КОГДА Количество <> 0 И НЕ Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ(Сумма / Количество КАК Число(15,2))
		|			
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ											КАК ЦенаДоИзменения,
		|	ВЫБОР
		|		КОГДА Ссылка.СуммаВключаетНДС ТОГДА
		|			Сумма - СуммаНДС
		|		ИНАЧЕ
		|			Сумма
		|	КОНЕЦ											КАК СуммаДоИзменения,
		|	СуммаНДС										КАК СуммаНДСДоИзменения,
		|	Всего											КАК ВсегоДоИзменения,
		|	
		|	// После корректировки (дубль)
		|	СтавкаНДС										КАК СтавкаНДС,
		|	Количество										КАК Количество,
		|	ВЫБОР
		|		КОГДА Количество <> 0 И Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ((Сумма - СуммаНДС) / Количество КАК Число(15,2))
		|			
		|		КОГДА Количество <> 0 И НЕ Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ(Сумма / Количество КАК Число(15,2))
		|			
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ											КАК Цена,
		|	ВЫБОР
		|		КОГДА Ссылка.СуммаВключаетНДС ТОГДА
		|			Сумма - СуммаНДС
		|		ИНАЧЕ
		|			Сумма
		|	КОНЕЦ											КАК Сумма,
		|	СуммаНДС										КАК СуммаНДС,
		|	Всего											КАК Всего
		|ИЗ
		|	Документ.ПоступлениеМЗ.Материалы КАК Материалы
		|ГДЕ 
		|	Ссылка = &ДокументОснованиеСсылка
		|;";
		
	Иначе
		// Вариант 1. Заполнение ИСФ(о)
		//
		// Заполняем два набора полей:
		//	- Поле<ДоИзменения>
		//	- Поле
		
		ЗапросПоиск.Текст = ЗапросПоиск.Текст + "
		|////////////////////////////////////////////////////////////////////////////////
		|// [1](1). Данные табличной части СоставНФА
		|//
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Ссылка 											КАК ДокументОснование,
		|	Номенклатура									КАК НФА,
		|	ЕдиницаИзмерения								КАК ЕдиницаИзмерения,
		|	Ссылка.ПринятьНДСКВычету						КАК НДСКВычету,
		|	НДСКРаспределению								КАК НДСКРаспределению,
		|	КФО												КАК КФО,
		|	ВЫБОР
		|		КОГДА Ссылка.КПСРасчетов <> ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка) ТОГДА
		|			Ссылка.КПСРасчетов
		|		ИНАЧЕ
		|			КПС
		|	КОНЕЦ											КАК КПСВычетКт,
		|	ВЫБОР
		|		КОГДА НДСКРаспределению ТОГДА
		|			&СчетУчетаНДСКРаспределению
		|		ИНАЧЕ
		|			&СчетУчетаНДС
		|	КОНЕЦ											КАК СчетВычетКт,
		|	&Счет30304										КАК Счет30304,
		|	
		|	// До корректировки
		|	СтавкаНДС										КАК СтавкаНДСДоИзменения,
		|	КоличествоДоКорректировки						КАК КоличествоДоИзменения,
		|	ВЫБОР
		|		КОГДА КоличествоДоКорректировки <> 0 И Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ((СуммаДоКорректировки - СуммаНДСДоКорректировки) / КоличествоДоКорректировки КАК Число(15,2))
		|			
		|		КОГДА КоличествоДоКорректировки <> 0 И НЕ Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ(СуммаДоКорректировки / КоличествоДоКорректировки КАК Число(15,2))
		|			
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ											КАК ЦенаДоИзменения,
		|	ВЫБОР
		|		КОГДА Ссылка.СуммаВключаетНДС ТОГДА
		|			СуммаДоКорректировки - СуммаНДСДоКорректировки
		|		ИНАЧЕ
		|			СуммаДоКорректировки
		|	КОНЕЦ											КАК СуммаДоИзменения,
		|	СуммаНДСДоКорректировки							КАК СуммаНДСДоИзменения,
		|	ВсегоДоКорректировки							КАК ВсегоДоИзменения,
		|	
		|	// После корректировки
		|	СтавкаНДС										КАК СтавкаНДС,
		|	Количество										КАК Количество,
		|	ВЫБОР
		|		КОГДА Количество <> 0 И Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ((Сумма - СуммаНДС) / Количество КАК Число(15,2))
		|			
		|		КОГДА Количество <> 0 И НЕ Ссылка.СуммаВключаетНДС ТОГДА
		|			ВЫРАЗИТЬ(Сумма / Количество КАК Число(15,2))
		|			
		|		ИНАЧЕ
		|			0
		|	КОНЕЦ											КАК Цена,
		|	ВЫБОР
		|		КОГДА Ссылка.СуммаВключаетНДС ТОГДА
		|			Сумма - СуммаНДС
		|		ИНАЧЕ
		|			Сумма
		|	КОНЕЦ											КАК Сумма,
		|	СуммаНДС										КАК СуммаНДС,
		|	Всего											КАК Всего
		|ИЗ
		|	Документ.ПоступлениеМЗ.Материалы КАК Материалы
		|ГДЕ 
		|	Ссылка = &ДокументОснованиеСсылка
		|;";
	КонецЕсли;
	
	РезультатыЗапросов = ЗапросПоиск.ВыполнитьПакет();
	
	// [0]. Данные шапки
	Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатыЗапросов[0].Выгрузить()[0]);
	ЗаполнитьЗначенияСвойств(Объект, Шапка);
	
	// [1]. Данные табличной части СоставНФА
	Объект.СоставНФА.Загрузить(РезультатыЗапросов[1].Выгрузить());
	
	РезультатыПоиска = УчетНДС.НайтиПредыдущийСчетФактуруПоступления(ДокументОснования);
	
	Если РезультатыПоиска <> Неопределено Тогда
		ДозаполнитьПоСчетуФактуре(Объект, РезультатыПоиска.Ссылка);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.СоставНФА Цикл
		УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(СтрокаТаблицы, "СуммаНДС");
		УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(СтрокаТаблицы, "Всего");
		
		СтрокаТаблицы.ПроцентНДСкВычетуДоИзменения = 100;
	КонецЦикла;
	
КонецПроцедуры


Процедура ДозаполнитьПоСчетуФактуре(ДокументОбъект, СчетФактура)
	
	Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
		Возврат;
	КонецЕсли;
	
	// Реквизиты шапки
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		// Частичное заполнение, аналогичное ЗаполнитьНаОснованииСчетФактураПолученный
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "
			|НомерПервичногоДокумента,
			|ДатаПервичногоДокумента,
			|ПричинаНалогообложения,
			|ВалютаДокумента,
			|КодВидаОперации");
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		
		ДокументОбъект.НомерСчетаФактуры = ЗначенияРеквизитов.НомерПервичногоДокумента;
		ДокументОбъект.ДатаСчетаФактуры = ЗначенияРеквизитов.ДатаПервичногоДокумента;
		
		ДокументОбъект.ДокументОснование = СчетФактура;
		ДокументОбъект.ИсправляемыйДокумент = СчетФактура;
		ДокументОбъект.НомерИсправления = 1;
		
		Для Каждого СтрокаТаблицы Из ДокументОбъект.СоставНФА Цикл
			СтрокаТаблицы.ПроцентНДСкВычетуДоИзменения = 100;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(СчетФактура) = Тип("ДокументСсылка.ИсправительныйСчетФактураПолученный") Тогда
		// Частичное заполнение, аналогичное ЗаполнитьНаОснованииИсправительныйСчетФактураПолученный
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "
			|НомерСчетаФактуры,
			|ДатаСчетаФактуры,
			|ПричинаНалогообложения,
			|ВалютаДокумента,
			|НомерИсправления,
			|ИсправляемыйДокумент,
			|КодВидаОперации");
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		
		ДокументОбъект.ДокументОснование = СчетФактура;
		ДокументОбъект.НомерИсправления = ЗначенияРеквизитов.НомерИсправления + 1;
		
	ИначеЕсли ТипЗнч(СчетФактура) = Тип("ДокументСсылка.КорректировочныйСчетФактураПолученный") Тогда
		// Частичное заполнение, аналогичное ЗаполнитьНаОснованииКорректировочныйСчетФактураПолученный
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "
			|НомерСчетаФактуры,
			|ДатаСчетаФактуры,
			|ПричинаНалогообложения,
			|ВалютаДокумента,
			|КодВидаОперации");
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		
		ДокументОбъект.ДокументОснование = СчетФактура;
		ДокументОбъект.ИсправляемыйДокумент = СчетФактура;
		ДокументОбъект.НомерИсправления = 1;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	// Табличные части
	
	УчетНДС.ЗаполнитьПлатежноРасчетныеДокументы(ДокументОбъект, СчетФактура);
	
КонецПроцедуры


Процедура ЗаполнитьРеквизитыСторонСделки(ДокументОбъект) Экспорт
	
	ШапкаДокумента = Новый Структура("
		|Дата,
		|Контрагент,
		|Организация,
		|Подразделение,
		|ПричинаНалогообложения");
	
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, ДокументОбъект);
	
	Если НЕ УчетНДС.ЗаполненыОбязательныеРеквизитыДляОпределенияСторонСделки(ШапкаДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = УчетНДС.РасширитьШапкуДокументаДляОпределенияПродавцаПокупателяГрузоотправителяГрузополучателя(ШапкаДокумента);
	
	ОбщаяКонтактнаяИнформация = УчетНДС.ПолучитьОбщуюКонтактнуюИнформациюПродавцаПокупателяГрузоотправителяГрузополучателя(
		Данные["СписокОбъектовДляОпределенияАдресов"]);
	
	СтороныСделки = УчетНДС.ОпределитьПродавцаПокупателяГрузоотправителяГрузополучателя(
		Данные["ШапкаДокументаРасширенная"],
		ОбщаяКонтактнаяИнформация);
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("НаименованиеПродавца",	СтороныСделки.Продавец.Наименование);
	Параметры.Вставить("АдресПродавца",			СтороныСделки.Продавец.Адрес.Представление);
	Параметры.Вставить("ИННПродавца",			СтороныСделки.Продавец.ИНН);
	Параметры.Вставить("КПППродавца",			СтороныСделки.Продавец.КПП);
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Параметры);
	
КонецПроцедуры

//---
// Движения

Функция СформироватьДвижения(СтруктураШапкиДокумента, ТаблицаДанных, Движения)
	
	Результат = Истина;
	//СчетРаспределения = ПланыСчетов.ЕПСБУ.НайтиПоКоду("210.Н1");
	Если    СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.ПокупкаНалоговыйАгент 
		ИЛИ СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.ПокупкаУНерезидентаНалоговыйАгент Тогда
		//---
		// Совместимость с БГУ1
		//---
		// Если это счет-фактура налогового агента, то следует начислить НДС в бюджет и зарегистрироваться
		// в книге продаж или доп. листе книги продаж
		Для каждого ТекСтрока из ТаблицаДанных Цикл
			Если СтруктураШапкиДокумента.РегистрацияВДопЛисте Тогда
				Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			Иначе	
				Если НЕ СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;
		
		Возврат Истина;
	ИначеЕсли СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.АвансВыданный Тогда
		Для каждого ТекСтрока из ТаблицаДанных Цикл
			
			Если СтруктураШапкиДокумента.РегистрацияВДопЛисте Тогда
				Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			Иначе
				Если НЕ СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			КонецЕсли;	
			
			СформироватьДвиженияПоРН_ИсходящийНДС(Движения, СтруктураШапкиДокумента, ТекСтрока);
		КонецЦикла;	
		
		Возврат Истина;
	КонецЕсли;	
	
//******************************************	
	
	Для каждого ТекСтрока из ТаблицаДанных Цикл
		// Если ВидЦенности = ОС, то все ложим либо в РН: НДС_Входящий, либо РН: НДС_КРаспределению
		
		//Если ТекСтрока.ВидЦенности = Перечисления.ВидыЦенностейНДС.ОС Тогда
		//	Если ТекСтрока["НДСКРаспределению"] Тогда
		//		Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДСКРаспределению, СтруктураШапкиДокумента, ТекСтрока) Тогда
		//			Возврат Ложь;
		//		КонецЕсли;	
		//	Иначе	
		//		//ТекДвижения = ДвиженияВходящийНДС;
		//		Если СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок Тогда
		//			Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
		//				Возврат Ложь;
		//			КонецЕсли;	
		//		Иначе
		//			Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДС, СтруктураШапкиДокумента, ТекСтрока) Тогда
		//				Возврат Ложь;
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	КонецЕсли;	
		//	
		//ИначеЕсли  СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.Покупка или
		Если  СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.Покупка или
			СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.ВозвратОтПокупателя Тогда
			
			Если ТекСтрока["НДСКРаспределению"] Тогда
				Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДСКРаспределению, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			Иначе	
				Если СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок Тогда
					Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
						Возврат Ложь;
					КонецЕсли;	
				Иначе	
					Если НЕ СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
						Возврат Ложь;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			
		Иначе	
			Если ТекСтрока["НДСКРаспределению"] Тогда
				Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДСКРаспределению, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			Иначе	
				Если СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок Тогда
					Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
						Возврат Ложь;
					КонецЕсли;	
				Иначе
					// Политика "По оплате", нет регистрации в доп. листе, НДС не к распределению.
					// Надо еще проверить если это поступление через подотчетное лицо, то будем считать, что
					// поставка оплачена
					Если БухгалтерскийУчет.СчетВИерархии(ТекСтрока.СчетРасчетов, "208.00") Тогда
						Если НЕ СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
							Возврат Ложь;
						КонецЕсли;	
					Иначе
						Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДС, СтруктураШапкиДокумента, ТекСтрока) Тогда
							Возврат Ложь;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат Истина;
КонецФункции	

Функция СформироватьДвижениеПоРН_ВходящийНДС(Движения, СтруктураШапкиДокумента, ТекСтрока)
	
	// Прежние движения уже отсторнированы, поэтому здесь сторно не формируем
	
	СуммыДвижения = Новый Структура();
	СуммыДвижения.Вставить("СуммаБезНДС",			ТекСтрока.Сумма);
	СуммыДвижения.Вставить("СуммаБезНДСВалютная",	ТекСтрока.СуммаВалютная);
	СуммыДвижения.Вставить("СуммаНДС",				ТекСтрока.СуммаНДС);
	СуммыДвижения.Вставить("СуммаНДСВалютная",		ТекСтрока.СуммаНДСВалютная);
	
	Если СуммыДвижения.СуммаБезНДС = 0
		И СуммыДвижения.СуммаБезНДСВалютная = 0
		И СуммыДвижения.СуммаНДС = 0
		И СуммыДвижения.СуммаНДСВалютная = 0
		Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Движение = Движения.Добавить();
	
	ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
	
	ЗаполнитьЗначенияСвойств(Движение, СуммыДвижения);
	
	Движение.ВидДвижения            = ВидДвиженияНакопления.Приход;
	Движение.Период                 = СтруктураШапкиДокумента.Дата;
	Движение.Организация            = СтруктураШапкиДокумента.Организация;
	Движение.СчетФактура            = СтруктураШапкиДокумента.ИсправляемыйДокумент;
	Движение.ДокументКорректировки  = СтруктураШапкиДокумента.Ссылка;
	Движение.ОбъектНалогообложения  = ?(ТекСтрока.ОбъектНалогообложения = Неопределено,СтруктураШапкиДокумента.Ссылка,ТекСтрока.ОбъектНалогообложения);
	Движение.ПричинаНалогообложения = СтруктураШапкиДокумента.ПричинаНалогообложения;
	
	Возврат Истина;
КонецФункции	

Функция СформироватьДвиженияПоРН_ИсходящийНДС(Движения, СтруктураШапкиДокумента, ТекСтрока)
	Результат = Истина;
	
	Движение = Движения.ИсходящийНДС.Добавить();
	ЗаполнитьЗначенияСвойств(Движение, СтруктураШапкиДокумента, "Организация, ПричинаНалогообложения");
	ЗаполнитьЗначенияСвойств(Движение, ТекСтрока, "КФО, СтавкаНДС, СуммаБезНДС, СуммаНДС, СуммаБезНДСВалютная, СуммаНДСВалютная");
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("СчетРасчетов",		СтруктураШапкиДокумента.СчетРасчетовАванс);
	ЗначенияПараметров.Вставить("КПССчетРасчетов",	ТекСтрока.КПСВычетКт);
	
	ЗаполнитьЗначенияСвойств(Движение, ЗначенияПараметров);
	
	Движение.ВидДвижения            = ВидДвиженияНакопления.Приход;
	Движение.Период                 = СтруктураШапкиДокумента.Дата;
	
	Движение.СчетФактура            = СтруктураШапкиДокумента.Ссылка;
	Движение.ОбъектНалогообложения  = ?(ТекСтрока.ОбъектНалогообложения = Неопределено,СтруктураШапкиДокумента.Ссылка,ТекСтрока.ОбъектНалогообложения);
	
	Движение.СчетДебета             = ТекСтрока.СчетКредита;
	Движение.КОСГУСчетДебета        = БухгалтерскийУчет.КЭКСчета(СтруктураШапкиДокумента.Организация, СтруктураШапкиДокумента.ИФО, ТекСтрока.КФО, СтруктураШапкиДокумента.Дата, Движение.СчетДебета, "Дт");
	
	Возврат Результат;
КонецФункции	

Функция СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока)
	
	СуммыСторно = ПолучитьСуммыСторно(ТекСтрока);
	
	Если СуммыСторно <> Неопределено Тогда
		
		Если ТекСтрока.МестоРегистрацииСторно = Перечисления.МестаРегистрацииСчетовФактур.КнигаПокупок тогда
			ДвижениеСторно = Движения.КнигаПокупок.Добавить();
		Иначе
			ДвижениеСторно = Движения.КнигаПродаж.Добавить();
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, ТекСтрока);
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, СтруктураШапкиДокумента, "Организация, ПричинаНалогообложения");
		ДвижениеСторно.Период      = СтруктураШапкиДокумента.Дата;
		ДвижениеСторно.СчетФактура = СтруктураШапкиДокумента.ДокументОснование;
		ДвижениеСторно.КодВидаОперации = СтруктураШапкиДокумента.КодВидаОперации;
		ДвижениеСторно.СтавкаНДС = ТекСтрока.СтавкаНДСДоИзменения;
		
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, СуммыСторно);
		
	КонецЕсли;
	
	СуммыДвижения = ПолучитьСуммыДвижения(ТекСтрока, СтруктураШапкиДокумента);
	
	Если СуммыДвижения <> Неопределено Тогда
		
		Если ТекСтрока.МестоРегистрацииДвижения = Перечисления.МестаРегистрацииСчетовФактур.КнигаПокупок тогда
			Движение = Движения.КнигаПокупок.Добавить();
		Иначе
			Движение = Движения.КнигаПродаж.Добавить();
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
		ЗаполнитьЗначенияСвойств(Движение, СтруктураШапкиДокумента, "Организация, ПричинаНалогообложения");
		Движение.Период      = СтруктураШапкиДокумента.Дата;
		Движение.СчетФактура = СтруктураШапкиДокумента.Ссылка;
		Движение.КодВидаОперации = СтруктураШапкиДокумента.КодВидаОперации;
		
		ЗаполнитьЗначенияСвойств(Движение, СуммыДвижения);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	

Функция СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока)
	
	СуммыСторно = ПолучитьСуммыСторно(ТекСтрока);
	
	Если СуммыСторно <> Неопределено Тогда
		
		Если ТекСтрока.МестоРегистрацииСторно = Перечисления.МестаРегистрацииСчетовФактур.КнигаПокупок тогда
			ДвижениеСторно = Движения.ДополнительныеЛистыКнигиПокупок.Добавить();
		Иначе
			ДвижениеСторно = Движения.ДополнительныеЛистыКнигиПродаж.Добавить();
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, ТекСтрока);
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, СтруктураШапкиДокумента, "Организация, ПричинаНалогообложения, КорректируемыйПериод");
		ДвижениеСторно.Период      = СтруктураШапкиДокумента.Дата;
		ДвижениеСторно.СчетФактура = СтруктураШапкиДокумента.ДокументОснование;
		ДвижениеСторно.СтавкаНДС = ТекСтрока.СтавкаНДСДоИзменения;
		
		ЗаполнитьЗначенияСвойств(ДвижениеСторно, СуммыСторно);
		
	КонецЕсли;
	
	СуммыДвижения = ПолучитьСуммыДвижения(ТекСтрока, СтруктураШапкиДокумента);
	
	Если СуммыДвижения <> Неопределено Тогда
		
		Если ТекСтрока.МестоРегистрацииДвижения = Перечисления.МестаРегистрацииСчетовФактур.КнигаПокупок тогда
			Движение	= Движения.ДополнительныеЛистыКнигиПокупок.Добавить();
		Иначе
			Движение	= Движения.ДополнительныеЛистыКнигиПродаж.Добавить();
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
		ЗаполнитьЗначенияСвойств(Движение, СтруктураШапкиДокумента, "Организация, ПричинаНалогообложения, КорректируемыйПериод");
		Движение.Период      = СтруктураШапкиДокумента.Дата;
		Движение.СчетФактура = СтруктураШапкиДокумента.Ссылка;
		Движение.КодВидаОперации = СтруктураШапкиДокумента.КодВидаОперации;
		
		ЗаполнитьЗначенияСвойств(Движение, СуммыДвижения);
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	

Функция ПолучитьДанныеДляВходящегоНДСпоДокументу(СтруктураШапкиДокумента)
	
	ДокументСсылка		= СтруктураШапкиДокумента.Ссылка;
	Курс				= СтруктураШапкиДокумента.Курс;
	Кратность			= СтруктураШапкиДокумента.Кратность;
	ЭтоКорректировка	= СтруктураШапкиДокумента.ЭтоКорректировка;
	
	СчетаНДСКРаспределению = Новый Массив();
	Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("210.Н1");
	Если ЗначениеЗаполнено(Счет) Тогда
		СчетаНДСКРаспределению.Добавить(Счет);
	КонецЕсли;
	Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("210.Н2");
	Если ЗначениеЗаполнено(Счет) Тогда
		СчетаНДСКРаспределению.Добавить(Счет);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументСсылка",					ДокументСсылка);
	Запрос.УстановитьПараметр("Курс",							?(ЗначениеЗаполнено(Курс), Курс, 1));
	Запрос.УстановитьПараметр("Кратность",						?(ЗначениеЗаполнено(Кратность), Кратность, 1));
	Запрос.УстановитьПараметр("ЗаполнитьВалютныеСуммы",			УчетНДС.СледуетЗаполнитьВалютныеСуммы());
	Запрос.УстановитьПараметр("ЭтоКорректировка",				ЭтоКорректировка);
	Запрос.УстановитьПараметр("СчетаНДСКРаспределению",			СчетаНДСКРаспределению);
	Запрос.УстановитьПараметр("ПричиныНалогообложенияАванс",	УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияАванс());
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Общая таблица для движений по всем регистрам
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировка И ВсегоДоКорректировки > ВсегоДоИзменения ТОГДА
	|			// Исправляемая полученная корректировка была на уменьшение,
	|			// и поэтому была зарегистрирована в книге продаж
	|			ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПродаж)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПокупок)
	|	КОНЕЦ										КАК МестоРегистрацииСторно,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировка И ВсегоДоИзменения > Всего ТОГДА
	|			// Данное исправление полученной корректировки на уменьшение,
	|			// и поэтому должно быть зарегистрировано в книге продаж
	|			ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПродаж)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПокупок)
	|	КОНЕЦ										КАК МестоРегистрацииДвижения,
	|
	|	НомерСтроки									КАК НомерСтроки,
	|	НДСКВычету									КАК НДСКВычету,
	|	НФА											КАК НФА,
	|
	|		ВЫБОР
	|			КОГДА Ссылка.ПричинаНалогообложения В(&ПричиныНалогообложенияАванс) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|				
	|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) И НФА.ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ПраваПользованияИмуществом) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	|				
	|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) ТОГДА
	|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.ОС)
	|				
	|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.Номенклатура) ТОГДА
	|				ВЫБОР
	|					КОГДА НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ИЛИ НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
	|						ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	|					ИНАЧЕ
	|						ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Материалы)
	|				КОНЕЦ
	|				
	|			ИНАЧЕ
	|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Прочее)
	|				
	|		КОНЕЦ										КАК ВидЦенности,
	|
	|	СоставНФА.ДокументОснование					КАК ОбъектНалогообложения,
	|	СоставНФА.ДокументОснование.Дата			КАК ДатаОснования,
	|	СоставНФА.СчетВычетКт						КАК СчетКредита,
	|	СоставНФА.КФО								КАК КФО,
	|	СоставНФА.СчетРасчетов						КАК СчетРасчетов,
	|	СоставНФА.КПСВычетКт						КАК КПССчетРасчетов,
	|	ВЫБОР
	|		КОГДА СоставНФА.СчетВычетКт В(&СчетаНДСКРаспределению) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ										КАК НДСКРаспределению,
	|	
	|	СтавкаНДС																КАК СтавкаНДС,
	|	СтавкаНДСДоИзменения													КАК СтавкаНДСДоИзменения,
	|	СтавкаНДСДоКорректировки												КАК СтавкаНДСДоКорректировки,
	|	ВЫРАЗИТЬ(СуммаДоКорректировки * &Курс / &Кратность КАК ЧИСЛО(15,2))			КАК СуммаДоКорректировки,
	|	ВЫРАЗИТЬ(СуммаДоИзменения * &Курс / &Кратность КАК ЧИСЛО(15,2))				КАК СуммаДоИзменения,
	|	ВЫРАЗИТЬ(Сумма * &Курс / &Кратность КАК ЧИСЛО(15,2))						КАК Сумма,
	|	ВЫРАЗИТЬ(СуммаНДСДоКорректировки * &Курс / &Кратность КАК ЧИСЛО(15,2))		КАК СуммаНДСДоКорректировки,
	|	ВЫРАЗИТЬ(СуммаНДСДоИзменения * &Курс / &Кратность КАК ЧИСЛО(15,2))			КАК СуммаНДСДоИзменения,
	|	ВЫРАЗИТЬ(СуммаНДС * &Курс / &Кратность КАК ЧИСЛО(15,2))						КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВсегоДоКорректировки * &Курс / &Кратность КАК ЧИСЛО(15,2))			КАК ВсегоДоКорректировки,
	|	ВЫРАЗИТЬ(ВсегоДоИзменения * &Курс / &Кратность КАК ЧИСЛО(15,2))				КАК ВсегоДоИзменения,
	|	ВЫРАЗИТЬ(Всего * &Курс / &Кратность КАК ЧИСЛО(15,2))						КАК Всего,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаДоКорректировки
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК СуммаДоКорректировкиВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаДоИзменения
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК СуммаДоИзмененияВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК СуммаВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаНДСДоКорректировки
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК СуммаНДСДоКорректировкиВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаНДСДоИзменения
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК СуммаНДСДоИзмененияВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаНДС
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК СуммаНДСВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			ВсегоДоКорректировки
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК ВсегоДоКорректировкиВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			ВсегоДоИзменения
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК ВсегоДоИзмененияВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			Всего
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ													КАК ВсегоВалютная
	|ИЗ
	|	Документ.ИсправительныйСчетФактураПолученный.СоставНФА КАК СоставНФА
	|ГДЕ
	|	СоставНФА.Ссылка = &ДокументСсылка
	|	И НДСКВычету
	|;";
	
	ТаблицаСоставНФА = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаСоставНФА;
	
КонецФункции	

Функция ПолучитьСуммыСторно(СтрокаТаблицы)
	
	СуммаНДС = СтрокаТаблицы["СуммаНДСДоКорректировки"] - СтрокаТаблицы["СуммаНДСДоИзменения"];
	
	СуммаБезНДС = СтрокаТаблицы["СуммаДоКорректировки"] - СтрокаТаблицы["СуммаДоИзменения"];
	
	СуммаНДСВалютная = СтрокаТаблицы["СуммаНДСДоКорректировкиВалютная"] - СтрокаТаблицы["СуммаНДСДоИзмененияВалютная"];
	
	СуммаБезНДСВалютная = СтрокаТаблицы["СуммаДоКорректировкиВалютная"] - СтрокаТаблицы["СуммаДоИзмененияВалютная"];
	
	Если СуммаНДС = 0 И СуммаБезНДС = 0 И СуммаНДСВалютная = 0 И СуммаБезНДСВалютная = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СуммыСторно = Новый Структура();
	СуммыСторно.Вставить("СуммаНДС",			СуммаНДС);
	СуммыСторно.Вставить("СуммаБезНДС",			СуммаБезНДС);
	СуммыСторно.Вставить("СуммаНДСВалютная",	СуммаНДСВалютная);
	СуммыСторно.Вставить("СуммаБезНДСВалютная",	СуммаБезНДСВалютная);
	
	УчетНДС.УстановитьЗнакЧисел(СуммыСторно, "-");
	
	Возврат СуммыСторно;
	
КонецФункции

Функция ПолучитьСуммыДвижения(СтрокаТаблицы, СтруктураШапкиДокумента)
	
	Если СтруктураШапкиДокумента["ЭтоКорректировка"] Тогда
		
		СуммаНДС = СтрокаТаблицы["СуммаНДС"] - СтрокаТаблицы["СуммаНДСДоКорректировки"];
		
		СуммаБезНДС = СтрокаТаблицы["Сумма"] - СтрокаТаблицы["СуммаДоКорректировки"];
		
		СуммаНДСВалютная = СтрокаТаблицы["СуммаНДС"] - СтрокаТаблицы["СуммаНДСДоКорректировкиВалютная"];
		
		СуммаБезНДСВалютная = СтрокаТаблицы["Сумма"] - СтрокаТаблицы["СуммаДоКорректировкиВалютная"];
		
	Иначе
		
		СуммаНДС = СтрокаТаблицы["СуммаНДС"];
		
		СуммаБезНДС = СтрокаТаблицы["Сумма"];
		
		СуммаНДСВалютная = СтрокаТаблицы["СуммаНДСВалютная"];
		
		СуммаБезНДСВалютная = СтрокаТаблицы["СуммаВалютная"];
		
	КонецЕсли;
	
	Если СуммаНДС = 0 И СуммаБезНДС = 0 И СуммаНДСВалютная = 0 И СуммаБезНДСВалютная = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	СуммыДвижения = Новый Структура();
	СуммыДвижения.Вставить("СуммаНДС",				СуммаНДС);
	СуммыДвижения.Вставить("СуммаБезНДС",			СуммаБезНДС);
	СуммыДвижения.Вставить("СуммаНДСВалютная",		СуммаНДСВалютная);
	СуммыДвижения.Вставить("СуммаБезНДСВалютная",	СуммаБезНДСВалютная);
	
	УчетНДС.УстановитьЗнакЧисел(СуммыДвижения, "+");
	
	Возврат СуммыДвижения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
