/////////////////////////////////////////////////////////////////////////////////
// Печать регламентированных форм клиент переопределяемый                      //
/////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ПечатьОтчета(Ссылка, ИмяКоманды, КомандыПечати, АдресОбъекта , Форма) Экспорт 
	

		
		НайденоеОписание = КомандыПечати.НайтиСтроки(Новый Структура("ИмяКоманды",ИмяКоманды));
		
		Если не ЗначениеЗаполнено(НайденоеОписание) Тогда 
			Шаблон = НСтр(
			"ru = 'Не найдено описание команды ""%1"".'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ИмяКоманды);
			ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);
			Возврат;
		КонецЕсли;
		
		ОписаниеКоманды = Новый Структура("Тип,Бланк,НазваниеВарианта");
		ЗаполнитьЗначенияСвойств(ОписаниеКоманды,НайденоеОписание[0]); 
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ОписаниеКоманды",ОписаниеКоманды);
		ПараметрыПечати.Вставить("Ссылка",Ссылка);
		ПараметрыПечати.Вставить("АдресОбъекта",АдресОбъекта);
		
		Если ОписаниеКоманды.Тип = "ТекущийБланк" Тогда
			//оключим загрузку настроек, которая портит порядок печатных форм
			ПараметрыПечати.Вставить("ПереопределитьПользовательскиеНастройкиКоличества",Истина);	
		КонецЕсли;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.УниверсальныйРегламентированныйОтчет",
			"ПечатьБланка",
			Ссылка,
			Форма,
			ПараметрыПечати);
		


	
КонецПроцедуры


