////////////////////////////////////////////////////////////////////////////////
// Подсистема «Аудит состояния системы».
// Переопределяемые процедуры и функции.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Метод предназначен для переопределения отображения пользователю 
//	дополнительной информации о проблеме.
// Если поведение не переопределяется прикладной подсистемой 
//	(СтандартнаяОбработка = Истина), отображается стандартная форма проблемы.
//
// Параметры:
//	Идентификатор - строка, указанная при регистрации проверки, 
//		см. ЗарегистрироватьПроверкуСостоянияСистемы.
//	Проблема - идентификатор выявленной проблемы, позволяет получить 
//		дополнительную информацию по проблеме при помощи метода 
//		АудитСостоянияСистемы.ДополнительнаяИнформацияПоПроблеме.
//	СтандартнаяОбработка - булево, признак необходимости отображать стандартную форму.
//
Процедура ПоказатьДополнительнуюИнформациюОПроблеме(Идентификатор, Проблема, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти
