// Переменные для работы обработки в фоновом режиме
&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ЗаполнитьТаблицуПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьСостояниеВыбораСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Отказ = Истина;
		ТекстПредупреждения = НСтр("ru = 'Выполняется восстановление свойств счетов. Рекомендуется дождаться результата выполнения.'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("Объект.СписокСчетов", Объект.СписокСчетов.Выгрузить());
	Настройки.Вставить("Объект.Параметры", Объект.Параметры.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Объект.СписокСчетов.Загрузить(Настройки["Объект.СписокСчетов"]);
	
	Если Настройки["Объект.Параметры"] <> Неопределено Тогда
		Объект.Параметры.Загрузить(Настройки["Объект.Параметры"]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВсеСчетаПриИзменении(Элемент)
	
	ИзменитьСостояниеВыбораСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Объект.СписокСчетов.Добавить().Счет = ВыбранноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВосстановитьПриИзменении(Элемент)
	
	ИзменитьСостояниеОбработкиРеквизита(Элементы.Параметры.ТекущиеДанные, Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыУстановитПриИзменении(Элемент)
	
	ИзменитьСостояниеОбработкиРеквизита(Элементы.Параметры.ТекущиеДанные, Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВосстановитьСчета(Команда)
	
	Текст = НСтр("ru = ""Будет выполнена установка свойств счетов. Продолжить?"";" + " en = ""Do you want to continue?""");
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВосстановитьСчетаЗавершение", ЭтотОбъект), Текст, РежимДиалогаВопрос.ДаНет, 10, КодВозвратаДиалога.Нет, "Выполнить");
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСчетаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СведенияЗадания = НачатьВосстановление();
	ИдентификаторЗадания = СведенияЗадания.ИдентификаторЗадания;
	
	Если СведенияЗадания.Статус = "Выполнено" Тогда
		ПослеВыполненияЗадания();
	Иначе
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСчета(Команда)
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("ПланСчетов.ЕПСБУ.Форма.ФормаВыбора", ПараметрыФормы, Элементы.СписокСчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьОтметитьВсе(Команда)
	ОбойтиВсеФлажки("Восстановить", Истина);
	ИзменитьСостояниеОбработкиРеквизитов("Восстановить");
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьСнятьВсе(Команда)	
	ОбойтиВсеФлажки("Восстановить", Ложь);
	ИзменитьСостояниеОбработкиРеквизитов("Восстановить");
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтметитьВсе(Команда)
	ОбойтиВсеФлажки("Установить", Истина);
	ИзменитьСостояниеОбработкиРеквизитов("Установить");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьВсе(Команда)
	ОбойтиВсеФлажки("Установить", Ложь);
	ИзменитьСостояниеОбработкиРеквизитов("Установить");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(Элемент.Поля, "ПараметрыУстановить");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Элемент.Отбор, "Объект.Параметры.ДоступенВводЗначения", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(Элемент.Поля, "ПараметрыЗначение");
	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Элемент.Отбор.Элементы, "", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ, "Объект.Параметры.ДоступенВводЗначения", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаИЛИ, "Объект.Параметры.Установить", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
КонецПроцедуры

&НаСервере
Функция НачатьВосстановление()
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ВсеСчета",			Объект.ВсеСчета);
	ПараметрыОбработки.Вставить("СчетаСИерархией",	Объект.СчетаСИерархией);
	ПараметрыОбработки.Вставить("МассивСчетов",		Объект.СписокСчетов.Выгрузить(,"Счет").ВыгрузитьКолонку("Счет"));
	ПараметрыОбработки.Вставить("Параметры",		Объект.Параметры.Выгрузить());
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Установка свойств счетов'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	СведенияЗадания = ДлительныеОперации.ВыполнитьВФоне("Обработки.УстановкаСвойствСчетов.ВыполнитьВосстановлениеСчетов",
		ПараметрыОбработки, ПараметрыВыполнения); 
	
	Возврат СведенияЗадания;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
			ПослеВыполненияЗадания();
			Возврат;
		КонецЕсли;
	Исключение
		ПослеВыполненияЗадания(Истина);
		ВызватьИсключение;
	КонецПопытки;
	
	ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ФоновоеЗаданиеИдентификатор)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПослеВыполненияЗадания(СОшибками = Ложь)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ПоказатьСообщенияЖурналаРегистраии();
	
	ИдентификаторЗадания = Неопределено;
	
	ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
	
	Если Не СОшибками Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Установка свойств счетов завершена!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьСообщенияЖурналаРегистраии()
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	
	Если Задание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ДатаНачала,ДатаОкончания,Событие",
		Задание.Начало, Задание.Конец, НСтр("ru = 'Восстановление свойств счетов'")); 
	ДанныеЖурнала = Новый ТаблицаЗначений;
	ВыгрузитьЖурналРегистрации(ДанныеЖурнала, Отбор, "Комментарий,Данные");
	
	Для Каждого Запись Из ДанныеЖурнала Цикл
		ОбщегоНазначения.СообщитьПользователю(Запись.Комментарий, Запись.Данные);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПараметров()
	
	ДобавитьРеквизитВТаблицу("Наименование"						,							, Ложь		);
	ДобавитьРеквизитВТаблицу("ДатаОкончанияДействия"			, "Действует по"			, Истина	, '00010101');
	ДобавитьРеквизитВТаблицу("ЗапретитьИспользоватьВПроводках"	, "Запретить использовать в проводках"	);
	
	ДобавитьРеквизитВТаблицу("Родитель"							, "Группа счетов"			, Истина	, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	ДобавитьРеквизитВТаблицу("НомерЖурнала"						, "Номер журнала"			, Истина	, Справочники.Журналы.ПустаяСсылка());
	ДобавитьРеквизитВТаблицу("ТипСчета"							, "Тип счета"				, Истина	, Перечисления.ТипыСчетов.Бухгалтерский);
	ДобавитьРеквизитВТаблицу("Вид"								, "Вид счета"				, Ложь		);
	ДобавитьРеквизитВТаблицу("КОСГУДт"							, "КОСГУ по дебету"			, Истина	, Справочники.КОСГУ.ПустаяСсылка());
	ДобавитьРеквизитВТаблицу("КОСГУКт"							, "КОСГУ по кредиту"		, Истина	, Справочники.КОСГУ.ПустаяСсылка());
	ДобавитьРеквизитВТаблицу("БезДетализацииКОСГУ"				, "Без детализации КОСГУ",);
	
	ДобавитьРеквизитВТаблицу("ДляКазенных"						, "Для казенных");
	ДобавитьРеквизитВТаблицу("ДляБюджетных"						, "Для бюджетных");
	ДобавитьРеквизитВТаблицу("ДляАвтономных"					, "Для автономных");
	
	ДобавитьРеквизитВТаблицу("Забалансовый");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
		ДобавитьРеквизитВТаблицу("Валютный");
	КонецЕсли;
	ДобавитьРеквизитВТаблицу("Количественный");
	
	Если ПолучитьФункциональнуюОпцию("ПлательщикНалогаНаПрибыль") И ПолучитьФункциональнуюОпцию("ПрименяетсяУСН") Тогда
		ДобавитьРеквизитВТаблицу("НалоговыйУчетНеУчитываемых"	, "Не учитывается (НУ)");
		ДобавитьРеквизитВТаблицу("НалоговыйУчетЕНВД"			, "ЕНВД (НУ)");
		ДобавитьРеквизитВТаблицу("НалоговыйУчетНДС"				, "НДС (НУ)");
	КонецЕсли;
	
	ДобавитьРеквизитВТаблицу("УчетПоКПС", "Учет по КПС");
	ДобавитьРеквизитВТаблицу("УчетПоКЭК", "Учет по КЭК");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
		ДобавитьРеквизитВТаблицу("УчетПоПодразделениям", "Учет по подразделениям");
		ДобавитьРеквизитВТаблицу("РазрешитьНеУказыватьПодразделение", "Необязательно указывать подразделение");
	КонецЕсли;
	
	ДобавитьРеквизитВТаблицу("Субконто"	, "Виды субконто счета"	, Ложь);
	ДобавитьРеквизитВТаблицу("ВидыКПС"	, "Виды КБК счетов"		, Ложь);
	ДобавитьРеквизитВТаблицу("ВидыКЭК"	, "КЭК счетов"			, Ложь);
	
	ДобавитьРеквизитВТаблицу("Порядок"	, "Порядок"				, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитВТаблицу(РеквизитСчета, Наименование = Неопределено,
	ДоступенВводЗначения = Истина, Значение = Ложь, Установить = Ложь, Восстановить = Ложь)
	
	НоваяСтрока = Объект.Параметры.Добавить();
	НоваяСтрока.РеквизитСчета			= РеквизитСчета;
	НоваяСтрока.Наименование			= ?(Наименование = Неопределено, РеквизитСчета, Наименование);
	НоваяСтрока.Восстановить			= Восстановить;
	НоваяСтрока.ДоступенВводЗначения	= ДоступенВводЗначения;
	НоваяСтрока.Установить				= Установить;
	НоваяСтрока.Значение				= ?(ДоступенВводЗначения, Значение, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеОбработкиРеквизитов(Префикс)
	
	Для Каждого Строка Из Объект.Параметры Цикл
		ИзменитьСостояниеОбработкиРеквизита(Строка, Префикс);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеОбработкиРеквизита(ТекущиеДанные, Имя)
	
	Префикс = ?(Найти(Имя, "Восстановить") > 0, "Восстановить", "Установить");
	
	Если ТекущиеДанные[Префикс] Тогда
		
		ПрефиксНовый = ?(Префикс = "Восстановить", "Установить", "Восстановить");
		ТекущиеДанные[ПрефиксНовый] = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСостояниеВыбораСчета()
	
	Элементы.СчетаСИерархией.Доступность	= Не Объект.ВсеСчета; 
	Элементы.СписокСчетов.Доступность		= Не Объект.ВсеСчета; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбойтиВсеФлажки(Префикс, СостояниеФлага)
	
	Для Каждого Строка Из Объект.Параметры Цикл
		Строка[Префикс] = ?(Префикс = "Установить" И Не Строка.ДоступенВводЗначения, Ложь, СостояниеФлага);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
