////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	БухгалтерскиеОперацииСервер.УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры);
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Если ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
			ОтборВладелец = Параметры.Отбор.Владелец;
			Элементы.ОтборВладелец.ТолькоПросмотр = Истина;
			Элементы.ОтборВладелец.КнопкаОткрытия = Ложь;
			Элементы.Владелец.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборВладелецПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ОтборВладелец,,, ЗначениеЗаполнено(ОтборВладелец));
    Элементы.Владелец.Видимость = Не ЗначениеЗаполнено(ОтборВладелец);
КонецПроцедуры

