
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере(Истина);
		
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = Константы.ОрганизацияДляУчетаКомпенсацииРодительскойПлаты.Получить();
		
			Если Параметры.Свойство("ЗначенияЗаполнения") И Не ЗначениеЗаполнено(Объект.Организация) Тогда
				Параметры.ЗначенияЗаполнения.Свойство("Организация", Объект.Организация);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			УстановитьОтветственныхЛиц(Объект.Организация, Объект.Подразделение, Объект.Дата, Объект.ГлБухгалтер);
		КонецЕсли;
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "РаботаСоСтудентамиКлиент_ПроизведенВыборПериода" И Источник = ЭтотОбъект Тогда
		ИмяРеквизита = СтрЗаменить(Параметр, "Объект.", "");
		
		Если ИмяРеквизита = "НачалоПериода" Тогда
			ОбработатьИзменениеНачалаПериода(Элементы.НачалоПериодаСтрокой);
		ИначеЕсли ИмяРеквизита = "КонецПериода" Тогда
			ОбработатьИзменениеОкончанияПериода(Элементы.КонецПериодаСтрокой);
		КонецЕсли;
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			УстановитьОтветственныхЛиц(Объект.Организация, Объект.Подразделение, Объект.Дата, Объект.ГлБухгалтер);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.Начисления.Очистить();
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		УстановитьОтветственныхЛиц(Объект.Организация, Объект.Подразделение, Объект.Дата, Объект.ГлБухгалтер);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		УстановитьОтветственныхЛиц(Объект.Организация, Объект.Подразделение, Объект.Дата, Объект.ГлБухгалтер);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетЗаНесколькоМесяцевПриИзменении(Элемент)
	
	УстановитьВидимостьПоПериодуРасчета(ЭтотОбъект);
	
	Если НЕ Объект.РасчетЗаНесколькоМесяцев Тогда
		
		Объект.КонецПериода =  КонецМесяца(Объект.НачалоПериода);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияСтрокойПриИзменении(Элемент)
		
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент);
	
	ОбработатьИзменениеНачалаПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтароеЗначение = Объект.НачалоПериода;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, СтандартнаяОбработка);
	
	Если Объект.НачалоПериода <> СтароеЗначение Тогда
		
		ОбработатьИзменениеНачалаПериода(Элемент);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка);
	
	ОбработатьИзменениеНачалаПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойПриИзменении(Элемент)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент);
	
	Объект.КонецПериода = КонецМесяца(Объект.КонецПериода);
	
	ОбработатьИзменениеОкончанияПериода(Элемент);


КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтароеЗначение = Объект.КонецПериода;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, СтандартнаяОбработка);
	
	Объект.КонецПериода = КонецМесяца(Объект.КонецПериода);
	
	Если Объект.КонецПериода <> СтароеЗначение Тогда
		
		ОбработатьИзменениеОкончанияПериода(Элемент);
		
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка);
	
	Объект.КонецПериода = КонецМесяца(Объект.КонецПериода);
	
	ОбработатьИзменениеОкончанияПериода(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);		
	
	Объект.КонецПериода = КонецМесяца(Объект.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
	Объект.КонецПериода = КонецМесяца(Объект.КонецПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ДошкольноеУчреждениеПриИзменении(Элемент)
	УстановитьСвязи();
	УстановитьВидимостьДошкольногоУчреждения(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаДетскогоУчрежденияПриИзменении(Элемент)
	УстановитьВидимостьГруппыДошкольногоУчреждения(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиНачисления

&НаКлиенте
Процедура НачисленияПриИзменении(Элемент)
	Если Элементы.Начисления.ТекущиеДанные = Неопределено Тогда
		УстановитьПредупреждение(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРебенокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", ?(ЗначениеЗаполнено(Объект.ДетскоеУчреждение), Объект.ДетскоеУчреждение, Объект.Организация));
	ПараметрыФормы.Вставить("ГруппаДетскогоУчреждения", Объект.ГруппаДетскогоУчреждения);
	ПараметрыФормы.Вставить("НаДату", НачалоДня(Объект.НачалоПериода));
	
	ОткрытьФорму("Справочник.Дети.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияРебенокПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Ребенок) Тогда
		ЗаполнитьДанныеСтроки(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	Если Копирование Тогда
		ТекущаяСтрока.Ребенок = Неопределено;
		ТекущаяСтрока.Договор = Неопределено;
		ТекущаяСтрока.Контрагент = Неопределено;
		ТекущаяСтрока.Плательщик = Неопределено;
		ТекущаяСтрока.ПроцентКомпенсации = 0;
		ТекущаяСтрока.СуммаКомпенсации = 0;
	КонецЕсли;
	
	Если НоваяСтрока И Не Копирование Тогда
		ТекущаяСтрока.ДетскоеУчреждение = Объект.ДетскоеУчреждение;
		ТекущаяСтрока.ГруппаДетскогоУчреждения = Объект.ГруппаДетскогоУчреждения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияНастройкаКомпенсацииПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Ребенок) Тогда
		ЗаполнитьДанныеСтроки(ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧасть(Команда)
	Если Объект.Начисления.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросОбОчисткеТабличнойЧасти", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='При заполнении таблица расчета начислений будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийПодсистемыТиповыеОперации

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект); 

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВопросОбОчисткеТабличнойЧасти(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	РодительскаяПлата.УстановитьУсловноеОформлениеПроцентКомпенсацииНеЗависитОтБазы(ЭтотОбъект, "Начисления");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()
	
	НастройкиКомпенсации = Объект.Начисления.Выгрузить(,"НастройкаКомпенсации");
	НастройкиКомпенсации.Свернуть("НастройкаКомпенсации");
	
	ДанныеНастроек = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НастройкиКомпенсации.ВыгрузитьКолонку("НастройкаКомпенсации"),
		"РасчетКомпенсацииНеЗависитОтБазы");
	
	Для Каждого СтрокаКомпенсации Из Объект.Начисления Цикл
		СтрокаКомпенсации.НеЗависитОтБазы = ДанныеНастроек.Получить(СтрокаКомпенсации.НастройкаКомпенсации) = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере(ПриСозданииНаСервере = Ложь)
	
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой");
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой");

	УстановитьВидимостьПоПериодуРасчета(ЭтотОбъект);
	
	Если НЕ ПриСозданииНаСервере Тогда
		УстановитьПредупреждение(ЭтотОбъект);
	КонецЕсли;
	
	УстановитьВидимостьДошкольногоУчреждения(ЭтотОбъект);
	УстановитьВидимостьГруппыДошкольногоУчреждения(ЭтотОбъект);
	
	УстановитьСвязи();
	ЗаполнитьДобавленныеКолонки();

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтветственныхЛиц(Организация, Подразделение, Дата, ГлБухгалтер)

	ГлБухгалтер = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Главный бухгалтер",
		Организация, Дата, Подразделение).ОтветственноеЛицоСсылка;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПоПериодуРасчета(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "КонецПериодаСтрокой",
		"Видимость", Форма.Объект.РасчетЗаНесколькоМесяцев);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредупреждение(Форма)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Организация");
	ИменаЭлементов.Добавить("ДошкольноеУчреждение");
	ИменаЭлементов.Добавить("КонецПериодаСтрокой");
	ИменаЭлементов.Добавить("НачалоПериодаСтрокой");
	ИменаЭлементов.Добавить("Дата");
	ИменаЭлементов.Добавить("ГруппаДетскогоУчреждения");
	ИменаЭлементов.Добавить("ИФО");
	ИменаЭлементов.Добавить("Подразделение");
	ИменаЭлементов.Добавить("НаправлениеДеятельности");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		ИменаЭлементов,
		"ОтображениеПредупрежденияПриРедактировании",
		?(Форма.Объект.Начисления.Количество() > 0,
			ОтображениеПредупрежденияПриРедактировании.Отображать,
			ОтображениеПредупрежденияПриРедактировании.НеОтображать));
			
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеОкончанияПериода(Элемент)
	
	НовоеЗначение = Неопределено;
	
	Если КонецМесяца(Объект.НачалоПериода) >  КонецМесяца(Объект.КонецПериода) Тогда
			
			НовоеЗначение =  НачалоМесяца(Объект.КонецПериода);
			
	КонецЕсли;

	
	Если НЕ НовоеЗначение = Неопределено Тогда
		
		Объект.НачалоПериода = НовоеЗначение;
		
		РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеНачалаПериода(Элемент)
	
	НовоеЗначение = Неопределено;
	
	Если НЕ Объект.РасчетЗаНесколькоМесяцев Тогда
		
		Если НЕ КонецМесяца(Объект.НачалоПериода) = КонецМесяца(Объект.КонецПериода) Тогда
			
			НовоеЗначение =  КонецМесяца(Объект.НачалоПериода);
			
		КонецЕсли;
		
	Иначе
		
		Если КонецМесяца(Объект.НачалоПериода) >  КонецМесяца(Объект.КонецПериода) Тогда
			
			НовоеЗначение =  КонецМесяца(Объект.НачалоПериода);
			
		КонецЕсли;

	КонецЕсли;	
	
	Если НЕ НовоеЗначение = Неопределено Тогда
		
		Объект.КонецПериода = НовоеЗначение;
		
		РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Ложь);

	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДошкольногоУчреждения(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НачисленияДошкольноеУчреждение",
		"Видимость", Не ЗначениеЗаполнено(Форма.Объект.ДетскоеУчреждение));
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьГруппыДошкольногоУчреждения(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НачисленияГруппаДетскогоУчреждения",
		"Видимость", Не ЗначениеЗаполнено(Форма.Объект.ГруппаДетскогоУчреждения));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	ПараметрыРасчета = Документы.НачислениеКомпенсацииРодительскойПлаты.ПараметрыРасчета(Объект);
	ПараметрыРасчета.ДетскоеУчреждение        = Объект.ДетскоеУчреждение;
	ПараметрыРасчета.ГруппаДетскогоУчреждения = Объект.ГруппаДетскогоУчреждения;
	ПараметрыРасчета.НаправлениеДеятельности  = Объект.НаправлениеДеятельности;
	
	ТаблицаКомпенсации = Документы.НачислениеКомпенсацииРодительскойПлаты.РассчитатьНачислениеКомпенсации(ПараметрыРасчета);
	Объект.Начисления.Загрузить(ТаблицаКомпенсации);
	УстановитьПредупреждение(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтроки(ИдентификаторСтроки)
	ТекущиеДанные = Объект.Начисления.НайтиПоИдентификатору(ИдентификаторСтроки);

	ПараметрыРасчета = Документы.НачислениеКомпенсацииРодительскойПлаты.ПараметрыРасчета(Объект);
	ПараметрыРасчета.ДетскоеУчреждение        = ТекущиеДанные.ДетскоеУчреждение;
	ПараметрыРасчета.ГруппаДетскогоУчреждения = ТекущиеДанные.ГруппаДетскогоУчреждения;
	ПараметрыРасчета.Ребенок                  = ТекущиеДанные.Ребенок;
	ПараметрыРасчета.НаправлениеДеятельности  = Объект.НаправлениеДеятельности;
	ПараметрыРасчета.НастройкаРасчета         = ТекущиеДанные.НастройкаКомпенсации;

	ДанныеЗаполнения = Документы.НачислениеКомпенсацииРодительскойПлаты.РассчитатьНачислениеКомпенсации(ПараметрыРасчета);
	Если ДанныеЗаполнения.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеЗаполнения[0]);
	Иначе
		ТекущиеДанные.КПС = Неопределено;
		ТекущиеДанные.КФО = Неопределено;
		ТекущиеДанные.ПроцентКомпенсации = 0;
		ТекущиеДанные.СуммаКомпенсации = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьСвязи()
	Если ЗначениеЗаполнено(Объект.ДетскоеУчреждение) Тогда
		Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.ДетскоеУчреждение");
	Иначе
		Связь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Организация");
	КонецЕсли;
	МассивСвязей = Новый Массив;
	МассивСвязей.Добавить(Связь);
	
	Элементы.ГруппаДетскогоУчреждения.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
