
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьПараметрКопирования();
	УстановитьВидОтчета();
	ЗаполнитьДеревоЭлементов();
	ЗаполнитьДеревоШапкиРаздела();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДополнительныеСвойстваОбъекта = ТекущийОбъект.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ДополнительныеСвойстваОбъекта <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ДополнительныеСвойстваОбъекта Цикл
			ТекущийОбъект.ДополнительныеСвойства.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
	ТекущийОбъект.ШапкаРаздела.Очистить();
	
	ЗаполнитьДеревоЭлементов();
	
	МассивОбъектов = Новый Массив;
	Для Каждого РазделДерева ИЗ ДеревоЭлементов.ПолучитьЭлементы() Цикл
		Если РазделДерева.ЭлементОтчета = "Боковик" Тогда
			МассивОбъектов.Добавить(РазделДерева.ЭлементОтчета);
			Продолжить;
		КонецЕсли;
		Для Каждого ЭлементыРаздела Из РазделДерева.ПолучитьЭлементы() Цикл
			Если ТипЗнч(ЭлементыРаздела.ЭлементОтчета) = Тип("Строка")  Тогда
				Для Каждого ЭлементыАналитики Из ЭлементыРаздела.ПолучитьЭлементы() Цикл
					МассивОбъектов.Добавить(ЭлементыАналитики.ЭлементОтчета);
				КонецЦикла;
			Иначе
				МассивОбъектов.Добавить(ЭлементыРаздела.ЭлементОтчета);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	СтрокаШапки = ДеревоШапкиРаздела.ПолучитьЭлементы()[0];
	ПеренестиРекурсивноДеревоШапки(ТекущийОбъект,МассивОбъектов,СтрокаШапки,"",0);	
		
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьДеревоЭлементов();
	ЗаполнитьДеревоШапкиРаздела();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ДеревоШапкиРаздела.Развернуть(ДеревоШапкиРаздела.ПолучитьЭлементы()[0].ПолучитьИдентификатор());
	Для Каждого ДоступныйЭлемент Из ДеревоЭлементов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоЭлементов.Развернуть(ДоступныйЭлемент.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	УстановитьВидОтчета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСтрокиРаздела

&НаКлиенте
Процедура СтрокиРазделаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	НоваяСтрока              = Объект.СтрокиРаздела.Добавить();
	НоваяСтрока.СтрокаОтчета = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКолонкиРаздела

&НаКлиенте
Процедура КолонкиРазделаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НоваяСтрока               = Объект.КолонкиРаздела.Добавить();
	НоваяСтрока.КолонкаОтчета = ВыбранноеЗначение;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоЭлементов

&НаКлиенте
Процедура ДеревоЭлементовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = ДеревоЭлементов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ВидЭлемента = "Данные";
	ТипТекЭлемента = ТипЗнч(ТекСтрока.ЭлементОтчета);
	Если ТипТекЭлемента = Тип("Строка") И ТекСтрока.ЭлементОтчета<>"Боковик" Тогда
		Возврат;
	ИначеЕсли ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
		ВидЭлемента = "Ан.";
	ИначеЕсли ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.СвойстваОбъектов") Тогда
		ВидЭлемента = "Св.";
	ИначеЕсли ТипТекЭлемента = Тип("СправочникСсылка.КолонкиОтчетов") Тогда
		ВидЭлемента = "Гр.";
	КонецЕсли;
	
	ЭлементПрисутствует = Ложь;
	
	ЕстьЭлементОтчета(ДеревоШапкиРаздела,ТекСтрока.ЭлементОтчета,ТекСтрока.РеквизитЭлемента,ЭлементПрисутствует);
	
	Если ЭлементПрисутствует = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокЭлемента = "";
	Если ЗначениеЗаполнено(ТекСтрока.РеквизитЭлемента) Тогда
		ЗаголовокЭлемента = ВидЭлемента +": "+ТекСтрока.ПолучитьРодителя().Заголовок + " ["+ТекСтрока.РеквизитЭлемента+"]"; 
	Иначе
		ЗаголовокЭлемента = ВидЭлемента +": " + ТекСтрока.Заголовок;
	КонецЕсли;
	
	РодительскаяГруппа = Элементы.ДеревоШапкиРаздела.ТекущиеДанные;
	Если РодительскаяГруппа = Неопределено Тогда
		РодительскаяГруппа = ДеревоШапкиРаздела.ПолучитьЭлементы()[0];	
	ИначеЕсли РодительскаяГруппа.ВидЭлемента = 0 Тогда
		РодительскаяГруппа = РодительскаяГруппа.ПолучитьРодителя();
	КонецЕсли;
	НовыйЭлемент = РодительскаяГруппа.ПолучитьЭлементы().Добавить();	
	НовыйЭлемент.ЭлементОтчета = ТекСтрока.ЭлементОтчета;
	НовыйЭлемент.РеквизитЭлемента = ТекСтрока.РеквизитЭлемента;
	НовыйЭлемент.Заголовок = ЗаголовокЭлемента;
	НовыйЭлемент.ВидЭлемента = 0;
	
	Модифицированность = Истина;
	Элементы.ДеревоШапкиРаздела.Развернуть(РодительскаяГруппа.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ЕстьЭлементОтчета(ПроверяемыйЭлементДерева,ИскомыйЭлементОтчета,РеквизитЭлемента,ЭлементПрисутствует)
	Для Каждого ТекЭлемент Из ПроверяемыйЭлементДерева.ПолучитьЭлементы() Цикл
		Если ТекЭлемент.ЭлементОтчета = ИскомыйЭлементОтчета 
			И ТекЭлемент.РеквизитЭлемента = РеквизитЭлемента Тогда
			Элементы.ДеревоШапкиРаздела.ТекущаяСтрока = ТекЭлемент.ПолучитьИдентификатор();
			ЭлементПрисутствует = Истина;
			Возврат;
		КонецЕсли;
		
		ЕстьЭлементОтчета(ТекЭлемент,ИскомыйЭлементОтчета,РеквизитЭлемента,ЭлементПрисутствует);
		Если ЭлементПрисутствует = Истина Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоЭлементовНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекСтрока       = ПараметрыПеретаскивания.Значение;
	
	СтрокаПеретаскивания = ДеревоЭлементов.НайтиПоИдентификатору(ТекСтрока);
	ВидЭлемента = "Данные";
	ТипТекЭлемента = ТипЗнч(СтрокаПеретаскивания.ЭлементОтчета);
	Если ТипТекЭлемента = Тип("Строка") И СтрокаПеретаскивания.ЭлементОтчета<>"Боковик" Тогда
		Выполнение = Ложь;
		Возврат;
	ИначеЕсли ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
		ВидЭлемента = "Ан.";
	ИначеЕсли ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.СвойстваОбъектов") Тогда
		ВидЭлемента = "Св.";
	ИначеЕсли ТипТекЭлемента = Тип("СправочникСсылка.КолонкиОтчетов") Тогда
		ВидЭлемента = "Гр.";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаПеретаскивания.ЭлементОтчета) Тогда
		Выполнение = Ложь;
		Возврат;
	КонецЕсли;
	
	РодительСтроки = СтрокаПеретаскивания.ПолучитьРодителя();

	Если ЗначениеЗаполнено(СтрокаПеретаскивания.РеквизитЭлемента) Тогда
		ЗаголовокЭлемента =  ВидЭлемента +": "+РодительСтроки.Заголовок + " ["+СтрокаПеретаскивания.РеквизитЭлемента+"]"; 
	Иначе
		ЗаголовокЭлемента = ВидЭлемента +": " + СтрокаПеретаскивания.Заголовок;
	КонецЕсли;
	
	СтруктураЗначения = Новый Структура("ЭлементОтчета,РеквизитЭлемента");
	ЗаполнитьЗначенияСвойств(СтруктураЗначения,СтрокаПеретаскивания);
	СтруктураЗначения.Вставить("Заголовок",ЗаголовокЭлемента);
	ПараметрыПеретаскивания.Значение = СтруктураЗначения;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоШапкиРаздела

&НаКлиенте
Процедура ДеревоШапкиРазделаПередУдалением(Элемент, Отказ)
	ТекЭлемент = Элементы.ДеревоШапкиРаздела.ТекущиеДанные;
	Если ТекЭлемент.ВидЭлемента = -1 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШапкиРазделаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШапкиРазделаНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ТекСтрока       = ПараметрыПеретаскивания.Значение;
	
	СтрокаПеретаскивания = ДеревоШапкиРаздела.НайтиПоИдентификатору(ТекСтрока);
	Если СтрокаПеретаскивания.ВидЭлемента = -1 Тогда
		Выполнение = Ложь;
	КонецЕсли;
	
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШапкиРазделаПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Структура") Тогда
		ТекСтрока = ПараметрыПеретаскивания.Значение;
		СтандартнаяОбработка = Ложь;	
		
		ЭлементПрисутствует = Ложь;
		
		ЕстьЭлементОтчета(ДеревоШапкиРаздела,ТекСтрока.ЭлементОтчета,ТекСтрока.РеквизитЭлемента,ЭлементПрисутствует);
		
		Если ЭлементПрисутствует = Истина Тогда
			Возврат;
		КонецЕсли;
		
		Если Строка <> Неопределено Тогда
			СтрокаШапки = ДеревоШапкиРаздела.НайтиПоИдентификатору(Строка);
			Если СтрокаШапки.ВидЭлемента = 0 Тогда
				СтрокаШапки = СтрокаШапки.ПолучитьРодителя();
			КонецЕсли;
		Иначе
			СтрокаШапки = ДеревоШапкиРаздела.ПолучитьЭлементы()[0];
		КонецЕсли;
		
		НовыйЭлемент = СтрокаШапки.ПолучитьЭлементы().Добавить();	
		НовыйЭлемент.ЭлементОтчета = ТекСтрока.ЭлементОтчета;
		НовыйЭлемент.РеквизитЭлемента = ТекСтрока.РеквизитЭлемента;
		НовыйЭлемент.Заголовок = ТекСтрока.Заголовок;
		НовыйЭлемент.ВидЭлемента = 0;

		Модифицированность = Истина;
		Если НЕ Элементы.ДеревоШапкиРаздела.Развернут(СтрокаШапки.ПолучитьИдентификатор()) Тогда
			Элементы.ДеревоШапкиРаздела.Развернуть(СтрокаШапки.ПолучитьИдентификатор());
		КонецЕсли;
	Иначе
		ИсходнаяСтрока = ДеревоШапкиРаздела.НайтиПоИдентификатору(ПараметрыПеретаскивания.Значение);
		
		Если Строка <> Неопределено Тогда
			СтрокаШапки = ДеревоШапкиРаздела.НайтиПоИдентификатору(Строка);
			Если СтрокаШапки.ВидЭлемента = 0 Тогда //это не группа
				СтрокаШапки = СтрокаШапки.ПолучитьРодителя();
			КонецЕсли;	
				
				
			Если СтрокаШапки = ИсходнаяСтрока Тогда
				СтандартнаяОбработка = Ложь;
				Возврат;
			Иначе
				Родитель = СтрокаШапки.ПолучитьРодителя();
				ЭтоПотомок = Ложь;
				Пока Родитель<> Неопределено Цикл
					Если Родитель = ИсходнаяСтрока Тогда
						ЭтоПотомок = Истина;
						Прервать;
					КонецЕсли;
					Родитель = Родитель.ПолучитьРодителя();
				КонецЦикла;
				Если ЭтоПотомок = Истина Тогда
					СтандартнаяОбработка = Ложь;
					Возврат;
				КонецЕсли;
				
				Строка = СтрокаШапки.ПолучитьИдентификатор();
				Элементы.ДеревоШапкиРаздела.ТекущаяСтрока = Строка;
			КонецЕсли; 
			
		Иначе
			СтрокаШапки = ДеревоШапкиРаздела.ПолучитьЭлементы()[0];
			Строка = СтрокаШапки.ПолучитьИдентификатор();
			Элементы.ДеревоШапкиРаздела.ТекущаяСтрока = Строка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШапкиРазделаФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ДеревоШапкиРаздела.ТекущиеДанные;
	КФС = Новый КонструкторФорматнойСтроки(ТекДанные.ФорматКолонки);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФорматнойСтроки",ЭтотОбъект,ТекДанные.ПолучитьИдентификатор());
	КФС.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФорматнойСтроки(Текст,ИдСтроки)Экспорт
	Если Текст<> Неопределено Тогда
		СтрокаДерева = ДеревоШапкиРаздела.НайтиПоИдентификатору(ИдСтроки);
		СтрокаДерева.ФорматКолонки = Текст;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы



&НаКлиенте
Процедура ЗаполнитьОтсутствующиеСтроки(Команда)
	ЗаполнитьСтроки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсеСтроки(Команда)
	ЗаполнитьСтроки(Истина);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьКолонки(Команда)
	
	Если не ВладелецЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.КолонкиРаздела.Количество() = 0 Тогда
		ЗаполнитьКолонкиОтчета();
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник","ЗаполнитьКолонки");	
	
	ТекстВопроса = НСтр("ru = 'Существующие колонки будут удалены. Продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаВопроса",ЭтотОбъект,ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , , , );
	
КонецПроцедуры


&НаКлиенте
Процедура ПодборСтроки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", ВидОтчета));
	
	ОткрытьФорму("Справочник.СтрокиОтчетов.ФормаВыбора", ПараметрыФормы, Элементы.СтрокиРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКолонки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец", ВидОтчета));
	
	ОткрытьФорму("Справочник.КолонкиОтчетов.ФормаВыбора", ПараметрыФормы, Элементы.КолонкиРаздела);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДеревоЭлементов(Команда)
	ЗаполнитьДеревоЭлементов();
	Для Каждого ДоступныйЭлемент Из ДеревоЭлементов.ПолучитьЭлементы() Цикл
		Элементы.ДеревоЭлементов.Развернуть(ДоступныйЭлемент.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	РодительскаяГруппа = Элементы.ДеревоШапкиРаздела.ТекущиеДанные;
	Если РодительскаяГруппа = Неопределено Тогда
		РодительскаяГруппа = ДеревоШапкиРаздела.ПолучитьЭлементы()[0];	
	ИначеЕсли РодительскаяГруппа.ВидЭлемента = 0 Тогда
		РодительскаяГруппа = РодительскаяГруппа.ПолучитьРодителя();
	КонецЕсли;
	
	НовСтр = РодительскаяГруппа.ПолучитьЭлементы().Добавить();
	НовСтр.ВидЭлемента = 1;
	
	Элементы.ДеревоШапкиРаздела.Развернуть(РодительскаяГруппа.ПолучитьИдентификатор());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСтроки(ВсеСтроки)
	
	Если не ВладелецЗаполнен() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.СтрокиРаздела.Количество() = 0 Тогда 
		ЗаполнитьСтрокиОтчета(ВсеСтроки);
		Возврат;
	КонецЕсли;	

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник","ЗаполнитьСтроки");
	ДополнительныеПараметры.Вставить("ВсеСтроки",ВсеСтроки);
	
	ТекстВопроса = НСтр("ru = 'Существующие строки будут удалены. Продолжить?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаВопроса",ЭтотОбъект,ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , , , );
	
КонецПроцедуры

&НаКлиенте
Функция ВладелецЗаполнен()

	Если Не ЗначениеЗаполнено(Объект.Владелец) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено поле ""Макет отображения""'"),,"Владелец","Объект");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции // ВладелецЗаполнен()

&НаСервере
Процедура ЗаполнитьСтрокиОтчета(ВсеСтроки)

	Объект.СтрокиРаздела.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Если ВсеСтроки = Истина Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтрокиОтчетов.Ссылка КАК СтрокаОтчета
		|ИЗ
		|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
		|ГДЕ
		|	СтрокиОтчетов.Владелец = &Владелец
		|	И НЕ СтрокиОтчетов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтрокиОтчетов.ПорядковыйНомер";
	Иначе
		Запрос.УстановитьПараметр("МакетОтображения", Объект.Владелец);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазделыМакетовОтображенияСтрокиРаздела.СтрокаОтчета
		|ПОМЕСТИТЬ СтрокиТекущегоМакета
		|ИЗ
		|	Справочник.РазделыМакетовОтображения.СтрокиРаздела КАК РазделыМакетовОтображенияСтрокиРаздела
		|ГДЕ
		|	РазделыМакетовОтображенияСтрокиРаздела.Ссылка <> &Ссылка
		|	И РазделыМакетовОтображенияСтрокиРаздела.Ссылка.Владелец = &МакетОтображения
		|	И РазделыМакетовОтображенияСтрокиРаздела.Ссылка.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиОтчетов.Ссылка КАК СтрокаОтчета
		|ИЗ
		|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтрокиТекущегоМакета КАК СтрокиТекущегоМакета
		|		ПО (СтрокиТекущегоМакета.СтрокаОтчета = СтрокиОтчетов.Ссылка)
		|ГДЕ
		|	СтрокиОтчетов.Владелец = &Владелец
		|	И НЕ СтрокиОтчетов.ПометкаУдаления
		|	И СтрокиТекущегоМакета.СтрокаОтчета ЕСТЬ NULL 
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтрокиОтчетов.ПорядковыйНомер";
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.СтрокиРаздела.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСтрокиОтчета()

&НаСервере
Процедура ЗаполнитьКолонкиОтчета()

	Объект.КолонкиРаздела.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КолонкиОтчетов.Ссылка КАК КолонкаОтчета
	|ИЗ
	|	Справочник.КолонкиОтчетов КАК КолонкиОтчетов
	|ГДЕ
	|	КолонкиОтчетов.Владелец = &Владелец
	|	И НЕ КолонкиОтчетов.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиОтчетов.ПорядковыйНомер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.КолонкиРаздела.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьКолонкиОтчета()

&НаСервере
Процедура ОбработатьПараметрКопирования()

	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если ТипЗнч(ДополнительныеСвойстваОбъекта) <> Тип("Структура") Тогда
			ДополнительныеСвойстваОбъекта = Новый Структура;
		КонецЕсли;
		
		ДополнительныеСвойстваОбъекта.Вставить("ОбъектКопирования", Параметры.ЗначениеКопирования);
		
	КонецЕсли;

КонецПроцедуры // ОбработатьПараметрКопирования()

&НаСервере
Процедура УстановитьВидОтчета()

	ВидОтчета =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "Владелец");

КонецПроцедуры // УстановитьВидОтчета()

&НаКлиенте
Процедура ОбработкаРезультатаВопроса(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ДополнительныеПараметры.Источник = "ЗаполнитьСтроки" Тогда 
		
		Если Результат = КодВозвратаДиалога.Да Тогда 
			
			ЗаполнитьСтрокиОтчета(ДополнительныеПараметры.ВсеСтроки);
			Модифицированность = Истина;
			
		КонецЕсли;
		
	ИначеЕсли ДополнительныеПараметры.Источник = "ЗаполнитьКолонки" Тогда 
		
		Если Результат = КодВозвратаДиалога.Да Тогда 
			
			ЗаполнитьКолонкиОтчета();
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоЭлементов()
	ДеревоЭлементов.ПолучитьЭлементы().Очистить();
		
	НаименованиеСтроки = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
	НаименованиеСтроки.ЭлементОтчета = "Боковик";
	НаименованиеСтроки.Заголовок = "Строка отчета";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.УстановитьПараметр("СтрокиОтчета", Объект.СтрокиРаздела.Выгрузить().ВыгрузитьКолонку("СтрокаОтчета"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыРаскрытияАналитика.ВидАналитики КАК ВидАналитики,
	|	ГруппыРаскрытияАналитика.Ссылка КАК ГруппаРаскрытия,
	|	ГруппыРаскрытияАналитика.НомерСтроки КАК НомерСтроки,
	|	ГруппыРаскрытияАналитика.Ссылка.Наименование
	|ИЗ
	|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	|		ПО СтрокиОтчетов.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
	|ГДЕ
	|	СтрокиОтчетов.Ссылка В(&СтрокиОтчета)
	|	И НЕ ГруппыРаскрытияАналитика.ВидАналитики ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаРаскрытия.Наименование,
	|	НомерСтроки
	|ИТОГИ ПО
	|	ГруппаРаскрытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗначенияСвойствОбъектов.Свойство КАК Свойство
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект В(&СтрокиОтчета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойство";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаГР = Результаты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	АналитикаОтчета = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
	АналитикаОтчета.ЭлементОтчета = "Аналитика раздела";
			
	Пока ВыборкаГР.Следующий() Цикл
		
		ТекГР = АналитикаОтчета.ПолучитьЭлементы().Добавить();
		ТекГР.ЭлементОтчета = ВыборкаГР.Наименование;
		ВыборкаАналитики = ВыборкаГР.Выбрать();
		Пока ВыборкаАналитики.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаАналитики.ВидАналитики) Тогда
					
				СтрокаДерева = ТекГР.ПолучитьЭлементы().Добавить();
				СтрокаДерева.ЭлементОтчета = ВыборкаАналитики.ВидАналитики;
				СтрокаДерева.Заголовок = Строка(ВыборкаАналитики.ВидАналитики);
				
				ДобавитьРеквизитыПоТипу(СтрокаДерева);
			КонецЕсли;
		КонецЦикла;
		Если ТекГР.ПолучитьЭлементы().Количество() = 0 Тогда
			АналитикаОтчета.ПолучитьЭлементы().Удалить(ТекГР);
		КонецЕсли;
	КонецЦикла;
	
	
	ВыборкаСвойств = Результаты[1].Выбрать();
	
	СвойстваОтчета = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
	СвойстваОтчета.ЭлементОтчета = "Свойства строк";
	Ном = 1;
	Пока ВыборкаСвойств.Следующий() Цикл
		
		СтрокаДерева = СвойстваОтчета.ПолучитьЭлементы().Добавить();
		СтрокаДерева.ЭлементОтчета = ВыборкаСвойств.Свойство;
		СтрокаДерева.Заголовок = ""+Ном+"."+Строка(ВыборкаСвойств.Свойство);
		
		ДобавитьРеквизитыПоТипу(СтрокаДерева);
		Ном = Ном+1;
	КонецЦикла;
	
	КолонкиОтчета = ДеревоЭлементов.ПолучитьЭлементы().Добавить();
	КолонкиОтчета.ЭлементОтчета = "Колонки раздела";
	Для Каждого ТекСтрока Из Объект.КолонкиРаздела Цикл
		Если НЕ ЗначениеЗаполнено(ТекСтрока.КолонкаОтчета) Тогда
			Продолжить;
		КонецЕсли;
		ТекКолонкаОтчета = КолонкиОтчета.ПолучитьЭлементы().Добавить();
		ТекКолонкаОтчета.ЭлементОтчета = ТекСтрока.КолонкаОтчета;
		Если ЗначениеЗаполнено(ТекСтрока.Заголовок) Тогда
			ТекКолонкаОтчета.Заголовок = "" + ТекСтрока.НомерСтроки + ". "+ТекСтрока.Заголовок;
		Иначе
			ТекКолонкаОтчета.Заголовок = "" + ТекСтрока.НомерСтроки + ". "+Строка(ТекСтрока.КолонкаОтчета);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитыПоТипу(СтрокаДерева)
	ТипОбъекта =  СтрокаДерева.ЭлементОтчета.ТипЗначения.Типы()[0];
	Если ОбщегоНазначения.ЭтоСсылка(ТипОбъекта) Тогда	
		ТекОбъект = Метаданные.НайтиПоТипу(ТипОбъекта);
		Если ОбщегоНазначения.ЭтоПеречисление(ТекОбъект) Тогда
			Возврат;
		КонецЕсли;
		Если ТекОбъект.ДлинаКода>0 Тогда
			НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
			НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
			НовРеквизит.Заголовок = "Код";
			НовРеквизит.РеквизитЭлемента = "Код";
		КонецЕсли;
		Если ТекОбъект.ДлинаНаименования>0 Тогда
			НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
			НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
			НовРеквизит.Заголовок = "Наименование";
			НовРеквизит.РеквизитЭлемента = "Наименование";
		КонецЕсли;
		Для Каждого РеквОбъекта Из ТекОбъект.Реквизиты Цикл
			НовРеквизит = СтрокаДерева.ПолучитьЭлементы().Добавить();
			НовРеквизит.ЭлементОтчета = СтрокаДерева.ЭлементОтчета;
			НовРеквизит.Заголовок = РеквОбъекта.Имя;
			НовРеквизит.РеквизитЭлемента = РеквОбъекта.Имя;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоШапкиРаздела()
	ДеревоШапкиРаздела.ПолучитьЭлементы().Очистить();
	ЭлементШапка = ДеревоШапкиРаздела.ПолучитьЭлементы().Добавить();
	ЭлементШапка.ВидЭлемента = -1;
	ЭлементШапка.ИмяГруппы = "Шапка таблицы раздела";
	
	ТекДеревоЭлементов = РеквизитФормыВЗначение("ДеревоЭлементов");
	
	СоответствиеСтрок = Новый Соответствие;
	Инд = 1;
	Для Каждого СтрокаШапки Из Объект.ШапкаРаздела Цикл
		Если ЗначениеЗаполнено(СтрокаШапки.ПолноеИмяГруппы) Тогда
			РодительскаяГруппа = СоответствиеСтрок[СтрокаШапки.ПолноеИмяГруппы];
		Иначе
			РодительскаяГруппа = ЭлементШапка;
		КонецЕсли;
		ТекГруппа = РодительскаяГруппа.ПолучитьЭлементы().Добавить();
		ТекГруппа.ИмяГруппы = СтрокаШапки.ИмяГруппы;
		ТекГруппа.ЭлементОтчета = СтрокаШапки.ЭлементОтчета;
		ТекГруппа.ВидГруппировки = СтрокаШапки.ВидГруппировки;
		ТекГруппа.Зафиксирована = СтрокаШапки.Зафиксирована;
		ТекГруппа.ЗаголовокЭлемента = СтрокаШапки.ЗаголовокЭлемента;
		ТекГруппа.ШиринаЭлемента = СтрокаШапки.ШиринаЭлемента;
		ТекГруппа.БезЗаголовка = СтрокаШапки.БезЗаголовка;
		ТекГруппа.РеквизитЭлемента = СтрокаШапки.РеквизитЭлемента;
		ТекГруппа.ПредставлениеПустого = СтрокаШапки.ПредставлениеПустого;
		ТекГруппа.НуженОтбор = СтрокаШапки.НуженОтбор;
		
		
		Если НЕ ЗначениеЗаполнено(ТекГруппа.ЭлементОтчета) Тогда
			ТекГруппа.ВидЭлемента = 1;
			ТекПолноеИмяГруппы = СтрокаШапки.ПолноеИмяГруппы +?(ЗначениеЗаполнено(СтрокаШапки.ПолноеИмяГруппы),".","")+"ГР_"+Инд;
			СоответствиеСтрок.Вставить(ТекПолноеИмяГруппы,ТекГруппа);			
		Иначе
			ТекГруппа.ФорматКолонки = СтрокаШапки.ФорматКолонки;
			СтрокиДерева = ТекДеревоЭлементов.Строки.НайтиСтроки(Новый Структура("ЭлементОтчета,РеквизитЭлемента",ТекГруппа.ЭлементОтчета,""),Истина);
			Если СтрокиДерева.Количество()>0 Тогда
				ТипТекЭлемента = ТипЗнч(ТекГруппа.ЭлементОтчета);
				ВидЭлемента = "Данные";
				Если ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") Тогда
					ВидЭлемента = "Ан.";
				ИначеЕсли ТипТекЭлемента = Тип("ПланВидовХарактеристикСсылка.СвойстваОбъектов") Тогда
					ВидЭлемента = "Св.";
				ИначеЕсли ТипТекЭлемента = Тип("СправочникСсылка.КолонкиОтчетов") Тогда
					ВидЭлемента = "Гр.";
				КонецЕсли;
				ТекГруппа.Заголовок = ВидЭлемента +": "+ СтрокиДерева[0].Заголовок+?(ЗначениеЗаполнено(ТекГруппа.РеквизитЭлемента)," ["+ТекГруппа.РеквизитЭлемента+"]","");
			КонецЕсли;
		КонецЕсли;
		Инд = Инд+1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиРекурсивноДеревоШапки(ТекущийОбъект,МассивОбъектов, ЭлементШапки,Знач ПолноеИмяГруппы,ПорядковыйНомер)
	
	Для Каждого ТекЭлемент Из ЭлементШапки.ПолучитьЭлементы() Цикл
			
		Если ТекЭлемент.ВидЭлемента = 0 Тогда
			//Сохранять будем только те элементы, которые есть табличных частях объекта.
			Если МассивОбъектов.Найти(ТекЭлемент.ЭлементОтчета) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ПорядковыйНомер = ПорядковыйНомер + 1;
		
		СтрТабШапки = ТекущийОбъект.ШапкаРаздела.Добавить();
		СтрТабШапки.ПолноеИмяГруппы = ПолноеИмяГруппы;
		СтрТабШапки.Зафиксирована = ТекЭлемент.Зафиксирована;
		СтрТабШапки.ЗаголовокЭлемента = ТекЭлемент.ЗаголовокЭлемента;
		СтрТабШапки.ШиринаЭлемента = ТекЭлемент.ШиринаЭлемента;
		СтрТабШапки.БезЗаголовка = ТекЭлемент.БезЗаголовка;
		
		Если ТекЭлемент.ВидЭлемента = 1 Тогда
			//Это группа			
			СтрТабШапки.ИмяГруппы = ТекЭлемент.ИмяГруппы;
			СтрТабШапки.ВидГруппировки = ТекЭлемент.ВидГруппировки;
			
			Если СтрТабШапки.ВидГруппировки = "ВЯчейке" Тогда
				Для Каждого ЭлементПроверки Из ТекЭлемент.ПолучитьЭлементы() Цикл
					Если ЭлементПроверки.ВидЭлемента = 1 Тогда
						СтрТабШапки.ВидГруппировки = "";
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			НовоеПолноеИмяГруппы = ПолноеИмяГруппы + ?(ЗначениеЗаполнено(ПолноеИмяГруппы),".","") + "ГР_"+ПорядковыйНомер;
			ПеренестиРекурсивноДеревоШапки(ТекущийОбъект,МассивОбъектов, ТекЭлемент, НовоеПолноеИмяГруппы, ПорядковыйНомер);
			
		ИначеЕсли ТекЭлемент.ВидЭлемента = 0 Тогда
			//Это элемент отчета
			СтрТабШапки.ЭлементОтчета = ТекЭлемент.ЭлементОтчета;
			СтрТабШапки.РеквизитЭлемента = ТекЭлемент.РеквизитЭлемента;
			СтрТабШапки.ПредставлениеПустого = ТекЭлемент.ПредставлениеПустого;
			СтрТабШапки.НуженОтбор = ТекЭлемент.НуженОтбор;
			СтрТабШапки.ФорматКолонки = ТекЭлемент.ФорматКолонки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры










#КонецОбласти

