
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".  
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1Сдокументооборотом

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);  
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1Сдокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетВложенийПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.КэшПараметров.Локальные.СчетВложений)
		И ЭтотОбъект.КэшПараметров.Локальные.СчетВложений <> Объект.СчетВложений
		И (Объект.КапитальныеВложения.Количество() > 0 ИЛИ Объект.Материалы.Количество() > 0) Тогда
		ТекстВопроса = НСтр("ru = 'При изменении счета вложений будут очищены табличные части ""Капитальные вложения"" и ""Номенклатура"".
			|Изменить счет вложений?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить счет вложений'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаВопросаИзменитьСчет", ЭтотОбъект), ТекстВопроса,Кнопки);
		Возврат;
	КонецЕсли;
	
	ОбработкаВопросаИзменитьСчет(КодВозвратаДиалога.Да, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаИзменитьСчет(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		// Возвращаем прежние значения.
		Объект.СчетВложений = ЭтотОбъект.КэшПараметров.Локальные.СчетВложений;
		Объект.КФОСписания  = ЭтотОбъект.КэшПараметров.Локальные.КФОСписания;
		Объект.КПССписания  = ЭтотОбъект.КэшПараметров.Локальные.КПССписания;
		Возврат;
	КонецЕсли;
	
	// Запомним новые значения.
	ЭтотОбъект.КэшПараметров.Локальные.СчетВложений = Объект.СчетВложений;
	ЭтотОбъект.КэшПараметров.Локальные.КФОСписания  = Объект.КФОСписания;
	ЭтотОбъект.КэшПараметров.Локальные.КПССписания  = Объект.КПССписания;
	
	Если Объект.КапитальныеВложения.Количество() > 0 Тогда
		Объект.КапитальныеВложения.Очистить();
	КонецЕсли;
	Если Объект.Материалы.Количество() > 0 Тогда
		Объект.Материалы.Очистить();
	КонецЕсли;
	УстановитьДоступностьЗакладок(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура СчетВложенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОграниченияСчета = Новый Массив;
	ОграниченияСчета.Добавить("106.00");

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			Объект.СчетВложений, 
																			Объект.КПССписания, 
																			Объект.КФОСписания), 
															Объект.Организация,
															Объект.ИФО,
															ОграниченияСчета,
															Объект.КФОСписания,
															МассивВидовРасходныхКПС(),
															Объект.Дата);
															
КонецПроцедуры

&НаКлиенте
Процедура СчетВложенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(ВыбранноеЗначение,
		Объект.КПССписания, Объект.КФОСписания);
	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетСписанияПриИзменении(Элемент)
	УстановитьЗаголовкиСубконтоСписания(ЭтаФорма, Объект);	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОграниченияСчета = Новый Массив;
	ОграниченияСчета.Добавить("304.06");
	ОграниченияСчета.Добавить("401.10");
	ОграниченияСчета.Добавить("401.20");
	ОграниченияСчета.Добавить("401.30");
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			Объект.КорСчетСписания, 
																			Объект.КорКПССписания, 
																			Объект.КФОСписания), 
															Объект.Организация,
															Объект.ИФО,
															ОграниченияСчета,
															Объект.КФОСписания,
															,
															Объект.Дата);
															
КонецПроцедуры

&НаКлиенте
Процедура КорСчетСписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															Объект.КорКПССписания,
															,
															Объект.КорКЭКСписания);
КонецПроцедуры

&НаКлиенте
Процедура КорСчетОприходованияПриИзменении(Элемент)
	УстановитьЗаголовкиСубконтоОприходования(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура КорСчетОприходованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОграниченияСчета = Новый Массив;
	ОграниченияСчета.Добавить("304.06");
	ОграниченияСчета.Добавить("401.10");
	ОграниченияСчета.Добавить("401.20");
	ОграниченияСчета.Добавить("401.30");
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			Объект.КорСчетОприходования, 
																			Объект.КорКПСОприходования, 
																			Объект.КФООприходования), 
															Объект.Организация,
															Объект.ИФО,
															ОграниченияСчета,
															Объект.КФООприходования,
															,
															Объект.Дата);
															
КонецПроцедуры

&НаКлиенте
Процедура КорСчетОприходованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															Объект.КорКПСОприходования,
															,,
															Объект.КорКЭКОприходования);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_КапитальныеВложения

&НаКлиенте
Процедура КапитальныеВложенияКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КапитальныеВложения.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Сумма = ?(ТекущиеДанные.Количество = 0, 1, ТекущиеДанные.Количество) * ТекущиеДанные.Цена;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Материалы

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьОС(Команда)
	
	ПроверитьВозможностьИРассчитатьСтоимость(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПодобратьМЗ(Команда)
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(ЭтаФорма, Объект,,
		ДополнитьСтруктуруПодбора());
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьМЗ(Команда)
	
	ПроверитьВозможностьИРассчитатьСтоимость(Ложь);

КонецПроцедуры

// Типовые операции
&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);	

КонецПроцедуры 

// Конец Типовые операции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1Сдокументооборотом 

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СчетВложений", Объект.СчетВложений);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("КФОСписания",  Объект.КФОСписания);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("КПССписания",  Объект.КПССписания);
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	УстановитьЗаголовкиСубконтоСписания(ЭтаФорма, Объект);
	УстановитьЗаголовкиСубконтоОприходования(ЭтаФорма, Объект);
	УстановитьДоступностьЗакладок(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("СчетВложений", "Счет вложений");
	СтруктураРеквизитов.Вставить("КФОСписания", "КФО (списания)");
	СтруктураРеквизитов.Вставить("КПССписания", "КПС (списания)");

    Возврат СтруктураРеквизитов;
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация"	, Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО"			, Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("КФО"			, Объект.КФОСписания);
	ПараметрыПодбора.Отбор.Вставить("КПС"			, Объект.КПССписания);
	ПараметрыПодбора.Отбор.Вставить("Счет"			, Объект.СчетВложений);	
	ПараметрыПодбора.Отбор.Вставить("Подразделение"	, Объект.Подразделение);
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения"	, "Вложения");
	ПараметрыПодбора.Вставить("СкрытьКолонки"	, "СчетУчета,ВидНФА");
	//ПараметрыПодбора.Вставить("КолонкиКорзины"	, Новый Структура("ОсновноеСредство", "ВнеоборотныйАктив"));

	Если Объект.КапитальныеВложения.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОССервер(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",						Объект.СчетВложений);
	ПараметрыПодбора.Вставить("КФО",							Объект.КФОСписания);
	ПараметрыПодбора.Вставить("КПС",							Объект.КПССписания);
	ПараметрыПодбора.Вставить("Подразделение",					Объект.Подразделение);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",				Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",			Истина);
	ПараметрыПодбора.Вставить("ИмяТаблицы",						"Материалы");
	ПараметрыПодбора.Вставить("ЭтоПодборСчета106",				Истина);
	ПараметрыПодбора.Вставить("ЕстьТолькоСуммовыеОстатки",		Истина);
	ПараметрыПодбора.Вставить("НеИспользоватьРезервирование",	Истина);
	
	Возврат ПараметрыПодбора;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма, Объект)

	Элементы = Форма.Элементы;
	Элементы.Подразделение.Доступность			= ЗначениеЗаполнено(Объект.Организация);
	Элементы.КапитальныеВложения.Доступность	= ЗначениеЗаполнено(Объект.Организация);

КонецПроцедуры

&НаКлиенте
Функция МассивВидовРасходныхКПС()

	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.Произвольный"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.АУИБУ"));
	Возврат Результат;

КонецФункции // МассивВидовРасходныхКПС()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиСубконто(Форма, Объект, Счет, ИменаЭлементов)
	Перем МассивПолей;
	
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто1", ИменаЭлементов[0], ИменаЭлементов[0], Истина, ИменаЭлементов[0], Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто2", ИменаЭлементов[1], ИменаЭлементов[1], Истина, ИменаЭлементов[1], Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто3", ИменаЭлементов[2], ИменаЭлементов[2], Истина, ИменаЭлементов[2], Истина, Истина, Истина);
	БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Счет, Форма, Объект, МассивПолей);

КонецПроцедуры // УстановитьЗаголовокиСубконтоЗатрат()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиСубконтоСписания(Форма, Объект)

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("КорСубконто1Списания");	
	ИменаЭлементов.Добавить("КорСубконто2Списания");	
	ИменаЭлементов.Добавить("КорСубконто3Списания");
	
	УстановитьЗаголовкиСубконто(Форма, Объект, Объект.КорСчетСписания, ИменаЭлементов)
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиСубконтоОприходования(Форма, Объект)

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("КорСубконто1Оприходования");	
	ИменаЭлементов.Добавить("КорСубконто2Оприходования");	
	ИменаЭлементов.Добавить("КорСубконто3Оприходования");
	
	УстановитьЗаголовкиСубконто(Форма, Объект, Объект.КорСчетОприходования, ИменаЭлементов)
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()

	ТаблицаОС = Объект.КапитальныеВложения.Выгрузить();
	ТаблицаОС.Колонки.ВнеоборотныйАктив.Имя = "ОсновноеСредство";
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);

КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(Знач ВыбранноеЗначение)
	
	УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(Объект.КапитальныеВложения,
		ВыбранноеЗначение, "ВнеоборотныйАктив", "ВнеоборотныйАктив"); 
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыНаСервере()
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект);
	ПараметрыПолученияОстатков.Подразделение	= Объект.Подразделение;
	ПараметрыПолученияОстатков.ИспользоватьУчетПоПодразделениям = ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям
		И БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Объект.СчетВложений).УчетПоПодразделениям;
	ПараметрыПолученияОстатков.КПС = Объект.КПССписания;
	ПараметрыПолученияОстатков.КФО = Объект.КФОСписания;

	Для Каждого ТекСтрокаОС Из Объект.КапитальныеВложения Цикл
		
		НоваяСтрока = ПараметрыПолученияОстатков.ТаблицаОС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОС);
		НоваяСтрока.ОсновноеСредство = ТекСтрокаОС.ВнеоборотныйАктив;
	
	КонецЦикла;
	
	ТаблицаОстатков = УправлениеОсновнымиСредствами.ПолучитьОстаткиКапВложений(ПараметрыПолученияОстатков); 
		
	Для Каждого ТекСтрокаОС Из Объект.КапитальныеВложения Цикл
		СтруктураПоиска = Новый Структура("ОсновноеСредство", ТекСтрокаОС.ВнеоборотныйАктив);
		СтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураПоиска);
		Если СтрокиОстатков.Количество() > 0 Тогда
			ТекСтрокаОС.Количество	= СтрокиОстатков[0].КоличествоОстаток;
			ТекСтрокаОС.Сумма		= СтрокиОстатков[0].БалансоваяСтоимость;
			ТекСтрокаОС.Цена		= СтрокиОстатков[0].БалансоваяСтоимость / ?(ТекСтрокаОС.Количество = 0, 1, ТекСтрокаОС.Количество);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыМЗнаСервере()
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Номенклатура,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстаток КАК Сумма,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет = &Счет,
	|			&Субконто,
	|			Организация = &Организация
	|				И КПС = &КПС
	|				И КФО = &КФО) КАК ЖурналПроводокЕПСБУОстатки";
	
	Если Параметры.Ключ.Пустая() Тогда
		Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	Иначе
		Запрос.УстановитьПараметр("Период", Новый Граница(Параметры.Ключ.МоментВремени(), ВидГраницы.Исключая));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Счет", Объект.СчетВложений);
	Запрос.УстановитьПараметр("Субконто", ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр("КПС", Объект.КПССписания);
	Запрос.УстановитьПараметр("КФО", Объект.КФОСписания);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("МассивНФА", Объект.Материалы.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"));
	
	Остатки = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаНоменклатуры Из Объект.Материалы Цикл
	
		СтрокаОстатков = Остатки.Найти(СтрокаНоменклатуры.Номенклатура, "Номенклатура");
		Если СтрокаОстатков = Неопределено Тогда
			СтрокаНоменклатуры.Цена = 0;
			СтрокаНоменклатуры.Сумма = 0;
		Иначе
			Если СтрокаНоменклатуры.Количество = 0 Тогда
				СтрокаНоменклатуры.Количество = СтрокаОстатков.Количество;
			КонецЕсли;
			
			Если СтрокаНоменклатуры.Количество = 0 Или СтрокаНоменклатуры.Количество = СтрокаОстатков.Количество Тогда
				
				СтрокаНоменклатуры.Сумма = СтрокаОстатков.Сумма;
				СтрокаНоменклатуры.Цена = ?(СтрокаОстатков.Количество = 0, СтрокаОстатков.Сумма, СтрокаОстатков.Сумма / СтрокаОстатков.Количество);
				
			Иначе
				
				СтрокаНоменклатуры.Цена = ?(СтрокаОстатков.Количество = 0, СтрокаОстатков.Сумма, СтрокаОстатков.Сумма / СтрокаОстатков.Количество);
				СтрокаНоменклатуры.Сумма = СтрокаНоменклатуры.Цена * СтрокаНоменклатуры.Количество;
				
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла; 
	

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьИРассчитатьСтоимость(РасчетОС = Истина)

	Если Не УправлениеОсновнымиСредствамиКлиент.ПроверитьЗаполнениеОбязательныхРеквизитов(ЭтаФорма, Объект, Истина) Тогда
		Возврат;
	КонецЕсли;
	
	Если РасчетОС Тогда
		РассчитатьСуммыНаСервере();
	Иначе
		РассчитатьСуммыМЗнаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЗакладок(Форма, Объект)

	Элементы = Форма.Элементы;
	
	ДоступностьОС = Ложь;
	ДоступностьМЗ = Ложь;
	
	Если ЗначениеЗаполнено(Объект.СчетВложений) Тогда
		СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Объект.СчетВложений);
		
		Для Индекс = 1 По 3 Цикл
		
			Если СвойстваСчета["ВидСубконто" + Индекс] = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства") Тогда
				ДоступностьОС = Истина;
			ИначеЕсли СвойстваСчета["ВидСубконто" + Индекс] = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Номенклатура") Тогда
				ДоступностьМЗ = Истина;
			КонецЕсли;
		
		КонецЦикла; 
		
	КонецЕсли;
	
	Элементы.КапитальныеВложения.Доступность = ДоступностьОС;
	Если Элементы.СтраницаКапВложения.ПодчиненныеЭлементы.Количество() = 1 Тогда
		Элементы.СтраницаКапВложения.Доступность = Элементы.СтраницаКапВложения.ПодчиненныеЭлементы[0].Доступность;
	КонецЕсли;
	Элементы.Материалы.Доступность = ДоступностьМЗ;
	Если Элементы.СтраницаМатериалы.ПодчиненныеЭлементы.Количество() = 1 Тогда
		Элементы.СтраницаМатериалы.Доступность = Элементы.СтраницаМатериалы.ПодчиненныеЭлементы[0].Доступность;
	КонецЕсли;
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница.Доступность <> Истина Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаРеквизитыСписанияОприходования;
	КонецЕсли;

КонецПроцедуры // УстановитьДоступностьЗакладок()

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	
	СписокПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	Для Каждого ЭлементПодбора Из СписокПодбора Цикл
		
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементПодбора);
		НоваяСтрока.Цена = ?(НоваяСтрока.Количество = 0, НоваяСтрока.Сумма, НоваяСтрока.Сумма / НоваяСтрока.Количество);
		
		Если НоваяСтрока.Сумма = 0 Тогда
			ЕстьНулеваяСуммаВПодборе = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьНулеваяСуммаВПодборе Тогда
		РассчитатьСуммыМЗнаСервере();
	КонецЕсли;
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
