#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьОстатковМатериаловМОЛПодразделение");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость остатков материалов по МОЛ и местам хранения'");
	НастройкиВарианта.Включен = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьОстатковМатериаловМОЛПодразделениеСчет");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость остатков материалов по МОЛ, местам хранения и счетам'");
	НастройкиВарианта.Включен = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ВедомостьОстатковМатериалов");
	НастройкиВарианта.Описание = НСтр("ru = 'Ведомость остатков материалов'");
	НастройкиВарианта.Включен = Истина;
	
КонецПроцедуры

Функция СвойстваОбъектаДляРасшифровкиСтандартнымиОтчетами(ОтчетОбъект) Экспорт
	
	СвойстваОбъекта = Новый Структура;
	Настройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрДата = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОтчета"));
	Если ПараметрДата <> Неопределено И ЗначениеЗаполнено(ПараметрДата.Значение) Тогда
		СвойстваОбъекта.Вставить("НачалоПериода", НачалоГода(ПараметрДата.Значение));
		СвойстваОбъекта.Вставить("КонецПериода", КонецДня(ПараметрДата.Значение));
	Иначе
		Возврат Новый Структура;
	КонецЕсли;
	
	МассивОтчетов = Новый Массив;
	МассивОтчетов.Добавить("ОборотноСальдоваяВедомостьПоСчету");
	МассивОтчетов.Добавить("КарточкаСчета");
	МассивОтчетов.Добавить("АнализСчета");
	МассивОтчетов.Добавить("ОборотыСчета");
	
	СвойстваОбъекта.Вставить("ОтчетыРасшифровки", МассивОтчетов);
	
	МассивОсновныхДействий = Новый Массив;
	СвойстваОбъекта.Вставить("МассивОсновныхДействий", МассивОсновныхДействий);
	
	Возврат СвойстваОбъекта;
	
КонецФункции

#КонецОбласти


#КонецЕсли
