#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	
	ПроверитьДублиСтрок(Ошибки);
	ПроверитьСуществующиеНачисления(Ошибки);
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = Дети.Итог("СуммаКомпенсации");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.КомпенсацияРодительскойПлаты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "ЖурналУчетаКомпенсацииРодительскойПлаты");
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ДанныеЗаполнения = Неопределено Тогда
		ЗаполнитьИзДанныхЗаполнения(Новый Структура, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьИзДанныхЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДублиСтрок(Ошибки)
	
	Таблица = Дети.Выгрузить(, "НомерСтроки, ГруппаДетскогоУчреждения, Ребенок, НастройкаКомпенсации");
	Отбор = Новый Структура("Ребенок, ГруппаДетскогоУчреждения, НастройкаКомпенсации");
	Дубли = Новый Соответствие;
	ШаблонОшибки = НСтр("ru = 'Дублируется сочетание ""Группа детского учреждения"", ""Ребенок"" и ""Настройка расчета"" в строке [СтрокаДубль].
		|Группа [ГруппаДетскогоУчреждения], [Ребенок] и настройка [НастройкаРасчета] уже выбраны в строке [СуществующаяСтрока]'");
	ПараметрыОшибки = Новый Структура("СтрокаДубль, ГруппаДетскогоУчреждения, Ребенок, НастройкаРасчета, СуществующаяСтрока");
	
	ПроверенныеСтроки = Новый Соответствие;
	Для Индекс = 0 По Таблица.Количество() - 1 Цикл
		
		ТекущаяСтрока = Таблица[Индекс];
		
		Если ПроверенныеСтроки.Получить(ТекущаяСтрока.НомерСтроки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Отбор, ТекущаяСтрока);
		
		СтрокиПоОтбору = Таблица.НайтиСтроки(Отбор);
		
		Для Каждого СтрокаПоОтбору Из СтрокиПоОтбору Цикл
			
			ПроверенныеСтроки.Вставить(СтрокаПоОтбору.НомерСтроки, Истина);
			
			Если СтрокаПоОтбору <> ТекущаяСтрока Тогда
				Дубли.Вставить(СтрокаПоОтбору.НомерСтроки, ТекущаяСтрока.НомерСтроки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для НомерСтроки = 1 По Дети.Количество() Цикл
		
		Если Дубли.Получить(НомерСтроки) <> Неопределено Тогда
			
			ТекущаяСтрока = Дети[НомерСтроки - 1];
			
			ПараметрыОшибки.Ребенок = ТекущаяСтрока.Ребенок;
			ПараметрыОшибки.ГруппаДетскогоУчреждения = ТекущаяСтрока.ГруппаДетскогоУчреждения;
			ПараметрыОшибки.НастройкаРасчета = ТекущаяСтрока.НастройкаКомпенсации;
			ПараметрыОшибки.СтрокаДубль = НомерСтроки;
			ПараметрыОшибки.СуществующаяСтрока = Дубли.Получить(НомерСтроки);
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонОшибки, ПараметрыОшибки);
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Дети[%1].НастройкаКомпенсации",
				ТекстОшибки,
				"Дубли",
				НомерСтроки - 1,
				ТекстОшибки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСуществующиеНачисления(Ошибки)
	
	ШаблонТекстНачислений = НСтр("ru = 'Для  ребенка [Ребенок] уже есть начисление компенсации (настройка: [НастройкаКомпенсации]) в периоде с [НачалоПериода] по [ОкончаниеПериода] документом ""[Регистратор]""'");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ТаблицаНачислений.НомерСтроки,
	|	ТаблицаНачислений.Ребенок КАК Ребенок,
	|	ТаблицаНачислений.НастройкаКомпенсации
	|ПОМЕСТИТЬ ТаблицаНачислений
	|ИЗ
	|	&ТаблицаНачислений КАК ТаблицаНачислений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ребенок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.НомерСтроки,
	|	ТаблицаНачислений.Ребенок,
	|	ТаблицаНачислений.НастройкаКомпенсации,
	|	ЖурналУчетаКомпенсацииРодительскойПлаты.Регистратор КАК Регистратор
	|ИЗ
	|	ТаблицаНачислений КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЖурналУчетаКомпенсацииРодительскойПлаты КАК ЖурналУчетаКомпенсацииРодительскойПлаты
	|		ПО ТаблицаНачислений.Ребенок = ЖурналУчетаКомпенсацииРодительскойПлаты.Ребенок
	|			И ТаблицаНачислений.НастройкаКомпенсации = ЖурналУчетаКомпенсацииРодительскойПлаты.НастройкаКомпенсации
	|			И &НачалоПериода = ЖурналУчетаКомпенсацииРодительскойПлаты.НачалоПериода
	|			И &КонецПериода = ЖурналУчетаКомпенсацииРодительскойПлаты.КонецПериода
	|ГДЕ
	|	ЖурналУчетаКомпенсацииРодительскойПлаты.Регистратор <> &Регистратор
	|	И НЕ ЖурналУчетаКомпенсацииРодительскойПлаты.Ребенок ЕСТЬ NULL ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаНачислений", Дети.Выгрузить(, "НомерСтроки, Ребенок, НастройкаКомпенсации"));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ВыборкаНачислений = Запрос.Выполнить().Выбрать();
	
	ПараметрыСообщения = Новый Структура("Ребенок, НастройкаКомпенсации, НачалоПериода, ОкончаниеПериода, Регистратор");
	
	Пока ВыборкаНачислений.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыСообщения, ВыборкаНачислений);
		ПараметрыСообщения.НачалоПериода = Формат(НачалоПериода, "ДЛФ=D");
		ПараметрыСообщения.ОкончаниеПериода = Формат(КонецПериода, "ДЛФ=D");
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекстНачислений,
			ПараметрыСообщения);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
				"Объект.Дети[%1].Ребенок",
				ТекстОшибки,
				"УжеЕстьНачисления",
				ВыборкаНачислений.НомерСтроки - 1,
				ТекстОшибки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИзДанныхЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Дата", ОбщегоНазначенияБГУ.РабочаяДатаПользователя());
	КонецЕсли;
	
	НачалоПериода = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "НачалоПериода", НачалоМесяца(Дата));
	КонецПериода  = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "КонецПериода",  КонецМесяца(Дата));
	
	РасчетЗаНесколькоМесяцев = НачалоМесяца(НачалоПериода) <> НачалоМесяца(КонецПериода);

КонецПроцедуры

#КонецОбласти

#КонецЕсли