#Область ОписаниеПеременных
	
// Используется при изменении ЦМО, для проверки необходимости очистки таблицы
&НаКлиенте
Перем ЦМООтправительДоИзменения; // СправочникСсылка.ЦМО

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);

	РезервированиеНФА.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда   
		ПодготовитьФормуНаСервере();      
		
		Если ЗначениеЗаполнено(Параметры.Основание)
			И ТипЗнч(Параметры.Основание) = Тип("Структура")
			И Параметры.Основание.Свойство("ДокументОснование")
			И ТипЗнч(Параметры.Основание.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
			РассчитатьСуммыНаСервере();
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда
			Подписанты = Новый Структура;
			Подписанты.Вставить("Руководитель", ЗаполнениеРеквизитовОбъектов.СтруктураПодписанта("Руководитель"));
			ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписантов(Объект, Подписанты);
		КонецЕсли;
		
		УстановитьЕстьРешениеОПрекращенииПризнанияАктивом(ЭтотОбъект);

		Если ЭтоВО_СДоговоромВТЧ(ЭтотОбъект) И НЕ Объект.ДоговорВТабличнойЧасти Тогда
			Объект.ДоговорВТабличнойЧасти = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервчиныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервчиныхДокументов 
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ВидМежотчетногоПериода = ?(Объект.Дата = КонецГода(Объект.Дата) И ОтразитьВМежотчетномПериоде,
		ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"),
		ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// ГолосованиеКомиссии
	Если РешениеСотрудникаМодифицированность Тогда
		СохранитьРезультатыГолосованияНаСервере(Сотрудник, РезультатыГолосованияСотрудника(Объект.ОсновныеСредства));
	КонецЕсли;
	// Конец ГолосованиеКомиссии
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимостьДанныхДрагМатериалов();
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	Оповестить("ДокументыПоУчетуОСИзменение");
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьДополнительныеРеквизитыФормы();
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект, "ОсновныеСредства");
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыДрагМатериаловДляМЦ();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ПрослеживаемостьФормыБГУКлиент.СобытиеВыборПодбораРНПТ(ИсточникВыбора) Тогда
		ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСчетаУчетаОС();
	
	УстановитьДоступностьКомиссии();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);

КонецПроцедуры 

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ОтразитьВМежотчетномПериоде", ОтразитьВМежотчетномПериоде);
	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьДатаСПереходомНачалаПрослеживаемости
		ИЛИ (ВедетсяУчетПрослеживаемыхТоваров И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
		УстановитьДопустимыеКодыОперацийПрослеживаемости(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ДопПараметры = УправлениеОсновнымиСредствамиКлиент.ДопПараметры_ОбработкаВыбора_ОчисткаТабЧастей();
	ДопПараметры.Вставить("ИмяРеквизита", "Организация");
	ДопПараметры.Вставить("ЗаголовокРеквизита", "Организация");
	ДопПараметры.ИменаТабЧастей.Вставить("ОсновныеСредства", "Основные средства, НМА, НПА");
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбора_ОчисткаТабЧастей(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура ИФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДопПараметры = УправлениеОсновнымиСредствамиКлиент.ДопПараметры_ОбработкаВыбора_ОчисткаТабЧастей();
	ДопПараметры.Вставить("ИмяРеквизита", "ИФО");
	ДопПараметры.Вставить("ЗаголовокРеквизита", "ИФО");
	ДопПараметры.ИменаТабЧастей.Вставить("ОсновныеСредства", "Основные средства, НМА, НПА");
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбора_ОчисткаТабЧастей(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ДопПараметры = УправлениеОсновнымиСредствамиКлиент.ДопПараметры_ОбработкаВыбора_ОчисткаТабЧастей();
	ДопПараметры.Вставить("ИмяРеквизита", "ВидОперации");
	ДопПараметры.Вставить("ЗаголовокРеквизита", "Вид списания");
	ДопПараметры.ИменаТабЧастей.Вставить("ОсновныеСредства", "Основные средства, НМА, НПА");
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбора_ОчисткаТабЧастей(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ПриИзмененииВидаОперации();
КонецПроцедуры

&НаКлиенте
Процедура ВидИмуществаПриИзменении(Элемент)
	УстановитьРеквизитДоговорВТабличнойЧасти();
	УстановитьОтборСчетаУчетаОС();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЦМООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЦМООтправительДоИзменения = Объект.ЦМО;
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПриИзменении(Элемент)
	// Действия при изменении ЦМО отправителя должны быть прописаны в процедуре ОбработкаИзмененияЦМООтправителя
	ПараметрыИзмененияЦМО = УправлениеНФАКлиент.ПараметрыИзмененияРеквизитаСОчисткойТЧ();
	ПараметрыИзмененияЦМО.ЗначениеДоИзменения = ЦМООтправительДоИзменения;
	ПараметрыИзмененияЦМО.ИмяРеквизита = "ЦМО";
	ПараметрыИзмененияЦМО.СинонимРеквизита = НСтр("ru = 'МОЛ/Место хранения'");
	ПараметрыИзмененияЦМО.ИменаТабличныхЧастей = "ОсновныеСредства, ДрагоценныеМатериалы, СведенияПрослеживаемости";

	//// Можно добавить обработчик ПриИзмененииЦМООТправитель
	//ОбработчикПриИзмененииЦМО = Новый ОписаниеОповещения("ОбработкаИзмененияЦМООтправителя", ЭтотОбъект);
	//ПараметрыИзмененияЦМО.ОбработчикПриИзменении = ОбработчикПриИзмененииЦМО;
	
	УправлениеНФАКлиент.ПриИзмененииРеквизитаСОчисткойТЧ(Объект, ПараметрыИзмененияЦМО);
КонецПроцедуры

&НаКлиенте
Процедура КФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(Объект.Организация, Объект.ИФО, Объект.КФО, Объект.Дата,,);
	
КонецПроцедуры

&НаКлиенте
Процедура КФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДопПараметры = УправлениеОсновнымиСредствамиКлиент.ДопПараметры_ОбработкаВыбора_ОчисткаТабЧастей();
	ДопПараметры.Вставить("ИмяРеквизита", "КФО");
	ДопПараметры.Вставить("ЗаголовокРеквизита", "КФО");
	ДопПараметры.ИменаТабЧастей.Вставить("ОсновныеСредства", "Основные средства, НМА, НПА");
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбора_ОчисткаТабЧастей(
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ДопПараметры);
КонецПроцедуры

&НаКлиенте
Процедура ВключатьМЦВСоставКапвложенийПриИзменении(Элемент)
	
	Если Объект.ВключатьМЦВСоставКапвложений 
								И Объект.ДрагоценныеМатериалы.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПередачиДрагМатериалов", ЭтотОбъект);
		ТекстПредупреждения = НСтр("ru = 'Будет очищена табличная часть ""Содержание драг. материалов"", продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет, 0);
	Иначе
		УстановитьВидимостьЭлементов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаДрагМатериалы" Тогда
		
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
		
		ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтаФорма);
		ОбновитьТекстЗаголовковВсехСтрокТаблицыДрагМатериаловДляМЦ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьНаХранениеПриИзменении(Элемент)
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	Иначе
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	КонецЕсли;
	
	ОтразитьВМежотчетномПериодеПриИзмененииНаСервере();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьВМежотчетномПериодеПриИзмененииНаСервере()
	
	// Может измениться дата определения параметров учетной политики.
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	//ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РешениеПриИзменении(Элемент)                                                          
	УстановитьЕстьРешениеОПрекращенииПризнанияАктивом(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Решение) Тогда
		УстановитьВидимостьЭлементов(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	СсылкаЦелевогоДокумента = Неопределено;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СсылкаЦелевогоДокумента = Объект.Ссылка;
	КонецЕсли;	
	ДопПараметры = Новый Структура("СсылкаЦелевогоДокумента", СсылкаЦелевогоДокумента);
	Оповещение = Новый ОписаниеОповещения("РешениеПриИзменении_Завершение", ЭтотОбъект, ДопПараметры);
	УправлениеОсновнымиСредствамиКлиент.ВвестиЦелевойДокументНаОсновании(
		Объект.Решение, ЭтотОбъект, Оповещение);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДоговорВТабличнойЧастиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура КФОВТабличнойЧастиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРезервированиеПриИзменении(Элемент)
	РезервированиеНФАКлиент.ПриИзмененииПереключателяРезервирования(ЭтотОбъект, Объект);
	ПереключательРезервированиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АннулированПриИзменении(Элемент)
	РезервированиеНФАКлиент.ПриИзмененииФлажкаАннулирован(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОсновныеСредства

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если РешениеСотрудникаМодифицированность
		И ЗначениеЗаполнено(ВыбранныйСотрудник)
		И ВыбранныйСотрудник <> Сотрудник Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Сотрудник", ВыбранныйСотрудник);
		ДопПараметры.Вставить("РезультатыГолосования", РезультатыГолосованияСотрудника(Объект.ОсновныеСредства));
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), ВыбранныйСотрудник);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	СотрудникПриИзмененииНаСервере();
	
	ВыбранныйСотрудник = Сотрудник;
	
	РешениеСотрудникаМодифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	РаботаСФайламиБГУ.ПолучитьФайлСотрудника(Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборПрисутствующих = Новый Структура("Отсутствует", Ложь);
	ПрисутствующиеЧленыКомиссии = Объект.СоставКомиссии.НайтиСтроки(ОтборПрисутствующих);
	
	// Выбирается из присутствующих членов комиссии.
	Элемент.СписокВыбора.Очистить();
	Элемент.СписокВыбора.Добавить(Объект.Председатель);
	Для Каждого ЧленКомиссии Из ПрисутствующиеЧленыКомиссии Цикл
		Элемент.СписокВыбора.Добавить(ЧленКомиссии.Сотрудник);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Организация",,Отказ);
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидИмущества) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Вид имущества'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ВидИмущества",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	ОсновноеСредствоПриИзмененииНаСервере(ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРешениеСотрудникаПоРезолюцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.РешениеСотрудникаПоРезолюции = ВыбранноеЗначение;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваПрослеживаемостиПриВыбореОсновногоСредства(ТекущиеДанные, ДанныеОбъектаОС)
	
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		ТекущиеДанные.ПрослеживаемыйТовар = ПрослеживаемостьБГУ.ПрослеживаемоеОсновноеСредство(ТекущиеДанные.ОсновноеСредство, Объект);
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ТекущиеДанные.СтранаПроисхождения = ДанныеОбъектаОС.СтранаПроисхождения;
			Если НЕ ЕстьПрослеживаемыеТовары Тогда
				ЕстьПрослеживаемыеТовары = Истина;
				УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерПриИзменении(Элемент)
	
	ОсновноеСредствоПриИзмененииНаСервере(Элементы.ОсновныеСредства.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетУчетаОСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчета) Тогда
		ТекущиеДанные.УчетПоКПС = Ложь;
	Иначе
		ТекущиеДанные.УчетПоКПС = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.СчетУчета).УчетПоКПС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСтоимостьЕдиницыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	ТекКоличество = ?(ТекущиеДанные.Количество = 0, 1, ТекущиеДанные.Количество);
	
	ТекущиеДанные.Сумма = ТекущиеДанные.СтоимостьЕдиницы * ТекКоличество;
	ТекущиеДанные.СуммаАмортизации = Мин(ТекущиеДанные.СуммаАмортизации, ТекущиеДанные.Сумма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если ТекущиеДанные.Количество <> 0 Тогда
		ТекущиеДанные.СтоимостьЕдиницы = ТекущиеДанные.Сумма / ТекущиеДанные.Количество;
	КонецЕсли;
	ТекущиеДанные.СуммаАмортизации = Мин(ТекущиеДанные.СуммаАмортизации, ТекущиеДанные.Сумма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений") Тогда
		УправлениеОсновнымиСредствамиКлиентСервер.ПроверитьУстановитьКоличествоОСВСтроке(ТекущиеДанные);
	КонецЕсли;	

	ТекКоличество = ?(ТекущиеДанные.Количество = 0, 1, ТекущиеДанные.Количество);
	
	ТекущиеДанные.Сумма = ТекущиеДанные.СтоимостьЕдиницы * ТекКоличество;
	ТекущиеДанные.СуммаАмортизации = Мин(ТекущиеДанные.СуммаАмортизации, ТекущиеДанные.Сумма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередУдалением(Элемент, Отказ)
	
	ОбъектНаУдаление = Элементы.ОсновныеСредства.ТекущиеДанные.ОсновноеСредство;
	ИнвНомерОбъектаНаУдаление = Элементы.ОсновныеСредства.ТекущиеДанные.ИнвентарныйНомер;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ОбъектНаУдаление);
	ПараметрыОтбора.Вставить("ИнвНомер", ИнвНомерОбъектаНаУдаление);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()<>0 Тогда
		ПараметрыОповещения = Новый Структура("НайденныеСтроки", НайденныеСтроки);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОДрагМатериалах", ЭтотОбъект, ПараметрыОповещения);
		Шаблон =  НСтр("ru = 'Удалить данные о содержании драгоценных материалов в удаленном объекте НФА ""%1"" на закладке ""Драгоценные материалы""?'");
		ПоказатьВопрос(Оповещение, СтрШаблон(Шаблон, СокрЛП(ОбъектНаУдаление)), РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);

		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений") 
			И НЕ ТекущиеДанные.ОтразитьВКарточкеКапвложений Тогда
			ТекущиеДанные.ОтразитьВКарточкеКапвложений = Истина;
		КонецЕсли;	
		
		//Если Не Копирование Тогда
		//	ТекущиеДанные.Количество = 1;
		//	ПересчитатьСуммыТекущейСтроки(ТекущиеДанные);
		//	ОбновитьТекстОтражениеВУчетеВСтрокеТаблицыОС(ТекущиеДанные);
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрослеживаемостьФормыБГУКлиент.ОсновныеСредстваВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
	ОбщегоНазначенияБГУКлиент.РешениеСотрудникаПоРезолюцииВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПослеУдаления(Элемент)
	
	Если ВедетсяУчетПрослеживаемыхТоваров И ЕстьПрослеживаемыеТовары Тогда
		ОсновныеСредстваПослеУдаленияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОсновныеСредстваПослеУдаленияНаСервере()
	
	ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(Объект.ОсновныеСредства);
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ПараметрыПодбора = ПрослеживаемостьФормыБГУКлиент.ПараметрыОткрытияФормыПодбораРНПТ("ОсновныеСредства");
	ПараметрыПодбора.ЭтоПоступление = Ложь;
	ПараметрыПодбора.ТекущийДокумент = Объект.Ссылка;
	ПараметрыПодбора.Период = Объект.Дата;
	ПараметрыПодбора.ВнеоборотныйАктив = ТекущиеДанные.ОсновноеСредство;
	ПараметрыПодбора.Организация = Объект.Организация;
	ПараметрыПодбора.ИмяКолонкиНоменклатура = "ОсновноеСредство";
	ПараметрыПодбора.ПредставлениеКолонкиНоменклатура = НСтр("ru = 'Основное средство'");
	ПараметрыПодбора.ИмяФормыПодбора = "ФормаПодбораРНПТДляОС";
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, ПараметрыПодбора);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРНПТОчистка(Элемент, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар Тогда
		УдалитьСтрокиРНПТ(СтрокаТабличнойЧасти.ИдентификаторСтроки);
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиентСервер.ОчиститьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПричинаСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ПричинаСписанияНачалоВыбора(
		Элемент, Элементы.ОсновныеСредства.ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПричинаСписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ПричинаСписанияОбработкаВыбора(
		Элементы.ОсновныеСредства.ТекущиеДанные, ВыбранноеЗначение);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНФАДокументаОснования

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииСтроки(Элемент)
	
	Если (Элемент.ТекущиеДанные <> Неопределено) И (ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА) Тогда
		ПодключитьОбработчикОжидания("ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДрагоценныеМатериалы

&НаКлиенте
Процедура ДрагоценныеМатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ЭтоСписаниеКапвложений = 
				Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений");
				
	Если НоваяСтрока И НЕ Копирование И ЭтоСписаниеКапвложений Тогда
		
		ТекущиеДанные = Элементы.ДрагоценныеМатериалы.ТекущиеДанные;
		
		ОбновитьТекстЗаголовковВСтрокеТаблицыДрагМатериалов(ТекущиеДанные);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДрагоценныеМатериалыОбъектМЦОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ Элемент.ТекстРедактирования = Строка(ВыбранноеЗначение) Тогда
		
		ТекущиеДанные = Элементы.ДрагоценныеМатериалы.ТекущиеДанные;
		ТекущиеДанные.ОбъектМЦ = ВыбранноеЗначение;
		
		ОбновитьТекстЗаголовковВСтрокеТаблицыДрагМатериалов(ТекущиеДанные);
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	УстановитьДоступностьКомиссии();
	
	Если Не ЗначениеЗаполнено(Объект.Комиссия) Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = ОбщегоНазначенияБГУКлиент.СтруктураПараметровВыбораКомисии(ЭтотОбъект);
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Объект.Комиссия, ДопПараметры, Объект);
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1СотрудникОбработкаВыбора(
	Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Элементы.СоставКомиссии1.ТекущиеДанные.Сотрудник Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1СотрудникПриИзменении(Элемент)                 
	УправлениеОсновнымиСредствамиКлиент.ЗаполнитьДанныеЧленаКомиссии(
		Элементы.СоставКомиссии1.ТекущиеДанные, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПредседательОбработкаВыбора(
	Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Объект.Председатель Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПредседательПриИзменении(Элемент)
	УправлениеОсновнымиСредствамиКлиент.ЗаполнитьДанныеЧленаКомиссии(
		Объект, Объект.Дата, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРассчитатьСтоимостьОС(Команда)
	
	РассчитатьСуммы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыТЧ(Команда)
	Реквизиты = "ПричинаСписанияСсылка, РезолюцияКомиссии, МероприятияПоСписанию";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыТЧЗавершение", ЭтотОбъект);
	
	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект, 
	"СписаниеОбъектовОС", "ОсновныеСредства", "ОсновныеСредства", 
	Реквизиты, ОписаниеОповещения);
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьРеквизитыТЧВосстановление(Команда)
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("СчетУчетаВосстановление", Новый Структура);
	Реквизиты.СчетУчетаВосстановление.Вставить("Счета", "101.00");
	Реквизиты.СчетУчетаВосстановление.Вставить("ВИерархии", Истина);
	Реквизиты.СчетУчетаВосстановление.Вставить("Дата", Объект.Дата);

	Реквизиты.Вставить("КПСВосстановление", Новый Структура);
	Реквизиты.КПСВосстановление.Вставить("Дата", Объект.Дата);
	Реквизиты.КПСВосстановление.Вставить("Организация", Объект.Организация);
	Реквизиты.КПСВосстановление.Вставить("ИФО", Объект.ИФО);
	
	ВидыПоказателей = Новый Массив;
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.Произвольный"));
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.АУИБУ"));
	Реквизиты.КПСВосстановление.Вставить("ВидыПоказателей", ВидыПоказателей);
	
	Реквизиты.Вставить("ЦМОВосстановление", Новый Структура);
	Реквизиты.ЦМОВосстановление.Вставить("Организация", Объект.Организация);
	
	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект, 
	"СписаниеОбъектовОС", "ОсновныеСредства", "ВосстановлениеОС", Реквизиты);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыТЧЗавершение(Результат, ДопПараметры) Экспорт
	НаименованиеПричиныСписания = "";
	Если Результат.Свойство("ПричинаСписанияСсылка") И ЗначениеЗаполнено(Результат.ПричинаСписанияСсылка) Тогда
		НаименованиеПричиныСписания = НаименованиеПричиныСписания(Результат.ПричинаСписанияСсылка);
	КонецЕсли;	                                                                                  
	Если ЗначениеЗаполнено(НаименованиеПричиныСписания) Тогда
		Для каждого ИдентификаторСтроки Из Элементы.ОсновныеСредства.ВыделенныеСтроки Цикл
			ТекущиеДанные = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
			ТекущиеДанные.ПричинаСписания = НаименованиеПричиныСписания;
		КонецЦикла;                         
	КонецЕсли;	
КонецПроцедуры	
	
&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ОбщегоНазначенияБГУКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии();
	ОбщегоНазначенияБГУКлиент.НачатьВыборПредседателяКомиссии(ЭтотОбъект, ИменаРеквизитов);
	
КонецПроцедуры

// ГолосованиеКомиссии
&НаКлиенте
Процедура КомандаСохранитьРезультатыГолосования(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Сотрудник", Сотрудник);
	ДопПараметры.Вставить("РезультатыГолосования", РезультатыГолосованияСотрудника(Объект.ОсновныеСредства));
	
	Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), Сотрудник);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноЗаВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "За");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноПротивВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "Против");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры
// Конец ГолосованиеКомиссии

// Файлы сотрудников
&НаКлиенте
Процедура НадписьФайлНеВыбранНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		СтандартнаяОбработка = Ложь;
		ОповещениеФайла = Новый ОписаниеОповещения("ОбработатьВыборФайлаСотрудника", ЭтотОбъект);
		РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элементы.ФайлСотрудника, ,ОповещениеФайла);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУдалитьФайлНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Или Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрепитьФайлСотрудникаНаСервере();
	
КонецПроцедуры
// Конец Файлы сотрудников

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьСписокДМДляСписания(Команда)
	ЗаполнитьСписокДМДляСписанияНаСервере();
	
	ЗаполнитьОбъектыСДрагМатериалами();
	ЗаполнитьКлючиСтрокДрагМатериалов();
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтаФорма); 
	ОбновитьТекстЗаголовковВсехСтрокТаблицыДрагМатериаловДляМЦ();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОтбораДМПоОбъекту(Команда)
	
	ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА = НЕ ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА;
	УстановитьВидимостьДанныхДрагМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОбъектыВСправочнике(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ПоказатьОсновныеСредстваВСправочнике(
		ЭтотОбъект, "ОсновныеСредства", "ОсновноеСредство");
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПереключательРезервированиеПриИзмененииНаСервере()
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьРеквизитДоговорВТабличнойЧасти()
	Если НЕ ЭтоВО_СДоговоромВТЧ(ЭтотОбъект) И Объект.ДоговорВТабличнойЧасти Тогда
		Объект.ДоговорВТабличнойЧасти = Ложь;
	ИначеЕсли ЭтоВО_СДоговоромВТЧ(ЭтотОбъект) И НЕ Объект.ДоговорВТабличнойЧасти Тогда
		Объект.ДоговорВТабличнойЧасти = Истина;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииВидаОперации()
	Если НЕ Объект.ВидОперации = 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеСобственныхОСОперУчет")
		И НЕ Объект.ВидОперации = 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСнаХранении")
		И Объект.ВосстановитьНаБалансе Тогда
			
		// Реквизит "ВосстановитьНаБалансе" стал невидимым и если он включен, его нужно выключить. От этого
		// зависит выбор типовой бухгалтерской операции
		Объект.ВосстановитьНаБалансе = Ложь;
	КонецЕсли;		 

	УстановитьРеквизитДоговорВТабличнойЧасти();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьОбязательностьЭлементовФормы(ЭтотОбъект);
	УстановитьОтборСчетаУчетаОС();
	
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	ОтключитьУчетВКарточкахКапвложений();
КонецПроцедуры	

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Решение сотрудника.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.За);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.ОсновныеСредстваРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОсновныеСредства.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.Против);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);
	
КонецПроцедуры

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
	//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
	ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(Объект.ОсновныеСредства);
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	УстановитьДопустимыеКодыОперацийПрослеживаемости(ЭтотОбъект);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект, "ОсновныеСредства");
	
	ЭтоСписаниеКапвложений = 	
		     Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений"); 
	ВедетсяУчетДрагМатериаловВМЦКапвложений = УчетДрагМатериалов.ПолучитьКонстантуВестиУчетДрагМатериаловВМЦКапвложений()
		ИЛИ (ЭтоСписаниеКапвложений И Объект.ДрагоценныеМатериалы.Количество() > 0);
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	ЗаполнитьДополнительныеРеквизитыФормы();
	
	УстановитьВидимостьЭлементов(ЭтаФорма);
	УстановитьОбязательностьЭлементовФормы(ЭтаФорма);
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтаФорма, Объект);
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыДрагМатериаловДляМЦ();

	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	РезервированиеНФАКлиентСервер.УстановитьПереключательРезервирование(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма, Объект)
	
	СвязанныеРеквизиты = Новый Массив;
	СвязанныеРеквизиты.Добавить("Подразделение");
	СвязанныеРеквизиты.Добавить("ЦМО");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		СвязанныеРеквизиты, "Доступность", ЗначениеЗаполнено(Объект.Организация));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОбязательностьЭлементовФормы(Форма)
	
	Объект = Форма.Объект;
	ЦМООбязательно = Объект.ВидОперации <> ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений");
	
	Если ЦМООбязательно Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЦМО",
			"АвтоотметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЦМО",
			"ОтметкаНезаполненного", Не ЗначениеЗаполнено(Объект.ЦМО));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЦМО",
			"АвтоотметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЦМО",
			"ОтметкаНезаполненного", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	ВидОперации = Объект.ВидОперации;
	Элементы = Форма.Элементы;
	
	ЭтоСписаниеКапвложений = 	
		     Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений");
	
	ВО_СписаниеСобственныхОС = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеСобственныхОС");
	ВО_СписаниеСобственныхОСОперУчет = 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеСобственныхОСОперУчет");
	ВО_СписаниеОСнаХранении = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСнаХранении");
	ВО_СписаниеОСПолученныхВПользование = 
		ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСПолученныхВПользование");
	ВО_СписаниеКапвложений = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений");
	
	ВидимостьРеквизитовАмортизации = (ВидОперации = ВО_СписаниеСобственныхОС);
	ВидимостьРеквизитовХранения =
		(ВидОперации = ВО_СписаниеСобственныхОС ИЛИ ВидОперации = ВО_СписаниеСобственныхОСОперУчет);
	ВидимостьРеквизитовВосстановления =
		(ВидОперации = ВО_СписаниеСобственныхОСОперУчет ИЛИ ВидОперации = ВО_СписаниеОСнаХранении);
		
	ЭлементыАмортизации = Новый Массив;
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСуммаАмортизацииНакопленная");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСуммаАмортизацииЗаТекущийМесяц");
	ЭлементыАмортизации.Добавить("ОсновныеСредстваСуммаОбесценения");
		
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыАмортизации, "Видимость", ВидимостьРеквизитовАмортизации);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаПолучатель", "Видимость", ВидимостьРеквизитовХранения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ВосстановитьНаБалансе", "Видимость", ВидимостьРеквизитовВосстановления);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтраницаВосстановлениеОС", "Видимость", ВидимостьРеквизитовВосстановления И Объект.ВосстановитьНаБалансе);
	
	ВидимостьЭлементовКарточки = (ВидОперации = ВО_СписаниеКапвложений);
	ЭлементыКарточкаКапвложений = Новый Массив;
	ЭлементыКарточкаКапвложений.Добавить("ОсновныеСредстваГруппаКарточкаКапвложений");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыКарточкаКапвложений, "Видимость", ВидимостьЭлементовКарточки);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ВидОперации", "Доступность", НЕ Объект.ЕстьРешениеОПрекращенииПризнанияАктивом);

	ДоступностьКнопкиРассчитать = (
		(ВидОперации = ВО_СписаниеСобственныхОС
		ИЛИ ВидОперации = ВО_СписаниеКапвложений
		ИЛИ ВидОперации = ВО_СписаниеСобственныхОСОперУчет
		ИЛИ ВидОперации = ВО_СписаниеОСнаХранении
		ИЛИ ВидОперации = ВО_СписаниеОСПолученныхВПользование
		)
		И НЕ Объект.ЕстьРешениеОПрекращенииПризнанияАктивом
		);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОсновныеСредстваКомандаРассчитатьСтоимостьОС", "Доступность", ДоступностьКнопкиРассчитать);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДоговорВТабличнойЧасти", "Видимость", ЭтоВО_СДоговоромВТЧ(Форма));

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОсновныеСредстваКонтрагентДоговор", "Видимость", Объект.ДоговорВТабличнойЧасти);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КФО", "Видимость", НЕ Объект.КФОВТабличнойЧасти);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОсновныеСредстваКФО", "Видимость", Объект.КФОВТабличнойЧасти);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДрагоценныеМатериалыГруппаМЦ", "Видимость", ЭтоСписаниеКапвложений И Форма.ВедетсяУчетДрагМатериаловВМЦКапвложений);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ДрагоценныеМатериалыИнвНомер", "Видимость", НЕ (ЭтоСписаниеКапвложений И Форма.ВедетсяУчетДрагМатериаловВМЦКапвложений));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,"ВключатьМЦВСоставКапвложений",
		"Видимость", Форма.ВедетсяУчетДрагМатериаловВМЦКапвложений И (ВидОперации = ВО_СписаниеСобственныхОС));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,"ДрагоценныеМатериалы",
		"Доступность", НЕ (Объект.ВключатьМЦВСоставКапвложений И (ВидОперации = ВО_СписаниеСобственныхОС)));	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОсновныеСредстваИнвентарныйНомер", "Видимость", НЕ ЭтоСписаниеКапвложений);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодыСчетовУчетаОСПоВидуОперацииИИмущества(ВидОперации, ВидИмущества, ВосстановитьНаБалансе) Экспорт
	Возврат Документы.СписаниеОбъектовОС.КодыСчетовУчетаОСПоВидуОперацииИИмущества(ВидОперации, ВидИмущества, ВосстановитьНаБалансе);
КонецФункции
	
&НаКлиенте
Процедура УстановитьОтборСчетаУчетаОС()
	КодыСчетов = КодыСчетовУчетаОСПоВидуОперацииИИмущества(Объект.ВидОперации, Объект.ВидИмущества, Объект.ВосстановитьНаБалансе);
	КодыСчетов = ?(КодыСчетов = "", "-", КодыСчетов);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыФормы()
	
	МассивОбъектовОС = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	ДанныеОбъектовОС = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивОбъектовОС, "ГрупповойУчет,ВидНФА");
	
	Для каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		
		ДанныеОбъектаОС = ДанныеОбъектовОС.Получить(СтрокаТаблицы.ОсновноеСредство);
		Если ДанныеОбъектаОС <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеОбъектаОС, "ГрупповойУчет,ВидНФА");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СчетУчета) Тогда
			СтрокаТаблицы.УчетПоКПС = Ложь;
		Иначе
			СтрокаТаблицы.УчетПоКПС = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаТаблицы.СчетУчета).УчетПоКПС;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомиссии()
	
	ЕстьКомиссия = ЗначениеЗаполнено(Объект.Комиссия);
	
	Элементы.ГруппаИндикаторКворумаПрисутствия.Видимость = ЕстьКомиссия;
	Элементы.ГруппаПриказОНазначенииКомиссии.ТолькоПросмотр = ЕстьКомиссия;
	//Элементы.ГруппаПредседательКомиссии.ТолькоПросмотр = ЕстьКомиссия;
	Элементы.Председатель.Видимость = ЕстьКомиссия;
	Элементы.ВыбратьПредседателяКомиссии.Видимость = Не ЕстьКомиссия;
	Элементы.СоставКомиссии.Видимость = Не ЕстьКомиссия;
	Элементы.СоставКомиссии1.Видимость = ЕстьКомиссия;
	Элементы.ЗаключениеКомиссии.Видимость = Не ЕстьКомиссия;
	
КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
КонецПроцедуры

// Основные средства

&НаКлиенте
Процедура РассчитатьСуммы()
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		// Если решение заполнено, документ движений не формирует, никакие дополнительные данные не нужны
		Возврат;
	КонецЕсли;	
	
	Если Объект.Проведен Тогда
		ТекстСообщения = НСтр("ru = 'Расчет доступен только в непроведенном документе'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	РассчитатьСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыНаСервере()
	
	ТаблицаОС = УправлениеОсновнымиСредствами.ПустаяТаблицаОС_ДляРасчетаУчетныхДанных();
	Для каждого СтрокаТЧ из Объект.ОсновныеСредства Цикл
		НоваяСтрока = ТаблицаОС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
	КонецЦикла;	
	
	ТабОстатков = УправлениеОсновнымиСредствами.ТаблицаУчетныхДанных(ПараметрыПолученияУчетныхДанных(ТаблицаОС));
	
	Для каждого СтрокаТЧ из Объект.ОсновныеСредства Цикл
		ЗаполнитьСтрокуТЧ(СтрокаТЧ, ТабОстатков);
	КонецЦикла;	
	
	РассчитатьСуммуАмортизацииЗаТекущийМесяц();
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидОперации");
	СтруктураРеквизитов.Вставить("ВидИмущества", "Вид имущества");
	СтруктураРеквизитов.Вставить("Организация");
	Если НЕ Объект.КФОВТабличнойЧасти Тогда
		СтруктураРеквизитов.Вставить("КФО");
	КонецЕсли;	
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
		СтруктураРеквизитов.Вставить("ИФО");
	КонецЕсли;
	Если Объект.ВидОперации <> ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений") Тогда
		
		СтруктураРеквизитов.Вставить("ЦМО", "МОЛ/Место хранения");
		
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям Тогда
		Если Элементы.Подразделение.ОтметкаНезаполненного Тогда
			
			СтруктураРеквизитов.Вставить("Подразделение");
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация", Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО", Объект.ИФО);
	Если НЕ Объект.КФОВТабличнойЧасти Тогда
		ПараметрыПодбора.Отбор.Вставить("КФО", Объект.КФО);
	КонецЕсли;	
	ПараметрыПодбора.Отбор.Вставить("Счет", КодыСчетов);
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений")
		Или Объект.Дата >= '20210101' Тогда
		ПараметрыПодбора.Отбор.Вставить("ЦМО", Объект.ЦМО);
		ПараметрыПодбора.Отбор.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеСобственныхОС") Тогда
		ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе");
		ПараметрыПодбора.Вставить("НужнаАмортизация", Истина);
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений") Тогда
		ВидРаспоряжения = "Вложения";
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеСобственныхОСОперУчет") Тогда
		ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ОперативныйУчет");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСПолученныхВПользование") Тогда
		ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.ПолученоВПользование");
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСнаХранении") Тогда
		ВидРаспоряжения = ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаХранении");
	Иначе
		ВидРаспоряжения = Неопределено;
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения", ВидРаспоряжения);

	Если НЕ Объект.ДоговорВТабличнойЧасти Тогда
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСПолученныхВПользование")
			Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСнаХранении") Тогда
			ПараметрыПодбора.Вставить("СкрытьКолонки", "Контрагент");
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	ПараметрыПодбора.Вставить("КолонкиКорзины", Новый Структура("Цена", "СтоимостьЕдиницы"));
	ПараметрыПодбора.Вставить("ДоговорВТабличнойЧасти", Объект.ДоговорВТабличнойЧасти);
	ПараметрыПодбора.Вставить("ДокументСРезервированиемОС", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОсновныхСредствНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()
	
	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);
	
КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОсновныхСредствНаСервере(Знач ВыбранноеЗначение)
	
	ДобавленныеСтроки = УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(
		Объект.ОсновныеСредства, ВыбранноеЗначение, , "ОсновноеСредство,ИнвентарныйНомер");
		
	Для Каждого НоваяСтрока Из ДобавленныеСтроки Цикл
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		Если НЕ НоваяСтрока.ОтразитьВКарточкеКапвложений Тогда
			НоваяСтрока.ОтразитьВКарточкеКапвложений = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	ЗаполнитьДополнительныеРеквизитыФормы();
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		УправлениеОсновнымиСредствамиКлиентСервер.ПроверитьУстановитьКоличествоОСВСтроке(СтрокаТаблицы);
	КонецЦикла;
	
	//РассчитатьСуммыНаСервере();
	РассчитатьСуммуАмортизацииЗаТекущийМесяц();
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		ПроверяемыеОС = Новый Массив;
		Для Каждого Строка Из ДобавленныеСтроки Цикл
			ПроверяемыеОС.Добавить(Строка.ОсновноеСредство);
		КонецЦикла;
		ПрослеживаемыеОсновныеСредства = ПрослеживаемостьБГУ.ПрослеживаемыеОсновныеСредства(Объект, ПроверяемыеОС);
		СтраныОС = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ПроверяемыеОС, "СтранаПроисхождения");
		Для каждого Строка Из ДобавленныеСтроки Цикл
			СостояниеПрослеживаемости = ПрослеживаемыеОсновныеСредства.Получить(Строка.ОсновноеСредство);
			Если СостояниеПрослеживаемости <> Неопределено Тогда
				Строка.ПрослеживаемыйТовар = СостояниеПрослеживаемости;
				ЕстьПрослеживаемыеТовары = ЕстьПрослеживаемыеТовары ИЛИ СостояниеПрослеживаемости;
			КонецЕсли;
			СтранаОС = СтраныОС.Получить(Строка.ОсновноеСредство);
			Если СтранаОС <> Неопределено Тогда
				Строка.СтранаПроисхождения = СтранаОС;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЕстьПрослеживаемыеТовары Тогда
		УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#Область УчетДрагМатериалов

&НаСервере
Процедура ЗаполнитьСписокДМДляСписанияНаСервере()
	
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект, ДатыПроведенияДокументов.ДатаПроведения);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыПолученияОстатков.Ссылка) Тогда
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Период, ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков);
	
	УчетДрагМатериалов.ЗаполнитьИсточникиОбразованияЛомаОтходовДрагМатериалов(Объект.Организация, Объект.ДрагоценныеМатериалы, Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков)
	
	ТаблицаСписанияОбъектов = Объект.ОсновныеСредства.Выгрузить(, "ОсновноеСредство,ИнвентарныйНомер,Количество");
	ТаблицаСписанияОбъектов.Колонки.ОсновноеСредство.Имя = "ОбъектНФА";
	ТаблицаСписанияОбъектов.Колонки.ИнвентарныйНомер.Имя = "ИнвНомер";
	
	ЭтоСписаниеКапвложений = 
			Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеКапвложений;
			
	Если ЭтоСписаниеКапвложений И ВедетсяУчетДрагМатериаловВМЦКапвложений Тогда
		ОстаткиДМ = УчетДрагМатериалов.ЗаполнитьДМДляСписанияКапвложений(Объект.Организация, ТаблицаСписанияОбъектов, ПериодОстатков);		
	Иначе			
		ОстаткиДМ = УчетДрагМатериалов.ЗаполнитьДМДляСписанияОС(Объект.Организация, ТаблицаСписанияОбъектов, ПериодОстатков);
	КонецЕсли;
	Объект.ДрагоценныеМатериалы.Загрузить(ОстаткиДМ);
	
	Для Каждого ТекСтрока Из Объект.ОсновныеСредства Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ОбъектНФА", ТекСтрока.ОсновноеСредство); 
		Если НЕ ЭтоСписаниеКапвложений Тогда
			ПараметрыОтбора.Вставить("ИнвНомер", ТекСтрока.ИнвентарныйНомер);
		КонецЕсли;
		НайденныеСтроки = ОстаткиДМ.НайтиСтроки(ПараметрыОтбора);
		Если ТипЗнч(НайденныеСтроки) = Тип("Массив") Тогда
			Для Каждого ТекСтрокаМассива Из НайденныеСтроки Цикл
				ТекСтрока.КоличествоВсегоДМ = ?(ЭтоСписаниеКапвложений,ТекСтрока.Количество, ТекСтрокаМассива.КоличествоВсего); 
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	
	Для каждого ТекСтрока Из Объект.ДрагоценныеМатериалы Цикл
		ТекСтрока.КлючСтроки = УчетДрагМатериаловКлиент.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА, ТекСтрока.ИнвНомер);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыСДрагМатериалами()
	
	ТаблицаВсехОбъектов = Объект.ОсновныеСредства.Выгрузить(,"СчетУчета, ОсновноеСредство, ИнвентарныйНомер, Количество, КоличествоВсегоДМ");
	
	ТаблицаОбъектовОС = Новый ТаблицаЗначений;
	ТаблицаОбъектовОС.Колонки.Добавить("КлючСтроки",Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовОС.Колонки.Добавить("ОсновноеСредство",Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаОбъектовОС.Колонки.Добавить("ИнвентарныйНомер",Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаОбъектовОС.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТаблицаОбъектовОС.Колонки.Добавить("КоличествоВсегоДМ",Новый ОписаниеТипов("Число"));
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеКапвложений И ВедетсяУчетДрагМатериаловВМЦКапвложений Тогда
		МассивСчетовОС = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляКапвложенийСМЦ();
	Иначе 
		МассивСчетовОС = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляОС();
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если МассивСчетовОС.Найти(ТекСтрока.СчетУчета)<>Неопределено Тогда
			НоваяСтрока = ТаблицаОбъектовОС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.КлючСтроки = УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.ОсновноеСредство, ТекСтрока.ИнвентарныйНомер); 
		КонецЕсли;
	КонецЦикла;
	
	ОбъектыНФАСДрагМатериалами.Загрузить(ТаблицаОбъектовОС);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхДрагМатериалов()
	
	Если ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Истина;
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
		
		Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные <> Неопределено Тогда
			ОтборДрагМатериаловДляОбъекта(Элементы.СписокНФАДокументаОснования.ТекущиеДанные.КлючСтроки);
		КонецЕсли;
	Иначе
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Ложь;
		Элементы.ДрагоценныеМатериалы.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	//Заголовки
	РеквизитыДрагМатериалы = Новый Массив;
	
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоВсегоДМЗаголовок");
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоЗаголовок");
	
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоВсегоДМ");
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличество");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(ЭтаФорма.Элементы,
		РеквизитыДрагМатериалы, "Видимость", Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектовДрагМатериалов(ТекущаяСтрока)
	
	ТекущаяСтрока.КоличествоВсегоДМЗаголовок = НСтр("ru = 'Всего:'");
	ТекущаяСтрока.КоличествоЗаголовок = НСтр("ru = 'Списать:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(Форма)
	
	Для каждого ТекущаяСтрока Из Форма.ОбъектыНФАСДрагМатериалами Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектовДрагМатериалов(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыДрагМатериалов(ТекущаяСтрока)

	ТекущаяСтрока.МатериальнаяЦенностьЗаголовок = НСтр("ru = 'Материальная ценность:'");
	ТекущаяСтрока.КоличествоМЦЗаголовок 		= НСтр("ru = 'Количество:'"); 
	
	ЕдиницаИзм = ПолучитьЕдиницуИзмеренияМатериальнойЦенности(ТекущаяСтрока.ОбъектМЦ);
	
	ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзм;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияМатериальнойЦенности(Знач ОбъектМЦ)
	
	Если ТипЗнч(ОбъектМЦ) = Тип("СправочникСсылка.ОсновныеСредства") ИЛИ Не ЗначениеЗаполнено(ОбъектМЦ) Тогда 
		ЕдиницаИзм = УчетДрагМатериалов.Штуки();
	Иначе
		Если ЗначениеЗаполнено(ОбъектМЦ.ЕдиницаИзмерения) Тогда
			ЕдиницаИзм = ОбъектМЦ.ЕдиницаИзмерения; 
		Иначе
			ЕдиницаИзм = УчетДрагМатериалов.Штуки(); 
		КонецЕсли;
	КонецЕсли;
	Возврат ЕдиницаИзм;

КонецФункции 

&НаСервере
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыДрагМатериаловДляМЦ()
	
	Если НЕ (Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеКапвложений
					И ВедетсяУчетДрагМатериаловВМЦКапвложений) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Объект.ДрагоценныеМатериалы Цикл
	
		ОбновитьТекстЗаголовковВСтрокеТаблицыДрагМатериалов(ТекущаяСтрока);
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтборДрагМатериаловДляОбъекта(КлючСтроки)
	
	Элементы.ДрагоценныеМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки",КлючСтроки));
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКлючиСтрокДрагМатериалов()
	
	Если ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОДрагМатериалах(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.НайденныеСтроки Цикл
		Объект.ДрагоценныеМатериалы.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА()
	Элемент = Элементы.СписокНФАДокументаОснования;
	ОтборДрагМатериаловДляОбъекта(Элемент.ТекущиеДанные.КлючСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПередачиДрагМатериалов(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ДрагоценныеМатериалы.Очистить();  
		УстановитьВидимостьЭлементов(ЭтотОбъект);
	Иначе 
		Объект.ВключатьМЦВСоставКапвложений = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура РассчитатьСуммуАмортизацииЗаТекущийМесяц(ТекущиеДанные = Неопределено)
	
	Если Объект.ВидОперации <> Перечисления.ВидыОперацийСписанияОС.СписаниеСобственныхОС 
		ИЛИ Справочники.Организации.ПолучитьУчетнуюПолитику(Объект.Организация, Объект.Дата).НачислятьАмортизациюПервымЧислом Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		СписокОС = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	Иначе
		СписокОС = Новый Массив;
		СписокОС.Добавить(ТекущиеДанные.ОсновноеСредство);
	КонецЕсли;
	
	ТаблицыАмортизации = УправлениеОсновнымиСредствами.РасчетАмортизацииОСиНМА(СписокОС, Объект, Ложь, Ложь, Ложь);
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		Если ТекущиеДанные <> Неопределено И СтрокаТаблицы <> ТекущиеДанные Тогда
			Продолжить;
		КонецЕсли;
		СтрокаАмортизации = ТаблицыАмортизации.ТаблицаНачисленияАмортизацииБУ.Найти(СтрокаТаблицы.ОсновноеСредство, "ОсновноеСредство");
		Если СтрокаАмортизации = Неопределено Тогда
			СтрокаТаблицы.СуммаАмортизацииЗаТекущийМесяц = 0;
		Иначе
			СтрокаТаблицы.СуммаАмортизацииЗаТекущийМесяц = СтрокаАмортизации.СуммаАмортизацииБУ;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНаБалансеПриИзменении(Элемент)   
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена. Продолжить?'");   
		Оповещение = Новый ОписаниеОповещения("ВосстановитьНаБалансеПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 10);
		Возврат;
	КонецЕсли;	
	
	ПриИзменении_ВосстановитьНаБалансе();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНаБалансеПриИзмененииЗавершение(Результат, Параметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Объект.ВосстановитьНаБалансе = НЕ Объект.ВосстановитьНаБалансе;
		Возврат;
	КонецЕсли;	
	
	Объект.ОсновныеСредства.Очистить();
	ПриИзменении_ВосстановитьНаБалансе();
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзменении_ВосстановитьНаБалансе()   
	ВидимостьРеквизитовВосстановления =
		Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеСобственныхОСОперУчет")
		Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСнаХранении");
	
	Элементы.СтраницаВосстановлениеОС.Видимость = ВидимостьРеквизитовВосстановления И Объект.ВосстановитьНаБалансе;
	
	УстановитьОтборСчетаУчетаОС();
КонецПроцедуры

&НаКлиенте
Процедура ВосстановлениеЗаполнить(Команда)
	ВосстановлениеЗаполнитьСервер();
КонецПроцедуры

&НаСервере
Процедура ВосстановлениеЗаполнитьСервер()
	Документы.СписаниеОбъектовОС.ЗаполнитьТЧВосстановлениеНаБалансе(Объект);
КонецПроцедуры

// Прослеживаемые ОС

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Прослеживаемость(Форма)
	
	Элементы = Форма.Элементы;
	
	ВидимостьОсновныхЭлементов = Форма.ВедетсяУчетПрослеживаемыхТоваров И Форма.ЕстьПрослеживаемыеТовары;
	ИменаЭлементовПрослеживаемости = Новый Массив;
	ИменаЭлементовПрослеживаемости.Добавить("ОсновныеСредстваСтранаПроисхождения");
	ИменаЭлементовПрослеживаемости.Добавить("ОсновныеСредстваПрослеживаемыйТовар");
	ИменаЭлементовПрослеживаемости.Добавить("ОсновныеСредстваРНПТ");
	ИменаЭлементовПрослеживаемости.Добавить("КодОперацииПрослеживаемости");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовПрослеживаемости,
		"Видимость", ВидимостьОсновныхЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиРНПТ(Знач ИдентификаторСтроки)
	ПрослеживаемостьБГУ.УдалитьСтрокиРНПТ(Объект, ИдентификаторСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки, ВыбранноеЗначение, СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр)
	
	СтрокаТабличнойЧасти = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТН(ЭтотОбъект, ИдентификаторСтроки, ВыбранноеЗначение);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТ(ЭтаФорма, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)
	
	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДопустимыеКодыОперацийПрослеживаемости(Форма)
	
	Если Не Форма.ВедетсяУчетПрослеживаемыхТоваров Тогда
		Возврат;
	КонецЕсли;
	
	ВидыОперацийПрослеживаемости = ПрослеживаемостьБГУКлиентСервер.ВидыОперацийПрослеживаемости();
	ВидыОперацийПрослеживаемости.Списание = Истина;
	ВидыОперацийПрослеживаемости.Утилизация = Истина;
	ДанныеВыбора = ПрослеживаемостьБГУКлиентСервер.КодыОперацийПрослеживаемости(ВидыОперацийПрослеживаемости);
	Форма.Элементы.КодОперацииПрослеживаемости.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ГолосованиеКомиссии

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СохранитьРезультатыГолосования", "Доступность",
			ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РезультатыГолосованияСотрудника(ТаблицаДокумента)
	
	РезультатыГолосования = Новый Массив;
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		Если ЗначениеЗаполнено(СтрокаДокумента.РешениеСотрудникаПоРезолюции) Тогда
			РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
				СтрокаДокумента.ИдентификаторСтроки, СтрокаДокумента.РешениеСотрудникаПоРезолюции);
			РезультатыГолосования.Добавить(РезультатГолосования);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатыГолосования;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРешениеВСтрокахДокумента(РешениеСотрудника, ВоВсехСтроках = Истина)
	
	РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.ПустаяСсылка");
	Если РешениеСотрудника = "За" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За");
	ИначеЕсли РешениеСотрудника = "Против" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против");
	КонецЕсли;
	
	Если ВоВсехСтроках Тогда
		Для Каждого СтрокаДокумента Из Объект.ОсновныеСредства Цикл
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	Иначе
		Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ОсновныеСредства.ВыделенныеСтроки Цикл
			СтрокаДокумента = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьРезультатыГолосованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатыГолосованияНаСервере(ДополнительныеПараметры.Сотрудник, ДополнительныеПараметры.РезультатыГолосования);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыГолосованияНаСервере(ЧленКомиссии, РезультатыГолосования)
	
	ОбщегоНазначенияБГУ.СохранитьРезультатыГолосованияНаСервере(Объект, ЧленКомиссии, РезультатыГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановитьРешениеЕдиногласноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		УстановитьРешениеЕдиногласноНаСервере(ДополнительныеПараметры);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРешениеЕдиногласноНаСервере(РезультатГолосования)
	
	ОбщегоНазначенияБГУ.УстановитьРешениеЕдиногласноНаСервере(Объект, "ОсновныеСредства", РезультатГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

// Файлы сотрудников
&НаКлиенте
Процедура ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора)
	
	РаботаСФайламиБГУ.ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОткрепитьФайлСотрудникаНаСервере()
	
	РаботаСФайламиБГУ.ОткрепитьФайлСотрудника(ФайлСотрудника, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

// Конец Файлы сотрудников

#КонецОбласти

&НаКлиенте
Процедура ОтключитьУчетВКарточкахКапвложений()
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений") Тогда
		
		Для каждого СтрокаТЧ из Объект.ОсновныеСредства Цикл
			Если СтрокаТЧ.ОтразитьВКарточкеКапвложений Тогда
				СтрокаТЧ.ОтразитьВКарточкеКапвложений = Ложь;
			КонецЕсли;	
		КонецЦикла;
		
	КонецЕсли;		
КонецПроцедуры	

&НаКлиенте
Процедура РешениеПриИзменении_Завершение(Результат, Параметры) Экспорт                     
	СсылкаЦелевогоДокумента = Неопределено;
	Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("СсылкаЦелевогоДокумента") Тогда
		СсылкаЦелевогоДокумента = Параметры.СсылкаЦелевогоДокумента;
	КонецЕсли;	
	ВвестиНаОснованииРешения(Объект.Решение, Результат, СсылкаЦелевогоДокумента);
	ПриИзмененииВидаОперации();
КонецПроцедуры	

&НаСервере
Процедура ВвестиНаОснованииРешения(ДокументОснования, Разделитель, СсылкаЦелевогоДокумента)
	ТекОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.СписаниеОбъектовОС"));
	ДанныеЗаполнения = Новый Структура("ДокументОснование, Разделитель, ВводНаОсновании, СсылкаЦелевогоДокумента", 
		ДокументОснования, Разделитель, Истина, СсылкаЦелевогоДокумента);
	
	ТекОбъект.Заполнить(ДанныеЗаполнения);
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	ЗаполнитьДанныеОСвТЧ();
КонецПроцедуры	

&НаСервереБезКонтекста
Функция НаименованиеПричиныСписания(ПричинаСсылка)
	Возврат Справочники.ПричиныСписанияНФА.НаименованиеПричиныСписания(ПричинаСсылка);
КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбора_ОчисткаТабЧастей_Завершение(Результат, ДопПараметры) Экспорт
	Если ДопПараметры.Параметры.ИмяРеквизита = "Организация" Тогда
		ОрганизацияПриИзменении(ДопПараметры.Элемент);
	ИначеЕсли ДопПараметры.Параметры.ИмяРеквизита = "ИФО" Тогда
		ИФОПриИзменении(ДопПараметры.Элемент);
	ИначеЕсли ДопПараметры.Параметры.ИмяРеквизита = "ВидОперации" Тогда
		ВидОперацииПриИзменении(ДопПараметры.Элемент);
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеОСвТЧ()
	Для каждого СтрокаТЧ Из Объект.ОсновныеСредства Цикл
		ОсновноеСредствоПриИзмененииНаСервере(СтрокаТЧ.ПолучитьИдентификатор());
	КонецЦикла;	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЕстьРешениеОПрекращенииПризнанияАктивом(Форма)
	Объект = Форма.Объект;
	ЕстьРешение = ЗначениеЗаполнено(Объект.Решение) 
		И ТипЗнч(Объект.Решение) = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивом");
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом <> ЕстьРешение Тогда
		 Объект.ЕстьРешениеОПрекращенииПризнанияАктивом = ЕстьРешение;
	КонецЕсли;		
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВО_СДоговоромВТЧ(Форма)
	Объект = Форма.Объект;
	ВидОперации = Объект.ВидОперации;
	Возврат(
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСПолученныхВПользование")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеОСнаХранении")
		ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийСписанияОС.СписаниеКапвложений")
		И Объект.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыИмущества.ВКонцессии")
	);
КонецФункции	

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаСервере
Функция ПараметрыПолученияУчетныхДанных(ТаблицаОС)
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.ПараметрыДляРасчетаУчетныхДанных();
	ЗаполнитьЗначенияСвойств(ПараметрыПолученияОстатков, Объект);
	ПараметрыПолученияОстатков.ТаблицаОС = ТаблицаОС;
	Дата = НачалоДня(Объект.Дата);
	Счета = Новый Массив;
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеСобственныхОСОперУчет Тогда
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("21", Дата));
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеСобственныхОС Тогда
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("101.00", Дата));
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("102.00", Дата));
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("103.00", Дата));
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеКапвложений Тогда
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("106.00", Дата));
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеОСнаХранении Тогда
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("02", Дата));
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияОС.СписаниеОСПолученныхВПользование Тогда
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("01", Дата));
	КонецЕсли;	
	ПараметрыПолученияОстатков.Счета = Счета;
	
	Возврат ПараметрыПолученияОстатков;
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуТЧ(ТекСтрока, ТабОстатков)
	Если ЗначениеЗаполнено(ТекСтрока.ИнвентарныйНомер) Тогда
		СтруктураПоиска = Новый Структура("ОсновноеСредство, ИнвентарныйНомер");
	Иначе	
		СтруктураПоиска = Новый Структура("ОсновноеСредство");
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекСтрока);
	СтрокиОстатков = ТабОстатков.НайтиСтроки(СтруктураПоиска);
	Если СтрокиОстатков.Количество() = 1 Тогда
		СтрокаОстатков = СтрокиОстатков[0];
		ЗаполнитьЗначенияСвойств(ТекСтрока, СтрокаОстатков,, "Количество, Сумма");
		
		Если ТипЗнч(СтрокаОстатков.ДопАналитика) = Тип("СправочникСсылка.Договоры") 
			И ЗначениеЗаполнено(СтрокаОстатков.ДопАналитика) Тогда
			ТекСтрока.Договор = СтрокаОстатков.ДопАналитика;
			ТекСтрока.Контрагент = СтрокаОстатков.Контрагент;
		ИначеЕсли ТипЗнч(СтрокаОстатков.ДопАналитика) = Тип("СправочникСсылка.Контрагенты") 
			И ЗначениеЗаполнено(СтрокаОстатков.ДопАналитика) Тогда
			ТекСтрока.Контрагент = СтрокаОстатков.ДопАналитика;
		КонецЕсли;		
		
		Если ТекСтрока.Количество = 0 ИЛИ ТекСтрока.Количество > СтрокаОстатков.Количество Тогда
			ТекСтрока.Количество = 1;
			ТекСтрока.Сумма = ТекСтрока.СтоимостьЕдиницы;
		Иначе
			ТекСтрока.Сумма = ТекСтрока.СтоимостьЕдиницы * ТекСтрока.Количество;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ОсновноеСредствоПриИзмененииНаСервере(Знач ИдентификаторСтроки)
	
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		// Если решение заполнено, документ движений не формирует, никакие дополнительные данные не нужны
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ТаблицаОС = УправлениеОсновнымиСредствами.ПустаяТаблицаОС_ДляРасчетаУчетныхДанных();
	НоваяСтрока = ТаблицаОС.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
	ТабОстатков = УправлениеОсновнымиСредствами.ТаблицаУчетныхДанных(ПараметрыПолученияУчетныхДанных(ТаблицаОС));
	ЗаполнитьСтрокуТЧ(ТекущиеДанные, ТабОстатков);
	
	РассчитатьСуммуАмортизацииЗаТекущийМесяц(ТекущиеДанные);
	ДанныеОС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.ОсновноеСредство, "СтранаПроисхождения");
	УстановитьСвойстваПрослеживаемостиПриВыбореОсновногоСредства(ТекущиеДанные, ДанныеОС);
	
КонецПроцедуры

#КонецОбласти
