
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнениеНастроекЭДОБГУ();
	
	//Маркировка товаров
	ВидимостьЭлементовМаркировки = Ложь;
	Если Объект.КодыУпаковокМаркируемойПродукции.Количество()>0 Тогда
		ВидимостьЭлементовМаркировки = Истина;
	КонецЕсли;
	ПроверитьСведенияОМаркировке();
	ОбновитьДанныеЗаголовкаСведенияОМаркировке(ЭтаФорма);
	
	//Прослеживаемость товаров
	ПоставщикРезидентТаможенногоСоюза = Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Объект.Контрагент);
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
	
	Если Объект.СведенияПрослеживаемости.Количество() > 0 Тогда
		ВедетсяУчетПрослеживаемыхТоваров = Истина;
	КонецЕсли;	
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Подсистема "ОбменСКонтрагентами".
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	ВидимостьЭлементовЭДОДляГосНужд = НЕ ЭлектронныеДокументыБГУ.НеЗаполнятьСведенияУПДОЗакупкеДляГосНужд(Объект.Организация);
	Если НЕ ВидимостьЭлементовЭДО ИЛИ Параметры.Ключ.Пустая() Тогда
		ВидимостьЭлементовЭДОДляГосНужд = Ложь;
	КонецЕсли;	
	
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);

	ЗаполнитьЗначенияСвойств(
		ЭтотОбъект, ЭлектронныеДокументыБГУ.РеквизитыЭТрН(Объект.Ссылка));
	ЭлектронныеДокументыБГУКлиентСервер.ПроверитьВозможностьОформленияЭПД(ЭтотОбъект);
	
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма, ВидимостьЭлементовЭДО, ВидимостьЭлементовМаркировки, ВидимостьЭлементовЭДОДляГосНужд);

	ДатаПодписанияЭД = Документы.ЭлектронныйДокументПоставщика.ДатаПоследнейЭлектроннойПодписи(Объект.Ссылка);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	УстановитьЗначенияПоУмолчаниюОтветственныйЗаТовары();
	УстановитьВидимостьЭлементовОтветственныйЗаТовары(ЭтаФорма);
	
	Если ВидимостьЭлементовЭДОДляГосНужд Тогда
		ОбновитьСведенияИнформацияПокупателяГосЗакупки();
		ГосЗакупкиДенежныеОбязательстваОбъектФАИПОбновитьКоды();
	КонецЕсли;
	
	ЗаполнитьНаименованиеТоваровПоставщика();
	
	ОбновитьТекстВсехСтрокТаблицыСписокНоменклатуры(ЭтотОбъект);	
	ОбновитьКартинкиВсехСтрокТаблицыСписокНоменклатуры(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ОбновитьТекстЗаголовковВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
	ОбновитьТекстВсехСтрокТаблицыКодовМаркировки();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".    
	
	ЗаполнитьНаименованиеТоваровПоставщика();
	ГосЗакупкиДенежныеОбязательстваОбъектФАИПОбновитьКоды();
	
	ПроверитьСведенияОМаркировке();
	ОбновитьДанныеЗаголовкаСведенияОМаркировке(ЭтаФорма);
	ОбновитьТекстВсехСтрокТаблицыСписокНоменклатуры(ЭтотОбъект);
	ОбновитьКартинкиВсехСтрокТаблицыСписокНоменклатуры(ЭтотОбъект);
	УстановитьУсловноеОформлениеОбщее();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
		ЭтотОбъект.ОбновитьОтображениеДанных();	
	ИначеЕсли ИмяСобытия = "Запись_СчетФактураПолученный" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			Если Параметр.ДокументыОснования.Найти(Объект.Ссылка) <> Неопределено Тогда
				ЗаполнитьТекстПроСчетФактуру();
			КонецЕсли;	
		КонецЕсли;
	ИначеЕсли (ИмяСобытия = "ДокументыПоУчетуМатериальныхЗапасовИзменение") ИЛИ 
			(ИмяСобытия = "ДокументыПоУчетуОСИзменение") Тогда
			
		НадписьОтражениеВУчете = ТекстОтраженияВУчете();
		ЭтотОбъект.ОбновитьОтображениеДанных();	
			
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьТекстПроСчетФактуру();
	УстановитьТипОтветственныйПринялТовары();
		
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьТекстВидовНоменклатурыВсехСтрокТаблицыСписокНоменклатуры();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	КонтрольЗаполненияДанныхГосЗакупок();
	
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПриИзмененииКлючевыхРеквизитовСостояниеЭДО();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ПриИзмененииКлючевыхРеквизитовСостояниеЭДО();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ПриИзмененииКлючевыхРеквизитовСостояниеЭДО();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураНажатие(Элемент, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтотОбъект, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПринятыПриИзменении(Элемент)
	УстановитьВидимостьЭлементовОтветственныйЗаТовары(ЭтаФорма);
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПолученияТоваров) Тогда
		Объект.ДатаПолученияТоваров = ОбщегоНазначенияКлиент.ДатаСеанса();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПринялТоварыДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПринялТоварыДолжностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		ОтветственныйПринялТоварыДолжность = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПринялТоварыОснованиеПолномочийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПринялТоварыОснованиеПолномочийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		ОтветственныйПринялТоварыОснованиеПолномочий = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидОтветственногоПринявшегоТоварыПриИзменении(Элемент)
	УстановитьТипОтветственныйПринялТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТипФорматаЭДПриИзменении(Элемент)
	ПодготовитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГосЗакупкаРеквизитыЛицевогоСчетаПокупателяПриИзменении(Элемент)
	
	ЗаполнитьСведенияГосЗакупкиПоРеквизитамЛС(Объект.ГосЗакупкаРеквизитыЛицевогоСчетаПокупателя);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЭТрННажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ЭлектроннаяТранспортнаяНакладная) Тогда
		ОткрытьФорму("Документ.ЭлектроннаяТранспортнаяНакладная.ФормаОбъекта", Новый Структура("Ключ", ЭлектроннаяТранспортнаяНакладная));
	Иначе
		ПараметрыОтбора	= Новый Структура;
		ПараметрыОтбора.Вставить("Тип",	Тип("ДокументСсылка.ЭлектроннаяТранспортнаяНакладная"));
		ПараметрыОтбора.Вставить("Организация",	Объект.Организация);
		
		Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ПараметрыОтбора.Вставить("Грузоотправитель", Объект.Контрагент);
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
		ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ВыборГруппИЭлементов",ГруппыИЭлементы.Элементы);
		
		ОткрытьФорму("ЖурналДокументов.ЭлектронныеПеревозочныеДокументы.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникСозданияДокументаПоступления(Команда)
	УспешныйРезультатПроверки = Истина;
	
	Если Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ необходимо записать.'"));
		УспешныйРезультатПроверки = Ложь;
	КонецЕсли; 
	
	Если НЕ УспешныйРезультатПроверки Тогда
		Возврат;	
	КонецЕсли;	
		
	ОткрытьФорму("Перечисление.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.Форма.ФормаВыбора",,Элементы.СписокНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодОКТМОМестаПоставкиПоКодуОКТМОПокупателя(Команда)
	ЗаполнитьКодОКТМОМестаПоставкиПоКодуОКТМОПокупателяНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваНоменклатурыОрганизации(Команда)

	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	
	ТипНоменклатурыЭДО = 0;
	Если ТИпЗнч(ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ТипНоменклатурыЭДО = 0;
	ИначеЕсли ТИпЗнч(ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		ТипНоменклатурыЭДО = 1;
	ИначеЕсли ТИпЗнч(ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
		ТипНоменклатурыЭДО = 2;
	КонецЕсли;	
	ПараметрыФормы.Вставить("ТипНоменклатурыЭДО", ТипНоменклатурыЭДО);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьРеквизитыСтрокЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.ЭлектронныйДокументПоставщика.Форма.ФормаГрупповогоИзмененияРеквизитовНоменклатуры", ПараметрыФормы,,,,,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуОтгрузкиПоУПД(Команда)
	ЗаполнитьДатуОтгрузкиПоУПДНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
		ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекущиеДанные);
	КонецЕсли;	
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ИдентификаторСтроки = "";
		Если Элемент.ТекущиеДанные.ПрослеживаемыйТовар Тогда
			Элемент.ТекущиеДанные.РНПТ = "";
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	ДанныеНоменклатурыОрганизацииСтроки = ДанныеНоменклатурыОрганизацииСтроки(ТекущиеДанные.Номенклатура);
	
	ТекущиеДанные.ВидНоменклатурыДляОтраженияВУчете = ДанныеНоменклатурыОрганизацииСтроки.Вид;
	
	Если ТекущиеДанные.ПризнакНоменклатуры = "1ВТ" Тогда
		ТекущиеДанные.ВидНоменклатурыДляОтраженияВУчете = НСтр("ru='Возвратная тара'");	
	КонецЕсли;
	
	ТекущиеДанные.ЕдиницаИзмеренияНоменклатуры = ДанныеНоменклатурыОрганизацииСтроки.ЕдиницаИзмерения;
	
	ОбновитьТекстВСтрокеТаблицыСписокНоменклатуры(ТекущиеДанные);

	НоменклатураСовпадает = Истина;
	Если ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторПоставщика) Тогда
		НоменклатураСовпадает(ТекущиеДанные.ИдентификаторПоставщика, ТекущиеДанные.Номенклатура, НоменклатураСовпадает); 
		ОбновитьКартинкуВСтрокеТаблицыСписокНоменклатуры(ТекущиеДанные, НоменклатураСовпадает, КонтролироватьСоответствиеНаименованияТРУ);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСтавкаНДСПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаНДСПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПеречислениеСсылка.ВидыНоменклатурыПоставщика") Тогда
		МассивСтрок = Элементы.СписокНоменклатуры.ВыделенныеСтроки;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			ТекСтр = Объект.СписокНоменклатуры.НайтиПоИдентификатору(ЭлМас);
			Если ТекСтр <> Неопределено Тогда
				ТекСтр.ВидНоменклатуры = ВыбранноеЗначение;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ПеречислениеСсылка.ТипыДокументовДляОтраженияВУчетеЭДПоставщика") Тогда
		ПараметрыФормыПодбора = Новый Структура("Отбор", Новый Структура);
		
		ПараметрыФормыПодбора.Вставить("ТипДокумента",	ВыбранноеЗначение);
		ПараметрыФормыПодбора.Вставить("Организация",	Объект.Организация);
		ПараметрыФормыПодбора.Вставить("Ссылка",	Объект.Ссылка);
		ПараметрыФормыПодбора.Вставить("СуммаВключаетНДС",	Объект.СуммаВключаетНДС);
		
		ОткрытьФорму("Документ.ЭлектронныйДокументПоставщика.Форма.ПомощникСозданияДокументаПоступления", ПараметрыФормыПодбора, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПризнакНоменклатурыПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтаФорма, "СписокНоменклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыРНПТОчистка(Элемент, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.СписокНоменклатуры.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		
		Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар 
			И НЕ ПоставщикРезидентТаможенногоСоюза Тогда
			СтрокиСРНПТ = Объект.СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТабличнойЧасти.ИдентификаторСтроки));
			
			Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
				Объект.СведенияПрослеживаемости.Удалить(СтрокаСРНПТ);
			КонецЦикла;
		КонецЕсли;
		
		ПрослеживаемостьФормыБГУКлиентСервер.ЗаполнитьПредставлениеРНПТ(ЭтаФорма, СтрокаТабличнойЧасти);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокНоменклатурыРНПТ" Тогда
		ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
		Если ТекущиеДанные.ПрослеживаемыйТовар 
			И НЕ ПоставщикРезидентТаможенногоСоюза Тогда
			ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтаФорма, "СписокНоменклатуры");
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Поле.Имя = "СписокНоменклатурыПрослеживаемыйТовар" Тогда
		ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ПрослеживаемостьФормыБГУКлиент.ПоказатьПредупреждениеПрослеживаемыйТовар();
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСписокГосЗакупкиДенежныеОбязательства

&НаКлиенте
Процедура ГосЗакупкиДенежныеОбязательстваОбъектФАИППриИзменении(Элемент)
	
	ОбъектФАИП = Элементы.ГосЗакупкиДенежныеОбязательства.ТекущиеДанные.ОбъектФАИП;
	ДанныеОбъектаФАИП = ДанныеОбъектаФАИП(ОбъектФАИП);
	Элементы.ГосЗакупкиДенежныеОбязательства.ТекущиеДанные.КодОбъектаФАИП = ДанныеОбъектаФАИП.КодФАИП;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыСписокНоменклатуры(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.СписокНоменклатуры Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока);
		
		ПрослеживаемостьФормыБГУКлиентСервер.ЗаполнитьПредставлениеРНПТ(Форма, ТекущаяСтрока);
	КонецЦикла;

	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока)

	ТекущаяСтрока.ЗаголовокНоменклатурыПоставщика = НСтр("ru = 'у поставщика:'");
	ТекущаяСтрока.ЗаголовокНоменклатуры = НСтр("ru = 'в организации:'");
	
	ТекущаяСтрока.ЗаголовокПризнак = НСтр("ru = 'признак:'");
	Если ТекущаяСтрока.ПризнакНоменклатуры = "1" 
		ИЛИ ТекущаяСтрока.ПризнакНоменклатуры = "1МЗ"
		ИЛИ ТекущаяСтрока.ПризнакНоменклатуры = "1ОС" Тогда
		ТекущаяСтрока.ПризнакНоменклатурыПоставщика = НСтр("ru = '1 - имущество'");	
	ИначеЕсли ТекущаяСтрока.ПризнакНоменклатуры = "1ВТ" Тогда
		ТекущаяСтрока.ПризнакНоменклатурыПоставщика = НСтр("ru = '1 - возвратная тара'");	
	ИначеЕсли ТекущаяСтрока.ПризнакНоменклатуры = "2" Тогда
		ТекущаяСтрока.ПризнакНоменклатурыПоставщика = НСтр("ru = '2 - работа'");	
	ИначеЕсли ТекущаяСтрока.ПризнакНоменклатуры = "3" Тогда
		ТекущаяСтрока.ПризнакНоменклатурыПоставщика = НСтр("ru = '3 - услуга'");	
	ИначеЕсли ТекущаяСтрока.ПризнакНоменклатуры = "4" Тогда
		ТекущаяСтрока.ПризнакНоменклатурыПоставщика = НСтр("ru = '4 - имущественные права'");	
	ИначеЕсли ТекущаяСтрока.ПризнакНоменклатуры = "5" Тогда
		ТекущаяСтрока.ПризнакНоменклатурыПоставщика = НСтр("ru = '5 - иное'");	
	Иначе
		ТекущаяСтрока.ПризнакНоменклатурыПоставщика = НСтр("ru = 'не указан'");	
	КонецЕсли;	
	
	ТекущаяСтрока.ЗаголовокВидНоменклатуры = НСтр("ru = 'вид:'");
	
	ТекущаяСтрока.ЗаголовокЕдиницаИзмеренияКод = НСтр("ru = 'код ед.изм.:'");
	ТекущаяСтрока.ЗаголовокЕдиницаИзмерения = НСтр("ru = 'ед.изм.:'");
	
	ТекущаяСтрока.ЗаголовокСтранаПроисхождения = НСтр("ru = 'страна происхождения:'");
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Содержание) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПоставщика) Тогда
		ТекущаяСтрока.НаименованиеПоставщика = ТекущаяСтрока.Содержание;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстВсехСтрокТаблицыКодовМаркировки()

	Для Каждого ТекущаяСтрока Из Объект.КодыУпаковокМаркируемойПродукции Цикл
		ОбновитьТекстВСтрокеТаблицыКодовМаркировки(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьТекстВСтрокеТаблицыКодовМаркировки(ТекущаяСтрока)

	ТекущаяСтрока.МаркируемыйТовар = МаркируемыйТовар(ТекущаяСтрока.ИдентификаторСтроки);

КонецПроцедуры

&НаСервере
Функция МаркируемыйТовар(ИдентификаторСтроки)
	Результат = Справочники.Номенклатура.ПустаяСсылка();
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	НайденныеСтроки = Объект.СписокНоменклатуры.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()>0 Тогда
		Результат = НайденныеСтроки[0].Номенклатура;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбновитьТекстВидовНоменклатурыВсехСтрокТаблицыСписокНоменклатуры()
	ДанныеНоменклатурыОрганизации = ДанныеНоменклатурыОрганизации();
	
	ДанныеВидовНоменклатуры = ДанныеНоменклатурыОрганизации.ВидыНоменклатурыОрганизации;
	ДанныеЕдИзмНоменклатуры = ДанныеНоменклатурыОрганизации.ЕдиницыИзмеренияНоменклатуры;
	ДанныеТребуетсяКонтрольПересчета = ДанныеНоменклатурыОрганизации.ТребуетсяНастройкаПересчетаКоличества;
	
	н = 0;
	Для Каждого ТекущаяСтрока Из Объект.СписокНоменклатуры Цикл
		НаименованиеВидаНоменклатуры = ДанныеВидовНоменклатуры[н];
		Если ЗначениеЗаполнено(НаименованиеВидаНоменклатуры) Тогда
			ТекущаяСтрока.ВидНоменклатурыДляОтраженияВУчете = НаименованиеВидаНоменклатуры;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
			Если ТекущаяСтрока.ПризнакНоменклатуры = "1ВТ" Тогда
				ТекущаяСтрока.ВидНоменклатурыДляОтраженияВУчете = НСтр("ru='Возвратная тара'");	
			КонецЕсли;
		КонецЕсли;
		
		ТекущаяСтрока.ЕдиницаИзмеренияНоменклатуры = ДанныеЕдИзмНоменклатуры[н];
		
		ТекущаяСтрока.ТребуетсяНастройкаПересчетаКоличества = ДанныеТребуетсяКонтрольПересчета[н];
		
		н = н + 1;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	СчетФактура = СчетФактураДокументаПоставщика(Объект);

	ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы(ЭтотОбъект, Объект);
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
	ОбновитьТекстВсехСтрокТаблицыКодовМаркировки();
	ОбновитьТекстВидовНоменклатурыВсехСтрокТаблицыСписокНоменклатуры();
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	НадписьОтражениеВУчете = ТекстОтраженияВУчете();
	
	Если Объект.ТипФорматаЭД = 0 Тогда
		НадписьТипФорматаЭД = НСтр("ru='УПД'");
	ИначеЕсли Объект.ТипФорматаЭД = 3 Тогда
		НадписьТипФорматаЭД = НСтр("ru='Документ государственного заказчика'");
	ИначеЕсли Объект.ТипФорматаЭД = 4 Тогда
		НадписьТипФорматаЭД = НСтр("ru='УПД поставщика (ЦС: организация-грузополучатель)'");
	ИначеЕсли Объект.ТипФорматаЭД = 5 Тогда
		НадписьТипФорматаЭД = НСтр("ru='Документ поставщика (ЦС: организация-грузополучатель)'");
	ИначеЕсли Объект.ТипФорматаЭД = 6 Тогда
		НадписьТипФорматаЭД = НСтр("ru='Акт о приемке выполненных работ в строительстве'");
	Иначе
		НадписьТипФорматаЭД = НСтр("ru='Документ поставщика'");
	КонецЕсли;	
	
	НастройкаЗаголовковКоманд();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаЗаголовковКоманд()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаСоздатьНаОсновании", "Заголовок", НСтр("ru = 'Создать документ поступления'"));
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПоступлениеМЗСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПоступлениеМЗ.ПустаяСсылка()));
 	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПоступлениеОССоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПоступлениеОС.ПустаяСсылка()));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПоступлениеУслугРаботСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПоступлениеУслугРабот.ПустаяСсылка()));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПоступлениеМЗВПутиСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПоступлениеМЗВПути.ПустаяСсылка()));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПоступлениеОСВПутиСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПоступлениеОСВПути.ПустаяСсылка()));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПоступлениеИКСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПоступлениеИК.ПустаяСсылка()));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПрочееОтражениеЭлектронногоДокументаВУчетеСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПрочееОтражениеЭлектронногоДокументаВУчете.ПустаяСсылка()));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПриходныйОрдерФондовыйСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПриходныйОрдерФондовый.ПустаяСсылка()));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаДокументПоступлениеОСИКСоздатьНаОсновании", "Заголовок", СинонимДокументаУчета(Документы.ПоступлениеОСИК.ПустаяСсылка()));

КонецПроцедуры

&НаСервере
Функция СинонимДокументаУчета(ВыбранныйТипДокументаУчета)
	
	Возврат ВыбранныйТипДокументаУчета.Метаданные().Синоним;

КонецФункции

&НаКлиенте
Процедура НадписьВалютаНДСНажатие(Элемент, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
	 	И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	
	ПараметрыПредставления = Новый Структура("ТипЦены, ВалютаДокумента, СуммаВключаетНДС");
	ЗаполнитьЗначенияСвойств(ПараметрыПредставления, Объект);
	ПараметрыПредставления.Вставить("ПоказыватьТипЦены", Ложь);
	ПараметрыПредставления.Вставить("ПоказыватьНДС", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьВалюту", Форма.КэшПараметров.ИспользоватьВалютныйУчет);
	
	Форма.НадписьВалютаНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт

	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.СуммаВключаетНДС <> Объект.СуммаВключаетНДС Тогда
		Для каждого ТекСтрока Из Объект.СписокНоменклатуры Цикл
			
			РассчитатьСтроку(ТекСтрока, Объект.СуммаВключаетНДС, "Всего");
			
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////
&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма, ВидимостьЭлементовЭДО = Истина, ВидимостьДанныхМаркировки = Ложь, ВидимостьЭлементовЭДОДляГосНужд = Истина)
	Объект = Форма.Объект;
	
	ИмяОбъектаМетаданных = Объект.Ссылка.Метаданные().ПолноеИмя();
	МодульМенеджера = Новый (СтрЗаменить(ИмяОбъектаМетаданных, ".", "Менеджер."));
	
	ВидимостьРеквизитовПолучателя = ?(ЗначениеЗаполнено(Объект.Извещение), Истина, Ложь);
	АктПриемкиСтроительныхРабот = ?(Объект.ТипФорматаЭД = 6, Истина, Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"Отправитель", "Видимость", ВидимостьРеквизитовПолучателя);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"Грузополучатель", "Видимость", НЕ ВидимостьРеквизитовПолучателя);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО И НЕ ВидимостьРеквизитовПолучателя);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СчетФактура", "Видимость", НЕ ВидимостьРеквизитовПолучателя);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаЗакупкаДляГосударственныхНужд", "Видимость", ВидимостьЭлементовЭДО И ВидимостьЭлементовЭДОДляГосНужд);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаКодыМаркировки", "Видимость", ВидимостьДанныхМаркировки);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаПринялТовары", "Видимость", НЕ Объект.ЗагруженИзЕИС);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаДатаОтгрузки", "Видимость", Объект.ТипФорматаЭД = 0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СписокНоменклатурыИдентификаторНоменклатурыЕИС", 
		"Видимость", Объект.ЗагруженИзЕИС);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СписокНоменклатурыВнешнийИдентификаторЕИС", 
		"Видимость", Объект.ЗагруженИзЕИС);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СписокНоменклатурыТехническийИдентификаторЕИС", 
		"Видимость", Объект.ЗагруженИзЕИС);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СостояниеЭТрН", "Видимость", Форма.МожноОформитьЭПД);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаСведенияЭДП", "Видимость", Форма.МожноОформитьЭПД);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаАктПриемкиСтроительныхРабот", "Видимость", АктПриемкиСтроительныхРабот);
	
	Если АктПриемкиСтроительныхРабот Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"Грузополучатель", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаПринялТовары", "Видимость", Ложь);
		Если Объект.ЗагруженИзЕИС Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
				"ГруппаИнформацияЗаказчикаСтроительства", "Видимость", Ложь);
		КонецЕсли;	
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаИнформацияЗаказчикаСтроительства", "Видимость", Ложь);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГосударственныйКонтрактЕИС", "Видимость", Объект.ЗагруженИзСведенийОГосКонтрактеЕИС);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ЗагруженИзСведенийОГосКонтрактеЕИС", "Видимость", Объект.ЗагруженИзСведенийОГосКонтрактеЕИС);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ЗаполнитьДатуОтгрузкиПоУПД", "Видимость",НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки)
		  И ЗначениеЗаполнено(МодульМенеджера.ДатаОтгрузкиДокументаПоУПД(Объект.Ссылка)));
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Функция СчетФактураДокументаПоставщика(ЭДПоставщика)
	Результат = Документы.СчетФактураПолученный.ПустаяСсылка();
	
	Если ЭДПоставщика.Ссылка = Документы.ЭлектронныйДокументПоставщика.ПустаяСсылка() Тогда
		Возврат Результат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.ЭДПоставщика = &ЭДПоставщика";
	
	Запрос.УстановитьПараметр("ЭДПоставщика", ЭДПоставщика.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуру() 
	СчетФактура = СчетФактураДокументаПоставщика(Объект);
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "НомерПервичногоДокумента,ДатаПервичногоДокумента");
		Номер	= ЗначенияРеквизитов["НомерПервичногоДокумента"];
		Дата	= ЗначенияРеквизитов["ДатаПервичногоДокумента"];
		
		ТекстНомер	= ?(НЕ ПустаяСтрока(Номер), Номер, "...");
		ТекстДата	= ?(ЗначениеЗаполнено(Дата), Формат(Дата, "ДЛФ=D"), "...");
		ТекстНадписи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='№ %1 от %2 г.'"),
			ТекстНомер,
			ТекстДата);
	Иначе
		ТекстНадписи = "";	
	КонецЕсли;	
	
	ЭтаФорма.НадписьСчетФактура = ТекстНадписи;	
	
КонецПРоцедуры

&НаСервере
Функция ТекстОтраженияВУчете()
	Результат = "";
	
	Если ЭтоТрехсторонняяПередача() ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Результат = "";
		Возврат Результат;
	КонецЕсли;	
	
	ДокументыОтражения = ЭлектронныеДокументыБГУВызовСервера.ДокументыОтраженияДляЭДП(Объект.Ссылка);
	СуммаОтраженияВучете = ДокументыОтражения.Итог("Сумма");
	
	Если Объект.СуммаДокумента = СуммаОтраженияВучете Тогда
		Результат = НСтр("ru = 'Отражено в учёте на сумму: '") + Формат(СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(Объект.ВалютаДокумента);
	Иначе
		Результат = НСтр("ru = 'Не отражено в учёте на сумму: '") + Формат(Объект.СуммаДокумента - СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(Объект.ВалютаДокумента);
	КонецЕсли;
	
	Если ЭтоТрехсторонняяПередача() ИЛИ Объект.НеОтражаетсяВУчете Тогда
		Результат = "";
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

&НаСервере
Функция ДанныеНоменклатурыОрганизации()
	Результат = Новый Структура;
	
	РезультатВиды = Новый Массив;
	РезультатЕдиницыИзмерения = Новый Массив;
	РезультатТребуетсяНастройкаПересчетаКоличества = Новый Массив;
	
	Для каждого ТекСтрока Из Объект.СписокНоменклатуры Цикл
		РезультатВиды.Добавить(ЭлектронныеДокументыБГУВызовСервера.ВидНоменклатурыОрганизации(ТекСтрока.Номенклатура));
		
		ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Если ТипЗнч(ТекСтрока.Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
				ЕдиницаИзмерения = ЭлектронныеДокументыБГУ.Штуки();
			Иначе	
				ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекСтрока.Номенклатура, "ЕдиницаИзмерения");
				ЕдиницаИзмерения = ЗначенияРеквизитов.ЕдиницаИзмерения;
			КонецЕсли;
		КонецЕсли;
		РезультатЕдиницыИзмерения.Добавить(ЕдиницаИзмерения);
		
		ТребуетсяНастройкаПересчетаКоличества = Ложь;
		КоличествоЗнаковПослеЗапятой = ЭлектронныеДокументыБГУВызовСервера.ЧислоЗнаковПослеЗапятой(ТекСтрока.Количество);
		Если КоличествоЗнаковПослеЗапятой > 3 Тогда
			ТребуетсяНастройкаПересчетаКоличества = Истина;
		Иначе
			Если ЗначениеЗаполнено(ЕдиницаИзмерения) И ЗначениеЗаполнено(ТекСтрока.ЕдиницаИзмерения) Тогда
				Если ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения Тогда
					ТребуетсяНастройкаПересчетаКоличества = Ложь;
				Иначе	
					ТребуетсяНастройкаПересчетаКоличества = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		РезультатТребуетсяНастройкаПересчетаКоличества.Добавить(ТребуетсяНастройкаПересчетаКоличества);
		
	КонецЦикла;
	
	Результат.Вставить("ВидыНоменклатурыОрганизации", РезультатВиды);
	Результат.Вставить("ЕдиницыИзмеренияНоменклатуры", РезультатЕдиницыИзмерения);
	Результат.Вставить("ТребуетсяНастройкаПересчетаКоличества", РезультатТребуетсяНастройкаПересчетаКоличества);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ДанныеНоменклатурыОрганизацииСтроки(Номенклатура)
	Результат = Новый Структура;
	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	ВидНоменклатуры = НСтр("ru=''");

	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ЕдиницаИзмерения = ЭлектронныеДокументыБГУ.Штуки();
		Иначе	
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ЕдиницаИзмерения");
			ЕдиницаИзмерения = ЗначенияРеквизитов.ЕдиницаИзмерения;
		КонецЕсли;
		ВидНоменклатуры = ЭлектронныеДокументыБГУВызовСервера.ВидНоменклатурыОрганизации(Номенклатура);
	КонецЕсли;
	
	Результат.Вставить("Вид", ВидНоменклатуры);
	Результат.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление() Экспорт

	НастройкиУсловногоОформления = Новый Структура();

	УсловноеОформление.Элементы.Очистить();

	ОбновитьУсловноеОформление(ЭтотОбъект);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьУсловноеОформление(Форма)

	НадоИнициализировать = Ложь;

	Если НЕ Форма.НастройкиУсловногоОформления.Свойство("ОбщееПроинициализировано") Тогда
		НадоИнициализировать = Истина;
	КонецЕсли;
	
	Если НадоИнициализировать Тогда
		Форма.УстановитьУсловноеОформлениеДокумента();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеДокумента() Экспорт

	Если НЕ НастройкиУсловногоОформления.Свойство("ОбщееПроинициализировано") Тогда
		УстановитьУсловноеОформлениеОбщее();
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеОбщее()

	НастройкиУсловногоОформления.Вставить("ОбщееПроинициализировано", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НадписьОтражениеВУчете");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НадписьОтражениеВУчете", ВидСравненияКомпоновкиДанных.НачинаетсяС, "Отражено в учёте");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ДосьеХорошаяОценкаЦвет);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НадписьОтражениеВУчете");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"НадписьОтражениеВУчете", ВидСравненияКомпоновкиДанных.НачинаетсяС, "Не отражено в учёте");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатурыЕдиницаИзмерения");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатурыЕдиницаИзмеренияНоменклатуры");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатурыКоличество");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.СписокНоменклатуры.ТребуетсяНастройкаПересчетаКоличества", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	Если Объект.СведенияПрослеживаемости.Количество() = 0 Тогда
		// Признак прослеживаемости
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатурыПрослеживаемыйТовар");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ВедетсяУчетПрослеживаемыхТоваров", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		// Таможенная декларация или РНПТ
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатурыПодсказкаРНПТ");
		
		ГруппаОтбора = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
			ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);

		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
			"ВедетсяУчетПрослеживаемыхТоваров", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
			"ПоставщикРезидентТаможенногоСоюза", ВидСравненияКомпоновкиДанных.Равно, Истина);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатурыРНПТ");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.СписокНоменклатуры.СтранаПроисхождения", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
		
		ГруппаОтбора = КомпоновкаДанныхКлиентСервер.ДобавитьГруппуОтбора(
			ЭлементУО.Отбор.Элементы, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
			"Объект.СписокНоменклатуры.ПрослеживаемыйТовар", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
			"ПоставщикРезидентТаможенногоСоюза", ВидСравненияКомпоновкиДанных.Равно, Истина);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='<Не требуется>'"));
		
		// Страна происхождения
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокНоменклатурыСтранаПроисхождения");
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.СписокНоменклатуры.ПрослеживаемыйТовар", ВидСравненияКомпоновкиДанных.Равно, Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"ПоставщикРезидентТаможенногоСоюза", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.СписокНоменклатуры.СтранаПроисхождения", ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	КонецЕсли;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДанныеОКоличествеМаркированныхТоваровМаркируемыйТовар");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДанныеОКоличествеМаркированныхТоваровКоличествоПоДокументу");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДанныеОКоличествеМаркированныхТоваровКоличествоПоСведениямОМаркировке");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДанныеОКоличествеМаркированныхТоваров.КоличествоПоДокументу", ВидСравненияКомпоновкиДанных.НеРавно, Новый ПолеКомпоновкиДанных("ДанныеОКоличествеМаркированныхТоваров.КоличествоПоСведениямОМаркировке"));
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
КонецПроцедуры

#Область ЭДОСКонтрагентами

&НаСервере
Функция ЭтоТрехсторонняяПередача()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
		Результат = Истина;
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Грузополучатель, "ИНН, КПП");
		ИННГрузополучателя = ЗначенияРеквизитов.ИНН;
		КППГрузополучателя = ЗначенияРеквизитов.КПП;
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация, "ИНН, КПП");
		ИННОрганизации = ЗначенияРеквизитов.ИНН;
		КППОрганизации = ЗначенияРеквизитов.КПП;

		Если (ИННГрузополучателя = ИННОрганизации) И (КППГрузополучателя = КППОрганизации) Тогда
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура ПриИзмененииКлючевыхРеквизитовСостояниеЭДО()
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ПараметрыПриИзменении = ОбменСКонтрагентами.ПараметрыПриИзмененииКлючевыхРеквизитовЭДО();
	
	ПараметрыПриИзменении.Форма                 = ЭтотОбъект;
	ПараметрыПриИзменении.ДокументСсылка        = Объект.Ссылка;
	ПараметрыПриИзменении.ДокументОбъект        = РеквизитФормыВЗначение("Объект");
	ПараметрыПриИзменении.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПриИзменении.ГруппаСостояниеЭДО    = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриИзмененииКлючевыхРеквизитовЭДО(ПараметрыПриИзменении);
	
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	ВидимостьЭлементовЭДОДляГосНужд = НЕ ЭлектронныеДокументыБГУ.НеЗаполнятьСведенияУПДОЗакупкеДляГосНужд(Объект.Организация);
	Если НЕ ВидимостьЭлементовЭДО Тогда
		ВидимостьЭлементовЭДОДляГосНужд = Ложь;
	КонецЕсли;	
	
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма, ВидимостьЭлементовЭДО, , ВидимостьЭлементовЭДОДляГосНужд);
	
	Если ВидимостьЭлементовЭДОДляГосНужд Тогда
		ЗаполнитьСведенияГосЗакупкиПоДоговору(Объект.Договор, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипОтветственныйПринялТовары()
	Если Объект.ОтветственныйПринялТоварыВид = 0 Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
		Элементы.ОтветственныйПринялТовары.ОграничениеТипа = ОписаниеТипа;
	Иначе	
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		Элементы.ОтветственныйПринялТовары.ОграничениеТипа = ОписаниеТипа;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовОтветственныйЗаТовары(ЭтаФорма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовОтветственныйЗаТовары(Форма)
	Объект = Форма.Объект;
	
	ВидимостьОтветственныйСотрудник = ?(Объект.ОтветственныйПринялТоварыВид = 0, Истина, Ложь);
	ВидимостьОтветственныйПредставительКонтрагента = ?(Объект.ОтветственныйПринялТоварыВид = 1, Истина, Ложь);
	ВидимостьОтветственныйФизЛицо = ?(Объект.ОтветственныйПринялТоварыВид = 2, Истина, Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаИное", "Видимость", Объект.ТоварыПриняты);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаОтветственныйОрганизация", "Видимость", Объект.ТоварыПриняты);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаЛицоИОснование", "Видимость", Объект.ТоварыПриняты);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаОтветственныйОрганизация", "Видимость", Объект.ТоварыПриняты);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаИное", "Видимость", Объект.ТоварыПриняты);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ВидОтветственногоПринявшегоТовары", "Видимость", Объект.ТоварыПриняты);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДатаПолученияТоваров", "Видимость", Объект.ТоварыПриняты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаОтветственныйОрганизация", "Видимость", ВидимостьОтветственныйПредставительКонтрагента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОтветственныйПринялТоварыДоверенность", "Видимость", НЕ ВидимостьОтветственныйСотрудник);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОтветственныйПринялТоварыОснованиеПолномочий", "Видимость", НЕ ВидимостьОтветственныйФизЛицо);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаРезультатПриемки", "Видимость", Объект.ТоварыПриняты);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияПоУмолчаниюОтветственныйЗаТовары();
	Если НЕ ЗначениеЗаполнено(Объект.ОтветственныйПринялТоварыОснованиеПолномочий) Тогда
		Объект.ОтветственныйПринялТоварыОснованиеПолномочий = НСтр("ru = 'Должностные обязанности'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуОтгрузкиПоУПДНаСервере()
	ДатаОтгрузки = Документы.ЭлектронныйДокументПоставщика.ДатаОтгрузкиДокументаПоУПД(Объект.Ссылка);
	Объект.ДатаОтгрузки = ДатаОтгрузки;
КонецПроцедуры

#КонецОбласти

#Область НоменклатураПоставщика

&НаСервере
Процедура ЗаполнитьНаименованиеТоваровПоставщика()
	
	Если Не ЗначениеЗаполнено(Объект.СписокНоменклатуры) Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(Объект.Ссылка);
	
		ДанныеОСравненииНоменклатуры.Загрузить(РазличающаясяНоменклатураКонтрагентаИОрганизации);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Извещение) Тогда
		ЭлектронныеДокументыБГУ.ЗаполнитьПредставлениеНоменклатурыКонтрагентовВИсточнике(
			Объект, "Отправитель", "СписокНоменклатуры", "ИдентификаторПоставщика", "НаименованиеПоставщика");
	Иначе	
		ЭлектронныеДокументыБГУ.ЗаполнитьПредставлениеНоменклатурыКонтрагентовВИсточнике(
			Объект, "Контрагент", "СписокНоменклатуры", "ИдентификаторПоставщика", "НаименованиеПоставщика");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПризнакНоменклатуры(Команда)
	ПризнакиНоменклатуры = Новый СписокЗначений;
	ПризнакиНоменклатуры.Добавить("1", НСтр("ru = '1 - имущество'"));
	ПризнакиНоменклатуры.Добавить("1ВТ", НСтр("ru = '1 - возвратная тара'"));
	ПризнакиНоменклатуры.Добавить("2", НСтр("ru = '2 - работа'"));
	ПризнакиНоменклатуры.Добавить("3", НСтр("ru = '3 - услуга'"));
	ПризнакиНоменклатуры.Добавить("4", НСтр("ru = '4 - имущественные права'"));
	ПризнакиНоменклатуры.Добавить("5", НСтр("ru = '5 - иное'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначенияПризнакаНоменклатуры", ЭтаФорма);
	ПризнакиНоменклатуры.ПоказатьВыборЭлемента(Оповещение, "Выберите признак номенклатуры");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначенияПризнакаНоменклатуры(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент = Неопределено Тогда
        Сообщить(НСтр("ru='Признак номенклатуры не выбран.'"));
    Иначе
        ВыбранноеЗначение = ВыбранныйЭлемент.Значение;
		
		МассивСтрок = Элементы.СписокНоменклатуры.ВыделенныеСтроки;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			ТекСтр = Объект.СписокНоменклатуры.НайтиПоИдентификатору(ЭлМас);
			Если ТекСтр <> Неопределено Тогда
				ТекСтр.ПризнакНоменклатуры = ВыбранноеЗначение;
				
				ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекСтр);
			КонецЕсли;
		КонецЦикла;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзвещениеПриИзмененииНаСервере()
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма, ВидимостьЭлементовЭДО);
КонецПроцедуры

&НаКлиенте
Процедура ИзвещениеПриИзменении(Элемент)
	ИзвещениеПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ГосЗакупки

&НаСервере
Процедура ЗаполнитьСведенияГосЗакупкиПоДоговору(ДоговорКонтрагента, ДатаСведений)
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		НаименованиеИКЗ =  ПланыВидовХарактеристик.ВидыХарактеристикОбязательства.ИКЗ.Наименование;
		КодЗакупки = РаботаСОбязательствами.ЗначениеХарактеристикиОбязательства(ДоговорКонтрагента, КонецДня(ДатаСведений), НаименованиеИКЗ);
		
		НомерБюджетногоОбязательстваПокупателя = РаботаСОбязательствами.ПолучитьУчетныйНомерОбязательства(ДоговорКонтрагента);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияГосЗакупкиПоОрганизации(ОрганизацияПокупатель)
	
	Если ЗначениеЗаполнено(ОрганизацияПокупатель) Тогда
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОрганизацияПокупатель, "Бюджет, КодОКТМО, КодПоРПБС");
		НомерРеестровойЗаписиПокупателя = СтруктураДанных.КодПоРПБС;
		КодОКТМО = СтруктураДанных.КодОКТМО;
		Бюджет = СтруктураДанных.Бюджет;
		
		СтруктураДанныхБюджет = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Бюджет, "НаименованиеФинансовогоОргана");
		НаименованиеФинансовогоОрганаПокупателя = СтруктураДанныхБюджет.НаименованиеФинансовогоОргана;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияГосЗакупкиПоРеквизитамЛС(РеквизитыЛицевогоСчета)
	
	Если ЗначениеЗаполнено(РеквизитыЛицевогоСчета) Тогда
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыЛицевогоСчета, "КассовыйОрган, Владелец");
		Казначейство = СтруктураДанных.КассовыйОрган;
		СтруктураДанныхКазначейства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Казначейство, "НаименованиеПолное, Код");
		ЛицевойСчет = СтруктураДанных.Владелец;
		СтруктураДанныхЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЛицевойСчет, "КодПоРПБС, Код, ИспользоватьДляСчетаУчетныйНомер");
		НомерЛицевогоСчетаПокупателя = СтруктураДанныхЛицевогоСчета.Код;
		КодПоРПБСЛицевогоСчета = СтруктураДанныхЛицевогоСчета.КодПоРПБС;
		ИспользоватьДляСчетаУчетныйНомер = СтруктураДанныхЛицевогоСчета.ИспользоватьДляСчетаУчетныйНомер;
		Если ИспользоватьДляСчетаУчетныйНомер И ЗначениеЗаполнено(КодПоРПБСЛицевогоСчета) Тогда
			НомерРеестровойЗаписиПокупателя = КодПоРПБСЛицевогоСчета;
		КонецЕсли;	
		
		КазначействоПокупателяКод = СтруктураДанныхКазначейства.Код;
		КазначействоПокупателяНаименование = СтруктураДанныхКазначейства.НаименованиеПолное;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСведенияИнформацияПокупателяГосЗакупки() 

	ЗаполнитьСведенияГосЗакупкиПоДоговору(Объект.Договор, Объект.Дата);
	ЗаполнитьСведенияГосЗакупкиПоОрганизации(Объект.Организация);
	ЗаполнитьСведенияГосЗакупкиПоРеквизитамЛС(Объект.ГосЗакупкаРеквизитыЛицевогоСчетаПокупателя);
	
КонецПроцедуры

&НаСервере
Процедура ГосЗакупкиДенежныеОбязательстваОбъектФАИПОбновитьКоды()
	
	Для каждого ТекСтрока Из Объект.ГосЗакупкиДенежныеОбязательства Цикл
		ОбъектФАИП = ТекСтрока.ОбъектФАИП;
		ДанныеОбъектаФАИП = ДанныеОбъектаФАИП(ОбъектФАИП);
		ТекСтрока.КодОбъектаФАИП = ДанныеОбъектаФАИП.КодФАИП;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ДанныеОбъектаФАИП(ОбъектФАИП)
	КодФАИП = "";
	
	Если ЗначениеЗаполнено(ОбъектФАИП) Тогда
		Если ТипЗнч(ОбъектФАИП) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектФАИП, "КодФАИП");
			КодФАИП = СтруктураДанных.КодФАИП;
		ИначеЕсли ТипЗнч(ОбъектФАИП) = Тип("СправочникСсылка.МероприятияПоИнформатизации") Тогда
			СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектФАИП, "Код");
			КодФАИП = СтруктураДанных.Код;
		КонецЕсли;
	КонецЕсли;
	
	РезультатСтруктураДанных = Новый Структура;
	РезультатСтруктураДанных.Вставить("КодФАИП", КодФАИП);
	
	Возврат РезультатСтруктураДанных;
КонецФункции	

&НаСервере
Процедура ЗаполнитьКодОКТМОМестаПоставкиПоКодуОКТМОПокупателяНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ГосЗакупкаКодОКТМОПокупателя) Тогда
		Объект.ГосЗакупкаКодОКТМОМестаПоставки = Объект.ГосЗакупкаКодОКТМОПокупателя;
	Иначе
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Организация, "КодОКТМО");
		Объект.ГосЗакупкаКодОКТМОМестаПоставки = СтруктураДанных.КодОКТМО;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЗаполненияДанныхГосЗакупок()
	Если ЗначениеЗаполнено(Объект.ГосЗакупкаНомерДенежногоОбязательства) И Элементы.ГруппаЗакупкаДляГосударственныхНужд.Видимость Тогда
		Если Объект.ГосЗакупкиДенежныеОбязательства.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнены сведения о денежном обязательстве!'"),
			Объект.Ссылка,
			"Объект.ГосЗакупкиДенежныеОбязательства");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область Прослеживаемость

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)

	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);

КонецПроцедуры

#КонецОбласти

#Область Маркировка

&НаСервере
Функция КоличествоПоКодуМаркировкиОСУ(ДанныеМаркировки)
	Результат = 0;

	КоличествоСтр = "";
	Если Сред(ДанныеМаркировки, 17, 2) = "37" Тогда
		КоличествоСтр = Сред(ДанныеМаркировки, 19);
	ИначеЕсли Сред(ДанныеМаркировки, 16, 2) = "37" Тогда
		КоличествоСтр = Сред(ДанныеМаркировки, 18);
	ИначеЕсли Сред(ДанныеМаркировки, 15, 2) = "37" Тогда
		КоличествоСтр = Сред(ДанныеМаркировки, 17);
	ИначеЕсли Сред(ДанныеМаркировки, 11, 2) = "37" Тогда
		КоличествоСтр = Сред(ДанныеМаркировки, 13);
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(КоличествоСтр) Тогда
		Если СтрДлина(КоличествоСтр) < 15 Тогда
			Результат = Число(КоличествоСтр);
		КонецЕсли;
	КонецЕсли;	

	Возврат Результат;
КонецФункции	

&НаСервере
Процедура ПроверитьСведенияОМаркировке()

	ЕстьЗамечанияПоСведениямОМаркировке = Ложь;

	ТоварыИзМаркировки = Новый Массив;
	ДанныеОКоличествеМаркированныхТоваров.Очистить();
	
	Для Каждого ТекСтрока Из Объект.КодыУпаковокМаркируемойПродукции Цикл
		КоличествоМаркированныхТоваров = 0;
		ДанныеМаркировки = СокрЛП(ТекСтрока.НомерУпаковки);
		Если ЗначениеЗаполнено(ДанныеМаркировки) Тогда
			Если Сред(ДанныеМаркировки, 1, 2) = "02" Тогда
				КоличествоМаркированныхТоваров = КоличествоПоКодуМаркировкиОСУ(ДанныеМаркировки);
			Иначе
				КоличествоМаркированныхТоваров = 1;
			КонецЕсли;	
		КонецЕсли;
		Если КоличествоМаркированныхТоваров > 0 Тогда
			ТоварыИзМаркировки.Добавить(ТекСтрока.МаркируемыйТовар);
			НоваяСтрока = ДанныеОКоличествеМаркированныхТоваров.Добавить();
			НоваяСтрока.МаркируемыйТовар = ТекСтрока.МаркируемыйТовар;
			НоваяСтрока.КоличествоПоСведениямОМаркировке = КоличествоМаркированныхТоваров;
		КонецЕсли;	
	КонецЦикла;	

	Для Каждого ТекСтрока Из Объект.СписокНоменклатуры Цикл
		Если НЕ ТоварыИзМаркировки.Найти(ТекСтрока.Номенклатура) = Неопределено Тогда
			НоваяСтрока = ДанныеОКоличествеМаркированныхТоваров.Добавить();
			НоваяСтрока.МаркируемыйТовар = ТекСтрока.Номенклатура;
			НоваяСтрока.КоличествоПоДокументу = ТекСтрока.Количество;
		КонецЕсли;	
	КонецЦикла;
	
	ДанныеОКоличестве = ДанныеОКоличествеМаркированныхТоваров.Выгрузить();
	ДанныеОКоличестве.Свернуть("МаркируемыйТовар", "КоличествоПоДокументу, КоличествоПоСведениямОМаркировке");
	ДанныеОКоличествеМаркированныхТоваров.Загрузить(ДанныеОКоличестве);

	Для Каждого ТекСтрока Из ДанныеОКоличествеМаркированныхТоваров Цикл
		Если ТекСтрока.КоличествоПоДокументу <> ТекСтрока.КоличествоПоСведениямОМаркировке Тогда
			ЕстьЗамечанияПоСведениямОМаркировке = Истина;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеЗаголовкаСведенияОМаркировке(Форма)
	
	Объект = Форма.Объект;
	
	Если Форма.ЕстьЗамечанияПоСведениямОМаркировке Тогда
		Форма.ДанныеЗаголовкаСведенияОМаркировке = НСтр("ru='есть расхождения!'");
		Форма.ДанныеЗаголовкаСведенияОМаркировке = НСтр("ru='есть расхождения!'");
		Форма.Элементы.ГруппаКодыМаркировки.Картинка = БиблиотекаКартинок.КрасныйВосклицательныйЗнак;
	Иначе
		Форма.ДанныеЗаголовкаСведенияОМаркировке = НСтр("ru=''");
		Форма.Элементы.ГруппаКодыМаркировки.Картинка = Новый Картинка;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИзменитьРеквизитыСтрокЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ИдентификаторСтроки Из Элементы.СписокНоменклатуры.ВыделенныеСтроки Цикл
		ТекущиеДанные = Объект.СписокНоменклатуры.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИзменитьРеквизитыНоменклатурыНаСервере(ТекущиеДанные.Номенклатура, Результат);
	КонецЦикла;
	
	ОбновитьТекстВидовНоменклатурыВсехСтрокТаблицыСписокНоменклатуры();	

КонецПроцедуры

&НаСервере
Процедура ИзменитьРеквизитыНоменклатурыНаСервере(Номенклатура, ИзмененныеЗначенияРеквизитов)
	НоменклатураДляИзменения = Номенклатура.ПолучитьОбъект();
	НоменклатураИзменена = Ложь;
	Если ИзмененныеЗначенияРеквизитов.ТипНоменклатурыЭДО = 0 Тогда
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
			Если ИзмененныеЗначенияРеквизитов.Свойство("ТипНоменклатуры") Тогда
				Если ЗначениеЗаполнено(ИзмененныеЗначенияРеквизитов.ТипНоменклатуры) Тогда
					НоменклатураДляИзменения.ТипНоменклатуры = ИзмененныеЗначенияРеквизитов.ТипНоменклатуры;
					НоменклатураИзменена = Истина;
				КонецЕсли;
			КонецЕсли;	
			Если ИзмененныеЗначенияРеквизитов.Свойство("ЕдиницаИзмерения") Тогда
				Если ЗначениеЗаполнено(ИзмененныеЗначенияРеквизитов.ЕдиницаИзмерения) Тогда
					НоменклатураДляИзменения.ЕдиницаИзмерения = ИзмененныеЗначенияРеквизитов.ЕдиницаИзмерения;
					НоменклатураИзменена = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли ИзмененныеЗначенияРеквизитов.ТипНоменклатурыЭДО = 1 Тогда
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			Если ИзмененныеЗначенияРеквизитов.Свойство("ИмуществоКазны") Тогда
				НоменклатураДляИзменения.ИмуществоКазны = ИзмененныеЗначенияРеквизитов.ИмуществоКазны;
				НоменклатураИзменена = Истина;
			КонецЕсли;	
			Если ИзмененныеЗначенияРеквизитов.Свойство("ВидНФА") Тогда
				Если ЗначениеЗаполнено(ИзмененныеЗначенияРеквизитов.ВидНФА) Тогда
					НоменклатураДляИзменения.ВидНФА = ИзмененныеЗначенияРеквизитов.ВидНФА;
					НоменклатураИзменена = Истина;
				КонецЕсли;
			КонецЕсли;	
			Если ИзмененныеЗначенияРеквизитов.Свойство("ТипНФА") Тогда
				Если ЗначениеЗаполнено(ИзмененныеЗначенияРеквизитов.ТипНФА) Тогда
					НоменклатураДляИзменения.ТипНФА = ИзмененныеЗначенияРеквизитов.ТипНФА;
					НоменклатураИзменена = Истина;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли ИзмененныеЗначенияРеквизитов.ТипНоменклатурыЭДО = 2 Тогда
		Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
			Если ИзмененныеЗначенияРеквизитов.Свойство("НомСтоимость") Тогда
				НоменклатураДляИзменения.НомСтоимость = ИзмененныеЗначенияРеквизитов.НомСтоимость;
				НоменклатураИзменена = Истина;
			КонецЕсли;	
			Если ИзмененныеЗначенияРеквизитов.Свойство("ЕдиницаИзмерения") Тогда
				Если ЗначениеЗаполнено(ИзмененныеЗначенияРеквизитов.ЕдиницаИзмерения) Тогда
					НоменклатураДляИзменения.ЕдиницаИзмерения = ИзмененныеЗначенияРеквизитов.ЕдиницаИзмерения;
					НоменклатураИзменена = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НоменклатураИзменена Тогда
		Попытка
			НоменклатураДляИзменения.Записать();
		Исключение
				
			ТекстСообщения  = НСтр("ru='Не удалось записать изменения реквизитов номенклатуры: %ИмяПараметра%'");
			ТекстСообщения  = СтрЗаменить(ТекстСообщения,"%ИмяПараметра%", НоменклатураДляИзменения);
			Сообщение       = Новый СообщениеПользователю();
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Сообщить();
				
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#Область ОбменСГИСЭПД

&НаСервере
Процедура ОбработкаВыбораЭТрННаСервере(ВыбранноеЗначение)

	ЭлектроннаяТранспортнаяНакладная = ВыбранноеЗначение;
	СостояниеЭТрН = ЭлектронныеДокументыБГУ.СостояниеЭТрН(ЭлектроннаяТранспортнаяНакладная, Объект.Ссылка);

	Если ЗначениеЗаполнено(ЭлектроннаяТранспортнаяНакладная) Тогда
		Если НЕ ЭлектроннаяТранспортнаяНакладнаяПривязанаКДокументуПоставщика(ЭлектроннаяТранспортнаяНакладная, Объект.Ссылка) Тогда
			Попытка
				ОбъектЭПД = ЭлектроннаяТранспортнаяНакладная.ПолучитьОбъект();
				НоваяСтрока = ОбъектЭПД.ДокументыОснования.Добавить();
				НоваяСтрока.ДокументОснование = Объект.Ссылка;
				ОбъектЭПД.Записать();
			Исключение
					
				ТекстСообщения  = НСтр("ru='Не удалось записать этот документ в качестве основания документа: %ИмяПараметра%'");
				ТекстСообщения  = СтрЗаменить(ТекстСообщения,"%ИмяПараметра%", ЭлектроннаяТранспортнаяНакладная);
				Сообщение       = Новый СообщениеПользователю();
				Сообщение.Текст = ТекстСообщения;
				Сообщение.Сообщить();
					
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ЭлектроннаяТранспортнаяНакладнаяПривязанаКДокументуПоставщика(ЭлектроннаяТранспортнаяНакладная, ДокументПоставщика)
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование
	               |ИЗ
	               |	Документ.ЭлектроннаяТранспортнаяНакладная.ДокументыОснования КАК ЭлектроннаяТранспортнаяНакладнаяДокументыОснования
	               |ГДЕ
	               |	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка = &ЭлектроннаяТранспортнаяНакладная
	               |	И ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.ДокументОснование = &ДокументПоставщика";
	Запрос.УстановитьПараметр("ЭлектроннаяТранспортнаяНакладная", ЭлектроннаяТранспортнаяНакладная);
	Запрос.УстановитьПараметр("ДокументПоставщика", ДокументПоставщика);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "ЖурналДокументов.ЭлектронныеПеревозочныеДокументы.Форма.ФормаВыбора" Тогда
		ОбработкаВыбораЭТрННаСервере(ВыбранноеЗначение);
	КонецЕсли;	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстВсехСтрокТаблицыСписокНоменклатуры(Форма)

	Объект = Форма.Объект;
	Для Каждого ТекущаяСтрока Из Объект.СписокНоменклатуры Цикл
		ОбновитьТекстВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКартинкиВсехСтрокТаблицыСписокНоменклатуры(Форма)
	Объект = Форма.Объект;
	ТаблицаСДаннымиОРазницеВНоменклатуре = Форма.ДанныеОСравненииНоменклатуры.Выгрузить();
	ЕстьРазличияВНоменклатуре = ?(ТаблицаСДаннымиОРазницеВНоменклатуре.Количество() > 0, Истина, Ложь);
	Если ЕстьРазличияВНоменклатуре Тогда
		Для Каждого ТекущаяСтрока Из ТаблицаСДаннымиОРазницеВНоменклатуре Цикл
			Объект.СписокНоменклатуры[ТекущаяСтрока.НомерСтроки-1].ЕстьЗамечания = ?(Форма.КонтролироватьСоответствиеНаименованияТРУ, 4, 3);		
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКартинкуВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока, НоменклатураСовпадает, КонтролироватьСоответствиеНаименованияТРУ)
	Если НЕ НоменклатураСовпадает Тогда
		ТекущаяСтрока.ЕстьЗамечания = ?(КонтролироватьСоответствиеНаименованияТРУ, 4, 3);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура НоменклатураСовпадает(ИдентификаторПоставщика, Номенклатура, Результат)
	Результат = НЕ ЭлектронныеДокументыБГУ.ЕстьРазличияВНоменклатуреПоставщикаИОрганизации(ИдентификаторПоставщика, Номенклатура);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока)
	Если ЗначениеЗаполнено(ТекущаяСтрока.Содержание) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПоставщика) Тогда
		ТекущаяСтрока.НаименованиеПоставщика = ТекущаяСтрока.Содержание;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторПоставщика) Тогда
		ТекущаяСтрока.ЕстьЗамечания = 1;
	Иначе
		ТекущаяСтрока.ЕстьЗамечания = -1;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеНастроекЭДОБГУ()

	КонтролироватьСоответствиеНаименованияТРУ = ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(Объект.Организация);

КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
