#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
	Иначе
		ОбстоятельстваСоставления = Объект.ОбстоятельстваСоставленияДокумента;
		ОбстоятельстваИспользования = Объект.ОбстоятельстваИспользованияДокументаПерваяЧастьКода;
	КонецЕсли;
	
	ПоказатьОписаниеВариантаФормированияДополнительныхСведений();
	СоздатьКнопкуДляСодержанияИтоговПриемки(ЭтотОбъект, "СодержаниеДополнительныхСведений", Элементы.ГруппаСодержаниеДополнительныхСведений);
	
	НастроитьФормуНаСервере();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	ДополнительныеПараметры.Вставить("Объект", Объект);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// Подсистема "ОбменСКонтрагентами".
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	КонецЕсли;
	// Конец подсистема "ОбменСКонтрагентами".
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".    
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".    
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
	ОбновитьТекстИныеСведенияВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыСведенияПоТранспортнымДокументам(ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.АктОРасхождениях.Форма.ФормаВводаДанныхНоменклатурыПоставщика" Тогда
		ОбработкаДобавленияДанныхОНоменклатуреНаСервере(ВыбранноеЗначение);
		ОбновитьТекстЗаголовковВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
		ОбновитьТекстИныеСведенияВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
	 	И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбстоятельстваИспользованияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОбстоятельстваИспользования) Тогда
		Объект.ОбстоятельстваИспользованияДокументаПерваяЧастьКода = ОбстоятельстваИспользования;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбстоятельстваСоставленияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОбстоятельстваСоставления) Тогда
		Объект.ОбстоятельстваСоставленияДокумента = ОбстоятельстваСоставления;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ДоступностьДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВалютаНДСНажатие(Элемент, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура СопроводительныйДокументНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныйДокументНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоотправительПриИзменении(Элемент)
	НастроитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	НастроитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНоменклатуры

&НаКлиенте
Процедура СписокНоменклатурыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
		ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекущиеДанные);
		ОбновитьТекстИныеСведенияСтрокиТаблицыСписокНоменклатуры(ЭтаФорма, ТекущиеДанные); 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПояснениеБракНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("СписокНоменклатурыПояснениеБракЗавершениеВвода", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение, Элемент.ТекстРедактирования, НСтр("ru='Пояснения по браку'"));
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПояснениеБракЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.ПояснениеБрак = ВведенныйТекст;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПояснениеБойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("СписокНоменклатурыПояснениеБойЗавершениеВвода", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение, Элемент.ТекстРедактирования, НСтр("ru='Пояснения по бою'"));
КонецПроцедуры
	
&НаКлиенте
Процедура СписокНоменклатурыПояснениеБойЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.ПояснениеБой = ВведенныйТекст;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПояснениеНедостачаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("СписокНоменклатурыПояснениеНедостачаЗавершениеВвода", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение, Элемент.ТекстРедактирования, НСтр("ru='Пояснения по недостаче'"));
КонецПроцедуры
	
&НаКлиенте
Процедура СписокНоменклатурыПояснениеНедостачаЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.ПояснениеНедостача = ВведенныйТекст;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПояснениеИзлишкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("СписокНоменклатурыПояснениеИзлишкиЗавершениеВвода", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение, Элемент.ТекстРедактирования, НСтр("ru='Пояснения по излишкам'"));
КонецПроцедуры
	
&НаКлиенте
Процедура СписокНоменклатурыПояснениеИзлишкиЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.ПояснениеИзлишки = ВведенныйТекст;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦеновыеОтклоненияПояснениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("СписокНоменклатурыПояснениеЦеновыеОтклоненияЗавершениеВвода", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение, Элемент.ТекстРедактирования, НСтр("ru='Пояснения по ценовым отклонениям'"));
КонецПроцедуры
	
&НаКлиенте
Процедура СписокНоменклатурыПояснениеЦеновыеОтклоненияЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.ЦеновыеОтклоненияПояснение = ВведенныйТекст;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыИнформацияОРасхожденияхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("СписокНоменклатурыИнформацияОРасхожденияхЗавершениеВвода", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение, Элемент.ТекстРедактирования, НСтр("ru='Информация о расхождениях'"));
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыИнформацияОРасхожденияхЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекущиеДанные.ИнформацияОРасхождениях = ВведенныйТекст;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыИныеСведенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФормуВводаДанныхОНоменклатуре(Элементы.СписокНоменклатуры.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СписокНоменклатурыИныеСведения" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуВводаДанныхОНоменклатуре(ВыбраннаяСтрока);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПоДокументамПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "КоличествоПоДокументам");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПоДокументамПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "ЦенаПоДокументам");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСтавкаНДСПоДокументамПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДСПоДокументам");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаНДСПоДокументамПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДСПоДокументам");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПоФактуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "КоличествоПоФакту");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПоФактуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "ЦенаПоФакту");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСтавкаНДСПоФактуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДСПоФакту");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаНДСПоФактуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДСПоФакту");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПоДокументамПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаПоДокументам");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВсегоПоДокументамПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "ВсегоПоДокументам");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыСуммаПоФактуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаПоФакту");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыВсегоПоФактуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РассчитатьСтроку(Элементы.СписокНоменклатуры.ТекущиеДанные, Объект.СуммаВключаетНДС, "ВсегоПоФакту");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияПоТранспортнымДокументам

&НаКлиенте
Процедура СведенияПоТранспортнымДокументамПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.СведенияПоТранспортнымДокументам.ТекущиеДанные;
		ОбновитьТекстЗаголовковВСтрокеТаблицыСведенияПоТранспортнымДокументам(ТекущиеДанные);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрилагаемыеДокументы

&НаКлиенте
Процедура ПрилагаемыеДокументыВидДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.КраткоеОписаниеСобытия) Тогда
		ОписаниеСобытия = НСтр("ru = 'При приемке указанных в документе ценностей (результатов работ) установлены расхождения с сопроводительными документами.'");
		Объект.КраткоеОписаниеСобытия = ОписаниеСобытия;
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы(ЭтотОбъект, Объект);
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
	ОбновитьТекстИныеСведенияВсехСтрокТаблицыСписокНоменклатуры(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыСведенияПоТранспортнымДокументам(ЭтаФорма);
	
	УстановитьДоступностьРеквизитовОрганизации(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуНаСервере()
	
	ГрузополучательСведения = СведенияОКонтрагентеУчастнике(Объект.ГрузополучательНаименование,
		Объект.ГрузополучательИНН, Объект.ГрузополучательКПП,
		Объект.ГрузополучательТелефон, Объект.ГрузополучательЭлектроннаяПочта);
	ГрузоотправительСведения = СведенияОКонтрагентеУчастнике(Объект.ГрузоотправительНаименование,
		Объект.ГрузоотправительИНН, Объект.ГрузоотправительКПП,
		Объект.ГрузоотправительТелефон, Объект.ГрузоотправительЭлектроннаяПочта);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузоотправительСведения", 
		"Видимость", НЕ ЗначениеЗаполнено(Объект.Грузоотправитель));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГрузополучательСведения", 
		"Видимость", НЕ ЗначениеЗаполнено(Объект.Грузополучатель));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитовОрганизации(Форма)

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Подразделение");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры // УстановитьДоступностьРеквизитовОрганизации()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация) И ЗначениеЗаполнено(Форма.Объект.Контрагент));

КонецПроцедуры

&НаКлиенте
Процедура ДоступностьДоговора()

	Элементы.Договор.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	
	ПараметрыПредставления = Новый Структура("ВалютаДокумента, СуммаВключаетНДС");
	ЗаполнитьЗначенияСвойств(ПараметрыПредставления, Объект);
	ПараметрыПредставления.Вставить("ПоказыватьНДС", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьВалюту", Форма.КэшПараметров.ИспользоватьВалютныйУчет);
	
	Форма.НадписьВалютаНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
		
КонецПроцедуры
	
	&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт

	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.СуммаВключаетНДС <> Объект.СуммаВключаетНДС Тогда
		ПересчитатьТабличнуюЧасть();
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТабличнуюЧасть()
	Для Каждого СтрокаТЧ из Объект.СписокНоменклатуры Цикл
		РассчитатьСтроку(СтрокаТЧ, Объект.СуммаВключаетНДС, "Сумма");
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	РассчитатьСтрокуПоДокументам(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита);
	РассчитатьСтрокуПоФакту(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтрокуПоДокументам(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	Если ИмяРеквизита = "КоличествоПоДокументам"
		ИЛИ ИмяРеквизита = "ЦенаПоДокументам"
		ИЛИ ИмяРеквизита = "СуммаПоДокументам"
		ИЛИ ИмяРеквизита = "ВсегоПоДокументам"
		ИЛИ ИмяРеквизита = "СтавкаНДСПоДокументам"
		ИЛИ ИмяРеквизита = "СуммаНДСПоДокументам" Тогда
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
		ПараметрыРасчета.Вставить("ИмяРеквизитаКоличество", "КоличествоПоДокументам");
		ПараметрыРасчета.Вставить("ИмяРеквизитаЦена", "ЦенаПоДокументам");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСтавкаНДС", "СтавкаНДСПоДокументам");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСуммаНДС", "СуммаНДСПоДокументам");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСумма", "СуммаПоДокументам");
		ПараметрыРасчета.Вставить("ИмяРеквизитаВсего", "ВсегоПоДокументам");
		
		Если ИмяРеквизита = "СуммаПоДокументам" ИЛИ  ИмяРеквизита = "ВсегоПоДокументам" Тогда
			ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
		КонецЕсли;
		
		ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "ПоДокументам", "");
		
		УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтрокуПоФакту(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	Если ИмяРеквизита = "КоличествоПоФакту"
		ИЛИ ИмяРеквизита = "ЦенаПоФакту"
		ИЛИ ИмяРеквизита = "СуммаПоФакту"
		ИЛИ ИмяРеквизита = "ВсегоПоФакту"
		ИЛИ ИмяРеквизита = "СтавкаНДСПоФакту"
		ИЛИ ИмяРеквизита = "СуммаНДСПоФакту" Тогда
		
		ПараметрыРасчета = Новый Структура;
		ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
		ПараметрыРасчета.Вставить("ИмяРеквизитаКоличество", "КоличествоПоФакту");
		ПараметрыРасчета.Вставить("ИмяРеквизитаЦена", "ЦенаПоФакту");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСтавкаНДС", "СтавкаНДСПоФакту");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСуммаНДС", "СуммаНДСПоФакту");
		ПараметрыРасчета.Вставить("ИмяРеквизитаСумма", "СуммаПоФакту");
		ПараметрыРасчета.Вставить("ИмяРеквизитаВсего", "ВсегоПоФакту");
		
		Если ИмяРеквизита = "СуммаПоФакту" ИЛИ  ИмяРеквизита = "ВсегоПоФакту" Тогда
			ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
		КонецЕсли;
		
		ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "ПоФакту", "");
		
		УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыСписокНоменклатуры(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.СписокНоменклатуры Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыСписокНоменклатуры(ТекущаяСтрока)

	ТекущаяСтрока.ЗаголовокНоменклатурыПоставщика = НСтр("ru = 'наименование:'");
	ТекущаяСтрока.ЗаголовокНоменклатуры = НСтр("ru = 'номенклатура:'");
	
	ТекущаяСтрока.ЗаголовокИныеСведения = НСтр("ru = 'прочее:'");
	ТекущаяСтрока.ЗаголовокЕдиницаИзмерения = НСтр("ru = 'ед.изм.:'");
	
	ТекущаяСтрока.ЗаголовокПоДокументамКоличество = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокПоДокументамЦена = НСтр("ru = 'цена:'");
	
	ТекущаяСтрока.ЗаголовокПоДокументамСумма = НСтр("ru = 'сумма:'");
	ТекущаяСтрока.ЗаголовокПоДокументамВсего = НСтр("ru = 'всего:'");
	
	ТекущаяСтрока.ЗаголовокПоДокументамСтавкаНДС = НСтр("ru = 'ставка НДС:'");
	ТекущаяСтрока.ЗаголовокПоДокументамСуммаНДС = НСтр("ru = 'сумма НДС:'");
	
	ТекущаяСтрока.ЗаголовокПоФактуКоличество = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокПоФактуЦена = НСтр("ru = 'цена:'");
	
	ТекущаяСтрока.ЗаголовокПоФактуСумма = НСтр("ru = 'сумма:'");
	ТекущаяСтрока.ЗаголовокПоФактуВсего = НСтр("ru = 'всего:'");
	
	ТекущаяСтрока.ЗаголовокПоФактуСтавкаНДС = НСтр("ru = 'ставка НДС:'");
	ТекущаяСтрока.ЗаголовокПоФактуСуммаНДС = НСтр("ru = 'сумма НДС:'");
	
	ТекущаяСтрока.ЗаголовокПоФактуБрак = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокПоФактуПоясненияБрак = НСтр("ru = 'пояснение:'");
	
	ТекущаяСтрока.ЗаголовокПоФактуБой = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокПоФактуПоясненияБой = НСтр("ru = 'пояснение:'");
	
	ТекущаяСтрока.ЗаголовокПоФактуИзлишки = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокПоФактуПоясненияИзлишки = НСтр("ru = 'пояснение:'");
	
	ТекущаяСтрока.ЗаголовокПоФактуНедостача = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокПоФактуПоясненияНедостача = НСтр("ru = 'пояснение:'");
	
	ТекущаяСтрока.ЗаголовокЦеновыеОтклоненияЦена = НСтр("ru = 'цена:'");
	ТекущаяСтрока.ЗаголовокЦеновыеОтклоненияСуммаНДС = НСтр("ru = 'сумма НДС:'");
	
	ТекущаяСтрока.ЗаголовокЦеновыеОтклоненияВсего = НСтр("ru = 'всего:'");
	ТекущаяСтрока.ЗаголовокЦеновыеОтклоненияПояснение = НСтр("ru = 'пояснение:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстИныеСведенияВсехСтрокТаблицыСписокНоменклатуры(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.СписокНоменклатуры	Цикл
		ОбновитьТекстИныеСведенияСтрокиТаблицыСписокНоменклатуры(Форма, ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстИныеСведенияСтрокиТаблицыСписокНоменклатуры(Форма, ТекущаяСтрока)
	ДанныеИныхСведенийОНоменклатуре = ДанныеИныхСведенийОНоменклатуре(Форма, ТекущаяСтрока);
	ТекстИныеСведения = ДанныеИныхСведенийОНоменклатуре.ТекстИныхСведений;
	ЕстьИныеСведения = ДанныеИныхСведенийОНоменклатуре.ЕстьИныеСведения;
	ОбновитьТекстИныеСведения(Форма, ТекущаяСтрока, ЕстьИныеСведения, ТекстИныеСведения);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеИныхСведенийОНоменклатуре(Форма, ТекущиеИныеСведения)
	Объект = Форма.Объект;
	
	ЕстьСведения = Ложь;
	ТекстСведений = "";
	
	Если ЗначениеЗаполнено(ТекущиеИныеСведения.АртикулТовара) Тогда
		ЕстьСведения = Истина;
		ТекстСведений = ТекстСведений + "артикул: "+СокрЛП(ТекущиеИныеСведения.АртикулТовара);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеИныеСведения.СортТовара) Тогда
		ЕстьСведения = Истина;
		ТекстСведений = ТекстСведений +(?(ЗначениеЗаполнено(ТекстСведений),", "," ")) + "сорт: "+СокрЛП(ТекущиеИныеСведения.СортТовара);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеИныеСведения.КодТовара) Тогда
		ЕстьСведения = Истина;
		ТекстСведений = ТекстСведений +(?(ЗначениеЗаполнено(ТекстСведений),", "," "))+ "код: "+СокрЛП(ТекущиеИныеСведения.КодТовара);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеИныеСведения.ПаспортТовара) Тогда
		ЕстьСведения = Истина;
		ТекстСведений = ТекстСведений +(?(ЗначениеЗаполнено(ТекстСведений),", "," "))+ "паспорт: "+СокрЛП(ТекущиеИныеСведения.ПаспортТовара);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеИныеСведения.ХарактеристикаТовара) Тогда
		ЕстьСведения = Истина;
		ТекстСведений = ТекстСведений +(?(ЗначениеЗаполнено(ТекстСведений),", "," "))+ "характеристика: "+Сред(СокрЛП(ТекущиеИныеСведения.ХарактеристикаТовара),1,10)
			+ (?(СтрДлина(ТекущиеИныеСведения.ХарактеристикаТовара)>10,"...",""));
	КонецЕсли;	
	
	Результат = Новый Структура;
	Результат.Вставить("ТекстИныхСведений", ТекстСведений);
	Результат.Вставить("ЕстьИныеСведения", ЕстьСведения);
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстИныеСведения(Форма, ТекущаяСтрока, ЕстьИныеСведения = Ложь, ТекстИныеСведения)
	Если ЕстьИныеСведения Тогда
		ТекущаяСтрока.ИныеСведения = СокрЛП(ТекстИныеСведения);
	Иначе
		ТекущаяСтрока.ИныеСведения = НСтр("ru = 'Ввести данные'");
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуВводаДанныхОНоменклатуре(ВыбранноеЗначение)

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = Объект.СписокНоменклатуры.НайтиПоИдентификатору(ВыбранноеЗначение);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторСтроки", ВыбранноеЗначение);
	ПараметрыФормы.Вставить("АртикулТовара", ДанныеСтроки.АртикулТовара);
	ПараметрыФормы.Вставить("СортТовара", ДанныеСтроки.СортТовара);
	ПараметрыФормы.Вставить("КодТовара", ДанныеСтроки.КодТовара);
	ПараметрыФормы.Вставить("ПаспортТовара", ДанныеСтроки.ПаспортТовара);
	ПараметрыФормы.Вставить("ХарактеристикаТовара", ДанныеСтроки.ХарактеристикаТовара);
	ПараметрыФормы.Вставить("НаименованиеТовара", ДанныеСтроки.НаименованиеТовара);
	
	ОткрытьФорму("Документ.АктОРасхождениях.Форма.ФормаВводаДанныхНоменклатурыПоставщика", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбработкаДобавленияДанныхОНоменклатуреНаСервере(Знач ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("ИдентификаторСтроки") Тогда
			ДанныеСтроки = Объект.СписокНоменклатуры.НайтиПоИдентификатору(ВыбранноеЗначение.ИдентификаторСтроки);
			
			ДанныеСтроки.АртикулТовара = ВыбранноеЗначение.АртикулТовара;
			ДанныеСтроки.СортТовара = ВыбранноеЗначение.СортТовара;
			ДанныеСтроки.КодТовара = ВыбранноеЗначение.КодТовара;
			ДанныеСтроки.ПаспортТовара = ВыбранноеЗначение.ПаспортТовара;
			ДанныеСтроки.ХарактеристикаТовара = ВыбранноеЗначение.ХарактеристикаТовара;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	РеквизитыДоговора = Новый Структура("ИдентификаторГосконтракта, КонтрактСУчастникомГОЗ",  "ГосударственныйКонтрактПоГОЗ.Код");
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, РеквизитыДоговора);
	
	Если ЗначениеЗаполнено(РеквизитыДоговора.ИдентификаторГосконтракта) Тогда
		Объект.ИдентификаторГосКонтракта = РеквизитыДоговора.ИдентификаторГосконтракта;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОписаниеВариантаФормированияДополнительныхСведений()

	ОписаниеВариантаФормированияДополнительныхСведений = ЭлектронныеДокументыБГУ.ОписаниеВариантаФормированияДополнительныхСведений(Объект.ФормированиеДополнительныхСведений);
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыСведенияПоТранспортнымДокументам(ТекущаяСтрока)

	ТекущаяСтрока.ЗаголовокОтметкаОбОпломбировании = НСтр("ru = 'опломбирование:'");
	ТекущаяСтрока.ЗаголовокВидУпаковки = НСтр("ru = 'вид упаковки:'");
	
	ТекущаяСтрока.ЗаголовокКоличество = НСтр("ru = 'количество:'");
	ТекущаяСтрока.ЗаголовокЕдиницаИзмерения = НСтр("ru = 'ед.изм.:'");
	
	ТекущаяСтрока.ЗаголовокНоменклатураГруза = НСтр("ru = 'номенклатура:'");
	ТекущаяСтрока.ЗаголовокНаименованиеГруза = НСтр("ru = 'наименование:'");
	
	ТекущаяСтрока.ЗаголовокМассаОтправленияБрутто = НСтр("ru = 'брутто:'");
	ТекущаяСтрока.ЗаголовокМассаОтправленияНетто = НСтр("ru = 'нетто:'");
	
	ТекущаяСтрока.ЗаголовокМассаПрибытияБрутто = НСтр("ru = 'брутто:'");
	ТекущаяСтрока.ЗаголовокМассаПрибытияНетто = НСтр("ru = 'нетто:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыСведенияПоТранспортнымДокументам(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.СведенияПоТранспортнымДокументам Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыСведенияПоТранспортнымДокументам(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СведенияОКонтрагентеУчастнике(Наименование, ИНН, КПП, Телефон, ЭлектроннаяПочта)
	Результат = "";
	
	Результат = Наименование + " " + ИНН + "/" + КПП;
	КонтактнаяИнформация = "";
	Если ЗначениеЗаполнено(Телефон) Тогда
		КонтактнаяИнформация = " тел.: " + Телефон;
	КонецЕсли;	
	Если ЗначениеЗаполнено(ЭлектроннаяПочта) Тогда
		КонтактнаяИнформация = КонтактнаяИнформация + ?(ЗначениеЗаполнено(КонтактнаяИнформация),", ","") + " эл.почта: " + ЭлектроннаяПочта;
	КонецЕсли;	
	Если ЗначениеЗаполнено(КонтактнаяИнформация) Тогда
		КонтактнаяИнформация = " ("+КонтактнаяИнформация+")";
		Результат = Результат + КонтактнаяИнформация;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура СоздатьКнопкуДляСодержанияИтоговПриемки(Форма, ИмяРеквизита, ГруппаРеквизита)
	
	ИмяКоманды = "Заполнить" + ИмяРеквизита;  
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Отображение = ОтображениеКнопки.Картинка;
	Команда.Действие = "ОбработкаНажатияКнопкиЗаполненияСодержанияИтоговПриемки";
	
	Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРеквизита);
	Элемент.ИмяКоманды = ИмяКоманды;
	
	Элемент.Заголовок = НСтр("ru = 'Заполнить'");
	Команда.Подсказка = НСтр("ru = 'Заполнить содержание итогов приемки'");
	Команда.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияКнопкиЗаполненияСодержанияИтоговПриемки(КомандаФормы)
	
	Элемент = ЭтаФорма.Элементы.Найти(КомандаФормы.Имя);
	СписокДляСодержанияИтоговПриемки = СписокЗначенийВариантовСодержанияДополнительныхСведений();
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораСодержанияИтоговПриемки", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокДляСодержанияИтоговПриемки, Элемент);
	
КонецПроцедуры

&НаКлиенте
Функция СписокЗначенийВариантовСодержанияДополнительныхСведений() Экспорт

	Результат = Новый СписокЗначений;
	Результат.Добавить("Материальные ценности приняты и оприходованы", НСтр("ru = 'Материальные ценности приняты и оприходованы'"));
	Результат.Добавить("Документ о приемке и (или) расхождениях утверждаю", НСтр("ru = 'Документ о приемке и (или) расхождениях утверждаю'"));
		
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеВыбораСодержанияИтоговПриемки(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = Сред(ДополнительныеПараметры.Элемент.Имя,10);
	Объект[ИмяРеквизита] = ВыбранныйЭлемент; 
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
