
#Область ОписаниеПеременных

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Перем ПроверкаКонтрагентовПараметрыОбработчикаОжидания Экспорт;
&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если Параметры.Ключ.Пустая() Тогда   
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ЭтотОбъект.Прочитать();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	НачисленияЗаполнитьДобавленныеКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПриОткрытииДокумент(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами    
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект); 

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			Ложь);
			
		ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Ложь;
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	РассчитатьСуммыСтрокНаСервере();
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.Начисления.Очистить();
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
    
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
    
    РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
                ПараметрыПеретаскивания, СтандартнаяОбработка);
    
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура НачисленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "НачисленияПоказатьПредупреждение" Тогда
		ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
		ПоказатьПредупреждение(, ТекущиеДанные.ТекстПредупреждения, , НСтр("ru = 'Отражение в доходах текущего периода'"));
	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ТаблицаФормыВыбор(ЭтотОбъект, Элемент, Поле);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СтатусОперацииДоИзменения", ТекущиеДанные.СтатусОперации);
	
	Если НоваяСтрока И НЕ Копирование Тогда
		НачисленияЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПризнакиСтатусаОперации = КлассифицироватьСтатусОперацииНачисленияДоходов(Элемент.ТекущиеДанные.СтатусОперации);
	ВСтатусеОперацииЕстьНастройкиПроводок = ЗначениеЗаполнено(ПризнакиСтатусаОперации.СтатусОперацииСчетДт);
	
	ТекстПредупреждения = "";
	
	Если НЕ ВСтатусеОперацииЕстьНастройкиПроводок Тогда
		ТекстПредупреждения = ТекстПредупреждения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='В строке %1 для статуса %2 в отсутствует настройка для отражения в учете. Проводки сформированы не будут.'"),
				Элемент.ТекущиеДанные.НомерСтроки,
				Элемент.ТекущиеДанные.СтатусОперации);
	КонецЕсли;
	
	Если (ПризнакиСтатусаОперации.ЭтоНачислениеДоходов ИЛИ ПризнакиСтатусаОперации.ЭтоДеаннулированиеДоходов)
		И (Элемент.ТекущиеДанные.Сумма < 0 Или Элемент.ТекущиеДанные.СуммаВВалюте < 0) Тогда
		ТекстПредупреждения = ТекстПредупреждения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Проверьте сумму начисления в строке %1. Для статуса %2 сумма начисления должна быть больше нуля.'"),
				Элемент.ТекущиеДанные.НомерСтроки,
				Элемент.ТекущиеДанные.СтатусОперации);
	КонецЕсли;
	
	Если (ПризнакиСтатусаОперации.ЭтоАннулированиеДоходов)
		И (Элемент.ТекущиеДанные.Сумма > 0 Или Элемент.ТекущиеДанные.СуммаВВалюте > 0) Тогда
		ТекстПредупреждения = ТекстПредупреждения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Проверьте сумму начисления в строке %1. Для статуса %2 сумма начисления должна быть меньше нуля.'"),
				Элемент.ТекущиеДанные.НомерСтроки,
				Элемент.ТекущиеДанные.СтатусОперации);
	КонецЕсли;
	
	Если ПризнакиСтатусаОперации.ЭтоУточнениеДоходов
		И ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаПризнанияДоходов)
		И Элемент.ТекущиеДанные.ДатаПризнанияДоходов < Объект.Дата Тогда
		ТекстПредупреждения = ТекстПредупреждения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Проверьте дату признания дохода в строке %1. Для статуса %2 дата признания дохода не может быть ранее даты формирования ведомости %3.'"),
				Элемент.ТекущиеДанные.НомерСтроки,
				Элемент.ТекущиеДанные.СтатусОперации,
				Объект.Дата);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ПредельнаяДатаИсполнения) 
		И (НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДатаПризнанияДоходов)
		ИЛИ Элемент.ТекущиеДанные.ПредельнаяДатаИсполнения < Элемент.ТекущиеДанные.ДатаПризнанияДоходов
		ИЛИ Элемент.ТекущиеДанные.ПредельнаяДатаИсполнения < Объект.Дата) Тогда
		ТекстПредупреждения = ТекстПредупреждения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Проверьте предельную дату исполнения в строке %1. Дата исполнения не может быть ранее даты признания дохода и даты формирования ведомости.'"),
				Элемент.ТекущиеДанные.НомерСтроки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПредупреждения,,, "Объект"); 
	Иначе
		ТекстПредупреждения = ПроверитьНаличиеУточняемыхДоходов(Элемент.ТекущиеДанные.СтатусОперации,
			Элемент.ТекущиеДанные.Контрагент,
			Элемент.ТекущиеДанные.ДоговорКонтрагента,
			Элемент.ТекущиеДанные.КОСГУ,
			Элемент.ТекущиеДанные.КПС,
			?(ЗначениеЗаполнено(Элемент.ТекущиеДанные.КФО), Элемент.ТекущиеДанные.КФО, ПредопределенноеЗначение("Перечисление.КВД.Бюджет")),
			Объект.Дата,
			Объект.Организация);
		Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстПредупреждения + 
				НСтр("ru=' Проверьте данные в строке %1.'"), Элемент.ТекущиеДанные.НомерСтроки) ,,,, "Объект"); 
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	ХарактеристикиГосуслуги = ПолучитьХарактеристикиГосуслуги(ТекущиеДанные.Номенклатура, Объект.Дата);
	
	ТекущиеДанные.КодОКТМО = ХарактеристикиГосуслуги.КодОКАТО;
	ТекущиеДанные.НомерРеестровойЗаписи = ХарактеристикиГосуслуги.НомерРеестровойЗаписи;
	
	// Реквизиты КОСГУ, КПС и сумма к этому моменту могут быть заполнены по данным графиков исполнения.
	Если Не (ЗначениеЗаполнено(ТекущиеДанные.КОСГУ) И ТекущиеДанные.ВестиПланГрафикИсполнения)
		И ЗначениеЗаполнено(ХарактеристикиГосуслуги.КЭК) Тогда
		ТекущиеДанные.КОСГУ = ХарактеристикиГосуслуги.КЭК;
	КонецЕсли;
	Если Не (ЗначениеЗаполнено(ТекущиеДанные.КПС) И ТекущиеДанные.ВестиПланГрафикИсполнения)
		И ЗначениеЗаполнено(ХарактеристикиГосуслуги.КПС) Тогда
		ТекущиеДанные.КПС = ХарактеристикиГосуслуги.КПС;
	КонецЕсли;
	Если Не (ЗначениеЗаполнено(ТекущиеДанные.Сумма) И ТекущиеДанные.ВестиПланГрафикИсполнения) 
		И ЗначениеЗаполнено(ХарактеристикиГосуслуги.Стоимость) Тогда
		ТекущиеДанные.Сумма = ХарактеристикиГосуслуги.Стоимость;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКПСПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(ТекущиеДанные.КПС, ТекущиеДанные.КОСГУ); 
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	ТекущиеДанные.ИдентификаторПлательщика = ИдентификаторКонтрагента(ТекущиеДанные.Контрагент, Объект.ВидДокументаФизЛиц);
	
	НачисленияЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные, 
		РеквизитыДоговоров(ТекущиеДанные.ДоговорКонтрагента));
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Элементы.Начисления);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
		
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПараметрыВыбораКонтрагента = Новый Массив;   
	
	Если Объект.Групповая Тогда
		ПараметрыВыбораКонтрагента.Добавить(Новый ПараметрВыбора("ПоказыватьУчетныеГруппы", Истина));
	КонецЕсли;  
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораКонтрагента); 
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДоговорКонтрагентаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные; 
	РеквизитыДоговора = РеквизитыДоговоров(ТекущиеДанные.ДоговорКонтрагента); 
	ДокОснование = РеквизитыДоговора.Получить(ТекущиеДанные.ДоговорКонтрагента);
	
	Если НЕ ДокОснование = Неопределено Тогда
		ТекущиеДанные.ВидПервичногоДокумента = ДокОснование.ВидОбязательства;
		ТекущиеДанные.ДатаПервичногоДокумента = ДокОснование.ДатаДоговора;
		ТекущиеДанные.НомерПервичногоДокумента = ДокОснование.НомерДоговора;
	КонецЕсли;	
		
	НачисленияЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные, РеквизитыДоговора); 
	
КонецПроцедуры  

&НаКлиенте
Процедура НачисленияВалютаПриИзменении(Элемент)
	РассчитатьСуммуСтрокиНаКлиенте(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДатаПризнанияДоходовПриИзменении(Элемент)
	РассчитатьСуммуСтрокиНаКлиенте(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСуммаВВалютеПриИзменении(Элемент)
	РассчитатьСуммуСтрокиНаКлиенте(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСтатусОперацииПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	Если ТекущиеДанные.СтатусОперации = ЭтотОбъект.КэшПараметров.Локальные.СтатусОперацииДоИзменения Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		Оповещение = Новый ОписаниеОповещения("НачисленияСтатусОперацииПриИзмененииОбработкаОтвета", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Проведение документа будет отменено. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		СтатусОперацииПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСтатусОперацииПриИзмененииОбработкаОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СтатусОперацииПриИзмененииНаСервере();
	Иначе
		ТекущиеДанные.СтатусОперации = ЭтотОбъект.КэшПараметров.Локальные.СтатусОперацииДоИзменения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСтатусОперацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	ПараметрыВыбораСтатусаОперации = Новый Структура;
	ПараметрыВыбораСтатусаОперации.Вставить("Организация", Объект.Организация);
	ПараметрыВыбораСтатусаОперации.Вставить("НаДату", Объект.Дата);
	ПараметрыВыбораСтатусаОперации.Вставить("ТекущийСтатусОперации", ТекущиеДанные.СтатусОперации);
	
	ОткрытьФорму("Справочник.СтатусыОперацийНачисленияДоходов.ФормаВыбора", ПараметрыВыбораСтатусаОперации, Элемент);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСтатусОперацииАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбораСтатусаОперации = Новый Структура("СтрокаПоиска", Текст);
	ПараметрыВыбораСтатусаОперации.Вставить("Организация", Объект.Организация);
	ПараметрыВыбораСтатусаОперации.Вставить("НаДату", Объект.Дата);
	
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.СтатусыОперацийНачисленияДоходов"), ПараметрыВыбораСтатусаОперации);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСтатусОперацииОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыбораСтатусаОперации = Новый Структура("СтрокаПоиска", Текст);
	ПараметрыВыбораСтатусаОперации.Вставить("Организация", Объект.Организация);
	ПараметрыВыбораСтатусаОперации.Вставить("НаДату", Объект.Дата);
	
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.СтатусыОперацийНачисленияДоходов"), ПараметрыВыбораСтатусаОперации);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СтатусОперацииПриИзмененииНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ДанныеСтроки = Объект.Начисления.НайтиПоИдентификатору(Элементы.Начисления.ТекущаяСтрока);
	
	ЭтоНачислениеДоходовБудущихПериодов = СтатусыНачислениеДоходовБудущихПериодов.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	ЭтоНачислениеДоходовТекущегоПериода = СтатусыНачислениеДоходовТекущегоПериода.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	ЭтоПризнаниеДоходовТекущегоПериода = СтатусыПризнаниеДоходовТекущегоПериода.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	ЭтоУточнениеДатыПризнанияДоходов = СтатусыУточнениеДатыПризнанияДоходов.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	ЭтоУточнениеПредельнойДатыИсполнения = СтатусыУточнениеПредельнойДатыИсполнения.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	ЭтоУточнениеДатИсполнения = СтатусыУточнениеДатИсполнения.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	
	Если ЭтоНачислениеДоходовБудущихПериодов Тогда
		ДанныеСтроки.СчетДоходов = БухгалтерскийУчет.СчетПоКоду("401.10", Объект.Дата, Объект.Организация);
		ДанныеСтроки.АвтоматическиОтразитьВГрафикахИсполненияДоговоров = ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров;
	Иначе
		ДанныеСтроки.СчетДоходов = "";
		Если ЭтоУточнениеДатыПризнанияДоходов
			ИЛИ ЭтоУточнениеПредельнойДатыИсполнения
			ИЛИ ЭтоУточнениеДатИсполнения
			ИЛИ ЭтоНачислениеДоходовТекущегоПериода
			ИЛИ ЭтоПризнаниеДоходовТекущегоПериода Тогда
			ДанныеСтроки.АвтоматическиОтразитьВГрафикахИсполненияДоговоров = ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров;
		Иначе
			ДанныеСтроки.АвтоматическиОтразитьВГрафикахИсполненияДоговоров = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров Тогда
		ЗаполнитьДокументПоГрафикамИсполнения(ДанныеСтроки);
	КонецЕсли;
	
	РеквизитыДоговоров = РеквизитыДоговоров(Объект.Начисления.Выгрузить(,"ДоговорКонтрагента").ВыгрузитьКолонку("ДоговорКонтрагента"));
	НачисленияЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ДанныеСтроки, РеквизитыДоговоров);
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СтатусОперацииДоИзменения", ДанныеСтроки.СтатусОперации);
	
КонецПроцедуры

&НаСервере
Процедура НачисленияЗаполнитьДобавленныеКолонки()
	
	РеквизитыДоговоров = РеквизитыДоговоров(Объект.Начисления.Выгрузить(,"ДоговорКонтрагента").ВыгрузитьКолонку("ДоговорКонтрагента"));
	
	Для Каждого СтрокаТаблицы Из Объект.Начисления Цикл
		
		НачисленияЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, СтрокаТаблицы, РеквизитыДоговоров);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НачисленияЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(Форма, СтрокаТаблицы, РеквизитыДоговоров = Неопределено)
	
	СтрокаТаблицы.ЗаголовокДоИзменения = НСтр("ru = 'до изм.:'");
	
	Если ТипЗнч(РеквизитыДоговоров) = Тип("Соответствие")
		И РеквизитыДоговоров[СтрокаТаблицы.ДоговорКонтрагента] <> Неопределено Тогда
		СтрокаТаблицы.ВестиГрафикПлатежей = РеквизитыДоговоров[СтрокаТаблицы.ДоговорКонтрагента].ВестиГрафикПлатежей;
		СтрокаТаблицы.ВестиПланГрафикИсполнения = РеквизитыДоговоров[СтрокаТаблицы.ДоговорКонтрагента].ВестиПланГрафикИсполнения;
	Иначе
		СтрокаТаблицы.ВестиГрафикПлатежей = Ложь;
		СтрокаТаблицы.ВестиПланГрафикИсполнения = Ложь;
	КонецЕсли;
	
	ЭтоНачислениеДоходовБудущихПериодов = Форма.СтатусыНачислениеДоходовБудущихПериодов.НайтиПоЗначению(СтрокаТаблицы.СтатусОперации) <> Неопределено;
	ЭтоНачислениеДоходовТекущегоПериода = Форма.СтатусыНачислениеДоходовТекущегоПериода.НайтиПоЗначению(СтрокаТаблицы.СтатусОперации) <> Неопределено;
	ЭтоПризнаниеДоходовТекущегоПериода = Форма.СтатусыПризнаниеДоходовТекущегоПериода.НайтиПоЗначению(СтрокаТаблицы.СтатусОперации) <> Неопределено;
	ЭтоУточнениеДатыПризнанияДоходов = Форма.СтатусыУточнениеДатыПризнанияДоходов.НайтиПоЗначению(СтрокаТаблицы.СтатусОперации) <> Неопределено;
	ЭтоУточнениеПредельнойДатыИсполнения = Форма.СтатусыУточнениеПредельнойДатыИсполнения.НайтиПоЗначению(СтрокаТаблицы.СтатусОперации) <> Неопределено;
	ЭтоУточнениеДатИсполнения = Форма.СтатусыУточнениеДатИсполнения.НайтиПоЗначению(СтрокаТаблицы.СтатусОперации) <> Неопределено;
	
	СтрокаТаблицы.ПоказатьПредупреждение = Ложь;
	СтрокаТаблицы.ТекстПредупреждения = "";
	Если ЭтоНачислениеДоходовБудущихПериодов Тогда
		
		Если НЕ Форма.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров Тогда
			СтрокаТаблицы.ПоказатьПредупреждение = Истина;
			СтрокаТаблицы.ТекстПредупреждения = НСтр("ru = 'Для автоматического признания доходов текущего периода по договору необходимо включить опцию ""Вести и контролировать исполнение графиков по договорам с контрагентами"" в настройках параметров учета (закладка ""Ведение учета"" в разделе ""Администрирование - Настройка параметров учета"").'");
		ИначеЕсли Не СтрокаТаблицы.ВестиПланГрафикИсполнения Тогда
			СтрокаТаблицы.ПоказатьПредупреждение = Истина;
			СтрокаТаблицы.ТекстПредупреждения = НСтр("ru = 'Для автоматического признания доходов текущего периода следует установить признак ""Вести графики исполнения - План-график реализации"" в карточке договора.'");
		КонецЕсли;
		
	КонецЕсли;
	
	СтрокаТаблицы.ДоступностьОтразитьВГрафикахИсполненияДоговоров =
		Форма.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров
		И Не Форма.Объект.Групповая
		И (ЭтоНачислениеДоходовБудущихПериодов
			ИЛИ ЭтоНачислениеДоходовТекущегоПериода
			ИЛИ ЭтоПризнаниеДоходовТекущегоПериода
			ИЛИ ЭтоУточнениеДатыПризнанияДоходов
			ИЛИ ЭтоУточнениеПредельнойДатыИсполнения
			ИЛИ ЭтоУточнениеДатИсполнения);
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		СтрокаТаблицы, СтрокаТаблицы.СчетДоходов, НачисленияПоляАналитикиСчетаДоходов());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НачисленияПоляАналитикиСчетаДоходов()

	// Пути к данным полей аналитики счета, выбираемого в таблице формы.
	Возврат Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
		"Объект.Начисления.СчетДоходов",
		"Объект.Начисления.СубконтоДоходов1",
		"Объект.Начисления.СубконтоДоходов2",
		"Объект.Начисления.СубконтоДоходов3");

КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
    РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ИспользоватьКонтрольИсполненияДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров"));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ИспользоватьДетализациюПоКОСГУ", ПолучитьФункциональнуюОпцию("ИспользоватьДетализациюПоКОСГУВГрафикахСПокупателями"));
	
	ВыборкаСтатусыОпераций = Справочники.СтатусыОперацийНачисленияДоходов.Выбрать();
	Пока ВыборкаСтатусыОпераций.Следующий() Цикл
		ПризнакиСтатусаОперации = УчетДоходовРасходов.КлассифицироватьСтатусОперацииНачисленияДоходов(ВыборкаСтатусыОпераций.Ссылка);
		Если ПризнакиСтатусаОперации.ЭтоНачислениеДоходовБудущихПериодов Тогда
			СтатусыНачислениеДоходовБудущихПериодов.Добавить(ВыборкаСтатусыОпераций.Ссылка);
		ИначеЕсли ПризнакиСтатусаОперации.ЭтоНачислениеДоходовТекущегоПериода Тогда
			СтатусыНачислениеДоходовТекущегоПериода.Добавить(ВыборкаСтатусыОпераций.Ссылка);
		ИначеЕсли ПризнакиСтатусаОперации.ЭтоПризнаниеДоходовТекущегоПериода Тогда
			СтатусыПризнаниеДоходовТекущегоПериода.Добавить(ВыборкаСтатусыОпераций.Ссылка);
		ИначеЕсли ПризнакиСтатусаОперации.ЭтоУточнениеДатыПризнанияДоходов Тогда
			СтатусыУточнениеДатыПризнанияДоходов.Добавить(ВыборкаСтатусыОпераций.Ссылка);
		ИначеЕсли ПризнакиСтатусаОперации.ЭтоУточнениеПредельнойДатыИсполнения Тогда
			СтатусыУточнениеПредельнойДатыИсполнения.Добавить(ВыборкаСтатусыОпераций.Ссылка);
		ИначеЕсли ПризнакиСтатусаОперации.ЭтоУточнениеДатИсполнения Тогда
			СтатусыУточнениеДатИсполнения.Добавить(ВыборкаСтатусыОпераций.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредупреждениеКонтрольИсполненияДоговоров", "Заголовок",
		КонтрольИсполненияДоговоров.ТекстПредупрежденияУчетЗадолженностиВРазрезеДатИсполнения());
	
	НачисленияЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияПоказатьПредупреждение");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Начисления.ПоказатьПредупреждение", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияАвтоматическиОтразитьВГрафикахИсполненияДоговоров");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Начисления.ДоступностьОтразитьВГрафикахИсполненияДоговоров", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	СтатусыОперацийУточнениеДатыПризнанияДоходов = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из СтатусыУточнениеДатыПризнанияДоходов Цикл
		СтатусыОперацийУточнениеДатыПризнанияДоходов.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	Для Каждого ЭлементСписка Из СтатусыУточнениеДатИсполнения Цикл
		СтатусыОперацийУточнениеДатыПризнанияДоходов.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияЗаголовокДатаПризнанияДоходовДоИзменения");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияДатаПризнанияДоходовДоИзменения");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Начисления.СтатусОперации", ВидСравненияКомпоновкиДанных.НеВСписке, СтатусыОперацийУточнениеДатыПризнанияДоходов);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	СтатусыОперацийУточнениеПредельнойДатыИсполнения = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из СтатусыУточнениеПредельнойДатыИсполнения Цикл
		СтатусыОперацийУточнениеПредельнойДатыИсполнения.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	Для Каждого ЭлементСписка Из СтатусыУточнениеДатИсполнения Цикл
		СтатусыОперацийУточнениеПредельнойДатыИсполнения.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияЗаголовокПредельнаяДатаИсполненияДоИзменения");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияПредельнаяДатаИсполненияДоИзменения");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Начисления.СтатусОперации", ВидСравненияКомпоновкиДанных.НеВСписке, СтатусыОперацийУточнениеПредельнойДатыИсполнения);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	
	Объект = Форма.Объект;
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ВидДокументаФизЛиц");
	МассивЭлементов.Добавить("НачисленияИдентификаторПлательщика");
	МассивЭлементов.Добавить("НачисленияДатаПризнанияДоходов");
	МассивЭлементов.Добавить("НачисленияДатаПризнанияДоходовДоИзменения");
	МассивЭлементов.Добавить("НачисленияЗаголовокДатаПризнанияДоходовДоИзменения");
	МассивЭлементов.Добавить("НачисленияВидПервичногоДокумента");
	МассивЭлементов.Добавить("НачисленияДатаПервичногоДокумента");
	МассивЭлементов.Добавить("НачисленияНомерПервичногоДокумента");
	МассивЭлементов.Добавить("НачисленияПредельнаяДатаИсполнения");
	МассивЭлементов.Добавить("НачисленияПредельнаяДатаИсполненияДоИзменения");
	МассивЭлементов.Добавить("НачисленияЗаголовокПредельнаяДатаИсполненияДоИзменения");
	МассивЭлементов.Добавить("НачисленияУникальныйИдентификаторНачисления");
	МассивЭлементов.Добавить("НачисленияАвтоматическиОтразитьВГрафикахИсполненияДоговоров");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, МассивЭлементов, "Видимость", НЕ Объект.Групповая);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "НачисленияКФО", "Видимость", Объект.Групповая);
	
	ПредупреждениеКонтрольИсполненияДоговоров = Новый Массив;
	ПредупреждениеКонтрольИсполненияДоговоров.Добавить("ПредупреждениеКонтрольИсполненияДоговоров");
	ПредупреждениеКонтрольИсполненияДоговоров.Добавить("ДекорацияПредупреждениеКонтрольИсполненияДоговоров");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ПредупреждениеКонтрольИсполненияДоговоров, "Видимость",
		НЕ Форма.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров И НЕ Объект.Групповая);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторКонтрагента(Контрагент, ВидДокументаФизЛиц)
	
	Возврат БухгалтерскийУчет.ИдентификаторКонтрагента(Контрагент, ВидДокументаФизЛиц);
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыДоговоров(Договоры)
	
	Если ТипЗнч(Договоры) = Тип("СправочникСсылка.Договоры") Тогда
		Ссылки = Новый Массив;
		Ссылки.Добавить(Договоры);
	Иначе
		Ссылки = Договоры;
	КонецЕсли;  
	
	РеквизитыДоговора = Новый Массив;
	РеквизитыДоговора.Добавить("Ссылка");
	РеквизитыДоговора.Добавить("ВидОбязательства");
	РеквизитыДоговора.Добавить("ДатаДоговора");
	РеквизитыДоговора.Добавить("НомерДоговора");  
	РеквизитыДоговора.Добавить("ВидДоговора");
	РеквизитыДоговора.Добавить("ВестиГрафикПлатежей");
	РеквизитыДоговора.Добавить("ВестиПланГрафикИсполнения");
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Ссылки, РеквизитыДоговора);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьХарактеристикиГосуслуги(Номенклатура, НаДату)

	Возврат Справочники.Номенклатура.ПолучитьХарактеристикиГосуслуги(Номенклатура, НаДату);

КонецФункции

&НаСервереБезКонтекста
Функция КлассифицироватьСтатусОперацииНачисленияДоходов(СтатусОперации)
	Возврат УчетДоходовРасходов.КлассифицироватьСтатусОперацииНачисленияДоходов(СтатусОперации);
КонецФункции

&НаСервере
Процедура ЗаполнитьДокументПоГрафикамИсполнения(ДанныеСтроки)
	
	Если Не ЗначениеЗаполнено(ДанныеСтроки.СтатусОперации) Тогда
		Возврат;
	КонецЕсли;
	
	ПризнакиСтатусаОперации = УчетДоходовРасходов.КлассифицироватьСтатусОперацииНачисленияДоходов(ДанныеСтроки.СтатусОперации);
	
	Отбор = Новый Структура;
	Отбор.Вставить("СчетРасчетов", БухгалтерскийУчет.СписокСчетов(
		ПризнакиСтатусаОперации.СтатусОперацииСчетРасчетов, Объект.Дата,, Объект.Организация));
	
	Если СтрНайти(ПризнакиСтатусаОперации.СтатусОперацииСчетРасчетов, "207.00") > 0 Тогда
		Отбор.Вставить("ВидРасчетов", Перечисления.ВидыРасчетовПоЗаймам.Проценты);
	Иначе
		Отбор.Вставить("ВидРасчетов", Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг);
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
		Отбор.Вставить("ИФО", Объект.ИФО);
	КонецЕсли;
	Отбор.Вставить("Контрагент", ДанныеСтроки.Контрагент);
	Отбор.Вставить("Договор", ДанныеСтроки.ДоговорКонтрагента);
	Отбор.Вставить("КФО", ?(Объект.Групповая, ДанныеСтроки.КФО, Перечисления.КВД.Бюджет));
	Отбор.Вставить("КПС", ДанныеСтроки.КПС);
	Если ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьДетализациюПоКОСГУ Тогда
		Отбор.Вставить("КЭК", ДанныеСтроки.КОСГУ);
	КонецЕсли;
	
	ЭтоУточнениеДатыПризнанияДоходов = СтатусыУточнениеДатыПризнанияДоходов.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	ЭтоУточнениеПредельнойДатыИсполнения = СтатусыУточнениеПредельнойДатыИсполнения.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	ЭтоУточнениеДатИсполнения = СтатусыУточнениеДатИсполнения.НайтиПоЗначению(ДанныеСтроки.СтатусОперации) <> Неопределено;
	
	Если ЭтоУточнениеДатыПризнанияДоходов
		И ДанныеСтроки.ВестиПланГрафикИсполнения Тогда
		
		ДоходыКПризнанию = КонтрольИсполненияДоговоров.НеисполненныеДоговораСПокупателями(Отбор, Объект.Организация);
		Если ДоходыКПризнанию.Количество() = 1 Тогда
			
			// Частный случай - одна строка доходов к признанию по договору, все доходы признаются на заданную дату ИсполнитьДо.
			ДоходКПризнанию = ДоходыКПризнанию[0];
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДоходКПризнанию, "КФО,КПС,Валюта");
			ДанныеСтроки.КОСГУ = ДоходКПризнанию.КЭК;
			ДанныеСтроки.ДатаПризнанияДоходовДоИзменения = ДоходКПризнанию.ИсполнитьДо;
			ДанныеСтроки.ДатаПризнанияДоходов = ДанныеСтроки.ДатаПризнанияДоходовДоИзменения;
			
			Если ДоходКПризнанию.Валюта = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета Тогда
				ДанныеСтроки.Сумма = ДоходКПризнанию.Сумма;
			Иначе
				ДанныеСтроки.СуммаВВалюте = ДоходКПризнанию.Сумма;
				КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеСтроки.Валюта, Объект.Дата);
				ДанныеСтроки.Сумма = ДанныеСтроки.СуммаВВалюте * КурсВалюты.Курс / ?(КурсВалюты.Кратность=0, 1, КурсВалюты.Кратность);
			КонецЕсли;
			
			Если ДанныеСтроки.ВестиГрафикПлатежей Тогда
				
				// Дополним структуру отбора, определяем предельную дату исполнения по данным графика платежей (справочно).
				Отбор.Вставить("Валюта", ДоходКПризнанию.Валюта);
				Отбор.Вставить("Сумма", ДоходКПризнанию.Сумма);
				НеисполненныеПлатежи = КонтрольИсполненияДоговоров.НеисполненныеПлатежиОтПокупателейДебиторов(Отбор, Объект.Организация);
				Если НеисполненныеПлатежи.Количество() > 0 Тогда
					НеисполненныйПлатеж = НеисполненныеПлатежи[0];
					ДанныеСтроки.ПредельнаяДатаИсполненияДоИзменения = НеисполненныйПлатеж.ОплатитьДо;
					ДанныеСтроки.ПредельнаяДатаИсполнения = ДанныеСтроки.ПредельнаяДатаИсполненияДоИзменения;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли (ЭтоУточнениеПредельнойДатыИсполнения ИЛИ ЭтоУточнениеДатИсполнения)
		И ДанныеСтроки.ВестиГрафикПлатежей Тогда
		
		// В случае уточнения обеих дат исполнения (дата признания доходов, предельная дата исполнения) заполняем по графику платежей,
		// поскольку для доходов текущего периода движения "план" и "факт" в план-график реализации выполняются одновременно.
		
		НеисполненныеПлатежи = КонтрольИсполненияДоговоров.НеисполненныеПлатежиОтПокупателейДебиторов(Отбор, Объект.Организация);
		Если НеисполненныеПлатежи.Количество() = 1 Тогда
			
			// Частный случай - один планируемый платеж по договору, вся задолженность оплачивается не позднее даты ОплатитьДо.
			НеисполненныйПлатеж = НеисполненныеПлатежи[0];
			ЗаполнитьЗначенияСвойств(ДанныеСтроки, НеисполненныйПлатеж, "КФО,КПС,Валюта");
			ДанныеСтроки.КОСГУ = НеисполненныйПлатеж.КЭК;
			ДанныеСтроки.ПредельнаяДатаИсполненияДоИзменения = НеисполненныйПлатеж.ОплатитьДо;
			ДанныеСтроки.ПредельнаяДатаИсполнения = ДанныеСтроки.ПредельнаяДатаИсполненияДоИзменения;
			
			Если НеисполненныйПлатеж.Валюта = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета Тогда
				ДанныеСтроки.Сумма = НеисполненныйПлатеж.Сумма;
			Иначе
				ДанныеСтроки.СуммаВВалюте = НеисполненныйПлатеж.Сумма;
				КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеСтроки.Валюта, Объект.Дата);
				ДанныеСтроки.Сумма = ДанныеСтроки.СуммаВВалюте * КурсВалюты.Курс / ?(КурсВалюты.Кратность=0, 1, КурсВалюты.Кратность);
			КонецЕсли;
			
			Если ДанныеСтроки.ВестиПланГрафикИсполнения Тогда
				
				// Дополним структуру отбора, определяем дату признания дохода по данным графика платежей (справочно).
				Отбор.Вставить("Валюта", НеисполненныйПлатеж.Валюта);
				Отбор.Вставить("Сумма", НеисполненныйПлатеж.Сумма);
				ДоходыКПризнанию = КонтрольИсполненияДоговоров.НеисполненныеДоговораСПокупателями(Отбор, Объект.Организация);
				Если ДоходыКПризнанию.Количество() > 0 Тогда
					ДоходКПризнанию = ДоходыКПризнанию[0];
					ДанныеСтроки.ДатаПризнанияДоходовДоИзменения = ДоходКПризнанию.ИсполнитьДо;
					ДанныеСтроки.ДатаПризнанияДоходов = ДанныеСтроки.ДатаПризнанияДоходовДоИзменения;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтрокиНаКлиенте(ДанныеСтроки)
	
	Если ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет Тогда 
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Валюта)
			ИЛИ ДанныеСтроки.Валюта = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета Тогда
			ДанныеСтроки.СуммаВВалюте = 0;
		ИначеЕсли ДанныеСтроки.СуммаВВалюте = 0 Тогда
			ДанныеСтроки.Сумма = 0;
		Иначе
			ДатаКурса = ?(ЗначениеЗаполнено(ДанныеСтроки.ДатаПризнанияДоходов), 
			            Мин(ДанныеСтроки.ДатаПризнанияДоходов, Объект.Дата), Объект.Дата);
			КурсКратность = ПолучитьКурс(ДанныеСтроки.Валюта, ДатаКурса);
			ДанныеСтроки.Сумма 	= ДанныеСтроки.СуммаВВалюте*КурсКратность.Курс/?(КурсКратность.Кратность=0, 1, КурсКратность.Кратность);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыСтрокНаСервере()
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из Объект.Начисления Цикл
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Валюта)
			ИЛИ ДанныеСтроки.Валюта = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета Тогда
			Если НЕ ДанныеСтроки.СуммаВВалюте = 0 Тогда
				ДанныеСтроки.СуммаВВалюте = 0;
				ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Истина;
			КонецЕсли;	
		ИначеЕсли ДанныеСтроки.СуммаВВалюте = 0 И НЕ ДанныеСтроки.Сумма = 0 Тогда
			ДанныеСтроки.Сумма = 0;
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Истина;
		Иначе
			ДатаКурса = ?(ЗначениеЗаполнено(ДанныеСтроки.ДатаПризнанияДоходов), 
			             Мин(ДанныеСтроки.ДатаПризнанияДоходов, Объект.Дата), Объект.Дата);
			КурсКратность = ПолучитьКурс(ДанныеСтроки.Валюта, ДатаКурса);
			НоваяСумма = ДанныеСтроки.СуммаВВалюте*КурсКратность.Курс/?(КурсКратность.Кратность=0, 1, КурсКратность.Кратность);
			Если НЕ ДанныеСтроки.Сумма = НоваяСумма Тогда
				ДанныеСтроки.Сумма = НоваяСумма;
				ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Истина;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурс(Знач ВалютаДокумента, Дата)
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаличиеУточняемыхДоходов(СтатусОперации, Контрагент, ДоговорКонтрагента, КОСГУ, КПС, КФО, Дата, Организация)
	
	Возврат Документы.ВедомостьНачисленияДоходов.ПроверитьНаличиеУточняемыхДоходов(СтатусОперации, Контрагент, ДоговорКонтрагента, КОСГУ, КПС, КФО, Дата, Организация);
		
КонецФункции	

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемыРаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ОтобразитьРезультатПроверкиКонтрагента() Экспорт
	ПроверкаКонтрагентов.ОтобразитьРезультатПроверкиКонтрагентаВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ПроверитьКонтрагентовФоновоеЗадание(ПараметрыФоновогоЗадания) Экспорт	
	ПроверкаКонтрагентов.ПроверитьКонтрагентовВДокументеФоновоеЗадание(ЭтотОбъект, ПараметрыФоновогоЗадания);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
