#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьЭлементы() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		
		Данные = ПолучитьМакет("РазделыПодразделыКРБ").ПолучитьТекст();
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Данные);
		
		ЗагрузкаБюджетнойКлассификации = Обработки.ЗагрузкаБюджетнойКлассификации.Создать();
		
		ЗагрузкаБюджетнойКлассификации.ЗагрузитьРазделыПодразделыКРБ(ЧтениеXML);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Справочники.РазделыПодразделыКРБ.СтандартныеРеквизиты.Код.Имя);
	Результат.Добавить(Метаданные.Справочники.РазделыПодразделыКРБ.Реквизиты.НаименованиеПолное.Имя);
	
	БюджетнаяКлассификацияПереопределяемый.ПолучитьБлокируемыеРеквизитыОбъекта(Результат);
	
	Возврат Результат;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьЭлементы");
КонецПроцедуры

#КонецОбласти

#КонецЕсли