&НаКлиенте
Перем ВыборОСОбработан;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УправлениеНФА.ПроверитьУчетИмуществаКазны();

	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект, "ВыбратьКомиссию,СоставКомиссииПодобратьКомиссию,ВыбратьПредседателя,ОсновныеСредстваРассчитать");

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ,
													 СтандартнаяОбработка, 
													 Элементы.БухгалтерскаяОперация, 
													 Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	БухгалтерскийУчетКлиентСервер.УстановитьТипРеквизитовШапкиПоПлануСчетов("Документы", Объект.Ссылка.Метаданные().Имя, Объект);
	ОбщегоНазначенияБГУКлиентСервер.УстановитьЗаголовкиСубконто(ЭтаФорма, Объект, Новый Структура("СчетОбъекта, Субконто1, Субконто2, Субконто3, Подразделение",
																									"СчетУчетаЗатрат",
																									"СубконтоЗатрат1",
																									"СубконтоЗатрат2",
																									"СубконтоЗатрат3",
																									"ПодразделениеЗатрат"));
	// если документ скопирован или введен на основании, то чтения на сервере не было
	Если Параметры.Ключ.Пустая() И Объект.ОсновныеСредства.Количество()>0 Тогда
		УстановитьГрупповойУчет();
	КонецЕсли;
	
	Элементы.Подразделение.АвтоОтметкаНезаполненного = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
														И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("108.00").УчетПоПодразделениям;
		
														Если Параметры.Ключ.Пустая() Тогда
															
		УстановитьЗаголовокКомандыЗаполнитьДанныеОбОС(ЭтаФорма);
		
		ДоступностьЭлементовПоОперации(ЭтаФорма, Объект);
		УстановитьДоступностьСвязанныхРеквизитовОрганизации();
		УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(ЭтаФорма, Объект);
		УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);
		
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов																					
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеОсновнымиСредствамиКлиент.ПриОткрытииДокумента173н(ЭтотОбъект, "ПринятиеКУчетуОбъектовИК");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма,
												   ТекущийОбъект, 
												   Элементы.БухгалтерскаяОперация, 
												   Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	УстановитьГрупповойУчет();
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ЗаполнитьЗначенияРевизитовИзОС(ЭтаФорма, Объект.ОсновныеСредства[0].ПолучитьИдентификатор(), Истина);
	КонецЕсли;
	УстановитьЗаголовокКомандыЗаполнитьДанныеОбОС(ЭтаФорма);
	
	ДоступностьЭлементовПоОперации(ЭтаФорма, Объект);
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(ЭтаФорма, Объект);
	УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
    Оповестить("ДокументыПоУчетуИКИзменение");
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если Лев(ИсточникВыбора.ИмяФормы,40) = "Справочник.ПостоянноДействующиеКомиссии." Тогда
		УправлениеОсновнымиСредствамиКлиент.УстановитьКомиссиюВДокументОС(ВыбранноеЗначение, Объект, ЭтаФорма);
	ИначеЕсли Лев(ИсточникВыбора.ИмяФормы,22) = "Справочник.Сотрудники." Тогда
		УправлениеОсновнымиСредствамиКлиент.ОбработатьВыборПредседателяКомиссии(ЭтаФорма,
																				ВыбранноеЗначение, 
																				, 
																				Объект.ДолжностьПредседателяКомиссии,
																				Объект.ФамилияПредседателяКомиссии,
																				Объект.ИмяПредседателяКомиссии,
																				Объект.ОтчествоПредседателяКомиссии);
	ИначеЕсли СтрНачинаетсяС(ИсточникВыбора.ИмяФормы, "Обработка.ПодборОсновныхСредств") Тогда
		ОбработкаВыбораПодбораОССервер(ВыбранноеЗначение);
		Если ЭтотОбъект.КэшПараметров.УчетнаяПолитика.НачислятьАмортизациюИмуществаКазны Тогда
			Если Объект.ОсновныеСредства.Количество()>0 Тогда
				ТекущиеДанные = Объект.ОсновныеСредства[0];	
				УстановитьПорядокПогашенияСтоимости();
				ПолучитьПараметрыНачисленияАмортизации(ТекущиеДанные.ОсновноеСредство);	
			КонецЕсли;
		ИначеЕсли Не ЗначениеЗаполнено(Объект.ПорядокПогашенияСтоимости) Тогда
			Объект.ПорядокПогашенияСтоимости 	= ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается");
			Объект.СпособНачисленияАмортизации	= ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.ПустаяСсылка");
			Объект.СчетУчетаЗатрат 				= ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбработатьДанныеОС = Ложь;
	
	Если ИмяСобытия = "ЗаполнениеДанныхОС" И ТипЗнч(Параметр) = Тип("Структура") Тогда
		
		Если Объект.ОсновныеСредства.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		ОсновноеСредство = Неопределено;
		Параметр.Свойство("Ссылка", ОсновноеСредство);
		Если ОсновноеСредство = Объект.ОсновныеСредства[0].ОсновноеСредство Тогда
			ОбработатьДанныеОС = Истина;
			ЗначенияРеквизитов = Новый Структура("СчетУчета,КодПоОКОФ,АмортизационнаяГруппа");
			ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Параметр);					
		КонецЕсли;	
		
	ИначеЕсли ИмяСобытия = "Запись_ОсновныеСредства" И Источник = Объект.ОсновныеСредства[0].ОсновноеСредство Тогда
		
		ОбработатьДанныеОС = Истина;
		ЗначенияРеквизитов = ЗначенияРеквизитовОС2(Объект.ОсновныеСредства[0].ОсновноеСредство, Объект.Дата);
		
	КонецЕсли;
	
	Если ОбработатьДанныеОС Тогда
		
		ОС_Модифицированность = Ложь;
		
		Если ЗначенияРеквизитов.КодПоОКОФ <> ОС_КодОКОФ Тогда
			ОС_КодОКОФ = ЗначенияРеквизитов.КодПоОКОФ;
			ОС_Модифицированность = Истина;
		КонецЕсли;
		Если ЗначенияРеквизитов.АмортизационнаяГруппа <> ОС_АмортизационнаяГруппа Тогда
			ОС_АмортизационнаяГруппа = ЗначенияРеквизитов.АмортизационнаяГруппа;
			ОС_Модифицированность = Истина;
		КонецЕсли;
		Если ЗначенияРеквизитов.СчетУчета <> ОС_СчетУчета Тогда
			ОС_СчетУчета = ЗначенияРеквизитов.СчетУчета;
			ОС_Модифицированность = Истина;
		КонецЕсли;
		Если ОС_Модифицированность Тогда
			УстановитьЗаголовокКомандыЗаполнитьДанныеОбОС(ЭтаФорма);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части

	УстановитьГрупповойУчет();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВидПоступленияПриИзменении(Элемент)
	ДоступностьЭлементовПоОперации(ЭтаФорма, Объект);
	УстановитьПараметрыАмортизации();
	УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокПолезногоИспользованияПриИзменении(Элемент)
	РассчитатьОставшийсяСрокПолезногоИспользования();
КонецПроцедуры

&НаКлиенте
Процедура ПорядокПогашенияСтоимостиПриИзменении(Элемент)
	ПараметрыВыбораЗначения = УправлениеОсновнымиСредствамиКлиент.ПараметрыВыбораПараметровНачисленияАмортизации();
	УправлениеОсновнымиСредствамиКлиент.ПорядокПогашенияСтоимостиПриИзменении(	
					Объект.СпособНачисленияАмортизации,
					Объект.НачислятьАмортизацию,
					ПараметрыВыбораЗначения);
	
	УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);			
КонецПроцедуры

&НаКлиенте
Процедура СпособНачисленияАмортизацииПриИзменении(Элемент)
	УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);			
КонецПроцедуры

&НаКлиенте
Процедура СпособНачисленияАмортизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбораЗначения = ПараметрыВыбораПараметровНачисленияАмортизации();
	УправлениеОсновнымиСредствамиКлиент.СпособНачисленияАмортизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ПараметрыВыбораЗначения); 
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗатратПриИзменении(Элемент)
	УправлениеОсновнымиСредствамиКлиент.СчетУчетаЗатратПриИзменении(Элемент, Объект.СчетУчетаЗатрат, Объект.КЭКЗатрат);
	ОбщегоНазначенияБГУКлиентСервер.УстановитьЗаголовкиСубконто(ЭтаФорма, Объект, Новый Структура("СчетОбъекта, Субконто1, Субконто2, Субконто3,
																									|Подразделение,
																									|ОчищатьОтстуствующие,
																									|СубконтоОбъекта1, СубконтоОбъекта2, СубконтоОбъекта3",
																									"СчетУчетаЗатрат",
																									"СубконтоЗатрат1",
																									"СубконтоЗатрат2",
																									"СубконтоЗатрат3",
																									"ПодразделениеЗатрат",
																									,
																									"СубконтоЗатрат1",
																									"СубконтоЗатрат2",
																									"СубконтоЗатрат3"));
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаЗатратОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															Объект.КПСЗатрат,
															,
															,);
КонецПроцедуры

&НаКлиенте
Процедура КЭКЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.СчетУчетаЗатрат) Тогда
		ТекстСообщения = НСтр("ru='Не заполнен счет затрат'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.СчетУчетаЗатрат");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	ДанныеВыбора = Новый СписокЗначений;
	Если Лев(Строка(Объект.СчетУчетаЗатрат), 3) = "106" Тогда
		ДанныеВыбора.Добавить(БухгалтерскийУчетВызовСервераПовтИсп.КЭКПоКоду("340"));
	Иначе		
		ДанныеВыбора.Добавить(БухгалтерскийУчетВызовСервераПовтИсп.КЭКПоКоду("271"));
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КПСЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													Объект.КПСЗатрат, 
													Объект.Организация,
													Объект.ИФО,
													ПредопределенноеЗначение("Перечисление.КВД.Бюджет"),
													Объект.СчетУчетаЗатрат,
													Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура КПСЗатратОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.КПСЗатрат.РежимВыбораИзСписка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат1ПриИзменении(Элемент)
	ОбработатьИзменениеСубконто(Элемент, 1);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 1);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат2ПриИзменении(Элемент)
	ОбработатьИзменениеСубконто(Элемент, 2);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 2);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат3ПриИзменении(Элемент)
	ОбработатьИзменениеСубконто(Элемент, 3);
КонецПроцедуры

&НаКлиенте
Процедура СубконтоЗатрат3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, 3);
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент); 
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПриложениеЗавершениеВвода", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(
		Оповещение, Элемент.ТекстРедактирования, НСтр("ru='Приложение'"));
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

/////////////////////////////////////////////////////////////////////////////////////////
//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //
/////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваПослеУдаления(Элемент)
	УстановитьЗаголовокКомандыЗаполнитьДанныеОбОС(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""Организация"" не заполнено'"),,"Объект.Организация",,Отказ);
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ВидПоступления) Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Поле ""Вид поступления"" не заполнено'"),,"Объект.ВидПоступления",,Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если НоваяСтрока Тогда
		Если Копирование Тогда
			ТекущиеДанные.ИнвентарныйНомер = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОсновныеСредстваПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	ПриИзмененииОсновногоСредства(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборОСОбработан = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ВыбранноеЗначение.Свойство("КодПоОКОФ", 			ОС_КодОКОФ);
		ВыбранноеЗначение.Свойство("СчетУчета", 			ОС_СчетУчета);
		ВыбранноеЗначение.Свойство("АмортизационнаяГруппа",	ОС_АмортизационнаяГруппа);
	КонецЕсли;
	
	СоответствиеРеквизитов = Новый Соответствие;
	СоответствиеРеквизитов.Вставить("ГрупповойУчет", 			"ГрупповойУчет");
	СоответствиеРеквизитов.Вставить("ИнвентарныйНомер", 		"ИнвентарныйНомер");
	СоответствиеРеквизитов.Вставить("ПервоначальнаяСтоимость",	"Сумма");
	
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбораОсновногоСредства(ВыбранноеЗначение, ТекущиеДанные, СоответствиеРеквизитов, ВыборОСОбработан);
	Если ТекущиеДанные.Сумма <> 0 И ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Поступление") Тогда
		ТекДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
		ПараметрыФормы = Новый Структура("Отбор, НаДату, ТекущаяСтрока",
											Новый Структура("Владелец, ОС",
															Объект.Организация,
															ТекДанные.ОсновноеСредство),
											?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата),													
											ТекДанные.ИнвентарныйНомер);
		//Параметры для формирования Инвентарных номеров
		ПараметрыФормы.Вставить("Дата",								Объект.Дата);
		ПараметрыФормы.Вставить("КФО",								ПредопределенноеЗначение("Перечисление.КВД.Бюджет"));
		ПараметрыФормы.Вставить("СчетУчета",						ТекДанные.СчетУчета);
		ПараметрыФормы.Вставить("Организация",						Объект.Организация);
		ПараметрыФормы.Вставить("ОсновноеСредство",					ТекДанные.ОсновноеСредство);
		ПараметрыФормы.Вставить("ИнвентарныйНомер",					ТекДанные.ИнвентарныйНомер);
		ПараметрыФормы.Вставить("ФормированиеИзДокумента",			Истина);
		ПараметрыФормы.Вставить("Регистратор",						Объект.Ссылка);
	    ПараметрыФормы.Вставить("ФормированиеИнвНомераБезОбработки",Ложь);
		ПараметрыФормы.Вставить("ПроверитьСоздатьИнвентарныйНомер",	Истина);
		ПараметрыФормы.Вставить("ПеренестиВсеНомера",				Истина);
		ПараметрыФормы.Вставить("ТЧОсновныеСредства",				Объект.ОсновныеСредства);
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ПометкаУдаления, Владелец, ОС", Ложь, Объект.Организация, ТекДанные.ОсновноеСредство));
		
		ДопустимыеВидыКПС = Новый СписокЗначений;
		ДопустимыеВидыКПС.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.гКБК"));
	
		ПараметрыФормы.Вставить("ДопустимыеВидыКПС",ДопустимыеВидыКПС);
		ОткрытьФорму("Справочник.ИнвентарныеНомераОС.ФормаВыбора", ПараметрыФормы, Элемент);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		СтандартнаяОбработка = Ложь;
		ТекДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
		ЭтоПервый = Истина;
		Для Каждого СтрокаСписка Из ВыбранноеЗначение Цикл
			Если ЭтоПервый Тогда
				ЭтоПервый = Ложь;
				ТекДанные.ИнвентарныйНомер 	= СтрокаСписка.Значение;	
				ТекДанные.Количество		= 1;
			Иначе
				НоваяСтрока = Объект.ОсновныеСредства.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекДанные);
				НоваяСтрока.ИнвентарныйНомер 	= СтрокаСписка.Значение;
				НоваяСтрока.Количество			= 1;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ИнвентарныйНомер) И ТекущиеДанные.Количество<>1 Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ИнвентарныйНомер) Тогда
		ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваДатаВводаВЭксплуатациюПриИзменении(Элемент)
	РассчитатьОставшийсяСрокПолезногоИспользования();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ СОСТАВ КОМИССИИ

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработатьПодборКомиссии(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация));
		ОткрытьФорму("Справочник.ПостоянноДействующиеКомиссии.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Сначала необходимо выбрать организацию'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателя(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма, Объект.Организация, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект.Организация, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если ОбщегоНазначенияБГУКлиентСервер.ПроверитьЗаполнениеРеквизитов(СформироватьСтруктуруПроверяемыхРеквизитов(Объект.ВидПоступления, УчитываетсяПодразделение(Объект.ВидПоступления)),Объект,Истина) Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСуммуВозврата();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеОбОСНажатие(Элемент, СтандартнаяОбработка)
	Если Объект.ОсновныеСредства.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Объект.ОсновныеСредства[0];
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ОсновноеСредство) Тогда
		СписокСпособов = Новый СписокЗначений;
		СписокСпособов.Добавить(ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации"
															+ ".ПриВводеВЭксплуатацию"));
		ПараметрыФормы = Новый Структура("Ключ, СпособыНачисленияАмортизации",
										ТекущиеДанные.ОсновноеСредство,
										СписокСпособов);
		ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаЭлемента", ПараметрыФормы);
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПриложениеЗавершениеВвода(Знач ВведенныйТекст, Знач ДополнительныеПараметры) Экспорт
	
	Если ВведенныйТекст = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Приложение = ВведенныйТекст;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	//ПараметрыПодбора.Отбор.Вставить("ВидНФА", ПредопределенноеЗначение("Перечисление.ВидыНФА.Казна"));
	ПараметрыПодбора.Вставить("Казна", Истина);
	ПараметрыПодбора.Вставить("ТребуемыеДанные","ГрупповойУчет,ПервоначальнаяСтоимость");
	
	ПараметрыПодбора.Вставить("ЕстьИнвентарныйНомер", ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны);
	
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Поступление") Тогда
		НастройкиПодбора = Новый НастройкиКомпоновкиДанных;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиПодбора.Отбор, "Состояние",,ВидСравненияКомпоновкиДанных.НеЗаполнено,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		ПараметрыПодбора.Вставить("ДополнительныйОтбор", НастройкиПодбора.Отбор);
	Иначе
		Если ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны Тогда
			СостоянияОС = Новый СписокЗначений;
			СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ВведеноВЭксплуатацию"));
			СостоянияОС.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияОС.ПринятоКУчету"));
			ПараметрыПодбора.Отбор.Вставить("Состояние",СостоянияОС);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидПоступления", НСтр("ru='Вид поступления'"));
	СтруктураРеквизитов.Вставить("Организация");
	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратАренда")
		ИЛИ Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратБезвозмездноеПользование") Тогда
		СтруктураРеквизитов.Вставить("Контрагент", "Поставщик");
		Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
			СтруктураРеквизитов.Вставить("ИФО");
		КонецЕсли;
		Если УчитываетсяПодразделение(Объект.ВидПоступления) Тогда
			СтруктураРеквизитов.Вставить("Подразделение");
		КонецЕсли;
	КонецЕсли;
	
    Возврат СтруктураРеквизитов;
КонецФункции

&НаСервере
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации()

	ДоступностьЭлементов = ЗначениеЗаполнено(Объект.Организация);
	
	Элементы.Подразделение.Доступность						= ДоступностьЭлементов;
	Элементы.РеквизитыЛицевогоСчета.Доступность				= ДоступностьЭлементов;

	Элементы.СоставКомиссииПодобратьСотрудников.Доступность	= ДоступностьЭлементов И ТолькоПросмотр <> Истина;
	Элементы.ВыбратьКомиссию.Доступность					= ДоступностьЭлементов И ТолькоПросмотр <> Истина;
	Элементы.ВыбратьПредседателя.Доступность				= ДоступностьЭлементов И ТолькоПросмотр <> Истина;

КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОсновногоСредства(Форма, Объект)

	Элементы = Форма.Элементы;
	
	ЭтоПоступление = Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Поступление");
	ДоступностьЭлементов = ЗначениеЗаполнено(Объект.Организация);
	ВедениеАналитическогоУчета = Форма.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны;
	Элементы.ПорядокПогашенияСтоимости.Доступность				= ЭтоПоступление;
	Элементы.ЗаполнитьДанныеОбОС.Доступность					= ДоступностьЭлементов;
	Элементы.СрокПолезногоИспользования.Доступность 			= ДоступностьЭлементов И ЭтоПоступление И ВедениеАналитическогоУчета;
	Элементы.ПорядокПогашенияСтоимости.Доступность 				= ДоступностьЭлементов И ЭтоПоступление И ВедениеАналитическогоУчета;
	
КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПараметровАмортизации(Форма, Объект)

	Элементы = Форма.Элементы;
	
	Если Объект.ОсновныеСредства.Количество()>0 Тогда
		
		УправлениеОсновнымиСредствамиКлиентСервер.ИзменитьДоступностьВариантыВыбораПараметровАмортизации(	Объект.ПорядокПогашенияСтоимости,
																									Элементы.СпособНачисленияАмортизации,
																									ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию"));
		Элементы.НачислятьАмортизацию.Доступность = Объект.СпособНачисленияАмортизации = ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.Линейный");
		
		ДоступностьЭлементовГруппыСчетаЗатрат = Объект.ПорядокПогашенияСтоимости <> ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается")
												И ЗначениеЗаполнено(Объект.ПорядокПогашенияСтоимости);
		УстановитьДоступностьЭлементовГруппыСчетаЗатрат(Форма, ДоступностьЭлементовГруппыСчетаЗатрат);
	Иначе
		Элементы.СпособНачисленияАмортизации.Доступность	= Ложь;
		Элементы.НачислятьАмортизацию.Доступность			= Ложь;
		УстановитьДоступностьЭлементовГруппыСчетаЗатрат(Форма, Ложь);		
	КонецЕсли;

КонецПроцедуры // УстановитьДоступностьПараметровАмортизации()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовГруппыСчетаЗатрат(Форма, ДоступностьЭлементов = Истина)

	Элементы = Форма.Элементы;
	
	Элементы.СчетУчетаЗатрат.Доступность	= ДоступностьЭлементов;	
	Элементы.КЭКЗатрат.Доступность 			= ДоступностьЭлементов;	
	Элементы.КПСЗатрат.Доступность 			= ДоступностьЭлементов;	

КонецПроцедуры // УстановитьДоступностьЭлементовГруппыСчетаЗатрат()
 
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокКомандыЗаполнитьДанныеОбОС(Форма)

	Если Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Поступление")
		И Форма.Объект.ОсновныеСредства.Количество() > 0
		И ЗначениеЗаполнено(Форма.Объект.ОсновныеСредства[0].ОсновноеСредство) Тогда
		
		СтруктураРеквизитовОС = Новый Структура("КодПоОКОФ, АмортизационнаяГруппа",
												Форма.ОС_КодОКОФ,
												Форма.ОС_АмортизационнаяГруппа);
		
		Форма.ЗаполнитьДанныеОбОС = УправлениеОсновнымиСредствамиКлиентСервер.ПредставлениеСтрокиЗаполнитьДанныеОбОС(
			СтруктураРеквизитовОС, Форма.Объект.Дата);
		
	Иначе
		Форма.ЗаполнитьДанныеОбОС = "";
	КонецЕсли;

КонецПроцедуры // УстановитьЗаголовокКомандыЗаполнитьДанныеОбОС()

&НаКлиенте
Процедура РассчитатьОставшийсяСрокПолезногоИспользования()
	
	Если Объект.СрокПолезногоИспользования=0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.ОставшийсяСрокПолезногоИспользования = 0;
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаВводаВЭксплуатацию) Тогда
		ДатаОкончанияЭксплуатации = КонецМесяца(ДобавитьМесяц(ТекущиеДанные.ДатаВводаВЭксплуатацию, Объект.СрокПолезногоИспользования));
		ВрДата = НачалоМесяца(ДобавитьМесяц(Объект.Дата,1));
		Пока КонецМесяца(ВрДата) <= ДатаОкончанияЭксплуатации Цикл
			ТекущиеДанные.ОставшийсяСрокПолезногоИспользования = ТекущиеДанные.ОставшийсяСрокПолезногоИспользования + 1;
			ВрДата = ДобавитьМесяц(ВрДата, 1);
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры // РассчитатьОставшийсяСрокПолезногоИспользования()

&НаКлиенте
Процедура ОбработатьНачалоВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, ТекНомерСубконто)

	СтрокаДанных = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
									Объект.СчетУчетаЗатрат,
									Объект.СубконтоЗатрат1,
									Объект.СубконтоЗатрат2,
									Объект.СубконтоЗатрат3);
	
	
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбораСпр(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													СтрокаДанных, ТекНомерСубконто);
	
КонецПроцедуры // ОбработатьВыборСубконто()

&НаКлиенте
Процедура ОбработатьИзменениеСубконто(Элемент, НомерСубконто)
	
	СтрокаДанных = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
									Объект.СчетУчетаЗатрат,
									Объект.СубконтоЗатрат1,
									Объект.СубконтоЗатрат2,
									Объект.СубконтоЗатрат3);

	БухгалтерскиеОперацииКлиент.СубконтоПриИзмененииСпр(Элемент, СтрокаДанных, НомерСубконто);
	
	Для Счетчик = НомерСубконто По 3 Цикл
		Если Объект["СубконтоЗатрат"+Счетчик] <> СтрокаДанных["Субконто"+Счетчик] Тогда
			Объект["СубконтоЗатрат"+Счетчик] = СтрокаДанных["Субконто"+Счетчик];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ОбработатьИзменениеСубконто()

&НаСервере
Процедура УстановитьГрупповойУчет()

	МассивСсылок = Объект.ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство");
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(МассивСсылок, "ГрупповойУчет");
	Для каждого ТекущиеДанные Из Объект.ОсновныеСредства Цикл
		
		ТекОС = ЗначенияРеквизитов[ТекущиеДанные.ОсновноеСредство];
		Если ТекОС <> Неопределено Тогда
			ТекущиеДанные.ГрупповойУчет = ТекОС.ГрупповойУчет;
		КонецЕсли;
	
	КонецЦикла; 	

КонецПроцедуры // УстановитьГрупповойУчет()

&НаКлиенте
Процедура ПриИзмененииОсновногоСредства(ПолучатьИнвентарныйНомер)
	
	ЭтоПоступление = Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Поступление");
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ВыборОСОбработан Тогда
		ЗаполнитьЗначенияРевизитовИзОС(ЭтаФорма, ТекущиеДанные.ПолучитьИдентификатор());
	КонецЕсли;
	Если ПолучатьИнвентарныйНомер И ЭтотОбъект.КэшПараметров.УчетнаяПолитика.ВедениеАналитическогоУчетаИмуществаКазны Тогда
		УстановитьИнвентарныйНомер(ТекущиеДанные.ОсновноеСредство, ТекущиеДанные.ИнвентарныйНомер, Объект.Дата);
	КонецЕсли;
	
	УстановитьЗаголовокКомандыЗаполнитьДанныеОбОС(ЭтаФорма);
	Если ЭтоПоступление Тогда
		УстановитьСрокПолезногоИспользования();
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПараметров.УчетнаяПолитика.НачислятьАмортизациюИмуществаКазны Тогда
		УстановитьПорядокПогашенияСтоимости();
		ПолучитьПараметрыНачисленияАмортизации(ТекущиеДанные.ОсновноеСредство);																								
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ПорядокПогашенияСтоимости) Тогда
		Объект.ПорядокПогашенияСтоимости 	= ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается");
		Объект.СпособНачисленияАмортизации	= ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.ПустаяСсылка");
		Объект.СчетУчетаЗатрат 				= ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка");
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьЗаголовкиСубконто(ЭтаФорма, Объект, Новый Структура("СчетОбъекта, Субконто1, Субконто2, Субконто3,
																									|Подразделение,
																									|ОчищатьОтстуствующие,
																									|ИспользоватьУчетПоПодразделениям,
																									|СубконтоОбъекта1, СубконтоОбъекта2, СубконтоОбъекта3",
																									"СчетУчетаЗатрат",
																									"СубконтоЗатрат1",
																									"СубконтоЗатрат2",
																									"СубконтоЗатрат3",
																									"ПодразделениеЗатрат",
																									,
																									ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям"),
																									"СубконтоЗатрат1",
																									"СубконтоЗатрат2",
																									"СубконтоЗатрат3"));
	
	УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);			

КонецПроцедуры // ПриИзмененииОсновногоСредства()

&НаСервере
Процедура УстановитьИнвентарныйНомер(ОсновноеСредство, ИнвентарныйНомер, Дата)
    
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ПериодЗапроса = Параметры.Ключ.МоментВремени();
	Иначе
		ПериодЗапроса = КонецДня(Дата);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнвентарныеНомераОС.Ссылка КАК ИнвентарныйНомер,
	               |	ЕСТЬNULL(МестонахождениеОССрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)) КАК Состояние
	               |ИЗ
	               |	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МестонахождениеОС.СрезПоследних(
	               |				&Период,
	               |				ОсновноеСредство = &ОсновноеСредство
	               |					И Регистратор <> &Ссылка) КАК МестонахождениеОССрезПоследних
	               |		ПО ИнвентарныеНомераОС.Ссылка = МестонахождениеОССрезПоследних.ИнвНомер
	               |ГДЕ
	               |	ЕСТЬNULL(МестонахождениеОССрезПоследних.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	               |	И ИнвентарныеНомераОС.ОС = &ОсновноеСредство
	               |	И НЕ ИнвентарныеНомераОС.ПометкаУдаления";
	Запрос.УстановитьПараметр("ОсновноеСредство", 	ОсновноеСредство);
	Запрос.УстановитьПараметр("Период",				ПериодЗапроса);
	Запрос.УстановитьПараметр("Ссылка",				Параметры.Ключ);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ИнвентарныйНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	Иначе
		ТаблицаИнвНомеров = Результат.Выгрузить();
		//ИнвентарныйНомер = ТаблицаИнвНомеров[0].ИнвентарныйНомер;
		СтрокаИнвНомера = Неопределено;
		Если ЗначениеЗаполнено(ИнвентарныйНомер) Тогда
			СтрокаИнвНомера = ТаблицаИнвНомеров.Найти(ИнвентарныйНомер, "ИнвентарныйНомер");
		КонецЕсли;
		Если СтрокаИнвНомера = Неопределено Тогда
			МассивВыбранныхИнвНомеров = Объект.ОсновныеСредства.Выгрузить(,"ИнвентарныйНомер");
			Для каждого ТекСтрокаИнвНомера Из ТаблицаИнвНомеров Цикл
			
				Если МассивВыбранныхИнвНомеров.Найти(ТекСтрокаИнвНомера.ИнвентарныйНомер) = Неопределено Тогда
					ИнвентарныйНомер = ТекСтрокаИнвНомера.ИнвентарныйНомер;
					Возврат;
				КонецЕсли;
			
			КонецЦикла; 
		Иначе
			ИнвентарныйНомер = СтрокаИнвНомера.ИнвентарныйНомер;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ИнвентарныйНомер = Неопределено;

КонецПроцедуры // УстановитьИнвентарныйНомер()

&НаКлиенте
Процедура УстановитьСрокПолезногоИспользования()

	СрокПолезногоИспользования = УправлениеОсновнымиСредствамиКлиентСервер.РасчетСрокаПолезногоИспользования(ОС_АмортизационнаяГруппа);
	Если Объект.СрокПолезногоИспользования = 0 ИЛИ СрокПолезногоИспользования <> 0 Тогда
		Объект.СрокПолезногоИспользования = СрокПолезногоИспользования;	
	КонецЕсли;

КонецПроцедуры // УстановитьСрокПолезногоИспользования()

&НаСервере
Процедура ПолучитьПараметрыНачисленияАмортизации(ОсновноеСредство)

	Если (Объект.ПорядокПогашенияСтоимости = Перечисления.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации 
		ИЛИ Объект.ПорядокПогашенияСтоимости = Перечисления.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
		И НЕ ЗначениеЗаполнено(Объект.СчетУчетаЗатрат) Тогда
		
		СведенияОбОС = УправлениеОсновнымиСредствами.ПолучитьСведенияОбОС(Объект.Дата, ОсновноеСредство, "СчетУчетаЗатрат, ПодразделениеЗатрат, КЭКЗатрат, КПСЗатрат, СубконтоЗатрат1, СубконтоЗатрат2, СубконтоЗатрат3");
		ЗаполнитьЗначенияСвойств(Объект, СведенияОбОС);
	КонецЕсли;

КонецПроцедуры // ПолучитьПараметрыНачисленияАмортизации()

&НаКлиенте
Процедура УстановитьПараметрыАмортизации()

	Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Поступление") Тогда
		Если Объект.ОсновныеСредства.Количество()>0 И Не ЗначениеЗаполнено(Объект.ПорядокПогашенияСтоимости) Тогда
			Если ЭтотОбъект.КэшПараметров.УчетнаяПолитика.НачислятьАмортизациюИмуществаКазны Тогда
				Объект.ПорядокПогашенияСтоимости 	= ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации");
				Объект.СпособНачисленияАмортизации	= ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию");
			Иначе
				Объект.ПорядокПогашенияСтоимости 	= ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается");	
				Объект.СпособНачисленияАмортизации	= Неопределено;
			КонецЕсли;
			Если Объект.СрокПолезногоИспользования = 0 И ЗначениеЗаполнено(ОС_АмортизационнаяГруппа) Тогда
				УстановитьСрокПолезногоИспользования();
			КонецЕсли;
			ПараметрыВыбораЗначения = УправлениеОсновнымиСредствамиКлиент.ПараметрыВыбораПараметровНачисленияАмортизации();
			УправлениеОсновнымиСредствамиКлиент.ПорядокПогашенияСтоимостиПриИзменении(	
							Объект.СпособНачисленияАмортизации,
							Объект.НачислятьАмортизацию,
							ПараметрыВыбораЗначения);
			УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);			
		КонецЕсли;
	Иначе
		Объект.СрокПолезногоИспользования 			= 0;
		Объект.ПорядокПогашенияСтоимости 			= Неопределено;
		Объект.СпособНачисленияАмортизации 			= Неопределено;
		Объект.НачислятьАмортизацию					= Ложь;
		Объект.СчетУчетаЗатрат						= Неопределено;
		Объект.КЭКЗатрат							= Неопределено;
		ОбщегоНазначенияБГУКлиентСервер.УстановитьЗаголовкиСубконто(ЭтаФорма, Объект, Новый Структура("СчетОбъекта, Субконто1, Субконто2, Субконто3,
																										|Подразделение,
																										|ОчищатьОтстуствующие,
																										|СубконтоОбъекта1, СубконтоОбъекта2, СубконтоОбъекта3",
																										"СчетУчетаЗатрат",
																										"СубконтоЗатрат1",
																										"СубконтоЗатрат2",
																										"СубконтоЗатрат3",
																										"ПодразделениеЗатрат",
																										,
																										"СубконтоЗатрат1",
																										"СубконтоЗатрат2",
																										"СубконтоЗатрат3"));
		УстановитьДоступностьПараметровАмортизации(ЭтаФорма, Объект);			
	КонецЕсли;

КонецПроцедуры // УстановитьПараметрыАмортизации()

&НаКлиентеНаСервереБезКонтекста
Процедура ДоступностьЭлементовПоОперации(Форма, Объект)

	Элементы = Форма.Элементы;
	ЭтоВозврат = Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратАренда")
				ИЛИ Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратБезвозмездноеПользование");
	Элементы.Контрагент.АвтоОтметкаНезаполненного = ЭтоВозврат;				
	Если ЭтоВозврат Тогда
		Элементы.Контрагент.ОтметкаНезаполненного = Не ЗначениеЗаполнено(Объект.Контрагент);
	Иначе
		Элементы.Контрагент.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	Элементы.ОсновныеСредстваРассчитать.Доступность = ЭтоВозврат;
	
КонецПроцедуры // ДоступностьЭлементовПоОперации()

&НаСервере
Процедура РассчитатьСуммуВозврата()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОСДокумента.ОсновноеСредство,
	               |	ОСДокумента.ИнвентарныйНомер
	               |ПОМЕСТИТЬ ОСДокумента
	               |ИЗ
	               |	&ОСДокумента КАК ОСДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СобытияОС.ОсновноеСредство,
	               |	СобытияОС.ИнвНомер,
	               |	СобытияОС.Событие,
	               |	СобытияОС.ДатаСобытия
	               |ПОМЕСТИТЬ СобытияОС
	               |ИЗ
	               |	РегистрСведений.СобытияОС КАК СобытияОС
	               |ГДЕ
	               |	СобытияОС.Организация = &Организация
	               |	И (СобытияОС.ОсновноеСредство, СобытияОС.ИнвНомер) В
	               |			(ВЫБРАТЬ
	               |				ОСДокумента.ОсновноеСредство,
	               |				ОСДокумента.ИнвентарныйНомер
	               |			ИЗ
	               |				ОСДокумента)
	               |	И СобытияОС.Событие В (&СобытиеПередача, &СобытиеВозврат)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПереданныеВАренду.ОсновноеСредство,
	               |	ПереданныеВАренду.ИнвНомер,
	               |	ПереданныеВАренду.ДатаСобытия
	               |ПОМЕСТИТЬ ОСвАренде
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	               |		СобытияОС.ИнвНомер КАК ИнвНомер,
	               |		МАКСИМУМ(СобытияОС.ДатаСобытия) КАК ДатаСобытия
	               |	ИЗ
	               |		СобытияОС КАК СобытияОС
	               |	ГДЕ
	               |		СобытияОС.Событие = &СобытиеПередача
	               |		И СобытияОС.ИнвНомер ЕСТЬ НЕ NULL 
	               |		И СобытияОС.ИнвНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СобытияОС.ОсновноеСредство,
	               |		СобытияОС.ИнвНомер) КАК ПереданныеВАренду
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СобытияОС КАК СобытияОС
	               |		ПО ПереданныеВАренду.ОсновноеСредство = СобытияОС.ОсновноеСредство
	               |			И ПереданныеВАренду.ИнвНомер = СобытияОС.ИнвНомер
	               |			И ПереданныеВАренду.ДатаСобытия < СобытияОС.ДатаСобытия
	               |			И (СобытияОС.Событие = &СобытиеВозврат)
	               |ГДЕ
	               |	СобытияОС.ДатаСобытия ЕСТЬ NULL 
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОСДокумента.ОсновноеСредство,
	               |	ОСДокумента.ИнвентарныйНомер,
	               |	СобытияОС.ДатаСобытия
	               |ИЗ
	               |	ОСДокумента КАК ОСДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СобытияОС КАК СобытияОС
	               |		ПО ОСДокумента.ОсновноеСредство = СобытияОС.ОсновноеСредство
	               |			И ОСДокумента.ИнвентарныйНомер = СобытияОС.ИнвНомер
	               |			И (НЕ(ОСДокумента.ИнвентарныйНомер ЕСТЬ НЕ NULL 
	               |					И ОСДокумента.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	               |	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт КАК СуммаВАренде,
	               |	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт КАК КоличествоВАренде
	               |ПОМЕСТИТЬ Остатки
	               |ИЗ
	               |	ОСвАренде КАК ОСвАренде,
	               |	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	               |			,
	               |			Счет В (&Счет),
	               |			,
	               |			Организация = &Организация
	               |				И Субконто1 = &Контрагент
	               |				И Субконто2 В
	               |					(ВЫБРАТЬ
	               |						ОСвАренде.ОсновноеСредство
	               |					ИЗ
	               |						ОСвАренде)) КАК ЖурналПроводокЕПСБУОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОСвАренде.ОсновноеСредство,
	               |	ОСвАренде.ИнвНомер КАК ИнвентарныйНомер,
	               |	Остатки.СуммаВАренде,
	               |	Остатки.КоличествоВАренде
	               |ИЗ
	               |	ОСвАренде КАК ОСвАренде
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	               |		ПО ОСвАренде.ОсновноеСредство = Остатки.ОсновноеСредство";
	Если Объект.ВидПоступления = Перечисления.ВидыОперацийИК.ВозвратАренда Тогда
		Запрос.УстановитьПараметр("Счет",	БухгалтерскийУчетПовтИсп.ПолучитьМассивСчетов("25"));
		Запрос.УстановитьПараметр("СобытиеПередача",	Перечисления.ВидыСобытийОС.СдачаВАренду);
		Запрос.УстановитьПараметр("СобытиеВозврат",		Перечисления.ВидыСобытийОС.ВозвратИзАренды);
	Иначе
		Запрос.УстановитьПараметр("Счет",	БухгалтерскийУчетПовтИсп.ПолучитьМассивСчетов("26"));
		Запрос.УстановитьПараметр("СобытиеПередача",	Перечисления.ВидыСобытийОС.ПередачаВБезвозмездноеПользование);
		Запрос.УстановитьПараметр("СобытиеВозврат",		Перечисления.ВидыСобытийОС.ВозвратИзБезвозмездногоПользования);
	КонецЕсли;
	Запрос.УстановитьПараметр("Период", ?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата-1));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("ОСДокумента", Объект.ОсновныеСредства.Выгрузить(,"ОсновноеСредство, ИнвентарныйНомер"));
	Результат = Запрос.Выполнить().Выгрузить();
    Для каждого ТекСтр Из Объект.ОсновныеСредства Цикл
	
		СтрокиТекОС = Результат.НайтиСтроки(Новый Структура("ОсновноеСредство, ИнвентарныйНомер", ТекСтр.ОсновноеСредство, ТекСтр.ИнвентарныйНомер));
		Если СтрокиТекОС.Количество() = 0 Тогда
			ТекСтр.Количество 	= 0;
			ТекСтр.Сумма		= 0;
		Иначе
			Если ТекСтр.Количество = 0 Тогда
				ТекСтр.Количество = СтрокиТекОС[0].КоличествоВАренде;
			КонецЕсли;
			Если СтрокиТекОС[0].КоличествоВАренде = 0
				ИЛИ СтрокиТекОС[0].КоличествоВАренде = ТекСтр.Количество Тогда
				ТекСтр.Сумма = СтрокиТекОС[0].СуммаВАренде;
			Иначе
				ТекСтр.Сумма = ТекСтр.Количество * СтрокиТекОС[0].СуммаВАренде / СтрокиТекОС[0].КоличествоВАренде; 
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла; 
	
	
КонецПроцедуры // РассчитатьСуммуВозврата()

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСтруктуруПроверяемыхРеквизитов(ВидПоступления, ВключатьПодразделение=Ложь)
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ВидПоступления", НСтр("ru='Вид поступления'"));
	СтруктураРеквизитов.Вставить("Организация");
	Если ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратАренда")
		ИЛИ ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратБезвозмездноеПользование") Тогда
		СтруктураРеквизитов.Вставить("Контрагент", "Поставщик");
		Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
			СтруктураРеквизитов.Вставить("ИФО");
		КонецЕсли;
		Если ВключатьПодразделение Тогда
			СтруктураРеквизитов.Вставить("Подразделение");
		КонецЕсли;
	КонецЕсли;
	
    Возврат СтруктураРеквизитов;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УчитываетсяПодразделение(ВидПоступления)

	ИспользоватьПодразделение = Ложь;
	Если ОбщегоНазначенияБГУВызовСервераПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям") Тогда
		Если ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратАренда") Тогда
			ИспользоватьПодразделение = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьПризнакиУчета("25").УчетПоПодразделениям;
		ИначеЕсли ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.ВозвратБезвозмездноеПользование") Тогда
			ИспользоватьПодразделение = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьПризнакиУчета("26").УчетПоПодразделениям;
		КонецЕсли;
	КонецЕсли;
	Возврат ИспользоватьПодразделение;

КонецФункции // УчитываетсяПодразделение()

&НаСервере
Функция ПоместитьОСВХранилище()

	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);

КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(Знач ВыбранноеЗначение)
	ДобавленныеСтроки = УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(Объект.ОсновныеСредства,ВыбранноеЗначение,,"ОсновноеСредство,ИнвентарныйНомер");
	
	Для каждого ЭлементКоллекции Из Объект.ОсновныеСредства Цикл
		
		Если НЕ ЭлементКоллекции.ГрупповойУчет И ЭлементКоллекции.Количество<>1 Тогда
			ЭлементКоллекции.Количество = 1;
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОС(ОсновноеСредство, Организация, Дата)

	Результат = Новый Структура("ПервоначальнаяСтоимость, КодПоОКОФ, АмортизационнаяГруппа", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство,
	|	ЕСТЬNULL(ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних.ПервоначальнаяСтоимость, 0) КАК ПервоначальнаяСтоимость
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОСБухгалтерскийУчетСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.ПервоначальнаяСтоимость = Выборка.ПервоначальнаяСтоимость;
	КонецЕсли;
	
	ДанныеОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновноеСредство, "АмортизационнаяГруппа");
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеОбъекта);
	
	Возврат Результат;

КонецФункции // ЗначенияРеквизитовОС()

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗначенияРевизитовИзОС(Форма, ИдентификаторСтроки, ТолькоРеквизитыФормы = Ложь)

	ТекущиеДанные = Форма.Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПервоначальнаяСтоимость = 0;
		
		РеквизитыОС = ЗначенияРеквизитовОС(ТекущиеДанные.ОсновноеСредство, Форма.Объект.Организация, Форма.Объект.Дата);
		
		РеквизитыОС.Свойство("КодПоОКОФ", 				Форма.ОС_КодОКОФ);
		РеквизитыОС.Свойство("АмортизационнаяГруппа",	Форма.ОС_АмортизационнаяГруппа);
		Если НЕ ТолькоРеквизитыФормы Тогда
			РеквизитыОС.Свойство("ПервоначальнаяСтоимость",	ПервоначальнаяСтоимость);
			Если ПервоначальнаяСтоимость <> 0 Тогда
				Если Не ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда
					ТекущиеДанные.Количество = 1;
				КонецЕсли;
				ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ПервоначальнаяСтоимость;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьПорядокПогашенияСтоимости()
	
	УправлениеОсновнымиСредствамиКлиент.УстановитьПорядокПогашенияСтоимости(
								Объект.ПорядокПогашенияСтоимости,
								Объект.СпособНачисленияАмортизации,
								Объект.НачислятьАмортизацию,
								ПараметрыВыбораПараметровНачисленияАмортизации());
	

КонецПроцедуры 

&НаКлиенте
Функция ПараметрыВыбораПараметровНачисленияАмортизации()

	ПараметрыВыбораЗначения = УправлениеОсновнымиСредствамиКлиент.ПараметрыВыбораПараметровНачисленияАмортизации();
	ПараметрыВыбораЗначения.ПорядокПогашенияСтоимости	= Объект.ПорядокПогашенияСтоимости;
	ПараметрыВыбораЗначения.ДатаДокумента				= Объект.Дата;
	//ПараметрыВыбораЗначения.ВидНФА						= ПредопределенноеЗначение("Перечисление.ВидыНФА.Казна");
	ПараметрыВыбораЗначения.СчетУчета					= ОС_СчетУчета;
	Возврат ПараметрыВыбораЗначения;
	
КонецФункции // ПараметрыВыбораПараметровНачисленияАмортизации()

&НаСервереБезКонтекста
Функция ЗначенияРеквизитовОС2(ОС, НаДату)
	
	ДанныеОбъектаОС = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(ОС, НаДату);
	ЗначенияРеквизитов = Новый Структура("СчетУчета,КодПоОКОФ,АмортизационнаяГруппа");
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ДанныеОбъектаОС);
			
	Возврат ДанныеОбъектаОС;
	
КонецФункции

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

ВыборОСОбработан = Ложь;

