
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

//Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
//	Перем ТекРегистратор;
//	Если ВидФормы = "ФормаСписка"
//		И Параметры.Свойство("Отбор")
//		И Параметры.Отбор.Количество() = 1
//		И Параметры.Отбор.Свойство("Регистратор", ТекРегистратор)
//		И ТипЗнч(ТекРегистратор) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		ВыбраннаяФорма = "ФормаСпискаДвижений";
//		
//	КонецЕсли;
//КонецПроцедуры
