
&НаКлиенте
Перем КомпонентаПодписи;

&НаКлиенте
Перем ПутьКПрограмме;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ХарактеристикиГосуслуги = Новый ФиксированнаяСтруктура(Справочники.Номенклатура.ПолучитьХарактеристикиГосуслуги(Объект.Номенклатура, Объект.Дата));
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(Объект));
		
	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.УникальныйИдентификаторНачисления = "";
			Объект.ДокументОснование = Неопределено;
			Объект.ИДСтрокиДокументаОснования = Неопределено;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
			
			ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию();
			
		Иначе
			
			ПриИзмененииЛицевогоСчетаНаСервере();
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидОбменаДляQRКода) ИЛИ НЕ ЗначениеЗаполнено(Объект.ФорматОбменаДляQRКода) Тогда
			Объект.ВидОбменаДляQRКода = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ВидОбменаДляQRКода_КвитанцияНаОплату", "");
			Объект.ФорматОбменаДляQRКода = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ФорматОбменаДляQRКода_КвитанцияНаОплату", "");
		КонецЕсли;
		
	КонецЕсли;
	
	ИспользоватьИнтеграциюСУНИФО = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО");
	ИнтеграцияГИСГМП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП");
	
	Элементы.ОбновитьУИН.Доступность = Параметры.Ключ.Пустая() ИЛИ ПроверитьСтатусДокумента(Объект.Ссылка);
	Элементы.ОбновитьУИН.Видимость = ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП;
	Элементы.ФормаОбновитьИдентификаторы.Видимость = ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП;
	
	Элементы.ГруппаОКВЭД.Видимость = ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ВидКвитанции = 1;
		Объект.ДатаИзменения = "";
		Объект.ПлательщикНаименование = "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПлательщикНаименование)
		И Не ЗначениеЗаполнено(Объект.Плательщик) Тогда
		//наименование плательщика может заполняться при загрузке документа из сервиса,
		//например, по подписке, при этом плательщик может быть не заполнен, 
		//если его не удалось определить по идентификатору, 
		//и чтобы проще было понять, кому это начисление, загружается наименование плательщика
		Элементы.ПлательщикНаименование.Видимость = ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП;
	Иначе
		Элементы.ПлательщикНаименование.Видимость = Ложь;
	КонецЕсли;
	
	ИспользоватьУчетРП = ПолучитьФункциональнуюОпцию("ИспользоватьУчетРодительскойПлаты");
	ИспользоватьУчетСтудентов = ПолучитьФункциональнуюОпцию("ИспользоватьУчетСтудентов");
	
	Элементы.ГруппаДетскогоУчреждения.Видимость = ИспользоватьУчетРП;
	
	Если НЕ (ИспользоватьУчетРП И ИспользоватьУчетСтудентов) Тогда
		МассивТипов = Новый Массив;
		Если ИспользоватьУчетРП Тогда
			МассивТипов.Добавить(Тип("СправочникСсылка.Дети"));
		КонецЕсли;
		Если ИспользоватьУчетСтудентов Тогда
			МассивТипов.Добавить(Тип("СправочникСсылка.Студенты"));
		КонецЕсли;
		ОписаниеТиповУчащихся = Новый ОписаниеТипов(МассивТипов);
		Элементы.Учащийся.ОграничениеТипа = ОписаниеТиповУчащихся;
		Элементы.Учащийся.ДоступныеТипы = ОписаниеТиповУчащихся;
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	Элементы.ПричинаАннулирования.ТолькоПросмотр = Объект.ВидКвитанции <= 1;
	
	Если ИспользоватьИнтеграциюСУНИФО Тогда
		Если Объект.ТаблицаИдентификаторов.Количество()>0 Тогда
			СформироватьДополнительныеРеквизиты();
			
			Отбор = Новый Структура;
			Отбор.Вставить("ТипПоля","ЕдиныйИдентификатор");
			СтрокиИдентификатораПлательщика = Объект.ТаблицаИдентификаторов.НайтиСтроки(Отбор);
			
			Отбор.Вставить("ТипПоля","ЕдиныйИдентификаторУчащегося");
			СтрокиИдентификатораУчащегося = Объект.ТаблицаИдентификаторов.НайтиСтроки(Отбор);
			Если СтрокиИдентификатораПлательщика.Количество()>0 
				ИЛИ СтрокиИдентификатораУчащегося.Количество()>0 Тогда
				Элементы.ЕдиныйИдентификаторПлательщика.Видимость = Истина;
			КонецЕсли;
			
			Отбор = Новый Структура;
			Отбор.Вставить("ТипПоля","АльтернативныйИдентификатор");
			СтрокиИдентификатораПлательщика = Объект.ТаблицаИдентификаторов.НайтиСтроки(Отбор);
			
			Отбор.Вставить("ТипПоля","АльтернативныйИдентификаторУчащегося");
			СтрокиИдентификатораУчащегося = Объект.ТаблицаИдентификаторов.НайтиСтроки(Отбор);
			Если СтрокиИдентификатораПлательщика.Количество()>0 
				ИЛИ СтрокиИдентификатораУчащегося.Количество()>0 Тогда
				
				Элементы.АльтернативныйИдентификаторПлательщика.Видимость = Истина;
			КонецЕсли;
			
			Элементы.ОсновнойИдентификаторПлательщика.Видимость = Истина;
			Элементы.ДополнительныйИдентификаторПлательщика.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли ИнтеграцияГИСГМП Тогда
		Элементы.ЕдиныйИдентификаторПлательщика.Видимость = Истина;
		Элементы.АльтернативныйИдентификаторПлательщика.Видимость = Истина;
		Элементы.ОсновнойИдентификаторПлательщика.Видимость = Истина;
		Элементы.ДополнительныйИдентификаторПлательщика.Видимость = Истина;
	КонецЕсли;
	
	Если НЕ (ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП) Тогда
		// Если нет обмена с ГИС ГМП или ИС РНИП / ИС УНП, то подписи не должно быть.
		Элементы.ГруппаПодписи.Видимость = Ложь;
		Элементы.ГруппаИнформацияОПодписи.Видимость = Ложь;
	Иначе		
		// Если обмен есть, но еще не по формату 1.16 или подпись выполняется при обмене, подписывать нельзя.
		ТекНастройки = БиблиотекаФункцийОбмена.ПолучитьНастройкиОрганизации(Объект.Организация);	 
		Если ТекНастройки.ВерсияФорматов <> "1.16" ИЛИ ТекНастройки.РежимПодписи<>"Самостоятельно" Тогда
			Элементы.ГруппаПодписи.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Дата) И Год(Объект.Дата) < 2015 Тогда
		Элементы.КодОКАТО.Заголовок = "Код ОКАТО (105)";
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.ПроцентСкидки) Тогда
		ВидСкидки = 1;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПонижающийКоэффициент) Тогда
		ВидСкидки = 2;
	ИначеЕсли ЗначениеЗаполнено(Объект.ФиксированнаяСуммаСкидки) Тогда
		ВидСкидки = 3;
	КонецЕсли;
	
	Элементы.ГруппаСкидка.Видимость = (ВидСкидки <> 0);
	
	Если ВидСкидки = 1 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаПроцент;
	ИначеЕсли ВидСкидки = 2 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаКоэффициент;
	ИначеЕсли ВидСкидки = 3 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаФиксированная;
	КонецЕсли;	
	
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);
	
	ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Плательщик, "ВидКонтрагента");
	УстановитьВидимостьЭлементовЧековККМ(ЭтаФорма, ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо);
	
	УстановитьДоступностьЭлементовСуммы(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	НастройкаQRкода = УправлениеПечатьюБГУКлиентСервер.СформироватьНадписьНастройкаQRкода(Объект.ВидОбменаДляQRКода, Объект.ФорматОбменаДляQRКода);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьЗаголовокСоотнесенияПлатежей(ТекущийОбъект.Ссылка,ТекущийОбъект.УникальныйИдентификаторНачисления);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	УстановитьДоступностьРедактированияДокумента(ТекущийОбъект.Ссылка);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьРеквизитов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.УникальныйИдентификаторНачисления) Тогда
			Документы.КвитанцияНаОплатуГосуслуг.СформироватьИдентификаторНачисления(ТекущийОбъект);
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.УникальныйИдентификаторНачисления) Тогда
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноРасчетныеДокументы.ПередЗаписьюНаСервереДокумента(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеХарактеристикГосуслуги" И Параметр = Объект.Номенклатура И НЕ ЭтаФорма.ТолькоПросмотр Тогда
		Модифицированность = Истина;
		ПриИзмененииНоменклатуры();
				
	ИначеЕсли ИмяСобытия = "ИзмененСтатус_ПлатежноРасчетныйДокумент"
		И Объект.Ссылка = Источник Тогда
		ТекСтатус = Неопределено;
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			ТекСтатус = Неопределено;
			Параметр.Свойство("Статус",ТекСтатус);
		Иначе
			ТекСтатус = Параметр;
		КонецЕсли;
		Если ТекСтатус = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.Подготовлен")
			ИЛИ ТекСтатус = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.ВРаботе")
			ИЛИ ТекСтатус = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.ПустаяСсылка") Тогда
			Элементы.ОбновитьУИН.Доступность = Истина;
		Иначе
			Элементы.ОбновитьУИН.Доступность = Ложь;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ОбновитьСтатус_ПлатежноРасчетныйДокумент"
		И Объект.Ссылка = Источник Тогда
		//статус изменен вне документа, но форма документа открыта - обновим в форме
		ОбновитьСтатусПлатежноРасчетныногоДокумента();
		
	ИначеЕсли ИмяСобытия = "СоотнесениеНачисленийИПлатежей" И Параметр = Объект.Ссылка Тогда
		ЗаполнитьЗаголовокСоотнесенияПлатежей(Объект.Ссылка,Объект.УникальныйИдентификаторНачисления);		
	ИначеЕсли ИмяСобытия = "ПодписьНачисления" И Параметр = Объект.Ссылка Тогда
		Если Источник <> Объект.Ссылка Тогда
			УстановитьДоступностьРедактированияДокумента(Объект.Ссылка);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ПодписьНачислений" Тогда
		УстановитьДоступностьРедактированияДокумента(Объект.Ссылка);
	КонецЕсли;
	
	ПлатежноРасчетныеДокументыКлиент.ОбработатьОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусПлатежноРасчетныногоДокумента()
	ПлатежноРасчетныеДокументы.ПриСозданииНаСервереФормыДокумента(ЭтаФорма);	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ВидОбменаДляQRКода_КвитанцияНаОплату", "", Объект.ВидОбменаДляQRКода);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ФорматОбменаДляQRКода_КвитанцияНаОплату", "", Объект.ФорматОбменаДляQRКода);

	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	УправлениеПечатьюБГУКлиент.ОбработатНастройкиQRкода(ВыбранноеЗначение, ИсточникВыбора, Объект.ВидОбменаДляQRКода, Объект.ФорматОбменаДляQRКода, НастройкаQRкода);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

/////////////////////////////////////////////////////////////////////////////////////////
//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ИДЕНТИФИКАТОРОВ                        //

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизитаИдентификатора(Элемент)
	
	ИмяРеквизита = СтрЗаменить(Элемент.Имя,"Доп_","");
	ИзменитьЗначениеИдентификатора(ИмяРеквизита,ЭтаФорма[ИмяРеквизита]);
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ИДЕНТИФИКАТОРОВ                        //
/////////////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	
	Объект.ФиксированнаяСуммаСкидки = 0;
	Объект.ПроцентСкидки = 0;
	Объект.ПонижающийКоэффициент = 0;
	Объект.ДатаОкончанияДействияСкидки = Неопределено;
	Элементы.ГруппаСкидка.Видимость = (ВидСкидки <> 0);
	
	Если ВидСкидки = 1 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаПроцент;
	ИначеЕсли ВидСкидки = 2 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаКоэффициент;
	ИначеЕсли ВидСкидки = 3 Тогда
		Элементы.ГруппаСтраницСкидки.ТекущаяСтраница = Элементы.ГруппаФиксированная;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ ТипЗнч(ХарактеристикиГосуслуги) = Тип("ФиксированнаяСтруктура") Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	Если ТипЗнч(ХарактеристикиГосуслуги) = Тип("ФиксированнаяСтруктура") Тогда
		ПриИзмененииНоменклатуры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	// Если обмен есть, но еще не по формату 1.16 или подпись выполняется при обмене, подписывать нельзя.
	ТекНастройки = БиблиотекаФункцийОбмена.ПолучитьНастройкиОрганизации(Объект.Организация);	 
	Если ТекНастройки.ВерсияФорматов <> "1.16" ИЛИ ТекНастройки.РежимПодписи<>"Самостоятельно" Тогда
		Элементы.ГруппаПодписи.Видимость = Ложь;
	Иначе
		Элементы.ГруппаПодписи.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогСборПлатежПриИзменении(Элемент)
	
	НалогСборПлатежПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура УстановленныйСтатусДокументаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СтатусЭтогоДокументаНажатие(Элемент)
	ИзменитьСтатусДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();	
	
	Если ИспользоватьИнтеграциюСУНИФО Тогда
		ИзменитьЗначениеРеквизитаИдентификатора("Договор",Объект.Договор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащийсяПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Учащийся) Тогда
		Объект.ГруппаДетскогоУчреждения = Неопределено;
	КонецЕсли;
	Если ИспользоватьИнтеграциюСУНИФО Тогда
		ИзменитьЗначениеРеквизитаИдентификатора("Учащийся",Объект.Учащийся);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	ПриИзмененииЛицевогоСчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, НаДату", Объект.Организация, Объект.РеквизитыЛицевогоСчета, Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Объект.РеквизитыЛицевогоСчета 	= ВыбранноеЗначение;
	ЛицевойСчетОбработкаВыбораНаСервере(ВыбранноеЗначение);

КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Объект.ЛицевойСчет 	= ПолучитьЛицевойСчет(ВыбранноеЗначение);
    ПриИзмененииЛицевогоСчетаНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если ХарактеристикиГосуслуги.Номенклатура = Объект.Номенклатура Тогда
		// ничего не делаем
		Возврат
	КонецЕсли;
	
	ПриИзмененииНоменклатуры();
		
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент)
	
	Объект.Договор = Неопределено;	
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) 
		И (ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП) Тогда
		ПлательщикПриИзмененииСервер();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ПлательщикНаименование)
		И Не ЗначениеЗаполнено(Объект.Плательщик) Тогда
		//наименование плательщика может заполняться при загрузке документа из сервиса,
		//например, по подписке, при этом плательщик может быть не заполнен, 
		//если его не удалось определить по идентификатору, 
		//и чтобы проще было понять, кому это начисление, загружается наименование плательщика
		Элементы.ПлательщикНаименование.Видимость = ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП;
	Иначе
		Элементы.ПлательщикНаименование.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПлательщикПриИзмененииСервер()
		
	Если ИнтеграцияГИСГМП ИЛИ ИспользоватьИнтеграциюСУНИФО Тогда
		ИзменитьЗначениеРеквизитаИдентификатора("Договор",Объект.Договор);
		ИзменитьЗначениеРеквизитаИдентификатора("Плательщик",Объект.Плательщик);
	КонецЕсли;
	
	ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Плательщик, "ВидКонтрагента");
	УстановитьВидимостьЭлементовЧековККМ(ЭтаФорма, ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура("Отбор");
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Учащийся) И ТипЗнч(Объект.Учащийся) = Тип("СправочникСсылка.Дети") Тогда 		
		ПараметрыФормы.Отбор = Новый Структура("Контрагент",Объект.Учащийся);		
	Иначе
		ПараметрыФормы.Отбор = Новый Структура("Контрагент",Объект.Плательщик);
	КонецЕсли;
	ПараметрыФормы.Отбор.Вставить("Организация",Объект.Организация);
	ОткрытьФорму("Справочник.Договоры.ФормаВыбора",ПараметрыФормы,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВидКвитанцииПриИзменении(Элемент)
	
	Элементы.ПричинаАннулирования.ТолькоПросмотр = Объект.ВидКвитанции <= 1;
	
	Если Объект.ВидКвитанции >1 Тогда
		Объект.ДатаИзменения = ТекущаяДата();
	Иначе
		Объект.ДатаИзменения = "";
	КонецЕсли;
	
	Если Объект.ВидКвитанции = 3 И ЗначениеЗаполнено(Объект.СуммаДокумента) Тогда
		
		//Аннулируем
		Объект.АннулированнаяСуммаДокумента = Объект.СуммаДокумента;
						
	КонецЕсли;
	
	Если Объект.ВидКвитанции <> 3 И Объект.СуммаДокумента = 0 Тогда
		Объект.СуммаДокумента = Объект.АннулированнаяСуммаДокумента;
		Объект.АннулированнаяСуммаДокумента = 0;
	КонецЕсли;
		
	Если Объект.ВидКвитанции<=1 Тогда
		Объект.ПричинаАннулирования = "";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаQRкодаНажатие(Элемент, СтандартнаяОбработка)
	УправлениеПечатьюБГУКлиент.ОткрытьФормуНастройкиQRкода(ЭтотОбъект, СтандартнаяОбработка, Объект.ВидОбменаДляQRКода, Объект.ФорматОбменаДляQRКода);
КонецПроцедуры

/////////////////////////////////////////////////////////////////////
//  ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ - Налоговые реквизиты

&НаКлиенте
Процедура ПолеВводаСтатусСоставителяПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("СтатусСоставителя", ПолеВводаСтатусСоставителя);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательОснованияПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательОснования", ПолеВводаПоказательОснования);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаГодПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаНомерПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаДатаПериодаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаКодТаможенногоОрганаПриИзменении(Элемент)
	ПриИзмененииРеквизитовПериодаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательНомераПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательНомера", ПолеВводаПоказательНомера);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательДатыПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательДаты", ПолеВводаПоказательДаты);
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаПоказательТипаПриИзменении(Элемент)
	ПриИзмененииРеквизитаНаКлиенте("ПоказательТипа", ПолеВводаПоказательТипа);
КонецПроцедуры

//--------------

&НаКлиенте
Процедура СтатусСоставителяПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("СтатусСоставителя");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательОснованияПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательОснования");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПериодаПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательПериода");

КонецПроцедуры

&НаКлиенте
Процедура ПоказательНомераПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательНомера");

КонецПроцедуры

&НаКлиенте
Процедура ПоказательДатыПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательДаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательТипаПриИзменении(Элемент)
	
	ПриИзмененииПоказателяНаклиенте("ПоказательТипа");

КонецПроцедуры


///////////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	Объект.СуммаНДС = ПересчитатьСуммуНДС(Объект.СуммаДокумента, Объект.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	Объект.СуммаНДС = ПересчитатьСуммуНДС(Объект.СуммаДокумента, Объект.СтавкаНДС);
КонецПроцедуры

&НаКлиенте
Процедура УчащийсяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ВыбранноеЗначение.Свойство("Ребенок",Объект.Учащийся);
		ВыбранноеЗначение.Свойство("ГруппаДетскогоУчреждения",Объект.ГруппаДетскогоУчреждения);
		
		СтандартнаяОбработка = Ложь;
		
		Если ИспользоватьИнтеграциюСУНИФО Тогда
			ИзменитьЗначениеРеквизитаИдентификатора("Учащийся",Объект.Учащийся);
		КонецЕсли;
	Иначе
		Объект.ГруппаДетскогоУчреждения = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УчащийсяОчистка(Элемент, СтандартнаяОбработка)
	Объект.ГруппаДетскогоУчреждения = Неопределено;
КонецПроцедуры

//Особые условия оплаты

&НаКлиенте
Процедура ПонижающийКоэффициентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПонижающийКоэффициент) Тогда
		Если ЗначениеЗаполнено(Объект.ПроцентСкидки) Тогда
			Объект.ПроцентСкидки = 0;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ДатаОкончанияДействияСкидки) Тогда
			Объект.ДатаОкончанияДействияСкидки = Дата('00010101');
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроцентСкидкиПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПроцентСкидки) Тогда
		Если ЗначениеЗаполнено(Объект.ПонижающийКоэффициент) Тогда
			Объект.ПонижающийКоэффициент = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

    БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьНазначениеПлатежа(Команда)
	Если ЭтаФорма.Модифицированность 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НужноЗаписыватьДляФормированияНП(Объект.Номенклатура) Тогда
			Режим = РежимДиалогаВопрос.ОКОтмена;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Для заполнения назначения платежа нужно записать документ. Записать?'"), Режим, 0);
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	УстановитьЗначениеПлатежа(Объект.Номенклатура);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Отмена Тогда
        Возврат;
	КонецЕсли;
	Если Записать() Тогда
		УстановитьЗначениеПлатежа(Объект.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьУИН(Команда)
	ОбновитьУИННаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИдентификаторы(Команда)
	
	Если ИнтеграцияГИСГМП ИЛИ ИспользоватьИнтеграциюСУНИФО Тогда
		СформироватьТаблицуИдентификаторов();
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СоотнестиПлатежи(Команда)
	
	Если ЕстьПлатежи Тогда	
		ПараметрыФормы = Новый Структура("Отбор",Новый Структура("Начисление",Объект.Ссылка));
		ОткрытьФорму("РегистрСведений.СоответствиеНачисленийИПлатежей.Форма.ФормаСписка",ПараметрыФормы,ЭтотОбъект);
	Иначе
		ПараметрыФормы = Новый Структура("Участник,Начисление",Объект.Организация,Объект.Ссылка);
		ОткрытьФорму("Обработка.РаспределениеПлатежейГИСГМП.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКассовыхПоступлений(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.УникальныйИдентификаторНачисления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнен уникальный идентификатор начисления.'"));
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	СтруктураОтбора = Новый Структура("Организация,ИдентификаторПлатежа",Объект.Организация,Объект.УникальныйИдентификаторНачисления);
	ПараметрыФормы.Вставить("Отбор",СтруктураОтбора);
	ОткрытьФорму("Документ.КассовоеПоступление.ФормаСписка",ПараметрыФормы,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	//Нужно:
	//1.записать документ
	//2.сформировать файл по формату, найденному по виду обмена из настройки организации
	//3.подписать сформированный файл
	//4.добавить запись в РС ПодписанныеНачисления
	//5.установить только просмотр для всего документа
	//6.добавить кнопку включения редактирования и удаления подписи.
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтаФорма.Записать();
	КонецЕсли;
	
	Результат = СформироватьФайл();
	Если Результат = Ложь Тогда
		//не подписали
		Возврат;
	КонецЕсли;
	
	МассивДанных = Результат;
	
	ПодписатьФайл(МассивДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПодпись(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ПродолжитьУдалениеПодписи", ЭтотОбъект),Нстр("ru='Удалить электронную подпись документа?'"),РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьФайл()
	
	РезультатФормирования = Документы.КвитанцияНаОплатуГосуслуг.СформироватьФайлыДляПодписи(Объект.Организация, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка));
		
	Если ТипЗнч(РезультатФормирования) = Тип("ТаблицаЗначений") Тогда	
		МассивДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатФормирования);
		Возврат МассивДанных; 
	Иначе
		Возврат РезультатФормирования;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПодписатьФайл(МассивДанных)
	
	Если ГосУслугиКлиентСервер.НужнаКомпонентаПодписиНаКлиенте() 
		И КомпонентаПодписи = Неопределено Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("МассивДанных",МассивДанных);
			
		Оповещение = Новый ОписаниеОповещения("ПослеПодключенияКомпоненты_Xades2AddIn", ЭтотОбъект, ДопПараметры);
		ПараметрыПодключения = ОбщегоНазначенияКлиент.ПараметрыПодключенияКомпоненты();
		ПараметрыПодключения.ТекстПояснения = НСтр("ru = 'Для установки подписи xml файлов требуется
		                                        |внешняя компонента Xades2AddIn.'");
						
		ОбщегоНазначенияКлиент.ПодключитьКомпонентуИзМакета(Оповещение, "Xades2AddIn","ОбщийМакет.Компонента_xades", ПараметрыПодключения);

		Возврат;
	КонецЕсли;
			
	ГосУслугиКлиент.ПодписатьНачисления(МассивДанных,"Charge",КомпонентаПодписи);
	СохранитьПодписьВРегистре(МассивДанных);
	Оповестить("ПодписьНачисления", Объект.Ссылка, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодключенияКомпоненты_Xades2AddIn(Результат, ДопПараметры) Экспорт
	
	КомпонентаПодписи = Неопределено;
    Если Результат.Подключено Тогда 
        КомпонентаПодписи = Результат.ПодключаемыйМодуль;    
	Иначе
		
		ТекстОшибки = Результат.ОписаниеОшибки;
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
		Возврат;
		
	КонецЕсли;
	
	Если КомпонентаПодписи = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не удалось создать компоненту для формирования электронной подписи.'");			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоLinuxКлиент() Тогда
		Если ЗначениеЗаполнено(ПутьКПрограмме) Тогда
			КомпонентаПодписи.Криптопровайдер = ПутьКПрограмме;
		Иначе
			ПерсональныеНастройки = ЭлектроннаяПодписьКлиент.ПерсональныеНастройки();
			
			ДополнительныеПараметры = Новый Структура("СоответствиеПутей",ПерсональныеНастройки.ПутиКПрограммамЭлектроннойПодписиИШифрования);
			ДополнительныеПараметры.Вставить("МассивДанных",ДопПараметры.МассивДанных);
			ПослеСозданияМК(Неопределено,ДополнительныеПараметры);
			Возврат;	
		КонецЕсли;
	КонецЕсли;
	
	ГосУслугиКлиент.ПодписатьНачисления(ДопПараметры.МассивДанных,"Charge",КомпонентаПодписи);
	СохранитьПодписьВРегистре(ДопПараметры.МассивДанных);
	Оповестить("ПодписьНачисления", Объект.Ссылка, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияМК(Результат,ДопПараметры)Экспорт
	Если Результат = Неопределено Тогда
		Если ДопПараметры.Свойство("ТекущаяПрограмма") Тогда
			ДопПараметры.СоответствиеПутей.Удалить(ДопПараметры.ТекущаяПрограмма);
		КонецЕсли;
		Для Каждого КлючИЗначение Из ДопПараметры.СоответствиеПутей Цикл
			ДопПараметры.Вставить("ТекущаяПрограмма",КлючИЗначение.Ключ);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияМК",ЭтотОбъект,ДопПараметры);
			ЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(ОписаниеОповещения,"",Ложь,КлючИЗначение.Ключ);
			Возврат;
		КонецЦикла;
	Иначе
		Результат = Неопределено;
		ПутьКПрограмме = ДопПараметры.СоответствиеПутей[ДопПараметры.ТекущаяПрограмма];
		КомпонентаПодписи.Криптопровайдер = ПутьКПрограмме;
	КонецЕсли;
	
	ГосУслугиКлиент.ПодписатьНачисления(ДопПараметры.МассивДанных,"Charge",КомпонентаПодписи);
	СохранитьПодписьВРегистре(ДопПараметры.МассивДанных);
	Оповестить("ПодписьНачисления", Объект.Ссылка, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере 
Процедура СохранитьПодписьВРегистре(ТЧДанных)
	
	Документы.КвитанцияНаОплатуГосуслуг.СохранитьПодписьВРегистре(Объект.Организация,ТЧДанных);
	
	УстановитьДоступностьРедактированияДокумента(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПродолжитьУдалениеПодписи(РезультатВопроса, ДополнительныйПараметр) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьПодписьНаСервере();
	Оповестить("ПодписьНачисления", Объект.Ссылка, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьПодписьНаСервере()
	
	Документы.КвитанцияНаОплатуГосуслуг.УдалитьЭПНачислений(Объект.Ссылка);
	
	УстановитьДоступностьРедактированияДокумента(Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПересчитатьСуммуНДС(СуммаДокумента, СтавкаНДС)

	ПроцентНДС = УчетНДСПовтИсп.ПолучитьСтавкуНДС(СтавкаНДС);
	СуммаНДС   = Окр(СуммаДокумента * ПроцентНДС / (100 + ПроцентНДС), 2);

	Возврат СуммаНДС;

КонецФункции

&НаСервере
Процедура ОбновитьУИННаСервере()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Документы.КвитанцияНаОплатуГосуслуг.СформироватьИдентификаторНачисления(ТекОбъект);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЛицевойСчет(РеквизитыЛС)
	
	Возврат РеквизитыЛС.Владелец;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьСтатусДокумента(Ссылка)
	СтруктураЗаявки = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(Ссылка);
	СтатусДок = "";
	Если СтруктураЗаявки.Свойство("Статус",СтатусДок) Тогда
		Если НЕ ЗначениеЗаполнено(СтатусДок)
			ИЛИ СтатусДок = Перечисления.СтатусыИсполненияДокумента.ВРаботе 
			ИЛИ СтатусДок = Перечисления.СтатусыИсполненияДокумента.Подготовлен Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПлатежныеРеквизитыОрганизации(Знач ПараметрыОбъекта, ДопустимыеИсточникиСредств)

	РеквизитыПлательщика = Новый Структура("ИННПлательщика, КПППлательщика, ТекстПлательщика, НомерСчетаПлательщика, НаименованиеБанкаПлательщика, БикБанкаПлательщика, СчетБанкаПлательщика", "ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ПараметрыОбъекта.ЛицевойСчет, ПараметрыОбъекта.РеквизитыЛицевогоСчета, РеквизитыПлательщика, Истина);
	
	ДопустимыеИсточникиСредств = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ПараметрыОбъекта.ЛицевойСчет);
	
	РеквизитыПлательщика.Вставить("ОрганКазначейства","");
	Если ПараметрыОбъекта.ЛицевойСчет.ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский Тогда
		ДанныеОК = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыОбъекта.РеквизитыЛицевогоСчета,"КассовыйОрган.Наименование,КассовыйОрган.НаименованиеПолное");	
		РеквизитыПлательщика.Вставить("ОрганКазначейства", ?(НЕ ЗначениеЗаполнено(ДанныеОК.КассовыйОрганНаименование), ДанныеОК.КассовыйОрганНаименованиеПолное, ДанныеОК.КассовыйОрганНаименование));
	КонецЕсли;
	
	Возврат РеквизитыПлательщика;

КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьРеквизитов()
	
	
	
КонецПроцедуры	

&НаСервере
Процедура ПриИзмененииЛицевогоСчетаНаСервере()
	
	Перем ДопустимыеИсточникиСредств;
	
	ПараметрыОбъекта = Новый Структура("ЛицевойСчет,РеквизитыЛицевогоСчета,Дата");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта,Объект);
	
	РеквизитыПлательщика = ПолучитьПлатежныеРеквизитыОрганизации(ПараметрыОбъекта, ДопустимыеИсточникиСредств);
	
	Объект.ПолучательНаименование 		=  РеквизитыПлательщика.ТекстПлательщика;
	Объект.ПолучательБанковскийСчет 	=  РеквизитыПлательщика.НомерСчетаПлательщика;
	Объект.ПолучательНаименованиеБанка 	=  РеквизитыПлательщика.НаименованиеБанкаПлательщика;
	Объект.ПолучательБИКБанка 			=  РеквизитыПлательщика.БикБанкаПлательщика;
	Объект.ПолучательКорСчетБанка 		=  РеквизитыПлательщика.СчетБанкаПлательщика;
	Объект.ИННПолучателя 				=  РеквизитыПлательщика.ИННПлательщика;
	Объект.КПППолучателя 				=  РеквизитыПлательщика.КПППлательщика;
	Объект.ПолучательКазначейство       =  РеквизитыПлательщика.ОрганКазначейства;
	
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторПлательщикаГосуслуг(Плательщик, Дата, ТипИдентификатораПлательщика, ВидАльтернативногоИдентификатора)
	
	Если НЕ ЗначениеЗаполнено(Плательщик) ИЛИ НЕ ЗначениеЗаполнено(ТипИдентификатораПлательщика) Тогда
		Возврат "";
	КонецЕсли;
	
	ВидИдентификатора = ?(ТипИдентификатораПлательщика = Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый,Справочники.ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.ПустаяСсылка(),ВидАльтернативногоИдентификатора);
	Если ТипИдентификатораПлательщика = Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный И НЕ ЗначениеЗаполнено(ВидАльтернативногоИдентификатора) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ГосУслуги.ЗаполнитьОдинИдентификаторПлательщика(Плательщик,ВидИдентификатора,Дата).Идентификатор;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИдентификаторПлательщикаГосуслуг_1_16(Плательщик, Дата, ТипИдентификатораПлательщика, ВидАльтернативногоИдентификатора)
	
	Если НЕ ЗначениеЗаполнено(Плательщик) ИЛИ НЕ ЗначениеЗаполнено(ТипИдентификатораПлательщика) Тогда
		Возврат "";
	КонецЕсли;
	
	ВидИдентификатора = ?(ТипИдентификатораПлательщика = Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый,Справочники.ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.ПустаяСсылка(),ВидАльтернативногоИдентификатора);
	Если ТипИдентификатораПлательщика = Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный И НЕ ЗначениеЗаполнено(ВидАльтернативногоИдентификатора) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ГосУслуги.ЗаполнитьОдинИдентификаторПлательщика_1_16(Плательщик,ВидИдентификатора,Дата).Идентификатор;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИдентификаторПлательщикаГосуслуг_2_00(Плательщик, Дата, ТипИдентификатораПлательщика, ВидАльтернативногоИдентификатора)
	
	Если НЕ ЗначениеЗаполнено(Плательщик) ИЛИ НЕ ЗначениеЗаполнено(ТипИдентификатораПлательщика) Тогда
		Возврат "";
	КонецЕсли;
	
	ВидИдентификатора = ?(ТипИдентификатораПлательщика = Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый,Справочники.ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.ПустаяСсылка(),ВидАльтернативногоИдентификатора);
	Если ТипИдентификатораПлательщика = Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный И НЕ ЗначениеЗаполнено(ВидАльтернативногоИдентификатора) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ГосУслуги.ЗаполнитьОдинИдентификаторПлательщика_2_00(Плательщик,ВидИдентификатора,Дата).Идентификатор;
	
КонецФункции
 
&НаСервере
Процедура СформироватьТаблицуИдентификаторов(ТекЗначениеНастройки=Неопределено)
	
	Объект.АльтернативныйИдентификаторПлательщика = "";
	Объект.ЕдиныйИдентификаторПлательщика = "";
	Объект.ОсновнойИдентификаторПлательщика = "";
	Объект.ДополнительныйИдентификаторПлательщика = "";
	
	Если ИнтеграцияГИСГМП Тогда
		ИзменитьЗначениеРеквизитаИдентификатора("Плательщик",Объект.Плательщик);
		
		Возврат	
	КонецЕсли;
	
	Если НЕ ИспользоватьИнтеграциюСУНИФО Тогда
		Возврат;
	КонецЕсли;
				
	Элементы.АльтернативныйИдентификаторПлательщика.Видимость = Ложь;
	Элементы.ЕдиныйИдентификаторПлательщика.Видимость = Ложь;
	
	Если ТекЗначениеНастройки = Неопределено Тогда
		ЗначениеНастройки = Справочники.Номенклатура.ПолучитьХарактеристикиГосуслуги(Объект.Номенклатура, Объект.Дата).ЗначениеНастройки;
	Иначе
		ЗначениеНастройки = ТекЗначениеНастройки;
	КонецЕсли;
	Если ТипЗнч(ЗначениеНастройки)<>Тип("ХранилищеЗначения") Тогда
		Объект.ТаблицаИдентификаторов.Очистить();
		СформироватьДополнительныеРеквизиты();
		Возврат;
	КонецЕсли;
	//Обработать таблицу идентификаторов
	ПолученноеЗначениеНастройки = ЗначениеНастройки.Получить();
	Если ТипЗнч(ПолученноеЗначениеНастройки) <> Тип("Структура") Тогда
		Объект.ТаблицаИдентификаторов.Очистить();
		СформироватьДополнительныеРеквизиты();
		Возврат;
	КонецЕсли;
	
	ТаблицаИдн = ПолученноеЗначениеНастройки.ТаблицаИдентификаторов;
	Если ТаблицаИдн.Количество()=0 Тогда
		Объект.ТаблицаИдентификаторов.Очистить();
		СформироватьДополнительныеРеквизиты();
		Возврат;
	КонецЕсли;
	
	НастройкиОрганизации = БиблиотекаФункцийОбмена.ПолучитьНастройкиОрганизации(Объект.Организация);
	ИдентификаторПо_1_16 = Ложь;
	ИдентификаторПо_2_00 = Ложь;
	Если НастройкиОрганизации.ВерсияФорматов="1.16" Тогда
		ИдентификаторПо_1_16 = Истина;
	ИначеЕсли НастройкиОрганизации.ВерсияФорматов="2.00" Тогда
		ИдентификаторПо_2_00 = Истина;		
	КонецЕсли;
	
	СтараяТаблица = Объект.ТаблицаИдентификаторов.Выгрузить();
	Объект.ТаблицаИдентификаторов.Очистить();
	Для Каждого СтрИдн Из ТаблицаИдн Цикл
		НовСтр = Объект.ТаблицаИдентификаторов.Добавить();
		НовСтр.ИмяВФайле = СтрИдн.ИмяПоля;
		НовСтр.Представление = СтрИдн.Представление;
		НовСтр.ТипПоля = СтрИдн.ТипПоля;
		НовСтр.РеквизитИдентификатор = СтрИдн.РеквизитИдентификатор;
		СтруктураПоиска = Новый Структура("ИмяВФайле,ТипПоля,РеквизитИдентификатор",НовСтр.ИмяВФайле,НовСтр.ТипПоля,НовСтр.РеквизитИдентификатор);
		НайденныеСтроки = СтараяТаблица.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество()>0 Тогда
			НовСтр.Значение = НайденныеСтроки[0].Значение;
			НовСтр.ПолеИдентификатор = НайденныеСтроки[0].ПолеИдентификатор;
		КонецЕсли;
		Если НовСтр.ТипПоля = "СправочникСсылка.Дети"
			ИЛИ НовСтр.ТипПоля = "ДопАльтИдентификатор_Ребенок" Тогда
			Если Тип("СправочникСсылка.Дети") = ТипЗнч(Объект.Учащийся) Тогда
				НовСтр.Значение = Объект.Учащийся;
			Иначе
				НовСтр.Значение = Справочники.Дети.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли НовСтр.ТипПоля = "СправочникСсылка.Студенты"
			ИЛИ НовСтр.ТипПоля = "ДопАльтИдентификатор_Учащийся" Тогда
			Если Тип("СправочникСсылка.Студенты") = ТипЗнч(Объект.Учащийся) Тогда
				НовСтр.Значение = Объект.Учащийся;
			Иначе
				НовСтр.Значение = Справочники.Студенты.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли НовСтр.ТипПоля = "СправочникСсылка.Договоры" Тогда
			НовСтр.Значение = Объект.Договор;
		ИначеЕсли НовСтр.ТипПоля = "СправочникСсылка.Контрагенты" Тогда
			НовСтр.Значение = Объект.Плательщик;
		КонецЕсли;
		
		Если (НовСтр.ТипПоля = "ЕдиныйИдентификатор" ИЛИ НовСтр.ТипПоля = "АльтернативныйИдентификатор") Тогда
			ТипИдентификатора = ?(НовСтр.ТипПоля = "ЕдиныйИдентификатор",Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый,Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный);
			
			Если ИдентификаторПо_2_00 Тогда
				ТекИд = ИдентификаторПлательщикаГосуслуг_2_00(Объект.Плательщик, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			ИначеЕсли ИдентификаторПо_1_16 Тогда
				ТекИд = ИдентификаторПлательщикаГосуслуг_1_16(Объект.Плательщик, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			Иначе			
				ТекИд = ИдентификаторПлательщикаГосуслуг(Объект.Плательщик, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			КонецЕсли;
			
			НовСтр.Значение = ТекИд;			
			НовСтр.ПолеИдентификатор = НовСтр.Значение;
			
			ЗаполнитьИдентификаторПлательщика(ТипИдентификатора,ТекИд,ИдентификаторПо_2_00);
			
		ИначеЕсли (НовСтр.ТипПоля = "ЕдиныйИдентификаторУчащегося" ИЛИ НовСтр.ТипПоля = "АльтернативныйИдентификаторУчащегося") Тогда
			ТипИдентификатора = ?(НовСтр.ТипПоля = "ЕдиныйИдентификаторУчащегося",Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый,Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный);
			Если ЗначениеЗаполнено(Объект.Учащийся) Тогда
				
				Если ИдентификаторПо_2_00 Тогда
					НовСтр.Значение = ИдентификаторПлательщикаГосуслуг_2_00(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Учащийся,"Контрагент"), Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
				ИначеЕсли ИдентификаторПо_1_16 Тогда
					НовСтр.Значение = ИдентификаторПлательщикаГосуслуг_1_16(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Учащийся,"Контрагент"), Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
				Иначе			
					НовСтр.Значение = ИдентификаторПлательщикаГосуслуг(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Учащийся,"Контрагент"), Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
				КонецЕсли;
 
			Иначе
				НовСтр.Значение = "";
			КонецЕсли;
			
			ЗаполнитьИдентификаторПлательщика(ТипИдентификатора,НовСтр.Значение,ИдентификаторПо_2_00);
			
			НовСтр.ПолеИдентификатор = НовСтр.Значение;
			
		ИначеЕсли НовСтр.ТипПоля = "ДопАльтИдентификатор" Тогда
			ТипИдентификатора = Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный;
			
			Если ИдентификаторПо_2_00 Тогда
				НовСтр.Значение = ИдентификаторПлательщикаГосуслуг_2_00(Объект.Плательщик, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			ИначеЕсли ИдентификаторПо_1_16 Тогда
				НовСтр.Значение = ИдентификаторПлательщикаГосуслуг_1_16(Объект.Плательщик, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			Иначе			
				НовСтр.Значение = ИдентификаторПлательщикаГосуслуг(Объект.Плательщик, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			КонецЕсли;
						
			НовСтр.ПолеИдентификатор = НовСтр.Значение;
		ИначеЕсли НовСтр.ТипПоля = "ДопАльтИдентификатор_Ребенок"
			ИЛИ НовСтр.ТипПоля = "ДопАльтИдентификатор_Учащийся" Тогда
			ТипИдентификатора = Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный;
			ИспользуемыйКонтрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовСтр.Значение,"Контрагент");
			
			Если ИдентификаторПо_2_00 Тогда
				НовСтр.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг_2_00(ИспользуемыйКонтрагент, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			ИначеЕсли ИдентификаторПо_1_16 Тогда
				НовСтр.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг_1_16(ИспользуемыйКонтрагент, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			Иначе			
				НовСтр.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг(ИспользуемыйКонтрагент, Объект.Дата, ТипИдентификатора, НовСтр.РеквизитИдентификатор);
			КонецЕсли;
			
		Иначе
			Если ЗначениеЗаполнено(НовСтр.РеквизитИдентификатор) И ЗначениеЗаполнено(НовСтр.Значение) Тогда
				НовСтр.ПолеИдентификатор = Документы.КвитанцияНаОплатуГосуслуг.ПолучитьЗначениеИдентификатора(НовСтр.РеквизитИдентификатор,НовСтр.Значение,Объект.Дата);
			Иначе
				НовСтр.ПолеИдентификатор = "";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
		
    СформироватьДополнительныеРеквизиты();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНоменклатуры()
	
	ХарактеристикиГосуслуги = Новый ФиксированнаяСтруктура(Справочники.Номенклатура.ПолучитьХарактеристикиГосуслуги(Объект.Номенклатура, Объект.Дата));
	
	СформироватьТаблицуИдентификаторов(ХарактеристикиГосуслуги.ЗначениеНастройки);	
	
	ЗаполнитьКодБКПлатежа();
	
	Объект.КодОКАТО = ХарактеристикиГосуслуги.КодОКАТО;
	Объект.КодОКВЭД2 = ХарактеристикиГосуслуги.КодОКВЭД2;
	Объект.НаименованиеОКВЭД2 = ХарактеристикиГосуслуги.НаименованиеОКВЭД2;
	
	Если Объект.Предварительное Тогда
		Если НЕ ЗначениеЗаполнено(Объект.СуммаПредварительная) Тогда
			Объект.СуммаПредварительная		= ХарактеристикиГосуслуги.Стоимость;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.СуммаДокумента) Тогда
			Объект.СуммаДокумента 			= ХарактеристикиГосуслуги.Стоимость;
		КонецЕсли;
	КонецЕсли;
	
	Объект.СтавкаНДС				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Номенклатура,"СтавкаНДС");
	Объект.СуммаНДС = ПересчитатьСуммуНДС(Объект.СуммаДокумента, Объект.СтавкаНДС);
	
	
	ПолеВводаПоказательОснования 	= ХарактеристикиГосуслуги.ПоказательОснования;
	ПолеВводаПоказательТипа 		= ХарактеристикиГосуслуги.ПоказательТипа;
	ПолеВводаСтатусСоставителя		= ХарактеристикиГосуслуги.СтатусСоставителя;
	ПолеВводаПоказательПериода		= ХарактеристикиГосуслуги.ПоказательПериода;
	ПолеВводаГодПериода  			= "";
	ПолеВводаДатаПериода 			= "";
	ПолеВводаКодТаможенногоОргана 	= "";
	ПолеВводаНомерПериода 			= "";
	ПолеВводаПоказательДаты 		= "";
	ПолеВводаПоказательНомера		= "";
	
	ЗаполнитьЗначенияСвойств(Объект, БухгалтерскийУчетКлиентСервер.НалоговыеРеквизитыПлатежногоДокумента(Новый Структура("СтатусСоставителя,ПоказательОснования,ПоказательТипа,ПоказательНомера,ПоказательДаты", ПолеВводаСтатусСоставителя,ПолеВводаПоказательОснования,ПолеВводаПоказательТипа,ПолеВводаПоказательНомера,ПолеВводаПоказательДаты)));
			
	ЗначенияРеквизитов = Новый Структура("ПоказательПериода, ПолеВводаГодПериода, ПолеВводаНомерПериода, ПолеВводаДатаПериода, ПолеВводаКодТаможенногоОргана");
    ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Объект);
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ЭтаФорма);
	БухгалтерскийУчетКлиентСервер.ОпределитьРеквизитыНалоговогоПериода(ПолеВводаПоказательПериода, Ложь, Объект.Дата, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов);
	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);	
	
	Если НЕ НужноЗаписыватьДляФормированияНП(Объект.Номенклатура) Тогда	
    	УстановитьЗначениеПлатежа(Объект.Номенклатура);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКодБКПлатежа()
	Если ХарактеристикиГосуслуги = Неопределено Тогда
		ХарактеристикиГосуслуги = Новый ФиксированнаяСтруктура(Справочники.Номенклатура.ПолучитьХарактеристикиГосуслуги(Объект.Номенклатура, Объект.Дата));
	КонецЕсли;
	
	Если ТипЗнч(ХарактеристикиГосУслуги.НачалоДействияКПС) = Тип("Дата") Тогда
		Объект.КодБКПлатежа = ГосУслуги.ПолучитьКодБК(Объект.Организация, ХарактеристикиГосУслуги.КПС, 
						ХарактеристикиГосУслуги.КЭК, ХарактеристикиГосУслуги.НачалоДействияКПС, Объект.ИФО, Объект.ЛицевойСчет);
	КонецЕсли;					
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДополнительныеРеквизиты()
	
	СтруктураТиповТребуемыхДанных = Новый Структура;
	СтруктураТиповТребуемыхДанных.Вставить("Договоры",Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	СтруктураТиповТребуемыхДанных.Вставить("Студенты",Новый ОписаниеТипов("СправочникСсылка.Студенты"));
	СтруктураТиповТребуемыхДанных.Вставить("Дети",Новый ОписаниеТипов("СправочникСсылка.Дети"));
	СтруктураТиповТребуемыхДанных.Вставить("Контрагенты",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	
	СтруктураТиповТребуемыхДанных.Вставить("ДопАльтИдентификатор_Ребенок",Новый ОписаниеТипов("СправочникСсылка.Дети"));	
	СтруктураТиповТребуемыхДанных.Вставить("ДопАльтИдентификатор_Учащийся",Новый ОписаниеТипов("СправочникСсылка.Студенты"));
	СтруктураТиповТребуемыхДанных.Вставить("ДопАльтИдентификатор",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(25)));
	
	ДобавляемыеРеквизиты = Новый Массив;											
	Результат = Новый ДеревоЗначений;
	
	// общие для группы и элемента
	
	Результат.Колонки.Добавить("ИмяДляФормулы");  
	Результат.Колонки.Добавить("Заголовок");
	Результат.Колонки.Добавить("РастягиватьПоГоризонтали");
	Результат.Колонки.Добавить("ТипЭлемента");
	Результат.Колонки.Добавить("ВидЭлемента");
	
	// реквизиты элемента
	Результат.Колонки.Добавить("ТипЗначения");
	Результат.Колонки.Добавить("Реквизит");
	Результат.Колонки.Добавить("ПоложениеЗаголовка");
	Результат.Колонки.Добавить("ШиринаЭлемента");
	Результат.Колонки.Добавить("Гиперссылка");
	
	ОписаниеБулевого = Новый ОписаниеТипов("Булево");
	
	МассивИменДопРеквизитов = Новый Массив;
	
	Для Каждого СтрокаТЧ Из Объект.ТаблицаИдентификаторов Цикл
		ТипПоля = СтрЗаменить(СтрокаТЧ.ТипПоля,"СправочникСсылка.","");
		Попытка
			ТипЗначенияЭлемента = Неопределено;
			Если НЕ СтруктураТиповТребуемыхДанных.Свойство(ТипПоля,ТипЗначенияЭлемента) Тогда
				Продолжить;	
			КонецЕсли;
			//ТипЭлемента = СтруктураТиповТребуемыхДанных[ТипПоля];
		Исключение
			Продолжить;
		КонецПопытки;
		ТекЗаголовок = СтрокаТЧ.Представление;
		
		СтрокаДерева = Результат.Строки.Добавить();
	
		СтрокаДерева.ИмяДляФормулы 	= "ИДПоле_"+СтрокаТЧ.НомерСтроки;
		СтрокаДерева.Заголовок 		= ТекЗаголовок;
		Если ТипПоля = "ЕдиныйИдентификатор" ИЛИ ТипПоля = "АльтернативныйИдентификатор" ИЛИ ТипПоля = "ДопАльтИдентификатор" Тогда
			СтрокаДерева.ВидЭлемента 	= ВидПоляФормы.ПолеВвода;
			СтрокаДерева.Гиперссылка    = Ложь;
		Иначе
		    СтрокаДерева.ВидЭлемента 	= ВидПоляФормы.ПолеНадписи;
			СтрокаДерева.Гиперссылка    = Истина;
		КонецЕсли;
		СтрокаДерева.ТипЭлемента 	= Тип("ПолеФормы");
		СтрокаДерева.РастягиватьПоГоризонтали =	Ложь;
		
		
		СтрокаДерева.ШиринаЭлемента = 30;
										 
		СтрокаДерева.ТипЗначения 	= ТипЗначенияЭлемента;
		СтрокаДерева.Реквизит 		= "ИДПоле_"+СтрокаТЧ.НомерСтроки;
		СтрокаДерева.ПоложениеЗаголовка =	ПоложениеЗаголовкаЭлементаФормы.Авто;
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ИДПоле_"+СтрокаТЧ.НомерСтроки,
													  ТипЗначенияЭлемента,
													  "",
													  ТекЗаголовок,
													  Ложь));
													  
       	МассивИменДопРеквизитов.Добавить("ИДПоле_"+СтрокаТЧ.НомерСтроки);
		
	КонецЦикла;	
	
	МассивУдаляемыхЭлементов = Новый Массив;
	МассивУдаляемыхРеквизитов = Новый Массив;
	
	Если ТипЗнч(ДобавленныеЭлементы) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ЭлМас Из ДобавленныеРеквизиты Цикл
			МассивУдаляемыхРеквизитов.Добавить(ЭлМас);
		КонецЦикла;
		Для Каждого ЭлМас Из ДобавленныеЭлементы Цикл
			ТекЭлемент = Элементы.Найти(ЭлМас);
			Если ТекЭлемент<>Неопределено Тогда
				МассивУдаляемыхЭлементов.Добавить(ТекЭлемент);
			КонецЕсли;
		КонецЦикла;	    
	КонецЕсли;
	
	Для Каждого ТекЭлемент Из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(ТекЭлемент);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты,МассивУдаляемыхРеквизитов);
	
	ДобавленныеРеквизиты = Новый ФиксированныйМассив(МассивИменДопРеквизитов);
	
	ДобавитьЭлементыНаФорму(Результат.Строки);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыНаФорму(ДеревоРеквизитов)
	ПолеДляРеквизитов = Элементы.ГруппаЗначениеИдентификаторов;
	ПолеДляНадписи    = Элементы.ГруппаНадписьИдентификаторов;
    ПрефиксЭлементовОперации = "Доп_";
	
	МассивЭлементов = Новый Массив;
	
    Для каждого НовыйРеквизит Из ДеревоРеквизитов Цикл
    	НовЭлемент = ЭтаФорма.Элементы.Найти(ПрефиксЭлементовОперации+НовыйРеквизит.ИмяДляФормулы);
    	Если НовЭлемент = Неопределено Тогда
    		НовЭлемент = ЭтаФорма.Элементы.Добавить(ПрефиксЭлементовОперации+НовыйРеквизит.ИмяДляФормулы,
    											 Тип("ПолеФормы"),
    											 ПолеДляРеквизитов);
    		НовЭлемент.ПутьКДанным = ""+НовыйРеквизит.ИмяДляФормулы;
			НовНадпись = ЭтаФорма.Элементы.Добавить("Доп_Надпись_"+НовыйРеквизит.ИмяДляФормулы,Тип("ДекорацияФормы"),ПолеДляНадписи);
			НовНадпись.Заголовок = "";
			НовНадпись.ЦветТекста = Новый Цвет(70,130,180);
			
			МассивЭлементов.Добавить(НовНадпись.Имя);
    	КонецЕсли;
    	
		НовЭлемент.Заголовок = НовыйРеквизит.Заголовок;
		НовЭлемент.Вид = НовыйРеквизит.ВидЭлемента;
		Если НовЭлемент.Вид = ВидПоляФормы.ПолеНадписи Тогда
			НовЭлемент.Гиперссылка = НовыйРеквизит.Гиперссылка;
		Иначе
			НовЭлемент.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
		КонецЕсли;	
		НовЭлемент.ПоложениеЗаголовка = НовыйРеквизит.ПоложениеЗаголовка;
		НовЭлемент.ЦветФона = Новый Цвет(225,225,225);
		НовЭлемент.РастягиватьПоГоризонтали = НовыйРеквизит.РастягиватьПоГоризонтали;
		НовЭлемент.Ширина	= НовыйРеквизит.ШиринаЭлемента;
		НовЭлемент.УстановитьДействие("ПриИзменении","Подключаемый_ПриИзмененииДопРеквизитаИдентификатора");
		
		МассивЭлементов.Добавить(НовЭлемент.Имя);
	КонецЦикла;
	
	ДобавленныеЭлементы = Новый ФиксированныйМассив(МассивЭлементов);
	
	Для Каждого СтрокаТЧ Из Объект.ТаблицаИдентификаторов Цикл
		Попытка
			Если Найти(СтрокаТЧ.ТипПоля, "ЕдиныйИдентификатор")=0 И  Найти(СтрокаТЧ.ТипПоля,"АльтернативныйИдентификатор")=0 Тогда
				ЭтаФорма["ИДПоле_"+СтрокаТЧ.НомерСтроки] = СтрокаТЧ.Значение;
				ЭлементНадпись = Элементы.Найти("Доп_Надпись_ИДПоле_"+СтрокаТЧ.НомерСтроки);
				Если ЭлементНадпись<>Неопределено Тогда
					ЭлементНадпись.Заголовок = СтрокаТЧ.ПолеИдентификатор;
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗначениеИдентификатора(ИмяРеквизита,Значение)
	НомерСтроки = Число(СтрЗаменить(ИмяРеквизита,"ИДПоле_",""));
	
	Если Объект.ТаблицаИдентификаторов.Количество() < НомерСтроки Тогда
		Возврат;
	КонецЕсли;
	СтрокаТЧ = Объект.ТаблицаИдентификаторов[НомерСтроки-1];
	
	СтрокаТЧ.Значение = Значение;
	Попытка	
		Если СтрокаТЧ.ТипПоля = "ЕдиныйИдентификатор" 
			ИЛИ СтрокаТЧ.ТипПоля = "АльтернативныйИдентификатор" 
			ИЛИ СтрокаТЧ.ТипПоля = "ДопАльтИдентификатор" Тогда
			СтрокаТЧ.Значение = Значение;
			СтрокаТЧ.ПолеИдентификатор = Значение;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТЧ.РеквизитИдентификатор) И ЗначениеЗаполнено(СтрокаТЧ.Значение) Тогда
			СтрокаТЧ.ПолеИдентификатор = Документы.КвитанцияНаОплатуГосуслуг.ПолучитьЗначениеИдентификатора(СтрокаТЧ.РеквизитИдентификатор, СтрокаТЧ.Значение, Объект.Дата);
		Иначе			
			СтрокаТЧ.ПолеИдентификатор = "";
		КонецЕсли;
	Исключение
		СтрокаТЧ.ПолеИдентификатор = "";
	КонецПопытки;
	
	ЭлементНадпись = Элементы.Найти("Доп_Надпись_"+ИмяРеквизита);
	Если ЭлементНадпись <> Неопределено Тогда
    	ЭлементНадпись.Заголовок = СтрокаТЧ.ПолеИдентификатор;
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗначениеРеквизитаИдентификатора(ИмяРеквизита,Значение)
	
	
	Если ИнтеграцияГИСГМП И ИмяРеквизита = "Плательщик" Тогда
				
		Объект.АльтернативныйИдентификаторПлательщика = "";
		Объект.ЕдиныйИдентификаторПлательщика = "";
		Объект.ОсновнойИдентификаторПлательщика = "";
		Объект.ДополнительныйИдентификаторПлательщика = "";
		
		ПериодНастройки = ГосУслугиПовтИсп.ВернутьПериодАктуальныхНастроек(Объект.Номенклатура,НачалоДня(Объект.Дата));
		Если НЕ ЗначениеЗаполнено(ПериодНастройки) Тогда
			Возврат;
		КонецЕсли;
		
		ТаблицаНастройки = ГосУслуги.ПолучитьНастройкуИспользуемыхИдентификаторов(Объект.Номенклатура,ПериодНастройки).Выгрузить();
		
		ГосУслуги.ЗаполнитьИдентификаторПлательщикаДляГИСГМП(Объект,ТаблицаНастройки);	
		
	ИначеЕсли ИспользоватьИнтеграциюСУНИФО Тогда
		
		МассивПроверямеыхРеквизитов = Новый Массив;
	
		Если ИмяРеквизита = "Договор" Тогда
			МассивПроверямеыхРеквизитов.Добавить("СправочникСсылка.Договоры");
		ИначеЕсли ИмяРеквизита = "Учащийся" Тогда
			МассивПроверямеыхРеквизитов.Добавить("СправочникСсылка.Дети");
			МассивПроверямеыхРеквизитов.Добавить("СправочникСсылка.Студенты");
			МассивПроверямеыхРеквизитов.Добавить("ДопАльтИдентификатор_Ребенок");
			МассивПроверямеыхРеквизитов.Добавить("ДопАльтИдентификатор_Учащийся");
			МассивПроверямеыхРеквизитов.Добавить("ЕдиныйИдентификаторУчащегося");
			МассивПроверямеыхРеквизитов.Добавить("АльтернативныйИдентификаторУчащегося");
			//добавляем поля плательщика
			МассивПроверямеыхРеквизитов.Добавить("ЕдиныйИдентификатор");
			МассивПроверямеыхРеквизитов.Добавить("АльтернативныйИдентификатор");
		ИначеЕсли ИмяРеквизита = "Плательщик" Тогда
			МассивПроверямеыхРеквизитов.Добавить("СправочникСсылка.Контрагенты");
			МассивПроверямеыхРеквизитов.Добавить("ЕдиныйИдентификатор");
			МассивПроверямеыхРеквизитов.Добавить("АльтернативныйИдентификатор");
			МассивПроверямеыхРеквизитов.Добавить("ДопАльтИдентификатор");
			//добавляем поля учащегося
			МассивПроверямеыхРеквизитов.Добавить("ЕдиныйИдентификаторУчащегося");
			МассивПроверямеыхРеквизитов.Добавить("АльтернативныйИдентификаторУчащегося");
		КонецЕсли;
		
	    НастройкиОрганизации = БиблиотекаФункцийОбмена.ПолучитьНастройкиОрганизации(Объект.Организация);
		ИдентификаторПо_1_16 = Ложь;
		ИдентификаторПо_2_00 = Ложь;
		Если НастройкиОрганизации.ВерсияФорматов="1.16" Тогда
			ИдентификаторПо_1_16 = Истина;
		ИначеЕсли НастройкиОрганизации.ВерсияФорматов="2.00" Тогда
			ИдентификаторПо_2_00 = Истина;
		КонецЕсли;
		
		Для Каждого СтрокаТЧ Из Объект.ТаблицаИдентификаторов Цикл
			Если (ИмяРеквизита = "Плательщик" 
					ИЛИ ИмяРеквизита = "Учащийся") 
				И (СтрокаТЧ.ТипПоля = "ЕдиныйИдентификатор"
					ИЛИ СтрокаТЧ.ТипПоля = "ЕдиныйИдентификаторУчащегося") Тогда
				
				Объект.ЕдиныйИдентификаторПлательщика = "";
				Объект.ОсновнойИдентификаторПлательщика = "";
				Объект.ДополнительныйИдентификаторПлательщика = "";
				
			ИначеЕсли (ИмяРеквизита = "Плательщик" 
					ИЛИ ИмяРеквизита = "Учащийся") 
				И (СтрокаТЧ.ТипПоля = "АльтернативныйИдентификатор"
					ИЛИ СтрокаТЧ.ТипПоля = "АльтернативныйИдентификаторУчащегося") Тогда
					
				Объект.АльтернативныйИдентификаторПлательщика = "";
			    Объект.ОсновнойИдентификаторПлательщика = "";
				Объект.ДополнительныйИдентификаторПлательщика = "";
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из Объект.ТаблицаИдентификаторов Цикл
			Если МассивПроверямеыхРеквизитов.Найти(СтрокаТЧ.ТипПоля) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаТЧ.ТипПоля = "ДопАльтИдентификатор_Ребенок" Тогда
				Если ТипЗнч(Объект.Учащийся) = Тип("СправочникСсылка.Дети") Тогда
					СтрокаТЧ.Значение = Объект.Учащийся;
				Иначе
					СтрокаТЧ.Значение = Справочники.Дети.ПустаяСсылка();
				КонецЕсли;
			ИначеЕсли СтрокаТЧ.ТипПоля = "ДопАльтИдентификатор_Учащийся" Тогда
				Если ТипЗнч(Объект.Учащийся) = Тип("СправочникСсылка.Студенты") Тогда
					СтрокаТЧ.Значение = Объект.Учащийся;
				Иначе
					СтрокаТЧ.Значение = Справочники.Студенты.ПустаяСсылка();
				КонецЕсли;
			ИначеЕсли СтрокаТЧ.ТипПоля = "ЕдиныйИдентификатор"
				ИЛИ СтрокаТЧ.ТипПоля = "АльтернативныйИдентификатор" Тогда
				
				ТипИдентификатора = ?(СтрокаТЧ.ТипПоля = "ЕдиныйИдентификатор",Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый,Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный);
				
				Если ИдентификаторПо_2_00 Тогда
					СтрокаТЧ.Значение = ИдентификаторПлательщикаГосуслуг_2_00(Объект.Плательщик, Объект.Дата, ТипИдентификатора, СтрокаТЧ.РеквизитИдентификатор);
				ИначеЕсли ИдентификаторПо_1_16 Тогда
					СтрокаТЧ.Значение = ИдентификаторПлательщикаГосуслуг_1_16(Объект.Плательщик, Объект.Дата, ТипИдентификатора, СтрокаТЧ.РеквизитИдентификатор);
				Иначе			
					СтрокаТЧ.Значение = ИдентификаторПлательщикаГосуслуг(Объект.Плательщик, Объект.Дата, ТипИдентификатора, СтрокаТЧ.РеквизитИдентификатор);
				КонецЕсли;
					
				ЗаполнитьИдентификаторПлательщика(ТипИдентификатора,СтрокаТЧ.Значение,ИдентификаторПо_2_00);
				
				СтрокаТЧ.ПолеИдентификатор = СтрокаТЧ.Значение;
				Продолжить;	
			ИначеЕсли СтрокаТЧ.ТипПоля = "ЕдиныйИдентификаторУчащегося"
				ИЛИ СтрокаТЧ.ТипПоля = "АльтернативныйИдентификаторУчащегося" Тогда
				
				ТипИдентификатора = ?(СтрокаТЧ.ТипПоля = "ЕдиныйИдентификаторУчащегося",Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый,Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный);
				
				Если ЗначениеЗаполнено(Объект.Учащийся) 
					И (ТипЗнч(Объект.Учащийся) = Тип("СправочникСсылка.Студенты")
					ИЛИ ТипЗнч(Объект.Учащийся) = Тип("СправочникСсылка.Дети")) Тогда
									
					Если ИдентификаторПо_2_00 Тогда
						СтрокаТЧ.Значение = ИдентификаторПлательщикаГосуслуг_2_00(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Учащийся,"Контрагент"), Объект.Дата, ТипИдентификатора, СтрокаТЧ.РеквизитИдентификатор);
					ИначеЕсли ИдентификаторПо_1_16 Тогда
						СтрокаТЧ.Значение = ИдентификаторПлательщикаГосуслуг_1_16(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Учащийся,"Контрагент"), Объект.Дата, ТипИдентификатора, СтрокаТЧ.РеквизитИдентификатор);
					Иначе			
						СтрокаТЧ.Значение = ИдентификаторПлательщикаГосуслуг(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Учащийся,"Контрагент"), Объект.Дата, ТипИдентификатора, СтрокаТЧ.РеквизитИдентификатор);
					КонецЕсли;
					
				Иначе
					СтрокаТЧ.Значение = "";
				КонецЕсли;
				
				ЗаполнитьИдентификаторПлательщика(ТипИдентификатора,СтрокаТЧ.Значение,ИдентификаторПо_2_00);
				
				СтрокаТЧ.ПолеИдентификатор = СтрокаТЧ.Значение;
				Продолжить;
			ИначеЕсли СтрокаТЧ.ТипПоля = "ДопАльтИдентификатор" Тогда
				//Тут ничего не делаем
			ИначеЕсли ТипЗнч(Значение) = Тип(СтрокаТЧ.ТипПоля) Тогда
				СтрокаТЧ.Значение = Значение;
			Иначе
				ОписаниеТипа = Новый ОписаниеТипов(СтрокаТЧ.ТипПоля);
				СтрокаТЧ.Значение = ОписаниеТипа.ПривестиЗначение(Неопределено);
			КонецЕсли;
			
			Если СтрокаТЧ.ТипПоля = "ДопАльтИдентификатор_Ребенок" 
				ИЛИ СтрокаТЧ.ТипПоля = "ДопАльтИдентификатор_Учащийся" Тогда
				ИспользуемыйПлательщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Значение,"Контрагент");
				
				Если ИдентификаторПо_2_00 Тогда
					СтрокаТЧ.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг_2_00(ИспользуемыйПлательщик, Объект.Дата, Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный, СтрокаТЧ.РеквизитИдентификатор);
				ИначеЕсли ИдентификаторПо_1_16 Тогда
					СтрокаТЧ.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг_1_16(ИспользуемыйПлательщик, Объект.Дата, Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный, СтрокаТЧ.РеквизитИдентификатор);
				Иначе			
					СтрокаТЧ.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг(ИспользуемыйПлательщик, Объект.Дата, Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный, СтрокаТЧ.РеквизитИдентификатор);
				КонецЕсли;
				
			ИначеЕсли СтрокаТЧ.ТипПоля = "ДопАльтИдентификатор" Тогда
				ИспользуемыйПлательщик = Объект.Плательщик;
				
				Если ИдентификаторПо_2_00 Тогда
					СтрокаТЧ.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг_2_00(ИспользуемыйПлательщик, Объект.Дата, Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный, СтрокаТЧ.РеквизитИдентификатор);
				ИначеЕсли ИдентификаторПо_1_16 Тогда
					СтрокаТЧ.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг_1_16(ИспользуемыйПлательщик, Объект.Дата, Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный, СтрокаТЧ.РеквизитИдентификатор);
				Иначе			
					СтрокаТЧ.ПолеИдентификатор = ИдентификаторПлательщикаГосуслуг(ИспользуемыйПлательщик, Объект.Дата, Перечисления.ТипИдентификатораПолучателяГосуслуг.Альтернативный, СтрокаТЧ.РеквизитИдентификатор);
				КонецЕсли;
				СтрокаТЧ.Значение = СтрокаТЧ.ПолеИдентификатор;
			Иначе
				Попытка
					Если ЗначениеЗаполнено(СтрокаТЧ.РеквизитИдентификатор) И ЗначениеЗаполнено(СтрокаТЧ.Значение) Тогда
						СтрокаТЧ.ПолеИдентификатор = Документы.КвитанцияНаОплатуГосуслуг.ПолучитьЗначениеИдентификатора(СтрокаТЧ.РеквизитИдентификатор,СтрокаТЧ.Значение,Объект.Дата);	
					Иначе
						СтрокаТЧ.ПолеИдентификатор = "";
					КонецЕсли;	
				Исключение		
					СтрокаТЧ.ПолеИдентификатор = "";
				КонецПопытки;
			КонецЕсли;
			
			Попытка
				//Элемент
				ИмяРеквизита = "ИДПоле_"+СтрокаТЧ.НомерСтроки;
				ЭлементИдн = Элементы.Найти("Доп_"+ИмяРеквизита);
				Если ЭлементИдн <> Неопределено Тогда
			    	ЭтаФорма[ИмяРеквизита] = СтрокаТЧ.Значение;
				КонецЕсли;
				
				//Надпись
				ИмяРеквизита = "Доп_Надпись_ИДПоле_"+СтрокаТЧ.НомерСтроки;
				ЭлементНадпись = Элементы.Найти(ИмяРеквизита);
				Если ЭлементНадпись <> Неопределено Тогда
			    	ЭлементНадпись.Заголовок = СтрокаТЧ.ПолеИдентификатор;
				КонецЕсли;
			Исключение
			
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИдентификаторПлательщика(ТипИдентификатора,ЗначениеИдентификатора,ИдентификаторПо_2_00)
	
	Если ИдентификаторПо_2_00 = Ложь Тогда
		Если ТипИдентификатора = Перечисления.ТипИдентификатораПолучателяГосуслуг.Единый Тогда
			Элементы.ЕдиныйИдентификаторПлательщика.Видимость = Истина;
			Если ЗначениеЗаполнено(ЗначениеИдентификатора) Тогда
				Объект.ЕдиныйИдентификаторПлательщика = ЗначениеИдентификатора;
			КонецЕсли;
		Иначе
			Элементы.АльтернативныйИдентификаторПлательщика.Видимость = Истина;
			Если ЗначениеЗаполнено(ЗначениеИдентификатора) Тогда
				Объект.АльтернативныйИдентификаторПлательщика = ЗначениеИдентификатора;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ЗначениеИдентификатора) Тогда
			Если НЕ ЗначениеЗаполнено(Объект.ОсновнойИдентификаторПлательщика) Тогда
				Объект.ОсновнойИдентификаторПлательщика = ЗначениеИдентификатора;
							
				Если Лев(Объект.ОсновнойИдентификаторПлательщика,1) = "1" Тогда
					//физлица
					Объект.АльтернативныйИдентификаторПлательщика = ГосУслуги.ПреобразоватьИдентификаторПлательщикаИз20В116(Объект.ОсновнойИдентификаторПлательщика);
				Иначе
					Объект.ЕдиныйИдентификаторПлательщика = ГосУслуги.ПреобразоватьИдентификаторПлательщикаИз20В116(Объект.ОсновнойИдентификаторПлательщика);
				КонецЕсли;			
							
			ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ДополнительныйИдентификаторПлательщика) Тогда
				Объект.ДополнительныйИдентификаторПлательщика = ЗначениеИдентификатора;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеПлатежа(Номенклатура)
	
	Если ИспользоватьИнтеграциюСУНИФО ИЛИ ИнтеграцияГИСГМП Тогда
		Если НЕ ЗначениеЗаполнено(Объект.УникальныйИдентификаторНачисления) Тогда
			ТекОбъект = РеквизитФормыВЗначение("Объект");
			Документы.КвитанцияНаОплатуГосуслуг.СформироватьИдентификаторНачисления(ТекОбъект);
			ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
		КонецЕсли;
	КонецЕсли;
	
	ШаблонЗаполнения = Справочники.ШаблоныЗаполненияНПКвитанцииНаОплату.ПолучитьШаблонЗаполнения(Номенклатура);
	
	Если НЕ ЗначениеЗаполнено(ШаблонЗаполнения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не установлен шаблон заполнения.'"));
		Возврат;
	КонецЕсли;	
	
	Объект.НазначениеПлатежа = Справочники.ШаблоныЗаполненияНПКвитанцииНаОплату.ПолучитьТекстПоШаблону(Объект,ШаблонЗаполнения);
	Модифицированность = Истина;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НужноЗаписыватьДляФормированияНП(Номенклатура)
	ШаблонЗаполнения = Справочники.ШаблоныЗаполненияНПКвитанцииНаОплату.ПолучитьШаблонЗаполнения(Номенклатура);
	Если НЕ ЗначениеЗаполнено(ШаблонЗаполнения) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонЗаполнения,"РасширенныйШаблон");
КонецФункции

&НаКлиенте
Процедура ИзменитьСтатусДокумента()
	
	ПлатежноРасчетныеДокументыКлиент.ОткрытьФормуИзмененияСтатусаДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовокСоотнесенияПлатежей(Ссылка,УИН)
	
	СуммаКоличествоПлатежей = РегистрыСведений.СоответствиеНачисленийИПлатежей.ПолучитьСуммуКоличествоПлатежейПоНачислению(Ссылка);	
	ЕстьПлатежи = Ложь;
	Если СуммаКоличествоПлатежей.Количество>0 Тогда
		Элементы.СоотнестиПлатежи.Заголовок = НСтр("ru='Список платежей ("+СуммаКоличествоПлатежей.Количество+" шт. на сумму "+СуммаКоличествоПлатежей.Сумма+" р.)'");
		ЕстьПлатежи = Истина;		
	Иначе
		Элементы.СоотнестиПлатежи.Заголовок = НСтр("ru='Распределить платежи по начислениям'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НалогСборПлатежПриИзмененииНаСервере()
	
	НалоговыеНастройки =  БухгалтерскийУчет.ПолучитьНастройкиНалоговогоПлатежа(Объект.НалогСборПлатеж, Истина);
	
	ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем 	= НалоговыеНастройки.ЗаполнятьНезаполненныеНулем;
	ТаможенныйПлатеж 								= НалоговыеНастройки.ТаможенныйПлатеж;
	ПолеВводаСтатусСоставителя 						= НалоговыеНастройки.СтатусСоставителя;
	ПолеВводаПоказательОснования 					= НалоговыеНастройки.ПоказательОснования;
	ПолеВводаПоказательПериода 						= НалоговыеНастройки.ПоказательПериода;
	ПолеВводаПоказательТипа 						= НалоговыеНастройки.ПоказательТипа;

	ЗаполнитьЗначенияСвойств(Объект, БухгалтерскийУчетКлиентСервер.НалоговыеРеквизитыПлатежногоДокумента(НалоговыеНастройки)); 

    ЗначенияРеквизитов = Новый Структура("ПоказательПериода, ПолеВводаГодПериода, ПолеВводаНомерПериода, ПолеВводаДатаПериода"); 
	ЗначенияРеквизитов.Вставить("ПолеВводаКодТаможенногоОргана", НалоговыеНастройки.КодТаможенногоОргана);
	БухгалтерскийУчетКлиентСервер.ОпределитьРеквизитыНалоговогоПериода(ПолеВводаПоказательПериода, ТаможенныйПлатеж, Объект.Дата, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияРеквизитов);

    БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);
	
    СписокРеквизитов = "ПоказательОснования,ПоказательПериода,ПоказательТипа,ПоказательНомера,ПоказательДаты,СтатусСоставителя";	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьНезаполненныеНалоговыеРеквизиты(Объект,СписокРеквизитов,ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем, Объект.Дата);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитаНаКлиенте(ИмяРеквизита, ЗначениеРеквизита)
	
	ЗаполнитьЗначенияСвойств(Объект, БухгалтерскийУчетКлиентСервер.НалоговыеРеквизитыПлатежногоДокумента(Новый Структура(ИмяРеквизита, ЗначениеРеквизита)));
    СписокРеквизитов = "ПоказательОснования,ПоказательПериода,ПоказательТипа,ПоказательНомера,ПоказательДаты,СтатусСоставителя";	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьНезаполненныеНалоговыеРеквизиты(Объект,СписокРеквизитов, ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовПериодаНаКлиенте()
	
	ЗначенияРеквизитов = Новый Структура("ПоказательПериода, ПолеВводаГодПериода, ПолеВводаНомерПериода, ПолеВводаДатаПериода, ПолеВводаКодТаможенногоОргана");
    ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Объект);
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, ЭтаФорма);
	БухгалтерскийУчетКлиентСервер.ОпределитьРеквизитыНалоговогоПериода(ПолеВводаПоказательПериода, ТаможенныйПлатеж, Объект.Дата, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияРеквизитов);
	ЗаполнитьЗначенияСвойств(Объект, ЗначенияРеквизитов);
	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);
    СписокРеквизитов = "ПоказательОснования,ПоказательПериода,ПоказательТипа,ПоказательНомера,ПоказательДаты,СтатусСоставителя";	
	БухгалтерскийУчетКлиентСервер.ЗаполнитьНезаполненныеНалоговыеРеквизиты(Объект,СписокРеквизитов, ЗаполнятьНезаполненныеНалоговыеРеквизитыНулем, Объект.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПоказателяНаклиенте(ИмяПоказателя) 
	
	РеквизитыПлатежа = Новый Структура(ИмяПоказателя, Объект[ИмяПоказателя]);
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, БухгалтерскийУчетКлиентСервер.ПолучитьЗначенияНалоговыхРеквизитов(РеквизитыПлатежа));

	БухгалтерскийУчетКлиентСервер.УстановитьВидимостьРеквизитовНалоговогоПериода(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьРедактированияДокумента(ТекСсылка)
	НельзяРедактировать = БиблиотекаФункцийОбмена.СуществуетПодписанноеНачисление(ТекСсылка);
	
	ЭтотОбъект.ТолькоПросмотр = НельзяРедактировать;
	Элементы.ГруппаИнформацияОПодписи.Видимость = НельзяРедактировать;
	Элементы.Подписать.Доступность = НЕ НельзяРедактировать;
КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию()
	
	Умолчания = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация, "Документ.КвитанцияНаОплатуГосуслуг", Объект.Дата);
	
	Объект.ЛицевойСчет = Умолчания.ЛицевойСчет;
	Объект.РеквизитыЛицевогоСчета = Умолчания.РеквизитыЛицевогоСчета;
	
	ПриИзмененииЛицевогоСчетаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()

	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ОплатаВстречнымПредоставлением = 
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, 
			"ОплатаВстречнымПредоставлением");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЧековККМ(Форма, ВидимостьЭлементовЧековККМ)
	
	Объект = Форма.Объект;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ОплатаВстречнымПредоставлением", "Видимость", ВидимостьЭлементовЧековККМ);
		
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
&НаКлиенте
Процедура КодОКВЭД2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", 				"Выбор вида деятельности по ОКВЭД");
	ПараметрыФормы.Вставить("НазваниеМакета",  			"ОКВЭД2");
	ПараметрыФормы.Вставить("Префикс",					"Классификатор");
	ПараметрыФормы.Вставить("ИмяРеквизитаКод",  		"КодОКВЭД2");
	ПараметрыФормы.Вставить("ИмяРеквизитаНаименование",	"НаименованиеОКВЭД2");
	
	ВыбратьИзКлассификатора(ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзКлассификатора(ПараметрыФормы)
	
	ПараметрыФормы.Вставить("ТекущийПериод",   		?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	ПараметрыФормы.Вставить("ТекущийКод",      		Объект[ПараметрыФормы.ИмяРеквизитаКод]);
	ПараметрыФормы.Вставить("ВернутьВсеРеквизиты",		Истина);

	ДополнительныеПараметры = Новый Структура("ИмяРеквизитаКод, ИмяРеквизитаНаименование", ПараметрыФормы.ИмяРеквизитаКод, ПараметрыФормы.ИмяРеквизитаНаименование);

	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьИзКлассификатораЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
	 
КонецПроцедуры	
 
&НаКлиенте
Процедура ВыбратьИзКлассификатораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		Объект[ДополнительныеПараметры.ИмяРеквизитаКод] = РезультатЗакрытия.Код;
		
		Объект[ДополнительныеПараметры.ИмяРеквизитаНаименование] = РезультатЗакрытия.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭД2ПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.КодОКВЭД2) Тогда
		Объект.НаименованиеОКВЭД2 = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПредварительноеПриИзменении(Элемент)
	Если Объект.Предварительное Тогда
		Объект.СуммаПредварительная = Объект.СуммаДокумента;
		Объект.СуммаДокумента = 0;
		Объект.СуммаНДС = ПересчитатьСуммуНДС(Объект.СуммаДокумента, Объект.СтавкаНДС);
	Иначе
		Объект.СуммаДокумента = Объект.СуммаПредварительная;
		Объект.СуммаПредварительная = 0;
		Объект.СуммаНДС = ПересчитатьСуммуНДС(Объект.СуммаДокумента, Объект.СтавкаНДС);
	КонецЕсли;
	УстановитьДоступностьЭлементовСуммы(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовСуммы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,"СуммаДокумента","ТолькоПросмотр",Форма.Объект.Предварительное);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,"СуммаПредварительная","ТолькоПросмотр",НЕ Форма.Объект.Предварительное);
		
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти



