
&НаКлиенте
Перем СуммаВключаетНДСДоИзменения;
&НаКлиенте
Перем ТипЦеныДоИзменения;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ИспользоватьВалютныйУчет = Ложь;
	ВалютаРубли = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Параметры.Ключ.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ПризнакСпособаРасчетаЧекаККМ) Тогда
			Объект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
		КонецЕсли;
		Объект.КассоваяСмена = Документы.КассоваяСмена.ПустаяСсылка();
		УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
		
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;
		Если НЕ ЗначениеЗаполнено(Объект.ЧекККМПродажа) Тогда
			Объект.ЭтоРозничныйПокупатель = Истина;
		КонецЕсли;
	
		Если Объект.Оплата.Количество() = 0 Тогда 
			НоваяСтрока = Объект.Оплата.Добавить();
			УстановитьНастройкиНаличнойОплаты();
		КонецЕсли;
	КонецЕсли;	
	
	УстановитьФункциональныеОпцииФормы();
	УстановитьДанныеДляПечатиЧековККМ();
	ИспользуетсяККТСПередачейДанных = ПодключаемоеОборудованиеБГУ.ИспользуетсяККТСПередачейДанных(Объект.КассаККМ);
	
	Если Параметры.Ключ.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.ТипЦены = Объект.КассаККМ.ТипЦены;
			Объект.СуммаВключаетНДС = Объект.КассаККМ.СуммаВключаетНДС;
		КонецЕсли;
		
		Объект.НомерЧекаККМ = 0;
		Объект.НомерСменыККМ = 0;
		Объект.СтатусЧекаККМ = "";
		Объект.ИсправительныйЧекККМ = "";
		
		ВестиКонтрольОстатковТоваров = РозничныеПродажиБГУ.ВестиКонтрольОстатковТоваров(Объект.КассаККМ);
		Если ВестиКонтрольОстатковТоваров Тогда
			Объект.ПоступлениеТоваровНаСкладТорговойТочки = Истина;
		КонецЕсли;

	КонецЕсли;
	
	ЭтоВозвратДеньВДень = ЭтоВозвратДеньВДень(); 
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтаФорма);
	
	РассчитатьИтоги();
	РассчитатьИтогиОплаты();
	
	ПрочитатьДополнительныеДанныеЧековККМ();
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
	
	УстановитьВидимостьЭлементовЭквайринга(ЭтаФорма, НомерКассовогоЧека);
	УстановитьВидимостьЭлементовФормы();
	УстановитьДоступностьДоговора(ЭтаФорма);
	УстановитьКартинкиЭлементовФормы();

	РозничнаяРеализацияМаркированныхТоваров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "РозничнаяРеализацияМаркированныхТоваров");
	УстановитьВидимостьУсловноеОформлениеМаркировка();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, ЭтаФорма.Элементы.ИнформационныеСсылки);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьФункциональныеОпцииФормы();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ИспользоватьВалютныйУчет = Ложь;
	ВалютаРубли = Константы.ВалютаРегламентированногоУчета.Получить();
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
	
	РассчитатьИтогиОплаты();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УстановитьВидимостьЭлементовФормы();
	Если НЕ Объект.ЭтоРозничныйПокупатель Тогда
		ДействияСКонтактнымиДаннымиДляЧекаККМ();
	Иначе
		ЗаписатьДополнительныеДанныеЧековККМ();
	КонецЕсли;
	
	ЗаполнитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьДоговора(ЭтаФорма);
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
	ПредставитьТелефонИEmailКлиент();
	ОбновитьФормуSMSИEmail();
	
	ТекущаяОплата = Объект.Оплата[0];

	Если ЗначениеЗаполнено(Объект.ИдентификаторКорзины) Тогда 
		СуммаОплаты 				= Объект.Оплата.Итог("Сумма"); 
		СуммаОплатыСертификатами 	= Объект.Оплата[1].Сумма; 
		СуммаКомиссии 				= Объект.Оплата.Итог("СуммаКомиссии");
	Иначе 
		СуммаОплаты			= ТекущаяОплата.Сумма; 
		СуммаКомиссии	 	= ТекущаяОплата.СуммаКомиссии;
	КонецЕсли;
	
	Если Объект.ФормаОплаты = 1 Тогда
		СуммаОплатыПлатежнойКартой = СуммаОплаты;
		ВидПлатежнойКарты = ТекущаяОплата.ВидПлатежнойКарты;
		
		ЭквайринговыйТерминал = ТекущаяОплата.ЭквайринговыйТерминал;
		ПараметрыДоговораЭквайринга = ТекущаяОплата.ПараметрыДоговораЭквайринга;
		ПроцентКомиссииБанка = ТекущаяОплата.ПроцентКомиссии;
		СуммаКомиссииБанка = СуммаКомиссии;
		НомерЧекаЭТВозврата = ТекущаяОплата.НомерЧекаЭТВозврата;
		СсылочныйНомерВозврата = ТекущаяОплата.СсылочныйНомерВозврата;
		НомерПлатежнойКарты = ТекущаяОплата.НомерПлатежнойКарты;
		ЗаполнитьПараметрыНДССКомиссии();
	Иначе
		СуммаОплатыНаличными = СуммаОплаты;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ЭтоРозничныйПокупатель Тогда
		Если НЕ ЗначениеЗаполнено(ТекущийОбъект.КассаККМ.КонтрагентДляРозничныхПродаж) ИЛИ НЕ ЗначениеЗаполнено(ТекущийОбъект.КассаККМ.ДоговорДляРозничныхПродаж) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не заполнены контрагент и договор соответствующие розничному покупателю для кассы ККМ из справочника ""Кассы ККМ (фискальные регистраторы)"".
			|Значение следует заполнить на закладке ""Настройки заполнения данных кассового чека"" (раздел ""Денежные средства""/""Управление ККТ""). '");
			Сообщение.Сообщить();
		КонецЕсли;	 
		
		Если НЕ ЗаполнятьКонтрагентаИДоговор() Тогда
			ТекущийОбъект.Контрагент = ТекущийОбъект.КассаККМ.КонтрагентДляРозничныхПродаж;
			ТекущийОбъект.Договор = ТекущийОбъект.КассаККМ.ДоговорДляРозничныхПродаж;
		Иначе
			Если НЕ ЗначениеЗаполнено(ТекущийОбъект.Контрагент) Тогда
				ТекущийОбъект.Контрагент = ТекущийОбъект.КассаККМ.КонтрагентДляРозничныхПродаж;
				ТекущийОбъект.Договор = ТекущийОбъект.КассаККМ.ДоговорДляРозничныхПродаж;
			Конецесли;	
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.Оплата.Количество() = 0 Тогда
		НоваяСтрока = Объект.Оплата.Добавить();
		УстановитьДанныеЭквайрингаНаСервере();
	КонецЕсли;	
	
	ТЗ_ТоварыУслуги = Новый ТаблицаЗначений;
	ТЗ_ТоварыУслуги.Колонки.Добавить("СтатьяАналитикиОплаты", Новый ОписаниеТипов("СправочникСсылка.СтатьиАналитикиОплатыЧекаККМ"));
	ТЗ_ТоварыУслуги.Колонки.Добавить("СуммаДляОплаты", Новый ОписаниеТипов("Число"));
	ТЗ_ТоварыУслуги.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТЗ_ТоварыУслуги.Колонки.Добавить("СуммаКомиссии", Новый ОписаниеТипов("Число"));
	ТЗ_ТоварыУслуги.Колонки.Добавить("КлючСвязиОплаты", Новый ОписаниеТипов("Число"));
 	
	ТЗ_ТоварыУслуги.Очистить();
	Для каждого ТекСтрока Из ТекущийОбъект.ТоварыРаботыУслуги Цикл
		НоваяСтрокаНоменклатуры = ТЗ_ТоварыУслуги.Добавить();
		НоваяСтрокаНоменклатуры.СтатьяАналитикиОплаты = ТекСтрока.Номенклатура.ОсновнаяСтатьяАналитикиОплаты;
		НоваяСтрокаНоменклатуры.СуммаДляОплаты = ТекСтрока.Всего;
		НоваяСтрокаНоменклатуры.Сумма = 0;
		НоваяСтрокаНоменклатуры.СуммаКомиссии = 0;
		НоваяСтрокаНоменклатуры.КлючСвязиОплаты = 1;
	КонецЦикла;	
	
	ВсегоОплачено = Объект.Оплата[0].Сумма;
	ВсегоКомиссияБанка = Объект.Оплата[0].СуммаКомиссии;
	ПроцентБанка = Объект.Оплата[0].ПроцентКомиссии; 
	Если ВсегоКомиссияБанка < 0 Тогда
		ВсегоКомиссияБанка = -1 * ВсегоКомиссияБанка;
	КонецЕсли;	
	Если ПроцентБанка < 0 Тогда
		ПроцентБанка = -1 * ПроцентБанка;
	КонецЕсли;	
	
	Для каждого ТекТоварУслуга Из ТЗ_ТоварыУслуги Цикл
		Если ВсегоОплачено = 0 Тогда 
			Прервать;
		КонецЕсли;
		
		ПолноеПогашение = Истина;
		Если ВсегоОплачено < ТекТоварУслуга.СуммаДляОплаты Тогда
			ПолноеПогашение = Ложь;
		КонецЕсли;	
		
		ТекТоварУслуга.Сумма = ?(ПолноеПогашение, ТекТоварУслуга.СуммаДляОплаты, ВсегоОплачено);
		Если ВсегоКомиссияБанка > 0 Тогда
			ТекТоварУслуга.СуммаКомиссии = (-1)*Окр(ТекТоварУслуга.Сумма * ПроцентБанка / 100, 2);	
			
			Если НДССКомиссииСверху Тогда 
				ТекТоварУслуга.СуммаКомиссии = ТекТоварУслуга.СуммаКомиссии + (ТекТоварУслуга.СуммаКомиссии * СтавкаНДССКомиссии)	
			КонецЕсли;
			
			Если НЕ ПолноеПогашение Тогда
				ТекТоварУслуга.СуммаКомиссии = ВсегоКомиссияБанка;
			КонецЕсли;	
			
			ВсегоКомиссияБанка = ВсегоКомиссияБанка - ТекТоварУслуга.СуммаКомиссии;
		Конецесли;	
		
		ВсегоОплачено = ВсегоОплачено - ТекТоварУслуга.Сумма;
	КонецЦикла;	
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторКорзины) Тогда 
		ТекущийОбъект.РасшифровкаОплаты.Загрузить(ТЗ_ТоварыУслуги);
	КонецЕсли;	
	
	СохранитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если (ИмяСобытия = "ФискальныеОперацииБГУИзменение") Тогда
		УстановитьВидимостьЭлементовФормы();
		НомерКассовогоЧека  = НомерЧекаДляДокумента();
		ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПредставитьТелефонИEmailКлиент();
	ОбновитьФормуSMSИEmail();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ИспользуетсяККТСПередачейДанных Тогда 
		ПроверитьЗакрытиеСессииПроверкиКМ();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЧекККМПродажаПриИзменении(Элемент)
	ЧекККМПродажаПриИзмененииНаСервере();
	
	ЭтоВозвратДеньВДень = ЭтоВозвратДеньВДень(); 
	
	Если НЕ ЭтоВозвратДеньВДень Тогда
		ТекстСообщения = НСтр("ru = 'Чек на возврат можно ввести только для чека на продажу по текущей кассовой смене!
		|Для оформления возврата денежных средств прошлых кассовых смен следует ввести документ ""Заявление на возврат по чеку ККМ"" на основании чека продажи
		|и использовать документ ""Расходный кассовый ордер"" или ""Эквайринговая операция"", в котором указать документ ""Заявление на возврат по чеку ККМ""
		|как документ-основание номенклатуры чека.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтаФорма);
	
	РассчитатьИтоги();
	РассчитатьИтогиОплаты();
	
	ПредставитьТелефонИEmailКлиент();
	
	ТекущаяОплата = Объект.Оплата[0];
	
	Если Объект.ФормаОплаты = 1 Тогда
		СуммаОплатыПлатежнойКартой = ТекущаяОплата.Сумма;
		ВидПлатежнойКарты = ТекущаяОплата.ВидПлатежнойКарты;
		
		ЭквайринговыйТерминал = ТекущаяОплата.ЭквайринговыйТерминал;
		ПараметрыДоговораЭквайринга = ТекущаяОплата.ПараметрыДоговораЭквайринга;
		ПроцентКомиссииБанка = ?(ЭтоВозвратДеньВДень, (-1)*ТекущаяОплата.ПроцентКомиссии, 0);
		СуммаКомиссииБанка = ТекущаяОплата.СуммаКомиссии;
		НомерЧекаЭТВозврата = ТекущаяОплата.НомерЧекаЭТВозврата;
		СсылочныйНомерВозврата = ТекущаяОплата.СсылочныйНомерВозврата;
		НомерПлатежнойКарты = ТекущаяОплата.НомерПлатежнойКарты;
		
		ПересчитатьКомиссию(ЭтаФорма);
		УстановитьДанныеЭквайрингаНаСервере();
	Иначе
		СуммаОплатыНаличными = ТекущаяОплата.Сумма;
	КонецЕсли;
	
	УстановитьДоступностьДоговора(ЭтаФорма);
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
	
	УстановитьВидимостьЭлементовФормы();
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	УстановитьВидимостьЭлементовЭквайринга(ЭтаФорма, НомерКассовогоЧека);
	УстановитьДоступностьДоговора(ЭтаФорма);
	УстановитьКартинкиЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	КассаККМПриИзмененииНаСервере();
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НадписьТипЦенНДСНажатие(Элемент, СтандартнаяОбработка)
	
	СуммаВключаетНДСДоИзменения = Объект.СуммаВключаетНДС;
	ТипЦеныДоИзменения = Объект.ТипЦены;
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		УстановитьДанныеДляПечатиЧековККМ(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьДоступностьДоговора(ЭтаФорма);
	
	ЗаполнениеДанныхДляЧекаККМ();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаОплатыПриИзменении(Элемент)
	Если Объект.ФормаОплаты = 1 Тогда
		Если НЕ ИспользоватьОплатуПлатежнымиКартами Тогда
			Объект.ФормаОплаты = 0;
			 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Включите флажок ""Оплата платежными картами (эквайринг)"" для возможности принимать оплату платежными картами. Флажок следует включить на закладке ""Денежные средства"" (раздел ""Администрирование""/""Настройка параметров учета""). '");
			Сообщение.Сообщить();
			 
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПараметрыДоговораЭквайринга) Тогда
			Объект.ФормаОплаты = 0;
			 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не заполнены параметры договора эквайринга для рабочего места.
			|В разделе ""Администрирование"" в ""Настройки параметров учета/Денежные средства/Оплата платежными картами (эквайринг)"" следует открыть 
			|настройку  ""Настройки ККТ и эквайринга для рабочих мест"", указать параметры договора эквайринга для рабочего места и сохранить.'");
			Сообщение.Сообщить();
			 
			Возврат;
		КонецЕсли;	
		
		ОплатаБылаНаличными = Ложь;
		Если ЗначениеЗаполнено(Объект.ЧекККМПродажа) Тогда
			ОплатаБылаНаличными = ?(ПолучитьФормуОплатыЧекаПродажи(Объект.ЧекККМПродажа)=0,Истина,Ложь);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не указан чек продажи. Если оплата была выполнена платежной картой, то укажите ""Номер платежной карты"",
			|""Номер чека ЭТ возврата"", ""Ссылочный номер возврата"" из слип-чека!'");
			Сообщение.Сообщить();
		КонецЕсли;	
		
		Если ОплатаБылаНаличными Тогда
			Объект.ФормаОплаты = 0;
			 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Оплата была выполнена наличными. Нельзя провести возврат оплаты на платежную карту!'");
			Сообщение.Сообщить();
			 
			Возврат;
		КонецЕсли
	Иначе
		ОплатаБылаПлатежнойКартой = Ложь;
		Если ЗначениеЗаполнено(Объект.ЧекККМПродажа) Тогда
			ОплатаБылаПлатежнойКартой = ?(ПолучитьФормуОплатыЧекаПродажи(Объект.ЧекККМПродажа)=1,Истина,Ложь);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Не указан чек продажи. Если оплата была выполнена платежной картой, то укажите ""Номер платежной карты"",
			|""Номер чека ЭТ возврата"", ""Ссылочный номер возврата"" из слип-чека!'");
			Сообщение.Сообщить();
		КонецЕсли;	
		
		Если ОплатаБылаПлатежнойКартой Тогда
			Объект.ФормаОплаты = 1;
			 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Оплата была выполнена платежной картой. Возврат оплаты наличными можно выполнить только через ""Расходный кассовый ордер""!
			|Для оформления возврата следует ввести на основании чека продажи документ ""Перечень номенклатуры прейскуранта для возврата""
			|и затем в документе ""Расходный кассовый ордер"" указать его в списке документов-оснований для чека ККМ.'");
			Сообщение.Сообщить();
			 
			Возврат;
		КонецЕсли
		
	КонецЕсли;	 
	
	Если Объект.ФормаОплаты = 1 Тогда
		Если СуммаОплатыНаличными > 0 Тогда
			СуммаОплатыПлатежнойКартой = СуммаОплатыНаличными;	
		Конецесли;	
		УстановитьНастройкиОплатыПлатежнойКартой();
	Иначе
		Если СуммаОплатыПлатежнойКартой > 0 Тогда
			СуммаОплатыНаличными = СуммаОплатыПлатежнойКартой;	
		Конецесли;	
		УстановитьНастройкиНаличнойОплаты();
	КонецЕсли;	
	УстановитьВидимостьЭлементовФормы();
	УстановитьКартинкиЭлементовФормы();
КонецПроцедуры

Функция ПолучитьФормуОплатыЧекаПродажи(ЧекПродажи)
	Результат = 0;
	
	СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЧекПродажи, "ФормаОплаты");
	
	Результат = СтруктураДанных.ФормаОплаты;
	
	Если Результат = 2 Тогда 
		Результат = 1;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура СуммаОплатыНаличнымиПриИзменении(Элемент)
	Объект.Оплата[0].Сумма = СуммаОплатыНаличными;
	РассчитатьИтогиОплаты();
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
КонецПроцедуры

&НаКлиенте
Процедура СуммаОплатыПлатежнойКартойПриИзменении(Элемент)
	Объект.Оплата[0].Сумма = СуммаОплатыПлатежнойКартой;
	ПересчитатьКомиссию(ЭтаФорма);
	УстановитьДанныеЭквайрингаНаСервере();
	РассчитатьИтогиОплаты();
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
КонецПроцедуры

&НаКлиенте
Процедура ПроцентКомиссииБанкаПриИзменении(Элемент)
	ПересчитатьКомиссию(ЭтаФорма);
	УстановитьДанныеЭквайрингаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаКомиссииБанкаПриИзменении(Элемент)
	УстановитьДанныеЭквайрингаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидПлатежнойКартыПриИзменении(Элемент)
	ВыбранноеЗначение = ВидПлатежнойКарты;
	
	ДанныеОВидеКартыИПроценте = ЭквайрингВызовСервера.ПолучитьДанныеВидаКартыДоговораЭквайринга(
		ПараметрыДоговораЭквайринга, ВыбранноеЗначение);
	Если ДанныеОВидеКартыИПроценте <> Неопределено Тогда
		ПроцентКомиссииБанка = ?(ЭтоВозвратДеньВДень(), (-1)*ДанныеОВидеКартыИПроценте.ПроцентТорговойУступки, 0);
		ПересчитатьКомиссию(ЭтаФорма);
	КонецЕсли;
	
	УстановитьДанныеЭквайрингаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОплатаВыполненаНажатие(Элемент)
	
	ДанныеБанковскойОперации = Новый Структура;
	ДанныеБанковскойОперации.Вставить("НомерПлатежнойКарты",Объект.Оплата[0].НомерПлатежнойКарты);
	ДанныеБанковскойОперации.Вставить("НомерЧекаЭТ",Объект.Оплата[0].НомерЧекаЭТ);
	ДанныеБанковскойОперации.Вставить("СсылочныйНомер",Объект.Оплата[0].СсылочныйНомер);
	ДанныеБанковскойОперации.Вставить("НомерЧекаККМ",Формат(Объект.НомерЧекаККМ,"ЧГ="));
	
	ОткрытьФорму("Документ.ЭквайринговаяОперация.Форма.ФормаДанныхБанковскойОперации",
		ДанныеБанковскойОперации, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоРозничныйПокупательПриИзменении(Элемент)
	ЭтоРозничныйПокупательПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПризнакСпособаРасчетаЧекаККМПриИзменении(Элемент)
	ПризнакСпособаРасчетаЧекаККМПриИзмененииНаСервере();
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыРаботыУслуги

&НаКлиенте
Процедура ТоварыРаботыУслугиКоличествоПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, Объект.СуммаВключаетНДС, "Количество");
	РассчитатьИтоги();
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиЦенаПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, Объект.СуммаВключаетНДС, "Цена");
	РассчитатьИтоги();	
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	Цена = ПолучитьЦенуНоменклатуры(ТекущиеДанные.Номенклатура, Объект.ТипЦены, Объект.Дата,
		Объект.Организация);
	ТекущиеДанные.Цена = Цена;
	КоличествоПоУмолчанию = 1;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(ТекущиеДанные.Номенклатура);
		ТекущиеДанные.СтавкаНДС = ДанныеНоменклатуры.СтавкаНДС;
		КоличествоПоУмолчанию = ДанныеНоменклатуры.Количество;
	КонецЕсли;
	
	РозничныеПродажиБГУКлиентСервер.ЗаполнитьКлючСвязи(Объект.ТоварыРаботыУслуги, ТекущиеДанные, "КлючСвязи");
	
	Если ТекущиеДанные.Количество = 0 Тогда
		ТекущиеДанные.Количество = КоличествоПоУмолчанию;
		
	КонецЕсли;
	
	Если ТекущиеДанные.Количество <> 0 Тогда
		РассчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, Объект.СуммаВключаетНДС, "Количество");
		РассчитатьИтоги();	
	КонецЕсли;
	
	ТекущиеДанные.МаркируемыйТовар = МаркируемыйТовар(ТекущиеДанные.ПолучитьИдентификатор());
	
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиСтавкаНДСПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДС");
	РассчитатьИтоги();
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиСуммаПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, Объект.СуммаВключаетНДС, "Сумма");
	РассчитатьИтоги();
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиСуммаНДСПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
	РассчитатьИтоги();
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	Если НоваяСтрока ИЛИ Копирование Тогда
		ТекущиеДанные.КлючСвязи = 0;
		РозничныеПродажиБГУКлиентСервер.ЗаполнитьКлючСвязи(Объект.ТоварыРаботыУслуги, ТекущиеДанные, "КлючСвязи");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиПослеУдаления(Элемент)
	ТоварыРаботыУслугиПослеУдаленияНаСервере();
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТоварыРаботыУслугиКодМаркировки" Тогда 
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда 
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("Номенклатура"				, ТекущиеДанные.Номенклатура);
			ПараметрыОткрытияФормы.Вставить("КодМаркировки"				, ТекущиеДанные.КодМаркировки);
			ПараметрыОткрытияФормы.Вставить("СессияПроверкиКМОткрыта"	, СессияПроверкиКМОткрыта);
			ПараметрыОткрытияФормы.Вставить("КассаККМ"					, Объект.КассаККМ);
			ПараметрыОткрытияФормы.Вставить("АдресДанныхПроверкиКМ"		, ТекущиеДанные.АдресДанныхПроверкиКМ);
			ПараметрыОткрытияФормы.Вставить("РезультатПроверкиКМ"		, ТекущиеДанные.РезультатПроверкиКМ);
			ПараметрыОткрытияФормы.Вставить("РежимПродажи"				, 1);
			Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВводаКодаМаркировкиЗавершение", ЭтотОбъект);
			ОткрытьФорму("ОбщаяФорма.ВводКодаМаркировки", ПараметрыОткрытияФормы, ЭтотОбъект,,,, ОбработчикОповещения, Режим);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасшифровкаОплаты

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаEmail(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаEmail", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Email", АдресЭлектроннойПочты);
	ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Введите адрес электронной почты (Email)'"));
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияEmail", ОтказПокупателяОтСохраненияДанных);
	
	ПодключаемоеОборудованиеБГУКлиент.ОткрытьФормуВводаEmailОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаSMS(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытиеФормыВводаТелефона", ЭтотОбъект, ДополнительныеПараметры);
	
	Если ЗначениеЗаполнено(АбонентскийНомерТелефона) Тогда
		ТелефонSMS = Число(АбонентскийНомерТелефона);
	Иначе
		ТелефонSMS = 0;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок" , НСтр("ru = 'Введите номер телефона'"));
	ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыФормы.Вставить("ЧислоВвода", ТелефонSMS);
	ПараметрыФормы.Вставить("ОтказКлиентаОтСохраненияТелефона", ОтказПокупателяОтСохраненияДанных);
	
	ПодключаемоеОборудованиеБГУКлиент.ОткрытьФормуВводаТелефонаДляОтправкиЧерезОФД(ОбработчикОповещения, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчиститьEmailИSMS(Команда)
	АдресЭлектроннойПочты = "";
	АбонентскийНомерТелефона = "";
	ДанныеSMSИлиEmail = "";
	ТелефонСтрокой = "";
	ОтказПокупателяОтСохраненияДанных = Истина;
	
	ОбновитьФормуSMSИEmail();
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧек(Команда)
	ПробитьЧекНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьПредставлениеЧека(Команда)
	ВывестиПредставлениеЧека();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуОплатыНаличнымиСтоимостьюТоваровРаботУслуг(Команда)
	
	СуммаОплатыНаличными = ИтогВсего;
	Объект.Оплата[0].Сумма = СуммаОплатыНаличными;
	
	РассчитатьИтогиОплаты();
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуОплатыПлатежнойКартойСтоимостьюТоваровРаботУслуг(Команда)
	СуммаОплатыПлатежнойКартой = ИтогВсего;
	Объект.Оплата[0].Сумма = СуммаОплатыПлатежнойКартой;
	
	ПересчитатьКомиссию(ЭтаФорма);
	УстановитьДанныеЭквайрингаНаСервере();
	
	РассчитатьИтогиОплаты();	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
КонецПроцедуры

&НаКлиенте
Процедура ОплатитьКартой(Команда)
	ЕстьОшибки = Ложь;
	
	ОчиститьСообщения();
	
	ЕстьОшибки = НЕ ПодключаемоеОборудованиеБГУКлиент.ПроверитьВозможностьПечатиЧека(ЭтотОбъект);
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;	
	
	Если ВсеРеквизитыДляЧекаЗаполнены() Тогда
		ВозвратНаКарту();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТоварыУслугиКромеОтмеченных(Команда)
	Если Объект.ФормаОплаты = 1 Тогда
		ТекстВопроса = НСтр("ru = 'Возврат оплаты платежной картой не предполагает частичный возврат. Отменить удаление строк?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Продолжить'"));
		
		Оповещение = Новый ОписаниеОповещения("УдалитьСтрокиТоваровУслугОбработатьОтвет", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		УдалитьТоварыУслугиКромеОтмеченныхНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	ИзменитьПометки(Неопределено);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	
	ПараметрыПредставления = Новый Структура("ТипЦены, ВалютаДокумента, СуммаВключаетНДС");
	ЗаполнитьЗначенияСвойств(ПараметрыПредставления, Объект);
	ПараметрыПредставления.Вставить("ПоказыватьТипЦены", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьНДС", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьВалюту", Форма.ИспользоватьВалютныйУчет);
	
	Форма.НадписьТипЦенНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт

	Если СуммаВключаетНДСДоИзменения <> Объект.СуммаВключаетНДС Тогда
		Для каждого ТекСтрока Из Объект.ТоварыРаботыУслуги Цикл
			РассчитатьСтроку(ТекСтрока, Объект.СуммаВключаетНДС, "Сумма");
			РассчитатьИтоги();	
		КонецЦикла;
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	Если ТипЦеныДоИзменения <> Объект.ТипЦены Тогда
		
		Если Объект.ТоварыРаботыУслуги.Количество() = 0 ИЛИ Не ЗначениеЗаполнено(Объект.ТипЦены) Тогда
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = НСтр("ru='Изменился тип цены.
							|Пересчитать цены в таблице документа?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, "Да, пересчитать цены");
		Кнопки.Добавить(КодВозвратаДиалога.Нет, "Нет, не пересчитывать цены");
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Не изменять тип цены");

		ПоказатьВопрос(Новый ОписаниеОповещения("ТипЦеныПриИзмененииЗавершение", ЭтотОбъект),
			ТекстВопроса, Кнопки, ,КодВозвратаДиалога.Отмена);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеДляПечатиЧековККМ(ИзмененаОрганизация = Ложь)
	Если НЕ ЗначениеЗаполнено(Объект.СистемаНалогообложенияЧекаККМ) ИЛИ ИзмененаОрганизация Тогда
		Объект.СистемаНалогообложенияЧекаККМ = ПодключаемоеОборудованиеБГУ.ВидСистемыНалогообложенияОрганизации(Объект.Организация, ТекущаяДатаСеанса());
	КонецЕсли;
	
	СписокВидовНалогообложения = ПодключаемоеОборудованиеБГУ.ПереченьСистемНалогообложенияОрганизации(Объект.Организация, ТекущаяДатаСеанса());
	Элементы.СистемаНалогообложенияЧекаККМ.СписокВыбора.ЗагрузитьЗначения(СписокВидовНалогообложения);
	Элементы.СистемаНалогообложенияЧекаККМ.РежимВыбораИзСписка = Истина;
	
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	НастройкиОборудования = ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьНастройкиОборудования(РабочееМесто, Объект.Организация);
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Объект.КассаККМ = НастройкиОборудования.ФискальныйРегистратор;
		
		Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
			СтруктураРеквизитов = Новый Структура;
			СтруктураРеквизитов.Вставить("СистемаНалогообложенияЧекаККМ", "");
			СтруктураРеквизитов.Вставить("СуммаВключаетНДС", "");
			СтруктураРеквизитов.Вставить("ТипЦены", "");
			СтруктураРеквизитов.Вставить("Подразделение", "");
			СтруктураРеквизитов.Вставить("ЗаполнятьПокупателяДляРозничныхПродаж", "");
			
			РеквизитыККТ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КассаККМ, СтруктураРеквизитов);
			
			Объект.СистемаНалогообложенияЧекаККМ = РеквизитыККТ.СистемаНалогообложенияЧекаККМ;
			Объект.Подразделение = РеквизитыККТ.Подразделение;
			Объект.ТипЦены = РеквизитыККТ.ТипЦены;
			Объект.СуммаВключаетНДС = РеквизитыККТ.СуммаВключаетНДС;
			
			Объект.ЭтоРозничныйПокупатель = НЕ РеквизитыККТ.ЗаполнятьПокупателяДляРозничныхПродаж;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
		Объект.КассоваяСмена = РозничныеПродажиБГУ.ТекущаяОткрытаяКассоваяСмена(Объект.Организация, Объект.КассаККМ);	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.ПараметрыДоговораПлатежногоАгента) Тогда
		Объект.ПараметрыДоговораПлатежногоАгента = НастройкиОборудования.ПараметрыДоговораПлатежногоАгента;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		ЭквайринговыйТерминал = НастройкиОборудования.ЭквайринговыйТерминал;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрыДоговораЭквайринга) Тогда
		ПараметрыДоговораЭквайринга = НастройкиОборудования.ПараметрыДоговораЭквайринга;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Если Объект.КассаККМ.ИспользоватьБезПодключенияОборудования Тогда
			ИспользоватьПодключаемоеОборудование = Ложь;
		Иначе
			ИспользоватьПодключаемоеОборудование = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипРасчета) Тогда
		Объект.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(Номенклатура, ТипЦены, Дата, Организация)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Номенклатура = &Номенклатура
	|				И ТипЦен = &ТипЦены) КАК ЦеныНоменклатурыСрезПоследних";
	Если ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура = &Номенклатура", "Номенклатура В (&Номенклатура)");
		Запрос.УстановитьПараметр("Номенклатура",	Номенклатура);
	Иначе
		Запрос.УстановитьПараметр("Номенклатура",	Номенклатура.Номенклатура);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТипЦены",		ТипЦены);
	Запрос.УстановитьПараметр("Период",			Дата);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Результат = Запрос.Выполнить();
	Если ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		Возврат Результат.Выгрузить();
	Иначе
		Если Результат.Пустой() Тогда
			Возврат 0;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
	КонецЕсли;

КонецФункции // ПолучитьЦенуНоменклатуры()

&НаСервере
Функция ПолучитьДанныеНоменклатуры(НоменклатураСсылка) 
	СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураСсылка.Номенклатура, "СтавкаНДС");
	СтруктураДанных.Вставить("Количество", НоменклатураСсылка.Количество);
	
	Возврат СтруктураДанных;
КонецФункции

&НаСервере
Процедура КассаККМПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("СистемаНалогообложенияЧекаККМ", "");
		СтруктураРеквизитов.Вставить("СуммаВключаетНДС", "");
		СтруктураРеквизитов.Вставить("ТипЦены", "");
		СтруктураРеквизитов.Вставить("Подразделение", "");
		
		РеквизитыККТ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КассаККМ, СтруктураРеквизитов);
		
		Объект.ТипЦены = РеквизитыККТ.ТипЦены;
		Объект.СуммаВключаетНДС = РеквизитыККТ.СуммаВключаетНДС;
		Объект.СистемаНалогообложенияЧекаККМ = РеквизитыККТ.СистемаНалогообложенияЧекаККМ;
		Объект.Подразделение = РеквизитыККТ.Подразделение;
		
		ВестиКонтрольОстатковТоваров = РозничныеПродажиБГУ.ВестиКонтрольОстатковТоваров(Объект.КассаККМ);
		Если ВестиКонтрольОстатковТоваров Тогда
			Объект.ПоступлениеТоваровНаСкладТорговойТочки = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	СписокВидовНалогообложения = ПодключаемоеОборудованиеБГУ.ПереченьСистемНалогообложенияОрганизации(Объект.Организация, ТекущаяДатаСеанса());
	Элементы.СистемаНалогообложенияЧекаККМ.СписокВыбора.ЗагрузитьЗначения(СписокВидовНалогообложения);
	Элементы.СистемаНалогообложенияЧекаККМ.РежимВыбораИзСписка = Истина;
	
	ИспользуетсяККТСПередачейДанных = ПодключаемоеОборудованиеБГУ.ИспользуетсяККТСПередачейДанных(Объект.КассаККМ);
	
	РозничнаяРеализацияМаркированныхТоваров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "РозничнаяРеализацияМаркированныхТоваров");
	УстановитьВидимостьУсловноеОформлениеМаркировка();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаEmail(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.Email) Тогда
			АдресЭлектроннойПочты = РезультатОткрытияФормы.Email;
			АбонентскийНомерТелефона = "";
			ТелефонСтрокой = "";
			ДанныеSMSИлиEmail = АдресЭлектроннойПочты;
			ОтказПокупателяОтСохраненияДанных = РезультатОткрытияФормы.ОтказКлиентаОтСохраненияEmail;
			
			ЗаписатьДополнительныеДанныеЧековККМ();
		Иначе
			АдресЭлектроннойПочты = "";
			АбонентскийНомерТелефона = "";
			ТелефонSMS = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьФормуSMSИEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытиеФормыВводаТелефона(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ЗначениеЗаполнено(РезультатОткрытияФормы.ВведенноеЧисло) Тогда
			ТелефонSMS = 0;
			ПодключаемоеОборудованиеБГУКлиент.ПреобразоватьТелефонКПользовательсткомуВиду(РезультатОткрытияФормы.ВведенноеЧисло, ТелефонSMS, ТелефонСтрокой);
			АбонентскийНомерТелефона = "7" + Формат(РезультатОткрытияФормы.ВведенноеЧисло, "ЧЦ=10; ЧДЦ=; ЧГ=0");
			АдресЭлектроннойПочты = "";
			ДанныеSMSИлиEmail = ТелефонСтрокой;
			ОтказПокупателяОтСохраненияДанных = РезультатОткрытияФормы.ОтказКлиентаОтСохраненияТелефона;
			
			ЗаписатьДополнительныеДанныеЧековККМ();
		Иначе
			АдресЭлектроннойПочты = "";
			АбонентскийНомерТелефона = "";
			ТелефонСтрокой = "";
			ТелефонSMS = 0;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьФормуSMSИEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуSMSИEmail()
	
	Если ЗначениеЗаполнено(ДанныеSMSИлиEmail) Тогда
		Если ОтказПокупателяОтСохраненияДанных Тогда
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.НеСохранять16;
		Иначе
			Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Сохранить16;
		КонецЕсли;
	Иначе
		Элементы.ДекорацияОтказКлиентаОтСохраненияТелефонаEmail.Картинка = БиблиотекаКартинок.Пустая;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоги()
	ИтогВсего = Объект.ТоварыРаботыУслуги.Итог("Всего");
	ИтогНДС   = Объект.ТоварыРаботыУслуги.Итог("СуммаНДС");
	
	Товары = Объект.ТоварыРаботыУслуги.Выгрузить();
	
	ПризнакиПредметаРасчетаТовары = РозничныеПродажиБГУ.ПризнакиПредметаРасчетаТовары();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыРаботыУслуги.КлючСвязи,
	               |	ТоварыРаботыУслуги.НомерСтроки,
	               |	ТоварыРаботыУслуги.Номенклатура,
	               |	ТоварыРаботыУслуги.СуммаНДС,
	               |	ТоварыРаботыУслуги.Всего
	               |ПОМЕСТИТЬ ТоварыРаботыУслуги
	               |ИЗ
	               |	&ТоварыРаботыУслуги КАК ТоварыРаботыУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыРаботыУслуги.НомерСтроки,
	               |	ТоварыРаботыУслуги.Номенклатура,
	               |	ВЫРАЗИТЬ(ТоварыРаботыУслуги.Номенклатура КАК Справочник.Прейскурант).Номенклатура КАК НоменклатураПрейскуранта,
	               |	ТоварыРаботыУслуги.СуммаНДС,
	               |	ТоварыРаботыУслуги.Всего
	               |ПОМЕСТИТЬ ИтоговаяТаблица
	               |ИЗ
	               |	ТоварыРаботыУслуги КАК ТоварыРаботыУслуги
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИтоговаяТаблица.НомерСтроки,
	               |	ИтоговаяТаблица.Номенклатура,
	               |	ИтоговаяТаблица.НоменклатураПрейскуранта,
	               |	ВЫРАЗИТЬ(ИтоговаяТаблица.НоменклатураПрейскуранта КАК Справочник.Номенклатура).ТипНоменклатуры КАК ПризнакПредметаРасчета,
	               |	ВЫБОР
	               |		КОГДА ВЫРАЗИТЬ(ИтоговаяТаблица.НоменклатураПрейскуранта КАК Справочник.Номенклатура).ТипНоменклатуры В (&ПризнакиПредметаРасчетаТовары)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК КодТипаНоменклатуры,
	               |	ИтоговаяТаблица.СуммаНДС,
	               |	ИтоговаяТаблица.Всего
	               |ИЗ
	               |	ИтоговаяТаблица КАК ИтоговаяТаблица";
				   
	Запрос.УстановитьПараметр("ТоварыРаботыУслуги", Товары);
	Запрос.УстановитьПараметр("ПризнакиПредметаРасчетаТовары", ПризнакиПредметаРасчетаТовары);
	Результат = Запрос.Выполнить().Выгрузить();
	
	УслугиИтогВсего = 0;
	УслугиИтогСуммаНДС = 0;
	ТоварыИтогВсего = 0;
	ТоварыИтогСуммаНДС = 0;
	
	Для каждого ТекСтрока Из Результат Цикл
		Если ТекСтрока.КодТипаНоменклатуры = 1 Тогда
			ТоварыИтогВсего = ТоварыИтогВсего + ТекСтрока.Всего;
			ТоварыИтогСуммаНДС = ТоварыИтогСуммаНДС + ТекСтрока.СуммаНДС;
		ИначеЕсли ТекСтрока.КодТипаНоменклатуры = 2 Тогда
			УслугиИтогВсего = УслугиИтогВсего + ТекСтрока.Всего;
			УслугиИтогСуммаНДС = УслугиИтогСуммаНДС + ТекСтрока.СуммаНДС;
		КонецЕсли;	
	КонецЦикла;	
	
	СуммаКОплате = УслугиИтогВсего;
	
	ИтогКоличествоВсего = Товары.Итог("Количество");
	
	РассчитатьСдачу();	
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСдачу()
	СуммаВсего = Объект.ТоварыРаботыУслуги.Итог("Всего");
	
	СуммаКОплате = СуммаВсего - СуммаОплачено;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ТипОплаты", Перечисления.ТипыОплатЧекаККМ.Наличные);
	
	СуммаНаличных  = 0;
	СтрокиНаличных = Объект.Оплата.НайтиСтроки(СтруктураПоиска);
	
	Для каждого СтрокаНаличных Из СтрокиНаличных Цикл
		СуммаНаличных = СуммаНаличных + СтрокаНаличных.Сумма;
	КонецЦикла;
	
	Сдача = Макс(Объект.Оплата.Итог("Сумма") - СуммаВсего, 0);
	Сдача = Мин(Сдача, СуммаНаличных);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиОплаты()

	ИтогОплатаВсего = Объект.Оплата.Итог("Сумма");
	ИтогОплатаНаличными = 0;
	ИтогОплатаЭлектронными = 0;
	
	Если Объект.ФормаОплаты = 1 Тогда
		ИтогОплатаЭлектронными = Объект.Оплата[0].Сумма;
	КонецЕсли;	
	
	ИтогОплатаНаличными = ИтогОплатаВсего - ИтогОплатаЭлектронными; 
	
	Объект.СуммаДокумента = ИтогОплатаВсего;
	
	СуммаОплачено = ИтогОплатаВсего;
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
	
	РассчитатьСдачу();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеЗаголовкаДанныеЧекаККМ(Форма, НомерЧекаККМ = 0)
	
	ТекстЗаголовкаДанныхЧека = "";
	
	Объект = Форма.Объект;
	
	ТекстЗаголовкаДанныхОплатыИЧека = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='%1 %2'"),
			Формат(Форма.ИтогОплатаВсего, "ЧЦ=15; ЧДЦ=2; ЧН=0"),
			Строка(Форма.ВалютаРубли));
			
	НомерЧекаККМ = ?(НомерЧекаККМ<>0, НомерЧекаККМ, Объект.НомерЧекаККМ);
			
	Если ЗначениеЗаполнено(НомерЧекаККМ) Тогда
		ИспользуетсяККТСПередачейДанных = Форма.ИспользуетсяККТСПередачейДанных;
		
		Если ИспользуетсяККТСПередачейДанных Тогда
			ТекстНомераЧека = НСтр("ru='ФД № '")+Формат(НомерЧекаККМ,"ЧГ=");
		Иначе	
			ТекстНомераЧека = НСтр("ru='чек № '")+Формат(НомерЧекаККМ,"ЧГ=");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.ЗаключительныйЧекИсправительный) Тогда
			ТекстНомераЧека = ТекстНомераЧека + " отменен";
		КонецЕсли;	
		
		Если НомерЧекаККМ<>0 Тогда
			ТекстЗаголовкаДанныхЧека = ТекстНомераЧека;
		КонецЕсли;	
		
		ТекстЗаголовкаДанныхОплатыИЧека = ТекстЗаголовкаДанныхОплатыИЧека + ", " + ТекстЗаголовкаДанныхЧека;
	КонецЕсли;
	
	Форма.ДанныеЗаголовкаОплата = ТекстЗаголовкаДанныхОплатыИЧека;
КонецПроцедуры
		
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(Форма)
	
	Объект = Форма.Объект;
	
	Форма.ДанныеЗаголовкаТоварыРаботыУслуги = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='%1 ед. на %2 %3'"),
			Строка(Форма.ИтогКоличествоВсего),
			Формат(Форма.ИтогВсего, "ЧЦ=15; ЧДЦ=2; ЧН=0"),
			Строка(Форма.ВалютаРубли));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопокПроведенияКлиент()
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ЗаполнятьКонтрагентаИДоговор = ЗаполнятьКонтрагентаИДоговор();
	
	ПоказыватьОплату = Истина;
	Если Объект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты Тогда
		ПоказыватьОплату = Ложь;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Контрагент", "Видимость", ЗаполнятьКонтрагентаИДоговор);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Договор", "Видимость", ЗаполнятьКонтрагентаИДоговор);
	
	ВидимостьКомандККТ = Ложь;
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Если ЗначениеЗаполнено(Объект.КассаККМ.ПодключаемоеОборудование) Тогда
			Если Объект.КассаККМ.ПодключаемоеОборудование.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
				ВидимостьКомандККТ = Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаEmail", 											"Видимость", ВидимостьКомандККТ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаSMS", 											"Видимость", ВидимостьКомандККТ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОтказКлиентаОтСохраненияТелефонаEmail", 		"Видимость", ВидимостьКомандККТ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеSMSИлиEmail", 									"Видимость", ВидимостьКомандККТ);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КомандаОчиститьEmailИSMS",								"Видимость", ВидимостьКомандККТ);
	
	ВидимостьРеквизитовЭквайринга = Объект.ФормаОплаты = 1;
	
	Если НЕ ИспользоватьОплатуПлатежнымиКартами Тогда
		ВидимостьРеквизитовЭквайринга = Ложь;
	КонецЕсли;	
	
	ОплатаВыполнена = Объект.Оплата[0].ДанныеПереданыВБанк;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаОплатаНаличными", "Видимость", НЕ ВидимостьРеквизитовЭквайринга И ПоказыватьОплату);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ГруппаОплатаПлатежнойКартой", "Видимость", ВидимостьРеквизитовЭквайринга И ПоказыватьОплату);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ФормаОплатитьКартой", "Видимость", ВидимостьРеквизитовЭквайринга И НЕ ОплатаВыполнена И ПоказыватьОплату);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтраницыСтатусОперации", "Видимость", ВидимостьРеквизитовЭквайринга И ПоказыватьОплату);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаФормаОплаты", "Видимость", ПоказыватьОплату);
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	СтатусЧекаККМПробит = ?(НомерКассовогоЧека<>0, Истина, Ложь);
	
	ВидимостьКнопкиПечатьЧекаККМ = Истина;
	ЕстьЗаключительныйЧекИсправительный = Ложь;
	
	Если СтатусЧекаККМПробит Тогда
		ЗаключительныйЧекИсправительный = ПодключаемоеОборудованиеБГУ.ЗаключительныйЧекИсправительный(Объект.Ссылка);
		Если ЗначениеЗаполнено(ЗаключительныйЧекИсправительный) Тогда
			ВидимостьКнопкиПечатьЧекаККМ = Истина;
			ЕстьЗаключительныйЧекИсправительный = Истина;
		Иначе
			ВидимостьКнопкиПечатьЧекаККМ = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаключительныйЧекИсправительный", 		"Видимость", ЕстьЗаключительныйЧекИсправительный);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсправительныйЧекККМ", 		"Видимость", НЕ ЕстьЗаключительныйЧекИсправительный);
	
	Если ВидимостьРеквизитовЭквайринга Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ФормаНапечататьЧек", "Видимость", ВидимостьКнопкиПечатьЧекаККМ И ОплатаВыполнена);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаНапечататьЧек", 
			"Видимость", ВидимостьКнопкиПечатьЧекаККМ);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПоступлениеТоваровНаСкладТорговойТочки", "Видимость", ВестиКонтрольОстатковТоваров);    
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторКорзины) Тогда 
		Если Объект.ФормаОплаты = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаОплатыСертификатамиНаличные", 
				"Видимость", Истина);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаОплатыСертификатамиКарта", 
				"Видимость", Ложь);	
		Иначе 
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаОплатыСертификатамиНаличные", 
				"Видимость", Ложь);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаОплатыСертификатамиКарта", 
				"Видимость", Истина);
		КонецЕсли;
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаОплатыСертификатамиНаличные", 
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаОплатыСертификатамиКарта", 
			"Видимость", Ложь);
	КонецЕсли;
			
КонецПроцедуры // УстановитьВидимостьЭлементовФормы()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭквайринга(Форма, НомерКассовогоЧека)
	
	Объект = Форма.Объект;
	ИспользоватьОплатуПлатежнымиКартами = Форма.ИспользоватьОплатуПлатежнымиКартами;
	ВидимостьРеквизитовЭквайринга = Объект.ФормаОплаты = 1;
	
	Если НЕ ИспользоватьОплатуПлатежнымиКартами Тогда
		ВидимостьРеквизитовЭквайринга = Ложь;
	КонецЕсли;	
	
	ОплатаВыполнена = Объект.Оплата[0].ДанныеПереданыВБанк;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ФормаОплатитьКартой", "Видимость", (НЕ ОплатаВыполнена) И (НЕ Объект.Проведен) И ВидимостьРеквизитовЭквайринга);
	
	СтатусЧекаККМПробит = ?(НомерКассовогоЧека<>0, Истина, Ложь);
	
	Если ВидимостьРеквизитовЭквайринга Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ФормаНапечататьЧек", "Видимость", НЕ СтатусЧекаККМПробит И ОплатаВыполнена);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ФормаНапечататьЧек", "Видимость", НЕ СтатусЧекаККМПробит);
	КонецЕсли;	
		
	Если ОплатаВыполнена Тогда
		Форма.Элементы.СтраницыСтатусОперации.ТекущаяСтраница = Форма.Элементы.СтраницаОперацияПроизведена;
	Иначе
		Форма.Элементы.СтраницыСтатусОперации.ТекущаяСтраница = Форма.Элементы.СтраницаОперацияНеПроизведена;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинкиЭлементовФормы()
	Если Объект.ФормаОплаты = 1 Тогда
		Элементы.ГруппаОплата.Картинка = БиблиотекаКартинок.ПлатежнаяКарта
	Иначе	
		Элементы.ГруппаОплата.Картинка = БиблиотекаКартинок.Наличные;
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ДействияСКонтактнымиДаннымиДляЧекаККМ()
	ЗаписатьДополнительныеДанныеЧековККМ();
	
	Если НЕ ОтказПокупателяОтСохраненияДанных Тогда
		Если ЗначениеЗаполнено(АбонентскийНомерТелефона) Тогда
			ПодключаемоеОборудованиеБГУ.ЗаписатьТелефонКонтрагента(Объект.Контрагент, АбонентскийНомерТелефона);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
			ПодключаемоеОборудованиеБГУ.ЗаписатьEmailКонтрагента(Объект.Контрагент, АдресЭлектроннойПочты);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)
	Объект = Форма.Объект;
	
	ДоступностьДоговора = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "Договор", "Доступность", ДоступностьДоговора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиНаличнойОплаты()
	ТекущаяОплата = Объект.Оплата[0];
	
	ТекущаяОплата.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.Наличные;
	
	ТекущаяОплата.ЭквайринговыйТерминал = "";
	ТекущаяОплата.ПараметрыДоговораЭквайринга = "";
	ТекущаяОплата.ВидПлатежнойКарты = "";
	ТекущаяОплата.ПроцентКомиссии = 0;
	ТекущаяОплата.СуммаКомиссии = 0;
	ТекущаяОплата.СсылочныйНомер = "";
	ТекущаяОплата.НомерЧекаЭТ = "";
	ТекущаяОплата.НомерПлатежнойКарты = "";
	ТекущаяОплата.ДанныеПереданыВБанк = Ложь;
	
	ТекущаяОплата.КлючСвязиОплаты = 1;
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиОплатыПлатежнойКартой()
	ТекущаяОплата = Объект.Оплата[0];
	
	ТекущаяОплата.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта;
		
	ТекущаяОплата.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
	ТекущаяОплата.ПараметрыДоговораЭквайринга = ПараметрыДоговораЭквайринга;
	ТекущаяОплата.ПроцентКомиссии = 0;
	ТекущаяОплата.СуммаКомиссии = 0;
	ТекущаяОплата.СсылочныйНомер = "";
	ТекущаяОплата.НомерЧекаЭТ = "";
	ТекущаяОплата.НомерПлатежнойКарты = "";
	ТекущаяОплата.ДанныеПереданыВБанк = Ложь;
	
	ТекущаяОплата.КлючСвязиОплаты = 1;
	
	Элементы.ВидПлатежнойКарты.СписокВыбора.Очистить();
	Элементы.ВидПлатежнойКарты.СписокВыбора.ЗагрузитьЗначения(
		ЭквайрингВызовСервера.ПолучитьМассивВидовПлатежныхКарт(ПараметрыДоговораЭквайринга));
	Элементы.ЭквайринговыйТерминал.СписокВыбора.ЗагрузитьЗначения(
		ЭквайрингВызовСервера.ПолучитьМассивТерминалов(ПараметрыДоговораЭквайринга));
		
	ДанныеОВидеКартыИПроценте = ЭквайрингВызовСервера.ПолучитьДанныеВидаКартыДоговораЭквайринга(
		ПараметрыДоговораЭквайринга, ВидПлатежнойКарты);
	Если ДанныеОВидеКартыИПроценте = Неопределено Тогда
		ТекстСообщения = "ru='Данные о виде платежной карты не определены! Следует указать вид платежной карты 
		|или определить основной вид платежной карты для параметров договора эквайринга для заполнения.'";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр(ТекстСообщения));
		РезультатПроверки = Ложь;
		
		Возврат;
	КонецЕсли;		
		
	ВидПлатежнойКарты = ДанныеОВидеКартыИПроценте.ВидПлатежнойКарты;
	
	ТекущаяОплата.ВидПлатежнойКарты = ВидПлатежнойКарты;
	ПроцентКомиссииБанка = ДанныеОВидеКартыИПроценте.ПроцентТорговойУступки;	
	ТекущаяОплата.ПроцентКомиссии = ПроцентКомиссииБанка;
	
	НДССКомиссииСверху = ДанныеОВидеКартыИПроценте.НДССКомиссииСверху;
	СтавкаНДССКомиссии = УчетНДСКлиентСервер.ПолучитьМножительСтавки(ДанныеОВидеКартыИПроценте.СтавкаНДССКомисии, Не НДССКомиссииСверху);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеЭквайрингаНаСервере()
	
	ТекущаяОплата = Объект.Оплата[0];
	
	Если Объект.ФормаОплаты = 1 Тогда
		ТекущаяОплата.Сумма = СуммаОплатыПлатежнойКартой;
		ТекущаяОплата.ЭквайринговыйТерминал = ЭквайринговыйТерминал;
		ТекущаяОплата.ПараметрыДоговораЭквайринга = ПараметрыДоговораЭквайринга;
		ТекущаяОплата.ПроцентКомиссии = ПроцентКомиссииБанка;
		ТекущаяОплата.СуммаКомиссии = СуммаКомиссииБанка;
		ТекущаяОплата.ВидПлатежнойКарты = ВидПлатежнойКарты;
		ТекущаяОплата.СсылочныйНомерВозврата = СсылочныйНомерВозврата;
		ТекущаяОплата.НомерЧекаЭТВозврата = НомерЧекаЭТВозврата;
		ТекущаяОплата.НомерПлатежнойКарты = НомерПлатежнойКарты;
	Иначе
		ТекущаяОплата.Сумма = СуммаОплатыНаличными;
		ТекущаяОплата.ЭквайринговыйТерминал = "";
		ТекущаяОплата.ПараметрыДоговораЭквайринга = "";
		ТекущаяОплата.ПроцентКомиссии = 0;
		ТекущаяОплата.СуммаКомиссии = 0;
		ТекущаяОплата.ВидПлатежнойКарты = "";
		ТекущаяОплата.СсылочныйНомерВозврата = СсылочныйНомерВозврата;
		ТекущаяОплата.НомерЧекаЭТВозврата = НомерЧекаЭТВозврата;
		ТекущаяОплата.НомерПлатежнойКарты = НомерПлатежнойКарты;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьКомиссию(Форма)
	
	Объект = Форма.Объект;
	
	Форма.СуммаКомиссииБанка = Форма.СуммаОплатыПлатежнойКартой * Форма.ПроцентКомиссииБанка / 100; 
	
	Если Форма.НДССКомиссииСверху Тогда 
		Форма.СуммаКомиссииБанка = Форма.СуммаКомиссииБанка + (Форма.СуммаКомиссииБанка * Форма.СтавкаНДССКомиссии)	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФункциональныеОпцииФормы()
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	ИспользоватьОплатуПлатежнымиКартами = ПолучитьФункциональнуюОпцию("ИспользоватьОплатуПлатежнымиКартами");
	
КонецПроцедуры

&НаКлиенте
Процедура ЭквайринговыйТерминалПриИзменении(Элемент)
	УстановитьДанныеЭквайрингаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыДоговораЭквайрингаПриИзменении(Элемент)
	УстановитьДанныеЭквайрингаНаСервере();
КонецПроцедуры

#Область ОплатаКартой

&НаКлиенте
Процедура ВозвратНаКарту()
	ТекущаяОплата = Объект.Оплата[0];

	Если НЕ ТекущаяОплата.ДанныеПереданыВБанк Тогда
		
		Если ЭтоВозвратДеньВДень() Тогда
			// Передача данных в банк
			УдалитьОплатуКартой(ТекущаяОплата);
		Иначе
			ТекстСообщения = НСтр("ru = 'Чек на возврат можно ввести только для чека на продажу по текущей кассовой смене!
			|Для оформления возврата денежных средств прошлых кассовых смен следует ввести документ ""Заявление на возврат по чеку ККМ"" на основании чека продажи
			|и использовать документ ""Расходный кассовый ордер"" или ""Эквайринговая операция"", в котором указать документ ""Заявление на возврат по чеку ККМ""
			|как документ-основание номенклатуры чека.'");
			Возврат;
		КонецЕсли;
	Иначе
		СтрокаСообщения = НСтр("ru = 'Данные об отмене/возврате оплаты в банк уже переданы.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтрокаСообщения,
		,
		
		);
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьОплатуКартой(ТекущиеДанные)
	
	ИдентификаторУстройстваЭТ = Неопределено;
	ИдентификаторУстройстваФР = Неопределено;
	
	СуммаОперации       = ТекущиеДанные.Сумма;
	НомерКарты          = ТекущиеДанные.НомерПлатежнойКарты;
	НомерСсылкиОперации = ТекущиеДанные.СсылочныйНомерВозврата;
	НомерЧекаЭТ         = ТекущиеДанные.НомерЧекаЭТВозврата;
	СтрокаСлипЧека      = "";
		
	СтруктураЭквайринговыйТерминал = СтруктураДанныхЭТ(ТекущиеДанные.ЭквайринговыйТерминал);
	ИдентификаторУстройстваЭТ = СтруктураЭквайринговыйТерминал.ПодключаемоеОборудование;
	
	ПараметрыКассыККМ = ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьПараметрыКассыККМ(Объект.КассаККМ);
	ИдентификаторУстройстваФР  = ПараметрыКассыККМ.ИдентификаторУстройства;
	Если НЕ ИспользоватьПодключаемоеОборудование Тогда
		ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования = Истина;
		СтруктураЭквайринговыйТерминал.ИспользоватьБезПодключенияОборудования = Истина;
	КонецЕсли;
	
	ИспользоватьКассуККМБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	ИспользоватьБезПодключенияОборудованияЭТ = СтруктураЭквайринговыйТерминал.ИспользоватьБезПодключенияОборудования;
	
	ПараметрДействия = Новый Структура;
	ПараметрДействия.Вставить("ИспользоватьКассуККМБезПодключенияОборудования", ИспользоватьКассуККМБезПодключенияОборудования);
	ПараметрДействия.Вставить("ИдентификаторУстройстваФР", ИдентификаторУстройстваФР);
	ПараметрДействия.Вставить("ИспользоватьБезПодключенияОборудованияЭТ", ИспользоватьБезПодключенияОборудованияЭТ);
	ПараметрДействия.Вставить("ИдентификаторУстройстваЭТ", ИдентификаторУстройстваЭТ);
	ПараметрДействия.Вставить("ТекстОписаниеОшибки", "");
	ПараметрДействия.Вставить("СтрокаСлипЧека", СтрокаСлипЧека);
	ПараметрДействия.Вставить("ВыбраннаяСтрокаИдентификатор", ТекущиеДанные.ПолучитьИдентификатор());
	ПараметрДействия.Вставить("СуммаОперации", СуммаОперации);
	ПараметрДействия.Вставить("НомерСсылкиОперации", НомерСсылкиОперации);
	ПараметрДействия.Вставить("НомерЧекаЭТ", НомерЧекаЭТ);
	
	Если НЕ ИспользоватьБезПодключенияОборудованияЭТ Тогда
		
		ЭтотОбъект.Доступность = Ложь;
			
		ПараметрыОперации = ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ПараметрыОперации.ТипТранзакции  = "AuthorizeVoid";
		ПараметрыОперации.СуммаОперации  = СуммаОперации;
		ПараметрыОперации.НомерКарты     = НомерКарты;
		ПараметрыОперации.НомерЧекаЭТ    = НомерЧекаЭТ;
		ПараметрыОперации.СсылочныйНомер = НомерСсылкиОперации;
		
		Оповещение = Новый ОписаниеОповещения("УдалитьОплатуКартойЗавершение", ЭтотОбъект, ПараметрДействия);
		ОборудованиеПлатежныеСистемыКлиент.НачатьВыполнениеОперацииНаЭквайринговомТерминале(Оповещение, УникальныйИдентификатор, 
			ПараметрДействия.ИдентификаторУстройстваЭТ, ПараметрыОперации,,ПараметрДействия.ИдентификаторУстройстваФР);
	
	Иначе
		
		ТекстВопроса = НСтр("ru = 'Требуется выполнить операцию отмены оплаты на эквайринговом терминале.'") + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Сумма операции:'")        + " "+ СуммаОперации         + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Номер карты:'")           + " "+ НомерКарты            + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Ссылочный номер:'")       + " "+ НомерСсылкиОперации   + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Номер чека:'")            + " "+ НомерЧекаЭТ           + Символы.ПС;
		ТекстВопроса = ТекстВопроса + Символы.ПС;
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Операция отмены оплаты на эквайринговом терминале прошла успешно?'");
		
		ДополнительныеПараметры = Новый Структура; 
		ДополнительныеПараметры.Вставить("ПараметрДействия", ПараметрДействия);
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВопросУспешностиОтменыОперацииНаЭТ", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОбработчикОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеВопросУспешностиОтменыОперацииНаЭТ(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	РезультатОперации = (РезультатВопроса = КодВозвратаДиалога.Да);
	
	Если НЕ РезультатОперации Тогда
		ТекстСообщения = НСтр("ru = 'Операция отменена'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	ЗавершитьОтменуОплатыПлатежнойКартойЧерезЭквайринговыйТерминал(РезультатОперации, ДополнительныеПараметры.ПараметрДействия);
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Функция СтруктураДанныхЭТ(Терминал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭквайринговыеТерминалы.ПодключаемоеОборудование,
	|	ЭквайринговыеТерминалы.ИспользоватьБезПодключенияОборудования,
	|	ЭквайринговыеТерминалы.Ссылка
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	ЭквайринговыеТерминалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Терминал);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СтруктураВозврата = Новый Структура("ПодключаемоеОборудование, ИспользоватьБезПодключенияОборудования");
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	Иначе
		СтруктураВозврата = Неопределено; 
		СтруктураВозврата.ИспользоватьБезПодключенияОборудования = Истина;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура УдалитьОплатуКартойЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтотОбъект.Доступность = Истина;
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Оплата по карте не была произведена.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		ЗавершитьОтменуОплатыПлатежнойКартойЧерезЭквайринговыйТерминал(Истина, Параметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьОплатуКартойЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтотОбъект.Доступность = Истина;
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении операции возникла ошибка:
			|""%ОписаниеОшибки%"".
			|Возврат оплаты по карте не был произведен.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе
		
		ЗавершитьВозвратОплатыПлатежнойКартойЧерезЭквайринговыйТерминал(Истина, Параметры);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОтменуОплатыПлатежнойКартойЧерезЭквайринговыйТерминал(РезультатОперации, ПараметрДействия)
	
	Если РезультатОперации Тогда
		
		ЗавершитьОплатуКартой(ПараметрДействия);
		
	КонецЕсли;
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВозвратОплатыПлатежнойКартойЧерезЭквайринговыйТерминал(РезультатОперации, ПараметрДействия)
	
	Если РезультатОперации Тогда
		
		ЗавершитьОплатуКартой(ПараметрДействия);
		
	КонецЕсли;
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьОплатуКартой(ПараметрДействия)
	
	Объект.Оплата[0].СсылочныйНомер = ПараметрДействия.НомерСсылкиОперации;
	Объект.Оплата[0].НомерЧекаЭТ = ПараметрДействия.НомерЧекаЭТ;
	Объект.Оплата[0].ДанныеПереданыВБанк = Истина;
	
	ИспользоватьБезПодключенияОборудованияФР = РаботаБезПодключенияФР(Объект.КассаККМ);
		
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	РезультатЗаписи = Записать(ПараметрыЗаписи);
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	
	Если РезультатЗаписи = Истина Тогда
		Если НомерКассовогоЧека = 0 Тогда
			ПробитьЧекНаКлиенте();
		КонецЕсли;
	КонецЕсли;
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	УстановитьВидимостьЭлементовЭквайринга(ЭтотОбъект, НомерКассовогоЧека);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РаботаБезПодключенияФР(ОбъектКасса)
	
	Если ЗначениеЗаполнено(ОбъектКасса) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектКасса, "ИспользоватьБезПодключенияОборудования");
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

&НаСервере
Функция ЗаполнятьКонтрагентаИДоговор()
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КассаККМ, "ЗаполнятьКонтрагентаИДоговорДляРозничногоПокупателя");
		ЗаполнятьКонтрагентаИДоговорДляРозничногоПокупателя = ЗначенияРеквизитов.ЗаполнятьКонтрагентаИДоговорДляРозничногоПокупателя;
	Иначе
		ЗаполнятьКонтрагентаИДоговорДляРозничногоПокупателя = Ложь;
	КонецЕсли;	
	
	Если Объект.ЭтоРозничныйПокупатель Тогда
		Если ЗаполнятьКонтрагентаИДоговорДляРозничногоПокупателя Тогда
			ЗаполнятьКонтрагентаИДоговор = Истина;
		Иначе
			ЗаполнятьКонтрагентаИДоговор = Ложь;
		КонецЕсли;	
	Иначе	
		ЗаполнятьКонтрагентаИДоговор = Истина;
	КонецЕсли;
	
	Возврат ЗаполнятьКонтрагентаИДоговор;
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ФискальныеОперации

&НаКлиенте
Процедура ПробитьЧекВыполнить(ОповещениеПриЗавершении)
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	
	Если НомерКассовогоЧека <> 0 Тогда
		ЗаключительныйЧекИсправительный = ЗаключительныйЧекИсправительный();
		
		Если НЕ ЗначениеЗаполнено(ЗаключительныйЧекИсправительный) Тогда
			ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Ложь);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПодключаемоеОборудованиеБГУКлиент.ЗаполнитьНомерДокументаКассыККМ(Объект.КассаККМ);
	НомерДокументаКассыККМ = ПараметрыПриложения["ПодключаемоеОборудование.НомерДокументаКассыККМ"];
	ПорядковыйНомерПродажи = НомерДокументаКассыККМ[Объект.КассаККМ];
	
	ПараметрыКассыККМ         = ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьПараметрыКассыККМ(Объект.КассаККМ);
	ИдентификаторУстройстваФР = ПараметрыКассыККМ.ИдентификаторУстройства;
	
	ИспользоватьКассуККМБезПодключенияОборудования = ПараметрыКассыККМ.ИспользоватьБезПодключенияОборудования;
	
	Если ИспользоватьКассуККМБезПодключенияОборудования Тогда
		
		ИспользоватьБезПримененияККТ = ПараметрыКассыККМ.ИспользоватьБезПримененияККТ;
		Если ИспользоватьБезПримененияККТ Тогда
			ЗаписатьФискальныеДанныеДляРасчетногоДокумента(ПорядковыйНомерПродажи);
			
			НомерДокументаКассыККМ[Объект.КассаККМ] = ПорядковыйНомерПродажи +	1;
				
			Подключаемый_ВыполнитьКоманду(ЭтотОбъект.Команды.Найти("ПодменюПечатьОбычное__РасчетныйДокументБезККТ"));
			
			ЭтотОбъект.Доступность = Истина;
			НомерКассовогоЧека = НомерЧекаДляДокумента();
			ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
			УстановитьВидимостьЭлементовФормы();
		Иначе
			ТекстСообщения = НСтр("ru = 'Для включения возможности печати расчетных документов следует включить 
			|флажок ""Использовать для печати расчетных документов без применения ККТ"" 
			|у кассы, которая указана в реквизите ""Касса ККМ"".'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Ложь);
		КонецЕсли;	
		
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторУстройстваФР <> Неопределено Тогда
		
		ПроверитьКодыМаркировки(ИдентификаторУстройстваФР);
		
		ЭтотОбъект.Доступность = Ложь;

		// Готовим данные
		НомерЧека = ПорядковыйНомерПродажи;
		ОбщиеПараметры    = ПодготовитьДанныеДляПробитияЧека(НомерЧека);
		
		Контекст = Новый Структура();
		Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
		
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекВыполнитьЗавершение", ЭтотОбъект, Контекст);
		
		ДополнительныеПараметры = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации();
   		ДополнительныеПараметры.ОповещениеПослеОткрытииЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОткрытияЧека", ЭтотОбъект, Контекст);
    	ДополнительныеПараметры.ОповещениеПриОшибкеПечатиЧека = Новый ОписаниеОповещения("ПечатьЧека_ПослеОшибкиПечатиЧека", ЭтотОбъект, Контекст);
				
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьФискализациюЧекаНаФискальномУстройстве(Оповещение, 
										УникальныйИдентификатор, 
										ИдентификаторУстройстваФР,
										ОбщиеПараметры, 
										ДополнительныеПараметры);
			
	Иначе
		ТекстСообщения = НСтр("ru = 'Устройство для печати чеков не выбрано.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	
	Если ПараметрыВыполнения.НомерСмены <> 0 Тогда
		ШапкаЧека.НомерСменыККТ = ПараметрыВыполнения.НомерСмены;
	КонецЕсли;
	
	Если ПараметрыВыполнения.НомерЧека <> 0 Тогда
		ШапкаЧека.НомерЧекаККТ = ПараметрыВыполнения.НомерЧека;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПродолжения, ПараметрыВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ШапкаЧека = ПараметрыВыполнения.ВходныеПараметры;
	ШапкаЧека.НомерЧекаККТ = ШапкаЧека.НомерЧекаККТ + 1000000;
	
	Если ШапкаЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств") Тогда
		ШапкаЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");
	Иначе
		ШапкаЧека.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств");
	КонецЕсли;
	
КонецПроцедуры

// Процедура вызывается при нажатии кнопки "НапечататьЧек" командной панели.
//
&НаКлиенте
Процедура ПробитьЧекНаКлиенте()
	
	Результат = Ложь;
	ЕстьОшибки = Ложь;
	
	ОчиститьСообщения();
	
	ЕстьОшибки = НЕ ПодключаемоеОборудованиеБГУКлиент.ПроверитьВозможностьПечатиЧека(ЭтотОбъект);
	
	Если НЕ ВсеРеквизитыДляЧекаЗаполнены() Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЕстьОшибки И ПроверитьЗаполнение() Тогда
		ПробитьЧекСПроверкойСтавокНДС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекНаКлиентеЗавершение(ЧекПробит, Параметры) Экспорт
	
	ЭтотОбъект.Доступность = Истина;
	
	Если ЧекПробит Тогда
		ТолькоПросмотр = Истина;
		УстановитьДоступностьКнопокПроведенияКлиент();
	КонецЕсли;
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	
	ЗаключительныйЧекИсправительный = ЗаключительныйЧекИсправительный();
	
	УстановитьВидимостьЭлементовЭквайринга(ЭтаФорма, НомерКассовогоЧека);
	УстановитьВидимостьПриИсправленииЧека();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ЭтотОбъект.Доступность = Истина;
	
	Если НЕ РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
		                            |Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, Ложь);
	КонецЕсли;
	
	НомерКассовогоЧека  = НомерЧекаДляДокумента();
	УстановитьВидимостьЭлементовЭквайринга(ЭтаФорма, НомерКассовогоЧека);
	УстановитьВидимостьПриИсправленииЧека();
	ОбновитьДанныеЗаголовкаДанныеЧекаККМ(ЭтаФорма, НомерКассовогоЧека);
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляПробитияЧека(НомерЧека)
	
	ОбщиеПараметры  = ПодключаемоеОборудованиеБГУ.ПодготовитьДанныеДляПробитияЧека(Объект, Объект.Ссылка, НомерЧека);
	
	Возврат ОбщиеПараметры;
КонецФункции

&НаСервере
Функция ЕстьЧекНепримененияККТ()
	Результат = Ложь;
	
	ЧекНепримененияККТ = ПодключаемоеОборудованиеБГУ.ИсправительныйЧекККМОперацииНепримененияККТ(Объект.Ссылка);
	Если ЗначениеЗаполнено(ЧекНепримененияККТ) Тогда
		ТекстСообщения = НСтр("ru = 'Кассовый чек не может быть напечатан. Для документа %1 
		|введен документ ""Исправительный чек ККМ"" с видом операции ""Неприменение ККТ""!
		|Документ %2 можно открыть через ""Связанные документы"" меню навигации.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Объект.Ссылка, ЧекНепримененияККТ);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , );
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ВсеРеквизитыДляЧекаЗаполнены(ПросмотрЧека = Ложь)
	Результат = Истина;
	
	Если НЕ ПросмотрЧека Тогда
		ЕстьЧекНепримененияККТ = ЕстьЧекНепримененияККТ();
		Если ЕстьЧекНепримененияККТ Тогда
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит ""Касса ККМ""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КассаККМ");
			
		Возврат Ложь;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит ""Ответственный""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Ответственный");
		
		Результат = Ложь;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.Ответственный.ФизическоеЛицо) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит ""Физическое лицо"" у реквизита ""Ответственный""!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Ответственный");
			
			Результат = Ложь;
		Иначе
			КассирККМ = Объект.Ответственный.ФизическоеЛицо;
			Если НЕ Объект.КассаККМ.НеПроверятьИННКассира Тогда
				Если СтрДлина(КассирККМ.ИНН)<12 Тогда
					ТекстСообщения = НСтр("ru = 'Не заполнен ИНН у реквизита ""Физическое лицо"" реквизита ""Ответственный""!'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Ответственный");
					
					Результат = Ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.СистемаНалогообложенияЧекаККМ) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит ""Система налогообложения""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.СистемаНалогообложенияЧекаККМ");
		
		Результат = Ложь;	
	КонецЕсли;
	
	Если НЕ Объект.КассаККМ.ИспользоватьБезПодключенияОборудования Тогда
		Если НЕ ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнен реквизит ""Кассовая смена""!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КассоваяСмена");
			
			Результат = Ложь;	
		Иначе
			Если НЕ (Объект.КассоваяСмена.КассаККМ = Объект.КассаККМ) Тогда
				ТекстСообщения = НСтр("ru = 'Касса ККМ документа ""Кассовая смена"" не соответствует реквизиту ""Касса ККМ""!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КассоваяСмена");
				
				Результат = Ложь;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипРасчета) Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен реквизит ""Тип расчета""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ТипРасчета");
		
		Результат = Ложь;	
	КонецЕсли;
	
	СтавкаДокумента = ПодключаемоеОборудованиеБГУ.ЕдиныеСтавкиВДокументеОснованииЧекаККМ(Объект.Ссылка);
	СуммаВсего = СтавкаДокумента.Всего;
	Если СуммаВсего <> Объект.СуммаДокумента Тогда
		Если НЕ(Объект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПередачаБезОплаты) Тогда
			ТекстСообщения = НСтр("ru = 'Сумма оплаты не равна итоговой сумме товаров, работ, услуг! Следует использовать команду ""Заполнить"" справа от суммы оплаты'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	ТаблицаНоменклатуры = ПодключаемоеОборудованиеБГУ.ТаблицаНоменклатурыЧекаККМ(Объект.Ссылка);
	ЕстьПустыеНаименованияТоваровУслуг = Ложь;
	ЕстьПустыеПредметыРасчетаТоваровУслуг = Ложь;
	НомераСтрокПустыхНаименований = "";
	НомераСтрокПустыхПредметовРасчета = "";
	Для каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
		Если Не ЗначениеЗаполнено(ТекСтрока.Наименование) Тогда
			ЕстьПустыеНаименованияТоваровУслуг = Истина;
			НомераСтрокПустыхНаименований = НомераСтрокПустыхНаименований + СокрЛП(ТекСтрока.НомерСтроки)+", ";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ТекСтрока.ПризнакПредметаРасчета) Тогда
			ЕстьПустыеПредметыРасчетаТоваровУслуг = Истина;
			НомераСтрокПустыхПредметовРасчета = НомераСтрокПустыхПредметовРасчета + СокрЛП(ТекСтрока.НомерСтроки)+", ";
		КонецЕсли;
	КонецЦикла;	
	
	Если ЕстьПустыеНаименованияТоваровУслуг Тогда
		НомераСтрокПустыхНаименований = Сред(НомераСтрокПустыхНаименований, 0, СтрДлина(НомераСтрокПустыхНаименований)-2);
		Если НомераСтрокПустыхНаименований = "1" Тогда
			ТекстСообщения = НСтр("ru = 'В строке %1 полного списка номенклатуры кассового чека пустое наименование номенклатуры! 
			|Следует в документе-основании заполнить номенклатуру и повторить попытку!'");
		Иначе
			ТекстСообщения = НСтр("ru = 'В строках %1 полного списка номенклатуры кассового чека пустые наименования номенклатуры!
			|Следует в документах-основаниях для этих строк заполнить номенклатуру и повторить попытку!'");
		КонецЕсли;	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомераСтрокПустыхНаименований);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ДокументыЧекаККМ");
		
		Результат = Ложь;	
	КонецЕсли;
	
	Если ЕстьПустыеПредметыРасчетаТоваровУслуг Тогда
		НомераСтрокПустыхПредметовРасчета = Сред(НомераСтрокПустыхПредметовРасчета, 0, СтрДлина(НомераСтрокПустыхПредметовРасчета)-2);
		Если НомераСтрокПустыхПредметовРасчета = "1" Тогда
			ТекстСообщения = НСтр("ru = 'В строке %1 полного списка номенклатуры кассового чека не заполнен признак предмета расчета! 
			|Следует в документе-основании заполнить у номенклатуры реквизит ""Признак предмета расчета"" и повторить попытку!'");
		Иначе
			ТекстСообщения = НСтр("ru = 'В строках %1 полного списка номенклатуры кассового чека не заполнен признак предмета расчета!
			|Следует в документах-основаниях для этих строк заполнить у номенклатуры реквизит ""Признак предмета расчета"" и повторить попытку!'");
		КонецЕсли;	
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомераСтрокПустыхПредметовРасчета);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ДокументыЧекаККМ");
		
		Результат = Ложь;	
	КонецЕсли;
	
	ПолучательЧекаККМ = Объект.Контрагент;
	Если ЗначениеЗаполнено(ПолучательЧекаККМ) Тогда
		ДанныеЮЛиИП = ПодключаемоеОборудованиеБГУ.ЧекККМДляЮЛилиИП(ПолучательЧекаККМ, Объект.Дата);
		Если ДанныеЮЛиИП.Заполнить Тогда
			Если НЕ ЗначениеЗаполнено(ДанныеЮЛиИП.Получатель) Тогда
				ТекстСообщения = НСтр("ru = 'Контрагент-получатель чека ККМ - юр.лицо или ИП. У контрагента не указано наименование!'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Контрагент");
						
				Результат = Ложь;
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(ДанныеЮЛиИП.ПолучательИНН) Тогда
				ТекстСообщения = НСтр("ru = 'Контрагент-получатель чека ККМ - юр.лицо или ИП. У контрагента не указан ИНН!'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.Контрагент");
						
				Результат = Ложь;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(АбонентскийНомерТелефона) Тогда
		Если НЕ ПодключаемоеОборудованиеБГУ.НомерТелефонаДляЭлектронногоЧекаКорректен(АбонентскийНомерТелефона) Тогда
			ТекстСообщения = НСтр("ru = 'Номер телефона для электронного чека указан некорректно!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.АбонентскийНомерТелефона");
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		Если НЕ ПодключаемоеОборудованиеБГУ.АдресЭлектроннойПочтаДляЭлектронногоЧекаКорректен(АдресЭлектроннойПочты) Тогда
			ТекстСообщения = НСтр("ru = 'Адрес электронной почты для электронного чека указан некорректно!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.АдресЭлектроннойПочты");
			Результат = Ложь;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ПредставитьТелефонИEmailКлиент()
	
	Если ЗначениеЗаполнено(АбонентскийНомерТелефона) Тогда
		Если ЗначениеЗаполнено(АбонентскийНомерТелефона) Тогда
			Попытка
				СохраненныйТелефон = Число(АбонентскийНомерТелефона);
			Исключение
				ТекстСообщения = НСтр("ru = 'Номер телефона для SMS указан некорректно. Следует изменить значение реквизита и повторить попытку.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,"АбонентскийНомерТелефона");
				
				Возврат;
			КонецПопытки
		Иначе
			СохраненныйТелефон = 0;
		КонецЕсли;
		ТелефонSMS = 0;
		ПодключаемоеОборудованиеБГУКлиент.ПреобразоватьТелефонКПользовательсткомуВиду(СохраненныйТелефон, ТелефонSMS, ТелефонСтрокой);
		ДанныеSMSИлиEmail = ТелефонСтрокой;
	ИначеЕсли ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		ДанныеSMSИлиEmail = АдресЭлектроннойПочты;
	Иначе
		ДанныеSMSИлиEmail = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьВозможностьЗаполненияСуммы(Форма) Экспорт
	
	Результат = Истина;
	
	Если Форма.Модифицированность Тогда
		
		ПоказатьПредупреждение( , НСтр("ru = 'Операция возможна только после записи документа'"));
		Результат = Ложь;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПроверитьВозможностьПечатиЧека()

&НаСервере
Процедура ТоварыРаботыУслугиПослеУдаленияНаСервере()
	РассчитатьИтоги();
КонецПроцедуры

&НаСервере
Процедура ЭтоРозничныйПокупательПриИзмененииНаСервере()
	ЗаполнятьКонтрагентаИДоговор = ЗаполнятьКонтрагентаИДоговор();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Контрагент", "Видимость", ЗаполнятьКонтрагентаИДоговор);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"Договор", "Видимость", ЗаполнятьКонтрагентаИДоговор);
	
	Если НЕ ЗаполнятьКонтрагентаИДоговор Тогда
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();	
		Объект.Договор = Справочники.Договоры.ПустаяСсылка();	
		
		Объект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПередачаСПолнойОплатой;
	Иначе
		Объект.ПризнакСпособаРасчетаЧекаККМ = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Функция ЭтоВозвратДеньВДень()
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ЧекККМПродажа) Тогда
		КассоваяСменаЧекаОснования = Объект.ЧекККМПродажа.КассоваяСмена;
		Если (КассоваяСменаЧекаОснования = Объект.КассоваяСмена) Тогда
			Результат = Истина;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЧекККМПродажаПриИзмененииНаСервере()
	ДокументОснование = Объект.ЧекККМПродажа;
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗаполняемыеДанные = "Организация, КассаККМ, СистемаНалогообложенияЧекаККМ, ПараметрыДоговораПлатежногоАгента, Контрагент, Договор, 
		|Телефон, АдресЭП, ТипЦены, СуммаВключаетНДС, ЭтоРозничныйПокупатель, ФормаОплаты, СуммаДокумента, ПризнакСпособаРасчетаЧекаККМ";
		ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
		ЗаполнитьЗначенияСвойств(Объект, ДанныеДокументаОснования);
		
		Объект.ТипРасчета = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств");	
		Объект.ЧекККМПродажа = ДокументОснование;
		
		ТЧ_ТоварыРаботыУслуги = ДокументОснование.ТоварыРаботыуслуги.Выгрузить();
		ТЧ_Оплата = ДокументОснование.Оплата.Выгрузить();
		ТЧ_РасшифровкаОплаты = ДокументОснование.РасшифровкаОплаты.Выгрузить();
		
		МассивКС10 = Новый Массив;
		МассивКС100 = Новый Массив;
		МассивКС10.Добавить(Тип("Строка"));
		МассивКС100.Добавить(Тип("Строка"));
		КС10 = Новый КвалификаторыСтроки(10);
		КС100 = Новый КвалификаторыСтроки(100);
		ОписаниеТиповС10 = Новый ОписаниеТипов(МассивКС10, , , КС10);
		ОписаниеТиповС100 = Новый ОписаниеТипов(МассивКС100, , , КС100);
		ТЧ_Оплата.Колонки.Добавить("НомерЧекаЭТВозврата", ОписаниеТиповС10);
		ТЧ_Оплата.Колонки.Добавить("СсылочныйНомерВозврата", ОписаниеТиповС100);
		
		Если ДокументОснование.ФормаОплаты = 1 Тогда
			Для каждого ТекОплата Из ТЧ_Оплата Цикл
				Если ЗначениеЗаполнено(ТекОплата.ТипОплаты) Тогда
					Если Объект.Оплата.Количество() > 0 Тогда 
						НоваяСтрока = Объект.Оплата[0];
					Иначе	
						НоваяСтрока = Объект.Оплата.Добавить();
					КонецЕсли;	
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекОплата); 
					
					НоваяСтрока.НомерЧекаЭТВозврата = ТекОплата.НомерЧекаЭТ;
					НоваяСтрока.СсылочныйНомерВозврата = ТекОплата.СсылочныйНомер;
					НоваяСтрока.НомерПлатежнойКарты = ТекОплата.НомерПлатежнойКарты;
					
					НоваяСтрока.ДанныеПереданыВБанк = Ложь;
					НоваяСтрока.НомерЧекаЭТ = "";
					НоваяСтрока.СсылочныйНомер = "";
					НоваяСтрока.ПроцентКомиссии = 0;
					НоваяСтрока.СуммаКомиссии = 0;
					
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;	
		
		Объект.ТоварыРаботыуслуги.Загрузить(ТЧ_ТоварыРаботыУслуги);
		Объект.РасшифровкаОплаты.Загрузить(ТЧ_РасшифровкаОплаты);
		
	КонецЕсли;	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ТипЦеныПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПересчитатьЦеныНоменклатуры();
	ИначеЕсли РезультатВопроса <> КодВозвратаДиалога.Нет Тогда
		Объект.ТипЦены = ТипЦеныДоИзменения;
		УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦеныНоменклатуры()

	МассивНоменклатуры = МассивНоменклатуры(Объект.ТоварыРаботыУслуги.Выгрузить(, "Номенклатура"));
	
	ТаблицаЦен = ПолучитьЦенуНоменклатуры(МассивНоменклатуры,
		Объект.ТипЦены, Объект.Дата, Объект.Организация);
	
	Для каждого ТекСтрока Из Объект.ТоварыРаботыУслуги Цикл
	
		СтрокаЦены = ТаблицаЦен.Найти(ТекСтрока.Номенклатура.Номенклатура, "Номенклатура");
		Если СтрокаЦены<>Неопределено Тогда
			ТекСтрока.Цена = СтрокаЦены.Цена;
		Иначе
			ТекСтрока.Цена = 0;
		КонецЕсли;
		
		РассчитатьСтроку(ТекСтрока, Объект.СуммаВключаетНДС, "Цена");
	
	КонецЦикла;

	РассчитатьИтоги();	
	
	ОбновитьДанныеЗаголовкаТоварыРаботыуслуги(ЭтаФорма);
	
КонецПроцедуры // ПересчитатьЦеныНоменклатуры()

&НаСервере
Функция МассивНоменклатуры(МассивИзПрейскуранта)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Прейскурант.Номенклатура
	               |ИЗ
	               |	Справочник.Прейскурант КАК Прейскурант
	               |ГДЕ
	               |	Прейскурант.Ссылка В(&МассивИзПрейскуранта)";
	Запрос.УстановитьПараметр("МассивИзПрейскуранта", МассивИзПрейскуранта);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ.ВыгрузитьКолонку("Номенклатура");
КонецФункции

&НаСервере
Процедура ПризнакСпособаРасчетаЧекаККМПриИзмененииНаСервере()
	Объект.СуммаДокумента = 0;
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура УдалитьТоварыУслугиКромеОтмеченныхНаСервере()
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Пометка", Ложь);
	НайденныеСтроки = Объект.ТоварыРаботыУслуги.НайтиСтроки(ПараметрыОтбора);
	ВсегоНайдено = НайденныеСтроки.Количество();
	Если ВсегоНайдено > 0 Тогда
		Для н = 1 По ВсегоНайдено Цикл
			Объект.ТоварыРаботыУслуги.Удалить(НайденныеСтроки[ВсегоНайдено-н].НомерСтроки-1);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометки(Пометка = Неопределено)

	Для каждого ТекСтр Из Объект.ТоварыРаботыУслуги Цикл
		
		НовоеЗначениеПометки = ?(Пометка = Неопределено, Не ТекСтр.Пометка, Пометка);
		
		ТекСтр.Пометка = НовоеЗначениеПометки;
	
	КонецЦикла;

КонецПроцедуры // ИзменитьПометки()

&НаКлиенте
Процедура УдалитьСтрокиТоваровУслугОбработатьОтвет(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	Иначе
		УдалитьТоварыУслугиКромеОтмеченныхНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредставлениеЧека()
	ЕстьОшибки = Ложь;
	ЧекСформирован = Ложь;
	
	КассаККМЧека = Объект.КассаККМ;
	
	ОчиститьСообщения();
	
	Если ЭтаФорма.Модифицированность Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Операция возможна только после сохранения документа'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ВсеРеквизитыДляЧекаЗаполнены(Истина) Тогда
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЕстьОшибки И ПроверитьЗаполнение() Тогда
		ДанныеЧекаДляДокумента = ДанныеЧекаДляДокумента();
		
		НомерКассовогоЧека = ДанныеЧекаДляДокумента.НомерЧекаККМ;		
		
		Если (НомерКассовогоЧека = 0) ИЛИ ЗначениеЗаполнено(ЗаключительныйЧекИсправительный) Тогда   
			НомерДокументаКассыККМ = ПараметрыПриложения["ПодключаемоеОборудование.НомерДокументаКассыККМ"];
			НомерДокКассыККМ = ?(НомерДокументаКассыККМ[Объект.КассаККМ]=Неопределено, 0, НомерДокументаКассыККМ[Объект.КассаККМ]);
			НомерЧека = НомерДокКассыККМ+1;
		Иначе
			НомерЧека = НомерКассовогоЧека;	
			ЧекСформирован = Истина;
		КонецЕсли;	
		
		ОбщиеПараметры = ПодготовитьДанныеДляПросмотраЧека(НомерЧека);
		
		Если ОбщиеПараметры = Неопределено Тогда
			ТекстСообщения = НСтр("ru = 'Недостаточно данных для просмотра кассового чека.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Возврат;
		КонецЕсли;
		
		Если ЧекСформирован Тогда
			ОбщиеПараметры.ДатаВремя = ДанныеЧекаДляДокумента.ДатаЧекаККМ;	
		КонецЕсли;	
		
		ВерсияФФД = ВерсияФФД(КассаККМЧека);
		
		ТекстЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.СформироватьТекстНефискальногоЧека(ОбщиеПараметры, 34, ВерсияФФД);
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.УстановитьТекст(ТекстЧека);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекстовыйДокумент", ТекстовыйДокумент);
		ПараметрыФормы.Вставить("ДокументОснование", Объект.Ссылка);
		ПараметрыФормы.Вставить("ИдентификаторЗаписи", ДанныеЧекаДляДокумента.ИдентификаторЗаписи);

		Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
		ОткрытьФорму("ОбщаяФорма.ФормаПросмотраЧекаККМ", ПараметрыФормы, , Объект,,,, Режим);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВерсияФФД(КассаККМЧека) Экспорт
	Возврат ПодключаемоеОборудованиеБГУ.ВерсияФФД(КассаККМЧека);	
КонецФункции

&НаСервере
Функция НомерЧекаДляДокумента()
	Если Объект.НомерЧекаККМ<>0 Тогда
		Возврат Объект.НомерЧекаККМ;
	КонецЕсли;	
	
	Возврат ПодключаемоеОборудованиеБГУ.НомерЧека(Объект.Ссылка);
КонецФункции

&НаСервере
Функция ДанныеЧекаДляДокумента()
	Результат = Новый Структура;
	Результат.Вставить("НомерЧекаККМ", 0);
	Результат.Вставить("ДатаЧекаККМ", Дата(1,1,1));
	Результат.Вставить("ФискальныйПризнак", "");
	Результат.Вставить("ИдентификаторЗаписи", "");
	
	Если Объект.НомерЧекаККМ<>0 Тогда
		Результат.НомерЧекаККМ = Объект.НомерЧекаККМ;
		Результат.ДатаЧекаККМ = Объект.Дата;
		
		Возврат Результат;
	КонецЕсли;	
	
	Возврат ПодключаемоеОборудованиеБГУ.ДанныеЧека(Объект.Ссылка);
КонецФункции

&НаСервере
Процедура ЗаписатьФискальныеДанныеДляРасчетногоДокумента(НомерЧека)
	ПараметрыФискализации = Новый Структура;
	ПараметрыФискализации.Вставить("ДатаВремяЧека", ТекущаяДата());
	ПараметрыФискализации.Вставить("ДокументОснование", Объект.Ссылка);
	ПараметрыФискализации.Вставить("Организация", Объект.Организация);
	ПараметрыФискализации.Вставить("ТипРасчета", Объект.ТипРасчета);
	ПараметрыФискализации.Вставить("НомерСменыККТ", 1);
	ПараметрыФискализации.Вставить("НомерЧекаККТ", НомерЧека);
	ПараметрыФискализации.Вставить("ФискальныйПризнак", Строка(НомерЧека));
	ПараметрыФискализации.Вставить("ТипДокумента", Перечисления.ТипыФискальныхДокументовККТ.КассовыйЧек);
	ПараметрыФискализации.Вставить("АдресСайтаПроверки", "");
	ПараметрыФискализации.Вставить("ЗаводскойНомерФН", "");
	ПараметрыФискализации.Вставить("РегистрационныйНомерККТ", "");
	ПараметрыФискализации.Вставить("ДополнительныйРеквизит", "");
	ПараметрыФискализации.Вставить("ДанныеЧекаXML", Неопределено);
	
	ОбщиеПараметры = ПодготовитьДанныеДляПробитияЧека(НомерЧека);
	
	СуммаЧека = 0;
	ОплатаНаличные = 0;
	ОплатаЭлектронно = 0;
	ОплатаПостоплата = 0;
	ОплатаПредоплата = 0;
	
	Для каждого ТекСтрока Из ОбщиеПараметры.ТаблицаОплат Цикл
		СуммаЧека = СуммаЧека + ТекСтрока.Сумма;
		Если ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Наличные Тогда
			ОплатаНаличные = ОплатаНаличные + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Электронно Тогда
			ОплатаЭлектронно = ОплатаЭлектронно + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Предоплата Тогда
			ОплатаПредоплата = ОплатаПредоплата + ТекСтрока.Сумма;
		ИначеЕсли ТекСтрока.ТипОплаты = Перечисления.ТипыОплатыККТ.Постоплата Тогда
			ОплатаПостоплата = ОплатаПостоплата + ТекСтрока.Сумма;
		КонецЕсли;	
	КонецЦикла;	
	ПараметрыФискализации.Вставить("СуммаЧека", СуммаЧека);
	ПараметрыФискализации.Вставить("ОплатаНаличные", ОплатаНаличные);
	ПараметрыФискализации.Вставить("ОплатаЭлектронно", ОплатаЭлектронно);
	ПараметрыФискализации.Вставить("ОплатаПредоплата", ОплатаПредоплата);
	ПараметрыФискализации.Вставить("ОплатаПостоплата", ОплатаПостоплата);
	
	ПодключаемоеОборудованиеБГУВызовСервера.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);

КонецПроцедуры

&НаСервере
Функция ЗаключительныйЧекИсправительный()
	
	Возврат ПодключаемоеОборудованиеБГУ.ЗаключительныйЧекИсправительный(Объект.Ссылка);

КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьПриИсправленииЧека()
	
	НомерКассовогоЧека = НомерЧекаДляДокумента();
	СтатусЧекаККМПробит = ?(НомерКассовогоЧека<>0, Истина, Ложь);
	
	ВидимостьКнопкиПечатьЧекаККМ = Истина;
	ЕстьЗаключительныйЧекИсправительный = Ложь;
	
	Если СтатусЧекаККМПробит Тогда
		ЗаключительныйЧекИсправительный = ЗаключительныйЧекИсправительный();
		Если ЗначениеЗаполнено(ЗаключительныйЧекИсправительный) Тогда
			ВидимостьКнопкиПечатьЧекаККМ = Истина;
			ЕстьЗаключительныйЧекИсправительный = Истина;
		Иначе
			ВидимостьКнопкиПечатьЧекаККМ = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаключительныйЧекИсправительный", 		"Видимость", ЕстьЗаключительныйЧекИсправительный);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсправительныйЧекККМ", 		"Видимость", НЕ ЕстьЗаключительныйЧекИсправительный);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаНапечататьЧек", 		"Видимость", ВидимостьКнопкиПечатьЧекаККМ);
	
КонецПроцедуры	

&НаКлиенте
Функция ПодготовитьДанныеДляПросмотраЧека(НомерЧека)
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(ЗаключительныйЧекИсправительный) Тогда
		
		Результат = ПодготовитьДанныеДляПробитияЧека(НомерЧека);
		
		Возврат Результат;
	КонецЕсли;	
	
	ДанныеЧека = ДанныеЧекаДляДокумента();
	Если ЗначениеЗаполнено(ДанныеЧека.ИдентификаторЗаписи) И ЗначениеЗаполнено(ДанныеЧека.ТекстовыеДанныеXML) Тогда
		Результат = ПодключаемоеОборудованиеБГУВызовСервера.ЗагрузитьДанныеФискализацииИзXML(ДанныеЧека.ТекстовыеДанныеXML);
		
		Возврат Результат;
	КонецЕсли;
	
	Результат = ПодготовитьДанныеДляПробитияЧека(НомерЧека);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ПробитьЧекСПроверкойСтавокНДС()
	ЕстьУстаревшиеСтавкиНДС = Ложь;
	ПроверитьКассовыйЧекНаУстаревшиеСтавкиНДСНаСервере(Объект.Ссылка, ЕстьУстаревшиеСтавкиНДС);
	
	Если ЕстьУстаревшиеСтавкиНДС Тогда
		ТекстСообщения = НСтр("ru='При формировании кассового чека используется устаревшая ставка НДС. Прервать печать чека?'");
		Оповещение = Новый ОписаниеОповещения("ПрерватьПечатьКассовогоЧекаПриЗамечаниях", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ЭтотОбъект.Доступность = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекНаКлиентеЗавершение", ЭтотОбъект);
		ПробитьЧекВыполнить(Оповещение);
	КонецЕсли;	
КонецПроцедуры		

&НаКлиенте
Процедура ПрерватьПечатьКассовогоЧекаПриЗамечаниях(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		ЭтотОбъект.Доступность = Ложь;
			
		Оповещение = Новый ОписаниеОповещения("ПробитьЧекНаКлиентеЗавершение", ЭтотОбъект);
		ПробитьЧекВыполнить(Оповещение);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ПроверитьКассовыйЧекНаУстаревшиеСтавкиНДСНаСервере(ДокументПечатиЧека, ЕстьУстаревшиеСтавкиНДС)
	
	УстаревшиеСтавкиНДС = ПодключаемоеОборудованиеБГУ.УстаревшиеСтавкиНДС();
	ТаблицаНоменклатуры = ПодключаемоеОборудованиеБГУ.ТаблицаНоменклатурыЧекаККМ(ДокументПечатиЧека);
	ТаблицаНоменклатуры.Свернуть("СтавкаНДС");
	Для каждого ТекСтрока Из ТаблицаНоменклатуры Цикл
		Если НЕ УстаревшиеСтавкиНДС.Найти(ТекСтрока.СтавкаНДС) = Неопределено Тогда
			ЕстьУстаревшиеСтавкиНДС = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДанныхДляЧекаККМ()

	НомерКассовогоЧека = НомерЧекаДляДокумента();
	ЗаполнитьДанныеДляОтправкиЧека(НомерКассовогоЧека); 
	ОбновитьФормуSMSИEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеДляОтправкиЧека(НомерКассовогоЧека)
	
	Если Не ЗначениеЗаполнено(НомерКассовогоЧека) Тогда  
		Если ЗначениеЗаполнено(Объект.КассаККМ) И ЗаполнятьПочтуИТелефонДляОтправкиЧека() Тогда 	
			АдресПочты 		= ПодключаемоеОборудованиеБГУВызовСервера.ПервыйАдресЭлектроннойПочтыПокупателя(Объект.Контрагент);
			НомерТелефона 	= ПодключаемоеОборудованиеБГУВызовСервера.ПервыйНомерТелефонаПокупателя(Объект.Контрагент);
			Если ЗначениеЗаполнено(АдресПочты) Тогда 
				АдресЭлектроннойПочты = АдресПочты;
				АбонентскийНомерТелефона = "";
				ТелефонСтрокой = "";
				ДанныеSMSИлиEmail = АдресЭлектроннойПочты;
				ОтказПокупателяОтСохраненияДанных = Истина;
			ИначеЕсли ЗначениеЗаполнено(НомерТелефона) Тогда 
				ТелефонSMS = 0;
				ПодключаемоеОборудованиеБГУКлиент.ПреобразоватьТелефонКПользовательсткомуВиду(НомерТелефона, ТелефонSMS, ТелефонСтрокой);
				АбонентскийНомерТелефона = "7" + Формат(НомерТелефона, "ЧЦ=10; ЧДЦ=; ЧГ=0");
				АдресЭлектроннойПочты = "";
				ДанныеSMSИлиEmail = ТелефонСтрокой;
				ОтказПокупателяОтСохраненияДанных = Истина;  
			Иначе
				АдресЭлектроннойПочты = "";
				АбонентскийНомерТелефона = "";
				ТелефонСтрокой = "";
				ДанныеSMSИлиEmail = "";
			КонецЕсли;  
			ЗаписатьДополнительныеДанныеЧековККМ();  
		Иначе
			АдресЭлектроннойПочты = "";
			АбонентскийНомерТелефона = "";
			ТелефонСтрокой = "";
			ДанныеSMSИлиEmail = "";	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнятьПочтуИТелефонДляОтправкиЧека()
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "ЗаполнятьПочтуИТелефонДляОтправкиЧека");
	
КонецФункции

&НаСервере
Процедура ЗаписатьДополнительныеДанныеЧековККМ()
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ДополнительныеДанныеЧекаККМ = Новый Структура;
		ДополнительныеДанныеЧекаККМ.Вставить("ДокументОснование", Объект.Ссылка);
		ДополнительныеДанныеЧекаККМ.Вставить("Контрагент", Объект.Контрагент);
		ДополнительныеДанныеЧекаККМ.Вставить("АбонентскийНомерТелефона", АбонентскийНомерТелефона);
		ДополнительныеДанныеЧекаККМ.Вставить("АдресЭлектроннойПочты", АдресЭлектроннойПочты);
		ДополнительныеДанныеЧекаККМ.Вставить("ОтказПокупателяОтСохраненияДанных", ОтказПокупателяОтСохраненияДанных);
		
		ПодключаемоеОборудованиеБГУВызовСервера.ЗаписатьДополнительныеСведенияКассовогоЧека(ДополнительныеДанныеЧекаККМ);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДополнительныеДанныеЧековККМ()
	ДополнительныеСведенияКассовогоЧека = 
		ПодключаемоеОборудованиеБГУВызовСервера.ДополнительныеСведенияКассовогоЧека(Объект.Ссылка);
	АбонентскийНомерТелефона = ДополнительныеСведенияКассовогоЧека.АбонентскийНомерТелефона;
	АдресЭлектроннойПочты = ДополнительныеСведенияКассовогоЧека.АдресЭлектроннойПочты;
	ОтказПокупателяОтСохраненияДанных = ДополнительныеСведенияКассовогоЧека.ОтказПокупателяОтСохраненияДанных;
	Если Объект.ОтказКлиентаОтСохраненияТелефонаEmail Тогда
		ОтказПокупателяОтСохраненияДанных = Объект.ОтказКлиентаОтСохраненияТелефонаEmail;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область МаркировкаТоваров

&НаКлиенте
Процедура ОповещениеОткрытьФормуВводаКодаМаркировкиЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения <> Неопределено Тогда 
		Если РезультатВыполнения.УдалитьТоварИзСписка Тогда 
			Объект.ТоварыРаботыУслуги.Удалить(Элементы.ТоварыРаботыУслуги.ТекущиеДанные)
		Иначе	
			Элементы.ТоварыРаботыУслуги.ТекущиеДанные.КодМаркировки 		= РезультатВыполнения.КодМаркировки;
			Элементы.ТоварыРаботыУслуги.ТекущиеДанные.РезультатПроверкиКМ 	= РезультатВыполнения.РезультатПроверкиКМ;
			Элементы.ТоварыРаботыУслуги.ТекущиеДанные.АдресДанныхПроверкиКМ	= РезультатВыполнения.АдресДанныхПроверкиКМ;
		КонецЕсли;	
		СессияПроверкиКМОткрыта = РезультатВыполнения.СессияПроверкиКМОткрыта;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьУсловноеОформлениеМаркировка()
	
	УсловноеОформление.Элементы.Очистить();
	
	Если РозничнаяРеализацияМаркированныхТоваров Тогда 
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыРаботыУслугиКодМаркировки");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.КодМаркировки", ВидСравненияКомпоновкиДанных.Равно, "");
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<...>'"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыРаботыУслугиКодМаркировки");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.МаркируемыйТовар", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ДосьеРамкаСтрокиЦвет);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Не используется'"));
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыРаботыУслугиКодМаркировки");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.КодМаркировки", ВидСравненияКомпоновкиДанных.Равно, "");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.МаркируемыйТовар", ВидСравненияКомпоновкиДанных.Равно, Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ДосьеПлохаяОценкаЦвет);
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыРаботыУслугиКоличество");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.МаркируемыйТовар", ВидСравненияКомпоновкиДанных.Равно, Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ДосьеРамкаСтрокиЦвет);
		
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыРаботыУслугиКодМаркировки");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.КодМаркировки", ВидСравненияКомпоновкиДанных.НеРавно, "");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.РезультатПроверкиКМ", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ДосьеПлохаяОценкаЦвет);

		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыРаботыУслугиКодМаркировки");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.КодМаркировки", ВидСравненияКомпоновкиДанных.НеРавно, "");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.РезультатПроверкиКМ", ВидСравненияКомпоновкиДанных.Равно, Истина);
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветАкцента);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	"ТоварыРаботыУслугиКодМаркировки", "Видимость", РозничнаяРеализацияМаркированныхТоваров);

КонецПроцедуры

&НаСервере
Функция МаркируемыйТовар(ИдентификаторСтроки)
	
	МассивНоменклатуры = Новый Массив;
	МассивНоменклатуры.Добавить(Объект.ТоварыРаботыУслуги.НайтиПоИдентификатору(ИдентификаторСтроки).Номенклатура);
	СписокМаркируемыхТоваров = РозничныеПродажиБГУ.ПолучитьМаркируемыеТовары(МассивНоменклатуры);
	Если СписокМаркируемыхТоваров.Количество() = 0 Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ПроверитьЗакрытиеСессииПроверкиКМ()
	
	Если СессияПроверкиКМОткрыта Тогда 
		ПараметрыКассыККМ 			= ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьПараметрыКассыККМ(Объект.КассаККМ);
		ИдентификаторУстройстваФР 	= ПараметрыКассыККМ.ИдентификаторУстройства;
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершениеЗакрытиеСессииПроверкиКМ", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытииСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройстваФР);
	КонецЕсли;	
		
КонецПроцедуры	

&НаКлиенте
Процедура КомандаВыполнитьЗавершениеЗакрытиеСессииПроверкиКМ(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		СессияПроверкиКМОткрыта = Ложь;
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура СохранитьДобавленныеКолонки()
	
	Если РозничнаяРеализацияМаркированныхТоваров Тогда 
		АдресаРезультатовПроверкиКМ.Очистить();
		Для Каждого СтрокаАдреса Из Объект.ТоварыРаботыУслуги Цикл 
			АдресаРезультатовПроверкиКМ.Добавить(СтрокаАдреса.АдресДанныхПроверкиКМ);
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДобавленныеКолонки()
	
	Если РозничнаяРеализацияМаркированныхТоваров Тогда 
		Для Каждого СтрокаАдреса Из Объект.ТоварыРаботыУслуги Цикл 
			СтрокаАдреса.АдресДанныхПроверкиКМ = АдресаРезультатовПроверкиКМ[СтрокаАдреса.НомерСтроки - 1].Значение;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКодыМаркировки(ИдентификаторУстройстваФР)              
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудования(Неопределено, ЭтотОбъект, , ИдентификаторУстройстваФР);
	
	Если ИспользуетсяККТСПередачейДанных И РозничнаяРеализацияМаркированныхТоваров И ВерсияФФД(Объект.КассаККМ) = "1.2" Тогда 
		Для Каждого СтрокаТовар Из Объект.ТоварыРаботыУслуги Цикл 
			Если СтрокаТовар.МаркируемыйТовар И СтрокаТовар.АдресДанныхПроверкиКМ = "" Тогда 
				ОтправитьЗапросНаПроверкуКМ(СтрокаТовар, ИдентификаторУстройстваФР);	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьЗапросНаПроверкуКМ(СтрокаТовар, ИдентификаторУстройстваФР)
	
	УникальныйИдентификаторЗапроса = Строка(Новый УникальныйИдентификатор); 
	
	ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыЗапросКМ();
	ПараметрыОперации.ИдентификаторЗапроса 			= УникальныйИдентификаторЗапроса;
	ПараметрыОперации.Количество 					= СтрокаТовар.Количество;  
	ПараметрыОперации.ДробноеКоличество.Числитель   = 0;     
	ПараметрыОперации.ДробноеКоличество.Знаменатель = 0;     
	ПараметрыОперации.МераКоличестваПредметаРасчета = ПредопределенноеЗначение("Перечисление.МераКоличестваПредметаРасчетаККТ.Штука");
	ПараметрыОперации.ПланируемыйСтатусТовара 		= ПредопределенноеЗначение("Перечисление.ПланируемыйСтатусМаркируемогоТовара.ШтучныйТоварРеализован");
	ПараметрыОперации.КонтрольнаяМарка 				= СтрокаТовар.КодМаркировки;
	ПараметрыОперации.ОжидатьПолучениеОтветаОИСМ 	= Ложь;
	
	ДопПараметры = Новый Структура("УникальныйИдентификаторЗапроса,ИдентификаторУстройстваФР", УникальныйИдентификаторЗапроса, ИдентификаторУстройстваФР);
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаВыполнитьЗавершениеКМ", ЭтотОбъект, ДопПараметры);
	ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗапросКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройстваФР, ПараметрыОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьЗавершениеКМ(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ДопПараметры = Новый Структура("УникальныйИдентификаторЗапроса,ИдентификаторУстройстваФР", Параметры.УникальныйИдентификаторЗапроса, Параметры.ИдентификаторУстройстваФР);
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаЗавершениеПолучениеОтветаКМ", ЭтотОбъект, ДопПараметры);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолученияРезультатовЗапросаКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, Параметры.ИдентификаторУстройстваФР, Неопределено);
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершениеПолучениеОтветаКМ(РезультатВыполнения, Параметры) Экспорт

	Если РезультатВыполнения.Результат Тогда
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПодтверждениеКМ();
		ПараметрыОперации.ИдентификаторЗапроса 	= Параметры.УникальныйИдентификаторЗапроса;
		ПараметрыОперации.Выбытие				= Истина;
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("КомандаЗавершениеПодтвержденияКМ", ЭтотОбъект);
		ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПодтверждениеКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, Параметры.ИдентификаторУстройстваФР, ПараметрыОперации);
	Иначе
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура КомандаЗавершениеПодтвержденияКМ(РезультатВыполнения, Параметры) Экспорт 
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = РезультатВыполнения.ОписаниеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаСервере
Процедура ЗаполнитьПараметрыНДССКомиссии()
	
	ДанныеОВидеКартыИПроценте = ЭквайрингВызовСервера.ПолучитьДанныеВидаКартыДоговораЭквайринга(ПараметрыДоговораЭквайринга, ВидПлатежнойКарты);
	Если ДанныеОВидеКартыИПроценте <> Неопределено Тогда 
		НДССКомиссииСверху = ДанныеОВидеКартыИПроценте.НДССКомиссииСверху;
		СтавкаНДССКомиссии = УчетНДСКлиентСервер.ПолучитьМножительСтавки(ДанныеОВидеКартыИПроценте.СтавкаНДССКомисии, Не НДССКомиссииСверху);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

