#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания,ФормаДлительнойОперации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсточникДанных = 0;
	УдалитьВсеСуществующие = Ложь;
	Элементы.ПолноеИмяФайла.Доступность = Ложь;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)
	Элементы.ПолноеИмяФайла.Доступность = ИсточникДанных = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ОткрытьФайлЗавершение", ЭтотОбъект), АдресВременногоХранилища,, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлЗавершение(Результат, Адрес, ИмяВыбрФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяФайла = ИмяВыбрФайла;
	АдресВременногоХранилища = Адрес;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если (ИсточникДанных = 0) Тогда 	// Из макета
		
	Иначе								// Из файла
		
		Если ПустаяСтрока(ПолноеИмяФайла) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите имя файла'"));
			ТекущийЭлемент = Элементы.ПолноеИмяФайла;
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполненоПроводок = 0;
	
	ВыполнитьЗагрузку();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ФоновоеЗаданиеИдентификатор)
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
КонецФункции

//длительные операции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			ЗагрузитьПодготовленныеДанные();
			
			// выполнить действия после окончания загрузки на клиенте
			Если (РезультатЗагрузки) Тогда
								
				ПоказатьПредупреждение(Новый ОписаниеОповещения("Подключаемый_ПроверитьВыполнениеЗаданияЗавершение", ЭтотОбъект), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Добавлено корректных проводок: %1'"), Строка(ЗаполненоПроводок)));
				
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите правильное имя файла'"));
				ТекущийЭлемент = Элементы.ПолноеИмяФайла;
				
			КонецЕсли;
			
			Возврат;
		КонецЕсли;

	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания(
		"Подключаемый_ПроверитьВыполнениеЗадания", 
		ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
		Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияЗавершение(ДополнительныеПараметры) Экспорт
    
    Попытка
        ЭтаФорма.ВладелецФормы.Элементы.Список.Обновить();
    Исключение
    КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ЗагрузитьКорректныеСчета()
	
	Если ИсточникДанных = 1 Тогда
		ДанныеФайла = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресВременногоХранилища), Новый СжатиеДанных(9));
	Иначе
		ДанныеФайла = "";
	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура("ДанныеФайла,УдалитьВсеСуществующие", ДанныеФайла, УдалитьВсеСуществующие);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ЗаданиеВыполнено = Ложь;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
	
		ФоновыеЗаданияБухгалтерскийУчет.ВыполнитьЗагрузкуКорреспондирующихСчетовВОбщемМодуле(ПараметрыОбработки, АдресХранилища);
		ЗагрузитьПодготовленныеДанные();
	
		Возврат Истина;
	
	КонецЕсли;
	
	НаименованиеЗадания = НСтр("ru = 'Загрузка корреспондирующих счетов'");
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	Задание = ФоновыеЗадания.Выполнить(
	"ФоновыеЗаданияБухгалтерскийУчет.ВыполнитьЗагрузкуКорреспондирующихСчетовВОбщемМодуле", 
		ПараметрыЭкспортнойПроцедуры, , НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
	
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗагрузитьПодготовленныеДанные();
		ЗаданиеВыполнено = Истина; 
	КонецЕсли;
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗагрузку()
	
	Результат = Ложь;
	ЗаполненоПроводок = 0;
	ЗаданиеВыполнено = ЗагрузитьКорректныеСчета();
	
	Если ЗаданиеВыполнено Тогда
		// выполнить действия после окончания загрузки на клиенте
		Если (РезультатЗагрузки) Тогда	
				
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ВыполнитьЗагрузкуЗавершение", ЭтотОбъект), СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Добавлено корректных проводок: %1'"), Строка(ЗаполненоПроводок)));
			
		Иначе
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Укажите правильное имя файла'"));
			ТекущийЭлемент = Элементы.ПолноеИмяФайла;
				
		КонецЕсли;

		Возврат;
	КонецЕсли;

	ПараметрыОбработчикаОжидания = Новый Структура(
		"МинимальныйИнтервал,
		|МаксимальныйИнтервал,
		|ТекущийИнтервал,
		|КоэффициентУвеличенияИнтервала", 
		1, 15, 1, 1.4);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
		Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуЗавершение(ДополнительныеПараметры) Экспорт
    
    Попытка
        ЭтаФорма.ВладелецФормы.Элементы.Список.Обновить();
    Исключение
    КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()
	
	// В этой процедуре выполняются действия после загрузки комплекта на сервере.
	
	СтруктураРезультата = ПолучитьИзВременногоХранилища(АдресХранилища);
	Если ТипЗнч(СтруктураРезультата) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	ЗаполненоПроводок = СтруктураРезультата.ЗаполненоПроводок;
	РезультатЗагрузки = СтруктураРезультата.Результат;
	
КонецПроцедуры

#КонецОбласти
