
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.РазделениеВключено() И НЕ ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("Регистратор") Тогда
		Элементы.ОтборОрганизация.Видимость = Ложь;
		Элементы.ОтборЖурналОпераций.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ЗаполнениеРеквизитовОбъектов.УстановитьОтборОсновнойОрганизации(Список, ОтборОрганизация);
	Элементы.Организация.Видимость = НЕ ЗначениеЗаполнено(ОтборОрганизация);
	
	// В журнале проводок всегда отображаются все суммы: "Сумма", "Не учитывается (НУ)", "ЕНВД (НУ)", "НДС (НУ)",
	// независимо от учетной политики учреждения.
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура, "Организация,Период");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		ОбщегоНазначенияБГУКлиентСервер.УстановитьОтборОсновнойОрганизации(Список, ОтборОрганизация,,Параметр);
		Элементы.Организация.Видимость = НЕ ЗначениеЗаполнено(ОтборОрганизация);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОтборОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборЖурналОперацийПриИзменении(Элемент)
	ОтборЖурналОперацийПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	Элементы.Организация.Видимость = НЕ ЗначениеЗаполнено(ОтборОрганизация);
	
КонецПроцедуры

&НаСервере
Процедура ОтборЖурналОперацийПриИзмененииНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ЖурналОпераций", ОтборЖурналОпераций,,, ЗначениеЗаполнено(ОтборЖурналОпераций));
	Элементы.ЖурналОпераций.Видимость = НЕ ЗначениеЗаполнено(ОтборЖурналОпераций);
	
КонецПроцедуры

#КонецОбласти
