#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Дата = Параметры.Дата;
	ИФО = Параметры.ИФО;
	СписокСчетов.ЗагрузитьЗначения(Параметры.МассивСчетов);
	
	НачальныеЗначения = Параметры.НачальныеЗначения;
	ЗаполнитьСтрокиТаблицы(НачальныеЗначения);
	
	ЗначениеСвойства = Неопределено;
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
	
		Если НачальныеЗначения.Свойство(СтрокаТаблицы.ИмяРеквизита, ЗначениеСвойства) Тогда
			СтрокаТаблицы.ЗначениеРеквизита = ЗначениеСвойства;
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаРеквизитов

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	ТекущиеДанные.ИзменятьРеквизит = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные.ИмяРеквизита = "СчетУчетаОС" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыбораЗначения = Новый Структура;
		ЗаполнитьПараметрыДляВыбораСчетаУчета(ПараметрыВыбораЗначения);
		ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыВыбораЗначения, Элемент);
	ИначеЕсли ТекущиеДанные.ИмяРеквизита = "КПС" Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыВыбораЗначения = Новый Структура;
		ЗаполнитьПараметрыДляВыбораКПС(ПараметрыВыбораЗначения);
		ОткрытьФорму("Справочник.КлассификационныеПризнакиСчетов.ФормаВыбора", ПараметрыВыбораЗначения, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные.ИмяРеквизита = "СчетУчетаОС" Тогда
		ЗаполнитьПараметрыДляВыбораСчетаУчета(Параметры);
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), Параметры);
	ИначеЕсли ТекущиеДанные.ИмяРеквизита = "КПС" Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьПараметрыДляВыбораКПС(Параметры);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КлассификационныеПризнакиСчетов"), Параметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРеквизитовЗначениеРеквизитаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ТаблицаРеквизитов.ТекущиеДанные;
	Если ТекущиеДанные.ИмяРеквизита = "СчетУчетаОС" Тогда
		ЗаполнитьПараметрыДляВыбораСчетаУчета(Параметры);
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), Параметры);
	ИначеЕсли ТекущиеДанные.ИмяРеквизита = "КПС" Тогда
		СтандартнаяОбработка = Ложь;
		ЗаполнитьПараметрыДляВыбораКПС(Параметры);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.КлассификационныеПризнакиСчетов"), Параметры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВозвращаемоеЗначение = Новый Структура;
	Для каждого СтрокаТаблицы Из ТаблицаРеквизитов Цикл
	
		Если СтрокаТаблицы.ИзменятьРеквизит Тогда
			ВозвращаемоеЗначение.Вставить(СтрокаТаблицы.ИмяРеквизита, СтрокаТаблицы.ЗначениеРеквизита);
		КонецЕсли;
	
	КонецЦикла;
	ОповеститьОВыборе(ВозвращаемоеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСтрокиТаблицы(НачальныеЗначения)

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита = "СчетУчетаОС";
	НоваяСтрока.ПредставлениеРеквизита = "Счет учета";
	НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита = "КПС";
	НоваяСтрока.ПредставлениеРеквизита = "КПС";
	НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");

	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита = "Количество";
	НоваяСтрока.ПредставлениеРеквизита = "Количество";
	НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0));
	
	НоваяСтрока = ТаблицаРеквизитов.Добавить();
	НоваяСтрока.ИмяРеквизита = "Сумма";
	НоваяСтрока.ПредставлениеРеквизита = "Стоимость";
	НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2));

	Если НачальныеЗначения.Свойство("СуммаАмортизации") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "СуммаАмортизации";
		НоваяСтрока.ПредставлениеРеквизита = "Сумма амортизации";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2));
	КонецЕсли;

	Если НачальныеЗначения.Свойство("ДатаВводаВЭксплуатацию") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ДатаВводаВЭксплуатацию";
		НоваяСтрока.ПредставлениеРеквизита = "Дата ввода в эксплуатацию";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата));
	КонецЕсли;

	Если НачальныеЗначения.Свойство("СрокПолезногоИспользования") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "СрокПолезногоИспользования";
		НоваяСтрока.ПредставлениеРеквизита = "Срок полезного использования";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Число",
			Новый КвалификаторыЧисла(10,0, ДопустимыйЗнак.Неотрицательный));
	КонецЕсли;

	Если НачальныеЗначения.Свойство("ПринятиеКУчетуОдновременноСВводомВЭксплуатацию") Тогда
		НоваяСтрока = ТаблицаРеквизитов.Добавить();
		НоваяСтрока.ИмяРеквизита = "ПринятиеКУчетуОдновременноСВводомВЭксплуатацию";
		НоваяСтрока.ПредставлениеРеквизита = "Ввести в эксплуатацию";
		НоваяСтрока.ТипРеквизита = Новый ОписаниеТипов("Булево");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПараметрыДляВыбораСчетаУчета(ПараметрыВыбораЗначения)

	ПараметрыВыбораЗначения.Вставить("ОграниченияСписокСчетов", СписокСчетов);
	ПараметрыВыбораЗначения.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыВыбораЗначения.Вставить("ОграничениеПоСубконто",
		ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства"));

КонецПроцедуры // ЗаполнитьПараметрыДляВыбораСчетаУчета()

&НаКлиенте
Процедура ЗаполнитьПараметрыДляВыбораКПС(ПараметрыВыбораЗначения)

	Отбор = Новый Структура;
	Отбор.Вставить("НаДату", Дата);
	Отбор.Вставить("Организация", Организация);
	Отбор.Вставить("ИФО", ИФО);
	
	ПараметрыВыбораЗначения.Вставить("Отбор", Отбор);

КонецПроцедуры // ЗаполнитьПараметрыДляВыбораСчетаУчета()

#КонецОбласти

