&НаСервере
Функция ПолучитьОбраз(Ссылка)
	РеквизитыРегистрации = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(Ссылка);
	ПервичныйОбраз = Неопределено;
	Если РеквизитыРегистрации.Количество() > 0
		И РеквизитыРегистрации.Свойство("ПервичныйОбразИРеквизиты")
		И РеквизитыРегистрации.ПервичныйОбразИРеквизиты <> Неопределено Тогда
		ПервичныйОбраз	= РеквизитыРегистрации.ПервичныйОбразИРеквизиты.Получить();
		Если  ТипЗнч(ПервичныйОбраз) = Тип("Структура") Тогда
			ПервичныйОбраз.Вставить("Ссылка", Ссылка);
			ПервичныйОбраз = ОбщегоназначенияКлиентСервер.ЗначениеВМассиве(ПервичныйОбраз);
		ИначеЕсли ТипЗнч(ПервичныйОбраз) = Тип("Массив") Тогда	
			Для Каждого ЭлементМассива Из ПервичныйОбраз Цикл
				Если ТипЗнч(ЭлементМассива) = Тип("Структура") Тогда
					ЭлементМассива.Вставить("Ссылка", Ссылка);
				Иначе 
					ПервичныйОбраз = Неопределено;
					Прервать;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	Возврат ПервичныйОбраз;
КонецФункции	

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураДокументов = ПолучитьОбраз(ПараметрКоманды);
	Если СтруктураДокументов = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Отсутствует первичный образ для %1'"), ПараметрКоманды[0]));
		Возврат ;
	КонецЕсли;
	
	Если  НЕ ТипЗнч(СтруктураДокументов) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Неизвестный тип данных'"));
		Возврат;
	КонецЕсли;
	
	Если СтруктураДокументов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Отсутствует первичный образ для %1'"), ПараметрКоманды[0]));
		Возврат ;
	КонецЕсли;   
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("РегистрСведений.СостояниеПлатежноРасчетныхДокументов", "", ПараметрКоманды,
		ПараметрыВыполненияКоманды.Источник, Новый Структура("ИмяМакета, ОбъектПечати", "", СтруктураДокументов));

	
КонецПроцедуры
