
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не Параметры.ПоказыватьВсеПериоды Тогда
	//	
	//	СписокПериодов = Справочники.Периоды.ПолучитьОткрытыеПериоды();
	//	
	//	ЭлементОтбора = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(Список.Отбор,"Ссылка",ВидСравненияКомпоновкиДанных.ВСписке,СписокПериодов);
	//	
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Периодичность) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Периодичность", Параметры.Периодичность, ВидСравненияКомпоновкиДанных.Равно, ,Истина);
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ДатаНачала) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаНачала", Параметры.ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, ,Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаОкончания", Параметры.ДатаОкончания, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ,Истина);
	КонецЕсли;

КонецПроцедуры
