#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьНачальноеЗаполнение(ОбновитьПолныеНаименования = Истина) Экспорт
	
	ОбъектМетаданных					= Метаданные.Справочники.ОснованияПроведенияИнвентаризации;
	ИмяСобытия							= НСтр("ru='Данные. Изменение'");
	
	КомментарийЗаполнениеНеТребуется	= НСтр("ru='Начальное заполнение справочника ""Основания проведения инвентаризации"" не требуется. Все необходимые элементы справочника уже существуют'");
	КомментарийБылиОшибкиЗаписи			= НСтр("ru='Начальное заполнение справочника ""Основания проведения инвентаризации"". Произошли ошибки записи новых элементов справочника. Подробности см. в журнале регистрации.'");
	
	ШаблонКомментарийОшибкаЗаписи		= НСтр("ru='Начальное заполнение справочника ""Основания проведения инвентаризации"". Ошибка записи элемента ""%1"" справочника. %2'");
	
	ШаблонКомментарийВсегоСоздано		= НСтр("ru='Начальное заполнение справочника ""Основания проведения инвентаризации"". Создано новых элементов: %1'");
	ШаблонКомментарийВсегоПереименовано	= НСтр("ru='Начальное заполнение справочника ""Основания проведения инвентаризации"". Переименовано элементов: %1'");
	
	Статистика = Новый Структура();
	Статистика.Вставить("Создано",			0);
	Статистика.Вставить("Переименовано",	0);
	Статистика.Вставить("ОшибокЗаписи",		0);
	
	ПолныеНаименования = ПолучитьПолныеНаименованияНачальногоЗаполнения();
	
	УжеИмеющиесяЭлементы = ПолучитьУжеИмеющиесяЭлементыНачальногоЗаполнения(ПолныеНаименования);
	
	Поиск = Новый Структура("Наименование");
	
	Для Каждого Элемент Из ПолныеНаименования Цикл
		Наименование		= Элемент.Ключ;
		НаименованиеПолное	= Элемент.Значение;
		
		Поиск.Вставить("Наименование", Наименование);
		
		МассивСтрок = УжеИмеющиесяЭлементы.НайтиСтроки(Поиск);
		
		// Создаем новый элемент справочника
		
		Если МассивСтрок.Количество() = 0 Тогда
			НовыйЭлемент = Справочники.ОснованияПроведенияИнвентаризации.СоздатьЭлемент();
			
			НовыйЭлемент.Наименование		= Наименование;
			НовыйЭлемент.НаименованиеПолное	= НаименованиеПолное;
			
			Попытка
				НовыйЭлемент.Записать();
				
				Статистика.Создано = Статистика.Создано + 1;
			Исключение
				Статистика.ОшибокЗаписи = Статистика.ОшибокЗаписи + 1;
				
				Комментарий = СтрШаблон(ШаблонКомментарийОшибкаЗаписи, Наименование, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
					ИмяСобытия,							// имя события
					УровеньЖурналаРегистрации.Ошибка,	// уровень
					ОбъектМетаданных,					// объект метаданных
					,									// данные
					Комментарий);						// комментарий
			КонецПопытки;
			
			Продолжить;
		КонецЕсли;
		
		Если НЕ ОбновитьПолныеНаименования Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			Если СтрокаТаблицы.НаименованиеПолное <> НаименованиеПолное Тогда
				ЭлементСправочника = СтрокаТаблицы.Ссылка.ПолучитьОбъект();
				
				ЭлементСправочника.НаименованиеПолное = НаименованиеПолное;
				
				Попытка
					ЭлементСправочника.Записать();
					
					Статистика.Переименовано = Статистика.Переименовано + 1;
				Исключение
					Статистика.ОшибокЗаписи = Статистика.ОшибокЗаписи + 1;
					
					Комментарий = СтрШаблон(ШаблонКомментарийОшибкаЗаписи, Наименование, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					ЗаписьЖурналаРегистрации(
						ИмяСобытия,							// имя события
						УровеньЖурналаРегистрации.Ошибка,	// уровень
						ОбъектМетаданных,					// объект метаданных
						,									// данные
						Комментарий);						// комментарий
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если Статистика.Создано = 0 И Статистика.Переименовано = 0 И Статистика.ОшибокЗаписи = 0 Тогда
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,								// имя события
			УровеньЖурналаРегистрации.Информация,	// уровень
			ОбъектМетаданных,						// объект метаданных
			,										// данные
			КомментарийЗаполнениеНеТребуется);		// комментарий
	КонецЕсли;
	
	Если Статистика.Создано > 0 Тогда
		Комментарий = СтрШаблон(ШаблонКомментарийВсегоСоздано, Статистика.Создано);
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,								// имя события
			УровеньЖурналаРегистрации.Информация,	// уровень
			ОбъектМетаданных,						// объект метаданных
			,										// данные
			Комментарий);							// комментарий
	КонецЕсли;
	
	Если Статистика.Переименовано > 0 Тогда
		Комментарий = СтрШаблон(ШаблонКомментарийВсегоПереименовано, Статистика.Переименовано);
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,								// имя события
			УровеньЖурналаРегистрации.Информация,	// уровень
			ОбъектМетаданных,						// объект метаданных
			,										// данные
			Комментарий);							// комментарий
	КонецЕсли;
	
	Если Статистика.ОшибокЗаписи > 0 Тогда
		ВызватьИсключение КомментарийБылиОшибкиЗаписи;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПолныеНаименованияНачальногоЗаполнения()
	
	ПолныеНаименования = Новый Соответствие();
	
	//1
	ПолныеНаименования.Вставить("Хищения, злоупотребления, порча", НСтр("ru='Установление фактов хищений или злоупотреблений, а также порчи имущества'"));
	
	//2
	ПолныеНаименования.Вставить("Стихийное бедствие", НСтр("ru='Стихийное бедствие, пожар, авария или другие чрезвычайные ситуации, в том числе вызванные экстремальными условиями'"));
	
	//3
	ПолныеНаименования.Вставить("Смена ответственного лица", НСтр("ru='Смена ответственного лица'"));
	
	//4
	ПолныеНаименования.Вставить("Передача комплекса объектов", НСтр("ru='Передача (возврат) комплекса объектов учета (имущественного комплекса) в аренду, управление, безвозмездное пользование, хранение, а также  выкуп, продажа комплекса объектов учета (имущественного комплекса)'"));
	
	//5
	ПолныеНаименования.Вставить("Составление отчетности", НСтр("ru='Перед составлением годовой бухгалтерской отчетности (кроме имущества, инвентаризация которого проводилась не ранее 1 октября отчетного года)'"));
	
	//6
	ПолныеНаименования.Вставить("Реорганизация, ликвидация", НСтр("ru='Реорганизация или ликвидация учреждения (организации)'"));
	
	//7
	ПолныеНаименования.Вставить("Другие случаи", НСтр("ru='Другие случаи, предусмотренные законодательством Российской Федерации, иными нормативными правовыми актами Российской Федерации'"));
	
	Возврат ПолныеНаименования;
	
КонецФункции

Функция ПолучитьУжеИмеющиесяЭлементыНачальногоЗаполнения(ПолныеНаименования)
	
	НаименованияПоиск = Новый Массив();
	
	Для Каждого Элемент Из ПолныеНаименования Цикл
		НаименованияПоиск.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("НаименованияПоиск", НаименованияПоиск);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	Ссылка				КАК Ссылка,
	|	Наименование		КАК Наименование,
	|	НаименованиеПолное	КАК НаименованиеПолное
	|ИЗ
	|	Справочник.ОснованияПроведенияИнвентаризации
	|ГДЕ
	|	Наименование В(&НаименованияПоиск)
	|	И НЕ ПометкаУдаления";
	
	Возврат ЗапросПоиск.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
