#Область ОписаниеПеременных

&НаКлиенте
Перем РодительУдаленнойСтроки;
&НаКлиенте
Перем ПеренестиВДокумент;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	СписокКатегорий.ЗагрузитьЗначения(Параметры.КатегорииДовольствующихся);

	ДобавитьДинамическиеКолонки(СписокКатегорий);
		
	Если ЭтоАдресВременногоХранилища(Параметры.СохраненныеПродуктыАдрес) Тогда 
		СохраненныеПродуктыАдрес = Параметры.СохраненныеПродуктыАдрес;
	КонецЕсли;
	
	Если НЕ Параметры.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиМатериалов,
			"ДатаОстатки",
			Новый Граница(Параметры.Ссылка.МоментВремени(), ВидГраницы.Исключая),
			Истина);
		Заголовок = СтрШаблон(НСтр("ru = 'Ручное заполнение: %1'"), Параметры.Ссылка);
	ИначеЕсли ЗначениеЗаполнено(Параметры.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиМатериалов,
			"ДатаОстатки",
			Новый Граница(КонецДня(Параметры.Дата), ВидГраницы.Включая),
			Истина);
	КонецЕсли;
	
	УчетПоПодразделениям = Ложь;
	ИспользуемыеСчета = ПолучитьСписокСчетовУчетаПродуктовПитания(УчетПоПодразделениям);
	УчетПоПодразделениям = УчетПоПодразделениям И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОстаткиМатериалов,
		"Организация",
		Параметры.Организация,
		ВидСравненияКомпоновкиДанных.Равно,
		"",
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОстаткиМатериалов,
		"ЦМО",
		Параметры.ЦМО,
		ВидСравненияКомпоновкиДанных.Равно,
		"",
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОстаткиМатериалов,
		"Счет",
		ИспользуемыеСчета,
		ВидСравненияКомпоновкиДанных.ВСписке,
		"",
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	Если УчетПоПодразделениям Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОстаткиМатериалов,
			"Подразделение",
			Параметры.Подразделение,
			ВидСравненияКомпоновкиДанных.Равно,
			"",
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	КонецЕсли;
	
	Если ИспользоватьУчетПоИФО Тогда
		МассивКлючей = Новый Массив(ОстаткиМатериалов.ПоляКлюча);
		МассивКлючей.Добавить("ИФО");
		ОстаткиМатериалов.ПоляКлюча = Новый ФиксированныйМассив(МассивКлючей);
	КонецЕсли;

	ЗаполнитьТаблицуПродуктовИзДокумента();
	УстановитьВидимостьПанелиОстатков(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И ПеренестиВДокумент <> Истина Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Таблица продуктов была изменена.
			|Перенести таблицу продуктов в документ?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Перенести в документ'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Закрыть форму'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Вернуться к редактированию'"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, 20, КодВозвратаДиалога.Да, НСтр("ru = 'Таблица продуктов была изменена'"));
		Возврат;
		
	КонецЕсли;
	
	Если Модифицированность И ПеренестиВДокумент = Истина Тогда
		Если НЕ ПроверитьЗаполнениеРеквизитовТаблицы() Тогда
			Отказ = Истина;
			ПеренестиВДокумент = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент = Истина Тогда
		АдресВХранилище = ПоместитьВХранилищеТаблицуВДокумент();
		ОповеститьОВыборе(АдресВХранилище);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаМатериалов

&НаКлиенте
Процедура ТаблицаМатериаловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	
	Если Копирование Тогда
		ТекущийРодитель = ТекущиеДанные.ПолучитьРодителя();
	Иначе
		ТекущийРодитель = Неопределено;
	КонецЕсли;
	
	Если ТекущийРодитель = Неопределено Тогда
		НовыйЭлемент = ТаблицаМатериалов.ПолучитьЭлементы().Добавить();
	Иначе
		НовыйЭлемент = ТекущийРодитель.ПолучитьЭлементы().Добавить();
	КонецЕсли;
	
	Если Копирование Тогда
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, ТекущиеДанные);
	КонецЕсли;
	
	НовыйЭлемент.КоличествоПодчиненныхНеПравильное = Ложь;
	
	Элементы.ТаблицаМатериалов.ТекущаяСтрока = НовыйЭлемент.ПолучитьИдентификатор();
	Элементы.ТаблицаМатериалов.ИзменитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииКоличестваПоКатегорииДовольствующихся(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьКоличествоПоСтроке(ТекущиеДанные, Неопределено, ТаблицаКатегорийДовольствующихся);
	
	Если ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		ТекущиеДанные.КоличествоПодчиненныхНеПравильное = Ложь;
	Иначе
		ПересчитатьКоличествоПоКолонкам(ТекущиеДанные.ПолучитьРодителя());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = ТекущиеДанные.ПолучитьЭлементы().Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловПослеУдаления(Элемент)
	
	Если РодительУдаленнойСтроки <> Неопределено Тогда
		
		ПересчитатьКоличествоПоКолонкам(РодительУдаленнойСтроки);
		РодительУдаленнойСтроки = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловПередУдалением(Элемент, Отказ)
	РодительУдаленнойСтроки = Неопределено;
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РодительУдаленнойСтроки = ТекущиеДанные.ПолучитьРодителя();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПодбиратьВсе И МножественныйВыбор Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПоискСтрокиОстатковМатериалов", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериаловПриИзмененииРеквизитовКлючаПоиска(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловКФОПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериаловПриИзмененииРеквизитовКлючаПоиска(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловСчетУчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериаловПриИзмененииРеквизитовКлючаПоиска(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловКПСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериаловПриИзмененииРеквизитовКлючаПоиска(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловИФОПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМатериаловПриИзмененииРеквизитовКлючаПоиска(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаМатериаловПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если РежимИзмененияСтрокиМатериалы Тогда
		РежимИзмененияСтрокиМатериалы = Ложь;
		ПодключитьОбработчикОжидания("АктивацияСтрокиОстатковМатериалов", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОстаткиМатериалов

&НаКлиенте
Процедура ОстаткиМатериаловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДобавитьМатериалВТаблицу(Элементы.ОстаткиМатериалов.ВыделенныеСтроки);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПодбиратьВсеПриИзменении(Элемент)
	
	Если ПодбиратьВсе Тогда
		АдресТаблицыКатегорийВХранилище = ПоместитьТаблицуКатегорийВХранилище();
	Иначе
		АдресТаблицыКатегорийВХранилище = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ДобавитьМатериалВТаблицу(Элементы.ОстаткиМатериалов.ВыделенныеСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПодчиненным(Команда)
	ДобавитьМатериалВТаблицу(Элементы.ОстаткиМатериалов.ВыделенныеСтроки, Элементы.ТаблицаМатериалов.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненный(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийРодитель = ТекущиеДанные.ПолучитьРодителя(); 
	Если ТекущийРодитель = Неопределено Тогда
		ТекущийРодитель = ТекущиеДанные;
	КонецЕсли;
	
	НовЭлемент = ТекущийРодитель.ПолучитьЭлементы().Добавить();
	ПересчитатьКоличествоПоКолонкам(ТекущийРодитель);
	Элементы.ТаблицаМатериалов.ТекущаяСтрока = НовЭлемент.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПанельОстатков(Команда)
	ПоказыватьОстатки = НЕ ПоказыватьОстатки;
	УстановитьВидимостьПанелиОстатков(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКолонки(Команда)
		
	СписокКатегорий.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ПродолжитьОчисткуКолонок", ЭтотОбъект),
		НСтр("ru = 'Отметьте колонки, которые следует очистить'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Если НЕ ПроверитьЗаполнениеРеквизитовТаблицы() Тогда
			Возврат;
		КонецЕсли;
		ПеренестиВДокумент = Истина;
	Иначе
		Модифицированность = Ложь;
	КонецЕсли;
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ДобавитьДинамическиеКолонки(СписокКатегорийДовольствующихся)

	НовыеРеквизиты = Новый Массив;
	
	Для каждого Категория Из СписокКатегорийДовольствующихся Цикл
		
		ИмяКолонки = "_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "");
		СтрокаКД = ТаблицаКатегорийДовольствующихся.Добавить();
		СтрокаКД.КатегорияДовольствующихся = Категория.Значение;
		СтрокаКД.ИмяКолонки = ИмяКолонки;
		
		НовыеРеквизиты.Добавить(Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)), "ТаблицаМатериалов", Строка(Категория.Значение), Истина));
	
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	
	Для каждого СтрокаКД Из ТаблицаКатегорийДовольствующихся Цикл
		
		НовыйЭлемент = Элементы.Добавить(СтрокаКД.ИмяКолонки, Тип("ПолеФормы"), Элементы.ТаблицаМатериалов);
		НовыйЭлемент.ПутьКДанным = "ТаблицаМатериалов." + СтрокаКД.ИмяКолонки;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииКоличестваПоКатегорииДовольствующихся");
		
	КонецЦикла;

КонецПроцедуры // ДобавитьДинамическиеКолонки()

&НаСервере
Процедура ЗаполнитьТаблицуПродуктовИзДокумента()

	ТаблицаМатериалов.ПолучитьЭлементы().Очистить();
	
	Если Не ЭтоАдресВременногоХранилища(СохраненныеПродуктыАдрес) Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеКатегорийДовольствующихся = СоответствиеКатегорийДовольствующихся(ТаблицаКатегорийДовольствующихся);
	
	МатериалыДокумента = ПолучитьИзВременногоХранилища(СохраненныеПродуктыАдрес);
	МатериалыДокумента.Сортировать("Номенклатура, КатегорияДовольствующихся");
	ДанныеТекущейСтроки = Новый Структура("Номенклатура, КФО, КПС, СчетУчета");
	Если ИспользоватьУчетПоИФО Тогда
		ДанныеТекущейСтроки.Вставить("ИФО");
	КонецЕсли;
	ТаблицаМатериаловОбъект = РеквизитФормыВЗначение("ТаблицаМатериалов");
	Для Каждого ТекМатериал Из МатериалыДокумента Цикл
		
		ЗаполнитьЗначенияСвойств(ДанныеТекущейСтроки, ТекМатериал);
		
		НайденыСтроки = ТаблицаМатериаловОбъект.Строки.НайтиСтроки(ДанныеТекущейСтроки);
		
		Если НайденыСтроки.Количество() = 0 Тогда
			НоваяСтрокаМатериала = ТаблицаМатериаловОбъект.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаМатериала, ДанныеТекущейСтроки);
		Иначе
			НоваяСтрокаМатериала = НайденыСтроки[0];
		КонецЕсли;
		
		НоваяСтрокаМатериала[СоответствиеКатегорийДовольствующихся.Получить(ТекМатериал.КатегорияДовольствующихся)] = ТекМатериал.Количество;
	
	КонецЦикла;
	
	Для каждого ТекущаяСтрока Из ТаблицаМатериаловОбъект.Строки Цикл
		
		Для каждого ПодчиненнаяСтрока Из ТекущаяСтрока.Строки Цикл
		
			ПересчитатьКоличествоПоСтроке(ПодчиненнаяСтрока, СоответствиеКатегорийДовольствующихся, ТаблицаКатегорийДовольствующихся);		
		
		КонецЦикла; 
		
		ПересчитатьКоличествоПоСтроке(ТекущаяСтрока, СоответствиеКатегорийДовольствующихся, ТаблицаКатегорийДовольствующихся);		
	
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(ТаблицаМатериаловОбъект, "ТаблицаМатериалов");
	
КонецПроцедуры // ЗаполнитьТаблицуПродуктовИзДокумента()

&НаКлиентеНаСервереБезКонтекста
Функция СоответствиеКатегорийДовольствующихся(ТаблицаКатегорийДовольствующихся)

	Результат = Новый Соответствие;
	Для каждого ТекКД Из ТаблицаКатегорийДовольствующихся Цикл
	
		Результат.Вставить(ТекКД.КатегорияДовольствующихся, ТекКД.ИмяКолонки);
		
	КонецЦикла;
	Возврат Результат;

КонецФункции // СоответствиеКатегорийДовольствующихся()

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьКоличествоПоСтроке(ТекущаяСтрока, СоответствиеКатегорийДовольствующихся, ТаблицаКатегорийДовольствующихся)

	Если СоответствиеКатегорийДовольствующихся = Неопределено Тогда
		СоответствиеКатегорийДовольствующихся = СоответствиеКатегорийДовольствующихся(ТаблицаКатегорийДовольствующихся);
	КонецЕсли;
	
	ТекущаяСтрока.Количество = 0;
	Для каждого КатегорияДовольствующихся Из СоответствиеКатегорийДовольствующихся Цикл
	
		ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + ТекущаяСтрока[КатегорияДовольствующихся.Значение];
	
	КонецЦикла; 
		

КонецПроцедуры // ПересчитатьКоличествоПоСтроке()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПанелиОстатков(Форма)

	Элементы = Форма.Элементы;
	Элементы.ГруппаОстаткиНоменклатуры.Видимость = Форма.ПоказыватьОстатки;
	УстановитьПараметрыСпискаОстатков(Форма);

КонецПроцедуры // УстановитьВидимостьПанелиОстатков()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыСпискаОстатков(Форма)

	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.Номенклатура"));
	ВидыСубконто.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ЦМО"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ОстаткиМатериалов, "ВидыСубконто", ВидыСубконто, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.ОстаткиМатериалов, "ПоказыватьОстатки", Форма.ПоказыватьОстатки, Истина);

КонецПроцедуры // УстановитьПараметрыСпискаОстатков()

&НаКлиенте
Процедура ДобавитьМатериалВТаблицу(ВыделенныеСтроки, ОбластьДобавления = Неопределено, ИндексМножественногоВыбора = 0, СтрокаАктивации = Неопределено)

	Если ОбластьДобавления = Неопределено Тогда
		ТекущийМатериал = Элементы.ТаблицаМатериалов.ТекущиеДанные;
		Если ТекущийМатериал = Неопределено ИЛИ ТекущийМатериал.ПолучитьРодителя() = Неопределено Тогда
			ОбластьПоиска = ТаблицаМатериалов;
		Иначе
			ОбластьПоиска = ТекущийМатериал.ПолучитьРодителя();
		КонецЕсли;
	Иначе
		Если ОбластьДобавления.ПолучитьРодителя() = Неопределено Тогда
			ОбластьПоиска = ОбластьДобавления;
		Иначе
			ОбластьПоиска = ОбластьДобавления.ПолучитьРодителя();
		КонецЕсли;
	КонецЕсли;
	
	Для Индекс = ИндексМножественногоВыбора По ВыделенныеСтроки.Вграница() Цикл
		СтруктураПоиска = Новый Структура("Номенклатура, КФО, КПС, СчетУчета");
		Если ИспользоватьУчетПоИФО Тогда
			СтруктураПоиска.Вставить("ИФО");
		КонецЕсли;
		ТестоваяСтруктура = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПоиска);
		
		ИдентификаторСтроки = ВыделенныеСтроки[Индекс];
		ТекущиеДанные = Элементы.ОстаткиМатериалов.ДанныеСтроки(ИдентификаторСтроки);
	
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущиеДанные);
		
		ПродолжитьЦикл = Истина;
		Для Каждого ТекЭлемент Из ОбластьПоиска.ПолучитьЭлементы() Цикл
			ЗаполнитьЗначенияСвойств(ТестоваяСтруктура, ТекЭлемент);
			Если СтруктурыИдентичны(СтруктураПоиска, ТестоваяСтруктура) Тогда
				ИдентификаторНайденнаяСтрокаМатериалы = ТекЭлемент.ПолучитьИдентификатор();
				ПродолжитьЦикл = Ложь;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ПродолжитьЦикл Тогда
			Если Не ПодбиратьВсе И ВыделенныеСтроки.Вграница() > 0 Тогда
				Продолжить;
			Иначе
				ТекущаяСтрокаМатериалы = ОбластьПоиска.НайтиПоИдентификатору(ИдентификаторНайденнаяСтрокаМатериалы);
			КонецЕсли;
		Иначе
			ТекущаяСтрокаМатериалы = ОбластьПоиска.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрокаМатериалы, СтруктураПоиска);
		КонецЕсли;
		
		Если ПодбиратьВсе Тогда
			Если ТаблицаКатегорийДовольствующихся.Количество() > 1 Тогда
				
				ПараметрыВвода = Новый Структура("Номенклатура, Остаток, КатегорииДовольствующихся, ЕдиницаИзмерения, ТекущаяСтрокаМатериалы");
				ПараметрыВвода.Номенклатура = ТекущиеДанные.Номенклатура;
				ПараметрыВвода.Остаток = ТекущиеДанные.КоличествоОстаток;
				ПараметрыВвода.ЕдиницаИзмерения = ТекущиеДанные.ЕдиницаИзмерения;
				ПараметрыВвода.КатегорииДовольствующихся = АдресТаблицыКатегорийВХранилище;
				ПараметрыВвода.ТекущаяСтрокаМатериалы = ?(ТекущаяСтрокаМатериалы.Количество > 0,
					СоответствиеКоличествоКатегории(ТекущаяСтрокаМатериалы),
					Неопределено);
				
				ДопПараметры = Новый Структура;
				ДопПараметры.Вставить("СтрокаМатериалы", ТекущаяСтрокаМатериалы);
				ДопПараметры.Вставить("ОбластьПоиска", ОбластьПоиска);
				ДопПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
				ДопПараметры.Вставить("ОбластьДобавления", ОбластьДобавления);
				ДопПараметры.Вставить("ИдентификаторСтроки", Элементы.ОстаткиМатериалов.ТекущаяСтрока);
				ДопПараметры.Вставить("ИндексМножественногоВыбора", ИндексМножественногоВыбора);
				ДопПараметры.Вставить("СтрокаАктивацииМатериалы", СтрокаАктивации);
				
				МножественныйВыбор = Истина;
				ОткрытьФорму("Документ.МенюТребование.Форма.ФормаВводаКоличества", ПараметрыВвода, ЭтотОбъект,,,,
					Новый ОписаниеОповещения("ДобавитьМатериалВТаблицуЗавершение", ЭтотОбъект, ДопПараметры),
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Прервать;
			ИначеЕсли ТаблицаКатегорийДовольствующихся.Количество() = 1 Тогда
				ТекущаяСтрокаМатериалы.Количество = ТекущиеДанные.КоличествоОстаток;
				ТекущаяСтрокаМатериалы[ТаблицаКатегорийДовольствующихся[0].ИмяКолонки] = ТекущаяСтрокаМатериалы.Количество;
			КонецЕсли;
		Иначе
			Если ВыделенныеСтроки.Вграница() = 0 Тогда
				Элементы.ТаблицаМатериалов.ТекущаяСтрока = ТекущаяСтрокаМатериалы.ПолучитьИдентификатор();
				Если ТаблицаКатегорийДовольствующихся.Количество() Тогда
					Элементы.ТаблицаМатериалов.ТекущийЭлемент = Элементы.ТаблицаМатериалов.ПодчиненныеЭлементы[ТаблицаКатегорийДовольствующихся[0].ИмяКолонки];
				КонецЕсли;
				Элементы.ТаблицаМатериалов.ИзменитьСтроку();
				РежимИзмененияСтрокиМатериалы = Истина;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаАктивации = ТекущаяСтрокаМатериалы.ПолучитьИдентификатор();
	КонецЦикла;
	
	Если ОбластьПоиска.ПолучитьЭлементы().Количество() <> 0 Тогда
		ПересчитатьКоличествоПоКолонкам(ОбластьПоиска);
	КонецЕсли;
		
	Если СтрокаАктивации <> Неопределено И Не ПодбиратьВсе Тогда
		Элементы.ТаблицаМатериалов.ТекущаяСтрока = СтрокаАктивации;
	КонецЕсли;

КонецПроцедуры // ДобавитьМатериалВТаблицу()

&НаКлиенте
Процедура ДобавитьМатериалВТаблицуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		
		НоваяСтрока = ДополнительныеПараметры.СтрокаМатериалы;
		СтрокаАктивацииМатериалы = ДополнительныеПараметры.СтрокаАктивацииМатериалы;
		
		ТекущаяСтрокаОстатков = СтруктураПоискаСтроки(ДополнительныеПараметры.ИдентификаторСтроки);
		ТекущаяСтрокаМатериалы = СтруктураПоискаСтроки(НоваяСтрока);
		
		Если СтруктурыИдентичны(ТекущаяСтрокаМатериалы, ТекущаяСтрокаОстатков) Тогда
			СтрокаАктивацииМатериалы = НоваяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
		
		НоваяСтрока.Количество = 0;
		Для Каждого СтрокаРаспределения Из Результат Цикл
			НоваяСтрока.Количество = НоваяСтрока.Количество + СтрокаРаспределения.Количество;
			НоваяСтрока[СтрокаРаспределения.ИмяКолонки] = СтрокаРаспределения.Количество;
		КонецЦикла;
		
		Если ДополнительныеПараметры.ОбластьПоиска.ПолучитьЭлементы().Количество() <> 0 Тогда
			ПересчитатьКоличествоПоКолонкам(ДополнительныеПараметры.ОбластьПоиска);
		КонецЕсли;
		
		Если ДополнительныеПараметры.ИндексМножественногоВыбора < ДополнительныеПараметры.ВыделенныеСтроки.ВГраница() Тогда
			СледующийИндекс = ДополнительныеПараметры.ИндексМножественногоВыбора + 1;
			ДобавитьМатериалВТаблицу(ДополнительныеПараметры.ВыделенныеСтроки, ДополнительныеПараметры.ОбластьДобавления, СледующийИндекс, СтрокаАктивацииМатериалы);
		Иначе
			Если СтрокаАктивацииМатериалы <> Неопределено Тогда
				Элементы.ТаблицаМатериалов.ТекущаяСтрока = СтрокаАктивацииМатериалы;
				Элементы.ОстаткиМатериалов.ВыделенныеСтроки.Очистить();
				Элементы.ОстаткиМатериалов.ВыделенныеСтроки.Добавить(ДополнительныеПараметры.ИдентификаторСтроки);
				МножественныйВыбор = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтруктурыИдентичны(Структура1, Знач Структура2)
	Перем ЗначениеСвойства;
	
	Если Структура1.Количество() <> Структура2.Количество() Тогда
		// если количество ключей различно, то и структуры различны
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого КлючИЗначение Из Структура1 Цикл
		Если НЕ Структура2.Свойство(КлючИЗначение.Ключ, ЗначениеСвойства)
			ИЛИ ЗначениеСвойства <> КлючИЗначение.Значение Тогда
			
			// ключ не найден во второй структуре или содержит значение отличное от значения в первой структуре
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции // СтруктурыИдентичны()

&НаКлиенте
Процедура ПересчитатьКоличествоПоКолонкам(ТекущийРодитель)

	Если ТипЗнч(ТекущийРодитель) = Тип("ДанныеФормыДерево") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыРодителя = ТекущийРодитель.ПолучитьЭлементы();
	КоличествоВсего = 0;
	
	Для каждого ПодчиненнаяСтрока Из ЭлементыРодителя Цикл
	
		КоличествоВсего  = КоличествоВсего  + ПодчиненнаяСтрока.Количество;
	
	КонецЦикла;
	
	ТекущийРодитель.КоличествоПодчиненныхНеПравильное = ЭлементыРодителя.Количество() > 0 И КоличествоВсего <> ТекущийРодитель.Количество;
	
КонецПроцедуры // ПересчитатьКоличествоПоКолонкам()

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.OK);
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеРеквизитовТаблицы()

	Отказ = Ложь;
	Для Каждого СтрокаТаблицы Из ТаблицаМатериалов.ПолучитьЭлементы() Цикл
		ПодчиненныеСтроки = ТаблицаМатериалов.ПолучитьЭлементы();
		Если ПодчиненныеСтроки.Количество() = 0 Тогда
			ПроверитьЗаполнениеСтроки(СтрокаТаблицы, Отказ);
		Иначе
			Для Каждого ВложеннаяСтрока Из ПодчиненныеСтроки Цикл
				ПроверитьЗаполнениеСтроки(ВложеннаяСтрока, Отказ);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Возврат Не Отказ;

КонецФункции

&НаКлиенте
Процедура ПроверитьЗаполнениеСтроки(СтрокаТаблицы, Отказ)

	ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "ИмяПоля");
	ЕстьОшибки = Ложь;
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
		ИндексСтроки = ТаблицаМатериалов.ПолучитьЭлементы().Индекс(СтрокаТаблицы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрЗаменить(ТекстОшибки, "ИмяПоля", "Продукт"),,,,Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.КФО) Тогда
		ИндексСтроки = ТаблицаМатериалов.ПолучитьЭлементы().Индекс(СтрокаТаблицы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрЗаменить(ТекстОшибки, "ИмяПоля", "КФО"),,,,Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СтрокаТаблицы.КПС) Тогда
		ИндексСтроки = ТаблицаМатериалов.ПолучитьЭлементы().Индекс(СтрокаТаблицы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрЗаменить(ТекстОшибки, "ИмяПоля", "КПС"),,,,Отказ);
	КонецЕсли;
	Если ИспользоватьУчетПоИФО И Не ЗначениеЗаполнено(СтрокаТаблицы.ИФО) Тогда
		ИндексСтроки = ТаблицаМатериалов.ПолучитьЭлементы().Индекс(СтрокаТаблицы);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрЗаменить(ТекстОшибки, "ИмяПоля", "ИФО"),,,,Отказ);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилищеТаблицуВДокумент(Отказ = Ложь)

	КолонкиКД = СоответствиеКатегорийДовольствующихся(ТаблицаКатегорийДовольствующихся);
	ТаблицаВДокумент = Документы.МенюТребование.СоздатьДокумент().Материалы.ВыгрузитьКолонки();
	
	Для каждого МатериалВДокумент Из ТаблицаМатериалов.ПолучитьЭлементы() Цикл
		
		Если МатериалВДокумент.ПолучитьЭлементы().Количество() = 0 Тогда
		
			ДобавитьСтрокуВТаблицуДокумента(ТаблицаВДокумент, МатериалВДокумент, КолонкиКД);
			
		Иначе
			
			Для каждого ВложеннаяСтрока Из МатериалВДокумент.ПолучитьЭлементы() Цикл
				
				ДобавитьСтрокуВТаблицуДокумента(ТаблицаВДокумент, ВложеннаяСтрока, КолонкиКД);
			
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЦикла; 
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВДокумент);

КонецФункции // ПоместитьВХранилищеТаблицуВДокумент()

&НаСервере
Процедура ДобавитьСтрокуВТаблицуДокумента(ТаблицаВДокумент, СтрокаТаблицыМатериалов, КолонкиКД)

	Для каждого КатегорияДовольствующихся Из КолонкиКД Цикл
	
		Если СтрокаТаблицыМатериалов[КатегорияДовольствующихся.Значение] <> 0 Тогда
			
			НоваяСтрокаВДокумент = ТаблицаВДокумент.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаВДокумент, СтрокаТаблицыМатериалов,,"Количество");
			НоваяСтрокаВДокумент.Количество = СтрокаТаблицыМатериалов[КатегорияДовольствующихся.Значение];
			НоваяСтрокаВДокумент.КатегорияДовольствующихся = КатегорияДовольствующихся.Ключ;
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры // ДобавитьСтрокуВТаблицуДокумента()

&НаСервере
Функция ПолучитьСписокСчетовУчетаПродуктовПитания(УчетПоПодразделениям)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Счет105", БухгалтерскийУчетПовтИсп.ПолучитьМассивСчетов("105.00"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка,
	|	ЕПСБУ.УчетПоПодразделениям КАК УчетПоПодразделениям
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В(&Счет105)
	|	И ПОДСТРОКА(ЕПСБУ.Код, 6, 1) = ""2""
	|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	СписокСчетов = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		СписокСчетов.Добавить(Выборка.Ссылка);
		УчетПоПодразделениям = УчетПоПодразделениям Или Выборка.УчетПоПодразделениям;
	КонецЦикла;
	
	Возврат СписокСчетов;

КонецФункции // ПолучитьСписокСчетовУчетаПродуктовПитания()

&НаКлиенте
Процедура ПродолжитьОчисткуКолонок(ВыбранныеЗначения, ДополнительныеПараметры) Экспорт

	Если ВыбранныеЗначения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтмеченныеЗначения = Новый Массив;
	
	Для каждого ТекКатегория Из ТаблицаКатегорийДовольствующихся Цикл
	
		Если ВыбранныеЗначения.НайтиПоЗначению(ТекКатегория.КатегорияДовольствующихся).Пометка Тогда
			ОтмеченныеЗначения.Добавить(ТекКатегория.ИмяКолонки);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ОтмеченныеЗначения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеКатегорийДовольствующихся = СоответствиеКатегорийДовольствующихся(ТаблицаКатегорийДовольствующихся);
	Для каждого ТекСтрока Из ТаблицаМатериалов.ПолучитьЭлементы() Цикл
		
		ВложенныеСтроки = ТекСтрока.ПолучитьЭлементы();
		Для каждого ВложеннаяСтрока Из ТекСтрока.ПолучитьЭлементы() Цикл
		
			Для каждого ТекКолонка Из ОтмеченныеЗначения Цикл
			
				ВложеннаяСтрока[ТекКолонка] = 0;
			
			КонецЦикла;
			
			ПересчитатьКоличествоПоСтроке(ВложеннаяСтрока, СоответствиеКатегорийДовольствующихся, ТаблицаКатегорийДовольствующихся);
		
		КонецЦикла;
		
		Для каждого ТекКолонка Из ОтмеченныеЗначения Цикл
		
			ТекСтрока[ТекКолонка] = 0;
		
		КонецЦикла;
		ПересчитатьКоличествоПоСтроке(ТекСтрока, СоответствиеКатегорийДовольствующихся, ТаблицаКатегорийДовольствующихся);
		
		Если ВложенныеСтроки.Количество() > 0 Тогда
			ПересчитатьКоличествоПоКолонкам(ТекСтрока);
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Функция СтруктураПоискаСтроки(ТекущиеДанные)
	
	ТекущийПоискСтрокиОстатков = Новый Структура("Номенклатура, СчетУчета, КФО, КПС",
	ТекущиеДанные.Номенклатура,
	ТекущиеДанные.СчетУчета,
	ТекущиеДанные.КФО,
	ТекущиеДанные.КПС);
	Если ИспользоватьУчетПоИФО Тогда
		ТекущийПоискСтрокиОстатков.Вставить("ИФО", ТекущиеДанные.ИФО);
	КонецЕсли;
	
	Возврат ТекущийПоискСтрокиОстатков;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаМатериаловПриИзмененииРеквизитовКлючаПоиска(ТекущиеДанные)
		
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура)
		И ЗначениеЗаполнено(ТекущиеДанные.СчетУчета)
		И ЗначениеЗаполнено(ТекущиеДанные.КФО)
		И ЗначениеЗаполнено(ТекущиеДанные.КПС)
		И ?(ИспользоватьУчетПоИФО, ЗначениеЗаполнено(ТекущиеДанные.ИФО), Истина) Тогда
		ТекущийПоискСтрокиОстатков = СтруктураПоискаСтроки(ТекущиеДанные);
		Элементы.ОстаткиМатериалов.ТекущаяСтрока = Новый КлючСтрокиДинамическогоСписка(ТекущийПоискСтрокиОстатков);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоискСтрокиОстатковМатериалов()
	
	ТекущиеДанные = Элементы.ТаблицаМатериалов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущийПоискСтрокиОстатков = СтруктураПоискаСтроки(Элементы.ТаблицаМатериалов.ТекущиеДанные);
	Элементы.ОстаткиМатериалов.ТекущаяСтрока = Новый КлючСтрокиДинамическогоСписка(ТекущийПоискСтрокиОстатков);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивацияСтрокиОстатковМатериалов()

	ЭтотОбъект.ТекущийЭлемент = Элементы.ОстаткиМатериалов;
	Элементы.ОстаткиМатериалов.ТекущийЭлемент = Элементы.ОстаткиМатериалов.ПодчиненныеЭлементы.ОстаткиМатериаловНоменклатура;

КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуКатегорийВХранилище()
	Возврат ПоместитьВоВременноеХранилище(ТаблицаКатегорийДовольствующихся.Выгрузить(), УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Функция СоответствиеКоличествоКатегории(СтрокаМатериалы)
	
	КоличествоКатегории = Новый Соответствие;
	Для Каждого СтрокаКатегория Из ТаблицаКатегорийДовольствующихся Цикл
		КоличествоКатегории.Вставить(СтрокаКатегория.ИмяКолонки, СтрокаМатериалы[СтрокаКатегория.ИмяКолонки]);
	КонецЦикла;
	
	Возврат КоличествоКатегории;

КонецФункции

#КонецОбласти
