////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидГСМ") Тогда
		СписокДоступныхЗначенийВидаГСМ = Новый СписокЗначений;
		СписокДоступныхЗначенийВидаГСМ.Добавить(Параметры.ВидГСМ);
		СписокДоступныхЗначенийВидаГСМ.Добавить(Справочники.ВидыГСМ.ПустаяСсылка());
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидГСМ");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = СписокДоступныхЗначенийВидаГСМ;
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОбъектаРасходаГСМ") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОбъектаРасхода");
	    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	    ЭлементОтбора.Использование = Истина;
	    ЭлементОтбора.ПравоеЗначение = Параметры.ВидОбъектаРасходаГСМ;
	КонецЕсли;
	
КонецПроцедуры
