
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ВариантМеню) Тогда
		Элементы.ВариантМеню.ТолькоПросмотр	= Истина;
		Элементы.ВариантМеню.КнопкаОткрытия	= Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.Порядок) Тогда
		Элементы.Порядок.ТолькоПросмотр	= Истина;
		Элементы.Порядок.КнопкаОткрытия = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БлюдоПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.Блюдо) Тогда
		ЗаполнитьЗначенияСвойств(Запись, ДанныеСпецификацииБлюда(Запись.Блюдо));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СпецификацияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Запись.Спецификация) Тогда
		Запись.Выход = ВыходПоСпецификации(Запись.Спецификация);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ДанныеСпецификацииБлюда(Знач Блюдо)
	Возврат Справочники.СпецификацииНоменклатуры.ДанныеСпецификацииБлюда(Блюдо);
КонецФункции

&НаСервереБезКонтекста
Функция ВыходПоСпецификации(Знач Спецификация)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Спецификация, "Выход");
КонецФункции

#КонецОбласти
