
#Область ОписаниеПеременных

&НаКлиенте
Перем ВидПоступленияДоИзменения; // ПеречислениеСсылка.ВидыПоступленийМЗ

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьКорректировка",
		"ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Нет);
	УстановитьУсловноеОформление();
	УстановитьУсловноеОформлениеЧленовКомиссии();
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Инициализация данных формы, не зависящих от ключа объекта
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьВалютаНДС",
		"Доступность", ТолькоПросмотр <> Истина);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьТекстПроСчетФактуруСервер();
	УправлениеМатериальнымиЗапасами.УстановитьКорректирующийДокумент(ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьСвойстваЭлементовГруппыКорректировка(ЭтотОбъект);
	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448();
	УправлениеМатериальнымиЗапасамиФормы.СохранитьПараметрыВыбораКЭК(ЭтотОбъект, Элементы.МатериалыКЭК);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБаннерУведомлениеОВвозе",
			"Видимость", Ложь);
		Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;
		
		// Установить зачет аванса и учет НДС по виду поступления
		УстановитьЗачетАванса(ЭтотОбъект);
		УстановитьУчетНДС(ЭтотОбъект);
		УстановитьВалюту(ЭтотОбъект);
		
		ПодготовитьФормуНаСервере();
		УстановитьОтражатьВПрослеживаемости(ЭтотОбъект);
		УстановитьКодОперацииПрослеживаемости(ЭтотОбъект);
		УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
		
		ЗапретитьИнтерактивныйВводСтрокВДокументахСписанияНФА = Константы.ЗапретитьИнтерактивныйВводСтрокВДокументахСписанияНФА.Получить();
		ОбщегоНазначенияБГУ.УстановитьНастройкуДоступностиРедактированияСтрокВДокументахНФА(ЭтотОбъект);
		УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
		
		Если Не Параметры.ЗначениеКопирования.Пустая()
				И Объект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования
				И ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Если Не ЗначениеЗаполнено(Объект.ПолучательИмущества) Тогда
				Объект.ПолучательИмущества = ЕдинственныйСотрудникПоКонтрагенту(Объект.Контрагент, Объект.Организация);
			КонецЕсли;
			Если ЗначениеЗаполнено(Объект.ПолучательИмущества) Тогда
				Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли Параметры.ЗначениеКопирования.Пустая() Тогда
			ЗаполнитьОтветственныеЛица();
		КонецЕсли;
	
	Иначе
		// При первом открытии формы существующего документа параметры нужно установить здесь, а не в ПриЧтенииНаСервере
		ИзменитьОтборКЭК();
	КонецЕсли;
	
	// ИнтеграцияИС
	ИнтеграцияИС.ПриСозданииНаСервереВФормеДокументаОснования(ЭтотОбъект, Объект, ИнтеграцияИС.ПараметрыИнтеграцииВФорме("ВетИС", ИнтеграцияИС.ИмяЭлементаДляРазмещения()));
	// Конец ИнтеграцияИС
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	ВидимостьЭлементовЭДОДляЭДПоставщика = ВидимостьЭлементовЭДОДляДокумента();
	ВидимостьЭлементовЭДОАкта448 = ВидимостьЭлементовЭДОАкта448();
	УстановитьВидимостьЭлементовЭДО(ЭтотОбъект, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448);
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
	// Конец подсистема "ОбменСКонтрагентами".
	
	ВестиКонтрольОстатковТоваров = РозничныеПродажиБГУ.ЭтоСкладТорговойТочки(Объект.ЦМО);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПоступлениеТоваровНаСкладТорговойТочки", "Видимость", ВестиКонтрольОстатковТоваров);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом

	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект, Истина);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаПодписанияПервичногоДокумента = Объект.Дата;
	КонецЕсли; 
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаБаннерУведомлениеОВвозе",
		"Видимость", Ложь);

	Если ЭтоВозвратИзЛичногоПользования(Объект.ВидПоступленияМЗ)
		И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПриСозданииНаСервереЗаполненКонтрагент = Истина;
	КонецЕсли;

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части

	ЗапретитьИнтерактивныйВводСтрокВДокументахСписанияНФА = Константы.ЗапретитьИнтерактивныйВводСтрокВДокументахСписанияНФА.Получить();
	ОбщегоНазначенияБГУ.УстановитьНастройкуДоступностиРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ПодготовитьФормуНаСервере();
		
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);   
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);	
	
	// Вид межотчетного периода необходимо очистить, если дата <> конец года.
	// После очистки реквизита выбранная типовая операция может оказаться недопустимой
	ОбщегоНазначенияБГУ.ОчиститьВидМежотчетногоПериода(ТекущийОбъект, Объект);
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	УправлениеМатериальнымиЗапасамиФормыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	УстановитьВидимостьДанныхДрагМатериалов();
	
	Если Объект.ЭтоКорректировка Тогда
		Оповестить("Запись_ПоступлениеМЗ", Объект.ДокументОснование, Объект.Ссылка);
	Иначе
		Оповестить("Запись_ПоступлениеМЗ", ПараметрыЗаписи, Объект.Ссылка);
	КонецЕсли;

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение, ИсточникВыбора.ИмяТаблицы);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ДобавлениеСпискаДМ.Форма.Форма" Тогда
		ОбработкаДобавленияДМДляОбъектаНаСервере(ВыбранноеЗначение);
		УстановитьВидимостьДанныхДрагМатериалов();
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаВыбора" Тогда
		ТекДанные = Элементы.СписокНФАДокументаОснования.ТекущиеДанные;
		Если НЕ ТекДанные = Неопределено Тогда
			ДобавитьДрагМатериалыОбъектаПоТехДокументации(ВыбранноеЗначение, ТекДанные.Номенклатура, ТекДанные.Количество);
		КонецЕсли;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КонтрольИсполненияДоговоров" Тогда
		Объект.ОтразитьВГрафикеИсполненияДоговора = ВыбранноеЗначение;
		КонтрольИсполненияДоговоровКлиент.УстановитьСтатусОтразитьДокументВГрафикеИсполнения(
			ЭтотОбъект, Объект.ОтразитьВГрафикеИсполненияДоговора);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТ" Тогда
		ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.СведенияЭлектронногоАктаОПриемеПередачеНФА" Тогда
		ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ВыбранноеЗначение);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭДАктов" Тогда
		ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьДрагМатериалы" Тогда
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
	КонецЕсли;	
	
	Если ИмяСобытия = "Запись_СчетФактураПолученный"
		ИЛИ ИмяСобытия = "Запись_ИсправительныйСчетФактураПолученный"
		ИЛИ ИмяСобытия = "Запись_КорректировочныйСчетФактураПолученный" Тогда
		
		ЗаполнитьТекстПроСчетФактуруКлиент(Параметр, Источник);
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_ПоступлениеМЗ" И Параметр = Объект.Ссылка Тогда
		ОбновитьДанныеКорректировки();
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_УведомлениеОВвозеПрослеживаемыхТоваров" 
		И ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("ПервичныйДокумент") И Объект.Ссылка = Параметр.ПервичныйДокумент 
		ИЛИ ИмяСобытия = "СозданыУведомленияВПомощникеПолученияРНПТ" Тогда
		
		УстановитьПредставлениеНадписиУведомлениеОВвозе();
		ПодключитьОбработчикОжидания("Подключаемый_НапоминатьОбУведомленияхОВвозе", 0.1, Истина);
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияИС
	ИнтеграцияИСКлиент.ОбработкаОповещенияВФормеДокументаОснования(
		ЭтотОбъект,
		Объект,
		ИмяСобытия,
		Параметр,
		Источник);
	// Конец ИнтеграцияИС
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	УправлениеМатериальнымиЗапасами.УстановитьТипНоменклатурыВСтрокахДляБиологическихАктивов(Объект.Материалы);
	УстановитьДанныеДинамическихКолонок();
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, ТекущийОбъект);
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	УправлениеНФА.ПроверитьЗаполнение(Объект, "Материалы", Отказ);
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СобытияФормИСКлиентПереопределяемый.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтотОбъект.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтотОбъект, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	Если ВедетсяУчетПрослеживаемыхТоваров И ЕстьПрослеживаемыеТовары Тогда
		УстановитьОбязательностьДатыНомераДокументаПоставщика();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидПоступленияМЗПриИзменении(Элемент)
	
	Если ТребуетсяПерезаполнитьСписокСчетовУчетаВШапке() Тогда
		ОбновитьДанныеСчетовВФорме();
	КонецЕсли;
	Если Объект.ВидПоступленияМЗ <> ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета") Тогда
		Объект.ЗабалансовыйСчет = ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка");
	КонецЕсли;
	УстановитьОграниченияТиповДокументаОснования(ЭтотОбъект, Объект);
	ВыполнитьПриведениеЗначенияДокументаОснования();
	УстановитьСчетУчетаВШапке();
	УстановитьЗачетАванса(ЭтотОбъект);
	УстановитьУчетНДС(ЭтотОбъект);
	УстановитьОтражатьВПрослеживаемости(ЭтотОбъект);
	УстановитьКодОперацииПрослеживаемости(ЭтотОбъект);
	УстановитьДопустимыеКодыОперацийПрослеживаемости(ЭтотОбъект);
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьВидимостьЭлементов(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров,
		ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей,
		Объект.ВидПоступленияМЗ);
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
	ВидПоступленияМЗПриИзмененииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	УстановитьДоступностьИзмененияСчетовУчета(ЭтотОбъект, Объект);
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьЗаголовокЗакладкиВозвратИзАренды(ЭтотОбъект);
	УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПоступленияМЗОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВидПоступленияДоИзменения = Объект.ВидПоступленияМЗ;
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Тип") Тогда 
		Возврат;
	КонецЕсли;
	
	Если (Объект.Материалы.Количество() > 0) И (ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика")) Тогда
		СтандартнаяОбработка = Ложь;
		Объект.ДокументОснование = ВыбранноеЗначение;
		Модифицированность = Истина;
		
		Возврат;
	КонецЕсли;	
	
	Если (Объект.Материалы.Количество() > 0 Или  Объект.ВозвратнаяТара.Количество() > 0)
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстВопроса = НСтр("ru='Документ будет перезаполнен, существующие строки удалены!'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Выполнить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отменить выбор документа'"));
		
		ДополнительныеПараметры = Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДокументОснованиеОбработкаВыбораЗавершение", ЭтотОбъект,
			ДополнительныеПараметры), ТекстВопроса, Кнопки, ,КодВозвратаДиалога.Да);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьПоДокументуОснованию(Объект.ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования") Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ОрганизацияСотрудника", Объект.Организация));
		ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Контрагент);
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СчетУчета", Объект.СчетУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетУчета <> Объект.СчетУчета Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КэшПараметров.Локальные.СчетУчета) Тогда
			// Если счет не был заполнен. Дополнительных вопросов не требуется.
			СчетУчетаПриИзмененииНаСервере();
			Возврат;
		КонецЕсли;
		
		Если Объект.Материалы.Количество() = 0 Тогда
			// Документ пустой. Дополнительных вопросов не требуется.
			СчетУчетаПриИзмененииНаСервере();
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = НСтр("ru = 'При изменении счета учета документа будет изменен счет учета в таблице ""Материалы"".
			|Изменить счет учета?'");
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить счет учета'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять счет учета'"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОбИзмененииСчетаУчета", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, 20, КодВозвратаДиалога.Да);
		Возврат;
		
	КонецЕсли;
	
	СчетУчетаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансаПриИзменении(Элемент)
	
	УчетРасчетовКлиент.СпособЗачетаАвансаПриИзменении(Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя")
		И ВыбранноеЗначение <> ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать") Тогда
		СтандартнаяОбработка = Ложь;
		Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
		ПоказатьПредупреждение(Неопределено, Элементы.СпособЗачетаАванса.ПредупреждениеПриРедактировании);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьОплатуПриИзменении(Элемент)
	
	Если Объект.ЗапланироватьОплату Тогда
		ДатаДокумента = ?(ЗначениеЗаполнено(Объект.ДатаПодписанияПервичногоДокумента), Объект.ДатаПодписанияПервичногоДокумента, Объект.Дата);
		Объект.ОплатитьДо = ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Объект.Договор);
	Иначе
		Объект.ОплатитьДо = Неопределено;
	КонецЕсли;
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПодписанияПервичногоДокументаПриИзменении(Элемент)
	
	Если Объект.ЗапланироватьОплату И ЗначениеЗаполнено(Объект.ДатаПодписанияПервичногоДокумента) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросПересчитатьДатуОплатитьДо", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Пересчитать крайний срок оплаты (предельную дату исполнения) от даты подписания?'"), РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаДрагМатериалы" Тогда
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаДополнительно" Тогда
		ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НадписьВалютаНДСНажатие(Элемент, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	УстановитьВДокументеВозможенУчетНДС();
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	ОтветственныйПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураНажатие(Элемент, СтандартнаяОбработка)
	Если НЕ (УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
		Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект)) Тогда
		ПоказатьПредупреждение(Неопределено,
			НСтр("ru = 'Для поступления на забалансовые счета не вводится счет-фактура'"), 20);
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	ВведенНаОснованииЭДП = Ложь;
	ЭлектронныеДокументыБГУКлиент.ОткрытьДокументОснованиеПоСсылкеСостояниеЭДО(ЭтотОбъект, Объект.Ссылка,
		СтандартнаяОбработка, ВведенНаОснованииЭДП, Объект.ДокументОснование);
		
	Если НЕ ВведенНаОснованииЭДП Тогда
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448()
	Возврат ЭлектронныеДокументыБГУ.НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
КонецФункции

&НаКлиенте
Процедура НадписьДопСведенияЭлектронногоАктаПоФорме0510448Нажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Параметры.Ключ.Пустая() Тогда
		ТекстОшибки = НСтр("ru='Необходимо записать документ для заполнение сведений электронного акта о приеме-передаче НФА.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыДопСведений = НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
	
	ПараметрыДопСведений.Ссылка = Объект.Ссылка;
	ПараметрыДопСведений.ДатаСведений = Объект.Дата;
	ПараметрыДопСведений.Организация = Объект.Организация;
	
	ЭлектронныеДокументыБГУКлиент.ОткрытьФормуДопСведенийДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, Объект, ПараметрыДопСведений);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦМОПриИзменении(Элемент)
	ЦМОПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	Объект.Дата = КонецГода(Объект.Дата);
	БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
КонецПроцедуры

&НаКлиенте
Процедура ЗабалансовыйСчетПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ЗабалансовыйСчет) Тогда
		ПрочитатьСвойстваЗабалансовогоСчета();
	Иначе
		ОчиститьСвойстваЗабалансовогоСчета(ЭтотОбъект);
	КонецЕсли;
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьЗаголовокСубконтоЗабалансовогоСчета(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаЗакрытьБаннерНажатие(Элемент)
	
	ОтключитьБаннерУведомленийОВвозе = Истина;
	ПодключитьОбработчикОжидания("Подключаемый_НапоминатьОбУведомленияхОВвозе", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУведомлениеОВвозеОбработкаНавигационнойСсылки(
	Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ПрослеживаемостьФормыБГУКлиент.СоздатьПоказатьУведомления(
		ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВПрослеживаемостиПриИзменении(Элемент)
	РассчитатьНеобходимостьНапоминанияОВвозе();
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ВидПоступленияМЗПриИзмененииНаСервере()

	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	Если Объект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования Тогда
		Если Не ЗначениеЗаполнено(Объект.ПолучательИмущества) И ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.ПолучательИмущества = ЕдинственныйСотрудникПоКонтрагенту(Объект.Контрагент, Объект.Организация);
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ПолучательИмущества) Тогда
			Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	УстановитьОбязательностьДатыНомераДокументаПоставщика();
	
	Если Объект.ВидПоступленияМЗ <> Перечисления.ВидыПоступленийМЗ.ПоступлениеОтПоставщика Тогда
		Объект.НесколькоКПСРасчетов = Ложь;
		Если ЗначениеЗаполнено(Объект.КПСРасчетов) Тогда
			Объект.КПСРасчетов = Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	УправлениеМатериальнымиЗапасами.УстановитьВидДопСубконтоЛичногоПользования(
	ЭтотОбъект,
	Объект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования,
	?(СчетУчетаИмуществаВПользовании.Количество(), СчетУчетаИмуществаВПользовании[0], ПланыСчетов.ЕПСБУ.ПустаяСсылка()),
	"МатериалыДополнительноеСубконтоСчета",
	"Материалы");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МатериалыДополнительноеСубконтоСчета", "Видимость",
		ЗначениеЗаполнено(ДополнительноеСубконто27ВидСубконто));

КонецПроцедуры

&НаКлиенте
Процедура НесколькоКПСРасчетовПриИзменении(Элемент)
	УстановитьВидимостьКПСРасчетовВТЧ(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолучательИмуществаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПолучательИмущества) И УчетПоПодразделениямНаСчетахУчетаИмущества Тогда
		Объект.ПодразделениеИсточник = ТекущееПодразделениеПолучателяИмущества(Объект.Дата, Объект.ПолучательИмущества);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если ВидПоступленияТолькоСчет0233(Объект.ВидПоступленияМЗ)Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСостояниеЭДОАктыОПриемеПередачеНФАНажатие(Элемент)

	ЭлектронныеДокументыБГУКлиент.ОткрытьСостояниеЭДОАктамиОПриемеПередачеНФА(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ЗапрещеноДобавлениеСтрок() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанные.КоличествоМест = 1;
		ТекущиеДанные.Коэффициент    = 1;
		ТекущиеДанные.Количество     = 1;
		
		ПоступлениеНаСчет105_106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
			Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
		
		Если НЕ ПоступлениеНаСчет105_106 Тогда
			ТекущиеДанные.СчетУчета = Объект.СчетУчета;
		КонецЕсли;
		КоличествоСтрок = Объект.Материалы.Количество();
		Если КоличествоСтрок > 1 Тогда
			ПредыдущаяСтрока = Объект.Материалы[КоличествоСтрок-2];
			ТекущиеДанные.КПС = ПредыдущаяСтрока.КПС;
			ТекущиеДанные.КФО = ПредыдущаяСтрока.КФО;
		КонецЕсли;
		
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТекущейСтрокиМатериалов(
			Объект, Элементы.Материалы.ТекущиеДанные, Истина);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчета)
			И ПоступлениеНаСчет105_106 Тогда
			ТекущиеДанные.УчетПоКПС = Истина;
		КонецЕсли;
		
		Если Объект.ЭтоКорректировка Тогда
			УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьТекстЗаголовковКорректировкиВСтроке(ТекущиеДанные);
		КонецЕсли;
		
		УправлениеНФАКлиентСервер.УстановитьСпособУчетаНДСПоУмолчаниюВСтроке(Объект, Элементы.Материалы.ТекущиеДанные);
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элементы.Материалы.ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	Если Копирование И ЗначениеЗаполнено(ТекущиеДанные.ВариантКомплектаПТ) Тогда
		ТекущиеДанные.ВариантКомплектаПТ = ПредопределенноеЗначение("Справочник.ВариантыКомплектовМЗПТ.ПустаяСсылка");
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиент.ПриНачалеРедактированияСтроки(Элементы.Материалы.ТекущиеДанные, Объект.СведенияПрослеживаемости, НоваяСтрока, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ЗаполнитьДанныеНоменклатурыВСтроке("Материалы", ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		ЗаполнитьПризнакКомиссионногоТовараНоменклатуры(ЭтотОбъект, ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, ТекущиеДанные, Ложь);
	АвтозаполнениеКПСКФОПоСчетуВСтроке(ЭтотОбъект, ТекущиеДанные);
	ЗаполнитьПризнакКомиссионногоТовараНоменклатуры(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.АвтоПодборСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОкончаниеВводаТекстаСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если НЕ ЗапрещеноДобавлениеСтрок() Тогда
		УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
			Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКФОПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоМестПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.Количество = ТекущиеДанные.КоличествоМест * ТекущиеДанные.Коэффициент;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоэффициентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.Количество = ТекущиеДанные.КоличествоМест * ТекущиеДанные.Коэффициент;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.КоличествоМест = ?(ТекущиеДанные.Коэффициент = 0,
		ТекущиеДанные.Количество, ТекущиеДанные.Количество / ТекущиеДанные.Коэффициент);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаПриИзменении(Элемент)
	
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСтавкаНДСПриИзменении(Элемент)
	
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаНДСПриИзменении(Элемент)
	
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаНДС1ПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВсегоПриИзменении(Элемент)
	
	РасчитатьСтроку(Элементы.Материалы.ТекущиеДанные, Объект.СуммаВключаетНДС, "Всего");
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПослеУдаления(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыДополнительнаяАналитикаСчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если СчетУчетаИмуществаВПользовании.Найти(ТекущиеДанные.СчетУчета) <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ОрганизацияСотрудника", Объект.Организация));
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.ДополнительнаяАналитикаСчета);
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередУдалением(Элемент, Отказ)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	ОбъектНаУдаление = СтрокаТабличнойЧасти.Номенклатура;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ОбъектНаУдаление);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()<>0 Тогда
		режим = РежимДиалогаВопрос.ДаНет;
		ПараметрыОповещения = Новый Структура("НайденныеСтроки", НайденныеСтроки);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОДрагМатериалах", ЭтотОбъект, ПараметрыОповещения);
		Шаблон = НСтр("ru = 'Удалить данные о содержании драгоценных материалов в удаленном объекте НФА (%1) на закладке ""Драгоценные материалы""?'");
		ПоказатьВопрос(Оповещение, СтрШаблон(Шаблон, СокрЛП(ОбъектНаУдаление)), Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, "Материалы", Истина);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРНПТОчистка(Элемент, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар Тогда
		УдалитьСтрокиРНПТ(СтрокаТабличнойЧасти.ИдентификаторСтроки);
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиентСервер.ОчиститьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрослеживаемостьФормыБГУКлиент.МатериалыВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка, Истина, "Материалы");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		ПодключитьОбработчикОжидания("Подключаемый_НапоминатьОбУведомленияхОВвозе", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВидимыеДефектыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаголовокФормыВвода = НСтр("ru = 'Видимые особенности объекта - Дефекты'");
	НачатьВводДлинногоТекста("ВидимыеДефекты", ЗаголовокФормыВвода);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыОсобыеОтметкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаголовокФормыВвода = НСтр("ru = 'Видимые особенности объекта - Особые отметки'");
	НачатьВводДлинногоТекста("ОсобыеОтметки", ЗаголовокФормыВвода);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСпособУчетаНДСПриИзменении(Элемент)
	УправлениеНФАКлиентСервер.ЗаполнитьДанныеУчетаНДСПоСпособуУчета(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНФАДокументаОснования

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено И ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ПодключитьОбработчикОжидания("ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииЯчейки(Элемент)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущаяКолонкаТаблицы = Элементы.СписокНФАДокументаОснования.ТекущийЭлемент;

	Если ТекущаяКолонкаТаблицы.Имя = "СписокНФАДокументаОснованияТехДокументацияИнфо" Тогда
		ТекСтрока = Элементы.СписокНФАДокументаОснования.ТекущиеДанные;
		ТехДокументация = ТекСтрока.ТехДокументация;
		ОбъектНФА = ТекСтрока.Номенклатура;
		ОткрытьФормуСведенийОСодержанииДрагМатериаловПоТехДокументации(ОбъектНФА, ТехДокументация);
		Элементы.СписокНФАДокументаОснования.ТекущийЭлемент = Элементы.СписокНФАДокументаОснованияНоменклатура;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВозвратнаяТара

&НаКлиенте
Процедура ВозвратнаяТараПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанные = Элементы.ВозвратнаяТара.ТекущиеДанные;
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТекущейСтрокиМатериалов(
			Объект, Элементы.ВозвратнаяТара.ТекущиеДанные);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчета)
			И (УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
				Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект)) Тогда
			ТекущиеДанные.УчетПоКПС = Истина;
		КонецЕсли;
		
		КоличествоСтрок = Объект.ВозвратнаяТара.Количество();
		Если КоличествоСтрок > 1 Тогда
			ПредыдущаяСтрока = Объект.ВозвратнаяТара[КоличествоСтрок-2];
			ТекущиеДанные.КПС = ПредыдущаяСтрока.КПС;
			ТекущиеДанные.КФО = ПредыдущаяСтрока.КФО;
		КонецЕсли;
		
		Если Объект.ЭтоКорректировка Тогда
			УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьТекстЗаголовковКорректировкиВСтроке(ТекущиеДанные);
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВозвратнаяТара.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ЗаполнитьДанныеНоменклатурыВСтроке("ВозвратнаяТара", ТекущиеДанные.ПолучитьИдентификатор(), Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараСчетУчетаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВозвратнаяТара.ТекущиеДанные;
	
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, ТекущиеДанные, Ложь);
	АвтозаполнениеКПСКФОПоСчетуВСтроке(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараКФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараСчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратнаяТараПослеУдаления(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗачетАвансов

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", , Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи

&НаКлиенте
Процедура ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиИмяФайла" Тогда
		УправлениеНФАКлиент.ОткрытьЭлектронныйДокументПриложенияИзФайла(
			ВыбраннаяСтрока, 
			ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи, 
			УникальныйИдентификатор);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПринятьНДСКВычетуУказываетсяВСтроках(Команда)
	Объект.ПринятьНДСКВычетуУказываетсяВСтроках = Не Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	Если Объект.ПринятьНДСКВычетуУказываетсяВСтроках Тогда
		УстановитьПринятьНДСКВычетуВСтроках();
	КонецЕсли;
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыСтрок(Команда)
	ОбработкаЗавершения = Новый ОписаниеОповещения("ВыполнитьИзменениеРеквизитовСтрок", ЭтотОбъект);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ИФО",         Объект.ИФО);
	ПараметрыФормы.Вставить("Дата",        Объект.Дата);
	ПараметрыФормы.Вставить("СчетУчета",   Объект.СчетУчета); 
	ПараметрыФормы.Вставить("НесколькоКПСРасчетов",   Объект.НесколькоКПСРасчетов);
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		НачальныеЗначения = Новый СписокЗначений;
		НачальныеЗначения.Добавить(ТекущиеДанные.СчетУчета, "СчетУчета");
		НачальныеЗначения.Добавить(ТекущиеДанные.КФО, "КФО");
		НачальныеЗначения.Добавить(ТекущиеДанные.КПС, "КПС");
		НачальныеЗначения.Добавить(ТекущиеДанные.КЭК, "КЭК");
		НачальныеЗначения.Добавить(ТекущиеДанные.КПСРасчетов, "КПСРасчетов");
		НачальныеЗначения.Добавить(ТекущиеДанные.ДополнительнаяАналитикаСчета, "ДополнительнаяАналитикаСчета");
		ПараметрыФормы.Вставить("НачальныеЗначения", НачальныеЗначения);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ПоступлениеМЗ.Форма.ФормаГрупповогоИзмененияРеквизитов", ПараметрыФормы,
		ЭтотОбъект,,,, ОбработкаЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборМЗ(Команда)
	
	Если ОткрытьПодборМЗ() Тогда
		Если ЭтоВозвратИзПользования(Объект.ВидПоступленияМЗ) И НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСТр("ru = 'Контрагент'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Объект.Контрагент");
		ИначеЕсли Объект.ВидПоступленияМЗ
				= ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования")
			И НЕ ЗначениеЗаполнено(Объект.ПолучательИмущества) Тогда
			ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(, , НСТр("ru = 'Получатель имущества'"));
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки,, "Объект.ПолучательИмущества");
		Иначе
			УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, "Материалы",
				ДополнитьСтруктуруПодбора("Материалы"));
		КонецЕсли;
	Иначе
		ПараметрыПодбора = Новый Структура;
		ПараметрыПодбора.Вставить("ИФО"				, Объект.ИФО);
		ПараметрыПодбора.Вставить("Счет"			, Объект.ЗабалансовыйСчет);
		ПараметрыПодбора.Вставить("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаХранении"));
		ПараметрыПодбора.Вставить("КолонкиКорзины", Новый Структура("Цена", "СтоимостьЕдиницы"));
		УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтотОбъект, Объект, ПараметрыПодбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТары(Команда)
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, "ВозвратнаяТара",
		ДополнитьСтруктуруПодбора("ВозвратнаяТара"));
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	Если Не ОбязательныеПоляДляЗаполненияЗаполнены() Тогда
		Возврат;
	КонецЕсли;

	ТекстВопроса = "";
	ЧастиВопроса = Новый Массив;	
	Если Объект.ЗачетАвансов.Количество() > 0 Тогда
		ЧастиВопроса.Добавить(НСтр("ru = 'Табличная часть будет очищена.'"));
	КонецЕсли;
	Если Объект.Проведен Тогда
		ЧастиВопроса.Добавить(НСтр("ru = 'Проведение документа будет отменено.'"));
	КонецЕсли;
	
	Если ЧастиВопроса.Количество() > 0 Тогда
		ЧастиВопроса.Добавить(НСтр("ru = 'Продолжить?'"));
		ТекстВопроса = СтрСоединить(ЧастиВопроса, Символы.ПС);
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнениеТаблицыАвансыЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;	 

	ЗаполнитьАвансыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДО(Команда)
	
	Если Не ОбязательныеПоляДляЗаполненияЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед заполнением денежных обязательств проведение документа будет отменено.
			|Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОтменитьПроведениеПередЗаполнениемДО", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();
	
КонецПроцедуры

// КонтрольИсполненияДоговоров
&НаКлиенте
Процедура Подключаемый_КонтрольИсполненияДоговоровПоказатьСтатус(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДокументСсылка", Объект.Ссылка);
	ДопПараметры.Вставить("ОтразитьВГрафикеИсполнения", Объект.ОтразитьВГрафикеИсполненияДоговора);
	ДопПараметры.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	
	КонтрольИсполненияДоговоровКлиент.ПоказатьСтатусИсполнения(
		Объект.Организация, Объект.Контрагент, Объект.Договор, ДопПараметры, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры
// Конец КонтрольИсполненияДоговоров

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ДобавитьЛомОтходыДМДляОбъекта(Команда)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, Объект.Ссылка,
			"СписокНФАДокументаОснования", "Объект");
	Иначе
		УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМ(ЭтотОбъект, Объект,
			Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Номенклатура,
			ПредопределенноеЗначение("Справочник.ИнвентарныеНомераОС.ПустаяСсылка"),
			Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Количество, "Лом");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписокДМДляОбъекта(Команда)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, Объект.Ссылка,
			"СписокНФАДокументаОснования", "Объект");
	Иначе
		Если Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Количество() = 1 Тогда
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМ(ЭтотОбъект, Объект,
				Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Номенклатура,
				ПредопределенноеЗначение("Справочник.ИнвентарныеНомераОС.ПустаяСсылка"),
				Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Количество, "Изделия");
			
			ВариантВводаДанныхДМ = 1;
		Иначе
			МассивВыделенныеСтроки = Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки;
			
			АдресТаблицыОбъектовНФА = ПоместитьТаблицуОбъектовНФАДляДМВХранилище(МассивВыделенныеСтроки);
			
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМДляПеречняОбъектов(ЭтотОбъект, Объект,
				АдресТаблицыОбъектовНФА, "Изделия");
			
			ВариантВводаДанныхДМ = 2;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОтбораДМПоОбъекту(Команда)
	
	ИспользоватьОтборДрагМатериаловПоОбъектуНФА = НЕ ИспользоватьОтборДрагМатериаловПоОбъектуНФА;
	УстановитьВидимостьДанныхДрагМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВСписокДрагМатериалыПоТехДокументации(Команда)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, Объект.Ссылка,
			"СписокНФАДокументаОснования", "Объект");
	Иначе
		ОткрытьФорму("Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаВыбора", , ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДрагМатериалыПоТехДокументации(Команда)
	ЗаполнитьСписокДрагМатериалыПоТехДокументацииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДоговору(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Договор) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСТр("ru = 'Не заполнено обязательное поле ""Договор""'"),,
			"Объект.Договор");
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика") Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСТр("ru = 'Заполнение по договору возможно только для поступления ТМЦ от поставщика'"),, "Объект.ВидПоступленияМЗ");
		Возврат;
	КонецЕсли;
	
	Если Объект.Материалы.Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТаблицуПоДоговору", ЭтотОбъект),
			НСтр("ru = 'Существующие строки документа будут удалены. 
			|Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ЗаполнитьТаблицуПоДоговоруНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВВЕТИС(Команда)
	
	ДополнительныеПараметры = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.ИнвентаризацияПродукцииВЕТИС.ФормаОбъекта", ДополнительныеПараметры);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЦенПоДатеДокумента(Команда)
	
	РаботаСобязательствамиКлиент.ОбработатьКомандуКонтроляЦен(Объект.Дата, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЦенПоДате(Команда)
	
	РаботаСобязательствамиКлиент.ОбработатьКомандуКонтроляЦен(Дата(1,1,1), ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрольЦенУбратьВыделение(Команда)
	
	РаботаСОбязательствамиКлиент.ОбработатьКомандуУбратьВыделениеКонтроляЦен(ЭтотОбъект, "Материалы");
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьОтборКЭК()
	УправлениеМатериальнымиЗапасамиФормы.УстановитьПараметрыВыбораКЭК(ЭтотОбъект, Элементы.МатериалыКЭК,
		Объект.СчетУчета, Объект.Дата, Объект.Организация);
КонецПроцедуры

&НаСервере
Процедура УстановитьОбязательностьДатыНомераДокументаПоставщика()

	ОбязательноЗаполнять = Документы.ПоступлениеМЗ.ЗаполнятьДатуНомерДокументаПоставщика(Объект);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПервичногоДокумента",
		"АвтоОтметкаНезаполненного", ОбязательноЗаполнять);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерПервичногоДокумента",
		"АвтоОтметкаНезаполненного", ОбязательноЗаполнять);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПервичногоДокумента",
		"ОтметкаНезаполненного", ОбязательноЗаполнять И Не ЗначениеЗаполнено(Объект.ДатаПервичногоДокумента));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НомерПервичногоДокумента",
		"ОтметкаНезаполненного", ОбязательноЗаполнять И Не ЗначениеЗаполнено(Объект.НомерПервичногоДокумента));

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЧленовКомиссии()
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.СоставКомиссии.Отсутствует", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("СоставКомиссииПричинаОтсутствия");
	Поле.Использование = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКПСРасчетовВТЧ(Форма)
	
	ИменаЭлементовКПС = Новый Массив; 
	ИменаЭлементовКПС.Добавить("МатериалыКПСРасчетов");
	ИменаЭлементовКПС.Добавить("ВозвратнаяТараКПСРасчетов");
	Признак = Форма.Объект.НесколькоКПСРасчетов И 
	   ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, "КПСРасчетов","Видимость");  
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		ИменаЭлементовКПС, "Видимость", Признак);

КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоАктОПриемеПередаче0510448(Форма)
	Возврат ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(Форма.Объект.ПервичныйДокумент, "АктПриемаПередачи0510448");
КонецФункции

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопустимыеКЭКСчетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОСГУ.Ссылка КАК КЭК
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|ГДЕ	
	|	КОСГУ.Ссылка В ИЕРАРХИИ
	|	(ВЫБРАТЬ
	|		ЕПСБУ.КОСГУДт
	|	ИЗ
	|		ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|	ГДЕ
	|		ЕПСБУ.Ссылка В (&ВсеСчета105)
	|	)	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КОСГУ.Ссылка КАК КЭК
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|ГДЕ	
	|	КОСГУ.Ссылка В ИЕРАРХИИ
	|	(ВЫБРАТЬ
	|		ЕПСБУ.КОСГУДт
	|	ИЗ
	|		ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|	ГДЕ
	|		ЕПСБУ.Ссылка В (&ВсеСчета113)
	|	)";
	Запрос.УстановитьПараметр("ВсеСчета105", ВсеСчета105.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("ВсеСчета113", ВсеСчета113.ВыгрузитьЗначения());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	КЭК105.ЗагрузитьЗначения(РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("КЭК"));
	КЭК113.ЗагрузитьЗначения(РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("КЭК"));
	
КонецПроцедуры

&НаКлиенте
Функция ЗапрещеноДобавлениеСтрок()
	
	ВозможенЗапретПоВидуПоступления =
		Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования");
	
	Возврат ВозможенЗапретПоВидуПоступления
		И ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект);
КонецФункции

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт

	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ТребуетсяВызовСервера = ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или ЭтотОбъект.КэшПараметров.ИзмениласьДатаСПереходомНачалаПрослеживаемости
		Или (ВедетсяУчетПрослеживаемыхТоваров И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня)
		Или (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
			И Не ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня)
		Или ((УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
				Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект))
			И УправлениеМатериальнымиЗапасамиКлиентСервер.ИзменилосьПрименениеДетальногоКЭК340и440(
				ЭтотОбъект.КэшПараметров.Дата,
				ЭтотОбъект.КэшПараметров.Организация,
				Объект.Дата,
				Объект.Организация));
	
	Если ТребуетсяВызовСервера Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		ОбновитьДанныеСчетовВФорме();
		УстановитьОбязательностьДатыНомераДокументаПоставщика();
		Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавенЗначению(ЭтотОбъект, "Счет0133") Тогда
			ИзменитьОтборКЭК();
		КонецЕсли;
		
	КонецЕсли;
	
	Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
		Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект)
		Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавенЗначению(ЭтотОбъект, "Счет0133") Тогда
			
		УправлениеМатериальнымиЗапасами.ОбработатьИзменениеПримененияДетальногоКЭК340и440(ЭтотОбъект,
			ЭтотОбъект.КэшПараметров.Дата,
			ЭтотОбъект.КэшПараметров.Организация);
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		ЗаполнитьОтветственныеЛица();
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьДатаСПереходомНачалаПрослеживаемости
		Или (ВедетсяУчетПрослеживаемыхТоваров И Не ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
		ПрослеживаемостьБГУ.ОбновитьПризнакПрослеживаемости(Объект, Объект.Материалы, ВедетсяУчетПрослеживаемыхТоваров);
		ОбновитьСрокОтправкиУведомленийОВвозе = Истина;
		РассчитатьНеобходимостьНапоминанияОВвозе();
		УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	ОбновитьДанныеСчетовВФорме();
	УстановитьОбязательностьДатыНомераДокументаПоставщика();
	
	Объект.ОтветственныйИсполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(
		Объект.Ответственный, Объект.Организация, "Документ.ПоступлениеМЗ");
	ЗаполнитьОтветственныеЛица();
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДокументОснование = ДополнительныеПараметры.ВыбранноеЗначение;
	
	ЗаполнитьПоДокументуОснованию(Объект.ДокументОснование);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	ПоставщикРезидентТаможенногоСоюза = Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Объект.Контрагент);
	РассчитатьНеобходимостьНапоминанияОВвозе();
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВестиГрафикПлатежей,ВестиПланГрафикИсполнения"); 
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиГрафикПлатежей", ?(РеквизитыДоговора.ВестиГрафикПлатежей = Истина, Истина, Ложь));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиПланГрафикИсполнения", ?(РеквизитыДоговора.ВестиПланГрафикИсполнения = Истина, Истина, Ложь));
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьВидимостьЭлементов(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров,
		ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей,
		Объект.ВидПоступленияМЗ);
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбИзмененииСчетаУчета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Объект.СчетУчета = ЭтотОбъект.КэшПараметров.Локальные.СчетУчета;
		Возврат;
	КонецЕсли;
	
	СчетУчетаПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзмененииНаКлиенте()

	СчетУчетаПриИзмененииНаСервере();
	УстановитьВидимостьВидаПользования(ЭтотОбъект);
	УстановитьВидимостьЭлементовКомиссионнаяТорговля(ЭтотОбъект);
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СчетУчетаПриИзмененииНаСервере()
	
	УстановитьСчетУчетаВТаблицеМатериалы(); 
	УстановитьКПСВТаблицеМатериалы();
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьОбязательностьДатыНомераДокументаПоставщика();
	ИзменитьОтборКЭК();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт

	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.СуммаВключаетНДС <> Объект.СуммаВключаетНДС Тогда
		СуммаВключаетНДСПриИзмененииНаСервере();
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура СуммаВключаетНДСПриИзмененииНаСервере()
	
	ПересчитатьТабличнуюЧасть();
	РассчитатьСуммуДокумента();

КонецПроцедуры

&НаСервере
Процедура ОтветственныйПриИзмененииНаСервере()
	Объект.ОтветственныйИсполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(
		Объект.Ответственный, Объект.Организация, "Документ.ПоступлениеМЗ");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственныеЛица()
	ДатаДокумента = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ОбщегоНазначения.ТекущаяДатаПользователя());
	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
		ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"),
		Объект.Организация, ДатаДокумента, Объект.Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
			И Объект.Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Объект.Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРедактированияСтрокВДокументахНФА(Форма)
	Если НЕ Форма.ЗапретитьИнтерактивныйВводСтрокВДокументахСписанияНФА Тогда
		Возврат;
	КонецЕсли;
	
	ЗначениеЗапрета = Форма.Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьПризнакЗапрещеноДобавлениеСтрокВДокументыНФА(Форма, ЗначениеЗапрета);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(Форма);
КонецПроцедуры

&НаСервере
Процедура УстановитьПринятьНДСКВычетуВСтроках()
	
	УправлениеНФА.УстановитьПринятьНДСКВычетуВСтроках(Объект, Объект.Материалы);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьИзменениеРеквизитовСтрок(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьИзменениеРеквизитовСтрокНаСервере(Результат, Элементы.Материалы.ВыделенныеСтроки);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьИзменениеРеквизитовСтрокНаСервере(Знач ЗначенияДляЗаполнения, Знач ИдентификаторыСтрок)

	ЗаполнятьКЭК = ЗначенияДляЗаполнения.Свойство("КЭК");
	ЗаполнятьСчет = ЗначенияДляЗаполнения.Свойство("СчетУчета");
	
	Для Каждого Идентификатор Из ИдентификаторыСтрок Цикл
	
		ТекСтрока = Объект.Материалы.НайтиПоИдентификатору(Идентификатор);
		ЗаполнитьЗначенияСвойств(ТекСтрока, ЗначенияДляЗаполнения);
		
		Если ЗаполнятьСчет Тогда
			ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(ЭтотОбъект, ТекСтрока);
			ПараметрыОбработки.ДтКт = "Дт";
			ПараметрыОбработки.Включать106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
			ПараметрыОбработки.Включать113 = Истина;
			// Переданный счет не нужно менять. Только получить его свойства и доп. субконто.
			ПараметрыОбработки.ЗаполнятьСчет = Ложь;
			
			УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(ТекСтрока, ПараметрыОбработки);
		КонецЕсли;
		Если ЗаполнятьКЭК Тогда
			ТекСтрока.КЭК = ЗначенияДляЗаполнения.КЭК;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура НачатьВводДлинногоТекста(ИмяПоля, ЗаголовокФормыВвода)

	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ИмяПоля", ИмяПоля);
	ОбработчикИзменения = Новый ОписаниеОповещения("ЗавершитьВводДлинногоТекста", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(ОбработчикИзменения, ТекущиеДанные[ИмяПоля], ЗаголовокФормыВвода); 

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводДлинногоТекста(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = ДополнительныеПараметры.ИмяПоля; 
	ТекущиеДанные[ИмяПоля] = Результат;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Функция ОткрытьПодборМЗ()
	Возврат НомерЗабалансовогоСубконтоОС = 0;
КонецФункции

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОсновныхСредствНаСервере(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодбораОсновныхСредствНаСервере(ВыбранноеЗначение)

	ТаблицаОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
	
	ДобавленныеСтроки = Новый Массив;
	Для Каждого СтрокаОС Из ТаблицаОС Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоОС] = СтрокаОС.ОсновноеСредство;
		Если ЗначениеЗаполнено(НомерЗабалансовогоСубконтоЦМО) Тогда
			НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоЦМО] = СтрокаОС.ЦМО;
		КонецЕсли;
		Если ЗначениеЗаполнено(НомерЗабалансовогоСубконтоДоп) Тогда
			Если ВидСубконтоЗабалансовогоСубконтоДоп = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
				НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоДоп] = СтрокаОС.Договор;
			ИначеЕсли ВидСубконтоЗабалансовогоСубконтоДоп = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты Тогда
				НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоДоп] = СтрокаОС.Контрагент;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрока.Сумма = СтрокаОС.Сумма;
		НоваяСтрока.Количество = СтрокаОС.Количество;
		НоваяСтрока.ИнвентарныйНомер = СтрокаОС.ИнвентарныйНомер;
		ДобавленныеСтроки.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Если ВидСубконтоЗабалансовогоСубконтоДоп = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
		ПараметрыЗаполненияДоговора = Новый Структура;
		ПараметрыЗаполненияДоговора.Вставить("НомерСубконтоОС", НомерЗабалансовогоСубконтоОС);
		ПараметрыЗаполненияДоговора.Вставить("НомерСубконтоДоговоры", НомерЗабалансовогоСубконтоДоп);
		Если Объект.Ссылка.Пустая() Тогда
			ПараметрыЗаполненияДоговора.Вставить("Период", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
		Иначе
			ПараметрыЗаполненияДоговора.Вставить("Период", Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая));
		КонецЕсли;
		ПараметрыЗаполненияДоговора.Вставить("Организация", Объект.Организация);
		ПараметрыЗаполненияДоговора.Вставить("ДобавленныеСтроки", ДобавленныеСтроки);
		ДополнительноЗаполнитьДоговор(ПараметрыЗаполненияДоговора);
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнительноЗаполнитьДоговор(ПараметрыЗаполненияДоговора);
	
	ИспользуемыеОС = Новый Массив;
	Для Каждого Строка Из ПараметрыЗаполненияДоговора.ДобавленныеСтроки Цикл
		ИспользуемыеОС.Добавить(Строка["СубконтоЗабалансовыйСчет" + ПараметрыЗаполненияДоговора.НомерСубконтоОС]);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.ОсновноеСредство,
	|	СтоимостьОбъектовОСПоКонтрагентамОстатки.Договор
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОСПоКонтрагентам.Остатки(&Период, Организация = &Организация
	|	И ВидРаспоряжения = &ВидРаспоряжения
	|	И ОсновноеСредство В (&ОсновныеСредства)) КАК СтоимостьОбъектовОСПоКонтрагентамОстатки";
	Запрос.УстановитьПараметр("Период", ПараметрыЗаполненияДоговора.Период);
	Запрос.УстановитьПараметр("Организация", ПараметрыЗаполненияДоговора.Организация);
	Запрос.УстановитьПараметр("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаХранении"));
	Запрос.УстановитьПараметр("ОсновныеСредства", ИспользуемыеОС);
	
	ДоговорыОС = Запрос.Выполнить().Выгрузить();
	ДоговорыОС.Индексы.Добавить("ОсновноеСредство");
	Отбор = Новый Структура("ОсновноеСредство");
	
	Для Каждого Строка Из ПараметрыЗаполненияДоговора.ДобавленныеСтроки Цикл
		Отбор.ОсновноеСредство = Строка["СубконтоЗабалансовыйСчет" + ПараметрыЗаполненияДоговора.НомерСубконтоОС];
		СтрокиДоговора = ДоговорыОС.НайтиСтроки(Отбор);
		Если СтрокиДоговора.Количество() > 0 Тогда
			Строка["СубконтоЗабалансовыйСчет" + ПараметрыЗаполненияДоговора.НомерСубконтоДоговоры] = СтрокиДоговора[0].Договор;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеСчетовВФорме()
	ЗаполнитьДанныеСчетовВФорме();
	Если Элементы.СчетУчета.СписокВыбора.НайтиПоЗначению(Объект.СчетУчета) = Неопределено Тогда
		Объект.СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме = Неопределено)
	
	Элементы.СчетУчета.СписокВыбора.Очистить();
	
	ПараметрыЗаполненияСчета = УправлениеМатериальнымиЗапасами.ПараметрыЗаполненияДанныхСчетовУчетаМЗВФорме();
	ПараметрыЗаполненияСчета.Организация = Объект.Организация;
	ПараметрыЗаполненияСчета.ДатаСчета = Объект.Дата;
	ПараметрыЗаполненияСчета.Включать113 = Не ВидПоступленияТолькоСчет105(Объект.ВидПоступленияМЗ);
	ПараметрыЗаполненияСчета.Включать106 = Истина;
	Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика")
		И ПолучитьФункциональнуюОпцию("ВестиУчетПоЗакупкеТоваровУслугДляКомитентов") Тогда
		ПараметрыЗаполненияСчета.Включать0234 = Истина;
	КонецЕсли;
	
	Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя")
		И ПолучитьФункциональнуюОпцию("ВестиУчетПоРеализацииТоваровУслугКомитентов") Тогда
		ПараметрыЗаполненияСчета.Включать0233 = Истина;
	КонецЕсли;
	
	ПараметрыЗаполненияСчета.ТолькоБалансовые = ВидПоступленияТолькоСчета105_106(Объект.ВидПоступленияМЗ);
	ПараметрыЗаполненияСчета.СписокВыбора = Элементы.СчетУчета.СписокВыбора;
	УправлениеМатериальнымиЗапасамиФормы.ЗаполнитьДанныеСчетовУчетаМЗВФорме(ЭтотОбъект, ПараметрыЗаполненияСчета,
		ДанныеСчетовВФорме);
	
	УправлениеМатериальнымиЗапасами.ЗаполнитьСчетаУчетаМЗ105(ЭтотОбъект);
	УправлениеМатериальнымиЗапасами.УстановитьОграниченияСчетовДляВыбораТары(Элементы.ВозвратнаяТараСчетУчета);
	МассивСчетов27 = ПолучитьСчета27();
	СчетУчетаИмуществаВПользовании = Новый ФиксированныйМассив(МассивСчетов27);
	УправлениеМатериальнымиЗапасами.ОтключитьВидимостьКолонкиДопСубконто(
		Элементы.ВозвратнаяТараДополнительнаяАналитикаСчета, ВсеСчета105);
	Для каждого СчетМЗ Из Элементы.СчетУчета.СписокВыбора Цикл
		ЭтоНеБалансовыйСчет = ВсеСчета105.НайтиПоЗначению(СчетМЗ.Значение) = Неопределено
			И ВсеСчета113.НайтиПоЗначению(СчетМЗ.Значение) = Неопределено
			И ВсеСчета106.НайтиПоЗначению(СчетМЗ.Значение) = Неопределено;
		
		Если ЭтоНеБалансовыйСчет Тогда
			ЗабалансовыеСчетаМЗ.Добавить(СчетМЗ.Значение);
		КонецЕсли;
	КонецЦикла;
	ДополнительныеСубконтоСчетов = Новый ФиксированноеСоответствие(ПараметрыЗаполненияСчета.ВидыСубконтоСчетов);
	ЗаполнитьКЭШПараметровФормыЛокальныеСчета();
	ПрочитатьСвойстваЗабалансовогоСчета();
	УстановитьЗаголовокСубконтоЗабалансовогоСчета(ЭтотОбъект);
	
	УчетПоПодразделениямНаСчетахУчетаИмущества = УправлениеМатериальнымиЗапасами.ЕстьУчетПоПодразделениямСчетаУчета27(
		ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям, СчетУчетаИмуществаВПользовании);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчета27()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	(ЕПСБУ.Код = ""27""
	|			ИЛИ ЕПСБУ.Код = ""27.02"")
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|	И (ЕПСБУ.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ЕПСБУ.ДатаНачалаДействия <= &ПериодСчета)
	|	И (ЕПСБУ.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ЕПСБУ.ДатаОкончанияДействия >= &ПериодСчета)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕПСБУ.Код УБЫВ";
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ПериодСчета = НачалоДня(Объект.Дата);
	Иначе
		ПериодСчета = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	КонецЕсли;
	Запрос.УстановитьПараметр("ПериодСчета", ПериодСчета);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции 

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеПоляДляЗаполненияЗаполнены()
	
	Результат = Истина;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Организация""'"),, "Объект.Организация");
		Результат = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Контрагент""'"),, "Объект.Контрагент");
		Результат = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.СчетРасчетов) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Счет расчетов""'"),, "Объект.СчетРасчетов");
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКЭШПараметровФормыЛокальныеСчета()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет105",
		БухгалтерскийУчет.СчетПоКоду("105.00", Объект.Дата, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет106",
		БухгалтерскийУчет.СчетПоКоду("106.00", Объект.Дата, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет0133",
		БухгалтерскийУчет.СчетПоКоду("01.33", Объект.Дата, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет24",
		БухгалтерскийУчет.СчетПоКоду("24", Объект.Дата, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет25",
		БухгалтерскийУчет.СчетПоКоду("25", Объект.Дата, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет26",
		БухгалтерскийУчет.СчетПоКоду("26", Объект.Дата, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет0233",
		БухгалтерскийУчет.СчетПоКоду("02.33", Объект.Дата, Объект.Организация));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет0234",
		БухгалтерскийУчет.СчетПоКоду("02.34", Объект.Дата, Объект.Организация));
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ДанныеСчетовВФорме = Неопределено;
	ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме);
	ЗаполнитьДопустимыеКЭКСчетов();
	ИзменитьОтборКЭК();
	
	УправлениеМатериальнымиЗапасами.УстановитьВидДопСубконтоЛичногоПользования(
	ЭтотОбъект,
	Объект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования,
	?(СчетУчетаИмуществаВПользовании.Количество(), СчетУчетаИмуществаВПользовании[0], ПланыСчетов.ЕПСБУ.ПустаяСсылка()),
	"МатериалыДополнительноеСубконтоСчета",
	"Материалы");
	
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
	ВестиУчетПоЗакупкеТоваровУслугДляКомитентов = ПолучитьФункциональнуюОпцию("ВестиУчетПоЗакупкеТоваровУслугДляКомитентов");
	ПоставщикРезидентТаможенногоСоюза = Справочники.Контрагенты.КонтрагентРезидентТаможенногоСоюза(Объект.Контрагент);
	ТребуетсяНапоминаниеУведомленийОВвозе = ТребуетсяНапоминаниеОбУведомленииОВвозе();
	УстановитьПредставлениеНадписиУведомлениеОВвозе();
	РассчитатьНеобходимостьНапоминанияОВвозе();
	УстановитьДопустимыеКодыОперацийПрослеживаемости(ЭтотОбъект);
	
	УправлениеМатериальнымиЗапасами.УстановитьТипНоменклатурыВСтрокахДляБиологическихАктивов(Объект.Материалы);
	УстановитьДанныеДинамическихКолонок(ДанныеСчетовВФорме);
	УстановитьОграниченияТиповДокументаОснования(ЭтотОбъект, Объект);
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтотОбъект);

	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьДоступностьИзмененияСчетовУчета(ЭтотОбъект, Объект);
	УстановитьЗаголовокЗакладкиВозвратИзАренды(ЭтотОбъект);

	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	УчетРасчетовКлиентСервер.УправлениеЭлементамиЗачетаАвансов(ЭтотОбъект);
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ИспользоватьКонтрольИсполненияДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров"));
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиГрафикПлатежей", ?(РеквизитыДоговора.ВестиГрафикПлатежей = Истина, Истина, Ложь));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиПланГрафикИсполнения", ?(РеквизитыДоговора.ВестиПланГрафикИсполнения = Истина, Истина, Ложь));
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьВидимостьЭлементов(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров,
		ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей,
		Объект.ВидПоступленияМЗ);
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
	УправлениеНФАКлиентСервер.ЗаполнитьСпособУчетаНДСВСтроках(Объект, Объект.Материалы);
	Если Не УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ОбязательностьЗаполненияРеквизита(Объект, "ДокументОснование") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснование",
			"АвтоотметкаНезаполненного", Ложь);
	КонецЕсли;
	УстановитьОбязательностьДатыНомераДокументаПоставщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеТаблицыАвансыЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвансыНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Функция ДополнитьСтруктуруПодбора(ДополнительныйПараметр)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета", Объект.СчетУчета);
	Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
		Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект)
		Или ДополнительныйПараметр = "ВозвратнаяТара" Тогда
		ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	КонецЕсли;
	ТипыНоменклатуры = Новый СписокЗначений;
	Если ДополнительныйПараметр = "Материалы" Тогда
		ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");
	
		ДополнительноеСубконтоСчета = УправлениеМатериальнымиЗапасамиКлиентСервер
			.ДополнительнаяАналитикаСчетаУчетаМатериалов(Объект.СчетУчета, Объект.Организация);
		Если ЗначениеЗаполнено(ДополнительноеСубконтоСчета) Тогда
			ПараметрыПодбора.Вставить("ВидСубконтоДополнительнойАналитикиСчета", ДополнительноеСубконтоСчета);
		КонецЕсли;
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО"));
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));
		Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета") Тогда
			ПараметрыПодбора.Вставить("РасширенныйПодборНоменклатуры", Истина);
		КонецЕсли;
	Иначе
		ПараметрыПодбора.Вставить("ИмяТаблицы",				"ВозвратнаяТара");
		ПараметрыПодбора.Вставить("ПредставлениеТаблицы",	"Возвратная тара");
		ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Тара"));
	КонецЕсли;
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("Валюта",					Объект.ВалютаДокумента);
	ПараметрыПодбора.Вставить("ЕстьЦена",				Истина);
	ПараметрыПодбора.Вставить("ПоказыватьЦены",			Истина);
	
	Если ЭтоВозвратИзПользования(Объект.ВидПоступленияМЗ) Тогда
		ПараметрыПодбора.Вставить("ПоказыватьОстатки",				Истина);
		ПараметрыПодбора.Вставить("ПроверятьОстаткиВПользовании",	Истина);
		ПараметрыПодбора.Вставить("КонтрагентОстатковВПользовании",	Объект.Контрагент);
		Если ЗначениеЗаполнено(Объект.ЦМОПриВозврате) Тогда
			ПараметрыПодбора.Вставить("ЦМО", Объект.ЦМОПриВозврате);
			ПараметрыПодбора.Вставить("Подразделение", Объект.ПодразделениеПриВозврате);
		Иначе
			ПараметрыПодбора.Вставить("ЦМО", Объект.ЦМО);
			ПараметрыПодбора.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзДоверительногоУправления") Тогда
			ПараметрыПодбора.Вставить("СчетОстатковВПользовании", ЭтотОбъект.КэшПараметров.Локальные.Счет24);
		ИначеЕсли Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзАренды") Тогда
			ПараметрыПодбора.Вставить("СчетОстатковВПользовании", ЭтотОбъект.КэшПараметров.Локальные.Счет25);
		ИначеЕсли Объект.ВидПоступленияМЗ = ПредопределенноеЗначение(
			"Перечисление.ВидыПоступленийМЗ.ВозвратИзБезвПользования") Тогда
			ПараметрыПодбора.Вставить("СчетОстатковВПользовании", ЭтотОбъект.КэшПараметров.Локальные.Счет26);
			ПараметрыПодбора.Вставить("ВидБезвозмездногоПользования", Объект.ВидБезвозмездногоПользования);
			ПараметрыПодбора.Вставить("ИспользоватьВидБезвозмездногоПользования", Истина);
		КонецЕсли;
	ИначеЕсли Объект.ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования") Тогда
		ПараметрыПодбора.Вставить("ПоказыватьОстатки",				Истина);
		ПараметрыПодбора.Вставить("ПодборОстатковВПользовании",		Истина);
		ПараметрыПодбора.Вставить("СотрудникОстатковВПользовании",	Объект.ПолучательИмущества);
		ПараметрыПодбора.Вставить("Подразделение", Объект.ПодразделениеИсточник);
		ПараметрыПодбора.Вставить("СчетОстатковВПользовании",	СчетУчетаИмуществаВПользовании[0]);
		ПараметрыПодбора.Вставить("СчетУчета",	СчетУчетаИмуществаВПользовании[0]);
	ИначеЕсли ЗначениеЗаполнено(Объект.ЗабалансовыйСчет) Тогда
		ПараметрыПодбора.Вставить("ПоказыватьОстатки",				Истина);
		ПараметрыПодбора.Вставить("СчетУчета",	Объект.ЗабалансовыйСчет);
		ПараметрыПодбора.Вставить("Подразделение", Объект.Подразделение);
		ПараметрыПодбора.Вставить("РасширенныйПодборНоменклатуры",	Истина);
	КонецЕсли;
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация) И ЗначениеЗаполнено(Форма.Объект.Контрагент));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма)

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ЦМО");
	ИменаЭлементов.Добавить("Подразделение");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()

&НаСервере
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Материалы.Итог("Всего") + Объект.ВозвратнаяТара.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТабличнуюЧасть()
	Для Каждого СтрокаТЧ из Объект.Материалы Цикл
		РасчитатьСтроку(СтрокаТЧ, Объект.СуммаВключаетНДС, "Сумма");
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНоменклатурыВСтроке(ИмяТаблицы, ИдентификаторСтроки, Знач ЗаполнятьСчет)
	
	Если ЗабалансовыеСчетаМЗ.НайтиПоЗначению(Объект.СчетУчета) <> Неопределено Тогда
		ЗаполнятьСчет = Ложь;
	КонецЕсли;
	
	ТекущиеДанные = Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если ИмяТаблицы = "Материалы" Тогда
		СтруктураДанных = УправлениеМатериальнымиЗапасамиВызовСервера.ПолучитьСвойстваНоменклатуры(ТекущиеДанные.Номенклатура, Объект.Дата);
		Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ВПоступленииМЗВозможенУчетНДС(ЭтотОбъект) Тогда
			ТекущиеДанные.СтавкаНДС = СтруктураДанных.СтавкаНДС;
		КонецЕсли;
		ТекущиеДанные.ЕдиницаИзмерения = СтруктураДанных.ЕдиницаИзмерения;
		ТекущиеДанные.ПрослеживаемыйТовар = СтруктураДанных.ПрослеживаемыйТовар;
		ТекущиеДанные.КомплектСПрослеживаемымиТоварами = СтруктураДанных.КомплектСПрослеживаемымиТоварами;
		ТекущиеДанные.СтранаПроисхождения = СтруктураДанных.СтранаПроисхождения;
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьТипНоменклатурыВСтрокеДляБиологическихАктивов(
			ТекущиеДанные, СтруктураДанных.ТипНоменклатуры);
		Если ЗначениеЗаполнено(ТекущиеДанные.ВариантКомплектаПТ) Тогда
			ТекущиеДанные.ВариантКомплектаПТ = Справочники.ВариантыКомплектовМЗПТ.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, ТекущиеДанные, ЗаполнятьСчет);
	АвтозаполнениеКПСКФОПоСчетуВСтроке(ЭтотОбъект, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСчетаВСтроке(Форма, Строка, ЗаполнятьСчет)
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Форма, Строка);
	ПараметрыОбработки.ЗаполнятьСчет = ЗаполнятьСчет;
	ПараметрыОбработки.ДтКт          = "Дт";
	ПараметрыОбработки.Включать113   = Истина;
	ПараметрыОбработки.Включать106   = Истина;
	ПараметрыОбработки.Включать0233   = Истина;
	ПараметрыОбработки.Включать0234   = Истина;
	ПараметрыОбработки.ВШапке106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(Форма);
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(Строка, ПараметрыОбработки);
	Если ЗначениеЗаполнено(Форма.ДополнительноеСубконто27ВидСубконто) Тогда
		Строка.ДополнительноеСубконтоВидСубконто = Форма.ДополнительноеСубконто27ВидСубконто;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура АвтозаполнениеКПСКФОПоСчетуВСтроке(Форма, Строка)

	Если Строка.УчетПоКПС Тогда
		Если Форма.КэшПараметров.КонтролироватьОперацииНаСоответствиеРПС
			И НЕ ЗначениеЗаполнено(Строка.КПС) И ЗначениеЗаполнено(Строка.СчетУчета) Тогда
			
			ЗначенияАвтозаполнения = УправлениеНФАВызовСервера.ЗначенияКПСКФОПоУмолчаниюДляСчета(
			Форма.Объект.Организация,
			Форма.Объект.ИФО,
			Строка.СчетУчета,
			Форма.Объект.Дата,
			Строка.КФО);
			
			Если ЗначенияАвтозаполнения <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Строка, ЗначенияАвтозаполнения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОграниченияТиповДокументаОснования(Форма, Объект)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"ДокументОснование",
		"ОграничениеТипа",
		ОграничениеТиповДокументаОснования(Объект.ВидПоступленияМЗ, Объект.ЭтоКорректировка));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПриведениеЗначенияДокументаОснования()
	
	НовоеОграничениеТипа = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы,
		"ДокументОснование", "ОграничениеТипа");
	Если ТипЗнч(НовоеОграничениеТипа) = Тип("ОписаниеТипов") Тогда
		Объект.ДокументОснование = НовоеОграничениеТипа.ПривестиЗначение(Объект.ДокументОснование);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОграничениеТиповДокументаОснования(ВидПоступленияМЗ, ЭтоКорректировка)
	МассивТипов = Новый Массив;
	Если ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя") Тогда
		
		МассивТипов.Добавить(Тип("ДокументСсылка.НакладнаяНаРеализациюТорг12"));
		МассивТипов.Добавить(Тип("ДокументСсылка.НакладнаяНаОтпускМ15"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументПоставщика"));
		
	ИначеЕсли ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзАренды")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзБезвПользования")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзДоверительногоУправления") Тогда
		
		МассивТипов.Добавить(Тип("ДокументСсылка.НакладнаяНаОтпускМ15"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументПоставщика"));
		
	ИначеЕсли ЭтоКорректировка Тогда
		
		МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеМЗ"));
		
	Иначе
		
		МассивТипов.Добавить(Тип("ДокументСсылка.АктОбУтилизацииМЗ"));
		МассивТипов.Добавить(Тип("ДокументСсылка.АктОбУтилизацииОС"));
		МассивТипов.Добавить(Тип("ДокументСсылка.АктПриемкиМ7"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ИзвещениеВходящее"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ИнвентаризацияМЗ"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеМЗВПути"));
		МассивТипов.Добавить(Тип("ДокументСсылка.РешениеОПризнанииОбъектовМЗ"));
		МассивТипов.Добавить(Тип("ДокументСсылка.СписаниеБСО"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ТаксировкаПутевогоЛиста"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументПоставщика"));
		МассивТипов.Добавить(Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий"));
		МассивТипов.Добавить(Тип("СправочникСсылка.Договоры"));
	
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(МассивТипов);
КонецФункции

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение, ИмяТЧ)
	
	ПоступлениеНаСчет106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
	ОтражатьСписаниеСЗабаланса = Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета");
	ЗаменитьЗабалансовыйСчетИзПодбора = Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования")
		Или ОтражатьСписаниеСЗабаланса;
	
	УстановитьСчетУчетаИзШапки = НЕ УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
		И Не ПоступлениеНаСчет106;
	ЗаполнятьНДСВТаблице = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ВПоступленииМЗВозможенУчетНДС(ЭтотОбъект);
	
	СчетТоваровНаКомиссии = БухгалтерскийУчет.СчетПоКоду("02.33", Объект.Дата, Объект.Организация);
	
	СчетТоваровЗакупкаПоКомиссии = БухгалтерскийУчет.СчетПоКоду("02.34", Объект.Дата, Объект.Организация);
	
	СписокПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	Для Каждого ЭлементПодбора Из СписокПодбора Цикл
		НоваяСтрока = Объект[ИмяТЧ].Добавить(); // см. Документ.ПоступлениеМЗ.Форма.ФормаДокумента.Элементы.Материалы
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементПодбора);
		Если ПоступлениеНаСчет106 Тогда
			// Из подбора возвращаеся счет 105.хх. Его нужно заменить на 106.хх
			НоваяСтрока.СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		КонецЕсли;
		Если ИмяТЧ = "Материалы" Тогда
			УправлениеНФАКлиентСервер.УстановитьСпособУчетаНДСПоУмолчаниюВСтроке(Объект, НоваяСтрока);
			НоваяСтрока.КоличествоМест = 1;
			НоваяСтрока.Коэффициент    = 1;
			Если УстановитьСчетУчетаИзШапки Тогда
				НоваяСтрока.СчетУчета = Объект.СчетУчета;
			ИначеЕсли ЗаменитьЗабалансовыйСчетИзПодбора Тогда
				НоваяСтрока.СчетУчета = УправлениеМатериальнымиЗапасами.ПолучитьСчетНоменклатурыПоУмолчанию(
					НоваяСтрока.Номенклатура);
			КонецЕсли;
			Если Не ЗаполнятьНДСВТаблице Тогда
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
				НоваяСтрока.СуммаНДС = 0;
			КонецЕсли;
			ЗаполнитьСубконтоЗабалансовогоСчетаВСтроке(НоваяСтрока, ЭлементПодбора.ДополнительнаяАналитикаСчета,
				?(ЗначениеЗаполнено(ЭлементПодбора.ЦМО), ЭлементПодбора.ЦМО, Объект.ЦМО));
			Если ЗначениеЗаполнено(ЭлементПодбора.ЦМО) И НомерЗабалансовогоСубконтоЦМО > 0 Тогда
				НоваяСтрока["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоЦМО] = ЭлементПодбора.ЦМО;
			КонецЕсли;
			РасчитатьСтроку(НоваяСтрока, Объект.СуммаВключаетНДС, "Сумма");
		КонецЕсли;
		ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, НоваяСтрока, НЕ ЗначениеЗаполнено(НоваяСтрока.СчетУчета));
		
		Если ЗначениеЗаполнено(НоваяСтрока.СчетУчета) И ИмяТЧ = "Материалы"Тогда
			Если НоваяСтрока.СчетУчета = СчетТоваровНаКомиссии ИЛИ НоваяСтрока.СчетУчета = СчетТоваровЗакупкаПоКомиссии Тогда
				НоваяСтрока.КомиссионнаяТорговля = Истина;
			Иначе
				НоваяСтрока.КомиссионнаяТорговля = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если (НЕ НоваяСтрока.ЕстьДополнительноеСубконто
			 И ЗначениеЗаполнено(НоваяСтрока.ДополнительнаяАналитикаСчета))
			 ИЛИ Объект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования Тогда
			НоваяСтрока.ДополнительнаяАналитикаСчета = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	РассчитатьСуммуДокумента();
	РассчитатьНеобходимостьНапоминанияОВвозе();
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	УстановитьОбязательностьДатыНомераДокументаПоставщика();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСубконтоЗабалансовогоСчетаВСтроке(Строка, ДополнительнаяАналитикаСчета,ЦМО)
	Если НомерЗабалансовогоСубконтоЦМО > 0 Тогда
		Строка["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоЦМО] = ЦМО;
	КонецЕсли;
	Если НомерЗабалансовогоСубконтоДоп > 0 Тогда
		Строка["СубконтоЗабалансовыйСчет" + НомерЗабалансовогоСубконтоДоп] = ДополнительнаяАналитикаСчета;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьСвойстваЗабалансовогоСчета(Форма)
	Форма.НомерЗабалансовогоСубконтоЦМО = 0;
	Форма.НомерЗабалансовогоСубконтоДоп = 0;
	Форма.НомерЗабалансовогоСубконтоОС = 0;
	Форма.ЗаголовокЗабалансовогоСубконтоДоп = "";
	Форма.ВидСубконтоЗабалансовогоСубконтоДоп = ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка");
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСвойстваЗабалансовогоСчета()
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Объект.ЗабалансовыйСчет);
	ОчиститьСвойстваЗабалансовогоСчета(ЭтотОбъект);
	Для Номер = 1 По СвойстваСчета.КоличествоСубконто Цикл
		Если СвойстваСчета["ВидСубконто" + Номер] = ПланыВидовХарактеристик.ВидыСубконто.ЦМО Тогда
			НомерЗабалансовогоСубконтоЦМО = Номер;
		ИначеЕсли СвойстваСчета["ВидСубконто" + Номер] = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
			НомерЗабалансовогоСубконтоОС = Номер;
		ИначеЕсли СвойстваСчета["ВидСубконто" + Номер] <> ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
			НомерЗабалансовогоСубконтоДоп = Номер;
			ЗаголовокЗабалансовогоСубконтоДоп = СвойстваСчета["ВидСубконто" + Номер + "Наименование"];
			ВидСубконтоЗабалансовогоСубконтоДоп = СвойстваСчета["ВидСубконто" + Номер]; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию(ДокументОснование)
	
	Если (Объект.Материалы.Количество() > 0) И 
		(ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика")) Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьПоОснованию(ДокументОснование);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	УправлениеМатериальнымиЗапасами.УстановитьТипНоменклатурыВСтрокахДляБиологическихАктивов(Объект.Материалы);
	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(Истина);
	РассчитатьСуммуДокумента();
	
КонецПроцедуры // ЗаполнитьПоДокументуОснованию()

&НаКлиенте
Процедура ЗаполнитьТекстПроСчетФактуруКлиент(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения)
	
	Перем ЗначениеСвойства;
	
	ЭтотДокументЯвляетсяОснованием = (ТипЗнч(ПараметрОбработкиОповещения) = Тип("Структура")
		И ПараметрОбработкиОповещения.Свойство("ДокументыОснования", ЗначениеСвойства)
		И ЗначениеСвойства.Найти(Объект.Ссылка) <> Неопределено);
	
	Если ЭтотДокументЯвляетсяОснованием Тогда
		ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения = Неопределено, ИсточникОбработкиОповещения = Неопределено)
	
	УчетНДС.ЗаполнитьТекстПроСчетФактуру(ЭтотОбъект, ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКПСВТаблицеМатериалы()
		
	Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект) Тогда
		УправлениеМатериальнымиЗапасами.ЗаполнитьКПСМЗвТЧПоступления(Объект, "Материалы", Истина);
		Если Объект.ВозвратнаяТара.Количество() Тогда
			УправлениеМатериальнымиЗапасами.ЗаполнитьКПСМЗвТЧПоступления(Объект, "ВозвратнаяТара", Истина);
		КонецЕсли;
	Иначе
		УправлениеМатериальнымиЗапасами.ЗаполнитьКПСМЗвТЧПоступления(Объект, "Материалы");
		Если Объект.ВозвратнаяТара.Количество() Тогда
			УправлениеМатериальнымиЗапасами.ЗаполнитьКПСМЗвТЧПоступления(Объект, "ВозвратнаяТара");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСчетУчетаВТаблицеМатериалы()

	Если Не ЗначениеЗаполнено(Объект.СчетУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнятьСчет106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
	ВычислятьСчет = ЗаполнятьСчет106 Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект);
	
	СчетУчета0233 = ЭтотОбъект.КэшПараметров.Локальные.Счет0233;
	СчетУчета0234 = ЭтотОбъект.КэшПараметров.Локальные.Счет0234;
	
	Если ВычислятьСчет Тогда
		НоменклатураДокумента = Объект.Материалы.Выгрузить().ВыгрузитьКолонку("Номенклатура"); // Массив из СправочникСсылка.Номенклатура
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(НоменклатураДокумента, "СчетУчета, ТипНоменклатуры");
		КЭШСчетов = Новый Соответствие;
		Для каждого ТекСтрока Из Объект.Материалы Цикл
			СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			
			// Если нужен счет 106.хх и в таблице заполнен счет 105,
			// нужно попробовать определить счет 106.хх по счету 105.хх (113.хх)
			Если ЗаполнятьСчет106 Тогда
				Если ЗначениеЗаполнено(ТекСтрока.СчетУчета)
					И (ВсеСчета105.НайтиПоЗначению(ТекСтрока.СчетУчета) <> Неопределено
						Или ВсеСчета113.НайтиПоЗначению(ТекСтрока.СчетУчета) <> Неопределено) Тогда
					СчетУчета = УправлениеМатериальнымиЗапасами.СчетВложенийПоСчетуМатериала(ТекСтрока.СчетУчета,
																							 Объект.Организация,
																							 Объект.Дата);
				КонецЕсли;
			КонецЕсли;
			
			ТекНоменклатура = ДанныеНоменклатуры.Получить(ТекСтрока.Номенклатура);
			Если Не ЗначениеЗаполнено(СчетУчета) И ТекНоменклатура <> Неопределено Тогда
				СчетУчетаСтр = ТекНоменклатура.СчетУчета;
				СчетУчета = КЭШСчетов.Получить(СчетУчетаСтр);
				Если СчетУчета = Неопределено Тогда
					СчетУчета = БухгалтерскийУчет.СчетПоКоду(СчетУчетаСтр, Объект.Дата, Объект.Организация);
					КЭШСчетов.Вставить(СчетУчетаСтр, СчетУчета);
				КонецЕсли;
				Если ЗаполнятьСчет106 И ЗначениеЗаполнено(СчетУчета) Тогда
					// Из полученного счета 105 (113) нужно получить счет 106
					СчетУчета = УправлениеМатериальнымиЗапасами.СчетВложенийПоСчетуМатериала(
						СчетУчета,
						Объект.Организация,
						Объект.Дата);
				КонецЕсли;
			КонецЕсли;
			ТекСтрока.СчетУчета = СчетУчета;
			Если ЗначениеЗаполнено(СчетУчета) И ТекНоменклатура <> Неопределено Тогда
				ТекСтрока.КЭК = БухгалтерскийУчет.КЭКНоменклатуры(Объект.Организация, Объект.ИФО, ТекСтрока.КФО,
					Объект.Дата, СчетУчета, ТекНоменклатура.ТипНоменклатуры, "Дт");
			Иначе
				ТекСтрока.КЭК = Справочники.КОСГУ.ПустаяСсылка();
			КонецЕсли;
			//Проверим если счет относится к комиссионной торговле необходимо заполнить признак "Комиссионная торговля" у позиции номенклатуры
			Если ТекСтрока.СчетУчета = СчетУчета0233 ИЛИ ТекСтрока.СчетУчета = СчетУчета0234 Тогда
				ТекСтрока.КомиссионнаяТорговля = Истина;
			Иначе
				ТекСтрока.КомиссионнаяТорговля = Ложь;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Объект.СчетУчета);
		Для каждого ТекСтрока Из Объект.Материалы Цикл
			ТекСтрока.СчетУчета = Объект.СчетУчета;
			//Проверим если счет относится к комиссионной торговле необходимо заполнить признак "Комиссионная торговля" у позиции номенклатуры
			Если ТекСтрока.СчетУчета = СчетУчета0233 ИЛИ ТекСтрока.СчетУчета = СчетУчета0234 Тогда
				ТекСтрока.КомиссионнаяТорговля = Истина;
			Иначе
				ТекСтрока.КомиссионнаяТорговля = Ложь;
			КонецЕсли;
			ТекСтрока.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка();
			ТекСтрока.УчетПоКПС = СвойстваСчета.УчетПоКПС;
			Если НЕ СвойстваСчета.УчетПоКПС Тогда
				ТекСтрока.КПС = Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
				ТекСтрока.КЭК = Справочники.КОСГУ.ПустаяСсылка();
			КонецЕсли;
			ТекСтрока.НДСКРаспределению = Ложь;
			РасчитатьСтроку(ТекСтрока, Объект.СуммаВключаетНДС, "СтавкаНДС");
		КонецЦикла;
		Если Не СвойстваСчета.Валютный Тогда
			Объект.ВалютаДокумента = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(Ложь);
	УстановитьЗачетАванса(ЭтотОбъект);
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);

КонецПроцедуры // УстановитьСчетУчетаВТаблицеМатериалы()

&НаСервере
Процедура УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ЗаполнятьВозвратнуюТару, ДанныеСчетовВФорме = Неопределено)
	ПараметрыЗаполненияКолонок = УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки_Параметры(
		ЭтотОбъект, Объект);
	ПараметрыЗаполненияКолонок.Включать106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
	ПараметрыЗаполненияКолонок.Включать113 = Истина;
	ПараметрыЗаполненияКолонок.ДанныеСчетов = ДанныеСчетовВФорме;
	УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки(ПараметрыЗаполненияКолонок);
	
	Если ВестиУчетПоЗакупкеТоваровУслугДляКомитентов Тогда
		ПараметрыЗаполненияКолонок.Включать0234 = Истина;
	КонецЕсли;
	
	Если ЗаполнятьВозвратнуюТару Тогда
		ПараметрыЗаполненияКолонок = УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки_Параметры(
			ЭтотОбъект, Объект);
		ПараметрыЗаполненияКолонок.ИмяТаблицы = "ВозвратнаяТара";
		ПараметрыЗаполненияКолонок.ДанныеСчетов = ДанныеСчетовВФорме;
		УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки(ПараметрыЗаполненияКолонок);
	КонецЕсли;
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	Отказ = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПериодЗаполнения = Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая);
	Иначе
		ПериодЗаполнения = Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	Документы.ПоступлениеМЗ.ЗаполнитьПоОстаткамАвансов(Объект, ПериодЗаполнения, Отказ);
	
	Если НЕ Отказ Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОтменитьПроведениеПередЗаполнениемДО(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДОНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПериодОстатков = Новый Граница(КонецДня(ДокументОбъект.Дата), ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	ТаблицаОбязательств = УчетРасчетов.ДенежныеОбязательстваПоПоступлениюТРУ(ДокументОбъект, ПериодОстатков);
	
	Объект.ДенежныеОбязательства.Загрузить(ТаблицаОбязательств);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетУчетаВШапке()
	
	УстановитьСчет105 = ВидПоступленияТолькоСчет105(Объект.ВидПоступленияМЗ)
		И Не УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(ЭтотОбъект)
		И Не УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
	УстановитьСчет0233 = ВидПоступленияТолькоСчет0233(Объект.ВидПоступленияМЗ);
	Если УстановитьСчет105 Тогда
		Объект.СчетУчета = ЭтотОбъект.КэшПараметров.Локальные.Счет105;
		УстановитьСчетУчетаВТаблицеМатериалы();
	ИначеЕсли УстановитьСчет0233 Тогда
		Объект.СчетУчета = ЭтотОбъект.КэшПараметров.Локальные.Счет0233;
		УстановитьСчетУчетаВТаблицеМатериалы()
	КонецЕсли;

КонецПроцедуры // УстановитьСчетУчетаВШапке()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИзмененияСчетовУчета(Форма, Объект)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СчетУчета",
		"Доступность", НЕ ВидПоступленияТолькоСчет105(Объект.ВидПоступленияМЗ));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВозвратИзПользования(ВидПоступленияМЗ)

	Возврат ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ВозвратИзАренды")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ВозвратИзБезвПользования")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ВозвратИзДоверительногоУправления");
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВозвратИзЛичногоПользования(ВидПоступленияМЗ)

	Возврат ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования");
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидПоступленияТолькоСчет105(ВидПоступления)
	
	ВидыПоступлений = Новый Массив;
	ВидыПоступлений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета"));
	ВидыПоступлений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзАренды"));
	ВидыПоступлений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзДоверительногоУправления"));
	ВидыПоступлений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзБезвПользования"));
	ВидыПоступлений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования"));
	
	Возврат ВидыПоступлений.Найти(ВидПоступления) <> Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидПоступленияТолькоСчета105_106(ВидПоступления)
	Возврат ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика");
КонецФункции

&НаКлиенте
Функция ТребуетсяПерезаполнитьСписокСчетовУчетаВШапке()
	ДоИзмененияТолько105_106 = ВидПоступленияТолькоСчета105_106(ВидПоступленияДоИзменения);
	ПослеИзмененияТолько105_106 = ВидПоступленияТолькоСчета105_106(Объект.ВидПоступленияМЗ);
	Возврат ДоИзмененияТолько105_106 <> ПослеИзмененияТолько105_106;
КонецФункции

#Область УчетДрагМатериалов

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитовДМ() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыДобавленияДМ(ПараметрыПодбора) Экспорт
	Если (Объект.ДрагоценныеМатериалы.Количество() > 0) И(ПараметрыПодбора.ВариантВводаДанных < 2) Тогда
		ПараметрыПодбора.Вставить("АдресДМВХранилище", ПоместитьДМВХранилище(ПараметрыПодбора));
	Иначе	
		ПараметрыПодбора.Вставить("АдресДМВХранилище", "");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДМВХранилище(ПараметрыПодбора)
	
	МассивСтрок = ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора);

	ТаблицаНФА = Объект.ДрагоценныеМатериалы.Выгрузить(МассивСтрок,
		"ОбъектНФА, ВидДрагМатериала, МассаДМ, КоличествоДМ, ЧистаяМасса, ЛигатурнаяМасса, ЕдИзм");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНФА);

КонецФункции

&НаСервере
Функция ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ПараметрыПодбора.ОбъектНФА);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеСтроки;
КонецФункции	

&НаСервере
Процедура ОбработкаДобавленияДМДляОбъектаНаСервере(Знач ВыбранноеЗначение)
	
	ДобавленныеСтроки = УчетДрагМатериалов.ОбработатьДобавлениеДМДляОбъекта(
		Объект.ДрагоценныеМатериалы, ВыбранноеЗначение, , "ОбъектНФА,ВидДрагМатериала");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	Для каждого ТекСтрока Из Объект.ДрагоценныеМатериалы Цикл
		ТекСтрока.КлючСтроки = УчетДрагМатериаловКлиент.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА, "");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыСДрагМатериалами()
	ТаблицаВсехОбъектов = Объект.Материалы.Выгрузить(,"Номенклатура, СчетУчета, Количество");
	
	ТаблицаОбъектовМЗ = Новый ТаблицаЗначений;
	ТаблицаОбъектовМЗ.Колонки.Добавить("КлючСтроки",Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовМЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОбъектовМЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	
	НеСодержатДрагМатериалы = УчетДрагМатериалов.ПолучитьМассивТиповНоменклатурыБезДрагМатериалов();
	МассивСчетовМЗ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗ();
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Если НеСодержатДрагМатериалы.Найти(ТекСтрока.Номенклатура.ТипНоменклатуры) = Неопределено Тогда
				Если МассивСчетовМЗ.Найти(ТекСтрока.СчетУчета)<>Неопределено Тогда
					НоваяСтрока = ТаблицаОбъектовМЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					НоваяСтрока.КлючСтроки = УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.Номенклатура, ""); 
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	УчетДрагМатериалов.ЗаполнитьДляМЗДанныеОТехДокументации(ТаблицаОбъектовМЗ);
	
	ОбъектыНФАСДрагМатериалами.Загрузить(ТаблицаОбъектовМЗ);
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьВидимостьДанныхДрагМатериалов()
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Истина;
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
		
		Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные <> Неопределено Тогда
			ОтборДрагМатериаловДляОбъекта(Элементы.СписокНФАДокументаОснования.ТекущиеДанные.КлючСтроки);
		КонецЕсли;
	Иначе
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Ложь;
		Элементы.ДрагоценныеМатериалы.ОтборСтрок = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДрагМатериаловДляОбъекта(КлючСтроки)
	
	Элементы.ДрагоценныеМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки",КлючСтроки));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючиСтрокДрагМатериалов()
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = Новый ТаблицаЗначений;
	ТаблицаНФА.Колонки.Добавить("ОбъектНФА", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНФА.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаНФА.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого ИдСтроки Из ВыделенныеСтрокиТЧ Цикл
		СтрокаТЧ = ОбъектыНФАСДрагМатериалами.НайтиПоИдентификатору(ИдСтроки);
		НоваяСтрока = ТаблицаНФА.Добавить();
		НоваяСтрока.ОбъектНФА = СтрокаТЧ.Номенклатура;
		НоваяСтрока.Количество = СтрокаТЧ.Количество;
	КонецЦикла;
	
	Возврат ТаблицаНФА;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ);
	ТаблицаДМ = ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтрокиТЧ); 
	
	Массив = Новый Массив;
	Массив.Добавить(ТаблицаНФА);
	Массив.Добавить(ТаблицаДМ);
	
	Возврат ПоместитьВоВременноеХранилище(Массив);

КонецФункции

&НаСервере
Функция ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтроки) 
	ВыбранныеНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтроки);
	
	ТаблицаДМ = Объект.ДрагоценныеМатериалы.Выгрузить();
	ТаблицаДМ.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	
	Результат = УчетДрагМатериалов.ЕдиныйСписокДрагМатериаловДляНесколькихОбъектовНФА(ТаблицаДМ, ВыбранныеНФА);
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопросаОДрагМатериалах(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.НайденныеСтроки Цикл
		Объект.ДрагоценныеМатериалы.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуПоДоговору(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуПоДоговоруНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоДоговоруНаСервере()
	
	Объект.Материалы.Очистить();
	
	Документы.ПоступлениеМЗ.ЗаполнитьПоДоговору(Объект, Объект.Договор);

	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(Ложь);
	
	УстановитьВидимостьКПСРасчетовВТЧ(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА()
	Элемент = Элементы.СписокНФАДокументаОснования;
	ОтборДрагМатериаловДляОбъекта(Элемент.ТекущиеДанные.КлючСтроки);
КонецПроцедуры	

&НаСервере
Процедура ДобавитьДрагМатериалыОбъектаПоТехДокументации(ВыбранныйОбъектНФА, ОбъектНФА, Количество)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	               |	СУММА(ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.МассаДМ * &Количество) КАК МассаДМ,
	               |	СУММА(ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.КоличествоДМ * &Количество) КАК КоличествоДМ,
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ЕдИзм КАК ЕдИзм
	               |ИЗ
	               |	Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.ДрагМатериалы КАК ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы
	               |ГДЕ
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ВидДрагМатериала,
	               |	ДрагМатериалыВОбъектеНФАПоТехДокументацииДрагМатериалы.ЕдИзм";

	Запрос.УстановитьПараметр("Ссылка", ВыбранныйОбъектНФА);
	Запрос.УстановитьПараметр("Количество", Количество);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ДрагоценныеМатериалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		НоваяСтрока.ОбъектНФА = ОбъектНФА;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДрагМатериалыПоТехДокументацииНаСервере()
	ТаблицаНФА = ОбъектыНФАСДрагМатериалами.Выгрузить();
	УчетДрагМатериалов.ЗаполнитьДляМЗДанныеОСодержанииДрагМатериаловТехДокументации(ТаблицаНФА);
	Объект.ДрагоценныеМатериалы.Загрузить(ТаблицаНФА);
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуСведенийОСодержанииДрагМатериаловПоТехДокументации(ОбъектНФА, ТехДокументация)
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ТехДокументация) Тогда
		ПараметрыФормы.Вставить("Ключ", ТехДокументация);
	Иначе
		ПараметрыФормы.Вставить("ОбъектНФА", ОбъектНФА);
	КонецЕсли;	
	ОткрытьФорму("Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗачетАванса(Форма)

	Объект = Форма.Объект;
	
	Если Объект.ВидПоступленияМЗ <> ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика") Тогда
		
		Если Объект.СпособЗачетаАванса <> ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать") Тогда
			
			Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
			Объект.ЗачетАвансов.Очистить();
			УчетРасчетовКлиентСервер.УправлениеЭлементамиЗачетаАвансов(Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьЗачетАванса()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьУчетНДС(Форма)

	Объект = Форма.Объект;
	Если Не УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ПоступлениеМЗЭтоПоступлениеИлиВозврат(Объект.ВидПоступленияМЗ) Тогда
		Объект.ПринятьНДСКВычету = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВалюту(Форма)

	Объект = Форма.Объект;
	Если Не УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ПоступлениеМЗЭтоПоступлениеИлиВозврат(Объект.ВидПоступленияМЗ) Тогда
		Объект.ВалютаДокумента = Форма.КэшПараметров.ВалютаРегламентированногоУчета;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	
	ПараметрыПредставления = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта_Параметры();
	ПараметрыПредставления.ВалютаДокумента = Объект.ВалютаДокумента;
	ПараметрыПредставления.ПринятьНДСКВычету = Объект.ПринятьНДСКВычету;
	ПараметрыПредставления.СуммаВключаетНДС = Объект.СуммаВключаетНДС;
	ПараметрыПредставления.ПринятьНДСКВычетуУказываетсяВСтроках = Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	ПараметрыПредставления.ПоказыватьНДС = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ВПоступленииМЗВозможенУчетНДС(Форма);
	ПараметрыПредставления.УчитыватьНДС = ПараметрыПредставления.ПоказыватьНДС;
	ПараметрыПредставления.ПоказыватьВалюту = Форма.КэшПараметров.ИспользоватьВалютныйУчет;
	
	Форма.НадписьВалютаНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокЗакладкиВозвратИзАренды(Форма)
	Если ЭтоВозвратИзПользования(Форма.Объект.ВидПоступленияМЗ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаВозвратИзАренды",
			"Заголовок", Форма.Объект.ВидПоступленияМЗ);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	
	Элементы = Форма.Элементы;

	УстановитьВидимостьЭлементовФормы_ПоДоверенности(Форма);
	УстановитьВидимостьЭлементовФормы_ОснованиеДляАкта(Форма);
	УстановитьВидимостьЭлементовФормы_Комиссия(Форма);
	УстановитьВидимостьЭлементовФормы_Корректировка(Форма);
	УстановитьВидимостьЭлементовФормы_НДС(Форма);
	УстановитьВидимостьЭлементовФормы_ПоступлениеОтПоставщика(Форма);
	УстановитьВидимостьЭлементовФормы_СчетРасчетов(Форма);
	УстановитьВидимостьЭлементовФормы_Отправитель(Форма);
	УстановитьВидимостьЭлементовФормы_Валюта(Форма);
	УстановитьВидимостьЭлементовФормы_ЗабалансовыйСчет(Форма);
	УстановитьВидимостьЭлементовВозвратаИзПользования(Форма);
	УстановитьВидимостьВидаПользования(Форма);
	УстановитьВидимостьЭлементовФормы_ДокументПоставщика(Форма);
	УстановитьВидимостьЭлементовФормы_ПоставкаОтКонтрагента(Форма);
	УстановитьВидимостьЭлементовФормы_ЦМОПриВозврате(Форма);
	УстановитьВидимостьКПСРасчетовВТЧ(Форма);
	УстановитьВидимостьЭлементовКомиссионнаяТорговля(Форма);
	
	ВидимостьНадписиВалютаНДС = ВДокументеВозможенУчетВалюты(Форма)
			Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ВПоступленииМЗВозможенУчетНДС(Форма);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьВалютаНДС",
		"Видимость", ВидимостьНадписиВалютаНДС);
	
	ВидимостьРеквизитовВозврата =
		Форма.Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МатериалыЦенаОприходования",
		"Видимость", ВидимостьРеквизитовВозврата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВозвратнаяТараЦенаОприходования",
		"Видимость", ВидимостьРеквизитовВозврата);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МатериалыДополнительноеСубконтоСчета", "Видимость",
		ЗначениеЗаполнено(Форма.ДополнительноеСубконто27ВидСубконто));
	
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ЦМОПриВозврате(Форма)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ЦМОПриВозврате");
	ИменаЭлементов.Добавить("ПодразделениеПриВозврате");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", ЭтоВозвратИзПользования(Форма.Объект.ВидПоступленияМЗ));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Комиссия(Форма)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Комиссия");
	ИменаЭлементов.Добавить("СоставКомиссии");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", ЭтоАктОПриемеПередаче0510448(Форма));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ОснованиеДляАкта(Форма)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ОснованиеДляАкта");
	ИменаЭлементов.Добавить("НомерОснованияДляАкта");
	ИменаЭлементов.Добавить("ДатаОснованияДляАкта");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", ЭтоАктОПриемеПередаче0510448(Форма));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Прослеживаемость(Форма)

	Элементы = Форма.Элементы;
	
	ВидимостьРНПТ = Форма.ВедетсяУчетПрослеживаемыхТоваров
		И Форма.Объект.ОтражатьВПрослеживаемости
		И НЕ Форма.ПоставщикРезидентТаможенногоСоюза
		И Форма.ЕстьПрослеживаемыеТовары;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МатериалыРНПТ",
		"Видимость", ВидимостьРНПТ);
	ВидимостьУведомленияОВвозе = Форма.ВедетсяУчетПрослеживаемыхТоваров
		И Форма.ПоставщикРезидентТаможенногоСоюза
		И Форма.ЕстьПрослеживаемыеТовары;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьУведомлениеОВвозе",
		"Видимость", ВидимостьУведомленияОВвозе);
	
	ВидимостьРеквизитовПрослеживаемости = Форма.ВедетсяУчетПрослеживаемыхТоваров И Форма.ЕстьПрослеживаемыеТовары;
	ИменаЭлементовПрослеживаемости = Новый Массив;
	ИменаЭлементовПрослеживаемости.Добавить("МатериалыСтранаПроисхождения");
	ИменаЭлементовПрослеживаемости.Добавить("МатериалыПрослеживаемыйТовар");
	ИменаЭлементовПрослеживаемости.Добавить("КодОперацииПрослеживаемости");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовПрослеживаемости,
		"Видимость", ВидимостьРеквизитовПрослеживаемости);
	ВидимостьФлагаОтражатьВПрослеживаемости = ВидимостьРеквизитовПрослеживаемости
		И Форма.Объект.ВидПоступленияМЗ <> ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтражатьВПрослеживаемости",
		"Видимость", ВидимостьФлагаОтражатьВПрослеживаемости);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Отправитель(Форма)
	ВидПоступленияМЗ = Форма.Объект.ВидПоступленияМЗ;
	Видимость = ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзАренды")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзДоверительногоУправления")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзБезвПользования")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования")
		И Форма.ПриСозданииНаСервереЗаполненКонтрагент
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеКомиссионныхТоваров")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.Поступление")
		ИЛИ ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика");
		
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Контрагент", "Видимость",
		Видимость);
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Договор");
	ИменаЭлементов.Добавить("ГруппаКонтрольИсполнения");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов, "Видимость",
		Видимость И Не ЭтоВозвратИзЛичногоПользования(ВидПоступленияМЗ));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ЗабалансовыйСчет(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	ВидимостьЗабалансовыйСчет = Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗабалансовыйСчет",
		"Видимость", ВидимостьЗабалансовыйСчет);

	ВидимостьЗабалансовыхСубконто = Новый Массив(3);
	Для Индекс = 0 По 2 Цикл
		ВидимостьЗабалансовыхСубконто[Индекс] = Ложь;
	КонецЦикла;
	Если ВидимостьЗабалансовыйСчет Тогда
		Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоДоп) Тогда
			ВидимостьЗабалансовыхСубконто[Форма.НомерЗабалансовогоСубконтоДоп - 1] = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоЦМО) Тогда
			ВидимостьЗабалансовыхСубконто[Форма.НомерЗабалансовогоСубконтоЦМО - 1] = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоОС) Тогда
			ВидимостьЗабалансовыхСубконто[Форма.НомерЗабалансовогоСубконтоОС - 1] = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Для Номер = 1 По ВидимостьЗабалансовыхСубконто.Количество() Цикл
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"МатериалыСубконтоЗабалансовыйСчет" + Номер,
		"Видимость",
		ВидимостьЗабалансовыхСубконто[Номер - 1]);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	"МатериалыИнвентарныйНомер",
	"Видимость",
	ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоОС));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Валюта(Форма)

	ЭлементыВалюта = Новый Массив;
	ЭлементыВалюта.Добавить("ВалютаИтогов");
	ЭлементыВалюта.Добавить("НадписьВалютаНДС");
	
	Элементы = Форма.Элементы;
	УчитываетсяВалюта = ВДокументеВозможенУчетВалюты(Форма);

	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыВалюта,
		"Видимость", УчитываетсяВалюта);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_СчетРасчетов(Форма)
	ЭлементыФормы = Новый Массив;
	ЭлементыФормы.Добавить("СчетРасчетов");
	ЭлементыФормы.Добавить("ГруппаКПС");
	ЭлементыФормы.Добавить("КПСРасчетов");
	ЭлементыФормы.Добавить("НесколькоКПСРасчетовв");

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьЭлементов = Объект.ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыФормы,
		"Видимость", ВидимостьЭлементов);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ПоДоверенности(Форма)

	Видимость = Не ЭтоАктОПриемеПередаче0510448(Форма)
		И Не ЭтоВозвратИзЛичногоПользования(Форма.Объект.ВидПоступленияМЗ);
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ЦМОСдал");
	ИменаЭлементов.Добавить("Доверенность");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов, "Видимость", Видимость);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ДокументПоставщика(Форма)

	Видимость = (Не ЭтоАктОПриемеПередаче0510448(Форма)
			Или Форма.Объект.НФАПереданыЭлектроннымАктом)
		И Не ЭтоВозвратИзЛичногоПользования(Форма.Объект.ВидПоступленияМЗ);

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ВидПервичногоДокумента");
	ИменаЭлементов.Добавить("НомерПервичногоДокумента");
	ИменаЭлементов.Добавить("ДатаПервичногоДокумента");
	ИменаЭлементов.Добавить("ДатаПодписанияПервичногоДокумента");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов, "Видимость", Видимость);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ПоступлениеОтПоставщика(Форма)
		
	ЭлементыПоступленияОтПоставщика = Новый Массив;
	ЭлементыПоступленияОтПоставщика.Добавить("СпособЗачетаАванса");
	ЭлементыПоступленияОтПоставщика.Добавить("ЗачетАванса");
	ЭлементыПоступленияОтПоставщика.Добавить("СтрДенежныеОбязательства");
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	ЭтоПоступлениеОтПоставщика = Объект.ВидПоступленияМЗ = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика")
		И (УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(Форма)
			Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(Форма));
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыПоступленияОтПоставщика,
		"Видимость", ЭтоПоступлениеОтПоставщика);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_НДС(Форма)
	
	ЭлементыНДС = Новый Массив;
	ЭлементыНДС.Добавить("СчетФактура");
	// колонки таблицы Материалы
	ЭлементыНДС.Добавить("МатериалыСуммаНДС");
	// если НДС не выводим, то колонка Всего тоже не нужна
	ЭлементыНДС.Добавить("МатериалыВсего");
	// итоги
	ЭлементыНДС.Добавить("МатериалыИтогНДС");
	ЭлементыНДС.Добавить("ДекорацияПустая2");
	ЭлементыНДС.Добавить("СуммаНДСДокумента");
	// команда
	ЭлементыНДС.Добавить("ФормаПринятьНДСКВычетуУказываетсяВСтроках");
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	УчитываетсяНДС = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ВПоступленииМЗВозможенУчетНДС(Форма);
	Если УчитываетсяНДС Тогда
		ПринятьНДСКВычетуУказываетсяВСтроках = Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
		ПринятьНДСКВычетуУказываетсяВШапке = Не Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	Иначе
		ПринятьНДСКВычетуУказываетсяВСтроках = Ложь;
		ПринятьНДСКВычетуУказываетсяВШапке = Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыНДС,
		"Видимость", УчитываетсяНДС И НЕ Форма.Объект.ЭтоКорректировка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МатериалыСтавкаНДС",
		"Видимость", УчитываетсяНДС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДекорацияОтступ",
		"Видимость", НЕ УчитываетсяНДС И НЕ Форма.Объект.ЭтоКорректировка);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МатериалыСпособУчетаНДС",
		"Видимость", ПринятьНДСКВычетуУказываетсяВСтроках И НЕ Форма.Объект.ЭтоКорректировка);
	ЭлементыНДСКРаспределению = Новый Массив;
	ЭлементыНДСКРаспределению.Добавить("МатериалыНДСКРаспределению");
	ЭлементыНДСКРаспределению.Добавить("МатериалыТекстНДСКРаспределению");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыНДСКРаспределению,
		"Видимость", ПринятьНДСКВычетуУказываетсяВШапке И НЕ Форма.Объект.ЭтоКорректировка);
	
	Элементы.ФормаПринятьНДСКВычетуУказываетсяВСтроках.Пометка = Объект.ПринятьНДСКВычетуУказываетсяВСтроках;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Корректировка(Форма)

	ИменаЭлементовСКорректировкой = Новый Массив;
	ИменаЭлементовСКорректировкой.Добавить("МатериалыЗаголовокДоКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("МатериалыЗаголовокПослеКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("МатериалыКоличествоДоКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("МатериалыКоличество1");
	ИменаЭлементовСКорректировкой.Добавить("МатериалыСуммаДоКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("МатериалыСуммаНДС1");
	ИменаЭлементовСКорректировкой.Добавить("МатериалыСуммаНДСДоКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("МатериалыВсегоДоКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("ВозвратнаяТараЗаголовокДоКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("ВозвратнаяТараЗаголовокПослеКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("ВозвратнаяТараКоличествоДоКорректировки");
	ИменаЭлементовСКорректировкой.Добавить("ВозвратнаяТараСуммаДоКорректировки");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементовСКорректировкой,
		"Видимость", Форма.Объект.ЭтоКорректировка);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовВозвратаИзПользования(Форма)

	Видимость = ЭтоВозвратИзЛичногоПользования(Форма.Объект.ВидПоступленияМЗ);
	
	ЭлементыВозвратаИзПользования = Новый Массив;
	ЭлементыВозвратаИзПользования.Добавить("ПолучательИмущества");
	ЭлементыВозвратаИзПользования.Добавить("МатериалыВидимыеДефекты");
	ЭлементыВозвратаИзПользования.Добавить("МатериалыОсобыеОтметки");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		ЭлементыВозвратаИзПользования, "Видимость", Видимость);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПодразделениеИсточник",
		"Видимость", Видимость И Форма.УчетПоПодразделениямНаСчетахУчетаИмущества);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьВидаПользования(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ВидБезвозмездногоПользования",
		"Видимость",
		Форма.Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзБезвПользования"));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВДокументеВозможенУчетВалюты(Форма)
	Возврат (УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ПоступлениеМЗЭтоПоступлениеИлиВозврат(Форма.Объект.ВидПоступленияМЗ) 
		И (УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(Форма)
			Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(Форма)))
		Или (ЗначениеЗаполнено(Форма.Объект.СчетУчета)
		И БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Форма.Объект.СчетУчета).Валютный);
КонецФункции

&НаКлиенте
Процедура УстановитьВДокументеВозможенУчетНДС()
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВДокументеВозможенУчетНДС",
		УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ВПоступленииМЗВозможенУчетНДС(ЭтотОбъект));
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСубконтоЗабалансовогоСчета(Форма)
	Если ЗначениеЗаполнено(Форма.ЗаголовокЗабалансовогоСубконтоДоп) Тогда
		ТекстЗаголовка = СтрШаблон(НСтр("ru = '(заб) %1'"), Форма.ЗаголовокЗабалансовогоСубконтоДоп);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"МатериалыСубконтоЗабалансовыйСчет" + Форма.НомерЗабалансовогоСубконтоДоп,
			"Заголовок",
			ТекстЗаголовка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоЦМО) Тогда
		ТекстЗаголовка = НСтр("ru = '(заб) ЦМО'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"МатериалыСубконтоЗабалансовыйСчет" + Форма.НомерЗабалансовогоСубконтоЦМО,
			"Заголовок",
			ТекстЗаголовка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.НомерЗабалансовогоСубконтоОС) Тогда
		ТекстЗаголовка = НСтр("ru = '(заб) ОС'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"МатериалыСубконтоЗабалансовыйСчет" + Форма.НомерЗабалансовогоСубконтоОС,
			"Заголовок",
			ТекстЗаголовка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеДинамическихКолонок(ДанныеСчетовВФорме = Неопределено)

	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(Истина, ДанныеСчетовВФорме);
		
	УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьТекстЗаголовковКорректировкиВТаблице(Объект.Материалы);
	УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьТекстЗаголовковКорректировкиВТаблице(Объект.ВозвратнаяТара);
	
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект);
	УправлениеНФАКлиентСервер.ЗаполнитьСпособУчетаНДСВСтроках(Объект, Объект.Материалы);
	

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448)
	
	Если ВидимостьЭлементовЭДОДляЭДПоставщика Тогда
		ВидимостьЭлементовЭДО = Истина;
		Форма.Элементы.ДекорацияСостояниеЭДО.Заголовок = НСтр("ru='Отражение ЭД в учете'");
	Конецесли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НадписьДопСведенияЭлектронногоАктаПоФорме0510448", "Видимость", ВидимостьЭлементовЭДОАкта448);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи", "Видимость", ВидимостьЭлементовЭДОАкта448);
	
	Если ВидимостьЭлементовЭДОАкта448 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"СтраницаКомиссия", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"Комиссия", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"СоставКомиссии", "Видимость", Истина);
	КонецЕсли;
КонецПроцедуры	
	
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Функция ВидимостьЭлементовЭДОДляДокумента()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура ЦМОПриИзмененииНаСервере()
	
	ВестиКонтрольОстатковТоваров = РозничныеПродажиБГУ.ЭтоСкладТорговойТочки(Объект.ЦМО);
	Объект.ПоступлениеТоваровНаСкладТорговойТочки = ВестиКонтрольОстатковТоваров;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ПоступлениеТоваровНаСкладТорговойТочки", "Видимость", ВестиКонтрольОстатковТоваров);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьПредставлениеНадписиУведомлениеОВвозе()
	
	ПрослеживаемостьФормыБГУ.УстановитьПредставлениеНадписиУведомлениеОВвозе(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НапоминатьОбУведомленияхОВвозе()
	
	РассчитатьНеобходимостьНапоминанияОВвозе();
	УстановитьВидимостьЭлементовФормы_Прослеживаемость(ЭтотОбъект);
	УстановитьОбязательностьДатыНомераДокументаПоставщика();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНапоминанияОбУведомленияхОВвозе(Форма)

	Если Форма.ПоказыватьБаннерУведомленийОВвозе Тогда
		ШаблонТекста = НСтр("ru = 'В документе присутствуют прослеживаемые товары. До %1 необходимо создать и отправить уведомление о ввозе в налоговую инспекцию и получить РНПТ.'");
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДекорацияУведомление",
			"Заголовок",
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонТекста, Формат(Форма.СрокУведомленияОВвозе, "ДФ='дд ММММ'")));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаБаннерУведомлениеОВвозе",
			"Видимость", Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаБаннерУведомлениеОВвозе",
			"Видимость", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТребуетсяНапоминаниеОбУведомленииОВвозе()
	
	ПрослеживаемыеТовары     = Объект.Материалы.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина));
	ЕстьПрослеживаемыеТовары = ПрослеживаемыеТовары.Количество() > 0;
	
	Возврат ЕстьПрослеживаемыеТовары
		И ПоставщикРезидентТаможенногоСоюза;

КонецФункции

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)

	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыбранноеЗначение.ВариантКомплектаПТ) Тогда
			СтрокаТабличнойЧасти.ВариантКомплектаПТ = ВыбранноеЗначение.ВариантКомплектаПТ; 
		КонецЕсли;
		ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки, ВыбранноеЗначение, СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр)
	
	СтрокаТабличнойЧасти = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТН(ЭтотОбъект, ИдентификаторСтроки, ВыбранноеЗначение);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ПараметрыУО = УправлениеМатериальнымиЗапасами.ПараметрыУстановкиУсловногоОформленияСпискаМатериалов();
	ПараметрыУО.ИмяТаблицы = "Материалы";
	ПараметрыУО.ИспользуетсяКЭКАвто = Истина;
	ПараметрыУО.ИмяКолонкиУчетПоКЭК = "УчетПоКЭК";
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериаловПоПараметрам(
		ЭтотОбъект, ПараметрыУО);
	
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериалов(ЭтотОбъект, "ВозвратнаяТара", Истина);
	УчетУСН.УстановитьУсловноеОформлениеОтражениеВУСН(ЭтотОбъект, "Материалы");
	УчетНДС.УстановитьУсловноеОформлениеПолейНДСКРаспределению(УсловноеОформление, "Материалы");

	ЦветТекстаНедоступныеДанные = Метаданные.ЭлементыСтиля.НедоступныеДанныеЦвет.Значение;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Материалы.Сумма", 0);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.ВидПоступленияМЗ", Перечисления.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекстаНедоступныеДанные);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = 'по забалансовой стоимости'"));
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("МатериалыСумма");
	Поле.Использование = Истина;
	
	ЦветТекстаЗапрещеннойЯчейки = Метаданные.ЭлементыСтиля.ТекстЗапрещеннойЯчейкиЦвет.Значение;

	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Материалы.ЕстьДополнительноеСубконто", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",     ЦветТекстаЗапрещеннойЯчейки);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",          НСтр("ru = '<не используется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", НСтр("ru = 'Истина'"));
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("МатериалыДополнительнаяАналитикаСчета");
	Поле.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Материалы.КомиссионнаяТорговля", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.ВидПоступленияМЗ", Перечисления.ВидыПоступленийМЗ.ПоступлениеОтПоставщика);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",     ЦветТекстаЗапрещеннойЯчейки);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",          НСтр("ru = '<не используется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", НСтр("ru = 'Истина'"));
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("МатериалыДополнительнаяАналитикаСчета");
	Поле.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Материалы.КомиссионнаяТорговля", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",     ЦветТекстаЗапрещеннойЯчейки);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",          НСтр("ru = '<не используется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", НСтр("ru = 'Истина'"));
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("МатериалыКомитент");
	Поле.Использование = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Материалы.КомиссионнаяТорговля", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста",     ЦветТекстаЗапрещеннойЯчейки);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",          НСтр("ru = '<не используется>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", НСтр("ru = 'Истина'"));
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("МатериалыДоговорКомитента");
	Поле.Использование = Истина;

	ПрослеживаемостьФормыБГУ.УстановитьУсловноеОформление(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура РассчитатьНеобходимостьНапоминанияОВвозе()
	
	ТребуетсяНапоминаниеДо = ТребуетсяНапоминаниеУведомленийОВвозе;
	ПоказыватьБаннерДо     = ПоказыватьБаннерУведомленийОВвозе;
	
	ТребуетсяНапоминаниеУведомленийОВвозе = ТребуетсяНапоминаниеОбУведомленииОВвозе();
	ПоказыватьБаннерУведомленийОВвозе     = ТребуетсяНапоминаниеУведомленийОВвозе И СписокУведомлений.Количество() = 0 И НЕ ОтключитьБаннерУведомленийОВвозе;
	Если ПоказыватьБаннерУведомленийОВвозе Тогда
		СрокУведомленияОВвозе = ПрослеживаемостьБГУ.СрокПодачиУведомления(Объект.Дата);
	КонецЕсли;
	
	Если ОбновитьСрокОтправкиУведомленийОВвозе
		ИЛИ ТребуетсяНапоминаниеДо <> ТребуетсяНапоминаниеУведомленийОВвозе
		ИЛИ ПоказыватьБаннерДо <> ПоказыватьБаннерУведомленийОВвозе Тогда
		
		УстановитьВидимостьНапоминанияОбУведомленияхОВвозе(ЭтотОбъект);
		ОбновитьСрокОтправкиУведомленийОВвозе = Ложь;
	КонецЕсли;
	УстановитьОбязательностьДатыНомераДокументаПоставщика();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтражатьВПрослеживаемости(Форма)
	
	Объект = Форма.Объект;
	
	Если Форма.ВедетсяУчетПрослеживаемыхТоваров Тогда
		ЭтоОприходованиеМЗвПути = Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.Поступление")
			И ЗначениеЗаполнено(Объект.ДокументОснование)
			И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеМЗВПути");
		Если (Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика") ИЛИ ЭтоОприходованиеМЗвПути)
			И НЕ Форма.ПоставщикРезидентТаможенногоСоюза Тогда
			Объект.ОтражатьВПрослеживаемости = Истина;
		КонецЕсли;
	Иначе
		Объект.ОтражатьВПрослеживаемости = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьКодОперацииПрослеживаемости(Форма)

	Если НЕ Форма.ВедетсяУчетПрослеживаемыхТоваров Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Форма.Объект;
	Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика")  Тогда
		Объект.КодОперацииПрослеживаемости = ПредопределенноеЗначение("Справочник.КодыОперацийПрослеживаемости.ПриобретениеПлательщикомНДС");
	ИначеЕсли Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя") Тогда
		Объект.КодОперацииПрослеживаемости = ПредопределенноеЗначение("Справочник.КодыОперацийПрослеживаемости.ВозвратОтРозничногоПокупателя");	
	Иначе
		Объект.КодОперацииПрослеживаемости = ПредопределенноеЗначение("Справочник.КодыОперацийПрослеживаемости.ПолучениеНеСвязанноеСРеализацией");	
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДопустимыеКодыОперацийПрослеживаемости(Форма)

	Если НЕ Форма.ВедетсяУчетПрослеживаемыхТоваров Тогда
		Возврат;
	КонецЕсли;

	Объект = Форма.Объект;
	ДанныеВыбора = Новый Массив;
	Если Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика") Тогда
		ДанныеВыбора = ПрослеживаемостьБГУКлиентСервер.КодыОперацийПрослеживаемостиПоступлениеОтПоставщика();
	ИначеЕсли Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.Поступление") Тогда
		ДанныеВыбора = ПрослеживаемостьБГУКлиентСервер.КодыОперацийПрослеживаемостиПрочееПоступление();
	ИначеЕсли Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя") Тогда
		ДанныеВыбора = ПрослеживаемостьБГУКлиентСервер.КодыОперацийПрослеживаемостиВозвратОтПокупателя();
	ИначеЕсли Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования")
		ИЛИ Объект.ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета") Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Справочник.КодыОперацийПрослеживаемости.ПолучениеНеСвязанноеСРеализацией"));
	КонецЕсли;
	
	Форма.Элементы.КодОперацииПрослеживаемости.СписокВыбора.ЗагрузитьЗначения(ДанныеВыбора);

КонецПроцедуры
 
&НаКлиенте
Процедура ОбновитьДанныеКорректировки()

	ОбновитьДанныеКорректировкиСервер();

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеКорректировкиСервер()

	УправлениеМатериальнымиЗапасами.УстановитьКорректирующийДокумент(ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьСвойстваЭлементовГруппыКорректировка(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиРНПТ(Знач ИдентификаторСтроки)
	СтрокиСРНПТ = Объект.СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	
	Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
		Объект.СведенияПрослеживаемости.Удалить(СтрокаСРНПТ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВопросПересчитатьДатуОплатитьДо(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДатаДокумента = ?(ЗначениеЗаполнено(Объект.ДатаПодписанияПервичногоДокумента), Объект.ДатаПодписанияПервичногоДокумента, Объект.Дата);
		Объект.ОплатитьДо = ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Объект.Договор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Договор)
	
	Возврат КонтрольИсполненияДоговоров.ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Договор);
	
КонецФункции

&НаСервере
Функция ВидимостьЭлементовЭДОАкта448()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений = "")
	ЭлектронныеДокументыБГУ.ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, ТекстСведений);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ДанныеДляАкта)
	КоличествоФайлов = ДанныеДляАкта.КоличествоФайлов;
	
	ТекстСведений = ЭлектронныеДокументыБГУКлиент.ТекстПриложеноФайлов(КоличествоФайлов);

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи()

	УправлениеНФА.ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи(Объект, ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕдинственныйСотрудникПоКонтрагенту(Знач Контрагент, Знач Организация)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Владелец = &Организация
	|	И Сотрудники.Контрагент = &Контрагент
	|	И НЕ Сотрудники.ПометкаУдаления";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Сотрудники.ПустаяСсылка();

КонецФункции

&НаСервереБезКонтекста
Функция ТекущееПодразделениеПолучателяИмущества(Знач Дата, Знач ПолучательИмущества)
	
	Возврат Справочники.Сотрудники.ПолучитьСвойствоСотрудника(
	ПолучательИмущества,
	"Подразделение",
	Дата);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВидПоступленияТолькоСчет0233(ВидПоступления)
	
	ВидыПоступлений = Новый Массив;
	ВидыПоступлений.Добавить(ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеКомиссионныхТоваров"));	
	Возврат ВидыПоступлений.Найти(ВидПоступления) <> Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПризнакКомиссионногоТовараНоменклатуры(ЭтотОбъект, ТекущиеДанные)
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.СчетУчета = ЭтотОбъект.КэшПараметров.Локальные.Счет0233
		ИЛИ ТекущиеДанные.СчетУчета = ЭтотОбъект.КэшПараметров.Локальные.Счет0234 Тогда
		ТекущиеДанные.КомиссионнаяТорговля = Истина;
	Иначе
		ТекущиеДанные.КомиссионнаяТорговля = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовКомиссионнаяТорговля(Форма)
	
	ВидПоступленияМЗ = Форма.Объект.ВидПоступленияМЗ;
	
	Если ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеКомиссионныхТоваров") Тогда
		
		ВидимостьМатериалыДополнительнаяАналитикаСчета = Ложь;
		ВидимостьМатериалыКомиссионнаяТорговля = Истина;
		ВидимостьМатериалыГруппаКомитент = Ложь;
		
	ИначеЕсли ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя") Тогда
		
		ВидимостьМатериалыДополнительнаяАналитикаСчета = Истина;
		ВидимостьМатериалыКомиссионнаяТорговля = Истина;
		ВидимостьМатериалыГруппаКомитент = Ложь;
		
	ИначеЕсли ВидПоступленияМЗ = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика") Тогда
		
		ВидимостьМатериалыКомиссионнаяТорговля = Истина;
		ВидимостьМатериалыГруппаКомитент = Истина;
		ВидимостьМатериалыДополнительнаяАналитикаСчета = Истина;
		
	Иначе
		
		ВидимостьМатериалыДополнительнаяАналитикаСчета = Истина;
		ВидимостьМатериалыКомиссионнаяТорговля = Ложь;
		ВидимостьМатериалыГруппаКомитент = Ложь;
		
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МатериалыДополнительнаяАналитикаСчета",
			"Видимость", ВидимостьМатериалыДополнительнаяАналитикаСчета);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МатериалыКомиссионнаяТорговля",
			"Видимость", ВидимостьМатериалыКомиссионнаяТорговля);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МатериалыГруппаКомитент",
			"Видимость", ВидимостьМатериалыГруппаКомитент);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыКонтроляЦен(ДатаКонтроля, ДопПараметры) Экспорт
	
	ДатаКонтроляЦен = ДатаКонтроля;
	
	Если ДатаКонтроляЦен = Неопределено Тогда
		ДатаКонтроляЦен = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДопПараметры, "ДатаКонтроля");
	КонецЕсли;
	
	Если ДатаКонтроляЦен <> Неопределено Тогда
		ВыполнитьКонтрольЦен(ДатаКонтроляЦен);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыполнитьКонтрольЦен(ДатаКонтроля)
	
	РаботаСОбязательствами.ВыполнитьКонтрольЦен(ДатаКонтроля, Объект, МассивСтрокКонтроляЦен, "Материалы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте()
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере()
	ЭлектронныеДокументыБГУ.ЗаполнитьСостояниеЭДОАктаПоФорме0510448(Объект.Ссылка, Элементы.ДекорацияСостояниеЭДОАкты);
	Если Элементы.ДекорацияСостояниеЭДОАкты.Заголовок = "Не начат" Тогда
		ВидимостьЭДОАктами = Ложь;
	Иначе		
		ВидимостьЭДОАктами = Истина;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСостояниеЭДОБГУ", "Видимость", ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияЭДОУПД", "Видимость", НЕ ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", НЕ ВидимостьЭДОАктами);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ПоставкаОтКонтрагента(Форма)

	Видимость = Не ЭтоАктОПриемеПередаче0510448(Форма)
		И Не ЭтоВозвратИзЛичногоПользования(Форма.Объект.ВидПоступленияМЗ);

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Грузоотправитель");
	ИменаЭлементов.Добавить("Грузополучатель");
	ИменаЭлементов.Добавить("ЗаказчикПоКонтракту");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов, "Видимость", Видимость);

КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область Инициализация

ВидПоступленияДоИзменения = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗ.ПустаяСсылка");

#КонецОбласти
