
#Область СлужебныйПрограммныйИнтерфейс

// см. ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации
Функция ОтветственноеЛицоОрганизации(Знач Организация, Знач ВидОтветственногоЛица, Знач НаДату = Неопределено) Экспорт
	Возврат ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоОрганизации(Организация, ВидОтветственногоЛица, НаДату);
КонецФункции

// см. ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизацииСоответствием
Функция ОтветственныеЛицаОрганизацииСоответствием(Знач Организация, Знач НаДату, Знач Подразделение = Неопределено) Экспорт
	Возврат ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизацииСоответствием(Организация, НаДату, Подразделение);
КонецФункции

// см. ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоПустаяСтруктура
Функция ОтветственноеЛицоПустаяСтруктура() Экспорт
	Возврат ОрганизационнаяСтруктураПовтИсп.ОтветственноеЛицоПустаяСтруктура();
КонецФункции

#КонецОбласти
