
#Область ОписаниеПеременных

// Признак закрытия без переноса в документ
&НаКлиенте
Перем ВыполняетсяЗакрытие; // Булево

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресСтрокиУпаковки = Параметры.АдресСтрокиУпаковки; // Строка
	
	Если Не ЭтоАдресВременногоХранилища(АдресСтрокиУпаковки) Тогда
		ВызватьИсключение "Не правильно заданы параметры формы";
	КонецЕсли;
	
	ТекущаяСтрокаУпаковки = ПолучитьИзВременногоХранилища(АдресСтрокиУпаковки);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ТекущаяСтрокаУпаковки, , "СоставАкта");
	
	Для Каждого СтрокаНоменклатуры Из ТекущаяСтрокаУпаковки.СоставАкта Цикл
		СтрокаСостава = СоставАкта.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаНоменклатуры);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ВыполняетсяЗакрытие = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПеренестиВДокумент И Модифицированность Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Данные были изменены.
								|Перенести изменения в документ?'");
		ДействиеПослеОтвета = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ДействиеПослеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ПеренестиИзмененияВДокумент();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Нет Тогда
		ВыполняетсяЗакрытие = Истина;
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиИзмененияВДокумент()

	Если ПеренестиВДокумент Тогда
		ПоместитьИзмененияВХранилище();
		Структура = Новый Структура("АдресСоставаУпаковки", АдресСтрокиУпаковки);
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(Структура);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоместитьИзмененияВХранилище()

	Результат = Новый Структура;
	
	ВыбранныйСоставУпаковки = Новый Соответствие;
	
	Для Каждого СтрокаАкта Из СоставАкта Цикл
		Если СтрокаАкта.ВходитВУпаковку Тогда
			ВыбранныйСоставУпаковки.Вставить(СтрокаАкта.ИдентификаторСтроки, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Вставить("СоставУпаковки", ВыбранныйСоставУпаковки);
	Результат.Вставить("ИдентификаторСтрокиУпаковки", ИдентификаторСтрокиУпаковки);
	
	ПоместитьВоВременноеХранилище(Результат, АдресСтрокиУпаковки);

КонецПроцедуры

#КонецОбласти
