#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПоДаннымУчета(ДокументОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУОстатки.Счет КАК Счет,
	|	ЕПСБУОстатки.КФО КАК КФО,
	|	ЕПСБУОстатки.КПС КАК КПС,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.Договоры) КАК Договор,
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Валюта ЕСТЬ NULL
	|				ИЛИ ЕПСБУОстатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &РегламентнаяВалюта
	|		ИНАЧЕ ЕПСБУОстатки.Валюта
	|	КОНЕЦ КАК Валюта,
	|	СУММА(ВЫБОР
	|			КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг)
	|				ТОГДА ЕПСБУОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОД,
	|	СУММА(ВЫБОР
	|			КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.Проценты)
	|				ТОГДА ЕПСБУОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПроцентов,
	|	СУММА(ВЫБОР
	|			КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.Штрафы)
	|				ТОГДА ЕПСБУОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаШтрафов,
	|	СУММА(ВЫБОР
	|			КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ПениНаОсновнойДолг)
	|					ИЛИ ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ПениНаПроценты)
	|				ТОГДА ЕПСБУОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПеней,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг)
	|					ТОГДА ЕПСБУОстатки.ВалютнаяСуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ, 0)) КАК СуммаОДВалютная,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.Проценты)
	|					ТОГДА ЕПСБУОстатки.ВалютнаяСуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ, 0)) КАК СуммаПроцентовВалютная,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.Штрафы)
	|					ТОГДА ЕПСБУОстатки.ВалютнаяСуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ, 0)) КАК СуммаШтрафовВалютная,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|				КОГДА ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ПениНаОсновнойДолг)
	|						ИЛИ ЕПСБУОстатки.Субконто3 = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ПениНаПроценты)
	|					ТОГДА ЕПСБУОстатки.ВалютнаяСуммаОстаток
	|				ИНАЧЕ 0
	|			КОНЕЦ, 0)) КАК СуммаПенейВалютная
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаЗапроса,
	|			Счет В ИЕРАРХИИ (&СчетаРасчетов),
	|			,
	|			ВЫБОР
	|					КОГДА &ИспользоватьУчетПоИФО = ИСТИНА
	|							И &БезУчетаИФО = ЛОЖЬ
	|						ТОГДА ИФО = &ИФО
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ КФО = &КФО
	|				КОНЕЦ
	|				И Организация = &Организация) КАК ЕПСБУОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕПСБУОстатки.Счет,
	|	ЕПСБУОстатки.КФО,
	|	ЕПСБУОстатки.КПС,
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.Контрагенты),
	|	ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.Договоры),
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Валюта ЕСТЬ NULL
	|				ИЛИ ЕПСБУОстатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &РегламентнаяВалюта
	|		ИНАЧЕ ЕПСБУОстатки.Валюта
	|	КОНЕЦ";
	
	ДатаОпределенияОстатков	= ИнвентаризацияКлиентСервер.ПолучитьДатуОпределенияОстатков52н(ДокументОбъект.ДатаИнвентаризации);
	
	Запрос.УстановитьПараметр("ДатаЗапроса",			ДатаОпределенияОстатков);
	Запрос.УстановитьПараметр("Организация",			ДокументОбъект["Организация"]);
	Запрос.УстановитьПараметр("КФО",					ДокументОбъект["КФО"]);
	Запрос.УстановитьПараметр("ИФО",					ДокументОбъект["ИФО"]);
	Запрос.УстановитьПараметр("БезУчетаИФО",			ДокументОбъект["БезУчетаИФО"]);
	Запрос.УстановитьПараметр("ИспользоватьУчетПоИФО",	ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Запрос.УстановитьПараметр("РегламентнаяВалюта",		ОбщегоНазначенияБГУПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	Запрос.УстановитьПараметр("СчетаРасчетов",			БухгалтерскийУчет.СписокСчетов("207.00"));
	
	ДокументОбъект["Задолженность"].Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Флажок <без ограничения>
Функция ФлажокБезОграничения_ПолучитьНастройкиМеханизма() Экспорт
	
	НастройкиМеханизма = Новый Структура();
	НастройкиМеханизма.Вставить("ИмяРеквизитаСсылка",	"ИФО");
	НастройкиМеханизма.Вставить("ИмяРеквизитаФлажок",	"БезУчетаИФО");
	
	Возврат НастройкиМеханизма;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Форма 0504089
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0504083_103н";
	КомандаПечати.Представление = НСтр("ru='Инвентаризационная опись (ф. 0504083) (в ред.103н)'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0504083";
	КомандаПечати.Представление = НСтр("ru='Инвентаризационная опись (ф. 0504083)'");
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0504083_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0504083_103н",
			"Инвентаризационная опись задолженности по кредитам, займам (ссудам) (ф. 0504083)",
			ПечатьФормы0504083(МассивОбъектов, ОбъектыПечати, "103н"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0504083") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0504083",
			"Инвентаризационная опись задолженности по кредитам, займам (ссудам) (ф. 0504083)",
			ПечатьФормы0504083(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
		//чтобы при программном открытии формы выбора установился режим выбора
		Параметры.Вставить("РежимВыбора", Истина);
		ВыбраннаяФорма = Метаданные.Документы.ИнвентаризацияКредитовИЗаймов.Формы.ФормаСписка;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьФормы0504083(МассивСсылок, ОбъектыПечати, РедакцияПечатнойФормы = Неопределено)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияКредитовИЗаймов.ПФ_MXL_Ф0504083_103н");
	
	Если РедакцияПечатнойФормы = "103н" Тогда
		КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияКредитовИЗаймов_ф0504083_103н";
	Иначе
		КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияКредитовИЗаймов_ф0504083";
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб				= Истина;
	ТабДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= КлючПараметровПечати;
	
	ОбластьЗаголовок         = Макет.ПолучитьОбласть("Заголовок");
	ОбластьКомиссия          = Макет.ПолучитьОбласть("Комиссия");
	ОбластьДатаПодписиКомиссии= Макет.ПолучитьОбласть("ДатаПодписиКомиссии");
	ОбластьПодзаголовокШапки = Макет.ПолучитьОбласть("ПодзаголовокШапки");
	ОбластьШапка1            = Макет.ПолучитьОбласть("Шапка1");
	ОбластьСтрока1           = Макет.ПолучитьОбласть("Строка1");
	ОбластьИтог1             = Макет.ПолучитьОбласть("Итог1");
	ОбластьШапка2            = Макет.ПолучитьОбласть("Шапка2");
	ОбластьСтрока2           = Макет.ПолучитьОбласть("Строка2");
	ОбластьИтог2             = Макет.ПолучитьОбласть("Итог2");
	ОбластьШапка3            = Макет.ПолучитьОбласть("Шапка3");
	ОбластьСтрока3           = Макет.ПолучитьОбласть("Строка3");
	ОбластьИтог3             = Макет.ПолучитьОбласть("Итог3");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияКредитовИЗаймов.Ссылка КАК Ссылка,
	|	ИнвентаризацияКредитовИЗаймов.Номер КАК Номер,
	|	ИнвентаризацияКредитовИЗаймов.ДатаИнвентаризации КАК ДатаОтчета,
	|	ИнвентаризацияКредитовИЗаймов.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	ИнвентаризацияКредитовИЗаймов.Организация.КодОКПО КАК КодОКПО,
	|	ИнвентаризацияКредитовИЗаймов.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	ИнвентаризацияКредитовИЗаймов.НомерПриказаИнвентаризации КАК НомерПриказаИнвентаризации,
	|	ИнвентаризацияКредитовИЗаймов.ДатаПриказаИнвентаризации КАК ДатаПриказаИнвентаризации,
	|	ИнвентаризацияКредитовИЗаймов.ДатаНачала,
	|	ИнвентаризацияКредитовИЗаймов.ДатаОкончания,
	|	ИнвентаризацияКредитовИЗаймов.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	ИнвентаризацияКредитовИЗаймов.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	ИнвентаризацияКредитовИЗаймов.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	ИнвентаризацияКредитовИЗаймов.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	ИнвентаризацияКредитовИЗаймов.МестоИнвентаризации,
	|	ИнвентаризацияКредитовИЗаймов.ЗаключениеКомиссии,
	|	ИнвентаризацияКредитовИЗаймов.ДатаПодписиКомиссии,
	|	ИнвентаризацияКредитовИЗаймов.НаименованиеЗадолженности
	|ИЗ
	|	Документ.ИнвентаризацияКредитовИЗаймов КАК ИнвентаризацияКредитовИЗаймов
	|ГДЕ
	|	ИнвентаризацияКредитовИЗаймов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер,
	|	ДатаОтчета,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Ссылка КАК Ссылка,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.НомерСтроки КАК КодСтроки,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияКредитовИЗаймовИнвентаризация.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА НЕ ИнвентаризацияКредитовИЗаймовИнвентаризация.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ИнвентаризацияКредитовИЗаймовИнвентаризация.Контрагент.НаименованиеСокращенное
	|		КОГДА ИнвентаризацияКредитовИЗаймовИнвентаризация.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И НЕ ИнвентаризацияКредитовИЗаймовИнвентаризация.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|			ТОГДА ВЫРАЗИТЬ(ИнвентаризацияКредитовИЗаймовИнвентаризация.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|		ИНАЧЕ ИнвентаризацияКредитовИЗаймовИнвентаризация.Контрагент.Наименование
	|	КОНЕЦ КАК НаименованиеЗаемщика,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Договор.ДатаДоговора КАК ДатаДоговора,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Договор.НомерДоговора КАК НомерДоговора,
	|	Представление(ИнвентаризацияКредитовИЗаймовИнвентаризация.КФО) КАК КФО,
	|	Представление(ИнвентаризацияКредитовИЗаймовИнвентаризация.Счет) КАК Счет,
	|	Представление(ИнвентаризацияКредитовИЗаймовИнвентаризация.КПС) КАК КПС,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДВалютная КАК СуммаОДВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОД КАК СуммаОД,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовВалютная КАК СуммаПроцентовВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентов КАК СуммаПроцентов,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовВалютная КАК СуммаШтрафовВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафов КАК СуммаШтрафов,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейВалютная КАК СуммаПенейВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПеней КАК СуммаПеней,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОД + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентов + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафов + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПеней КАК СуммаИтого
	|ИЗ
	|	Документ.ИнвентаризацияКредитовИЗаймов.Задолженность КАК ИнвентаризацияКредитовИЗаймовИнвентаризация
	|ГДЕ
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСтроки
	|ИТОГИ
	|	СУММА(СуммаОДВалютная),
	|	СУММА(СуммаОД),
	|	СУММА(СуммаПроцентовВалютная),
	|	СУММА(СуммаПроцентов),
	|	СУММА(СуммаШтрафовВалютная),
	|	СУММА(СуммаШтрафов),
	|	СУММА(СуммаПенейВалютная),
	|	СУММА(СуммаПеней),
	|	СУММА(СуммаИтого)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Ссылка КАК Ссылка,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.НомерСтроки КАК КодСтроки,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДПодтвержденнаяВалютная КАК СуммаОДПодтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДПодтвержденная КАК СуммаОДПодтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовПодтвержденнаяВалютная КАК СуммаПроцентовПодтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовПодтвержденная КАК СуммаПроцентовПодтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовПодтвержденнаяВалютная КАК СуммаШтрафовПодтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовПодтвержденная КАК СуммаШтрафовПодтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейПодтвержденнаяВалютная КАК СуммаПенейПодтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейПодтвержденная КАК СуммаПенейПодтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДПодтвержденная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовПодтвержденная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовПодтвержденная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейПодтвержденная КАК СуммаИтогоПодтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДНеподтвержденнаяВалютная КАК СуммаОДНеподтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДНеподтвержденная КАК СуммаОДНеподтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовНеподтвержденнаяВалютная КАК СуммаПроцентовНеподтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовНеподтвержденная КАК СуммаПроцентовНеподтвержденная
	|ИЗ
	|	Документ.ИнвентаризацияКредитовИЗаймов.Задолженность КАК ИнвентаризацияКредитовИЗаймовИнвентаризация
	|ГДЕ
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСтроки
	|ИТОГИ
	|	СУММА(СуммаОДПодтвержденнаяВалютная),
	|	СУММА(СуммаОДПодтвержденная),
	|	СУММА(СуммаПроцентовПодтвержденнаяВалютная),
	|	СУММА(СуммаПроцентовПодтвержденная),
	|	СУММА(СуммаШтрафовПодтвержденнаяВалютная),
	|	СУММА(СуммаШтрафовПодтвержденная),
	|	СУММА(СуммаПенейПодтвержденнаяВалютная),
	|	СУММА(СуммаПенейПодтвержденная),
	|	СУММА(СуммаИтогоПодтвержденная),
	|	СУММА(СуммаОДНеподтвержденнаяВалютная),
	|	СУММА(СуммаОДНеподтвержденная),
	|	СУММА(СуммаПроцентовНеподтвержденнаяВалютная),
	|	СУММА(СуммаПроцентовНеподтвержденная)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Ссылка КАК Ссылка,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.НомерСтроки КАК КодСтроки,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовНеподтвержденнаяВалютная КАК СуммаШтрафовНеподтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовНеподтвержденная КАК СуммаШтрафовНеподтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейНеподтвержденнаяВалютная КАК СуммаПенейНеподтвержденнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейНеподтвержденная КАК СуммаПенейНеподтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДНеподтвержденная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовНеподтвержденная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовНеподтвержденная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейНеподтвержденная КАК СуммаИтогоНеподтвержденная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДПросроченнаяВалютная КАК СуммаОДПросроченнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДПросроченная КАК СуммаОДПросроченная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовПросроченнаяВалютная КАК СуммаПроцентовПросроченнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовПросроченная КАК СуммаПроцентовПросроченная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовПросроченнаяВалютная КАК СуммаШтрафовПросроченнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовПросроченная КАК СуммаШтрафовПросроченная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейПросроченнаяВалютная КАК СуммаПенейПросроченнаяВалютная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейПросроченная КАК СуммаПенейПросроченная,
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаОДПросроченная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПроцентовПросроченная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаШтрафовПросроченная + ИнвентаризацияКредитовИЗаймовИнвентаризация.СуммаПенейПросроченная КАК СуммаИтогоПросроченная
	|ИЗ
	|	Документ.ИнвентаризацияКредитовИЗаймов.Задолженность КАК ИнвентаризацияКредитовИЗаймовИнвентаризация
	|ГДЕ
	|	ИнвентаризацияКредитовИЗаймовИнвентаризация.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСтроки
	|ИТОГИ
	|	СУММА(СуммаШтрафовНеподтвержденнаяВалютная),
	|	СУММА(СуммаШтрафовНеподтвержденная),
	|	СУММА(СуммаПенейНеподтвержденнаяВалютная),
	|	СУММА(СуммаПенейНеподтвержденная),
	|	СУММА(СуммаИтогоНеподтвержденная),
	|	СУММА(СуммаОДПросроченнаяВалютная),
	|	СУММА(СуммаОДПросроченная),
	|	СУММА(СуммаПроцентовПросроченнаяВалютная),
	|	СУММА(СуммаПроцентовПросроченная),
	|	СУММА(СуммаШтрафовПросроченнаяВалютная),
	|	СУММА(СуммаШтрафовПросроченная),
	|	СУММА(СуммаПенейПросроченнаяВалютная),
	|	СУММА(СуммаПенейПросроченная),
	|	СУММА(СуммаИтогоПросроченная)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнвентаризацияОССоставКомиссии.Ссылка КАК Ссылка,
	|	ИнвентаризацияОССоставКомиссии.НомерСтроки,
	|	ИнвентаризацияОССоставКомиссии.ДолжностьЧленаКомиссии,
	|	ИнвентаризацияОССоставКомиссии.ФамилияЧленаКомиссии,
	|	ИнвентаризацияОССоставКомиссии.ИмяЧленаКомиссии,
	|	ИнвентаризацияОССоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ИнвентаризацияКредитовИЗаймов.СоставКомиссии КАК ИнвентаризацияОССоставКомиссии
	|ГДЕ
	|	ИнвентаризацияОССоставКомиссии.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивСсылок);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	ВыборкаШапка 	= МассивРезультатов[0].Выбрать();
	ВыборкаТЧ1 		= МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЧ2 		= МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТЧ3 		= МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия = МассивРезультатов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Выборки по документам:
	ПервыйДокумент = Истина;
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.Заполнить(ВыборкаШапка);
		ТабДокумент.Вывести(ОбластьЗаголовок);
		
		ОбластьЗаключениеКомиссии = СформироватьЗаключениеКомиссии(ВыборкаШапка.ЗаключениеКомиссии, Макет);
		ТабДокумент.Вывести(ОбластьЗаключениеКомиссии);
		
		// Продвигаемся в остальных выборках до текущего документа:
		ПоискТекущегоДокумента = Новый Структура("Ссылка", ВыборкаШапка["Ссылка"]);
		
		ВыборкаКомиссия.Сбросить();
		ВыборкаТЧ1.Сбросить();
		ВыборкаТЧ2.Сбросить();
		ВыборкаТЧ3.Сбросить();
		
		ВыборкаКомиссия.НайтиСледующий(ПоискТекущегоДокумента);
		ВыборкаТЧ1.НайтиСледующий(ПоискТекущегоДокумента);
		ВыборкаТЧ2.НайтиСледующий(ПоискТекущегоДокумента);
		ВыборкаТЧ3.НайтиСледующий(ПоискТекущегоДокумента);
		
		ОбластьВсяКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(
			ВыборкаШапка, ВыборкаКомиссия.Выбрать(), ОбластьКомиссия, 3);
		
		ТабДокумент.Вывести(ОбластьВсяКомиссия);
		
		КомпонентыДатыДляПодписи = ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(ВыборкаШапка["ДатаПодписиКомиссии"]);
		
		ОбластьДатаПодписиКомиссии.Параметры.Заполнить(КомпонентыДатыДляПодписи);
		
		ТабДокумент.Вывести(ОбластьДатаПодписиКомиссии);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьПодзаголовокШапки);
		ТабДокумент.Вывести(ОбластьШапка1);
		
		ВыборкаТЧ1Детальная = ВыборкаТЧ1.Выбрать();
		Пока ВыборкаТЧ1Детальная.Следующий() Цикл
			
			ОбластьСтрока1.Параметры.Заполнить(ВыборкаТЧ1Детальная);
			
			ОбластьСтрока1.Параметры.НомерСчета = ВыборкаТЧ1Детальная.КПС + "." + ВыборкаТЧ1Детальная.КФО + "." + ВыборкаТЧ1Детальная.Счет + ".000";
			
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока1);
			Если ВыборкаТЧ1Детальная.КодСтроки = ВыборкаТЧ1Детальная.Количество() Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтог1);
			КонецЕсли;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьШапка1);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьСтрока1);
			
		КонецЦикла;
		
		ОбластьИтог1.Параметры.Заполнить(ВыборкаТЧ1);
		ТабДокумент.Вывести(ОбластьИтог1);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьШапка2);
		
		ВыборкаТЧ2Детальная = ВыборкаТЧ2.Выбрать();
		Пока ВыборкаТЧ2Детальная.Следующий() Цикл
			
			ОбластьСтрока2.Параметры.Заполнить(ВыборкаТЧ2Детальная);
			
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока2);
			Если ВыборкаТЧ2Детальная.КодСтроки = ВыборкаТЧ2Детальная.Количество() Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтог2);
			КонецЕсли;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьШапка2);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьСтрока2);
			
		КонецЦикла;
		
		ОбластьИтог2.Параметры.Заполнить(ВыборкаТЧ2);
		ТабДокумент.Вывести(ОбластьИтог2);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабДокумент.Вывести(ОбластьШапка3);
		
		ВыборкаТЧ3Детальная = ВыборкаТЧ3.Выбрать();
		Пока ВыборкаТЧ3Детальная.Следующий() Цикл
			
			ОбластьСтрока3.Параметры.Заполнить(ВыборкаТЧ3Детальная);
			
			МассивВыводимыхОбластей = Новый Массив;
			МассивВыводимыхОбластей.Добавить(ОбластьСтрока3);
			Если ВыборкаТЧ3Детальная.КодСтроки = ВыборкаТЧ3Детальная.Количество() Тогда
				МассивВыводимыхОбластей.Добавить(ОбластьИтог3);
			КонецЕсли;
			
			Если НЕ ТабДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьШапка3);
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьСтрока3);
			
		КонецЦикла;
		
		ОбластьИтог3.Параметры.Заполнить(ВыборкаТЧ3);
		ТабДокумент.Вывести(ОбластьИтог3);
		
	КонецЦикла;
	
	// Колонтитулы:
	ТабДокумент.ВерхнийКолонтитул.Выводить			= Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница	= 2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа		= НСтр("ru='Форма 0504083 с.[&НомерСтраницы]'");
	
	Возврат ТабДокумент;
	
КонецФункции

Функция СформироватьЗаключениеКомиссии(Текст, Макет)
	
	БлокиСтрок = Неопределено;
	
	// Блок 1
	ИнвентаризацияСервер.ДобавитьОписаниеБлокаСтрок(БлокиСтрок, 1, 160, "ЗаключениеКомиссииСтрока1");
	
	// Блок 2
	ИнвентаризацияСервер.ДобавитьОписаниеБлокаСтрок(БлокиСтрок, , 190, "ЗаключениеКомиссииСтрока2");
	
	МинимальноеКоличествоСтрок = 3;
	
	Возврат ИнвентаризацияСервер.РазбитьТекстНаБлокиСтрокИВывестиВТабличныйДокумент(Текст, БлокиСтрок, Макет, МинимальноеКоличествоСтрок);
	
КонецФункции

#КонецОбласти

#КонецЕсли
