#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры
//  Ссылка  - ДокументСсылка.РасходныйОрдерФондовый - ссылка на текущий документ
//  ДополнительныеСвойства  - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыМатериалы.Номенклатура КАК Номенклатура,
	|	УстановкаЦенНоменклатурыМатериалы.Цена КАК Цена,
	|	УстановкаЦенНоменклатурыМатериалы.Ссылка.Организация КАК Организация,
	|	УстановкаЦенНоменклатурыМатериалы.Ссылка.ТипЦен КАК ТипЦен,
	|	УстановкаЦенНоменклатурыМатериалы.Ссылка КАК Регистратор,
	|	УстановкаЦенНоменклатурыМатериалы.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Материалы КАК УстановкаЦенНоменклатурыМатериалы
	|ГДЕ
	|	УстановкаЦенНоменклатурыМатериалы.Ссылка = &Ссылка
	|	И (НЕ УстановкаЦенНоменклатурыМатериалы.Ссылка.НеПроводитьНулевыеЗначения
	|			ИЛИ УстановкаЦенНоменклатурыМатериалы.Цена <> 0)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ЦеныНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ЦеныНоменклатуры",  ЦеныНоменклатуры);
	
КонецПроцедуры	

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
