#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = "ИзДвиженийДокумента" Тогда

		СтандартнаяОбработка = Ложь;
		ЗаполнитьИзДвижений();
		ДанныеЗаполнения = Новый Структура("ВводНаОсновании");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИзДвижений()
	
	Материалы.Очистить();
	
	Если Движения.ЦеныНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПервоеДвижение	= Движения.ЦеныНоменклатуры[0];
	Организация		= ПервоеДвижение.Организация;
	ТипЦен			= ПервоеДвижение.ТипЦен;
	
	Для Каждого Движение Из Движения.ЦеныНоменклатуры Цикл
		
		НоваяСтрока = Материалы.Добавить();
		
		НоваяСтрока.Номенклатура	= Движение.Номенклатура;
		НоваяСтрока.Цена			= Движение.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли