#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоОснованию(ДокументОснование,ЭтотОбъект,ПерезаполнитьРасшифровкуПлатежа = Истина) Экспорт
	
	ЭтотОбъект.ДокументПеречисленияДенежныхСредств = ДокументОснование;
	
	ЗаполняемыеДанные = "Организация, Подразделение, ИФО, Контрагент, СуммаДокумента";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования,,"СуммаДокумента");
	
	ЭтотОбъект.СуммаРублейДляПокупкиВалюты = ДанныеДокументаОснования.СуммаДокумента;
	
	// определим счет списания рублей из реквизита операции
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗначенияДополнительныхРеквизитовОпераций.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	|ГДЕ
	|	(ВЫРАЗИТЬ(ЗначенияДополнительныхРеквизитовОпераций.Объект КАК Документ.ЗаявкаНаКассовыйРасход).Ссылка = &Ссылка
	|			ИЛИ ВЫРАЗИТЬ(ЗначенияДополнительныхРеквизитовОпераций.Объект КАК Документ.ПлатежноеПоручение).Ссылка = &Ссылка
	|			ИЛИ ВЫРАЗИТЬ(ЗначенияДополнительныхРеквизитовОпераций.Объект КАК Документ.КассовоеВыбытие).Ссылка = &Ссылка)
	|	И ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации.ИмяДляФормулы = &ИмяДляФормулы";
	Запрос.УстановитьПараметр("Ссылка",ДокументОснование);
	Запрос.УстановитьПараметр("ИмяДляФормулы","БанковскийСчет");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭтотОбъект.СчетСписанияРублей = Выборка.Значение;
	КонецЕсли;
	
	Если НЕ ПерезаполнитьРасшифровкуПлатежа Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.РасшифровкаПлатежа.Очистить();
	
	ТипДокумента = ТипЗнч(ДокументОснование);
	
	СписокСвойств = "КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,КодЦели,КодМероприятия,ДопКлассификация,ИсточникСредств";
	
	Если ДокументОснование.Метаданные().ТабличныеЧасти.Найти("РасшифровкаПлатежа") <> Неопределено Тогда
		Для Каждого СтрокаИсточник Из ДокументОснование["РасшифровкаПлатежа"] Цикл
			
			НоваяСтрока = ЭтотОбъект.РасшифровкаПлатежа.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаИсточник,СписокСвойств);
			
			Если ТипДокумента = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") Тогда
				НоваяСтрока.Примечание = СтрокаИсточник.СтрокаНазначениеПлатежа;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
				НоваяСтрока.Примечание = ДокументОснование.НазначениеПлатежа;
			ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КассовоеВыбытие") Тогда
				НоваяСтрока.Примечание = СтрокаИсточник.Примечание;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
