#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура ЗаполнениеИдентификатора() Экспорт
	
	Если Метаданные.Справочники.ФорматыОбменаБанкиКС.Реквизиты.Найти("УдалитьОбъектТип") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Справочник ФорматыОбменаБанкиКС
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФорматыОбменаБанкиКС.Ссылка,
		|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Идентификатор,
		|	ИдентификаторыОбъектовМетаданных.Синоним КАК Наименование
		|ИЗ
		|	Справочник.ФорматыОбменаБанкиКС КАК ФорматыОбменаБанкиКС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ПО (ФорматыОбменаБанкиКС.УдалитьОбъектТип + ""."" + ФорматыОбменаБанкиКС.УдалитьОбъектИмя = ИдентификаторыОбъектовМетаданных.ПолноеИмя)
		|ГДЕ
		|	ФорматыОбменаБанкиКС.ИдентификаторОбъекта = &Идентификатор
		|	И ФорматыОбменаБанкиКС.УдалитьОбъектТип В(&СписокТипов)";

	Запрос.УстановитьПараметр("Идентификатор", Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
	СписокТипов = Новый Массив;
	СписокТипов.Добавить("Справочник");
	СписокТипов.Добавить("Документ");
	Запрос.УстановитьПараметр("СписокТипов", СписокТипов);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФорматОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ФорматОбъект.ИдентификаторОбъекта = ВыборкаДетальныеЗаписи.Идентификатор;
		Если НЕ ЗначениеЗаполнено(ФорматОбъект.ПредставлениеОбъектаВНастройке) Тогда
			ФорматОбъект.ПредставлениеОбъектаВНастройке = ВыборкаДетальныеЗаписи.Наименование;
		КонецЕсли;
		Попытка
			ФорматОбъект.Записать();
		Исключение
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьНеобходимостьКонвертации() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФорматыОбменаБанкиКС.Ссылка
		|ИЗ
		|	Справочник.ФорматыОбменаБанкиКС КАК ФорматыОбменаБанкиКС
		|ГДЕ
		|	ФорматыОбменаБанкиКС.НеобходимаКонвертация = ЛОЖЬ
		|	И ФорматыОбменаБанкиКС.НаправлениеОбмена = ЗНАЧЕНИЕ(Перечисление.НаправлениеОбменаБанкиКС.Экспорт)";

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФорматОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ФорматОбъект.НеобходимаКонвертация = Истина;
		ФорматОбъект.ДополнительныеСвойства.Вставить("НеФормироватьСКД",Истина);

		ФорматОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Новый механизм формирования СКД

Процедура СформироватьСхемуФормированияОбмена_Новый(ФорматОбъект,Отказ) Экспорт

	СообщатьОбОшибках = Истина;
	
	Если ФорматОбъект.ДополнительныеСвойства.Свойство("НеСообщатьОбОшибках") Тогда
		СообщатьОбОшибках = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФорматыОбменаБанкиКСПравилаОбмена",ФорматОбъект.ПравилаОбмена);

	ТаблицаНастройкаПолейФайла = ФорматОбъект.НастройкаПолейФайла;
	
	Если НЕ ЗначениеЗаполнено(ФорматОбъект.Ссылка) Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОграничениеРазмерности,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОписаниеПоляФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПорядокЗаполнения,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОбязательностьЗаполнения,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ТабличнаяЧасть,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Условие,
				   |	ФорматыОбменаБанкиКСПравилаОбмена.ПроверкаВалидностиДанных,
				   |	ФорматыОбменаБанкиКСПравилаОбмена.СообщениеПриОшибкеВалидности,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ДопДействия,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.СекцияПечати,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПеременнаяПечати,
				   |	ФорматыОбменаБанкиКСПравилаОбмена.Отключить
	               |ПОМЕСТИТЬ ТабФорматов
	               |ИЗ
	               |	&ФорматыОбменаБанкиКСПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабФорматов.ПолеФайлаПередачи,
	               |	ТабФорматов.НомерСтроки,
	               |	ТабФорматов.ТипПоляФайлаПередачи,
	               |	ТабФорматов.ТипПоляФайлаПередачи.ПравилоФорматирования КАК ПравилоФорматирования,
	               |	ТабФорматов.ТипПоляФайлаПередачи.СтрогоРавноМаксимальномуРазмеру КАК СтрогоРавноМаксимальномуРазмеру,
	               |	ТабФорматов.ОграничениеРазмерности,
	               |	ТабФорматов.ОписаниеПоляФайлаПередачи,
	               |	ТабФорматов.ПолеОбъекта,
	               |	ТабФорматов.ПорядокЗаполнения,
	               |	ТабФорматов.ОбязательностьЗаполнения,
	               |	ТабФорматов.ТабличнаяЧасть,
	               |	ТабФорматов.Условие,
				   |	ТабФорматов.ПроверкаВалидностиДанных,
				   |	ТабФорматов.СообщениеПриОшибкеВалидности,
	               |	ТабФорматов.ДопДействия,
	               |	ТабФорматов.СекцияПечати,
	               |	ТабФорматов.ПеременнаяПечати
	               |ИЗ
	               |	ТабФорматов КАК ТабФорматов
				   |ГДЕ
				   |	ТабФорматов.Отключить = Ложь
				   |УПОРЯДОЧИТЬ ПО
				   |    НомерСтроки";
				   
		
		
	Иначе
         Запрос.УстановитьПараметр("ФорматОбмена",ФорматОбъект.Ссылка);
		 Запрос.Текст = "ВЫБРАТЬ
						|	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи,
						|	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ОграничениеРазмерности,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ОписаниеПоляФайлаПередачи,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ПорядокЗаполнения,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ОбязательностьЗаполнения,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ТабличнаяЧасть,
						|	ФорматыОбменаБанкиКСПравилаОбмена.Условие,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ПроверкаВалидностиДанных,
						|	ФорматыОбменаБанкиКСПравилаОбмена.СообщениеПриОшибкеВалидности,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ДопДействия,
						|	ФорматыОбменаБанкиКСПравилаОбмена.СекцияПечати,
						|	ФорматыОбменаБанкиКСПравилаОбмена.ПеременнаяПечати,
						|	ФорматыОбменаБанкиКСПравилаОбмена.Отключить
						|ПОМЕСТИТЬ ТабФорматов
						|ИЗ
						|	&ФорматыОбменаБанкиКСПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена,
						|	ПользовательскиеВыраженияПолейФорматовОбмена.ОбрабатываемоеПоле,
						|	ПользовательскиеВыраженияПолейФорматовОбмена.ПолеФайла,
						|	ПользовательскиеВыраженияПолейФорматовОбмена.НомерСтрокиПравил,
						|	ПользовательскиеВыраженияПолейФорматовОбмена.ПользовательскоеВыражение
						|ПОМЕСТИТЬ ПереопределяемыеПоля
						|ИЗ
						|	РегистрСведений.ПользовательскиеВыраженияПолейФорматовОбмена КАК ПользовательскиеВыраженияПолейФорматовОбмена
						|ГДЕ
						|	ПользовательскиеВыраженияПолейФорматовОбмена.Использовать
						|	И ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена = &ФорматОбмена
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ТабФорматов.ПолеФайлаПередачи,
						|	ТабФорматов.НомерСтроки,
						|	ТабФорматов.ТипПоляФайлаПередачи,
						|	ТабФорматов.ТипПоляФайлаПередачи.ПравилоФорматирования КАК ПравилоФорматирования,
						|	ТабФорматов.ТипПоляФайлаПередачи.СтрогоРавноМаксимальномуРазмеру КАК СтрогоРавноМаксимальномуРазмеру,
						|	ТабФорматов.ОграничениеРазмерности,
						|	ТабФорматов.ОписаниеПоляФайлаПередачи,
						|	ТабФорматов.ОбязательностьЗаполнения,
						|	ТабФорматов.ТабличнаяЧасть,
						|	ВЫБОР
						|		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение
						|		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение
						|		ИНАЧЕ ТабФорматов.ПолеОбъекта
						|	КОНЕЦ КАК ПолеОбъекта,
						|	ВЫБОР
						|		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение
						|		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение
						|		ИНАЧЕ ТабФорматов.ПорядокЗаполнения
						|	КОНЕЦ КАК ПорядокЗаполнения,
						|	ВЫБОР
						|		КОГДА НЕ ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение
						|		КОГДА НЕ ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение
						|		ИНАЧЕ ТабФорматов.Условие
						|	КОНЕЦ КАК Условие,
						|	ВЫБОР
						|		КОГДА НЕ ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ПользовательскоеВыражение
						|		КОГДА НЕ ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ПользовательскоеВыражение
						|		ИНАЧЕ ТабФорматов.ПроверкаВалидностиДанных
						|	КОНЕЦ КАК ПроверкаВалидностиДанных,
						|	ВЫБОР
						|		КОГДА НЕ ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ПользовательскоеВыражение
						|		КОГДА НЕ ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
						|			ТОГДА ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ПользовательскоеВыражение
						|		ИНАЧЕ ТабФорматов.СообщениеПриОшибкеВалидности
						|	КОНЕЦ КАК СообщениеПриОшибкеВалидности
		               	|ИЗ
		               	|	ТабФорматов КАК ТабФорматов
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Номер
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Номер.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_ПолеОбъекта_Номер.ОбрабатываемоеПоле = ""ПолеОбъекта"")
						|			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ПолеОбъекта_Номер.НомерСтрокиПравил
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Ноль
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.ОбрабатываемоеПоле = ""ПолеОбъекта"")
						|			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.НомерСтрокиПравил = 0)
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Номер
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
						|			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ПорядокЗаполнения_Номер.НомерСтрокиПравил
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Ноль
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
						|			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.НомерСтрокиПравил = 0)
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Номер
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Номер.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_Условие_Номер.ОбрабатываемоеПоле = ""Условие"")
						|			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_Условие_Номер.НомерСтрокиПравил
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Ноль
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Ноль.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_Условие_Ноль.ОбрабатываемоеПоле = ""Условие"")
						|			И (ПереопределяемыеПоля_Условие_Ноль.НомерСтрокиПравил = 0)
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.ОбрабатываемоеПоле = ""ПроверкаВалидностиДанных"")
						|			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ПроверкаВалидностиДанных_Номер.НомерСтрокиПравил
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.ОбрабатываемоеПоле = ""ПроверкаВалидностиДанных"")
						|			И (ПереопределяемыеПоля_ПроверкаВалидностиДанных_Ноль.НомерСтрокиПравил = 0)
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.ОбрабатываемоеПоле = ""СообщениеПриОшибкеВалидности"")
						|			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Номер.НомерСтрокиПравил
						|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль
						|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ПолеФайла КАК СТРОКА(1000))))
						|			И (ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.ОбрабатываемоеПоле = ""СообщениеПриОшибкеВалидности"")
						|			И (ПереопределяемыеПоля_СообщениеПриОшибкеВалидности_Ноль.НомерСтрокиПравил = 0)
						//|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Номер
						//|		ПО ((ВЫРАЗИТЬ(ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Номер.ПолеФайла КАК СТРОКА(1000))))
						//|			И (ПереопределяемыеПоля_ДопДействия_Номер.ОбрабатываемоеПоле = ""ДопДействия"")
						//|			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ДопДействия_Номер.НомерСтрокиПравил
						//|		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Ноль
						//|		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Ноль.ПолеФайла КАК СТРОКА(1000))))
						//|			И (ПереопределяемыеПоля_ДопДействия_Ноль.ОбрабатываемоеПоле = ""ДопДействия"")
						//|			И (ПереопределяемыеПоля_ДопДействия_Ноль.НомерСтрокиПравил = 0)
						|ГДЕ
				   		|	ТабФорматов.Отключить = Ложь
						|УПОРЯДОЧИТЬ ПО
				        |   НомерСтроки";

		
		
		
	КонецЕсли;				
		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат; // нет правил обмена
	КонецЕсли;
	

	ТекстЗапросаШапки = "ВЫБРАТЬ  "; // Содержит текст запроса к шапке документа, Набор данных - "ШапкаДокумента"	
	ТекущийОбъект = ФорматОбъект.ИдентификаторОбъекта.Имя;
	ПолноеИмяТекОбъекта = ФорматОбъект.ИдентификаторОбъекта.ПолноеИмя;
	
	МассивТЧ = Новый Массив;
	
	//Параметры
	ДатаВыгрузки    = Дата(1,1,1);
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ЗначениеЗаполнено(ФорматОбъект.Владелец.ТипКассовогоОргана) Тогда
		Массив         	= Новый Массив;
		Массив.Добавить(Тип(ФорматОбъект.Владелец.ТипКассовогоОргана));
		ОписаниеТипов  	= Новый ОписаниеТипов(Массив);	
		КассовыйОрган   = ОписаниеТипов.ПривестиЗначение(Неопределено);
	Иначе
		КассовыйОрган   = Неопределено;
	КонецЕсли;
	
    ОбрабатываемыйФормат   = ФорматОбъект.Ссылка;
	Организация		       = Справочники.Организации.ПустаяСсылка();
	ВидОбмена		       = ФорматОбъект.Владелец;
	Ссылка			       = ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки;
	Задание  		       = Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка();   
	Файл                   = Справочники.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы.ПустаяСсылка();
	
	Если Найти(ФорматОбъект.ИдентификаторОбъекта.ПолноеИмя,"Документ") <>0 Тогда
		ТипОбъекта = "Документ";
		МетаданныеОбъекта = Метаданные.Документы[ТекущийОбъект];
	// Если это не документ, тогда Отказ. 
	Иначе
		Возврат;
	КонецЕсли;
	
	// Таблица параметров формируемой схемы компоновки данных.
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("ИмяПараметра");
	ТаблицаПараметров.Колонки.Добавить("ЗначениеПараметра");
	ТаблицаПараметров.Колонки.Добавить("ДоступенСписокЗначений",Новый ОписаниеТипов("Булево"));
	
	НовПараметр                   = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра      = "ОбрабатываемыйФормат";
	НовПараметр.ЗначениеПараметра = ОбрабатываемыйФормат; 
	
	НовПараметр                   = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра      = "Файл";
	НовПараметр.ЗначениеПараметра = Файл;
	
	//НовПараметр = ТаблицаПараметров.Добавить();
	//НовПараметр.ИмяПараметра = "УникальныйИдентификаторОбъекта";
	
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "валютареглучета";
	НовПараметр.ЗначениеПараметра = ВалютаРеглУчета;
	
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "НастройкаОбмена";
	НовПараметр.ЗначениеПараметра = Справочники.НастройкиОбменаБанкиКС.ПустаяСсылка();
		
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "ссылка";
	НовПараметр.ЗначениеПараметра = Ссылка;
	НовПараметр.ДоступенСписокЗначений = Истина;
	
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "Задание";
	НовПараметр.ЗначениеПараметра = Задание;
	
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "ТаблицаОбъектовОбмена";
	
	//Параметр, в котором следует передавать количество документов, переданное в параметре "Ссылка"
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "НужнаПустаяСсылка";
	НовПараметр.ЗначениеПараметра = Ложь;
	
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "ПарольНастройкиОбмена";
	НовПараметр.ЗначениеПараметра = "";
	
	//Параметр для формирования файла по формату СМЭВ 3.0 (для ГИС ГМП 2.0)
	НовПараметр = ТаблицаПараметров.Добавить();
	НовПараметр.ИмяПараметра = "ИдентификаторСообщения";
	НовПараметр.ЗначениеПараметра = "";
	
	// Таблица полей шапки документа.
	//ТаблицаПолей = Новый ТаблицаЗначений;
	//ТаблицаПолей.Колонки.Добавить("ИмяПоля");
	//ТаблицаПолей.Колонки.Добавить("ТипПоля");
	//ТаблицаПолей.Колонки.Добавить("ИмяНабора");
		
	СхемаКомпоновки = Справочники.ФорматыОбменаБанкиКС.ПолучитьМакет("ОбразецСКДФормат");
    Объединение = СхемаКомпоновки.НаборыДанных.Найти("ДанныеДокумента");
	
	ОбъединениеДляСсылок = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхОбъединениеСхемыКомпоновкиДанных"));
	ОбъединениеДляСсылок.Имя = "ОбъединениеСсылокДокументов"; 
	
	//ШапкаДокумента = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	//ШапкаДокумента.ИсточникДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;
	//ШапкаДокумента.Имя = "Объект";
	
	ШапкаДокумента = ОбъединениеДляСсылок.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	ШапкаДокумента.ИсточникДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;
	ШапкаДокумента.Имя = "Объект";
	
	НаборПустойСсылки = ОбъединениеДляСсылок.Элементы.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборПустойСсылки.ИсточникДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;
	НаборПустойСсылки.Имя = "ОбъектПустой";
	
	//Обработка результата для пустой ссылки
	ТекстПустогоДокумента = "Выбрать
	|	ИСТИНА КАК ПолеСвязи,
	|	Значение(Документ."+МетаданныеОбъекта.Имя+".ПустаяСсылка) Как ССЫЛКАДОКУМЕНТА
	|ГДЕ
	|	&НужнаПустаяСсылка = Истина";
	
	НаборПустойСсылки.Запрос = ТекстПустогоДокумента;
	
	ЭтоПервый = Истина;	
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ВычисляемыеПоля = СхемаКомпоновки.ВычисляемыеПоля;
		
	МассивИспользуемыхРеквизитов = Новый Массив;
	
	// Формирование вычисляемых полей
	ТекстОшибки = Нстр("ru='При формировании схемы формата возникла ошибка.
	|Номер строки: %1.
	|Колонка: %2. 
	|Описание ошибки: %3'");
	
	МассивТЧДокумента = Новый Массив;
	СоответствиеТЧИзПроцедур = Новый Соответствие;
	МассивВложенныхТЧ = Новый Массив;
	РассматриваемаяТЧ = "";
	ИспользуемыеПараметры = Новый Массив;
	Пока Выборка.Следующий() Цикл
		//Приведение текста поля ТабличнаяЧасть к необходимому виду
		ТекстТабличнойЧасти = ВРег(СтрЗаменить(Выборка.ТабличнаяЧасть,".","__"));
		
		ТекстТЧДляОбработки = ВРег(Выборка.ТабличнаяЧасть);
		ПозицияТочки = Найти(ТекстТЧДляОбработки,".");
		Если ПозицияТочки >0 Тогда
			ТекстТЧДляОбработки = Лев(ТекстТЧДляОбработки,ПозицияТочки-1);					
		КонецЕсли;
	
		//Формирование вычисляемого поля
		ТекПоле = ВычисляемыеПоля.Добавить();
		ТекПоле.ПутьКДанным = "СлужебноеПоле_"+Выборка.НомерСтроки;
		ТекПоле.Заголовок = Выборка.ПолеФайлаПередачи+"_"+Выборка.НомерСтроки;
		
		//Приводим к языку СКД выражение в поле ПолеОбъекта
		ИсходныйКод = "";
		ИсходныйКод = СокрЛП(Выборка.ПолеОбъекта);
		РезультатОбработкиПолеОбъекта = "";
		ТекИспользуемыеРеквизиты = Новый Массив;
		ОписаниеОшибки = "";
		Попытка
			БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ИсходныйКод,РезультатОбработкиПолеОбъекта,"",ТекИспользуемыеРеквизиты,ТекстТЧДляОбработки,"Значение",ОписаниеОшибки,Ложь,ИспользуемыеПараметры);
		Исключение
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Значение""",ИнформацияОбОшибке().Описание);
			
			Если СообщатьОбОшибках Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);

			ОчиститьСхемуФорматирования(ФорматОбъект);
			//Отказ = Истина;
			Возврат;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Значение""",ОписаниеОшибки);
			
			Если СообщатьОбОшибках Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);

			ОчиститьСхемуФорматирования(ФорматОбъект);
			//Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		//Переносим все используемые реквизиты в один массив, для последующего их использованя
		Для Каждого ЭлМас Из ТекИспользуемыеРеквизиты Цикл
			Если МассивИспользуемыхРеквизитов.Найти(ЭлМас)=Неопределено Тогда
				МассивИспользуемыхРеквизитов.Добавить(ЭлМас);
			КонецЕсли;
		КонецЦикла;
		
		//Приводим к языку СКД выражение в поле ПорядокЗаполнения
		ТекИспользуемыеРеквизиты = Новый Массив;		
		ТекстПорядкаЗаполнения = Выборка.ПорядокЗаполнения;
		Если ЗначениеЗаполнено(ТекстПорядкаЗаполнения) Тогда
			РезультатОбработкиПорядкаЗаполнения = "";
			Попытка
				БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ТекстПорядкаЗаполнения,РезультатОбработкиПорядкаЗаполнения,"Порядок заполнения",ТекИспользуемыеРеквизиты,ТекстТЧДляОбработки,"",ОписаниеОшибки,Ложь,ИспользуемыеПараметры);
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Порядок заполнения""",ИнформацияОбОшибке().Описание);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
				
				
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецПопытки;
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Порядок заполнения""",ОписаниеОшибки);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
				
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецЕсли;
			//Объединяем результат полученный от поля ПолеОбъекта и ПорядокЗаполнения
			ВесьРезультат = СтрЗаменить(РезультатОбработкиПорядкаЗаполнения,"<ЗНАЧЕНИЕ>",РезультатОбработкиПолеОбъекта);
			//ТекПоле.Выражение = ВесьРезультат;	
			
			//Переносим все используемые реквизиты в один массив, для последующего их использованя
			Для Каждого ЭлМас Из ТекИспользуемыеРеквизиты Цикл
				Если МассивИспользуемыхРеквизитов.Найти(ЭлМас)=Неопределено Тогда
					МассивИспользуемыхРеквизитов.Добавить(ЭлМас);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			ВесьРезультат = РезультатОбработкиПолеОбъекта;
		КонецЕсли;
		
		//Приводим к языку СКД выражение приведения к формату (поле ПравилоФорматирования)
		ТекИспользуемыеРеквизиты = Новый Массив;		
		ТекстПравилаФорматирования = Выборка.ПравилоФорматирования;		
		Если ЗначениеЗаполнено(ТекстПравилаФорматирования) Тогда
			РезультатОбработкиПравилаФорматирования = "";
			Попытка
				БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ТекстПравилаФорматирования,РезультатОбработкиПравилаФорматирования,"Тип поля файла",ТекИспользуемыеРеквизиты,ТекстТЧДляОбработки,"",ОписаниеОшибки,Ложь,ИспользуемыеПараметры);
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Тип поля файла""",ИнформацияОбОшибке().Описание);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
				
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецПопытки;
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Тип поля файла""",ОписаниеОшибки);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
				
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецЕсли;
			//Получаем весь текст выражения вычисляемого поля, уже приводимого к нужному формату вывода
			ВесьРезультатПослеФорматирования = СтрЗаменить(РезультатОбработкиПравилаФорматирования,"<ЗНАЧЕНИЕ>",ВесьРезультат);
			ТекПоле.Выражение = ВесьРезультатПослеФорматирования;
			
			
			//Переносим все используемые реквизиты в один массив, для последующего их использованя
			Для Каждого ЭлМас Из ТекИспользуемыеРеквизиты Цикл
				Если МассивИспользуемыхРеквизитов.Найти(ЭлМас)=Неопределено Тогда
					МассивИспользуемыхРеквизитов.Добавить(ЭлМас);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			ТекПоле.Выражение = ВесьРезультат;
		КонецЕсли;
		
		//Обрабатываем текст поля Условие	
		//условие может быть не с начала строки, если это объявление табличной части
		ТекстПоляУсловия = СокрЛП(Выборка.Условие);
		Если СтрНайти(ТекстПоляУсловия,"/*?*/")>0
			ИЛИ СтрНайти(ТекстПоляУсловия, "/*??*/")>0 Тогда			
			
			ТекстВыражения = "";
			
			ПозицияУсловия = СтрНайти(ТекстПоляУсловия,"/*?*/");
			
			Если ПозицияУсловия > 0 Тогда
				ТекстВыражения = Сред(ТекстПоляУсловия,ПозицияУсловия + 5);
			Иначе
				ПозицияУсловия = СтрНайти(ТекстПоляУсловия,"/*??*/");
				ТекстВыражения = Сред(ТекстПоляУсловия,ПозицияУсловия + 6);
			КонецЕсли;
			
			ТекПоле = ВычисляемыеПоля.Добавить();
			ТекПоле.ПутьКДанным =  "СлужебноеПоле_Условие_"+Выборка.НомерСтроки;//Выборка.ПолеФайлаПередачи+"_Условие"+"_"+Выборка.НомерСтроки;
			ТекПоле.Заголовок = Выборка.ПолеФайлаПередачи+"_Условие"+"_"+Выборка.НомерСтроки;
			
			//ТекстВыражения = ?(Лев(СокрЛП(Выборка.Условие), 5) = "/*?*/", СокрЛП(Сред(Выборка.Условие, 6)), СокрЛП(Сред(Выборка.Условие, 7)));

			РезультатОбработкиУсловия = "";
			ТекИспользуемыеРеквизиты = Новый Массив;
			Попытка
				БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ТекстВыражения,РезультатОбработкиУсловия,"Условие заполения поля",ТекИспользуемыеРеквизиты,ТекстТЧДляОбработки,"",ОписаниеОшибки,Ложь,ИспользуемыеПараметры);
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Условие заполения поля""",ИнформацияОбОшибке().Описание);
			
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
								
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
	        КонецПопытки;
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Условие заполения поля""",ОписаниеОшибки);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
						
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецЕсли;
			//Переносим все используемые реквизиты в один массив, для последующего их использованя
			Для Каждого ЭлМас Из ТекИспользуемыеРеквизиты Цикл
				Если МассивИспользуемыхРеквизитов.Найти(ЭлМас)=Неопределено Тогда
					МассивИспользуемыхРеквизитов.Добавить(ЭлМас);
				КонецЕсли;
			КонецЦикла;
			//Получаем весь текст выражения вычисляемого поля, 
			//при этом в поле Условие доступно использование реквизитов Объекта, Задания, ОбрабатываемогоФормата, реквизитов ТЧ
			//
			ВесьРезультатУсловия = СтрЗаменить(РезультатОбработкиУсловия,"<ЗНАЧЕНИЕ>",ВесьРезультат);
			ТекПоле.Выражение = ВесьРезультатУсловия;
			
		КонецЕсли;
		
		//Обрабатываем текст поля ПроверкаВалидностиДанных
		Если ЗначениеЗаполнено(Выборка.ПроверкаВалидностиДанных) Тогда			
		
			ТекПолеПВ = ВычисляемыеПоля.Добавить();
			ТекПолеПВ.ПутьКДанным =  "СлужебноеПоле_ПроверкаВалидности_"+Выборка.НомерСтроки;//Выборка.ПолеФайлаПередачи+"_Условие"+"_"+Выборка.НомерСтроки;
			ТекПолеПВ.Заголовок = Выборка.ПолеФайлаПередачи+"_ПроверкаВалидности"+"_"+Выборка.НомерСтроки;
			ТекстВыражения = "";
			ТекстВыражения = Выборка.ПроверкаВалидностиДанных;

			РезультатОбработкиПВ = "";
			ТекИспользуемыеРеквизиты = Новый Массив;
			Попытка
				БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ТекстВыражения,РезультатОбработкиПВ,"Проверка валидности",ТекИспользуемыеРеквизиты,ТекстТЧДляОбработки,"",ОписаниеОшибки,Ложь,ИспользуемыеПараметры);
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Проверка валидности""",ИнформацияОбОшибке().Описание);
			
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
								
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
	        КонецПопытки;
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Проверка валидности""",ОписаниеОшибки);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
						
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецЕсли;
			//Переносим все используемые реквизиты в один массив, для последующего их использованя
			Для Каждого ЭлМас Из ТекИспользуемыеРеквизиты Цикл
				Если МассивИспользуемыхРеквизитов.Найти(ЭлМас)=Неопределено Тогда
					МассивИспользуемыхРеквизитов.Добавить(ЭлМас);
				КонецЕсли;
			КонецЦикла;
			//Получаем весь текст выражения вычисляемого поля, 
			//при этом в поле ПроверкаВалидности доступно использование реквизитов Объекта, Задания, ОбрабатываемогоФормата, реквизитов ТЧ
			//
			ВесьРезультатПВ = СтрЗаменить(РезультатОбработкиПВ,"<ЗНАЧЕНИЕ>",ВесьРезультат);
			ТекПолеПВ.Выражение = ВесьРезультатПВ;
			
		КонецЕсли;
		
		//Обрабатываем текст поля СообщениеПриОшибкеВалидности - сообщение обрабатываем только если заполнена проверка
		Если ЗначениеЗаполнено(Выборка.ПроверкаВалидностиДанных)
			И ЗначениеЗаполнено(Выборка.СообщениеПриОшибкеВалидности) Тогда			
		
			ТекПолеСПВ = ВычисляемыеПоля.Добавить();
			ТекПолеСПВ.ПутьКДанным =  "СлужебноеПоле_СообщениеПриОшибкеВалидности_"+Выборка.НомерСтроки;//Выборка.ПолеФайлаПередачи+"_Условие"+"_"+Выборка.НомерСтроки;
			ТекПолеСПВ.Заголовок = Выборка.ПолеФайлаПередачи+"_СообщениеПриОшибкеВалидности"+"_"+Выборка.НомерСтроки;
			ТекстВыражения = "";
			ТекстВыражения = Выборка.СообщениеПриОшибкеВалидности;

			РезультатОбработкиСПВ = "";
			ТекИспользуемыеРеквизиты = Новый Массив;
			Попытка
				БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ТекстВыражения,РезультатОбработкиСПВ,"Сообщение при ошибке валидности",ТекИспользуемыеРеквизиты,ТекстТЧДляОбработки,"",ОписаниеОшибки,Ложь,ИспользуемыеПараметры);
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Сообщение при ошибке валидности""",ИнформацияОбОшибке().Описание);
			
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
								
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
	        КонецПопытки;
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Сообщение при ошибке валидности""",ОписаниеОшибки);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
						
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецЕсли;
			//Переносим все используемые реквизиты в один массив, для последующего их использованя
			Для Каждого ЭлМас Из ТекИспользуемыеРеквизиты Цикл
				Если МассивИспользуемыхРеквизитов.Найти(ЭлМас)=Неопределено Тогда
					МассивИспользуемыхРеквизитов.Добавить(ЭлМас);
				КонецЕсли;
			КонецЦикла;
			//Получаем весь текст выражения вычисляемого поля, 
			//при этом в поле СообщениеПриОшибкеВалидности доступно использование реквизитов Объекта, Задания, ОбрабатываемогоФормата, реквизитов ТЧ
			//
			ВесьРезультатСПВ = СтрЗаменить(РезультатОбработкиСПВ,"<ЗНАЧЕНИЕ>",ВесьРезультат);
			ТекПолеСПВ.Выражение = ВесьРезультатСПВ;
			
		КонецЕсли;
		
		//Обрабатываем текст поля ПолеФайлаПередачи
		Если Найти(Выборка.ПолеФайлаПередачи,"%")>0 Тогда			
		
			ТекПоле = ВычисляемыеПоля.Добавить();
			ТекПоле.ПутьКДанным =  "СлужебноеПоле_ПолеФайлаПередачи_"+Выборка.НомерСтроки;
			ТекПоле.Заголовок = Выборка.ПолеФайлаПередачи+"_ПолеФайлаПередачи"+"_"+Выборка.НомерСтроки;
			ТекстВыражения = "";
			
			ТекПолеФайла = Выборка.ПолеФайлаПередачи;
			ТекПолеФайла = """"+ТекПолеФайла+"""";
			Пока Найти(ТекПолеФайла,"%")>0 Цикл
				НачПоз = Найти(ТекПолеФайла,"%");
				
				КонПоз = Найти(Сред(ТекПолеФайла,НачПоз+1),"%");
				
				ЗаменяемыйБлок = Сред(ТекПолеФайла,НачПоз+1,КонПоз-1);
				
				МассивИскомыхСтрок = ТаблицаНастройкаПолейФайла.НайтиСтроки(Новый Структура("ИмяПараметра",ЗаменяемыйБлок));
				ВыражениеТекущегоБлока = "";
				Если МассивИскомыхСтрок.Количество() = 0 Тогда
					ВыражениеТекущегоБлока = """ + Строка("""+ЗаменяемыйБлок+""")+""";
				Иначе
					ВыражениеТекущегоБлока = """ + ВЫБОР ";
					Для Каждого СтрТЧ Из МассивИскомыхСтрок Цикл
						ВыражениеТекущегоБлока = ВыражениеТекущегоБлока + " КОГДА ("+ СтрТЧ.УсловиеПримененияПараметра +") = ИСТИНА ТОГДА Строка("""+СтрТЧ.ЗначениеПараметра+""") ";
					КонецЦикла;
				    ВыражениеТекущегоБлока = ВыражениеТекущегоБлока + " ИНАЧЕ Строка("""+ЗаменяемыйБлок+""") КОНЕЦ +""";
				КонецЕсли;
				ТекПолеФайла = СтрЗаменить(ТекПолеФайла,"%"+ЗаменяемыйБлок+"%",ВыражениеТекущегоБлока);
			КонецЦикла;
			ТекстВыражения = ТекПолеФайла;
			
			Если Лев(ТекстВыражения,4) = """"" +" Тогда
				ТекстВыражения = Сред(ТекстВыражения,5);
			КонецЕсли;
			Если Прав(ТекстВыражения,3) = "+""""" Тогда
				ТекстВыражения = Сред(ТекстВыражения,1,СтрДлина(ТекстВыражения)-3);
			КонецЕсли;
			
			РезультатОбработкиПоляФайла = "";
			ТекИспользуемыеРеквизиты = Новый Массив;
			Попытка
				БухгалтерскиеОперацииСервер.ОбработатьФормулуРеквизитаПроводки(ТекстВыражения,РезультатОбработкиПоляФайла,"Поле файла передачи",ТекИспользуемыеРеквизиты,ТекстТЧДляОбработки,"",ОписаниеОшибки,Ложь,ИспользуемыеПараметры);
			Исключение
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Поле файла передачи""",ИнформацияОбОшибке().Описание);
			
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
								
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
	        КонецПопытки;
			
			Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Выборка.НомерСтроки,"""Поле файла передачи""",ОписаниеОшибки);
				
				Если СообщатьОбОшибках Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
						
				ОчиститьСхемуФорматирования(ФорматОбъект);
				//Отказ = Истина;
				Возврат;
			КонецЕсли;
			//Переносим все используемые реквизиты в один массив, для последующего их использованя
			Для Каждого ЭлМас Из ТекИспользуемыеРеквизиты Цикл
				Если МассивИспользуемыхРеквизитов.Найти(ЭлМас)=Неопределено Тогда
					МассивИспользуемыхРеквизитов.Добавить(ЭлМас);
				КонецЕсли;
			КонецЦикла;
			
			ТекПоле.Выражение = РезультатОбработкиПоляФайла;
			
		КонецЕсли;
		
		// Обработка поля ТабличнаяЧасть - если "*ТЧДОКУМЕНТА", то это ТЧ документа (явная или дополнительня), 
		// иначе это процедура общего модуля, формирующая таблицу значений 
		//        
		Если ЗначениеЗаполнено(ТекстТабличнойЧасти) Тогда
			Если ТекстТабличнойЧасти = РассматриваемаяТЧ Тогда
				Продолжить;
			КонецЕсли;
			//Тут должна быть обработка того, что может быть вложенная табличная часть 
			
			ПозицияТочки = Найти(Выборка.ТабличнаяЧасть,".");
			Если ПозицияТочки >0 Тогда
				Если МассивВложенныхТЧ.Найти(ТекстТабличнойЧасти) = Неопределено Тогда
					МассивВложенныхТЧ.Добавить(ТекстТабличнойЧасти);
				КонецЕсли;
							
			КонецЕсли;
			ТекстУсловия = ВРег(СокрЛП(Выборка.Условие));
			Если СтрНачинаетсяС(ТекстУсловия, "*ТЧДОКУМЕНТА") Тогда
				МассивТЧДокумента.Добавить(ТекстТабличнойЧасти);
				
			ИначеЕсли СтрНачинаетсяС(ТекстУсловия, "/*?*/") = Ложь 
				И СтрНачинаетсяС(ТекстУсловия, "/*??*/") = Ложь
				И СтрДлина(ТекстУсловия)>0 Тогда
				
				// Получение таблицы значений, проверка на список разрешенных функций
				БлокТекстаДоСкобки = Лев(ТекстУсловия,Найти(ТекстУсловия,"(")-1);
				НомерПП            = 0;
				Попытка
					Если БлокТекстаДоСкобки = ВРег("ФормированиеТаблицыОснованийДляСокращеннойЗКР") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ФормированиеТаблицыОснованийДляСокращеннойЗКР(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки,ТекстТабличнойЧасти);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаИсполненияЗавершенногоДоговора") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИсполненияЗавершенногоДоговора(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиОбязательства") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки,ТекстТабличнойЧасти,Истина);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиОбязательстваБезФАИП") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, НомерПП, Ложь, "");
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиОбязательстваПоФАИП") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, НомерПП, Истина, "");
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиОбязательстваБезФАИП2016") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, НомерПП, Ложь, "0506101");
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиОбязательстваПоФАИП2016") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, НомерПП, Истина, "0506101");	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиОбязательстваПоФАИП2016Детально") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиОбязательства151н(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, НомерПП, Истина, "0506101", Истина);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиПодтвержденияДО") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиПодтвержденияДО(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРасшифровкиПлатежаЗаявкиДляОбеспеченияНД") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиПлатежаЗаявкиДляОбеспеченияНД(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаБюджет") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта("Бюджет", ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаБюджет_2025") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_2025("Бюджет", ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаБюджет_1Г_2025") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_1Г_2025(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаБюджет_07_2025") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_07_2025("Бюджет", ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаВнебюджет") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта("Внебюджет", ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
                    ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаВнебюджет_2025") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_2025("Внебюджет", ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаВнебюджет_2026") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтракта_2026("Внебюджет", ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
                    ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаПоПредметам") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоПредметам(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки); 
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаПоПредметам_2026") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоПредметам_2026(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТоварыИсполненияГК") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТоварыИсполненияГК(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТоварыИсполненияГК_2026") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТоварыИсполненияГК_2026(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаПоКонтрагентам") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоКонтрагентам(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДанныхКонтрактаПоКонтрагентам_2025") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДанныхКонтрактаПоКонтрагентам_2025(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаКодовЗаявленияРасходы") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКодовЗаявления(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, "", "");	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаКодовЗаявленияДоходы") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКодовЗаявления(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, "", "");
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаКодовЗаявленияИсточники") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКодовЗаявления(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, "", "");	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаКонтрагентовОбязательства") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКонтрагентовОбязательства(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, "");
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаКонтрагентовОбязательства2016") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКонтрагентовОбязательства(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, "0506101");
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаКонтрагентовСоглашения") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаКонтрагентовСоглашения(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ПолучитьПереченьГосУслугДляЭкспорта") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьПереченьГосУслугДляЭкспорта(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки,Документы.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка());
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ПолучитьПереченьГосУслугДляЭкспортаКаталога") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьПереченьГосУслугДляЭкспортаКаталога(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ПолучитьТаблицуПараметровПодписок") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьТаблицуПараметровПодписок(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ПолучитьТаблицуДополнительныхДанных") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьТаблицуДополнительныхДанных(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ПолучитьТаблицуПакетаНачислений") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ПолучитьТаблицуПакетаНачислений(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки); 
					ИначеЕсли БлокТекстаДоСкобки = ВРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица140н") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица140н(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки); 
					ИначеЕсли БлокТекстаДоСкобки = ВРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226н") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226н(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки); 
					ИначеЕсли БлокТекстаДоСкобки = ВРег("УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226нИтоги") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетПараметрыОтчетаТаблица226нИтоги(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки); 		
					ИначеЕсли БлокТекстаДоСкобки = ВРег("УниверсальныйРегламентированныйОтчетТаблица0501015") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.УниверсальныйРегламентированныйОтчетТаблица0501015(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки); 	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаСредствБюджетаДляГК") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаСредствБюджетаДляГК(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки,ТекстТабличнойЧасти,Истина);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаСредствВнебюджетаДляГК") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаСредствВнебюджетаДляГК(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки,ТекстТабличнойЧасти,Истина);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаСредствПредметКонтракта") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаСредствПредметКонтракта(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки,ТекстТабличнойЧасти,Истина);
					ИначеЕсли Лев(БлокТекстаДоСкобки, 33) = ВРег("ТаблицаРасшифровкиРаспоряженияМИР") Тогда 
						ИспользоватьКЭК              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кэк")              > 0, Истина, Ложь);
						ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
						ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
						ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРасшифровкиРаспоряженияМИР(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, ИспользоватьДопКл, 
				                                                                     ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьКФО);
					ИначеЕсли Лев(БлокТекстаДоСкобки, 41) = ВРег("ТаблицаИтоговРаспоряженияМИРСДетализацией") Тогда 
						ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
						ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
						ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИтоговРаспоряженияМИРСДетализацией(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, ИспользоватьДопКл, 
						                                                                             ИспользоватьКодМероприятия, ИспользоватьКФО);
					ИначеЕсли Лев(БлокТекстаДоСкобки, 28) = ВРег("ТаблицаИтоговРаспоряженияМИР") Тогда 
						ИспользоватьКЭК              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кэк")              > 0, Истина, Ложь);
						ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
						ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
						ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИтоговРаспоряженияМИР(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, ИспользоватьДопКл, 
				                                                                     ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьКФО);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаИсточниковСредствВР") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИсточниковСредствВР(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);	
					ИначеЕсли Лев(БлокТекстаДоСкобки, 28) = ВРег("ТаблицаТЧПлатежногоДокумента") Тогда
						ИспользоватьКЭК              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кэк")              > 0, Истина, Ложь);
						ИспользоватьДопКл            = ?(Найти(Нрег(БлокТекстаДоСкобки), "допкл")            > 0, Истина, Ложь);
						ИспользоватьКодМероприятия   = ?(Найти(Нрег(БлокТекстаДоСкобки), "кодмероприятия")   > 0, Истина, Ложь);
						ИспользоватьАналитическийКод = ?(Найти(Нрег(БлокТекстаДоСкобки), "аналитическийкод") > 0, Истина, Ложь);
						ИспользоватьКФО              = ?(Найти(Нрег(БлокТекстаДоСкобки), "кфо")              > 0, Истина, Ложь);
						ИспользоватьКОСГУПолучателя  = ?(Найти(Нрег(БлокТекстаДоСкобки), "косгуполучателя")  > 0, Истина, Ложь);
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаТЧПлатежногоДокумента(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, ТекстТабличнойЧасти, ИспользоватьДопКл, 
						                                                                   ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьАналитическийКод, ИспользоватьКФО, ИспользоватьКОСГУПолучателя);		
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаСведенийОбИмуществе") Тогда
						ТабЧасть = РеестрИмуществаСервер.ТаблицаСведенийОбИмуществе(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, ТекстТабличнойЧасти, ТекстУсловия);	
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаФайловИмущества") Тогда
						ТабЧасть = РеестрИмуществаСервер.ТаблицаФайлов(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки, ТекстТабличнойЧасти, ТекстУсловия);						
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаРеквизитовПодтверждающихДокументов") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаРеквизитовПодтверждающихДокументов(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);							
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаДокументовОснований") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаДокументовОснований(ФорматОбъект.ИдентификаторОбъекта.ЗначениеПустойСсылки);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаИдентификаторовПолученныхСообщений") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаИдентификаторовПолученныхСообщений(Новый Массив);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаОтбораПоУчастникам") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаОтбораПоУчастникам(Новый Массив);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаОтбораПоКБК") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаОтбораПоКБК(Новый Массив);
					ИначеЕсли БлокТекстаДоСкобки = ВРег("ТаблицаОтбораПоИдентификаторам") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаОтбораПоИдентификаторам(Новый Массив);
					ИначеЕсли НРег(БлокТекстаДоСкобки) = НРег("ТаблицаБухПроводокИсходящегоИзвещенияГИИСЭБ") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаБухПроводокИсходящегоИзвещенияГИИСЭБ(ФорматОбъект.ИдентификаторОбъекта);
					ИначеЕсли НРег(БлокТекстаДоСкобки) = НРег("ТаблицаБухОборотовИсходящегоИзвещенияГИИСЭБ") Тогда
						ТабЧасть = БиблиотекаФункцийОбмена.ТаблицаБухОборотовИсходящегоИзвещенияГИИСЭБ(ФорматОбъект.ИдентификаторОбъекта);	
					Иначе
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("Незарегистрированная функция [БлокТекстаДоСкобки]", 
																								Новый Структура("БлокТекстаДоСкобки", БлокТекстаДоСкобки));
																								
						ОчиститьСхемуФорматирования(ФорматОбъект);
						ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
					
						Если СообщатьОбОшибках Тогда
							ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
						КонецЕсли;
						Возврат;
					
					КонецЕсли;
                    
				Исключение
					ОчиститьСхемуФорматирования(ФорматОбъект);
					
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку("Не удалось сформировать таблицу значений функцией [БлокТекстаДоСкобки]", 
																								Новый Структура("БлокТекстаДоСкобки", БлокТекстаДоСкобки));
					ЗаписьЖурналаРегистрации("Форматы обмена.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ФорматыОбменаБанкиКС, ФорматОбъект.Ссылка, ТекстОшибки);
					
					Если СообщатьОбОшибках Тогда
						ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
					КонецЕсли;

					Возврат;
																																														
				КонецПопытки;
				СоответствиеТЧИзПроцедур.Вставить(ТекстТЧДляОбработки,ТабЧасть);
			КонецЕсли;
				 
		КонецЕсли;
		РассматриваемаяТЧ = ТекстТабличнойЧасти;
	КонецЦикла;
	
	Для Каждого ИспПараметр Из ИспользуемыеПараметры Цикл
		
		НовПараметр = СхемаКомпоновки.Параметры.Добавить();
		НовПараметр.Имя = ИспПараметр;
		НовПараметр.ОграничениеИспользования = Истина;
		
	КонецЦикла;
	
	
	ТекстЗапросаШапки = ТекстЗапросаШапки + Символы.ПС +" ИСТИНА КАК ПолеСвязи,";
	
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "ПолеСвязи","",,Новый ОписаниеТипов("Булево"));
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ШапкаДокумента,"ПолеСвязи","",,Новый ОписаниеТипов("Булево"),Истина);
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборПустойСсылки,"ПолеСвязи","",,Новый ОписаниеТипов("Булево"),Истина);
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ОбъединениеДляСсылок,"ПолеСвязи","",,Новый ОписаниеТипов("Булево"),Истина);
	
	ТекстЗапросаШапки = ТекстЗапросаШапки + Символы.ПС +" ОБЪЕКТ.ССЫЛКА КАК ССЫЛКАДОКУМЕНТА,";
	
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "ССЫЛКАДОКУМЕНТА","",,Новый ОписаниеТипов("ДокументСсылка."+МетаданныеОбъекта.Имя));
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ШапкаДокумента,"ССЫЛКАДОКУМЕНТА","",,Новый ОписаниеТипов("ДокументСсылка."+МетаданныеОбъекта.Имя),Истина);
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборПустойСсылки,"ССЫЛКАДОКУМЕНТА","",,Новый ОписаниеТипов("ДокументСсылка."+МетаданныеОбъекта.Имя),Истина);
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ОбъединениеДляСсылок,"ССЫЛКАДОКУМЕНТА","",,Новый ОписаниеТипов("ДокументСсылка."+МетаданныеОбъекта.Имя),Истина);
	
	
	
	
	//ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "ПолеСвязи", "Объект",,Новый ОписаниеТипов("Булево"));
	
	
	
	
	//ТабличныеЧасти
	ТекстЗапросаТЧШаблон = "ВЫБРАТЬ " + Символы.ПС +" ИСТИНА КАК ПолеСвязи,";
	
	//Переделать в таблицу
	ТаблицаДанныхТЧ = Новый ТаблицаЗначений;
	ТаблицаДанныхТЧ.Колонки.Добавить("ИмяТЧ");
	ТаблицаДанныхТЧ.Колонки.Добавить("НаборДанных");
	ТаблицаДанныхТЧ.Колонки.Добавить("ТекстЗапроса");
	ТаблицаДанныхТЧ.Колонки.Добавить("ТабличнаяЧасть");
	ТаблицаДанныхТЧ.Колонки.Добавить("ЭтоДопТЧ");
	ТаблицаДанныхТЧ.Колонки.Добавить("ЭтоНаборДанныхОбъект");
	ТаблицаДанныхТЧ.Колонки.Добавить("МассивИменДопРеквизитов");
	ТаблицаДанныхТЧ.Колонки.Добавить("ДопТЧНачало",Новый ОписаниеТипов("Строка"));
	ТаблицаДанныхТЧ.Колонки.Добавить("ДопТЧРеквизиты",Новый ОписаниеТипов("Строка"));
	ТаблицаДанныхТЧ.Колонки.Добавить("ДопТЧРеквизитыКонец",Новый ОписаниеТипов("Строка"));
	ТаблицаДанныхТЧ.Колонки.Добавить("ДопТЧКонец",Новый ОписаниеТипов("Строка"));
	СтруктураНаборов = Новый Структура;
	СтруктураТекстов = Новый Структура;
	
	ФорматНужен  = Ложь;
	ЗаданиеНужно = Ложь; 
	ФайлНужен    = Ложь;
	
	Для Каждого ЭлМас Из МассивИспользуемыхРеквизитов Цикл
		Если Прав(ЭлМас,15) = "ССЫЛКАДОКУМЕНТА" Тогда
			Продолжить;
		КонецЕсли;
		Если Лев(ЭлМас,7) = "ОБЪЕКТ." Тогда
			
			ИмяРеквизита = Сред(ЭлМас,8);
			
			Реквизит = МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита);
			
			ТекстЗапросаШапки = ТекстЗапросаШапки + Символы.ПС + " " + ЭлМас + " КАК " + ИмяРеквизита + ",";
			
			ТипПоля = Неопределено;
			Если Реквизит<>Неопределено Тогда
				ТипПоля = Реквизит.Тип;
			КонецЕсли;
			//ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, Сред(НовоеПоле.ИмяПоля,Найти(НовоеПоле.ИмяПоля,"_")+1), НовоеПоле.ИмяНабора,,НовоеПоле.ТипПоля);
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ШапкаДокумента,ИмяРеквизита,"Объект",,ТипПоля,Истина);
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ОбъединениеДляСсылок,ИмяРеквизита,"Объект",,ТипПоля,Истина);
			
		ИначеЕсли Лев(ЭлМас,8) = "ЗАДАНИЕ." Тогда
			Если НЕ ЗаданиеНужно Тогда
				МетаданныеЗадания    = Метаданные.Документы.ЗаданиеНаЭкспортДанныхВБанкиКС;
				ТекстЗапросаЗадания  = "Выбрать " + Символы.ПС +" ИСТИНА КАК ПолеСвязи,";
				
				ТекстЗапросаЗадания2 = "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС + "ВЫБРАТЬ " + Символы.ПС + "ИСТИНА, ";
	
				ДанныеЗадания        = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
				ДанныеЗадания.ИсточникДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;
				ДанныеЗадания.Имя    = "Задание";
				
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ДанныеЗадания,"ПолеСвязи","",, Новый ОписаниеТипов("Булево"), Истина);
				ЗаданиеНужно        = Истина; 	
			КонецЕсли;
			
			ИмяРеквизита         = Сред(ЭлМас,9);
			
			Реквизит             = МетаданныеЗадания.Реквизиты.Найти(ИмяРеквизита);
			
			ТекстЗапросаЗадания  = ТекстЗапросаЗадания  + Символы.ПС + " " + ЭлМас + " КАК " + ИмяРеквизита+",";
						
			ТипПоля = Неопределено;
			Если Реквизит <> Неопределено Тогда
				ТипПоля = Реквизит.Тип;				
				Если Реквизит.Тип.Типы()[0] = Тип("Дата") ИЛИ Реквизит.Тип.Типы()[0] = Тип("Строка") ИЛИ 
					 Реквизит.Тип.Типы()[0] = Тип("Число") ИЛИ Реквизит.Тип.Типы()[0] = Тип("ДвоичныеДанные") Тогда
					 
					 ТекстЗапросаЗадания2 = ТекстЗапросаЗадания2 + Символы.ПС + " """" ,";
			    Иначе		 				 				
				     ТекстЗапросаЗадания2 = ТекстЗапросаЗадания2 + Символы.ПС + "Значение(" + Метаданные.НайтиПоТипу(Реквизит.Тип.Типы()[0]).ПолноеИмя() + ".ПустаяСсылка),";
				КонецЕсли;	 
			Иначе
				ТекстЗапросаЗадания2 = ТекстЗапросаЗадания2 + Символы.ПС + "Значение(Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяСсылка),";
			КонецЕсли;
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ДанныеЗадания, ИмяРеквизита, "Задание",, ТипПоля, Истина);
			
			
		ИначеЕсли Лев(ЭлМас, 5) = "ФАЙЛ." Тогда 
			
			Если НЕ ФайлНужен Тогда
				МетаданныеФормата = Метаданные.Справочники.ФорматыОбменаБанкиКС;
				ТекстЗапросаФормата = "Выбрать " + Символы.ПС + " ИСТИНА КАК ПолеСвязи,";		
				
				ДанныеФайла = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
				ДанныеФайла.ИсточникДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;
				ДанныеФайла.Имя = "Файл";
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ДанныеФайла, "ПолеСвязи","",, Новый ОписаниеТипов("Булево"),Истина);
				ФайлНужен = Истина;
			КонецЕсли;      
			
			ИмяРеквизита = Сред(ЭлМас, 6);
			ТекстЗапросаФормата = ТекстЗапросаФормата + Символы.ПС +" "+ ЭлМас + " КАК " + ИмяРеквизита + ",";
			
			Реквизит = МетаданныеФормата.Реквизиты.Найти(ИмяРеквизита);
			ТипПоля = Неопределено;
			Если Реквизит<>Неопределено Тогда
				ТипПоля = Реквизит.Тип;
			КонецЕсли;
			
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ДанныеФайла, ИмяРеквизита, "ФАЙЛ",, ТипПоля, Истина);
	
		ИначеЕсли Лев(ЭлМас, 21) = "ОБРАБАТЫВАЕМЫЙФОРМАТ." Тогда
			Если НЕ ФорматНужен Тогда
				МетаданныеФормата = Метаданные.Справочники.ФорматыОбменаБанкиКС;
				ТекстЗапросаФормата = "Выбрать " + Символы.ПС + " ИСТИНА КАК ПолеСвязи,";		
				
				ДанныеФормата = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
				ДанныеФормата.ИсточникДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;
				ДанныеФормата.Имя = "ФорматОбмена";
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ДанныеФормата,"ПолеСвязи","",,Новый ОписаниеТипов("Булево"),Истина);
				ФорматНужен = Истина;
			КонецЕсли;
			ИмяРеквизита = Сред(ЭлМас,22);
			ТекстЗапросаФормата = ТекстЗапросаФормата + Символы.ПС +" "+ЭлМас+" КАК "+ИмяРеквизита+",";
			
			Реквизит = МетаданныеФормата.Реквизиты.Найти(ИмяРеквизита);
			ТипПоля = Неопределено;
			Если Реквизит<>Неопределено Тогда
				ТипПоля = Реквизит.Тип;
			КонецЕсли;
			
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(ДанныеФормата,ИмяРеквизита,"ОБРАБАТЫВАЕМЫЙФОРМАТ",,ТипПоля,Истина);
			
		Иначе
			//ЭтоТЧ
			ТекущийНабор = Неопределено;
			ТекТекст = "";
			ИмяТЧ = Сред(ЭлМас,1,Найти(ЭлМас,".")-1);
			ИмяРеквизита = Сред(ЭлМас,Найти(ЭлМас,".")+1);
			
			СтрокаДанныхТЧ = ТаблицаДанныхТЧ.Найти(ИмяТЧ,"ИмяТЧ");
			Если СтрокаДанныхТЧ = Неопределено Тогда
				СтрокаДанныхТЧ = ТаблицаДанныхТЧ.Добавить();
				СтрокаДанныхТЧ.ИмяТЧ = ИмяТЧ;
				
				Если МассивТЧДокумента.Найти(ИмяТЧ)<>Неопределено Тогда
					//Это ТЧ Документа
					ТипНабораДанных = Тип("НаборДанныхЗапросСхемыКомпоновкиДанных");
					СтрокаДанныхТЧ.ЭтоНаборДанныхОбъект = Ложь;
				ИначеЕсли СоответствиеТЧИзПроцедур.Получить(ИмяТЧ)<>Неопределено Тогда
					//Это тч, формируемая из внешней процедуры
					ТипНабораДанных = Тип("НаборДанныхОбъектСхемыКомпоновкиДанных");
					СтрокаДанныхТЧ.ЭтоНаборДанныхОбъект = Истина;
				КонецЕсли;
				
				СтрокаДанныхТЧ.НаборДанных = Объединение.Элементы.Добавить(ТипНабораДанных);
				СтрокаДанныхТЧ.НаборДанных.ИсточникДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;
				СтрокаДанныхТЧ.НаборДанных.Имя = ИмяТЧ;
				
				Если СтрокаДанныхТЧ.ЭтоНаборДанныхОбъект Тогда
					СтрокаДанныхТЧ.НаборДанных.ИмяОбъекта = ИмяТЧ;
					Если МассивВложенныхТЧ.Количество()>0 Тогда
						ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "ИмяТабЧасти_ГЛ", "",,Новый ОписаниеТипов("Строка"));
						ОбщийМодульСКД.ДобавитьПолеВНаборДанных(СтрокаДанныхТЧ.НаборДанных,"ИмяТабЧасти_ГЛ","",,Новый ОписаниеТипов("Строка"));

						ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "НомерСтроки_ГЛ", "",,Новый ОписаниеТипов("Строка"));
						ОбщийМодульСКД.ДобавитьПолеВНаборДанных(СтрокаДанныхТЧ.НаборДанных,"НомерСтроки_ГЛ",ИмяТЧ,,Новый ОписаниеТипов("Строка"));
					КонецЕсли;
				Иначе
					СтрокаДанныхТЧ.ТекстЗапроса = ТекстЗапросаТЧШаблон;
					СтрокаДанныхТЧ.ТабличнаяЧасть = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТЧ);
					СтрокаДанныхТЧ.МассивИменДопРеквизитов = Новый Массив;
					
					Если СтрокаДанныхТЧ.ТабличнаяЧасть<>Неопределено Тогда
						СтрокаДанныхТЧ.ЭтоДопТЧ = Ложь;
						СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " " + ИмяТЧ + ".НомерСтроки КАК НомерСтроки,";
						СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " " + ИмяТЧ + ".ССЫЛКА КАК ССЫЛКАДОКУМЕНТА,";
					Иначе
						СтрокаДанныхТЧ.ЭтоДопТЧ = Истина;
						УстановитьНачальныеЗначенияПолямЗапросаДопТЧ(СтрокаДанныхТЧ,ИмяТЧ,ИмяРеквизита);
						Если ИмяРеквизита <> "НОМЕРСТРОКИ" Тогда
							СтрокаДанныхТЧ.МассивИменДопРеквизитов.Добавить(ИмяРеквизита);
							ДобавитьДопРеквизит(СтрокаДанныхТЧ,ИмяТЧ,ИмяРеквизита);
						КонецЕсли;
						СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " ДопРекДопТЧ.НомерСтроки КАК НомерСтроки,";
						СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " ДопРекДопТЧ.ССЫЛКАДОКУМЕНТА КАК ССЫЛКАДОКУМЕНТА,";
					КонецЕсли;
					СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " """ + ВРег(ИмяТЧ) + """ КАК ИмяТабЧасти,";
				КонецЕсли;	
				
				//ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "ПолеСвязи", "",,Новый ОписаниеТипов("Булево"),Истина);
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(СтрокаДанныхТЧ.НаборДанных,"ПолеСвязи","",,Новый ОписаниеТипов("Булево"));
				
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(СтрокаДанныхТЧ.НаборДанных,"ССЫЛКАДОКУМЕНТА","",,Новый ОписаниеТипов("ДокументСсылка."+МетаданныеОбъекта.Имя));
				
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "ИмяТабЧасти", "",,Новый ОписаниеТипов("Строка"));
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(СтрокаДанныхТЧ.НаборДанных,"ИмяТабЧасти","",,Новый ОписаниеТипов("Строка"));

				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "НомерСтроки", "",,Новый ОписаниеТипов("Число"));
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(СтрокаДанныхТЧ.НаборДанных,"НомерСтроки",ИмяТЧ,,Новый ОписаниеТипов("Число"));
			КонецЕсли;
			Если СтрокаДанныхТЧ.ЭтоНаборДанныхОбъект Тогда
				ТипПоля = Неопределено;
				
			Иначе
				
				ТекТЧ = МетаданныеОбъекта.ТабличныеЧасти.Найти(ИмяТЧ);
				
				ЭтоДопРеквизит = Истина;
				Если НЕ СтрокаДанныхТЧ.ЭтоДопТЧ Тогда
					Реквизит = СтрокаДанныхТЧ.ТабличнаяЧасть.Реквизиты.Найти(ИмяРеквизита);	
					Если Реквизит <> Неопределено ИЛИ ИмяРеквизита = "НОМЕРСТРОКИ" Тогда
						ЭтоДопРеквизит = Ложь;
					КонецЕсли;			
				КонецЕсли;	
				
				Если ИмяРеквизита = "НОМЕРСТРОКИ" Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЭтоДопРеквизит Тогда
					СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " " + ЭлМас + " КАК " + ИмяРеквизита + ",";
				Иначе
					Если СтрокаДанныхТЧ.МассивИменДопРеквизитов.Найти(ИмяРеквизита) = Неопределено Тогда
						СтрокаДанныхТЧ.МассивИменДопРеквизитов.Добавить(ИмяРеквизита);
						ДобавитьДопРеквизит(СтрокаДанныхТЧ,ИмяТЧ,ИмяРеквизита);
					КонецЕсли;
					СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " ДопРекДопТЧ."+ИмяРеквизита+" КАК " + ИмяРеквизита + ",";
				КонецЕсли;
				
				ТипПоля = Неопределено;
				Если Реквизит<>Неопределено Тогда
					ТипПоля = Реквизит.Тип;
				КонецЕсли;
				
			КонецЕсли;
			
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ИмяРеквизита, ИмяТЧ,,ТипПоля);
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(СтрокаДанныхТЧ.НаборДанных,ИмяРеквизита,ИмяТЧ,,ТипПоля);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаДанныхТЧ Из ТаблицаДанныхТЧ Цикл
		Если НЕ СтрокаДанныхТЧ.ЭтоНаборДанныхОбъект Тогда
			СтрокаДанныхТЧ.ТекстЗапроса = Лев(СтрокаДанныхТЧ.ТекстЗапроса,СтрДлина( СтрокаДанныхТЧ.ТекстЗапроса)-1);
			Если НЕ СтрокаДанныхТЧ.ЭтоДопТЧ Тогда			
				СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + Символы.ПС + " ИЗ Документ."+МетаданныеОбъекта.Имя+"."+СтрокаДанныхТЧ.ИмяТЧ+" КАК "+СтрокаДанныхТЧ.ИмяТЧ;
				Если СтрокаДанныхТЧ.МассивИменДопРеквизитов.Количество()>0 Тогда
					СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ДопТЧНачало + СтрокаДанныхТЧ.ДопТЧРеквизиты + СтрокаДанныхТЧ.ДопТЧРеквизитыКонец + ";" + Символы.ПС + СтрокаДанныхТЧ.ТекстЗапроса + СтрокаДанныхТЧ.ДопТЧКонец;
				КонецЕсли;
				СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ТекстЗапроса + " ГДЕ "+СтрокаДанныхТЧ.ИмяТЧ+".Ссылка В (&Ссылка) ";
			Иначе
				СтрокаДанныхТЧ.ТекстЗапроса = СтрокаДанныхТЧ.ДопТЧНачало + СтрокаДанныхТЧ.ДопТЧРеквизиты + СтрокаДанныхТЧ.ДопТЧРеквизитыКонец + ";" + Символы.ПС + СтрокаДанныхТЧ.ТекстЗапроса + СтрокаДанныхТЧ.ДопТЧКонец;
			КонецЕсли; 
			СтрокаДанныхТЧ.НаборДанных.Запрос = СтрокаДанныхТЧ.ТекстЗапроса;
    	КонецЕсли;
	КонецЦикла;
	
	ОбъединениеЕсть = Истина;
	Если Объединение.Элементы.Количество() = 0 Тогда
		ОбъединениеЕсть = Ложь;
	КонецЕсли;
		
	ТекстЗапросаШапки = Лев(ТекстЗапросаШапки,СтрДлина(ТекстЗапросаШапки)-1);
	ШапкаДокумента.Запрос = ТекстЗапросаШапки + Символы.ПС + " ИЗ Документ."+МетаданныеОбъекта.Имя+" КАК ОБЪЕКТ ГДЕ ОБЪЕКТ.Ссылка В (&Ссылка) ";
	
	Если ЗаданиеНужно Тогда
		
		ТекстЗапросаЗадания                    = Лев(ТекстЗапросаЗадания, СтрДлина(ТекстЗапросаЗадания) - 1);
		ТекстЗапросаЗадания                    = ТекстЗапросаЗадания + Символы.ПС + " ИЗ Документ.ЗаданиеНаЭкспортДанныхВБанкиКС Как ЗАДАНИЕ ГДЕ ЗАДАНИЕ.Ссылка = &Задание ";
		ТекстЗапросаЗадания2                   = Лев(ТекстЗапросаЗадания2, СтрДлина(ТекстЗапросаЗадания2) - 1);
		ТекстЗапросаЗадания2                   = ТекстЗапросаЗадания2 + Символы.ПС + " ГДЕ &Задание = ЗНАЧЕНИЕ(Документ.ЗаданиеНаЭкспортДанныхВБанкиКС.ПустаяССылка)";
		
		ДанныеЗадания.Запрос                   = ТекстЗапросаЗадания + Символы.ПС + ТекстЗапросаЗадания2;
		
		СвязьНаборовДанных                     = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
		СвязьНаборовДанных.НаборДанныхИсточник = ОбъединениеДляСсылок.Имя;
		СвязьНаборовДанных.НаборДанныхПриемник = "Задание";
		СвязьНаборовДанных.ВыражениеИсточник   = "ПолеСвязи";
		СвязьНаборовДанных.ВыражениеПриемник   = "ПолеСвязи";
		
	КонецЕсли;
	
	Если ОбъединениеЕсть Тогда	
		СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
		СвязьНаборовДанных.НаборДанныхИсточник = ОбъединениеДляСсылок.Имя;//"Объект";
		СвязьНаборовДанных.НаборДанныхПриемник = "ДанныеДокумента";
		СвязьНаборовДанных.ВыражениеИсточник = "ПолеСвязи";
		СвязьНаборовДанных.ВыражениеПриемник = "ПолеСвязи";
		
		СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
		СвязьНаборовДанных.НаборДанныхИсточник = ОбъединениеДляСсылок.Имя;//"Объект";
		СвязьНаборовДанных.НаборДанныхПриемник = "ДанныеДокумента";
		СвязьНаборовДанных.ВыражениеИсточник = "ССЫЛКАДОКУМЕНТА";
		СвязьНаборовДанных.ВыражениеПриемник = "ССЫЛКАДОКУМЕНТА";
		
		Если ЗаданиеНужно Тогда
			СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
			СвязьНаборовДанных.НаборДанныхИсточник = "Задание";
			СвязьНаборовДанных.НаборДанныхПриемник = "ДанныеДокумента";
			СвязьНаборовДанных.ВыражениеИсточник   = "ПолеСвязи";
			СвязьНаборовДанных.ВыражениеПриемник   = "ПолеСвязи";
		КонецЕсли;
	КонецЕсли;
	
	Если ФорматНужен Тогда
		СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
		СвязьНаборовДанных.НаборДанныхИсточник = ОбъединениеДляСсылок.Имя;//"Объект";
		СвязьНаборовДанных.НаборДанныхПриемник = "ФорматОбмена";
		СвязьНаборовДанных.ВыражениеИсточник = "ПолеСвязи";
		СвязьНаборовДанных.ВыражениеПриемник = "ПолеСвязи";	
		
		Если ЗаданиеНужно Тогда
			СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
			СвязьНаборовДанных.НаборДанныхИсточник = "Задание";
			СвязьНаборовДанных.НаборДанныхПриемник = "ФорматОбмена";
			СвязьНаборовДанных.ВыражениеИсточник = "ПолеСвязи";
			СвязьНаборовДанных.ВыражениеПриемник = "ПолеСвязи";
		КонецЕсли;
		Если ОбъединениеЕсть Тогда
			СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
			СвязьНаборовДанных.НаборДанныхИсточник = "ФорматОбмена";
			СвязьНаборовДанных.НаборДанныхПриемник = "ДанныеДокумента";
			СвязьНаборовДанных.ВыражениеИсточник = "ПолеСвязи";
			СвязьНаборовДанных.ВыражениеПриемник = "ПолеСвязи";
		КонецЕсли;
		ТекстЗапросаФормата = Лев(ТекстЗапросаФормата,СтрДлина(ТекстЗапросаФормата)-1);
		ДанныеФормата.Запрос = ТекстЗапросаФормата + Символы.ПС + " ИЗ Справочник.ФорматыОбменаБанкиКС КАК ОБРАБАТЫВАЕМЫЙФОРМАТ ГДЕ ОБРАБАТЫВАЕМЫЙФОРМАТ.Ссылка = &ОБРАБАТЫВАЕМЫЙФОРМАТ";
	КонецЕсли;    
	
	Если ФайлНужен Тогда
		СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
		СвязьНаборовДанных.НаборДанныхИсточник = ОбъединениеДляСсылок.Имя;//"Объект";
		СвязьНаборовДанных.НаборДанныхПриемник = "Файл";
		СвязьНаборовДанных.ВыражениеИсточник = "ПолеСвязи";
		СвязьНаборовДанных.ВыражениеПриемник = "ПолеСвязи";	
		
		Если ЗаданиеНужно Тогда
			СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
			СвязьНаборовДанных.НаборДанныхИсточник = "Задание";
			СвязьНаборовДанных.НаборДанныхПриемник = "Файл";
			СвязьНаборовДанных.ВыражениеИсточник = "ПолеСвязи";
			СвязьНаборовДанных.ВыражениеПриемник = "ПолеСвязи";
		КонецЕсли;
		Если ОбъединениеЕсть Тогда
			СвязьНаборовДанных = СхемаКомпоновки.СвязиНаборовДанных.Добавить();
			СвязьНаборовДанных.НаборДанныхИсточник = "Файл";
			СвязьНаборовДанных.НаборДанныхПриемник = "ДанныеДокумента";
			СвязьНаборовДанных.ВыражениеИсточник = "ПолеСвязи";
			СвязьНаборовДанных.ВыражениеПриемник = "ПолеСвязи";
		КонецЕсли;
		ТекстЗапросаФормата = Лев(ТекстЗапросаФормата,СтрДлина(ТекстЗапросаФормата)-1);
		ДанныеФормата.Запрос = ТекстЗапросаФормата + Символы.ПС + " ИЗ Справочник.ЗаданиеНаЭкспортДанныхВБанкиКСПрисоединенныеФайлы КАК ФАЙЛ ГДЕ ФАЙЛ.Ссылка = &ФАЙЛ";
	КонецЕсли;   

	
	Если НЕ ОбъединениеЕсть Тогда
		СхемаКомпоновки.НаборыДанных.Удалить(Объединение);
	КонецЕсли;
	
	//Добавим поле ПолеСвязи для того, чтобы если в формате не используются поля документа, то данные все равно формировались в СКД
	ВыбранноеПоле = СхемаКомпоновки.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ПолеСвязи");
	ВыбранноеПоле.Использование = Истина;
	ВыбранноеПоле.Заголовок = "ПоляСвязи";
	//

	ГруппировкаСКД = СхемаКомпоновки.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСКД.Имя = "ГруппировкаПоДокументу";
	ГруппировкаСКД.Использование = Истина;
	
	ПолеГруппировки = ГруппировкаСКД.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	ПолеГруппировки.Использование = Истина;
	ПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ССЫЛКАДОКУМЕНТА");
	
	Поле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	Поле.Поле = Новый ПолеКомпоновкиДанных("ССЫЛКАДОКУМЕНТА");
	Поле.Использование = Истина;
	Поле.Заголовок = "Ссылка на документ";
	
	//Добавление в структуру СКД полей.
	ГруппировкаСКД = ГруппировкаСКД.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ГруппировкаСКД.Имя = "ДетальныеЗаписи";
	ГруппировкаСКД.Использование = Истина;
	
	// добавление поля ссылки, чтобы результат выборки был всегда
	Поле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных")); 
	Поле.Поле = Новый ПолеКомпоновкиДанных("ССЫЛКАДОКУМЕНТА");
	Поле.Использование = Истина;
	Поле.Заголовок = "Ссылка на документ";
	
	Если ТаблицаДанныхТЧ.Количество()>0 Тогда	
		
		Поле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных("ИмяТабЧасти");
		Поле.Использование = Истина;
		Поле.Заголовок = "ИмяТабЧасти";
		Если МассивВложенныхТЧ.Количество()>0 Тогда
			Поле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Поле = Новый ПолеКомпоновкиДанных("ИмяТабЧасти_ГЛ");
			Поле.Использование = Истина;
			Поле.Заголовок = "ИмяТабЧасти_ГЛ";
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаДанныхТЧ Из ТаблицаДанныхТЧ Цикл
		Поле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных(СтрокаДанныхТЧ.ИмяТЧ+".НомерСтроки");
		Поле.Использование = Истина;
		Поле.Заголовок = СтрокаДанныхТЧ.ИмяТЧ+".НомерСтроки";
		
		Если СтрокаДанныхТЧ.ЭтоНаборДанныхОбъект И МассивВложенныхТЧ.Количество() > 0 Тогда
			Поле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			Поле.Поле = Новый ПолеКомпоновкиДанных(СтрокаДанныхТЧ.ИмяТЧ+".НомерСтроки_ГЛ");
			Поле.Использование = Истина;
			Поле.Заголовок = СтрокаДанныхТЧ.ИмяТЧ+".НомерСтроки_ГЛ";	
		КонецЕсли;	
			
	КонецЦикла;
	
	Для Каждого ВычПоле Из СхемаКомпоновки.ВычисляемыеПоля Цикл 
		Поле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных(ВычПоле.ПутьКДанным);
		Поле.Использование = Истина;
		Поле.Заголовок = ВычПоле.Заголовок;
	КонецЦикла;

	//Добавим авто выбранное поле, для автоматического добавления поля, добавленного в корень, в детальные записи
	АвтоВыбранноеПоле = ГруппировкаСКД.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	АвтоВыбранноеПоле.Использование = Истина;
	//
	
	// Добавление параметов в СКД.	
	Для каждого ТекПараметр Из ТаблицаПараметров Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ТекПараметр.ЗначениеПараметра));
		
	    Параметр = СхемаКомпоновки.Параметры.Найти(СокрЛП(ТекПараметр.ИмяПараметра));
		Если Параметр=Неопределено Тогда
			НовПараметр = СхемаКомпоновки.Параметры.Добавить();
			НовПараметр.Имя = ТекПараметр.ИмяПараметра;
			
			НовПараметр.ДоступенСписокЗначений = ТекПараметр.ДоступенСписокЗначений;
			
			НовПараметр.ОграничениеИспользования = Истина;
			Если ТекПараметр.ЗначениеПараметра<>Неопределено Тогда
				НовПараметр.Значение = ТекПараметр.ЗначениеПараметра;
				НовПараметр.ТипЗначения = Новый ОписаниеТипов(МассивТипов);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
  	Хранилище = Новый ХранилищеЗначения(СхемаКомпоновки);
	
	ФорматОбъект.СхемаФорматирования = Хранилище;
	
КонецПроцедуры

Процедура УстановитьНачальныеЗначенияПолямЗапросаДопТЧ(СтрокаДанныхТЧ,ИмяТЧ,ИмяРеквизита)
	СтрокаДанныхТЧ.ДопТЧНачало = "ВЫБРАТЬ
	|	Т.ТабличнаяЧасть,
	|	Т.Объект Как СсылкаДокумента,
	|	Т.КолонкаТабличнойЧасти Как РеквизитТабличнойЧасти,
	|	Т.ТабличнаяЧасть.ИмяТабличнойЧасти Как ИмяТабличнойЧасти,
	|	Т.КолонкаТабличнойЧасти.ИмяКолонки КАК ИмяРеквизита,
	|	Т.НомерСтрокиДокумента,
	|	Т.Значение Как ЗначениеРеквизита
	|ПОМЕСТИТЬ СохраненныеЗначения
	|ИЗ
	|	РегистрСведений.ЗначенияКолонокДополнительныхТабличныхЧастей КАК Т
	|ГДЕ
	|	Т.Объект В (&Ссылка)
	|	И Т.ТабличнаяЧасть.ИмяТабличнойЧасти Подобно """+ИмяТЧ+"""
	|	И НЕ Т.ТабличнаяЧасть.ПометкаУдаления
	|	И НЕ Т.КолонкаТабличнойЧасти.ПометкаУдаления
	|;
	|";
	
	СтрокаДанныхТЧ.ДопТЧРеквизиты = "ВЫБРАТЬ
	|	ВложенныйЗапрос.НомерСтрокиДокумента КАК НомерСтроки,
	|	ВложенныйЗапрос.СсылкаДокумента КАК СсылкаДокумента";
	
	СтрокаДанныхТЧ.ДопТЧРеквизитыКонец = "
	|ПОМЕСТИТЬ ДопРекДопТЧ	
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		СохраненныеЗначения.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|		СохраненныеЗначения.СсылкаДокумента КАК СсылкаДокумента
	|	ИЗ
	|		СохраненныеЗначения КАК СохраненныеЗначения
	|) КАК ВложенныйЗапрос
	|";	
	Если НЕ СтрокаДанныхТЧ.ЭтоДопТЧ Тогда
		СтрокаДанныхТЧ.ДопТЧКонец = "
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДопРекДопТЧ КАК ДопРекДопТЧ
		|	ПО "+ИмяТЧ+".НомерСтроки = ДопРекДопТЧ.НомерСтроки
		|		И "+ИмяТЧ+".Ссылка = ДопРекДопТЧ.СсылкаДокумента";
	Иначе
		СтрокаДанныхТЧ.ДопТЧКонец = "
		|	ИЗ ДопРекДопТЧ КАК ДопРекДопТЧ";
		
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьДопРеквизит(СтрокаДанныхТЧ,ИмяТЧ,ИмяРеквизита)
	
	Номер = СтрокаДанныхТЧ.МассивИменДопРеквизитов.Количество();
	
	Если НЕ ЗначениеЗаполнено(СтрокаДанныхТЧ.ДопТЧНачало) Тогда
		УстановитьНачальныеЗначенияПолямЗапросаДопТЧ(СтрокаДанныхТЧ,ИмяТЧ,ИмяРеквизита);
	КонецЕсли;
	

	СтрокаДанныхТЧ.ДопТЧРеквизиты = СтрокаДанныхТЧ.ДопТЧРеквизиты + ","+ Символы.ПС+ "СохраненныеЗначения"+Номер+".ЗначениеРеквизита КАК "+ИмяРеквизита;
	
	СтрокаДанныхТЧ.ДопТЧРеквизитыКонец = СтрокаДанныхТЧ.ДопТЧРеквизитыКонец + Символы.ПС + "
	|		ЛЕВОЕ СОЕДИНЕНИЕ СохраненныеЗначения КАК СохраненныеЗначения"+Номер+"
	|		ПО ВложенныйЗапрос.НомерСтрокиДокумента = СохраненныеЗначения"+Номер+".НомерСтрокиДокумента
	|			И (СохраненныеЗначения"+Номер+".ИмяРеквизита Подобно """+ИмяРеквизита+""")
	|			И (СохраненныеЗначения"+Номер+".СсылкаДокумента = ВложенныйЗапрос.СсылкаДокумента)";
	
КонецПроцедуры

Процедура ОчиститьСхемуФорматирования(ФорматОбъект)
	
	ФорматОбъект.СхемаФорматирования = Новый ХранилищеЗначения(Неопределено);
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для формата ""%1"" не удалось сформировать схему компоновки данных.'"),ФорматОбъект.Наименование);
	ОбщегоНазначения.СообщитьПользователю(Текст);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьПравилаОбменаПоФормату(Формат) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.НомерСтроки,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ТипПоляФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОграничениеРазмерности,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОписаниеПоляФайлаПередачи,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПолеОбъекта,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПорядокЗаполнения,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ОбязательностьЗаполнения,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ТабличнаяЧасть,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Условие,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ДопДействия,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.СекцияПечати,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.ПеременнаяПечати,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка,
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Отключить
	               |ПОМЕСТИТЬ ТабФорматов
	               |ИЗ
	               |	Справочник.ФорматыОбменаБанкиКС.ПравилаОбмена КАК ФорматыОбменаБанкиКСПравилаОбмена
	               |ГДЕ
	               |	ФорматыОбменаБанкиКСПравилаОбмена.Ссылка = &ФорматОбмена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ОбрабатываемоеПоле,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ПолеФайла,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.НомерСтрокиПравил,
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.ПользовательскоеВыражение
	               |ПОМЕСТИТЬ ПереопределяемыеПоля
	               |ИЗ
	               |	РегистрСведений.ПользовательскиеВыраженияПолейФорматовОбмена КАК ПользовательскиеВыраженияПолейФорматовОбмена
	               |ГДЕ
	               |	ПользовательскиеВыраженияПолейФорматовОбмена.Использовать
	               |	И ПользовательскиеВыраженияПолейФорматовОбмена.ФорматОбмена = &ФорматОбмена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТабФорматов.Ссылка,
	               |	ТабФорматов.ПолеФайлаПередачи,
	               |	ТабФорматов.НомерСтроки КАК НомерСтроки,
	               |	ТабФорматов.ТипПоляФайлаПередачи,
	               |	ЕСТЬNULL(ТабФорматов.ТипПоляФайлаПередачи.ПравилоФорматирования, """") КАК ПравилоФорматирования,
	               |	ЕСТЬNULL(ТабФорматов.ТипПоляФайлаПередачи.ПравилоФорматированияИмпорт, """") КАК ПравилоФорматированияИмпорт,
	               |	ЕСТЬNULL(ТабФорматов.ТипПоляФайлаПередачи.СтрогоРавноМаксимальномуРазмеру, ЛОЖЬ) КАК СтрогоРавноМаксимальномуРазмеру,
	               |	ТабФорматов.ОграничениеРазмерности,
	               |	ТабФорматов.ОписаниеПоляФайлаПередачи,
	               |	ТабФорматов.ОбязательностьЗаполнения,
	               |	ТабФорматов.СекцияПечати,
	               |	ТабФорматов.ПеременнаяПечати,
	               |	ТабФорматов.ТабличнаяЧасть,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.ПолеОбъекта
	               |	КОНЕЦ КАК ПолеОбъекта,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.ПорядокЗаполнения
	               |	КОНЕЦ КАК ПорядокЗаполнения,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_Условие_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_Условие_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.Условие
	               |	КОНЕЦ КАК Условие,
	               |	ВЫБОР
	               |		КОГДА НЕ ПереопределяемыеПоля_ДопДействия_Номер.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ДопДействия_Номер.ПользовательскоеВыражение
	               |		КОГДА НЕ ПереопределяемыеПоля_ДопДействия_Ноль.ПользовательскоеВыражение ЕСТЬ NULL 
	               |			ТОГДА ПереопределяемыеПоля_ДопДействия_Ноль.ПользовательскоеВыражение
	               |		ИНАЧЕ ТабФорматов.ДопДействия
	               |	КОНЕЦ КАК ДопДействия
	               |ИЗ
	               |	ТабФорматов КАК ТабФорматов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПолеОбъекта_Номер.ОбрабатываемоеПоле = ""ПолеОбъекта"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ПолеОбъекта_Номер.НомерСтрокиПравил
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПолеОбъекта_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПолеОбъекта_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.ОбрабатываемоеПоле = ""ПолеОбъекта"")
	               |			И (ПереопределяемыеПоля_ПолеОбъекта_Ноль.НомерСтрокиПравил = 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПорядокЗаполнения_Номер.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ПорядокЗаполнения_Номер.НомерСтрокиПравил
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ПорядокЗаполнения_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.ОбрабатываемоеПоле = ""ПорядокЗаполнения"")
	               |			И (ПереопределяемыеПоля_ПорядокЗаполнения_Ноль.НомерСтрокиПравил = 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_Условие_Номер.ОбрабатываемоеПоле = ""Условие"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_Условие_Номер.НомерСтрокиПравил
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_Условие_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_Условие_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_Условие_Ноль.ОбрабатываемоеПоле = ""Условие"")
	               |			И (ПереопределяемыеПоля_Условие_Ноль.НомерСтрокиПравил = 0)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Номер
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Номер.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ДопДействия_Номер.ОбрабатываемоеПоле = ""ДопДействия"")
	               |			И ТабФорматов.НомерСтроки = ПереопределяемыеПоля_ДопДействия_Номер.НомерСтрокиПравил
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПереопределяемыеПоля КАК ПереопределяемыеПоля_ДопДействия_Ноль
	               |		ПО ((ВЫРАЗИТЬ(ТабФорматов.ПолеФайлаПередачи КАК СТРОКА(1000))) = (ВЫРАЗИТЬ(ПереопределяемыеПоля_ДопДействия_Ноль.ПолеФайла КАК СТРОКА(1000))))
	               |			И (ПереопределяемыеПоля_ДопДействия_Ноль.ОбрабатываемоеПоле = ""ДопДействия"")
	               |			И (ПереопределяемыеПоля_ДопДействия_Ноль.НомерСтрокиПравил = 0)
	               |ГДЕ
	               |	ТабФорматов.Отключить = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
					
	Запрос.УстановитьПараметр("ФорматОбмена",Формат);
	Результат = Запрос.Выполнить().Выгрузить();
		
	ТаблицаНастройкаПолейФайла = Формат.НастройкаПолейФайла;
	Если Формат.НаправлениеОбмена <> Перечисления.НаправлениеОбменаБанкиКС.Импорт Или ТаблицаНастройкаПолейФайла.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ОбработанныеПравила = Результат.Скопировать(Новый Массив);
	
	Для Каждого Правило Из Результат Цикл
		
		НовыеПолеФайла = ПолучитьИменаПоляФайла(Правило.ПолеФайлаПередачи, ТаблицаНастройкаПолейФайла);
		Для Каждого НовоеПолеФайла Из НовыеПолеФайла Цикл
			НовоеПравило = ОбработанныеПравила.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеПравило, Правило);
			НовоеПравило.ПолеФайлаПередачи = НовоеПолеФайла;
		КонецЦикла;
			
	КонецЦикла;
		
	Возврат ОбработанныеПравила;	
	
КонецФункции

Функция ПолучитьИменаПоляФайла(Знач Источник, ТаблицаНастройки)
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		Источник = ОбщегоНазначенияБГУ.Массив(Источник);
	КонецЕсли;
	
	Результат = Новый Массив;
	ЕстьПараметры = Ложь;
	
	Для Каждого ПолеФайла Из Источник Цикл
		
		Если Найти(ПолеФайла,"%")>0 Тогда
			
			НачПоз = Найти(ПолеФайла,"%");			
			КонПоз = Найти(Сред(ПолеФайла,НачПоз+1),"%");
			
			ЗаменяемыйБлок = Сред(ПолеФайла,НачПоз+1,КонПоз-1);
			
			МассивИскомыхСтрок = ТаблицаНастройки.НайтиСтроки(Новый Структура("ИмяПараметра",ЗаменяемыйБлок));
			
			Если МассивИскомыхСтрок.Количество() > 0 Тогда 
				Для Каждого СтрТЧ Из МассивИскомыхСтрок Цикл
					НовоеПолеФайла = СтрЗаменить(ПолеФайла, "%" + ЗаменяемыйБлок + "%", СтрТЧ.ЗначениеПараметра); 
					Результат.Добавить(НовоеПолеФайла);
				КонецЦикла;
			Иначе
				НовоеПолеФайла = СтрЗаменить(ПолеФайла, "%" + ЗаменяемыйБлок + "%", ЗаменяемыйБлок); 
				Результат.Добавить(НовоеПолеФайла);
			КонецЕсли;
			
			ЕстьПараметры = Истина;
			
		Иначе
			Результат.Добавить(ПолеФайла);
		КонецЕсли;
				
	КонецЦикла;
	
	Если ЕстьПараметры Тогда
		Результат = ПолучитьИменаПоляФайла(Результат, ТаблицаНастройки);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьФорматПоВладельцуНаправлениюНаименованию(Владелец,НаправлениеОбмена,НаименованиеФормата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ Первые 1
	               |	ФорматыОбменаБанкиКС.Ссылка
	               |ИЗ
	               |	Справочник.ФорматыОбменаБанкиКС КАК ФорматыОбменаБанкиКС
	               |ГДЕ
	               |	ФорматыОбменаБанкиКС.Владелец = &Владелец
	               |	И ФорматыОбменаБанкиКС.НаправлениеОбмена = &НаправлениеОбмена
	               |	И ФорматыОбменаБанкиКС.Наименование = &Наименование";
				   
				   
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("НаправлениеОбмена", НаправлениеОбмена);
	Запрос.УстановитьПараметр("Наименование", НаименованиеФормата);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.ФорматыОбменаБанкиКС.ПустаяСсылка();
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////

Процедура ПереформироватьСхемуФорматовСВложеннымиТаблицами() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Ссылка
		|ПОМЕСТИТЬ ИдентМет
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.ЗначениеПустойСсылки В(&ПустыеСсылки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФорматыОбменаБанкиКС.Ссылка,
		|	ФорматыОбменаБанкиКС.СхемаФорматирования
		|ИЗ
		|	Справочник.ФорматыОбменаБанкиКС КАК ФорматыОбменаБанкиКС
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИдентМет КАК ИдентМет
		|		ПО ФорматыОбменаБанкиКС.ИдентификаторОбъекта = ИдентМет.Ссылка
		|ГДЕ
		|	ФорматыОбменаБанкиКС.НаправлениеОбмена = &НаправлениеОбмена
		|	И ФорматыОбменаБанкиКС.НеобходимаКонвертация = ЛОЖЬ
		|	И ФорматыОбменаБанкиКС.ПометкаУдаления = ЛОЖЬ";

	ПустыеСсылки = Новый Массив;
	ПустыеСсылки.Добавить(Документы.КаталогГосУслуг.ПустаяСсылка());
	ПустыеСсылки.Добавить(Документы.РегистрацияОбязательствИСведенийПоДоговорам.ПустаяСсылка());
	
	
	Запрос.УстановитьПараметр("ПустыеСсылки", ПустыеСсылки);
	Запрос.УстановитьПараметр("НаправлениеОбмена", Перечисления.НаправлениеОбменаБанкиКС.Экспорт);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СхемаФорматирования.Получить() <> Неопределено Тогда
			ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СформироватьСхемуФормированияОбмена_Новый(ТекОбъект,Ложь);
			ТекОбъект.ДополнительныеСвойства.Вставить("НеФормироватьСКД");
			ТекОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление = "" + ?(ЗначениеЗаполнено(Данные.КраткоеНаименование),Данные.КраткоеНаименование,Данные.Наименование);
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Наименование");
	Поля.Добавить("КраткоеНаименование");
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти
