
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает признаки учета по направлениям деятельности и по подразделениям
// на счете основного производства.
// Если счет 109.60 групповой, то используется счет 109.61.
// При проверке учета по подразделениям учитывается значение функциональной опции
// "Вести учет по подразделениям".
//
// Параметры:
//  Дата		 - Дата - дата для получения счета.
//  Организация	 - СправочникСсылка.Организации - организация для получения счета.
// 
// Возвращаемое значение:
// Структура - содержит ключи:
//	* ЕстьНаправлениеДеятельности - Булево - на счете есть субконто "НаправленияДеятельности".
//	* УчетПоПодразделениям - Булево - на счете ведется учет по подразделениям.
//
Функция ПризнакиУчетаСчетаПроизводства(СчетПроизводства) Экспорт

	Результат = Новый Структура("ЕстьНаправлениеДеятельности, УчетПоПодразделениям", Ложь, Ложь);
	
	Если Не ЗначениеЗаполнено(СчетПроизводства) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат.ЕстьНаправлениеДеятельности = БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(СчетПроизводства,
		ПланыВидовХарактеристик.ВидыСубконто.НаправленияДеятельности);
		
	Результат.УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетПроизводства).УчетПоПодразделениям;
		
	Возврат Результат;

КонецФункции

// Возвращает счет 109.60 или 109.61.
//
// Параметры:
//  Дата		 - Дата - дата для получения счета.
//  Организация	 - СправочникСсылка.Организации - организация для получения счета.
// 
// Возвращаемое значение:
// ПланСчетовСсылка.ЕПСБУ - счет основного производства.
//
Функция СчетОсновногоПроизводства(Дата, Организация) Экспорт

	Счет10960 = БухгалтерскийУчет.СчетПоКоду("109.60", Дата, Организация);
	
	Если БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет10960).ЭлементГруппа Тогда
		Возврат БухгалтерскийУчет.СчетПоКоду("109.61", Дата, Организация);
	Иначе
		Возврат Счет10960;
	КонецЕсли;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
