
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КоличествоЗнаковДробнойЧастиДляСкидки = 2;
		Объект.РежимОкругленияРезультатаДляСкидки = 2;
	КонецЕсли;	

	ЭлементОтбора = ТопливныеКарты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Объект.Организация;
	
	ЭлементОтбора = ТопливныеКарты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДоговораПоставкиГСМ");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
	НастройкаЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СформироватьСписокВыбораНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	СформироватьСписокВыбораНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	СформироватьСписокВыбораНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРасчетаЦенПриИзменении(Элемент)
	НастройкаЭлементовФормы();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СформироватьСписокВыбораНаименований()
	
	СписокВыбора = Элементы.Наименование.СписокВыбора;
	
	СписокВыбора.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		СписокВыбора.Добавить(СокрЛП(Объект.Контрагент));
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			ВариантНаименования = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2'"),
				СокрЛП(Объект.Контрагент), СокрЛП(Объект.Договор));
			СписокВыбора.Добавить(ВариантНаименования);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаЭлементовФормы()
	ВидимостьСкидки = Ложь;
	ВидимостьЦены = Истина;
	Если Объект.СпособОпределенияЦен = 0 Тогда
		ВидимостьСкидки = Ложь;
		ВидимостьЦены = Истина;
	ИначеЕсли Объект.СпособОпределенияЦен = 1 Тогда
		ВидимостьСкидки = Истина;
		ВидимостьЦены = Ложь;
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЦеныЦена", "Видимость", ВидимостьЦены);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЦеныСкидкаОтРозничнойЦены", "Видимость", ВидимостьСкидки);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаНастройкиРасчетаЦен", "Видимость", ВидимостьСкидки);
КонецПроцедуры

