
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздаваемыйДокумент = ДоступныеПоля.ПолучитьЭлементы().Добавить();	
	СоздаваемыйДокумент.Имя = "Квитанция на оплату госуслуг";
	СоздаваемыйДокумент.ПутьКДанным = "Документ";
	ПлатежноРасчетныеДокументы.ИнициализироватьДоступныеПоля("КвитанцияНаОплатуГосуслуг",СоздаваемыйДокумент);
	
	ОрганизацияДок = ДоступныеПоля.ПолучитьЭлементы().Добавить();	
	ОрганизацияДок.Имя = "Организация";
	ОрганизацияДок.ПутьКДанным = "Организация";
	ПлатежноРасчетныеДокументы.ИнициализироватьДоступныеПоля("Организации",ОрганизацияДок,"Справочник");

	ДатаДок = ДоступныеПоля.ПолучитьЭлементы().Добавить();	
	ДатаДок.Имя = "Дата документа";
	ДатаДок.ПутьКДанным = "ДатаДокумента";	
	
	ДатаДокГод = ДатаДок.ПолучитьЭлементы().Добавить();	
	ДатаДокГод.Имя = "Год (2 знака)";
	ДатаДокГод.ПутьКДанным = "Год";
	
	ДатаДокМесяц = ДатаДок.ПолучитьЭлементы().Добавить();	
	ДатаДокМесяц.Имя = "Месяц (2 знака)";
	ДатаДокМесяц.ПутьКДанным = "Месяц";
	
	ДатаДокДень = ДатаДок.ПолучитьЭлементы().Добавить();	
	ДатаДокДень.Имя = "День (2 знака)";
	ДатаДокДень.ПутьКДанным = "День";
	
	АлгоритмыУникальногоКода = ДоступныеПоля.ПолучитьЭлементы().Добавить();
	АлгоритмыУникальногоКода.Имя = "Алгоритмы формирования уникального кода";
	АлгоритмыУникальногоКода.ПутьКДанным = "Алгоритм";
	
    АлгоритмУникальногоКода14 = АлгоритмыУникальногоКода.ПолучитьЭлементы().Добавить();
	АлгоритмУникальногоКода14.Имя = "12-символьный уникальный код";
	АлгоритмУникальногоКода14.ПутьКДанным = "Алгоритм12";
	
	АлгоритмУникальногоКода13 = АлгоритмыУникальногоКода.ПолучитьЭлементы().Добавить();
	АлгоритмУникальногоКода13.Имя = "13-символьный уникальный код";
	АлгоритмУникальногоКода13.ПутьКДанным = "Алгоритм13";
	
	КонтрольныйРазряд = ДоступныеПоля.ПолучитьЭлементы().Добавить();	
	КонтрольныйРазряд.Имя = "Контрольный разряд (формат 1.16)";
	КонтрольныйРазряд.ПутьКДанным = "КонтрольныйРазряд_1_16";
	
    КонтрольныйРазряд = ДоступныеПоля.ПолучитьЭлементы().Добавить();	
	КонтрольныйРазряд.Имя = "Контрольный разряд (формат 1.15)";
	КонтрольныйРазряд.ПутьКДанным = "КонтрольныйРазряд";
	Дерево = РеквизитФормыВЗначение("ДоступныеПоля");
	НайденнаяСтрока = Дерево.Строки.Найти("КонтактнаяИнформация","ПутьКДанным",Истина);
	Если НайденнаяСтрока<>Неопределено Тогда
		НайденнаяСтрока.Родитель.Строки.Удалить(НайденнаяСтрока);
	КонецЕсли;
	ЗначениеВРеквизитФормы(Дерево,"ДоступныеПоля");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеПоля

&НаКлиенте
Процедура ДоступныеПоляВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьДоступноеПоле(Элемент);	
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеПоляВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьДоступноеПоле(Элемент);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьДоступноеПоле(Элемент)
	Путь = "";
	ТекСтр = Элемент.ТекущиеДанные;

	Если ТекСтр<>Неопределено Тогда
		Путь = ТекСтр.ПутьКДанным;
		Родитель = ТекСтр.ПолучитьРодителя();
		Пока Родитель<>Неопределено Цикл			
			Если Родитель.ПутьКДанным + "." = Лев(Путь,СтрДлина(Родитель.ПутьКДанным+".")) Тогда
				//Ищем родителя на уровень выше;
			Иначе
				Путь = Родитель.ПутьКДанным + "." + Путь;
			КонецЕсли;
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
		//Если Лев(Путь,12) = "Организация." Тогда
		//	Путь = "Документ."+Путь;
		//КонецЕсли;
	КонецЕсли;
	Если Путь = "Алгоритм" ИЛИ Путь = "ДатаДокумента" Тогда
		Возврат;
	КонецЕсли;
	
	ВозвращаемаяСтруктура = Новый Структура;
	ВозвращаемаяСтруктура.Вставить("Путь",Путь);
	Длина = 0;
	Символ = "";
	Если Путь = "КонтрольныйРазряд" Тогда
		Длина = 1;
		Символ = "K"
	ИначеЕсли Путь = "Алгоритм.Алгоритм13" Тогда
		Длина = 13;
		Символ = "N";
	ИначеЕсли Путь = "Алгоритм.Алгоритм12" Тогда
		Длина = 12;
		Символ = "N";
	ИначеЕсли Путь = "ДатаДокумента.Год" Тогда
		Длина = 2;
		Символ = "г";
	ИначеЕсли Путь = "ДатаДокумента.Месяц" Тогда
		Длина = 2;
		Символ = "М";
    ИначеЕсли Путь = "ДатаДокумента.День" Тогда
		Длина = 2;
		Символ = "д";
	КонецЕсли;	
	ВозвращаемаяСтруктура.Вставить("Длина",Длина);	
	ВозвращаемаяСтруктура.Вставить("Символ",Символ);	
	Закрыть(ВозвращаемаяСтруктура);	
	
КонецПроцедуры

#КонецОбласти
