
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОбработкаСвертки") Тогда
		ОбработкаСвертки = Параметры.ОбработкаСвертки;
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСверткиИБ_Новый	= Константы.ПараметрыСверткиИБ.Получить().Получить();
	ПараметрыСверткиИБ_Старый	= Константы.СтатусСверткиИнформационнойБазы.Получить().Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Если это повторное открытие, то повторно выбирать не нужно.
	// Ранее выбранную способ определяем по сохраненным настройкам.
	
	ВыбранныйСпособ = 0;
	
	Если ПараметрыСверткиИБ_Новый <> Неопределено
		И ТипЗнч(ПараметрыСверткиИБ_Новый) = Тип("Структура")
		И ПараметрыСверткиИБ_Новый.Свойство("НомерСтраницы")
		И ПараметрыСверткиИБ_Новый.НомерСтраницы > 0 Тогда
		
		ВыбранныйСпособ = 1;
		
	ИначеЕсли ПараметрыСверткиИБ_Старый <> Неопределено
		И ТипЗнч(ПараметрыСверткиИБ_Старый) = Тип("Структура")
		И ПараметрыСверткиИБ_Старый.Свойство("ТекущийЭтапСвертки")
		И ПараметрыСверткиИБ_Старый.ТекущийЭтапСвертки > 0 Тогда
		
		ВыбранныйСпособ = 2;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВыбранныйСпособ = 1 Тогда
		Отказ = Истина;
		ОткрытьФорму("Обработка.СверткаИнформационнойБазыОстатками.Форма");
	ИначеЕсли ВыбранныйСпособ = 2 Тогда
		Отказ = Истина;
		ОткрытьФорму("Обработка.СверткаИнформационнойБазы.Форма");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Декорация2ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОткрытьОписаниеПодхода" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьСправку("Обработка.СверткаИнформационнойБазыОстатками.Форма.Старт");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборСпособа(Команда)
	
	Если ОбработкаСвертки = 0 Тогда
		ОткрытьФорму("Обработка.СверткаИнформационнойБазыОстатками.Форма");
		Закрыть();
	ИначеЕсли ОбработкаСвертки = 1 Тогда
		ОткрытьФорму("Обработка.СверткаИнформационнойБазы.Форма");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
