#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Параметры.Свойство("Номенклатура") И ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		Параметры.Отбор.Вставить("Владелец", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Номенклатура, "БСО"));
		Параметры.Удалить("Номенклатура");
		СтандартнаяОбработка = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли