#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Доверенность (М-2)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Доверенность";
	КомандаПечати.Идентификатор = "М2";
	КомандаПечати.Представление = НСтр("ru = 'Доверенность (М-2)'");
	КомандаПечати.ДополнительныеПараметры.Вставить("Форма", "М-2"); 
	
	// Доверенность (М-2а)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.Доверенность";
	КомандаПечати.Идентификатор = "М2а";
	КомандаПечати.Представление = НСтр("ru = 'Доверенность (М-2а)'");
    КомандаПечати.ДополнительныеПараметры.Вставить("Форма", "М-2а"); 

КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М2") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"М2", "М-2", ПечатьДоверенности(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "М2а") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,	"М2а", "М-2а", ПечатьДоверенности(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;

КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьДоверенности(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Доверенность_М2";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Доверенность.ПФ_MXL_М2");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доверенность.Номер КАК НомерДокумента,
	|	Доверенность.Дата КАК ДатаДокумента,
	|	Доверенность.ДатаДействия КАК СрокДействия,
	|	Доверенность.Организация КАК УчреждениеСсылка,
	|	Доверенность.Организация.Наименование КАК УчреждениеНаименование,
	|	Доверенность.Организация.НаименованиеПолное КАК УчреждениеПредставление,
	|	Доверенность.Организация.КодОКПО КАК КодПоОКПО,
	|	Доверенность.Организация.ИНН КАК УчреждениеИНН,
	|	Доверенность.Организация.КПП КАК УчреждениеКПП,
	|	Доверенность.ЛицевойСчет КАК ЛицевойСчет,
	|	Доверенность.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	Доверенность.Сотрудник КАК СотрудникСсылка,
	|	Доверенность.Сотрудник.Контрагент КАК СотрудникКонтрагентСсылка,
	|	Доверенность.Руководитель КАК РуководительСсылка,
	|	Доверенность.ГлавныйБухгалтер КАК ГлавныйБухгалтерСсылка,
	|	Доверенность.Контрагент КАК ПоставщикСсылка,
	|	ВЫБОР
	|		КОГДА Доверенность.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА Доверенность.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ Доверенность.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА Доверенность.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ Доверенность.Контрагент.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ Доверенность.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК ПоставщикНаименование,
	|	Доверенность.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮрФизЛицо,
	|	Доверенность.Плательщик КАК ПлательщикСсылка,
	|	Доверенность.ПлательщикОрганизация КАК ПлательщикУчреждение,
	|	ВЫБОР
	|		КОГДА Доверенность.Плательщик.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА Доверенность.Плательщик.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ Доверенность.Плательщик.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА Доверенность.Плательщик.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ Доверенность.Плательщик.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ Доверенность.Плательщик.НаименованиеСокращенное
	|	КОНЕЦ КАК ПлательщикНаименование,
	|	Доверенность.Плательщик.ЮридическоеФизическоеЛицо КАК ПлательщикЮрФизЛицо,
	|	Доверенность.Плательщик.Представление КАК ПлательщикПредставление,
	|	Доверенность.БанковскийСчетОрганизации КАК БанковскийСчет,
	|	Доверенность.НаПолучениеОт КАК ПоставщикПредставление,
	|	Доверенность.ПоДокументу КАК ПоДокументу,
	|	Доверенность.НомерДокумента КАК НомерНаряда,
	|	Доверенность.ДатаДокумента КАК ДатаНаряда,
	|	Доверенность.Ссылка КАК Ссылка,
	|	Доверенность.Товары.(
	|		НомерСтроки КАК Номер,
	|		НаименованиеТовара КАК ЦеннностиПредставление,
	|		ЕдиницаИзмерения.Представление,
	|		Количество
	|	)
	|ИЗ
	|	Документ.Доверенность КАК Доверенность
	|ГДЕ
	|	Доверенность.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Номер";
		
	ПервыйДокумент = Истина;	
		
	Шапка = Запрос.Выполнить().Выбрать();
	
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			// Все документы нужно выводить на разных страницах.
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		ВыборкаСтрокТовары = Шапка.Товары.Выбрать();
		
		ОбластьМакетаОтрез = Макет.ПолучитьОбласть("Отрез");
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ФИОДоверенного               = "";
		ДолжностьДоверенного         = "";
		ФамилияИмяОчествоДоверенного = "";
		Если ЗначениеЗаполнено(Шапка.СотрудникСсылка) Тогда
			СтруктураРеквизитовСотрудника = Новый Структура("СсылкаНаОбъект,Период,Должность,Фамилия,Имя,Отчество", Шапка.СотрудникСсылка, Шапка.ДатаДокумента);
		   	Справочники.Сотрудники.ПолучитьДанныеСотрудника(СтруктураРеквизитовСотрудника);
            ДанныеДокумента = ПолучитьДокументыФизЛиц(Шапка.СотрудникКонтрагентСсылка.ЮридическоеФизическоеЛицо,Шапка.ДатаДокумента);
			Если ЗначениеЗаполнено(ДанныеДокумента) Тогда
				ОбластьМакетаШапка.Параметры.Заполнить(ДанныеДокумента);
			КонецЕсли;
			ФИОДоверенного               = "" + СтруктураРеквизитовСотрудника.Должность + " " + Справочники.Сотрудники.ФамилияИО(Шапка.СотрудникСсылка, Истина, Шапка.ДатаДокумента);
			ДолжностьДоверенного         = СтруктураРеквизитовСотрудника.Должность;
			ФамилияИмяОчествоДоверенного = СтруктураРеквизитовСотрудника.Фамилия + " " + СтруктураРеквизитовСотрудника.Имя + " " + СтруктураРеквизитовСотрудника.Отчество;
		КонецЕсли;	
		
		Если ПараметрыПечати.Форма = "М-2" тогда
			КодПоОКУД = "0315001";
			ОбластьМакетаОтрез.Параметры.Заполнить(Шапка);
			
			СтруктураОбластьМакетаОтрез = Новый Структура("ФИОДоверенного,РеквизитыНаряда,НомерДокумента");
			СтруктураОбластьМакетаОтрез.ФИОДоверенного 	= ФИОДоверенного;
			СтруктураОбластьМакетаОтрез.РеквизитыНаряда = СформироватьСтроку_ПоДокументу(Шапка.ПоДокументу, Шапка.НомерНаряда, Шапка.ДатаНаряда);
			СтруктураОбластьМакетаОтрез.НомерДокумента 	= ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Шапка.Ссылка, Шапка.НомерДокумента);
			ОбластьМакетаОтрез.Параметры.Заполнить(СтруктураОбластьМакетаОтрез);
			
			ТабДокумент.Вывести(ОбластьМакетаОтрез);
			НазваниеФормы = "Типовая межотраслевая форма № М-2";
		Иначе
			КодПоОКУД = "0315002";
			НазваниеФормы = "Типовая межотраслевая форма № М-2а";
		КонецЕсли;	
		
		ОбластьМакетаШапка.Параметры.Заполнить(Шапка);
		СтруктураОбластьМакетаШапка = Новый Структура("НазваниеФормы,КодПоОКУД,НомерДокумента,РеквизитыПотребителя,РеквизитыПлательщика,РеквизитыСчета",НазваниеФормы,КодПоОКУД);
		
		Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Шапка.УчреждениеСсылка, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		Если Не ПустаяСтрока(Шапка.УчреждениеПредставление) Тогда
			НазвОрг	= Шапка.УчреждениеПредставление;
		Иначе
			НазвОрг	= Шапка.УчреждениеНаименование;
		КонецЕсли;

		СтруктураОбластьМакетаШапка.РеквизитыПотребителя = "" + НазвОрг + ", ИНН: " + Шапка.УчреждениеИНН + ", КПП: " + Шапка.УчреждениеКПП + ", адрес: " + Адрес;
							
		// Заполним данные плательщика
		СтруктураСчетаПлательщика = "";
		Если Шапка.ПлательщикУчреждение Тогда
			СтруктураОбластьМакетаШапка.РеквизитыПлательщика = "" + НазвОрг +", ИНН: " + Шапка.УчреждениеИНН + ", КПП: " + Шапка.УчреждениеКПП + ", адрес: " + Адрес;
			
			СтруктураСчетаПлательщика = Новый Структура("ИННПлательщика, КПППлательщика, ТекстПлательщика, НомерСчетаПлательщика, НаименованиеБанкаПлательщика, БикБанкаПлательщика, СчетБанкаПлательщика", "ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(Шапка.ЛицевойСчет, Шапка.РеквизитыЛицевогоСчета, СтруктураСчетаПлательщика);
		Иначе						
			РеквизитыПлательщика = "";
			Если ЗначениеЗаполнено(Шапка.ПлательщикСсылка) Тогда
				
				НаименованиеПлательщика = Шапка.ПлательщикНаименование;
				
				Адрес = Справочники.Контрагенты.ПолучитьКонтактнуюИнформацию(Шапка.ПлательщикСсылка, Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты);
						
				РеквизитыПлательщика = "" + НаименованиеПлательщика + ", адрес: " + Адрес; 

			КонецЕсли;	
			СтруктураОбластьМакетаШапка.РеквизитыПлательщика = РеквизитыПлательщика;
			
			Если ЗначениеЗаполнено(Шапка.БанковскийСчет) Тогда
				СтруктураСчетаПлательщика = Новый Структура("ИННПлательщика, КПППлательщика, ТекстПлательщика, НомерСчетаПлательщика, НаименованиеБанкаПлательщика, БикБанкаПлательщика, СчетБанкаПлательщика", "ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
				ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(Шапка.БанковскийСчет,Шапка.БанковскийСчет,СтруктураСчетаПлательщика);
			КонецЕсли;	
						
			РеквизитыПлательщика = "" + НаименованиеПлательщика +
			?(ЗначениеЗаполнено(СтруктураСчетаПлательщика), ", ИНН: " + СтруктураСчетаПлательщика.ИННПлательщика + ", КПП: " + СтруктураСчетаПлательщика.КПППлательщика, "") +
			", адрес: " + Адрес; 

			СтруктураОбластьМакетаШапка.РеквизитыПлательщика = РеквизитыПлательщика;

			
		КонецЕсли;	
		
		РеквизитыСчета = "";
		Если ЗначениеЗаполнено(СтруктураСчетаПлательщика) Тогда
			РеквизитыСчета = "" + СтруктураСчетаПлательщика.НомерСчетаПлательщика + " в "
								+ СтруктураСчетаПлательщика.НаименованиеБанкаПлательщика + ", БИК "
								+ СтруктураСчетаПлательщика.БикБанкаПлательщика + ", к/с "
								+ СтруктураСчетаПлательщика.СчетБанкаПлательщика;
		КонецЕсли;						

		СтруктураОбластьМакетаШапка.РеквизитыСчета = РеквизитыСчета;
		
		ТребуемыеДанные = Новый Структура("СсылкаНаОбъект, Период, УдостоверениеЛичности",Шапка.СотрудникКонтрагентСсылка,Шапка.ДатаДокумента);
		Справочники.Контрагенты.ПолучитьДанныеКонтрагента(ТребуемыеДанные);
		ОбластьМакетаШапка.Параметры.Заполнить(ТребуемыеДанные);
		
		СтруктураОбластьМакетаШапка.Вставить("ДолжностьДоверенного", ДолжностьДоверенного);
		СтруктураОбластьМакетаШапка.Вставить("ФамилияИмяОчествоДоверенного", ФамилияИмяОчествоДоверенного);
		СтруктураОбластьМакетаШапка.Вставить("РеквизитыДокументаНаПолучение", СформироватьСтроку_ПоДокументу(Шапка.ПоДокументу, Шапка.НомерНаряда, Шапка.ДатаНаряда));
		СтруктураОбластьМакетаШапка.НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Шапка.Ссылка,Шапка.НомерДокумента);
		ОбластьМакетаШапка.Параметры.Заполнить(СтруктураОбластьМакетаШапка);
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
		
		Пока ВыборкаСтрокТовары.Следующий() Цикл
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрокТовары);
			СтруктураОбластьМакетаСтрока = Новый Структура("КоличествоПрописью");
			СтруктураОбластьМакетаСтрока.КоличествоПрописью = ?(ВыборкаСтрокТовары.Количество = 0,
														   "",
														   Строка(ВыборкаСтрокТовары.Количество) + " (" + 
														   КоличествоПрописью(ВыборкаСтрокТовары.Количество) + ")");
			ОбластьМакетаСтрока.Параметры.Заполнить(СтруктураОбластьМакетаСтрока);											   
			ТабДокумент.Вывести(ОбластьМакетаСтрока);											   
		КонецЦикла;	
		
		СтруктураОбластьМакетаПодвал = Новый Структура("ФИОРуководителя,ФИОГлавногоБухгалтера");											   
		СтруктураОбластьМакетаПодвал.ФИОРуководителя = Справочники.Сотрудники.ФамилияИО(Шапка.РуководительСсылка, Истина,Шапка.ДатаДокумента);
		СтруктураОбластьМакетаПодвал.ФИОГлавногоБухгалтера = Справочники.Сотрудники.ФамилияИО(Шапка.ГлавныйБухгалтерСсылка, Истина,Шапка.ДатаДокумента);
		ОбластьМакетаПодвал.Параметры.Заполнить(СтруктураОбластьМакетаПодвал);
		
		ТабДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно. 
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьДоверенности()

// Стандартная функция форматирования прописи количества
//
// Параметры:
//  Количество - число, которое мы хотим форматировать
//  Род - строка, грамматический род предмета форматирования, используется 
//        для целых чисел. Принимает значение "м", "ж", "с"
//
// Возвращаемое значение:
//  Отформатированная должным образом строковое представление количества.
//
Функция КоличествоПрописью(Количество,Род=" ") 

	ЦелаяЧасть   = Цел(Количество);
	ДробнаяЧасть = Окр(Количество - ЦелаяЧасть, 3);

	Если ДробнаяЧасть = Окр(ДробнаяЧасть,0) Тогда
		ПараметрыПрописи = ", , , "+Род+", , , , , 0";

	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 1) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, десятая, десятых, десятых, м, 1";

	ИначеЕсли ДробнаяЧасть = Окр(ДробнаяЧасть, 2) Тогда
		ПараметрыПрописи = "целая, целых, целых, ж, сотая, сотых, сотых, м, 2";

	Иначе
		ПараметрыПрописи = "целая, целых, целых, ж, тысячная, тысячных, тысячных, м, 3";

	КонецЕсли;

	Возврат ЧислоПрописью(Количество, ,ПараметрыПрописи);

КонецФункции // КоличествоПрописью()

Функция СформироватьСтроку_ПоДокументу(Наряд, НомерНаряда, ДатаНаряда)
	Результат = "";
	Если ЗначениеЗаполнено(Наряд) Тогда
		Результат = Результат + Наряд;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(НомерНаряда) Тогда
		Результат = Результат + " № " + НомерНаряда;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДатаНаряда) Тогда
		Результат = Результат + " от " + Формат(ДатаНаряда, "ДФ=dd.MM.yyyy");
	КонецЕсли;	
	
	Возврат(Результат);
КонецФункции	

Функция ПолучитьДокументыФизЛиц(ФизЛицо,Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыФизическихЛицСрезПоследних.Серия КАК ДокументСерия,
		|	ДокументыФизическихЛицСрезПоследних.Номер КАК ДокументНомер,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДокументДатаВыдачи,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК ДокументКемВыдан,
		|	ДокументыФизическихЛицСрезПоследних.Период
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			&Дата,
		|			ЯвляетсяДокументомУдостоверяющимЛичность
		|				И Физлицо = &ФизЛицо) КАК ДокументыФизическихЛицСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДокументыФизическихЛицСрезПоследних.Период УБЫВ";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
