&НаКлиенте
Перем ПеренестиВДокумент;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем ЗначениеСвойства;
	
	ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
	
	Организация = Параметры.Организация;
	ДокументОснование = Параметры.Ссылка;

	Приложения = Новый Массив;
	
	ПриложенныеДокументыДляЭДО = ПриложенныеДокументыДляЭДО(ДокументОснование);
	ИспользуетсяПОД = ЭлектронныеДокументыБГУ.ИспользуетсяПОД();
	
	Для каждого Строка Из ПриложенныеДокументыДляЭДО Цикл
		Документ = Новый Структура;
		Документ.Вставить("ВидСведений");
		Документ.Вставить("ПрисоединенныйФайл");
		Документ.Вставить("НаименованиеДокументаФайла");
		
		ЗаполнитьЗначенияСвойств(Документ, Строка);
		Приложения.Добавить(Документ);
	КонецЦикла;
	
	// Формируем список расширений.
	ЧастиСтроки = Новый Массив;
	Часть = НСтр("ru='Допускается прикладывать файлы с расширениями'") + " ";
	ЧастиСтроки.Добавить(Часть);
	ДопустимыеРасширения = ДопустимыеРасширенияПриложенныхФайлов();
	Для каждого Расширение Из ДопустимыеРасширения Цикл
		Часть = Новый ФорматированнаяСтрока(Расширение, Новый Шрифт( , , Истина));
		ЧастиСтроки.Добавить(Часть);
		Часть = ", ";
		ЧастиСтроки.Добавить(Часть);
	КонецЦикла;
	Если ЧастиСтроки[ЧастиСтроки.Количество() - 1] = ", " Тогда
		ЧастиСтроки[ЧастиСтроки.Количество() - 1] =  ".";
	КонецЕсли;
	
	Элементы.ДекорацияОписание.Заголовок = Новый ФорматированнаяСтрока(ЧастиСтроки);
	
	Для каждого Вложение Из Приложения Цикл
		Если ЗначениеЗаполнено(Вложение.ПрисоединенныйФайл) Тогда
			Строка = ПриложенныеДокументы.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Вложение);
			ЗаполнитьДанныеСтроки(Строка, Вложение.ПрисоединенныйФайл);
		КонецЕсли;	
	КонецЦикла;
	
	МаксимальныйРазмерФайла = МаксимальныйРазмерПриложенногоФайлаВБайтах();
	МаксимальныйРазмерФайлов = МаксимальныйОбщийРазмерПриложенныхФайловВБайтах();
	
	ПравоЧтенияВнутреннегоЭДО = ПравоДоступа("Чтение", Метаданные.Документы.ВнутреннийЭлектронныйДокумент, Пользователи.ТекущийПользователь());
	УсловиеВидимостиКоманд = ?(ИспользуетсяПОД, Истина, ПравоЧтенияВнутреннегоЭДО); 
	
	Для Каждого ТекСтрока Из Параметры.КодыДополнительныхКоманд Цикл
		Если ТекСтрока = 1 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтотОбъект.Элементы,
				"ДобавитьИнвКарточкиИзВнутреннегоЭДО", "Видимость", НЕ ИспользуетсяПОД);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтотОбъект.Элементы,
				"ДобавитьФайлыИнвентарныеКарточкиДляРегистраУчета", "Видимость", УсловиеВидимостиКоманд);
		КонецЕсли;	
		Если ТекСтрока = 2 Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтотОбъект.Элементы,
				"ДобавитьКарточкиКапвложенийИзВнутреннегоЭДО", "Видимость", НЕ ИспользуетсяПОД);
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтотОбъект.Элементы,
				"ДобавитьФайлыКарточкиКапвложенийДляРегистраУчета", "Видимость", УсловиеВидимостиКоманд);
		КонецЕсли;	
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДанныеДляКлиента = Новый Структура("ДопустимыеРасширения", ДопустимыеРасширенияПриложенныхФайлов());
	ПроверитьПриложенныеДокументыРасчетРазмера();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если ПеренестиВДокумент = Истина Тогда
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("КоличествоФайлов", ПриложенныеДокументы.Количество());
		
		ПеренестиВДокумент = Истина;
		ЗаписатьСведенияОПриложенныхФайлах(ДокументОснование);
		ОповеститьОВыборе(СтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент <> Истина И Модифицированность Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), НСтр("ru = 'Сведения для электронного акта не сохранены в документ.
			|
			|Перенести?'"), РежимДиалогаВопрос.ДаНетОтмена);
			
		Отказ = Истина;
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПриложенныеДокументы

&НаКлиенте
Процедура ПриложенныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ПриложенныеДокументыНаименованиеФайла" Тогда
		ОткрытьЭлектронныйДокументИзФайла(ВыбраннаяСтрока);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриложенныеДокументыПередУдалением(Элемент, Отказ)
	
	МассивИндексов = Элемент.ВыделенныеСтроки;
	
	Если НЕ МассивИндексов.Количество() > 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого ИндексСтроки Из МассивИндексов Цикл 

		Если ПриложенныеДокументы.Количество() = 1 Тогда
			ИндексСтроки = 0;
		КонецЕсли;	
		
		ТекущаяСтрока = ПриложенныеДокументы.Получить(ИндексСтроки); 
		СписокУдаленныхДокументов.Добавить(ТекущаяСтрока.ПрисоединенныйФайл);
			
	КонецЦикла;
	
	ПроверитьПриложенныеДокументыРасчетРазмера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьИзФайла(Команда)

	Оповещение = Новый ОписаниеОповещения("ДобавитьИзФайлаПослеВыбораФайла", ЭтотОбъект);
	
	ДопустимыеРасширения = ДанныеДляКлиента.ДопустимыеРасширения;
	ТипыФильтра = Новый Массив;
	Для каждого Тип Из ДопустимыеРасширения Цикл
		ТипыФильтра.Добавить("*." + Тип);
	КонецЦикла;
	СтрокаРасширений = СтрСоединить(ТипыФильтра, ";");
	ФильтрШаблон = НСтр("ru = 'Все разрешенные типы (%1)|%1'");
	Фильтр = СтрШаблон(ФильтрШаблон, СтрокаРасширений);
	РаботаСФайламиКлиент.ДобавитьФайлы(ДокументОснование, УникальныйИдентификатор, Фильтр, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзПрисоединенныхФайловДокумента(Команда)

	Оповещение = Новый ОписаниеОповещения("ДобавитьИзФайлаПослеВыбораФайла", ЭтотОбъект);
	РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(ДокументОснование, Элементы.ПриложенныеДокументы, , Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьСведенияДляАкта(Команда)
	
	РезультатПроверки = ПроверитьПриложенныеДокументыРасчетРазмера();
	Если РезультатПроверки.ОбщийРазмер > МаксимальныйРазмерФайлов Тогда
		ТекстПредупреждения = НСтр("ru='На %1 %3 превышен допустимый для передачи через операторов ЭДО предел общего размера приложенных файлов (%2 %4), которые входят в состав электронного документа извещения.
		|
		|Необходимо сократить список приложенных файлов и повторить операцию. 
		|Для передачи файлов, которые не могут быть включены в состав электронного документа извещения, следует использовать произвольный электронный документ (Органайзер - Текущие дела ЭДО - Исходящие - Создать произвольный документ).'"); 
		МаксимальныйРазмерДляВывода = Окр(МаксимальныйРазмерФайлов / БайтовВМегабайте(), 1);
		РазмерПревышенияДляВвода = Окр((РезультатПроверки.ОбщийРазмер - МаксимальныйРазмерДляВывода * БайтовВМегабайте()) / 1024 , 1); 
		Шаблон = СтрШаблон(ТекстПредупреждения, РазмерПревышенияДляВвода, МаксимальныйРазмерДляВывода, НСтр("ru = 'Кб'"), НСтр("ru = 'Мб'"));
		ПоказатьПредупреждение(,Шаблон);
		Возврат;
	КонецЕсли;
	
	СписокТекстаЗамечаний = Новый Массив;
	ЕстьЗамечанияКЗаполнению = ЕстьЗамечанияКЗаполнению(СписокТекстаЗамечаний);
	Если ЕстьЗамечанияКЗаполнению Тогда
		Для Каждого ТекСтрока Из СписокТекстаЗамечаний Цикл
			ТекстСообщения = ТекСтрока;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;

		Возврат;
	КонецЕсли;	
	
	ПеренестиВДокумент = Истина;  
	
	Если СписокУдаленныхДокументов.Количество() > 0 Тогда 
		ПриложенныеДокументыПометкаУдаленияНаСервере();
	КонецЕсли;

	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИнвКарточкиИзВнутреннегоЭДО(Команда)
	ДобавитьИнвКарточкиИзВнутреннегоЭДОНаСервере();
	
	ПроверитьПриложенныеДокументыРасчетРазмера();
		
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКарточкиКапвложенийИзВнутреннегоЭДО(Команда)
	ДобавитьКарточкиКапвложенийИзВнутреннегоЭДОНаСервере();
	
	ПроверитьПриложенныеДокументыРасчетРазмера();
		
	Модифицированность = Истина;
КонецПроцедуры
 
&НаКлиенте
Процедура ДобавитьФайлыИнвентарныеКарточкиДляРегистраУчета(Команда)
	
	ДобавитьИнвКарточкиИКарточкиКапвложенийИзРегистраУчета("Инвентарная карточка");		
			
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлыКарточкиКапвложенийДляРегистраУчета(Команда) 
	
	ДобавитьИнвКарточкиИКарточкиКапвложенийИзРегистраУчета("Карточка капвложений");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПриложенныеДокументыДляЭДО(ДокументИзвещения) Экспорт
	
	ТаблицаФайлов = ЭлектронныеДокументыБГУ.ДанныеФайловПрисоединенныхКДокументуИзвещения(ДокументИзвещения);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаФайлов);
	
КонецФункции

&НаСервере
Процедура ЗаписатьСведенияОПриложенныхФайлах(ТекущийДокументОбъект)

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписейПриложения = РегистрыСведений.ПриложенныеФайлыДляЭДОБГУ.СоздатьНаборЗаписей();
	НаборЗаписейПриложения.Отбор.ДокументЭД.Установить(ТекущийДокументОбъект.Ссылка);
	
	Для Каждого Строка Из ПриложенныеДокументы Цикл
		Если ЗначениеЗаполнено(Строка.ПрисоединенныйФайл) Тогда
			ЗаписьПриложение = НаборЗаписейПриложения.Добавить();
			ЗаписьПриложение.ДокументЭД = ТекущийДокументОбъект.Ссылка;
			ЗаписьПриложение.Активность = Ложь;
			ЗаписьПриложение.Организация = ТекущийДокументОбъект.Организация;	
			ЗаписьПриложение.ПрисоединенныйФайл = Строка.ПрисоединенныйФайл;
			ЗаписьПриложение.ВидСведений = Строка.ВидСведений;
			ЗаписьПриложение.НаименованиеДокументаФайла = Строка.НаименованиеДокументаФайла;
		КонецЕсли;	
	КонецЦикла;
	
	НаборЗаписейПриложения.Записать();
	
КонецПроцедуры

&НаСервере
Функция МаксимальныйРазмерПриложенногоФайлаВБайтах() Экспорт
	
	Возврат 40 * БайтовВМегабайте();
	
КонецФункции

&НаСервере
Функция МаксимальныйОбщийРазмерПриложенныхФайловВБайтах() Экспорт
	
	Возврат 40 * БайтовВМегабайте();
	
КонецФункции

&НаСервереБезКонтекста
Функция ДопустимыеРасширенияПриложенныхФайлов()

	ДопустимыеРасширения = Новый Массив;
	ДопустимыеРасширения.Добавить("pdf");
	
	Возврат ДопустимыеРасширения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСтроки(Строка, Файл)
	
	РеквизитыФайла = ИмяРазмерРасширениеФайла(Файл);
	Строка.ПрисоединенныйФайл = Файл;
	Строка.Размер = РеквизитыФайла.Размер;
	Строка.РазмерПредставление = РеквизитыФайла.ПредставлениеРазмера;
	Строка.НаименованиеФайла = РеквизитыФайла.Наименование;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяРазмерРасширениеФайла(Файл)
	
	Результат = Новый Структура;
	Результат.Вставить("Наименование", "");
	Результат.Вставить("Размер", 0);
	Результат.Вставить("ПредставлениеРазмера", "");
	Результат.Вставить("Расширение", "");
	
	ИмяРазмерРасширение = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Файл, "Наименование, Размер, Расширение");
	Результат.Расширение = ИмяРазмерРасширение.Расширение;
	Шаблон = НСтр("ru='%1.%2'");
	Результат.Наименование = СтрШаблон(Шаблон, ИмяРазмерРасширение.Наименование, ИмяРазмерРасширение.Расширение);
	Размер = ИмяРазмерРасширение.Размер;
	Результат.Размер = Размер;
	БайтовВМегабайте = БайтовВМегабайте();
	БайтовВКилобайте = 1024;
	Если Размер >= БайтовВМегабайте Тогда
		Размер = Размер / БайтовВМегабайте;
		Размер = Окр(Размер, 1);
		Шаблон = НСтр("ru='%1 Мб'");
	Иначе
		Размер = Размер / БайтовВКилобайте;
		Размер = Окр(Размер, 1);
		Шаблон = НСтр("ru='%1 Кб'");
	КонецЕсли;
	Результат.ПредставлениеРазмера = СтрШаблон(Шаблон, Размер);
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция БайтовВМегабайте()
	
	Возврат 1024 * 1024;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЦветТекстаКрасный()
	Возврат  ЭлектронноеАктированиеЕИС.ЦветТекстаКрасный();
КонецФункции

&НаСервереБезКонтекста
Функция ЦветТекстаОбычный()
	Возврат  ЭлектронноеАктированиеЕИС.ЦветТекстаОбычный();
КонецФункции

&НаКлиенте
Процедура ОткрытьЭлектронныйДокументИзФайла(ВыбранноеЗначение)

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ПриложенныеДокументы.НайтиПоИдентификатору(ВыбранноеЗначение);
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ПрисоединенныйФайл) Тогда
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(
			ДанныеСтроки.ПрисоединенныйФайл, Неопределено, УникальныйИдентификатор);
		
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзФайлаПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Файл = Результат[0];
		Иначе
			Файл = Результат;
		КонецЕсли;
		
		Строка = ПриложенныеДокументы.Добавить();
		ЗаполнитьДанныеСтроки(Строка, Файл);
		
		Если СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Инвентарные карточки'")) > 0 Тогда
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийИзвещения0504805.КопииИнвентарныхКарточек");
			Строка.НаименованиеДокументаФайла = НСтр("ru='Инвентарные карточки объектов'");
		ИначеЕсли СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Инвентарная карточка'")) > 0 Тогда
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийИзвещения0504805.КопииИнвентарныхКарточек");
			Строка.НаименованиеДокументаФайла = НСтр("ru='Инвентарная карточка объекта'");
		ИначеЕсли СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Карточки капвложений'")) > 0 Тогда
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийИзвещения0504805.КопииКарточекКапитальныхВложений");
			Строка.НаименованиеДокументаФайла = НСтр("ru='Карточки капитальных вложений'");
		ИначеЕсли СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Карточка капвложений'")) > 0 Тогда
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийИзвещения0504805.КопииКарточекКапитальныхВложений");
			Строка.НаименованиеДокументаФайла = НСтр("ru='Карточка капитальных вложений'");
		ИначеЕсли СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Выписка из реестра имущества'")) > 0 Тогда
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийИзвещения0504805.ВыпискаИзРеестраИмуществаОбОбъекте");
			Строка.НаименованиеДокументаФайла = НСтр("ru='Выписка из реестра имущества'");
		ИначеЕсли СтрНайти(Строка.НаименованиеФайла, НСтр("ru='ЕГРН'")) > 0 Тогда
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийИзвещения0504805.ВыпискаИзЕГРН");
			Строка.НаименованиеДокументаФайла = НСтр("ru='Выписка из ЕГРН'");
		Иначе 
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийИзвещения0504805.ПрочиеДокументы");
			Строка.НаименованиеДокументаФайла = НСтр("ru='Прочие документы'");
		КонецЕсли;	
		
		ПроверитьПриложенныеДокументыРасчетРазмера();
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПриложенныеДокументыРасчетРазмера()
	
	Результат = Новый Структура;
	Результат.Вставить("ОбщийРазмер", 0);
	Результат.Вставить("ОбщийРазмерМб", 0);
	Результат.Вставить("Выполнено", Истина);
	
	ОбщийРазмер = 0;
	БайтовВМегабайте = БайтовВМегабайте();
	БайтовВКилобайте = 1024;
	ДопустимыеРасширения = ДанныеДляКлиента.ДопустимыеРасширения; //ДопустимыеРасширенияПриложенныхФайлов();
	Для каждого Файл Из ПриложенныеДокументы Цикл
		
		НайденныйЭлементСписка = СписокУдаленныхДокументов.НайтиПоЗначению(Файл.ПрисоединенныйФайл);
		Если НайденныйЭлементСписка <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		ОбщийРазмер = ОбщийРазмер + Файл.Размер;
		
		ПрисоединенныйФайл = Файл.ПрисоединенныйФайл;
		РеквизитыФайла = ИмяРазмерРасширениеФайла(ПрисоединенныйФайл);
		
		Если НЕ ЗначениеЗаполнено(Файл.ВидСведений) Тогда
			Шаблон = НСтр("ru='Не заполнен вид документа для файла ""%1"".'");
			ТекстОшибки = СтрШаблон(Шаблон, ПрисоединенныйФайл);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			Результат.Выполнено = Ложь;
		КонецЕсли;
		
		Если ДопустимыеРасширения.Найти(РеквизитыФайла.Расширение) = Неопределено Тогда
			Шаблон = НСтр("ru='Выбран документ с недопустимым расширением - ""%1"".'");
			ТекстОшибки = СтрШаблон(Шаблон, ПрисоединенныйФайл);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			Результат.Выполнено = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Если МаксимальныйРазмерФайлов - ОбщийРазмер >= БайтовВМегабайте Тогда
		ЕщеМожноПриложить = Окр((МаксимальныйРазмерФайлов - ОбщийРазмер) / БайтовВМегабайте, 1);
		ЕдиницаЕщеПриложить = НСтр("ru = 'Мб'");
	Иначе
		ЕщеМожноПриложить = Окр((МаксимальныйРазмерФайлов - ОбщийРазмер) / БайтовВКилобайте, 1);
		ЕдиницаЕщеПриложить = НСтр("ru = 'Кб'");
	КонецЕсли;
	
	Если ЕщеМожноПриложить < 0 Тогда
		Результат.Выполнено = Ложь;
	КонецЕсли;
	
	Результат.ОбщийРазмер = ОбщийРазмер;
	Результат.ОбщийРазмерМб = ОбщийРазмер / БайтовВМегабайте;
	
	Если ПриложенныеДокументы.Количество() > 0 Тогда
		
		// Формируем надпись о размере файлов.
		// Вывод в декорацию, не всегда появляется выбор типа файла из-за особенностей платформы.
		Если ОбщийРазмер >= БайтовВМегабайте Тогда
			ОбщийРазмерДляВывода = Окр(Результат.ОбщийРазмерМб, 1);
			ЕдиницаОбщегоРазмера = НСтр("ru = 'Мб'");
		Иначе
			ОбщийРазмерДляВывода = Окр(ОбщийРазмер / БайтовВКилобайте, 1);
			ЕдиницаОбщегоРазмера = НСтр("ru = 'Кб'");
		КонецЕсли;
				
		// Вывод в надпись.
		Если ЕщеМожноПриложить < 0 Тогда
			Шаблон = НСтр("ru='Общий размер %1 %3. Допустимый размер превышен на %2 %4.'");
			Элементы.НадписьОбщийРазмерФайлов.ЦветТекста = ЦветТекстаКрасный();
		Иначе
			Шаблон = НСтр("ru='Общий размер %1 %3. Можно дополнительно приложить файлы размером %2 %4.'");
			Элементы.НадписьОбщийРазмерФайлов.ЦветТекста = ЦветТекстаОбычный();
		КонецЕсли;
		ЕщеМожноПриложить = Макс(ЕщеМожноПриложить, -ЕщеМожноПриложить);
		
		НадписьОбщийРазмерФайлов = СтрШаблон(Шаблон,
			ОбщийРазмерДляВывода, ЕщеМожноПриложить, ЕдиницаОбщегоРазмера, ЕдиницаЕщеПриложить);
		
	Иначе
		НадписьОбщийРазмерФайлов = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		РезультатПроверки = ПроверитьПриложенныеДокументыРасчетРазмера();
		Если РезультатПроверки.ОбщийРазмер > МаксимальныйРазмерФайлов Тогда
			ТекстПредупреждения = НСтр("ru='На %1 %3 превышен допустимый для передачи через операторов ЭДО предел общего размера приложенных файлов (%2 %4), которые входят в состав электронного документа извещения.
			|
			|Необходимо сократить список приложенных файлов и повторить операцию. 
			|Для передачи файлов, которые не могут быть включены в состав электронного документа извещения, следует использовать произвольный электронный документ (Органайзер - Текущие дела ЭДО - Исходящие - Создать произвольный документ).'"); 
			МаксимальныйРазмерДляВывода = Окр(МаксимальныйРазмерФайлов / БайтовВМегабайте(), 1);
			РазмерПревышенияДляВвода = Окр((РезультатПроверки.ОбщийРазмер - МаксимальныйРазмерДляВывода * БайтовВМегабайте()) / 1024 , 1); 
			Шаблон = СтрШаблон(ТекстПредупреждения, РазмерПревышенияДляВвода, МаксимальныйРазмерДляВывода, НСтр("ru = 'Кб'"), НСтр("ru = 'Мб'"));
			ПоказатьПредупреждение(,Шаблон);
			Возврат;
		КонецЕсли;

		ПеренестиВДокумент = Истина;
		Закрыть(КодВозвратаДиалога.OK);
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть(КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложенныеДокументыВидСведенийОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекущиеДанные = Элементы.ПриложенныеДокументы.ТекущиеДанные;
		
		Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.КопииИнвентарныхКарточек") Тогда
			ТекущиеДанные.НаименованиеДокументаФайла = НСтр("ru='Инвентарные карточки объектов'");
		ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.КопииКарточекКапитальныхВложений") Тогда
			ТекущиеДанные.НаименованиеДокументаФайла = НСтр("ru='Карточки капитальных вложений'");
		ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.ВыпискаИзРеестраИмуществаОбОбъекте") Тогда
			ТекущиеДанные.НаименованиеДокументаФайла = НСтр("ru='Выписка из реестра имущества'");
		ИначеЕсли ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.ВыпискаИзЕГРН") Тогда
			ТекущиеДанные.НаименованиеДокументаФайла = НСтр("ru='Выписка из ЕГРН'");
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ДобавитьИнвКарточкиИзВнутреннегоЭДОНаСервере()
	НаименованиеДокументаФайла = НСтр("ru='Инвентарная карточка объекта'");	
	
	ИспользуетсяПОД = ЭлектронныеДокументыБГУ.ИспользуетсяПОД();
	
	ИдентификаторКомандыПечати = "ИнвентарнаяКарточка61н";
	
	ОбъектыУчета = СписокОбъектовОСДокументаОснования();
	НомерСтроки = 0;
	
	Для Каждого ТекСтрока Из ОбъектыУчета Цикл
		НомерСтроки = НомерСтроки + 1;
		
		ОбъектНФА = ТекСтрока.ОбъектНФА;
		
		Если ИспользуетсяПОД Тогда
			СведенияПредставленияВнутреннегоЭД = СведенияПредставленияВнутреннегоЭДПОД(ОбъектНФА, ОбъектНФА, ИдентификаторКомандыПечати, НаименованиеДокументаФайла);
		Иначе
			СведенияПредставленияВнутреннегоЭД = СведенияПредставленияВнутреннегоЭД(ОбъектНФА, ОбъектНФА, ИдентификаторКомандыПечати, НаименованиеДокументаФайла);
		КонецЕсли;	

		Если ЗначениеЗаполнено(СведенияПредставленияВнутреннегоЭД.ДобавленныйФайл) Тогда
			Файл = СведенияПредставленияВнутреннегоЭД.ДобавленныйФайл;
			Строка = ПриложенныеДокументы.Добавить();
			ЗаполнитьДанныеСтроки(Строка, Файл);
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.КопииИнвентарныхКарточек");
			Строка.НаименованиеДокументаФайла = НаименованиеДокументаФайла;
		Иначе
			ШаблонСообщения = НСтр("ru = 'Внутренний электронный документ ""%1"" не найден для ОС ""%2"" (строка № %3).'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, НаименованиеДокументаФайла, ТекСтрока.ОбъектНФА, НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКарточкиКапвложенийИзВнутреннегоЭДОНаСервере()
	НаименованиеДокументаФайла = НСтр("ru='Карточка капитальных вложений'");
	
	ИспользуетсяПОД = Ложь;	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПроцессыОбработкиДокументов") Тогда
		ИспользуетсяПОД = Истина;	
	КонецЕсли;

	ИдентификаторКомандыПечати = "КарточкаКапвложений0509211";
	
	ОбъектыУчета = СписокОбъектовКВДокументаОснования();
	НомерСтроки = 0;
	
	Для Каждого ТекСтрока Из ОбъектыУчета Цикл
		НомерСтроки = НомерСтроки + 1;
		
		ОбъектНФА = ТекСтрока.ОбъектНФА;
		КарточкаКВ = ТекСтрока.КарточкаКапВложений;
	
		Если ИспользуетсяПОД Тогда
			СведенияПредставленияВнутреннегоЭД = СведенияПредставленияВнутреннегоЭДПОД(КарточкаКВ, ОбъектНФА, ИдентификаторКомандыПечати, НаименованиеДокументаФайла);
		Иначе	
			СведенияПредставленияВнутреннегоЭД = СведенияПредставленияВнутреннегоЭД(КарточкаКВ, ОбъектНФА, ИдентификаторКомандыПечати, НаименованиеДокументаФайла);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СведенияПредставленияВнутреннегоЭД.ДобавленныйФайл) Тогда
			Файл = СведенияПредставленияВнутреннегоЭД.ДобавленныйФайл;
			Строка = ПриложенныеДокументы.Добавить();
			ЗаполнитьДанныеСтроки(Строка, Файл);
			Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.КопииКарточекКапитальныхВложений");
			Строка.НаименованиеДокументаФайла = НаименованиеДокументаФайла;
		Иначе
			ШаблонСообщения = НСтр("ru = 'Внутренний электронный документ ""%1"" не найден для капвложения ""%2"" (строка № %3).'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, НаименованиеДокументаФайла, ТекСтрока.ОбъектНФА, НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры

&НаСервере
Функция СведенияПредставленияВнутреннегоЭД(ДокументОснование, НФА, ИдентификаторКомандыПечати, НаименованиеДокументаФайла)
	ДатаСведений = ТекущаяДатаСеанса();
	ТекстовоеСодержимое = "";
	ИмяПриложенногоФайла = "";
	
	Расширение = "pdf";
	ТипФайлаТабДок = ТипФайлаТабличногоДокумента.PDF_A_3;
	
	ВнутреннийЭД = ВнутреннийЭДО.АктуальныйЭлектронныйДокумент(ДокументОснование, ИдентификаторКомандыПечати);

	Если НЕ ЗначениеЗаполнено(ВнутреннийЭД) Тогда
		Результат = Новый Структура;
		Результат.Вставить("ДобавленныйФайл", Неопределено);
		Результат.Вставить("ИмяПриложенногоФайла", ИмяПриложенногоФайла);

		Возврат Результат;
	КонецЕсли;

	Реквизиты = "Код, Наименование";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, Реквизиты);
	ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2, %3)'"), НаименованиеДокументаФайла, ЗначенияРеквизитов.Код, ЗначенияРеквизитов.Наименование);
	Если СтрДлина(ИмяФайла) > 150 Тогда
		ИмяФайла = Сред(ИмяФайла,1,149);		
		ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1)'"), ИмяФайла);
	КонецЕсли;	
	
	ДвоичныеДанные = ЭлектронныеДокументыБГУ.ДвоичныеДанныеЭлектронногоДокумента(ВнутреннийЭД);

	ЭлектронныеПодписи = ЭлектронныеДокументыБГУ.НовыйСписокЭлектронныхПодписейВнутреннегоЭД();
	ЭлектронныеДокументыБГУ.ЗаполнитьСписокПодписей(ЭлектронныеПодписи, ВнутреннийЭД.ОсновнойФайл, Организация);
	
	АдресОсновногоФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ТабличныйДокументОсновной = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхАрхива(ДвоичныеДанные);
	
	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной);
	
	ЭлектронныеДокументыБГУ.ДобавитьШтампыЭлектронныхПодписейВнутреннегоЭДО(ТабличныйДокументОсновной, ЭлектронныеПодписи, Организация);

	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ТабличныйДокументОсновной.Записать(ИмяВременногоФайла, ТипФайлаТабДок);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанные);

	ИмяБезРасширения = ИмяФайла;
	РасширениеБезТочки = Расширение;
	СсылкаНаВладельца = НФА;
	
	ПараметрыФайла = Новый Структура();
	ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов", СсылкаНаВладельца);
	ПараметрыФайла.Вставить("ИмяБезРасширения", ИмяБезРасширения);
	ПараметрыФайла.Вставить("РасширениеБезТочки", РасширениеБезТочки);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ДатаСведений);
	ПараметрыФайла.Вставить("Служебный", Истина);

	ДобавленныйФайл = РаботаСФайлами.ДобавитьФайл(
		ПараметрыФайла, АдресДвоичныхДанных, "", СокрЛП(ИмяФайла));
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ШаблонТекста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Удаление временного %1 файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
			Расширение);
		
		ЗаписьЖурналаРегистрации(ШаблонТекста,
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление временного PDF файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
	ИмяПриложенногоФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1.pdf'"), ИмяФайла);
	
	Результат = Новый Структура;
	Результат.Вставить("ДобавленныйФайл", ДобавленныйФайл);
	Результат.Вставить("ИмяПриложенногоФайла", ИмяПриложенногоФайла);
	
	Возврат Результат;
КонецФункции	

&НаСервере
Функция СведенияПредставленияВнутреннегоЭДПОД(ДокументОснование, ОбъектНФА, ИдентификаторКомандыПечати, НаименованиеДокументаФайла)

	ДатаСведений = ТекущаяДатаСеанса();
	ТекстовоеСодержимое = "";
	ИмяПриложенногоФайла = "";
	
	Расширение = "pdf";
	ТипФайлаТабДок = ТипФайлаТабличногоДокумента.PDF_A_3;
	
	Реквизиты = "Код, Наименование";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектНФА, Реквизиты);
	ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2, %3)'"), НаименованиеДокументаФайла, ЗначенияРеквизитов.Код, ЗначенияРеквизитов.Наименование);
	Если СтрДлина(ИмяФайла) > 150 Тогда
		ИмяФайла = Сред(ИмяФайла,1,149);		
		ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1)'"), ИмяФайла);
	КонецЕсли;	
	
	ТабличныйДокументОсновной = ЭлектронныеДокументыБГУ.АдресТабличногоДокументаПредставленияЭДПОД(ДокументОснование, ИдентификаторКомандыПечати);

	ДвоичныеДанные = ЭлектронныеДокументыБГУ.ДвоичныеДанныеПредставленияДокументаПОД(ДокументОснование, ИдентификаторКомандыПечати, ТипФайлаТабличногоДокумента.MXL);
	
	ТабличныйДокументОсновной = ЭлектронныеДокументыБГУ.ТабличныйДокументИзДвоичныхДанных(ДвоичныеДанные);
	
	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ТабличныйДокументОсновной.Записать(ИмяВременногоФайла, ТипФайлаТабДок);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанные);

	ИмяБезРасширения = ИмяФайла;
	РасширениеБезТочки = Расширение;
	СсылкаНаВладельца = ДокументОснование;
	
	ПараметрыФайла = Новый Структура();
	ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов", СсылкаНаВладельца);
	ПараметрыФайла.Вставить("ИмяБезРасширения", ИмяБезРасширения);
	ПараметрыФайла.Вставить("РасширениеБезТочки", РасширениеБезТочки);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ДатаСведений);
	ПараметрыФайла.Вставить("Служебный", Истина);
	
	ДобавленныйФайл = РаботаСФайлами.ДобавитьФайл(
		ПараметрыФайла, АдресДвоичныхДанных, "", ИмяФайла);
	
	ИмяПриложенногоФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='%1.pdf'"), ИмяФайла);
	
	Результат = Новый Структура;
	Результат.Вставить("ДобавленныйФайл", ДобавленныйФайл);
	Результат.Вставить("ИмяПриложенногоФайла", ИмяПриложенногоФайла);

	Возврат Результат;
КонецФункции

&НаСервере
Функция СписокОбъектовОСИзДокументовПередачи()
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзвещениеИсходящееДокументыПередачи.ДокументПередачи КАК ДокументПередачи
	               |ИЗ
	               |	Документ.ИзвещениеИсходящее.ДокументыПередачи КАК ИзвещениеИсходящееДокументыПередачи
	               |ГДЕ
	               |	ИзвещениеИсходящееДокументыПередачи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументПередачи"); 
	
	Возврат Результат;
КонецФункции
	

&НаСервере
Функция СписокОбъектовОСДокументаОснования()
	ДокументыПередачиОС = СписокОбъектовОСИзДокументовПередачи();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОбъектНФА
	               |ИЗ
	               |	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ПередачаОбъектовОСОсновныеСредства
	               |ГДЕ
	               |	ПередачаОбъектовОСОсновныеСредства.Ссылка В(&ДокументыПередачиОС)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПередачаОбъектовИКОсновныеСредства.ОсновноеСредство
	               |ИЗ
	               |	Документ.ПередачаОбъектовИК.ОсновныеСредства КАК ПередачаОбъектовИКОсновныеСредства
	               |ГДЕ
	               |	ПередачаОбъектовИКОсновныеСредства.Ссылка В(&ДокументыПередачиОС)";
	
	Запрос.УстановитьПараметр("ДокументыПередачиОС", ДокументыПередачиОС);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

&НаСервере
Функция СписокОбъектовКВДокументаОснования()
	ДокументыПередачиОС = СписокОбъектовОСИзДокументовПередачи();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОбъектНФА
	               |ПОМЕСТИТЬ ОбъектыОС
	               |ИЗ
	               |	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ПередачаОбъектовОСОсновныеСредства
	               |ГДЕ
	               |	ПередачаОбъектовОСОсновныеСредства.Ссылка В(&ДокументыПередачиОС)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПередачаОбъектовИКОсновныеСредства.ОсновноеСредство
	               |ИЗ
	               |	Документ.ПередачаОбъектовИК.ОсновныеСредства КАК ПередачаОбъектовИКОсновныеСредства
	               |ГДЕ
	               |	ПередачаОбъектовИКОсновныеСредства.Ссылка В(&ДокументыПередачиОС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОбъектыОС.ОбъектНФА КАК ОбъектНФА,
	               |	КарточкиКапвложений.Ссылка КАК КарточкаКапВложений
	               |ИЗ
	               |	ОбъектыОС КАК ОбъектыОС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КарточкиКапвложений КАК КарточкиКапвложений
	               |		ПО ОбъектыОС.ОбъектНФА.Ссылка = КарточкиКапвложений.ОбъектВложений";

	Запрос.УстановитьПараметр("ДокументыПередачиОС", ДокументыПередачиОС);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

&НаСервере
Функция ЕстьЗамечанияКЗаполнению(СписокЗамечаний)
	Результат = Ложь;
	ТекстЗамечанияКФайлу = НСтр("ru = 'не указан файл. Необходимо удалить строку и добавить файл одной из команд подменю ""Добавить"".'");
	
	НомерСтроки = 0;
	Для Каждого Строка Из ПриложенныеДокументы Цикл
		НомерСтроки = НомерСтроки + 1;
		Если НЕ ЗначениеЗаполнено(Строка.ПрисоединенныйФайл) Тогда
			ТекстЗамечания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'В строке %2 %1'"), ТекстЗамечанияКФайлу, НомерСтроки);
			
			СписокЗамечаний.Добавить(ТекстЗамечания);
			
			Результат = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
 
&НаКлиенте
Процедура ДобавитьИнвКарточкиИКарточкиКапвложенийИзРегистраУчета(ТипВидаРегистра)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПриложенныеДокументыРегистраУчета",ЭтотОбъект);
	
	ВидРегистра = Новый СписокЗначений; 
	МассиВидыРегистра =  СсылкаВидРегистра(ТипВидаРегистра);
	ВидРегистра.ЗагрузитьЗначения(МассиВидыРегистра);
	
	СтруктураОтбора = Новый Структура; 
	СтруктураОтбора.Вставить("ВидРегистра", ВидРегистра);
	СтруктураОтбора.Вставить("Организация", Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму(
	"Документ.РегистрУчета.Форма.ФормаВыбораВнутреннегоЭДО", ПараметрыФормы,
	,,,,Оповещение,
	);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриложенныеДокументыРегистраУчета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ДобавитьИнвКарточкиИКарточкиКапвложенийИзФайлаРегистрУчетаНаСервере(Результат);
	Иначе
		Возврат;
	КонецЕсли;
	
	ПроверитьПриложенныеДокументыРасчетРазмера();
	
	Модифицированность = Истина;
	
КонецПроцедуры 

&НаСервере
Процедура ДобавитьИнвКарточкиИКарточкиКапвложенийИзФайлаРегистрУчетаНаСервере(ВыбранныеОбъекты)
	
	ИспользуетсяПОД = ЭлектронныеДокументыБГУ.ИспользуетсяПОД();
	
	Если ИспользуетсяПОД Тогда
		ОбъектыУчета = ВыбранныеОбъекты;
	Иначе
		ОбъектыУчета = СписокВыбранныхКарточекЭД(ВыбранныеОбъекты);
	КонецЕсли;
	
	НомерСтроки = 0;
	
	Для Каждого ТекСтрока Из ОбъектыУчета Цикл 
		
		НомерСтроки = НомерСтроки + 1;
		
		Если ИспользуетсяПОД Тогда 
			РегистрУчета 				= ТекСтрока.Значение; 
			
			СведенияПредставленияВнутреннегоЭД = СведенияПредставленияФайлаРегистрУчетаЭДПОД(РегистрУчета);
		Иначе   
			РегистрУчета 				= ТекСтрока.РегистрУчета; 
			ВнутреннийЭД 				= ТекСтрока.ВнутреннийЭД;
			ИдентификаторКомандыПечати 	= ТекСтрока.ИдентификаторКомандыПечати;
			
			СведенияПредставленияВнутреннегоЭД = СведенияПредставленияФайлаРегистрУчетаЭД(РегистрУчета, ВнутреннийЭД, ИдентификаторКомандыПечати);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СведенияПредставленияВнутреннегоЭД.ДобавленныйФайл) Тогда
			Файл = СведенияПредставленияВнутреннегоЭД.ДобавленныйФайл;
			Строка = ПриложенныеДокументы.Добавить();
			ЗаполнитьДанныеСтроки(Строка, Файл); 
			ЗаполнитьВидСведенийНаименованиеДокумента(Строка);
		Иначе
			ШаблонСообщения = НСтр("ru = 'Внутренний электронный документ не найден для  ""%1"" (строка № %2).'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, РегистрУчета, НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокВыбранныхКарточекЭД(ВыбранныеОбъекты)
	
	Запрос = Новый Запрос;	                                   
	Запрос.Текст = "ВЫБРАТЬ
	|	ВнутреннийЭлектронныйДокумент.Ссылка КАК ВнутреннийЭД,
	|	ДокументРегистрУчета.Ссылка КАК РегистрУчета,
	|	ВнутреннийЭлектронныйДокумент.ИдентификаторКомандыПечати КАК ИдентификаторКомандыПечати
	|ИЗ
	|	Документ.ВнутреннийЭлектронныйДокумент КАК ВнутреннийЭлектронныйДокумент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РегистрУчета КАК ДокументРегистрУчета
	|		ПО (ВЫБОР
	|				КОГДА ВнутреннийЭлектронныйДокумент.УчетныйДокумент ССЫЛКА Документ.РегистрУчета
	|					ТОГДА ДокументРегистрУчета.Ссылка = ВнутреннийЭлектронныйДокумент.УчетныйДокумент
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|ГДЕ
	|	ДокументРегистрУчета.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВнутреннийЭлектронныйДокумент.Ссылка,
	|	ДокументРегистрУчета.Ссылка,
	|	ВнутреннийЭлектронныйДокумент.ИдентификаторКомандыПечати";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранныеОбъекты);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции	

&НаСервереБезКонтекста
Функция СсылкаВидРегистра(ТипВидаРегистра)
	
	ВидРегистраУчета = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыРегистровУчета.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыРегистровУчета КАК ВидыРегистровУчета
	               |ГДЕ
	               |	ВидыРегистровУчета.Наименование ПОДОБНО &Наименование
				   |	И ВидыРегистровУчета.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("Наименование", "%" + ТипВидаРегистра + "%");
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	Если Результат.Количество() > 0 Тогда 
		ВидРегистраУчета = Результат.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат ВидРегистраУчета;
	
КонецФункции 

&НаСервере
Функция СведенияПредставленияФайлаРегистрУчетаЭД(ДокументРегистрУчета, ДокВнутреннегоЭД, ИдентификаторКомандыПечати)
	
	ДатаСведений = ТекущаяДатаСеанса();
	ТекстовоеСодержимое = "";
	ИмяПриложенногоФайла = "";
	
	Расширение = "pdf";
	ТипФайлаТабДок = ТипФайлаТабличногоДокумента.PDF_A_3;
	
	ВнутреннийЭД = ВнутреннийЭДО.АктуальныйЭлектронныйДокумент(ДокументРегистрУчета, ИдентификаторКомандыПечати);
	
	Если НЕ ЗначениеЗаполнено(ВнутреннийЭД) Тогда
		Результат = Новый Структура;
		Результат.Вставить("ДобавленныйФайл", Неопределено);
		Результат.Вставить("ИмяПриложенногоФайла", ИмяПриложенногоФайла);
		
		Возврат Результат;
	КонецЕсли;
	
	Реквизиты = "Описание, Дата";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрУчета,Реквизиты);
	ИмяФайлаСПробелами = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регистр учета от %1, %2)'"), ЗначенияРеквизитов.Дата,ЗначенияРеквизитов.Описание);
	ИмяФайлаБезПробелов = СтрЗаменить(ИмяФайлаСПробелами," ","_");
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаБезПробелов, "_");
	Если СтрДлина(ИмяФайла) > 150 Тогда
		ИмяФайла = Сред(ИмяФайла,1,149);		
		ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1)'"), ИмяФайла);
	КонецЕсли;	
	
	ДвоичныеДанные = ЭлектронныеДокументыБГУ.ДвоичныеДанныеЭлектронногоДокумента(ВнутреннийЭД);
	
	ЭлектронныеПодписи = ЭлектронныеДокументыБГУ.НовыйСписокЭлектронныхПодписейВнутреннегоЭД();
	ЭлектронныеДокументыБГУ.ЗаполнитьСписокПодписей(ЭлектронныеПодписи, ВнутреннийЭД.ОсновнойФайл, Организация);
	
	АдресОсновногоФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ТабличныйДокументОсновной = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхАрхива(ДвоичныеДанные);
	
	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной);
	
	ЭлектронныеДокументыБГУ.ДобавитьШтампыЭлектронныхПодписейВнутреннегоЭДО(ТабличныйДокументОсновной, ЭлектронныеПодписи, Организация);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ТабличныйДокументОсновной.Записать(ИмяВременногоФайла, ТипФайлаТабДок);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ИмяБезРасширения = ИмяФайла;
	РасширениеБезТочки = Расширение;
	СсылкаНаВладельца = ДокументОснование;
	
	ПараметрыФайла = Новый Структура();
	ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов", СсылкаНаВладельца);
	ПараметрыФайла.Вставить("ИмяБезРасширения", ИмяБезРасширения);
	ПараметрыФайла.Вставить("РасширениеБезТочки", РасширениеБезТочки);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ДатаСведений);
	ПараметрыФайла.Вставить("Описание", "");
	ПараметрыФайла.Вставить("Служебный", Ложь);
	
	ДобавленныйФайл = РаботаСФайлами.ДобавитьФайл(
	ПараметрыФайла, АдресДвоичныхДанных, "", СокрЛП(ИмяФайла));
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ШаблонТекста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Удаление временного %1 файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
		Расширение);
		
		ЗаписьЖурналаРегистрации(ШаблонТекста,
		УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление временного PDF файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
	ИмяПриложенногоФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1.pdf'"), ИмяФайла);
	
	Результат = Новый Структура;
	Результат.Вставить("ДобавленныйФайл", ДобавленныйФайл);
	Результат.Вставить("ИмяПриложенногоФайла", ИмяПриложенногоФайла);
	
	Возврат Результат;
	
КонецФункции	

&НаСервере
Функция СведенияПредставленияФайлаРегистрУчетаЭДПОД(ДокументРегистрУчета)
	
	ДатаСведений = ТекущаяДатаСеанса();
	ТекстовоеСодержимое = "";
	ИмяПриложенногоФайла = "";
	
	Расширение = "pdf";
	ТипФайлаТабДок = ТипФайлаТабличногоДокумента.PDF_A_3; 
	
	Реквизиты = "Описание, Дата";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрУчета,Реквизиты);
	ИмяФайлаСПробелами = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Регистр учета от %1, %2)'"), ЗначенияРеквизитов.Дата,ЗначенияРеквизитов.Описание);
	ИмяФайлаБезПробелов = СтрЗаменить(ИмяФайлаСПробелами," ","_");
	
	ИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ИмяФайлаБезПробелов, "_");
	Если СтрДлина(ИмяФайла) > 150 Тогда
		ИмяФайла = Сред(ИмяФайла,1,149);		
		ИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1)'"), ИмяФайла);
	КонецЕсли;
	
	ТабличныйДокументОсновной = Документы.РегистрУчета.ПолучитьПечатнуюФормуТекущегоДокумента(ДокументРегистрУчета);
	
	АдресТабличногоДокумента = ПоместитьВоВременноеХранилище(ТабличныйДокументОсновной);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ТабличныйДокументОсновной.Записать(ИмяВременногоФайла, ТипФайлаТабДок);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	АдресДвоичныхДанных = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	ИмяБезРасширения = ИмяФайла;
	РасширениеБезТочки = Расширение;
	СсылкаНаВладельца = ДокументОснование;
	
	ПараметрыФайла = Новый Структура();
	ПараметрыФайла.Вставить("Автор", Пользователи.ТекущийПользователь());
	ПараметрыФайла.Вставить("ВладелецФайлов", СсылкаНаВладельца);
	ПараметрыФайла.Вставить("ИмяБезРасширения", ИмяБезРасширения);
	ПараметрыФайла.Вставить("РасширениеБезТочки", РасширениеБезТочки);
	ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", ДатаСведений);
	ПараметрыФайла.Вставить("Описание", "");
	ПараметрыФайла.Вставить("Служебный", Ложь);
	
	ДобавленныйФайл = РаботаСФайлами.ДобавитьФайл(
	ПараметрыФайла, АдресДвоичныхДанных, "", СокрЛП(ИмяФайла));
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ШаблонТекста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Удаление временного %1 файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
		Расширение);
		
		ЗаписьЖурналаРегистрации(ШаблонТекста,
		УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Удаление временного PDF файла'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
	ИмяПриложенногоФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	НСтр("ru='%1.pdf'"), ИмяФайла);
	
	Результат = Новый Структура;
	Результат.Вставить("ДобавленныйФайл", ДобавленныйФайл);
	Результат.Вставить("ИмяПриложенногоФайла", ИмяПриложенногоФайла);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьВидСведенийНаименованиеДокумента(Строка)
	
	Если СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Инвентарные карточки объектов'")) > 0 
		ИЛИ СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Инвентарная_карточка'")) > 0 Тогда
		Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.КопииИнвентарныхКарточек");
		Строка.НаименованиеДокументаФайла = НСтр("ru='Инвентарные карточки объектов'");
	ИначеЕсли СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Карточки капвложений'")) > 0 
		ИЛИ СтрНайти(Строка.НаименованиеФайла, НСтр("ru='Карточка_капвложений'")) > 0 ТОгда
		Строка.ВидСведений = ПредопределенноеЗначение("Перечисление.ВидыСведенийПриложенийАктаПриемаПередачиНФА.КопииКарточекКапитальныхВложений");
		Строка.НаименованиеДокументаФайла = НСтр("ru='Карточки капитальных вложений'"); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриложенныеДокументыПометкаУдаленияНаСервере()
	
	Для Каждого ТекСтрока Из СписокУдаленныхДокументов Цикл
		
		УдаляемыйЭлемент = ТекСтрока.Значение;
		Если НЕ ЗначениеЗаполнено(УдаляемыйЭлемент) Тогда
			Продолжить;
		КонецЕсли; 
		ОбъектФайла = УдаляемыйЭлемент.ПолучитьОбъект();
		
		Если НЕ ОбъектФайла.ПометкаУдаления Тогда 
			
			ОбъектФайла.ПометкаУдаления = Истина; 
			ОбъектФайла.Записать(); 
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
