// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЦентрализованноеСнабжение.УстановитьУсловноеОформлениеСпискаВидовИзвещений(ЭтотОбъект);
	Параметры.Свойство("ТекущаяСтрока", НачальноеЗначениеСписка);
	ЦентрализованноеСнабжение.ЗаполнитьСписокВидовИзвещений(ЭтотОбъект,
		Перечисления.ВидыОперацийИсходящееИзвещение.ПустаяСсылка());
	
	ПоказыватьИсходящиеОперацииОтЗаказчика = Истина;
	ПоказыватьИсходящиеОперацииОтПолучателя = Истина;
	ПоказыватьОтветныеОперацииОтЗаказчика = Истина;
	ПоказыватьОтветныеОперацииОтПолучателя = Истина;

	ОбновитьСоставВидимойТаблицы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЦентрализованноеСнабжениеКлиент.УстановитьТекущуюСтрокуСписка(ЭтотОбъект, НачальноеЗначениеСписка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьИсходящиеОперацииОтЗаказчикаПриИзменении(Элемент)
	ПриИзмененииОтбораПоВидам();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьИсходящиеОперацииОтПолучателяПриИзменении(Элемент)
	ПриИзмененииОтбораПоВидам();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОтветныеОперацииОтЗаказчикаПриИзменении(Элемент)
	ПриИзмененииОтбораПоВидам();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьОтветныеОперацииОтПолучателяПриИзменении(Элемент)
	ПриИзмененииОтбораПоВидам();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыборЗначения();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОбработатьВыборЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	ОбработатьВыборЗначения();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииОтбораПоВидам()
	ПараметрыЗаполнения = ПараметрыЗаполненияСписка(ЭтотОбъект);
	ЦентрализованноеСнабжениеКлиент.ПриИзмененииОтбораПоВидам(ЭтотОбъект, ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыЗаполненияСписка(Форма)
	ПараметрыЗаполнения = ЦентрализованноеСнабжениеКлиентСервер.ПараметрыОбновленияСоставаВидимойТаблицыПеречисления();
	ПараметрыЗаполнения.ПоказыватьОперацииОтЗаказчика = Форма.ПоказыватьИсходящиеОперацииОтЗаказчика;
	ПараметрыЗаполнения.ПоказыватьОперацииОтПолучателя = Форма.ПоказыватьИсходящиеОперацииОтПолучателя;
	ПараметрыЗаполнения.ПоказыватьОперацииЭДООтЗаказчика = Форма.ПоказыватьОтветныеОперацииОтЗаказчика;
	ПараметрыЗаполнения.ПоказыватьОперацииЭДООтПолучателя = Форма.ПоказыватьОтветныеОперацииОтПолучателя;
	ПараметрыЗаполнения.ЗаголовокОперацииОтЗаказчика = НСтр("ru = 'Исходящие операции (документооборот со стороны отправителя)'");
	ПараметрыЗаполнения.ЗаголовокОперацииОтПолучателя = НСтр("ru = 'Исходящие операции (документооборот со стороны получателя)'");
	ПараметрыЗаполнения.ЗаголовокОперацииЭДООтЗаказчика = НСтр("ru = 'Ответные операции ЭДО (документооборот со стороны отправителя)'");
	ПараметрыЗаполнения.ЗаголовокОперацииЭДООтПолучателя = НСтр("ru = 'Ответные операции ЭДО (документооборот со стороны получателя)'");
	Возврат ПараметрыЗаполнения;
КонецФункции

// Обновить состав видимой таблицы.
// 
// Параметры:
//  Форма - см. Перечисление.ВидыОперацийИсходящееИзвещение.Форма.ФормаВыбора2
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСоставВидимойТаблицы(Форма)
	ПараметрыЗаполнения = ПараметрыЗаполненияСписка(Форма);
	ЦентрализованноеСнабжениеКлиентСервер.ОбновитьСоставВидимойТаблицыПеречисления(Форма, ПараметрыЗаполнения);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборЗначения()
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(ТекущиеДанные.Ссылка);
КонецПроцедуры

#КонецОбласти
