&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Инициализация
	ТекстЗаголовкаСообщений = НСтр("ru='Ввод начальных остатков по родительской плате'");
	//КомментарийРежимРаботы_ТолькоБухОстатки = НСтр("ru='Вводятся только бухгалтерские остатки (группа не указана)'");
	//КомментарийРежимРаботы_БухОстаткиИСоставГруппы = НСтр("ru='Вводятся и бухгалтерские остатки и ставки оплаты (группа указана)'");
	
	НастроитьФормуКлиент();
	
	ВводНачальныхОстатковКлиент.ПриОткрытии(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Подбор детей:
	Если ИсточникВыбора.ИмяФормы = "Справочник.Дети.Форма.ФормаВыбора" Тогда
		РебенокСсылка = ВыбранноеЗначение;
		
		// Заполняем поля "Ребенок" и "Договор" новой строки:
		НовыеДанные = ПолучитьДоговорРебенкаСервер(РебенокСсылка, Объект["НаправлениеДеятельности"]);
		СтрокаТЧ = Объект["РодительскаяПлата"].Добавить();
		НовыеДанные.Вставить("Ребенок", РебенокСсылка);
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, НовыеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьЗаголовокФормы();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
	// Оповещаем форму Помощника ввода начальных остатков:
	ИмяСобытия = "ЗаписанДокументВводНачальныхОстатков";
	Параметр = Объект["Организация"];
	Оповестить(ИмяСобытия, Параметр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииКлиент();
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьДетейВГруппуПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииПринятьДетейВГруппу();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РодительскаяПлата

&НаКлиенте
Процедура РодительскаяПлатаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСведенияТекущегоРебенкаВОстальныхСтрокахКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура РодительскаяПлатаРебенокПриИзменении(Элемент)
	
	ТекДанные = Элементы["РодительскаяПлата"].ТекущиеДанные;
	РебенокСсылка = ТекДанные["Ребенок"];
	
	НовыеДанные = ПолучитьДоговорРебенкаСервер(РебенокСсылка, Объект["НаправлениеДеятельности"]);
	
	ЗаполнитьЗначенияСвойств(ТекДанные, НовыеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РодительскаяПлатаЗадолженностьПриИзменении(Элемент)
	
	ТекДанные = Элементы["РодительскаяПлата"].ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные["Задолженность"]) Тогда
		ТекДанные["Переплата"] = 0;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура РодительскаяПлатаПереплатаПриИзменении(Элемент)
	
	ТекДанные = Элементы["РодительскаяПлата"].ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные["Переплата"]) Тогда
		ТекДанные["Задолженность"] = 0;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьДетей(Команда)
	
	Если ЗначениеЗаполнено(Объект["Организация"]) Тогда
		ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриВыборе",
			Новый Структура("Организация", Объект["Организация"]),
			Ложь);
			
		ОткрытьФорму("Справочник.Дети.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ТекстСообщения = НСтр("ru='Сначала выберите организацию'");
		ИмяПоляДляВыводаСообщения = "Организация";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект." + ИмяПоляДляВыводаСообщения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискомДетейИзГруппы(Команда)
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		ТекстСообщения	= НСтр("ru='Перед заполнением будет очищена
			|табличная часть %1
			|
			|Продолжить и заполнить?'");
		ИмяКоманды		= "ЗаполнитьСпискомДетейИзГруппы";
		
		Если ПодтвердитьИзменениеТабличнойЧасти(
			"РодительскаяПлата",				// имя
			НСтр("ru='Родительская плата'"),	// представление
			ТекстСообщения,
			ИмяКоманды)	Тогда
			
			ЗаполнитьСпискомДетейИзГруппыКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискомДетейНеВГруппах(Команда)
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		ТекстСообщения	= НСтр("ru='Перед заполнением будет очищена
			|табличная часть %1
			|
			|Продолжить и заполнить?'");
		ИмяКоманды		= "ЗаполнитьСпискомДетейЕщеНеЗачисленныхВГруппы";
		
		Если ПодтвердитьИзменениеТабличнойЧасти(
			"РодительскаяПлата",				// имя
			НСтр("ru='Родительская плата'"),	// представление
			ТекстСообщения,
			ИмяКоманды)	Тогда
			
			ЗаполнитьСпискомДетейЕщеНеЗачисленныхВГруппыКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискомВсехДетей(Команда)
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		ТекстСообщения	= НСтр("ru='Перед заполнением будет очищена
			|табличная часть %1
			|
			|Продолжить и заполнить?'");
		ИмяКоманды		= "ЗаполнитьСпискомВсехДетей";
		
		Если ПодтвердитьИзменениеТабличнойЧасти(
			"РодительскаяПлата",				// имя
			НСтр("ru='Родительская плата'"),	// представление
			ТекстСообщения,
			ИмяКоманды)	Тогда
			
			ЗаполнитьСпискомВсехДетейКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПризнакАгрегатора(Команда)
	
	ВводНачальныхОстатковКлиент.СнятьПризнакАгрегатора(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЗаголовокФормы = "Ввод начальных остатков по родительской плате ";
	Если Объект.Ссылка.Пустая() Тогда
		ЗаголовокФормы = ЗаголовокФормы + "(создание)";
	Иначе
		ЗаголовокФормы = ЗаголовокФормы + Объект.Номер + " от " + Объект.Дата;
	КонецЕсли;
	ЭтаФорма.Заголовок = ЗаголовокФормы;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСогласноНастройкамВеденияРодительскойПлаты()
	
	ИспользоватьУчетРодительскойПлаты = ПолучитьФункциональнуюОпцию("ИспользоватьУчетРодительскойПлаты");
	
	РазрешитьРаботуСФормой = ИспользоватьУчетРодительскойПлаты
		И ПравоДоступа("Изменение", Объект.Ссылка.Метаданные());
	
	Если НЕ ИспользоватьУчетРодительскойПлаты Тогда
		
		// В программе не ведется учет родительской платы.
		ТекстСообщения = НСтр("ru='В программе не ведется учет расчетов за содержание детей в ДДУ (родительская плата). Документ не предназначен для работы в таком режиме.
			|Включить учет расчетов за содержание детей в ДДУ можно в разделе «Учет расчетов за содержание детей в ДДУ» в настройках параметров учета (по гиперссылке «Специализированные подсистемы» в разделе «Администрирование - Настройка параметров учета»).'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка);
		
		// 1. Доступность
		ИменаДоступность = "
			// Командные панели:
			|ФормаКоманднаяПанель,
			|РодительскаяПлатаКоманднаяПанель,
			// Отдельные элементы:
			|ГруппаШапка,
			|Комментарий";
		// Все элементы на вкладке "Бухгалтерская операция":	
		Для Каждого Элем Из Элементы.БухгалтерскаяОперация.ПодчиненныеЭлементы Цикл
			ИменаДоступность = ИменаДоступность + "," + Элем.Имя;
		КонецЦикла;
		ИменаДоступность = Новый Структура(ИменаДоступность);
		Для Каждого Элем Из ИменаДоступность Цикл
			Элементы[Элем.Ключ].Доступность = Ложь;
		КонецЦикла;
		
		// 2. ТолькоПросмотр
		ИменаТолькоПросмотр = Новый Структура("
			|Страницы");
		Для Каждого Элем Из ИменаТолькоПросмотр Цикл
			Элементы[Элем.Ключ].ТолькоПросмотр = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Инициализация:
	// Заполняем список выбора "КФО" значениями из уч.пол., плюс доп.ограничения:
	ЗаполнитьСписокВыбораКФОСервер();
	
	Элементы["ПодразделениеОрганизации"].Видимость = Документы.ВводНачальныхОстатков.ПодразделениеОбязательноКЗаполнению(Объект);
	
	// Заполняем по возможности пустые поля формы:
	Если Объект.Ссылка.Пустая() Тогда
		
		СписокВыбораКФО = Элементы["КФО"].СписокВыбора;
		Если НЕ ЗначениеЗаполнено(Объект["КФО"]) И СписокВыбораКФО.Количество() = 1 Тогда
			Объект["КФО"] = СписокВыбораКФО[0].Значение;
		КонецЕсли;
		
		Попытка
			
			ЭтаФорма.ТиповаяОперация = Справочники.ТиповыеОперации.ВводНачальныхОстатков_РодительскаяПлата;
			
			ПодключаемыйСервер_ПриИзмененииТиповойОперации("ТиповыеОперации_ТиповаяОперацияДокумента");
			
		Исключение
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьЗаголовокФормы();
	
	// Настраиваем форму, учитывая, ведется ли учет родительской платы вообще в программе:
	НастроитьФормуСогласноНастройкамВеденияРодительскойПлаты();
	
	// Если нет прав на изменение документа, то дополнительно отключаем еще элементы:
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект,
		"РодительскаяПлатаКоманднаяПанель");
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуКлиент()
	
	// Настраиваем форму, только если она вообще в рабочем режиме:
	Если РазрешитьРаботуСФормой Тогда
		НовДоступность = ЗначениеЗаполнено(Объект.Организация);
		Элементы["ПодразделениеОрганизации"].Доступность	= НовДоступность;
		Элементы["Страницы"].ТолькоПросмотр					= НЕ НовДоступность;
		
		НастроитьФормуКлиент_ПриИзмененииПринятьДетейВГруппу();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуКлиент_ПриИзмененииПринятьДетейВГруппу()
	
	// Настраиваем форму, только если она вообще в рабочем режиме:
	Если РазрешитьРаботуСФормой Тогда
		// Заголовок колонки:
		ПринятьДетейВГруппуЗаголовокКолонки = ?(Объект["ПринятьДетейВГруппу"],
			"",
			НСтр("ru='(не заполняется)'"));
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список выбора "КФО" значениями из уч.пол., плюс доп.ограничения (КФО=2 или 4).
&НаСервере
Процедура ЗаполнитьСписокВыбораКФОСервер()
	
	СписокЗначенийКФО = Новый СписокЗначений;
	
	БухгалтерскийУчет.ЗаполнитьСписокКФО(
		СписокЗначенийКФО,
		Объект.КФО,
		ПолучитьМассивКФОНаСервере(),
		"КФО",
		"",
		Новый Структура("Организация, ИФО, Дата, НаНачалоСледующегоГода", Объект.Организация, Объект.ИФО, Объект.Дата, Истина));
		
	Элементы.КФО.СписокВыбора.ЗагрузитьЗначения(СписокЗначенийКФО.ВыгрузитьЗначения());
	Элементы.КФО.РежимВыбораИзСписка = Истина;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ПолучитьМассивКФОНаСервере()
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.КВД.Бюджет);
	Результат.Добавить(Перечисления.КВД.Внебюджет);
	Результат.Добавить(Перечисления.КВД.СубсидииНаГосзадание);
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоговорРебенкаСервер(Ребенок, НаправлениеДеятельности)
	
	Результат = Новый Структура();
	
	ИскатьДоговор = Ложь;
	Если ЗначениеЗаполнено(Ребенок) Тогда
		Организация = Ребенок["Организация"];
		Контрагент = Ребенок["Контрагент"];
		
		Если ЗначениеЗаполнено(Организация)
			И ЗначениеЗаполнено(Контрагент)
			И ЗначениеЗаполнено(НаправлениеДеятельности)
			Тогда
			ИскатьДоговор = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ИскатьДоговор Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Настраиваем запрос:
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Организация", Организация);
	ЗапросПоиск.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросПоиск.УстановитьПараметр("НаправлениеДеятельности", НаправлениеДеятельности);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	Договоры.Ссылка	КАК Договор
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.ПометкаУдаления = ЛОЖЬ
	|	И Договоры.Организация = &Организация
	|	И Договоры.Контрагент = &Контрагент
	|	И Договоры.НаправлениеДеятельности = &НаправлениеДеятельности
	|;";
	
	МассивСсылок = ЗапросПоиск.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");
	
	Если МассивСсылок.Количество() = 1 Тогда
		Результат.Вставить("Договор", МассивСсылок[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//---
// Обработчики событий элементов формы

&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОрганизацияПередИзменениемКлиент_Ответ", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении,
		НСтр("ru='Изменение организации вызовет полную очистку
		|табличной части документа и некоторых полей шапки.
		|
		|Продолжить и сменить организацию?'"),
		РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		Объект["Организация"] = ПараметрыОповещения["ВыбранноеЗначение"];
		ЭтаФорма.Модифицированность = Истина;
		ОрганизацияПриИзмененииКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзмененииКлиент()
	
	ОрганизацияПриИзмененииСервер();
	
	НастроитьФормуКлиент();
	
КонецПроцедуры
&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	ОчиститьРеквизитыТабличнойЧастиНесоответствующиеОрганизации();
	
КонецПроцедуры
&НаСервере
Процедура ОчиститьРеквизитыТабличнойЧастиНесоответствующиеОрганизации()
	
	// Очищаем табличную часть документа:
	Объект.РодительскаяПлата.Очистить();
	
	// Устанавливаем новую дату документа:
	Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
	
	// Заполняем список выбора "КФО" значениями из уч.пол., плюс доп.ограничения:
	ЗаполнитьСписокВыбораКФОСервер();
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииСервер()
	
	// Заполняем список выбора "КФО" значениями из уч.пол., плюс доп.ограничения:
	ЗаполнитьСписокВыбораКФОСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	// Заполняем список выбора "КФО" значениями из уч.пол., плюс доп.ограничения:
	ЗаполнитьСписокВыбораКФОСервер();
	
КонецПроцедуры

//--------------------------------------------------------------------------------
// Заполнение табличных частей

&НаКлиенте
Функция НеобходимыеРеквизитыЗаполнены()
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.Организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле ""Дата"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.Дата");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПодтвердитьИзменениеТабличнойЧасти(ИмяТЧ, СинонимТЧ, ТекстВопроса = "", ИмяКоманды = "")
	
	// Есть ли в проверяемой табл.части строки?
	ТаблЧасть = Объект[ИмяТЧ];
	Если ТаблЧасть.Количество() = 0 Тогда
		Результат = Истина;
		
	Иначе
		Результат = Ложь;
		Если ПустаяСтрока(ТекстВопроса) Тогда
			ТекстВопроса = НСтр("ru='Очистить табличную часть %1?'");
		КонецЕсли;
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, СинонимТЧ);
		
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("ИмяКоманды", ИмяКоманды);
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПодтвердитьИзменениеТабличнойЧасти_Ответ", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
&НаКлиенте
Процедура ПодтвердитьИзменениеТабличнойЧасти_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		Если ПараметрыОповещения["ИмяКоманды"] = "ЗаполнитьСпискомДетейИзГруппы" Тогда
			ЗаполнитьСпискомДетейИзГруппыКлиент();
			
		ИначеЕсли ПараметрыОповещения["ИмяКоманды"] = "ЗаполнитьСпискомДетейЕщеНеЗачисленныхВГруппы" Тогда
			ЗаполнитьСпискомДетейЕщеНеЗачисленныхВГруппыКлиент();
			
		ИначеЕсли ПараметрыОповещения["ИмяКоманды"] = "ЗаполнитьСпискомВсехДетей" Тогда
			ЗаполнитьСпискомВсехДетейКлиент();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискомДетейИзГруппыКлиент()
	
	ЗаполнитьСпискомДетейИзГруппыСервер();
	
	Если Объект["РодительскаяПлата"].Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В указанной группе детского учреждения не числится ни один ребенок'");
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСпискомДетейИзГруппыСервер()
	
	Документы.ВводНачальныхОстатков.Заполнить_СпискомДетейИзУказанойГруппы_РодительскаяПлата(Объект);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискомДетейЕщеНеЗачисленныхВГруппыКлиент()
	
	ЗаполнитьСпискомДетейЕщеНеЗачисленныхВГруппыСервер();
	
	Если Объект["РодительскаяПлата"].Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Отсутствуют дети, которые не числятся в группах'");
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСпискомДетейЕщеНеЗачисленныхВГруппыСервер()
	
	Документы.ВводНачальныхОстатков.Заполнить_СпискомДетейЕщеНеЗачисленныхВГруппы_РодительскаяПлата(Объект);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСпискомВсехДетейКлиент()
	
	ЗаполнитьСпискомВсехДетейСервер();
	
	Если Объект["РодительскаяПлата"].Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='В указанной организации не числится ни один ребенок'");
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьСпискомВсехДетейСервер()
	
	Документы.ВводНачальныхОстатков.Заполнить_СпискомВсехДетей_РодительскаяПлата(Объект);
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСведенияТекущегоРебенкаВОстальныхСтрокахКлиент()
	// Максимальное количество строк для выполнения обработки на клиенте:
	Перем МаксКолвоСтрок;
	
	МаксКолвоСтрок = 40;
	
	// Входная проверка:
	ИмяТаблЧасти = "РодительскаяПлата";
	ТекДанные = Элементы[ИмяТаблЧасти].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	Иначе
		РебенокСсылка = ТекДанные["Ребенок"];
		Если НЕ ЗначениеЗаполнено(РебенокСсылка) Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТиражируемыеКолонки = Новый Структура("СтавкаОплаты, Льгота, ДатаВключения");
	ЗаполнитьЗначенияСвойств(ТиражируемыеКолонки, ТекДанные);
	Если Объект[ИмяТаблЧасти].Количество() > МаксКолвоСтрок Тогда
		// Выполняем обработку на сервере.
		ОбновитьСведенияТекущегоРебенкаВОстальныхСтрокахСервер(ИмяТаблЧасти, РебенокСсылка, ТиражируемыеКолонки);
	Иначе
		// Выполняем обработку на клиенте.
		Поиск = Новый Структура("Ребенок", РебенокСсылка);
		МассивСтрок = Объект[ИмяТаблЧасти].НайтиСтроки(Поиск);
		Для Каждого СтрокаТЧ Из МассивСтрок Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТиражируемыеКолонки);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ОбновитьСведенияТекущегоРебенкаВОстальныхСтрокахСервер(ИмяТаблЧасти, РебенокСсылка, ТиражируемыеКолонки);
	
	Поиск = Новый Структура("Ребенок", РебенокСсылка);
	МассивСтрок = Объект[ИмяТаблЧасти].НайтиСтроки(Поиск);
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТиражируемыеКолонки);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ТиповыеОперации

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)
	
	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)
	
	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

#КонецОбласти
