
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Организация = Параметры.Организация;
	Контрагент = Параметры.Контрагент;
	Договор = Параметры.Договор;
	ВидДоговора = Параметры.ВидДоговора;
	ДействующийДокумент = Параметры.ДействующийДокумент;
	
	ВедетсяУчетОбязательств = УчетРасчетовКлиентСервер.ВедетсяУчетОбязательств(ВидДоговора);
	
	ЭлементыУчетОбязательств = Новый Массив;
	ЭлементыУчетОбязательств.Добавить("СрокиИсполненияИСуммыОбязательствВидОбязательства");
	ЭлементыУчетОбязательств.Добавить("СрокиИсполненияИСуммыОбязательствСумма");
	ЭлементыУчетОбязательств.Добавить("СрокиИсполненияИСуммыОбязательствСуммаВВалюте");
	ЭлементыУчетОбязательств.Добавить("СрокиИсполненияИСуммыОбязательствВалютаРасчетов");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыУчетОбязательств, "Видимость", ВедетсяУчетОбязательств);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СрокиИсполненияИСуммыОбязательств,
		"Обязательство", Договор, ВидСравненияКомпоновкиДанных.Равно, , Истина, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРезультат = Новый Структура("Договор, Контрагент, Организация");
	ЗаполнитьЗначенияСвойств(СтруктураРезультат, ЭтотОбъект);
	
	ОповеститьОВыборе(СтруктураРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРегистрацияОбязательствИСведенийПоДоговорам(Команда)
	
	Если ЗначениеЗаполнено(ДействующийДокумент) Тогда
		ПараметрыФормы = Новый Структура("Основание", ДействующийДокумент);
	Иначе
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		ЗначенияЗаполнения.Вставить("Контрагент", Контрагент);
		ЗначенияЗаполнения.Вставить("Договор", Договор);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	ФормаНовогоДокумента = ОткрытьФорму("Документ.РегистрацияОбязательствИСведенийПоДоговорам.ФормаОбъекта",
		ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , , РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

#КонецОбласти
