
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДополнитьДанныеТабличнойЧасти(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаДату", ЭтотОбъект.Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СпособОтраженияЗарплатыВБухУчете КАК СпособОтражения,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Организация КАК Организация,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодНалоговогоОргана КАК КодНалоговогоОргана,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ВидОперации КАК ВидОперацииЗГУ,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СчетДт КАК Счет,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто1 КАК Субконто1,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто2 КАК Субконто2,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.Субконто3 КАК Субконто3,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СчетНУ КАК СчетНУ,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ1 КАК СубконтоНУ1,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ2 КАК СубконтоНУ2,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.СубконтоНУ3 КАК СубконтоНУ3,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ОтражениеВУСН КАК ОтражениеВУСН,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.НеИспользоватьВходящиеДанныеЗГУ КАК НеИспользоватьВходящиеДанныеЗГУ,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодЦели КАК КодЦели,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.КодМероприятия КАК КодМероприятия,
	               |	НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних.ДопКлассификация КАК ДопКлассификация
	               |ИЗ
	               |	РегистрСведений.НастройкаСпособовОтраженияЗарплатыВБухУчете.СрезПоследних(&НаДату, ) КАК НастройкаСпособовОтраженияЗарплатыВБухУчетеСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.СтатьяФинансированияЗарплата КАК СтатьяФинансированияЗГУ,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.Организация КАК Организация,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.ВидОперации КАК ВидОперацииЗГУ,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КЭК КАК КЭКСтатьи,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.ИФО КАК ИФО,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КФО КАК КФО,
	               |	НастройкаСтатейФинансированияЗарплатаСрезПоследних.КПС КАК КПС
	               |ИЗ
	               |	РегистрСведений.НастройкаСтатейФинансированияЗарплата.СрезПоследних(&НаДату, ) КАК НастройкаСтатейФинансированияЗарплатаСрезПоследних";
	
	Результат = Запрос.ВыполнитьПакет();
	
	НастройкаСпОтр = Результат[0].Выгрузить();
	НастройкаСпОтр.Индексы.Добавить("СпособОтражения,Организация,КодНалоговогоОргана,ВидОперацииЗГУ");
	
	НастройкаСтФин = Результат[1].Выгрузить();
	НастройкаСтФин.Индексы.Добавить("СтатьяФинансированияЗГУ,Организация,ВидОперацииЗГУ,КЭКСтатьи");
	
	ВидОперацииЗГУ = Перечисления.ВидыОперацийПоЗарплате.ВедомостьНаВыплатуЗарплатыВБанк;
	
	Для Каждого СтрокаОперации Из ЭтотОбъект.РасшифровкаПлатежа Цикл
		
		СтрокаОперации.Сотрудник = СотрудникПоКонтрагенту(Контрагент, Организация);
		СтрокаОперации.Контрагент = Контрагент;
		
		СтруктураОтбораСтФин = Новый Структура;
		СтруктураОтбораСтФин.Вставить("СтатьяФинансированияЗГУ",СтрокаОперации.СтатьяФинансированияЗарплата);
		СтруктураОтбораСтФин.Вставить("Организация", ЭтотОбъект.Организация);
		СтруктураОтбораСтФин.Вставить("ВидОперацииЗГУ", ВидОперацииЗГУ);
		СтруктураОтбораСтФин.Вставить("КЭКСтатьи", СтрокаОперации.КЭК);
		
		СтрокаСтФин = Документы.ОтражениеЗарплатыВУчете.НайтиСтрокуСтФин(СтруктураОтбораСтФин, НастройкаСтФин);
		
		Если СтрокаСтФин.Количество() = 0 Тогда 
			СтруктураОтбораСтФин.КЭКСтатьи = Справочники.КОСГУ.ПустаяСсылка();
			СтрокаСтФин = Документы.ОтражениеЗарплатыВУчете.НайтиСтрокуСтФин(СтруктураОтбораСтФин, НастройкаСтФин);
		КонецЕсли;
		
		Если СтрокаСтФин.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОперации, СтрокаСтФин[0]);
		КонецЕсли;
		
		СтруктураОтбораСпОтр = Новый Структура;
		СтруктураОтбораСпОтр.Вставить("СпособОтражения", СтрокаОперации.СпособОтраженияЗарплатыВБухУчете);
		СтруктураОтбораСпОтр.Вставить("Организация", ЭтотОбъект.Организация);
		СтруктураОтбораСпОтр.Вставить("ВидОперацииЗГУ", ВидОперацииЗГУ);
		
		СтрокаСпОтр = НастройкаСпОтр.НайтиСтроки(СтруктураОтбораСпОтр);
		
		Если СтрокаСпОтр.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаОперации, СтрокаСпОтр[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаОперации Из ЭтотОбъект.Состав Цикл
		
		СтрокаОперации.Контрагент = Контрагент;
		
	КонецЦикла;
	
	УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	УчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	
	КолонкиГруппировки = "ИдентификаторСтроки,
			               |Контрагент,
			               |Сотрудник,
			               |ДопКлассификация,
			               |КодМероприятия,
			               |КодЦели,
			               |ВидВыплатНаКартуМИР,
			               |КПС,
			               |КФО,
			               |КЭК,
			               |СтатьяФинансированияЗарплата,
			               |СпособОтраженияЗарплатыВБухУчете,
			               |ИФО,
			               |Подразделение,
			               |КодВидаДохода";
	
	Если Не УчетПоПодразделениям Тогда
		КолонкиГруппировки = СтрЗаменить(КолонкиГруппировки, "Подразделение,", "");
	КонецЕсли;
	
	Если Не УчетПоИФО Тогда
		КолонкиГруппировки = СтрЗаменить(КолонкиГруппировки, "ИФО,", "");
	КонецЕсли;
	
	РасшифровкаПлатежа.Свернуть(КолонкиГруппировки, "Сумма");
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ПроцессыОбработкиДокументов_ЗаписатьБезПроверкиИсполнителяЭтапа");
	
	ЭтотОбъект.Записать();
	
КонецПроцедуры

Функция СотрудникПоКонтрагенту(ТекКонтрагент, ТекОрганизация)
	Результат = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Сотрудники.Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Контрагент = &Контрагент
	|	И Сотрудники.Владелец = &Организация";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", ТекОрганизация);
	Запрос.УстановитьПараметр("Контрагент", ТекКонтрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ОбщегоНазначенияБГУПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоИФО") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.ИФО");
	КонецЕсли;
	
	Если Не ОбщегоНазначенияБГУПовтИсп.ЗначениеФункциональнойОпции("ИспользоватьУчетПоПодразделениям") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("РасшифровкаПлатежа.Подразделение");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = Состав.Итог("Сумма");
	СуммаДокументаВзыскано = Состав.Итог("Взыскано");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
