
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ВидОтчета",ВидОтчета);
	Параметры.Свойство("КодыСтрокОтчета",КодыСтрокОтчета);
	
	Если Не ЗначениеЗаполнено(ВидОтчета) Тогда
		
		ВызватьИсключение "Не передан вид отчета";
	КонецЕсли;
	
	ЗаполнитьПоВидуОтчета();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСтрок
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьСтроки(Команда)
	
	МассивСтрок = ВыбратьСтрокиТаблицы();
	
	ОповеститьОВыборе(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	УстановитьИспользованиеВСпискиСтрок(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	УстановитьИспользованиеВСпискиСтрок(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоВидуОтчета()
	
	МассивСтрок = Новый Массив;
	Если Не ПустаяСтрока(КодыСтрокОтчета) Тогда
		МассивСтрок = СтрРазделить(КодыСтрокОтчета,";");
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА &БезОтбораСтрок
	               |			ТОГДА ЛОЖЬ
	               |		КОГДА СтрокиОтчетов.Код В (&МассивСтрок)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Использовать,
	               |	СтрокиОтчетов.Код,
	               |	СтрокиОтчетов.Наименование,
	               |	СтрокиОтчетов.ПорядковыйНомер,
	               |	СтрокиОтчетов.ГруппаРаскрытия,
	               |	СтрокиОтчетов.Ссылка
	               |ИЗ
	               |	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	               |ГДЕ
	               |	СтрокиОтчетов.Владелец = &ВидОтчета";
				   
	Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
	Запрос.УстановитьПараметр("МассивСтрок",МассивСтрок);
	Запрос.УстановитьПараметр("БезОтбораСтрок",МассивСтрок.Количество() = 0);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ЗначениеВРеквизитФормы(Результат,"СписокСтрок");
	
КонецПроцедуры

&НаСервере
Функция ВыбратьСтрокиТаблицы()
	
	ТаблицаСтрок = РеквизитФормыВЗначение("СписокСтрок");
	ВыбраннаяТаблица = ТаблицаСтрок.Скопировать(Новый Структура("Использовать",Истина));
	
	Если НЕ ВыбраннаяТаблица.Количество() Тогда
		
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат ВыбраннаяТаблица.ВыгрузитьКолонку("ссылка");
			
КонецФункции


Процедура УстановитьИспользованиеВСпискиСтрок(Флаг)
	
	Для Каждого Стр из СписокСтрок Цикл
		
		Стр.Использовать = Флаг;
		
	КонецЦикла;
	
КонецПроцедуры
	
	
#КонецОбласти