#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьХешРеквизитовВидовОтчетов() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда // В подчиненных узлах РИБ не выполняется
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	СпрКомпл.Ссылка
			|ИЗ
			|	Справочник.ВидыОтчетов КАК СпрКомпл
			|ГДЕ
			|	ПОДСТРОКА(СпрКомпл.ХешРеквизитов, 1, 1) = """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		НачатьТранзакцию();
		Попытка
		
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекОбъект,Ложь,Ложь);
		    ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать спавочник: %Справочник% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.ВидыОтчетов,
				Выборка.Ссылка,
				ТекстСообщения);
		
		КонецПопытки;
	
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьХешРеквизитовВидовОтчетов");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
