#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьПараметрыФормы();
	
	НастроитьФормуСервер();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборПоСотруднику();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	НастроитьВидимостьКолонок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	УстановитьОтборПоСотруднику()
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоСчетамПриИзменении(Элемент)
	
	ОбъединитьСтрокиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьСтрокиПоМестамИнвентаризацииПриИзменении(Элемент)
	
	ОбъединитьСтрокиПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаОтметок

&НаКлиенте
Процедура ТаблицаОтметокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ТаблицаОтметокПредставлениеДокументовОписей" Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекДанные = Элементы.ТаблицаОтметок.ТекущиеДанные;
		
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СписокДокументовОписей = ТекДанные.СписокДокументовОписей;
		
		Если СписокДокументовОписей.Количество() = 1 Тогда
			ВыбраннаяОпись = СписокДокументовОписей.Получить(0).Значение;
			
			Если ВыбраннаяОпись = ОписьСсылка Тогда
				Возврат;
			КонецЕсли;
			
			ПоказатьЗначение(, ВыбраннаяОпись);
			
		ИначеЕсли СписокДокументовОписей.Количество() > 1 Тогда
			Оповещение = Новый ОписаниеОповещения("ВыбранДокументОписи", ЭтаФорма);
			
			ПоказатьВыборИзСписка(Оповещение, ТекДанные.СписокДокументовОписей);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокОтметкаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаОтметок.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НеобходимоОчиститьПрежниеОтметки() Тогда
		ОчиститьКолонкуОтметка(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокКодСтрокиПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокСчетПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокСотрудникПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокДатаИнвентаризацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокДатаИнвентаризацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокДатаНачалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокДатаНачалаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокДатаОкончанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокДатаОкончанияОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокМестоИнвентаризацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтметокПримечаниеПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	Если ТаблицаОтметок.Итог("Отметка") = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Отсутствуют отмеченные строки.
			|Необходимо отметить хотя бы одну строку'"));
		
		Возврат;
	КонецЕсли;
	
	Закрыть(ПолучитьВозвращаемоеЗначение());
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеКолонки(Команда)
	
	ПоказатьВсеКолонкиКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление(ОформитьОтсутствиеДокументов = Истина)
	
	//---
	// Оформление пустой колонки Сотрудник
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Оформление пустой колонки Сотрудник'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОтметок.СотрудникПредставление");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", ИнвентаризацияКлиентСервер.ПредставлениеПустогоСотрудникаФормаОтметок());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОтметокСотрудникПредставление");
	
	
	Если ОформитьОтсутствиеДокументов Тогда
		//---
		// Оформление пустой колонки Документы описей
		//---
		ЭлементУО = УсловноеОформление.Элементы.Добавить();
		ЭлементУО.Представление = НСтр("ru='Оформление пустой колонки Документы описей'");
		
		// Условия
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТаблицаОтметок.ПредставлениеДокументовОписей");
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		// Оформление
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='не найдены'"));
		ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
		
		// Оформляемые поля
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТаблицаОтметокПредставлениеДокументовОписей");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВозвращаемоеЗначение()
	
	Перем НомерСтроки;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОтметок Цикл
		Если СтрокаТаблицы.Отметка = 1 Тогда
			НомерСтроки = СтрокаТаблицы.НомерСтроки;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("АдресХранилища",	Параметры.АдресХранилища);
	Результат.Вставить("НомерСтроки",		НомерСтроки);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПрочитатьПараметрыФормы()
	
	Если Не ЭтоАдресВременногоХранилища(Параметры.АдресХранилища) Тогда
		ТекстСообщения = НСтр("ru='В параметре ""АдресХранилища"" ожидается строковый адрес временного хранилища, содержащего параметры формы'");
		
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ПереданнаяСтруктура = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	
	ДополнительныеПараметры = ПереданнаяСтруктура.Данные.ДополнительныеПараметры;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ПереданнаяСтруктура, "Решение,ПоследнееИзменение,ОписьСсылка");
	
	ОбщийСписокСотрудников = Новый ФиксированныйМассив(ДополнительныеПараметры.ОбщийСписокСотрудников);
	
	ОписаниеРеквизитаМОЛ = Новый ФиксированнаяСтруктура(ДополнительныеПараметры.ОписаниеРеквизитаМОЛ);
	
	ТаблицаОтметок.Загрузить(ДополнительныеПараметры.ТаблицаОтметок);
	
	// Объединение строк
	
	ДопустимостьОбъединенияСчетов = ПереданнаяСтруктура.Данные.ДополнительныеПараметры.ДопустимостьОбъединенияСчетов;
	
	ДопустимостьОбъединенияМестИнвентаризации = ПереданнаяСтруктура.Данные.ДополнительныеПараметры.ДопустимостьОбъединенияМестИнвентаризации;
	
	ОбъединитьСтрокиПоСчетам = ПереданнаяСтруктура.НастройкиОбъединенияСтрок.ПоСчетам;
	
	ОбъединитьСтрокиПоМестамИнвентаризации = ПереданнаяСтруктура.НастройкиОбъединенияСтрок.ПоМестамИнвентаризации;
	
	Если Не ДопустимостьОбъединенияСчетов Тогда
		ОбъединитьСтрокиПоСчетам = Ложь;
	КонецЕсли;
	
	Если Не ДопустимостьОбъединенияМестИнвентаризации Тогда
		ОбъединитьСтрокиПоМестамИнвентаризации = Ложь;
	КонецЕсли;
	
	НастроитьВидимостьФлажковОбъединенияСтрок();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер()
	
	НовДоступностьСотрудника = Не ОписаниеРеквизитаМОЛ.Отсутствует;
	
	Элементы.Сотрудник.ТолькоПросмотр								= Не НовДоступностьСотрудника;
	Элементы.ТаблицаОтметокСотрудникПредставление.ТолькоПросмотр	= Не НовДоступностьСотрудника;
	
	Если Не НовДоступностьСотрудника Тогда
		Элементы.Сотрудник.ПодсказкаВвода = ИнвентаризацияКлиентСервер.ПредставлениеПустогоСотрудникаФормаОтметок();
	КонецЕсли;
	
	НастроитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКолонкуОтметка(СтрокаИсключение = Неопределено)
	
	Для Каждого СтрокаТаблицы Из ТаблицаОтметок Цикл
		
		Если СтрокаТаблицы = СтрокаИсключение Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТаблицы.Отметка = 0;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСотруднику()
	
	СтруктураОтбора = Новый Структура();
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		СтруктураОтбора.Вставить("СотрудникПредставление", Строка(Сотрудник));
	КонецЕсли;
		
	НовоеЗначениеОтбора = Новый ФиксированнаяСтруктура(СтруктураОтбора);
	
	Элементы.ТаблицаОтметок.ОтборСтрок = НовоеЗначениеОтбора;
	
	ОчиститьКолонкуОтметка();
	
КонецПроцедуры
	
&НаКлиенте
Функция НеобходимоОчиститьПрежниеОтметки()
	
	Возврат (ТаблицаОтметок.Итог("Отметка") > 1);
	
КонецФункции

&НаСервере
Процедура ОбъединитьСтрокиПриИзмененииСервер()
	
	ПереданнаяСтруктура = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	
	НастройкиОбъединенияСтрок = ИнвентаризацияСервер.ПолучитьПустыеНастройкиОбъединенияСтрокДляВыбораИзРешения();
	НастройкиОбъединенияСтрок.ПоСчетам = ОбъединитьСтрокиПоСчетам;
	НастройкиОбъединенияСтрок.ПоМестамИнвентаризации = ОбъединитьСтрокиПоМестамИнвентаризации;
	
	Данные = ИнвентаризацияСервер.ПодготовитьДанныеДляВыбораИзРешения(ОписьСсылка, Решение, НастройкиОбъединенияСтрок, ПереданнаяСтруктура.Данные);
	
	ТаблицаОтметок.Загрузить(Данные.ДополнительныеПараметры.ТаблицаОтметок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранДокументОписи(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяОпись = ВыбранноеЗначение.Значение;
	
	Если ВыбраннаяОпись = ОписьСсылка Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, ВыбраннаяОпись);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеКолонкиКлиент()
	
	ПоказатьВсеКолонки = Не ПоказатьВсеКолонки;
	
	НастроитьВидимостьКолонок();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКолонок()
	
	ИменаКолонок = Новый Массив();
	ИменаКолонок.Добавить("ДатаНачала");
	ИменаКолонок.Добавить("ДатаОкончания");
	ИменаКолонок.Добавить("МестоИнвентаризацииПредставление");
	ИменаКолонок.Добавить("ДатаИнвентаризации");
	ИменаКолонок.Добавить("ПримечаниеПредставление");
	
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		Элементы["ТаблицаОтметок" + ИмяКолонки].Видимость = ПоказатьВсеКолонки;
	КонецЦикла;
	
	Элементы.ФормаПоказатьВсеКолонки.Пометка = ПоказатьВсеКолонки;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьФлажковОбъединенияСтрок()
	
	Элементы.ОбъединитьСтрокиПоСчетам.Видимость = ДопустимостьОбъединенияСчетов;
	
	Элементы.ОбъединитьСтрокиПоМестамИнвентаризации.Видимость = ДопустимостьОбъединенияМестИнвентаризации;
	
КонецПроцедуры

#КонецОбласти
