#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

Функция ТаблицаСчетовСанкционирования(Списком = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	""501.11"" КАК ТекущийГод,
	               |	""501.21"" КАК ОчереднойГод,
	               |	""501.31"" КАК ОчереднойГод1,
	               |	""501.41"" КАК ОчереднойГод2
	               |ПОМЕСТИТЬ СписокКодов
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""501.12"",
	               |	""501.22"",
	               |	""501.32"",
	               |	""501.42""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""501.13"",
	               |	""501.23"",
	               |	""501.33"",
	               |	""501.43""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""501.14"",
	               |	""501.24"",
	               |	""501.34"",
	               |	""501.44""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""501.15"",
	               |	""501.25"",
	               |	""501.35"",
	               |	""501.45""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""501.16"",
	               |	""501.26"",
	               |	""501.36"",
	               |	""501.46""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""501.19"",
	               |	""501.29"",
	               |	""501.39"",
	               |	""501.49""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""502.11"",
	               |	""502.21"",
	               |	""502.31"",
	               |	""502.41""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""502.12"",
	               |	""502.22"",
	               |	""502.32"",
	               |	""502.42""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""503.11"",
	               |	""503.21"",
	               |	""503.31"",
	               |	""503.41""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""503.12"",
	               |	""503.22"",
	               |	""503.32"",
	               |	""503.42""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""503.13"",
	               |	""503.23"",
	               |	""503.33"",
	               |	""503.43""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""503.14"",
	               |	""503.24"",
	               |	""503.34"",
	               |	""503.44""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""503.15"",
	               |	""503.25"",
	               |	""503.35"",
	               |	""503.45""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""503.16"",
	               |	""503.26"",
	               |	""503.36"",
	               |	""503.46""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""503.19"",
	               |	""503.29"",
	               |	""503.39"",
	               |	""503.49""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""504.11"",
	               |	""504.21"",
	               |	""504.31"",
	               |	""504.41""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""504.12"",
	               |	""504.22"",
	               |	""504.32"",
	               |	""504.42""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""506.10"",
	               |	""506.20"",
	               |	""506.30"",
	               |	""506.40""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""507.10"",
	               |	""507.20"",
	               |	""507.30"",
	               |	""507.40""
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""508.10"",
	               |	""508.20"",
	               |	""508.30"",
	               |	""508.40""
	               |;";
	Если НЕ Списком Тогда
		Запрос.Текст = Запрос.Текст + "				   
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(Т1.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК ТекущийГод,
	               |	ЕСТЬNULL(Т2.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК ОчереднойГод,
	               |	ЕСТЬNULL(Т3.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК ОчереднойГод1,
	               |	ЕСТЬNULL(Т4.Ссылка, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК ОчереднойГод2
	               |ИЗ
	               |	СписокКодов КАК СписокКодов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК Т1
	               |		ПО (Т1.Код = СписокКодов.ТекущийГод)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК Т2
	               |		ПО (Т2.Код = СписокКодов.ОчереднойГод)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК Т3
	               |		ПО (Т3.Код = СписокКодов.ОчереднойГод1)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК Т4
	               |		ПО (Т4.Код = СписокКодов.ОчереднойГод2)";
		Возврат Запрос.Выполнить().Выгрузить();				   
	Иначе				   
		Запрос.Текст = Запрос.Текст + "				   
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕПСБУ.Ссылка
	               |ИЗ
	               |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |ГДЕ
	               |	ЕПСБУ.Код В
	               |			(ВЫБРАТЬ
	               |				СписокКодов.ТекущийГод КАК Код
	               |			ИЗ
	               |				СписокКодов КАК СписокКодов
	               |			ГДЕ
	               |				СписокКодов.ТекущийГод <> """"
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				СписокКодов.ОчереднойГод
	               |			ИЗ
	               |				СписокКодов КАК СписокКодов
	               |			ГДЕ
	               |				СписокКодов.ОчереднойГод <> """"
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				СписокКодов.ОчереднойГод1
	               |			ИЗ
	               |				СписокКодов КАК СписокКодов
	               |			ГДЕ
	               |				СписокКодов.ОчереднойГод1 <> """"
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				СписокКодов.ОчереднойГод2
	               |			ИЗ
	               |				СписокКодов КАК СписокКодов
	               |			ГДЕ
	               |				СписокКодов.ОчереднойГод2 <> """")";
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");				   
	КонецЕсли;				   

КонецФункции // ТаблицаСчетовСанкционирования()
 
#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
