#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Родитель") Тогда   
		ДанныеЗаполнения.Вставить("АналитическаяГруппаКДБ",			ДанныеЗаполнения.Родитель.АналитическаяГруппаКДБ);
		ДанныеЗаполнения.Вставить("АналитическаяГруппаКИФ",			ДанныеЗаполнения.Родитель.АналитическаяГруппаКИФ); 
		ДанныеЗаполнения.Вставить("ВидДоходаКДБ",					ДанныеЗаполнения.Родитель.ВидДоходаКДБ); 
		ДанныеЗаполнения.Вставить("ВидКИФ",							ДанныеЗаполнения.Родитель.ВидКИФ);
		ДанныеЗаполнения.Вставить("ВидРасходаКРБ",					ДанныеЗаполнения.Родитель.ВидРасходаКРБ);   
		ДанныеЗаполнения.Вставить("ГруппаПодвидаКДБ",				ДанныеЗаполнения.Родитель.ГруппаПодвидаКДБ); 
		ДанныеЗаполнения.Вставить("ГруппаПодгруппаКИФ",				ДанныеЗаполнения.Родитель.ГруппаПодгруппаКИФ); 
		ДанныеЗаполнения.Вставить("КОСГУ",							ДанныеЗаполнения.Родитель.КОСГУ);     
		ДанныеЗаполнения.Вставить("ПрограммаЦелевойСтатьиКРБ",		ДанныеЗаполнения.Родитель.ПрограммаЦелевойСтатьиКРБ);   
		ДанныеЗаполнения.Вставить("РазделПодразделКРБ",				ДанныеЗаполнения.Родитель.РазделПодразделКРБ); 
		ДанныеЗаполнения.Вставить("СтатьяКИФ",						ДанныеЗаполнения.Родитель.СтатьяКИФ);  
		ДанныеЗаполнения.Вставить("ЦелеваяСтатьяКРБ",				ДанныеЗаполнения.Родитель.ЦелеваяСтатьяКРБ); 
		ДанныеЗаполнения.Вставить("Код",							ДанныеЗаполнения.Родитель.Код);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Перем ДатаНачала, ДатаОкончания;

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		
		Код = ПлановыеПоказателиДеятельности.НовыйКодСтатьи(ПлановыеПоказателиДеятельности.ОбъектВСтруктуру(ЭтотОбъект), ДатаНачала, ДатаОкончания,, Владелец.ВидПоказателя, Владелец.УточнениеПоказателя);
		
		Если Не ДатаНачала = Неопределено Тогда
			
			Если ДатаНачала <= ДатаОкончания Тогда
				
				Если ДатаНачалаДействия < ДатаНачала Тогда
					ДатаНачалаДействия = ДатаНачала 
				КонецЕсли;
				
				ДатаОкончанияДействия = ДатаОкончания;
				ОкончаниеДействия     = ?(ДатаОкончания = '29990101', '00010101', ДатаОкончания);
				
			Иначе
				
				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Компоненты кода имеют непересекающиеся периоды действия.'"), ЭтотОбъект);
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли