
#Область ПрограммныйИнтерфейс

Функция ЦенаНоменклатуры(Знач Организация, Знач Номенклатура, Знач ТипЦены, Знач Дата) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ТипЦен = &ТипЦены
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних");
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ТипЦены",		ТипЦены); 
	Запрос.УстановитьПараметр("Номенклатура",	Номенклатура); 
	Запрос.УстановитьПараметр("Период",			Дата);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Цена;

КонецФункции

// Определяет цену номенклатуры из регистра сведений "ЦеныНоменклатуры" и возвращает ее.
//
// Параметры:
// СтруктураПараметров - Структура:
//			* Организация - СправочникСсылка.Организации 
//			* Номенклатура - СправочникСсылка.Номенклатура 
//			* ТипЦены - СправочникСсылка.ТипыЦенНоменклатуры 
//			* Валюта - СправочникСсылка.Валюты - Если не задана, то цена будет получена по валюте регламентированного учета
//			* ДатаЦены - Дата - Если не задана, то цена будет получена на текущую дату
// Возвращаемое значение:
//  Число - значение цены.
Функция ЦенаНоменклатурыВвалюте(СтруктураПараметров) Экспорт
	Перем Организация;
	Перем Номенклатура;
	Перем ТипЦены;
	Перем Валюта;
	Перем ДатаЦены;
	
	Результат = 0;
	
	Если НЕ СтруктураПараметров.Свойство("Организация", Организация) Тогда
		Возврат Результат;
	ИначеЕсли НЕ СтруктураПараметров.Свойство("Номенклатура", Номенклатура) Тогда
		Возврат Результат;
	ИначеЕсли НЕ СтруктураПараметров.Свойство("ТипЦены", ТипЦены) Тогда
		Возврат Результат;
	КонецЕсли;	
	
	СтруктураПараметров.Свойство("Валюта", Валюта);
	Если Валюта = Неопределено Тогда
		Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;	

	СтруктураПараметров.Свойство("ДатаЦены", ДатаЦены);
	Если ДатаЦены = Неопределено Тогда
		ДатаЦены = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипЦены", ТипЦены);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЦеныНоменклатурыСрезПоследних.Цена,
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен.ВалютаЦены КАК ВалютаЦены
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&ДатаЦены,
	               |			Активность = ИСТИНА
	               |				И Организация = &Организация
	               |				И ТипЦен = &ТипЦены
	               |				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
				   
	Выборка = Запрос.Выполнить().Выбрать();			   
	Если НЕ Выборка.Следующий() Тогда
		Возврат Результат;
	КонецЕсли;
	
	Цена       = Выборка.Цена;
	ВалютаЦены = Выборка.ВалютаЦены;
	
	СтруктураВалютыЦены = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаЦены, ДатаЦены);
	КурсВалютыЦены      = СтруктураВалютыЦены.Курс;
	КратностьВалютыЦены = СтруктураВалютыЦены.Кратность;
	
	СтруктураВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаЦены);
	КурсВалюты      = СтруктураВалюты.Курс;
	КратностьВалюты = СтруктураВалюты.Кратность;
	
	Результат = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		Цена, 
		Новый Структура("Валюта, Курс, Кратность", ВалютаЦены, КурсВалютыЦены, КратностьВалютыЦены),
		Новый Структура("Валюта, Курс, Кратность", Валюта, КурсВалюты, КратностьВалюты));
	
	Возврат Результат;
	
КонецФункции

Функция СчетУчетаНоменклатуры(Знач Номенклатура, Знач ПолучатьСчетВложений = Ложь, Знач Включать106ИК = Ложь, Знач ДатаСчета = Неопределено) Экспорт

	Если ЗначениеЗаполнено(Номенклатура) Тогда
		СчетУчета = УправлениеМатериальнымиЗапасами.СчетУчетаСсылкаИзНоменклатуры(Номенклатура, ДатаСчета);
		Если ПолучатьСчетВложений Тогда
			Если Включать106ИК Тогда
				СчетУчета = БухгалтерскийУчет.СчетПоКоду("106.56");
			Иначе
				СчетУчета = УправлениеМатериальнымиЗапасами.СчетВложенийПоСчетуМатериала(СчетУчета, , ДатаСчета);
			КонецЕсли;
		КонецЕсли;
	
		Возврат СчетУчета;
	Иначе
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция СчетУчетаНоменклатурыИК(Знач Номенклатура, Знач ДатаСчета = Неопределено) Экспорт
	СчетУчетаНоменклатуры = СчетУчетаНоменклатуры(Номенклатура, , , ДатаСчета);
	Если ЗначениеЗаполнено(СчетУчетаНоменклатуры) И БухгалтерскийУчет.СчетВИерархии(СчетУчетаНоменклатуры, "108.00") Тогда
		Возврат СчетУчетаНоменклатуры;
	КонецЕсли;
	Возврат БухгалтерскийУчет.СчетПоКоду("108.56", ДатаСчета);
КонецФункции

Функция ПолучитьДанныеСчетаУчетаНоменклатуры(Параметры) Экспорт

	Возврат УправлениеМатериальнымиЗапасами.ПолучитьДанныеСчетаУчетаНоменклатуры(Параметры);

КонецФункции

Функция ПроверитьОстаткиНаСчете09(НаДату, Организация, ИФО, КФО = Неопределено, СписокОС) Экспорт
	Возврат УправлениеМатериальнымиЗапасами.ПроверитьОстаткиНаСчете09(НаДату, Организация, ИФО, КФО, СписокОС);
КонецФункции

// Возвращает признаки прослеживаемости номенклатуры на дату и набор доп.реквизитов(используется в документах при изменении номенклатуры)
//
// Параметры:
// Номенклатура - СправочникСсылка.Номенклатура 
// ДатаПроверки - Дата
// ПричинаНалогообложения - ПеречислениеСсылка.ПричиныНалогообложенияНДС
// Возвращаемое значение:
//  Структура
Функция ПолучитьСвойстваНоменклатуры(Знач Номенклатура, Знач ДатаПроверки, Знач ПричинаНалогообложения = Неопределено) Экспорт
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("СтавкаНДС", Перечисления.СтавкиНДС.ПустаяСсылка());
	СтруктураДанных.Вставить("ЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	СтруктураДанных.Вставить("ПрослеживаемыйТовар", Ложь);
	СтруктураДанных.Вставить("КомплектСПрослеживаемымиТоварами", Ложь);
	СтруктураДанных.Вставить("СтранаПроисхождения", Справочники.СтраныМира.ПустаяСсылка());
	СтруктураДанных.Вставить("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.ПустаяСсылка());
	СтруктураДанных.Вставить("Наименование", "");
	СтруктураДанных.Вставить("НаименованиеПолное", "");
	
	КодВидаТовараИспользуется = Ложь;
	Если ПричинаНалогообложения <> Неопределено Тогда
		КодВидаТовараИспользуется = УчетНДСПовтИсп.КодВидаТовараИспользуется(ПричинаНалогообложения);
	КонецЕсли;

	Если КодВидаТовараИспользуется Тогда
		СтруктураДанных.Вставить("КодТНВЭД", "");
	КонецЕсли;
	
	ДопРеквизиты = "";
	Для Каждого ЭлементСтруктураДанных Из СтруктураДанных Цикл
		Если ЭлементСтруктураДанных.Ключ = "ПрослеживаемыйТовар" ИЛИ ЭлементСтруктураДанных.Ключ = "КомплектСПрослеживаемымиТоварами" Тогда
			Продолжить;
		КонецЕсли;
		Разделитель = ?(ДопРеквизиты ="", "", ",");
		ДопРеквизиты = ДопРеквизиты + Разделитель + ЭлементСтруктураДанных.Ключ;
	КонецЦикла;
	
	СвойстваНоменклатуры = УправлениеМатериальнымиЗапасами.ПризнакиПрослеживаемостиНоменклатуры(
	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номенклатура),
	ДатаПроверки,
	ДопРеквизиты);
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных, СвойстваНоменклатуры.Получить(Номенклатура));
	
	Возврат СтруктураДанных;
	
КонецФункции

#КонецОбласти
