
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
	Элементы.КартинкаНацПроект.Видимость = БюджетнаяКлассификацияКлиентСервер.ЭтоКодНацПроекта(Сред(Объект.Код, 4, 1)) > 0; 
	ОбновитьОформлениеПоляКод();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
	Элементы.КартинкаНацПроект.Видимость = БюджетнаяКлассификацияКлиентСервер.ЭтоКодНацПроекта(Сред(Объект.Код, 4, 1)) > 0; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Объект.Код = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(СокрЛП(Объект.Код), 10);
	
	Элементы.КартинкаНацПроект.Видимость = БюджетнаяКлассификацияКлиентСервер.ЭтоКодНацПроекта(Сред(Объект.Код, 4, 1)) > 0; 
    ОбновитьОформлениеПоляКод();
	
КонецПроцедуры

&НаКлиенте
Процедура КодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ДополнительныйОтбор", Новый Структура);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.Код);
	ПараметрыФормы.Вставить("ОтветСтруктурой", Истина);

	БюджетнаяКлассификацияКлиент.ОткрытьФормуКлассификатора("ЦСР", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбработатьВыборНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВыборНаСервере(ВыбранноеЗначение)
	
	Источник = Неопределено;
	
	Если ОбщегоНазначения.СсылкаСуществует(ВыбранноеЗначение.Ссылка) Тогда
		Источник = ВыбранноеЗначение.Ссылка;	
	ИначеЕсли ОбщегоНазначения.СсылкаСуществует(ВыбранноеЗначение.ЦелеваяСтатья) Тогда
		Источник = ВыбранноеЗначение.ЦелеваяСтатья;
	КонецЕсли;
	
	Если НЕ Источник = Неопределено Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Наименование, НаименованиеПолное");
		
		Объект.Код = ЗначенияРеквизитов.Наименование;
		Объект.НаименованиеПолное = ЗначенияРеквизитов.НаименованиеПолное;
		
		Если Лев(Объект.Код,5) = "00000" Тогда
			//была выбрана универсальная программа ЦС, заполним первые 5 символов из ЦС
			Если ОбщегоНазначения.СсылкаСуществует(ВыбранноеЗначение.ЦелеваяСтатья) Тогда
				КодЦС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение.ЦелеваяСтатья, "Наименование");
				Объект.Код = Лев(КодЦС,5) + Прав(Объект.Код,5); 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Элементы.КартинкаНацПроект.Видимость = БюджетнаяКлассификацияКлиентСервер.ЭтоКодНацПроекта(Сред(Объект.Код, 4, 1)) > 0; 
	ОбновитьОформлениеПоляКод();
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьОформлениеПоляКод()
		
	Латиница = БюджетнаяКлассификацияКлиентСервер.СимволыЛатиницы();
	Кириллица = БюджетнаяКлассификацияКлиентСервер.СимволыКириллицы();
	ЦветЛатиницы = Новый Цвет(0,0,255);
	ЦветКириллицы = WebЦвета.ЗеленыйЛес; 
	
	МассивСтрок = Новый Массив;
	
	ЕстьОформление = Ложь;
	
	ЖирныйШрифт = Новый Шрифт(,,Истина);
	
	Если ЗначениеЗаполнено(Объект.Код) Тогда
				
		Для Инд = 1 По СтрДлина(Объект.Код) Цикл
			ТекБлок = Сред(Объект.Код,Инд,1);
			
			Если Найти(Латиница,ВРег(ТекБлок))>0 Тогда
				ЕстьОформление = Истина;
				ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока(ТекБлок,ЖирныйШрифт,ЦветЛатиницы);
				МассивСтрок.Добавить(ТекущийФорматированныйБлок);
			ИначеЕсли Найти(Кириллица,ВРег(ТекБлок))>0 Тогда
				ЕстьОформление = Истина;
				ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока(ТекБлок,ЖирныйШрифт,ЦветКириллицы);
				МассивСтрок.Добавить(ТекущийФорматированныйБлок);				
			Иначе
				МассивСтрок.Добавить(ТекБлок);	
			КонецЕсли;
			
		КонецЦикла;
		
		ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока("  Кир.",ЖирныйШрифт,ЦветКириллицы);
		МассивСтрок.Добавить(ТекущийФорматированныйБлок);
		МассивСтрок.Добавить("/");
		ТекущийФорматированныйБлок = Новый ФорматированнаяСтрока("Лат.",ЖирныйШрифт,ЦветЛатиницы);
		МассивСтрок.Добавить(ТекущийФорматированныйБлок);
	КонецЕсли;
	
	Если ЕстьОформление Тогда
		Элементы.ГруппаСтраницыОформления.ТекущаяСтраница = Элементы.ГруппаОформление;
	Иначе
		Элементы.ГруппаСтраницыОформления.ТекущаяСтраница = Элементы.ГруппаПустая;	
	КонецЕсли;
	
	Элементы.ДекорацияКод.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
КонецПроцедуры


#КонецОбласти

