
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗагрузитьИзФайла(Команда)
	
	#Если ВебКлиент Тогда
		Результат = Ждать ПодключитьРасширениеРаботыСФайламиАсинх();
		Если Не Результат Тогда
			Сообщить("Необходимо установить расширение работы с файлами 1С:Предприятие 8.");
			Сообщить("Установить расширение можно в разделе Мои настройки (Быстрый доступ - Администрирование - Прочее - Мои настройки).");
			Возврат;
		КонецЕсли;		
	#КонецЕсли
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Фильтр = "Файлы xml|*.xml";
	Обещание = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	Если Не Обещание = Неопределено И Обещание.Количество() Тогда
		
		ИмяФайла = Обещание[0]; 
		
		ОбещаниеНов = Ждать СоздатьДвоичныеДанныеИзФайлаАсинх(ИмяФайла);
		Если Не ОбещаниеНов = Неопределено Тогда    
			
			ВыполнитьЗагрузкуСроковКлиент(ПоместитьВоВременноеХранилище(ОбещаниеНов, ЭтаФорма.УникальныйИдентификатор));
			
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьЗагрузкуСроковКлиент(Адрес)
	
	РезультатЗадания = СформироватьЗагрузкуСроковНаСервереВФоне(Адрес);
	
	МодульДлительныеОперацииКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ДлительныеОперацииКлиент");
	ПараметрыОжидания = МодульДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьСообщения = Истина;	
	ОписаниеОповещенияЗавершение = Новый ОписаниеОповещения("СформироватьЗагрузкуСроковЗавершение", ЭтотОбъект);
		
	МодульДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещенияЗавершение, ПараметрыОжидания);     

КонецПроцедуры 

&НаСервере
Функция  СформироватьЗагрузкуСроковНаСервереВФоне(Адрес)
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Данные", Base64Строка(ПолучитьИзВременногоХранилища(Адрес)));  
	
	МодульДлительныеОперации = ОбщегоНазначения.ОбщийМодуль("ДлительныеОперации");
	ПараметрыВыполнения = МодульДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ЗагрузкаСрокиПредоставленияДанных";
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ДополнительныйРезультат = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.АдресРезультата = АдресРезультата;
	
	РезультатФоновогоЗадания = МодульДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "МодульСбораДанных.ЗагрузитьСрокиПредоставленияДанных", ПараметрыПроцедуры);
	
	Возврат РезультатФоновогоЗадания;

КонецФункции      

&НаКлиенте
Процедура СформироватьЗагрузкуСроковЗавершение(Результат, ДопПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
    	ПоказатьПредупреждение(,"Загрузка выполнена успешно");
	Иначе                                                     
		ПоказатьПредупреждение(,"В процессе загрузки произошли ошибки");
	КонецЕсли;		

КонецПроцедуры

#КонецОбласти
