
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок 			= Параметры.Заголовок;
	Если Параметры.Свойство("АдресДокумента") И ЭтоАдресВременногоХранилища(Параметры.АдресДокумента) Тогда
		ТабличныйДокумент   = ПолучитьИзВременногоХранилища(Параметры.АдресДокумента);
	КонецЕсли;

	Если Параметры.ЧерноБелыйПросмотр Тогда
		Элементы.ТабличныйДокумент.ЧерноБелыйПросмотр = Истина;
		ТабличныйДокумент.ЧерноБелаяПечать            = Истина;
	КонецЕсли;
	
	Параметры.Свойство("Расшифровывать", Расшифровывать);
	
	ТолькоСОтклонением = Истина;
	
	Элементы.ТолькоСОтклонением.Видимость = Расшифровывать;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если Расшифровывать Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ТолькоСОтклонением", ТолькоСОтклонением);
		ПараметрыОповещения.Вставить("Расшифровка", Расшифровка);
		
		Оповестить("СверкаУчетныхДанных_РасшифровкаТабличногоДокумента", ПараметрыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
