
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.РежимРасшифровки = (Параметры.Свойство("Расшифровка") И Параметры.Расшифровка <> Неопределено);
	Если Отчет.РежимРасшифровки Тогда // Формирование отчета в режиме расшифровки с детализацией по периодам задолженности и видам расчетов.
		
		ЗаполнитьЗначенияСвойств(Отчет, Параметры,
			"Организация,ДатаОтчета,ВидЗадолженности");
		Если Параметры.Свойство("ТипЗадолженности") Тогда
			Отчет.ТипЗадолженности = Параметры.ТипЗадолженности;
		КонецЕсли;
		Если Параметры.Свойство("Контрагент") Тогда
			Отчет.Контрагент = Параметры.Контрагент;
		КонецЕсли;
		Если Параметры.Свойство("Договор") Тогда
			Отчет.Договор = Параметры.Договор;
		КонецЕсли;
		Если Параметры.Свойство("ВыводитьЗаголовок") Тогда
			Отчет.ВыводитьЗаголовок = Параметры.ВыводитьЗаголовок;
		КонецЕсли;
		Если Параметры.Свойство("ВыводитьПодвал") Тогда
			Отчет.ВыводитьПодвал = Параметры.ВыводитьПодвал;
		КонецЕсли;
		Если Параметры.Свойство("СУчетомИсправленияОшибокПрошлыхЛет") Тогда
			Отчет.СУчетомИсправленияОшибокПрошлыхЛет = Параметры.СУчетомИсправленияОшибокПрошлыхЛет;
		КонецЕсли;
		Если Параметры.Свойство("КонецПериодаИсправленияОшибокПрошлыхЛет") Тогда
			Отчет.КонецПериодаИсправленияОшибокПрошлыхЛет = Параметры.КонецПериодаИсправленияОшибокПрошлыхЛет;
		КонецЕсли;
		
		Отчет.ПоДатамИсполнения = Истина;
		Отчет.ВидЗадолженностиИспользование = ЗначениеЗаполнено(Отчет.ВидЗадолженности);
		Отчет.ТипЗадолженностиИспользование = ЗначениеЗаполнено(Отчет.ТипЗадолженности);
		
	ИначеЕсли Параметры.Свойство("ИДРасшифровки") И Параметры.ИДРасшифровки = "АнализЗадолженности" Тогда // Расшифровка из стандартных отчетов.
		
		ДанныеОбъекта = ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		ПользовательскиеНастройки = ДанныеОбъекта.НастройкиРасшифровки[Параметры.ИДРасшифровки];
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		
		Отчет.Организация = ДополнительныеСвойства.Организация;
		Отчет.ДатаОтчета = ДополнительныеСвойства.КонецПериода;
		Отчет.ПоДатамИсполнения = Истина;
		Если ДополнительныеСвойства.Свойство("Контрагент") Тогда
			Отчет.Контрагент = ДополнительныеСвойства.Контрагент;
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("Договор") Тогда
			Отчет.Договор = ДополнительныеСвойства.Договор;
		КонецЕсли;
		
	Иначе // Обычный режим формирования отчета.
		
		Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
			Отчет.Организация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Отчет.ДатаОтчета) Тогда
			Отчет.ДатаОтчета = ТекущаяДатаСеанса();
		КонецЕсли;
		
		Если Параметры.Свойство("Отбор") Тогда
		
			Если Параметры.Отбор.Свойство("Договор") Тогда
				
				РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Отбор.Договор,
					"Контрагент,Организация,Ссылка");
				Отчет.Организация = РеквизитыДоговора.Организация;
				Отчет.Контрагент  = РеквизитыДоговора.Контрагент;
				Отчет.Договор     = РеквизитыДоговора.Ссылка;
				
			Иначе
				ЗаполнитьЗначенияСвойств(Отчет, Параметры.Отбор);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоДатамИсполнения", "Доступность", Не Отчет.РежимРасшифровки);
	
	РабочаяДатаПользователя = ОбщегоНазначенияБГУ.РабочаяДатаПользователя();
	
	Элементы.ТипЗадолженности.СписокВыбора.Очистить();
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Дт205", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Дт205"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Дт206", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Дт206"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Дт207", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Дт207"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Дт208", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Дт208"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Кт205", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Кт205"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Кт208", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Кт208"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Кт302", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Кт302"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Кт301", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Кт301"));
	Элементы.ТипЗадолженности.СписокВыбора.Добавить("Кт30401", Отчеты.АнализЗадолженности.ТипЗадолженностиПредставление("Кт30401"));
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
	РегистрыУчета.ПриСозданииНаСервере(ЭтотОбъект, "ОсновнаяКоманднаяПанель");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойПользовательскихНастроекНаСервере(Настройки)
	
	Если Отчет.РежимРасшифровки	И ТипЗнч(Параметры.Расшифровка) = Тип("Структура") Тогда // В режиме расшифровки устанавливаем быстрые отборы из данных расшифровки.
	
		Если Параметры.Расшифровка.Свойство("ИФО") И ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИФО");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.ИФО;
			ПользовательскаяНастройка.Использование = Истина;
		Иначе
			ОчиститьЗначениеПараметраПользовательскойНастройки(Настройки, "ИФО");
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("КФО") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КФО");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.КФО;
			ПользовательскаяНастройка.Использование = Истина;
		Иначе
			ОчиститьЗначениеПараметраПользовательскойНастройки(Настройки, "КФО");
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("КПС") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КПС");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = Параметры.Расшифровка.КПС;
			ПользовательскаяНастройка.Использование = Истина;
		Иначе
			ОчиститьЗначениеПараметраПользовательскойНастройки(Настройки, "КПС");
		КонецЕсли;
		Если Параметры.Расшифровка.Свойство("СчетРасчетов") Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетРасчетов");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			Если Отчет.ТипЗадолженности = "Дт206" Тогда
				ПользовательскаяНастройка.Значение = УчетРасчетов.ОпределитьСчетАвансов(Параметры.Расшифровка.СчетРасчетов,
					Отчет.ДатаОтчета, Отчет.Организация);
			Иначе
				ПользовательскаяНастройка.Значение = Параметры.Расшифровка.СчетРасчетов;
			КонецЕсли;
			ПользовательскаяНастройка.Использование = Истина;
		Иначе
			ОчиститьЗначениеПараметраПользовательскойНастройки(Настройки, "СчетРасчетов");
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ИДРасшифровки") И Параметры.ИДРасшифровки = "АнализЗадолженности" Тогда // Расшифровка из стандартных отчетов.
		
		ДанныеОбъекта = ПолучитьИзВременногоХранилища(Параметры.АдресНастроек);
		ПользовательскиеНастройки = ДанныеОбъекта.НастройкиРасшифровки[Параметры.ИДРасшифровки];
		ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
		
		Если ЗначениеЗаполнено(ДополнительныеСвойства.Счет) Тогда
			Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетРасчетов");
			ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
			ПользовательскаяНастройка.Значение = ДополнительныеСвойства.Счет;
			ПользовательскаяНастройка.Использование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	СтандартныеОтчетыКлиент.РезультатПриАктивизацииОбласти(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	ЗначенияРасшифровки = ЗначенияРасшифровкиЯчейки(Расшифровка, ДанныеРасшифровки);
	
	Если ЗначенияРасшифровки.Параметры.Свойство("СпособРасшифровки")
		И ЗначениеЗаполнено(ЗначенияРасшифровки.Параметры.СпособРасшифровки) Тогда
		
		Если ЗначенияРасшифровки.Параметры.СпособРасшифровки = "ПоСрокамИсполнения" Тогда
			
			СтандартнаяОбработка = Ложь; // Расшифровка этим же отчетом в режиме РежимРасшифровки.
			
			ПараметрыФормы = Новый Структура("ДатаОтчета,Организация,ВыводитьЗаголовок,ВыводитьПодвал,
				|ВидЗадолженности,ВидЗадолженностиИспользование,ТипЗадолженности,ТипЗадолженностиИспользование");
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, Отчет, "Организация,ДатаОтчета,ВыводитьЗаголовок,ВыводитьПодвал");
			ЗаполнитьЗначенияСвойств(ПараметрыФормы, ЗначенияРасшифровки);
			ПараметрыФормы.Вставить("Контрагент", ?(ЗначениеЗаполнено(ЗначенияРасшифровки.Контрагент), ЗначенияРасшифровки.Контрагент, Отчет.Контрагент));
			ПараметрыФормы.Вставить("Договор", ?(ЗначениеЗаполнено(ЗначенияРасшифровки.Договор), ЗначенияРасшифровки.Договор, Отчет.Договор));
			ПараметрыФормы.Вставить("Расшифровка", ЗначенияРасшифровки.Параметры);
			
			ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
			ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
			ПараметрыФормы.Вставить("КлючВарианта", "Основной");
			ПараметрыФормы.Вставить("КлючНазначенияИспользования", "Основной");
			
			ОткрытьФорму("Отчет.АнализЗадолженности.Форма", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект);
			
		ИначеЕсли ЗначенияРасшифровки.Параметры.СпособРасшифровки = "СтандартныйОтчет"  Тогда
			
			СтандартнаяОбработка = Ложь; // Расшифровка остатков по счетам стандартными бух.отчетами.
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", Отчет.Организация);
			
			ПараметрыФормы.Вставить("РежимРасшифровки", Истина);
			ПараметрыФормы.Вставить("ВидРасшифровки", 2);
			ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
			
			ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
			
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Организация",   Отчет.Организация);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("НачалоПериода", НачалоГода(Отчет.ДатаОтчета));
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("КонецПериода",  Отчет.ДатаОтчета);
			
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоСубсчетам", Истина);
			
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательБУ",              Истина);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательНеУчитываетсяНУ", Ложь);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательЕНВД",            Ложь);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательНДС",             Ложь);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательВалютнаяСумма",   Ложь);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПоказательКоличество",      Ложь);
			
			// Группировки.
			ГруппировкиОСВ = Новый Массив;
			
			Если НЕ ЗначениеЗаполнено(ЗначенияРасшифровки.Контрагент) Тогда
				// Группировка Контрагент.
				ОписаниеГруппировки = Новый Структура;
				ОписаниеГруппировки.Вставить("Использование",  Истина);
				ОписаниеГруппировки.Вставить("Поле",           "Субконто1");
				ОписаниеГруппировки.Вставить("Представление",  "Контрагенты");
				ОписаниеГруппировки.Вставить("ТипГруппировки", 0);
				ГруппировкиОСВ.Добавить(ОписаниеГруппировки);
			КонецЕсли;
			
			Если ЗначенияРасшифровки.Параметры.Свойство("СчетРасчетов")
				И ЗначениеЗаполнено(ЗначенияРасшифровки.Параметры.СчетРасчетов) Тогда
				
				ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
					ЗначенияРасшифровки.Параметры.СчетРасчетов);
				
				Если НЕ ЗначениеЗаполнено(ЗначенияРасшифровки.Договор) Тогда
					// Группировка Договор.
					ОписаниеГруппировки = Новый Структура;
					ОписаниеГруппировки.Вставить("Использование",  Истина);
					ОписаниеГруппировки.Вставить("Поле",           "Субконто2");
					ОписаниеГруппировки.Вставить("Представление",  "Договоры");
					ОписаниеГруппировки.Вставить("ТипГруппировки", 0);
					ГруппировкиОСВ.Добавить(ОписаниеГруппировки);
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(ЗначенияРасшифровки.ТипЗадолженности)
				ИЛИ ЗначениеЗаполнено(Отчет.ТипЗадолженности) Тогда
				
				ТипЗадолженности = ?(ЗначениеЗаполнено(ЗначенияРасшифровки.ТипЗадолженности),
					ЗначенияРасшифровки.ТипЗадолженности, Отчет.ТипЗадолженности);
				
				Если ТипЗадолженности = "Дт205" ИЛИ ТипЗадолженности = "Кт205" Тогда
					ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
						БухгалтерскийУчетВызовСервера.СчетПоКоду("205.00", Отчет.ДатаОтчета, Отчет.Организация));
				ИначеЕсли ТипЗадолженности = "Дт206" Тогда
					ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
						БухгалтерскийУчетВызовСервера.СчетПоКоду("206.00", Отчет.ДатаОтчета, Отчет.Организация));
				ИначеЕсли ТипЗадолженности = "Дт207" Тогда
					ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
						БухгалтерскийУчетВызовСервера.СчетПоКоду("207.00", Отчет.ДатаОтчета, Отчет.Организация));
				ИначеЕсли ТипЗадолженности = "Дт208" ИЛИ ТипЗадолженности = "Кт208" Тогда
					ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
						БухгалтерскийУчетВызовСервера.СчетПоКоду("208.00", Отчет.ДатаОтчета, Отчет.Организация));
				ИначеЕсли ТипЗадолженности = "Кт301" Тогда
					ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
						БухгалтерскийУчетВызовСервера.СчетПоКоду("301.00", Отчет.ДатаОтчета, Отчет.Организация));
				ИначеЕсли ТипЗадолженности = "Кт302" Тогда
					ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
						БухгалтерскийУчетВызовСервера.СчетПоКоду("302.00", Отчет.ДатаОтчета, Отчет.Организация));
				ИначеЕсли ТипЗадолженности = "Кт30401" Тогда
					ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Счет",
						БухгалтерскийУчетВызовСервера.СчетПоКоду("304.01", Отчет.ДатаОтчета, Отчет.Организация));
				КонецЕсли;
				
			КонецЕсли;
			
			// Группировка КФО.
			ОписаниеГруппировки = Новый Структура;
			ОписаниеГруппировки.Вставить("Использование",  Истина);
			ОписаниеГруппировки.Вставить("Поле",           "КФО");
			ОписаниеГруппировки.Вставить("Представление",  "КФО");
			ОписаниеГруппировки.Вставить("ТипГруппировки", 1);
			ГруппировкиОСВ.Добавить(ОписаниеГруппировки);
			// Группировка КПС.
			ОписаниеГруппировки = Новый Структура;
			ОписаниеГруппировки.Вставить("Использование",  Истина);
			ОписаниеГруппировки.Вставить("Поле",           "КПС");
			ОписаниеГруппировки.Вставить("Представление",  "КПС");
			ОписаниеГруппировки.Вставить("ТипГруппировки", 1);
			ГруппировкиОСВ.Добавить(ОписаниеГруппировки);
			ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Группировка", ГруппировкиОСВ);
			
			// Отбор.
			Отбор = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
			Отбор.ИдентификаторПользовательскойНастройки = "Отбор";
			СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Отбор, "Субконто1",
				ЗначенияРасшифровки.Контрагент, ВидСравненияКомпоновкиДанных.Равно, ЗначениеЗаполнено(ЗначенияРасшифровки.Контрагент));
			СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Отбор, "Субконто2",
				ЗначенияРасшифровки.Договор, ВидСравненияКомпоновкиДанных.Равно, ЗначениеЗаполнено(ЗначенияРасшифровки.Договор));
			
			ПараметрыФормы.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
			
			ОткрытьФорму("Отчет.ОборотноСальдоваяВедомостьПоСчету.Форма", ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор);
			
		КонецЕсли;
		
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтчетаПриИзменении(Элемент)
	
	Если Отчет.ДатаОтчета <> НачалоГода(Отчет.ДатаОтчета) Тогда
		Отчет.СУчетомИсправленияОшибокПрошлыхЛет = Ложь;
	КонецЕсли;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СУчетомИсправленияОшибокПрошлыхЛетПриИзменении(Элемент)
	
	Если Отчет.СУчетомИсправленияОшибокПрошлыхЛет И Не ЗначениеЗаполнено(Отчет.КонецПериодаИсправленияОшибокПрошлыхЛет) Тогда
		Отчет.КонецПериодаИсправленияОшибокПрошлыхЛет = РабочаяДатаПользователя;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоДатамИсполненияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиИспользованиеПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Отчет.ВидЗадолженности) Тогда
		Отчет.ВидЗадолженностиИспользование = Истина;
	КонецЕсли;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадолженностиИспользованиеПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗадолженностиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Отчет.ТипЗадолженности) Тогда
		Отчет.ТипЗадолженностиИспользование = Истина;
	КонецЕсли;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	Если ОтображениеСостояния.Видимость = Истина
		И ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность Тогда
		ТекстВопроса = НСтр("ru = 'Отчет не сформирован. Сформировать?'");
		Обработчик = Новый ОписаниеОповещения("СформироватьПередОтправкойПоПочте", ЭтотОбъект);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	Иначе
		ПоказатьДиалогОтправкиПоПочте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	
	РегистрыУчетаКлиент.ОбработчикКомандыРаботыСРегистромУчета(ЭтотОбъект, Команда, "Результат");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Отчет = Форма.Отчет;
	Элементы = Форма.Элементы;
	
	ЭлементыИсправлениеОшибокПрошлыхЛет = Новый Массив;
	ЭлементыИсправлениеОшибокПрошлыхЛет.Добавить("СУчетомИсправленияОшибокПрошлыхЛет");
	ЭлементыИсправлениеОшибокПрошлыхЛет.Добавить("КонецПериодаИсправленияОшибокПрошлыхЛет");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыИсправлениеОшибокПрошлыхЛет, "Видимость", Отчет.ДатаОтчета = НачалоГода(Отчет.ДатаОтчета));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КонецПериодаИсправленияОшибокПрошлыхЛет", "Доступность", Отчет.СУчетомИсправленияОшибокПрошлыхЛет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогОтправкиПоПочте()
	
	НаименованиеОтчета = НСтр("ru = 'Анализ задолженности'");
	
	Вложение = Новый Структура;
	Вложение.Вставить("АдресВоВременномХранилище", ПоместитьВоВременноеХранилище(Результат, УникальныйИдентификатор));
	Вложение.Вставить("Представление", НаименованиеОтчета);
	
	СписокВложений = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Вложение);
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениямиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСПочтовымиСообщениямиКлиент");
		ПараметрыОтправки = МодульРаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
		ПараметрыОтправки.Тема = НаименованиеОтчета;
		ПараметрыОтправки.Вложения = СписокВложений;
		МодульРаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыОтправки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияРасшифровкиЯчейки(Расшифровка, ДанныеРасшифровки)
	
	ЗначенияРасшифровки = Новый Структура("Контрагент, Договор, ВидЗадолженности, ТипЗадолженности, Параметры");
	ЗначенияРасшифровки.Параметры = Новый Структура;
	
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	МассивПолей = СтандартныеОтчеты.ПолучитьМассивПолейРасшифровки(Расшифровка, ДанныеРасшифровкиОбъект, , Истина);
	
	Для Каждого ПолеРасшифровки Из МассивПолей Цикл
		
		Если ТипЗнч(ПолеРасшифровки) <> Тип("ЗначениеПоляРасшифровкиКомпоновкиДанных") Тогда
			Продолжить;
		ИначеЕсли ПолеРасшифровки.Иерархия Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПолеРасшифровки.Поле = "Контрагент" Тогда
			ЗначенияРасшифровки.Контрагент = ПолеРасшифровки.Значение;
		ИначеЕсли ПолеРасшифровки.Поле = "Договор" Тогда
			ЗначенияРасшифровки.Договор = ПолеРасшифровки.Значение;
		ИначеЕсли ПолеРасшифровки.Поле = "ВидЗадолженности" Тогда
			ЗначенияРасшифровки.ВидЗадолженности = ПолеРасшифровки.Значение;
		ИначеЕсли ПолеРасшифровки.Поле = "ТипЗадолженности" Тогда
			ЗначенияРасшифровки.ТипЗадолженности = ПолеРасшифровки.Значение;
		Иначе
			ЗначенияРасшифровки.Параметры.Вставить(ПолеРасшифровки.Поле, ПолеРасшифровки.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЗначенияРасшифровки;
	
КонецФункции

&НаСервере
Процедура ОчиститьЗначениеПараметраПользовательскойНастройки(Настройки, ИдентификаторПараметра)
	Параметр = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти(ИдентификаторПараметра);
	ПользовательскаяНастройка = Настройки.Элементы.Найти(Параметр.ИдентификаторПользовательскойНастройки);
	ПользовательскаяНастройка.Значение = ОбщегоНазначенияБГУКлиентСервер.ПустоеЗначениеТипа(
		ТипЗнч(ПользовательскаяНастройка.Значение));
	ПользовательскаяНастройка.Использование = Ложь;
КонецПроцедуры

#КонецОбласти
