#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате") Тогда
		ПлатежноРасчетныеДокументы.ЗаполнитьНаОснованииВедомостиКомпенсацииРодительскойПлатыКВыплате(ЭтотОбъект,
			ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьНаВыплатуВБанк") Тогда
		
		// проверим, был ли уже введен расчетно-платежный документ на основании ведомости
		РасчетноПлатежныйДокумент =
			ПлатежноРасчетныеДокументы.ВведенныйНаОснованииВедомостиВБанкРасчетноПлатежныйДокумент(ДанныеЗаполнения);
		
		Если ЗначениеЗаполнено(РасчетноПлатежныйДокумент) И Ссылка <> РасчетноПлатежныйДокумент Тогда
			
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='На основании ведомости уже введен расчетно-платежный документ (%1)'"),
				РасчетноПлатежныйДокумент);
			ВызватьИсключение ТекстИсключения;
			
		Иначе
			
			Если НЕ ДанныеЗаполнения.ПолучитьОбъект().ПроверитьЗаполнение() Тогда
				ВызватьИсключение "В ведомости есть ошибки заполнения (см. окно сообщений)! Ввод на основании невозможен."
			КонецЕсли;
			
			Организация			= ДанныеЗаполнения.Организация;
			ИФО					= ДанныеЗаполнения.ИФО;
			Дата				= ДанныеЗаполнения.Дата;
			СуммаДокумента		= ДанныеЗаполнения.СуммаДокумента;
			ДокументОснование	= ДанныеЗаполнения;
			КодВидаДохода		= ДанныеЗаполнения.КодВидаДохода;
			
			ТаблицаДляЗаполнения = ДанныеЗаполнения.РасшифровкаПлатежа.Выгрузить();
			ТаблицаДляЗаполнения.Свернуть("КФО,КПС,КЭК,КодЦели,КодМероприятия,ДопКлассификация","Сумма");
			
			Если ТаблицаДляЗаполнения.Количество() = 1 Тогда
				КФО						= ДанныеЗаполнения.РасшифровкаПлатежа[0].КФО;
				КБКНазначениеПлатежа	= ДанныеЗаполнения.РасшифровкаПлатежа[0].КПС;
				КОСГУНазначениеПлатежа	= ДанныеЗаполнения.РасшифровкаПлатежа[0].КЭК;
				КодЦели					= ДанныеЗаполнения.РасшифровкаПлатежа[0].КодЦели;
				КодМероприятия			= ДанныеЗаполнения.РасшифровкаПлатежа[0].КодМероприятия;
				ДопКлассификация		= ДанныеЗаполнения.РасшифровкаПлатежа[0].ДопКлассификация;
				
				ДопустимыеИсточникиСредств = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ЛицевойСчет,КФО);
				Если ДопустимыеИсточникиСредств.Количество() = 1 Тогда
					ИсточникСредств = ДопустимыеИсточникиСредств[0];
				КонецЕсли;
				
			ИначеЕсли ТаблицаДляЗаполнения.Количество() > 1 Тогда
				ТекстИсключения = НСтр("ru='Заявка на кассовый расход (сокращенная) не может быть введена на основании ведомости с различными кодами бюджетной классификации.'");
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СведенияОДенежномОбязательстве") Тогда
		
		ДокументТМЦ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ПодтверждающийДокумент");
		
		Если НЕ Метаданные.Документы.ЗаявкаНаКассовыйРасход.ВводитсяНаОсновании.Содержит(ДокументТМЦ.Метаданные()) Тогда
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='Ввод на основании денежного обязательства, принятого по документу %1 невозможен!'"),
									ДокументТМЦ.Метаданные().Синоним);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
		ЗаполнитьПоДО(ДанныеЗаполнения, ДокументТМЦ);
		
		ДокументОснование = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеМЗ") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеМЗВПути") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеОС") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеОСВПути") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеУслугРабот") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам") Тогда
		
		ДокументДО = Документы.СведенияОДенежномОбязательстве.ДенежноеОбязательствоПоДокументуТМЦ(ДанныеЗаполнения);
		
		ЗаполнитьПоДО(ДокументДО, ДанныеЗаполнения); 
		
		ДокументОснование = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КассовоеПоступление") Тогда
		
		ЗаполнитьПоКассовомуПоступлению(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаВыдачуАванса") Тогда
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииЗаявленияНаВыдачуАванса(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомандировании") Тогда
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииРешенияОКомандировании(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомпенсацииРасходовДляКрайнегоСевера") Тогда
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииРешенияОКомпенсации(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииЗаявкиОбоснования(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетОРасходахПодотчетногоЛица") Тогда
		ПлатежноРасчетныеДокументы.ЗаполнитьНаОснованииОтчетаОРасходахПодотчетногоЛица(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Отказ = ПлатежноРасчетныеДокументы.ВыполнитьДвиженияПлатежноРасчетногоДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КонтрольИсполненияДоговоров.ОчиститьДвиженияРегистровПодсистемы(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноРасчетныеДокументы.ПриЗаписиНаСервереУстановкаСтатуса(Отказ, ЭтотОбъект);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	
	// Очистим поле "Оплатить до", т.к. данный платеж, скорее всего, уже был оплачен в документе, который копируем.
	ОплатитьДо = Дата("00010101");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоДО(ДокументДО, ДокументТМЦ)
	
	ДанныеДляЗаполнения = Документы.ЗаявкаНаКассовыйРасход.ЗначенияЗаполненияПоПоступлениюТМЦ(ДокументДО, ДокументТМЦ);
	
	Если ДанныеДляЗаполнения.РасшифровкаПлатежа.Количество() > 1 Тогда
		ТекстИсключения = НСтр("ru='Заявка на кассовый расход (сокращенная) не может быть введена на основании документа с различными кодами бюджетной классификации.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;	
	
	ИсточникСредствШапка = Неопределено;
	
	Если ДанныеДляЗаполнения.Шапка.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.Шапка[0]);
		Если ЗначениеЗаполнено(Договор) Тогда   
			Документы.ЗаявкаНаКассовыйРасходСокращенная.ЗаполнитьРеквизитыДоговора(ЭтотОбъект);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.Шапка[0]);
		Документы.ЗаявкаНаКассовыйРасход.ЗаполнитьРеквизитыПолучателя(ЭтотОбъект);
	Конецесли;
	
	Если ДанныеДляЗаполнения.ШапкаДО.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.ШапкаДО[0]);
		ИсточникСредствШапка = ДанныеДляЗаполнения.ШапкаДО[0].ИсточникСредств;
	ИначеЕсли ДанныеДляЗаполнения.ЛицевойСчет.Количество() > 0
		И ЗначениеЗаполнено(ДанныеДляЗаполнения.ЛицевойСчет[0].РеквизитыЛицевогоСчета) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.ЛицевойСчет[0]); 	
	Конецесли;
	
	Если ДанныеДляЗаполнения.РасшифровкаПлатежа.Количество() > 0 Тогда
		Стр = ДанныеДляЗаполнения.РасшифровкаПлатежа[0];
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Стр);
		СуммаДокумента = Стр.Сумма; 
		Если НЕ ЗначениеЗаполнено(ИсточникСредств) Тогда
			ИсточникСредств = ИсточникСредствШапка;
		КонецЕсли;
		
		ВидРасчетов = ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг");
		
		КорСчет = ДанныеДляЗаполнения.КорСчет;
		ПризнакАвансовогоПлатежа = ДанныеДляЗаполнения.ЭтоАванс;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоКассовомуПоступлению(ДанныеЗаполнения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	КассовоеПоступление.Ссылка КАК ДокументОснование,
	|	КассовоеПоступление.Организация КАК Организация,
	|	КассовоеПоступление.ИФО КАК ИФО,
	|	КассовоеПоступление.ЛицевойСчет КАК ЛицевойСчет,
	|	КассовоеПоступление.Плательщик КАК Контрагент,
	|	КассовоеПоступление.СчетКонтрагента КАК СчетКонтрагента,
	|	КассовоеПоступление.СуммаДокумента КАК СуммаДокумента,
	|	КассовоеПоступление.СтавкаНДС КАК СтавкаНДС,
	|	КассовоеПоступление.СуммаНДС КАК СуммаНДС,
	|	КассовоеПоступление.Договор КАК Договор,
	|	КассовоеПоступление.ВалютаДокумента КАК ВалютаДокумента,
	|	КассовоеПоступление.Курс КАК Курс,
	|	КассовоеПоступление.Кратность КАК Кратность,
	|	КассовоеПоступление.СуммаДокументаВВалюте КАК СуммаДокументаВВалюте,
	|	КассовоеПоступление.НазначениеПлатежа КАК НазначениеПлатежа,
	|	КассовоеПоступление.НалогСборПлатеж КАК НалогСборПлатеж,
	|	КассовоеПоступление.Подразделение КАК Подразделение,
	|	КассовоеПоступление.КорСчет КАК КорСчет
	|ИЗ
	|	Документ.КассовоеПоступление КАК КассовоеПоступление
	|ГДЕ
	|	КассовоеПоступление.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КассовоеПоступлениеРасшифровкаПлатежа.ИсточникСредств КАК ИсточникСредств,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КБКНазначениеПлатежа КАК КБКНазначениеПлатежа,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КОСГУНазначениеПлатежа КАК КОСГУНазначениеПлатежа,
	|	КассовоеПоступлениеРасшифровкаПлатежа.Примечание КАК Примечание,
	|	СУММА(КассовоеПоступлениеРасшифровкаПлатежа.СуммаВал) КАК СуммаВал,
	|	СУММА(КассовоеПоступлениеРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КодЦели КАК КодЦели,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
	|	КассовоеПоступлениеРасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КФО КАК КФО,
	|	КассовоеПоступлениеРасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
	|	КассовоеПоступлениеРасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
	|	КассовоеПоступлениеРасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
	|	КассовоеПоступлениеРасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов,
	|	КассовоеПоступлениеРасшифровкаПлатежа.Договор КАК Договор
	|ИЗ
	|	Документ.КассовоеПоступление.РасшифровкаПлатежа КАК КассовоеПоступлениеРасшифровкаПлатежа
	|ГДЕ
	|	КассовоеПоступлениеРасшифровкаПлатежа.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КассовоеПоступлениеРасшифровкаПлатежа.ИсточникСредств,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КБКНазначениеПлатежа,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КОСГУНазначениеПлатежа,
	|	КассовоеПоступлениеРасшифровкаПлатежа.Примечание,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КодЦели,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КодМероприятия,
	|	КассовоеПоступлениеРасшифровкаПлатежа.ДопКлассификация,
	|	КассовоеПоступлениеРасшифровкаПлатежа.КФО,
	|	КассовоеПоступлениеРасшифровкаПлатежа.СчетРасчетов,
	|	КассовоеПоступлениеРасшифровкаПлатежа.СпособПогашенияЗадолженности,
	|	КассовоеПоступлениеРасшифровкаПлатежа.ДопСубконтоРасчетов,
	|	КассовоеПоступлениеРасшифровкаПлатежа.ВидРасчетов,
	|	КассовоеПоступлениеРасшифровкаПлатежа.Договор");
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения); 
	
	Результат = Запрос.ВыполнитьПакет();
	
	РасшифровкаПлатежа = Результат[1].Выгрузить();
	
	Если РасшифровкаПлатежа.Количество() > 1 Тогда
		ТекстИсключения = НСтр("ru='Заявка на кассовый расход (сокращенная) не может быть введена на основании документа с различными кодами бюджетной классификации.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;	
	
	Выборка = Результат[0].Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РасшифровкаПлатежа[0]);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	РеквизитыЛицевыхСчетов.Ссылка КАК Ссылка,
	|	РеквизитыЛицевыхСчетов.КассовыйОрган КАК КассовыйОрган
	|ИЗ
	|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|ГДЕ
	|	РеквизитыЛицевыхСчетов.Владелец = &Владелец");
	
	Запрос.УстановитьПараметр("Владелец", ЛицевойСчет);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		РеквизитыЛицевогоСчета = Выборка.Ссылка;
		ОрганКазначейства = Выборка.КассовыйОрган;
	КонецЕсли;	

	Документы.ЗаявкаНаКассовыйРасходСокращенная.ЗаполнитьРеквизитыПолучателя(ЭтотОбъект);
	Документы.ЗаявкаНаКассовыйРасходСокращенная.ЗаполнитьРеквизитыДоговора(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#КонецЕсли