#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Максимальное кол-во строк в таблице "Фактическое наличие ценностей" при ручном редактировании.
Функция ПолучитьМаксимальноеКоличествоСтрокТаблицыЦенностей() Экспорт
	Возврат 5; 
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Форма 0317013 (Инв-15)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0317013";
	КомандаПечати.Представление = НСтр("ru='Акт инвентаризации (Инв-15)'");
	
	// Пустой бланк формы 0317013 (Инв-15)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0317013бланк";
	КомандаПечати.Представление = НСтр("ru='Акт инвентаризации (Инв-15), пустой бланк'");

КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0317013") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"Форма0317013",
															"ф.0317013",
															ПечатьФормы0317013(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
														
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0317013бланк") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"Форма0317013бланк",
															"ф.0317013 (бланк)",
															ПечатьФормы0317013(МассивОбъектов, ОбъектыПечати, Истина));
	КонецЕсли;
	
КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
		//чтобы при программном открытии формы выбора установился режим выбора
		Параметры.Вставить("РежимВыбора", Истина);
		ВыбраннаяФорма = Метаданные.Документы.АктИнвентаризацииНаличныхДенежныхСредств.Формы.ФормаСписка;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПечатьФормы0317013(МассивОбъектов, ОбъектыПечати, ЭтоБланк = Ложь)
	
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПечатьФормы0317013";
	ТабДокумент.АвтоМасштаб = Истина;
	
	// Используемый макет:
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктИнвентаризацииНаличныхДенежныхСредств.ПФ_MXL_Ф0317013");
	
	// Настраиваем запрос:
	ЗапросыПечать = Новый Запрос();
	ЗапросыПечать.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	ЗапросыПечать.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Шапка документа
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка							КАК ДокСсылка,
	|	Номер							КАК Номер,
	|	Дата 							КАК Дата,
	|	Организация						КАК Организация,
	|	Организация.НаименованиеПолное	КАК ОрганизацияНаименование,
	|	Подразделение.Наименование		КАК ПодразделениеНаименование,
	|	Организация.КодОКПО				КАК КодОКПО,
	|	МОЛ								КАК МОЛ,
	|	
	|	УчитыватьФК						КАК УчитыватьФК,
	|	ПоследнийРКОНомер				КАК НомерРКО,
	|	ПоследнийПКОНомер				КАК НомерПКО,
	|	ПоследнийРОФНомер				КАК НомерРОФ,
	|	ПоследнийПОФНомер				КАК НомерПОФ,
	|	ИтогоУчет						КАК ИтогоУчет,
	|	ТекстОбъяснения					КАК ТекстОбъяснения,
	|	ТекстРешения					КАК ТекстРешения,
	|	
	|	ДолжностьПредседателяКомиссии	КАК ДолжностьПредседателяКомиссии,
	|	ФамилияПредседателяКомиссии		КАК ФамилияПредседателяКомиссии,
	|	ИмяПредседателяКомиссии			КАК ИмяПредседателяКомиссии,
	|	ОтчествоПредседателяКомиссии	КАК ОтчествоПредседателяКомиссии,
	|	ДатаНачала						КАК ДатаНачала,
	|	ДатаОкончания					КАК ДатаОкончания,
	|	ДатаПриказаИнвентаризации		КАК ДатаПриказаИнвентаризации,
	|	НомерПриказаИнвентаризации		КАК НомерПриказаИнвентаризации,
	|	ДатаПриказаКомиссии				КАК ДатаПриказаКомиссии,
	|	НомерПриказаКомиссии			КАК НомерПриказаКомиссии
	|ИЗ
	|	Документ.АктИнвентаризацииНаличныхДенежныхСредств
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Таблица инвентаризационной комиссии
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка					КАК ДокСсылка,
	|	ДолжностьЧленаКомиссии	КАК ДолжностьЧленаКомиссии,
	|	ФамилияЧленаКомиссии	КАК ФамилияЧленаКомиссии,
	|	ИмяЧленаКомиссии		КАК ИмяЧленаКомиссии,
	|	ОтчествоЧленаКомиссии	КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.АктИнвентаризацииНаличныхДенежныхСредств.СоставКомиссии	КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В (&МассивСсылок)
	|ИТОГИ ПО
	|	// Обязательно первые итоги по ссылке на документ:
	|	ТЧ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Фактическое наличие ценностей и итоговые результаты инвентаризации
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка			КАК ДокСсылка,
	|	ВидЦенности		КАК ВидЦенности,
	|	Сумма			КАК Сумма
	|ИЗ
	|	Документ.АктИнвентаризацииНаличныхДенежныхСредств.ЦенностиФакт	КАК ТЧ
	|ГДЕ
	|	Ссылка В (&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Сумма)	КАК Сумма
	|ПО
	|	// Обязательно первые итоги по ссылке на документ:
	| 	ДокСсылка
	|;";
	
	РезультатыПечать = ЗапросыПечать.ВыполнитьПакет();
	
	ВыборкаШапка		= РезультатыПечать[0].Выбрать();
	ВыборкаДокКомиссия	= РезультатыПечать[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДокЦенности	= РезультатыПечать[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Выборки по документам:
	ПервыйДокумент = Истина;
	Пока ВыборкаШапка.Следующий() Цикл
		
		// Используемые области макета.
		// Страница 1:
		ОбластьЗаголовокС1	= Макет.ПолучитьОбласть("Заголовок_с1");
		ОбластьСтрокаС1		= Макет.ПолучитьОбласть("Строка_с1");
		ОбластьИтогиС1		= Макет.ПолучитьОбласть("Итоги_с1");
		ОбластьКомиссияС1	= Макет.ПолучитьОбласть("Комиссия_с1");
		ОбластьПодвалС1		= Макет.ПолучитьОбласть("Подвал_с1");
		// Страница 2:
		ОбластьЗаголовокС2		= Макет.ПолучитьОбласть("Заголовок_с2");
		ОбластьОбъяснение1С2	= Макет.ПолучитьОбласть("Объяснение1_с2");
		ОбластьОбъяснение2С2	= Макет.ПолучитьОбласть("Объяснение2_с2");
		ОбластьМОЛС2			= Макет.ПолучитьОбласть("МОЛ_с2");
		ОбластьРешение1С2		= Макет.ПолучитьОбласть("Решение1_с2");
		ОбластьРешение2С2		= Макет.ПолучитьОбласть("Решение2_с2");
		ОбластьРуководительС2	= Макет.ПолучитьОбласть("Руководитель_с2");
		
		// Продвигаемся в остальных выборках до текущего документа:
		ПоискТекущегоДокумента = Новый Структура("ДокСсылка", ВыборкаШапка["ДокСсылка"]);
		ВыборкаДокЦенности.Сбросить();
		ВыборкаДокКомиссия.Сбросить();
		ЕстьВыборкаДокЦенности	= ВыборкаДокЦенности.НайтиСледующий(ПоискТекущегоДокумента);
		ЕстьВыборкаДокКомиссия	= ВыборкаДокКомиссия.НайтиСледующий(ПоискТекущегоДокумента);
		
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		//---
		// Страница 1
		//---
		ОбластьЗаголовокС1.Параметры.Заполнить(ВыборкаШапка);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьЗаголовокС1,"Номер",ВыборкаШапка.Номер,ВыборкаШапка.ДокСсылка,Неопределено, Истина);
		
		//---
		// Сведения о МОЛ
		//---
		МОЛ				= ВыборкаШапка.МОЛ;
		МОЛДолжность	= "";
		МОЛФИО			= "";
		МОЛФИОПолное	= "";
		Если ЗначениеЗаполнено(МОЛ) Тогда
			ТребуемыеДанные = Новый Структура("СсылкаНаОбъект, Период, Должность, НаименованиеПолное",
				МОЛ,
				ВыборкаШапка.Дата);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ТребуемыеДанные);
			
			МОЛДолжность = ТребуемыеДанные.Должность;
			МОЛФИО       = Корреспонденты.ФИОПоОбъекту(МОЛ, Истина);
			МОЛФИОПолное = ТребуемыеДанные.НаименованиеПолное;
		КонецЕсли;
		Параметр_МОЛ = Новый Структура("МОЛДолжность, МОЛФИО, МОЛФИОПолное",
			МОЛДолжность,
			МОЛФИО,
			МОЛФИОПолное);
			
		// Заполняем значения параметров выводимой области:
		ОбластьЗаголовокС1.Параметры.Заполнить(Параметр_МОЛ);
		Если ЭтоБланк Тогда
			ОчищающаяСтруктура = Новый Структура("
				|Номер,
				|Дата,
				|МОЛДолжность,
				|МОЛФИО");
			ОбластьЗаголовокС1.Параметры.Заполнить(ОчищающаяСтруктура);
		КонецЕсли;
		// Выводим область:
		ТабДокумент.Вывести(ОбластьЗаголовокС1);
		
		//---
		// Таблица ценностей
		//---
		МаксимальноеКоличествоСтрок = ПолучитьМаксимальноеКоличествоСтрокТаблицыЦенностей();
		НПП = 1;
		ВыборкаЦенности = ВыборкаДокЦенности.Выбрать();
		Пока ВыборкаЦенности.Следующий() Цикл
			ОбластьСтрокаС1 = Макет.ПолучитьОбласть("Строка_с1");
			
			Сумма = ВыборкаЦенности["Сумма"];
			Если Сумма = 0 Тогда
				СуммаРуб = "-";
				СуммаКоп = "-";
			Иначе
				СуммаРуб = Цел(Сумма);
				СуммаКоп = Сумма - Цел(Сумма);
				Если СуммаКоп < 0 Тогда // Боремся с отрицательными копейками
					СуммаКоп = -СуммаКоп;
				КонецЕсли;
			КонецЕсли;
			
			// Заполняем значения параметров выводимой области:
			ЗначенияПараметров = Новый Структура("НПП, ВидЦенности, СуммаРуб, СуммаКоп",
				НПП,
				ВыборкаЦенности["ВидЦенности"],
				СуммаРуб,
				СуммаКоп);
			ОбластьСтрокаС1.Параметры.Заполнить(ЗначенияПараметров);
			Если ЭтоБланк Тогда
				ОчищающаяСтруктура = Новый Структура("
					|ВидЦенности,
					|СуммаРуб,
					|СуммаКоп");
				ОбластьСтрокаС1.Параметры.Заполнить(ОчищающаяСтруктура);
			КонецЕсли;
			// Выводим область:
			ТабДокумент.Вывести(ОбластьСтрокаС1);
			
			НПП = НПП + 1;
		КонецЦикла;
		// Выводим пустые строки до достижения максимального их кол-ва:
		Для сч = НПП По МаксимальноеКоличествоСтрок Цикл
			ОбластьСтрокаС1		= Макет.ПолучитьОбласть("Строка_с1");
			
			// Заполняем значения параметров выводимой области:
			ЗначенияПараметров = Новый Структура("НПП", сч);
			ОбластьСтрокаС1.Параметры.Заполнить(ЗначенияПараметров);
			// Выводим область:
			ТабДокумент.Вывести(ОбластьСтрокаС1);
		КонецЦикла;
		
		//---
		// Итоги
		//---
		Если ЭтоБланк Тогда
			// Очищаем оформление номеров фондовых документов:
			ОбластьИтогиС1.Область("НомераФондовыхДокументов").Очистить(
				Истина,		// ОчищатьТекст
				Истина,		// ОчищатьФорматирование
				Истина);	// ОчищатьРамки
		Иначе
			ИтогоУчет = ВыборкаШапка["ИтогоУчет"];
			ИтогоФакт = ВыборкаДокЦенности["Сумма"];
			Если ИтогоФакт = Неопределено Тогда
				ИтогоФакт = 0;
			КонецЕсли;
			ИтогоУчетРубПропись = ЧислоПрописью(Цел(ИтогоУчет));
			ИтогоФактРубПропись = ЧислоПрописью(Цел(ИтогоФакт));
			ИтогоФактКоп = ИтогоФакт - Цел(ИтогоФакт);
			ИтогоУчетКоп = ИтогоУчет - Цел(ИтогоУчет);
			Если ИтогоФактКоп < 0 Тогда // Боремся с отрицательными копейками
				ИтогоФактКоп = -ИтогоФактКоп;
			КонецЕсли;
			Если ИтогоУчетКоп < 0 Тогда // Боремся с отрицательными копейками
				ИтогоУчетКоп = -ИтогоУчетКоп;
			КонецЕсли;
			
			Недостача = ?(ИтогоУчет > ИтогоФакт,
				ИтогоУчет - ИтогоФакт,
				0);
			Излишек = ?(ИтогоФакт > ИтогоУчет,
				ИтогоФакт - ИтогоУчет,
				0);
				
			Если Недостача = 0 Тогда
				НедостачаРуб = "-";
				НедостачаКоп = "-";
			Иначе
				НедостачаРуб = Цел(Недостача);
				НедостачаКоп = Недостача - Цел(Недостача);
				Если НедостачаКоп < 0 Тогда // Боремся с отрицательными копейками
					НедостачаКоп = -НедостачаКоп;
				КонецЕсли;
			КонецЕсли;
			Если Излишек = 0 Тогда
				ИзлишекРуб = "-";
				ИзлишекКоп = "-";
			Иначе
				ИзлишекРуб = Цел(Излишек);
				ИзлишекКоп = Излишек - Цел(Излишек);
				Если ИзлишекКоп < 0 Тогда // Боремся с отрицательными копейками
					ИзлишекКоп = -ИзлишекКоп;
				КонецЕсли;
			КонецЕсли;
				
			ЗначенияПараметров = Новый Структура();
			ЗначенияПараметров.Вставить("ИтогоФактРуб", Цел(ИтогоФакт));
			ЗначенияПараметров.Вставить("ИтогоФактКоп", ИтогоФактКоп);
			ЗначенияПараметров.Вставить("ИтогоФактРубПропись", Лев(ИтогоФактРубПропись, СтрДлина(ИтогоФактРубПропись) - 4));

			ЗначенияПараметров.Вставить("ИтогоУчетРуб", Цел(ИтогоУчет));
			ЗначенияПараметров.Вставить("ИтогоУчетКоп", ИтогоУчетКоп);
			ЗначенияПараметров.Вставить("ИтогоУчетРубПропись", Лев(ИтогоУчетРубПропись, СтрДлина(ИтогоУчетРубПропись) - 4));

			ЗначенияПараметров.Вставить("ИзлишекРуб", ИзлишекРуб);
			ЗначенияПараметров.Вставить("ИзлишекКоп", ИзлишекКоп);
			ЗначенияПараметров.Вставить("НедостачаРуб", НедостачаРуб);
			ЗначенияПараметров.Вставить("НедостачаКоп", НедостачаКоп);
			
			// Настроим номера фондовых кассовых документов:
			Если ВыборкаШапка["УчитыватьФК"] Тогда
				ЗначенияПараметров.Вставить("ЗаголовокПОФ", НСтр("ru='фондовые: №'"));
				ЗначенияПараметров.Вставить("ЗаголовокРОФ", НСтр("ru='№'"));
			Иначе
				ЗначенияПараметров.Вставить("НомерПОФ", "");
				ЗначенияПараметров.Вставить("НомерРОФ", "");
				
				// Очищаем оформление номеров фондовых документов:
				ОбластьИтогиС1.Область("НомераФондовыхДокументов").Очистить(
					Истина,		// ОчищатьТекст
					Истина,		// ОчищатьФорматирование
					Истина);	// ОчищатьРамки
			КонецЕсли;
			
			// Заполняем значения параметров выводимой области:
			ОбластьИтогиС1.Параметры.Заполнить(ВыборкаШапка);
			ОбластьИтогиС1.Параметры.Заполнить(ЗначенияПараметров);
		КонецЕсли;
		// Выводим область:
		ТабДокумент.Вывести(ОбластьИтогиС1);
		
		//---
		// Инвентаризационная комиссия
		//---
		// Заполняем значения параметров выводимой области:
		ОбластьВсяКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(
			ВыборкаШапка,
			ВыборкаДокКомиссия.Выбрать(),
			ОбластьКомиссияС1, 
			3);
		// Выводим область:
		ТабДокумент.Вывести(ОбластьВсяКомиссия);
		
		// Заполняем значения параметров выводимой области:
		Если НЕ ЭтоБланк Тогда
			ОбластьПодвалС1.Параметры.Заполнить(ВыборкаШапка);
			ОбластьПодвалС1.Параметры.Заполнить(Параметр_МОЛ);
		КонецЕсли;
		// Выводим область:
		ТабДокумент.Вывести(ОбластьПодвалС1);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//---
		// Страница 2
		//---
		// Выводим область:
		ТабДокумент.Вывести(ОбластьЗаголовокС2);
		
		//---
		// Объяснение причин излишков или недостач
		//---
		Если ЭтоБланк Тогда
			Объяснения = "";
		Иначе
			Объяснения = СтрЗаменить(ВыборкаШапка["ТекстОбъяснения"], Символы.ПС, " ");
		КонецЕсли;
		КолвоСимволовПервойСтроки 		= 40;
		КолвоСимволовПоследующихСтрок	= 100;
		КолВыведенныхСтрок = ВывестиДлиннуюСтроку(
			Объяснения, ТабДокумент, 
			ОбластьОбъяснение1С2, ОбластьОбъяснение2С2, 
			КолвоСимволовПервойСтроки, КолвоСимволовПоследующихСтрок);
		// Кол-во строк текста должно быть не менее 14:
		ОбластьОбъяснение2С2	= Макет.ПолучитьОбласть("Объяснение2_с2");
		Для инд = (КолВыведенныхСтрок + 1) по 14 Цикл
			ТабДокумент.Вывести(ОбластьОбъяснение2С2);
		КонецЦикла;
		
		// Заполняем значения параметров выводимой области:
		Если НЕ ЭтоБланк Тогда
			ОбластьМОЛС2.Параметры.Заполнить(Параметр_МОЛ);
		КонецЕсли;
		// Выводим область:
		ТабДокумент.Вывести(ОбластьМОЛС2);
		
		//---
		// Решение руководителя организации
		//---
		Если ЭтоБланк Тогда
			Решение = "";
		Иначе
			Решение = СтрЗаменить(ВыборкаШапка["ТекстРешения"], Символы.ПС, " ");
		КонецЕсли;
		КолвоСимволовПервойСтроки 		= 50;
		КолвоСимволовПоследующихСтрок	= 100;
		КолВыведенныхСтрок = ВывестиДлиннуюСтроку(
			Решение, ТабДокумент, 
			ОбластьРешение1С2, ОбластьРешение2С2, 
			КолвоСимволовПервойСтроки, КолвоСимволовПоследующихСтрок);
		// Кол-во строк текста должно быть не менее 9:
		ОбластьРешение2С2	= Макет.ПолучитьОбласть("Решение2_с2");
		Для инд = (КолВыведенныхСтрок + 1) по 9 Цикл
			ТабДокумент.Вывести(ОбластьРешение2С2);
		КонецЦикла;
		
		// Заполняем значения параметров выводимой области:
		Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
			ВыборкаШапка["Организация"],
			ВыборкаШапка["Дата"]);
		ЗначенияПараметров = Новый Структура("РуководительФИО, РуководительДолжность", 
			КорреспондентыКлиентСервер.ФИО(Руководитель["ОтветственноеЛицоФИО"]),
			Руководитель["ДолжностьПредставление"]);
		Если НЕ ЭтоБланк Тогда
			ОбластьРуководительС2.Параметры.Заполнить(ВыборкаШапка);
		КонецЕсли;
		ОбластьРуководительС2.Параметры.Заполнить(ЗначенияПараметров);
		// Выводим область:
		ТабДокумент.Вывести(ОбластьРуководительС2);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабДокумент, 
			НомерСтрокиНачало,
			ОбъектыПечати,
			ВыборкаШапка.ДокСсылка);
			
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВывестиДлиннуюСтроку(СтрокаВывода, ТабДокумент, Область1, Область2, ЧислоСимволов1, ЧислоСимволов2)
	
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаВывода, " ");
	ТекИндекс = 0;
	Область1.Параметры.Установить(0, СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ЧислоСимволов1));
	ТабДокумент.Вывести(Область1);
	КолВыведенныхСтрок = 1;
	Пока ТекИндекс <= МассивСлов.Количество() - 1 Цикл
		Область2.Параметры.Установить(0, СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ЧислоСимволов2));
		ТабДокумент.Вывести(Область2);
		КолВыведенныхСтрок = КолВыведенныхСтрок + 1;
	КонецЦикла;	
	
	Возврат КолВыведенныхСтрок;
КонецФункции

Функция СобратьСтрокуИзМассиваДляОбласти(МассивСлов, ТекИндекс, ШиринаВСимволах)
	ТекСтрока = "";
	ВсегоСимволов = 0;
	Для к = ТекИндекс по МассивСлов.Количество()-1 Цикл
		ТекСлово = МассивСлов[к];
		ВсегоСимволов = ВсегоСимволов + СтрДлина(" " + ТекСлово);
		Если ВсегоСимволов < ШиринаВСимволах Тогда
			ТекСтрока = ТекСтрока + " " + ТекСлово;
			ТекИндекс = ТекИндекс  + 1;
		ИначеЕсли ВсегоСимволов = ШиринаВСимволах Тогда
			ТекСтрока = ТекСтрока + " " + ТекСлово;
			ТекИндекс = ТекИндекс  + 1;
			Прервать;
		Иначе
			Прервать
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ТекСтрока;
КонецФункции	

#КонецОбласти

#КонецЕсли
