
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		ИнициализацияФормы();
	КонецЕсли;	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ИнициализацияФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановкаОсновногоПараметра();
	ИнициализацияФормы();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.СезонныйПараметр Тогда
		Если (Объект.МесяцНачалаСезона = 0)ИЛИ(Объект.МесяцНачалаСезона > 12) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Месяц начала сезона имеет некорректное значение.'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
		Конецесли;	
		Если (Объект.МесяцОкончанияСезона = 0)ИЛИ(Объект.МесяцОкончанияСезона > 12) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Месяц окончания сезона имеет некорректное значение.'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
		Конецесли;	
		Если (Объект.ЧислоМесяцаНачалаСезона = 0)ИЛИ(Объект.ЧислоМесяцаНачалаСезона > 31) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Число дня начала сезона имеет некорректное значение.'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
		Конецесли;	
		Если (Объект.ЧислоМесяцаОкончанияСезона = 0)ИЛИ(Объект.ЧислоМесяцаОкончанияСезона > 31) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Число дня окончания сезона имеет некорректное значение.'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
		Конецесли;	
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СезонныйПараметрПриИзменении(Элемент)
	ИнициализацияФормы();
КонецПроцедуры

&НаКлиенте
Процедура ВидНормыПриИзменении(Элемент)
	УстановкаОсновногоПараметра();
	ИнициализацияФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПараметрРасчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьОграниченияОсновногоПараметраРасчетаДляТС(Объект.ВидНормы);
КонецПроцедуры

&НаКлиенте
Процедура ВидГСМПриИзменении(Элемент)
	УстановкаЕдиницыИзмеренияНормы();
КонецПроцедуры

&НаКлиенте
Процедура ВидСМПриИзменении(Элемент)
	УстановкаЕдиницыИзмеренияНормыСМ();
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализацияФормы()
	Если Объект.СезонныйПараметр Тогда
		Элементы.ГруппаНастройкиСезонности.Видимость = Истина;
	Иначе
		Элементы.ГруппаНастройкиСезонности.Видимость = Ложь;
	КонецЕсли;	
	
	Если Объект.ВидНормы = Перечисления.ВидыНормРасходаГСМ.НормаРасходаСмазочныхМатериалов Тогда
		Элементы.ГруппаСмазочныеМатериалы.Видимость = Истина;
		Элементы.ВидГСМ.Видимость = Ложь;
		Элементы.Значение.Заголовок = "Значение расхода";
	Иначе
		Элементы.ГруппаСмазочныеМатериалы.Видимость = Ложь;
		Элементы.ВидГСМ.Видимость = Истина;
		Элементы.Значение.Заголовок = "Значение расхода горючего";
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура УстановкаОсновногоПараметра()
	
	СписокДопустимыхЗначений = УчетГСМ.ПолучитьОграниченияОсновногоПараметраРасчетаДляТС(Объект.ВидНормы);
	Если СписокДопустимыхЗначений.Количество() = 0 Тогда
		//пустой параметр
		Объект.ОсновнойПараметрРасчета = Неопределено;
		Объект.ЕдиницаИзмеренияПараметра = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
		Элементы.ГруппаПараметра.Видимость = Ложь;
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.ОсновнойПараметрРасчета) Тогда
			Объект.ОсновнойПараметрРасчета = СписокДопустимыхЗначений[0].Значение;
			Элементы.ГруппаПараметра.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановкаЕдиницыИзмеренияНормы()
	Если ЗначениеЗаполнено(Объект.ВидГСМ) Тогда
		ДанныеВидаГСМ = УчетГСМ.ПолучитьДанныеВидаГСМ(Объект.ВидГСМ);	
		Объект.ЕдиницаИзмерения = ДанныеВидаГСМ.ЕдиницаИзмерения;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановкаЕдиницыИзмеренияНормыСМ()
	Если ЗначениеЗаполнено(Объект.ВидСМ) Тогда
		ДанныеВидаГСМ = УчетГСМ.ПолучитьДанныеВидаГСМ(Объект.ВидСМ);	
		Объект.ЕдиницаИзмерения = ДанныеВидаГСМ.ЕдиницаИзмерения;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ПолучитьОграниченияОсновногоПараметраРасчетаДляТС(ВидНормы)
	Возврат УчетГСМ.ПолучитьОграниченияОсновногоПараметраРасчетаДляТС(ВидНормы);
КонецФункции	

#КонецОбласти
