
Функция СоздатьСтруктуруОшибки()
	
	Возврат Новый Структура("Описание, Код, ИмяМодуля, ИсходнаяСтрока, НомерСтроки, Объект, Причина");
	
КонецФункции

// Функция формирует код ошибки из сообщений об ошибках, генерируемых
// платформой.
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке - результат вызова функции
//                 ИнформацияОбОшибке().
//
// Возвращаемое значение:
//  Строка. Сгенерированное локальное имя ошибки.
//
Функция СгенерироватьКодОшибки(ИнформацияОбОшибке)
	
	Если ИнформацияОбОшибке.Причина <> Неопределено Тогда
		Описание = ИнформацияОбОшибке.Причина.Описание;
	Иначе
		Описание = ИнформацияОбОшибке.Описание;
	КонецЕсли;
	
	ВидОшибки = "XC"; // exception - исключительная ситуация
	
	Если Найти(Описание, " XDTO") <> 0 Тогда
		КодСоздателя = "XD"; // XDTO
	ИначеЕсли Найти(Описание, " XML") <> 0 Тогда
		КодСоздателя = "ML"; // XML
	ИначеЕсли Найти(Описание, "параметр номер") <> 0 Тогда
		КодСоздателя = "CT"; // contract - система проверки входных и выходных данных (контракты)
		ВидОшибки = "SE";    // static error - ошибка в коде конфигурации
	ИначеЕсли Найти(Описание, "Поле объекта не обнаружено") <> 0 Или Найти(Описание, "Метод объекта не обнаружен") <> 0 Тогда
		КодСоздателя = "EE"; // execution environment - среда исполнения
		ВидОшибки = "SE";    // static error - ошибка в коде конфигурации
	ИначеЕсли Найти(Описание, "Значение не является значением объектного типа") <> 0 Тогда
		КодСоздателя = "EE";
		ВидОшибки = "RE";    // run-time error - ошибка времени исполнения
	ИначеЕсли Найти(Описание, "Операция не выполнена!") <> 0 Тогда
		КодСоздателя = "EH"; // event-handler, обработчик события
		ВидОшибки = "RT"; 	 // rollback transaction. Ошибка вызвана отказом в процедуре "ПриЗаписи"
	Иначе
		КодСоздателя = "V8";
	КонецЕсли;
	
	Возврат КодСоздателя
	     + ВидОшибки
	     + "0000"; // код ошибки - неизвестен
	
КонецФункции
/////////////////////////////////////////////////////////////////////////////////
// ДИАГНОСТИКА                                                                 //
/////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ИнформациюОбОшибкеВСтруктуруОшибки(ИнформацияОбОшибке) Экспорт
	
	Если ИнформацияОбОшибке = Неопределено Тогда
		СтруктураОшибки = Неопределено; // пустая структура
	ИначеЕсли ТипЗнч(ИнформацияОбОшибке) = Тип("Структура") Тогда
		СтруктураОшибки = ИнформацияОбОшибке;
	Иначе
		Если Лев(ИнформацияОбОшибке.Описание, 5) = "{""#""," Тогда
			СтруктураОшибки = ЗначениеИзСтрокиВнутр(ИнформацияОбОшибке.Описание);
			ЗаполнитьЗначенияСвойств(СтруктураОшибки, ИнформацияОбОшибке, "ИмяМодуля, НомерСтроки"); // исходную строку не заполняем, т. к. там всегда ВызватьИсключение
		Иначе
			СтруктураОшибки = СоздатьСтруктуруОшибки();
			Если ТипЗнч(ИнформацияОбОшибке) = Тип("ИнформацияОбОшибке") Тогда
				ЗаполнитьЗначенияСвойств(СтруктураОшибки, ИнформацияОбОшибке,, "Причина");
				СтруктураОшибки.Причина = ИнформациюОбОшибкеВСтруктуруОшибки(ИнформацияОбОшибке.Причина);
				СтруктураОшибки.Код = "{http://v8.1c.ru/8.1/platform-errors}" +
					СгенерироватьКодОшибки(ИнформацияОбОшибке);
			Иначе
				СтруктураОшибки.Описание = Строка(ИнформацияОбОшибке);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураОшибки;
	
КонецФункции

Функция СоздатьОшибку(Сообщение, Параметры = Неопределено, Причина = Неопределено, Код = Неопределено, Объект = Неопределено) Экспорт
	
	СтруктураПричины = ИнформациюОбОшибкеВСтруктуруОшибки(Причина);
	
	Результат = СоздатьСтруктуруОшибки();
	Результат.Описание = ФорматироватьСообщение(Сообщение, Параметры);
	Результат.Код      = Код;
	Результат.Причина  = СтруктураПричины;
	Результат.Объект   = Объект;
	
	Возврат ПолучитьТекстОшибки(Результат);
	//Возврат ЗначениеВСтрокуВнутр(Результат);
	
КонецФункции

Функция ПоказатьОшибку(ИнформацияОбОшибке) Экспорт
	
	ТекстСообщения = ПолучитьТекстОшибки(ИнформацияОбОшибке);
	ТекстСообщения = СформироватьТекстСообщения(ТекстСообщения);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецФункции

Функция СформироватьТекстСообщения(Знач ТекстСообщения)
	
	НачалоСлужебногоСообщения    = Найти(ТекстСообщения, "{");
	ОкончаниеСлужебногоСообщения = Найти(ТекстСообщения, "}:");
	
	Если ОкончаниеСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения > 0 
		И НачалоСлужебногоСообщения < ОкончаниеСлужебногоСообщения Тогда
		
		ТекстСообщения = Лев(ТекстСообщения, (НачалоСлужебногоСообщения - 1)) +
		                 Сред(ТекстСообщения, (ОкончаниеСлужебногоСообщения + 2));
						 
	КонецЕсли;
	
	Возврат СокрЛП(ТекстСообщения);

КонецФункции // ()

Функция ПолучитьТекстОшибки(ИнформацияОбОшибке) Экспорт
	
	СтруктураОшибки = ИнформациюОбОшибкеВСтруктуруОшибки(ИнформацияОбОшибке);
	
	Результат = "";
	
	Пока СтруктураОшибки <> Неопределено Цикл
		
		ШаблонТекста = "[%Код.ЛокальноеИмя%] %Описание%";
		Если не ПустаяСтрока(СтруктураОшибки.ИмяМодуля) Тогда
			ШаблонТекста = ШаблонТекста + "
			|Модуль: %ИмяМодуля%, Номер строки: %НомерСтроки%";
		КонецЕсли;
			
		ТекстОшибки = ФорматироватьСообщение(ШаблонТекста,
						Новый Структура("Описание, Код, ИмяМодуля, НомерСтроки", 
							СтруктураОшибки.Описание,
							ПолучитьКодОшибки(СтруктураОшибки),
							СтруктураОшибки.ИмяМодуля,
							СтруктураОшибки.НомерСтроки));
		
		Результат = Результат + ?(ПустаяСтрока(Результат), "",
			НСтр("ru = '
			|	причина:
			|
			|'")) + ТекстОшибки;
		
		СтруктураОшибки = СтруктураОшибки.Причина;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКодОшибки(ИнформацияОбОшибке) Экспорт
	
	СтруктураОшибки = ИнформациюОбОшибкеВСтруктуруОшибки(ИнформацияОбОшибке);
	
	Результат = Новый РасширенноеИмяXML("", "ERR00000");
	Если СтруктураОшибки <> Неопределено Тогда
		Попытка
			Результат = СериализаторXDTO.XMLЗначение(Тип("РасширенноеИмяXML"), СтруктураОшибки.Код);
		Исключение
			Попытка
				Результат = Новый РасширенноеИмяXML("", СтруктураОшибки.Код);
			Исключение
			КонецПопытки;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоздателяОшибки(КодОшибки) Экспорт
	
	Если ТипЗнч(КодОшибки) = Тип("РасширенноеИмяXML") Тогда
		Возврат Лев(КодОшибки.ЛокальноеИмя, 2);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВидОшибки(КодОшибки) Экспорт
	
	Если ТипЗнч(КодОшибки) = Тип("РасширенноеИмяXML") Тогда
		Возврат Сред(КодОшибки.ЛокальноеИмя, 3, 2);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНомерОшибки(КодОшибки) Экспорт
	
	Если ТипЗнч(КодОшибки) = Тип("РасширенноеИмяXML") Тогда
		Возврат Сред(КодОшибки.ЛокальноеИмя, 5);
	КонецЕсли;
	
КонецФункции

// Формирует сообщение из строки с параметрами. Как строка, так и значения
// параметров могут быть заданы на нескольких языках.
//
// Параметры:
//  Сообщение    - Строка - текст сообщения с включенными в него параметрами 
//                 в форме %ИмяПараметра%.
//  Параметры    - Структура - структура, в которой перечислены значения
//                 параметров.
//
Функция ФорматироватьСообщение(Сообщение, Параметры = Неопределено) Экспорт
	
	Если Найти(СтрЗаменить(Сообщение, " ", ""), ТекущийЯзык().КодЯзыка + "=") <> 0 Тогда
		ТекстСообщения = НСтр(Сообщение);
	Иначе
		ТекстСообщения = Сообщение
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		
		Результат = ТекстСообщения;
		
	Иначе
		
		ОстатокСообщения   = ТекстСообщения;
		ПозНачалаПараметра = Найти(ОстатокСообщения, "%");
		
		Результат = "";
		Если ПозНачалаПараметра > 0 Тогда
			
			Пока ПозНачалаПараметра > 0 Цикл
				
				Результат = Результат + Лев(ОстатокСообщения, ПозНачалаПараметра - 1);
				
				ОстатокСообщения  = Сред(ОстатокСообщения, ПозНачалаПараметра + 1);
				ПозКонцаПараметра = Найти(ОстатокСообщения, "%");
				
				Если ПозКонцаПараметра = 1 Тогда // двойной «%» - не параметр
					
					Результат = Результат + "%";
					
				ИначеЕсли ПозКонцаПараметра = 0 Тогда // ошибка
					
					Результат = Результат + "%";
					Прервать;
					
				Иначе
					
					ПутьКДанным = Лев(ОстатокСообщения, ПозКонцаПараметра - 1);
					Попытка
						Значение = Параметры;
						Для Каждого Имя Из СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПутьКДанным, ".") Цикл
							Значение = Значение[Имя];
						КонецЦикла;
					Исключение
						Значение = "";
					КонецПопытки;
					Результат = Результат + ФорматироватьСообщение(СокрЛП(Значение), Неопределено);
					
				КонецЕсли;
				
				ОстатокСообщения   = Сред(ОстатокСообщения, ПозКонцаПараметра + 1);
				ПозНачалаПараметра = Найти(ОстатокСообщения, "%");
				
			КонецЦикла;
			
		КонецЕсли;
		Результат = Результат + ОстатокСообщения;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ФорматироватьСообщение()

функция ПолучитьПервопричинуОшибки(ИнформацияОбОшибке) Экспорт 
	
	Если ИнформацияОбОшибке.Причина = Неопределено Тогда 
		Возврат ИнформацияОбОшибке.Описание;
	Иначе 
		Возврат ПолучитьПервопричинуОшибки(ИнформацияОбОшибке.Причина);
	КонецЕсли;
	
КонецФункции	