
#Область ПрограммныйИнтерфейс

// Возвращает размеры ставок налога для переданной организации.
//
// Параметры:
//   Организация - СправочникСсылка.Организации
//   ОтчетныйПериод - Дата
//
// Возвращаемое значение:
//   Структура:
//      - ОсновнаяСтавка - Число - размер основной ставки налога УСН
//      - ПовышеннаяСтавка - Число - размер повышенной ставки налога УСН
//
Функция СтавкиНалогаУСН(Организация, ОтчетныйПериод) Экспорт
	
	СтавкиНалогаУСН = Новый Структура;
	СтавкиНалогаУСН.Вставить("ОсновнаяСтавка", 0);
	СтавкиНалогаУСН.Вставить("ПовышеннаяСтавка", 0);
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(Организация, ОтчетныйПериод);
	СтавкиНалогаУСН.ОсновнаяСтавка = УчетнаяПолитика.СтавкаНалогаУСН;
	
	Если УчетнаяПолитика.ПрименяетсяУСНДоходы Тогда
		СтавкиНалогаУСН.ПовышеннаяСтавка = 
			УчетУСНКлиентСервер.НалоговыеСтавкиПоУмолчанию(ОтчетныйПериод).СтавкаУСНДоходыПовышенная;
	Иначе
		СтавкиНалогаУСН.ПовышеннаяСтавка = 
			УчетУСНКлиентСервер.НалоговыеСтавкиПоУмолчанию(ОтчетныйПериод).СтавкаУСНДоходыМинусРасходыПовышенная;
	КонецЕсли;
	
	Возврат СтавкиНалогаУСН;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НаименованиеКонтрагентаДляКУДиР(Контрагент) Экспорт
	
	Возврат ?(ЗначениеЗаполнено(Контрагент.НаименованиеСокращенное), 
				Контрагент.НаименованиеСокращенное,
				Контрагент.Наименование);
	
КонецФункции

// Определяет, что не требуется сдавать отчетность и уплачивать налог за переданный период (год)
// по причине регистрации организации в декабре этого года (п. 2 статьи 55 НК РФ).
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - проверяемая организация
//  Период        - Дата - проверяемый период
//
// Возвращаемое значение:
//   Булево   - Если ИСТИНА, это пропущенный период
//              (организация зарегистрирована в декабре переданного года, и для нее актуальны требования п.2 статьи 55 НК РФ).
//
Функция НалоговыйПериодПропущен(Организация, Период, ДатаРегистрации = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(Период) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПропущенныйПериод = ИнтерфейсыВзаимодействияБРО.ПропущенныйНалоговыйПериод(
		Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВДекабре,
		Организация,
		ДатаРегистрации);
	
	Возврат ПропущенныйПериод <> Неопределено И (Год(ПропущенныйПериод) = Год(Период));
	
КонецФункции

// Определяет, что переданный период находится в пределах расширенного первого налогового периода -
// с даты регистрации в декабре по конец следующего года после регистрации (п. 2 статьи 55 НК РФ).
//
// Параметры:
//  Организация   - СправочникСсылка.Организации - проверяемая организация
//  Период        - Дата - проверяемый период (в пределах расширенного налогового периода)
//
// Возвращаемое значение:
//   Булево   - Если ИСТИНА, это расширенный период
//             (организация зарегистрирована в декабре переданного или прошлого года,
//              и для нее актуальны требования п.2 статьи 55 НК РФ).
//
Функция НалоговыйПериодРасширен(Организация, Период, ДатаРегистрации = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация) ИЛИ НЕ ЗначениеЗаполнено(Период) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НалоговыйПериод = ИнтерфейсыВзаимодействияБРО.БлижайшийНалоговыйПериод(Организация,
		Период, Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВДекабре, , ДатаРегистрации);
	
	Возврат НалоговыйПериод.Начало < НалоговыйПериод.Период;
	
КонецФункции

// Возвращает список дат перехода организации с УСН на ОСНО.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - организация, для которой необходимо получить даты перехода.
//
// Возвращаемое значение:
//   СписокЗначений - список дат перехода с УСН на ОСНО
//       * Значение - Дата - конец последнего дня применения УСН.
//       * Представление - Строка - строка вида "Переход на ОСНО с 1 января 2026 г.".
Функция ДатыПереходаСУСННаОСНО(Организация) Экспорт
	
	ДатыПерехода = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиСистемыНалогообложения.Период КАК Период,
	|	НастройкиСистемыНалогообложения.ПрименяетсяУСН КАК ПрименяетсяУСН,
	|	НастройкиСистемыНалогообложения.ПлательщикНалогаНаПрибыль КАК ПрименяетсяОСНО
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК НастройкиСистемыНалогообложения
	|ГДЕ
	|	НастройкиСистемыНалогообложения.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ДатыПерехода;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	ВПредыдущемПериодеПрименяласьУСН = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПрименяетсяОСНО И ВПредыдущемПериодеПрименяласьУСН Тогда
			ДатаПерехода = НачалоДня(Выборка.Период) - 1;
			Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Переход на ОСНО с %1'"), Формат(Выборка.Период, "ДЛФ=DD;"));
			ДатыПерехода.Добавить(ДатаПерехода, Представление);
		КонецЕсли;
		ВПредыдущемПериодеПрименяласьУСН = Выборка.ПрименяетсяУСН;
	КонецЦикла;
	
	Возврат ДатыПерехода;
	
КонецФункции

#КонецОбласти

#Область ИсключениеНДСИзДоходовУСН

Функция ПустаяТаблицаЗачетАвансовПолученныхУСН() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расчетов с контрагентами (покупателями).
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты", ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Суммы для отражения в налоговом учете (УСН).
	ПустаяТаблица.Колонки.Добавить("СуммаВал", ОписаниеТипаСуммы);                // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб", ОписаниеТипаСуммы);                // Сумма в рублях, включая НДС.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях, не учитываемая при налогообложении.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб", ОписаниеТипаСуммы);            // Сумма в рублях, относящаяся к деятельности с особым порядком налогообложения (ЕНВД и пр.).
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб", ОписаниеТипаСуммы);             // Сумма НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаЗачетАвансовПолученныхУСН(ТаблицаРасчетовСЗачетомАвансов, ТаблицыРеализации, Реквизиты, Отказ) Экспорт
	
	ТаблицаЗачетАвансовПолученныхУСН = ПустаяТаблицаЗачетАвансовПолученныхУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСН Тогда
		Возврат ТаблицаЗачетАвансовПолученныхУСН;
	КонецЕсли;
	Если Реквизиты.Свойство("СпособИсключенияНДСИзДоходовУСН") И Реквизиты.СпособИсключенияНДСИзДоходовУСН <> Перечисления.СпособыИсключенияНДСизДоходовУСН.Автоматически Тогда
		Возврат ТаблицаЗачетАвансовПолученныхУСН; // Ниже автоматический алгоритм (способ) исключения НДС из доходов УСН при зачете аванса полученного.
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	Для Каждого СтрокаРасчетов Из ТаблицаРасчетовСЗачетомАвансов Цикл
		
		Если НЕ (СтрокаРасчетов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
			И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаРасчетов.КФО)
			И УчетРасчетов.ВедетсяУчетАвансовПолученных(СтрокаРасчетов.СчетРасчетов) ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаРасчетов.ЭтоЗачетАванса Тогда
			
			НоваяСтрока = ТаблицаЗачетАвансовПолученныхУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчетов,
				"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			НоваяСтрока.ДокументОплаты = СтрокаРасчетов.ДопСубконтоАвансов;
			НоваяСтрока.СуммаВал = СтрокаРасчетов.СуммаРасчетов;
			Если Реквизиты.ВидДеятельностиУСН = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда
				НоваяСтрока.СуммаЕНВДРуб = СтрокаРасчетов.СуммаРубПоКурсуАванса;
			Иначе
				НоваяСтрока.СуммаРуб = СтрокаРасчетов.СуммаРубПоКурсуАванса;
			КонецЕсли;
			
			Если Реквизиты.ВидДеятельностиУСН = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
				
				// Исключение НДС, расчет НДС в составе суммы зачтенного аванса полученного.
				
				СуммаДокумента    = 0; // Итоговая сумма документа.
				СуммаНДС          = 0; // в т.ч. НДС.
				СуммаЕНВД         = 0; // Реализация по деятельности с особым порядком налогообложения (ЕНВД и пр.).
				СуммаКомиссии     = 0; // Реализация по договорам комиссии.
				СуммаУСН          = 0; // Реализация по деятельности на УСН.
				
				Для Каждого ТаблицаРеализации Из ТаблицыРеализации Цикл
					
					ИмяТаблицы = ТаблицаРеализации.Ключ;
					Таблица    = ТаблицаРеализации.Значение;
					
					Отбор = Новый Структура("Контрагент, Договор",
						СтрокаРасчетов.Контрагент,
						СтрокаРасчетов.Договор);
					Отбор.Вставить("КФО", СтрокаРасчетов.КФО);
					Если Реквизиты.ИспользоватьУчетПоИФО Тогда
						Отбор.Вставить("ИФО", СтрокаРасчетов.ИФО);
					КонецЕсли;
					СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасчетов.СчетРасчетов);
					Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
						Отбор.Вставить("КПС", СтрокаРасчетов.КПС);
					КонецЕсли;
					Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
						Отбор.Вставить("Подразделение", СтрокаРасчетов.Подразделение);
					КонецЕсли;
					НайденныеСтрокиРеализации = Таблица.НайтиСтроки(Отбор);
					Для Каждого СтрокаТаблицы Из НайденныеСтрокиРеализации Цикл
						СуммаДокумента = СуммаДокумента + СтрокаТаблицы.СуммаРуб;
						СуммаНДС = СуммаНДС + СтрокаТаблицы.СуммаНДСРуб;
					КонецЦикла;
					
				КонецЦикла;
				
				СуммаУСН = СуммаДокумента - СуммаЕНВД - СуммаКомиссии;
				
				Если СуммаДокумента = 0 ИЛИ СтрокаРасчетов.СуммаРубПоКурсуАванса = 0 Тогда
					СуммаНДСЗачтено = 0;
				ИначеЕсли СтрокаРасчетов.СуммаРубПоКурсуАванса >= СуммаДокумента Тогда // Аванс зачтен на полную сумму документа реализации.
					СуммаНДСЗачтено = СуммаНДС;
				ИначеЕсли СтрокаРасчетов.СуммаРубПоКурсуАванса < СуммаДокумента Тогда // Частичный зачет аванса.
					КоэффициентНДС = СуммаНДС / СуммаДокумента;
					СуммаНДСЗачтено = Окр(СтрокаРасчетов.СуммаРубПоКурсуАванса * КоэффициентНДС, 2);
				КонецЕсли;
				
				СобственнаяВыручка = СуммаДокумента - СуммаКомиссии;
				ДоляСобственнойВыручкиУСН  = ?(СобственнаяВыручка = 0, 0, СуммаУСН / СобственнаяВыручка);
				ДоляСобственнойВыручкиЕНВД = ?(СобственнаяВыручка = 0, 0, СуммаЕНВД / СобственнаяВыручка);
				
				ИсключитьНДСИзДоходовУСН = Окр(СуммаНДСЗачтено * ДоляСобственнойВыручкиУСН, 2);
				Если ИсключитьНДСИзДоходовУСН <> 0 Тогда
					// НДС исключается из доходов УСН в обработчике УчетУСН.СкорректироватьПроводкиОтраженияДоходовРасходов.
					НоваяСтрока.СуммаНДСРуб = ИсключитьНДСИзДоходовУСН;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаЗачетАвансовПолученныхУСН;
	
КонецФункции

Функция ПустаяТаблицаПогашениеЗадолженностиПокупателейУСН() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расчетов с контрагентами (покупателями).
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов", ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты",   ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Суммы для отражения в налоговом учете (УСН).
	ПустаяТаблица.Колонки.Добавить("СуммаВал", ОписаниеТипаСуммы);                // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб", ОписаниеТипаСуммы);                // Сумма в рублях, включая НДС.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях, не учитываемая при налогообложении.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб", ОписаниеТипаСуммы);            // Сумма в рублях, относящаяся к деятельности с особым порядком налогообложения (ЕНВД и пр.).
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб", ОписаниеТипаСуммы);             // Сумма НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("КнигаПродажСуммаБезНДС", ОписаниеТипаСуммы);  // Сумма без НДС в рублях по данным регистра КнигаПродаж.
	ПустаяТаблица.Колонки.Добавить("КнигаПродажСуммаНДС", ОписаниеТипаСуммы);     // Сумма НДС в рублях по данным регистра КнигаПродаж.
	ПустаяТаблица.Колонки.Добавить("ИсключитьНДСИзДоходовУСН", ОписаниеТипаСуммы); // Сумма НДС в рублях к исключению из доходов УСН.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаПогашениеЗадолженностиПокупателейУСН(ТаблицаРасчетовСПогашениемЗадолженности, Реквизиты, Отказ) Экспорт
	
	ТаблицаПогашениеЗадолженностиПокупателейУСН = ПустаяТаблицаПогашениеЗадолженностиПокупателейУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСН Тогда
		Возврат ТаблицаПогашениеЗадолженностиПокупателейУСН;
	КонецЕсли;
	Если Реквизиты.Свойство("УказатьВручнуюДоходыУСН") И Реквизиты.УказатьВручнуюДоходыУСН Тогда
		// В ручном режиме автоматический алгоритм исключения НДС из доходов УСН отключен,
		// т.к. сумма учитываемых доходов указывается пользователем уже за исключением НДС.
		Возврат ТаблицаПогашениеЗадолженностиПокупателейУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД", Истина);
	
	// Получим остатки расчетов УСН (по документам расчетов) по счету УРД "Расчеты с дебиторами (покупателями, заказчиками)".
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты, "Дата"));
	СчетДоходовУСН = БухгалтерскийУчет.СчетПоКоду("УД", ПериодОстатков, Реквизиты.Организация);
	СвойстваСчетаДоходовУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетДоходовУСН);
	
	ОтборРасчетов = Новый Структура;
	ОтборРасчетов.Вставить("Субконто1", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаРасчетовСПогашениемЗадолженности.ВыгрузитьКолонку("Контрагент")));
	ОтборРасчетов.Вставить("Субконто2", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаРасчетовСПогашениемЗадолженности.ВыгрузитьКолонку("Договор")));
	ОтборРасчетов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаРасчетовСПогашениемЗадолженности.ВыгрузитьКолонку("КФО")));
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасчетов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаРасчетовСПогашениемЗадолженности.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиРасчетовУСН = ОстаткиПрочихРасчетовУСН(ПериодОстатков, СчетДоходовУСН, ОтборРасчетов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасчетовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	ОстаткиРасчетовУСН.Индексы.Добавить("ДокументРасчетов");
	
	// Отражение дебетового оборота по счету УД при погашении задолженности.
	Для Каждого СтрокаРасчетов Из ТаблицаРасчетовСПогашениемЗадолженности Цикл
		
		Если НЕ (СтрокаРасчетов.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
			И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаРасчетов.КФО)
			И УчетРасчетов.ВедетсяУчетАвансовПолученных(СтрокаРасчетов.СчетРасчетов) ) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не СтрокаРасчетов.ЭтоАванс Тогда
			
			ОсталосьПогаситьСуммаРасчетов = СтрокаРасчетов.СуммаРасчетов;
			
			Отбор = Новый Структура("Субконто1, Субконто2",
				СтрокаРасчетов.Контрагент,
				СтрокаРасчетов.Договор);
			Отбор.Вставить("КФО", СтрокаРасчетов.КФО);
			Если Реквизиты.ИспользоватьУчетПоИФО Тогда
				Отбор.Вставить("ИФО", СтрокаРасчетов.ИФО);
			КонецЕсли;
			СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасчетов.СчетРасчетов);
			Если СвойстваСчетаРасчетов.УчетПоКПС И СвойстваСчетаДоходовУСН.УчетПоКПС Тогда
				Отбор.Вставить("КПС", СтрокаРасчетов.КПС);
			КонецЕсли;
			Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям И СвойстваСчетаДоходовУСН.УчетПоПодразделениям Тогда
				Отбор.Вставить("Подразделение", СтрокаРасчетов.Подразделение);
			КонецЕсли;
			НайденныеСтрокиРеализации = ОстаткиРасчетовУСН.НайтиСтроки(Отбор);
			Для Каждого СтрокаРеализации Из НайденныеСтрокиРеализации Цикл
				
				СуммаПогаситьВал = Мин(СтрокаРеализации.СуммаВал, ОсталосьПогаситьСуммаРасчетов);
				Если СуммаПогаситьВал <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Коэффициент = СуммаПогаситьВал / СтрокаРеализации.СуммаВал;
				
				НоваяСтрока = ТаблицаПогашениеЗадолженностиПокупателейУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчетов,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
				НоваяСтрока.ДокументРасчетов = СтрокаРеализации.ДокументРасчетов;
				НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
				НоваяСтрока.СуммаВал                = Окр(СтрокаРеализации.СуммаВал * Коэффициент, 2, 1);
				НоваяСтрока.СуммаРуб                = Окр(СтрокаРеализации.СуммаРуб * Коэффициент, 2, 1);
				НоваяСтрока.СуммаНеУчитываетсяНУРуб = Окр(СтрокаРеализации.СуммаНеУчитываетсяНУРуб * Коэффициент, 2, 1);
				НоваяСтрока.СуммаЕНВДРуб            = Окр(СтрокаРеализации.СуммаЕНВДРуб * Коэффициент, 2, 1);
				НоваяСтрока.СуммаНДСРуб             = Окр(СтрокаРеализации.СуммаНДСРуб * Коэффициент, 2, 1);
				
				НоваяСтрока.ИсключитьНДСИзДоходовУСН = НоваяСтрока.СуммаНДСРуб; // По данным документов начисления доходов (реализации товаров, работ, услуг).
				
				СтрокаРеализации.СуммаВал                = СтрокаРеализации.СуммаВал - НоваяСтрока.СуммаВал;
				СтрокаРеализации.СуммаРуб                = СтрокаРеализации.СуммаРуб - НоваяСтрока.СуммаРуб;
				СтрокаРеализации.СуммаНеУчитываетсяНУРуб = СтрокаРеализации.СуммаНеУчитываетсяНУРуб - НоваяСтрока.СуммаНеУчитываетсяНУРуб;
				СтрокаРеализации.СуммаЕНВДРуб            = СтрокаРеализации.СуммаЕНВДРуб - НоваяСтрока.СуммаЕНВДРуб;
				СтрокаРеализации.СуммаНДСРуб             = СтрокаРеализации.СуммаНДСРуб - НоваяСтрока.СуммаНДСРуб;
				
				ОсталосьПогаситьСуммаРасчетов = ОсталосьПогаситьСуммаРасчетов - СуммаПогаситьВал;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавляем данные счетов-фактур (книга продаж).
	Если УчетнаяПолитика.ИсключатьНДСИзДоходовУСНПоДаннымКнигиПродаж Тогда
		
		// Получим данные счетов-фактур по расчетным документам (по данным счета УД).
		ДокументыРасчетов = Новый Массив;
		Для Каждого СтрокаРасчетовУСН Из ОстаткиРасчетовУСН Цикл
			Если ЗначениеЗаполнено(СтрокаРасчетовУСН.ДокументРасчетов)
				И ДокументыРасчетов.Найти(СтрокаРасчетовУСН.ДокументРасчетов) = Неопределено Тогда
				ДокументыРасчетов.Добавить(СтрокаРасчетовУСН.ДокументРасчетов);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДокументыРасчетов", ДокументыРасчетов);
		Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(Реквизиты.Дата));
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КнигаПродажОбороты.СчетФактура.Контрагент КАК Контрагент,
		|	КнигаПродажОбороты.СчетФактура.Договор КАК Договор,
		|	КнигаПродажОбороты.СчетФактура.ДокументОснование КАК ДокументРасчетов,
		|	КнигаПродажОбороты.СуммаБезНДСОборот КАК СуммаБезНДС,
		|	КнигаПродажОбороты.СуммаНДСОборот КАК СуммаНДС
		|ИЗ
		|	РегистрНакопления.КнигаПродаж.Обороты(
		|			,
		|			&КонецПериода,
		|			,
		|			Организация = &Организация
		|				И ПричинаНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.Реализация)
		|				И СчетФактура.ДокументОснование В (&ДокументыРасчетов)) КАК КнигаПродажОбороты";
		НДСПоРеализации = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаНДСПоРеализации Из НДСПоРеализации Цикл
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаНДСПоРеализации.СуммаБезНДС,
				ТаблицаПогашениеЗадолженностиПокупателейУСН, "КнигаПродажСуммаБезНДС", "СуммаВал");
			ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаНДСПоРеализации.СуммаНДС,
				ТаблицаПогашениеЗадолженностиПокупателейУСН, "КнигаПродажСуммаНДС", "СуммаВал");
		КонецЦикла;
		
		Для Каждого СтрокаТаблицы Из ТаблицаПогашениеЗадолженностиПокупателейУСН Цикл
			
			СуммаДокумента    = СтрокаТаблицы.КнигаПродажСуммаБезНДС + СтрокаТаблицы.КнигаПродажСуммаНДС; // Итоговая сумма документа.
			СуммаНДС          = СтрокаТаблицы.КнигаПродажСуммаНДС; // в т.ч. НДС.
			СуммаЕНВД         = СтрокаТаблицы.СуммаЕНВДРуб; // Реализация по деятельности с особым порядком налогообложения (ЕНВД и пр.).
			СуммаКомиссии     = 0; // Реализация по договорам комиссии.
			СуммаУСН          = СуммаДокумента - СуммаЕНВД - СуммаКомиссии; // Реализация по деятельности на УСН.
			
			СуммаРуб = СтрокаТаблицы.СуммаРуб + СтрокаТаблицы.СуммаНДСРуб;
			Если СуммаДокумента = 0 ИЛИ СуммаРуб = 0 Тогда
				СуммаНДСЗачтено = 0;
			ИначеЕсли СуммаРуб >= СуммаДокумента Тогда // Задолженность погашена на полную сумму остатка по документу реализации.
				СуммаНДСЗачтено = СуммаНДС;
			ИначеЕсли СуммаРуб < СуммаДокумента Тогда // Частичное погашение задолженности.
				КоэффициентНДС = СуммаНДС / СуммаДокумента;
				СуммаНДСЗачтено = Окр(СуммаРуб * КоэффициентНДС, 2);
			КонецЕсли;
			
			СобственнаяВыручка = СуммаДокумента - СуммаКомиссии;
			ДоляСобственнойВыручкиУСН  = ?(СобственнаяВыручка = 0, 0, СуммаУСН / СобственнаяВыручка);
			ДоляСобственнойВыручкиЕНВД = ?(СобственнаяВыручка = 0, 0, СуммаЕНВД / СобственнаяВыручка);
			
			СтрокаТаблицы.ИсключитьНДСИзДоходовУСН = Мин(
				СтрокаТаблицы.ИсключитьНДСИзДоходовУСН, // Не превышает сумму НДС по документам начисления доходов.
				СтрокаТаблицы.СуммаНДСРуб, // Не превышает сумму по счету-фактуре.
				Окр(СуммаНДСЗачтено * ДоляСобственнойВыручкиУСН, 2) ); // По данным счетов-фактур и книги продаж.
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаПогашениеЗадолженностиПокупателейУСН;
	
КонецФункции

#КонецОбласти

#Область ПрименяетсяУСНДоходыМинусРасходы

Процедура УстановитьУсловноеОформлениеОтражениеВУСН(Форма, ИмяТаблицы = "Материалы") Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление.Элементы;
	
	Элемент = УсловноеОформление.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор,
		"Объект." + ИмяТаблицы + ".ОтражениеВУСН", Неопределено, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст",      "<авто>");
	
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицы + "ОтражениеВУСН");
	Поле.Использование = Истина;
	
КонецПроцедуры

Функция ОтражениеВУСНпоВидуЗатрат(ВидЗатрат) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВидЗатрат) Тогда
		Возврат Перечисления.ОтражениеВУСН.НеПринимаются;
	КонецЕсли;
	
	Если ВидЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат =
			Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда
		Возврат Перечисления.ОтражениеВУСН.ОсобыйПорядок;
	ИначеЕсли ВидЗатрат.ВидДеятельностиДляНалоговогоУчетаЗатрат =
				Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты Тогда
		Возврат Перечисления.ОтражениеВУСН.Распределяются;
	Иначе // ОсновнаяСистемаНалогообложения
		Если ВидЗатрат.ВидРасходовНУ = Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения Тогда
			Возврат Перечисления.ОтражениеВУСН.НеПринимаются;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Перечисления.ОтражениеВУСН.Принимаются;
	
КонецФункции

Функция ВидРасходовПоСчетуУчетаУСН(СчетУСН) Экспорт
	
	Если БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У01") Тогда
		Возврат Перечисления.ВидыРасходовУСН.ОС;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У04") Тогда
		Возврат Перечисления.ВидыРасходовУСН.НМА;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У08") Тогда
		Возврат Перечисления.ВидыРасходовУСН.КапВложения;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У10")
		ИЛИ   БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У41") Тогда
		Возврат Перечисления.ВидыРасходовУСН.МатериальныеЗапасы;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У15") Тогда
		Возврат Перечисления.ВидыРасходовУСН.ДопРасходы;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У20") Тогда
		Возврат Перечисления.ВидыРасходовУСН.Услуги;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У68") Тогда
		Возврат Перечисления.ВидыРасходовУСН.Налоги;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(СчетУСН, "У70") Тогда
		Возврат Перечисления.ВидыРасходовУСН.ОплатаТруда;
	КонецЕсли;
	
КонецФункции

Функция ЕстьПравоНаВычетНДС(УчетнаяПолитика)
	
	Если УчетнаяПолитика.НДСПрименяетсяОсвобождениеОтУплаты Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат УчетнаяПолитика.СтавкаНалогообложенияПриУСН <> Перечисления.ВидыСтавокНДС.ПониженнаяУСН И
			УчетнаяПолитика.СтавкаНалогообложенияПриУСН <> Перечисления.ВидыСтавокНДС.ОбщаяУСН;
	
КонецФункции

// Формирование элементов учета расходов (справочник "Расходы УСН")

Функция ПолучитьЭлементыУчетаРасходовУСН(ДокументПартии) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходыУСН.Ссылка КАК Ссылка,
	|	РасходыУСН.ПометкаУдаления КАК ПометкаУдаления,
	|	РасходыУСН.Наименование КАК Наименование,
	|	РасходыУСН.ВидРасхода КАК ВидРасхода,
	|	РасходыУСН.ЭлементРасхода КАК ЭлементРасхода,
	|	РасходыУСН.ОтражениеВУСН КАК ОтражениеВУСН,
	|	РасходыУСН.СчетРасчетов КАК СчетРасчетов,
	|	РасходыУСН.Контрагент КАК Контрагент,
	|	РасходыУСН.Договор КАК Договор,
	|	РасходыУСН.ДокументРасчетов КАК ДокументРасчетов,
	|	РасходыУСН.Партия КАК Партия,
	|	РасходыУСН.ИмяСпискаДокумента КАК ИмяСпискаДокумента,
	|	РасходыУСН.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	РасходыУСН.ВведенИзмененВручную КАК ВведенИзмененВручную
	|ИЗ
	|	Справочник.РасходыУСН КАК РасходыУСН
	|ГДЕ
	|	РасходыУСН.Партия = &ДокументПартии
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасходыУСН.НомерСтрокиДокумента";
	Запрос.УстановитьПараметр("ДокументПартии", ДокументПартии);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура СформироватьЭлементыУчетаРасходовУСН(ДокументПартии, ТаблицаРасходовУСН) Экспорт
	
	Если ТаблицаРасходовУСН.Колонки.Найти("РасходыУСН") = Неопределено Тогда
		ТаблицаРасходовУСН.Колонки.Добавить("РасходыУСН", Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	КонецЕсли;
	
	// Поиск существующих элементов учета расходов УСН для данного документа партии.
	СуществующиеЭлементыУчетаРасходовУСН = ПолучитьЭлементыУчетаРасходовУСН(ДокументПартии);
	СуществующиеЭлементыУчетаРасходовУСН.Колонки.Добавить("Использован", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаРасхода Из ТаблицаРасходовУСН Цикл
		
		СписокСвойств = "Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,
			|ВидРасхода,ЭлементРасхода,ОтражениеВУСН,
			|СчетРасчетов,Контрагент,Договор,ДокументРасчетов";
		СвойстваРасходаУСН = Новый Структура(СписокСвойств);
		ЗаполнитьЗначенияСвойств(СвойстваРасходаУСН, СтрокаРасхода, СписокСвойств);
		
		Если СвойстваРасходаУСН.ВидРасхода = Перечисления.ВидыРасходовУСН.ОС
		 ИЛИ СвойстваРасходаУСН.ВидРасхода = Перечисления.ВидыРасходовУСН.НМА Тогда
			РеквизитыПоиска = "Партия, ИмяСпискаДокумента, НомерСтрокиДокумента, ВидРасхода, ЭлементРасхода, ДокументРасчетов";
		Иначе
			РеквизитыПоиска = "Партия, ИмяСпискаДокумента, НомерСтрокиДокумента, ВидРасхода, ЭлементРасхода";
		КонецЕсли;
		
		// Сформируем элементы справочника "Расходы УСН".
		Отбор = Новый Структура(РеквизитыПоиска);
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаРасхода);
		Отбор.Вставить("ВведенИзмененВручную", Ложь);
		НайденныеЭлементы = СуществующиеЭлементыУчетаРасходовУСН.НайтиСтроки(Отбор);
		Если НайденныеЭлементы.Количество() > 0 Тогда
			
			ЭлементУчетаРасходовУСН = НайденныеЭлементы[0];
			ЭлементУчетаРасходовУСН.Использован = Истина;
			
			ЗаписатьЭлемент = Ложь;
			Для Каждого Свойство Из СвойстваРасходаУСН Цикл
				Если ЭлементУчетаРасходовУСН[Свойство.Ключ] <> Свойство.Значение Тогда
					ЗаписатьЭлемент = Истина;
					ЭлементРасходовОбъект = ЭлементУчетаРасходовУСН.Ссылка.ПолучитьОбъект();
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЭлементУчетаРасходовУСН.ПометкаУдаления Тогда
				ЗаписатьЭлемент = Истина;
				ЭлементРасходовОбъект = ЭлементУчетаРасходовУСН.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			
		Иначе
			
			ЗаписатьЭлемент = Истина;
			ЭлементРасходовОбъект = Справочники.РасходыУСН.СоздатьЭлемент();
			
		КонецЕсли;
		
		// Записываем новые или обновляем существующие.
		Если ЗаписатьЭлемент Тогда
			
			ЭтоНовый = ЭлементРасходовОбъект.ЭтоНовый();
			
			ЗаполнитьЗначенияСвойств(ЭлементРасходовОбъект, СвойстваРасходаУСН);
			
			Попытка
				
				ЭлементРасходовОбъект.Наименование = Справочники.РасходыУСН.АвтоНаименованиеРасходаУСН(ЭлементРасходовОбъект);
				
				ЭлементРасходовОбъект.ПометкаУдаления = Ложь;
				ЭлементРасходовОбъект.Записать();
				ЭлементУчетаРасходовУСН = ЭлементРасходовОбъект.Ссылка;
				
			Исключение
				ВызватьИсключение "Ошибка при формировании элементов учета расходов УСН.
					|"+ ОписаниеОшибки();
			КонецПопытки;
			
			Если ЭтоНовый Тогда
				// Запишем в таблицу существующих.
				НовыйЭлементУчета = СуществующиеЭлементыУчетаРасходовУСН.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйЭлементУчета, ЭлементУчетаРасходовУСН);
				НовыйЭлементУчета.Использован = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		// Заполним информацию о расходах УСН в таблице.
		СтрокаРасхода.РасходыУСН = ЭлементУчетаРасходовУСН.Ссылка;
		
	КонецЦикла;
	
	// Пометка на удаление неиспользованных элементов справочника "Расходы УСН".
	НеиспользованныеЭлементы = СуществующиеЭлементыУчетаРасходовУСН.НайтиСтроки(
		Новый Структура("ПометкаУдаления, Использован", Ложь, Ложь));
	Для Каждого НеиспользованныйЭлемент Из НеиспользованныеЭлементы Цикл
		НеиспользованныйЭлементОбъект = НеиспользованныйЭлемент.Ссылка.ПолучитьОбъект();
		НеиспользованныйЭлементОбъект.ПометкаУдаления = Истина;
		Попытка
			НеиспользованныйЭлементОбъект.Записать();
		Исключение
			ВызватьИсключение "Ошибка при формировании элементов учета расходов УСН.
				|"+ ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Поступление расходов УСН

Функция ПустаяТаблицаПоступлениеРасходовУСН() Экспорт

	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Свойства расходов для формирования элементов справочника "Расходы УСН".
	МетаданныеРасходовУСН  = Метаданные.Справочники.РасходыУСН.Реквизиты;
	ПустаяТаблица.Колонки.Добавить("Партия",               МетаданныеРасходовУСН.Партия.Тип);
	ПустаяТаблица.Колонки.Добавить("ИмяСпискаДокумента",   МетаданныеРасходовУСН.ИмяСпискаДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("НомерСтрокиДокумента", МетаданныеРасходовУСН.НомерСтрокиДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидРасхода",           МетаданныеРасходовУСН.ВидРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ЭлементРасхода",       МетаданныеРасходовУСН.ЭлементРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН",        МетаданныеРасходовУСН.ОтражениеВУСН.Тип);
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",         МетаданныеРасходовУСН.СчетРасчетов.Тип);
	ПустаяТаблица.Колонки.Добавить("Контрагент",           МетаданныеРасходовУСН.Контрагент.Тип);
	ПустаяТаблица.Колонки.Добавить("Договор",              МетаданныеРасходовУСН.Договор.Тип);
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",     МетаданныеРасходовУСН.ДокументРасчетов.Тип);
	
	ПустаяТаблица.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	ОписаниеТипаСуммы       = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТипаСубконто    = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	// Элементы справочника "РасходыУСН" формируются "на лету" при подготовке таблицы поступления расходов.
	// Ссылки на сформированные элементы справочника сохраняются в колонках таблицы источника данных
	// для использования в проводках по счетам учета расходов УСН.
	ПустаяТаблица.Колонки.Добавить("РасходыУСН", Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	
	// Дополнительная аналитика учета расходов УСН.
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов2",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов2",     ОписаниеТипаСубконто);
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов3",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов3",     ОписаниеТипаСубконто);
	
	// Суммы поступивших расходов заполняются из соответствующих таблиц поступления (материалов, услуг и пр.).
	ПустаяТаблица.Колонки.Добавить("Количество",              ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма с НДС в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВал",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаПоступлениеРасходовУСН(ТаблицыПоступления, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасходовУСН = ПустаяТаблицаПоступлениеРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
	Реквизиты.Вставить("ЕстьПравоНаВычетНДС", ЕстьПравоНаВычетНДС(УчетнаяПолитика));
	
	// Материальные запасы.
	Если ТаблицыПоступления.Свойство("ПоступлениеМатериальныхЗапасов")
	   И ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеМатериальныхЗапасов Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаДокумента.СуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.МатериальныеЗапасы;
			РасходУСН.ЭлементРасхода = СтрокаДокумента.Номенклатура;
			
			Если ЗначениеЗаполнено(СтрокаДокумента.КПСРасчетов) И (СтрокаДокумента.КПСРасчетов <> СтрокаДокумента.КПС) Тогда
				// Расходы УСН отражаем по КПС расчетов, т.к. оплата их будет производиться по КПС расчетов.
				РасходУСН.КПС = СтрокаДокумента.КПСРасчетов;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ОтражениеВУСН) Тогда // Отражение в УСН явно указано в строке документа.
				РасходУСН.ОтражениеВУСН = СтрокаДокумента.ОтражениеВУСН;
			ИначеЕсли Реквизиты.Свойство("АвтоОтражениеВУСН")
				И ЗначениеЗаполнено(Реквизиты.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
				РасходУСН.ОтражениеВУСН = Реквизиты.АвтоОтражениеВУСН;
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			ВидСчетаБУ = НалоговыйУчетКлиентСервер.ВидСчетаБУ(СтрокаДокумента.СчетУчета);
			Если ВидСчетаБУ = "СчетВложенийМЗ" Тогда
				РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У15.СО");
				РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
				РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
				РасходУСН.ВидСубконтоРасходов3 = ПланыВидовХарактеристик.ВидыСубконто.Партии;
				РасходУСН.СубконтоРасходов3    = Реквизиты.Ссылка;
			ИначеЕсли ВидСчетаБУ = "СчетМатериалов" Тогда
				РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.СО");
				РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
				РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
			ИначеЕсли ВидСчетаБУ = "СчетТоваровНаСкладах"
				ИЛИ ВидСчетаБУ = "СчетГотовойПродукции" Тогда
				РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.СО");
				РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
				РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
			КонецЕсли;
			
			РасходУСН.Количество  = СтрокаДокумента.Количество;
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			Иначе
				РасходУСН.СуммаРуб    = СтрокаДокумента.СуммаРуб - СтрокаДокумента.СуммаНДСРуб;
				РасходУСН.СуммаВал    = СтрокаДокумента.СуммаВал - СтрокаДокумента.СуммаНДСВал;
				РасходУСН.СуммаНДСРуб = СтрокаДокумента.СуммаНДСВал * РасходУСН.СуммаРуб / РасходУСН.СуммаВал;
				РасходУСН.СуммаНДСВал = СтрокаДокумента.СуммаНДСВал;
			КонецЕсли;
			
			Если Реквизиты.ЕстьПравоНаВычетНДС Тогда // НДС не учитывается в расходах УСН.
				РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб + РасходУСН.СуммаНДСРуб;
				РасходУСН.СуммаНДСРуб = 0;
			КонецЕсли;
			
			Если УчетРасчетов.УчетАгентскогоНДС(СтрокаДокумента.Договор) И СтрокаДокумента.СуммаНДСВал > 0 Тогда
				ДобавитьСтрокуАгентскийНДС(ТаблицаРасходовУСН, СтрокаДокумента, РасходУСН);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Возвратная тара.
	Если ТаблицыПоступления.Свойство("ПоступлениеВозвратнойТары")
	   И ТаблицыПоступления.ПоступлениеВозвратнойТары.Количество() > 0 Тогда
		
		// Поступление возвратной тары фиксируем как не принимаемые расходы УСН,
		// т.к. расчеты по возвратной таре учитываются вместе с расчетами за материалы (товары),
		// и оплата за возвратную тару не выделяется отдельно от оплаты за материалы (товары).
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеВозвратнойТары Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.МатериальныеЗапасы;
			РасходУСН.ЭлементРасхода = СтрокаДокумента.Номенклатура;
			РасходУСН.ОтражениеВУСН  = Перечисления.ОтражениеВУСН.НеПринимаются;
			
			Если ЗначениеЗаполнено(СтрокаДокумента.КПСРасчетов) И (СтрокаДокумента.КПСРасчетов <> СтрокаДокумента.КПС) Тогда
				// Расходы УСН отражаем по КПС расчетов, т.к. оплата их будет производиться по КПС расчетов.
				РасходУСН.КПС = СтрокаДокумента.КПСРасчетов;
			КонецЕсли;
			
			ВидСчетаБУ = НалоговыйУчетКлиентСервер.ВидСчетаБУ(СтрокаДокумента.СчетУчета);
			Если ВидСчетаБУ = "СчетВложенийМЗ" Тогда
				РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У15.СО");
				РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
				РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
				РасходУСН.ВидСубконтоРасходов3 = ПланыВидовХарактеристик.ВидыСубконто.Партии;
				РасходУСН.СубконтоРасходов3    = Реквизиты.Ссылка;
			ИначеЕсли ВидСчетаБУ = "СчетМатериалов" Тогда
				РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.СО");
				РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
				РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
			ИначеЕсли ВидСчетаБУ = "СчетТоваровНаСкладах" Тогда
				РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.СО");
				РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
				РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
			КонецЕсли;
			
			РасходУСН.Количество              = СтрокаДокумента.Количество;
			РасходУСН.СуммаВал                = СтрокаДокумента.СуммаВал;
			РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Поступление услуг, работ
	Если ТаблицыПоступления.Свойство("ПоступлениеУслугРабот")
	   И ТаблицыПоступления.ПоступлениеУслугРабот.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеУслугРабот Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаДокумента.СуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода = Перечисления.ВидыРасходовУСН.Услуги;
			Если ЗначениеЗаполнено(СтрокаДокумента.ВидЗатрат) Тогда
				РасходУСН.ЭлементРасхода = СтрокаДокумента.ВидЗатрат;
			Иначе
				РасходУСН.ЭлементРасхода = Лев(СокрЛП(СтрокаДокумента.Содержание), 200);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ОтражениеВУСН) Тогда // Отражение в УСН явно указано в строке документа.
				РасходУСН.ОтражениеВУСН = СтрокаДокумента.ОтражениеВУСН;
			ИначеЕсли Реквизиты.Свойство("АвтоОтражениеВУСН")
				И ЗначениеЗаполнено(Реквизиты.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
				РасходУСН.ОтражениеВУСН = Реквизиты.АвтоОтражениеВУСН;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ВидЗатрат) Тогда // Отражение в УСН определим из вида затрат.
				РасходУСН.ОтражениеВУСН = УчетУСН.ОтражениеВУСНпоВидуЗатрат(СтрокаДокумента.ВидЗатрат);
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У20.О");
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
			РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
			РасходУСН.ВидСубконтоРасходов3 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат;
			РасходУСН.СубконтоРасходов3    = СтрокаДокумента.ВидЗатрат;
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			Иначе
				РасходУСН.СуммаРуб    = СтрокаДокумента.СуммаРуб - СтрокаДокумента.СуммаНДСРуб;
				РасходУСН.СуммаВал    = СтрокаДокумента.СуммаВал - СтрокаДокумента.СуммаНДСВал;
				РасходУСН.СуммаНДСРуб = СтрокаДокумента.СуммаНДСВал * РасходУСН.СуммаРуб / РасходУСН.СуммаВал;
				РасходУСН.СуммаНДСВал = СтрокаДокумента.СуммаНДСВал;
			КонецЕсли;
			
			Если Реквизиты.ЕстьПравоНаВычетНДС Тогда // НДС не учитывается в расходах УСН.
				РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб + РасходУСН.СуммаНДСРуб;
				РасходУСН.СуммаНДСРуб = 0;
			КонецЕсли;
			
			Если УчетРасчетов.УчетАгентскогоНДС(СтрокаДокумента.Договор) И СтрокаДокумента.СуммаНДСВал > 0 Тогда
				ДобавитьСтрокуАгентскийНДС(ТаблицаРасходовУСН, СтрокаДокумента, РасходУСН);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Поступление доп. расходов, включаемых в себестоимость материальных запасов.
	Если ТаблицыПоступления.Свойство("ПоступлениеДопРасходов")
	   И ТаблицыПоступления.ПоступлениеДопРасходов.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеДопРасходов Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаДокумента.СуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.ДопРасходы;
			РасходУСН.ЭлементРасхода = СтрокаДокумента.НоменклатураВложений;
			
			Если Реквизиты.Свойство("АвтоОтражениеВУСН")
				И ЗначениеЗаполнено(Реквизиты.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
				РасходУСН.ОтражениеВУСН = Реквизиты.АвтоОтражениеВУСН;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ВидЗатрат) Тогда // Отражение в УСН определим из вида затрат.
				РасходУСН.ОтражениеВУСН = УчетУСН.ОтражениеВУСНпоВидуЗатрат(СтрокаДокумента.ВидЗатрат);
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			Если Реквизиты.ДопРасходыПоОплате Тогда
				РасходУСН.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У15.О");
			Иначе
				РасходУСН.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У15.СО");
			КонецЕсли;
			
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
			РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
			РасходУСН.ВидСубконтоРасходов3 = ПланыВидовХарактеристик.ВидыСубконто.Партии;
			РасходУСН.СубконтоРасходов3    = СтрокаДокумента.ПартияВложений;
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			Иначе
				РасходУСН.СуммаРуб    = СтрокаДокумента.СуммаРуб - СтрокаДокумента.СуммаНДСРуб;
				РасходУСН.СуммаВал    = СтрокаДокумента.СуммаВал - СтрокаДокумента.СуммаНДСВал;
				РасходУСН.СуммаНДСРуб = СтрокаДокумента.СуммаНДСВал * РасходУСН.СуммаРуб / РасходУСН.СуммаВал;
				РасходУСН.СуммаНДСВал = СтрокаДокумента.СуммаНДСВал;
			КонецЕсли;
			
			Если Реквизиты.ЕстьПравоНаВычетНДС Тогда // НДС не учитывается в расходах УСН.
				РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб + РасходУСН.СуммаНДСРуб;
				РасходУСН.СуммаНДСРуб = 0;
			КонецЕсли;
			
			Если УчетРасчетов.УчетАгентскогоНДС(СтрокаДокумента.Договор) И СтрокаДокумента.СуммаНДСВал > 0 Тогда
				ДобавитьСтрокуАгентскийНДС(ТаблицаРасходовУСН, СтрокаДокумента, РасходУСН);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Вложения во внеоборотные активы.
	Если ТаблицыПоступления.Свойство("ВложенияВоВнеоборотныеАктивы")
	   И ТаблицыПоступления.ВложенияВоВнеоборотныеАктивы.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ВложенияВоВнеоборотныеАктивы Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаДокумента.СуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			Если БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетВложений, "106.60") Тогда
				// Вложения в права пользования нематериальными активами.
				// Неисключительные права пользования на результаты интеллектуальной деятельности не относятся к НМА (п.3 ст. 257 НК РФ).
				РасходУСН.СчетУчетаУСН   = БухгалтерскийУчет.СчетПоКоду("У20.О", Реквизиты.Дата, Реквизиты.Организация);
				РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.Услуги;
				РасходУСН.ЭлементРасхода = СтрокаДокумента.ВидЗатрат;
			Иначе
				// Расходы на приобретение ОС, НМА.
				РасходУСН.СчетУчетаУСН   = БухгалтерскийУчет.СчетПоКоду("У08.ПО", Реквизиты.Дата, Реквизиты.Организация);
				РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.КапВложения;
				РасходУСН.ЭлементРасхода = СтрокаДокумента.ВидЗатрат;
			КонецЕсли;
			
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства;
			РасходУСН.СубконтоРасходов2    = СтрокаДокумента.ВнеоборотныйАктив;
			РасходУСН.ВидСубконтоРасходов3 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат;
			РасходУСН.СубконтоРасходов3    = СтрокаДокумента.ВидЗатрат;
			
			Если Реквизиты.Свойство("АвтоОтражениеВУСН")
				И ЗначениеЗаполнено(Реквизиты.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
				РасходУСН.ОтражениеВУСН = Реквизиты.АвтоОтражениеВУСН;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ВидЗатрат) Тогда // Отражение в УСН определим из вида затрат.
				РасходУСН.ОтражениеВУСН = УчетУСН.ОтражениеВУСНпоВидуЗатрат(СтрокаДокумента.ВидЗатрат);
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			Иначе
				РасходУСН.СуммаРуб    = СтрокаДокумента.СуммаРуб - СтрокаДокумента.СуммаНДСРуб;
				РасходУСН.СуммаВал    = СтрокаДокумента.СуммаВал - СтрокаДокумента.СуммаНДСВал;
				РасходУСН.СуммаНДСРуб = СтрокаДокумента.СуммаНДСВал * РасходУСН.СуммаРуб / РасходУСН.СуммаВал;
				РасходУСН.СуммаНДСВал = СтрокаДокумента.СуммаНДСВал;
			КонецЕсли;
			
			Если Реквизиты.ЕстьПравоНаВычетНДС Тогда // НДС не учитывается в расходах УСН.
				РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб + РасходУСН.СуммаНДСРуб;
				РасходУСН.СуммаНДСРуб = 0;
			КонецЕсли;
			
			Если УчетРасчетов.УчетАгентскогоНДС(СтрокаДокумента.Договор) И СтрокаДокумента.СуммаНДСВал > 0 Тогда
				ДобавитьСтрокуАгентскийНДС(ТаблицаРасходовУСН, СтрокаДокумента, РасходУСН);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Поступление основных средств.
	Если ТаблицыПоступления.Свойство("ПоступлениеОсновныхСредств")
	   И ТаблицыПоступления.ПоступлениеОсновныхСредств.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеОсновныхСредств Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаДокумента.СуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
			
			Если БухгалтерскийУчет.СчетВИерархии(СтрокаДокумента.СчетВложений, "106.60") Тогда
				// Вложения в права пользования нематериальными активами.
				// Неисключительные права пользования на результаты интеллектуальной деятельности не относятся к НМА (п.3 ст. 257 НК РФ).
				РасходУСН.СчетУчетаУСН   = БухгалтерскийУчет.СчетПоКоду("У20.О", Реквизиты.Дата, Реквизиты.Организация);
				РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.Услуги;
				РасходУСН.ЭлементРасхода = СтрокаДокумента.ВидЗатрат;
			Иначе
				// Расходы на приобретение ОС, НМА.
				РасходУСН.СчетУчетаУСН   = БухгалтерскийУчет.СчетПоКоду("У08.ПО", Реквизиты.Дата, Реквизиты.Организация);
				РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.КапВложения;
				РасходУСН.ЭлементРасхода = СтрокаДокумента.ВнеоборотныйАктив;
			КонецЕсли;
			
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства;
			РасходУСН.СубконтоРасходов2    = СтрокаДокумента.ВнеоборотныйАктив;
			РасходУСН.ВидСубконтоРасходов3 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат;
			РасходУСН.СубконтоРасходов3    = СтрокаДокумента.ВидЗатрат;
			
			Если Реквизиты.Свойство("АвтоОтражениеВУСН")
				И ЗначениеЗаполнено(Реквизиты.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
				РасходУСН.ОтражениеВУСН = Реквизиты.АвтоОтражениеВУСН;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ВидЗатрат) Тогда // Отражение в УСН определим из вида затрат.
				РасходУСН.ОтражениеВУСН = УчетУСН.ОтражениеВУСНпоВидуЗатрат(СтрокаДокумента.ВидЗатрат);
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			РасходУСН.Количество = СтрокаДокумента.Количество;
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			Иначе
				РасходУСН.СуммаРуб    = СтрокаДокумента.СуммаРуб - СтрокаДокумента.СуммаНДСРуб;
				РасходУСН.СуммаВал    = СтрокаДокумента.СуммаВал - СтрокаДокумента.СуммаНДСВал;
				РасходУСН.СуммаНДСРуб = СтрокаДокумента.СуммаНДСВал * РасходУСН.СуммаРуб / РасходУСН.СуммаВал;
				РасходУСН.СуммаНДСВал = СтрокаДокумента.СуммаНДСВал;
			КонецЕсли;
			
			Если Реквизиты.ЕстьПравоНаВычетНДС Тогда // НДС не учитывается в расходах УСН.
				РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб + РасходУСН.СуммаНДСРуб;
				РасходУСН.СуммаНДСРуб = 0;
			КонецЕсли;
			
			Если УчетРасчетов.УчетАгентскогоНДС(СтрокаДокумента.Договор) И СтрокаДокумента.СуммаНДСВал > 0 Тогда
				ДобавитьСтрокуАгентскийНДС(ТаблицаРасходовУСН, СтрокаДокумента, РасходУСН);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "Партия");
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "ДокументРасчетов");
	
	ТаблицаРасходовУСН.Сортировать("ИмяСпискаДокумента,НомерСтрокиДокумента");
	
	// Формируем элементы учета расходов УСН.
	СформироватьЭлементыУчетаРасходовУСН(Реквизиты.Ссылка, ТаблицаРасходовУСН);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Процедура ДобавитьСтрокуАгентскийНДС(ТаблицаРасходовУСН, СтрокаДокумента, РасходУСН)
	
	// Агентский НДС учтем как отдельный расход,
	АгентскийНДС = ТаблицаРасходовУСН.Добавить();
	ЗаполнитьЗначенияСвойств(АгентскийНДС, СтрокаДокумента,
		"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,Контрагент,Договор,Валюта");
	
	АгентскийНДС.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
	АгентскийНДС.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;

	АгентскийНДС.ВидРасхода     = Перечисления.ВидыРасходовУСН.Налоги;
	АгентскийНДС.ЭлементРасхода = Справочники.ВидыНалоговИПлатежей.НДС;
	АгентскийНДС.ОтражениеВУСН  = РасходУСН.ОтражениеВУСН;
	АгентскийНДС.СчетУчетаУСН   = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У68.О");
	
	АгентскийНДС.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.ВидыНалоговИПлатежей;
	АгентскийНДС.СубконтоРасходов2    = Справочники.ВидыНалоговИПлатежей.НДС;
	АгентскийНДС.СчетРасчетов         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРН"); // 303.04
	
	АгентскийНДС.СуммаВал = СтрокаДокумента.СуммаНДСВал;
	
	// и уберем суммы НДС из расходов на приобретение материальных запасов, услуг и пр.
	Если АгентскийНДС.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
		
		АгентскийНДС.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаНДСРуб;
		
		РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб - СтрокаДокумента.СуммаНДСРуб;
		РасходУСН.СуммаВал                = РасходУСН.СуммаВал - СтрокаДокумента.СуммаНДСВал;
		
	ИначеЕсли АгентскийНДС.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
		
		АгентскийНДС.СуммаЕНВДРуб = СтрокаДокумента.СуммаНДСРуб;
		
		РасходУСН.СуммаЕНВДРуб    = РасходУСН.СуммаЕНВДРуб - СтрокаДокумента.СуммаНДСРуб;
		РасходУСН.СуммаВал        = РасходУСН.СуммаВал - СтрокаДокумента.СуммаНДСВал;
		
	Иначе
		
		АгентскийНДС.СуммаРуб = СтрокаДокумента.СуммаНДСРуб;
		
	КонецЕсли;
	
	РасходУСН.СуммаНДСВал = 0;
	РасходУСН.СуммаНДСРуб = 0;
	
КонецПроцедуры

// Ввод начальных остатков

Функция ПодготовитьТаблицыВводОстатковРасходовУСН(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицыПоступления = Новый Структура;
	ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов",
		УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов());
	//ТаблицыПоступления.Вставить("ПоступлениеУслугРабот",          УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот());
	//ТаблицыПоступления.Вставить("ПоступлениеДопРасходов",         УчетРасчетов.ПустаяТаблицаПоступлениеДопРасходов());
	//ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы",   УправлениеОсновнымиСредствами.ПустаяТаблицаВложенияВоВнеоборотныеАктивы());
	
	// При вводе начальных остатков СчетУчетаУСН задан явно в табличной части документа.
	ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Колонки.Добавить("СчетУчетаУСН", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	ДатаСрезаУчетнойПолитики = КонецГода(Документ.Дата)+1;
	Если НЕ Документ.ОтражатьВНалоговомУчете
	 ИЛИ НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, ДатаСрезаУчетнойПолитики) Тогда
		Возврат ТаблицыПоступления;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Если Документ.РазделУчета = Перечисления.РазделыУчетаДляВводаОстатков.Материалы Тогда
	
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Материалы",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,КонтрагентРасчетов,ДоговорРасчетов,Валюта,
			|Счет,СчетУСН,Номенклатура,ЦМО,Количество,Сумма,СуммаНДС,ВалютнаяСумма,ВалютнаяСуммаНДС,ОтражениеВУСН",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""Материалы"" КАК ИмяСписка,
		|	""Материалы"" КАК СинонимСписка,
		|	Материалы.НомерСтроки КАК НомерСтроки,
		|	Материалы.ИФО КАК ИФО,
		|	Материалы.КФО КАК КФО,
		|	Материалы.КПС КАК КПС,
		|	Материалы.Подразделение КАК Подразделение,
		|	Материалы.Счет.УчетПоПодразделениям КАК УчетПоПодразделениям,
		|	Материалы.Счет КАК СчетУчета,
		|	Материалы.СчетУСН КАК СчетУчетаУСН,
		|	Материалы.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ЦМО) КАК ДопИзмерениеВидСубконто,
		|	Материалы.ЦМО КАК ДопИзмерение,
		|	Материалы.СчетРасчетов КАК СчетРасчетов,
		|	Материалы.КонтрагентРасчетов КАК Контрагент,
		|	Материалы.ДоговорРасчетов КАК Договор,
		|	Материалы.Валюта КАК Валюта,
		|	Материалы.Количество КАК Количество,
		|	Материалы.Сумма + Материалы.СуммаНДС КАК СуммаРуб,
		|	Материалы.СуммаНДС КАК СуммаНДСРуб,
		|	Материалы.ВалютнаяСумма + Материалы.ВалютнаяСуммаНДС КАК СуммаВал,
		|	Материалы.ВалютнаяСуммаНДС КАК СуммаНДСВал,
		|	Материалы.ОтражениеВУСН КАК ОтражениеВУСН
		|ИЗ
		|	ТаблицаМатериалы КАК Материалы
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
		ТаблицаМатериалы = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из ТаблицаМатериалы Цикл
			
			Если НЕ УчетУСНКлиентСервер.ОтражатьВУСНДоходыМинусРасходы(Документ.Организация, ДатаСрезаУчетнойПолитики, Строка.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			// Материальные запасы.
			Если БухгалтерскийУчет.СчетВИерархии(Строка.СчетУчета, "105.00")
			И НЕ БухгалтерскийУчет.СчетВИерархии(Строка.СчетУчета, "105.Б8,105.Г8,105.29,105.39") Тогда
				
				Если НЕ ЗначениеЗаполнено(Строка.СчетУчетаУСН) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
						НСтр("ru = 'Счет (УСН)'"), Строка.НомерСтроки, Строка.СинонимСписка);
					ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].СчетУСН";
					БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Строка.ОтражениеВУСН) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
						НСтр("ru = 'Расходы (УСН)'"), Строка.НомерСтроки, Строка.СинонимСписка);
					ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ОтражениеВУСН";
					БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Строка.СчетРасчетов) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
						НСтр("ru = 'Счет расчетов (УСН)'"), Строка.НомерСтроки, Строка.СинонимСписка);
					ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].СчетРасчетов";
					БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(Строка.Контрагент) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
						НСтр("ru = 'Контрагент (УСН)'"), Строка.НомерСтроки, Строка.СинонимСписка);
					ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].КонтрагентРасчетов";
					БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
				КонецЕсли;
				
				Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(Строка.СчетРасчетов)
				   И НЕ ЗначениеЗаполнено(Строка.Договор) Тогда
					ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
						НСтр("ru = 'Договор (УСН)'"), Строка.НомерСтроки, Строка.СинонимСписка);
					ПолеКолонки = "Объект." + Строка.ИмяСписка + "[" + Формат(Строка.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ДоговорРасчетов";
					БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
				КонецЕсли;
				
				НоваяСтрока = ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				Если Не ЗначениеЗаполнено(Строка.Валюта) Тогда
					НоваяСтрока.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
					НоваяСтрока.СуммаВал    = НоваяСтрока.СуммаРуб;
					НоваяСтрока.СуммаНДСВал = НоваяСтрока.СуммаНДСРуб;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицыПоступления;
	
КонецФункции

Функция ТаблицаВводОстатковРасходовУСН(ТаблицыПоступления, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасходовУСН = ПустаяТаблицаПоступлениеРасходовУСН();
	
	// Материальные запасы.
	Если ТаблицыПоступления.Свойство("ПоступлениеМатериальныхЗапасов")
	   И ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеМатериальныхЗапасов Цикл
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.МатериальныеЗапасы;
			РасходУСН.ЭлементРасхода = СтрокаДокумента.Номенклатура;
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ОтражениеВУСН) Тогда
				РасходУСН.ОтражениеВУСН = СтрокаДокумента.ОтражениеВУСН;
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			РасходУСН.СчетУчетаУСН         = СтрокаДокумента.СчетУчетаУСН;
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура;
			РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Номенклатура;
			
			РасходУСН.Количество  = СтрокаДокумента.Количество;
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
				РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
				РасходУСН.СуммаНДСРуб = 0;
				РасходУСН.СуммаНДСВал = 0;
			Иначе
				РасходУСН.СуммаРуб    = СтрокаДокумента.СуммаРуб - СтрокаДокумента.СуммаНДСРуб;
				РасходУСН.СуммаВал    = СтрокаДокумента.СуммаВал - СтрокаДокумента.СуммаНДСВал;
				РасходУСН.СуммаНДСРуб = СтрокаДокумента.СуммаНДСВал * РасходУСН.СуммаРуб / РасходУСН.СуммаВал;
				РасходУСН.СуммаНДСВал = СтрокаДокумента.СуммаНДСВал;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "Партия");
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "ДокументРасчетов");
	
	ТаблицаРасходовУСН.Сортировать("ИмяСпискаДокумента,НомерСтрокиДокумента");
	
	// Формируем элементы учета расходов УСН.
	СформироватьЭлементыУчетаРасходовУСН(Реквизиты.Ссылка, ТаблицаРасходовУСН);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Эквайринговая операция

Функция ПодготовитьТаблицыРасходовПоЭквайринговойОперации(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицыПоступления = Новый Структура;
	ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот());
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицыПоступления;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
		"ИФО,КФО,КПСУчетаЗатрат,Подразделение,Эквайер,ДоговорЭквайринга,ОтражениеВУСН,СуммаКомиссииБанка",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ЭквайринговаяОперация.ИФО КАК ИФО,
	|	ЭквайринговаяОперация.КФО КАК КФО,
	|	ЭквайринговаяОперация.КПСУчетаЗатрат КАК КПС,
	|	ЭквайринговаяОперация.Подразделение КАК Подразделение,
	|	ЭквайринговаяОперация.Эквайер КАК Контрагент,
	|	ЭквайринговаяОперация.ДоговорЭквайринга КАК Договор,
	|	ЭквайринговаяОперация.ОтражениеВУСН КАК ОтражениеВУСН,
	|	ЭквайринговаяОперация.СуммаКомиссииБанка КАК Сумма
	|ИЗ
	|	Документ КАК ЭквайринговаяОперация
	|ГДЕ
	|	ЭквайринговаяОперация.СуммаКомиссииБанка > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// Определим вид затрат.
		ВидЗатрат = Справочники.ВидыЗатрат.ПустаяСсылка();
		
		СвойстваСчетаЗатрат = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Документ.СчетУчетаЗатрат);
		Для НомерСубконто = 1 По СвойстваСчетаЗатрат.КоличествоСубконто Цикл
			
			ВидСубконто = СвойстваСчетаЗатрат["ВидСубконто" + НомерСубконто];
			Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
				ВидЗатрат = Документ["СубконтоЗатрат" + НомерСубконто];
			КонецЕсли;
			
		КонецЦикла;
		
		// Заполним информацию о расходах на комиссию эквайера.
		НоваяСтрока = ТаблицыПоступления.ПоступлениеУслугРабот.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка,
			"ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ОтражениеВУСН");
		
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
		НоваяСтрока.ВидЗатрат    = ВидЗатрат;
		НоваяСтрока.Содержание   = "Комиссия эквайера";
		
		СчетРасчетов = УчетРасчетов.ОпределитьСчетРасчетовПоПараметрам(Параметры, "Поступление",
			Документ.Дата, Документ.Организация, Документ.ИФО);
		Если ЗначениеЗаполнено(СчетРасчетов) Тогда
			НоваяСтрока.СчетРасчетов = СчетРасчетов;
		Иначе
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("302.26", Документ.Дата, Документ.Организация);
		КонецЕсли;
		
		НоваяСтрока.Валюта   = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
		НоваяСтрока.СуммаВал = Выборка.Сумма;
		НоваяСтрока.СуммаРуб = Выборка.Сумма;
		
	КонецЕсли;
	
	Возврат ТаблицыПоступления;
	
КонецФункции

// Авансовый отчет, Отчет о расходах подотчетного лица

Функция ПодготовитьТаблицыРасходовПоАвансовомуОтчету(Документ, Параметры = Неопределено) Экспорт
	
	ТаблицыПоступления = Новый Структура;
	ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов());
	ТаблицыПоступления.Вставить("ПоступлениеВозвратнойТары",      УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеВозвратнойТары());
	ТаблицыПоступления.Вставить("ПоступлениеУслугРабот",          УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот());
	ТаблицыПоступления.Вставить("ПоступлениеДопРасходов",         УчетРасчетов.ПустаяТаблицаПоступлениеДопРасходов());
	ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы",   УправлениеОсновнымиСредствами.ПустаяТаблицаВложенияВоВнеоборотныеАктивы());
	ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств",     УправлениеОсновнымиСредствами.ПустаяТаблицаПоступлениеОсновныхСредств());
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицыПоступления;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	КурсДокумента = Документ.Курс / ?(Документ.Кратность = 0, 1, Документ.Кратность);
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Израсходовано",
		"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,ПоДокументу,СчетДебета,СубконтоДебета1,СубконтоДебета2,СубконтоДебета3,
		|СчетКредита,КомуЗаЧто,ОтражениеВУСН,ВалютаДокумента,Количество,СтавкаНДС,СуммаНДС,Сумма,СуммаВВалюте",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Израсходовано"" КАК ИмяСписка,
	|	""Израсходовано"" КАК СинонимСписка,
	|	Израсходовано.НомерСтроки КАК НомерСтроки,
	|	Израсходовано.ИФО КАК ИФО,
	|	Израсходовано.КФО КАК КФО,
	|	Израсходовано.КПС КАК КПС,
	|	Израсходовано.КЭК КАК КЭК,
	|	Израсходовано.Подразделение КАК Подразделение,
	|	Израсходовано.СчетДебета КАК СчетДебета,
	|	Израсходовано.СубконтоДебета1 КАК СубконтоДебета1,
	|	Израсходовано.СубконтоДебета2 КАК СубконтоДебета2,
	|	Израсходовано.СубконтоДебета3 КАК СубконтоДебета3,
	|	Израсходовано.СчетКредита КАК СчетКредита,
	|	Израсходовано.КомуЗаЧто КАК КомуЗаЧто,
	|	Израсходовано.ОтражениеВУСН КАК ОтражениеВУСН,
	|	Израсходовано.ВалютаДокумента КАК Валюта,
	|	Израсходовано.Количество КАК Количество,
	|	Израсходовано.СтавкаНДС КАК СтавкаНДС,
	|	Израсходовано.СуммаНДС КАК СуммаНДС,
	|	Израсходовано.Сумма КАК Сумма,
	|	Израсходовано.СуммаВВалюте КАК СуммаВВалюте
	|ИЗ
	|	ТаблицаИзрасходовано КАК Израсходовано
	|ГДЕ
	|	НЕ Израсходовано.ПоДокументу
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТаблицаИзрасходовано = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаблицаИзрасходовано Цикл
		
		Если НЕ УчетУСНКлиентСервер.ОтражатьВУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата, Строка.КФО) Тогда
			Продолжить;
		КонецЕсли;
		Если БухгалтерскийУчет.СчетВИерархии(Строка.СчетДебета, "206.00,302.00") Тогда
			Продолжить; // Расчеты с контрагентами пропускаем, не возникает расходов УСН.
		КонецЕсли;
		
		// ПоступлениеМатериальныхЗапасов, ПоступлениеВозвратнойТары.
		Если БухгалтерскийУчет.СчетВИерархии(Строка.СчетДебета, "105.00") Тогда
			
			Номенклатура            = Справочники.Номенклатура.ПустаяСсылка();
			ЦМО                     = Справочники.ЦМО.ПустаяСсылка();
			ДопАналитика            = Неопределено;
			ДопАналитикаВидСубконто = Неопределено;
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
					Номенклатура = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦМО Тогда
					ЦМО = Строка["СубконтоДебета" + НомерСубконто];
				Иначе
					ДопАналитикаВидСубконто = ВидСубконто;
					ДопАналитика = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоТара = (Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Тара);
			
			Если Строка.Сумма > 0 Тогда
				
				Если ЭтоТара Тогда
					НоваяСтрока = ТаблицыПоступления.ПоступлениеВозвратнойТары.Добавить();
				Иначе
					НоваяСтрока = ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.СчетУчета    = Строка.СчетДебета;
				НоваяСтрока.Номенклатура = Номенклатура;
				
				Если ЗначениеЗаполнено(ЦМО) Тогда
					НоваяСтрока.ДопИзмерениеВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦМО;
					НоваяСтрока.ДопИзмерение            = ЦМО;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДопАналитикаВидСубконто) И ЗначениеЗаполнено(ДопАналитика) Тогда
					НоваяСтрока.ДопАналитикаВидСубконто = ДопАналитикаВидСубконто;
					НоваяСтрока.ДопАналитика            = ДопАналитика;
				КонецЕсли;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
				
				НоваяСтрока.Количество = Строка.Количество;
				
				Если НЕ ЭтоТара Тогда
					НоваяСтрока.СтавкаНДС     = Строка.СтавкаНДС;
					НоваяСтрока.СуммаНДСВал   = Строка.СуммаНДС;
					НоваяСтрока.СуммаНДСРуб   = Строка.СуммаНДС;
					НоваяСтрока.ОтражениеВУСН = Строка.ОтражениеВУСН;
				КонецЕсли;
				
				НоваяСтрока.СуммаВал = Строка.Сумма;
				НоваяСтрока.СуммаРуб = Строка.Сумма;
				
			КонецЕсли;
			
			Если Строка.СуммаВВалюте > 0 Тогда
				
				Если ЭтоТара Тогда
					НоваяСтрока = ТаблицыПоступления.ПоступлениеВозвратнойТары.Добавить();
				Иначе
					НоваяСтрока = ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.СчетУчета    = Строка.СчетДебета;
				НоваяСтрока.Номенклатура = Номенклатура;
				
				Если ЗначениеЗаполнено(ЦМО) Тогда
					НоваяСтрока.ДопИзмерениеВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦМО;
					НоваяСтрока.ДопИзмерение            = ЦМО;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДопАналитикаВидСубконто) И ЗначениеЗаполнено(ДопАналитика) Тогда
					НоваяСтрока.ДопАналитикаВидСубконто = ДопАналитикаВидСубконто;
					НоваяСтрока.ДопАналитика            = ДопАналитика;
				КонецЕсли;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = Строка.Валюта;
				
				НоваяСтрока.Количество = Строка.Количество;
				
				Если НЕ ЭтоТара Тогда
					НоваяСтрока.СтавкаНДС     = Строка.СтавкаНДС;
					НоваяСтрока.СуммаНДСВал   = Строка.СуммаНДС;
					НоваяСтрока.СуммаНДСРуб   = Строка.СуммаНДС * КурсДокумента;
					НоваяСтрока.ОтражениеВУСН = Строка.ОтражениеВУСН;
				КонецЕсли;
				
				НоваяСтрока.СуммаВал = Строка.СуммаВВалюте;
				НоваяСтрока.СуммаРуб = Строка.СуммаВВалюте * КурсДокумента;
				
			КонецЕсли;
			
		// ПоступлениеДопРасходов.
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Строка.СчетДебета, "106.2П,106.3П,106.4П") Тогда
			
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			ВидЗатрат    = Справочники.ВидыЗатрат.ПустаяСсылка();
			Партия       = Неопределено;
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
					Номенклатура = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
					ВидЗатрат = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Партии Тогда
					Партия = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(ВидЗатрат) ИЛИ Не ЗначениеЗаполнено(Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.Сумма > 0 Тогда
				
				НоваяСтрока = ТаблицыПоступления.ПоступлениеДопРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрока.Содержание   = Строка.КомуЗаЧто;
				НоваяСтрока.КЭК          = Строка.КЭК;
				НоваяСтрока.ВидЗатрат    = ВидЗатрат;
				
				НоваяСтрока.СчетВложений          = Строка.СчетДебета;
				НоваяСтрока.ПартияВложений        = Партия;
				НоваяСтрока.КПСВложений           = Строка.КПС;
				НоваяСтрока.ПодразделениеВложений = Строка.Подразделение;
				НоваяСтрока.НоменклатураВложений  = Номенклатура;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СтавкаНДС   = Строка.СтавкаНДС;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС;
				НоваяСтрока.СуммаВал    = Строка.Сумма;
				НоваяСтрока.СуммаРуб    = Строка.Сумма;
				
			КонецЕсли;
			
			Если Строка.СуммаВВалюте > 0 Тогда
				
				НоваяСтрока = ТаблицыПоступления.ПоступлениеДопРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрока.Содержание   = Строка.КомуЗаЧто;
				НоваяСтрока.КЭК          = Строка.КЭК;
				НоваяСтрока.ВидЗатрат    = ВидЗатрат;
				
				НоваяСтрока.СчетВложений          = Строка.СчетДебета;
				НоваяСтрока.ПартияВложений        = Партия;
				НоваяСтрока.КПСВложений           = Строка.КПС;
				НоваяСтрока.ПодразделениеВложений = Строка.Подразделение;
				НоваяСтрока.НоменклатураВложений  = Номенклатура;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = Строка.Валюта;
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СтавкаНДС   = Строка.СтавкаНДС;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС * КурсДокумента;
				НоваяСтрока.СуммаВал    = Строка.СуммаВВалюте;
				НоваяСтрока.СуммаРуб    = Строка.СуммаВВалюте * КурсДокумента;
				
			КонецЕсли;
			
		// ВложенияВоВнеоборотныеАктивы.
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Строка.СчетДебета, "106.10,106.21,106.22,106.31,106.32,106.41,106.42,106.43") Тогда
			
			ВнеоборотныйАктив = Справочники.ОсновныеСредства.ПустаяСсылка();
			ВидЗатрат         = Справочники.ВидыЗатрат.ПустаяСсылка();
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
					ВнеоборотныйАктив = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
					ВидЗатрат = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(ВидЗатрат) ИЛИ Не ЗначениеЗаполнено(ВнеоборотныйАктив) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПоступлениеОсновныхСредств = (Строка.Количество <> 0);
			
			Если Строка.Сумма > 0 Тогда
				
				Если ЭтоПоступлениеОсновныхСредств Тогда
					НоваяСтрока = ТаблицыПоступления.ПоступлениеОсновныхСредств.Добавить();
				Иначе // Доп.вложения в основные средства.
					НоваяСтрока = ТаблицыПоступления.ВложенияВоВнеоборотныеАктивы.Добавить();
					НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
					НоваяСтрока.Содержание   = Строка.КомуЗаЧто;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.СчетВложений      = Строка.СчетДебета;
				НоваяСтрока.ВнеоборотныйАктив = ВнеоборотныйАктив;
				НоваяСтрока.ВидЗатрат         = ВидЗатрат;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СтавкаНДС   = Строка.СтавкаНДС;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС;
				НоваяСтрока.СуммаВал    = Строка.Сумма;
				НоваяСтрока.СуммаРуб    = Строка.Сумма;
				
			КонецЕсли;
			
			Если Строка.СуммаВВалюте > 0 Тогда
				
				Если ЭтоПоступлениеОсновныхСредств Тогда
					НоваяСтрока = ТаблицыПоступления.ПоступлениеОсновныхСредств.Добавить();
				Иначе // Доп.вложения в основные средства.
					НоваяСтрока = ТаблицыПоступления.ВложенияВоВнеоборотныеАктивы.Добавить();
					НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
					НоваяСтрока.Содержание   = Строка.КомуЗаЧто;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.СчетВложений      = Строка.СчетДебета;
				НоваяСтрока.ВнеоборотныйАктив = ВнеоборотныйАктив;
				НоваяСтрока.ВидЗатрат         = ВидЗатрат;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = Строка.Валюта;
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СтавкаНДС   = Строка.СтавкаНДС;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС * КурсДокумента;
				НоваяСтрока.СуммаВал    = Строка.СуммаВВалюте;
				НоваяСтрока.СуммаРуб    = Строка.СуммаВВалюте * КурсДокумента;
				
			КонецЕсли;
			
		// ПоступлениеУслугРабот.
		Иначе
			
			ВидЗатрат = Справочники.ВидыЗатрат.ПустаяСсылка();
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
					ВидЗатрат = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Строка.Сумма > 0 Тогда
				
				НоваяСтрока = ТаблицыПоступления.ПоступлениеУслугРабот.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.Номенклатура  = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрока.Содержание    = Строка.КомуЗаЧто;
				НоваяСтрока.КЭК           = Строка.КЭК;
				НоваяСтрока.ВидЗатрат     = ВидЗатрат;
				НоваяСтрока.ОтражениеВУСН = Строка.ОтражениеВУСН;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СтавкаНДС   = Строка.СтавкаНДС;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС;
				НоваяСтрока.СуммаВал    = Строка.Сумма;
				НоваяСтрока.СуммаРуб    = Строка.Сумма;
				
			КонецЕсли;
			
			Если Строка.СуммаВВалюте > 0 Тогда
				
				НоваяСтрока = ТаблицыПоступления.ПоступлениеУслугРабот.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.Номенклатура  = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрока.Содержание    = Строка.КомуЗаЧто;
				НоваяСтрока.КЭК           = Строка.КЭК;
				НоваяСтрока.ВидЗатрат     = ВидЗатрат;
				НоваяСтрока.ОтражениеВУСН = Строка.ОтражениеВУСН;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетКредита;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				НоваяСтрока.Валюта       = Строка.Валюта;
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СтавкаНДС   = Строка.СтавкаНДС;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС * КурсДокумента;
				НоваяСтрока.СуммаВал    = Строка.СуммаВВалюте;
				НоваяСтрока.СуммаРуб    = Строка.СуммаВВалюте * КурсДокумента;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицыПоступления;
	
КонецФункции

Функция ПодготовитьТаблицыРасходовУСНПоРасходамПодотчетногоЛица(РасходыПодотчетногоЛица, Документ) Экспорт
	
	ТаблицыПоступления = Новый Структура;
	ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов());
	ТаблицыПоступления.Вставить("ПоступлениеВозвратнойТары",      УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеВозвратнойТары());
	ТаблицыПоступления.Вставить("ПоступлениеУслугРабот",          УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот());
	ТаблицыПоступления.Вставить("ПоступлениеДопРасходов",         УчетРасчетов.ПустаяТаблицаПоступлениеДопРасходов());
	ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы",   УправлениеОсновнымиСредствами.ПустаяТаблицаВложенияВоВнеоборотныеАктивы());
	ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств",     УправлениеОсновнымиСредствами.ПустаяТаблицаПоступлениеОсновныхСредств());
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицыПоступления;
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Для Каждого Строка Из РасходыПодотчетногоЛица Цикл
		
		Если НЕ УчетУСНКлиентСервер.ОтражатьВУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата, Строка.КФО) Тогда
			Продолжить;
		КонецЕсли;
		
		// ПоступлениеМатериальныхЗапасов, ПоступлениеВозвратнойТары.
		Если БухгалтерскийУчет.СчетВИерархии(Строка.СчетДебета, "105.00") Тогда
			
			Номенклатура            = Справочники.Номенклатура.ПустаяСсылка();
			ЦМО                     = Справочники.ЦМО.ПустаяСсылка();
			ДопАналитика            = Неопределено;
			ДопАналитикаВидСубконто = Неопределено;
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
					Номенклатура = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦМО Тогда
					ЦМО = Строка["СубконтоДебета" + НомерСубконто];
				Иначе
					ДопАналитикаВидСубконто = ВидСубконто;
					ДопАналитика = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоТара = (Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Тара);
			
			Если Строка.СуммаРасчетов > 0 Тогда
				
				Если ЭтоТара Тогда
					НоваяСтрока = ТаблицыПоступления.ПоступлениеВозвратнойТары.Добавить();
				Иначе
					НоваяСтрока = ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Добавить();
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.СчетУчета    = Строка.СчетДебета;
				НоваяСтрока.Номенклатура = Номенклатура;
				
				Если ЗначениеЗаполнено(ЦМО) Тогда
					НоваяСтрока.ДопИзмерениеВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ЦМО;
					НоваяСтрока.ДопИзмерение            = ЦМО;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДопАналитикаВидСубконто) И ЗначениеЗаполнено(ДопАналитика) Тогда
					НоваяСтрока.ДопАналитикаВидСубконто = ДопАналитикаВидСубконто;
					НоваяСтрока.ДопАналитика            = ДопАналитика;
				КонецЕсли;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетРасчетов;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				
				НоваяСтрока.Количество = Строка.Количество;
				
				Если НЕ ЭтоТара Тогда
					НоваяСтрока.СуммаНДСВал   = Строка.СуммаНДС;
					НоваяСтрока.СуммаНДСРуб   = Строка.СуммаНДС;
					НоваяСтрока.ОтражениеВУСН = Строка.ОтражениеВУСН;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Строка.Валюта) Тогда
					НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
				Иначе
					НоваяСтрока.Валюта = Строка.Валюта;
				КонецЕсли;
				
				НоваяСтрока.Количество = Строка.Количество;
				НоваяСтрока.СуммаВал   = Строка.СуммаРасчетов;
				НоваяСтрока.СуммаРуб   = Строка.СуммаРубПоКурсуАванса;
				
			КонецЕсли;
			
		// ПоступлениеДопРасходов.
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Строка.СчетДебета, "106.2П,106.3П,106.4П") Тогда
			
			Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			ВидЗатрат    = Справочники.ВидыЗатрат.ПустаяСсылка();
			Партия       = Неопределено;
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Номенклатура Тогда
					Номенклатура = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
					ВидЗатрат = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Партии Тогда
					Партия = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(ВидЗатрат) ИЛИ Не ЗначениеЗаполнено(Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Строка.СуммаРасчетов > 0 Тогда
				
				НоваяСтрока = ТаблицыПоступления.ПоступлениеДопРасходов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрока.Содержание   = Строка.НаименованиеРасхода;
				НоваяСтрока.КЭК          = Строка.КЭК;
				НоваяСтрока.ВидЗатрат    = ВидЗатрат;
				
				НоваяСтрока.СчетВложений          = Строка.СчетДебета;
				НоваяСтрока.ПартияВложений        = Партия;
				НоваяСтрока.КПСВложений           = Строка.КПС;
				НоваяСтрока.ПодразделениеВложений = Строка.Подразделение;
				НоваяСтрока.НоменклатураВложений  = Номенклатура;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетРасчетов;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				
				Если Не ЗначениеЗаполнено(Строка.Валюта) Тогда
					НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
				Иначе
					НоваяСтрока.Валюта = Строка.Валюта;
				КонецЕсли;
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС;
				НоваяСтрока.СуммаВал    = Строка.СуммаРасчетов;
				НоваяСтрока.СуммаРуб    = Строка.СуммаРубПоКурсуАванса;
				
			КонецЕсли;
			
		// ВложенияВоВнеоборотныеАктивы.
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Строка.СчетДебета, "106.10,106.21,106.22,106.31,106.32,106.41,106.42,106.43") Тогда
			
			ВнеоборотныйАктив = Справочники.ОсновныеСредства.ПустаяСсылка();
			ВидЗатрат         = Справочники.ВидыЗатрат.ПустаяСсылка();
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
					ВнеоборотныйАктив = Строка["СубконтоДебета" + НомерСубконто];
				ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
					ВидЗатрат = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не ЗначениеЗаполнено(ВидЗатрат) ИЛИ Не ЗначениеЗаполнено(ВнеоборотныйАктив) Тогда
				Продолжить;
			КонецЕсли;
			
			ЭтоПоступлениеОсновныхСредств = (Строка.Количество <> 0);
			
			Если Строка.СуммаРасчетов > 0 Тогда
				
				Если ЭтоПоступлениеОсновныхСредств Тогда
					НоваяСтрока = ТаблицыПоступления.ПоступлениеОсновныхСредств.Добавить();
				Иначе // Доп.вложения в основные средства.
					НоваяСтрока = ТаблицыПоступления.ВложенияВоВнеоборотныеАктивы.Добавить();
					НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
					НоваяСтрока.Содержание   = Строка.НаименованиеРасхода;
				КонецЕсли;
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.СчетВложений      = Строка.СчетДебета;
				НоваяСтрока.ВнеоборотныйАктив = ВнеоборотныйАктив;
				НоваяСтрока.ВидЗатрат         = ВидЗатрат;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетРасчетов;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				
				Если Не ЗначениеЗаполнено(Строка.Валюта) Тогда
					НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
				Иначе
					НоваяСтрока.Валюта = Строка.Валюта;
				КонецЕсли;
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС;
				НоваяСтрока.СуммаВал    = Строка.СуммаРасчетов;
				НоваяСтрока.СуммаРуб    = Строка.СуммаРубПоКурсуАванса;
				
			КонецЕсли;
			
		// ПоступлениеУслугРабот.
		Иначе
			
			ВидЗатрат = Справочники.ВидыЗатрат.ПустаяСсылка();
			
			СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
			Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
				
				ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
				Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
					ВидЗатрат = Строка["СубконтоДебета" + НомерСубконто];
				КонецЕсли;
				
			КонецЦикла;
			
			Если Строка.СуммаРасчетов > 0 Тогда
				
				НоваяСтрока = ТаблицыПоступления.ПоступлениеУслугРабот.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
					"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
				
				НоваяСтрока.Номенклатура  = Справочники.Номенклатура.ПустаяСсылка();
				НоваяСтрока.Содержание    = Строка.НаименованиеРасхода;
				НоваяСтрока.КЭК           = Строка.КЭК;
				НоваяСтрока.ВидЗатрат     = ВидЗатрат;
				НоваяСтрока.ОтражениеВУСН = Строка.ОтражениеВУСН;
				
				НоваяСтрока.СчетРасчетов = Строка.СчетРасчетов;
				НоваяСтрока.Контрагент   = Документ.Сотрудник.Контрагент;
				
				Если Не ЗначениеЗаполнено(Строка.Валюта) Тогда
					НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
				Иначе
					НоваяСтрока.Валюта = Строка.Валюта;
				КонецЕсли;
				
				НоваяСтрока.Количество  = Строка.Количество;
				НоваяСтрока.СуммаНДСВал = Строка.СуммаНДС;
				НоваяСтрока.СуммаНДСРуб = Строка.СуммаНДС;
				НоваяСтрока.СуммаВал    = Строка.СуммаРасчетов;
				НоваяСтрока.СуммаРуб    = Строка.СуммаРубПоКурсуАванса;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицыПоступления;
	
КонецФункции

Функция ПодготовитьТаблицуОплатПоставщикамПодотчетнымЛицом(Документ, Параметры = Неопределено) Экспорт
	
	ТаблицаОплат = УчетРасчетов.ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицаОплат;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	КурсДокумента = Документ.Курс / ?(Документ.Кратность = 0, 1, Документ.Кратность);
	
	Запрос = Новый Запрос;
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Израсходовано",
		"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,ПоДокументу,СчетДебета,СубконтоДебета1,СубконтоДебета2,СубконтоДебета3,
		|СчетКредита,КомуЗаЧто,ВалютаДокумента,Сумма,СуммаВВалюте",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Израсходовано"" КАК ИмяСписка,
	|	""Израсходовано"" КАК СинонимСписка,
	|	Израсходовано.НомерСтроки КАК НомерСтроки,
	|	Израсходовано.ИФО КАК ИФО,
	|	Израсходовано.Подразделение КАК Подразделение,
	|	Израсходовано.КФО КАК КФО,
	|	Израсходовано.КПС КАК КПС,
	|	Израсходовано.КЭК КАК КЭК,
	|	Израсходовано.СчетДебета КАК СчетДебета,
	|	Израсходовано.СубконтоДебета1 КАК СубконтоДебета1,
	|	Израсходовано.СубконтоДебета2 КАК СубконтоДебета2,
	|	Израсходовано.СубконтоДебета3 КАК СубконтоДебета3,
	|	Израсходовано.СчетКредита КАК СчетКредита,
	|	Израсходовано.КомуЗаЧто КАК КомуЗаЧто,
	|	Израсходовано.ВалютаДокумента КАК Валюта,
	|	Израсходовано.Сумма КАК Сумма,
	|	Израсходовано.СуммаВВалюте КАК СуммаВВалюте
	|ИЗ
	|	ТаблицаИзрасходовано КАК Израсходовано
	|ГДЕ
	|	НЕ Израсходовано.ПоДокументу
	|	И Израсходовано.СчетДебета В(&СчетаРасчетовСКонтрагентами)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("СчетаРасчетовСКонтрагентами",
		БухгалтерскийУчет.СписокСчетов("302.00"));
	
	ОплаченоПодотчетнымЛицом = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ОплаченоПодотчетнымЛицом Цикл
		
		Если НЕ УчетРасчетовКлиентСервер.ВедетсяУчетПоДокументамРасчетов(Документ.Организация, Документ.Дата,
				Строка.КФО, Строка.Валюта, Строка.СчетДебета) Тогда
			Продолжить;
		КонецЕсли;
		
		Контрагент       = Справочники.Контрагенты.ПустаяСсылка();
		Договор          = Справочники.Договоры.ПустаяСсылка();
		ДокументРасчетов = Неопределено;
		
		СвойстваСчетаДебета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.СчетДебета);
		Для НомерСубконто = 1 По СвойстваСчетаДебета.КоличествоСубконто Цикл
			
			ВидСубконто = СвойстваСчетаДебета["ВидСубконто" + НомерСубконто];
			Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты Тогда
				Контрагент = Строка["СубконтоДебета" + НомерСубконто];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.Договоры Тогда
				Договор = Строка["СубконтоДебета" + НомерСубконто];
			ИначеЕсли ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов Тогда
				ДокументРасчетов = Строка["СубконтоДебета" + НомерСубконто];
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(ДокументРасчетов) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Строка.Сумма > 0 Тогда
			
			НоваяСтрока = ТаблицаОплат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение");
			
			НоваяСтрока.СчетРасчетов  = Строка.СчетДебета;
			НоваяСтрока.Контрагент    = Контрагент;
			НоваяСтрока.Договор       = Договор;
			
			НоваяСтрока.ВидДопСубконтоРасчетов = ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов;
			НоваяСтрока.ДопСубконтоРасчетов    = ДокументРасчетов;
			
			НоваяСтрока.ВидДоговора       = НоваяСтрока.Договор.ВидДоговора;
			НоваяСтрока.УчетАгентскогоНДС = УчетРасчетов.УчетАгентскогоНДС(НоваяСтрока.Договор);
			НоваяСтрока.РасчетыВВалюте    = Ложь;
			
			НоваяСтрока.Валюта                = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
			НоваяСтрока.СуммаРасчетов         = Строка.Сумма;
			НоваяСтрока.СуммаРуб              = Строка.Сумма;
			НоваяСтрока.СуммаРубПоКурсуАванса = НоваяСтрока.СуммаРуб;
			
		КонецЕсли;
		
		Если Строка.СуммаВВалюте > 0 Тогда
			
			НоваяСтрока = ТаблицаОплат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
			
			НоваяСтрока.СчетРасчетов  = Строка.СчетДебета;
			НоваяСтрока.Контрагент    = Контрагент;
			НоваяСтрока.Договор       = Договор;
			
			НоваяСтрока.ВидДопСубконтоРасчетов = ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов;
			НоваяСтрока.ДопСубконтоРасчетов    = ДокументРасчетов;
			
			НоваяСтрока.ВидДоговора       = НоваяСтрока.Договор.ВидДоговора;
			НоваяСтрока.УчетАгентскогоНДС = УчетРасчетов.УчетАгентскогоНДС(НоваяСтрока.Договор);
			НоваяСтрока.РасчетыВВалюте    = Истина;
			
			НоваяСтрока.Валюта                = Строка.Валюта;
			НоваяСтрока.СуммаРасчетов         = Строка.СуммаВВалюте;
			НоваяСтрока.СуммаРуб              = Строка.СуммаВВалюте * КурсДокумента;
			НоваяСтрока.СуммаРубПоКурсуАванса = НоваяСтрока.СуммаРуб;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаОплат;
	
КонецФункции

Функция ПодготовитьТаблицуОплатПоПриходнымДокументам(Документ, Параметры = Неопределено) Экспорт
	
	ТаблицаОплат = УчетРасчетов.ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицаОплат;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	// Выберем оплаченные приходные документы.
	Запрос = Новый Запрос;
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Израсходовано",
		"НомерСтроки,Сотрудник,ПоДокументу,ПриходныйДокумент",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Израсходовано"" КАК ИмяСписка,
	|	""Израсходовано"" КАК СинонимСписка,
	|	Израсходовано.НомерСтроки КАК НомерСтроки,
	|	Израсходовано.Сотрудник КАК Сотрудник,
	|	Израсходовано.Сотрудник.Контрагент КАК Контрагент,
	|	Израсходовано.ПриходныйДокумент КАК ПриходныйДокумент
	|ИЗ
	|	ТаблицаИзрасходовано КАК Израсходовано
	|ГДЕ
	|	Израсходовано.ПоДокументу";
	ОплаченныеПриходныеДокументы = Запрос.Выполнить().Выгрузить();
	
	// Получим остатки неоплаченных расходов УСН по выбранным приходным документам.
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("СчетРасчетов",     БухгалтерскийУчет.СписокСчетов("208.00"));
	ОтборРасходов.Вставить("Контрагент",       ОплаченныеПриходныеДокументы.ВыгрузитьКолонку("Контрагент"));
	ОтборРасходов.Вставить("ДокументРасчетов", ОплаченныеПриходныеДокументы.ВыгрузитьКолонку("ПриходныйДокумент"));
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		ОтборРасходов.Вставить("ИФО", Документ.ИФО);
	КонецЕсли;
	
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(
		Новый Граница(Документ.МоментВремени(), ВидГраницы.Исключая),
		БухгалтерскийУчет.СписокСчетов("У01.ВО,У01.О,У04.О,У08.ПО,У10.О,У10.СО,У10.ОР,У15.О,У15.СО,У41.О,У41.СО,У41.ОР"),
		ОтборРасходов,
		Новый Структура("Организация,Дата", Документ.Организация, Документ.Дата));
	
	// Все неоплаченные расходы УСН по выбранным платежным документам считаем оплаченными данным авансовым отчетом.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОплаченныеПриходныеДокументы.ИмяСписка КАК ИмяСписка,
	|	ОплаченныеПриходныеДокументы.СинонимСписка КАК СинонимСписка,
	|	ОплаченныеПриходныеДокументы.НомерСтроки КАК НомерСтроки,
	|	ОплаченныеПриходныеДокументы.Сотрудник КАК Сотрудник,
	|	ОплаченныеПриходныеДокументы.Контрагент КАК Контрагент,
	|	ОплаченныеПриходныеДокументы.ПриходныйДокумент КАК ПриходныйДокумент
	|ПОМЕСТИТЬ ОплаченныеПриходныеДокументы
	|ИЗ
	|	&ОплаченныеПриходныеДокументы КАК ОплаченныеПриходныеДокументы
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПриходныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиРасходовУСН.Организация КАК Организация,
	|	ОстаткиРасходовУСН.ИФО КАК ИФО,
	|	ОстаткиРасходовУСН.КФО КАК КФО,
	|	ОстаткиРасходовУСН.КПС КАК КПС,
	|	ОстаткиРасходовУСН.Подразделение КАК Подразделение,
	|	ОстаткиРасходовУСН.СчетРасчетов КАК СчетРасчетов,
	|	ОстаткиРасходовУСН.Контрагент КАК Контрагент,
	|	ОстаткиРасходовУСН.ДокументРасчетов КАК ДокументРасчетов,
	|	ОстаткиРасходовУСН.НомерСтрокиДокумента КАК НомерСтрокиДокументРасчетов,
	|	ОстаткиРасходовУСН.Валюта КАК Валюта,
	|	ОстаткиРасходовУСН.СуммаВал КАК СуммаВал,
	|	ОстаткиРасходовУСН.СуммаРуб КАК СуммаРуб,
	|	ОстаткиРасходовУСН.СуммаНеУчитываетсяНУРуб КАК СуммаНеУчитываетсяНУРуб,
	|	ОстаткиРасходовУСН.СуммаЕНВДРуб КАК СуммаЕНВДРуб,
	|	ОстаткиРасходовУСН.СуммаНДСРуб КАК СуммаНДСРуб
	|ПОМЕСТИТЬ НеоплаченныеРасходыУСНПоПриходнымДокументам
	|ИЗ
	|	&ОстаткиРасходовУСН КАК ОстаткиРасходовУСН
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплаченныеПриходныеДокументы.ИмяСписка КАК ИмяСписка,
	|	ОплаченныеПриходныеДокументы.СинонимСписка КАК СинонимСписка,
	|	ОплаченныеПриходныеДокументы.НомерСтроки КАК НомерСтроки,
	|	ОплаченныеПриходныеДокументы.Сотрудник,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.Организация,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.ИФО,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.КФО,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.КПС,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.Подразделение,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.СчетРасчетов,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.Контрагент,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.ДокументРасчетов,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.НомерСтрокиДокументРасчетов КАК НомерСтрокиДокументРасчетов,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.Валюта,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.СуммаВал,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.СуммаРуб,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.СуммаНеУчитываетсяНУРуб,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.СуммаЕНВДРуб,
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам.СуммаНДСРуб
	|ИЗ
	|	НеоплаченныеРасходыУСНПоПриходнымДокументам КАК НеоплаченныеРасходыУСНПоПриходнымДокументам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплаченныеПриходныеДокументы КАК ОплаченныеПриходныеДокументы
	|		ПО НеоплаченныеРасходыУСНПоПриходнымДокументам.ДокументРасчетов = ОплаченныеПриходныеДокументы.ПриходныйДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИмяСписка,
	|	НомерСтроки,
	|	НомерСтрокиДокументРасчетов";
	Запрос.УстановитьПараметр("ОстаткиРасходовУСН",           ОстаткиРасходовУСН);
	Запрос.УстановитьПараметр("ОплаченныеПриходныеДокументы", ОплаченныеПриходныеДокументы);
	
	РасходыУСНКОплате = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из РасходыУСНКОплате Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ДокументРасчетов) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
			"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Валюта");
		НоваяСтрока.ЭтоАванс = Ложь;
		
		НоваяСтрока.ВидДопСубконтоРасчетов = ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов;
		НоваяСтрока.ДопСубконтоРасчетов    = Строка.ДокументРасчетов;
		
		НоваяСтрока.РасчетыВВалюте = (НоваяСтрока.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
		
		НоваяСтрока.СуммаРасчетов = Строка.СуммаВал;
		НоваяСтрока.СуммаРуб      = Строка.СуммаРуб
								  + Строка.СуммаНеУчитываетсяНУРуб
								  + Строка.СуммаЕНВДРуб
								  + Строка.СуммаНДСРуб;
		НоваяСтрока.СуммаРубПоКурсуАванса = НоваяСтрока.СуммаРуб;
		
	КонецЦикла;
	
	// Сворачиваем по всем колонкам, суммируя суммовые показатели.
	ОбщегоНазначенияБГУ.СвернутьТаблицуИСуммироватьКолонки(ТаблицаОплат,
		"ОстатокРасчетов,СуммаРасчетов,СуммаРуб,СуммаРубПоКурсуАванса,СуммаЕНВДРуб");
	
	Возврат ТаблицаОплат;
	
КонецФункции

// Признание расходов при отражении Авансового отчета, Отчета о расходах подотчетного лица.
Функция ТаблицаОплаченныеАвансомРасходыПодотчетнихЛиц(ТаблицаПоступлениеРасходовУСН, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	Если ТаблицаПоступлениеРасходовУСН.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);

	// Подготовим таблицу остатков авансов.
	ОстаткиАвансов = РасчетыСПодотчетнымиЛицами.ОстаткиАвансов(Реквизиты.Ссылка, ТаблицаПоступлениеРасходовУСН, Реквизиты);
	ОстаткиАвансов.Свернуть("Организация,ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Валюта", "СуммаРасчетов,СуммаРуб");
	
	// Заполним таблицу оплаченных расходов.
	Для Каждого Аванс Из ОстаткиАвансов Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("КФО", Аванс.КФО);
		
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", Аванс.ИФО);
		КонецЕсли;
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Аванс.СчетРасчетов);
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", Аванс.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", Аванс.Валюта);
		КонецЕсли;
		
		Отбор.Вставить("СчетРасчетов", Аванс.СчетРасчетов);
		Отбор.Вставить("Контрагент",   Аванс.Контрагент);
		
		ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
		ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
		
		ОплаченныеРасходыУСН = ТаблицаПоступлениеРасходовУСН.Скопировать(Отбор);
		// Сворачиваем по всем колонкам таблицы УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН().
		ОплаченныеРасходыУСН.Свернуть("ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,
		|СчетУчетаУСН,ВидРасхода,ЭлементРасхода,Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,ОтражениеВУСН,
		|СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,РасходыУСН,
		|ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3",
			"Количество,СуммаВал,СуммаРуб,СуммаНДСВал,СуммаНДСРуб,СуммаНеУчитываетсяНУРуб,СуммаЕНВДРуб");
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоКоличество",              ОписаниеТипаКоличества);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаРуб",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаЕНВДРуб",            ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНДСРуб",             ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовРуб",                ОписаниеТипаСуммы);
		Для Каждого СтрокаРасходовУСН Из ОплаченныеРасходыУСН Цикл
			
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасходовУСН.СчетУчетаУСН);
				Если СвойстваСчетаУСН.УчетПоКПС И (СтрокаРасходовУСН.КПС <> Аванс.КПС) Тогда
					Продолжить; // Пропускаем расходы по другим КПС.
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаРасходовУСН.СуммаВал > 0 Тогда
				// Распределять оплату будем только на строки с положительной суммой расходов УСН.
				СтрокаРасходовУСН.ВсегоРасходовВал = СтрокаРасходовУСН.СуммаВал + СтрокаРасходовУСН.СуммаНДСВал;
				СтрокаРасходовУСН.ВсегоРасходовРуб = СтрокаРасходовУСН.СуммаРуб +
					СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб + СтрокаРасходовУСН.СуммаЕНВДРуб + СтрокаРасходовУСН.СуммаНДСРуб;
			КонецЕсли;
			
		КонецЦикла;
		
		РаспределитьСуммуОплатыРасходовУСН(
			Мин(Аванс.СуммаРасчетов, ОплаченныеРасходыУСН.Итог("ВсегоРасходовВал")),
			Мин(Аванс.СуммаРуб,      ОплаченныеРасходыУСН.Итог("ВсегоРасходовРуб")),
			ОплаченныеРасходыУСН);
		
		Для Каждого РасходУСН Из ОплаченныеРасходыУСН Цикл
			
			Если РасходУСН.ОплаченоСуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ДокументРасчетов,Валюта,
				|СчетУчетаУСН,РасходыУСН,ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3");
			
			НоваяСтрока.Количество              = РасходУСН.ОплаченоКоличество;
			НоваяСтрока.СуммаВал                = РасходУСН.ОплаченоСуммаВал;
			НоваяСтрока.СуммаРуб                = РасходУСН.ОплаченоСуммаРуб;
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
			НоваяСтрока.СуммаЕНВДРуб            = РасходУСН.ОплаченоСуммаЕНВДРуб;
			НоваяСтрока.СуммаНДСРуб             = РасходУСН.ОплаченоСуммаНДСРуб;
			
			НоваяСтрока.КорСчетУСН = СчетУчетаОплаченныхРасходовУСН(
				НоваяСтрока.СчетУчетаУСН, НоваяСтрока.РасходыУСН, Реквизиты);
			
			НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Признание расходов при погашении задолженности подотчетным лицам документами оплаты.
Функция ТаблицаОплаченныеРасходыПодотчетнихЛиц(ТаблицаРасшифровкаПлатежаУнифицированная, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);

	ТаблицаОплат = ТаблицаРасшифровкаПлатежаУнифицированная.СкопироватьКолонки();
	Для Каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасшифровкаПлатежаУнифицированная Цикл
		Если УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаРасшифровкаПлатежа.КФО) Тогда
			НоваяОплата = ТаблицаОплат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяОплата, СтрокаРасшифровкаПлатежа);
		КонецЕсли;
	КонецЦикла;
	ТаблицаОплат.Свернуть("ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Валюта", "СуммаРасчетов,СуммаРуб");
	
	Если ТаблицаОплат.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	// Получим остатки неоплаченных расходов УСН по оплаченным документам расчетов.
	СчетаРасходовКОплате = БухгалтерскийУчет.СписокСчетов(
		"У01.О,У01.ВО,У04.О,У08.ПО,У08.О,У10.О,У10.СО,У10.ОР,У15.О,У15.СО,У20.О,У41.О,У41.СО,У41.ОР,У70.О");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("СчетРасчетов", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("СчетРасчетов")));
	ОтборРасходов.Вставить("Контрагент", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("Контрагент")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаОплат.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаРасходовКОплате, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Заполним таблицу оплаченных расходов УСН.
	Для Каждого Оплата Из ТаблицаОплат Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("КФО", Оплата.КФО);
		
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", Оплата.ИФО);
		КонецЕсли;
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Оплата.СчетРасчетов);
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", Оплата.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", Оплата.Валюта);
		КонецЕсли;
		
		Отбор.Вставить("СчетРасчетов", Оплата.СчетРасчетов);
		Отбор.Вставить("Контрагент",   Оплата.Контрагент);
		
		ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
		ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
		
		ОплаченныеРасходыУСН = ОстаткиРасходовУСН.Скопировать(Отбор);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоКоличество",              ОписаниеТипаКоличества);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаРуб",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаЕНВДРуб",            ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНДСРуб",             ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовРуб",                ОписаниеТипаСуммы);
		Для Каждого СтрокаРасходовУСН Из ОплаченныеРасходыУСН Цикл
			
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасходовУСН.СчетУчетаУСН);
				Если СвойстваСчетаУСН.УчетПоКПС И (СтрокаРасходовУСН.КПС <> Оплата.КПС) Тогда
					Продолжить; // Пропускаем расходы по другим КПС.
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаРасходовУСН.СуммаВал > 0 Тогда
				// Распределять оплату будем только на строки с положительной суммой расходов УСН.
				СтрокаРасходовУСН.ВсегоРасходовВал = СтрокаРасходовУСН.СуммаВал;
				СтрокаРасходовУСН.ВсегоРасходовРуб = СтрокаРасходовУСН.СуммаРуб +
					СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб + СтрокаРасходовУСН.СуммаЕНВДРуб + СтрокаРасходовУСН.СуммаНДСРуб;
			КонецЕсли;
			
		КонецЦикла;
		
		ОсталосьПогаситьВал = Мин(Оплата.СуммаРасчетов, ОплаченныеРасходыУСН.Итог("ВсегоРасходовВал"));
		Если Оплата.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
			// Если расчеты в рублях, сумма оплаченных расходов не может превышать сумму расходов,
			// признанных первоначально при поступлении расходов.
			ОсталосьПогаситьРуб = Мин(Оплата.СуммаРуб, ОплаченныеРасходыУСН.Итог("ВсегоРасходовРуб"));
		Иначе
			// Если расчеты в валюте, сумма расходов в рублях может быть как больше, так и меньше суммы расходов,
			// признанных первоначально при поступлении расходов из-за разницы курсов.
			Коэффициент = ?(Оплата.СуммаРасчетов = 0, 0, ОсталосьПогаситьВал / Оплата.СуммаРасчетов);
			ОсталосьПогаситьРуб = Коэффициент * Оплата.СуммаРуб;
		КонецЕсли;
		
		// В таблице ОплаченныеРасходыУСН отобраны расходы УСН по подотчетному лицу.
		// Распределим сумму оплаты на все расходы УСН по данному расчетному документу.
		РаспределитьСуммуОплатыРасходовУСН(ОсталосьПогаситьВал, ОсталосьПогаситьРуб, ОплаченныеРасходыУСН);
		
		Для Каждого РасходУСН Из ОплаченныеРасходыУСН Цикл
			
			Если РасходУСН.ОплаченоСуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,СчетУчетаУСН,РасходыУСН");
			
			СвойстваСчетаУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			НоваяСтрока.Количество              = РасходУСН.ОплаченоКоличество;
			НоваяСтрока.СуммаВал                = РасходУСН.ОплаченоСуммаВал;
			НоваяСтрока.СуммаРуб                = РасходУСН.ОплаченоСуммаРуб;
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
			НоваяСтрока.СуммаЕНВДРуб            = РасходУСН.ОплаченоСуммаЕНВДРуб;
			НоваяСтрока.СуммаНДСРуб             = РасходУСН.ОплаченоСуммаНДСРуб;
			
			НоваяСтрока.КорСчетУСН = СчетУчетаОплаченныхРасходовУСН(
				НоваяСтрока.СчетУчетаУСН, НоваяСтрока.РасходыУСН, Реквизиты);
			
			НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
			
			// Спишем рублевые остатки расходов (УСН), учтенные по курсу на дату документа поступления (партии).
			Если РасходУСН.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
				
				Коэффициент = ?(РасходУСН.СуммаВал = 0, 0, РасходУСН.ОплаченоСуммаВал / РасходУСН.СуммаВал);
				
				Если Коэффициент * РасходУСН.СуммаРуб                <> РасходУСН.ОплаченоСуммаРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаНДСРуб             <> РасходУСН.ОплаченоСуммаНДСРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаЕНВДРуб            <> РасходУСН.ОплаченоСуммаЕНВДРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаНеУчитываетсяНУРуб <> РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб Тогда
					
					КорректировкаСуммРуб = ТаблицаОплаченныхРасходовУСН.Добавить();
					ЗаполнитьЗначенияСвойств(КорректировкаСуммРуб, НоваяСтрока,
						"ИмяСписка,СинонимСписка,НомерСтроки,
						|ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,СчетУчетаУСН,РасходыУСН,
						|ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3");
					
					КорректировкаСуммРуб.СуммаРуб                = Коэффициент * РасходУСН.СуммаРуб                - РасходУСН.ОплаченоСуммаРуб;
					КорректировкаСуммРуб.СуммаНДСРуб             = Коэффициент * РасходУСН.СуммаНДСРуб             - РасходУСН.ОплаченоСуммаНДСРуб;
					КорректировкаСуммРуб.СуммаЕНВДРуб            = Коэффициент * РасходУСН.СуммаЕНВДРуб            - РасходУСН.ОплаченоСуммаЕНВДРуб;
					КорректировкаСуммРуб.СуммаНеУчитываетсяНУРуб = Коэффициент * РасходУСН.СуммаНеУчитываетсяНУРуб - РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Оплата труда, налоги с ФОТ

Функция ВедетсяУчетРасчетовПоНалогу(ВидНалоговИПлатежей) Экспорт
	
	ВидыНалоговИПлатежей = Справочники.ВидыНалоговИПлатежей;
	
	Если ВидНалоговИПлатежей = ВидыНалоговИПлатежей.НДС
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.НДФЛ
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРДополнительная
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРДополнительнаяЛетныхЭкипажей
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРДополнительнаяНаДоплатуКПенсииШахтерам
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРЗаЗанятыхНаПодземныхИВредныхРаботах
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРЗаЗанятыхНаПодземныхИВредныхРаботахБезСпецОценки
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРЗаЗанятыхНаПодземныхИВредныхРаботахСпецОценка
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРЗаЗанятыхНаТяжелыхИПрочихРаботах
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахБезСпецОценки
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРЗаЗанятыхНаТяжелыхИПрочихРаботахСпецОценка
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРНакопительная
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРПоСуммарномуТарифу
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ПФРСтраховая
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ТФОМС
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ФСС
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СтраховыеВзносы_ФФОМС
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.ФСС_Добровольные
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.ФСС_НС
	 ИЛИ ВидНалоговИПлатежей = ВидыНалоговИПлатежей.СФР_НС
	Тогда
		// Начисление этих налогов проводится на счет У68 документами отражения зарплаты в учете,
		// поступления материальных запасов, услуг и пр. Расчеты по налогу ведутся на счете УРН.
		Возврат Истина;
	КонецЕсли;
	
	// Начисление этих налогов на счет У68 не производится, расчеты по ним не ведутся.
	// При выплате они сразу отражаются в расходах КУДиР (Дт У99) на всю сумму.
	Возврат Ложь;
	
КонецФункции

Функция ПодготовитьТаблицыРасходовПриОтраженииЗарплаты(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ОписаниеТипаСуммы        = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТиповСубконто    = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Вид операции (начисления, удержания, отчисления).
	ПустаяТаблица.Колонки.Добавить("ВидОперации",   Новый ОписаниеТипов("Строка"));
	ПустаяТаблица.Колонки.Добавить("ВидОперацииОтраженияЗарплаты", Новый ОписаниеТипов("СправочникСсылка.ВидыОперацийОтраженияЗарплаты"));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика отражения начислений, удержаний, отчислений.
	ПустаяТаблица.Колонки.Добавить("Счет",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Субконто1",     ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("Субконто2",     ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("Субконто3",     ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("КЭК",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("ВидЗатрат",     Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ПустаяТаблица.Колонки.Добавить("ВидНалога",     Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежей"));
	ПустаяТаблица.Колонки.Добавить("Налог",         Новый ОписаниеТипов("СправочникСсылка.НалогиИПлатежиОрганизации"));
	// Сотрудник.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Отражение в налоговом учете при УСН.
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
	
	ПустаяТаблица.Колонки.Добавить("СуммаВал",      ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",      ОписаниеТипаСуммы);
	
	ТаблицыРасходов = Новый Структура;
	ТаблицыРасходов.Вставить("Начисления", ПустаяТаблица.Скопировать());
	ТаблицыРасходов.Вставить("Удержания",  ПустаяТаблица.Скопировать());
	ТаблицыРасходов.Вставить("НалогиСФОТ", ПустаяТаблица.Скопировать());
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицыРасходов;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Параметры.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Параметры.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Параметры.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	КурсДокумента = Параметры.Курс / ?(Параметры.Кратность = 0, 1, Параметры.Кратность);
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Операции",
		"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,Счет,Субконто1,Субконто2,Субконто3,
		|ВидОперации,ОсновнойКонтрагент,Контрагент,Договор,ВидНалога,Налог,ВалютаДокумента,ОтражениеВУСН,Сумма",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Операции"" КАК ИмяСписка,
	|	""Операции"" КАК СинонимСписка,
	|	Операции.НомерСтроки КАК НомерСтроки,
	|	Операции.ИФО КАК ИФО,
	|	Операции.КФО КАК КФО,
	|	Операции.КПС КАК КПС,
	|	Операции.КЭК КАК КЭК,
	|	Операции.Подразделение КАК Подразделение,
	|	Операции.Счет КАК Счет,
	|	Операции.Субконто1 КАК Субконто1,
	|	Операции.Субконто2 КАК Субконто2,
	|	Операции.Субконто3 КАК Субконто3,
	|	Операции.ВидОперации КАК ВидОперацииОтраженияЗарплаты,
	|	Операции.ВидОперации.Код КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА Операции.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Операции.ОсновнойКонтрагент
	|		ИНАЧЕ Операции.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Операции.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|		ИНАЧЕ Операции.Договор
	|	КОНЕЦ КАК Договор,
	|	Операции.ВидНалога КАК ВидНалога,
	|	Операции.Налог КАК Налог,
	|	Операции.ОтражениеВУСН КАК ОтражениеВУСН,
	|	Операции.ВалютаДокумента КАК Валюта,
	|	Операции.Сумма КАК Сумма
	|ИЗ
	|	ТаблицаОперации КАК Операции
	|ГДЕ
	|	Операции.КФО В(&КФО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("КФО", УчетУСНКлиентСервер.МассивКФОдляНалоговогоУчетаУСН());
	
	ТаблицаОперации = Запрос.Выполнить().Выгрузить();
	
	// I. Обработаем начисления и отчисления.
	Для Каждого Строка Из ТаблицаОперации Цикл
		
		ЭтоНачисление = (Найти(Строка.ВидОперации, "Начисление") > 0);
		ЭтоОтчисления = (Найти(Строка.ВидОперации, "Отчисления") > 0)
					ИЛИ (Найти(Строка.ВидОперации, "СтраховыеВзносы") > 0)
					ИЛИ (Найти(Строка.ВидОперации, "ЕдиныйСтраховойТариф") > 0);
		
		Если ЭтоНачисление И Строка.Сумма <> 0 Тогда
			
			// Расходы на оплату труда.
			НоваяСтрока = ТаблицыРасходов.Начисления.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.ВидОперации = СокрЛП(Строка.ВидОперации);
			
			НоваяСтрока.СуммаВал = Строка.Сумма;
			НоваяСтрока.СуммаРуб = Строка.Сумма * КурсДокумента;
			
		ИначеЕсли ЭтоОтчисления И Строка.Сумма <> 0 Тогда
			
			// Расходы на уплату налогов с ФОТ.
			НоваяСтрока = ТаблицыРасходов.НалогиСФОТ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			
			НоваяСтрока.ВидОперации = СокрЛП(Строка.ВидОперации);
			
			НоваяСтрока.СуммаВал = Строка.Сумма;
			НоваяСтрока.СуммаРуб = Строка.Сумма * КурсДокумента;
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Строка.Счет);
		Если СвойстваСчета.ВидСубконто1 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
			НоваяСтрока.ВидЗатрат = НоваяСтрока.Субконто1;
		ИначеЕсли СвойстваСчета.ВидСубконто2 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
			НоваяСтрока.ВидЗатрат = НоваяСтрока.Субконто2;
		ИначеЕсли СвойстваСчета.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
			НоваяСтрока.ВидЗатрат = НоваяСтрока.Субконто3;
		КонецЕсли;
		
		Если НоваяСтрока.ВидОперации = "НачислениеПособияФСС"
		 ИЛИ НоваяСтрока.ВидОперации = "НачислениеНСиПЗ" Тогда
			// Согласно абз. 2 п. 1 ст. 252 НК РФ расходами признаются затраты, осуществленные (понесенные) налогоплательщиком.
			// Суммы, выплачиваемые за счет ФСС, не являются расходами, понесенными организацией самостоятельно.
			НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
		ИначеЕсли ЗначениеЗаполнено(Строка.ОтражениеВУСН) Тогда // Отражение в УСН явно указано в строке документа.
			НоваяСтрока.ОтражениеВУСН = Строка.ОтражениеВУСН;
		ИначеЕсли Параметры.Свойство("АвтоОтражениеВУСН")
			И ЗначениеЗаполнено(Параметры.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
			НоваяСтрока.ОтражениеВУСН = Параметры.АвтоОтражениеВУСН;
		ИначеЕсли ЗначениеЗаполнено(НоваяСтрока.ВидЗатрат) Тогда // Отражение в УСН определим из вида затрат.
			НоваяСтрока.ОтражениеВУСН = УчетУСН.ОтражениеВУСНпоВидуЗатрат(НоваяСтрока.ВидЗатрат);
		Иначе
			НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
		КонецЕсли;
		
	КонецЦикла;
	
	// II. Обработаем удержания.
	Для Каждого Строка Из ТаблицаОперации Цикл
		
		ЭтоУдержания = (Найти(Строка.ВидОперации, "Удержания") > 0);
		Если ЭтоУдержания И Строка.Сумма <> 0 Тогда
			
			ОтборНачислений = Новый Структура("ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,Валюта");
			ЗаполнитьЗначенияСвойств(ОтборНачислений, Строка);
			
			НачисленияВЭтомДокументе = ТаблицыРасходов.Начисления.Скопировать(ОтборНачислений);
			ВсегоНачисленийВЭтомДокументе = НачисленияВЭтомДокументе.Итог("СуммаВал");
			СуммаУдержанийКРаспределению  = Мин(Строка.Сумма, ВсегоНачисленийВЭтомДокументе);
			
			Если СуммаУдержанийКРаспределению > 0 Тогда
				
				// 1. Распределим сумму удержаний по начислениям в этом документе.
				ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(Строка.Сумма * КурсДокумента,
					НачисленияВЭтомДокументе, "СуммаРуб", "СуммаВал");
				
				ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(Строка.Сумма,
					НачисленияВЭтомДокументе, "СуммаВал");
				
				Для Каждого СтрокаНачислений Из НачисленияВЭтомДокументе Цикл
					
					НоваяСтрока = ТаблицыРасходов.Удержания.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					
					// Запомним, к какому начислению относится это удержание.
					НоваяСтрока.НомерСтроки   = СтрокаНачислений.НомерСтроки;
					НоваяСтрока.ОтражениеВУСН = СтрокаНачислений.ОтражениеВУСН;
					
					Если СокрЛП(Строка.ВидОперации) = "УдержанияПФРДополнительная"
					 ИЛИ СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛ"
					 ИЛИ СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛСПревышения" Тогда
						
						НоваяСтрока.СуммаВал = СтрокаНачислений.СуммаВал;
						НоваяСтрока.СуммаРуб = СтрокаНачислений.СуммаРуб;
						
						НоваяСтрока = ТаблицыРасходов.НалогиСФОТ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						
						НоваяСтрока.ОтражениеВУСН = СтрокаНачислений.ОтражениеВУСН;
						
						НоваяСтрока.СуммаВал = СтрокаНачислений.СуммаВал;
						НоваяСтрока.СуммаРуб = СтрокаНачислений.СуммаРуб;
						
					ИначеЕсли СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛПередачаЗадолженностиВНалоговыйОрган" Тогда
						
						НоваяСтрока.СуммаВал = (-1) * СтрокаНачислений.СуммаВал;
						НоваяСтрока.СуммаРуб = (-1) * СтрокаНачислений.СуммаРуб;
						
						НоваяСтрока = ТаблицыРасходов.НалогиСФОТ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						
						НоваяСтрока.ОтражениеВУСН = СтрокаНачислений.ОтражениеВУСН;
						
						// Операция отражается в учете как сторно удержания НДФЛ.
						НоваяСтрока.СуммаВал = (-1) * СтрокаНачислений.СуммаВал;
						НоваяСтрока.СуммаРуб = (-1) * СтрокаНачислений.СуммаРуб;
						
					ИначеЕсли СокрЛП(Строка.ВидОперации) = "УдержанияРазные" Тогда
						
						НоваяСтрока.СуммаВал = СтрокаНачислений.СуммаВал;
						НоваяСтрока.СуммаРуб = СтрокаНачислений.СуммаРуб;
						
						НоваяСтрока = ТаблицыРасходов.Начисления.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						
						// Счет и Субконто1 могут быть установлены в окне "Настройка отражения расходов в учете".
						Если ЗначениеЗаполнено(Строка.Счет) Тогда
							НоваяСтрока.СчетРасчетов = Строка.Счет;
						Иначе
							НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("304.03", Документ.Дата, Документ.Организация);
						КонецЕсли;
						Если ЗначениеЗаполнено(Строка.Субконто1) Тогда
							НоваяСтрока.Контрагент = Строка.Субконто1;
						КонецЕсли;
						
						НоваяСтрока.ОтражениеВУСН = СтрокаНачислений.ОтражениеВУСН;
						
						НоваяСтрока.СуммаВал = СтрокаНачислений.СуммаВал;
						НоваяСтрока.СуммаРуб = СтрокаНачислений.СуммаРуб;
						
					КонецЕсли;
					
				КонецЦикла;
				
				// 2. Нераспределенный остаток удержаний распределим по остаткам начислений.
				НеРаспределеноУдержанийРуб = Строка.Сумма * КурсДокумента - НачисленияВЭтомДокументе.Итог("СуммаРуб");
				НеРаспределеноУдержанийВал = Строка.Сумма - НачисленияВЭтомДокументе.Итог("СуммаВал");
				Если НеРаспределеноУдержанийРуб > 0 ИЛИ НеРаспределеноУдержанийВал > 0 Тогда
					
					// Получим остатки неоплаченных расходов УСН по оплаченным документам расчетов.
					СчетаНачислений = БухгалтерскийУчет.СписокСчетов("У70.О");
					
					ОтборРасходов = Новый Структура;
					ОтборРасходов.Вставить("ВидРасхода", Перечисления.ВидыРасходовУСН.ОплатаТруда);
					ОтборРасходов.Вставить("Контрагент", Строка.Контрагент);
					ОтборРасходов.Вставить("Договор",    Строка.Договор);
					ОтборРасходов.Вставить("Валюта",     Строка.Валюта);
					
					Если Параметры.ИспользоватьУчетПоИФО Тогда
						ОтборРасходов.Вставить("ИФО", Строка.ИФО);
					КонецЕсли;
					//Если Параметры.ИспользоватьУчетПоПодразделениям Тогда
					//	ОтборРасходов.Вставить("Подразделение", Строка.Подразделение);
					//КонецЕсли;
					ОтборРасходов.Вставить("КФО", Строка.КФО);
					
					ПериодОстатков = Новый Граница(Документ.Ссылка.МоментВремени(), ВидГраницы.Исключая);
					ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаНачислений, ОтборРасходов, Параметры);
					ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
					
					ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(НеРаспределеноУдержанийРуб,
						ОстаткиРасходовУСН, "СуммаРуб", "СуммаВал");
					
					ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(НеРаспределеноУдержанийВал,
						ОстаткиРасходовУСН, "СуммаВал");
					
					Для Каждого СтрокаОстатков Из ОстаткиРасходовУСН Цикл
						
						НоваяСтрока = ТаблицыРасходов.Удержания.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков);
						
						// Запомним, к какому начислению относится это удержание.
						НоваяСтрока.НомерСтроки   = СтрокаОстатков.НомерСтрокиДокумента;
						НоваяСтрока.ОтражениеВУСН = СтрокаОстатков.ОтражениеВУСН;
						
						НоваяСтрока.СуммаВал = СтрокаОстатков.СуммаВал;
						НоваяСтрока.СуммаРуб = СтрокаОстатков.СуммаРуб;
						
						Если СокрЛП(Строка.ВидОперации) = "УдержанияПФРДополнительная"
						 ИЛИ СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛ"
						 ИЛИ СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛСПревышения" Тогда
							
							НоваяСтрока = ТаблицыРасходов.НалогиСФОТ.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
							
							НоваяСтрока.ОтражениеВУСН = СтрокаОстатков.ОтражениеВУСН;
							
							НоваяСтрока.СуммаВал = СтрокаОстатков.СуммаВал;
							НоваяСтрока.СуммаРуб = СтрокаОстатков.СуммаРуб;
							
						ИначеЕсли СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛПередачаЗадолженностиВНалоговыйОрган" Тогда
							
							НоваяСтрока = ТаблицыРасходов.НалогиСФОТ.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
							
							НоваяСтрока.ОтражениеВУСН = СтрокаОстатков.ОтражениеВУСН;
							
							// Операция отражается в учете как сторно удержания НДФЛ.
							НоваяСтрока.СуммаВал = (-1) * СтрокаОстатков.СуммаВал;
							НоваяСтрока.СуммаРуб = (-1) * СтрокаОстатков.СуммаРуб;
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				НоваяСтрока = ТаблицыРасходов.Удержания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
				
				НоваяСтрока.СуммаВал = Строка.Сумма;
				НоваяСтрока.СуммаРуб = Строка.Сумма * КурсДокумента;
				
				Если СокрЛП(Строка.ВидОперации) = "УдержанияПФРДополнительная"
				 ИЛИ СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛ"
				 ИЛИ СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛСПревышения" Тогда
					
					НоваяСтрока = ТаблицыРасходов.НалогиСФОТ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					
					НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
					
					НоваяСтрока.СуммаВал = Строка.Сумма;
					НоваяСтрока.СуммаРуб = Строка.Сумма * КурсДокумента;
					
				ИначеЕсли СокрЛП(Строка.ВидОперации) = "УдержанияНДФЛПередачаЗадолженностиВНалоговыйОрган" Тогда
					
					НоваяСтрока = ТаблицыРасходов.НалогиСФОТ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					
					НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
					
					// Операция отражается в учете как сторно удержания НДФЛ.
					НоваяСтрока.СуммаВал = (-1) * Строка.Сумма;
					НоваяСтрока.СуммаРуб = (-1) * Строка.Сумма * КурсДокумента;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицыРасходов.Удержания.Свернуть("ИмяСписка,СинонимСписка,НомерСтроки,
		|ИФО,КФО,КПС,КЭК,Подразделение,Счет,Субконто1,Субконто2,Субконто3,ВидЗатрат,
		|ВидОперации,ВидОперацииОтраженияЗарплаты,Контрагент,Договор,Валюта,ОтражениеВУСН", "СуммаВал,СуммаРуб");
	ТаблицыРасходов.Удержания.Сортировать("ИмяСписка,НомерСтроки");
	
	ТаблицыРасходов.НалогиСФОТ.Свернуть("ИмяСписка,СинонимСписка,НомерСтроки,
		|ИФО,КФО,КПС,КЭК,Подразделение,Счет,Субконто1,Субконто2,Субконто3,ВидЗатрат,ВидНалога,Налог,
		|ВидОперации,ВидОперацииОтраженияЗарплаты,Контрагент,Договор,Валюта,ОтражениеВУСН", "СуммаВал,СуммаРуб");
	ТаблицыРасходов.НалогиСФОТ.Сортировать("ИмяСписка,НомерСтроки");
	
	Возврат ТаблицыРасходов;
	
КонецФункции

Функция ПустаяТаблицаРасходыУСННаОплатуТрудаИНалогиСФОТ() Экспорт

	ПустаяТаблица = ПустаяТаблицаПоступлениеРасходовУСН();
	
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ВидОперации", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаРасходыУСННаОплатуТрудаИНалогиСФОТ(ТаблицыПоступления, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасходовУСН = ПустаяТаблицаРасходыУСННаОплатуТрудаИНалогиСФОТ();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Оплата труда (начисления).
	Если ТаблицыПоступления.Свойство("Начисления")
	   И ТаблицыПоступления.Начисления.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.Начисления Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,ВидОперации,СчетРасчетов,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.ОплатаТруда;
			РасходУСН.ЭлементРасхода = СтрокаДокумента.Контрагент;
			
			Если ЗначениеЗаполнено(СтрокаДокумента.ОтражениеВУСН) Тогда
				РасходУСН.ОтражениеВУСН = СтрокаДокумента.ОтражениеВУСН;
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			РасходУСН.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У70.О");
			Если НЕ ЗначениеЗаполнено(РасходУСН.СчетРасчетов) Тогда
				РасходУСН.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
					СтрокаДокумента.КЭК, "302.00", , Реквизиты.Дата, Реквизиты.Организация, СтрокаДокумента.ИФО);
			КонецЕсли;
			
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты;
			РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Контрагент;
			
			РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
			Иначе
				РасходУСН.СуммаРуб = СтрокаДокумента.СуммаРуб;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Удержания.
	Если ТаблицыПоступления.Свойство("Удержания")
	   И ТаблицыПоступления.Удержания.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.Удержания Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,ВидОперации,Контрагент,Договор,Валюта,ОтражениеВУСН");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода     = Перечисления.ВидыРасходовУСН.ОплатаТруда;
			РасходУСН.ЭлементРасхода = СтрокаДокумента.Контрагент;
			
			РасходУСН.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У70.О");
			РасходУСН.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				СтрокаДокумента.КЭК, "302.00", , Реквизиты.Дата, Реквизиты.Организация, СтрокаДокумента.ИФО);
			
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.Контрагенты;
			РасходУСН.СубконтоРасходов2    = СтрокаДокумента.Контрагент;
			
			РасходУСН.СуммаВал = - СтрокаДокумента.СуммаВал;
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = - СтрокаДокумента.СуммаРуб;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = - СтрокаДокумента.СуммаРуб;
			Иначе
				РасходУСН.СуммаРуб = - СтрокаДокумента.СуммаРуб;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Налоги с ФОТ.
	Если ТаблицыПоступления.Свойство("НалогиСФОТ")
	   И ТаблицыПоступления.НалогиСФОТ.Количество() > 0 Тогда
		
		// Соответствие видов операций отражения зарплаты и счетов учета.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыОперацийОтраженияЗарплаты.Ссылка КАК ВидОперации,
		|	ВидыОперацийОтраженияЗарплаты.ВидНалога КАК ВидНалога,
		|	ВидыОперацийОтраженияЗарплаты.ВидНалога.СчетУчета КАК КодСчетаУчета
		|ИЗ
		|	Справочник.ВидыОперацийОтраженияЗарплаты КАК ВидыОперацийОтраженияЗарплаты
		|ГДЕ
		|	ВидыОперацийОтраженияЗарплаты.ЭтоВзносы";
		ВидыОперацийОтраженияЗарплаты = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.НалогиСФОТ Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			РасходУСН = ТаблицаРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(РасходУСН, СтрокаДокумента,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,ВидОперации,Контрагент,Договор,Валюта");
			
			РасходУСН.ИмяСпискаДокумента   = СтрокаДокумента.ИмяСписка;
			РасходУСН.НомерСтрокиДокумента = СтрокаДокумента.НомерСтроки;
		
			РасходУСН.ВидРасхода = Перечисления.ВидыРасходовУСН.Налоги;
			
			// Вид налога определяется по аналогии с типовыми операциями документа (СубконтоКт1).
			ВидНалога = Справочники.ВидыНалоговИПлатежей.ПустаяСсылка();
			Если ЗначениеЗаполнено(СтрокаДокумента.Счет)
				И ТипЗнч(СтрокаДокумента.Субконто1) = Тип("СправочникСсылка.ВидыНалоговИПлатежей") Тогда
				ВидНалога = СтрокаДокумента.Субконто1;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ВидНалога) Тогда
				ВидНалога = СтрокаДокумента.ВидНалога;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.Налог) Тогда
				ВидНалога = СтрокаДокумента.Налог.ВидНалогаИлиПлатежа;
			Иначе
				ВидОперацииОтраженияЗарплаты = ВидыОперацийОтраженияЗарплаты.Найти(СтрокаДокумента.ВидОперацииОтраженияЗарплаты, "ВидОперации");
				Если ВидОперацииОтраженияЗарплаты <> Неопределено Тогда
					ВидНалога = ВидОперацииОтраженияЗарплаты.ВидНалога;
				КонецЕсли;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ВидНалога) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru = 'Вид налога'"), СтрокаДокумента.НомерСтроки, СтрокаДокумента.СинонимСписка);
				ПолеКолонки = "Объект." + СтрокаДокумента.ИмяСписка + "[" + Формат(СтрокаДокумента.НомерСтроки-1, "ЧН=0; ЧГ=") + "].ВидНалога";
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстСообщения, ПолеКолонки, Отказ);
			КонецЕсли;
			РасходУСН.ЭлементРасхода = ВидНалога;
			
			Если ЗначениеЗаполнено(ВидНалога) Тогда
				РеквизитыВидаНалога = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидНалога, "СчетУчета");
				Если Справочники.ВидыНалоговИПлатежей.ОплачиваетсяЧерезЕНП(ВидНалога, Реквизиты.Организация) Тогда
					// Для налогов (платежей), оплачиваемых через ЕНП, расчеты ведутся на счете 303.хх. Счет УРН не используется.
					РасходУСН.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду(РеквизитыВидаНалога.СчетУчета, Реквизиты.Дата, Реквизиты.Организация);
				Иначе // Для остальных налогов (платежей) расчеты ведутся на счете УРН.
					РасходУСН.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("УРН", Реквизиты.Дата, Реквизиты.Организация);
				КонецЕсли;
			Иначе
				РасходУСН.СчетРасчетов = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			КонецЕсли;
			
			// Отражение в расходах УСН.
			Если ЗначениеЗаполнено(СтрокаДокумента.ОтражениеВУСН) Тогда // Отражение в УСН явно указано в строке документа.
				РасходУСН.ОтражениеВУСН = СтрокаДокумента.ОтражениеВУСН;
			ИначеЕсли Реквизиты.Свойство("АвтоОтражениеВУСН")
				И ЗначениеЗаполнено(Реквизиты.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
				РасходУСН.ОтражениеВУСН = Реквизиты.АвтоОтражениеВУСН;
			ИначеЕсли ЗначениеЗаполнено(СтрокаДокумента.ВидЗатрат) Тогда // Отражение в УСН определим из вида затрат.
				РасходУСН.ОтражениеВУСН = УчетУСН.ОтражениеВУСНпоВидуЗатрат(СтрокаДокумента.ВидЗатрат);
			Иначе
				РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;
			
			РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У68.О");
			РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.ВидыНалоговИПлатежей;
			РасходУСН.СубконтоРасходов2    = РасходУСН.ЭлементРасхода;
			
			РасходУСН.СуммаВал = СтрокаДокумента.СуммаВал;
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
				РасходУСН.СуммаНеУчитываетсяНУРуб = СтрокаДокумента.СуммаРуб;
			ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
				РасходУСН.СуммаЕНВДРуб = СтрокаДокумента.СуммаРуб;
			Иначе
				РасходУСН.СуммаРуб = СтрокаДокумента.СуммаРуб;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "Партия");
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "ДокументРасчетов");
	
	ТаблицаРасходовУСН.Сортировать("ИмяСпискаДокумента,НомерСтрокиДокумента");
	
	// Формируем элементы учета расходов УСН.
	СформироватьЭлементыУчетаРасходовУСН(Реквизиты.Ссылка, ТаблицаРасходовУСН);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Функция ПустаяТаблицаНачисленияЗаСчетНалоговыхПлатежей() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("КЭК",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов по налогам и сборам.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("ВидНалога",     Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежей"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	// Суммовые показатели операции.
	ПустаяТаблица.Колонки.Добавить("СуммаВал", ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб", ОписаниеТипаСуммы);
	// Дополнительные колонки.
	ПустаяТаблица.Колонки.Добавить("ВидОперации", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	
	Возврат ПустаяТаблица;

КонецФункции

// Подготавливает таблицу расшифровки налогового платежа (для целей УСН).
//
Функция ПодготовитьТаблицуНачисленийЗаСчетНалоговыхПлатежейПоДокументу(Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицаНачислений = ПустаяТаблицаНачисленияЗаСчетНалоговыхПлатежей();
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	МетаданныеДокумента = Документ.Метаданные();
	
	Запрос = Новый Запрос;
	
	Если МетаданныеДокумента.Имя = "ОтражениеЗарплатыВУчете" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Операции",
			"НомерСтроки,ИФО,КФО,КПС,КЭК,Подразделение,
			|ВидОперации,ОсновнойКонтрагент,Контрагент,Договор,ВалютаДокумента,Сумма",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""Операции"" КАК ИмяСписка,
		|	""Операции"" КАК СинонимСписка,
		|	Операции.НомерСтроки КАК НомерСтроки,
		|	Операции.ИФО КАК ИФО,
		|	Операции.КФО КАК КФО,
		|	Операции.КПС КАК КПС,
		|	Операции.КЭК КАК КЭК,
		|	Операции.Подразделение КАК Подразделение,
		|	Операции.ВидОперации.Код КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА Операции.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА Операции.ОсновнойКонтрагент
		|		ИНАЧЕ Операции.Контрагент
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА Операции.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
		|		ИНАЧЕ Операции.Договор
		|	КОНЕЦ КАК Договор,
		|	Операции.ВалютаДокумента КАК Валюта,
		|	Операции.Сумма КАК СуммаВал,
		|	Операции.Сумма * &КурсДокумента КАК СуммаРуб
		|ИЗ
		|	ТаблицаОперации КАК Операции
		|ГДЕ
		|	Операции.КФО В(&КФО)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("КФО", УчетУСНКлиентСервер.МассивКФОдляНалоговогоУчетаУСН());
		Запрос.УстановитьПараметр("КурсДокумента", Параметры.Курс / ?(Параметры.Кратность = 0, 1, Параметры.Кратность));
		
		ТаблицаОперации = Запрос.Выполнить().Выгрузить();
		Для Каждого Строка Из ТаблицаОперации Цикл
			
			Если СокрЛП(Строка.ВидОперации) = "НачислениеПособияФСС" Тогда
			
				НоваяСтрока = ТаблицаНачислений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.ВидНалога    = Справочники.ВидыНалоговИПлатежей.СтраховыеВзносы_ФСС; // 303.02
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("УРН", Документ.Дата, Документ.Организация);
				
			ИначеЕсли СокрЛП(Строка.ВидОперации) = "НачислениеНСиПЗ" Тогда
				
				НоваяСтрока = ТаблицаНачислений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.ВидНалога    = Справочники.ВидыНалоговИПлатежей.ВидНалогаНСиПЗ(Документ.Дата); // 303.06
				НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду("УРН", Документ.Дата, Документ.Организация);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаНачислений.ЗаполнитьЗначения(Документ, "ДокументРасчетов");
	
	Возврат ТаблицаНачислений;
	
КонецФункции

// Удержания из оплаты труда (алименты и пр.)

// Признание расходов при отражении удержаний из оплаты труда документом Отражение зарплаты в учете.
Функция ТаблицаОплаченныеАвансомУдержанияИзОплатыТруда(ТаблицаПоступлениеРасходовУСН, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	Если ТаблицаПоступлениеРасходовУСН.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
	
	Отбор = Новый Структура("СчетРасчетов", БухгалтерскийУчет.СчетПоКоду("304.03", Реквизиты.Дата, Реквизиты.Организация));
	УдержанияИзОплатыТруда = ТаблицаПоступлениеРасходовУСН.Скопировать(Отбор);
	УдержанияИзОплатыТруда.Колонки.Добавить("КЭК", Новый ОписаниеТипов("СправочникСсылка.КОСГУ")); // Учет по КЭК на счете 304.03 не ведется.
	УдержанияИзОплатыТруда.Колонки.Добавить("СчетАвансов", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	Для Каждого Удержание Из УдержанияИзОплатыТруда Цикл
		Удержание.СчетАвансов = Удержание.СчетРасчетов; // Нет отдельного счета авансов для счета 304.03.
	КонецЦикла;
	
	// Подготовим таблицу остатков авансов.
	ОстаткиАвансов = УчетРасчетов.ОстаткиАвансов(Реквизиты.Дата, УдержанияИзОплатыТруда, Реквизиты);
	Если ОстаткиАвансов.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	ОстаткиАвансов.Свернуть("ИФО,КФО,КПС,Подразделение,СчетАвансов,Контрагент,Валюта", "СуммаРасчетов,СуммаРуб");
	
	// Заполним таблицу оплаченных расходов.
	Для Каждого Аванс Из ОстаткиАвансов Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("КФО", Аванс.КФО);
		
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", Аванс.ИФО);
		КонецЕсли;
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Аванс.СчетАвансов);
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", Аванс.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", Аванс.Валюта);
		КонецЕсли;
		
		Отбор.Вставить("СчетРасчетов", Аванс.СчетАвансов);
		Отбор.Вставить("Контрагент",   Аванс.Контрагент);
		
		ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
		ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
		
		ОплаченныеРасходыУСН = УдержанияИзОплатыТруда.Скопировать(Отбор);
		// Сворачиваем по всем колонкам таблицы УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН().
		ОплаченныеРасходыУСН.Свернуть("ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,
		|СчетУчетаУСН,ВидРасхода,ЭлементРасхода,Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,ОтражениеВУСН,
		|СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,РасходыУСН,
		|ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3",
			"Количество,СуммаВал,СуммаРуб,СуммаНДСВал,СуммаНДСРуб,СуммаНеУчитываетсяНУРуб,СуммаЕНВДРуб");
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоКоличество",              ОписаниеТипаКоличества);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаРуб",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаЕНВДРуб",            ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНДСРуб",             ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовРуб",                ОписаниеТипаСуммы);
		Для Каждого СтрокаРасходовУСН Из ОплаченныеРасходыУСН Цикл
			
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасходовУСН.СчетУчетаУСН);
				Если СвойстваСчетаУСН.УчетПоКПС И (СтрокаРасходовУСН.КПС <> Аванс.КПС) Тогда
					Продолжить; // Пропускаем расходы по другим КПС.
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаРасходовУСН.СуммаВал > 0 Тогда
				// Распределять оплату будем только на строки с положительной суммой расходов УСН.
				СтрокаРасходовУСН.ВсегоРасходовВал = СтрокаРасходовУСН.СуммаВал + СтрокаРасходовУСН.СуммаНДСВал;
				СтрокаРасходовУСН.ВсегоРасходовРуб = СтрокаРасходовУСН.СуммаРуб +
					СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб + СтрокаРасходовУСН.СуммаЕНВДРуб + СтрокаРасходовУСН.СуммаНДСРуб;
			КонецЕсли;
			
		КонецЦикла;
		
		РаспределитьСуммуОплатыРасходовУСН(
			Мин(Аванс.СуммаРасчетов, ОплаченныеРасходыУСН.Итог("ВсегоРасходовВал")),
			Мин(Аванс.СуммаРуб,      ОплаченныеРасходыУСН.Итог("ВсегоРасходовРуб")),
			ОплаченныеРасходыУСН);
		
		Для Каждого РасходУСН Из ОплаченныеРасходыУСН Цикл
			
			Если РасходУСН.ОплаченоСуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ДокументРасчетов,Валюта,
				|СчетУчетаУСН,РасходыУСН,ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3");
			
			НоваяСтрока.Количество              = РасходУСН.ОплаченоКоличество;
			НоваяСтрока.СуммаВал                = РасходУСН.ОплаченоСуммаВал;
			НоваяСтрока.СуммаРуб                = РасходУСН.ОплаченоСуммаРуб;
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
			НоваяСтрока.СуммаЕНВДРуб            = РасходУСН.ОплаченоСуммаЕНВДРуб;
			НоваяСтрока.СуммаНДСРуб             = РасходУСН.ОплаченоСуммаНДСРуб;
			
			НоваяСтрока.КорСчетУСН = СчетУчетаОплаченныхРасходовУСН(
				НоваяСтрока.СчетУчетаУСН, НоваяСтрока.РасходыУСН, Реквизиты);
			
			НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Признание расходов при погашении задолженности (перечислении удержаний) контрагентам документами оплаты.
Функция ТаблицаПеречислениеУдержанийИзОплатыТруда(ТаблицаРасчетов, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
	
	// Подготовим таблицу оплат для целей УСН.
	ТаблицаОплат = ТаблицаРасчетов.СкопироватьКолонки();
	Если ТаблицаРасчетов.Колонки.Найти("ЭтоАванс") <> Неопределено Тогда // ТаблицаРасчетовСПогашениемЗадолженности
		
		Для Каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
			Если НЕ СтрокаРасчетов.ЭтоАванс И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаРасчетов.КФО) Тогда
				НоваяОплата = ТаблицаОплат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяОплата, СтрокаРасчетов);
			КонецЕсли;
		КонецЦикла;
		
	Иначе // ТаблицаРасшифровкаПлатежаУнифицированная
		
		Для Каждого СтрокаРасшифровкаПлатежа Из ТаблицаРасчетов Цикл
			Если УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаРасшифровкаПлатежа.КФО) Тогда
				НоваяОплата = ТаблицаОплат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяОплата, СтрокаРасшифровкаПлатежа);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	ТаблицаОплат.Свернуть("ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Валюта", "СуммаРасчетов,СуммаРуб");
	
	Если ТаблицаОплат.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	// Получим остатки неоплаченных расходов УСН по оплаченным документам расчетов.
	СчетаРасходовКОплате = БухгалтерскийУчет.СписокСчетов("У70.О");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("СчетРасчетов", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("СчетРасчетов")));
	ОтборРасходов.Вставить("Контрагент", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("Контрагент")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаОплат.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаРасходовКОплате, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Заполним таблицу оплаченных расходов УСН.
	Для Каждого Оплата Из ТаблицаОплат Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("КФО", Оплата.КФО);
		
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", Оплата.ИФО);
		КонецЕсли;
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Оплата.СчетРасчетов);
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", Оплата.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", Оплата.Валюта);
		КонецЕсли;
		
		Отбор.Вставить("СчетРасчетов", Оплата.СчетРасчетов);
		Отбор.Вставить("Контрагент",   Оплата.Контрагент);
		
		ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
		ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
		
		ОплаченныеРасходыУСН = ОстаткиРасходовУСН.Скопировать(Отбор);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоКоличество",              ОписаниеТипаКоличества);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаРуб",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаЕНВДРуб",            ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНДСРуб",             ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовВал",                ОписаниеТипаСуммы);
		ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовРуб",                ОписаниеТипаСуммы);
		Для Каждого СтрокаРасходовУСН Из ОплаченныеРасходыУСН Цикл
			
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасходовУСН.СчетУчетаУСН);
				Если СвойстваСчетаУСН.УчетПоКПС И (СтрокаРасходовУСН.КПС <> Оплата.КПС) Тогда
					Продолжить; // Пропускаем расходы по другим КПС.
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаРасходовУСН.СуммаВал > 0 Тогда
				// Распределять оплату будем только на строки с положительной суммой расходов УСН.
				СтрокаРасходовУСН.ВсегоРасходовВал = СтрокаРасходовУСН.СуммаВал;
				СтрокаРасходовУСН.ВсегоРасходовРуб = СтрокаРасходовУСН.СуммаРуб +
					СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб + СтрокаРасходовУСН.СуммаЕНВДРуб + СтрокаРасходовУСН.СуммаНДСРуб;
			КонецЕсли;
			
		КонецЦикла;
		
		ОсталосьПогаситьВал = Мин(Оплата.СуммаРасчетов, ОплаченныеРасходыУСН.Итог("ВсегоРасходовВал"));
		Если Оплата.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
			// Если расчеты в рублях, сумма оплаченных расходов не может превышать сумму расходов,
			// признанных первоначально при поступлении расходов.
			ОсталосьПогаситьРуб = Мин(Оплата.СуммаРуб, ОплаченныеРасходыУСН.Итог("ВсегоРасходовРуб"));
		Иначе
			// Если расчеты в валюте, сумма расходов в рублях может быть как больше, так и меньше суммы расходов,
			// признанных первоначально при поступлении расходов из-за разницы курсов.
			Коэффициент = ?(Оплата.СуммаРасчетов = 0, 0, ОсталосьПогаситьВал / Оплата.СуммаРасчетов);
			ОсталосьПогаситьРуб = Коэффициент * Оплата.СуммаРуб;
		КонецЕсли;
		
		// В таблице ОплаченныеРасходыУСН отобраны расходы УСН по подотчетному лицу.
		// Распределим сумму оплаты на все расходы УСН по данному расчетному документу.
		РаспределитьСуммуОплатыРасходовУСН(ОсталосьПогаситьВал, ОсталосьПогаситьРуб, ОплаченныеРасходыУСН);
		
		Для Каждого РасходУСН Из ОплаченныеРасходыУСН Цикл
			
			Если РасходУСН.ОплаченоСуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,СчетУчетаУСН,РасходыУСН");
			
			СвойстваСчетаУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			НоваяСтрока.Количество              = РасходУСН.ОплаченоКоличество;
			НоваяСтрока.СуммаВал                = РасходУСН.ОплаченоСуммаВал;
			НоваяСтрока.СуммаРуб                = РасходУСН.ОплаченоСуммаРуб;
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
			НоваяСтрока.СуммаЕНВДРуб            = РасходУСН.ОплаченоСуммаЕНВДРуб;
			НоваяСтрока.СуммаНДСРуб             = РасходУСН.ОплаченоСуммаНДСРуб;
			
			НоваяСтрока.КорСчетУСН = СчетУчетаОплаченныхРасходовУСН(
				НоваяСтрока.СчетУчетаУСН, НоваяСтрока.РасходыУСН, Реквизиты);
			
			НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
			
			// Спишем рублевые остатки расходов (УСН), учтенные по курсу на дату документа поступления (партии).
			Если РасходУСН.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
				
				Коэффициент = ?(РасходУСН.СуммаВал = 0, 0, РасходУСН.ОплаченоСуммаВал / РасходУСН.СуммаВал);
				
				Если Коэффициент * РасходУСН.СуммаРуб                <> РасходУСН.ОплаченоСуммаРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаНДСРуб             <> РасходУСН.ОплаченоСуммаНДСРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаЕНВДРуб            <> РасходУСН.ОплаченоСуммаЕНВДРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаНеУчитываетсяНУРуб <> РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб Тогда
					
					КорректировкаСуммРуб = ТаблицаОплаченныхРасходовУСН.Добавить();
					ЗаполнитьЗначенияСвойств(КорректировкаСуммРуб, НоваяСтрока,
						"ИмяСписка,СинонимСписка,НомерСтроки,
						|ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,СчетУчетаУСН,РасходыУСН,
						|ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3");
					
					КорректировкаСуммРуб.СуммаРуб                = Коэффициент * РасходУСН.СуммаРуб                - РасходУСН.ОплаченоСуммаРуб;
					КорректировкаСуммРуб.СуммаНДСРуб             = Коэффициент * РасходУСН.СуммаНДСРуб             - РасходУСН.ОплаченоСуммаНДСРуб;
					КорректировкаСуммРуб.СуммаЕНВДРуб            = Коэффициент * РасходУСН.СуммаЕНВДРуб            - РасходУСН.ОплаченоСуммаЕНВДРуб;
					КорректировкаСуммРуб.СуммаНеУчитываетсяНУРуб = Коэффициент * РасходУСН.СуммаНеУчитываетсяНУРуб - РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Имущественные налоги

Функция ТаблицаНачислениеИмущественныхНалогов(Документ, Параметры = Неопределено) Экспорт
	
	ТаблицаРасходовУСН = ПустаяТаблицаПоступлениеРасходовУСН();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицаРасходовУСН;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ДвиженияДокумента",
		"НомерСтроки,ИФО,КФО,КПСДт,ПодразделениеДт,СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,
		|ВидНалогаИлиПлатежа,НалогСборПлатеж,ОтражениеВУСН,Сумма",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""ДвиженияДокумента"" КАК ИмяСписка,
	|	""Бухгалтерский учет"" КАК СинонимСписка,
	|	НачислениеИмущественныхНалогов.НомерСтроки КАК НомерСтроки,
	|	НачислениеИмущественныхНалогов.ИФО КАК ИФО,
	|	НачислениеИмущественныхНалогов.КФО КАК КФО,
	|	НачислениеИмущественныхНалогов.КПСДт КАК КПС,
	|	НачислениеИмущественныхНалогов.ПодразделениеДт КАК Подразделение,
	|	НачислениеИмущественныхНалогов.СчетДт КАК СчетДт,
	|	НачислениеИмущественныхНалогов.СубконтоДт1 КАК СубконтоЗатрат1,
	|	НачислениеИмущественныхНалогов.СубконтоДт2 КАК СубконтоЗатрат2,
	|	НачислениеИмущественныхНалогов.СубконтоДт3 КАК СубконтоЗатрат3,
	|	НачислениеИмущественныхНалогов.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
	|	НачислениеИмущественныхНалогов.ВидНалогаИлиПлатежа.СчетУчета КАК КодСчетаРасчетов,
	|	НачислениеИмущественныхНалогов.НалогСборПлатеж КАК НалогСборПлатеж,
	|	НачислениеИмущественныхНалогов.ОтражениеВУСН КАК ОтражениеВУСН,
	|	НачислениеИмущественныхНалогов.Сумма КАК Сумма
	|ИЗ
	|	ТаблицаДвиженияДокумента КАК НачислениеИмущественныхНалогов
	|ГДЕ
	|	НачислениеИмущественныхНалогов.Сумма > 0";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(Выборка.КФО) Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		РасходУСН = ТаблицаРасходовУСН.Добавить();
		ЗаполнитьЗначенияСвойств(РасходУСН, Выборка,
			"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение");
		
		РасходУСН.ИмяСпискаДокумента   = Выборка.ИмяСписка;
		РасходУСН.НомерСтрокиДокумента = Выборка.НомерСтроки;
		
		РасходУСН.ВидРасхода = Перечисления.ВидыРасходовУСН.Налоги;
		РасходУСН.ЭлементРасхода = Выборка.ВидНалогаИлиПлатежа;
		
		// Определим вид затрат.
		ВидЗатрат = Справочники.ВидыЗатрат.ПустаяСсылка();
		СвойстваСчетаЗатрат = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Выборка.СчетДт);
		Для НомерСубконто = 1 По СвойстваСчетаЗатрат.КоличествоСубконто Цикл
			
			ВидСубконто = СвойстваСчетаЗатрат["ВидСубконто" + НомерСубконто];
			Если ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат Тогда
				ВидЗатрат = Выборка["СубконтоЗатрат" + НомерСубконто];
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Выборка.ОтражениеВУСН) Тогда // Отражение в УСН явно указано в строке документа.
			РасходУСН.ОтражениеВУСН = Выборка.ОтражениеВУСН;
		ИначеЕсли Параметры.Свойство("АвтоОтражениеВУСН")
			И ЗначениеЗаполнено(Параметры.АвтоОтражениеВУСН) Тогда // Отражение в УСН определено типовой операцией.
			РасходУСН.ОтражениеВУСН = Параметры.АвтоОтражениеВУСН;
		ИначеЕсли ЗначениеЗаполнено(ВидЗатрат) Тогда // Отражение в УСН определим из вида затрат.
			РасходУСН.ОтражениеВУСН = УчетУСН.ОтражениеВУСНпоВидуЗатрат(ВидЗатрат);
		Иначе
			РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
		КонецЕсли;
		
		РасходУСН.СчетУчетаУСН         = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У68.О");
		РасходУСН.ВидСубконтоРасходов2 = ПланыВидовХарактеристик.ВидыСубконто.ВидыНалоговИПлатежей;
		РасходУСН.СубконтоРасходов2    = Выборка.ВидНалогаИлиПлатежа;
		
		Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются Тогда
			РасходУСН.СуммаНеУчитываетсяНУРуб = Выборка.Сумма;
			РасходУСН.СуммаВал = Выборка.Сумма;
		ИначеЕсли РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.ОсобыйПорядок Тогда
			РасходУСН.СуммаЕНВДРуб = Выборка.Сумма;
			РасходУСН.СуммаВал = Выборка.Сумма;
		Иначе
			РасходУСН.СуммаРуб = Выборка.Сумма;
			РасходУСН.СуммаВал = Выборка.Сумма;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.КодСчетаРасчетов) Тогда
			РасходУСН.СчетРасчетов = БухгалтерскийУчет.СчетПоКоду(Выборка.КодСчетаРасчетов, Документ.Дата, Документ.Организация);
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Документ.Ссылка, "Партия");
	ТаблицаРасходовУСН.ЗаполнитьЗначения(Документ.Ссылка, "ДокументРасчетов");
	
	// Формируем элементы учета расходов УСН.
	СформироватьЭлементыУчетаРасходовУСН(Документ.Ссылка, ТаблицаРасходовУСН);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Оплата расходов УСН

Функция ПустаяТаблицаОплаченныхРасходовУСН() Экспорт

	ОписаниеТипаСуммы       = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТипаСубконто    = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Счет и аналитика учета расходов УСН в оплате (Кт).
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",    Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов2",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов2",     ОписаниеТипаСубконто);
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов3",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов3",     ОписаниеТипаСубконто);
	
	// Счет и аналитика учета оплаченных расходов УСН (Дт).
	ПустаяТаблица.Колонки.Добавить("КорСчетУСН",    Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	
	ПустаяТаблица.Колонки.Добавить("Количество",              ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаЗачетАвансовПоставщикуУСН(ТаблицаПоступлениеРасходовУСН, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);

	// Подготовим таблицу расходов к оплате.
	РасходыУСНкОплате = ТаблицаПоступлениеРасходовУСН.Скопировать();
	РасходыКУдалению = Новый Массив;
	Для Каждого РасходУСН Из РасходыУСНкОплате Цикл
		Если РасходУСН.ВидРасхода = Перечисления.ВидыРасходовУСН.Налоги
		   И БухгалтерскийУчет.СчетВИерархии(РасходУСН.СчетУчетаУСН, "У68.НА") Тогда
		// Агентский НДС исключаем, т.к. он оплачивается в налоговую, а не поставщику.
		РасходыКУдалению.Добавить(РасходУСН);
		КонецЕсли;
	КонецЦикла;
	Для Каждого РасходКУдалению Из РасходыКУдалению Цикл
		РасходыУСНкОплате.Удалить(РасходКУдалению);
	КонецЦикла;
	
	// Подготовим таблицу зачтенных авансов.
	ТаблицаЗачтенныхАвансов = ТаблицаРасчетовСЗачетомАвансов.Скопировать(
		Новый Структура("ЭтоЗачетАванса", Истина));
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ТаблицаЗачтенныхАвансов.Колонки.Добавить("РасходыУСНВал", ОписаниеТипаСуммы);
	ТаблицаЗачтенныхАвансов.Колонки.Добавить("РасходыУСНРуб", ОписаниеТипаСуммы);
	ОстаткиРасходовУСН = РасходыУСНкОплате.Скопировать(, "ИФО,КФО,КПС,Подразделение,Контрагент,Договор,СчетРасчетов,Валюта,
		|СуммаВал, СуммаРуб, СуммаНДСВал, СуммаНДСРуб, СуммаНеУчитываетсяНУРуб, СуммаЕНВДРуб");
	ОстаткиРасходовУСН.Свернуть("ИФО,КФО,КПС,Подразделение,Контрагент,Договор,СчетРасчетов,Валюта",
		"СуммаВал, СуммаРуб, СуммаНДСВал, СуммаНДСРуб, СуммаНеУчитываетсяНУРуб, СуммаЕНВДРуб");
	Для Каждого СтрокаОстаткиРасходовУСН Из ОстаткиРасходовУСН Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("СчетРасчетов", СтрокаОстаткиРасходовУСН.СчетРасчетов);
		Отбор.Вставить("Контрагент",   СтрокаОстаткиРасходовУСН.Контрагент);
		Отбор.Вставить("КФО", СтрокаОстаткиРасходовУСН.КФО);
		Если ЗначениеЗаполнено(СтрокаОстаткиРасходовУСН.Договор)
		   И БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(СтрокаОстаткиРасходовУСН.СчетРасчетов) Тогда
			Отбор.Вставить("Договор", СтрокаОстаткиРасходовУСН.Договор);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", СтрокаОстаткиРасходовУСН.ИФО);
		КонецЕсли;
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаОстаткиРасходовУСН.СчетРасчетов);
		Если СвойстваСчетаРасчетов.УчетПоКПС И ЗначениеЗаполнено(СтрокаОстаткиРасходовУСН.КПС) Тогда
			Отбор.Вставить("КПС", СтрокаОстаткиРасходовУСН.КПС);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", СтрокаОстаткиРасходовУСН.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", СтрокаОстаткиРасходовУСН.Валюта);
		КонецЕсли;
		
		НайденныеСтроки = ТаблицаЗачтенныхАвансов.НайтиСтроки(Отбор);
		
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(
			СтрокаОстаткиРасходовУСН.СуммаВал,
			НайденныеСтроки, "РасходыУСНВал", "СуммаРасчетов", Ложь);
		
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(
			СтрокаОстаткиРасходовУСН.СуммаРуб + СтрокаОстаткиРасходовУСН.СуммаНДСРуб + СтрокаОстаткиРасходовУСН.СуммаНеУчитываетсяНУРуб + СтрокаОстаткиРасходовУСН.СуммаЕНВДРуб,
			НайденныеСтроки, "РасходыУСНРуб", "СуммаРубПоКурсуАванса", Ложь);
			
	КонецЦикла;
	
	// Заполним таблицу оплаченных расходов.
	Для Каждого ЗачтенныйАванс Из ТаблицаЗачтенныхАвансов Цикл
		
		ОплаченныеРасходыУСН = ОплаченныеРасходыУСНЗачетАванса(
			ЗачтенныйАванс, РасходыУСНкОплате, Реквизиты);
		
		Для Каждого РасходУСН Из ОплаченныеРасходыУСН Цикл
			
			Если РасходУСН.ОплаченоСуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,Контрагент,Договор,ДокументРасчетов,Валюта,
				|СчетУчетаУСН,РасходыУСН,ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3");
			
			НоваяСтрока.Количество              = РасходУСН.ОплаченоКоличество;
			НоваяСтрока.СуммаВал                = РасходУСН.ОплаченоСуммаВал;
			НоваяСтрока.СуммаРуб                = РасходУСН.ОплаченоСуммаРуб;
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
			НоваяСтрока.СуммаЕНВДРуб            = РасходУСН.ОплаченоСуммаЕНВДРуб;
			НоваяСтрока.СуммаНДСРуб             = РасходУСН.ОплаченоСуммаНДСРуб;
			
			НоваяСтрока.КорСчетУСН = СчетУчетаОплаченныхРасходовУСН(
				НоваяСтрока.СчетУчетаУСН, НоваяСтрока.РасходыУСН, Реквизиты);
			
			Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДокументамРасчетов(ЗачтенныйАванс.СчетАвансов) Тогда
				НоваяСтрока.ДокументОплаты = ЗачтенныйАванс.ДопСубконтоАвансов;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ТаблицаОплатаПоставщикуУСН(ТаблицаРасчетовСПогашениемЗадолженности, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД",                   УчетнаяПолитика.ПлательщикЕНВД);
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);

	// Отберем документы расчетов (партии поступления расходов УСН), оплаченные документом.
	ТаблицаОплат = ТаблицаРасчетовСПогашениемЗадолженности.СкопироватьКолонки();
	Для Каждого СтрокаРасчетов Из ТаблицаРасчетовСПогашениемЗадолженности Цикл
		Если НЕ СтрокаРасчетов.ЭтоАванс И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаРасчетов.КФО) Тогда
			НоваяОплата = ТаблицаОплат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяОплата, СтрокаРасчетов);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаОплат.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	// Получим остатки неоплаченных расходов УСН по оплаченным документам расчетов.
	СчетаРасходовКОплате = БухгалтерскийУчет.СписокСчетов(
		"У01.О,У01.ВО,У04.О,У08.ПО,У08.О,У10.О,У10.СО,У10.ОР,У15.О,У15.СО,У20.О,У41.О,У41.СО,У41.ОР,У70.О");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("СчетРасчетов", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("СчетРасчетов")));
	ОтборРасходов.Вставить("Контрагент", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("Контрагент")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаОплат.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаРасходовКОплате, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Заполним таблицу оплаченных расходов УСН.
	Для Каждого Оплата Из ТаблицаОплат Цикл
		
		ОплаченныеРасходыУСН = ОплаченныеРасходыУСНПогашениеЗадолженности(
			Оплата, ОстаткиРасходовУСН, Реквизиты);
		
		Для Каждого РасходУСН Из ОплаченныеРасходыУСН Цикл
			
			Если РасходУСН.ОплаченоСуммаВал = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Оплата, "ИмяСписка,СинонимСписка,НомерСтроки");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,СчетУчетаУСН,РасходыУСН");
			
			СвойстваСчетаУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			НоваяСтрока.Количество              = РасходУСН.ОплаченоКоличество;
			НоваяСтрока.СуммаВал                = РасходУСН.ОплаченоСуммаВал;
			НоваяСтрока.СуммаРуб                = РасходУСН.ОплаченоСуммаРуб;
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
			НоваяСтрока.СуммаЕНВДРуб            = РасходУСН.ОплаченоСуммаЕНВДРуб;
			НоваяСтрока.СуммаНДСРуб             = РасходУСН.ОплаченоСуммаНДСРуб;
			
			НоваяСтрока.КорСчетУСН = СчетУчетаОплаченныхРасходовУСН(
				НоваяСтрока.СчетУчетаУСН, НоваяСтрока.РасходыУСН, Реквизиты);
			
			НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
			
			// Спишем рублевые остатки расходов (УСН), учтенные по курсу на дату документа поступления (партии).
			Если РасходУСН.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
				
				Коэффициент = ?(РасходУСН.СуммаВал = 0, 0, РасходУСН.ОплаченоСуммаВал / РасходУСН.СуммаВал);
				
				Если Коэффициент * РасходУСН.СуммаРуб                <> РасходУСН.ОплаченоСуммаРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаНДСРуб             <> РасходУСН.ОплаченоСуммаНДСРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаЕНВДРуб            <> РасходУСН.ОплаченоСуммаЕНВДРуб
				 ИЛИ Коэффициент * РасходУСН.СуммаНеУчитываетсяНУРуб <> РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб Тогда
					
					КорректировкаСуммРуб = ТаблицаОплаченныхРасходовУСН.Добавить();
					ЗаполнитьЗначенияСвойств(КорректировкаСуммРуб, НоваяСтрока,
						"ИмяСписка,СинонимСписка,НомерСтроки,
						|ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,СчетУчетаУСН,РасходыУСН,
						|ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3");
					
					КорректировкаСуммРуб.СуммаРуб                = Коэффициент * РасходУСН.СуммаРуб                - РасходУСН.ОплаченоСуммаРуб;
					КорректировкаСуммРуб.СуммаНДСРуб             = Коэффициент * РасходУСН.СуммаНДСРуб             - РасходУСН.ОплаченоСуммаНДСРуб;
					КорректировкаСуммРуб.СуммаЕНВДРуб            = Коэффициент * РасходУСН.СуммаЕНВДРуб            - РасходУСН.ОплаченоСуммаЕНВДРуб;
					КорректировкаСуммРуб.СуммаНеУчитываетсяНУРуб = Коэффициент * РасходУСН.СуммаНеУчитываетсяНУРуб - РасходУСН.ОплаченоСуммаНеУчитываетсяНУРуб;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ОплаченныеРасходыУСНЗачетАванса(Оплата, ТаблицаРасходовУСН, Реквизиты)
	
	Отбор = Новый Структура;
	Отбор.Вставить("КФО", Оплата.КФО);
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		Отбор.Вставить("ИФО", Оплата.ИФО);
	КонецЕсли;
	
	СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Оплата.СчетРасчетов);
	Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
		Отбор.Вставить("Подразделение", Оплата.Подразделение);
	КонецЕсли;
	Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
		Отбор.Вставить("Валюта", Оплата.Валюта);
	КонецЕсли;
	
	Отбор.Вставить("СчетРасчетов", Оплата.СчетРасчетов);
	Отбор.Вставить("Контрагент",   Оплата.Контрагент);
	
	Если ЗначениеЗаполнено(Оплата.Договор)
	   И БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(Оплата.СчетРасчетов) Тогда
		Отбор.Вставить("Договор", Оплата.Договор);
	КонецЕсли;
	
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ОплаченныеРасходыУСН = ТаблицаРасходовУСН.Скопировать(Отбор);
	// Сворачиваем по всем колонкам таблицы УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН().
	// Избавляемся от строк с отрицательными суммами расходов, например, удержание НДФЛ.
	ОплаченныеРасходыУСН.Свернуть("ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,
	|СчетУчетаУСН,ВидРасхода,ЭлементРасхода,Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,ОтражениеВУСН,
	|СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,РасходыУСН,
	|ВидСубконтоРасходов2,СубконтоРасходов2,ВидСубконтоРасходов3,СубконтоРасходов3",
		"Количество,СуммаВал,СуммаРуб,СуммаНДСВал,СуммаНДСРуб,СуммаНеУчитываетсяНУРуб,СуммаЕНВДРуб");
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоКоличество",              ОписаниеТипаКоличества);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаВал",                ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаРуб",                ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаЕНВДРуб",            ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНДСРуб",             ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовВал",                ОписаниеТипаСуммы);
	Для Каждого СтрокаРасходовУСН Из ОплаченныеРасходыУСН Цикл
		
		Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
			СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасходовУСН.СчетУчетаУСН);
			Если СвойстваСчетаУСН.УчетПоКПС И (СтрокаРасходовУСН.КПС <> Оплата.КПС) Тогда
				Продолжить; // Пропускаем расходы по другим КПС.
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаРасходовУСН.СуммаВал > 0 Тогда
			// Распределять оплату будем только на строки с положительной суммой расходов УСН.
			СтрокаРасходовУСН.ВсегоРасходовВал = СтрокаРасходовУСН.СуммаВал + СтрокаРасходовУСН.СуммаНДСВал;
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаОплатыВал = Мин(Оплата.СуммаРасчетов, Оплата.РасходыУСНВал);
	СуммаОплатыРуб = Мин(Оплата.СуммаРубПоКурсуАванса, Оплата.РасходыУСНРуб);
	РаспределитьСуммуОплатыРасходовУСН(СуммаОплатыВал, СуммаОплатыРуб, ОплаченныеРасходыУСН);
	
	Возврат ОплаченныеРасходыУСН;
	
КонецФункции

Функция ОплаченныеРасходыУСНПогашениеЗадолженности(Оплата, ТаблицаРасходовУСН, Реквизиты)
	
	Отбор = Новый Структура;
	Отбор.Вставить("КФО", Оплата.КФО);
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		Отбор.Вставить("ИФО", Оплата.ИФО);
	КонецЕсли;
	
	СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Оплата.СчетРасчетов);
	Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
		Отбор.Вставить("Подразделение", Оплата.Подразделение);
	КонецЕсли;
	Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
		Отбор.Вставить("Валюта", Оплата.Валюта);
	КонецЕсли;
	
	Отбор.Вставить("СчетРасчетов", Оплата.СчетРасчетов);
	Отбор.Вставить("Контрагент",   Оплата.Контрагент);
	
	Если ЗначениеЗаполнено(Оплата.Договор)
	   И БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(Оплата.СчетРасчетов) Тогда
		Отбор.Вставить("Договор", Оплата.Договор);
	КонецЕсли;
	
	ВедетсяУчетПоДокументамРасчетов =
		(Оплата.ВидДопСубконтоРасчетов = ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов)
		И ЗначениеЗаполнено(Оплата.ДопСубконтоРасчетов);
	Если ВедетсяУчетПоДокументамРасчетов Тогда
		Отбор.Вставить("ДокументРасчетов", Оплата.ДопСубконтоРасчетов);
	КонецЕсли;
	
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ОплаченныеРасходыУСН = ТаблицаРасходовУСН.Скопировать(Отбор);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоКоличество",              ОписаниеТипаКоличества);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаВал",                ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаРуб",                ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаЕНВДРуб",            ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ОплаченоСуммаНДСРуб",             ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовВал",                ОписаниеТипаСуммы);
	ОплаченныеРасходыУСН.Колонки.Добавить("ВсегоРасходовРуб",                ОписаниеТипаСуммы);
	Для Каждого СтрокаРасходовУСН Из ОплаченныеРасходыУСН Цикл
		
		Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
			СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасходовУСН.СчетУчетаУСН);
			Если СвойстваСчетаУСН.УчетПоКПС И (СтрокаРасходовУСН.КПС <> Оплата.КПС) Тогда
				Продолжить; // Пропускаем расходы по другим КПС.
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаРасходовУСН.СуммаВал > 0 Тогда
			// Распределять оплату будем только на строки с положительной суммой расходов УСН.
			СтрокаРасходовУСН.ВсегоРасходовВал = СтрокаРасходовУСН.СуммаВал;
			СтрокаРасходовУСН.ВсегоРасходовРуб = СтрокаРасходовУСН.СуммаРуб +
				СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб + СтрокаРасходовУСН.СуммаЕНВДРуб + СтрокаРасходовУСН.СуммаНДСРуб;
		КонецЕсли;
		
	КонецЦикла;
	
	ОсталосьПогаситьВал = Мин(Оплата.СуммаРасчетов, ОплаченныеРасходыУСН.Итог("ВсегоРасходовВал"));
	Если Оплата.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
		// Если расчеты в рублях, сумма оплаченных расходов не может превышать сумму расходов,
		// признанных первоначально при поступлении расходов.
		ОсталосьПогаситьРуб = Мин(Оплата.СуммаРуб, ОплаченныеРасходыУСН.Итог("ВсегоРасходовРуб"));
	Иначе
		// Если расчеты в валюте, сумма расходов в рублях может быть как больше, так и меньше суммы расходов,
		// признанных первоначально при поступлении расходов из-за разницы курсов.
		Коэффициент = ?(Оплата.СуммаРасчетов = 0, 0, ОсталосьПогаситьВал / Оплата.СуммаРасчетов);
		ОсталосьПогаситьРуб = Коэффициент * Оплата.СуммаРуб;
	КонецЕсли;
	
	Если ВедетсяУчетПоДокументамРасчетов Тогда
		
		// В таблице ОплаченныеРасходыУСН отобраны расходы УСН по оплаченному расчетному документу.
		// Просто распределим сумму оплаты на все расходы УСН по данному расчетному документу.
		РаспределитьСуммуОплатыРасходовУСН(ОсталосьПогаситьВал, ОсталосьПогаситьРуб, ОплаченныеРасходыУСН);
		
	Иначе
		
		// В таблице ОплаченныеРасходыУСН отобраны расходы УСН по нескольким расчетным документам.
		// Выстраиваем их по FIFO и последовательно распределяем сумму оплаты по каждому расчетному документу.
		ДокументыРасчетов = ОплаченныеРасходыУСН.Скопировать(, "ДокументРасчетов,ДатаДокументаРасчетов,ВсегоРасходовВал,ВсегоРасходовРуб");
		ДокументыРасчетов.Свернуть("ДокументРасчетов,ДатаДокументаРасчетов", "ВсегоРасходовВал,ВсегоРасходовРуб");
		ДокументыРасчетов.Сортировать("ДатаДокументаРасчетов");
		
		Для Каждого ДокументРасчетов Из ДокументыРасчетов Цикл
			
			ОтборПоДокументуРасчетов = Новый Структура("ДокументРасчетов", ДокументРасчетов.ДокументРасчетов);
			ОплаченныеРасходыПоДокументуРасчетовУСН = ОплаченныеРасходыУСН.НайтиСтроки(ОтборПоДокументуРасчетов);
			
			ПогаситьВал = Мин(ОсталосьПогаситьВал, ДокументРасчетов.ВсегоРасходовВал);
			Если Оплата.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
				ПогаситьРуб = Мин(ОсталосьПогаситьРуб, ДокументРасчетов.ВсегоРасходовРуб);
			Иначе
				Коэффициент = ?(ОсталосьПогаситьВал = 0, 0, ПогаситьВал / ОсталосьПогаситьВал);
				ПогаситьРуб = Коэффициент * ОсталосьПогаситьРуб;
			КонецЕсли;
			
			РаспределитьСуммуОплатыРасходовУСН(ПогаситьВал, ПогаситьРуб, ОплаченныеРасходыПоДокументуРасчетовУСН);
			
			ОсталосьПогаситьВал = ОсталосьПогаситьВал - ПогаситьВал;
			ОсталосьПогаситьРуб = ОсталосьПогаситьРуб - ПогаситьРуб;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ОплаченныеРасходыУСН;
	
КонецФункции

Процедура РаспределитьСуммуОплатыРасходовУСН(СуммаОплатыВал, СуммаОплатыРуб, ОплаченныеРасходыУСН)
	
	Если СуммаОплатыВал < 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СуммаОплатыВал,
		ОплаченныеРасходыУСН, "ОплаченоСуммаВал", "ВсегоРасходовВал");
	
	ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СуммаОплатыРуб,
		ОплаченныеРасходыУСН, "ОплаченоСуммаРуб", "ВсегоРасходовВал");
	
	Для Каждого СтрокаРасходовУСН Из ОплаченныеРасходыУСН Цикл
		
		Если СтрокаРасходовУСН.СуммаВал = 0
		 ИЛИ СтрокаРасходовУСН.ОплаченоСуммаВал = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Рассчитаем долю оплаченного количества, сумм в рублях и НДС.
		ДоляОплатыРасходов = ?(СтрокаРасходовУСН.ОплаченоСуммаВал < СтрокаРасходовУСН.ВсегоРасходовВал,
			СтрокаРасходовУСН.ОплаченоСуммаВал / СтрокаРасходовУСН.ВсегоРасходовВал, 1);
			
		СтрокаРасходовУСН.ОплаченоКоличество = ДоляОплатыРасходов * СтрокаРасходовУСН.Количество;
		
		// Распределим сумму оплаты в рублях по компонентам.
		БазаРаспределения = Новый Массив;
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаРуб);
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб);
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаЕНВДРуб);
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаНДСРуб);
		
		РаспределениеСуммыОплатыРуб = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СтрокаРасходовУСН.ОплаченоСуммаРуб, БазаРаспределения);
		Если РаспределениеСуммыОплатыРуб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРасходовУСН.ОплаченоСуммаРуб                = РаспределениеСуммыОплатыРуб[0];
		СтрокаРасходовУСН.ОплаченоСуммаНеУчитываетсяНУРуб = РаспределениеСуммыОплатыРуб[1];
		СтрокаРасходовУСН.ОплаченоСуммаЕНВДРуб            = РаспределениеСуммыОплатыРуб[2];
		СтрокаРасходовУСН.ОплаченоСуммаНДСРуб             = РаспределениеСуммыОплатыРуб[3];
		
	КонецЦикла;
	
КонецПроцедуры

Функция СчетУчетаОплаченныхРасходовУСН(СчетУчетаУСН, РасходУСН, Реквизиты)
	
	КодСчетаУчетаУСН = Строка(СчетУчетаУСН);
	
	// ОС: не Оплачены.
	Если Найти(КодСчетаУчетаУСН, "У01.О") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.П"); // Признать расходы.
		
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У01.ВО") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.В"); // Признать расходы.
		
	// НМА: не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У04.О") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У04.П"); // Признать расходы.
		
	// Кап. вложения: имущество не Принято к учету, расходы не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У08.ПО") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У08.П"); // Принять к учету.
		
	// Кап. вложения в неамортизируемое имущество: расходы не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У08.О") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99"); // Включаем расходы в КУДиР.
		
	// Материалы: не Списаны, не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У10.СО") Тогда
		
		Если Реквизиты.МатериалыПоОплате Тогда
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Распределяются Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.Р"); // Распределить.
			Иначе
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.СП"); // Не Списаны, расходы Признаны.
			КонецЕсли;
			
		Иначе
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.С"); // Списать.
		КонецЕсли;
		
	// Материалы: не Оплачены, не Распределены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У10.ОР") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.Р"); // Распределить.
		
	// Товары: не Списаны, не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У41.СО") Тогда
		
		Если Реквизиты.ТоварыПоОплате Тогда
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Распределяются Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.Р"); // Распределить.
			Иначе
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.СП"); // Не Списаны, расходы Признаны.
			КонецЕсли;
			
		Иначе
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.С"); // Списать.
		КонецЕсли;
		
	// Товары: не Оплачены, не Распределены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У41.ОР") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.Р"); // Распределить.
		
	// Вложения в материальные запасы: не Списаны, не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У15.СО") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У15.С"); // Списать (принять к учету).
		
	// Доп. расходы: не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У15.О") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99"); // Включаем расходы в КУДиР.
		
	// Материалы, товары, услуги и пр.: не Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У10.О")
	      ИЛИ Найти(КодСчетаУчетаУСН, "У20.О")
	      ИЛИ Найти(КодСчетаУчетаУСН, "У41.О")
	      ИЛИ Найти(КодСчетаУчетаУСН, "У70.О") Тогда
		
		Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Распределяются Тогда
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду(Лев(КодСчетаУчетаУСН, 4)+"Р"); // Распределить.
		Иначе
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99"); // Включаем расходы в КУДиР.
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Начисление обязательств за счет резерва

Функция ПустаяТаблицаПриемкаТоваровРаботУслугУСН() Экспорт
	
	ОписаниеТипаСуммы       = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Приемка товаров, работ, услуг.
	ПустаяТаблица.Колонки.Добавить("ВнеоборотныйАктив", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ПустаяТаблица.Колонки.Добавить("Номенклатура",      Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("Содержание",        Новый ОписаниеТипов("Строка"));
	ПустаяТаблица.Колонки.Добавить("Количество",        ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",          ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаВал",          ОписаниеТипаСуммы);
	
	Возврат ПустаяТаблица;
	
КонецФункции

Функция ПодготовитьТаблицыПриемкаТоваровРаботУслугУСН(ТаблицыПоступления, Документ, Параметры = Неопределено, Отказ) Экспорт
	
	ТаблицыПриемкаТоваровРаботУслуг = Новый Структура;
	ТаблицыПриемкаТоваровРаботУслуг.Вставить("ТоварыРаботыУслуги", ПустаяТаблицаПриемкаТоваровРаботУслугУСН());
	ТаблицыПриемкаТоваровРаботУслуг.Вставить("ДокументыПоступления", Новый ТаблицаЗначений);
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицыПриемкаТоваровРаботУслуг;
	КонецЕсли;
	
	// Материальные запасы.
	Если ТаблицыПоступления.Свойство("ПоступлениеМатериальныхЗапасов")
	   И ТаблицыПоступления.ПоступлениеМатериальныхЗапасов.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеМатериальныхЗапасов Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицыПриемкаТоваровРаботУслуг.ТоварыРаботыУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Услуги, работы.
	Если ТаблицыПоступления.Свойство("ПоступлениеУслугРабот")
	   И ТаблицыПоступления.ПоступлениеУслугРабот.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеУслугРабот Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицыПриемкаТоваровРаботУслуг.ТоварыРаботыУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Услуги, работы.
	Если ТаблицыПоступления.Свойство("ПоступлениеОсновныхСредств")
	   И ТаблицыПоступления.ПоступлениеОсновныхСредств.Количество() > 0 Тогда
		
		Для Каждого СтрокаДокумента Из ТаблицыПоступления.ПоступлениеОсновныхСредств Цикл
			
			Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаДокумента.КФО) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицыПриемкаТоваровРаботУслуг.ТоварыРаботыУслуги.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
			
		КонецЦикла;
		
	КонецЕсли;
	
	МетаданныеДокумента = Документ.Метаданные();
	Если ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("ДокументыПоступления", МетаданныеДокумента) Тогда
		ТаблицыПриемкаТоваровРаботУслуг.ДокументыПоступления = Документ.ДокументыПоступления.Выгрузить();
	КонецЕсли;
	
	Возврат ТаблицыПриемкаТоваровРаботУслуг;
	
КонецФункции

Функция ПустаяТаблицаНачислениеОбязательствЗаСчетРезерваУСН() Экспорт

	ОписаниеТипаСуммы       = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТипаСубконто    = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Свойства расходов для формирования элементов справочника "Расходы УСН".
	МетаданныеРасходовУСН  = Метаданные.Справочники.РасходыУСН.Реквизиты;
	ПустаяТаблица.Колонки.Добавить("Партия",               МетаданныеРасходовУСН.Партия.Тип);
	ПустаяТаблица.Колонки.Добавить("ИмяСпискаДокумента",   МетаданныеРасходовУСН.ИмяСпискаДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("НомерСтрокиДокумента", МетаданныеРасходовУСН.НомерСтрокиДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидРасхода",           МетаданныеРасходовУСН.ВидРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ЭлементРасхода",       МетаданныеРасходовУСН.ЭлементРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН",        МетаданныеРасходовУСН.ОтражениеВУСН.Тип);
	
	// Аналитика учета расчетов с контрагентами.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("Контрагент",    Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПустаяТаблица.Колонки.Добавить("Договор",       Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("Валюта",        Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Счет и аналитика учета расходов УСН к погашению (Кт).
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",    Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов2",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов2",     ОписаниеТипаСубконто);
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов3",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов3",     ОписаниеТипаСубконто);
	
	// Счет и аналитика учета расходов УСН к оплате (Дт).
	ПустаяТаблица.Колонки.Добавить("КорРасходыУСН", Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	
	// Содержание проводки.
	ПустаяТаблица.Колонки.Добавить("Содержание", Новый ОписаниеТипов("Строка"));
	
	// Количество, сумма.
	ПустаяТаблица.Колонки.Добавить("Количество",              ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте документа.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСВал",             ОписаниеТипаСуммы); // Сумма НДС в валюте документа.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаНачислениеОбязательствЗаСчетРезерваУСН(ТаблицыПриемкаТоваровРаботУслуг, Реквизиты, Отказ) Экспорт
	
	ТаблицаНачислениеОбязательствЗаСчетРезерваУСН = ПустаяТаблицаНачислениеОбязательствЗаСчетРезерваУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаНачислениеОбязательствЗаСчетРезерваУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД",                   УчетнаяПолитика.ПлательщикЕНВД);
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
	
	ТоварыРаботыУслуги = ТаблицыПриемкаТоваровРаботУслуг.ТоварыРаботыУслуги;
	ДокументыПоступления = ТаблицыПриемкаТоваровРаботУслуг.ДокументыПоступления;
	
	Если ТоварыРаботыУслуги.Количество() = 0 Тогда
		Возврат ТаблицаНачислениеОбязательствЗаСчетРезерваУСН;
	КонецЕсли;
	
	// Получим остатки расходов УСН по принятым позициям Номенклатуры.
	СчетаРасходовУСН = БухгалтерскийУчет.СписокСчетов(
		"У08.ПО,У10.СО,У15.СО,У20.О,У41.СО");
	
	ОтборРасходов = Новый Структура;
	
	ВидыРасходовУСН = Новый Массив;
	ВидыРасходовУСН.Добавить(Перечисления.ВидыРасходовУСН.КапВложения);
	ВидыРасходовУСН.Добавить(Перечисления.ВидыРасходовУСН.МатериальныеЗапасы);
	ВидыРасходовУСН.Добавить(Перечисления.ВидыРасходовУСН.Услуги);
	ВидыРасходовУСН.Добавить(Перечисления.ВидыРасходовУСН.ДопРасходы);
	ОтборРасходов.Вставить("ВидРасхода", ВидыРасходовУСН);
	
	ОтборРасходов.Вставить("СчетРасчетов", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТоварыРаботыУслуги.ВыгрузитьКолонку("СчетРасчетов")));
	ОтборРасходов.Вставить("Контрагент", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТоварыРаботыУслуги.ВыгрузитьКолонку("Контрагент")));
	ОтборРасходов.Вставить("Договор", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТоварыРаботыУслуги.ВыгрузитьКолонку("Договор")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТоварыРаботыУслуги.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТоварыРаботыУслуги.ВыгрузитьКолонку("КФО")));
	
	Если ДокументыПоступления.Количество() > 0 Тогда // Акт приемки ф.0510452.
		ОтборРасходов.Вставить("ДокументРасчетов", ДокументыПоступления.ВыгрузитьКолонку("ДокументОснование"));
	КонецЕсли;
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаРасходовУСН, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Заполним таблицу расходов УСН по принятым позициям Номенклатуры.
	Для Каждого СтрокаПриемкаТоваровРаботУслуг Из ТоварыРаботыУслуги Цикл
		
		РасходыУСНПоПринятымТРУ = РасходыУСНПоПринятымТРУ(
			СтрокаПриемкаТоваровРаботУслуг, ОстаткиРасходовУСН, Реквизиты);
		
		Для Каждого ПринятыеРасходыУСН Из РасходыУСНПоПринятымТРУ Цикл
			
			НоваяСтрока = ТаблицаНачислениеОбязательствЗаСчетРезерваУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПриемкаТоваровРаботУслуг,
				"ИмяСписка,СинонимСписка,НомерСтроки");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПринятыеРасходыУСН, "ВидРасхода,ЭлементРасхода,ОтражениеВУСН,
				|ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,Валюта,СчетУчетаУСН,РасходыУСН");
			
			СвойстваСчетаУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(ПринятыеРасходыУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = ПринятыеРасходыУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = ПринятыеРасходыУСН.СубконтоРасходов3;
			
			// Элементы, по которым учтены расходы УСН в корреспонденции с 401.60.
			НоваяСтрока.КорРасходыУСН = ПринятыеРасходыУСН.РасходыУСН;
			НоваяСтрока.ИмяСпискаДокумента   = СтрокаПриемкаТоваровРаботУслуг.ИмяСписка;
			НоваяСтрока.НомерСтрокиДокумента = СтрокаПриемкаТоваровРаботУслуг.НомерСтроки;
			
			НоваяСтрока.Количество              = ПринятыеРасходыУСН.ПринятоКоличество;
			НоваяСтрока.СуммаВал                = ПринятыеРасходыУСН.ПринятоСуммаВал;
			НоваяСтрока.СуммаРуб                = ПринятыеРасходыУСН.ПринятоСуммаРуб;
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = ПринятыеРасходыУСН.ПринятоСуммаНеУчитываетсяНУРуб;
			НоваяСтрока.СуммаЕНВДРуб            = ПринятыеРасходыУСН.ПринятоСуммаЕНВДРуб;
			НоваяСтрока.СуммаНДСРуб             = ПринятыеРасходыУСН.ПринятоСуммаНДСРуб;
			
			// Содержание операции.
			Если ЗначениеЗаполнено(СтрокаПриемкаТоваровРаботУслуг.ВнеоборотныйАктив) Тогда
				ПредставлениеОбъекта = БухгалтерскиеОперацииПовтИсп.ПредставлениеОбъекта(СтрокаПриемкаТоваровРаботУслуг.ВнеоборотныйАктив);
			Иначе
				ПредставлениеОбъекта = БухгалтерскиеОперацииПовтИсп.ПредставлениеОбъекта(СтрокаПриемкаТоваровРаботУслуг.Номенклатура);
			КонецЕсли;
			НоваяСтрока.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Начисление обязательств за счет резерва: %1'"),
					ПредставлениеОбъекта);
				
		КонецЦикла;
		
	КонецЦикла;
	
	// Формируем новые элементы учета расходов УСН с партией/расчетным документом "Акт приемки", Дт 401.60 Кт 302.00.
	ТаблицаНачислениеОбязательствЗаСчетРезерваУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "Партия");
	ТаблицаНачислениеОбязательствЗаСчетРезерваУСН.ЗаполнитьЗначения(Реквизиты.Ссылка, "ДокументРасчетов");
	ТаблицаНачислениеОбязательствЗаСчетРезерваУСН.Сортировать("ИмяСпискаДокумента,НомерСтрокиДокумента");
	СформироватьЭлементыУчетаРасходовУСН(Реквизиты.Ссылка, ТаблицаНачислениеОбязательствЗаСчетРезерваУСН);
	
	Возврат ТаблицаНачислениеОбязательствЗаСчетРезерваУСН;
	
КонецФункции

Функция РасходыУСНПоПринятымТРУ(ПриемкаТоваровРаботУслуг, ТаблицаРасходовУСН, Реквизиты)
	
	Отбор = Новый Структура;
	Отбор.Вставить("КФО", ПриемкаТоваровРаботУслуг.КФО);
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		Отбор.Вставить("ИФО", ПриемкаТоваровРаботУслуг.ИФО);
	КонецЕсли;
	
	СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(ПриемкаТоваровРаботУслуг.СчетРасчетов);
	Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
		Отбор.Вставить("Подразделение", ПриемкаТоваровРаботУслуг.Подразделение);
	КонецЕсли;
	Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
		Отбор.Вставить("Валюта", ПриемкаТоваровРаботУслуг.Валюта);
	КонецЕсли;
	
	Отбор.Вставить("СчетРасчетов", ПриемкаТоваровРаботУслуг.СчетРасчетов);
	Отбор.Вставить("Контрагент",   ПриемкаТоваровРаботУслуг.Контрагент);
	
	Если ЗначениеЗаполнено(ПриемкаТоваровРаботУслуг.Договор)
	   И БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДоговорам(ПриемкаТоваровРаботУслуг.СчетРасчетов) Тогда
		Отбор.Вставить("Договор", ПриемкаТоваровРаботУслуг.Договор);
	КонецЕсли;
	
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПринятыеРасходыУСН = ТаблицаРасходовУСН.Скопировать(Отбор);
	ПринятыеРасходыУСН.Колонки.Добавить("ПринятоКоличество",              ОписаниеТипаКоличества);
	ПринятыеРасходыУСН.Колонки.Добавить("ПринятоСуммаВал",                ОписаниеТипаСуммы);
	ПринятыеРасходыУСН.Колонки.Добавить("ПринятоСуммаРуб",                ОписаниеТипаСуммы);
	ПринятыеРасходыУСН.Колонки.Добавить("ПринятоСуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
	ПринятыеРасходыУСН.Колонки.Добавить("ПринятоСуммаЕНВДРуб",            ОписаниеТипаСуммы);
	ПринятыеРасходыУСН.Колонки.Добавить("ПринятоСуммаНДСРуб",             ОписаниеТипаСуммы);
	ПринятыеРасходыУСН.Колонки.Добавить("ВсегоРасходовВал",               ОписаниеТипаСуммы);
	ПринятыеРасходыУСН.Колонки.Добавить("ВсегоРасходовРуб",               ОписаниеТипаСуммы);
	Для Каждого СтрокаРасходовУСН Из ПринятыеРасходыУСН Цикл
		
		Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
			СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаРасходовУСН.СчетУчетаУСН);
			Если СвойстваСчетаУСН.УчетПоКПС И (СтрокаРасходовУСН.КПС <> ПриемкаТоваровРаботУслуг.КПС) Тогда
				Продолжить; // Пропускаем расходы по другим КПС.
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаРасходовУСН.СуммаВал > 0 Тогда
			// Распределять оплату будем только на строки с положительной суммой расходов УСН.
			СтрокаРасходовУСН.ВсегоРасходовВал = СтрокаРасходовУСН.СуммаВал;
			СтрокаРасходовУСН.ВсегоРасходовРуб = СтрокаРасходовУСН.СуммаРуб +
				СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб + СтрокаРасходовУСН.СуммаЕНВДРуб + СтрокаРасходовУСН.СуммаНДСРуб;
		КонецЕсли;
		
	КонецЦикла;
	
	//Если Реквизиты.Свойство("Курс") И Реквизиты.Свойство("Кратность") Тогда
	//	КурсРасчетов = ?(Реквизиты.Кратность = 0, 1, Реквизиты.Курс / Реквизиты.Кратность);
	//Иначе
	//	КурсРасчетов = 1;
	//КонецЕсли;
	
	ОсталосьПогаситьВал = Мин(ПриемкаТоваровРаботУслуг.СуммаВал, ПринятыеРасходыУСН.Итог("ВсегоРасходовВал"));
	Если ПриемкаТоваровРаботУслуг.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
		// Если расчеты в рублях, сумма оплаченных расходов не может превышать сумму расходов,
		// признанных первоначально при поступлении расходов.
		ОсталосьПогаситьРуб = Мин(ПриемкаТоваровРаботУслуг.СуммаРуб, ПринятыеРасходыУСН.Итог("ВсегоРасходовРуб"));
	Иначе
		// Если расчеты в валюте, сумма расходов в рублях может быть как больше, так и меньше суммы расходов,
		// признанных первоначально при поступлении расходов из-за разницы курсов.
		Коэффициент = ?(ПриемкаТоваровРаботУслуг.СуммаВал = 0, 0, ОсталосьПогаситьВал / ПриемкаТоваровРаботУслуг.СуммаВал);
		ОсталосьПогаситьРуб = Коэффициент * ПриемкаТоваровРаботУслуг.СуммаРуб;
	КонецЕсли;
	
	// В таблице ПринятыеРасходыУСН отобраны расходы УСН по нескольким расчетным документам.
	// Выстраиваем их по FIFO и последовательно распределяем сумму принято по каждому расчетному документу.
	ДокументыРасчетов = ПринятыеРасходыУСН.Скопировать(, "ДокументРасчетов,ДатаДокументаРасчетов,ВсегоРасходовВал,ВсегоРасходовРуб");
	ДокументыРасчетов.Свернуть("ДокументРасчетов,ДатаДокументаРасчетов", "ВсегоРасходовВал,ВсегоРасходовРуб");
	ДокументыРасчетов.Сортировать("ДатаДокументаРасчетов");
	
	Для Каждого ДокументРасчетов Из ДокументыРасчетов Цикл
		
		ОтборПоДокументуРасчетов = Новый Структура("ДокументРасчетов", ДокументРасчетов.ДокументРасчетов);
		ПринятыеРасходыПоДокументуРасчетовУСН = ПринятыеРасходыУСН.НайтиСтроки(ОтборПоДокументуРасчетов);
		
		ПогаситьВал = Мин(ОсталосьПогаситьВал, ДокументРасчетов.ВсегоРасходовВал);
		Если ПриемкаТоваровРаботУслуг.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
			ПогаситьРуб = Мин(ОсталосьПогаситьРуб, ДокументРасчетов.ВсегоРасходовРуб);
		Иначе
			Коэффициент = ?(ОсталосьПогаситьВал = 0, 0, ПогаситьВал / ОсталосьПогаситьВал);
			ПогаситьРуб = Коэффициент * ОсталосьПогаситьРуб;
		КонецЕсли;
		
		РаспределитьСуммуПринятыхРасходовПоДокументуРасчетовУСН(ПогаситьВал, ПогаситьРуб, ПринятыеРасходыПоДокументуРасчетовУСН);
		
		ОсталосьПогаситьВал = ОсталосьПогаситьВал - ПогаситьВал;
		ОсталосьПогаситьРуб = ОсталосьПогаситьРуб - ПогаситьРуб;
		
	КонецЦикла;
	
	Возврат ПринятыеРасходыУСН;
	
КонецФункции

Процедура РаспределитьСуммуПринятыхРасходовПоДокументуРасчетовУСН(СуммаПринятоВал, СуммаПринятоРуб, ПринятыеРасходыУСН)
	
	Если СуммаПринятоВал < 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СуммаПринятоВал,
		ПринятыеРасходыУСН, "ПринятоСуммаВал", "ВсегоРасходовВал");
	
	ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СуммаПринятоРуб,
		ПринятыеРасходыУСН, "ПринятоСуммаРуб", "ВсегоРасходовВал");
	
	Для Каждого СтрокаРасходовУСН Из ПринятыеРасходыУСН Цикл
		
		Если СтрокаРасходовУСН.СуммаВал = 0
		 ИЛИ СтрокаРасходовУСН.ПринятоСуммаВал = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Рассчитаем долю оплаченного количества, сумм в рублях и НДС.
		ДоляРасходовПринято = ?(СтрокаРасходовУСН.ПринятоСуммаВал < СтрокаРасходовУСН.ВсегоРасходовВал,
			СтрокаРасходовУСН.ПринятоСуммаВал / СтрокаРасходовУСН.ВсегоРасходовВал, 1);
			
		СтрокаРасходовУСН.ПринятоКоличество = ДоляРасходовПринято * СтрокаРасходовУСН.Количество;
		
		// Распределим сумму оплаты в рублях по компонентам.
		БазаРаспределения = Новый Массив;
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаРуб);
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаНеУчитываетсяНУРуб);
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаЕНВДРуб);
		БазаРаспределения.Добавить(СтрокаРасходовУСН.СуммаНДСРуб);
		
		РаспределениеСуммыПринятоРуб = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СтрокаРасходовУСН.ПринятоСуммаРуб, БазаРаспределения);
		Если РаспределениеСуммыПринятоРуб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРасходовУСН.ПринятоСуммаРуб                = РаспределениеСуммыПринятоРуб[0];
		СтрокаРасходовУСН.ПринятоСуммаНеУчитываетсяНУРуб = РаспределениеСуммыПринятоРуб[1];
		СтрокаРасходовУСН.ПринятоСуммаЕНВДРуб            = РаспределениеСуммыПринятоРуб[2];
		СтрокаРасходовУСН.ПринятоСуммаНДСРуб             = РаспределениеСуммыПринятоРуб[3];
		
	КонецЦикла;
	
КонецПроцедуры



// Уплата налогов и сборов УСН

// Подготавливает таблицу расшифровки налогового платежа (для целей УСН).
//
Функция ПодготовитьТаблицуРасшифровкаНалоговогоПлатежаПоДокументу(Документ, Реквизиты = Неопределено, Отказ) Экспорт
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	РасшифровкаПлатежа = Новый ТаблицаЗначений;
	// Идентификация строки.
	РасшифровкаПлатежа.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	РасшифровкаПлатежа.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	РасшифровкаПлатежа.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Признак поступления денежных средств.
	РасшифровкаПлатежа.Колонки.Добавить("ЭтоПоступление", Новый ОписаниеТипов("Булево"));
	// Общие разрезы учета.
	РасшифровкаПлатежа.Колонки.Добавить("ИФО",            Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	РасшифровкаПлатежа.Колонки.Добавить("КФО",            Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	РасшифровкаПлатежа.Колонки.Добавить("КПС",            Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	РасшифровкаПлатежа.Колонки.Добавить("Подразделение",  Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов по налогам и сборам.
	РасшифровкаПлатежа.Колонки.Добавить("СчетРасчетов",   Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	РасшифровкаПлатежа.Колонки.Добавить("ВидНалога",      Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежей"));
	РасшифровкаПлатежа.Колонки.Добавить("Валюта",         Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	// Суммовые показатели операции.
	РасшифровкаПлатежа.Колонки.Добавить("Сумма",          ОписаниеТипаСуммы);
	
	Если Реквизиты = Неопределено Тогда
		Реквизиты = Новый Структура;
	КонецЕсли;
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты, "Дата"));
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, ПериодОстатков) Тогда
		Возврат РасшифровкаПлатежа;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	МетаданныеДокумента = Документ.Метаданные();
	
	Если МетаданныеДокумента.Имя = "ЗаявкаНаКассовыйРасход"
	 ИЛИ МетаданныеДокумента.Имя = "КассовоеВыбытие"
	 ИЛИ МетаданныеДокумента.Имя = "ПлатежноеПоручение" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
			"НомерСтроки,ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,НалогСборПлатеж,Сумма",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""РасшифровкаПлатежа"" КАК ИмяСписка,
		|	""Расшифровка платежа"" КАК СинонимСписка,
		|	РасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
		|	ЛОЖЬ КАК ЭтоПоступление,
		|	РасшифровкаПлатежа.ИФО КАК ИФО,
		|	РасшифровкаПлатежа.КФО КАК КФО,
		|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
		|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
		|	РасшифровкаПлатежа.НалогСборПлатеж.ВидНалогаИлиПлатежа КАК ВидНалога,
		|	РасшифровкаПлатежа.Сумма КАК Сумма
		|ИЗ
		|	ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";     
		
	ИначеЕсли МетаданныеДокумента.Имя = "РСКППеречисление" Тогда   
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ДетализацияПлатежа",
			"НомерСтроки,ИФО,КФО,РазделЛС,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,НалогСборПлатеж,Сумма",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""РасшифровкаПлатежа"" КАК ИмяСписка,
		|	""Расшифровка платежа"" КАК СинонимСписка,
		|	ДетализацияПлатежа.НомерСтроки КАК НомерСтроки,
		|	ЛОЖЬ КАК ЭтоПоступление,
		|	ДетализацияПлатежа.ИФО КАК ИФО, 
		|	ВЫБОР КОГДА ДетализацияПлатежа.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
		|		ТОГДА
		|";
		ПлатежноРасчетныеДокументы.ТекстЗапросаКФОПоКодуПоступленияЕБП(Запрос.Текст, "ДетализацияПлатежа.РазделЛС.КодПоступленияЕБП", "");
		
	    Запрос.Текст = Запрос.Текст + " 
		|		ИНАЧЕ ДетализацияПлатежа.КФО
		|	КОНЕЦ КАК КФО, 
		|	ДетализацияПлатежа.КБКНазначениеПлатежа КАК КПС,
		|	ДетализацияПлатежа.Подразделение КАК Подразделение,
		|	ДетализацияПлатежа.НалогСборПлатеж.ВидНалогаИлиПлатежа КАК ВидНалога,
		|	ДетализацияПлатежа.Сумма КАК Сумма
		|ИЗ
		|	ТаблицаДетализацияПлатежа КАК ДетализацияПлатежа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";   
		
	ИначеЕсли МетаданныеДокумента.Имя = "ЗаявкаНаКассовыйРасходСокращенная" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
			"ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,НалогСборПлатеж,СуммаДокумента",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоПоступление,
		|	РасшифровкаПлатежа.ИФО КАК ИФО,
		|	РасшифровкаПлатежа.КФО КАК КФО,
		|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
		|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
		|	РасшифровкаПлатежа.НалогСборПлатеж.ВидНалогаИлиПлатежа КАК ВидНалога,
		|	РасшифровкаПлатежа.СуммаДокумента КАК Сумма
		|ИЗ
		|	Документ КАК РасшифровкаПлатежа";
		
	ИначеЕсли МетаданныеДокумента.Имя = "СводнаяЗаявкаНаКассовыйРасход" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Документ",
			"ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,ВидНалогаИлиПлатежа,СуммаДокумента",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоПоступление,
		|	РасшифровкаПлатежа.ИФО КАК ИФО,
		|	РасшифровкаПлатежа.КФО КАК КФО,
		|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
		|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
		|	РасшифровкаПлатежа.ВидНалогаИлиПлатежа КАК ВидНалога,
		|	РасшифровкаПлатежа.СуммаДокумента КАК Сумма
		|ИЗ
		|	Документ КАК РасшифровкаПлатежа";
		
	ИначеЕсли МетаданныеДокумента.Имя = "КассовоеПоступление" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "РасшифровкаПлатежа",
			"НомерСтроки,ИФО,КФО,КБКНазначениеПлатежа,КОСГУНазначениеПлатежа,Подразделение,Контрагент,НалогСборПлатеж,Сумма",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""РасшифровкаПлатежа"" КАК ИмяСписка,
		|	""Расшифровка платежа"" КАК СинонимСписка,
		|	РасшифровкаПлатежа.НомерСтроки КАК НомерСтроки,
		|	ИСТИНА КАК ЭтоПоступление,
		|	РасшифровкаПлатежа.ИФО КАК ИФО,
		|	РасшифровкаПлатежа.КФО КАК КФО,
		|	РасшифровкаПлатежа.КБКНазначениеПлатежа КАК КПС,
		|	РасшифровкаПлатежа.Подразделение КАК Подразделение,
		|	РасшифровкаПлатежа.НалогСборПлатеж.ВидНалогаИлиПлатежа КАК ВидНалога,
		|	РасшифровкаПлатежа.Сумма КАК Сумма
		|ИЗ
		|	ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки"; 
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеНаСчет" Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ДетализацияПлатежа",
			"НомерСтроки,ИФО,КФО,КБКНазначениеПлатежа,РазделЛС,КОСГУНазначениеПлатежа,Подразделение,Контрагент,НалогСборПлатеж,Сумма",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""РасшифровкаПлатежа"" КАК ИмяСписка,
		|	""Расшифровка платежа"" КАК СинонимСписка,
		|	ДетализацияПлатежа.НомерСтроки КАК НомерСтроки,
		|	ИСТИНА КАК ЭтоПоступление,
		|	ДетализацияПлатежа.ИФО КАК ИФО,
		|	ДетализацияПлатежа.КБКНазначениеПлатежа КАК КПС,
		|	ДетализацияПлатежа.Подразделение КАК Подразделение,
		|	ДетализацияПлатежа.НалогСборПлатеж.ВидНалогаИлиПлатежа КАК ВидНалога,
		|	ВЫБОР КОГДА ДетализацияПлатежа.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)
		|		ТОГДА
		|";
		ПлатежноРасчетныеДокументы.ТекстЗапросаКФОПоКодуПоступленияЕБП(Запрос.Текст, "ДетализацияПлатежа.РазделЛС.КодПоступленияЕБП", "");

		Запрос.Текст = Запрос.Текст + "
		|		ИНАЧЕ ДетализацияПлатежа.КФО
		|	КОНЕЦ КАК КФО,
		|	ДетализацияПлатежа.Сумма КАК Сумма
		|ИЗ
		|	ТаблицаДетализацияПлатежа КАК ДетализацияПлатежа
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	ИначеЕсли МетаданныеДокумента.Имя = "РаспределениеЕНП" Тогда   
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Налоги",
			"НомерСтроки,ИФО,КФО,КПС,Подразделение,ВидНалогаИлиПлатежа,НалогСборПлатеж,Сумма",
			Документ, Реквизиты);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""Налоги"" КАК ИмяСписка,
		|	""Принадлежность сумм ЕНП"" КАК СинонимСписка,
		|	Налоги.НомерСтроки КАК НомерСтроки,
		|	ЛОЖЬ КАК ЭтоПоступление,
		|	Налоги.ИФО КАК ИФО,
		|	Налоги.КФО КАК КФО,
		|	Налоги.КПС КАК КПС,
		|	Налоги.Подразделение КАК Подразделение,
		|	Налоги.ВидНалогаИлиПлатежа КАК ВидНалога,
		|	Налоги.Сумма КАК Сумма
		|ИЗ
		|	ТаблицаНалоги КАК Налоги
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";     
		
	КонецЕсли;
	
	ДвижениеДенежныхСредств = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ДвижениеДенежныхСредств Цикл
		
		Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(Строка.КФО) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ УчетУСН.ВедетсяУчетРасчетовПоНалогу(Строка.ВидНалога) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		НоваяСтрока.СчетРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРН");
		
		//00-00014281 - добавляем подразделение из шапки
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Подразделение) И ОбщегоНазначения.ЕстьРеквизитОбъекта("Подразделение", МетаданныеДокумента) Тогда
			НоваяСтрока.Подразделение = Документ.Подразделение; 
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ВалютаДокумента", МетаданныеДокумента) Тогда
		РасшифровкаПлатежа.ЗаполнитьЗначения(Документ.ВалютаДокумента, "Валюта");
	Иначе
		РасшифровкаПлатежа.ЗаполнитьЗначения(БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета(), "Валюта");
	КонецЕсли;
	
	Возврат РасшифровкаПлатежа;
	
КонецФункции

// Структура таблицы прочих расчетов УСН.
//
Функция ПустаяТаблицаРасчетыПоНалогамИСборамУСН() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Признак аванса. После погашения задолженности, аванс добавляется в таблицу последней строкой.
	ПустаяТаблица.Колонки.Добавить("ЭтоАванс",      Новый ОписаниеТипов("Булево"));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расчетов УСН по налогам и сборам.
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("ВидНалога",        Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежей"));
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов", ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("Валюта",           Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	// Суммы расчетов.
	ПустаяТаблица.Колонки.Добавить("ОстатокРасчетов",         ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРасчетов",           ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы);
	
	Возврат ПустаяТаблица;

КонецФункции

// Формирует таблицу прочих расчетов УСН по налогам и сборам.
//
Функция ТаблицаРасчетыПоНалогамИСборамУСН(РасшифровкаНалоговогоПлатежа, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасчетов = ПустаяТаблицаРасчетыПоНалогамИСборамУСН();
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты, "Дата"));
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, ПериодОстатков);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаРасчетов;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД",                   УчетнаяПолитика.ПлательщикЕНВД);
	
	// Получим остаток расчетов УСН по налогам и сборам.
	СчетаРасчетовПоНалогам = БухгалтерскийУчет.СчетПоКоду("УРН", ПериодОстатков, Реквизиты.Организация);
	
	ОтборРасчетов = Новый Структура;
	ОтборРасчетов.Вставить("Субконто1", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		РасшифровкаНалоговогоПлатежа.ВыгрузитьКолонку("ВидНалога")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасчетов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			РасшифровкаНалоговогоПлатежа.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасчетов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		РасшифровкаНалоговогоПлатежа.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиРасчетовУСН = ОстаткиПрочихРасчетовУСН(ПериодОстатков, СчетаРасчетовПоНалогам, ОтборРасчетов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасчетовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Погасим задолженность, выделим аванс.
	Для Каждого СтрокаПлатежа Из РасшифровкаНалоговогоПлатежа Цикл
		
		НераспределенныйОстаток = СтрокаПлатежа.Сумма;
		
		Если ОстаткиРасчетовУСН.Количество() > 0 Тогда
		
			Отбор = Новый Структура("КФО,Субконто1",
				СтрокаПлатежа.КФО,
				СтрокаПлатежа.ВидНалога);
			
			СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаПлатежа.СчетРасчетов);
			Если Реквизиты.ИспользоватьУчетПоИФО Тогда
				Отбор.Вставить("ИФО", СтрокаПлатежа.ИФО);
			КонецЕсли;
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				Отбор.Вставить("КПС", СтрокаПлатежа.КПС);
			КонецЕсли;
			Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
				Отбор.Вставить("Подразделение", СтрокаПлатежа.Подразделение);
			КонецЕсли;
			Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
				Отбор.Вставить("Валюта", СтрокаПлатежа.Валюта);
			КонецЕсли;
			
			ОстаткиЗадолженности = ОстаткиРасчетовУСН.НайтиСтроки(Отбор);
			
			// Добавим строки задолженности.
			Знак = ?(СтрокаПлатежа.ЭтоПоступление, +1, -1);
			Для Каждого СтрокаОстатка Из ОстаткиЗадолженности Цикл
				
				Если НераспределенныйОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;
				
				ПогашеннаяСумма = Мин(НераспределенныйОстаток, Знак * СтрокаОстатка.СуммаВал);
				Если ПогашеннаяСумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаРасчетов = ТаблицаРасчетов.Добавить();
				СтрокаРасчетов.ЭтоАванс = Ложь;
				
				ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаОстатка,
					"ИФО,КФО,КПС,Подразделение,Валюта,СчетРасчетов,ДокументРасчетов");
				
				ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаПлатежа,
					"ИмяСписка,СинонимСписка,НомерСтроки,ВидНалога");
				
				СтрокаРасчетов.ОстатокРасчетов = Знак * СтрокаОстатка.СуммаВал;
				СтрокаРасчетов.СуммаРасчетов   = ПогашеннаяСумма;
				
				Если Реквизиты.ИспользоватьВалютныйУчет
				   И СтрокаПлатежа.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
					КоэффициентРуб = ?(СтрокаОстатка.СуммаВал = 0, 1,
						СтрокаОстатка.СуммаРуб + СтрокаОстатка.СуммаНеУчитываетсяНУРуб + СтрокаОстатка.СуммаЕНВДРуб / СтрокаОстатка.СуммаВал);
					ПогашеннаяСуммаРуб = Окр(ПогашеннаяСумма * КоэффициентРуб, 2);
				Иначе
					ПогашеннаяСуммаРуб = ПогашеннаяСумма;
				КонецЕсли;
				
				// Распределим сумму оплаты по компонентам.
				БазаРаспределения = Новый Массив;
				БазаРаспределения.Добавить(СтрокаОстатка.СуммаРуб);
				БазаРаспределения.Добавить(СтрокаОстатка.СуммаНеУчитываетсяНУРуб);
				БазаРаспределения.Добавить(СтрокаОстатка.СуммаЕНВДРуб);
				
				РаспределениеСуммыОплатыРуб = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					ПогашеннаяСуммаРуб, БазаРаспределения);
				Если РаспределениеСуммыОплатыРуб = Неопределено Тогда
					СтрокаРасчетов.СуммаРуб = ПогашеннаяСуммаРуб;
				Иначе
					СтрокаРасчетов.СуммаРуб                = РаспределениеСуммыОплатыРуб[0];
					СтрокаРасчетов.СуммаНеУчитываетсяНУРуб = РаспределениеСуммыОплатыРуб[1];
					СтрокаРасчетов.СуммаЕНВДРуб            = РаспределениеСуммыОплатыРуб[2];
				КонецЕсли;
				
				НераспределенныйОстаток = НераспределенныйОстаток - ПогашеннаяСумма;
				
				СтрокаОстатка.СуммаВал                = СтрокаОстатка.СуммаВал                - Знак * СтрокаРасчетов.СуммаРасчетов;
				СтрокаОстатка.СуммаРуб                = СтрокаОстатка.СуммаРуб                - Знак * СтрокаРасчетов.СуммаРуб;
				СтрокаОстатка.СуммаНеУчитываетсяНУРуб = СтрокаОстатка.СуммаНеУчитываетсяНУРуб - Знак * СтрокаРасчетов.СуммаНеУчитываетсяНУРуб;
				СтрокаОстатка.СуммаЕНВДРуб            = СтрокаОстатка.СуммаЕНВДРуб            - Знак * СтрокаРасчетов.СуммаЕНВДРуб;
				
			КонецЦикла;
			
		КонецЕсли;
		
		// Добавим строку аванса.
		Если НераспределенныйОстаток > 0 Тогда
			
			СтрокаРасчетов = ТаблицаРасчетов.Добавить();
			СтрокаРасчетов.ЭтоАванс = Истина;
			
			ЗаполнитьЗначенияСвойств(СтрокаРасчетов, СтрокаПлатежа,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,Валюта,СчетРасчетов,ВидНалога,Валюта");
			
			СтрокаРасчетов.ДокументРасчетов = Реквизиты.Ссылка;
			
			СтрокаРасчетов.СуммаРасчетов = НераспределенныйОстаток;
			
			Если Реквизиты.ИспользоватьВалютныйУчет
			   И СтрокаПлатежа.Валюта <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
				КоэффициентРуб = ?(Реквизиты.Кратность = 0, Реквизиты.Курс, Реквизиты.Курс / Реквизиты.Кратность);
				СтрокаРасчетов.СуммаРуб = Окр(НераспределенныйОстаток * КоэффициентРуб, 2);
			Иначе
				СтрокаРасчетов.СуммаРуб = НераспределенныйОстаток;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ТаблицаУплатаНалоговИСборовУСН(ТаблицаРасчетыПоНалогамИСборамУСН, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = ПустаяТаблицаОплаченныхРасходовУСН();
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты, "Дата"));
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, ПериодОстатков);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Отберем документы расчетов (партии поступления расходов УСН), оплаченные документом.
	ТаблицаОплат = ТаблицаРасчетыПоНалогамИСборамУСН.СкопироватьКолонки();
	Для Каждого СтрокаРасчетов Из ТаблицаРасчетыПоНалогамИСборамУСН Цикл
		Если НЕ СтрокаРасчетов.ЭтоАванс
		   И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаРасчетов.КФО) Тогда
			НоваяОплата = ТаблицаОплат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяОплата, СтрокаРасчетов);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаОплат.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	// Получим остатки неоплаченных расходов УСН на уплату налогов и сборов.
	СчетаРасходовКОплате = БухгалтерскийУчет.СписокСчетов("У68.О");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("ВидРасхода",   Перечисления.ВидыРасходовУСН.Налоги);
	ОтборРасходов.Вставить("ЭлементРасхода", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("ВидНалога")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаОплат.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОплат.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		УчетРасчетов.ПериодПолученияОстатков(Реквизиты.Ссылка));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаРасходовКОплате, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Заполним таблицу оплаченных расходов УСН.
	Для Каждого Оплата Из ТаблицаОплат Цикл
		
		Если НЕ УчетУСН.ВедетсяУчетРасчетовПоНалогу(Оплата.ВидНалога) Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаОсталосьПогасить = Оплата.СуммаРасчетов;
		Если СуммаОсталосьПогасить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("КФО,СчетРасчетов,ЭлементРасхода",
			Оплата.КФО,
			Оплата.СчетРасчетов,
			Оплата.ВидНалога);
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Оплата.СчетРасчетов);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", Оплата.ИФО);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", Оплата.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", Оплата.Валюта);
		КонецЕсли;
		
		ОстаткиНеоплаченныхРасходов = ОстаткиРасходовУСН.НайтиСтроки(Отбор);
		Для каждого РасходУСН Из ОстаткиНеоплаченныхРасходов Цикл
			
			Если СуммаОсталосьПогасить <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если РасходУСН.СуммаВал <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
				Если СвойстваСчетаУСН.УчетПоКПС И (РасходУСН.КПС <> Оплата.КПС) Тогда
					Продолжить; // Пропускаем расходы по другим КПС.
				КонецЕсли;
			КонецЕсли;
			
			СуммаПогасить = Мин(РасходУСН.СуммаВал, СуммаОсталосьПогасить);
			Коэффициент   = СуммаПогасить / РасходУСН.СуммаВал;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИФО,КФО,КПС,Подразделение,СчетРасчетов,СчетУчетаУСН,Валюта,СчетУчетаУСН,РасходыУСН");
			
			НоваяСтрока.НомерСтроки = ТаблицаОплаченныхРасходовУСН.Количество();
			
			НоваяСтрока.СуммаВал                = Окр(РасходУСН.СуммаВал                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаРуб                = Окр(РасходУСН.СуммаРуб                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = Окр(РасходУСН.СуммаНеУчитываетсяНУРуб * Коэффициент, 2, 1);
			НоваяСтрока.СуммаЕНВДРуб            = Окр(РасходУСН.СуммаЕНВДРуб            * Коэффициент, 2, 1);
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Распределяются Тогда
				НоваяСтрока.КорСчетУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У68.Р");
			Иначе
				НоваяСтрока.КорСчетУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99");
			КонецЕсли;
			
			СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
			
			СуммаОсталосьПогасить = СуммаОсталосьПогасить - СуммаПогасить;
			
			РасходУСН.СуммаВал                = РасходУСН.СуммаВал                - НоваяСтрока.СуммаВал;
			РасходУСН.СуммаРуб                = РасходУСН.СуммаРуб                - НоваяСтрока.СуммаРуб;
			РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб - НоваяСтрока.СуммаНеУчитываетсяНУРуб;
			РасходУСН.СуммаЕНВДРуб            = РасходУСН.СуммаЕНВДРуб            - НоваяСтрока.СуммаЕНВДРуб;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ТаблицаЗачетОплатыНалоговИСборовУСН(ТаблицаПоступлениеРасходовУСН, ТаблицаНачисленийЗаСчетНалогов, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД",                   УчетнаяПолитика.ПлательщикЕНВД);
	
	// Подготовим таблицу расходов к оплате.
	РасходыУСНкОплате = ТаблицаПоступлениеРасходовУСН.Скопировать();
	РасходыКУдалению = Новый Массив;
	Для Каждого РасходУСН Из РасходыУСНкОплате Цикл
		Если РасходУСН.ВидРасхода <> Перечисления.ВидыРасходовУСН.Налоги Тогда
			РасходыКУдалению.Добавить(РасходУСН);
		КонецЕсли;
	КонецЦикла;
	Для Каждого РасходКУдалению Из РасходыКУдалению Цикл
		РасходыУСНкОплате.Удалить(РасходКУдалению);
	КонецЦикла;
	
	Если РасходыУСНкОплате.Количество() = 0 Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	// Получим остаток расчетов УСН по налогам и сборам.
	СчетаРасчетовПоНалогам = БухгалтерскийУчет.СчетПоКоду("УРН", Реквизиты.Дата, Реквизиты.Организация);
	
	ОтборРасчетов = Новый Структура;
	ОтборРасчетов.Вставить("Субконто1", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		РасходыУСНкОплате.ВыгрузитьКолонку("ЭлементРасхода")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасчетов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			РасходыУСНкОплате.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасчетов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		РасходыУСНкОплате.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	ОстаткиОплатыНалогов = ОстаткиПрочихРасчетовУСН(ПериодОстатков, СчетаРасчетовПоНалогам, ОтборРасчетов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиОплатыНалогов, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Сформируем общую таблицу оплат из (1) таблицы начислений за счет налогов
	// и (2) таблицы остатков расчетов УСН по налогам и сборам.
	ТаблицаОплат = ТаблицаНачисленийЗаСчетНалогов.Скопировать();
	Для Каждого Оплата Из ОстаткиОплатыНалогов Цикл
		НоваяСтрока = ТаблицаОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Оплата);
		НоваяСтрока.ВидНалога = Оплата.Субконто1;
	КонецЦикла;
	
	// Заполним таблицу оплаченных расходов УСН.
	Для Каждого Оплата Из ТаблицаОплат Цикл
		
		Если НЕ УчетУСН.ВедетсяУчетРасчетовПоНалогу(Оплата.ВидНалога) Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаОсталосьПогасить = Оплата.СуммаВал;
		Если СуммаОсталосьПогасить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("КФО,СчетРасчетов,ЭлементРасхода",
			Оплата.КФО,
			Оплата.СчетРасчетов,
			Оплата.ВидНалога);
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Оплата.СчетРасчетов);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", Оплата.ИФО);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", Оплата.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", Оплата.Валюта);
		КонецЕсли;
		
		ОстаткиНеоплаченныхРасходов = РасходыУСНкОплате.НайтиСтроки(Отбор);
		Для каждого РасходУСН Из ОстаткиНеоплаченныхРасходов Цикл
			
			Если СуммаОсталосьПогасить <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если РасходУСН.СуммаВал <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
				Если СвойстваСчетаУСН.УчетПоКПС И (РасходУСН.КПС <> Оплата.КПС) Тогда
					Продолжить; // Пропускаем расходы по другим КПС.
				КонецЕсли;
			КонецЕсли;
			
			СуммаПогасить = Мин(РасходУСН.СуммаВал, СуммаОсталосьПогасить);
			Коэффициент   = СуммаПогасить / РасходУСН.СуммаВал;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИмяСписка,СинонимСписка,НомерСтроки,ИФО,КФО,КПС,Подразделение,СчетРасчетов,СчетУчетаУСН,Валюта,СчетУчетаУСН,РасходыУСН");
			
			НоваяСтрока.СуммаВал                = Окр(РасходУСН.СуммаВал                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаРуб                = Окр(РасходУСН.СуммаРуб                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = Окр(РасходУСН.СуммаНеУчитываетсяНУРуб * Коэффициент, 2, 1);
			НоваяСтрока.СуммаЕНВДРуб            = Окр(РасходУСН.СуммаЕНВДРуб            * Коэффициент, 2, 1);
			
			НоваяСтрока.КорСчетУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99");
			
			СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			НоваяСтрока.ДокументОплаты = Оплата.ДокументРасчетов;
			
			СуммаОсталосьПогасить = СуммаОсталосьПогасить - СуммаПогасить;
			
			РасходУСН.СуммаВал                = РасходУСН.СуммаВал                - НоваяСтрока.СуммаВал;
			РасходУСН.СуммаРуб                = РасходУСН.СуммаРуб                - НоваяСтрока.СуммаРуб;
			РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб - НоваяСтрока.СуммаНеУчитываетсяНУРуб;
			РасходУСН.СуммаЕНВДРуб            = РасходУСН.СуммаЕНВДРуб            - НоваяСтрока.СуммаЕНВДРуб;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Распределение ЕНП

// Подготавливает таблицу распределения ЕНП для целей УСН.
//
Функция ПодготовитьТаблицуРаспределениеЕНППоДокументу(Документ, Реквизиты = Неопределено, Отказ) Экспорт
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	РаспределениеЕНП = Новый ТаблицаЗначений;
	// Идентификация строки.
	РаспределениеЕНП.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	РаспределениеЕНП.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	РаспределениеЕНП.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Общие разрезы учета.
	РаспределениеЕНП.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	РаспределениеЕНП.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	РаспределениеЕНП.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	РаспределениеЕНП.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	// Счет и аналитика учета расчетов по налогам и сборам.
	РаспределениеЕНП.Колонки.Добавить("СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	РаспределениеЕНП.Колонки.Добавить("ВидНалога",     Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежей"));
	// Суммовые показатели операции.
	РаспределениеЕНП.Колонки.Добавить("Сумма",         ОписаниеТипаСуммы);
	
	Если Реквизиты = Неопределено Тогда
		Реквизиты = Новый Структура;
	КонецЕсли;
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат РаспределениеЕНП;
	КонецЕсли;
	
	Запрос = Новый Запрос;

	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "Налоги",
		"НомерСтроки,ИФО,КФО,КПС,Подразделение,Счет,ВидНалогаИлиПлатежа,НалогСборПлатеж,Сумма",
		Документ, Реквизиты);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Налоги"" КАК ИмяСписка,
	|	""Принадлежность сумм ЕНП"" КАК СинонимСписка,
	|	Налоги.НомерСтроки КАК НомерСтроки,
	|	Налоги.ИФО КАК ИФО,
	|	Налоги.КФО КАК КФО,
	|	Налоги.КПС КАК КПС,
	|	Налоги.Подразделение КАК Подразделение,
	|	Налоги.Счет КАК СчетРасчетов,
	|	Налоги.ВидНалогаИлиПлатежа КАК ВидНалога,
	|	Налоги.Сумма КАК Сумма
	|ИЗ
	|	ТаблицаНалоги КАК Налоги
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТаблицаНалоги = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка Из ТаблицаНалоги Цикл
		
		Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(Строка.КФО) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Справочники.ВидыНалоговИПлатежей.ОплачиваетсяЧерезЕНП(Строка.ВидНалога, Документ.Организация) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РаспределениеЕНП.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	Возврат РаспределениеЕНП;
	
КонецФункции

Функция ТаблицаОплатаНалоговИСборовЧерезЕНПвУСН(ТаблицаРаспределениеЕНП, Реквизиты, Отказ) Экспорт
	
	ТаблицаОплаченныхРасходовУСН = ПустаяТаблицаОплаченныхРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаОплаченныхРасходовУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Получим остатки неоплаченных расходов УСН на уплату налогов и сборов.
	СчетаРасходовКОплате = БухгалтерскийУчет.СписокСчетов("У68.О");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("ВидРасхода",   Перечисления.ВидыРасходовУСН.Налоги);
	ОтборРасходов.Вставить("ЭлементРасхода", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаРаспределениеЕНП.ВыгрузитьКолонку("ВидНалога")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаРаспределениеЕНП.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаРаспределениеЕНП.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаРасходовКОплате, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "ДокументРасчетов", "ДатаДокументаРасчетов");
	
	// Заполним таблицу оплаченных расходов УСН.
	Для Каждого Оплата Из ТаблицаРаспределениеЕНП Цикл
		
		Если НЕ Справочники.ВидыНалоговИПлатежей.ОплачиваетсяЧерезЕНП(Оплата.ВидНалога, Реквизиты.Организация) Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаОсталосьПогасить = Оплата.Сумма;
		Если СуммаОсталосьПогасить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("КФО,СчетРасчетов,ЭлементРасхода",
			Оплата.КФО,
			Оплата.СчетРасчетов,
			Оплата.ВидНалога);
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Оплата.СчетРасчетов);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", Оплата.ИФО);
		КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаРасчетов.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", Оплата.Подразделение);
		КонецЕсли;
		Если Реквизиты.ИспользоватьВалютныйУчет И СвойстваСчетаРасчетов.Валютный Тогда
			Отбор.Вставить("Валюта", Оплата.Валюта);
		КонецЕсли;
		
		ОстаткиНеоплаченныхРасходов = ОстаткиРасходовУСН.НайтиСтроки(Отбор);
		Для каждого РасходУСН Из ОстаткиНеоплаченныхРасходов Цикл
			
			Если СуммаОсталосьПогасить <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если РасходУСН.СуммаВал <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
				СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
				Если СвойстваСчетаУСН.УчетПоКПС И (РасходУСН.КПС <> Оплата.КПС) Тогда
					Продолжить; // Пропускаем расходы по другим КПС.
				КонецЕсли;
			КонецЕсли;
			
			СуммаПогасить = Мин(РасходУСН.СуммаВал, СуммаОсталосьПогасить);
			Коэффициент   = СуммаПогасить / РасходУСН.СуммаВал;
			
			НоваяСтрока = ТаблицаОплаченныхРасходовУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИФО,КФО,КПС,Подразделение,СчетРасчетов,СчетУчетаУСН,Валюта,СчетУчетаУСН,РасходыУСН");
			
			НоваяСтрока.НомерСтроки = ТаблицаОплаченныхРасходовУСН.Количество();
			
			НоваяСтрока.СуммаВал                = Окр(РасходУСН.СуммаВал                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаРуб                = Окр(РасходУСН.СуммаРуб                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = Окр(РасходУСН.СуммаНеУчитываетсяНУРуб * Коэффициент, 2, 1);
			НоваяСтрока.СуммаЕНВДРуб            = Окр(РасходУСН.СуммаЕНВДРуб            * Коэффициент, 2, 1);
			
			Если РасходУСН.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Распределяются Тогда
				НоваяСтрока.КорСчетУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У68.Р");
			Иначе
				НоваяСтрока.КорСчетУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99");
			КонецЕсли;
			
			СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			НоваяСтрока.ДокументОплаты = Реквизиты.Ссылка;
			
			СуммаОсталосьПогасить = СуммаОсталосьПогасить - СуммаПогасить;
			
			РасходУСН.СуммаВал                = РасходУСН.СуммаВал                - НоваяСтрока.СуммаВал;
			РасходУСН.СуммаРуб                = РасходУСН.СуммаРуб                - НоваяСтрока.СуммаРуб;
			РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб - НоваяСтрока.СуммаНеУчитываетсяНУРуб;
			РасходУСН.СуммаЕНВДРуб            = РасходУСН.СуммаЕНВДРуб            - НоваяСтрока.СуммаЕНВДРуб;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Списание материальных запасов в УСН

Функция ПустаяТаблицаСписаниеМатериальныхЗапасовУСН() Экспорт

	ОписаниеТипаСуммы       = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТипаСубконто    = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расходов УСН по НЕсписанным партиям материальных запасов (Кт).
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",    Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("Партия",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов2",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов2",     ОписаниеТипаСубконто);
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов3",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов3",     ОписаниеТипаСубконто);
	
	// Аналитика учета расходов УСН по списанным партиям материальных запасов (Дт).
	ПустаяТаблица.Колонки.Добавить("ПодразделениеПолучатель", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Количество и стоимость списанных материальных запасов.
	ПустаяТаблица.Колонки.Добавить("Количество",              ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("Валюта",                  Новый ОписаниеТипов("СправочникСсылка.Валюты")); // Валюта расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаСписаниеМатериальныхЗапасовУСН(ТаблицыСписания, Реквизиты, Отказ) Экспорт
	
	ТаблицаСписанныхПартийУСН = ПустаяТаблицаСписаниеМатериальныхЗапасовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаСписанныхПартийУСН;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД",                   УчетнаяПолитика.ПлательщикЕНВД);
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);

	// Отберем партии, списанные документом, для отражения в УСН.
	ТаблицаСписанныхПартий = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов();
	Для Каждого ТаблицаСписанных Из ТаблицыСписания Цикл
		Для Каждого СтрокаСписанных Из ТаблицаСписанных.Значение Цикл
			Если СтрокаСписанных.ВидУчета = "БУ"
			   И УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаСписанных.КФО)
			   И БухгалтерскийУчетПовтИсп.НаСчетеВедетсяПартионныйУчет(СтрокаСписанных.СчетУчета)
			   И НЕ СтрокаСписанных.СчетУчета = БухгалтерскийУчет.СчетПоКоду("02.33")
			   И ЗначениеЗаполнено(СтрокаСписанных.Партия)
			Тогда
				НоваяПартия = ТаблицаСписанныхПартий.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяПартия, СтрокаСписанных);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Получим остатки расходов УСН по несписанным партиям материальных запасов.
	СчетаМатериальныхЗапасовКСписанию = БухгалтерскийУчет.СписокСчетов(
		"У10.С,У10.СО,У10.СП,У41.С,У41.СО,У41.СП");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("Партия", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаСписанныхПартий.ВыгрузитьКолонку("Партия")));
	ОтборРасходов.Вставить("ЭлементРасхода", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаСписанныхПартий.ВыгрузитьКолонку("Номенклатура")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
			ТаблицаСписанныхПартий.ВыгрузитьКолонку("ИФО")));
	КонецЕсли;
	//Если Реквизиты.ИспользоватьУчетПоПодразделениям Тогда
	//	ОтборРасходов.Вставить("Подразделение", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
	//		ТаблицаСписанныхПартий.ВыгрузитьКолонку("Подразделение")));
	//КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаСписанныхПартий.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаМатериальныхЗапасовКСписанию, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "Партия", "ДатаДокументаПартии");
	
	// Заполним таблицу списанных партий материальных запасов для отражения в УСН.
	Для Каждого СписаннаяПартия Из ТаблицаСписанныхПартий Цикл
		
		КоличествоОсталосьПогасить = СписаннаяПартия.Количество;
		Если КоличествоОсталосьПогасить <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("КФО,Партия,ЭлементРасхода",
			СписаннаяПартия.КФО,
			СписаннаяПартия.Партия,
			СписаннаяПартия.Номенклатура);
		
		СвойстваСчетаУчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СписаннаяПартия.СчетУчета);
		Если Реквизиты.ИспользоватьУчетПоИФО Тогда
			Отбор.Вставить("ИФО", СписаннаяПартия.ИФО);
		КонецЕсли;
		//Если СвойстваСчетаРасчетов.УчетПоКПС Тогда
		//	Отбор.Вставить("КПС", Оплата.КПС);
		//КонецЕсли;
		Если Реквизиты.ИспользоватьУчетПоПодразделениям И СвойстваСчетаУчета.УчетПоПодразделениям Тогда
			Отбор.Вставить("Подразделение", СписаннаяПартия.Подразделение);
		КонецЕсли;
		
		ОстаткиРасходовПоСписаннойПартии = ОстаткиРасходовУСН.НайтиСтроки(Отбор);
		Для каждого РасходУСН Из ОстаткиРасходовПоСписаннойПартии Цикл
			
			Если КоличествоОсталосьПогасить <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если РасходУСН.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Количество = Мин(РасходУСН.Количество, КоличествоОсталосьПогасить);
			Коэффициент  = Количество / РасходУСН.Количество;
			
			НоваяСтрока = ТаблицаСписанныхПартийУСН.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СписаннаяПартия,
				"ИмяСписка,СинонимСписка,НомерСтроки,ПодразделениеПолучатель");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИФО,КФО,КПС,Подразделение,СчетУчетаУСН,РасходыУСН,Партия,Валюта");
			
			НоваяСтрока.Количество              = Количество;
			НоваяСтрока.СуммаВал                = Окр(РасходУСН.СуммаВал                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаРуб                = Окр(РасходУСН.СуммаРуб                * Коэффициент, 2, 1);
			НоваяСтрока.СуммаНеУчитываетсяНУРуб = Окр(РасходУСН.СуммаНеУчитываетсяНУРуб * Коэффициент, 2, 1);
			НоваяСтрока.СуммаЕНВДРуб            = Окр(РасходУСН.СуммаЕНВДРуб            * Коэффициент, 2, 1);
			НоваяСтрока.СуммаНДСРуб             = Окр(РасходУСН.СуммаНДСРуб             * Коэффициент, 2, 1);
			
			СвойстваСчетаУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			КоличествоОсталосьПогасить = КоличествоОсталосьПогасить - Количество;
			
			РасходУСН.Количество              = РасходУСН.Количество              - НоваяСтрока.Количество;
			РасходУСН.СуммаВал                = РасходУСН.СуммаВал                - НоваяСтрока.СуммаВал;
			РасходУСН.СуммаРуб                = РасходУСН.СуммаРуб                - НоваяСтрока.СуммаРуб;
			РасходУСН.СуммаНеУчитываетсяНУРуб = РасходУСН.СуммаНеУчитываетсяНУРуб - НоваяСтрока.СуммаНеУчитываетсяНУРуб;
			РасходУСН.СуммаЕНВДРуб            = РасходУСН.СуммаЕНВДРуб            - НоваяСтрока.СуммаЕНВДРуб;
			РасходУСН.СуммаНДСРуб             = РасходУСН.СуммаНДСРуб             - НоваяСтрока.СуммаНДСРуб;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаСписанныхПартийУСН;
	
КонецФункции

Функция СчетУСНСписанныхМатериальныхЗапасов(СчетУчетаМатериальныхЗапасовУСН, ОтражениеВУСН) Экспорт
	
	КодСчетаУчетаУСН = Строка(СчетУчетаМатериальныхЗапасовУСН);
	
	Если ОтражениеВУСН = Перечисления.ОтражениеВУСН.Распределяются Тогда
		
		Если Найти(КодСчетаУчетаУСН, "У10") Тогда // Материалы.
			
			Если Найти(КодСчетаУчетаУСН, "У10.СО") Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.ОР"); // Оплатить, распределить.
			Иначе
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.Р"); // Распределить.
			КонецЕсли;
			
		ИначеЕсли Найти(КодСчетаУчетаУСН, "У41") Тогда // Товары.
			
			Если Найти(КодСчетаУчетаУСН, "У41.СО") Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.ОР"); // Оплатить, распределить.
			Иначе
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.Р"); // Распределить.
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		// Материалы: не Списаны, не Оплачены.
		Если Найти(КодСчетаУчетаУСН, "У10.СО") Тогда
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У10.О"); // Оплатить.
			
		// Товары: не Списаны, не Оплачены.
		ИначеЕсли Найти(КодСчетаУчетаУСН, "У41.СО") Тогда
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У41.О"); // Оплатить.
			
		// Материалы, товары: не Списаны.
		ИначеЕсли Найти(КодСчетаУчетаУСН, "У10.С")
		      ИЛИ Найти(КодСчетаУчетаУСН, "У41.С") Тогда
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99"); // Включаем расходы в КУДиР.
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Списание доп. расходов, включаемых в себестоимость

Функция ПустаяТаблицаСписаниеДопРасходовУСН() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",                   Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",                   Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",                   Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение",         Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета доп. расходов.
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",            Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("Номенклатура",          Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ПустаяТаблица.Колонки.Добавить("Партия",
		ПланыВидовХарактеристик.ВидыСубконто.Партии.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	
	// Суммы доп. расходов к списанию.
	ПустаяТаблица.Колонки.Добавить("Валюта",                  Новый ОписаниеТипов("СправочникСсылка.Валюты")); // Валюта расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма без НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	// Порядок отражения в налоговом учете при УСН.
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаСписаниеДопРасходовУСН(Реквизиты) Экспорт
	
	ТаблицаСписаниеДопРасходов = ПустаяТаблицаСписаниеДопРасходовУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаСписаниеДопРасходов;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД",                   УчетнаяПолитика.ПлательщикЕНВД);
	
	// Параметры учетной политики в части учета расходов УСН.
	Реквизиты.Вставить("ТоварыПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТоварыПоОтгрузке", УчетнаяПолитика.ПорядокПризнанияРасходовПоТоварам =
		Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоФактуРеализации);
	Реквизиты.Вставить("МатериалыПоОплате", УчетнаяПолитика.ПорядокПризнанияМатериальныхРасходов =
		Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ДопРасходыПоОплате", УчетнаяПолитика.ПорядокПризнанияДопРасходов =
		Перечисления.ПорядокПризнанияДопРасходов.ПоОплатеПоставщику);
	Реквизиты.Вставить("ТаможенныеПлатежиПоОплате", УчетнаяПолитика.ПорядокПризнанияТаможенныхПлатежей =
		Перечисления.ПорядокПризнанияТаможенныхПлатежей.ПоОплате);
	Реквизиты.Вставить("НДСПоОплате", УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
		Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетДолейСписания.НомерСтроки,
	|	РасчетДолейСписания.ИдСтроки КАК ИдСтроки,
	|	РасчетДолейСписания.ИФО,
	|	РасчетДолейСписания.КФО,
	|	РасчетДолейСписания.КПС,
	|	РасчетДолейСписания.Подразделение,
	|	РасчетДолейСписания.Номенклатура,
	|	РасчетДолейСписания.Партия
	|ПОМЕСТИТЬ РасчетДолейСписания
	|ИЗ
	|	Документ.СписаниеДопРасходовУСН.РасчетДолейСписания КАК РасчетДолейСписания
	|ГДЕ
	|	РасчетДолейСписания.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДопРасходыУСН.НомерСтроки,
	|	ДопРасходыУСН.ИдСтроки КАК ИдСтроки,
	|	ДопРасходыУСН.СчетУчета,
	|	ДопРасходыУСН.РасходыУСН,
	|	ДопРасходыУСН.Субконто3,
	|	ДопРасходыУСН.Валюта,
	|	ДопРасходыУСН.СписатьНаУСНСуммаВал,
	|	ДопРасходыУСН.СписатьНаУСНСумма,
	|	ДопРасходыУСН.СписатьНаУСНСуммаНДС,
	|	ДопРасходыУСН.СписатьНаУСНСуммаНеУчитываетсяНУ,
	|	ДопРасходыУСН.СписатьНаУСНСуммаЕНВД,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаВал,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСумма,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаНДС,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаНеУчитываетсяНУ,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаЕНВД,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаВал,
	|	ДопРасходыУСН.СписатьНаЕНВДСумма,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаНДС,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаНеУчитываетсяНУ,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаЕНВД
	|ПОМЕСТИТЬ ДопРасходыУСН
	|ИЗ
	|	Документ.СписаниеДопРасходовУСН.ДопРасходыУСН КАК ДопРасходыУСН
	|ГДЕ
	|	ДопРасходыУСН.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетДолейСписания.НомерСтроки КАК НомерСтрокиРасчета,
	|	РасчетДолейСписания.ИдСтроки,
	|	РасчетДолейСписания.ИФО,
	|	РасчетДолейСписания.КФО,
	|	РасчетДолейСписания.КПС,
	|	РасчетДолейСписания.Подразделение,
	|	РасчетДолейСписания.Номенклатура,
	|	РасчетДолейСписания.Партия,
	|	ДопРасходыУСН.НомерСтроки КАК НомерСтрокиРасходов,
	|	ДопРасходыУСН.СчетУчета КАК СчетУчетаУСН,
	|	ДопРасходыУСН.РасходыУСН КАК РасходыУСН,
	|	ДопРасходыУСН.Субконто3 КАК Субконто3,
	|	ДопРасходыУСН.Валюта КАК Валюта,
	|	ДопРасходыУСН.СписатьНаУСНСуммаВал,
	|	ДопРасходыУСН.СписатьНаУСНСумма,
	|	ДопРасходыУСН.СписатьНаУСНСуммаНДС,
	|	ДопРасходыУСН.СписатьНаУСНСуммаНеУчитываетсяНУ,
	|	ДопРасходыУСН.СписатьНаУСНСуммаЕНВД,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаВал,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСумма,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаНДС,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаНеУчитываетсяНУ,
	|	ДопРасходыУСН.СписатьНаНеУчитываемыеСуммаЕНВД,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаВал,
	|	ДопРасходыУСН.СписатьНаЕНВДСумма,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаНДС,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаНеУчитываетсяНУ,
	|	ДопРасходыУСН.СписатьНаЕНВДСуммаЕНВД
	|ИЗ
	|	РасчетДолейСписания КАК РасчетДолейСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДопРасходыУСН КАК ДопРасходыУСН
	|		ПО РасчетДолейСписания.ИдСтроки = ДопРасходыУСН.ИдСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиРасчета,
	|	НомерСтрокиРасходов";
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДобавитьСтрокуСписанияДопРасходовУСН(ТаблицаСписаниеДопРасходов, Выборка,
			Выборка.СписатьНаУСНСуммаВал,
			Выборка.СписатьНаУСНСумма,
			Выборка.СписатьНаУСНСуммаНДС,
			Выборка.СписатьНаУСНСуммаНеУчитываетсяНУ,
			Выборка.СписатьНаУСНСуммаЕНВД,
			Перечисления.ОтражениеВУСН.Принимаются);
		
		ДобавитьСтрокуСписанияДопРасходовУСН(ТаблицаСписаниеДопРасходов, Выборка,
			Выборка.СписатьНаНеУчитываемыеСуммаВал,
			Выборка.СписатьНаНеУчитываемыеСумма,
			Выборка.СписатьНаНеУчитываемыеСуммаНДС,
			Выборка.СписатьНаНеУчитываемыеСуммаНеУчитываетсяНУ,
			Выборка.СписатьНаНеУчитываемыеСуммаЕНВД,
			Перечисления.ОтражениеВУСН.НеПринимаются);
		
		ДобавитьСтрокуСписанияДопРасходовУСН(ТаблицаСписаниеДопРасходов, Выборка,
			Выборка.СписатьНаЕНВДСуммаВал,
			Выборка.СписатьНаЕНВДСумма,
			Выборка.СписатьНаЕНВДСуммаНДС,
			Выборка.СписатьНаЕНВДСуммаНеУчитываетсяНУ,
			Выборка.СписатьНаЕНВДСуммаЕНВД,
			Перечисления.ОтражениеВУСН.ОсобыйПорядок);
		
	КонецЦикла;
	
	Возврат ТаблицаСписаниеДопРасходов;
	
КонецФункции

Процедура ДобавитьСтрокуСписанияДопРасходовУСН(ТаблицаСписаниеДопРасходов, Выборка,
				СуммаВал, Сумма, СуммаНДС, СуммаНеУчитываетсяНУ, СуммаЕНВД, ОтражениеВУСН)
	
	Если СуммаВал = 0
	   И Сумма = 0
	   И СуммаНДС = 0
	   И СуммаНеУчитываетсяНУ = 0
	   И СуммаЕНВД = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СписаниеДопРасходов = ТаблицаСписаниеДопРасходов.Добавить();
	ЗаполнитьЗначенияСвойств(СписаниеДопРасходов, Выборка,
		"ИФО,КФО,КПС,Подразделение,СчетУчетаУСН,РасходыУСН,Партия,Валюта");
	
	СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Выборка.СчетУчетаУСН);
	Если СвойстваСчетаУСН.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН Тогда
		СписаниеДопРасходов.ДокументОплаты = Выборка.Субконто3;
	КонецЕсли;
	
	СписаниеДопРасходов.СуммаВал                = СуммаВал;
	СписаниеДопРасходов.СуммаРуб                = Сумма;
	СписаниеДопРасходов.СуммаНДСРуб             = СуммаНДС;
	СписаниеДопРасходов.СуммаНеУчитываетсяНУРуб = СуммаНеУчитываетсяНУ;
	СписаниеДопРасходов.СуммаЕНВДРуб            = СуммаЕНВД;
	
	СписаниеДопРасходов.ОтражениеВУСН = ОтражениеВУСН;

КонецПроцедуры

// Распределение расходов по видам деятельности

Функция ПустаяТаблицаРаспределениеРасходовПоВидамДеятельностиУСН() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТиповСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета доп. расходов.
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",    Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("Субконто1",     ОписаниеТиповСубконто);
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	
	// Суммы доп. расходов к списанию.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма без НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма с НДС в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	// Порядок отражения в налоговом учете при УСН.
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаРаспределениеРасходовПоВидамДеятельностиУСН(Реквизиты) Экспорт
	
	ТаблицаРаспределениеРасходов = ПустаяТаблицаРаспределениеРасходовПоВидамДеятельностиУСН();
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат ТаблицаРаспределениеРасходов;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Реквизиты.Вставить("ПлательщикЕНВД",                   УчетнаяПолитика.ПлательщикЕНВД);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходыСводно.НомерСтроки,
	|	РасходыСводно.ИдСтроки КАК ИдСтроки,
	|	РасходыСводно.ИФО,
	|	РасходыСводно.КФО,
	|	РасходыСводно.КПС,
	|	РасходыСводно.Подразделение,
	|	РасходыСводно.СчетГруппа,
	|	РасходыСводно.Субконто1
	|ПОМЕСТИТЬ РасходыСводно
	|ИЗ
	|	Документ.РаспределениеРасходовПоВидамДеятельностиУСН.РасходыСводно КАК РасходыСводно
	|ГДЕ
	|	РасходыСводно.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыДетально.НомерСтроки,
	|	РасходыДетально.ИдСтроки КАК ИдСтроки,
	|	РасходыДетально.СчетУчета,
	|	РасходыДетально.РасходыУСН,
	|	РасходыДетально.Субконто3,
	|	РасходыДетально.СписатьНаУСНСумма,
	|	РасходыДетально.СписатьНаУСНСуммаНДС,
	|	РасходыДетально.СписатьНаУСНСуммаНеУчитываетсяНУ,
	|	РасходыДетально.СписатьНаУСНСуммаЕНВД,
	|	РасходыДетально.СписатьНаЕНВДСумма,
	|	РасходыДетально.СписатьНаЕНВДСуммаНДС,
	|	РасходыДетально.СписатьНаЕНВДСуммаНеУчитываетсяНУ,
	|	РасходыДетально.СписатьНаЕНВДСуммаЕНВД
	|ПОМЕСТИТЬ РасходыДетально
	|ИЗ
	|	Документ.РаспределениеРасходовПоВидамДеятельностиУСН.РасходыДетально КАК РасходыДетально
	|ГДЕ
	|	РасходыДетально.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходыСводно.НомерСтроки КАК НомерСтрокиСводно,
	|	РасходыСводно.ИдСтроки,
	|	РасходыСводно.ИФО,
	|	РасходыСводно.КФО,
	|	РасходыСводно.КПС,
	|	РасходыСводно.Подразделение,
	|	РасходыСводно.СчетГруппа,
	|	РасходыСводно.Субконто1,
	|	РасходыДетально.НомерСтроки КАК НомерСтрокиДетально,
	|	РасходыДетально.СчетУчета КАК СчетУчетаУСН,
	|	РасходыДетально.РасходыУСН КАК РасходыУСН,
	|	РасходыДетально.Субконто3 КАК Субконто3,
	|	РасходыДетально.СписатьНаУСНСумма,
	|	РасходыДетально.СписатьНаУСНСуммаНДС,
	|	РасходыДетально.СписатьНаУСНСуммаНеУчитываетсяНУ,
	|	РасходыДетально.СписатьНаУСНСуммаЕНВД,
	|	РасходыДетально.СписатьНаЕНВДСумма,
	|	РасходыДетально.СписатьНаЕНВДСуммаНДС,
	|	РасходыДетально.СписатьНаЕНВДСуммаНеУчитываетсяНУ,
	|	РасходыДетально.СписатьНаЕНВДСуммаЕНВД
	|ИЗ
	|	РасходыСводно КАК РасходыСводно
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходыДетально КАК РасходыДетально
	|		ПО РасходыСводно.ИдСтроки = РасходыДетально.ИдСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиСводно,
	|	НомерСтрокиДетально";
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДобавитьСтрокуРаспределениеРасходовПоВидамДеятельностиУСН(ТаблицаРаспределениеРасходов, Выборка,
			Выборка.СписатьНаУСНСумма,
			Выборка.СписатьНаУСНСуммаНДС,
			Выборка.СписатьНаУСНСуммаНеУчитываетсяНУ,
			Выборка.СписатьНаУСНСуммаЕНВД,
			Перечисления.ОтражениеВУСН.Принимаются);
		
		ДобавитьСтрокуРаспределениеРасходовПоВидамДеятельностиУСН(ТаблицаРаспределениеРасходов, Выборка,
			Выборка.СписатьНаЕНВДСумма,
			Выборка.СписатьНаЕНВДСуммаНДС,
			Выборка.СписатьНаЕНВДСуммаНеУчитываетсяНУ,
			Выборка.СписатьНаЕНВДСуммаЕНВД,
			Перечисления.ОтражениеВУСН.ОсобыйПорядок);
		
	КонецЦикла;
	
	Возврат ТаблицаРаспределениеРасходов;
	
КонецФункции

Процедура ДобавитьСтрокуРаспределениеРасходовПоВидамДеятельностиУСН(ТаблицаРаспределениеРасходов, Выборка,
				Сумма, СуммаНДС, СуммаНеУчитываетсяНУ, СуммаЕНВД, ОтражениеВУСН)
	
	Если Сумма = 0
	   И СуммаНДС = 0
	   И СуммаНеУчитываетсяНУ = 0
	   И СуммаЕНВД = 0 Тогда
		Возврат;
	КонецЕсли;
	
	РаспределениеРасходов = ТаблицаРаспределениеРасходов.Добавить();
	ЗаполнитьЗначенияСвойств(РаспределениеРасходов, Выборка,
		"ИФО,КФО,КПС,Подразделение,СчетУчетаУСН,РасходыУСН,Субконто1");
	
	СвойстваСчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Выборка.СчетУчетаУСН);
	Если СвойстваСчетаУСН.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН Тогда
		РаспределениеРасходов.ДокументОплаты = Выборка.Субконто3;
	КонецЕсли;
	
	РаспределениеРасходов.СуммаРуб                = Сумма;
	РаспределениеРасходов.СуммаНДСРуб             = СуммаНДС;
	РаспределениеРасходов.СуммаНеУчитываетсяНУРуб = СуммаНеУчитываетсяНУ;
	РаспределениеРасходов.СуммаЕНВДРуб            = СуммаЕНВД;
	
	РаспределениеРасходов.ОтражениеВУСН = ОтражениеВУСН;

КонецПроцедуры

// Ввод остатков ОС и НМА в УСН

Функция ПустаяТаблицаВводОстатковОсновныхСредствУСН() Экспорт

	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расходов УСН на приобретение ОС, НМА (Дт).
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",       Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	
	// Порядок отражения стоимости объекта в налоговом учете при УСН.
	ПустаяТаблица.Колонки.Добавить("ПорядокВключенияСтоимостиВСоставРасходовУСН",
		Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН"));
	ПустаяТаблица.Колонки.Добавить("РасходыПроизведеныДоПереходаНаУСН", Новый ОписаниеТипов("Булево"));
	ПустаяТаблица.Колонки.Добавить("ЭтоОплаченныеРасходы", Новый ОписаниеТипов("Булево"));
	
	// Свойства расходов для формирования элементов справочника "Расходы УСН".
	МетаданныеРасходовУСН  = Метаданные.Справочники.РасходыУСН.Реквизиты;
	ПустаяТаблица.Колонки.Добавить("Партия",               МетаданныеРасходовУСН.Партия.Тип);
	ПустаяТаблица.Колонки.Добавить("ИмяСпискаДокумента",   МетаданныеРасходовУСН.ИмяСпискаДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("НомерСтрокиДокумента", МетаданныеРасходовУСН.НомерСтрокиДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидРасхода",           МетаданныеРасходовУСН.ВидРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ЭлементРасхода",       МетаданныеРасходовУСН.ЭлементРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН",        МетаданныеРасходовУСН.ОтражениеВУСН.Тип);
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",         МетаданныеРасходовУСН.СчетРасчетов.Тип);
	ПустаяТаблица.Колонки.Добавить("Контрагент",           МетаданныеРасходовУСН.Контрагент.Тип);
	ПустаяТаблица.Колонки.Добавить("Договор",              МетаданныеРасходовУСН.Договор.Тип);
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",     МетаданныеРасходовУСН.ДокументРасчетов.Тип);
	
	// Количество и стоимость принимаемых вложений во внеоборотные активы.
	ПустаяТаблица.Колонки.Добавить("Количество",              ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("Валюта",                  Новый ОписаниеТипов("СправочникСсылка.Валюты")); // Валюта расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаВводОстатковОсновныхСредствУСН(ТаблицаВводОстатковОсновныхСредств, Реквизиты, Отказ) Экспорт
	
	ТаблицаРасходовУСН = ПустаяТаблицаВводОстатковОсновныхСредствУСН();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, КонецГода(Реквизиты.Дата)+1) Тогда
		Возврат ТаблицаРасходовУСН;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаВводОстатков.ИмяСписка КАК ИмяСписка,
	|	ТаблицаВводОстатков.СинонимСписка КАК СинонимСписка,
	|	ТаблицаВводОстатков.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВводОстатков.ИФО КАК ИФО,
	|	ТаблицаВводОстатков.КФО КАК КФО,
	|	ТаблицаВводОстатков.КПС КАК КПС,
	|	ТаблицаВводОстатков.Подразделение КАК Подразделение,
	|	ТаблицаВводОстатков.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаВводОстатков.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаВводОстатков.СчетУчетаОС КАК СчетУчетаОС,
	|	ТаблицаВводОстатков.СостояниеОС КАК СостояниеОС,
	|	ТаблицаВводОстатков.ПорядокВключенияСтоимостиВСоставРасходовУСН КАК ПорядокВключенияСтоимостиВСоставРасходовУСН,
	|	ТаблицаВводОстатков.Количество КАК Количество
	|ПОМЕСТИТЬ ВводОстатковОСиНМА
	|ИЗ
	|	&ТаблицаВводОстатковОсновныхСредств КАК ТаблицаВводОстатков
	|ГДЕ
	|	ТаблицаВводОстатков.ПорядокВключенияСтоимостиВСоставРасходовУСН <> ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.НеВключатьВСоставРасходов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВводОстатковОСиНМА.ИмяСписка КАК ИмяСписка,
	|	ВводОстатковОСиНМА.СинонимСписка КАК СинонимСписка,
	|	ВводОстатковОСиНМА.НомерСтроки КАК НомерСтроки,
	|	ВводОстатковОСиНМА.ИФО КАК ИФО,
	|	ВводОстатковОСиНМА.КФО КАК КФО,
	|	ВводОстатковОСиНМА.КПС КАК КПС,
	|	ВводОстатковОСиНМА.Подразделение КАК Подразделение,
	|	ВводОстатковОСиНМА.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(ВводОстатковОСиНМА.ОсновноеСредство КАК Справочник.ОсновныеСредства).ВидНФА КАК ВидНФА,
	|	ВводОстатковОСиНМА.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВводОстатковОСиНМА.СчетУчетаОС КАК СчетУчетаОС,
	|	ВводОстатковОСиНМА.СостояниеОС КАК СостояниеОС,
	|	ВводОстатковОСиНМА.ПорядокВключенияСтоимостиВСоставРасходовУСН КАК ПорядокВключенияСтоимостиВСоставРасходовУСН,
	|	ОстаткиРасходовУСН.РасходыПроизведеныДоПереходаНаУСН КАК РасходыПроизведеныДоПереходаНаУСН,
	|	""ОС_РасходыУСН"" КАК ИмяСпискаДокумента,
	|	ОстаткиРасходовУСН.НомерСтроки КАК НомерСтрокиДокумента,
	|	ОстаткиРасходовУСН.СчетРасчетов КАК СчетРасчетов,
	|	ОстаткиРасходовУСН.Контрагент КАК Контрагент,
	|	ОстаткиРасходовУСН.Договор КАК Договор,
	|	ОстаткиРасходовУСН.Валюта КАК Валюта,
	|	ЕСТЬNULL(ОстаткиРасходовУСН.СуммаОплаченныхРасходовРуб, 0) КАК СуммаОплаченныхРасходовРуб,
	|	ЕСТЬNULL(ОстаткиРасходовУСН.СуммаНеоплаченныхРасходовРуб, 0) КАК СуммаНеоплаченныхРасходовРуб,
	|	ЕСТЬNULL(ОстаткиРасходовУСН.СуммаНеоплаченныхРасходовВал, 0) КАК СуммаНеоплаченныхРасходовВал
	|ИЗ
	|	ВводОстатковОСиНМА КАК ВводОстатковОСиНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводНачальныхОстатков.ОС_РасходыУСН КАК ОстаткиРасходовУСН
	|		ПО (ОстаткиРасходовУСН.Ссылка = &Ссылка)
	|			И ВводОстатковОСиНМА.ОсновноеСредство = ОстаткиРасходовУСН.ОС
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерСтрокиДокумента";
	
	Если ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ВводНачальныхОстатков", "Документ.ВводНачальныхОстатковОС");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОС_РасходыУСН", "РасходыУСН");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВводОстатковОСиНМА.ОсновноеСредство = ОстаткиРасходовУСН.ОС", "ИСТИНА");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("ТаблицаВводОстатковОсновныхСредств", ТаблицаВводОстатковОсновныхСредств);
	
	ТаблицаВводОстатковУСН = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаВводОстатковУСН Цикл
		
		Если НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(СтрокаТаблицы.КФО) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаНеоплаченныхРасходовРуб > 0 Тогда
			
			НоваяСтрока = ТаблицаРасходовУСН.Добавить();
			НоваяСтрока.ЭтоОплаченныеРасходы = Ложь;
			ЗаполнитьОбщиеРеквизитыРасходовУСНприВводеОстатковПоОС(НоваяСтрока, СтрокаТаблицы, Реквизиты);
			
			Если СтрокаТаблицы.ПорядокВключенияСтоимостиВСоставРасходовУСН =
					Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
				Если СтрокаТаблицы.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
					НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У04.О");
				ИначеЕсли НЕ СтрокаТаблицы.СостояниеОС = Перечисления.СостоянияОС.ВведеноВЭксплуатацию Тогда
					НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.ВО");
				Иначе
					НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.О");
				КонецЕсли;
			Иначе
				НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У08.О");
			КонецЕсли;
			
			НоваяСтрока.Валюта     = СтрокаТаблицы.Валюта;
			НоваяСтрока.СуммаВал   = СтрокаТаблицы.СуммаНеоплаченныхРасходовВал;
			НоваяСтрока.СуммаРуб   = СтрокаТаблицы.СуммаНеоплаченныхРасходовРуб;
			
		КонецЕсли;
		
		Если СтрокаТаблицы.СуммаОплаченныхРасходовРуб > 0 Тогда
			
			НоваяСтрока = ТаблицаРасходовУСН.Добавить();
			НоваяСтрока.ЭтоОплаченныеРасходы = Истина;
			ЗаполнитьОбщиеРеквизитыРасходовУСНприВводеОстатковПоОС(НоваяСтрока, СтрокаТаблицы, Реквизиты);
			
			Если СтрокаТаблицы.ПорядокВключенияСтоимостиВСоставРасходовУСН =
					Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
				Если СтрокаТаблицы.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
					НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У04.П");
				ИначеЕсли НЕ СтрокаТаблицы.СостояниеОС = Перечисления.СостоянияОС.ВведеноВЭксплуатацию Тогда
					НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.В");
				Иначе
					НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.П");
				КонецЕсли;
			Иначе
				НоваяСтрока.СчетУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У08.П");
			КонецЕсли;
			
			НоваяСтрока.Валюта     = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
			НоваяСтрока.СуммаВал   = СтрокаТаблицы.СуммаОплаченныхРасходовРуб;
			НоваяСтрока.СуммаРуб   = СтрокаТаблицы.СуммаОплаченныхРасходовРуб;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьЭлементыУчетаРасходовУСН(Реквизиты.Ссылка, ТаблицаРасходовУСН);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Процедура ЗаполнитьОбщиеРеквизитыРасходовУСНприВводеОстатковПоОС(НоваяСтрока, СтрокаТаблицы, Реквизиты)
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	
	// Заполним реквизиты для формирования новых элементов учета расходов УСН.
	НоваяСтрока.Партия               = Реквизиты.Ссылка;
	НоваяСтрока.ИмяСпискаДокумента   = СтрокаТаблицы.ИмяСпискаДокумента;
	НоваяСтрока.НомерСтрокиДокумента = СтрокаТаблицы.НомерСтрокиДокумента;
	
	Если СтрокаТаблицы.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
		НоваяСтрока.ВидРасхода     = Перечисления.ВидыРасходовУСН.НМА;
		НоваяСтрока.ЭлементРасхода = СтрокаТаблицы.ОсновноеСредство;
	Иначе
		НоваяСтрока.ВидРасхода     = Перечисления.ВидыРасходовУСН.ОС;
		Если ЗначениеЗаполнено(СтрокаТаблицы.ИнвентарныйНомер) Тогда
			НоваяСтрока.ЭлементРасхода = СтрокаТаблицы.ИнвентарныйНомер;
		Иначе
			НоваяСтрока.ЭлементРасхода = СтрокаТаблицы.ОсновноеСредство;
		КонецЕсли;
	КонецЕсли;
	
	НоваяСтрока.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
	
	НоваяСтрока.СчетРасчетов     = СтрокаТаблицы.СчетРасчетов;
	НоваяСтрока.Контрагент       = СтрокаТаблицы.Контрагент;
	НоваяСтрока.Договор          = СтрокаТаблицы.Договор;
	НоваяСтрока.ДокументРасчетов = Реквизиты.Ссылка;
	
КонецПроцедуры

// Принятие к учету ОС и НМА в УСН

// Подготавливает таблицу документа принятия к учету ОС, НМА (для целей УСН).
//
Функция ПодготовитьТаблицуПринятиеКУчетуОсновныхСредствПоДокументу(Документ, Параметры = Неопределено) Экспорт
	
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ТаблицаДокумента = Новый ТаблицаЗначений;
	// Идентификация строки.
	ТаблицаДокумента.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаДокумента.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаДокумента.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Объект учета внеоборотных активов.
	ТаблицаДокумента.Колонки.Добавить("ОсновноеСредство",     Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаДокумента.Колонки.Добавить("ИнвентарныйНомер",     Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаДокумента.Колонки.Добавить("Количество",           ОписаниеТипаКоличества);
	ТаблицаДокумента.Колонки.Добавить("ВведеноВЭксплуатацию", Новый ОписаниеТипов("Булево"));
	ТаблицаДокумента.Колонки.Добавить("ПорядокВключенияСтоимостиВСоставРасходовУСН",
		Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН"));
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицаДокумента;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	МетаданныеДокумента = Документ.Метаданные();
	
	ЕстьТабЧастьОсновныеСредства = ОбщегоНазначенияБГУ.ЕстьТабЧастьДокумента("ОсновныеСредства", МетаданныеДокумента);
	Если ЕстьТабЧастьОсновныеСредства Тогда
		
		ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ОсновныеСредства",
			"НомерСтроки,ОсновноеСредство,ИнвентарныйНомер,Количество,
			|ПринятиеКУчетуОдновременноСВводомВЭксплуатацию,ПорядокВключенияСтоимостиВСоставРасходовУСН",
			Документ, Параметры);
		
		Запрос.Текст = Запрос.Текст +
		"ВЫБРАТЬ
		|	""ОсновныеСредства"" КАК ИмяСписка,
		|	""Основные средства"" КАК СинонимСписка,
		|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
		|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ОсновныеСредства.Количество КАК Количество,
		|	ОсновныеСредства.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию КАК ВведеноВЭксплуатацию,
		|	ОсновныеСредства.ПорядокВключенияСтоимостиВСоставРасходовУСН КАК ПорядокВключенияСтоимостиВСоставРасходовУСН
		|ИЗ
		|	ТаблицаОсновныеСредства КАК ОсновныеСредства
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		ПринятиеКУчетуОсновныхСредств = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаДокумента Из ПринятиеКУчетуОсновныхСредств Цикл
			НоваяСтрока = ТаблицаДокумента.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
		КонецЦикла;
		
	Иначе
		
		НоваяСтрока = ТаблицаДокумента.Добавить();
		НоваяСтрока.ОсновноеСредство     = Документ.ОсновноеСредство;
		НоваяСтрока.ИнвентарныйНомер     = Документ.ИнвентарныйНомер;
		НоваяСтрока.Количество           = 1;
		НоваяСтрока.ВведеноВЭксплуатацию = Документ.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию;
		НоваяСтрока.ПорядокВключенияСтоимостиВСоставРасходовУСН =
			Документ.ПорядокВключенияСтоимостиВСоставРасходовУСН;
		
	КонецЕсли;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

Функция ПустаяТаблицаПринятиеКУчетуОсновныхСредствУСН() Экспорт

	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расходов УСН, отнесенных на вложения во внеоборотные активы (Кт).
	ПустаяТаблица.Колонки.Добавить("СчетВложенийУСН", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("КапВложенияУСН",  Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ОбъектВложений",
		ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("КоличествоВложений", ОписаниеТипаКоличества);
	
	// Счет и аналитика учета расходов УСН на приобретение ОС, НМА (Дт).
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",       Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	
	// Порядок отражения стоимости объекта в налоговом учете при УСН.
	ПустаяТаблица.Колонки.Добавить("ПорядокВключенияСтоимостиВСоставРасходовУСН",
		Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН"));
	
	// Свойства расходов для формирования элементов справочника "Расходы УСН".
	МетаданныеРасходовУСН  = Метаданные.Справочники.РасходыУСН.Реквизиты;
	ПустаяТаблица.Колонки.Добавить("Партия",               МетаданныеРасходовУСН.Партия.Тип);
	ПустаяТаблица.Колонки.Добавить("ИмяСпискаДокумента",   МетаданныеРасходовУСН.ИмяСпискаДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("НомерСтрокиДокумента", МетаданныеРасходовУСН.НомерСтрокиДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидРасхода",           МетаданныеРасходовУСН.ВидРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ЭлементРасхода",       МетаданныеРасходовУСН.ЭлементРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН",        МетаданныеРасходовУСН.ОтражениеВУСН.Тип);
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",         МетаданныеРасходовУСН.СчетРасчетов.Тип);
	ПустаяТаблица.Колонки.Добавить("Контрагент",           МетаданныеРасходовУСН.Контрагент.Тип);
	ПустаяТаблица.Колонки.Добавить("Договор",              МетаданныеРасходовУСН.Договор.Тип);
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",     МетаданныеРасходовУСН.ДокументРасчетов.Тип);
	
	// Количество и стоимость принимаемых вложений во внеоборотные активы.
	ПустаяТаблица.Колонки.Добавить("Количество",              ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("Валюта",                  Новый ОписаниеТипов("СправочникСсылка.Валюты")); // Валюта расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаПринятиеКУчетуОсновныхСредствУСН(ТаблицаОСиНМА, Документ, Реквизиты, Отказ) Экспорт
	
	ТаблицаПринятыхОСиНМА           = ПустаяТаблицаПринятиеКУчетуОсновныхСредствУСН();
	ТаблицаАмортизируемогоИмущества = ПустаяТаблицаПринятиеКУчетуОсновныхСредствУСН();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
		Возврат ТаблицаПринятыхОСиНМА;
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РешениеОПризнанииОбъектовОС") Тогда
		ЭтоПриобретение = (Документ.ВидОперации = Перечисления.ВидыОперацийПризнанияОС.Приобретение);
		ЭтоИзготовление = (Документ.ВидОперации = Перечисления.ВидыОперацийПризнанияОС.Изготовление);
		ВнеоборотныйАктив = Документ.КапитальноеВложение;
	Иначе
		ЭтоПриобретение = (Документ.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение);
		ЭтоИзготовление = (Документ.ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление);
		ВнеоборотныйАктив = Документ.ВнеоборотныйАктив;
	КонецЕсли;
	
	Если Не ЭтоПриобретение И Не ЭтоИзготовление Тогда
		Возврат ТаблицаПринятыхОСиНМА;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Получим все остатки расходов УСН по указанному в документе внеоборотному активу.
	СчетаВложенийВоВнеоборотныеАктивыУСН = БухгалтерскийУчет.СписокСчетов("У08.ПО,У08.П");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("СубконтоРасходов2", ВнеоборотныйАктив);
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", Документ.ИФО);
	КонецЕсли;
	//Если Реквизиты.ИспользоватьУчетПоПодразделениям Тогда
	//	ОтборРасходов.Вставить("Подразделение", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
	//		ТаблицаОСиНМА.ВыгрузитьКолонку("Подразделение")));
	//КонецЕсли;
	ОтборРасходов.Вставить("КФО", Документ.КФО);
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаВложенийВоВнеоборотныеАктивыУСН, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "Партия", "ДатаДокументаПартии");
	
	// Рассчитаем долю списания кап. вложений.
	Если ЭтоИзготовление Тогда // указывается в документе
		Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("КоличествоВложений", Документ.Метаданные()) Тогда
			КоличествоКапВложенийВсего = Документ.КоличествоВложений;
		Иначе
			КоличествоКапВложенийВсего = Документ.Количество;
		КонецЕсли;
	Иначе
		КоличествоКапВложенийВсего = ОстаткиРасходовУСН.Итог("Количество");
	КонецЕсли;
	КоличествоОбъектовОСиНМАВсего = ТаблицаОСиНМА.Итог("Количество");
	Коэффициент = ?(КоличествоКапВложенийВсего = 0, 0, КоличествоОбъектовОСиНМАВсего / КоличествоКапВложенийВсего);
	Если Коэффициент = 0 Тогда
		Возврат ТаблицаПринятыхОСиНМА;
	КонецЕсли;
	
	// Распределим аккумулированные кап. вложения по объектам ОС и НМА.
	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ТаблицаОСиНМА.Колонки.Добавить("КоличествоВложений",      ОписаниеТипаКоличества);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы);
	
	Для Каждого ОстатокВложений Из ОстаткиРасходовУСН Цикл
		
		СписатьКоличество              = Окр(ОстатокВложений.Количество              * Коэффициент, 2, 1);
		СписатьСуммаВал                = Окр(ОстатокВложений.СуммаВал                * Коэффициент, 2, 1);
		СписатьСуммаРуб                = Окр(ОстатокВложений.СуммаРуб                * Коэффициент, 2, 1);
		СписатьСуммаНеУчитываетсяНУРуб = Окр(ОстатокВложений.СуммаНеУчитываетсяНУРуб * Коэффициент, 2, 1);
		СписатьСуммаЕНВДРуб            = Окр(ОстатокВложений.СуммаЕНВДРуб            * Коэффициент, 2, 1);
		СписатьСуммаНДСРуб             = Окр(ОстатокВложений.СуммаНДСРуб             * Коэффициент, 2, 1);
		
		// Количество и суммы кап.вложений распределяем по объектам ОС и НМА, принимаемым к учету.
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СписатьКоличество,
			ТаблицаОСиНМА, "КоличествоВложений", "Количество");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СписатьСуммаВал,
			ТаблицаОСиНМА, "СуммаВал", "Количество");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СписатьСуммаРуб,
			ТаблицаОСиНМА, "СуммаРуб", "Количество");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СписатьСуммаНеУчитываетсяНУРуб,
			ТаблицаОСиНМА, "СуммаНеУчитываетсяНУРуб", "Количество");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СписатьСуммаЕНВДРуб,
			ТаблицаОСиНМА, "СуммаЕНВДРуб", "Количество");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СписатьСуммаНДСРуб,
			ТаблицаОСиНМА, "СуммаНДСРуб", "Количество");
		
		Для Каждого СтрокаОСиНМА Из ТаблицаОСиНМА Цикл
			
			ПорядокВключенияСтоимостиВСоставРасходовУСН = СтрокаОСиНМА.ПорядокВключенияСтоимостиВСоставРасходовУСН;
			
			Если ПорядокВключенияСтоимостиВСоставРасходовУСН =
					Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
				НоваяСтрока = ТаблицаАмортизируемогоИмущества.Добавить();
			Иначе
				НоваяСтрока = ТаблицаПринятыхОСиНМА.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстатокВложений,
				"ИФО,КФО,КПС,Подразделение,Валюта,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,ОтражениеВУСН");
			
			НоваяСтрока.СчетВложенийУСН = ОстатокВложений.СчетУчетаУСН;
			НоваяСтрока.КапВложенияУСН  = ОстатокВложений.РасходыУСН;
			НоваяСтрока.ОбъектВложений  = ОстатокВложений.СубконтоРасходов2;
			
			СвойстваСчетаВложений = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяСтрока.СчетВложенийУСН);
			Если СвойстваСчетаВложений.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН Тогда
				НоваяСтрока.ДокументОплаты  = ОстатокВложений.СубконтоРасходов3;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОСиНМА,
				"ИмяСписка,СинонимСписка,НомерСтроки,КоличествоВложений,Количество,
				|СуммаВал,СуммаРуб,СуммаНеУчитываетсяНУРуб,СуммаЕНВДРуб,СуммаНДСРуб");
			
			Если ПорядокВключенияСтоимостиВСоставРасходовУСН =
					Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
				
				// Расходы УСН учитываем по новому объекту ОС, НМА, НПА.
				НоваяСтрока.ОсновноеСредство = СтрокаОСиНМА.ОсновноеСредство;
				
				// Заполним реквизиты для формирования новых элементов учета расходов УСН.
				НоваяСтрока.Партия               = Документ;
				НоваяСтрока.ИмяСпискаДокумента   = СтрокаОСиНМА.ИмяСписка;
				НоваяСтрока.НомерСтрокиДокумента = СтрокаОСиНМА.НомерСтроки;
				
				Если СтрокаОСиНМА.ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
					НоваяСтрока.ВидРасхода     = Перечисления.ВидыРасходовУСН.НМА;
					НоваяСтрока.ЭлементРасхода = СтрокаОСиНМА.ОсновноеСредство;
				Иначе
					НоваяСтрока.ВидРасхода     = Перечисления.ВидыРасходовУСН.ОС;
					Если ЗначениеЗаполнено(СтрокаОСиНМА.ИнвентарныйНомер) Тогда
						НоваяСтрока.ЭлементРасхода = СтрокаОСиНМА.ИнвентарныйНомер;
					Иначе
						НоваяСтрока.ЭлементРасхода = СтрокаОСиНМА.ОсновноеСредство;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
			
				// Расходы УСН учитываем по тому же объекту вложений.
				НоваяСтрока.ОсновноеСредство = ОстатокВложений.СубконтоРасходов2;
				
				// Новые элементы учета расходов УСН не формируем.
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстатокВложений,
					"Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,ВидРасхода,ЭлементРасхода,РасходыУСН");
				
			КонецЕсли;
			
			НоваяСтрока.СчетУчетаУСН = СчетРасходовУСНприПринятииКУчетуОсновныхСредствУСН(
				НоваяСтрока.СчетВложенийУСН,
				НоваяСтрока.ОсновноеСредство,
				СтрокаОСиНМА.ВведеноВЭксплуатацию,
				ПорядокВключенияСтоимостиВСоставРасходовУСН);
			
		КонецЦикла;
		
	КонецЦикла;
	
	СформироватьЭлементыУчетаРасходовУСН(Документ, ТаблицаАмортизируемогоИмущества);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаАмортизируемогоИмущества, ТаблицаПринятыхОСиНМА);
	ТаблицаПринятыхОСиНМА.Сортировать("ИмяСписка,НомерСтроки");
	
	Возврат ТаблицаПринятыхОСиНМА;
	
КонецФункции

Функция СчетРасходовУСНприПринятииКУчетуОсновныхСредствУСН(СчетВложенийУСН, ОсновноеСредство, ВведеноВЭксплуатацию, ПорядокВключенияСтоимостиВСоставРасходовУСН)
	
	КодСчетаУчетаУСН = Строка(СчетВложенийУСН);
	
	Если ПорядокВключенияСтоимостиВСоставРасходовУСН =
			Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
		
		// Кап. вложения: не Оплачены.
		Если Найти(КодСчетаУчетаУСН, "У08.ПО") Тогда
			
			Если ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У04.О"); // Не меняем статус оплаты.
			ИначеЕсли НЕ ВведеноВЭксплуатацию Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.ВО"); // Не меняем статус оплаты.
			Иначе
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.О"); // Не меняем статус оплаты.
			КонецЕсли;
			
		// Кап. вложения: Оплачены.
		ИначеЕсли Найти(КодСчетаУчетаУСН, "У08.П") Тогда
			
			Если ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У04.П"); // Не меняем статус оплаты.
			ИначеЕсли НЕ ВведеноВЭксплуатацию Тогда
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.В"); // Не меняем статус оплаты.
			Иначе
				Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.П"); // Не меняем статус оплаты.
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ПорядокВключенияСтоимостиВСоставРасходовУСН =
			Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставМатериальныхРасходов Тогда
		
		// Кап. вложения: не Оплачены.
		Если Найти(КодСчетаУчетаУСН, "У08.ПО") Тогда
			
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У08.О"); // Не меняем статус оплаты.
			
		// Кап. вложения: Оплачены.
		ИначеЕсли Найти(КодСчетаУчетаУСН, "У08.П") Тогда
			
			Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99"); // Включаем расходы в КУДиР.
			
		КонецЕсли;
		
	Иначе
		
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

// Модернизация ОС и НМА в УСН

Функция ПустаяТаблицаМодернизацияОсновныхСредствУСН() Экспорт

	ОписаниеТипаСуммы      = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	ПустаяТаблица.Колонки.Добавить("ИдентификаторСтроки", Новый ОписаниеТипов("Строка"));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расходов УСН, отнесенных на вложения во внеоборотные активы (Кт).
	ПустаяТаблица.Колонки.Добавить("СчетВложенийУСН", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("КапВложенияУСН",  Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ОбъектВложений",
		ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства.ТипЗначения);
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	
	// Счет и аналитика учета расходов УСН на приобретение ОС, НМА (Дт).
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",       Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	
	// Порядок отражения стоимости объекта в налоговом учете при УСН, указанный при принятии к учету.
	ПустаяТаблица.Колонки.Добавить("ПорядокВключенияСтоимостиВСоставРасходовУСН",
		Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН"));
	
	// Свойства расходов для формирования элементов справочника "Расходы УСН".
	МетаданныеРасходовУСН  = Метаданные.Справочники.РасходыУСН.Реквизиты;
	ПустаяТаблица.Колонки.Добавить("Партия",               МетаданныеРасходовУСН.Партия.Тип);
	ПустаяТаблица.Колонки.Добавить("ИмяСпискаДокумента",   МетаданныеРасходовУСН.ИмяСпискаДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("НомерСтрокиДокумента", МетаданныеРасходовУСН.НомерСтрокиДокумента.Тип);
	ПустаяТаблица.Колонки.Добавить("ВидРасхода",           МетаданныеРасходовУСН.ВидРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ЭлементРасхода",       МетаданныеРасходовУСН.ЭлементРасхода.Тип);
	ПустаяТаблица.Колонки.Добавить("ОтражениеВУСН",        МетаданныеРасходовУСН.ОтражениеВУСН.Тип);
	ПустаяТаблица.Колонки.Добавить("СчетРасчетов",         МетаданныеРасходовУСН.СчетРасчетов.Тип);
	ПустаяТаблица.Колонки.Добавить("Контрагент",           МетаданныеРасходовУСН.Контрагент.Тип);
	ПустаяТаблица.Колонки.Добавить("Договор",              МетаданныеРасходовУСН.Договор.Тип);
	ПустаяТаблица.Колонки.Добавить("ДокументРасчетов",     МетаданныеРасходовУСН.ДокументРасчетов.Тип);
	
	// Стоимость вложений во внеоборотные активы.
	ПустаяТаблица.Колонки.Добавить("Валюта",                  Новый ОписаниеТипов("СправочникСсылка.Валюты")); // Валюта расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаМодернизацияОсновныхСредствУСН(ТаблицаОСиНМА, Документ, Реквизиты, Отказ) Экспорт
	
	ТаблицаМодернизацииОСиНМА       = ПустаяТаблицаМодернизацияОсновныхСредствУСН();
	ТаблицаАмортизируемогоИмущества = ПустаяТаблицаМодернизацияОсновныхСредствУСН();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
		Возврат ТаблицаМодернизацииОСиНМА;
	КонецЕсли;
	
	Если Документ.ВидОперации <> Перечисления.ВидыОперацийРеконструкцияОС.МодернизацияОС Тогда
		// Согласно пп. 1 п. 1 ст. 346.16 НК РФ налогоплательщик уменьшает полученные доходы
		// на расходы на достройку, дооборудование, реконструкцию, модернизацию и техническое перевооружение ОС.
		// Модернизация НМА не предусмотрена гл. 26.2 НК РФ. Кап. ремонт в УСН не отражается.
		Возврат ТаблицаМодернизацииОСиНМА;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Получим все остатки расходов УСН по указанному в документе внеоборотному активу.
	СчетаВложенийВоВнеоборотныеАктивыУСН = БухгалтерскийУчет.СписокСчетов("У08.ПО,У08.П");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("СубконтоРасходов2", Документ.ВнеоборотныйАктив);
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", Документ.ИФО);
	КонецЕсли;
	//Если Реквизиты.ИспользоватьУчетПоПодразделениям Тогда
	//	ОтборРасходов.Вставить("Подразделение", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
	//		ТаблицаОСиНМА.ВыгрузитьКолонку("Подразделение")));
	//КонецЕсли;
	ОтборРасходов.Вставить("КФО", Документ.КФО);
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков, СчетаВложенийВоВнеоборотныеАктивыУСН, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "Партия", "ДатаДокументаПартии");
	
	// Распределим аккумулированные кап. вложения по объектам ОС и НМА.
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ТаблицаОСиНМА.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы);
	ТаблицаОСиНМА.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы);
	
	ТаблицаОСиНМА.Колонки.Добавить("БазаРаспределения", ОписаниеТипаСуммы);
	Для Каждого СтрокаОСиНМА Из ТаблицаОСиНМА Цикл
		СтрокаОСиНМА.БазаРаспределения = // Пропорционально сумме вложений, отнесенной на строку.
			СтрокаОСиНМА.СуммаМодернизации
			+ СтрокаОСиНМА.СуммаДемонтажа
			+ СтрокаОСиНМА.СуммаТранспортировки;
	КонецЦикла;
	
	Для Каждого ОстатокВложений Из ОстаткиРасходовУСН Цикл
		
		// Cуммы кап.вложений распределяем по модернизируемым объектам ОС и НМА.
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ОстатокВложений.СуммаВал,
			ТаблицаОСиНМА, "СуммаВал", "БазаРаспределения");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ОстатокВложений.СуммаРуб,
			ТаблицаОСиНМА, "СуммаРуб", "БазаРаспределения");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ОстатокВложений.СуммаНеУчитываетсяНУРуб,
			ТаблицаОСиНМА, "СуммаНеУчитываетсяНУРуб", "БазаРаспределения");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ОстатокВложений.СуммаЕНВДРуб,
			ТаблицаОСиНМА, "СуммаЕНВДРуб", "БазаРаспределения");
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(ОстатокВложений.СуммаНДСРуб,
			ТаблицаОСиНМА, "СуммаНДСРуб", "БазаРаспределения");
		
		Для Каждого СтрокаОСиНМА Из ТаблицаОСиНМА Цикл
			
			ПорядокВключенияСтоимостиВСоставРасходовУСН = СтрокаОСиНМА.ПорядокВключенияСтоимостиВСоставРасходовУСН;
			
			Если ПорядокВключенияСтоимостиВСоставРасходовУСН =
					Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
				НоваяСтрока = ТаблицаАмортизируемогоИмущества.Добавить();
			Иначе
				НоваяСтрока = ТаблицаМодернизацииОСиНМА.Добавить();
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстатокВложений,
				"ИФО,КФО,КПС,Подразделение,Валюта,СчетРасчетов,Контрагент,Договор,ДокументРасчетов,ОтражениеВУСН");
			
			НоваяСтрока.СчетВложенийУСН = ОстатокВложений.СчетУчетаУСН;
			НоваяСтрока.КапВложенияУСН  = ОстатокВложений.РасходыУСН;
			НоваяСтрока.ОбъектВложений  = ОстатокВложений.СубконтоРасходов2;
			
			СвойстваСчетаВложений = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяСтрока.СчетВложенийУСН);
			Если СвойстваСчетаВложений.ВидСубконто3 = ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН Тогда
				НоваяСтрока.ДокументОплаты  = ОстатокВложений.СубконтоРасходов3;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОСиНМА,
				"ИмяСписка,СинонимСписка,НомерСтроки,
				|СуммаВал,СуммаРуб,СуммаНеУчитываетсяНУРуб,СуммаЕНВДРуб,СуммаНДСРуб");
			
			Если ПорядокВключенияСтоимостиВСоставРасходовУСН =
					Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
				
				// Расходы УСН учитываем по новому объекту ОС, НМА, НПА.
				НоваяСтрока.ОсновноеСредство = СтрокаОСиНМА.ОсновноеСредство;
				
				// Заполним реквизиты для формирования новых элементов учета расходов УСН.
				НоваяСтрока.Партия               = Документ;
				НоваяСтрока.ИмяСпискаДокумента   = СтрокаОСиНМА.ИмяСписка;
				НоваяСтрока.НомерСтрокиДокумента = СтрокаОСиНМА.НомерСтроки;
				
				Если СтрокаОСиНМА.ОсновноеСредство.ВидНФА = Перечисления.ВидыНФА.НМА Тогда
					НоваяСтрока.ВидРасхода     = Перечисления.ВидыРасходовУСН.НМА;
					НоваяСтрока.ЭлементРасхода = СтрокаОСиНМА.ОсновноеСредство;
				Иначе
					НоваяСтрока.ВидРасхода     = Перечисления.ВидыРасходовУСН.ОС;
					Если ЗначениеЗаполнено(СтрокаОСиНМА.ИнвентарныйНомер) Тогда
						НоваяСтрока.ЭлементРасхода = СтрокаОСиНМА.ИнвентарныйНомер;
					Иначе
						НоваяСтрока.ЭлементРасхода = СтрокаОСиНМА.ОсновноеСредство;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
			
				// Расходы УСН учитываем по тому же объекту вложений.
				НоваяСтрока.ОсновноеСредство = ОстатокВложений.СубконтоРасходов2;
				
				// Новые элементы учета расходов УСН не формируем.
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстатокВложений,
					"Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,ВидРасхода,ЭлементРасхода,РасходыУСН");
				
			КонецЕсли;
			
			НоваяСтрока.СчетУчетаУСН = СчетРасходовУСНприПринятииКУчетуОсновныхСредствУСН(
				НоваяСтрока.СчетВложенийУСН,
				НоваяСтрока.ОсновноеСредство,
				СтрокаОСиНМА.СостояниеОС = Перечисления.СостоянияОС.ВведеноВЭксплуатацию,
				ПорядокВключенияСтоимостиВСоставРасходовУСН);
			
		КонецЦикла;
		
	КонецЦикла;
	
	СформироватьЭлементыУчетаРасходовУСН(Документ, ТаблицаАмортизируемогоИмущества);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаАмортизируемогоИмущества, ТаблицаМодернизацииОСиНМА);
	ТаблицаМодернизацииОСиНМА.Сортировать("ИмяСписка,НомерСтроки");
	
	Возврат ТаблицаМодернизацииОСиНМА;
	
КонецФункции

// Ввод в эксплуатацию ОС в УСН

// Подготавливает таблицу по документу ввода в эксплуатацию ОС (для целей УСН).
//
Функция ПодготовитьТаблицуВводВЭксплуатациюОсновныхСредствПоДокументу(Документ, Параметры = Неопределено) Экспорт
	
	ОписаниеТипаКоличества = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	ТаблицаДокумента = Новый ТаблицаЗначений;
	// Идентификация строки.
	ТаблицаДокумента.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаДокумента.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаДокумента.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Объект учета внеоборотных активов.
	ТаблицаДокумента.Колонки.Добавить("КФО",              Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаДокумента.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаДокумента.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаДокумента.Колонки.Добавить("Количество",       ОписаниеТипаКоличества);
	
	Если Документ.ВидОперацииДокумента <> 0 Тогда
		Возврат ТаблицаДокумента; // "0" - ввод в эксплуатацию.
	КонецЕсли;
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Документ.Организация, Документ.Дата) Тогда
		Возврат ТаблицаДокумента;
	КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(Запрос, "ОсновныеСредства",
		"НомерСтроки,КФО,ОсновноеСредство,ИнвентарныйНомер,Количество",
		Документ, Параметры);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""ОсновныеСредства"" КАК ИмяСписка,
	|	""Основные средства"" КАК СинонимСписка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.КФО КАК КФО,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Количество КАК Количество
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ОсновныеСредства
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ВводВЭкплуатациюОсновныхСредств = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДокумента Из ВводВЭкплуатациюОсновныхСредств Цикл
		НоваяСтрока = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
	КонецЦикла;
	
	Возврат ТаблицаДокумента;
	
КонецФункции

Функция ПустаяТаблицаВводВЭксплуатациюОсновныхСредствУСН() Экспорт

	ОписаниеТипаСуммы       = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества  = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТипаСубконто    = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Идентификация строки.
	ПустаяТаблица.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ПустаяТаблица.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расходов УСН на приобретение ОС.
	ПустаяТаблица.Колонки.Добавить("ОсновноеСредство",  Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",      Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("КорСчетУСН",        Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",        Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов2",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов2",     ОписаниеТипаСубконто);
	ПустаяТаблица.Колонки.Добавить("ВидСубконтоРасходов3",  ОписаниеТипаВидСубконто);
	ПустаяТаблица.Колонки.Добавить("СубконтоРасходов3",     ОписаниеТипаСубконто);
	
	// Количество и стоимость принимаемых вложений во внеоборотные активы.
	ПустаяТаблица.Колонки.Добавить("Количество",              ОписаниеТипаКоличества);
	ПустаяТаблица.Колонки.Добавить("Валюта",                  Новый ОписаниеТипов("СправочникСсылка.Валюты")); // Валюта расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаВал",                ОписаниеТипаСуммы); // Сумма в валюте расчетов.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы); // Сумма в рублях.
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы); // Сумма НДС в рублях.
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаВводВЭксплуатациюОсновныхСредствУСН(ТаблицаОС, Документ, Реквизиты, Отказ) Экспорт
	
	ТаблицаВведенныхВЭксплуатациюОС = ПустаяТаблицаВводВЭксплуатациюОсновныхСредствУСН();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
		Возврат ТаблицаВведенныхВЭксплуатациюОС;
	КонецЕсли;
	
	Реквизиты.Вставить("ИспользоватьУчетПоИФО",            ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	Реквизиты.Вставить("ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Реквизиты.Вставить("ИспользоватьВалютныйУчет",         ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	// Получим все остатки расходов УСН по указанным в документе объектам ОС.
	СчетаНеВведенныхВЭксплуатациюОсновныхСредствУСН = БухгалтерскийУчет.СписокСчетов("У01.ВО,У01.В");
	
	ОтборРасходов = Новый Структура;
	ОтборРасходов.Вставить("СубконтоРасходов2", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОС.ВыгрузитьКолонку("ОсновноеСредство")));
	
	Если Реквизиты.ИспользоватьУчетПоИФО Тогда
		ОтборРасходов.Вставить("ИФО", Документ.ИФО);
	КонецЕсли;
	//Если Реквизиты.ИспользоватьУчетПоПодразделениям Тогда
	//	ОтборРасходов.Вставить("Подразделение", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
	//		ТаблицаОС.ВыгрузитьКолонку("Подразделение")));
	//КонецЕсли;
	ОтборРасходов.Вставить("КФО", ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(
		ТаблицаОС.ВыгрузитьКолонку("КФО")));
	
	ПериодОстатков = ?(Реквизиты.Свойство("ПериодОстатков"), Реквизиты.ПериодОстатков,
		Новый Граница(Реквизиты.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	ОстаткиРасходовУСН = ОстаткиРасходовУСН(ПериодОстатков,
		СчетаНеВведенныхВЭксплуатациюОсновныхСредствУСН, ОтборРасходов, Реквизиты);
	ОбщегоНазначенияБГУ.УпорядочитьТаблицуПоДокументу(ОстаткиРасходовУСН, "Партия", "ДатаДокументаПартии");
	
	Для Каждого СтрокаОС Из ТаблицаОС Цикл
		
		Если СтрокаОС.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура("КФО,СубконтоРасходов2",
			СтрокаОС.КФО, СтрокаОС.ОсновноеСредство);
		
		ОстаткиРасходовПоОбъектуОС = ОстаткиРасходовУСН.НайтиСтроки(Отбор);
		Для Каждого РасходУСН Из ОстаткиРасходовПоОбъектуОС Цикл
			
			НоваяСтрока = ТаблицаВведенныхВЭксплуатациюОС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОС,
				"ИмяСписка,СинонимСписка,НомерСтроки,ОсновноеСредство");
			ЗаполнитьЗначенияСвойств(НоваяСтрока, РасходУСН,
				"ИФО,КФО,КПС,Подразделение,СчетУчетаУСН,РасходыУСН,Валюта,
				|Количество,СуммаВал,СуммаРуб,СуммаНеУчитываетсяНУРуб,СуммаЕНВДРуб,СуммаНДСРуб");
			
			СвойстваСчетаУчетаУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(РасходУСН.СчетУчетаУСН);
			НоваяСтрока.ВидСубконтоРасходов2 = СвойстваСчетаУчетаУСН.ВидСубконто1;
			НоваяСтрока.СубконтоРасходов2    = РасходУСН.СубконтоРасходов2;
			НоваяСтрока.ВидСубконтоРасходов3 = СвойстваСчетаУчетаУСН.ВидСубконто3;
			НоваяСтрока.СубконтоРасходов3    = РасходУСН.СубконтоРасходов3;
			
			НоваяСтрока.КорСчетУСН = СчетРасходовУСНприВводеВЭксплуатациюОсновныхСредствУСН(РасходУСН.СчетУчетаУСН);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаВведенныхВЭксплуатациюОС;
	
КонецФункции

Функция СчетРасходовУСНприВводеВЭксплуатациюОсновныхСредствУСН(СчетУчетаУСН)
	
	КодСчетаУчетаУСН = Строка(СчетУчетаУСН);
	
	// ОС: не Введены в эксплуатацию, не Оплачены.
	Если Найти(КодСчетаУчетаУСН, "У01.ВО") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.О"); // Не меняем статус оплаты.
		
	// ОС: не Введены в эксплуатацию, Оплачены.
	ИначеЕсли Найти(КодСчетаУчетаУСН, "У01.В") Тогда
		
		Возврат БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У01.П"); // Не меняем статус оплаты.
		
	Иначе
		
		Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

// Признание расходов на ОС и НМА

Функция ПустаяТаблицаПризнанныхРасходовНаПриобретениеОсновныхСредствУСН() Экспорт

	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПустаяТаблица = Новый ТаблицаЗначений;
	
	// Общие разрезы учета.
	ПустаяТаблица.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПустаяТаблица.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ПустаяТаблица.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ПустаяТаблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// Счет и аналитика учета расходов на ОС и НМА.
	ПустаяТаблица.Колонки.Добавить("СчетУчетаУСН",     Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПустаяТаблица.Колонки.Добавить("РасходыУСН",       Новый ОписаниеТипов("СправочникСсылка.РасходыУСН"));
	ПустаяТаблица.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ПустаяТаблица.Колонки.Добавить("ДокументОплаты",
		ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	
	// Суммы расходов к списанию.
	ПустаяТаблица.Колонки.Добавить("СуммаРуб",                ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаНеУчитываетсяНУРуб", ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаЕНВДРуб",            ОписаниеТипаСуммы);
	ПустаяТаблица.Колонки.Добавить("СуммаНДСРуб",             ОписаниеТипаСуммы);
	
	Возврат ПустаяТаблица;

КонецФункции

Функция ТаблицаПризнанныхРасходовНаПриобретениеОсновныхСредствУСН(Реквизиты) Экспорт
	
	ТаблицаПризнанныхРасходов = ПустаяТаблицаПризнанныхРасходовНаПриобретениеОсновныхСредствУСН();
	
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Реквизиты.Организация, Реквизиты.Дата) Тогда
		Возврат ТаблицаПризнанныхРасходов;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОСиНМА.НомерСтроки,
	|	ОСиНМА.ИдСтроки КАК ИдСтроки,
	|	ОСиНМА.ИФО,
	|	ОСиНМА.КФО,
	|	ОСиНМА.КПС,
	|	ОСиНМА.Подразделение,
	|	ОСиНМА.ОсновноеСредство,
	|	ОСиНМА.ДокументОплаты
	|ПОМЕСТИТЬ ОСиНМА
	|ИЗ
	|	Документ.РасчетРасходовНаОСиНМАПриУСН.ОСиНМА КАК ОСиНМА
	|ГДЕ
	|	ОСиНМА.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнанныеРасходыУСН.НомерСтроки,
	|	ПризнанныеРасходыУСН.ИдСтроки КАК ИдСтроки,
	|	ПризнанныеРасходыУСН.СчетУчета,
	|	ПризнанныеРасходыУСН.РасходыУСН,
	|	ПризнанныеРасходыУСН.СписатьСумма,
	|	ПризнанныеРасходыУСН.СписатьНДС,
	|	ПризнанныеРасходыУСН.СписатьНеУчитываетсяНУ,
	|	ПризнанныеРасходыУСН.СписатьЕНВД
	|ПОМЕСТИТЬ ПризнанныеРасходыУСН
	|ИЗ
	|	Документ.РасчетРасходовНаОСиНМАПриУСН.ПризнанныеРасходыУСН КАК ПризнанныеРасходыУСН
	|ГДЕ
	|	ПризнанныеРасходыУСН.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОСиНМА.НомерСтроки КАК НомерСтрокиОС,
	|	ОСиНМА.ИдСтроки,
	|	ОСиНМА.ИФО,
	|	ОСиНМА.КФО,
	|	ОСиНМА.КПС,
	|	ОСиНМА.Подразделение,
	|	ОСиНМА.ОсновноеСредство,
	|	ОСиНМА.ДокументОплаты,
	|	ПризнанныеРасходыУСН.НомерСтроки КАК НомерСтрокиРасходов,
	|	ПризнанныеРасходыУСН.СчетУчета КАК СчетУчетаУСН,
	|	ПризнанныеРасходыУСН.РасходыУСН КАК РасходыУСН,
	|	ПризнанныеРасходыУСН.СписатьСумма,
	|	ПризнанныеРасходыУСН.СписатьНДС,
	|	ПризнанныеРасходыУСН.СписатьНеУчитываетсяНУ,
	|	ПризнанныеРасходыУСН.СписатьЕНВД
	|ИЗ
	|	ОСиНМА КАК ОСиНМА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПризнанныеРасходыУСН КАК ПризнанныеРасходыУСН
	|		ПО ОСиНМА.ИдСтроки = ПризнанныеРасходыУСН.ИдСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтрокиОС,
	|	НомерСтрокиРасходов";
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СписатьСумма = 0
		   И Выборка.СписатьНДС = 0
		   И Выборка.СписатьНеУчитываетсяНУ = 0
		   И Выборка.СписатьЕНВД = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПризнанныхРасходов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка,
			"ИФО,КФО,КПС,Подразделение,СчетУчетаУСН,РасходыУСН,ОсновноеСредство,ДокументОплаты");
		
		НоваяСтрока.СуммаРуб                = Выборка.СписатьСумма;
		НоваяСтрока.СуммаНДСРуб             = Выборка.СписатьНДС;
		НоваяСтрока.СуммаНеУчитываетсяНУРуб = Выборка.СписатьНеУчитываетсяНУ;
		НоваяСтрока.СуммаЕНВДРуб            = Выборка.СписатьЕНВД;
		
	КонецЦикла;
	
	Возврат ТаблицаПризнанныхРасходов;
	
КонецФункции

Процедура ПроверитьКорректностьЗаполненияТаблицыРасходовНаОСиНМА(ДокументОбъект, Отказ) Экспорт
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(
		ДокументОбъект.Организация, ДокументОбъект.Дата);
	Если НЕ УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеТабЧастиОСиНМА = ДокументОбъект.Метаданные().ТабличныеЧасти.ОСиНМА;
	
	Для Каждого СтрокаОСиНМА Из ДокументОбъект.ОСиНМА Цикл
	
		Если СтрокаОСиНМА.РасходыПроизведеныДоПереходаНаУСН Тогда
			
			Если ЗначениеЗаполнено(СтрокаОСиНМА.ПервоначальнаяСтоимость) Тогда
				
				ТекстОшибки = НСтр("ru='
					|Графа 6 ""Первоначальная стоимость"" раздела II КУДиР не заполняется по ОС и НМА, приобретенным (изготовленным, сооруженным, созданным) до перехода на УСН.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					МетаданныеТабЧастиОСиНМА.Реквизиты.ПервоначальнаяСтоимость.Синоним,
					СтрокаОСиНМА.НомерСтроки,
					МетаданныеТабЧастиОСиНМА.Синоним,
					ТекстОшибки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка,
					"ОСиНМА[" + Формат(СтрокаОСиНМА.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ПервоначальнаяСтоимость", "Объект", Отказ);
				
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(СтрокаОСиНМА.СрокПолезногоИспользования) Тогда
				
				ТекстОшибки = НСтр("ru='
					|Графа 7 ""Срок полезного использования"" раздела II КУДиР не заполняется по ОС и НМА, приобретенным (изготовленным, сооруженным, созданным) в период применения УСН.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					МетаданныеТабЧастиОСиНМА.Реквизиты.СрокПолезногоИспользования.Синоним,
					СтрокаОСиНМА.НомерСтроки,
					МетаданныеТабЧастиОСиНМА.Синоним,
					ТекстОшибки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка,
					"ОСиНМА[" + Формат(СтрокаОСиНМА.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].СрокПолезногоИспользования", "Объект", Отказ);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОСиНМА.ОстаточнаяСтоимость) Тогда
				
				ТекстОшибки = НСтр("ru='
					|Графа 8 ""Остаточная стоимость"" раздела II КУДиР не заполняется по ОС и НМА, приобретенным (изготовленным, сооруженным, созданным) в период применения УСН.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					МетаданныеТабЧастиОСиНМА.Реквизиты.ОстаточнаяСтоимость.Синоним,
					СтрокаОСиНМА.НомерСтроки,
					МетаданныеТабЧастиОСиНМА.Синоним,
					ТекстОшибки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка,
					"ОСиНМА[" + Формат(СтрокаОСиНМА.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ОстаточнаяСтоимость", "Объект", Отказ);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОСиНМА.РасходыПрошлыхПериодов) Тогда
				
				ТекстОшибки = НСтр("ru='
					|Графа 14 ""Включено в расходы за предыдущие налоговые периоды"" раздела II КУДиР не заполняется по ОС и НМА, приобретенным (изготовленным, сооруженным, созданным) в период применения УСН.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					МетаданныеТабЧастиОСиНМА.Реквизиты.РасходыПрошлыхПериодов.Синоним,
					СтрокаОСиНМА.НомерСтроки,
					МетаданныеТабЧастиОСиНМА.Синоним,
					ТекстОшибки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка,
					"ОСиНМА[" + Формат(СтрокаОСиНМА.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].РасходыПрошлыхПериодов", "Объект", Отказ);
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаОСиНМА.ОставшаясяЧастьРасходов) Тогда
				
				ТекстОшибки = НСтр("ru='
					|Графа 15 ""Оставшая часть расходов"" раздела II КУДиР не заполняется по ОС и НМА, приобретенным (изготовленным, сооруженным, созданным) в период применения УСН.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					МетаданныеТабЧастиОСиНМА.Реквизиты.ОставшаясяЧастьРасходов.Синоним,
					СтрокаОСиНМА.НомерСтроки,
					МетаданныеТабЧастиОСиНМА.Синоним,
					ТекстОшибки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка,
					"ОСиНМА[" + Формат(СтрокаОСиНМА.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ОставшаясяЧастьРасходов", "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеПолейТаблицыРасходовНаОСиНМА(УсловноеОформление) Экспорт
	
	// Расходы произведены до перехода на УСН.
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОСиНМАПервоначальнаяСтоимость");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.РасходыПроизведеныДоПереходаНаУСН", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.ПервоначальнаяСтоимость", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не заполняется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Расходы произведены в период применения УСН.
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОСиНМАСрокПолезногоИспользования");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.РасходыПроизведеныДоПереходаНаУСН", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.СрокПолезногоИспользования", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не заполняется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОСиНМАОстаточнаяСтоимость");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.РасходыПроизведеныДоПереходаНаУСН", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.ОстаточнаяСтоимость", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не заполняется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОСиНМАРасходыПрошлыхПериодов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.РасходыПроизведеныДоПереходаНаУСН", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.РасходыПрошлыхПериодов", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не заполняется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОСиНМАОставшаясяЧастьРасходов");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.РасходыПроизведеныДоПереходаНаУСН", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОСиНМА.ОставшаясяЧастьРасходов", ВидСравненияКомпоновкиДанных.Равно, 0);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не заполняется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

// Остатки

// Возвращает таблицу с остатками расходов УСН
//
Функция ОстаткиРасходовУСН(Период, СчетаРасходов, ОтборРасходов, Реквизиты) Экспорт
	
	// Блокируем регистр бухгалтерии для получения остатков.
	УстанавливатьБлокировку = ?(Реквизиты.Свойство("ТиповаяОперация"), Реквизиты.ТиповаяОперация.УстанавливатьБлокировку, Ложь);
	Если УстанавливатьБлокировку Тогда
		
	//	Блокировка = Новый БлокировкаДанных;
	//	
	//	Блокировка.Заблокировать();
		
	КонецЕсли;
	
	// Получаем остатки
	
	Запрос = Новый Запрос;
	
	УсловияОтбораРасходовПоРеквизитам = "";
	УсловияОтбораРасходовПоОстаткам = "";
	ЕстьОтборРасходов = (ЗначениеЗаполнено(ОтборРасходов) И ОтборРасходов.Количество() > 0);
	Если ЕстьОтборРасходов Тогда
		
		РеквизитыСправочникаРасходыУСН = "ВидРасхода,ЭлементРасхода,Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,
			|ОтражениеВУСН,СчетРасчетов,Контрагент,Договор,ДокументРасчетов";
		
		Для Каждого ЭлементОтбора Из ОтборРасходов Цикл
			
			Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
			Если Найти(РеквизитыСправочникаРасходыУСН, ЭлементОтбора.Ключ) > 0 Тогда
				УсловияОтбораРасходовПоРеквизитам = УсловияОтбораРасходовПоРеквизитам
					+ ?(ПустаяСтрока(УсловияОтбораРасходовПоРеквизитам), "", " И ")
					+ "РасходыУСН." + ЭлементОтбора.Ключ + " В (&" + ЭлементОтбора.Ключ + ")";
			Иначе
				УсловияОтбораРасходовПоОстаткам = УсловияОтбораРасходовПоОстаткам
					+ ?(ПустаяСтрока(УсловияОтбораРасходовПоОстаткам), "", " И ")
					+ "ОстаткиРасходовУСН." + ЭлементОтбора.Ключ + " В (&" + ЭлементОтбора.Ключ + ")";
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(УсловияОтбораРасходовПоРеквизитам) Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходыУСН.Ссылка КАК РасходУСН
			|ПОМЕСТИТЬ ОтборРасходовУСН
			|ИЗ
			|	Справочник.РасходыУСН КАК РасходыУСН
			|ГДЕ
			|	РасходыУСН.Организация = &Организация
			|	И &УсловияОтбораРасходовПоРеквизитам
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РасходУСН";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбораРасходовПоРеквизитам",
				УсловияОтбораРасходовПоРеквизитам);
			Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	Остатки.Организация КАК Организация,
	|	ЕСТЬNULL(Остатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	Остатки.КФО КАК КФО,
	|	ЕСТЬNULL(Остатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЕСТЬNULL(Остатки.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	Остатки.Счет КАК СчетУчетаУСН,
	|	ВЫРАЗИТЬ(Остатки.Субконто2 КАК Справочник.РасходыУСН) КАК РасходыУСН,
	|	Остатки.Субконто1 КАК СубконтоРасходов2,
	|	Остатки.Субконто3 КАК СубконтоРасходов3,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.Валюта
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.Количественный
	|			ТОГДА Остатки.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ Остатки.СуммаОстаток + Остатки.СуммаНеУчитываетсяНУОстаток + Остатки.СуммаЕНВДОстаток + Остатки.СуммаНДСОстаток
	|	КОНЕЦ КАК СуммаВал,
	|	Остатки.СуммаОстаток КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.НалоговыйУчетНеУчитываемых
	|			ТОГДА Остатки.СуммаНеУчитываетсяНУОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНеУчитываетсяНУРуб,
	|	ВЫБОР
	|		КОГДА &ПлательщикЕНВД
	|				И Остатки.Счет.НалоговыйУчетЕНВД
	|			ТОГДА Остатки.СуммаЕНВДОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЕНВДРуб,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.НалоговыйУчетНДС
	|			ТОГДА Остатки.СуммаНДСОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДСРуб
	|ПОМЕСТИТЬ ОстаткиРасходовУСН
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СчетаРасходовУСН),
	|			,
	|			Организация = &Организация
	|				И КФО В (&КФО)
	|				И &УсловиеИФО
	|				И &УсловиеОтбораРасходовУСН) КАК Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиРасходовУСН.Организация КАК Организация,
	|	ОстаткиРасходовУСН.ИФО КАК ИФО,
	|	ОстаткиРасходовУСН.КФО КАК КФО,
	|	ОстаткиРасходовУСН.КПС КАК КПС,
	|	ОстаткиРасходовУСН.Подразделение КАК Подразделение,
	|	ОстаткиРасходовУСН.СчетУчетаУСН КАК СчетУчетаУСН,
	|	ОстаткиРасходовУСН.РасходыУСН.ВидРасхода КАК ВидРасхода,
	|	ОстаткиРасходовУСН.РасходыУСН.ЭлементРасхода КАК ЭлементРасхода,
	|	ОстаткиРасходовУСН.РасходыУСН.Партия КАК Партия,
	|	ОстаткиРасходовУСН.РасходыУСН.ИмяСпискаДокумента КАК ИмяСпискаДокумента,
	|	ОстаткиРасходовУСН.РасходыУСН.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
	|	ОстаткиРасходовУСН.РасходыУСН.ОтражениеВУСН КАК ОтражениеВУСН,
	|	ОстаткиРасходовУСН.РасходыУСН.СчетРасчетов КАК СчетРасчетов,
	|	ОстаткиРасходовУСН.РасходыУСН.Контрагент КАК Контрагент,
	|	ОстаткиРасходовУСН.РасходыУСН.Договор КАК Договор,
	|	ОстаткиРасходовУСН.РасходыУСН.ДокументРасчетов КАК ДокументРасчетов,
	|	ОстаткиРасходовУСН.РасходыУСН КАК РасходыУСН,
	|	ОстаткиРасходовУСН.СубконтоРасходов2,
	|	ОстаткиРасходовУСН.СубконтоРасходов3,
	|	ОстаткиРасходовУСН.Валюта,
	|	ОстаткиРасходовУСН.Количество,
	|	ОстаткиРасходовУСН.СуммаВал,
	|	ОстаткиРасходовУСН.СуммаРуб,
	|	ОстаткиРасходовУСН.СуммаНеУчитываетсяНУРуб,
	|	ОстаткиРасходовУСН.СуммаЕНВДРуб,
	|	ОстаткиРасходовУСН.СуммаНДСРуб
	|ИЗ
	|	ОстаткиРасходовУСН КАК ОстаткиРасходовУСН
	|ГДЕ
	|	&УсловияОтбораРасходовПоОстаткам";
	
	Запрос.УстановитьПараметр("Период",      Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
	Запрос.УстановитьПараметр("СчетаРасходовУСН", СчетаРасходов);
	
	Если ЕстьОтборРасходов Тогда
		
		Если ПустаяСтрока(УсловияОтбораРасходовПоРеквизитам) Тогда
			Запрос.УстановитьПараметр("УсловиеОтбораРасходовУСН", Истина);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораРасходовУСН",
				"Субконто2 В (ВЫБРАТЬ ОтборРасходовУСН.РасходУСН ИЗ ОтборРасходовУСН)");
		КонецЕсли;
		
		Если ПустаяСтрока(УсловияОтбораРасходовПоОстаткам) Тогда
			Запрос.УстановитьПараметр("УсловияОтбораРасходовПоОстаткам", Истина);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбораРасходовПоОстаткам",
				УсловияОтбораРасходовПоОстаткам);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("КФО", УчетУСНКлиентСервер.МассивКФОдляНалоговогоУчетаУСН());
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	ПоВсемИФО = Реквизиты.Свойство("ПоВсемИФО") И Реквизиты.ПоВсемИФО;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО",
		?(ИспользоватьУчетПоИФО И НЕ ПоВсемИФО, "ИФО В (&ИФО)", "ИСТИНА") );
	
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Реквизиты.Организация, Реквизиты.Дата);
	Запрос.УстановитьПараметр("ПлательщикЕНВД", УчетнаяПолитика.ПлательщикЕНВД);
	
	ОстаткиРасходов = Запрос.Выполнить().Выгрузить();
	
	Возврат ОстаткиРасходов;
	
КонецФункции

// Возвращает таблицу с остатками прочих расчетов УСН
//
Функция ОстаткиПрочихРасчетовУСН(Период, СчетаРасчетов, ОтборРасчетов, Реквизиты) Экспорт
	
	// Блокируем регистр бухгалтерии для получения остатков.
	УстанавливатьБлокировку = ?(Реквизиты.Свойство("ТиповаяОперация"), Реквизиты.ТиповаяОперация.УстанавливатьБлокировку, Ложь);
	Если УстанавливатьБлокировку Тогда
		
	//	Блокировка = Новый БлокировкаДанных;
	//	
	//	Блокировка.Заблокировать();
		
	КонецЕсли;
	
	// Получаем остатки
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	Остатки.Организация КАК Организация,
	|	ЕСТЬNULL(Остатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	Остатки.КФО КАК КФО,
	|	ЕСТЬNULL(Остатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
	|	ЕСТЬNULL(Остатки.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	Остатки.Счет КАК СчетРасчетов,
	|	Остатки.Субконто1 КАК Субконто1,
	|	Остатки.Субконто2 КАК Субконто2,
	|	Остатки.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.Валюта
	|		ИНАЧЕ &ВалютаРеглУчета
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет
	|				И Остатки.Счет.Валютный
	|			ТОГДА Остатки.ВалютнаяСуммаОстаток
	|		ИНАЧЕ Остатки.СуммаОстаток + Остатки.СуммаНеУчитываетсяНУОстаток + Остатки.СуммаЕНВДОстаток + Остатки.СуммаНДСОстаток
	|	КОНЕЦ КАК СуммаВал,
	|	Остатки.СуммаОстаток КАК СуммаРуб,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.НалоговыйУчетНеУчитываемых
	|			ТОГДА Остатки.СуммаНеУчитываетсяНУОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНеУчитываетсяНУРуб,
	|	ВЫБОР
	|		КОГДА &ПлательщикЕНВД
	|				И Остатки.Счет.НалоговыйУчетЕНВД
	|			ТОГДА Остатки.СуммаЕНВДОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаЕНВДРуб,
	|	ВЫБОР
	|		КОГДА Остатки.Счет.НалоговыйУчетНДС
	|			ТОГДА Остатки.СуммаНДСОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДСРуб
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СчетаРасчетов),
	|			,
	|			Организация = &Организация
	|				И КФО В (&КФО)
	|				И &УсловиеИФО
	|				И &УсловиеОтбораРасчетовУСН) КАК Остатки";
	
	Запрос.УстановитьПараметр("Период",      Период);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	
	Запрос.УстановитьПараметр("СчетаРасчетов", СчетаРасчетов);
	
	ЕстьОтборРасчетов = (ЗначениеЗаполнено(ОтборРасчетов) И ОтборРасчетов.Количество() > 0);
	Если ЕстьОтборРасчетов Тогда
		
		УсловияОтбораРасчетов = "";
		Для Каждого ЭлементОтбора Из ОтборРасчетов Цикл
			
			Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
			
			Если Найти("ИФО,КФО", ЭлементОтбора.Ключ) = 0 Тогда
				УсловияОтбораРасчетов = УсловияОтбораРасчетов
					+ ?(ПустаяСтрока(УсловияОтбораРасчетов), "", " И ")
					+ ЭлементОтбора.Ключ + " В (&" + ЭлементОтбора.Ключ + ")";
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	Если ЕстьОтборРасчетов И НЕ ПустаяСтрока(УсловияОтбораРасчетов) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеОтбораРасчетовУСН", УсловияОтбораРасчетов);
	Иначе
		Запрос.УстановитьПараметр("УсловиеОтбораРасчетовУСН", Истина);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО",
		?(Реквизиты.ИспользоватьУчетПоИФО, "ИФО В (&ИФО)", "ИСТИНА") );
	
	Запрос.УстановитьПараметр("ИспользоватьВалютныйУчет", Реквизиты.ИспользоватьВалютныйУчет);
	Запрос.УстановитьПараметр("ПлательщикЕНВД", Реквизиты.ПлательщикЕНВД);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	ОстаткиРасчетов = Запрос.Выполнить().Выгрузить();
	
	// Добавим колонку "Документ расчетов".
	ВидСубконтоДокументыРасчетов = ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов;
	ОстаткиРасчетов.Колонки.Добавить("ДокументРасчетов", ВидСубконтоДокументыРасчетов.ТипЗначения);
	Для Каждого СтрокаОстатков Из ОстаткиРасчетов Цикл
		
		СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаОстатков.СчетРасчетов);
		Если СвойстваСчетаРасчетов.ВидСубконто1 = ВидСубконтоДокументыРасчетов Тогда
			НомерСубконтоДокументыРасчетов = 1;
		ИначеЕсли СвойстваСчетаРасчетов.ВидСубконто2 = ВидСубконтоДокументыРасчетов Тогда
			НомерСубконтоДокументыРасчетов = 2;
		ИначеЕсли СвойстваСчетаРасчетов.ВидСубконто3 = ВидСубконтоДокументыРасчетов Тогда
			НомерСубконтоДокументыРасчетов = 3;
		Иначе
			НомерСубконтоДокументыРасчетов = 0;
		КонецЕсли;
		Если НомерСубконтоДокументыРасчетов > 0 Тогда
			СтрокаОстатков.ДокументРасчетов = СтрокаОстатков["Субконто" + НомерСубконтоДокументыРасчетов];
		КонецЕсли;
		
		Если СвойстваСчетаРасчетов.Вид = ВидСчета.Пассивный Тогда
			// Меняем знак остатка для счета УД "Доходы по обычным видам деятельности (УСН)".
			СтрокаОстатков.СуммаВал                = (-1) * СтрокаОстатков.СуммаВал;
			СтрокаОстатков.СуммаРуб                = (-1) * СтрокаОстатков.СуммаРуб;
			СтрокаОстатков.СуммаНДСРуб             = (-1) * СтрокаОстатков.СуммаНДСРуб;
			СтрокаОстатков.СуммаНеУчитываетсяНУРуб = (-1) * СтрокаОстатков.СуммаНеУчитываетсяНУРуб;
			СтрокаОстатков.СуммаЕНВДРуб            = (-1) * СтрокаОстатков.СуммаЕНВДРуб;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОстаткиРасчетов;
	
КонецФункции

#КонецОбласти

#Область КнигаУчетаДоходовИРасходов

Процедура СформироватьДвиженияПоНалоговомуУчетуУСН(ДокументСсылка, НаборЗаписейРегистраБухгалтерии, ТаблицыДляДвижений = Неопределено) Экспорт
	
	ЗаписатьДвижения = (ТаблицыДляДвижений = Неопределено);
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	Если НЕ МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыНакопления.КнигаУчетаДоходовИРасходов)
	 ИЛИ МетаданныеДокумента.Имя = "ОперацияБух" Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСрезаУчетнойПолитики = ?(СтрНайти(МетаданныеДокумента.Имя, "ВводНачальныхОстатков")>0,
		КонецГода(ДокументСсылка.Дата) + 1, ДокументСсылка.Дата);
	Если НЕ УчетУСНВызовСервера.ПрименяетсяУСН(ДокументСсылка.Организация, ДатаСрезаУчетнойПолитики) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДвиженияУСН = Новый Структура;
	ДвиженияУСН.Вставить("КнигаУчетаДоходовИРасходов", РегистрыНакопления.КнигаУчетаДоходовИРасходов.СоздатьНаборЗаписей());
	ДвиженияУСН.Вставить("РасшифровкаКУДиР",           РегистрыСведений.РасшифровкаКУДиР.СоздатьНаборЗаписей());
	
	Если ЗаписатьДвижения Тогда
		
		Для Каждого РегистрУСН из ДвиженияУСН Цикл
			НаборЗаписей = РегистрУСН.Значение;
			НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() > 0 Тогда
				НаборЗаписей.Очистить();
			КонецЕсли;
			НаборЗаписей.Записывать = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	ОтразитьДоходыРасходыВКУДиР(ДвиженияУСН, ДокументСсылка, НаборЗаписейРегистраБухгалтерии);
	
	Если НЕ Отказ Тогда
		Для Каждого РегистрУСН из ДвиженияУСН Цикл
			Если РегистрУСН.Ключ = "РасшифровкаКУДиР"
				И НЕ МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыСведений.РасшифровкаКУДиР) Тогда
				Продолжить; // Некоторые документы не двигают регистр РасшифровкаКУДиР.
			Иначе
				НаборЗаписей = РегистрУСН.Значение;
				Если ЗаписатьДвижения Тогда
					НаборЗаписей.Записать(Истина);
				Иначе // Режим без записи движений.
					ТаблицыДляДвижений.Вставить(РегистрУСН.Ключ, НаборЗаписей.Выгрузить());
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьДоходыРасходыВКУДиР(ДвиженияУСН, ДокументСсылка, ПроводкиДокумента) Экспорт
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(
		ДокументСсылка.Организация,
		БухгалтерскийУчет.ДатаУстановкиУчетнойПолитики(ДокументСсылка.Организация, ДокументСсылка.Дата) );
	
	ОписаниеТипаСумм = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	МетаданныеРасходовУСН = Метаданные.Справочники.РасходыУСН.Реквизиты;
	МетаданныеДокумента   = ДокументСсылка.Метаданные();
	
	ДвиженияДенежныхСредств = Новый ТаблицаЗначений;
	// Общие разрезы учета.
	ДвиженияДенежныхСредств.Колонки.Добавить("Период",        Новый ОписаниеТипов("Дата"));
	ДвиженияДенежныхСредств.Колонки.Добавить("Организация",   Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ДвиженияДенежныхСредств.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ДвиженияДенежныхСредств.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	// Характеристики движения денежных средств.
	ДвиженияДенежныхСредств.Колонки.Добавить("ВидОперацииУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийУСН"));
	ДвиженияДенежныхСредств.Колонки.Добавить("СчетБУ",         Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДвиженияДенежныхСредств.Колонки.Добавить("Контрагент",     Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ДвиженияДенежныхСредств.Колонки.Добавить("Договор",        Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ДвиженияДенежныхСредств.Колонки.Добавить("ЦМО",            Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	ДвиженияДенежныхСредств.Колонки.Добавить("ВидНалога",      Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежей"));
	ДвиженияДенежныхСредств.Колонки.Добавить("Сумма",            ОписаниеТипаСумм);
	
	ПризнанныеДоходы  = Новый ТаблицаЗначений;
	// Общие разрезы учета.
	ПризнанныеДоходы.Колонки.Добавить("Период",        Новый ОписаниеТипов("Дата"));
	ПризнанныеДоходы.Колонки.Добавить("Организация",   Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ПризнанныеДоходы.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПризнанныеДоходы.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	// Характеристики доходов УСН.
	ПризнанныеДоходы.Колонки.Добавить("ВидОперацииУСН",      Новый ОписаниеТипов("Строка"));
	ПризнанныеДоходы.Колонки.Добавить("Контрагент",          Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ПризнанныеДоходы.Колонки.Добавить("Договор",             Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ПризнанныеДоходы.Колонки.Добавить("ЦМО",                 Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	ПризнанныеДоходы.Колонки.Добавить("ДокументОплаты",      ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	ПризнанныеДоходы.Колонки.Добавить("СчетДт",              Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПризнанныеДоходы.Колонки.Добавить("СчетКт",              Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПризнанныеДоходы.Колонки.Добавить("БазаРаспределения",   ОписаниеТипаСумм);
	ПризнанныеДоходы.Колонки.Добавить("ДоходыВсего",         ОписаниеТипаСумм);
	ПризнанныеДоходы.Колонки.Добавить("ДоходыУСН",           ОписаниеТипаСумм);
	ПризнанныеДоходы.Колонки.Добавить("ДоходыНеУчитываемые", ОписаниеТипаСумм);
	ПризнанныеДоходы.Колонки.Добавить("ДоходыЕНВД",          ОписаниеТипаСумм);
	
	ПризнанныеРасходы  = Новый ТаблицаЗначений;
	// Общие разрезы учета.
	ПризнанныеРасходы.Колонки.Добавить("Период",        Новый ОписаниеТипов("Дата"));
	ПризнанныеРасходы.Колонки.Добавить("Организация",   Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ПризнанныеРасходы.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ПризнанныеРасходы.Колонки.Добавить("КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	// Характеристики расходов УСН.
	ПризнанныеРасходы.Колонки.Добавить("ДокументОплаты",       ПланыВидовХарактеристик.ВидыСубконто.ДокументыОплатыУСН.ТипЗначения);
	ПризнанныеРасходы.Колонки.Добавить("Контрагент",           МетаданныеРасходовУСН.Контрагент.Тип);
	ПризнанныеРасходы.Колонки.Добавить("Договор",              МетаданныеРасходовУСН.Договор.Тип);
	ПризнанныеРасходы.Колонки.Добавить("ВидРасхода",           МетаданныеРасходовУСН.ВидРасхода.Тип);
	ПризнанныеРасходы.Колонки.Добавить("ЭлементРасхода",       МетаданныеРасходовУСН.ЭлементРасхода.Тип);
	ПризнанныеРасходы.Колонки.Добавить("Партия",               МетаданныеРасходовУСН.Партия.Тип);
	ПризнанныеРасходы.Колонки.Добавить("ИмяСпискаДокумента",   МетаданныеРасходовУСН.ИмяСпискаДокумента.Тип);
	ПризнанныеРасходы.Колонки.Добавить("НомерСтрокиДокумента", МетаданныеРасходовУСН.НомерСтрокиДокумента.Тип);
	ПризнанныеРасходы.Колонки.Добавить("СчетДт",               Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПризнанныеРасходы.Колонки.Добавить("СчетКт",               Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ПризнанныеРасходы.Колонки.Добавить("ОписаниеРасходов",     Новый ОписаниеТипов("Строка"));
	ПризнанныеРасходы.Колонки.Добавить("БазаРаспределения",    ОписаниеТипаСумм);
	ПризнанныеРасходы.Колонки.Добавить("РасходыВсего",         ОписаниеТипаСумм);
	ПризнанныеРасходы.Колонки.Добавить("РасходыУСН",           ОписаниеТипаСумм);
	ПризнанныеРасходы.Колонки.Добавить("РасходыНеУчитываемые", ОписаниеТипаСумм);
	ПризнанныеРасходы.Колонки.Добавить("РасходыЕНВД",          ОписаниеТипаСумм);
	ПризнанныеРасходы.Колонки.Добавить("НДС",                  ОписаниеТипаСумм);
	
	// Соберем признанные расходы из проводок документа по забалансовым счетам учета расходов УСН.
	Для Каждого Проводка Из ПроводкиДокумента Цикл
		
		Если НЕ УчетУСНВызовСервера.ПрименяетсяУСН(Проводка.Организация, Проводка.Период)
		 ИЛИ НЕ УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(Проводка.КФО) Тогда
			Продолжить;
		КонецЕсли;
		
		Сумма                = ?(ЗначениеЗаполнено(Проводка.Сумма),                Проводка.Сумма, 0);
		СуммаНеУчитываетсяНУ = ?(ЗначениеЗаполнено(Проводка.СуммаНеУчитываетсяНУ), Проводка.СуммаНеУчитываетсяНУ, 0);
		СуммаЕНВД            = ?(ЗначениеЗаполнено(Проводка.СуммаЕНВД),            Проводка.СуммаЕНВД, 0);
		СуммаНДС             = ?(ЗначениеЗаполнено(Проводка.СуммаНДС),             Проводка.СуммаНДС, 0);
		
		// Поступления денежных средств.
		Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "201.00") Тогда
			
			Поступление = ДвиженияДенежныхСредств.Добавить();
			ЗаполнитьЗначенияСвойств(Поступление, Проводка, "Период,Организация,ИФО,КФО");
			
			Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "206.20,206.30,206.90")
			 ИЛИ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "302.20,302.30,302.90") Тогда
				Поступление.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратОтПоставщика;
				Поступление.Контрагент     = Проводка.СубконтоКт.Контрагенты;
				Поступление.Договор        = Проводка.СубконтоКт.Договоры;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "205.00,209.00") Тогда
				Поступление.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ОплатаОтПокупателя;
				Поступление.Контрагент     = Проводка.СубконтоКт.Контрагенты;
				Поступление.Договор        = Проводка.СубконтоКт.Договоры;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "208.00") Тогда
				Поступление.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратОтПодотчетногоЛица;
				Поступление.Контрагент     = Проводка.СубконтоКт.Контрагенты;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "401.10") Тогда
				
				Если ТипЗнч(Проводка.ХарактеристикаДвиженияКт) = Тип("СправочникСсылка.ЦМО") Тогда
					Поступление.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.РозничнаяВыручка;
					Поступление.ЦМО            = Проводка.ХарактеристикаДвиженияКт;
				Иначе
					Поступление.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПрочееПоступление;
				КонецЕсли;
				
			Иначе
				Поступление.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.НеОтражается;
			КонецЕсли;
			
			Поступление.СчетБУ = Проводка.СчетДт; // Счет учета денежных средств (субсчет 201).
			Поступление.Сумма  = Сумма;
			
		КонецЕсли;
		
		// Списания денежных средств.
		Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "201.00") Тогда
			
			Списание = ДвиженияДенежныхСредств.Добавить();
			ЗаполнитьЗначенияСвойств(Списание, Проводка, "Период,Организация,ИФО,КФО");
			
			Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "206.20,206.30,206.90")
			 ИЛИ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "302.20,302.30,302.90") Тогда
				Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ОплатаПоставщику;
				Списание.Контрагент     = Проводка.СубконтоДт.Контрагенты;
				Списание.Договор        = Проводка.СубконтоДт.Договоры;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "205.00,209.00") Тогда
				Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратПокупателю;
				Списание.Контрагент     = Проводка.СубконтоДт.Контрагенты;
				Списание.Договор        = Проводка.СубконтоДт.Договоры;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "208.00") Тогда
				Списание.ВидОперацииУСН = ?(БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "201.30"),
					Перечисления.ВидыОперацийУСН.ВыдачаПодотчетномуЛицу,
					Перечисления.ВидыОперацийУСН.ПеречислениеПодотчетномуЛицу);
				Списание.Контрагент     = Проводка.СубконтоДт.Контрагенты;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "206.10,302.10") Тогда
				Списание.ВидОперацииУСН = ?(БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "201.30"),
					Перечисления.ВидыОперацийУСН.ВыплатаЗаработнойПлаты,
					Перечисления.ВидыОперацийУСН.ПеречислениеЗаработнойПлаты);
				Списание.Контрагент     = Проводка.СубконтоДт.Контрагенты;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "303.00") Тогда
				Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеНалога;
				Списание.ВидНалога      = Проводка.СубконтоДт.ВидыНалоговИПлатежей;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "304.03") Тогда
				Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеУдержанийИзЗаработнойПлаты;
				Списание.Контрагент     = Проводка.СубконтоДт.Контрагенты;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "401.10") Тогда
				
				Если ТипЗнч(Проводка.ХарактеристикаДвиженияДт) = Тип("СправочникСсылка.ЦМО") Тогда
					Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.СторноРозничнойВыручки;
					Списание.ЦМО            = Проводка.ХарактеристикаДвиженияДт;
				Иначе
					Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПрочееСписание;
				КонецЕсли;
				
			ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "401.20") Тогда
				Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПрочееСписание;
				
			Иначе
				Списание.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.НеОтражается;
			КонецЕсли;
			
			Списание.СчетБУ = Проводка.СчетКт; // Счет учета денежных средств (субсчет 201).
			Списание.Сумма  = Сумма;
			
		КонецЕсли;
		
		// Доходы УСН.
		Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У99")
		И НЕ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "У99") Тогда
			
			Если Сумма <> 0
			 ИЛИ СуммаНеУчитываетсяНУ <> 0
			 ИЛИ СуммаЕНВД <> 0 Тогда
			
				ПризнанныйДоход = ПризнанныеДоходы.Добавить();
				ЗаполнитьЗначенияСвойств(ПризнанныйДоход, Проводка, "Период,Организация,ИФО,КФО");
				
				Если Проводка.ХарактеристикаДвиженияКт = Перечисления.ПорядокОтраженияАвансовУСН.ДоходУСН
				   И Проводка.ХарактеристикаДвиженияДт = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения Тогда
					ПризнанныйДоход.ВидОперацииУСН = "АвансОтнесенКДеятельностиНаУСН";
				ИначеЕсли Проводка.ХарактеристикаДвиженияКт = Перечисления.ПорядокОтраженияАвансовУСН.ДоходЕНВД
				   И Проводка.ХарактеристикаДвиженияДт = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсобыйПорядокНалогообложения Тогда
					ПризнанныйДоход.ВидОперацииУСН = "АвансОтнесенКДеятельностиНаЕНВД";
				ИначеЕсли (Сумма + СуммаНДС = 0) И Сумма < 0 И СуммаНеУчитываетсяНУ = 0 И СуммаЕНВД = 0 Тогда
					ПризнанныйДоход.ВидОперацииУСН = "НДСИсключенИзДоходовУСН";
				КонецЕсли;
				
				ПризнанныйДоход.СчетДт = Проводка.СчетДт;
				ПризнанныйДоход.СчетКт = Проводка.СчетКт;
				
				ПризнанныйДоход.ДокументОплаты = Проводка.СубконтоКт.ДокументыОплатыУСН;
				
				Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "УРК") Тогда
					ПризнанныйДоход.Контрагент = Проводка.СубконтоДт.Контрагенты;
					ПризнанныйДоход.Договор    = Проводка.СубконтоДт.Договоры;
				ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "УРТ") Тогда
					ПризнанныйДоход.ЦМО = Проводка.СубконтоДт.ЦМО;
				КонецЕсли;
				
				ПризнанныйДоход.ДоходыУСН           = Сумма;
				ПризнанныйДоход.ДоходыНеУчитываемые = СуммаНеУчитываетсяНУ;
				ПризнанныйДоход.ДоходыЕНВД          = СуммаЕНВД;
				
				ПризнанныйДоход.БазаРаспределения = ПризнанныйДоход.ДоходыУСН
												+ ПризнанныйДоход.ДоходыНеУчитываемые
												+ ПризнанныйДоход.ДоходыЕНВД;
				Если ПризнанныйДоход.ВидОперацииУСН = "НДСИсключенИзДоходовУСН" Тогда
					ПризнанныйДоход.БазаРаспределения = 0;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Проводка.Организация, Проводка.Период) Тогда
			Продолжить;
		КонецЕсли;
		
		// Расходы УСН.
		Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "У99,У10.СП,У41.СП")
		И НЕ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У99,У10.СП,У41.СП") Тогда
			
			Если Сумма <> 0
			 ИЛИ СуммаНеУчитываетсяНУ <> 0
			 ИЛИ СуммаЕНВД <> 0
			 ИЛИ СуммаНДС <> 0 Тогда
			
				Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10.С,У41.С") Тогда // расходы УСН уже оплачены
				
					ДокументОплаты = Проводка.СубконтоКт.ДокументыОплатыУСН;
					Если ЗначениеЗаполнено(ДокументОплаты) Тогда
						УчетнаяПолитикаНаМоментОплаты = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
							ДокументОплаты.Организация, ДокументОплаты.Дата);
					Иначе // Если учет на счете расчетов ведется без расчетных документов, и расчеты оплачены авансом,
						// нет возможности определить учетную политику на дату оплаты.
						УчетнаяПолитикаНаМоментОплаты = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
							Проводка.Организация, Проводка.Период); // Определяем на текущую дату и считаем, что изменений не было.
					КонецЕсли;
					
					НДСПоОплате = (УчетнаяПолитикаНаМоментОплаты.ПорядокПризнанияРасходовПоНДС =
						Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
					Если НДСПоОплате Тогда
						ПризнанныйРасход = ДобавитьПризнанныйРасход(ПризнанныеРасходы, Проводка,
							Сумма, СуммаНеУчитываетсяНУ, СуммаЕНВД, 0);
					Иначе
						ПризнанныйРасход = ДобавитьПризнанныйРасход(ПризнанныеРасходы, Проводка,
							Сумма, СуммаНеУчитываетсяНУ, СуммаЕНВД, СуммаНДС);
					КонецЕсли;
					
				Иначе
					ПризнанныйРасход = ДобавитьПризнанныйРасход(ПризнанныеРасходы, Проводка,
						Сумма, СуммаНеУчитываетсяНУ, СуммаЕНВД, СуммаНДС);
				КонецЕсли;
				
				ПризнанныйРасход.ДокументОплаты = Проводка.СубконтоДт.ДокументыОплатыУСН;
				
			КонецЕсли;
			
		// Включение в расходы НДС по факту его оплаты поставщику.
		ИначеЕсли СуммаНДС > 0
			И УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС = Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику
			И НЕ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "У10.СО,У10.О,У15.СО,У15.О,У20.О,У41.СО,У41.О")
			И    БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10.СО,У10.О,У15.СО,У15.О,У20.О,У41.СО,У41.О") Тогда
		
			ПризнанныйРасход = ДобавитьПризнанныйРасход(ПризнанныеРасходы, Проводка,
				0, 0, 0, СуммаНДС);
			
			ПризнанныйРасход.ДокументОплаты = Проводка.СубконтоДт.ДокументыОплатыУСН;
			
		// Корректировка КУДиР при списании материальных запасов на ЕНВД или на неучитываемые расходы.
		ИначеЕсли НЕ ЗначениеЗаполнено(Проводка.СчетДт)
			И БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10,У15,У20,У41")
			И НЕ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10.СО,У10.О,У10.ОР,У10.Р,У15.СО,У15.О,У20.О,У20.Р,У41.СО,У41.О,У41.ОР,У41.Р")
			Тогда // расходы УСН уже оплачены
			
			ДокументОплаты = Проводка.СубконтоКт.ДокументыОплатыУСН;
			Если ЗначениеЗаполнено(ДокументОплаты) Тогда
				УчетнаяПолитикаНаМоментОплаты = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
					ДокументОплаты.Организация, ДокументОплаты.Дата);
			Иначе // Если учет на счете расчетов ведется без расчетных документов, и расчеты оплачены авансом,
				// нет возможности определить учетную политику на дату оплаты.
				УчетнаяПолитикаНаМоментОплаты = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
					Проводка.Организация, Проводка.Период); // Определяем на текущую дату и считаем, что изменений не было.
			КонецЕсли;
			
			ТоварыПоОплате    = (УчетнаяПолитикаНаМоментОплаты.ПорядокПризнанияРасходовПоТоварам =
				Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
			МатериалыПоОплате = (УчетнаяПолитикаНаМоментОплаты.ПорядокПризнанияМатериальныхРасходов =
				Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
			НДСПоОплате       = (УчетнаяПолитикаНаМоментОплаты.ПорядокПризнанияРасходовПоНДС =
				Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
			
			Если (ТоварыПоОплате    И БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У41.СП"))
			 ИЛИ (МатериалыПоОплате И БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10.СП")) Тогда
				КорректировкаСуммы    = Сумма;
				КорректировкаСуммыНДС = СуммаНДС;
			Иначе
				КорректировкаСуммы    = 0;
				КорректировкаСуммыНДС = ?(НДСПоОплате, СуммаНДС, 0);
			КонецЕсли;
			
			Если КорректировкаСуммы > 0
			 ИЛИ КорректировкаСуммыНДС > 0 Тогда
			
				ПризнанныйРасход = ДобавитьПризнанныйРасход(ПризнанныеРасходы, Проводка,
					- КорректировкаСуммы, 0, 0, - КорректировкаСуммыНДС);
				
				ПризнанныйРасход.ДокументОплаты = ДокументОплаты;
				
			КонецЕсли;
			
		// Корректировка КУДиР при возврате материальных запасов поставщику.
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "УРК")
			И (   БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10.СП")
			  ИЛИ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У41.СП") )
			Тогда // расходы УСН уже оплачены
			
			ДокументОплаты = Проводка.СубконтоКт.ДокументыОплатыУСН;
			Если ЗначениеЗаполнено(ДокументОплаты) Тогда
				УчетнаяПолитикаНаМоментОплаты = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
					ДокументОплаты.Организация, ДокументОплаты.Дата);
			Иначе // Если учет на счете расчетов ведется без расчетных документов, и расчеты оплачены авансом,
				// нет возможности определить учетную политику на дату оплаты.
				УчетнаяПолитикаНаМоментОплаты = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
					Проводка.Организация, Проводка.Период); // Определяем на текущую дату и считаем, что изменений не было.
			КонецЕсли;
			
			ТоварыПоОплате    = (УчетнаяПолитикаНаМоментОплаты.ПорядокПризнанияРасходовПоТоварам =
				Перечисления.ПорядокПризнанияРасходовПоТоварам.ПоОплатеПоставщику);
			МатериалыПоОплате = (УчетнаяПолитикаНаМоментОплаты.ПорядокПризнанияМатериальныхРасходов =
				Перечисления.ПорядокПризнанияМатериальныхРасходов.ПоОплатеПоставщику);
			НДСПоОплате       = (УчетнаяПолитикаНаМоментОплаты.ПорядокПризнанияРасходовПоНДС =
				Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
			
			Если (ТоварыПоОплате    И БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У41.СП"))
			 ИЛИ (МатериалыПоОплате И БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10.СП")) Тогда
				КорректировкаСуммы    = Сумма;
				КорректировкаСуммыНДС = СуммаНДС;
			Иначе
				КорректировкаСуммы    = 0;
				КорректировкаСуммыНДС = ?(НДСПоОплате, СуммаНДС, 0);
			КонецЕсли;
			
			Если КорректировкаСуммы > 0
			 ИЛИ КорректировкаСуммыНДС > 0 Тогда
			
				ПризнанныйРасход = ДобавитьПризнанныйРасход(ПризнанныеРасходы, Проводка,
					- КорректировкаСуммы, 0, 0, - КорректировкаСуммыНДС);
				
				ПризнанныйРасход.ДокументОплаты = ДокументОплаты;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// 1. Отражение в КУДиР поступления и списания денежных средств.
	Если ДвиженияДенежныхСредств.Количество() > 0 Тогда
	
		ДвиженияДенежныхСредств.Свернуть("Период,Организация,ИФО,КФО,
			|ВидОперацииУСН,СчетБУ,Контрагент,Договор,ЦМО,ВидНалога", "Сумма");
		Для Каждого Оплата Из ДвиженияДенежныхСредств Цикл
			
			СодержаниеОперации = ОписаниеОплатыДляКУДиР(Оплата);
			
			Если Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ОплатаОтПокупателя Тогда
				
				ОтборПоДоговору = Новый Структура("Период,Организация,ИФО,КФО,Контрагент");
				ЗаполнитьЗначенияСвойств(ОтборПоДоговору, Оплата);
				Если ЗначениеЗаполнено(Оплата.Договор) Тогда
					ОтборПоДоговору.Вставить("Договор", Оплата.Договор);
				КонецЕсли;
				ОтборПоДоговору.Вставить("СчетДт", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРК"));
				
				ПризнанныеДоходыПоДоговору = ВыделитьОплаченныеДоходы(Оплата.Сумма,
					ПризнанныеДоходы, ОтборПоДоговору);
				
				ОтразитьПризнанныеДоходыВКУДиР(ПризнанныеДоходыПоДоговору,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратПокупателю Тогда
				
				ОтборПоДоговору = Новый Структура("Период,Организация,ИФО,КФО,Контрагент");
				ЗаполнитьЗначенияСвойств(ОтборПоДоговору, Оплата);
				Если ЗначениеЗаполнено(Оплата.Договор) Тогда
					ОтборПоДоговору.Вставить("Договор", Оплата.Договор);
				КонецЕсли;
				ОтборПоДоговору.Вставить("СчетДт", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРК"));
				
				ПризнанныеДоходыПоДоговору = ВыделитьОплаченныеДоходы(-1 * Оплата.Сумма,
					ПризнанныеДоходы, ОтборПоДоговору);
				
				ОтразитьПризнанныеДоходыВКУДиР(ПризнанныеДоходыПоДоговору,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
			
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.РозничнаяВыручка
				ИЛИ Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.СторноРозничнойВыручки Тогда
				
				ОтборДоходов = Новый Структура("Период,Организация,ИФО,КФО");
				ЗаполнитьЗначенияСвойств(ОтборДоходов, Оплата);
				ОтборДоходов.Вставить("СчетДт", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРТ"));
				ОтборДоходов.Вставить("ЦМО",    Оплата.ЦМО);
				
				Если Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.РозничнаяВыручка Тогда
					ПризнанныеДоходыПоЦМО = ВыделитьОплаченныеДоходы(Оплата.Сумма,
						ПризнанныеДоходы, ОтборДоходов);
				Иначе
					ПризнанныеДоходыПоЦМО = ВыделитьОплаченныеДоходы(-1 * Оплата.Сумма,
						ПризнанныеДоходы, ОтборДоходов);
				КонецЕсли;
				
				ОтборРасходов = Новый Структура("Период,Организация,ИФО,КФО");
				ЗаполнитьЗначенияСвойств(ОтборРасходов, Оплата);
				ОтборРасходов.Вставить("СчетКт",         БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРТ"));
				ОтборРасходов.Вставить("ЭлементРасхода", Оплата.ЦМО);
				
				ПризнанныеРасходыПоЦМО = ВыделитьОплаченныеРасходы(0,
					ПризнанныеРасходы, ОтборРасходов);
				
				ОтразитьРозничныеДоходыИРасходыВКУДиР(ПризнанныеДоходыПоЦМО, ПризнанныеРасходыПоЦМО,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПрочееПоступление Тогда
				
				ОтборПрочихДоходов = Новый Структура("Период,Организация,ИФО,КФО");
				ЗаполнитьЗначенияСвойств(ОтборПрочихДоходов, Оплата);
				ОтборПрочихДоходов.Вставить("СчетДт", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УР"));
				
				ПризнанныеДоходыПоПрочимОперациям = ВыделитьОплаченныеДоходы(Оплата.Сумма,
					ПризнанныеДоходы, ОтборПрочихДоходов);
				
				ОтразитьПризнанныеДоходыВКУДиР(ПризнанныеДоходыПоПрочимОперациям,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			КонецЕсли;
			
			Если НЕ УчетУСНВызовСервера.ПрименяетсяУСНДоходыМинусРасходы(Оплата.Организация, Оплата.Период) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ОплатаПоставщику Тогда
				
				ОтборПоДоговору = Новый Структура("Период,Организация,ИФО,КФО,Контрагент,Договор");
				ЗаполнитьЗначенияСвойств(ОтборПоДоговору, Оплата);
				
				ПризнанныеРасходыПоДоговору = ВыделитьОплаченныеРасходы(Оплата.Сумма,
					ПризнанныеРасходы, ОтборПоДоговору);
				
				ОтразитьПризнанныеРасходыВКУДиР(ПризнанныеРасходыПоДоговору,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратОтПоставщика Тогда
				
				ОтборПоДоговору = Новый Структура("Период,Организация,ИФО,КФО,Контрагент,Договор");
				ЗаполнитьЗначенияСвойств(ОтборПоДоговору, Оплата);
				
				ПризнанныеРасходыПоДоговору = ВыделитьОплаченныеРасходы(-1 * Оплата.Сумма,
					ПризнанныеРасходы, ОтборПоДоговору);
				
				ОтразитьПризнанныеРасходыВКУДиР(ПризнанныеРасходыПоДоговору,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВыдачаПодотчетномуЛицу
				ИЛИ Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеПодотчетномуЛицу Тогда
				
				ОтборПоКонтрагенту = Новый Структура("Период,Организация,ИФО,КФО,Контрагент");
				ЗаполнитьЗначенияСвойств(ОтборПоКонтрагенту, Оплата);
				
				ПризнанныеРасходыПоКонтрагенту = ВыделитьОплаченныеРасходы(Оплата.Сумма,
					ПризнанныеРасходы, ОтборПоКонтрагенту);
				
				ОтразитьПризнанныеРасходыВКУДиР(ПризнанныеРасходыПоКонтрагенту,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратОтПодотчетногоЛица Тогда
				
				ВыплаченоПодочетномуЛицу = ПризнанныеРасходы.СкопироватьКолонки();
				
				СтрокаРасходыВсего = ВыплаченоПодочетномуЛицу.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРасходыВсего, Оплата, "Период,Организация,ИФО,КФО");
				СтрокаРасходыВсего.РасходыВсего = - Оплата.Сумма;
				
				ОтразитьПризнанныеРасходыВКУДиР(ВыплаченоПодочетномуЛицу,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеНалога Тогда
				
				ОтборПоВидуНалога = Новый Структура("Период,Организация,ИФО,КФО");
				ЗаполнитьЗначенияСвойств(ОтборПоВидуНалога, Оплата);
				ОтборПоВидуНалога.Вставить("ВидРасхода",     Перечисления.ВидыРасходовУСН.Налоги);
				ОтборПоВидуНалога.Вставить("ЭлементРасхода", Оплата.ВидНалога);
				
				ПризнанныеРасходыПоВидуНалога = ВыделитьОплаченныеРасходы(Оплата.Сумма,
					ПризнанныеРасходы, ОтборПоВидуНалога);
				
				ОтразитьПризнанныеРасходыВКУДиР(ПризнанныеРасходыПоВидуНалога,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВыплатаЗаработнойПлаты
				ИЛИ Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеЗаработнойПлаты
				ИЛИ Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеУдержанийИзЗаработнойПлаты Тогда
				
				ОтборПоКонтрагенту = Новый Структура("Период,Организация,ИФО,КФО,Контрагент");
				ЗаполнитьЗначенияСвойств(ОтборПоКонтрагенту, Оплата);
				
				ПризнанныеРасходыПоКонтрагенту = ВыделитьОплаченныеРасходы(Оплата.Сумма,
					ПризнанныеРасходы, ОтборПоКонтрагенту);
				
				ОтразитьПризнанныеРасходыВКУДиР(ПризнанныеРасходыПоКонтрагенту,
					СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// 2. Отражение признанных доходов остальными документами.
	Если ПризнанныеДоходы.Количество() > 0 Тогда
		
		РеквизитыГруппировки = "ВидОперацииУСН,Период,Организация,ИФО,КФО,СчетДт,СчетКт,Контрагент,Договор,ЦМО";
		ПризнанныеДоходыСводно = ПризнанныеДоходы.Скопировать();
		ПризнанныеДоходыСводно.Свернуть(РеквизитыГруппировки);
		Для Каждого ПризнанныйДоход Из ПризнанныеДоходыСводно Цикл
			
			СодержаниеОперации = ОписаниеОперацииДляКУДиР(ПризнанныйДоход, ДокументСсылка);
			
			Отбор = Новый Структура(РеквизитыГруппировки);
			ЗаполнитьЗначенияСвойств(Отбор, ПризнанныйДоход);
			ПризнанныеДоходыДетально = ПризнанныеДоходы.Скопировать(Отбор);
			
			ОтразитьПризнанныеДоходыВКУДиР(ПризнанныеДоходыДетально,
				СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// 3. Отражение признанных расходов остальными документами.
	Если ПризнанныеРасходы.Количество() > 0 Тогда
		
		РеквизитыГруппировки = "Период,Организация,ИФО,КФО,СчетДт,СчетКт,Контрагент,Договор,ВидРасхода";
		ПризнанныеРасходыСводно = ПризнанныеРасходы.Скопировать();
		ПризнанныеРасходыСводно.Свернуть(РеквизитыГруппировки);
		Для Каждого ПризнанныйРасход Из ПризнанныеРасходыСводно Цикл
			
			СодержаниеОперации = ОписаниеОперацииДляКУДиР(ПризнанныйРасход, ДокументСсылка);
			
			Отбор = Новый Структура(РеквизитыГруппировки);
			ЗаполнитьЗначенияСвойств(Отбор, ПризнанныйРасход);
			ПризнанныеРасходыДетально = ПризнанныеРасходы.Скопировать(Отбор);
			
			ОтразитьПризнанныеРасходыВКУДиР(ПризнанныеРасходыДетально,
				СодержаниеОперации, ДвиженияУСН, ДокументСсылка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьПризнанныйРасход(ПризнанныеРасходы, Проводка, РасходыУСН, РасходыНеУчитываемые, РасходыЕНВД, СуммаНДС)
	
	ПризнанныйРасход = ПризнанныеРасходы.Добавить();
	ЗаполнитьЗначенияСвойств(ПризнанныйРасход, Проводка, "Период,Организация,ИФО,КФО");
	
	ПризнанныйРасход.СчетДт = Проводка.СчетДт;
	ПризнанныйРасход.СчетКт = Проводка.СчетКт;
	
	Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "УРТ") Тогда
		
		ПризнанныйРасход.ВидРасхода     = Перечисления.ВидыРасходовУСН.МатериальныеЗапасы;
		ПризнанныйРасход.ЭлементРасхода = Проводка.СубконтоКт.ЦМО;
		
	ИначеЕсли БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(Проводка.СчетКт,
			ПланыВидовХарактеристик.ВидыСубконто.РасходыУСН) Тогда
		
		ЭлементУчетаРасходовУСН = Проводка.СубконтоКт.РасходыУСН;
		Если ЗначениеЗаполнено(ЭлементУчетаРасходовУСН) Тогда
			ЗаполнитьЗначенияСвойств(ПризнанныйРасход, ЭлементУчетаРасходовУСН,
				"ВидРасхода,ЭлементРасхода,Партия,ИмяСпискаДокумента,НомерСтрокиДокумента,Контрагент,Договор");
		КонецЕсли;
		
	КонецЕсли;
	
	Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У01")
	 ИЛИ БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У04") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'расходы на приобретение (изготовление, модернизацию) ОС и НМА'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У08") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'расходы на приобретение (изготовление, модернизацию) имущества, не являющегося амортизируемым'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У10") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'расходы на приобретение материальных запасов'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У15") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'доп. расходы на приобретение материальных запасов'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У20") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'расходы на услуги сторонних организаций'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У41") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'расходы на приобретение товаров'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У68") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'расходы на уплату налогов (взносов)'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "У70") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'расходы на оплату труда'");
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "УРТ") Тогда
		ПризнанныйРасход.ОписаниеРасходов =
			НСтр("ru = 'себестоимость розничных продаж'");
	КонецЕсли;
	
	ПризнанныйРасход.РасходыУСН           = РасходыУСН + СуммаНДС;
	ПризнанныйРасход.РасходыНеУчитываемые = РасходыНеУчитываемые;
	ПризнанныйРасход.РасходыЕНВД          = РасходыЕНВД;
	ПризнанныйРасход.НДС                  = СуммаНДС;
	
	ПризнанныйРасход.БазаРаспределения = ПризнанныйРасход.РасходыУСН
										+ ПризнанныйРасход.РасходыНеУчитываемые
										+ ПризнанныйРасход.РасходыЕНВД;
	
	Возврат ПризнанныйРасход;
	
КонецФункции

Функция ВыделитьОплаченныеДоходы(СуммаОплаты, ТаблицаДоходов, ОтборДоходов)
	
	НайденныеСтроки = ТаблицаДоходов.НайтиСтроки(ОтборДоходов);
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НоваяТаблица = ТаблицаДоходов.Скопировать(НайденныеСтроки);
		
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СуммаОплаты,
			НоваяТаблица, "ДоходыВсего", "БазаРаспределения");
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			ТаблицаДоходов.Удалить(Строка);
		КонецЦикла;
		
	Иначе
		НоваяТаблица = ТаблицаДоходов.СкопироватьКолонки();
	КонецЕсли;
	
	// Нераспределенный остаток добавляем отдельной строкой.
	Если НоваяТаблица.Итог("ДоходыВсего") <> СуммаОплаты Тогда
		
		СтрокаДоходыВсего = НоваяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДоходыВсего, ОтборДоходов);
		СтрокаДоходыВсего.ДоходыВсего = СуммаОплаты - НоваяТаблица.Итог("ДоходыВсего");
		
	КонецЕсли;
	
	Возврат НоваяТаблица;
	
КонецФункции

Функция ВыделитьОплаченныеРасходы(СуммаОплаты, ТаблицаРасходов, ОтборРасходов)
	
	НайденныеСтроки = ТаблицаРасходов.НайтиСтроки(ОтборРасходов);
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НоваяТаблица = ТаблицаРасходов.Скопировать(НайденныеСтроки);
		
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(СуммаОплаты,
			НоваяТаблица, "РасходыВсего", "БазаРаспределения");
		
		Для Каждого Строка Из НайденныеСтроки Цикл
			ТаблицаРасходов.Удалить(Строка);
		КонецЦикла;
		
	Иначе
		НоваяТаблица = ТаблицаРасходов.СкопироватьКолонки();
	КонецЕсли;
	
	// Нераспределенный остаток добавляем отдельной строкой.
	Если НоваяТаблица.Итог("РасходыВсего") <> СуммаОплаты Тогда
		
		СтрокаРасходыВсего = НоваяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРасходыВсего, ОтборРасходов);
		СтрокаРасходыВсего.РасходыВсего = СуммаОплаты - НоваяТаблица.Итог("РасходыВсего");
		
	КонецЕсли;
	
	Возврат НоваяТаблица;
	
КонецФункции

Процедура ОтразитьПризнанныеДоходыВКУДиР(ПризнанныеДоходы, СодержаниеОперации, ДвиженияУСН, ДокументСсылка)
	
	// Отразим признанные доходы в регистре "КнигаУчетаДоходовИРасходов".
	ИтогиДоходовУСН = ПризнанныеДоходы.Скопировать();
	ИтогиДоходовУСН.Свернуть("Период,Организация,ИФО,КФО,ВидОперацииУСН",
		"ДоходыУСН,ДоходыЕНВД,ДоходыВсего");
	
	ВалютаРеглУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	
	Для Каждого СтрокаИтогов Из ИтогиДоходовУСН Цикл
		
		Если СтрокаИтогов.ДоходыВсего = 0
		   И СтрокаИтогов.ДоходыУСН = 0
		   И СтрокаИтогов.ДоходыЕНВД = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Добавим запись КУДиР.
		ЗаписьКУДиР = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Добавить();
		
		ЗаписьКУДиР.Период      = СтрокаИтогов.Период;
		ЗаписьКУДиР.Организация = СтрокаИтогов.Организация;
		ЗаписьКУДиР.Содержание  = СодержаниеОперации;
		
		ЗаписьКУДиР.РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента(ДокументСсылка);
		
		ЗаписьКУДиР.ДоходыВсего = СтрокаИтогов.ДоходыВсего;
		ЗаписьКУДиР.ДоходыУСН   = СтрокаИтогов.ДоходыУСН;
		ЗаписьКУДиР.ДоходыЕНВД  = СтрокаИтогов.ДоходыЕНВД;
		
		УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
			СтрокаИтогов.Организация, СтрокаИтогов.Период);
		Если УчетнаяПолитика.ПлательщикЕНВД Тогда
			
			Если СтрокаИтогов.ВидОперацииУСН = "АвансОтнесенКДеятельностиНаУСН" Тогда
				
				ЗаписьКУДиР.Содержание = ЗаписьКУДиР.Содержание +
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '. Аванс на сумму %1 отнесен к деятельности на УСН.'"),
						ОбщегоНазначенияБГУ.ФорматСумм(ЗаписьКУДиР.ДоходыУСН, ВалютаРеглУчета));
				
			ИначеЕсли СтрокаИтогов.ВидОперацииУСН = "АвансОтнесенКДеятельностиНаЕНВД" Тогда
				
				ЗаписьКУДиР.Содержание = ЗаписьКУДиР.Содержание +
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '. Аванс на сумму %1 отнесен к деятельности на ЕНВД.'"),
						ОбщегоНазначенияБГУ.ФорматСумм(ЗаписьКУДиР.ДоходыЕНВД, ВалютаРеглУчета));
				
			ИначеЕсли ЗаписьКУДиР.ДоходыЕНВД > 0 Тогда
				
				ЗаписьКУДиР.Содержание = ЗаписьКУДиР.Содержание +
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '. Оплата на сумму %1 отнесена к деятельности на ЕНВД.'"),
						ОбщегоНазначенияБГУ.ФорматСумм(ЗаписьКУДиР.ДоходыЕНВД, ВалютаРеглУчета));
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если УчетнаяПолитика.ПрименяетсяУСН Тогда
			
			Если СтрокаИтогов.ВидОперацииУСН = "НДСИсключенИзДоходовУСН" Тогда
				
				ЗаписьКУДиР.Содержание = ЗаписьКУДиР.Содержание +
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '. Предъявленный покупателям НДС в сумме %1 исключен из доходов.'"),
						ОбщегоНазначенияБГУ.ФорматСумм(-ЗаписьКУДиР.ДоходыУСН, ВалютаРеглУчета));
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Ключ синхронизации с записями регистра сведений "РасшифровкаКУДиР".
		ЗаписьКУДиР.КлючЗаписиКУДиР = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Количество();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтразитьПризнанныеРасходыВКУДиР(ПризнанныеРасходы, СодержаниеОперации, ДвиженияУСН, ДокументСсылка)
	
	// Отразим признанные расходы в регистрах "КнигаУчетаДоходовИРасходов" и "РасшифровкаКУДиР".
	ИтогиРасходовУСН = ПризнанныеРасходы.Скопировать();
	ИтогиРасходовУСН.Свернуть("Период,Организация,ИФО,КФО,ВидРасхода,ОписаниеРасходов",
		"РасходыВсего,РасходыУСН,НДС");
	
	Для Каждого СтрокаИтогов Из ИтогиРасходовУСН Цикл
		
		// Нет признанных расходов, только Расходы (всего).
		Если СтрокаИтогов.РасходыВсего <> 0
		   И СтрокаИтогов.РасходыУСН = 0
		   И СтрокаИтогов.НДС = 0 Тогда
			
			// Добавим запись КУДиР.
			ЗаписьКУДиР = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Добавить();
			
			ЗаписьКУДиР.Период      = СтрокаИтогов.Период;
			ЗаписьКУДиР.Организация = СтрокаИтогов.Организация;
			
			ЗаписьКУДиР.РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента(ДокументСсылка);
			
			ЗаписьКУДиР.РасходыВсего = СтрокаИтогов.РасходыВсего;
			
			ЗаписьКУДиР.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1.'"),
				СодержаниеОперации);
			
			ЗаписьКУДиР.РасходыВсего = СтрокаИтогов.РасходыВсего;
			
		// Есть признанные расходы.
		ИначеЕсли СтрокаИтогов.РасходыУСН <> 0
			ИЛИ СтрокаИтогов.НДС <> 0 Тогда
			
			УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
				СтрокаИтогов.Организация, СтрокаИтогов.Период);
			НДСПоОплатеПоставщику = (УчетнаяПолитика.ПорядокПризнанияРасходовПоНДС =
				Перечисления.ПорядокПризнанияРасходовПоНДС.ПоОплатеПоставщику);
			
			// Добавим основную запись КУДиР.
			ЗаписьКУДиР = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Добавить();
			
			ЗаписьКУДиР.Период      = СтрокаИтогов.Период;
			ЗаписьКУДиР.Организация = СтрокаИтогов.Организация;
			
			ЗаписьКУДиР.ВидРасхода = СтрокаИтогов.ВидРасхода;
			ЗаписьКУДиР.РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента(ДокументСсылка);
			
			ЗаписьКУДиР.РасходыВсего = СтрокаИтогов.РасходыВсего;
			ЗаписьКУДиР.РасходыУСН   = СтрокаИтогов.РасходыУСН;
			ЗаписьКУДиР.НДС          = СтрокаИтогов.НДС;
			
			ОписаниеДействия = ?( ЗаписьКУДиР.РасходыУСН < 0,
				НСтр("ru = 'Сторнированы'"), НСтр("ru = 'Признаны'") );
			
			ЗаписьКУДиР.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1. %2 %3.'"),
				СодержаниеОперации,
				ОписаниеДействия,
				СтрокаИтогов.ОписаниеРасходов);
			
			// Ключ синхронизации с записями регистра сведений "РасшифровкаКУДиР".
			ЗаписьКУДиР.КлючЗаписиКУДиР = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Количество();
			
			// Записи расшифровки КУДиР.
			Отбор = Новый Структура("Период,Организация,ИФО,КФО,ВидРасхода,ОписаниеРасходов");
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаИтогов);
			ЗаписиРасшифровкиКУДиР = ПризнанныеРасходы.Скопировать(Отбор);
			
			Если НДСПоОплатеПоставщику И СтрокаИтогов.НДС <> 0 Тогда
				
				// Добавим запись КУДиР по НДС.
				ЗаписьПоНДС = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Добавить();
				
				ЗаписьПоНДС.Период      = СтрокаИтогов.Период;
				ЗаписьПоНДС.Организация = СтрокаИтогов.Организация;
				
				ЗаписьПоНДС.ВидРасхода = Перечисления.ВидыРасходовУСН.НДС;
				ЗаписьПоНДС.РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента(ДокументСсылка);
				
				// Уберем НДС из основной записи КУДиР, добавим в запись по НДС.
				Если ЗаписьКУДиР.РасходыВсего > 0 Тогда
					ЗаписьКУДиР.РасходыВсего = ЗаписьКУДиР.РасходыВсего - СтрокаИтогов.НДС;
					ЗаписьПоНДС.РасходыВсего = ЗаписьПоНДС.РасходыВсего + СтрокаИтогов.НДС;
				КонецЕсли;
				ЗаписьКУДиР.РасходыУСН = ЗаписьКУДиР.РасходыУСН - СтрокаИтогов.НДС;
				ЗаписьПоНДС.РасходыУСН = ЗаписьПоНДС.РасходыУСН + СтрокаИтогов.НДС;
				ЗаписьКУДиР.НДС = 0;
				ЗаписьПоНДС.НДС = 0;
				
				ОписаниеДействия = ?( ЗаписьПоНДС.РасходыУСН < 0,
					НСтр("ru = 'Сторнированы'"), НСтр("ru = 'Признаны'") );
				
				ЗаписьПоНДС.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1. %2 %3.'"),
					СодержаниеОперации,
					ОписаниеДействия,
					НСтр("ru = 'расходы на уплату НДС, предъявленного поставщиком'"));
				
				// Ключ синхронизации с записями регистра сведений "РасшифровкаКУДиР".
				ЗаписьПоНДС.КлючЗаписиКУДиР = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Количество();
				
				// Уберем НДС из расшифровки основной записи КУДиР, добавим расшифровку записи по НДС.
				ЗаписиРасшифровкиНДС = ЗаписиРасшифровкиКУДиР.Скопировать();
				Для Каждого ЗаписьРасшифровкиКУДиР Из ЗаписиРасшифровкиКУДиР Цикл
					ЗаписьРасшифровкиКУДиР.РасходыУСН = ЗаписьРасшифровкиКУДиР.РасходыУСН - ЗаписьРасшифровкиКУДиР.НДС;
					ЗаписьРасшифровкиКУДиР.НДС = 0;
				КонецЦикла;
				Для Каждого ЗаписьРасшифровкиНДС Из ЗаписиРасшифровкиНДС Цикл
					ЗаписьРасшифровкиНДС.РасходыУСН = ЗаписьРасшифровкиНДС.НДС;
					ЗаписьРасшифровкиНДС.НДС = 0;
				КонецЦикла;
				
				Если ЗаписьКУДиР.РасходыУСН = 0
				   И ЗаписьКУДиР.НДС = 0 Тогда
					// Признаны только расходы на уплату НДС, и они отражаются отдельной записью по НДС.
					// Убираем основную запись КУДиР и не будем формировать расшифровку.
					ЗаписьПоНДС.РасходыВсего = ЗаписьПоНДС.РасходыВсего + ЗаписьКУДиР.РасходыВсего;
					ЗаписьПоНДС.КлючЗаписиКУДиР = ЗаписьКУДиР.КлючЗаписиКУДиР;
					ДвиженияУСН.КнигаУчетаДоходовИРасходов.Удалить(ЗаписьКУДиР);
				Иначе
					// Сформируем движения регистра "РасшифровкаКУДиР" для основной записи КУДиР.
					ДобавитьЗаписиРасшифровкиКУДиР(ЗаписиРасшифровкиКУДиР, ЗаписьКУДиР, ДвиженияУСН);
				КонецЕсли;
				
				// Сформируем движения регистра "РасшифровкаКУДиР" для записи по НДС.
				ДобавитьЗаписиРасшифровкиКУДиР(ЗаписиРасшифровкиНДС, ЗаписьПоНДС, ДвиженияУСН);
				
			Иначе
				
				// Сформируем движения регистра "РасшифровкаКУДиР".
				ДобавитьЗаписиРасшифровкиКУДиР(ЗаписиРасшифровкиКУДиР, ЗаписьКУДиР, ДвиженияУСН);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтразитьРозничныеДоходыИРасходыВКУДиР(ПризнанныеДоходы, ПризнанныеРасходы, СодержаниеОперации, ДвиженияУСН, ДокументСсылка)
	
	// Добавим запись КУДиР.
	ЗаписьКУДиР = ДвиженияУСН.КнигаУчетаДоходовИРасходов.Добавить();
	
	ЗаписьКУДиР.Период      = ДокументСсылка.Дата;
	ЗаписьКУДиР.Организация = ДокументСсылка.Организация;
	ЗаписьКУДиР.Содержание  = СодержаниеОперации;
	
	ЗаписьКУДиР.РеквизитыПервичногоДокумента = РеквизитыПервичногоДокумента(ДокументСсылка);
	
	ЗаписьКУДиР.ДоходыВсего = ПризнанныеДоходы.Итог("ДоходыВсего");
	ЗаписьКУДиР.ДоходыУСН   = ПризнанныеДоходы.Итог("ДоходыУСН");
	ЗаписьКУДиР.ДоходыЕНВД  = ПризнанныеДоходы.Итог("ДоходыЕНВД");
	
	ЗаписьКУДиР.РасходыВсего = ПризнанныеРасходы.Итог("РасходыВсего");
	ЗаписьКУДиР.РасходыУСН   = ПризнанныеРасходы.Итог("РасходыУСН");
	ЗаписьКУДиР.НДС          = ПризнанныеРасходы.Итог("НДС");
	
	УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
		ДокументСсылка.Организация, ДокументСсылка.Дата);
	Если УчетнаяПолитика.ПлательщикЕНВД Тогда
		
		Если ЗаписьКУДиР.ДоходыЕНВД > 0 Тогда
			
			ВалютаРеглУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
			
			ЗаписьКУДиР.Содержание = ЗаписьКУДиР.Содержание +
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = ' Оплата на сумму %1 отнесена к деятельности на ЕНВД.'"),
					ОбщегоНазначенияБГУ.ФорматСумм(ЗаписьКУДиР.ДоходыЕНВД, ВалютаРеглУчета));
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗаписиРасшифровкиКУДиР(ЗаписиРасшифровкиКУДиР, ЗаписьКУДиР, ДвиженияУСН)
	
	НомерСтрокиРасшифровки = 0;
	
	Для Каждого ЗаписьРасшифровки Из ЗаписиРасшифровкиКУДиР Цикл
		
		Если ЗаписьРасшифровки.РасходыУСН <> 0 Тогда
			
			Запись = ДвиженияУСН.РасшифровкаКУДиР.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписьКУДиР,
				"Период,Регистратор,Организация,КлючЗаписиКУДиР,РеквизитыПервичногоДокумента");
			
			НомерСтрокиРасшифровки = НомерСтрокиРасшифровки + 1;
			Запись.НомерСтрокиРасшифровки = НомерСтрокиРасшифровки;
			
			Запись.Активность = Истина;
			Запись.ВидРасхода = ЗаписьКУДиР.ВидРасхода;
			
			Запись.РасходыУСН = ЗаписьРасшифровки.РасходыУСН - ЗаписьРасшифровки.НДС;
			
			Запись.ДокументОплатыРасходов       = ЗаписьРасшифровки.ДокументОплаты;
			Запись.ДокументПоступленияРасходов  = ЗаписьРасшифровки.Партия;
			
			Если Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.МатериальныеЗапасы
			 ИЛИ Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.Услуги
			 ИЛИ Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.ДопРасходы Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1. Поступление %2'"),
					ЗаписьРасшифровки.ЭлементРасхода,
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия));
				
			ИначеЕсли Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.ОС
			 ИЛИ Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.НМА Тогда
				
				Если ТипЗнч(ЗаписьРасшифровки.ЭлементРасхода) = Тип("СправочникСсылка.ИнвентарныеНомераОС") Тогда
					Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1, инв. № %2. %3'"),
						СокрЛП(ЗаписьРасшифровки.ЭлементРасхода.ОС),
						СокрЛП(ЗаписьРасшифровки.ЭлементРасхода),
						РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия, Истина));
				Иначе
					Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = '%1. %2'"),
						СокрЛП(ЗаписьРасшифровки.ЭлементРасхода),
						РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия, Истина));
				КонецЕсли;
				
			ИначеЕсли Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.КапВложения Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1. Поступление %2'"),
					СокрЛП(ЗаписьРасшифровки.ЭлементРасхода),
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия));
				
			ИначеЕсли Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.НДС Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '(НДС) %1. Поступление %2'"),
					ЗаписьРасшифровки.ЭлементРасхода,
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия));
				
			ИначеЕсли Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.Налоги Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Налоги (взносы): %1 (%2)'"),
					ЗаписьРасшифровки.ЭлементРасхода,
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия, Истина));
				
			ИначеЕсли Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.ОплатаТруда Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Оплата труда (перечисление удержаний): %1 (%2)'"),
					ЗаписьРасшифровки.ЭлементРасхода,
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия, Истина));
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗаписьРасшифровки.НДС <> 0 Тогда
			
			Запись = ДвиженияУСН.РасшифровкаКУДиР.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ЗаписьКУДиР,
				"Период,Регистратор,Организация,КлючЗаписиКУДиР,РеквизитыПервичногоДокумента");
			
			НомерСтрокиРасшифровки = НомерСтрокиРасшифровки + 1;
			Запись.НомерСтрокиРасшифровки = НомерСтрокиРасшифровки;
			
			Запись.Активность = Истина;
			Запись.ВидРасхода = Перечисления.ВидыРасходовУСН.НДС;
			
			Запись.РасходыУСН = ЗаписьРасшифровки.НДС;
			
			Запись.ДокументОплатыРасходов       = ЗаписьРасшифровки.ДокументОплаты;
			Запись.ДокументПоступленияРасходов  = ЗаписьРасшифровки.Партия;
			
			Если ЗаписьРасшифровки.ВидРасхода = Перечисления.ВидыРасходовУСН.МатериальныеЗапасы
			 ИЛИ ЗаписьРасшифровки.ВидРасхода = Перечисления.ВидыРасходовУСН.Услуги
			 ИЛИ ЗаписьРасшифровки.ВидРасхода = Перечисления.ВидыРасходовУСН.ДопРасходы Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '(НДС) %1. Поступление %2'"),
					ЗаписьРасшифровки.ЭлементРасхода,
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия));
				
			ИначеЕсли ЗаписьРасшифровки.ВидРасхода = Перечисления.ВидыРасходовУСН.ОС
			 ИЛИ ЗаписьРасшифровки.ВидРасхода = Перечисления.ВидыРасходовУСН.НМА Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '(НДС) %1. Принятие к учету %2'"),
					СокрЛП(ЗаписьРасшифровки.ЭлементРасхода),
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия));
				
			ИначеЕсли ЗаписьРасшифровки.ВидРасхода = Перечисления.ВидыРасходовУСН.КапВложения Тогда
				
				Запись.Содержание = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '(НДС) %1. Поступление %2'"),
					СокрЛП(ЗаписьРасшифровки.ЭлементРасхода),
					РеквизитыПервичногоДокумента(ЗаписьРасшифровки.Партия));
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеОплатыДляКУДиР(Оплата)
	
	ОписаниеОперации = "";
	
	Если Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ОплатаПоставщику Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Выдача из кассы'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание денежных средств'");
		КонецЕсли;
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: оплата поставщику ""%2"" по договору ""%3""'"),
			ОписаниеДвиженияДенежныхСредств,
			Оплата.Контрагент,
			Оплата.Договор);
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратОтПоставщика Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление в кассу'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление на р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление на л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление денежных средств'");
		КонецЕсли;
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: возврат оплаты поставщику ""%2"" по договору ""%3""'"),
			ОписаниеДвиженияДенежныхСредств,
			Оплата.Контрагент,
			Оплата.Договор);
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ОплатаОтПокупателя Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление в кассу'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление на р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление на л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление денежных средств'");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Оплата.Договор) Тогда
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: оплата от покупателя (дебитора) ""%2"" по договору ""%3""'"),
				ОписаниеДвиженияДенежныхСредств,
				Оплата.Контрагент,
				Оплата.Договор);
		Иначе
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: оплата от контрагента ""%2""'"),
				ОписаниеДвиженияДенежныхСредств,
				Оплата.Контрагент);
		КонецЕсли;
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратПокупателю Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Выдача из кассы'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание денежных средств'");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Оплата.Договор) Тогда
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: возврат оплаты покупателю (дебитору) ""%2"" по договору ""%3""'"),
				ОписаниеДвиженияДенежныхСредств,
				Оплата.Контрагент,
				Оплата.Договор);
		Иначе
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: возврат контрагенту ""%2""'"),
				ОписаниеДвиженияДенежныхСредств,
				Оплата.Контрагент);
		КонецЕсли;
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.РозничнаяВыручка Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Прием розничной выручки: ""%1"".'"),
			Оплата.ЦМО);
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.СторноРозничнойВыручки Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сторно розничной выручки: ""%1"".'"),
			Оплата.ЦМО);
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВыдачаПодотчетномуЛицу
		ИЛИ Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеПодотчетномуЛицу Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Выдача из кассы'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание денежных средств'");
		КонецЕсли;
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: выдано под отчет сотруднику ""%2""'"),
			ОписаниеДвиженияДенежныхСредств,
			Оплата.Контрагент);
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВозвратОтПодотчетногоЛица Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление в кассу'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление на р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление на л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Поступление денежных средств'");
		КонецЕсли;
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: возврат аванса подотчетным лицом ""%2""'"),
			ОписаниеДвиженияДенежныхСредств,
			Оплата.Контрагент,
			Оплата.Договор);
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеНалога Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Выдача из кассы'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание денежных средств'");
		КонецЕсли;
		
		Если Оплата.ВидНалога = Справочники.ВидыНалоговИПлатежей.НДФЛ Тогда
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: перечисление НДФЛ работников'"),
				ОписаниеДвиженияДенежныхСредств);
		Иначе
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: перечисление налога (%2)'"),
				ОписаниеДвиженияДенежныхСредств,
				Оплата.ВидНалога);
		КонецЕсли;
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ВыплатаЗаработнойПлаты
		ИЛИ Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеЗаработнойПлаты Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Выдача из кассы'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание денежных средств'");
		КонецЕсли;
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: выплата заработной платы ""%2""'"),
			ОписаниеДвиженияДенежныхСредств,
			Оплата.Контрагент);
		
	ИначеЕсли Оплата.ВидОперацииУСН = Перечисления.ВидыОперацийУСН.ПеречислениеУдержанийИзЗаработнойПлаты Тогда
		
		Если БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.30") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Выдача из кассы'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.20") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с р/с'");
		ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Оплата.СчетБУ, "201.10") Тогда
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание с л/с'");
		Иначе
			ОписаниеДвиженияДенежныхСредств = НСтр("ru = 'Списание денежных средств'");
		КонецЕсли;
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1: перечисление удержаний из заработной платы ""%2""'"),
			ОписаниеДвиженияДенежныхСредств,
			Оплата.Контрагент);
		
	КонецЕсли;
	
	Возврат ОписаниеОперации;
	
КонецФункции

Функция ОписаниеОперацииДляКУДиР(Операция, ДокументСсылка)
	
	ОписаниеОперации = "";
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	Если МетаданныеДокумента.Имя = "АктОбОказанииУслуг" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Оказание услуг контрагенту ""%1"" по договору ""%2""'"),
			Операция.Контрагент,
			Операция.Договор);
		
	ИначеЕсли МетаданныеДокумента.Имя = "НачислениеДоходов"
		ИЛИ МетаданныеДокумента.Имя = "НачислениеЗаУслугиОбразования"
		ИЛИ МетаданныеДокумента.Имя = "НачислениеСтудентамЗаПрочиеУслуги"
		ИЛИ МетаданныеДокумента.Имя = "СписаниеДоходовБудущихПериодов" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Оказание услуг контрагенту ""%1"" по договору ""%2""'"),
			Операция.Контрагент,
			Операция.Договор);
		
	ИначеЕсли МетаданныеДокумента.Имя = "НакладнаяНаОтпускМ15" Тогда
		
		Если ДокументСсылка.ВидПередачиМЗ = Перечисления.ВидыПередачиМЗ.ПередачаНаСторону Тогда
			
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Передача материальных запасов контрагенту ""%1"" по договору ""%2""'"),
				Операция.Контрагент,
				Операция.Договор);
			
		ИначеЕсли ДокументСсылка.ВидПередачиМЗ = Перечисления.ВидыПередачиМЗ.ВозвратПоставщику Тогда
			
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Возврат материальных запасов поставщику ""%1"" по договору ""%2""'"),
				Операция.Контрагент,
				Операция.Договор);
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента.Имя = "НакладнаяНаРеализациюТорг12" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Реализация материальных запасов покупателю ""%1"" по договору ""%2""'"),
			Операция.Контрагент,
			Операция.Договор);
		
	ИначеЕсли МетаданныеДокумента.Имя = "КассовоеПоступление"
		ИЛИ МетаданныеДокумента.Имя = "ПриходныйКассовыйОрдер"
		ИЛИ МетаданныеДокумента.Имя = "ЭквайринговаяОперация" Тогда
		
		Если ЗначениеЗаполнено(Операция.Договор) Тогда
			
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Поступление денежных средств от контрагента ""%1"" по договору ""%2""'"),
				Операция.Контрагент,
				Операция.Договор);
			
		Иначе
			
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Поступление денежных средств от контрагента ""%1""'"),
				Операция.Контрагент);
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ОтражениеЗарплатыВУчете" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Начисление заработной платы и налогов с ФОТ за %1'"),
			Формат(Операция.Период, "ДФ=""ММММ гггг"""));
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПередачаОбъектаОС"
		ИЛИ МетаданныеДокумента.Имя = "ПередачаГруппОбъектовОС"
		ИЛИ МетаданныеДокумента.Имя = "ПередачаЗдания" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Реализация объектов ОС, НМА контрагенту ""%1"" по договору ""%2""'"),
			Операция.Контрагент,
			Операция.Договор);
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеМЗ" Тогда
		
		Если ДокументСсылка.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ПоступлениеОтПоставщика Тогда
			
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Поступление материальных запасов от поставщика ""%1"" по договору ""%2""'"),
				Операция.Контрагент,
				Операция.Договор);
			
		ИначеЕсли ДокументСсылка.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратОтПокупателя Тогда
			
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Возврат материальных запасов от покупателя ""%1"" по договору ""%2""'"),
				Операция.Контрагент,
				Операция.Договор);
			
		ИначеЕсли ДокументСсылка.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.Поступление Тогда
			
			ОтКонтрагента = ?(ЗначениеЗаполнено(ДокументСсылка.Контрагент),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = ' от контрагента ""%1""'"), ДокументСсылка.Контрагент), "");
			ПоДоговору = ?(ЗначениеЗаполнено(ДокументСсылка.Договор),
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = ' по договору ""%1""'"), ДокументСсылка.Договор), "");
			ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Прочее поступление материальных запасов%1%2'"),
				ОтКонтрагента,
				ПоДоговору);
			
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеУслугРабот" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Контрагентом ""%1"" оказаны услуги по договору ""%2""'"),
			Операция.Контрагент,
			Операция.Договор);
		
	ИначеЕсли МетаданныеДокумента.Имя = "АвансовыйОтчет" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Представлен авансовый отчет: %1'"),
			ДокументСсылка.Сотрудник);
		Если ЗначениеЗаполнено(ДокументСсылка.НазначениеАванса) Тогда
			ОписаниеОперации = ОписаниеОперации + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = ', назначение аванса  ""%1""'"),
				ДокументСсылка.НазначениеАванса);
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ОтчетОРасходахПодотчетногоЛица" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Представлен отчет о расходах подотчетного лица: %1'"),
			ДокументСсылка.Сотрудник);
		Если ЗначениеЗаполнено(ДокументСсылка.НазначениеАванса) Тогда
			ОписаниеОперации = ОписаниеОперации + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = ', назначение аванса  ""%1""'"),
				ДокументСсылка.НазначениеАванса);
		КонецЕсли;
		
	ИначеЕсли МетаданныеДокумента.Имя = "ТребованиеНакладная0315006" Тогда
		
		ОписаниеОперации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Требование накладная на списание материалов, МОЛ/Место хранения: %1'"),
				ДокументСсылка.ЦМООтправитель);
		
	ИначеЕсли МетаданныеДокумента.Имя = "СписаниеДопРасходовУСН" Тогда
		
		ОписаниеОперации = НСтр("ru = 'Регламентная операция'");
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОписаниеОперации) Тогда
		ОписаниеОперации = МетаданныеДокумента.Синоним;
	КонецЕсли;
	
	Возврат ОписаниеОперации;
	
КонецФункции

Процедура СкорректироватьПроводкиОтраженияДоходовРасходов(ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты) Экспорт
	
	ВидыДеятельностиНУ = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат;
	ВидыСубконто       = ПланыВидовХарактеристик.ВидыСубконто;
	
	КоличествоПроводок = ТаблицаПроводок.Количество();
	Для НомерПроводки = 1 По КоличествоПроводок Цикл
		
		ИндексПроводки = КоличествоПроводок - НомерПроводки;
		Проводка = ТаблицаПроводок[ИндексПроводки];
		
		СвойстваСчетаДт = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетДт);
		СвойстваСчетаКт = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Проводка.СчетКт);
		
		Проводка.Сумма                = ?(Проводка.Сумма = NULL,                0, Проводка.Сумма);
		Проводка.СуммаНеУчитываетсяНУ = ?(Проводка.СуммаНеУчитываетсяНУ = NULL, 0, Проводка.СуммаНеУчитываетсяНУ);
		Проводка.СуммаЕНВД            = ?(Проводка.СуммаЕНВД = NULL,            0, Проводка.СуммаЕНВД);
		Проводка.СуммаНДС             = ?(Проводка.СуммаНДС = NULL,             0, Проводка.СуммаНДС);
		
		// ДОХОДЫ
		ИспользуетсяСчетАП = (Проводка.Период >= УчетРасчетов.ДатаПереходаНаЗабалансовыйСчетАП(Проводка.Организация));
		Если ИспользуетсяСчетАП Тогда
			ЭтоЗачетАвансаПолученного = БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "АП")
				И (Проводка.ХарактеристикаДвиженияДт <> Перечисления.СобытияНДС.ВозвратАвансаПолученного);
		Иначе
			ЭтоЗачетАвансаПолученного =
				(УчетРасчетов.ВедетсяУчетАвансовПолученных(Проводка.СчетДт)
				И УчетРасчетов.ВедетсяУчетАвансовПолученных(Проводка.СчетКт));
		КонецЕсли;
		
		Если ЭтоЗачетАвансаПолученного И УчетУСНКлиентСервер.ВедетсяУчетРасчетовПоЕНВД(Проводка.Организация, Проводка.Период, Проводка.КФО) Тогда
			
			КоличествоДобавленныхПроводок = 1;
			
			ПорядокНалогообложения = Проводка["ХарактеристикаДвижения" + ?(ИспользуетсяСчетАП, "Дт", "Кт")];
			ЭтоОсобыйПорядокНалогообложения = (ПорядокНалогообложения = ВидыДеятельностиНУ.ОсобыйПорядокНалогообложения);
			Если ЭтоОсобыйПорядокНалогообложения И (Проводка.Сумма - Проводка.СуммаЕНВД > 0) Тогда
				
				Если НЕ ИспользуетсяСчетАП Тогда // После перехода на 64н эти проводки формируются типовой операцией "Зачет аванса полученного (УСН + ЕНВД)".
					
					// Скорректируем показатель СуммаЕНВД на счете 205.ХХ, если зачли авансы, отнесенные к деятельности на УСН.
					НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки + КоличествоДобавленныхПроводок);
					ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка, ,
						"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,КПСДт,КЭКДт,ПодразделениеДт,
						|ВалютаДт,ВалютнаяСуммаДт,КоличествоДт,ВалютнаяСуммаКт,КоличествоКт,
						|Сумма,СуммаНеУчитываетсяНУ,СуммаЕНВД,СуммаНДС"); // без корреспонденции
					
					НоваяПроводка.Содержание = НСтр("ru = 'Аванс отнесен к деятельности на ЕНВД.'");
					НоваяПроводка.СчетДт     = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("000");
					НоваяПроводка.ВидСубконтоДт1 = ВидыСубконто.ПустаяСсылка();
					НоваяПроводка.ВидСубконтоДт2 = ВидыСубконто.ПустаяСсылка();
					НоваяПроводка.ВидСубконтоДт3 = ВидыСубконто.ПустаяСсылка();
					
					НоваяПроводка.СуммаЕНВД = Проводка.Сумма - Проводка.СуммаЕНВД;
					
					КоличествоДобавленныхПроводок = КоличествоДобавленныхПроводок + 1;
					
				КонецЕсли;
				
				// Скорректируем доходы на счете У99 "Доходы и расходы".
				НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки + КоличествоДобавленныхПроводок);
				ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка,
					"Активность,Период,Организация,ИФО,КФО,
					|ВидПервичногоДокумента,ДатаПервичногоДокумента,НомерПервичногоДокумента"); // без корреспонденции
				НоваяПроводка.ВидСубконтоДт1 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоДт2 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоДт3 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт1 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт2 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт3 = ВидыСубконто.ПустаяСсылка();
				
				НоваяПроводка.Содержание = НСтр("ru = 'Аванс отнесен к деятельности на ЕНВД.'");
				НоваяПроводка.СчетДт = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРК");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Контрагенты", Проводка.СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Договоры",    Проводка.СубконтоДт2);
				НоваяПроводка.ХарактеристикаДвиженияДт = ПорядокНалогообложения;
				
				НоваяПроводка.СчетКт = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Кт", "ДокументыОплатыУСН", Проводка.СубконтоДт3);
				НоваяПроводка.ХарактеристикаДвиженияКт = Перечисления.ПорядокОтраженияАвансовУСН.ДоходЕНВД;
				
				СвойстваСчетаДтУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетДт);
				СвойстваСчетаКтУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетКт);
				Если СвойстваСчетаДтУСН.УчетПоПодразделениям И СвойстваСчетаДт.УчетПоПодразделениям Тогда
					НоваяПроводка.ПодразделениеДт = Проводка.ПодразделениеДт;
					Если СвойстваСчетаКтУСН.УчетПоПодразделениям Тогда
						НоваяПроводка.ПодразделениеКт = НоваяПроводка.ПодразделениеДт;
					КонецЕсли;
				КонецЕсли;
				Если СвойстваСчетаДтУСН.УчетПоКПС И СвойстваСчетаДт.УчетПоКПС Тогда
					НоваяПроводка.КПСДт = Проводка.КПСДт;
					Если СвойстваСчетаКтУСН.УчетПоКПС Тогда
						НоваяПроводка.КПСКт = НоваяПроводка.КПСДт;
					КонецЕсли;
				КонецЕсли;
				
				НоваяПроводка.Сумма     = - (Проводка.Сумма - Проводка.СуммаЕНВД);
				НоваяПроводка.СуммаЕНВД = + (Проводка.Сумма - Проводка.СуммаЕНВД);
				
				КоличествоДобавленныхПроводок = КоличествоДобавленныхПроводок + 1;
				
			ИначеЕсли НЕ ЭтоОсобыйПорядокНалогообложения И Проводка.СуммаЕНВД > 0 Тогда
				
				Если НЕ ИспользуетсяСчетАП Тогда // После перехода на 64н эти проводки формируются типовой операцией "Зачет аванса полученного (УСН + ЕНВД)".
					
					// Скорректируем показатель СуммаЕНВД на счете 205.ХХ, если зачли авансы, отнесенные к деятельности на ЕНВД.
					НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки + КоличествоДобавленныхПроводок);
					ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка, ,
						"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,КПСДт,КЭКДт,ПодразделениеДт,
						|ВалютаДт,ВалютнаяСуммаДт,КоличествоДт,ВалютнаяСуммаКт,КоличествоКт,
						|Сумма,СуммаНеУчитываетсяНУ,СуммаЕНВД,СуммаНДС"); // без корреспонденции
					
					НоваяПроводка.Содержание = НСтр("ru = 'Аванс отнесен к деятельности на УСН.'");
					НоваяПроводка.СчетДт     = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("000");
					НоваяПроводка.ВидСубконтоДт1 = ВидыСубконто.ПустаяСсылка();
					НоваяПроводка.ВидСубконтоДт2 = ВидыСубконто.ПустаяСсылка();
					НоваяПроводка.ВидСубконтоДт3 = ВидыСубконто.ПустаяСсылка();
					
					НоваяПроводка.СуммаЕНВД = - Проводка.СуммаЕНВД;
					
					КоличествоДобавленныхПроводок = КоличествоДобавленныхПроводок + 1;
					
				КонецЕсли;
				
				// Скорректируем доходы на счете У99 "Доходы и расходы".
				НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки + КоличествоДобавленныхПроводок);
				ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка,
					"Активность,Период,Организация,ИФО,КФО,
					|ВидПервичногоДокумента,ДатаПервичногоДокумента,НомерПервичногоДокумента"); // без корреспонденции
				НоваяПроводка.ВидСубконтоДт1 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоДт2 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоДт3 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт1 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт2 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт3 = ВидыСубконто.ПустаяСсылка();
				
				НоваяПроводка.Содержание = НСтр("ru = 'Аванс отнесен к деятельности на УСН.'");
				НоваяПроводка.СчетДт = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРК");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Контрагенты", Проводка.СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Договоры",    Проводка.СубконтоДт2);
				НоваяПроводка.ХарактеристикаДвиженияДт = ПорядокНалогообложения;
				
				НоваяПроводка.СчетКт = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Кт", "ДокументыОплатыУСН", Проводка.СубконтоДт3);
				НоваяПроводка.ХарактеристикаДвиженияКт = Перечисления.ПорядокОтраженияАвансовУСН.ДоходУСН;
				
				СвойстваСчетаДтУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетДт);
				СвойстваСчетаКтУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетКт);
				Если СвойстваСчетаДтУСН.УчетПоПодразделениям И СвойстваСчетаДт.УчетПоПодразделениям Тогда
					НоваяПроводка.ПодразделениеДт = Проводка.ПодразделениеДт;
					Если СвойстваСчетаКтУСН.УчетПоПодразделениям Тогда
						НоваяПроводка.ПодразделениеКт = НоваяПроводка.ПодразделениеДт;
					КонецЕсли;
				КонецЕсли;
				Если СвойстваСчетаДтУСН.УчетПоКПС И СвойстваСчетаДт.УчетПоКПС Тогда
					НоваяПроводка.КПСДт = Проводка.КПСДт;
					Если СвойстваСчетаКтУСН.УчетПоКПС Тогда
						НоваяПроводка.КПСКт = НоваяПроводка.КПСДт;
					КонецЕсли;
				КонецЕсли;
				
				НоваяПроводка.Сумма     = + Проводка.СуммаЕНВД;
				НоваяПроводка.СуммаЕНВД = - Проводка.СуммаЕНВД;
				
				КоличествоДобавленныхПроводок = КоличествоДобавленныхПроводок + 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтоОплаченныеДоходыУСН = БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "УД");
		Если ЭтоОплаченныеДоходыУСН Тогда
			
			КоличествоДобавленныхПроводок = 1;
			
			ДокументОплатыУСН = Проводка.ХарактеристикаДвиженияДт;
			Если Проводка.СуммаНДС > 0 Тогда
				
				// Скорректируем доходы на счете У99 "Доходы и расходы".
				НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки + КоличествоДобавленныхПроводок);
				ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка,
					"Активность,Период,Организация,ИФО,КФО,
					|ВидПервичногоДокумента,ДатаПервичногоДокумента,НомерПервичногоДокумента"); // без корреспонденции
				НоваяПроводка.ВидСубконтоДт1 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоДт2 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоДт3 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт1 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт2 = ВидыСубконто.ПустаяСсылка();
				НоваяПроводка.ВидСубконтоКт3 = ВидыСубконто.ПустаяСсылка();
				
				НоваяПроводка.Содержание = НСтр("ru = 'Предъявленный покупателям НДС исключен из доходов'");
				НоваяПроводка.СчетДт = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("УРК");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Контрагенты", Проводка.СубконтоДт1);
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Договоры",    Проводка.СубконтоДт2);
				
				НоваяПроводка.СчетКт = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("У99");
				БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Кт", "ДокументыОплатыУСН", ДокументОплатыУСН);
				
				СвойстваСчетаДтУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетДт);
				СвойстваСчетаКтУСН = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(НоваяПроводка.СчетКт);
				Если СвойстваСчетаДтУСН.УчетПоПодразделениям И СвойстваСчетаДт.УчетПоПодразделениям Тогда
					НоваяПроводка.ПодразделениеДт = Проводка.ПодразделениеДт;
					Если СвойстваСчетаКтУСН.УчетПоПодразделениям Тогда
						НоваяПроводка.ПодразделениеКт = НоваяПроводка.ПодразделениеДт;
					КонецЕсли;
				КонецЕсли;
				Если СвойстваСчетаДтУСН.УчетПоКПС И СвойстваСчетаДт.УчетПоКПС Тогда
					НоваяПроводка.КПСДт = Проводка.КПСДт;
					Если СвойстваСчетаКтУСН.УчетПоКПС Тогда
						НоваяПроводка.КПСКт = НоваяПроводка.КПСДт;
					КонецЕсли;
				КонецЕсли;
				
				НоваяПроводка.Сумма    = - Проводка.СуммаНДС;
				НоваяПроводка.СуммаНДС = + Проводка.СуммаНДС;
				
				КоличествоДобавленныхПроводок = КоличествоДобавленныхПроводок + 1;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// РАСХОДЫ
		// Корректировать нужно, если это расходы по деятельности с особым порядком налогообложения (ЕНВД и пр.)
		//  или расходы, не учитываемые при налогообложении по ст. 251 и 270 НК РФ.
		
		Если НЕ ЗначениеЗаполнено(СвойстваСчетаДт)
		 ИЛИ СвойстваСчетаДт.ТипСчета <> ПредопределенноеЗначение("Перечисление.ТипыСчетов.Налоговый") Тогда
			Продолжить; // корректируем только проводки по счетам УСН
		КонецЕсли;
		
		ЭтоНеУчитываемые  = (Проводка.ХарактеристикаДвиженияДт = Перечисления.ОтражениеВУСН.НеПринимаются);
		ЭтоЕНВД           = (Проводка.ХарактеристикаДвиженияДт = Перечисления.ОтражениеВУСН.ОсобыйПорядок);
		
		Если ЭтоНеУчитываемые ИЛИ ЭтоЕНВД Тогда
			
			// Скорректируем стоимость списания имущества.
			МассивСчетовУСН = БухгалтерскийУчет.СписокСчетов("У10,У15,У20,У41,У68,У70");
			Если МассивСчетовУСН.Найти(Проводка.СчетКт) <> Неопределено Тогда
			
				Если ЭтоНеУчитываемые И (Проводка.Сумма <> 0 ИЛИ Проводка.СуммаЕНВД <> 0 ИЛИ Проводка.СуммаНДС <> 0) Тогда
					
					НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки);
					ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка, ,
						"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,КПСДт,ПодразделениеДт,
						|ВалютаДт,ВалютнаяСуммаДт,КоличествоДт,
						|ВалютнаяСуммаКт,КоличествоКт"); // без корреспонденции
					
					// списываем суммы в остальных ресурсах на не учитываемые
					НоваяПроводка.СуммаНеУчитываетсяНУ = - (Проводка.Сумма + Проводка.СуммаЕНВД + Проводка.СуммаНДС);
					
				ИначеЕсли ЭтоЕНВД И (Проводка.Сумма <> 0 ИЛИ Проводка.СуммаНеУчитываетсяНУ <> 0 ИЛИ Проводка.СуммаНДС <> 0) Тогда
					
					НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки);
					ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка, ,
						"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,КПСДт,ПодразделениеДт,
						|ВалютаДт,ВалютнаяСуммаДт,КоличествоДт,
						|ВалютнаяСуммаКт,КоличествоКт"); // без корреспонденции
					
					// списываем суммы в остальных ресурсах на ЕНВД
					НоваяПроводка.СуммаЕНВД = - (Проводка.Сумма + Проводка.СуммаНеУчитываетсяНУ + Проводка.СуммаНДС);
					
				КонецЕсли;
				
			КонецЕсли;
			
			// общую сумму расходов спишем по соответствующему ресурсу
			ОбщаяСуммаРасходов = Проводка.Сумма + Проводка.СуммаНеУчитываетсяНУ + Проводка.СуммаЕНВД + Проводка.СуммаНДС;
			
			Проводка.СуммаНеУчитываетсяНУ = ?(ЭтоНеУчитываемые, ОбщаяСуммаРасходов, 0);
			Проводка.СуммаЕНВД            = ?(ЭтоЕНВД,          ОбщаяСуммаРасходов, 0);
			Проводка.Сумма                = 0;
			Проводка.СуммаНДС             = 0;
			
		КонецЕсли;
		
		Если БухгалтерскийУчет.СчетВИерархии(Проводка.СчетДт, "УРН")
		   И БухгалтерскийУчет.СчетВИерархии(Проводка.СчетКт, "УРН") Тогда
			
			Если (Проводка.СуммаЕНВД <> 0 ИЛИ Проводка.СуммаНеУчитываетсяНУ <> 0) Тогда
				
				// Расходы на уплату налогов отнесены к ЕНВД или к неучитываемым расходам.
				// Уплата налогов всегда отражается по Дт УРН по ресурсу "Сумма".
				НоваяПроводка = ТаблицаПроводок.Вставить(ИндексПроводки);
				ЗаполнитьЗначенияСвойств(НоваяПроводка, Проводка, ,
					"СчетДт,СубконтоДт1,СубконтоДт2,СубконтоДт3,КПСДт,ПодразделениеДт,
					|ВалютаДт,ВалютнаяСуммаДт,КоличествоДт,
					|ВалютнаяСуммаКт,КоличествоКт"); // без корреспонденции
				
				// Списываем сумму зачета оплаты из ресурса "Сумма" за счет неучитываемых и ЕНВД.
				НоваяПроводка.Сумма                = Проводка.СуммаНеУчитываетсяНУ + Проводка.СуммаЕНВД;
				НоваяПроводка.СуммаНеУчитываетсяНУ = - Проводка.СуммаНеУчитываетсяНУ;
				НоваяПроводка.СуммаЕНВД            = - Проводка.СуммаЕНВД;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает реквизиты первичного документа для занесения в графу 2 КУДиР
//
Функция РеквизитыПервичногоДокумента(Знач Документ, Знач УказыватьВид = Ложь, СтруктураРеквизитов = Неопределено) Экспорт
	
	ОпределитьНомерДокументаСНастройкойПрефиксов = (СтруктураРеквизитов <> Неопределено);
	
	СтруктураРеквизитов = Новый Структура("Наименование,Номер,Дата");
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		Возврат "";
	КонецЕсли;
	
	ВидНаПечать		= "";
	НомерНаПечать	= "";
	ДатаНаПечать	= "";
	ДатаДокумента	= '00010101';
	
	МетаданныеДокумента	= Документ.Метаданные();

	Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("НомерПервичногоДокумента", МетаданныеДокумента) И
		ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ДатаПервичногоДокумента", МетаданныеДокумента) Тогда

		НомерНаПечать = Документ.НомерПервичногоДокумента;
		ДатаНаПечать  = Формат(Документ.ДатаПервичногоДокумента, "ДЛФ=D");
		ДатаДокумента = НачалоДня(Документ.ДатаПервичногоДокумента);
	КонецЕсли;

	//Если дата и номер первичного документа не указаны или не заполнены, используем дату и номер регистрации
	Если НЕ ЗначениеЗаполнено(НомерНаПечать) Тогда
		Если ОпределитьНомерДокументаСНастройкойПрефиксов Тогда
			НомерДокументаСНастройкойПрефиксов = РегистрыСведений.НастройкиПечатиПрефиксаНомера.ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(Документ, Документ.Номер);
			
			НомерНаПечать = НомерДокументаСНастройкойПрефиксов;
		Иначе
			НомерДокументаБезПрефиксов = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Документ.Номер, Истина, Истина);
			
			НомерНаПечать = НомерДокументаБезПрефиксов;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаНаПечать) Тогда
		ДатаНаПечать = Формат(Документ.Дата, "ДЛФ=D");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = НачалоДня(Документ.Дата);
	КонецЕсли;
	
	Если УказыватьВид Тогда
	
		Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ВидПервичногоДокумента", МетаданныеДокумента)
		   И ЗначениеЗаполнено(Документ.ВидПервичногоДокумента) Тогда
			ВидНаПечать = Документ.ВидПервичногоДокумента;
		Иначе
			ВидНаПечать = МетаданныеДокумента.Синоним;
		КонецЕсли;
	
		РеквизитыПервичногоДокумента	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 № %2 от %3'"),
			ВидНаПечать, НомерНаПечать, ДатаНаПечать);

	Иначе
	
		РеквизитыПервичногоДокумента	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '№ %1 от %2'"),
			НомерНаПечать, ДатаНаПечать);

	КонецЕсли;
	
	СтруктураРеквизитов.Наименование = ВидНаПечать;
	СтруктураРеквизитов.Номер = НомерНаПечать;
	СтруктураРеквизитов.Дата = ДатаДокумента;
	
	Возврат РеквизитыПервичногоДокумента;
	
КонецФункции

#КонецОбласти

#Область РегламентированныйОтчетУСН

Процедура ПолучитьСведенияОПоказателяхОтчетаУСНФормаОтчета2014Кв1(ПоказателиОтчета) Экспорт

	// Раздел 2.1
	
	// признак налогоплательщика
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210010203", Истина, Ложь);
	
	// доходы
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210011003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210011103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210011203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210011303", Истина, Ложь);
	
	// расходы, уменьшающие налог
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210014003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210014103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210014203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000210014303", Истина, Ложь);
	
	// Раздел 2.2
	
	// доходы
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021303", Истина, Ложь);
	
	// расходы
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022303", Истина, Ложь);
	
	// ставка налога
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026303", Истина, Ложь);
	
	// убытки прошлых лет
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220023003", Истина, Ложь);

КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхОтчетаУСНФормаОтчета2015Кв1(ПоказателиОтчета) Экспорт

	// Раздел 2.1.1
	
	// признак налогоплательщика
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110010203", Истина, Ложь);
	
	// доходы
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110011003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110011103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110011203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110011303", Истина, Ложь);
	
	// ставки налога
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110012003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110012103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110012203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110012303", Истина, Ложь);
	
	// расходы, уменьшающие налог
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110014003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110014103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110014203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П002110014303", Истина, Ложь);
	
	// Раздел 2.2
	
	// доходы
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220021303", Истина, Ложь);
	
	// расходы
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220022303", Истина, Ложь);
	
	// ставка налога
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026003", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026103", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026203", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220026303", Истина, Ложь);
	
	// убытки прошлых лет
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000220023003", Истина, Ложь);

КонецПроцедуры

Процедура ПолучитьСведенияОПоказателяхОтчетаУСНФормаОтчета2021Кв1(ПоказателиОтчета) Экспорт
	
	КлючиПоказателей = КлючиПоказателейДекларации2021Кв1();
	
	// Раздел 2.1 (для объекта "Доходы")
	
	КлючиПоказателей21 = КлючиПоказателей.Раздел21;
	
	// Подраздел 2.1.1 - основной
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
		КлючиПоказателей21.ПризнакНалогоплательщика, Истина, Ложь);
	
	Для НомерКвартала = 1 По 4 Цикл
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
			КлючиПоказателей21["Доходы" + НомерКвартала], Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
			КлючиПоказателей21["СтавкаНалога" + НомерКвартала], Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
			КлючиПоказателей21["УменьшениеНалога" + НомерКвартала], Истина, Ложь);
	КонецЦикла;
	
	// Раздел 2.2 (для объекта "Доходы минус расходы")
	
	КлючиПоказателей22 = КлючиПоказателей.Раздел22;
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
		КлючиПоказателей22.УбытокПрошлыхЛет, Истина, Ложь);
	
	Для НомерКвартала = 1 По 4 Цикл
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
			КлючиПоказателей22["Доходы" + НомерКвартала], Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
			КлючиПоказателей22["Расходы" + НомерКвартала], Истина, Ложь);
		РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета,
			КлючиПоказателей22["СтавкаНалога" + НомерКвартала], Истина, Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОтчетУСНФормаОтчета2014Кв1(ПараметрыОтчета, Контейнер) Экспорт

	НачалоПериода       = НачалоГода(ПараметрыОтчета.мДатаНачалаПериодаОтчета);
	КонецПериода        = КонецГода(ПараметрыОтчета.мДатаКонцаПериодаОтчета);
	КонецПериодаГраница = Новый Граница(КонецПериода, ВидГраницы.Включая);

	ПрименяетсяУСНДоходы = Ложь;

	// Учтем возможные сценарии:
	// 1. Единственная запись в учетной политике организации введена не с начала отчетного года.
	// 2. В течение года организация утратила право на применение УСН.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",           ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.ПрименяетсяУСНДоходы КАК ПрименяетсяУСНДоходы
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(
	|			&КонецОтчетногоПериода,
	|			Организация = &Организация
	|				И ПрименяетсяУСН) КАК УчетнаяПолитикаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПрименяетсяУСНДоходы = Выборка.ПрименяетсяУСНДоходы;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭтоИПБезВыплатФизлицам = Ложь;

	// периоды и ставки налога для поквартальных расчетов
	ДанныеПериодов = Новый ТаблицаЗначений;
	ДанныеПериодов.Колонки.Добавить("НомерКвартала", ОбщегоНазначения.ОписаниеТипаЧисло(1, 0, ДопустимыйЗнак.Неотрицательный));
	ДанныеПериодов.Колонки.Добавить("Период",        ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ДанныеПериодов.Колонки.Добавить("СтавкаНалога",  ОбщегоНазначения.ОписаниеТипаЧисло(5, 2, ДопустимыйЗнак.Неотрицательный));

	Для НомерКвартала = 1 По 4 Цикл
		
		ДатаНачалаКвартала = НачалоКвартала(ДобавитьМесяц(НачалоПериода, (НомерКвартала-1)*3));
		СтрокаПериода = ДанныеПериодов.Добавить();
		СтрокаПериода.НомерКвартала = НомерКвартала;
		СтрокаПериода.Период        = ДатаНачалаКвартала;
		
		Если ПрименяетсяУСНДоходы Тогда
			СтрокаПериода.СтавкаНалога = 6;
		Иначе
			ИмяЯчейки = "П000220026" + (НомерКвартала - 1) + "03";
			СтавкаИзДекларации = Контейнер.Раздел22[ИмяЯчейки];
			Если ЗначениеЗаполнено(СтавкаИзДекларации) Тогда
				СтрокаПериода.СтавкаНалога = СтавкаИзДекларации;
			Иначе
				ДатаОкончанияКвартала = КонецКвартала(ДобавитьМесяц(НачалоПериода, (НомерКвартала-1)*3));
				СтавкаИзУП = УчетУСНВызовСервера.СтавкаНалогаУСН(ПараметрыОтчета.Организация, ДатаОкончанияКвартала);
				Контейнер.Раздел22[ИмяЯчейки] = СтавкаИзУП;
				СтрокаПериода.СтавкаНалога = СтавкаИзУП;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	// показатели налоговой базы по данным ИБ
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",       НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",        КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаГраница", КонецПериодаГраница);
	Запрос.УстановитьПараметр("Организация",         ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ДанныеПериодов",      ДанныеПериодов);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеПериодов.Период КАК Период,
	|	ДанныеПериодов.НомерКвартала
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	&ДанныеПериодов КАК ДанныеПериодов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.НомерКвартала,
	|	ВТ_Периоды.Период КАК Период,
	|	ЕСТЬNULL(КнигаУчетаДоходовИРасходовОбороты.ДоходыУСНОборот, 0) КАК Доходы,
	|	ЕСТЬNULL(КнигаУчетаДоходовИРасходовОбороты.РасходыУСНОборот, 0) КАК Расходы
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КнигаУчетаДоходовИРасходов.Обороты(&НачалоПериода, &КонецПериодаГраница, Квартал, Организация = &Организация) КАК КнигаУчетаДоходовИРасходовОбороты
	|		ПО (ВТ_Периоды.Период = НАЧАЛОПЕРИОДА(КнигаУчетаДоходовИРасходовОбороты.Период, КВАРТАЛ))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерКвартала"
	+ ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета();
	
	Если ПрименяетсяУСНДоходы Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ВТ_Периоды.НомерКвартала КАК НомерКвартала,
		|	ВТ_Периоды.Период,
		|	ЕСТЬNULL(ВложенныйЗапрос.ПФР, 0) КАК ПФР,
		|	ЕСТЬNULL(ВложенныйЗапрос.ФСС, 0) КАК ФСС,
		|	ЕСТЬNULL(ВложенныйЗапрос.ФОМС, 0) КАК ФОМС,
		|	ЕСТЬNULL(ВложенныйЗапрос.ФСС_НС, 0) КАК ФСС_НС,
		|	ЕСТЬNULL(ВложенныйЗапрос.Больничные, 0) КАК Больничные,
		|	ЕСТЬNULL(ВложенныйЗапрос.ДобровольноеСтрахование, 0) КАК ДобровольноеСтрахование
		|ИЗ
		|	ВТ_Периоды КАК ВТ_Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата, КВАРТАЛ) КАК Период,
		|			СУММА(ЗаписьКУДиРУменьшениеНалога.ПФР) КАК ПФР,
		|			СУММА(ЗаписьКУДиРУменьшениеНалога.ФСС) КАК ФСС,
		|			СУММА(ЗаписьКУДиРУменьшениеНалога.ФОМС) КАК ФОМС,
		|			СУММА(ЗаписьКУДиРУменьшениеНалога.ФСС_НС) КАК ФСС_НС,
		|			СУММА(ЗаписьКУДиРУменьшениеНалога.Больничные) КАК Больничные,
		|			СУММА(ЗаписьКУДиРУменьшениеНалога.ДобровольноеСтрахование) КАК ДобровольноеСтрахование
		|		ИЗ
		|			Документ.ЗаписьКУДиР.УменьшениеНалога КАК ЗаписьКУДиРУменьшениеНалога
		|		ГДЕ
		|			ЗаписьКУДиРУменьшениеНалога.Ссылка.Проведен
		|			И НЕ ЗаписьКУДиРУменьшениеНалога.Ссылка.ПометкаУдаления
		|			И ЗаписьКУДиРУменьшениеНалога.Ссылка.Организация = &Организация
		|			И ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|		
		|		СГРУППИРОВАТЬ ПО
		|			НАЧАЛОПЕРИОДА(ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата, КВАРТАЛ)) КАК ВложенныйЗапрос
		|		ПО ВТ_Периоды.Период = ВложенныйЗапрос.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерКвартала"
		+ ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапросаНалоговаяБаза = Запрос.ВыполнитьПакет();

	УбыткиПрошлыхЛет = Неопределено;
	Если НЕ ПрименяетсяУСНДоходы Тогда
		УбыткиПрошлыхЛет = ПеренесенныеУбыткиПрошлыхЛет(ПараметрыОтчета.Организация, НачалоПериода, КонецПериода);
	КонецЕсли;
	
	// заполнение показателей отчета
	
	ИтогоДоходы  = 0;
	ИтогоРасходы = 0;
	ИтогоРасходыУменьшающиеНалог = 0;
	
	ТаблицаДоходыРасходы = РезультатЗапросаНалоговаяБаза[1].Выгрузить();
	
	Если ПрименяетсяУСНДоходы Тогда // объект налогообложения "доходы"
		
		ЗаполняемыйРаздел = Контейнер.Раздел21;
		
		КоэффМаксУменьшенияНалога = ?(ЭтоИПБезВыплатФизлицам, 1, 0.5);
		ЗаполняемыйРаздел["П000210010203"] = ?(ЭтоИПБезВыплатФизлицам, "2", "1");
		
		ТаблицаРасходыУменьшающиеНалог = РезультатЗапросаНалоговаяБаза[2].Выгрузить();
		
		Для каждого СтрокаПериода Из ДанныеПериодов Цикл
			
			ИдКвартала = Строка(СтрокаПериода.НомерКвартала - 1);
			
			СтрокаДоходов = ТаблицаДоходыРасходы[СтрокаПериода.НомерКвартала-1];
			ИтогоДоходы   = ИтогоДоходы + СтрокаДоходов.Доходы;
			
			СтрокаРасходовУменьшающихНалог = ТаблицаРасходыУменьшающиеНалог[СтрокаПериода.НомерКвартала-1];
			ИтогоРасходыУменьшающиеНалог   = ИтогоРасходыУменьшающиеНалог
				+ СтрокаРасходовУменьшающихНалог.ПФР + СтрокаРасходовУменьшающихНалог.ФОМС
				+?(ЭтоИПБезВыплатФизлицам, 0, СтрокаРасходовУменьшающихНалог.ФСС + СтрокаРасходовУменьшающихНалог.ФСС_НС
					+ СтрокаРасходовУменьшающихНалог.Больничные + СтрокаРасходовУменьшающихНалог.ДобровольноеСтрахование);
				
			НалогОтБазы = ИтогоДоходы*СтрокаПериода.СтавкаНалога/100;
			УменьшениеНалога = Мин(НалогОтБазы*КоэффМаксУменьшенияНалога, ИтогоРасходыУменьшающиеНалог);
				
			ЗаполняемыйРаздел["П000210011" + ИдКвартала + "03"] = ИтогоДоходы;
			ЗаполняемыйРаздел["П000210014" + ИдКвартала + "03"] = УменьшениеНалога;
			
		КонецЦикла;
		
	Иначе // объект налогообложения "доходы минус расходы"
		
		ЗаполняемыйРаздел = Контейнер.Раздел22;
		
		Для каждого СтрокаПериода Из ДанныеПериодов Цикл
			
			ИдКвартала = Строка(СтрокаПериода.НомерКвартала - 1);
			
			СтрокаДоходовРасходов = ТаблицаДоходыРасходы[СтрокаПериода.НомерКвартала-1];
		
			ИтогоДоходы  = ИтогоДоходы + СтрокаДоходовРасходов.Доходы;
			ИтогоРасходы = ИтогоРасходы + СтрокаДоходовРасходов.Расходы;
			
			// в последнем квартела года учтем перенесенные убытки прошлых лет
			Если СтрокаПериода.НомерКвартала = 4 Тогда
				ИтогоРасходы = ИтогоРасходы + УбыткиПрошлыхЛет.УбытокОтУплатыМинимальногоНалога;
				НалоговаяБаза  = ИтогоДоходы - ИтогоРасходы;
				УменьшениеНалоговойБазы = Макс(0, Мин(НалоговаяБаза, УбыткиПрошлыхЛет.ПеренесенныеУбытки));
				ЗаполняемыйРаздел["П000220023003"] = УменьшениеНалоговойБазы;
			КонецЕсли;
			
			ЗаполняемыйРаздел["П000220021" + ИдКвартала + "03"] = ИтогоДоходы;
			ЗаполняемыйРаздел["П000220022" + ИдКвартала + "03"] = ИтогоРасходы;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтчетУСНФормаОтчета2015Кв1(ПараметрыОтчета, Контейнер) Экспорт

	НачалоГода          = НачалоГода(ПараметрыОтчета.мДатаНачалаПериодаОтчета);
	КонецПериода        = КонецГода(ПараметрыОтчета.мДатаКонцаПериодаОтчета);
	КонецПериодаГраница = Новый Граница(КонецПериода, ВидГраницы.Включая);
	
	Если ПараметрыОтчета.Свойство("ДатаНачалаРасширенногоПериодаОтчета") Тогда
		// Для зарегистрированных в декабре при подаче декларации за следующий год начало налогового периода - дата регистрации.
		НачалоНалоговогоПериода = ПараметрыОтчета.ДатаНачалаРасширенногоПериодаОтчета;
	Иначе
		НачалоНалоговогоПериода = НачалоГода;
	КонецЕсли;
	
	ПрименяетсяУСНДоходы = Ложь;
	
	// Учтем возможные сценарии:
	// 1. Единственная запись в учетной политике организации введена не с начала отчетного года.
	// 2. В течение года организация утратила право на применение УСН.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",           ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("КонецОтчетногоПериода", КонецПериода);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.ПрименяетсяУСНДоходы КАК ПрименяетсяУСНДоходы
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(
	|			&КонецОтчетногоПериода,
	|			Организация = &Организация
	|				И ПрименяетсяУСН) КАК УчетнаяПолитикаОрганизацийСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПрименяетсяУСНДоходы = Выборка.ПрименяетсяУСНДоходы;
	КонецЕсли;
	
	ЭтоИПБезВыплатФизлицам = Ложь; // Это государственное учреждение.

	// периоды и ставки налога для поквартальных расчетов
	ДанныеПериодов = Новый ТаблицаЗначений;
	ДанныеПериодов.Колонки.Добавить("НомерКвартала", ОбщегоНазначения.ОписаниеТипаЧисло(1, 0, ДопустимыйЗнак.Неотрицательный));
	ДанныеПериодов.Колонки.Добавить("Период",        ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ДанныеПериодов.Колонки.Добавить("СтавкаНалога",  ОбщегоНазначения.ОписаниеТипаЧисло(5, 2, ДопустимыйЗнак.Неотрицательный));
	
	Для НомерКвартала = 1 По 4 Цикл
		
		ДатаНачалаКвартала = НачалоКвартала(ДобавитьМесяц(НачалоГода, (НомерКвартала-1)*3));
		СтрокаПериода = ДанныеПериодов.Добавить();
		СтрокаПериода.НомерКвартала = НомерКвартала;
		СтрокаПериода.Период        = ДатаНачалаКвартала;
		
		// ставки налога задаются для каждого из отчетных периодов
		ДатаОкончанияКвартала = КонецКвартала(ДобавитьМесяц(НачалоГода, (НомерКвартала-1)*3));
		СтавкаИзУП = УчетУСНВызовСервера.СтавкаНалогаУСН(ПараметрыОтчета.Организация, ДатаОкончанияКвартала);
		СтрокаПериода.СтавкаНалога = СтавкаИзУП;
		
		Если ПрименяетсяУСНДоходы Тогда
			ИмяЯчейки = "П002110012" + (НомерКвартала - 1) + "03";
			Контейнер.Раздел21[ИмяЯчейки] = СтавкаИзУП;
		Иначе
			ИмяЯчейки = "П000220026" + (НомерКвартала - 1) + "03";
			Контейнер.Раздел22[ИмяЯчейки] = СтавкаИзУП;
		КонецЕсли;
		
	КонецЦикла;
	
	// Показатели налоговой базы по данным ИБ
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",       НачалоНалоговогоПериода);
	Запрос.УстановитьПараметр("КонецПериода",        КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаГраница", КонецПериодаГраница);
	Запрос.УстановитьПараметр("Организация",         ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("ДанныеПериодов",      ДанныеПериодов);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеПериодов.Период КАК Период,
	|	ДанныеПериодов.НомерКвартала КАК НомерКвартала
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	&ДанныеПериодов КАК ДанныеПериодов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ГОД(КнигаУчетаДоходовИРасходовОбороты.Период) < ГОД(&КонецПериода)
	|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(КнигаУчетаДоходовИРасходовОбороты.Период, КВАРТАЛ)
	|	КОНЕЦ КАК Период,
	|	СУММА(КнигаУчетаДоходовИРасходовОбороты.ДоходыУСНОборот) КАК Доходы,
	|	СУММА(КнигаУчетаДоходовИРасходовОбороты.РасходыУСНОборот) КАК Расходы
	|ПОМЕСТИТЬ ВТ_ДоходыИРасходыОбороты
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходов.Обороты(&НачалоПериода, &КонецПериодаГраница, Квартал, Организация = &Организация) КАК КнигаУчетаДоходовИРасходовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ГОД(КнигаУчетаДоходовИРасходовОбороты.Период) < ГОД(&КонецПериода)
	|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(КнигаУчетаДоходовИРасходовОбороты.Период, КВАРТАЛ)
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.НомерКвартала КАК НомерКвартала,
	|	ВТ_Периоды.Период КАК Период,
	|	ЕСТЬNULL(ВТ_ДоходыИРасходыОбороты.Доходы, 0) КАК Доходы,
	|	ЕСТЬNULL(ВТ_ДоходыИРасходыОбороты.Расходы, 0) КАК Расходы
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоходыИРасходыОбороты КАК ВТ_ДоходыИРасходыОбороты
	|		ПО ВТ_Периоды.Период = ВТ_ДоходыИРасходыОбороты.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Периоды.НомерКвартала"
	+ ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета();
	
	Если ПрименяетсяУСНДоходы Тогда
		ТекстЗапроса = ТекстЗапроса +
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ГОД(ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата) < ГОД(&КонецПериода)
		|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата, КВАРТАЛ)
		|	КОНЕЦ КАК Период,
		|	СУММА(ЗаписьКУДиРУменьшениеНалога.ПФР) КАК ПФР,
		|	СУММА(ЗаписьКУДиРУменьшениеНалога.ФСС) КАК ФСС,
		|	СУММА(ЗаписьКУДиРУменьшениеНалога.ФОМС) КАК ФОМС,
		|	СУММА(ЗаписьКУДиРУменьшениеНалога.ФСС_НС) КАК ФСС_НС,
		|	СУММА(ЗаписьКУДиРУменьшениеНалога.Больничные) КАК Больничные,
		|	СУММА(ЗаписьКУДиРУменьшениеНалога.ДобровольноеСтрахование) КАК ДобровольноеСтрахование
		|ПОМЕСТИТЬ ВТ_Раздел4Обороты
		|ИЗ
		|	Документ.ЗаписьКУДиР.УменьшениеНалога КАК ЗаписьКУДиРУменьшениеНалога
		|ГДЕ
		|	ЗаписьКУДиРУменьшениеНалога.Ссылка.Проведен
		|	И НЕ ЗаписьКУДиРУменьшениеНалога.Ссылка.ПометкаУдаления
		|	И ЗаписьКУДиРУменьшениеНалога.Ссылка.Организация = &Организация
		|	И ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ГОД(ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата) < ГОД(&КонецПериода)
		|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаписьКУДиРУменьшениеНалога.Ссылка.Дата, КВАРТАЛ)
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Периоды.НомерКвартала КАК НомерКвартала,
		|	ВТ_Периоды.Период КАК Период,
		|	СУММА(ЕСТЬNULL(ВТ_Раздел4Обороты.ПФР, 0)) КАК ПФР,
		|	СУММА(ЕСТЬNULL(ВТ_Раздел4Обороты.ФСС, 0)) КАК ФСС,
		|	СУММА(ЕСТЬNULL(ВТ_Раздел4Обороты.ФОМС, 0)) КАК ФОМС,
		|	СУММА(ЕСТЬNULL(ВТ_Раздел4Обороты.ФСС_НС, 0)) КАК ФСС_НС,
		|	СУММА(ЕСТЬNULL(ВТ_Раздел4Обороты.Больничные, 0)) КАК Больничные,
		|	СУММА(ЕСТЬNULL(ВТ_Раздел4Обороты.ДобровольноеСтрахование, 0)) КАК ДобровольноеСтрахование
		|ИЗ
		|	ВТ_Периоды КАК ВТ_Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Раздел4Обороты КАК ВТ_Раздел4Обороты
		|		ПО ВТ_Периоды.Период = ВТ_Раздел4Обороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Периоды.НомерКвартала,
		|	ВТ_Периоды.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерКвартала"
		+ ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета();
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапросаНалоговаяБаза = Запрос.ВыполнитьПакет();

	УбыткиПрошлыхЛет = Неопределено;
	Если НЕ ПрименяетсяУСНДоходы Тогда
		УбыткиПрошлыхЛет = ПеренесенныеУбыткиПрошлыхЛет(ПараметрыОтчета.Организация, НачалоГода, КонецПериода);
	КонецЕсли;
	
	// заполнение показателей отчета
	
	ИтогоДоходы  = 0;
	ИтогоРасходы = 0;
	ИтогоРасходыУменьшающиеНалог = 0;
	
	ТаблицаДоходыРасходы = РезультатЗапросаНалоговаяБаза[2].Выгрузить();
	
	Если ПрименяетсяУСНДоходы Тогда // объект налогообложения "доходы"
		
		ЗаполняемыйРаздел = Контейнер.Раздел21;
		
		КоэффМаксУменьшенияНалога = ?(ЭтоИПБезВыплатФизлицам, 1, 0.5);
		ЗаполняемыйРаздел["П002110010203"] = ?(ЭтоИПБезВыплатФизлицам, "2", "1");
		
		ТаблицаРасходыУменьшающиеНалог = РезультатЗапросаНалоговаяБаза[4].Выгрузить();
		
		Для каждого СтрокаПериода Из ДанныеПериодов Цикл
			
			ИдКвартала = Строка(СтрокаПериода.НомерКвартала - 1);
			
			СтрокаДоходов = ТаблицаДоходыРасходы[СтрокаПериода.НомерКвартала-1];
			ИтогоДоходы   = ИтогоДоходы + СтрокаДоходов.Доходы;
			
			СтрокаРасходовУменьшающихНалог = ТаблицаРасходыУменьшающиеНалог[СтрокаПериода.НомерКвартала-1];
			ИтогоРасходыУменьшающиеНалог   = ИтогоРасходыУменьшающиеНалог
				+ СтрокаРасходовУменьшающихНалог.ПФР + СтрокаРасходовУменьшающихНалог.ФОМС
				+?(ЭтоИПБезВыплатФизлицам, 0, СтрокаРасходовУменьшающихНалог.ФСС + СтрокаРасходовУменьшающихНалог.ФСС_НС
					+ СтрокаРасходовУменьшающихНалог.Больничные + СтрокаРасходовУменьшающихНалог.ДобровольноеСтрахование);
			
			НалоговаяБаза    = Окр(ИтогоДоходы, 0);
			НалогОтБазы      = Окр(НалоговаяБаза*СтрокаПериода.СтавкаНалога/100, 0);
			УменьшениеНалога = Мин(Окр(НалогОтБазы*КоэффМаксУменьшенияНалога, 0), ИтогоРасходыУменьшающиеНалог);
			
			ЗаполняемыйРаздел["П002110011" + ИдКвартала + "03"] = ИтогоДоходы;
			ЗаполняемыйРаздел["П002110014" + ИдКвартала + "03"] = УменьшениеНалога;
			
		КонецЦикла;
		
	Иначе // объект налогообложения "доходы минус расходы"
		
		ЗаполняемыйРаздел = Контейнер.Раздел22;
		
		Для каждого СтрокаПериода Из ДанныеПериодов Цикл
			
			ИдКвартала = Строка(СтрокаПериода.НомерКвартала - 1);
			
			СтрокаДоходовРасходов = ТаблицаДоходыРасходы[СтрокаПериода.НомерКвартала-1];
		
			ИтогоДоходы  = ИтогоДоходы + СтрокаДоходовРасходов.Доходы;
			ИтогоРасходы = ИтогоРасходы + СтрокаДоходовРасходов.Расходы;
			
			// в последнем квартела года учтем перенесенные убытки прошлых лет
			Если СтрокаПериода.НомерКвартала = 4 Тогда
				ИтогоРасходы = ИтогоРасходы + УбыткиПрошлыхЛет.УбытокОтУплатыМинимальногоНалога;
				НалоговаяБаза  = ИтогоДоходы - ИтогоРасходы;
				УменьшениеНалоговойБазы = Макс(0, Мин(НалоговаяБаза, УбыткиПрошлыхЛет.ПеренесенныеУбытки));
				ЗаполняемыйРаздел["П000220023003"] = УменьшениеНалоговойБазы;
			КонецЕсли;
			
			ЗаполняемыйРаздел["П000220021" + ИдКвартала + "03"] = ИтогоДоходы;
			ЗаполняемыйРаздел["П000220022" + ИдКвартала + "03"] = ИтогоРасходы;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОтчетУСНФормаОтчета2021Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	ПараметрыЗаполнения = ПараметрыЗаполненияДекларации2021Кв1(ПараметрыОтчета);
	Если Не ПараметрыЗаполнения.ПрименяетсяУСН Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКУДиР = ДанныеКУДиРЗаПериодПоКварталам(
		ПараметрыЗаполнения.Организация,
		ПараметрыЗаполнения.НачалоПериода,
		ПараметрыЗаполнения.КонецПериода,
		Истина,
		ПараметрыЗаполнения.ПрименяетсяУСНДоходы);
	
	СтавкиНалога = СтавкиНалогаУСНЗаПериод(ПараметрыЗаполнения.Организация, ПараметрыЗаполнения.КонецПериода, ДанныеКУДиР.Раздел1);
	
	КлючиПоказателей = КлючиПоказателейДекларации2021Кв1();
	
	Если ПараметрыЗаполнения.ПрименяетсяУСНДоходы Тогда // Объект налогообложения "доходы"
		
		ЗаполнитьДекларацию2021ОбъектДоходы(
			ПараметрыЗаполнения,
			ДанныеКУДиР,
			СтавкиНалога,
			Контейнер.Раздел21,
			КлючиПоказателей.Раздел21);
		
	Иначе // Объект налогообложения "доходы минус расходы"
		
		ЗаполнитьДекларацию2021ОбъектДоходыМинусРасходы(
			ПараметрыЗаполнения,
			ДанныеКУДиР,
			СтавкиНалога,
			Контейнер.Раздел22,
			КлючиПоказателей.Раздел22);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПеренесенныеУбыткиПрошлыхЛет(Организация, НачалоПериода, КонецПериода)

	СтруктураУбытков = Новый Структура("ПеренесенныеУбытки, УбытокОтУплатыМинимальногоНалога", 0, 0);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РегистрацияСуммыУбыткаУСН.СуммаНеПеренесенныхУбытков) КАК СуммаНеПеренесенныхУбытков,
	|	РегистрацияСуммыУбыткаУСН.Ссылка
	|ПОМЕСТИТЬ НеперенесенныеУбытки
	|ИЗ
	|	Документ.РегистрацияСуммыУбыткаУСН.Убытки КАК РегистрацияСуммыУбыткаУСН
	|ГДЕ
	|	РегистрацияСуммыУбыткаУСН.Ссылка.Организация = &Организация
	|	И РегистрацияСуммыУбыткаУСН.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РегистрацияСуммыУбыткаУСН.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрацияСуммыУбыткаУСН.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(РегистрацияСуммыУбыткаУСН.УбытокОтУплатыМинимальногоНалога), 0) КАК УбытокОтУплатыМинимальногоНалога,
	|	ЕСТЬNULL(СУММА(НеперенесенныеУбытки.СуммаНеПеренесенныхУбытков), 0) КАК СуммаНеПеренесенныхУбытков
	|ИЗ
	|	НеперенесенныеУбытки КАК НеперенесенныеУбытки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияСуммыУбыткаУСН КАК РегистрацияСуммыУбыткаУСН
	|		ПО НеперенесенныеУбытки.Ссылка = РегистрацияСуммыУбыткаУСН.Ссылка"
	;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураУбытков.ПеренесенныеУбытки				  = Выборка.СуммаНеПеренесенныхУбытков;
		СтруктураУбытков.УбытокОтУплатыМинимальногоНалога = Выборка.УбытокОтУплатыМинимальногоНалога;
	КонецЕсли;
	
	Возврат СтруктураУбытков;

КонецФункции

	#Область ЗаполнениеДекларацииФормаОтчета2021Кв1

Функция КлючиПоказателейДекларации2021Кв1()
	
	КлючиПоказателей = Новый Структура;
	
	// Раздел 2.1 (для объекта "Доходы")
	
	КлючиПоказателей.Вставить("Раздел21", Новый Структура);
	
	Раздел21 = КлючиПоказателей.Раздел21;
	
	// Подраздел 2.1.1 - основной
	Раздел21.Вставить("ПризнакНалогоплательщика", "П002110010203");
	
	Раздел21.Вставить("Доходы1", "П002110011003");
	Раздел21.Вставить("Доходы2", "П002110011103");
	Раздел21.Вставить("Доходы3", "П002110011203");
	Раздел21.Вставить("Доходы4", "П002110011303");
	
	Раздел21.Вставить("СтавкаНалога1", "П002110012003");
	Раздел21.Вставить("СтавкаНалога2", "П002110012103");
	Раздел21.Вставить("СтавкаНалога3", "П002110012203");
	Раздел21.Вставить("СтавкаНалога4", "П002110012303");
	
	Раздел21.Вставить("УменьшениеНалога1", "П002110014003");
	Раздел21.Вставить("УменьшениеНалога2", "П002110014103");
	Раздел21.Вставить("УменьшениеНалога3", "П002110014203");
	Раздел21.Вставить("УменьшениеНалога4", "П002110014303");
	
	// Раздел 2.2 (для объекта "Доходы минус расходы")
	
	КлючиПоказателей.Вставить("Раздел22", Новый Структура);
	
	Раздел22 = КлючиПоказателей.Раздел22;
	
	Раздел22.Вставить("Доходы1", "П000220021003");
	Раздел22.Вставить("Доходы2", "П000220021103");
	Раздел22.Вставить("Доходы3", "П000220021203");
	Раздел22.Вставить("Доходы4", "П000220021303");
	
	Раздел22.Вставить("Расходы1", "П000220022003");
	Раздел22.Вставить("Расходы2", "П000220022103");
	Раздел22.Вставить("Расходы3", "П000220022203");
	Раздел22.Вставить("Расходы4", "П000220022303");
	
	Раздел22.Вставить("УбытокПрошлыхЛет", "П000220023003");
	
	Раздел22.Вставить("СтавкаНалога1", "П000220026003");
	Раздел22.Вставить("СтавкаНалога2", "П000220026103");
	Раздел22.Вставить("СтавкаНалога3", "П000220026203");
	Раздел22.Вставить("СтавкаНалога4", "П000220026303");
	
	Возврат КлючиПоказателей;
	
КонецФункции

// Возвращает значение признака налогоплательщика для подстановки в декларацию УСН при объекте "Доходы".
//
// Возвращаемое значение:
//   Строка - значение признака налогоплательщика в соответствии с форматом декларации.
//
Функция ПризнакНалогоплательщикаВДекларацииУСНДоходы()
	
	Возврат "1";
	
КонецФункции

// Определяет предельную долю уменьшения налога УСН-доходы на суммы страховых взносов, больничных
// и добровольного страхования в зависимости от характера налогоплательщика.
//
// Возвращаемое значение:
//   Число - предельная доля уменьшения налога (от 0 до 1).
//
Функция КоэффициентУменьшенияНалогаУСНДоходы()
	
	Возврат 0.5;
	
КонецФункции

Функция ПараметрыЗаполненияДекларации2021Кв1(ПараметрыОтчета)
	
	// Транслируем параметры отчета из БРО в параметры для методов автозаполнения.
	
	Организация   = ПараметрыОтчета.Организация;
	НачалоПериода = НачалоГода(ПараметрыОтчета.мДатаКонцаПериодаОтчета); // Расширенный налоговый период не поддерживается - отменен с 2019 года.
	КонецПериода  = КонецГода(ПараметрыОтчета.мДатаКонцаПериодаОтчета);
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("Организация",   Организация);
	ПараметрыЗаполнения.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗаполнения.Вставить("КонецПериода",  КонецПериода);
	
	ПараметрыЗаполнения.Вставить("НалоговыйПериодРасширен", НачалоГода(НачалоПериода) < НачалоГода(КонецПериода));
	
	ПараметрыЗаполнения.Вставить("ПрименяетсяУСН",
		РегламентированнаяОтчетностьБГУ.ПрименяетсяУСНЗаПериод(Организация, НачалоПериода, КонецПериода));
	ПараметрыЗаполнения.Вставить("ПрименяетсяУСНДоходы",
		РегламентированнаяОтчетностьБГУ.ПрименяетсяУСНДоходыЗаПериод(Организация, НачалоПериода, КонецПериода));
	
	ПараметрыЗаполнения.Вставить("ПрименяетсяВычетНаТорговыйСбор", Ложь); // Не используется в БГУ.
	ПараметрыЗаполнения.Вставить("ПредпринимательБезСотрудников", Ложь); // Не используется в БГУ.
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Процедура ЗаполнитьДекларацию2021ОбъектДоходы(ПараметрыЗаполнения, ДанныеКУДиР, СтавкиНалога, ЗаполняемыйРаздел, КлючиРаздела)
	
	ЗаполняемыйРаздел[КлючиРаздела.ПризнакНалогоплательщика]
		= ПризнакНалогоплательщикаВДекларацииУСНДоходы();
	
	КоэффициентПредельногоУменьшенияНалога = КоэффициентУменьшенияНалогаУСНДоходы();
	
	ИтогоДоходы = 0;
	ИтогоРасходыУменьшающиеНалог = 0;
	НалоговаяБазаДоПовышенияСтавки = 0;
	НалогДоПовышенияСтавки = 0;
	
	Для Каждого СтрокаНалоговойБазы Из ДанныеКУДиР.Раздел1 Цикл
		
		НомерКвартала = СтрокаНалоговойБазы.НомерКвартала;
		ТекущийПериод = СтрокаНалоговойБазы.Период;
		
		ОтборКвартал = Новый Структура("НомерКвартала", НомерКвартала);
		
		СтрокиСтавки = СтавкиНалога.НайтиСтроки(ОтборКвартал);
		ТекущаяСтавкаНалога = ?(СтрокиСтавки.Количество() > 0, СтрокиСтавки[0].СтавкаНалога, 0);
		ПовышеннаяСтавка = ?(СтрокиСтавки.Количество() > 0, СтрокиСтавки[0].ПовышеннаяСтавка, Ложь);
		
		ИтогоДоходы = ИтогоДоходы + СтрокаНалоговойБазы.Доходы;
		
		УменьшающиеРасходыЗаКвартал = ДанныеКУДиР.Раздел4.НайтиСтроки(ОтборКвартал);
		Для Каждого СтрокаРасхода Из УменьшающиеРасходыЗаКвартал Цикл
			ИтогоРасходыУменьшающиеНалог = ИтогоРасходыУменьшающиеНалог + СтрокаРасхода.ПФР + СтрокаРасхода.ФОМС;
			Если Не ПараметрыЗаполнения.ПредпринимательБезСотрудников Тогда
				ИтогоРасходыУменьшающиеНалог = ИтогоРасходыУменьшающиеНалог
					+ СтрокаРасхода.ФСС + СтрокаРасхода.ФСС_НС + СтрокаРасхода.Больничные + СтрокаРасхода.ДобровольноеСтрахование;
			КонецЕсли;
		КонецЦикла;
		
		Если ПовышеннаяСтавка Тогда
			НалоговаяБаза = Макс(Окр(ИтогоДоходы, 0) - НалоговаяБазаДоПовышенияСтавки, 0);
			ТекущийНалог = Окр(НалоговаяБаза * ТекущаяСтавкаНалога / 100, 0) + НалогДоПовышенияСтавки;
		Иначе
			НалоговаяБаза = Окр(ИтогоДоходы, 0);
			ТекущийНалог = Окр(НалоговаяБаза * ТекущаяСтавкаНалога / 100, 0);
			НалоговаяБазаДоПовышенияСтавки = НалоговаяБаза;
			НалогДоПовышенияСтавки = ТекущийНалог;
		КонецЕсли;
		
		УменьшениеНалога = Мин(Окр(ТекущийНалог * КоэффициентПредельногоУменьшенияНалога, 0), ИтогоРасходыУменьшающиеНалог);
		
		// Передадим рассчитанные показатели в БРО.
		ЗаполняемыйРаздел[КлючиРаздела["СтавкаНалога" + НомерКвартала]]     = ТекущаяСтавкаНалога;
		ЗаполняемыйРаздел[КлючиРаздела["Доходы" + НомерКвартала]]           = ИтогоДоходы;
		ЗаполняемыйРаздел[КлючиРаздела["УменьшениеНалога" + НомерКвартала]] = УменьшениеНалога;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДекларацию2021ОбъектДоходыМинусРасходы(ПараметрыЗаполнения, ДанныеКУДиР, СтавкиНалога, ЗаполняемыйРаздел, КлючиРаздела)
	
	УбыткиПрошлыхЛет = ПеренесенныеУбыткиПрошлыхЛет(
		ПараметрыЗаполнения.Организация,
		ПараметрыЗаполнения.НачалоПериода,
		ПараметрыЗаполнения.КонецПериода);
	
	ИтогоДоходы  = 0;
	ИтогоРасходы = 0;
	
	Для Каждого СтрокаНалоговойБазы Из ДанныеКУДиР.Раздел1 Цикл
		
		НомерКвартала = СтрокаНалоговойБазы.НомерКвартала;
		ТекущийПериод = СтрокаНалоговойБазы.Период;
		
		ОтборКвартал = Новый Структура("НомерКвартала", НомерКвартала);
		СтрокиСтавки = СтавкиНалога.НайтиСтроки(ОтборКвартал);
		ТекущаяСтавкаНалога = ?(СтрокиСтавки.Количество() > 0, СтрокиСтавки[0].СтавкаНалога, 0);
		
		ИтогоДоходы  = ИтогоДоходы  + СтрокаНалоговойБазы.Доходы;
		ИтогоРасходы = ИтогоРасходы + СтрокаНалоговойБазы.Расходы;
		
		// В последнем квартела года учтем перенесенные убытки прошлых лет.
		Если СтрокаНалоговойБазы.НомерКвартала = 4 Тогда
			ИтогоРасходы = ИтогоРасходы + УбыткиПрошлыхЛет.УбытокОтУплатыМинимальногоНалога;
			НалоговаяБаза  = ИтогоДоходы - ИтогоРасходы;
			УменьшениеНалоговойБазы = Макс(0, Мин(НалоговаяБаза, УбыткиПрошлыхЛет.ПеренесенныеУбытки));
			ЗаполняемыйРаздел[КлючиРаздела["УбытокПрошлыхЛет"]] = УменьшениеНалоговойБазы;
		КонецЕсли;
		
		// Передадим рассчитанные показатели в БРО.
		ЗаполняемыйРаздел[КлючиРаздела["СтавкаНалога" + НомерКвартала]] = ТекущаяСтавкаНалога;
		ЗаполняемыйРаздел[КлючиРаздела["Доходы" + НомерКвартала]]       = ИтогоДоходы;
		ЗаполняемыйРаздел[КлючиРаздела["Расходы" + НомерКвартала]]      = ИтогоРасходы;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеКУДиРЗаПериодПоКварталам(Организация, НачалоПериода, КонецПериода, Раздел1 = Истина, Раздел4 = Ложь)
	
	ДанныеКУДиР = Новый Структура("Раздел1, Раздел4");
	
	ТекстыЗапросов     = Новый Массив;
	ИндексыРезультатов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",      Организация);
	Запрос.УстановитьПараметр("НачалоПериода",    НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",     КонецПериода);
	Запрос.УстановитьПараметр("ТаблицаКварталов", НоваяТаблицаКварталов(НачалоПериода, КонецПериода));
	
	// Временная таблица периодов для представления результата за каждый квартал, в том числе и с отсутствующими оборотами.
	
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ТаблицаКварталов.Период КАК Период,
	|	ТаблицаКварталов.НомерКвартала КАК НомерКвартала
	|ПОМЕСТИТЬ Кварталы
	|ИЗ
	|	&ТаблицаКварталов КАК ТаблицаКварталов"
	);
	
	// Подготовка данных разделов КУДиР.
	
	Если Раздел1 = Истина Тогда
		
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КнигаРаздел1.Период, КВАРТАЛ) КАК Период,
		|	СУММА(КнигаРаздел1.ДоходыУСНОборот) КАК Доходы,
		|	СУММА(КнигаРаздел1.РасходыУСНОборот) КАК Расходы
		|ПОМЕСТИТЬ ДанныеРаздел1
		|ИЗ
		|	РегистрНакопления.КнигаУчетаДоходовИРасходов.Обороты(&НачалоПериода, &КонецПериода, Квартал, Организация = &Организация) КАК КнигаРаздел1
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(КнигаРаздел1.Период, КВАРТАЛ)"
		);
		
		ИндексыРезультатов.Вставить("Раздел1", ТекстыЗапросов.Количество());
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	Кварталы.Период КАК Период,
		|	Кварталы.НомерКвартала КАК НомерКвартала,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел1.Доходы, 0)) КАК Доходы,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел1.Расходы, 0)) КАК Расходы
		|ИЗ
		|	Кварталы КАК Кварталы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРаздел1 КАК ДанныеРаздел1
		|		ПО Кварталы.Период = ДанныеРаздел1.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Кварталы.Период,
		|	Кварталы.НомерКвартала
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период"
		);
		
	КонецЕсли;
	
	Если Раздел4 = Истина Тогда
		
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(КнигаРаздел4.Ссылка.Дата, КВАРТАЛ) КАК Период,
		|	СУММА(КнигаРаздел4.ПФР) КАК ПФР,
		|	СУММА(КнигаРаздел4.ФСС) КАК ФСС,
		|	СУММА(КнигаРаздел4.ФОМС) КАК ФОМС,
		|	СУММА(КнигаРаздел4.ФСС_НС) КАК ФСС_НС,
		|	СУММА(КнигаРаздел4.Больничные) КАК Больничные,
		|	СУММА(КнигаРаздел4.ДобровольноеСтрахование) КАК ДобровольноеСтрахование
		|ПОМЕСТИТЬ ДанныеРаздел4
		|ИЗ
		|	Документ.ЗаписьКУДиР.УменьшениеНалога КАК КнигаРаздел4
		|ГДЕ
		|	КнигаРаздел4.Ссылка.Проведен
		|	И НЕ КнигаРаздел4.Ссылка.ПометкаУдаления
		|	И КнигаРаздел4.Ссылка.Организация = &Организация
		|	И КнигаРаздел4.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(КнигаРаздел4.Ссылка.Дата, КВАРТАЛ)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период"
		);
		
		ИндексыРезультатов.Вставить("Раздел4", ТекстыЗапросов.Количество());
		ТекстыЗапросов.Добавить(
		"ВЫБРАТЬ
		|	Кварталы.Период КАК Период,
		|	Кварталы.НомерКвартала КАК НомерКвартала,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел4.ПФР, 0)) КАК ПФР,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел4.ФСС, 0)) КАК ФСС,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел4.ФОМС, 0)) КАК ФОМС,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел4.ФСС_НС, 0)) КАК ФСС_НС,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел4.Больничные, 0)) КАК Больничные,
		|	СУММА(ЕСТЬNULL(ДанныеРаздел4.ДобровольноеСтрахование, 0)) КАК ДобровольноеСтрахование
		|ИЗ
		|	Кварталы КАК Кварталы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРаздел4 КАК ДанныеРаздел4
		|		ПО Кварталы.Период = ДанныеРаздел4.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Кварталы.Период,
		|	Кварталы.НомерКвартала
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период"
		);
		
	КонецЕсли;
	
	// Итоговый запрос и сборка результатов.
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Для Каждого ИндексРезультата Из ИндексыРезультатов Цикл
		ДанныеКУДиР[ИндексРезультата.Ключ] = Результаты[ИндексРезультата.Значение].Выгрузить();
	КонецЦикла;
	
	Возврат ДанныеКУДиР;
	
КонецФункции

Функция НоваяТаблицаКварталов(НачалоПериода, КонецПериода)
	
	// Приводим период к границам квартала
	НачальнаяДата = НачалоКвартала(НачалоПериода);
	КонечнаяДата  = КонецКвартала(КонецПериода);
	
	Периоды = Новый ТаблицаЗначений;
	Периоды.Колонки.Добавить("НомерКвартала", ОбщегоНазначения.ОписаниеТипаЧисло(1, 0, ДопустимыйЗнак.Неотрицательный));
	Периоды.Колонки.Добавить("Период",        ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	ТекущийПериод = НачальнаяДата;
	
	Пока ТекущийПериод < КонечнаяДата Цикл
		
		НоваяСтрока = Периоды.Добавить();
		НоваяСтрока.Период        = ТекущийПериод;
		НоваяСтрока.НомерКвартала = Месяц(КонецКвартала(ТекущийПериод)) / 3;
		
		ТекущийПериод = ИнтерфейсыВзаимодействияБРОКлиентСервер.ДобавитьПериод(ТекущийПериод, Перечисления.Периодичность.Квартал);
		
	КонецЦикла;
	
	Возврат Периоды;
	
КонецФункции

Функция СтавкиНалогаУСНЗаПериод(Организация, ОтчетныйПериод, ДанныеКУДиРРаздел1 = Неопределено)
	
	НачалоПериода = НачалоГода(ОтчетныйПериод);
	КонецПериода  = КонецКвартала(ОтчетныйПериод);
	
	ПрименениеПовышеннойСтавки
		= ПериодНачалаПримененияПовышеннойСтавкиНалога(Организация, НачалоПериода, КонецПериода, ДанныеКУДиРРаздел1);
	
	ПериодПовышеннойСтавки      = ПрименениеПовышеннойСтавки.Период;
	ПрименяетсяПовышеннаяСтавка = ЗначениеЗаполнено(ПериодПовышеннойСтавки);
	
	ТаблицаСтавок = НоваяТаблицаКварталов(НачалоПериода, КонецПериода);
	ТаблицаСтавок.Колонки.Добавить("СтавкаНалога", ОбщегоНазначения.ОписаниеТипаЧисло(5, 2, ДопустимыйЗнак.Неотрицательный));
	ТаблицаСтавок.Колонки.Добавить("ПовышеннаяСтавка", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтавкаЗаПериод Из ТаблицаСтавок Цикл
		
		СтавкиНалога = СтавкиНалогаУСН(Организация, КонецКвартала(СтавкаЗаПериод.Период));
		
		Если ПрименяетсяПовышеннаяСтавка И СтавкаЗаПериод.Период >= ПериодПовышеннойСтавки Тогда
			СтавкаЗаПериод.СтавкаНалога = СтавкиНалога.ПовышеннаяСтавка;
			СтавкаЗаПериод.ПовышеннаяСтавка = Истина;
		Иначе
			СтавкаЗаПериод.СтавкаНалога = СтавкиНалога.ОсновнаяСтавка;
			СтавкаЗаПериод.ПовышеннаяСтавка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаСтавок;
	
КонецФункции

Функция ПериодНачалаПримененияПовышеннойСтавкиНалога(Организация, НачалоНалоговогоПериода, КонецОтчетногоПериода, ДанныеКУДиРРаздел1 = Неопределено)
	
	Результат = Новый Структура("Период, Ошибки", Дата(1, 1, 1), Новый Массив);
	
	Если КонецОтчетногоПериода < УчетУСНКлиентСервер.ДатаНачалаПрогрессивнойШкалы()
		Или КонецОтчетногоПериода >= УчетУСНКлиентСервер.ДатаОтменыПрогрессивнойШкалы() Тогда
		Возврат Результат;
	КонецЕсли;
	
	РазрядностьОкругленияПоказателей = УчетУСНКлиентСервер.РазрядностьОкругленияПоказателей(КонецОтчетногоПериода);
	
	// Проверяем превышение лимита доходов.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоНалоговогоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецОтчетногоПериода);
	
	Если ДанныеКУДиРРаздел1 = Неопределено Тогда
		ДанныеКУДиР = ДанныеКУДиРЗаПериодПоКварталам(Организация, НачалоНалоговогоПериода, КонецОтчетногоПериода);
		ДоходыПоКварталам = ДанныеКУДиР.Раздел1;
	Иначе
		ДоходыПоКварталам = ДанныеКУДиРРаздел1.Скопировать(, "Период, Доходы");
	КонецЕсли;
	
	ДоходыПоКварталам.Свернуть("Период", "Доходы");
	ДоходыПоКварталам.Сортировать("Период");
	
	ГраницаДоходов = УчетУСНКлиентСервер.ГраницаДоходовДляПримененияОсновнойСтавкиУСН(
		КонецОтчетногоПериода);
	
	ДоходыНакопительнымИтогом = 0;
	
	Для Каждого СтрокаДоходов Из ДоходыПоКварталам Цикл
		ДоходыНакопительнымИтогом = ДоходыНакопительнымИтогом + СтрокаДоходов.Доходы;
		
		Если Окр(ДоходыНакопительнымИтогом, РазрядностьОкругленияПоказателей) > ГраницаДоходов Тогда
			
			Если Не ЗначениеЗаполнено(Результат.Период)
				Или СтрокаДоходов.Период < Результат.Период Тогда
				Результат.Период = СтрокаДоходов.Период;
			КонецЕсли;
			
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	// Проверяем превышение лимита средней численности работников.
	ЭтоЮрЛицо = Истина; // В БГУ учет индивидуальных предпринимателей не ведется.
	Если ЭтоЮрЛицо Тогда
		
		ГраницаЧисленностиРаботников =
			УчетУСНКлиентСервер.ГраницаЧисленностиРаботниковДляПримененияОсновнойСтавкиУСН();
		
		ТекущийПериод = КонецКвартала(НачалоНалоговогоПериода);
		Пока ТекущийПериод <= КонецКвартала(КонецОтчетногоПериода) Цикл
			
			// Лимит по доходам достигнут раньше, чем лимит по сотрудникам. Дальнейшая проверка не имеет смысла
			Если ЗначениеЗаполнено(Результат.Период) И Результат.Период < ТекущийПериод Тогда
				Прервать;
			КонецЕсли;
			
			ЧисленностьРаботников = СредняяЧисленностьРаботников(Организация, НачалоНалоговогоПериода, ТекущийПериод);
			
			Если ЧисленностьРаботников = Неопределено Тогда
				
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Не указана средняя численность наемных работников за отчетный период %1. Эти сведения нужны для определения периодов применения повышенной ставки налога.
						|Чтобы корректно рассчитать налог, укажите сведения в учетной политике организации ""%2"" (регистр сведений ""%3"").'"),
							СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(НачалоКвартала(ТекущийПериод), КонецКвартала(ТекущийПериод), Истина),
							Организация,
							Метаданные.РегистрыСведений.СредняяЧисленностьРаботниковОрганизаций.Синоним) );
				
				ОписаниеОшибки = Новый Структура;
				ОписаниеОшибки.Вставить("Тип", "ЧисленностьРаботников");
				ОписаниеОшибки.Вставить("ТекстСообщения", НСтр(
					"ru = 'Не указана средняя численность наемных работников за отчетный период.'"));
				Результат.Ошибки.Добавить(ОписаниеОшибки);
				
				Возврат Результат;
				
			КонецЕсли;
			
			Если ЧисленностьРаботников > ГраницаЧисленностиРаботников Тогда
				Результат.Период = НачалоКвартала(ТекущийПериод);
				Прервать;
			КонецЕсли;
			
			ТекущийПериод = КонецКвартала(ДобавитьМесяц(ТекущийПериод, 3));
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает сведения о средней численности наемных работников за отчетный период.
//
// Параметры:
//   Организация - СправочникСсылка.Организации - ссылка на организацию
//   НачалоОтчетногоПериода - Дата
//   КонецОтчетногоПериода - Дата
//   УчитыватьРучныеКорректировки - Булево - учитывать сведения о численности, указанные пользователем
//
// Возвращаемое значение:
//   - Число - средняя численность наемных работников за отчетный период
//   - Неопределено - нет сведений о средней численности работников
//
Функция СредняяЧисленностьРаботников(Организация, НачалоОтчетногоПериода, КонецОтчетногоПериода, УчитыватьРучныеКорректировки = Истина) Экспорт
	
	Перем ЧисленностьРаботников;

	ГраницаРаботников =
		УчетУСНКлиентСервер.ГраницаЧисленностиРаботниковДляПримененияОсновнойСтавкиУСН();
	
	Если УчитыватьРучныеКорректировки Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Организация", Организация);
		// Данные о численности хранятся с периодичностью Квартал, поэтому период запроса необходимо привести к границам квартала.
		Запрос.УстановитьПараметр("НачалоОтчетногоПериода", НачалоКвартала(НачалоОтчетногоПериода));
		Запрос.УстановитьПараметр("КонецПериода", КонецКвартала(КонецОтчетногоПериода));
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СредняяЧисленностьРаботниковОрганизацийСрезПоследних.Организация,
		|	СредняяЧисленностьРаботниковОрганизацийСрезПоследних.Период КАК Период,
		|	СредняяЧисленностьРаботниковОрганизацийСрезПоследних.ЧисленностьРаботников
		|ИЗ
		|	РегистрСведений.СредняяЧисленностьРаботниковОрганизаций.СрезПоследних(&КонецПериода,
		|		Организация = &Организация) КАК СредняяЧисленностьРаботниковОрганизацийСрезПоследних
		|ГДЕ
		|	СредняяЧисленностьРаботниковОрганизацийСрезПоследних.Период >= &НачалоОтчетногоПериода
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если КонецКвартала(Выборка.Период) = КонецКвартала(КонецОтчетногоПериода)
				Или Выборка.ЧисленностьРаботников > ГраницаРаботников Тогда
				ЧисленностьРаботников = Выборка.ЧисленностьРаботников;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЧисленностьРаботников;
	
КонецФункции

	#КонецОбласти

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. 
Функция ПодготовитьТаблицуОплатПоРасходамПодотчетногоЛица(ТаблицаПоступлениеРасходовУСН) Экспорт
	
	ТаблицаОплат = УчетРасчетов.ПустаяТаблицаРасчетовСЗачетомАвансов();
	
	// Все расходы УСН, которые поступили по авансовому отчету считаем оплаченными поставщикам.
	Для Каждого Строка Из ТаблицаПоступлениеРасходовУСН Цикл
		
		НоваяСтрока = ТаблицаОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,
			"ИФО,КФО,КПС,Подразделение,СчетРасчетов,Контрагент,Договор,Валюта");
		
		НоваяСтрока.ЭтоЗачетАванса = Истина;
		
		НоваяСтрока.СуммаРасчетов =
			Строка.СуммаВал + Строка.СуммаНДСВал;
		НоваяСтрока.СуммаРуб =
			Строка.СуммаРуб + Строка.СуммаНеУчитываетсяНУРуб + Строка.СуммаЕНВДРуб + Строка.СуммаНДСРуб;
		
		НоваяСтрока.СуммаРубПоКурсуАванса = НоваяСтрока.СуммаРуб;
		
	КонецЦикла;
	
	// Сворачиваем по всем колонкам, суммируя суммовые показатели.
	ОбщегоНазначенияБГУ.СвернутьТаблицуИСуммироватьКолонки(ТаблицаОплат,
		"ОстатокРасчетов,СуммаРасчетов,СуммаРуб,СуммаРубПоКурсуАванса,СуммаЕНВДРуб");
	
	Возврат ТаблицаОплат;
	
КонецФункции

#КонецОбласти
