
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Организация") Тогда
		Организация = Параметры.Отбор.Организация;
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОрганизацияСписок",
			"Видимость", НЕ ЗначениеЗаполнено(Организация));
	КонецЕсли;  
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация",Организация, ВидСравненияКомпоновкиДанных.Равно, ,ЗначениеЗаполнено(Организация));
	Элементы.ОрганизацияСписок.Видимость = НЕ ЗначениеЗаполнено(Организация);
КонецПроцедуры

#КонецОбласти
