
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПараметрыОтбора", ПараметрыОтбора);
	Параметры.Свойство("Отбор", АдресОтбора);
	
	ТаблицаОтбора = ПолучитьИзВременногоХранилища(АдресОтбора);
	Отбор.Загрузить(ТаблицаОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИЗакрытьЗавершение", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьОтбор(Команда)
	
	ЗаписатьИЗакрытьЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвто(Команда)
	
	Если Отбор.Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьЗавершение", ЭтотОбъект),
			НСтр("ru='Таблица будет очищена, продолжить?'"),
			РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, НСтр("ru='Начисление амортизации'"));
		
	Иначе
		
		ЗаполнитьТабличнуюЧасть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Отбор.Очистить();
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаписатьИЗакрытьЗавершение(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ТаблицаЗаполнена() Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Модифицированность = Ложь;
		ПомеситьОтборВХранилище();
		ОповеститьОВыборе(АдресОтбора);
		
	Иначе
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТаблицаЗаполнена()
	
	Отказ = Ложь;
	
	Сч = 0;
	Для Каждого Строка Из Отбор Цикл
		Если Не ЗначениеЗаполнено(Строка.СчетУчета) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение", "СчетУчета", Сч+1, "Отбор");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Отбор["+Сч+"].СчетУчета",,Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Строка.КФО) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение", "КФО", Сч+1, "Отбор");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Отбор["+Сч+"].КФО",,Отказ);
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции

&НаСервере
Процедура ПомеситьОтборВХранилище()
	
	ПоместитьВоВременноеХранилище(Отбор.Выгрузить(), АдресОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТабличнуюЧасть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
	
	СпособыНачисленияАмортизации = Новый Массив;
	СпособыНачисленияАмортизации.Добавить(Перечисления.СпособНачисленияАмортизации.Линейный);
	СпособыНачисленияАмортизации.Добавить(Перечисления.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции);
	СпособыНачисленияАмортизации.Добавить(Перечисления.СпособНачисленияАмортизации.УменьшаемогоОстатка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КонецМесяца"		, Новый Граница(КонецМесяца(ПараметрыОтбора.Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация"		, ПараметрыОтбора.Организация);
	Запрос.УстановитьПараметр("ИФО"				, ПараметрыОтбора.ИФО);
	Запрос.УстановитьПараметр("Подразделение"	, ПараметрыОтбора.Подразделение);
	Запрос.УстановитьПараметр("Счет"			, БухгалтерскийУчет.СписокСчетов("101.00,102.00,111.60"));
	Запрос.УстановитьПараметр("СпособыАморт"	, СпособыНачисленияАмортизации);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ СписокОС
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&КонецМесяца, Организация = &Организация) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(&КонецМесяца, Организация = &Организация) КАК НачислениеАмортизацииОСБухгалтерскийУчетСрезПоследних
	|		ПО (НачислениеАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство)
	|ГДЕ
	|	ЕСТЬNULL(НачислениеАмортизацииОСБухгалтерскийУчетСрезПоследних.НачислятьАмортизацию, ИСТИНА)
	|	И ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|	И ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации В(&СпособыАморт)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НачислениеАмортизацииОСНалоговыйУчетСрезПоследних.ОсновноеСредство
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.СрезПоследних(&КонецМесяца, Организация = &Организация) КАК НачислениеАмортизацииОСНалоговыйУчетСрезПоследних
	|ГДЕ
	|	НачислениеАмортизацииОСНалоговыйУчетСрезПоследних.НачислятьАмортизацию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК СчетУчета,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт КАК СуммаОстатокДт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонецМесяца,
	|			Счет В (&Счет),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И &УсловиеПодразделение
	|				И Субконто1 В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СписокОС.ОсновноеСредство
	|					ИЗ
	|						СписокОС)) КАК ЖурналПроводокЕПСБУОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЖурналПроводокЕПСБУОстатки.Счет.Код,
	|	ЖурналПроводокЕПСБУОстатки.КФО.Порядок";
	
	// Отборы по ИФО и Подразделению
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО")
		И ЗначениеЗаполнено(ПараметрыОтбора.ИФО);
	ИспользоватьУчетПоПодразделениям = УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям()
		И ЗначениеЗаполнено(ПараметрыОтбора.Подразделение);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО",
		?(ИспользоватьУчетПоИФО, "ИФО = &ИФО", "ИСТИНА"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПодразделение",
		?(ИспользоватьУчетПоПодразделениям, "Подразделение = &Подразделение", "ИСТИНА"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	Отбор.Загрузить(Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
