
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАБаланс);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНФАЗабаланс);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправления);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзУправленияОперУчет);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет);
	СписокВидовОпераций.Добавить(Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет);
	
	Если Параметры.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
		
		ПереданныеЗначенияЗаполнения = Новый ФиксированнаяСтруктура(Параметры.ЗначенияЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВидовОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КлючеваяОперация = "СозданиеФормыПринятиеКУчетуОбъектовОС";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	ПараметрыДокумента = Новый Структура;
	Если ЗначениеЗаполнено(ПереданныеЗначенияЗаполнения) Тогда
		ПараметрыДокумента.Вставить("ЗначенияЗаполнения", Новый Структура(ПереданныеЗначенияЗаполнения));
	Иначе
		ПараметрыДокумента.Вставить("ЗначенияЗаполнения", Новый Структура);
	КонецЕсли;
	ПараметрыДокумента.ЗначенияЗаполнения.Вставить("ВидПоступления", СписокВидовОпераций[ВыбраннаяСтрока].Значение);
	ОткрытьФорму("Документ.ПринятиеКУчетуОбъектовОС.ФормаОбъекта", ПараметрыДокумента);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
