//////////////////////////////////////////////////////////////////////////////////
//БУХГАЛТЕРСКИЕ ОПЕРАЦИИ, СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ                         //
//////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПрограммноеСозданиеДокументов

// Процедура добавляет переданные в структуре ДанныеПроведения данные в ДополнительныеСвойства объекта,
// для обработки в процедуре записи или проведения.
// Параметры:
// Объект - ДокументОбъект - записываемый документ.
// ТиповаяОперация - СправочникСсылка.ТиповыеОперации.
// ДополнительныеРеквизиты - Структура - содержит дополнительные реквизиты типовой операции. 
//							Ключ - ИмяДляФормулы соотвествующего реквизита, Значение - Значение реквизита.
// ФормироватьПроводки - Булево - формировать проводки при проведении документа. Имеет смысл только при формировании 
// 								  проводок обособленно от проведения документа.
// Бухгалтер - СправочникСсылка.Сотрудники - сотрудник для изменения ОтветственныйИсполнитель, который будет записан, если документ будет проведен.
//
Процедура ДобавитьДанныеДляПроведения(Объект, ТиповаяОперация,
		ДополнительныеРеквизиты, ФормироватьПроводки = Ложь, Бухгалтер = Неопределено) Экспорт

	Если Не ДокументПроводитсяПоРегиструБухгалтерии(Объект) Тогда
		Возврат;
	КонецЕсли;

	ИнициализироватьБухгалтерскиеОперации(Объект);
	ДанныеАвтоПроведения = Объект.ДополнительныеСвойства.ДанныеАвтоПроведения;
	ДанныеАвтоПроведения.ТиповаяОперация = ТиповаяОперация;
	ДанныеАвтоПроведения.ДополнительныеРеквизиты = ДополнительныеРеквизиты;
	ДанныеАвтоПроведения.ФормироватьПроводки = ФормироватьПроводки;
	ДанныеАвтоПроведения.ПрограммноеСоздание = Истина;
	ДанныеАвтоПроведения.ОтветственныйИсполнитель = Бухгалтер;

КонецПроцедуры

// Записывает переданные типовую операцию и реквизиты типовой операции в соответствующие регистры.
// Может использоваться в планах обмена, чтобы переносить документы с уже заполненной операцией.
// При заполнении дополнительных реквизитов операции будут получены значения по умолчанию в соответствии с настройками
// текущего пользователя.
// Если нужно установить вместо них другие значения или не заполнять их, то нужно явно задать ключи
// структуры "ДополнительныеРеквизиты" с соответствующими именами.
// Процедура не пытается прочитать проводки, а устанавливает признак ЕстьПроводки из параметра.
//
// Функция применяется для записанного объекта. Для нового объекта всегда возвращает "ложь" и ничего не делает.
//
// Параметры:
//  Объект  - ДокументОбъект - документ, которому будет записана типовая операция и доп. реквизиты.
//  ТиповаяОперация  - СправочникСсылка.ТиповыеОперации - типовая операция.
//  ЗначенияДополнительныхРеквизитов  - Структура - дополнительные реквизиты.
//                              Ключ - "Имя для формулы" дополнительного реквизита, "Значение" - значение реквизита.
//  Курс - Число - курс валюты.
//  Кратность - Число - кратность валюты,
//  ЕстьПроводки - Булево - признак наличия проводок.
//  РегистрироватьНаУзлахПлановОбмена - Булево
//
// Возвращаемое значение:
//  Булево - результат выполнения функции. Истина - успех, данные записаны, Ложь - неудача, данные не записаны.
//
Функция ЗаписатьДанныеТиповойОперацииОбъекта(Объект, ТиповаяОперация,
		Знач ЗначенияДополнительныхРеквизитов = Неопределено, Курс = 1,
		Кратность = 1, ЕстьПроводки = Ложь,
		Знач РегистрироватьНаУзлахПлановОбмена = Истина) Экспорт

	Если Объект.Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(ЗначенияДополнительныхРеквизитов) <> Тип("Структура") Тогда
		ЗначенияДополнительныхРеквизитов = Новый Структура;
	КонецЕсли;

	СсылкаОбъекта = Объект.Ссылка;

	// Прочитать реквизиты операции
	РеквизитыОперации = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация);

	// Значения по умолчанию для выбранной организации установленные для всех пользователей
	РеквизитыПоУмолчанию = РеквизитыТиповойОперацииПоУмолчанию(Неопределено, ТиповаяОперация, Объект.Организация);

	// Вычислить реквизиты операции "Организация" и "Дата"
	ИсточникДанныхШапка = СоздатьИсточникДанныхИзШапкиОбъекта(Объект, ТиповаяОперация);
	ДанныеОперации = Новый Структура("Дата, Организация");

	УстановитьПривилегированныйРежим(Истина);
	РассчитатьРеквизитыОперации(ТиповаяОперация, ИсточникДанныхШапка, ДанныеОперации);
	УстановитьПривилегированныйРежим(Ложь);

	Результат = Истина;
	НачатьТранзакцию();

	Попытка

		// Запись типовой операции
		ДанныеДляЗаписи = РегистрыСведений.ОперацииДокументов.ДанныеДляЗаписи(СсылкаОбъекта);

		ДанныеДляЗаписи.Операция     = ТиповаяОперация;
		ДанныеДляЗаписи.Курс         = Курс;
		ДанныеДляЗаписи.Кратность    = Кратность;
		ДанныеДляЗаписи.ЕстьПроводки = ЕстьПроводки;
		ДанныеДляЗаписи.Организация  = ДанныеОперации.Организация;
		ДанныеДляЗаписи.Дата         = ДанныеОперации.Дата;

		РегистрыСведений.ОперацииДокументов.ЗаписатьОперацию(СсылкаОбъекта, ДанныеДляЗаписи, Истина, РегистрироватьНаУзлахПлановОбмена);

		// Запись дополнительных реквизитов
		НаборЗаписейРеквизиты = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
		НаборЗаписейРеквизиты.Отбор.Объект.Установить(СсылкаОбъекта);

		ЗначениеДопРеквизита = Неопределено;
		Для каждого ДополнительныйРеквизит Из РеквизитыОперации Цикл

		// В регистр пишем только доп. реквизиты, для которых задано значение
			Если НЕ ЗначенияДополнительныхРеквизитов.Свойство(ДополнительныйРеквизит.ИмяДляФормулы, ЗначениеДопРеквизита)
					И НЕ РеквизитыПоУмолчанию.Свойство(ДополнительныйРеквизит.ИмяДляФормулы, ЗначениеДопРеквизита) Тогда

				Продолжить;
			КонецЕсли;

			Запись = НаборЗаписейРеквизиты.Добавить();
			Запись.Объект = СсылкаОбъекта;
			Запись.РеквизитОперации = ДополнительныйРеквизит.Ссылка;
			Запись.Значение = ЗначениеДопРеквизита;

		КонецЦикла;
		
		Если Не РегистрироватьНаУзлахПлановОбмена Тогда
			НаборЗаписейРеквизиты.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
			НаборЗаписейРеквизиты.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		КонецЕсли;

		НаборЗаписейРеквизиты.Записать(Истина);

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
	
		ИнформацияОбОшибке = ИнформацияОбОшибке();

		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииУстановкаТиповойОперации(),
			УровеньЖурналаРегистрации.Ошибка,
			Объект.Метаданные(),
			СсылкаОбъекта,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		Результат = Ложь;

	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ИспользованиеСобственныхМодулейВРасширениях

// Добавляет заготовку для описания расширения в массив ИменаМодулей. Возвращает структуру - добавленное описание.
// Возвращаемая структура содержит ключи:
// 		*Заголовок - Строка - описание, которое добавляется к представлениям функций из расширения.
// 		*МодулиФункций - Массив - имена модулей функций, используемых в проводках и условиях операций.
// 		*МодулиИсточниковДанных - Массив - имена модулей функций дополнительных источников.
// 		*МодулиОбработчиков - Массив - имена модулей обработчиков "после формирования проводок".
// 		*МодулиПроведения - Массив - имена модулей процедур проведения без настройки проводок.
// 
// Параметры:
// 	ИменаМодулей - Массив - массив, в который добавляется пустая заготовка описания.
// Возвращаемое значение:
// 	Структура - добавленная заготовка описания.
Функция ОписаниеРасширения(ИменаМодулей) Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Заголовок", "");
	Описание.Вставить("МодулиФункций", Новый Массив);
	Описание.Вставить("МодулиИсточниковДанных", Новый Массив);
	Описание.Вставить("МодулиОбработчиков", Новый Массив);
	Описание.Вставить("МодулиПроведения", Новый Массив);

	ИменаМодулей.Добавить(Описание);

	Возврат Описание;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

Функция ЗаполнитьПараметрыДобавленияЭлементовФормы(Форма, Объект, ПолеДляРеквизитовОперации,
	ПараметрПолеДляДополнительныхТабЧастей, ТиповаяОперация, ДобавлятьДопРеквизитыОперации, ДобавлятьДопТабЧасти = Истина)

	Если ТипЗнч(ПараметрПолеДляДополнительныхТабЧастей) = Тип("ГруппаФормы") Тогда
		ПолеДляДополнительныхТабЧастей = ПараметрПолеДляДополнительныхТабЧастей;
	Иначе
		ПолеДляДополнительныхТабЧастей = Форма;
	КонецЕсли;
	
	РеквизитыФормы = ПолучитьИменаРеквизитовФормы(Форма);
	ПовторноеЧтениеОбъекта = РеквизитыФормы.Найти("БухгалтерскиеОперации_ДобавленныеРеквизитыОперации") <> Неопределено;
	
	ТипЗначенияСсылки = ТипЗнч(Объект.Ссылка);
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗначенияСсылки);

	ВалютныйУчет = ВДокументеИспользуетсяВалютныйУчет(ИдентификаторДокумента);
	
	ПараметрыДобавленияЭлементовФормы = ПараметрыДобавленияЭлементовФормы();
	ПараметрыДобавленияЭлементовФормы.Форма = Форма;
	ПараметрыДобавленияЭлементовФормы.Объект = Объект;
	ПараметрыДобавленияЭлементовФормы.ТипЗначенияСсылки = ТипЗначенияСсылки;
	ПараметрыДобавленияЭлементовФормы.ПолеДляРеквизитовОперации = ПолеДляРеквизитовОперации;
	ПараметрыДобавленияЭлементовФормы.ПолеДляДополнительныхТабЧастей = ПолеДляДополнительныхТабЧастей;
	ПараметрыДобавленияЭлементовФормы.ДобавлятьДопТабЧасти = ДобавлятьДопТабЧасти;
	ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации = ДобавлятьДопРеквизитыОперации;
	ПараметрыДобавленияЭлементовФормы.ПовторноеЧтениеОбъекта = ПовторноеЧтениеОбъекта;
	ПараметрыДобавленияЭлементовФормы.РеквизитыФормы = РеквизитыФормы;
	ПараметрыДобавленияЭлементовФормы.ВалютныйУчет = ВалютныйУчет;
	ПараметрыДобавленияЭлементовФормы.ТиповаяОперация = ТиповаяОперация;
	
	Возврат ПараметрыДобавленияЭлементовФормы;
	
КонецФункции

Процедура ПриЧтенииНаСервере(Знач Форма, Знач Объект,
		Знач ПолеДляРеквизитовОперации,
		Знач ПараметрПолеДляДополнительныхТабЧастей = Неопределено) Экспорт

	// Даты запрета изменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(Форма, Объект);
	// Конец Даты запрета изменения
	ТипЗначенияСсылки = ТипЗнч(Объект.Ссылка);
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗначенияСсылки);

	ДобавлятьДопРеквизитыОперации = ДобавлятьДопРеквизитыОперации(ИдентификаторДокумента);

	Если ДобавлятьДопРеквизитыОперации Тогда
		ТиповаяОперация = БухгалтерскаяОперацияДокумента(Объект.Ссылка);
	Иначе
		ТиповаяОперация = Неопределено;
	КонецЕсли;

	ПараметрыДобавленияЭлементовФормы = ЗаполнитьПараметрыДобавленияЭлементовФормы(Форма, Объект, ПолеДляРеквизитовОперации,
		ПараметрПолеДляДополнительныхТабЧастей, ТиповаяОперация, ДобавлятьДопРеквизитыОперации);
	БухгалтерскиеОперацииРаботаСФормами.ДобавитьРеквизитыЭлементыНаФорму(ПараметрыДобавленияЭлементовФормы);

	ЗначенияДопКолонок = ПолучитьЗначенияСохраненныхДопКолонок(Форма.Объект);
	ЗаполнитьЗначенияДобавленныхРеквизитов(Форма, Форма.Объект, ЗначенияДопКолонок);
	УстановитьТолькоПросмотрСКонфликтомИмен(Форма);

	Если ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации Тогда
		ЗначенияДопРеквизитов = ЗаполнитьДополнительныеРеквизиты(Объект.Ссылка, ТиповаяОперация);
		УстановитьЗначенияИСвойстваЭлементовФормы(Форма, ПолеДляРеквизитовОперации, ТиповаяОперация, ЗначенияДопРеквизитов);
	КонецЕсли;

КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Знач ПолеДляРеквизитовОперации,
		Знач ПолеДляДополнительныхТабЧастей = Неопределено) Экспорт

	Форма = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(ПолеДляРеквизитовОперации, Тип("ФормаКлиентскогоПриложения"));
	Объект = Форма.Объект;

	ЭтоНовый = Объект.Ссылка.Пустая();
	Если НЕ ЭтоНовый Тогда
		Возврат;
	КонецЕсли;

	ТипЗначенияСсылки = ТипЗнч(Объект.Ссылка);
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗначенияСсылки);
	ВалютныйУчет = ВДокументеИспользуетсяВалютныйУчет(ИдентификаторДокумента);

	ДобавлятьДопРеквизитыОперации = ДобавлятьДопРеквизитыОперации(ИдентификаторДокумента);

	Если ДобавлятьДопРеквизитыОперации Тогда
		ТиповаяОперацияИДопРеквизиты = ТиповаяОперацияДляНовогоДокумента(Форма, Объект, ИдентификаторДокумента, ВалютныйУчет);
		ТиповаяОперация = ТиповаяОперацияИДопРеквизиты.ТиповаяОперация;
		ЗначенияДопРеквизитов = ТиповаяОперацияИДопРеквизиты.ДополнительныеРеквизиты;
	Иначе
		ТиповаяОперация = Справочники.ТиповыеОперации.ПустаяСсылка();
		ЗначенияДопРеквизитов = Новый Структура;
	КонецЕсли;

	ПараметрыДобавленияЭлементовФормы = ЗаполнитьПараметрыДобавленияЭлементовФормы(Форма, Объект, ПолеДляРеквизитовОперации,
		ПолеДляДополнительныхТабЧастей, ТиповаяОперация, ДобавлятьДопРеквизитыОперации);
	БухгалтерскиеОперацииРаботаСФормами.ДобавитьРеквизитыЭлементыНаФорму(ПараметрыДобавленияЭлементовФормы);

	ЗаполнитьЗначенияДобавленныхРеквизитов(Форма, Форма.Объект, ЗначенияДополнительныхКолонокДляНовогоДокумента(Форма));
	УстановитьТолькоПросмотрСКонфликтомИмен(Форма);

	Если ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации Тогда
		Если Не ЗначениеЗаполнено(ЗначенияДопРеквизитов) Тогда
			ЗначенияДопРеквизитов = ДополнительныеРеквизитыДляНовогоДокумента(Форма, Объект, ТиповаяОперация, ВалютныйУчет);
		КонецЕсли;
		ИзменитьЗначенияДопРеквизитовПередУстановкой(ИдентификаторДокумента, Объект, ТиповаяОперация, ЗначенияДопРеквизитов);
		Если ВалютныйУчет Тогда
			ЗаполнитьКурсИКратностьОперации(ЗначенияДопРеквизитов, Форма, Объект);
		КонецЕсли;
		УстановитьЗначенияИСвойстваЭлементовФормы(Форма, ПолеДляРеквизитовОперации, ТиповаяОперация, ЗначенияДопРеквизитов);
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗначенияИСвойстваЭлементовФормы(Форма, ПолеДляРеквизитовОперации, ТиповаяОперация, ЗначенияДопРеквизитов)
	
	ЗаполнитьДополнительныеРеквизитыВФорме(Форма, ТиповаяОперация, ЗначенияДопРеквизитов);
	БухгалтерскиеОперацииКлиентСервер.ОбновитьВидимостьВсехЭлементов(Форма);
	УстановитьКартинкуЗакладки(Форма, ТиповаяОперация);
	
КонецПроцедуры

Функция ДобавлятьДопРеквизитыОперации(ИдентификаторДокумента)
	
	ДокументОперацияБух = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ОперацияБух"));
	
	Если ИдентификаторДокумента = ДокументОперацияБух
		ИЛИ ПроводкиФормируютсяВсегдаОдновременно(ИдентификаторДокумента) Тогда
	
		Возврат Истина;
	
	Иначе
	
		Возврат ПравоДоступа("Просмотр", Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ)
			И НЕ ПолучитьФункциональнуюОпцию("ФормированиеПроводокОбособленноОтДокумента");
	
	КонецЕсли;
	
КонецФункции

Функция ЗначенияДополнительныхКолонокДляНовогоДокумента(Форма)

	ЗначениеКопирования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ЗначениеКопирования");
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Возврат ПолучитьЗначенияСохраненныхДопКолонок(ЗначениеКопирования);
	Иначе
		Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ЗначенияДопКолонок");
	КонецЕсли;
	
КонецФункции

Функция ДополнительныеРеквизитыДляНовогоДокумента(Форма, Объект, ТиповаяОперация, ВалютныйУчет)

	ЗначениеКопирования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ЗначениеКопирования");
	Основание           = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "Основание");
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		КорректируемыйДокумент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Основание, "КорректируемыйДокумент");
	Иначе
		КорректируемыйДокумент = Неопределено;
	КонецЕсли;

	Если ЗначениеЗаполнено(КорректируемыйДокумент) Тогда
	    Возврат ЗаполнитьДополнительныеРеквизиты(КорректируемыйДокумент, ТиповаяОперация, ВалютныйУчет);
	ИначеЕсли ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Возврат ЗаполнитьДополнительныеРеквизиты(ЗначениеКопирования, ТиповаяОперация, ВалютныйУчет);
	Иначе
		Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ЗначенияДопРеквизитов");
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТиповуюОперациюИзПараметровФормы(Форма, Объект)
	
	ЗначениеКопирования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ЗначениеКопирования");
	Основание           = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "Основание");
	Если ТипЗнч(Основание) = Тип("Структура") Тогда
		КорректируемыйДокумент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Основание, "КорректируемыйДокумент");
	Иначе
		КорректируемыйДокумент = Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура("ТиповаяОперация, ДополнительныеРеквизиты");
	
	Если ЗначениеЗаполнено(КорректируемыйДокумент) Тогда
	    Результат.ТиповаяОперация = БухгалтерскаяОперацияДокумента(КорректируемыйДокумент);
	ИначеЕсли ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Результат.ТиповаяОперация = БухгалтерскаяОперацияДокумента(ЗначениеКопирования);
	ИначеЕсли ЗначениеЗаполнено(Основание) И ОбщегоНазначения.ЗначениеСсылочногоТипа(Основание) Тогда
		Результат = ТиповаяОперацияПоДокументуОснованию(Основание, Объект);
	Иначе
		Результат.ТиповаяОперация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Параметры, "ТиповаяОперация");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТиповаяОперацияВходитВСписокДопустимых(ТиповаяОперация, СписокДопустимыхТиповыхОпераций)
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат СписокДопустимыхТиповыхОпераций.НайтиПоЗначению(ТиповаяОперация) <> Неопределено;
	
КонецФункции

Функция ТиповаяОперацияДляНовогоДокумента(Форма, Объект, ИдентификаторДокумента, ВалютныйУчет)

	Результат = ПолучитьТиповуюОперациюИзПараметровФормы(Форма, Объект);

	СписокДопустимыхТиповыхОпераций = Справочники.ТиповыеОперации.ПолучитьСписокТиповыхОперацийПоУсловиям(
		ИдентификаторДокумента,
		ПараметрыДляВыбораТиповойОперации(Объект, ИдентификаторДокумента));

	Если НЕ ТиповаяОперацияВходитВСписокДопустимых(Результат.ТиповаяОперация, СписокДопустимыхТиповыхОпераций) Тогда
		Результат.ТиповаяОперация = Справочники.ТиповыеОперации.ПустаяСсылка();
		Результат.ДополнительныеРеквизиты = Новый Структура;
	КонецЕсли;

	Если ЗначениеЗаполнено(Результат.ТиповаяОперация)
		И ПроверятьПравоПросмотраТиповойОперацииВФорме(Форма)
		И НЕ Справочники.ТиповыеОперации.ПраваДоступаКТиповойОперации(Результат.ТиповаяОперация).Просмотр Тогда
			
		Результат.ТиповаяОперация = Справочники.ТиповыеОперации.ПустаяСсылка();
		Результат.ДополнительныеРеквизиты = Новый Структура;
	КонецЕслИ;

	Если Не ЗначениеЗаполнено(Результат.ТиповаяОперация)
		И (НЕ ПолучитьФункциональнуюОпцию("ФормированиеПроводокОбособленноОтДокумента")
			ИЛИ ПроводкиФормируютсяВсегдаОдновременно(ИдентификаторДокумента)) Тогда
		
		ТиповаяОперацияПоУмолчанию = ТиповаяОперацияПоУмолчанию(ИдентификаторДокумента);
		Если ТиповаяОперацияВходитВСписокДопустимых(ТиповаяОперацияПоУмолчанию, СписокДопустимыхТиповыхОпераций) Тогда
			Результат.ТиповаяОперация = ТиповаяОперацияПоУмолчанию;
		КонецЕсли;

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат.ТиповаяОперация) И СписокДопустимыхТиповыхОпераций.Количество() = 1 Тогда
		Результат.ТиповаяОперация = СписокДопустимыхТиповыхОпераций[0].Значение;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПроверятьПравоПросмотраТиповойОперацииВФорме(Форма)
	Возврат НЕ Форма.Параметры.Свойство("НеПроверятьПраваТиповойОперации")
			ИЛИ Форма.Параметры.НеПроверятьПраваТиповойОперации = Ложь;
КонецФункции

Процедура ЗаполнитьКурсИКратностьОперации(ЗначенияДопРеквизитов, Форма, Объект)
	Если ЗначенияДопРеквизитов = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначенияДопРеквизитов.Свойство("Курс") Тогда
		ЗначенияДопРеквизитов.Вставить("Курс");
	КонецЕсли;
	Если Не ЗначенияДопРеквизитов.Свойство("Кратность") Тогда
		ЗначенияДопРеквизитов.Вставить("Кратность");
	КонецЕсли;

	НеПересчитыватьКурс = Форма.Параметры.Свойство("НеПересчитыватьКурсПриВводе")
		И Форма.Параметры.НеПересчитыватьКурсПриВводе = Истина
		И ЗначениеЗаполнено(ЗначенияДопРеквизитов.Курс)
		И ЗначениеЗаполнено(ЗначенияДопРеквизитов.Кратность);

	Если НЕ НеПересчитыватьКурс Тогда
		Если Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
			ЗначенияДопРеквизитов.Курс = 1;
			ЗначенияДопРеквизитов.Кратность = 1;
		Иначе
			КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
			ЗначенияДопРеквизитов.Курс = КурсКратность.Курс;
			ЗначенияДопРеквизитов.Кратность = КурсКратность.Кратность;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Процедура вызывается из формы документа из события ПередЗаписьюНаСервере
// Здесь только записываются в ДополнительныеСвойства текущего объекта типовая операция и 
// дополнительные реквизиты из формы.
//
Процедура ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, Форма) Экспорт

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьИзФормыДокумента", Истина);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ДанныеДополнительныхТабЧастей", ПолучитьЗначенияДополнительныхТабличныхЧастейИзФормы(Форма));

	ФормированиеПроводокОбособленноОтДокумента = НЕ Форма["БухгалтерскиеОперации_ПризнакФормированияПроводокАвтоматически"];
	ТипЗначенияСсылки = ТипЗнч(ТекущийОбъект.Ссылка);

	Если ТипЗначенияСсылки <> Тип("ДокументСсылка.ОперацияБух")
			И НЕ ПроводкиФормируютсяВсегдаОдновременно(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗначенияСсылки)) Тогда

		Если ФормированиеПроводокОбособленноОтДокумента Тогда
			Возврат;
		КонецЕсли;

		Если Форма.Элементы.Найти(БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации()
				+ БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыТиповаяОперация()) = Неопределено Тогда
				// типовая операция не выводилась на форму
			Возврат;
		КонецЕсли;
		НеИспользоватьВалютныйУчет = Ложь;
	Иначе

		НеИспользоватьВалютныйУчет = Истина;

	КонецЕсли;

	Если Не ДокументПроводитсяПоРегиструБухгалтерии(ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;

	ИнициализироватьБухгалтерскиеОперации(ТекущийОбъект);

	ТиповаяОперация = Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыТиповаяОперация()];
	Если ЗначениеЗаполнено(ТиповаяОперация)
			И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись
			ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение)
			И НЕ ТиповаяОперацияСоответствуетДокументу(ТекущийОбъект, ТиповаяОперация) Тогда

		СообщитьТиповаяОперацияНеСоответствуетДокументу(ТекущийОбъект, Форма);
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	НеИспользоватьВалютныйУчет = НеИспользоватьВалютныйУчет
		ИЛИ НЕ ИспользоватьВалютныйУчет(ТекущийОбъект);
	ДополнительныеРеквизиты = Неопределено;
	ЗначенияДопРеквизитов = Неопределено;
	СформироватьСтруктуруДопРеквизитов(Форма, ДополнительныеРеквизиты, ЗначенияДопРеквизитов, НеИспользоватьВалютныйУчет);

	ДанныеАвтоПроведения = ТекущийОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения;
	ДанныеАвтоПроведения.ТиповаяОперация = ТиповаяОперация;
	ДанныеАвтоПроведения.ДополнительныеРеквизиты = ДополнительныеРеквизиты;
	ДанныеАвтоПроведения.ТаблицаЗначенийДопРеквизитов = ЗначенияДопРеквизитов;
	ДанныеАвтоПроведения.ВызовИзФормы = Истина;
	ДанныеАвтоПроведения.ОтветственныйИсполнитель = ОтветственныйИсполнительИзФормы(Форма);

КонецПроцедуры

// Вызывается из формы при изменении типовой операции через подключаемую процедуру ПриИзмененииТиповойОперации
//
// Параметры:
// 	ПолеДляРеквизитовОперации - ГруппаФормы - группа формы для размещения элементов типовой операции.
// 	ЗаполнятьЗначенияПоУмолчанию - Булево - Заполнять пустые дополнительные реквизиты по умолчанию.
Процедура ПриИзмененииТиповойОперации(Знач ПолеДляРеквизитовОперации,
		ЗаполнятьЗначенияПоУмолчанию = Истина) Экспорт

	Если ТипЗнч(ПолеДляРеквизитовОперации) = Тип("ФормаКлиентскогоПриложения") Тогда
		Форма = ПолеДляРеквизитовОперации;
	Иначе
		Если ПолеДляРеквизитовОперации.Имя = "ТиповыеОперации_ТиповаяОперацияДокумента" Тогда
			ПолеДляРеквизитовОперации = ПолеДляРеквизитовОперации.Родитель;
		КонецЕсли;
		Форма = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(ПолеДляРеквизитовОперации, Тип("ФормаКлиентскогоПриложения"));
	КонецЕсли;
	ПолеДляРеквизитовОперации = Форма.Элементы[Форма.БухгалтерскиеОперации_ИмяГруппыЭлементовТиповойОперации];
	Объект = Форма["Объект"];

	РеквизитыФормы = ПолучитьИменаРеквизитовФормы(Форма);
	Если РеквизитыФормы.Найти("БухгалтерскиеОперации_ДобавленныеРеквизитыОперации") = Неопределено Тогда
	// Нет реквизита, значит типовая операция не выводилась на форму
		Возврат;
	КонецЕсли;

	ТиповаяОперация = Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма)];

	ТипЗначенияСсылки = ТипЗнч(Объект.Ссылка);
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗначенияСсылки);

	ПараметрыДобавленияЭлементовФормы = ЗаполнитьПараметрыДобавленияЭлементовФормы(Форма, Объект, ПолеДляРеквизитовОперации,
		Неопределено, ТиповаяОперация, Истина, Ложь);

	ЗначенияДопРеквизитовДоИзменения = БухгалтерскиеОперацииКлиентСервер.ЗначенияДополнительныхРеквизитовИзФормы(Форма);

	БухгалтерскиеОперацииРаботаСФормами.ДобавитьРеквизитыЭлементыНаФорму(ПараметрыДобавленияЭлементовФормы);

	ИзменитьЗначенияДопРеквизитовПередУстановкой(ИдентификаторДокумента, Объект, ТиповаяОперация, ЗначенияДопРеквизитовДоИзменения, ЗаполнятьЗначенияПоУмолчанию);
	УстановитьЗначенияИСвойстваЭлементовФормы(Форма, ПолеДляРеквизитовОперации, ТиповаяОперация, ЗначенияДопРеквизитовДоИзменения);
	
	ОбщегоНазначенияБГУ.СохранитьИменаРеквизитовОперацииЗависящихОтУчетнойПолитики(Форма, ТиповаяОперация);
	ПриИзмененииПараметровФункциональныхОпций(ПолеДляРеквизитовОперации);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЦентрализованнуюБухгалтерию") Тогда
		УстановитьПараметрыВыбораОтветственногоИсполнителя(ИдентификаторДокумента, Форма);
	КонецЕсли;

КонецПроцедуры

// Вызывается из формы документа при изменении реквизита объекта, от которого может зависеть
// список доступных типовых операций.
//
// Пример использования:
//
//&НаКлиенте
//Процедура ВидПоступленияПриИзменении()
//
//	ВидПоступленияПриИзмененииНаСервере();
//
//КонецПроцедуры
//
//&НаСервере
//Процедура ВидПоступленияПриИзмененииНаСервере()
//
//	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект, Объект);
//
//КонецПроцедуры
//
// Пример использования в расширении конфигурации:
//
//&После("ВидПоступленияПриИзмененииНаСервере")
//&НаСервере
//Процедура ВидПоступленияПриИзмененииНаСервере_Расш1()
//
//	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект, Объект);
//
//КонецПроцедуры
//
// Параметры:
//  Форма	 - УправляемаяФорма - форма, из которой вызывается процедура.
//  Объект	 - ДанныеФормыСтруктура, ДанныеФормыСтруктураСКоллекцией, ДокументОбъект - документ, из которого получаются значения реквизитов.
// 
Процедура ПриИзмененииКлючевогоРеквизита(Форма, Знач Объект = Неопределено) Экспорт

	Если ПолучитьФункциональнуюОпцию("ФормированиеПроводокОбособленноОтДокумента")
		Или НЕ ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "БухгалтерскиеОперации_ДобавленныеРеквизитыОперации") Тогда
		// На форме нет добавленных реквизитов типовой операции
		Возврат;
	КонецЕсли;
	
	ИмяРеквизитаТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма);
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаТиповаяОперация) Тогда
		// На форме нет реквизита хранения типовой операции
		Возврат;
	КонецЕсли;
	
	Если Объект = Неопределено Тогда
		Объект = Форма.Объект;
	КонецЕсли;
	
	ВыбраннаяТиповаяОперация = Форма[ИмяРеквизитаТиповаяОперация];
	Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_БезИзменения();
	
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Ссылка));
	СписокДопустимыхТиповыхОпераций = Справочники.ТиповыеОперации.ПолучитьСписокТиповыхОперацийПоУсловиям(ИдентификаторДокумента,
		ПараметрыДляВыбораТиповойОперации(Объект, ИдентификаторДокумента));
	
	Если СписокДопустимыхТиповыхОпераций.НайтиПоЗначению(ВыбраннаяТиповаяОперация) <> Неопределено Тогда
		// Типовая операция допустима в контексте реквизиов документа. Действия не требуются.
		Возврат;
	КонецЕсли;
	
	Если СписокДопустимыхТиповыхОпераций.Количество() = 1 Тогда
		Если ЗначениеЗаполнено(Форма[ИмяРеквизитаТиповаяОперация]) Тогда
			Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_Изменена();
		Иначе
			Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_Установлена();
		КонецЕсли;
		Форма[ИмяРеквизитаТиповаяОперация] = СписокДопустимыхТиповыхОпераций[0].Значение;
	Иначе
		Форма.БухгалтерскиеОперации_ИзмениласьТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ПризнакИзмененияТиповойОперации_Очищена();
		Форма[ИмяРеквизитаТиповаяОперация] = Справочники.ТиповыеОперации.ПустаяСсылка();
	КонецЕсли;
	ПриИзмененииТиповойОперации(Форма);

КонецПроцедуры

Процедура УстановитьКартинкуЗакладки(Форма, ТиповаяОперация)
	
	ГруппаБухгалтерскаяОперация = Форма.Элементы.Найти("БухгалтерскаяОперация");
	
	Если ГруппаБухгалтерскаяОперация = Неопределено Или ГруппаБухгалтерскаяОперация.Вид <> ВидГруппыФормы.Страница Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Картинка = БиблиотекаКартинок.Внимание16;
	Иначе
		Картинка = Новый Картинка();
	КонецЕсли;
	ГруппаБухгалтерскаяОперация.Картинка = Картинка;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	ЗначенияДопКолонок = ПолучитьЗначенияСохраненныхДопКолонок(Форма.Объект);
	ЗаполнитьЗначенияДобавленныхРеквизитов(Форма, Форма.Объект, ЗначенияДопКолонок);
	Если ПолучитьФункциональнуюОпцию("ФормированиеПроводокПриПроведенииДокумента") Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьВидимостьВсехЭлементов(Форма);
		// После записи мог измениться ответственный исполнитель
		ОтветственныйИсполнитель = РегистрыСведений.ОперацииДокументов.ПрочитатьОперацию(ТекущийОбъект.Ссылка)
			.ОтветственныйИсполнитель;
		// Безопасная установка значения реквизита формы, которого может не существовать на форме
		ВременнаяСтруктура = Новый Структура;
		ВременнаяСтруктура.Вставить(БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель(),
			ОтветственныйИсполнитель);
		ЗаполнитьЗначенияСвойств(Форма, ВременнаяСтруктура); 
	КонецЕсли;
КонецПроцедуры

Процедура ПриИзмененииПараметровФункциональныхОпций(ПолеДляРеквизитовОперации) Экспорт

	Форма = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(ПолеДляРеквизитовОперации, Тип("ФормаКлиентскогоПриложения"));

	Для каждого ДобавленныйРеквизит Из Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"] Цикл
		
		ДобавленныйРеквизит.ВидимостьПоФО = БухгалтерскиеОперацииРаботаСФормами.ВидимостьПоФункциональнымОпциям(Форма,
			ДобавленныйРеквизит.ФункциональныеОпции);

	КонецЦикла;
	
	БухгалтерскиеОперацииКлиентСервер.УстановитьВидимостьЭлементов(Форма);

КонецПроцедуры

Процедура ЗаполнитьЗначенияДобавленныхРеквизитов(Форма, Объект, ЗначенияДопКолонок) Экспорт
	Перем ЗначенияКолонокТЧ;

	ДобавленныеРеквизитыОперации = Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"];

	ИменаТЧ = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
		ДобавленныеРеквизитыОперации.Выгрузить(, "ИмяТаблицы").ВыгрузитьКолонку("ИмяТаблицы"));

	Для каждого ИмяТЧ Из ИменаТЧ Цикл

		РеквизитыТЧ = ДобавленныеРеквизитыОперации.НайтиСтроки(Новый Структура("ИмяТаблицы, ЭтоГруппа", ИмяТЧ, Ложь));

		Если НЕ ПустаяСтрока(ИмяТЧ) И ТипЗнч(ЗначенияДопКолонок) = Тип("Структура")
				И ЗначенияДопКолонок.Свойство(ИмяТЧ, ЗначенияКолонокТЧ) Тогда

				// преобразовать таблицу...
			ДанныеТаблицы = ЗначенияКолонокТЧ.ДанныеТаблицы;

			Если ТипЗнч(ДанныеТаблицы) = Тип("Массив") Тогда
				ДанныеТаблицы = ТаблицаЗначенийИзМассива(ДанныеТаблицы);
			КонецЕсли;

			ИменаКолонок = Новый Массив;
			Для каждого ТекРеквизитТЧ Из РеквизитыТЧ Цикл

				Если ПустаяСтрока(ТекРеквизитТЧ.ИмяРеквизита)
						ИЛИ ПустаяСтрока(ТекРеквизитТЧ.ИмяДляФормулы) Тогда
					Продолжить;
				КонецЕсли;

				ДанныеТаблицы.Колонки.Добавить(ТекРеквизитТЧ.ИмяРеквизита, ДанныеТаблицы.Колонки[ТекРеквизитТЧ.ИмяДляФормулы].ТипЗначения);
				ДанныеТаблицы.ЗагрузитьКолонку(ДанныеТаблицы.ВыгрузитьКолонку(ТекРеквизитТЧ.ИмяДляФормулы), ТекРеквизитТЧ.ИмяРеквизита);
				ИменаКолонок.Добавить(ТекРеквизитТЧ.ИмяРеквизита);

				ПредопределеннаяТабличнаяЧасть = ТекРеквизитТЧ.ПредопределеннаяТЧ;

			КонецЦикла;
			СтрокаИменКолонок = СтрСоединить(ИменаКолонок, ",");

			Если ПредопределеннаяТабличнаяЧасть Тогда

				ИндексСтрокиТЧ = 0;
				КоличествоСтрокТЧ = ДанныеТаблицы.Количество();
				Для каждого СтрокаТЧДокумента Из Объект[ИмяТЧ] Цикл

					Пока ИндексСтрокиТЧ < КоличествоСтрокТЧ
						И ДанныеТаблицы[ИндексСтрокиТЧ].НомерСтрокиДокумента < СтрокаТЧДокумента.НомерСтроки Цикл

						ИндексСтрокиТЧ = ИндексСтрокиТЧ + 1;

					КонецЦикла;

					Если ИндексСтрокиТЧ = КоличествоСтрокТЧ Тогда
						Прервать;
					КонецЕсли;

					Если ДанныеТаблицы[ИндексСтрокиТЧ].НомерСтрокиДокумента = СтрокаТЧДокумента.НомерСтроки Тогда

						ЗаполнитьЗначенияСвойств(СтрокаТЧДокумента, ДанныеТаблицы[ИндексСтрокиТЧ], СтрокаИменКолонок);
						ИндексСтрокиТЧ = ИндексСтрокиТЧ + 1;

					КонецЕсли;

				КонецЦикла;

			Иначе

				СтрокиОписанияТЧ = ДобавленныеРеквизитыОперации.НайтиСтроки(Новый Структура("ИмяДляФормулы", ИмяТЧ));

				Если СтрокиОписанияТЧ.Количество() > 0 Тогда
					Форма[СтрокиОписанияТЧ[0].ИмяРеквизита].Загрузить(ДанныеТаблицы);
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Фактическая дата проведения документа из регистра сведений ДатыПроведенияДокументов.
// Если дата не заполнена или документа нет в ОТ.ДокументыСОтдельнойДатойПроведения, возвращается пустая дата.
// 
// Параметры:
//  Документ - ДокументСсылка
// 
// Возвращаемое значение:
// 	Дата 
Функция ФактическаяДатаПроведенияДокумента(Документ) Экспорт
	Возврат БухгалтерскийУчет.УстановленнаяДатаПроведения(Документ);
КонецФункции

// Функция проверяет необходимость вывода валютных реквизитов в типовой операции документа.
// Проверяется функциональная опция ИспользоватьВалютныйУчет и наличие реквизитов документа
// "ВалютаДокумента" и "Курс".
//
// Параметры:
//  ОбъектИлиСсылка - ДокументОбъект,ДокументСсылка - проверяемый документ.
// 
// Возвращаемое значение:
// Булево - Истина, если необходимо использовать реквизиты типовой операции "Курс" и "Кратность". Иначе Ложь.
//
Функция ИспользоватьВалютныйУчет(ОбъектИлиСсылка) Экспорт

	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеДокумента = ОбъектИлиСсылка.Метаданные();
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВалютаДокумента", МетаданныеДокумента)
		И НЕ ОбщегоНазначения.ЕстьРеквизитОбъекта("Курс", МетаданныеДокумента) Тогда
		
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ТиповаяОперацияПоУмолчанию(ИдентификаторДокумента, Знач Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ТиповыеОперации.Ссылка КАК ТиповаяОперация,
		|	ЕСТЬNULL(ДанныеТиповыхОпераций.ИспользуетсяВнешняяПроцедура, ЛОЖЬ) КАК ИспользуетсяВнешняяПроцедура,
		|	ДанныеТиповыхОпераций.ИмяВнешнейПроцедуры
		|ИЗ
		|	Справочник.ТиповыеОперации КАК ТиповыеОперации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеТиповыхОпераций КАК ДанныеТиповыхОпераций
		|		ПО ТиповыеОперации.Ссылка = ДанныеТиповыхОпераций.ТиповаяОперация
		|ГДЕ
		|	(НЕ ИСТИНА В
		|					(ВЫБРАТЬ
		|						ИСТИНА
		|					ИЗ
		|						Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
		|					ГДЕ
		|						ТиповыеОперацииРазрешенныеПользователи.Ссылка = ТиповыеОперации.Ссылка)
		|			ИЛИ ИСТИНА В
		|				(ВЫБРАТЬ
		|					ИСТИНА
		|				ИЗ
		|					Справочник.ТиповыеОперации.РазрешенныеПользователи КАК ТиповыеОперацииРазрешенныеПользователи
		|				ГДЕ
		|					ТиповыеОперацииРазрешенныеПользователи.Ссылка = ТиповыеОперации.Ссылка
		|					И ТиповыеОперацииРазрешенныеПользователи.Пользователь = &ТекущийПользователь))
		|	И ТиповыеОперации.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И ТиповыеОперации.НеИспользуется = ЛОЖЬ
		|	И ТиповыеОперации.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТиповыеОперацииПоУмолчанию.Пользователь,
		|	ТиповыеОперацииПоУмолчанию.ТиповаяОперация,
		|	1 КАК Порядок
		|ИЗ
		|	РегистрСведений.ТиповыеОперацииПоУмолчанию КАК ТиповыеОперацииПоУмолчанию
		|ГДЕ
		|	ТиповыеОперацииПоУмолчанию.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И ТиповыеОперацииПоУмолчанию.Пользователь = &ТекущийПользователь
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТиповыеОперацииПоУмолчанию.Пользователь,
		|	ТиповыеОперацииПоУмолчанию.ТиповаяОперация,
		|	2
		|ИЗ
		|	РегистрСведений.ТиповыеОперацииПоУмолчанию КАК ТиповыеОперацииПоУмолчанию
		|ГДЕ
		|	ТиповыеОперацииПоУмолчанию.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И ТиповыеОперацииПоУмолчанию.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";

	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);

	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователь);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТиповыеОперацииПользователя = РезультатЗапроса[0].Выгрузить();
	Если ТиповыеОперацииПользователя.Количество() = 1 Тогда
		Возврат ТиповыеОперацииПользователя[0].ТиповаяОперация;
	КонецЕсли;

	ТиповыеОперацииПоУмолчанию = РезультатЗапроса[1].Выбрать();
	Пока ТиповыеОперацииПоУмолчанию.Следующий() Цикл
		ТекСтрокаОперации = ТиповыеОперацииПользователя.Найти(ТиповыеОперацииПоУмолчанию.ТиповаяОперация, "ТиповаяОперация");
		Если ТекСтрокаОперации <> Неопределено Тогда
			Возврат ТекСтрокаОперации.ТиповаяОперация;
		КонецЕсли;
	КонецЦикла;

	Отбор = Новый Структура("ИспользуетсяВнешняяПроцедура, ИмяВнешнейПроцедуры", Истина, "ПереносДанных");
	ОперацииПереносДанных = ТиповыеОперацииПользователя.НайтиСтроки(Отбор);
	Если ОперацииПереносДанных.Количество() > 0 Тогда
		Для каждого ТекОперацияПереносДанных Из ОперацииПереносДанных Цикл
			ТиповыеОперацииПользователя.Удалить(ТекОперацияПереносДанных);
		КонецЦикла;
	КонецЕсли;

	Если ТиповыеОперацииПользователя.Количество() = 1 Тогда
		Возврат ТиповыеОперацииПользователя[0].ТиповаяОперация;
	КонецЕсли;

	Возврат Справочники.ТиповыеОперации.ПустаяСсылка();

Конецфункции

Функция РеквизитыТиповойОперацииПоУмолчанию(ИдентификаторДокумента,
		ТиповаяОперация, Знач Организация, Знач Пользователь = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат Новый Структура;
	КонецЕсли;

	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;

	Если Организация = Неопределено Тогда
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	// если нет значений по умолчанию в регистре, то возьмем из справочника
	Запрос.Текст = "ВЫБРАТЬ
		|	РеквизитыТиповыхОпераций.Ссылка КАК РеквизитОперации,
		|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
		|	РеквизитыТиповыхОпераций.ЗначениеПоУмолчанию КАК Значение,
		|	ИСТИНА КАК ТолькоЗаполненные
		|ИЗ
		|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|ГДЕ
		|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций
		|				ГДЕ
		|					ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.ТиповаяОперация = РеквизитыТиповыхОпераций.Владелец
		|					И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка
		|					И (ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|						ИЛИ ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Пользователь = &Пользователь))
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
		|	И РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст
		+ ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все");
		// если нет значений по умолчанию для текущего пользователя, то возьмем общие значения
	// без указания организации
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	РеквизитыТиповыхОпераций.Ссылка,
		|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Значение,
		|	ЛОЖЬ КАК Поле1
		|ИЗ
		|	РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|		ПО ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка
		|ГДЕ
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.ТиповаяОперация = &ТиповаяОперация
		|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК Т
		|				ГДЕ
		|					Т.ТиповаяОперация = РеквизитыТиповыхОпераций.Владелец
		|					И Т.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка
		|					И Т.Пользователь = &Пользователь)
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК Т
		|				ГДЕ
		|					Т.ТиповаяОперация = ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.ТиповаяОперация
		|					И Т.РеквизитОперации = ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.РеквизитОперации
		|					И Т.Организация = &Организация)";
	Запрос.Текст = Запрос.Текст
		+ ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все");
		// по указанной организации
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	РеквизитыТиповыхОпераций.Ссылка,
		|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Значение,
		|	ЛОЖЬ КАК Поле1
		|ИЗ
		|	РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|		ПО ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка
		|ГДЕ
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.ТиповаяОперация = &ТиповаяОперация
		|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК Т
		|				ГДЕ
		|					Т.ТиповаяОперация = РеквизитыТиповыхОпераций.Владелец
		|					И Т.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка
		|					И Т.Пользователь = &Пользователь)
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Организация = &Организация
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст
		+ ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все");
		// иначе берем для указанного пользователя
	// без указания организации
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	РеквизитыТиповыхОпераций.Ссылка,
		|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Значение,
		|	ЛОЖЬ КАК Поле1
		|ИЗ
		|	РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|		ПО ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка
		|ГДЕ
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.ТиповаяОперация = &ТиповаяОперация
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Пользователь = &Пользователь
		|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И НЕ ИСТИНА В
		|				(ВЫБРАТЬ
		|					ИСТИНА
		|				ИЗ
		|					РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК Т
		|				ГДЕ
		|					Т.ТиповаяОперация = ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.ТиповаяОперация
		|					И Т.РеквизитОперации = ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.РеквизитОперации
		|					И Т.Пользователь = ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Пользователь
		|					И Т.Организация = &Организация)
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";
	Запрос.Текст = Запрос.Текст
		+ ОбщегоНазначенияБГУ.ТекстРазделителяОбъединенияЗапросов("Все");
		// по указанной организации
	Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		|	РеквизитыТиповыхОпераций.Ссылка,
		|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Значение,
		|	ЛОЖЬ КАК Поле1
		|ИЗ
		|	РегистрСведений.ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций КАК ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|		ПО ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.РеквизитОперации = РеквизитыТиповыхОпераций.Ссылка
		|ГДЕ
		|	ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.ТиповаяОперация = &ТиповаяОперация
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Пользователь = &Пользователь
		|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		|	И ЗначенияПоУмолчаниюРеквизитовТиповыхОпераций.Организация = &Организация
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Организация", Организация);

	Результат = Новый Структура;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Не Выборка.ТолькоЗаполненные
				ИЛИ ЗначениеЗаполнено(Выборка.Значение) Тогда
			Результат.Вставить(Выборка.ИмяДляФормулы, Выборка.Значение);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ИспользованиеСобственныхМодулейВРасширениях

Функция ПроверитьИменаПроцедурРасширения(ИменаПроцедур, ИмяМодуля,
		ТекстОшибки = "") Экспорт

	Ошибки = Новый Массив;

	Для каждого ИмяПроцедуры Из ИменаПроцедур Цикл

		Если СтрНайти(ИмяПроцедуры, ".") > 0 Тогда
			Ошибки.Добавить(ИмяПроцедуры);
			Продолжить;
		КонецЕсли;

		Попытка
			ТестоваяСтруктура = Новый Структура(ИмяПроцедуры);
		Исключение
			Ошибки.Добавить(ИмяПроцедуры);
			Продолжить;
		КонецПопытки;

	КонецЦикла;

	Результат = Ошибки.Количество() = 0;

	ТекстОшибки = СтрШаблон(НСтр("ru = 'Общий модуль ""%1"", функции:
		|%2.'"), ИмяМодуля, СтрСоединить(Ошибки, "," + Символы.ПС));

	Возврат Результат;

КонецФункции

// Возвращает имена дополнительных модулей и описание расширения по заданной функциональности.
//
// Параметры:
//  Функциональность - Строка - возможные значения "Функции", "ИсточникиДанных", "Обработчики", "ФункцииПроведения".
// 
// Возвращаемое значение:
// ФиксированнаяСтруктура - структура, в которой "ключ" - имя функции, а "значение" - описание расширения.
//
Функция ОписанияМодулейРасширений(Функциональность) Экспорт

	Возврат БухгалтерскиеОперацииПовтИспНаВремяСеанса.ИменаМодулей()[Функциональность];

КонецФункции
#КонецОбласти

#Область ФункцииВызываемыеИзСхемыФормированияПроводок

//ФУНКЦИЯ ДЛЯ ПОЛУЧЕНИЯ РЕКВИЗИТА ОБЪЕКТА 
//ИСПОЛЬЗУЕТСЯ В СКД ПРИ ВЫЧИСЛЕНИИ ПРОВОДОК
//НЕ МЕНЯТЬ И НЕ УДАЛЯТЬ!!!
// вызывается также из модуля БухгалтерскиеОперацииКлиент
//
Функция ЗначениеРеквизита(Знач Элемент, Знач ИмяРеквизита) Экспорт
	Возврат БухгалтерскиеОперацииПовтИсп.ЗначениеРеквизита(Элемент, ИмяРеквизита);
КонецФункции

// Вызывает соответствующую функцию БСП РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу
//  
Функция ПересчитатьИзВалютыВВалюту(Сумма, ВалютаНач, ВалютаКон, ПоКурсуНач,
		ПоКурсуКон, ПоКратностьНач = 1, ПоКратностьКон = 1) Экспорт

	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Сумма, Новый Структура("Валюта, Курс, Кратность", ВалютаНач, ПоКурсуНач, ПоКратностьНач), Новый Структура("Валюта, Курс, Кратность", ВалютаКон, ПоКурсуКон, ПоКратностьКон));

КонецФункции
#КонецОбласти

#Область ФоновоеОбновлениеТиповыхОпераций

Процедура УстановитьПометкуУдаленияРеквизитамПоставляемыхТиповыхОпераций() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();

	Если ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы() Тогда

	// Проверку выполнять после окончания обновления областей данных.
		Возврат;

	КонецЕсли;

	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда

	// Выключить использование рег. задания, т.к. оно было включено не правильно
		ОстановитьРегЗаданиеУдаленияПоставлямойТиповойОперации();
		Возврат;

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ПоставляемыеТиповыеОперации.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА КАК Поле1
		|				ИЗ
		|					РегистрСведений.ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации КАК ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации
		|				ГДЕ
		|					ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации.ПоставляемаяТиповаяОперация = ПоставляемыеТиповыеОперации.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьНеобработанныеОбластиДанных
		|ИЗ
		|	Справочник.ПоставляемыеТиповыеОперации КАК ПоставляемыеТиповыеОперации
		|ГДЕ
		|	ПоставляемыеТиповыеОперации.ПометкаУдаления = ИСТИНА
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК Поле1
		|			ИЗ
		|				Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
		|			ГДЕ
		|				ПоставляемыеРеквизитыТиповыхОпераций.Владелец = ПоставляемыеТиповыеОперации.Ссылка
		|				И ПоставляемыеРеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ)
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК Поле1
		|			ИЗ
		|				Справочник.ПоставляемыеПроводкиТиповыхОпераций КАК ПоставляемыеПроводкиТиповыхОпераций
		|			ГДЕ
		|				ПоставляемыеПроводкиТиповыхОпераций.Владелец = ПоставляемыеТиповыеОперации.Ссылка
		|				И ПоставляемыеПроводкиТиповыхОпераций.ПометкаУдаления = ЛОЖЬ)
		|	И ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА КАК Поле1
		|			ИЗ
		|				Справочник.ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций
		|			ГДЕ
		|				ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = ПоставляемыеТиповыеОперации.Ссылка
		|				И ПоставляемыеДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления = ЛОЖЬ)";

	ЕстьНеобработанныеОбластиДанных = Ложь;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Выборка.ЕстьНеобработанныеОбластиДанных Тогда

			ЕстьНеобработанныеОбластиДанных = Истина;
			Продолжить;

		КонецЕсли;

		Справочники.ПоставляемыеТиповыеОперации.УстановитьПометкуУдаленияПодчиненнымЭлементам(Выборка.Ссылка);

	КонецЦикла;

	Если НЕ ЕстьНеобработанныеОбластиДанных Тогда

	// Выключить использование рег. задания
		ОстановитьРегЗаданиеУдаленияПоставлямойТиповойОперации();

	КонецЕсли;

КонецПроцедуры

Процедура НачатьОтключениеОтПоддержкиТиповойОперацииВОбластяхДанных() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ОбластиДанных.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные
		|ИЗ
		|	РегистрСведений.ОбластиДанных КАК ОбластиДанных
		|ГДЕ
		|	ОбластиДанных.Статус В (Значение(Перечисление.СтатусыОбластейДанных.Новая), Значение(Перечисление.СтатусыОбластейДанных.Используется))";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ПараметрыЗадания = Новый Структура("ОбластьДанных, ИмяМетода");
		ПараметрыЗадания.ОбластьДанных = Выборка.ОбластьДанныхВспомогательныеДанные;
		ПараметрыЗадания.ИмяМетода = "ОтключитьОтПоддержкиТиповыеОперацииВОбластиДанных";

		ОчередьЗаданий.ДобавитьЗадание(ПараметрыЗадания);

	КонецЦикла;

	ЗапуститьРегЗаданиеУдаленияПоставлямойТиповойОперации();

КонецПроцедуры

// Добавляет фоновые задания обновления типовых операций в областях данных.
// 
// Параметры:
//  ТолькоИзменившиеся - Булево - будут обновлены только ТО, у которых дата версии ниже даты версии ПТО
Процедура НачатьФоновоеОбновлениеТиповыхОперацийВОбластяхДанных(ТолькоИзменившиеся) Экспорт

	Если Не ОбщегоНазначения.РазделениеВключено()
			Или ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда

		ТекстОшибки = НСтр("ru = 'Запуск фоновых заданий обновления типовых операций возможен только из неразделенного режима.'"); 
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииОбновлениеТО(), УровеньЖурналаРегистрации.Ошибка, , ,
			ТекстОшибки);

		ВызватьИсключение ТекстОшибки;

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбластиДанных.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные
	|ИЗ
	|	РегистрСведений.ОбластиДанных КАК ОбластиДанных
	|ГДЕ
	|	ОбластиДанных.Статус В (Значение(Перечисление.СтатусыОбластейДанных.Новая),
	|		Значение(Перечисление.СтатусыОбластейДанных.Используется))";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ОбластьДанных", Выборка.ОбластьДанныхВспомогательныеДанные);
		ПараметрыЗадания.Вставить("ИмяМетода", "ОбновлениеТиповыхОперацийВОбластиДанных");
		ПараметрыЗадания.Вставить("Параметры", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТолькоИзменившиеся));

		ОчередьЗаданий.ДобавитьЗадание(ПараметрыЗадания);

	КонецЦикла;

КонецПроцедуры

Процедура ОстановитьФоновоеОбновлениеТиповыхОперацийВОбластиДанных(Знач ОбластьДанных = 0) Экспорт

	Отбор = Новый Структура("ИмяМетода");
	Отбор.ИмяМетода = "ОбновлениеТиповыхОперацийВОбластиДанных";
	Если ОбластьДанных <> 0 Тогда
		Отбор.Вставить("ОбластьДанных", ОбластьДанных);
	КонецЕсли;

	СуществующиеЗадания = ОчередьЗаданий.ПолучитьЗадания(Отбор);
	Для каждого Задание Из СуществующиеЗадания Цикл

		ОчередьЗаданий.УдалитьЗадание(Задание.Идентификатор);

	КонецЦикла;

КонецПроцедуры

Функция ЗапущеноФоновоеОбновлениеТиповыхОпераций() Экспорт

	Если НЕ ОбщегоНазначения.РазделениеВключено()
			ИЛИ НЕ ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда

		Возврат Ложь;

	КонецЕсли;

	ЗначениеРазделителяСеанса = РаботаВМоделиСервиса.ЗначениеРазделителяСеанса();

	Отбор = Новый Структура("ИмяМетода, ОбластьДанных");
	Отбор.ИмяМетода = "ОбновлениеТиповыхОперацийВОбластиДанных";
	Отбор.ОбластьДанных = ЗначениеРазделителяСеанса;

	СуществующиеЗадания = ОчередьЗаданий.ПолучитьЗадания(Отбор);

	Если СуществующиеЗадания.Количество() > 0 Тогда

		Возврат Истина;

	КонецЕсли;

	Отбор.ИмяМетода = "ОтключитьОтПоддержкиТиповыеОперацииВОбластиДанных";

	СуществующиеЗадания = ОчередьЗаданий.ПолучитьЗадания(Отбор);

	Если СуществующиеЗадания.Количество() > 0 Тогда

		Возврат Истина;

	КонецЕсли;

	Возврат Ложь;

КонецФункции

Процедура ЗапуститьРегЗаданиеУдаленияПоставлямойТиповойОперации()

	Отбор = Новый Структура("Метаданные", "УстановитьПометкуУдаленияРеквизитовПоставляемыхТиповыхОпераций");
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);

	Если Задания.Количество() <> 1 Тогда
	// Запись в журнал ошибки опущена.
		Возврат;
	КонецЕсли;

	Параметры = Новый Структура("Использование", Истина);
	РегламентныеЗаданияСервер.ИзменитьЗадание(Задания[0].УникальныйИдентификатор, Параметры);

КонецПроцедуры

Процедура ОстановитьРегЗаданиеУдаленияПоставлямойТиповойОперации()

	Отбор = Новый Структура("Метаданные, Использование");
	Отбор.Метаданные = "УстановитьПометкуУдаленияРеквизитовПоставляемыхТиповыхОпераций";
	Отбор.Использование = Истина;

	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);

	Если Задания.Количество() <> 1 Тогда
	// Нет запущенных заданий
		Возврат;
	КонецЕсли;

	Параметры = Новый Структура("Использование", Ложь);
	РегламентныеЗаданияСервер.ИзменитьЗадание(Задания[0].УникальныйИдентификатор, Параметры);

КонецПроцедуры
#КонецОбласти

#Область ВерсионированиеОбъектов

// см. ВерсионированиеОбъектовПереопределяемый.ПослеРазбораВерсииОбъекта
Процедура ПослеРазбораВерсииДокумента(Ссылка, Результат) Экспорт

	ИдентификаторКолонки = УИДКолонокДопРеквизитовДляВерсионирования()
		+ "ДополнительнаяКолонка";

	Если ЗначениеЗаполнено(Результат.ДополнительныеРеквизиты) Тогда
		Для каждого СтрокаДополнительногоРеквизита Из Результат.ДополнительныеРеквизиты Цикл

			Если СтрокаДополнительногоРеквизита.Идентификатор = ИдентификаторКолонки Тогда

				ОписаниеКолонки = СтрокаДополнительногоРеквизита.Значение;

				Если ТипЗнч(ОписаниеКолонки) <> Тип("Структура")
						ИЛИ НЕ ОписаниеКолонки.Свойство("ЗначениеКолонки") Тогда
					Продолжить;
				КонецЕсли;

				ИмяТЧ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОписаниеКолонки.ТабличнаяЧасть, "ИмяТабличнойЧасти");
				ТекТЧ = Результат.ТабличныеЧасти.Получить(ИмяТЧ);

				Если ТекТЧ = Неопределено Тогда
					Результат.ТабличныеЧасти.Вставить(ИмяТЧ, Новый ТаблицаЗначений);
					ТекТЧ = Результат.ТабличныеЧасти.Получить(ИмяТЧ);
				КонецЕсли;

				ИмяКолонки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОписаниеКолонки.КолонкаТабличнойЧасти, "ИмяКолонки");
				Если ТекТЧ.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
					ТекТЧ.Колонки.Добавить(ИмяКолонки);
				КонецЕсли;

				Если ТекТЧ.Количество() >= ОписаниеКолонки.НомерСтрокиДокумента Тогда
					ТекТЧ[ОписаниеКолонки.НомерСтрокиДокумента
						- 1][ИмяКолонки] = ОписаниеКолонки.ЗначениеКолонки;
				КонецЕсли;

			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

	// Обработать наименования реквизитов
	УИД = УИДКолонокДопРеквизитовДляВерсионирования();
	ДлинаУИД = СтрДлина(УИД);
	НаименованиеРеквизитаТиповаяОперация = НаименованиеРеквизитаВерсииОбъекта_ТиповаяОперация();
	УдаляемыеСтроки = Новый Массив; // строки доп. реквизитов удалить из таблицы реквизитов
	Для каждого СтрокаРеквизита Из Результат.Реквизиты Цикл

		Если СтрНачинаетсяС(СтрокаРеквизита.НаименованиеРеквизита, УИД) Тогда

			Если СтрокаРеквизита.НаименованиеРеквизита = НаименованиеРеквизитаТиповаяОперация Тогда

				СтрокаРеквизита.НаименованиеРеквизита = НСтр("ru = 'Типовая операция'");

			ИначеЕсли Сред(СтрокаРеквизита.НаименованиеРеквизита, ДлинаУИД + 1, 10) = "_Реквизит_" Тогда

				СтрокаРеквизита.НаименованиеРеквизита = СтрШаблон(
					НСтр("ru = '%1 (реквизит операции)'"),
					Сред(СтрокаРеквизита.НаименованиеРеквизита, ДлинаУИД + 11));

			ИначеЕсли Сред(СтрокаРеквизита.НаименованиеРеквизита, ДлинаУИД + 1, 9) = "_Колонка_" Тогда

				УдаляемыеСтроки.Добавить(СтрокаРеквизита);

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Для каждого Строка Из УдаляемыеСтроки Цикл

		Результат.Реквизиты.Удалить(Строка);

	КонецЦикла;

КонецПроцедуры

// см. ВерсионированиеОбъектовПереопределяемый.ПриВосстановленииВерсииОбъекта
Процедура ПриВосстановленииВерсииДокумента(Объект, ДополнительныеРеквизиты) Экспорт

	НаименованиеРеквизитаТиповаяОперация = НаименованиеРеквизитаВерсииОбъекта_ТиповаяОперация();
	Если ДополнительныеРеквизиты.Найти(НаименованиеРеквизитаТиповаяОперация, "Наименование") = Неопределено Тогда
			// Версия сохранена без данных о типовой операции, реквизитах и доп. колонках.
			// Никаких дополнительных действий не производим.
		Возврат;
	КонецЕсли;

	ДанныеОперации = РегистрыСведений.ОперацииДокументов.ПрочитатьОперацию(Объект.Ссылка);

	Если ЗначениеЗаполнено(ДанныеОперации.Операция) Тогда
		ЗаписатьРегистрОперации = Истина;
		ПерезаписьРегистраОперации = Истина;
	Иначе
		ЗаписатьРегистрОперации = Ложь;
		ПерезаписьРегистраОперации = Ложь;
	КонецЕсли;

	РегистрРеквизиты = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
	РегистрРеквизиты.Отбор.Объект.Установить(Объект.Ссылка);
	РегистрРеквизиты.Прочитать();
	Если РегистрРеквизиты.Количество() > 0 Тогда
		РегистрРеквизиты.Очистить();
		ЗаписатьРегистрРеквизиты = Истина;
		ПерезаписьРегистраРеквизиты = Истина;
	Иначе
		ЗаписатьРегистрРеквизиты = Ложь;
		ПерезаписьРегистраРеквизиты = Ложь;
	КонецЕсли;

	РегистрКолонки = РегистрыСведений.ЗначенияКолонокДополнительныхТабличныхЧастей.СоздатьНаборЗаписей();
	РегистрКолонки.Отбор.Объект.Установить(Объект.Ссылка);
	РегистрКолонки.Прочитать();
	Если РегистрКолонки.Количество() > 0 Тогда
		РегистрКолонки.Очистить();
		ЗаписатьРегистрКолонки = Истина;
		ПерезаписьРегистраКолонки = Истина;
	Иначе
		ЗаписатьРегистрКолонки = Ложь;
		ПерезаписьРегистраКолонки = Ложь;
	КонецЕсли;

	УИД = УИДКолонокДопРеквизитовДляВерсионирования();
	ДлинаУИД = СтрДлина(УИД);
	НаименованиеРеквизитаОтветственный = НаименованиеРеквизитаВерсииОбъекта_ОтветственныйИсполнитель();
	Для каждого СтрокаРеквизита Из ДополнительныеРеквизиты Цикл

		Если НЕ СтрНачинаетсяС(СтрокаРеквизита.Наименование, УИД) Тогда

			Продолжить;

		КонецЕсли;

		Если СтрокаРеквизита.Наименование = НаименованиеРеквизитаТиповаяОперация Тогда
			// типовая операция
			Если ЗначениеЗаполнено(СтрокаРеквизита.Значение) Тогда
				ДанныеОперации.Документ = Объект.Ссылка;
				ДанныеОперации.Операция = СтрокаРеквизита.Значение;
				ДанныеОперации.Организация = Объект.Организация;

				ЗаписатьРегистрОперации = Истина;
			Иначе
				Если ЗначениеЗаполнено(ДанныеОперации.Операция) Тогда
					ДанныеОперации = РегистрыСведений.ОперацииДокументов.ДанныеДляЗаписи(Объект.Ссылка);
					ЗаписатьРегистрОперации = Истина;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СтрокаРеквизита.Наименование = НаименованиеРеквизитаОтветственный Тогда
			Если ДанныеОперации.ОтветственныйИсполнитель <> СтрокаРеквизита.Значение Тогда
				ДанныеОперации.ОтветственныйИсполнитель = СтрокаРеквизита.Значение;
				ЗаписатьРегистрОперации = Истина;
			КонецЕсли;
		ИначеЕсли Сред(СтрокаРеквизита.Наименование, ДлинаУИД + 1, 10) = "_Реквизит_" Тогда
			// дополнительные реквизиты операции
			НоваяЗаписьР = РегистрРеквизиты.Добавить();
			НоваяЗаписьР.Объект = Объект.Ссылка;
			НоваяЗаписьР.РеквизитОперации = СтрокаРеквизита.Идентификатор;
			НоваяЗаписьР.Значение = СтрокаРеквизита.Значение;

			ЗаписатьРегистрРеквизиты = Истина

		ИначеЕсли Сред(СтрокаРеквизита.Наименование, ДлинаУИД + 1, 9) = "_Колонка_" Тогда
			// дополнительные колонки
			ОписаниеКолонки = Новый Структура("ТабличнаяЧасть,КолонкаТабличнойЧасти,НомерСтрокиДокумента,ЗначениеКолонки");
			ЗаполнитьЗначенияСвойств(ОписаниеКолонки, СтрокаРеквизита.Значение);

			Если НЕ ЗначениеЗаполнено(ОписаниеКолонки.ТабличнаяЧасть)
					ИЛИ НЕ ЗначениеЗаполнено(ОписаниеКолонки.КолонкаТабличнойЧасти) Тогда

				Продолжить;
			КонецЕсли;

			НоваяЗаписьК = РегистрКолонки.Добавить();
			НоваяЗаписьК.Объект = Объект.Ссылка;
			НоваяЗаписьК.ТабличнаяЧасть = ОписаниеКолонки.ТабличнаяЧасть;
			НоваяЗаписьК.КолонкаТабличнойЧасти = ОписаниеКолонки.КолонкаТабличнойЧасти;
			НоваяЗаписьК.НомерСтрокиДокумента = ОписаниеКолонки.НомерСтрокиДокумента;
			НоваяЗаписьК.Значение = ОписаниеКолонки.ЗначениеКолонки;

			ЗаписатьРегистрКолонки = Истина;

		КонецЕсли;

	КонецЦикла;

	Если ЗаписатьРегистрОперации Тогда
		РегистрыСведений.ОперацииДокументов.ЗаписатьОперацию(Объект.Ссылка, ДанныеОперации, ПерезаписьРегистраОперации);
	КонецЕсли;

	Если ЗаписатьРегистрРеквизиты Тогда
		РегистрРеквизиты.Записать(ПерезаписьРегистраРеквизиты);
	КонецЕсли;

	Если ЗаписатьРегистрКолонки Тогда
		РегистрКолонки.Записать(ПерезаписьРегистраКолонки);
	КонецЕсли;

КонецПроцедуры

// см. ВерсионированиеОбъектовПереопределяемый.ПриПодготовкеДанныхОбъекта
//
// Параметры:
//  Объект - ДокументОбъект - версионируемый объект:
//   * ДополнительныеСвойства - Структура:
//    ** ДанныеАвтоПроведения - Структура
//    ** ДанныеТиповойОперации - см. НовыйДанныеТиповойОперацииВерсионирование  
//  ДополнительныеРеквизиты - ТаблицаЗначений - коллекция дополнительных реквизитов, которые требуется сохранить вместе
//                                              с версией объекта:
//   * Идентификатор - Произвольный - уникальный идентификатор реквизита. Требуется при восстановлении из версии
//                                    объекта в случае, когда значение реквизита хранится отдельно от объекта.
//   * Наименование - Строка - название реквизита.
//   * Значение - Произвольный - значение реквизита.
Процедура ПриПодготовкеДанныхОбъекта(Объект, ДополнительныеРеквизиты) Экспорт

	Если НЕ ДокументПроводитсяПоРегиструБухгалтерии(Объект) Тогда
		Возврат;
	КонецЕсли;

	УИД = УИДКолонокДопРеквизитовДляВерсионирования();

	Если Объект.ДополнительныеСвойства.Свойство("ДанныеАвтоПроведения") Тогда
		ДанныеАвтоПроведения = Объект.ДополнительныеСвойства.ДанныеАвтоПроведения;
		ТиповаяОперация = ДанныеАвтоПроведения.ТиповаяОперация;
		ТаблицаЗначенийДопРеквизитов = ДанныеАвтоПроведения.ТаблицаЗначенийДопРеквизитов;
		ОтветственныйИсполнитель = ДанныеАвтоПроведения.ОтветственныйИсполнитель;

	ИначеЕсли Объект.ДополнительныеСвойства.Свойство("ДанныеТиповойОперации") Тогда

		ДанныеТиповойОперации = Объект.ДополнительныеСвойства.ДанныеТиповойОперации;
		ТиповаяОперация = ДанныеТиповойОперации.ТиповаяОперация;
		ТаблицаЗначенийДопРеквизитов = ДанныеТиповойОперации.ТаблицаЗначенийДопРеквизитов;
		ОтветственныйИсполнитель = ДанныеТиповойОперации.ОтветственныйИсполнитель;

	Иначе
		ТиповаяОперация = Неопределено;
		ДополнительныеРеквизитыОперации = Неопределено;
		ТаблицаЗначенийДопРеквизитов = Неопределено;
		СформироватьСтруктуруДопРеквизитовИзБазы(Объект, ТиповаяОперация, ДополнительныеРеквизитыОперации,
			ТаблицаЗначенийДопРеквизитов, Истина);
		ОтветственныйИсполнитель = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеРеквизитыОперации,
			"ОтветственныйИсполнитель");
	КонецЕсли;

	Если Объект.ДополнительныеСвойства.Свойство("ДанныеДополнительныхТабЧастей") Тогда
		ДанныеДополнительныхТабЧастей = Объект.ДополнительныеСвойства.ДанныеДополнительныхТабЧастей;
	Иначе
		ДанныеДополнительныхТабЧастей = ПолучитьСохраненныеЗначенияДополнительныхТабличныхЧастей(Объект);
	КонецЕсли;

	Если ТипЗнч(ТиповаяОперация) = Тип("Структура")
			И ТиповаяОперация.Свойство("Операция") Тогда
		ТиповаяОперация = ТиповаяОперация.Операция;
	КонецЕсли;

	// Типовая операция
	// Значение пишем всегда, даже если оно пустое.
	// Потом эта запись используется для анализа необходимости восстановления связанных регистров
	НоваяСтрока = ДополнительныеРеквизиты.Добавить();
	НоваяСтрока.Идентификатор = УИД + "ТиповаяОперация";
	НоваяСтрока.Наименование = НаименованиеРеквизитаВерсииОбъекта_ТиповаяОперация();
	НоваяСтрока.Значение = ТиповаяОперация;
	
	Если ЗначениеЗаполнено(ТиповаяОперация) Тогда
		НоваяСтрока = ДополнительныеРеквизиты.Добавить();
		НоваяСтрока.Идентификатор = УИД + "ОтветственныйИсполнитель";
		НоваяСтрока.Наименование = НаименованиеРеквизитаВерсииОбъекта_ОтветственныйИсполнитель();
		НоваяСтрока.Значение = ОтветственныйИсполнитель;
	КонецЕсли;

	// Дополнительные реквизиты
	Если ТаблицаЗначенийДопРеквизитов <> Неопределено Тогда
		Для Каждого ДопРеквизит Из ТаблицаЗначенийДопРеквизитов Цикл

			НоваяСтрока = ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Идентификатор = ДопРеквизит.РеквизитОперации;
			НоваяСтрока.Наименование = УИД + "_Реквизит_"
				+ ДопРеквизит.НаименованиеРеквизита;
			НоваяСтрока.Значение = ДопРеквизит.Значение;

		КонецЦикла;
	КонецЕсли;

	// Дополнительные колонки табличных частей
	Если ДанныеДополнительныхТабЧастей <> Неопределено Тогда
		Для Каждого ДопКолонка Из ДанныеДополнительныхТабЧастей Цикл

			НоваяСтрока = ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Идентификатор = УИД + "ДополнительнаяКолонка";
			НоваяСтрока.Наименование = УИД + "_Колонка_"
				+ ДопКолонка.НаименованиеКолонки;
			НоваяСтрока.Значение = Новый Структура("ТабличнаяЧасть,КолонкаТабличнойЧасти,НомерСтрокиДокумента,ЗначениеКолонки");
			НоваяСтрока.Значение.ТабличнаяЧасть = ДопКолонка.ТабличнаяЧасть;
			НоваяСтрока.Значение.КолонкаТабличнойЧасти = ДопКолонка.КолонкаТабличнойЧасти;
			НоваяСтрока.Значение.НомерСтрокиДокумента = ДопКолонка.НомерСтрокиДокумента;
			НоваяСтрока.Значение.ЗначениеКолонки = ДопКолонка.Значение;

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

// Подписка ПодготовитьТаблицуПроводок (событие = ПередЗаписью)
//
Процедура ПодготовитьТаблицуПроводокПередЗаписью(Источник, Отказ, РежимЗаписи,
		РежимПроведения) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И РегистрыСведений.ОперацииДокументов.ПрочитатьОперацию(Источник.Ссылка).РучнаяКорректировка Тогда

		ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Проведение документа %1.
			|Бухгалтерские проводки не изменены, т.к. для документа установлен режим ручной корректировки проводок.'"), Источник.Ссылка), Источник.Ссылка, , , Отказ);
		Источник.ДополнительныеСвойства.Вставить("РучнаяКорректировка", Истина);

	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		РегистрыСведений.ОперацииДокументов.ОбновитьЗаписьПриОтменеПроведения(Источник.Ссылка);
	КонецЕсли;

	ПравоДоступаЕПСБУИзменение = ОбщегоНазначенияБГУПовтИсп.ЕстьПравоДоступа("Изменение", "РегистрБухгалтерии.ЖурналПроводокЕПСБУ");
	Если Не ПравоДоступаЕПСБУИзменение И ЕстьПроводкиДокумента(Источник.Ссылка) Тогда
		ТекстИсключения = НСтр("ru = 'Нарушение прав доступа.
			|Пользователю без права формирования проводок запрещено перепроводить документ, у которого сформированы проводки'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Если Источник.ДополнительныеСвойства.Свойство("ПравоДоступаЕПСБУИзменение") Тогда
		Источник.ДополнительныеСвойства.ПравоДоступаЕПСБУИзменение = ПравоДоступаЕПСБУИзменение;
	Иначе
		Источник.ДополнительныеСвойства.Вставить("ПравоДоступаЕПСБУИзменение", ПравоДоступаЕПСБУИзменение);
	КонецЕсли;

	ПередЗаписьюОбъекта(Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

// Подписка ЗаписатьБухгалтерскуюОперацию (событие = ПриЗаписи)
//
Процедура ЗаписатьБухгалтерскуюОперациюПриЗаписи(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//  При проведении устанавливается привелигированный режим, поэтому
	// определить имеет ли пользователь право измеения регистра Рабочие счета
	// надо заранее
	//
	НаборЗаписейРБ = Источник.Движения.Найти("ЖурналПроводокЕПСБУ");
	Если НЕ НаборЗаписейРБ = Неопределено Тогда
		НаборЗаписейРБ.ДополнительныеСвойства.Вставить("ЕстьПравоИзмененияРабочихСчетов", ПравоДоступа("Изменение", Метаданные.РегистрыСведений.РабочиеСчета));
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.Свойство("РучнаяКорректировка")
			И Источник.ДополнительныеСвойства.РучнаяКорректировка = Истина Тогда
		Возврат;
	КонецЕсли;

	ПриЗаписиОбъекта(Источник, Отказ);
	
КонецПроцедуры

// Подписка ЗаписатьТаблицуПроводок (событие = ОбработкаПроведения)
//
Процедура ЗаписатьТаблицуПроводокОбработкаПроведения(Источник, Отказ,
		РежимПроведения) Экспорт
	Если Не ДокументПроводитсяПоРегиструБухгалтерии(Источник) Тогда
		Возврат;
	КонецЕсли;

	Если Источник.ДополнительныеСвойства.Свойство("РучнаяКорректировка")
			И Источник.ДополнительныеСвойства.РучнаяКорректировка = Истина Тогда

		Источник.Движения.ЖурналПроводокЕПСБУ.Прочитать();

		Возврат;
	КонецЕсли;

	ПравоДоступаЕПСБУИзменение = Неопределено;
	Если НЕ Источник.ДополнительныеСвойства.Свойство("ПравоДоступаЕПСБУИзменение", ПравоДоступаЕПСБУИзменение) Тогда
		ПравоДоступаЕПСБУИзменение = Истина;
	КонецЕсли;
	Если НЕ ПравоДоступаЕПСБУИзменение Тогда
		Если Источник.Движения.Найти("РегистрБухгалтерии.ЖурналПроводокЕПСБУ") <> Неопределено Тогда
			Источник.Движения.ЖурналПроводокЕПСБУ.Прочитать();
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Если Источник.ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	ЭтоБухОперация = Ложь;
	ЭтоСторно = Ложь;
	Если НЕ Источник.ДополнительныеСвойства.ДанныеАвтоПроведения.Свойство("ЭтоБухОперация", ЭтоБухОперация) Тогда
		ЭтоБухОперация = Ложь;
	КонецЕсли;
	Если НЕ Источник.ДополнительныеСвойства.ДанныеАвтоПроведения.Свойство("ЭтоСторно", ЭтоСторно) Тогда
		ЭтоСторно = Ложь;
	КонецЕсли;

	Если ЭтоБухОперация ИЛИ ЭтоСторно Тогда

		Возврат;

	КонецЕсли;

	ОбработкаПроведения(Источник, Отказ, РежимПроведения);
КонецПроцедуры
#КонецОбласти

#Область Прочие

Функция ИндексКартинкиСостояниеПоддержки(СостояниеПоддержки) Экспорт

	Если Не ЗначениеЗаполнено(СостояниеПоддержки) Тогда

		Возврат -1;
	ИначеЕсли СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.НеРедактируется Тогда

		Возврат 0;
	ИначеЕсли СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.РедактируетсяССохранениемПоддержки Тогда

		Возврат 1;
	ИначеЕсли СостояниеПоддержки = Перечисления.СостоянияПоддержкиТиповыхОпераций.РедактируетсяБезСохраненияПоддержки Тогда

		Возврат 2;
	Иначе

		ВызватьИсключение "Неизвестное состояние поддержки";
	КонецЕсли;

КонецФункции

Функция ПрочитатьЗначениеРеквизитаИзУзлаФайла(ФайлОпераций) Экспорт
	
	ТипЗнч = ФайлОпераций.ПолучитьАтрибут("ТипЗнч");
	
	Если ТипЗнч = Неопределено Тогда
		ФайлОпераций.Прочитать();
		Если ФайлОпераций.Имя = "ЗначениеРеквизита" Тогда
			ТипЗнч = ФайлОпераций.ПолучитьАтрибут("ТипЗнч");
		ИначеЕсли ФайлОпераций.Имя = "ОписаниеТипов" Тогда
			ТипЗнч = "ОписаниеТипов";
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
	ФайлОпераций.Прочитать();
	Если ТипЗнч="Строка" Тогда
		ЗначениеРеквизита = ФайлОпераций.Значение;
	ИначеЕсли ТипЗнч="Дата" Тогда
		Если ФайлОпераций.Имя = "dateTime" Тогда
			ЗначениеРеквизита = ПрочитатьXML(ФайлОпераций);
		Иначе
			ЗначениеРеквизита = XMLЗначение(Тип("Дата"), ФайлОпераций.Значение);
		КонецЕсли;
	ИначеЕсли ТипЗнч = "Стандартная дата начала" Тогда
		ЗначениеРеквизита = Новый СтандартнаяДатаНачала(ПрочитатьXML(ФайлОпераций));
	ИначеЕсли ТипЗнч = "Булево" Тогда
		ЗначениеРеквизита = ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповБулево().ПривестиЗначение(ФайлОпераций.Значение);
	ИначеЕсли ТипЗнч = "Число" Тогда
		Если ФайлОпераций.Имя = "decimal" Тогда
			ФайлОпераций.Прочитать();
		КонецЕсли;
		ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
		ЗначениеРеквизита = ОписаниеТиповЧисло.ПривестиЗначение(ФайлОпераций.Значение);
	ИначеЕсли ТипЗнч<>"ОписаниеТипов" Тогда
		Если ФайлОпераций.ТипУзла = ТипУзлаXML.Текст Тогда
			ОписаниеТипа = Новый ОписаниеТипов("Булево");
			ЗначениеРеквизита = ОписаниеТипа.ПривестиЗначение(ФайлОпераций.Значение);
		Иначе
			ЗначениеРеквизита = ПрочитатьXML(ФайлОпераций);
		КонецЕсли;
	Иначе
		ТипЗначения = ПрочитатьXML(ФайлОпераций);
		ПолноеИмя = Метаданные.НайтиПоТипу(ТипЗначения).ПолноеИмя();
		ИмяОбъекта = СтрРазделить(ПолноеИмя, ".")[1];
		ФайлОпераций.Прочитать();
		
		Если Перечисления.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
			ФайлОпераций.Прочитать();
			Если ЗначениеЗаполнено(ФайлОпераций.Значение) Тогда
				ЗначениеРеквизита = Перечисления[ИмяОбъекта][ФайлОпераций.Значение];
			Иначе
				ЗначениеРеквизита = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя).ПустаяСсылка();
			КонецЕсли;
		ИначеЕсли ПланыСчетов.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
			// Со счетами могут быть выгружены сроки действия счетов
			ДатаНачалаДействияИзФайла = ФайлОпераций.ПолучитьАтрибут("ДатаНачалаДействия");
			ДатаОкончанияДействияИзФайла = ФайлОпераций.ПолучитьАтрибут("ДатаОкончанияДействия");
			
			ДатаНачалаДействия = ?(ДатаНачалаДействияИзФайла = Неопределено, Дата(1,1,1), XMLЗначение(Тип("Дата"), ДатаНачалаДействияИзФайла));
			ДатаОкончанияДействия = ?(ДатаОкончанияДействияИзФайла = Неопределено, Дата(1,1,1), XMLЗначение(Тип("Дата"), ДатаОкончанияДействияИзФайла));
			
			ФайлОпераций.Прочитать();
			КодСчета = ФайлОпераций.Значение;
			
			Если ЗначениеЗаполнено(КодСчета) Тогда
			
				ЗначениеРеквизита = ПолучитьСчетПоКодуИПериодуДействия(КодСчета, ДатаНачалаДействия, ДатаОкончанияДействия);
				Если Не ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
					
					Если ЗначениеЗаполнено(ДатаНачалаДействия) ИЛИ ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
						ТекстОшибки = НСтр("ru = 'Не найден счет с кодом %КодСчета% и сроком действия с %ДатаНачалаДействия% по %ДатаОкончанияДействия%.'");
						ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаНачалаДействия%", Формат(ДатаНачалаДействия, "ДЛФ=D"));
						ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ДатаОкончанияДействия%", Формат(ДатаОкончанияДействия, "ДЛФ=D"));
					Иначе
						ТекстОшибки = НСтр("ru = 'Не найден счет с кодом %КодСчета%, с любым сроком действия.'");
					КонецЕсли;
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%КодСчета%", КодСчета);
					
					ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииОбновлениеТО(),
					УровеньЖурналаРегистрации.Предупреждение, Метаданные.ПланыСчетов.ЕПСБУ,,
					ТекстОшибки);
				КонецЕсли;
			Иначе
				ЗначениеРеквизита = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя).ПустаяСсылка();
			КонецЕсли;
		Иначе
			Предопределенный = ?(ФайлОпераций.ПолучитьАтрибут("Предопределенный")="1", Истина, Ложь);
			Код = ФайлОпераций.ПолучитьАтрибут("Код");
			Наименование = ФайлОпераций.ПолучитьАтрибут("Наименование");
			ФайлОпераций.Прочитать();
			
			Если ЗначениеЗаполнено(Код) Или ЗначениеЗаполнено(Наименование) Или ЗначениеЗаполнено(ФайлОпераций.Значение) Тогда
			
				Если Предопределенный Тогда
					ЗначениеРеквизита = ПредопределенноеЗначение(ФайлОпераций.Значение);
				Иначе
					Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
						Если Метаданные.НайтиПоТипу(ТипЗначения).ОсновноеПредставление = 
							Метаданные.СвойстваОбъектов.ОсновноеПредставлениеСправочника.ВВидеКода Тогда
							ЗначениеРеквизита = Справочники[ИмяОбъекта].НайтиПоКоду(Код);
						Иначе
							ЗначениеРеквизита = Справочники[ИмяОбъекта].НайтиПоНаименованию(Наименование);
						КонецЕсли;
					ИначеЕсли ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда
						ЗначениеРеквизита = ПланыВидовХарактеристик[ИмяОбъекта].НайтиПоНаименованию(Наименование);	
					КонецЕслИ;
				КонецЕсли;
			Иначе
				ЗначениеРеквизита = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя).ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	Возврат ЗначениеРеквизита;

КонецФункции

Функция ПолучитьСчетПоКодуИПериодуДействия(КодСчета, Знач ДатаНачалаДействия, ДатаОкончанияДействия)
	
	ИспользоватьОтборПоПериоду = ЗначениеЗаполнено(ДатаНачалаДействия)
		ИЛИ ЗначениеЗаполнено(ДатаОкончанияДействия);
		
	Если ИспользоватьОтборПоПериоду Тогда
		Если НЕ ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
			// ДатаНачалаДействия не должна быть Неопределено
			ДатаНачалаДействия = '00010101';
		КонецЕсли;
	Иначе
		ДатаНачалаДействия = Неопределено;
	КонецЕсли;
	
	Если ДатаНачалаДействия = Неопределено Тогда
		Счет = БухгалтерскийУчет.СчетПоКоду(КодСчета);
	Иначе
		Счет = БухгалтерскиеОперацииПовтИспНаВремяСеанса.СчетПоКодуИНачалуДействия(КодСчета, ДатаНачалаДействия);
	КонецЕсли;
	Возврат Счет;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИсточникДанныхПоТаблицеДокумента(ОписаниеТЧ, НастройкаДополнительныхТабЧастей, ИсточникиДанных,
		ДокументОбъект, ДанныеДополнительныхТабЧастей, ОбщиеДанныеТаблицы)
	
	ИмяТЧ = ОписаниеТЧ.Имя;	
	ТекДопТабЧасть = НастройкаДополнительныхТабЧастей.Получить(ИмяТЧ);
	Префикс = ПрефиксКолонкиИсточникаДанных(ИмяТЧ);
	ТабЧасть = ИсточникиДанных[ИмяТЧ];
	
	ДобавленныеПользователемРеквизиты = Новый Массив;
	ЗаполняемыеКолонки = Новый Массив;

	// Подготовить таблицу документа для переноса. Колонки переименовываются как в таблице источника данных.
	СоставТаблицы = ДокументОбъект[ИмяТЧ].Выгрузить(); // ТаблицаЗначений
	Для каждого РеквизитТЧ Из ОписаниеТЧ.Реквизиты Цикл
		Если РеквизитТЧ.Предопределенный Тогда
			КолонкаТаблицы = СоставТаблицы.Колонки.Найти(РеквизитТЧ.Имя);
			Если КолонкаТаблицы <> Неопределено Тогда
				НовоеИмяКолонки = Префикс + РеквизитТЧ.Имя;
				КолонкаТаблицы.Имя = НовоеИмяКолонки;
				ЗаполняемыеКолонки.Добавить(НовоеИмяКолонки);
			КонецЕсли;
		Иначе
			ДобавленныеПользователемРеквизиты.Добавить(РеквизитТЧ);
		КонецЕсли;
	КонецЦикла;
	ЗаполняемыеКолонкиСтрокой = СтрСоединить(ЗаполняемыеКолонки, ",");
	
	// Перенести таблицу документа в таблицу источника данных.
	// Колонки, добавленные через механизм дополнительных колонок, заполняются дополнительным вложенным циклом.
	Для каждого СтрокаОбъекта Из СоставТаблицы Цикл

		НоваяСтрока = ТабЧасть.Добавить();
		НоваяСтрока.НомерСтроки = СтрокаОбъекта.НомерСтроки;
		НоваяСтрока.ИмяТабличнойЧасти = ИмяТЧ;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОбъекта, ЗаполняемыеКолонкиСтрокой);
		Для каждого РеквизитТЧ Из ДобавленныеПользователемРеквизиты Цикл

			СтрокиДопРеквизитов = ДанныеДополнительныхТабЧастей.НайтиСтроки(
				Новый Структура("ТабличнаяЧасть, НомерСтрокиДокумента, ИмяКолонкиТабличнойЧасти",
					ТекДопТабЧасть.СсылкаТабличнойЧасти, СтрокаОбъекта.НомерСтроки, РеквизитТЧ.Имя));

			Если СтрокиДопРеквизитов.Количество() > 0 Тогда
				НоваяСтрока[Префикс + РеквизитТЧ.Имя] = СтрокиДопРеквизитов[0].Значение;
			КонецЕсли;
		КонецЦикла;

		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбщиеДанныеТаблицы);

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВсеИсточникиДанныхПоТаблицамДокумента(ТабличныеЧасти, НастройкаДополнительныхТабЧастей, ИсточникиДанных,
		ДокументОбъект, ДанныеДополнительныхТабЧастей, ОбщиеДанныеТаблицы)
		
	Для каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		ОписаниеТЧ = ТабличнаяЧасть.Значение;

		Если Не ОписаниеТЧ.Предопределенный Тогда
			Продолжить;
		КонецЕсли;

		ЗаполнитьИсточникДанныхПоТаблицеДокумента(
			ОписаниеТЧ,
			НастройкаДополнительныхТабЧастей,
			ИсточникиДанных,
			ДокументОбъект,
			ДанныеДополнительныхТабЧастей,
			ОбщиеДанныеТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьПараметрыВыбораОтветственногоИсполнителя(ИдентификаторДокумента, Форма)
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЦентрализованнуюБухгалтерию") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель();
	НастройкиЗаполнения = РегистрыСведений.НастройкиВыбораОтветственныхСотрудниковЦБ.НастройкиПоОбъекту(
		ИдентификаторДокумента, ИмяРеквизита);
	Если НастройкиЗаполнения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ИмяЭлемента = БухгалтерскиеОперацииКлиентСервер.ИмяЭлементаФормыДополнительногоРеквизита(Форма, ИмяРеквизита);
	ЭлементФормы = Форма.Элементы.Найти(ИмяЭлемента);
	Если ЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнениеРеквизитовОбъектов.УстановитьПараметрыВыбораСотрудников(ЭлементФормы, НастройкиЗаполнения[0].СпособВыбора);		
КонецПроцедуры

Функция ОтветственныйИсполнительИзФормы(Форма)
	Результат = Новый Структура(БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель());
	ЗаполнитьЗначенияСвойств(Результат, Форма);
	Возврат Результат[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель()];
КонецФункции

#Область ВерсионированиеОбъектов

Функция УИДКолонокДопРеквизитовДляВерсионирования()

	Возврат "32c2d012-f175-4bd7-8619-d555f7067a95";

КонецФункции

// Новый данные типовой операции версионирование.
// 
// Параметры:
//  Операция - СправочникСсылка.ТиповыеОперации
// 
// Возвращаемое значение:
//  Структура - Новый данные типовой операции версионирование:
// * ТиповаяОперация - СправочникСсылка.ТиповыеОперации 
// * ТаблицаЗначенийДопРеквизитов - см. ПустаяТаблицаЗначенияДопРеквизитов 
// * ОтветственныйИсполнитель - СправочникСсылка.Сотрудники - 
Функция НовыйДанныеТиповойОперацииВерсионирование(Операция)
	Результат = Новый Структура;
	Результат.Вставить("ТиповаяОперация", Операция);
	Результат.Вставить("ТаблицаЗначенийДопРеквизитов", ПустаяТаблицаЗначенияДопРеквизитов(Истина));
	Результат.Вставить("ОтветственныйИсполнитель", Справочники.Сотрудники.ПустаяСсылка());
	Возврат Результат;
КонецФункции

Функция НаименованиеРеквизитаВерсииОбъекта_ТиповаяОперация()
	Возврат УИДКолонокДопРеквизитовДляВерсионирования() + "Типовая операция";
КонецФункции

Функция НаименованиеРеквизитаВерсииОбъекта_ОтветственныйИсполнитель()
	Возврат УИДКолонокДопРеквизитовДляВерсионирования() + "_Реквизит_Ответственный исполнитель";
КонецФункции

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

// Процедура вызывается из подписки на событие.
// Процедура формирует таблицу проводок. Если реквизиты операции есть в ДополнительныхСвойствах объекта,
// то для вычисления таблицы проводок используются переданные реквизиты, иначе берутся записанные в регистр значения.
// Процедура устанавливает только таблицу проводок. Остальные реквизиты остаются без изменения, как пришли.
//
Процедура ПередЗаписьюОбъекта(ТекущийОбъект, Отказ, РежимЗаписи, РежимПроведения)

	ПроведениеСервер.УстановитьРежимПроведения(ТекущийОбъект, РежимЗаписи, РежимПроведения);

	ТекущийОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи",     РежимЗаписи);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("РежимПроведения", РежимПроведения);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый",        ТекущийОбъект.ЭтоНовый());

	Если НЕ ТекущийОбъект.ДополнительныеСвойства.Свойство("ЗаписьИзФормыДокумента")
			И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		ТекущийОбъект.ДополнительныеСвойства.Вставить("МеткаВремениПередЗаписью",
													  ОценкаПроизводительности.НачатьЗамерВремени());
	КонецЕсли;
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписатьДатуПроведенияПриЗаписи", Истина);
	Иначе
		// Если документ записан ранее, то дата проведения записывается в регистр до формирования данных проведения.
		ЗаписатьДатуПроведенияДокумента(ТекущийОбъект);
	КонецЕсли;

КонецПроцедуры

// Процедура вызывается из подписки на событие при записи.
// Процедура записывает типовую операцию документа и дополнительные реквизиты операции.
//
Процедура ПриЗаписиОбъекта(ТекущийОбъект, Отказ)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущийОбъект.ДополнительныеСвойства, "ЗаписатьДатуПроведенияПриЗаписи", Ложь) Тогда
		// Если документ новый, то дата проведения записывается в регистр после присвоения ссылки.
		ЗаписатьДатуПроведенияДокумента(ТекущийОбъект);
	КонецЕсли;

	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ДанныеДополнительныхТабЧастей") Тогда
		ЗаписатьДанныеДополнительныхТабЧастей(ТекущийОбъект.Ссылка,
											  ТекущийОбъект.ДополнительныеСвойства.ДанныеДополнительныхТабЧастей);
	КонецЕсли;
	
	Если ТипЗнч(ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.Сторно") Тогда
		ИнициализироватьБухгалтерскиеОперации(ТекущийОбъект);
		Возврат;
	КонецЕсли;

	Если НЕ ПроверитьНеобходимостьДействийПриЗаписиОбъекта(ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;

	ДанныеАвтоПроведения = ТекущийОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения;

	ДанныеДляЗаписи = ЗаполнитьДанныеДляЗаписиОбъекта(ТекущийОбъект);
	Если НЕ ДанныеДляЗаписи.СформироватьПроводки И НЕ ДанныеДляЗаписи.ЗаписатьОперацию Тогда
		Возврат;
	КонецЕсли;

	Если ДанныеДляЗаписи.ПроверитьКонтролируемыеРеквизиты Тогда
		Объект = ТекущийОбъект.Ссылка.ПолучитьОбъект();
		Если НЕ КонтролируемыеРеквизитыНеИзменены(ТекущийОбъект, Объект) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	РеквизитыБухгалтерскойОперации = Новый Структура("Операция, Дата, Организация", ДанныеДляЗаписи.ТиповаяОперация);

	Если ДанныеДляЗаписи.СформироватьПроводки Тогда

		ВычислитьПроводкиПриЗаписиОбъекта(ТекущийОбъект, ДанныеДляЗаписи, РеквизитыБухгалтерскойОперации, Отказ);

		Если Отказ Тогда
			Возврат;
		КонецЕсли;

		ДанныеАвтоПроведения.ТаблицаПроводок = ДанныеДляЗаписи.ТаблицаПроводок;
	ИначеЕсли ДанныеДляЗаписи.ЗаписатьОперацию И ЗначениеЗаполнено(ДанныеДляЗаписи.ТиповаяОперация) Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыБухгалтерскойОперации,
								ПолучитьДатуИОрганизациюОперации(ТекущийОбъект,
																 ДанныеДляЗаписи.ТиповаяОперация),
																 "Дата, Организация");
	ИначеЕсли ЗначениеЗаполнено(ДанныеАвтоПроведения.ТиповаяОперация) Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыБухгалтерскойОперации,
								ПолучитьДатуИОрганизациюОперации(ТекущийОбъект,
																 ДанныеАвтоПроведения.ТиповаяОперация),
																 "Дата, Организация");
	КонецЕсли;

	ДанныеАвтоПроведения.ФормироватьПроводки = ДанныеДляЗаписи.СформироватьПроводки;
	Если ДанныеАвтоПроведения.ФормироватьПроводки Тогда
		Если ДанныеАвтоПроведения.ВызовИзФормы
				И ЗначениеЗаполнено(ДанныеАвтоПроведения.ОтветственныйИсполнитель) Тогда
			ОтветственныйИсполнитель = ДанныеАвтоПроведения.ОтветственныйИсполнитель;
		Иначе
			ОтветственныйИсполнитель = ДанныеДляЗаписи.ОтветственныйИсполнитель;
		КонецЕсли;
		ЗаполнитьОтветственногоИсполнителяДляЗаписи(ДанныеДляЗаписи, ДанныеАвтоПроведения.ИдентификаторДокумента,
			ОтветственныйИсполнитель, РеквизитыБухгалтерскойОперации, Отказ);
		Если ТекущийОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
				И Не ЗначениеЗаполнено(ДанныеДляЗаписи.ОтветственныйИсполнитель) Тогда
			Если ЗапретитьПроведениеБезУказанияОтветственного() Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Не заполнено поле ""Бухгалтер"" в реквизитах типовой операции'"),
					ТекущийОбъект.Ссылка,
					БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель(),
					,
					Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ДанныеДляЗаписи.ОтветственныйИсполнитель = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;

	Если ТипЗнч(ДанныеАвтоПроведения.ТаблицаПроводок) = Тип("ТаблицаЗначений") Тогда
		ДанныеАвтоПроведения.ТаблицаБлокировок = СобратьТаблицуБлокировок(ДанныеАвтоПроведения.ТаблицаПроводок);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеДляЗаписи.ТиповаяОперация) Тогда

		ЗаписатьТиповуюОперациюДокумента(ТекущийОбъект, РеквизитыБухгалтерскойОперации, ДанныеДляЗаписи);

		Если ТипЗнч(ДанныеДляЗаписи.ТаблицаЗначенийДопРеквизитов) = Тип("ТаблицаЗначений") Тогда

			ЗаписатьЗначенияДополнительныхРеквизитовИзТаблицы(ТекущийОбъект.Ссылка,
															  ДанныеДляЗаписи.ТаблицаЗначенийДопРеквизитов);

		ИначеЕсли ТипЗнч(ДанныеДляЗаписи.ДополнительныеРеквизиты) = Тип("Структура") Тогда

			ТекТиповаяОперация = ?(ЗначениеЗаполнено(ДанныеДляЗаписи.ТиповаяОперация),
									ДанныеДляЗаписи.ТиповаяОперация,
									БухгалтерскаяОперацияДокумента(ТекущийОбъект.Ссылка));

			ЗаписатьЗначенияДополнительныхРеквизитовИзСтруктуры(ТекущийОбъект.Ссылка,
																ДанныеДляЗаписи.ДополнительныеРеквизиты,
																ТекТиповаяОперация);

		КонецЕсли;
	Иначе
		РегистрыСведений.ОперацииДокументов.ЗаписатьОперацию(ТекущийОбъект.Ссылка,
			РегистрыСведений.ОперацииДокументов.ДанныеДляЗаписи());
		ЗаписатьПустойНаборДополнительныхРеквизитов(ТекущийОбъект.Ссылка);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьДатуПроведенияДокумента(ТекущийОбъект)
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОтдельнуюДатуПроведенияДокументов") 
		Или Не Метаданные.ОпределяемыеТипы.ДокументыСОтдельнойДатойПроведения.Тип.СодержитТип(ТипЗнч(ТекущийОбъект.Ссылка)) Тогда
			
		Возврат;
	КонецЕсли;
	
	НоваяДатаПроведения = '00010101';
	Если Не ТекущийОбъект.ДополнительныеСвойства.Свойство("ОтдельнаяДатаПроведения", НоваяДатаПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ДатыПроведенияДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ТекущийОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Если Не ЗначениеЗаполнено(НоваяДатаПроведения) Тогда
			Возврат;
		КонецЕсли;
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Документ = ТекущийОбъект.Ссылка;
		НоваяЗапись.ДатаПроведения = НоваяДатаПроведения;
		НаборЗаписей.Записать(РежимЗамещения.Добавление);
	Иначе
		Запись = НаборЗаписей[0];
		СохраненнаяДатаПроведения = Запись.ДатаПроведения;
		Если НоваяДатаПроведения = СохраненнаяДатаПроведения Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяДатаПроведения) Тогда
			Запись.ДатаПроведения = НоваяДатаПроведения;
			НаборЗаписей.Записать(РежимЗамещения.Обновление);
		Иначе
			НаборЗаписей.Записать(РежимЗамещения.Удаление);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция ЗапретитьПроведениеБезУказанияОтветственного()
	Возврат Ложь;
КонецФункции

// Заполнить ответственного исполнителя для записи.
// 
// Параметры:
//  ДанныеДляЗаписи - см. НовыйДанныеДляЗаписи
//  ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных
//  ОтветственныйИсполнитель - СправочникСсылка.Сотрудники
//  РеквизитыБухгалтерскойОперации - Структура -
//                                 - ДанныеФормыСтруктура:
//   * Организация - СправочникСсылка.Организации
//   * Дата - Дата
//  Отказ - Булево
Процедура ЗаполнитьОтветственногоИсполнителяДляЗаписи(ДанныеДляЗаписи, ИдентификаторДокумента, ОтветственныйИсполнитель, РеквизитыБухгалтерскойОперации, Отказ) Экспорт
	
	// Указанный в документе "бухгалтер" не изменяется
	Если ЗначениеЗаполнено(ОтветственныйИсполнитель) Тогда
		ДанныеДляЗаписи.ОтветственныйИсполнитель = ОтветственныйИсполнитель;
		Возврат;
	КонецЕсли;
	
	// Получить допустимых ответственных
	ТекущийПользователь = Пользователи.АвторизованныйПользователь(); // СправочникСсылка.Пользователи
	СлужебныйПользователь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "Служебный");
	Если СлужебныйПользователь Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДляЗаписи.ОтветственныйИсполнитель = ОтветственныйИсполнительДляДокумента(ИдентификаторДокумента,
		ОтветственныйИсполнитель, РеквизитыБухгалтерскойОперации.Организация, РеквизитыБухгалтерскойОперации.Дата);
	
КонецПроцедуры

Функция ОтветственныйИсполнительДляДокумента(ИдентификаторДокумента, ОтветственныйИсполнитель, Организация, Дата) Экспорт
	// Получить допустимых ответственных
	ТекущийПользователь = Пользователи.АвторизованныйПользователь(); // СправочникСсылка.Пользователи
	
	ДопустимыеСотрудники = ДопустимыеОтветственныеДляДокумента(ИдентификаторДокумента, Организация);
	Если ДопустимыеСотрудники.Количество() = 1 Тогда
		// Можно без анализа устанавливать нового сотрудника
		Возврат ДопустимыеСотрудники[0];
	КонецЕсли;
	
	СотрудникИзНастройкиПользователя = РегистрыСведений.ОтветственныеИсполнителиПользователей.Ответственный(
		ТекущийПользователь, Организация, Дата);
	Если ЗначениеЗаполнено(СотрудникИзНастройкиПользователя) Тогда
		Возврат СотрудникИзНастройкиПользователя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтветственныйИсполнитель) Тогда
		Если ДопустимыеСотрудники.Найти(ОтветственныйИсполнитель) <> Неопределено Тогда
			Возврат ОтветственныйИсполнитель;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Сотрудники.ПустаяСсылка();
	
КонецФункции

// Допустимые ответственные для документа.
// 
// Параметры:
//  ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных, СправочникСсылка.ИдентификаторыОбъектовРасширений - Идентификатор документа
//  Организация - СправочникСсылка.Организации - Организация
//  СпособВыбора - ПеречислениеСсылка.СпособВыбораОтветственногоЦБ, Неопределено - возвращаемый параметр.
// 
// Возвращаемое значение:
//  Массив из СправочникСсылка.Сотрудники - Допустимые ответственные для документа
Функция ДопустимыеОтветственныеДляДокумента(ИдентификаторДокумента, Организация, СпособВыбора = Неопределено) Экспорт
	ТекущийПользователь = Пользователи.АвторизованныйПользователь(); // СправочникСсылка.Пользователи
	
	ОрганизацииДляПроверки = Неопределено;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЦентрализованнуюБухгалтерию") Тогда
		НастройкиЦБ = РегистрыСведений.НастройкиВыбораОтветственныхСотрудниковЦБ.НастройкиПоОбъекту(
			ИдентификаторДокумента, БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель());
		Если НастройкиЦБ.Количество() > 0 Тогда
			СпособВыбора = НастройкиЦБ[0].СпособВыбора;
			Если СпособВыбора = Перечисления.СпособВыбораОтветственногоЦБ.ИзСотрудниковУчрежденияИЦБ Тогда
				ОрганизацииДляПроверки = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Организация);
				ОрганизацииДляПроверки.Добавить(Константы.ОрганизацияЦентрализованнаяБухгалтерия.Получить());
			ИначеЕсли СпособВыбора = Перечисления.СпособВыбораОтветственногоЦБ.ИзСотрудниковЦБ Тогда
				ОрганизацииДляПроверки = Константы.ОрганизацияЦентрализованнаяБухгалтерия.Получить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ОрганизацииДляПроверки = Неопределено Тогда
		ОрганизацииДляПроверки = Организация;
	КонецЕсли;
	
	ДопустимыеСотрудники = ОбщегоНазначенияБГУ.СотрудникиПоПользователю(ТекущийПользователь, ОрганизацииДляПроверки);
	Возврат ДопустимыеСотрудники;
	
КонецФункции

Функция ПроверитьНеобходимостьДействийПриЗаписиОбъекта(ТекущийОбъект)
	
	Если НЕ ДокументПроводитсяПоРегиструБухгалтерии(ТекущийОбъект)
		ИЛИ НЕ ТекущийОбъект.ДополнительныеСвойства.ПравоДоступаЕПСБУИзменение Тогда
		Возврат Ложь;
	КонецЕсли;

	ИнициализироватьБухгалтерскиеОперации(ТекущийОбъект);

	ДанныеАвтоПроведения = ТекущийОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения;

	Если ТипЗнч(ДанныеАвтоПроведения.ТиповаяОперация) = Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	ТиповаяОперация = ДанныеАвтоПроведения.ТиповаяОперация;

	УстановитьПривилегированныйРежим(Истина);

	Если ЗначениеЗаполнено(ТиповаяОперация)
			И НЕ ОбщегоНазначения.СсылкаСуществует(ТиповаяОперация) Тогда
		ТекстОшибки = НСтр("ru = 'В документе %Документ% выбрана не существующая типовая операция'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", Строка(ТекущийОбъект.Ссылка));
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

Функция НовыйДанныеДляЗаписи()
	ДанныеДляЗаписи = Новый Структура;
	ДанныеДляЗаписи.Вставить("ТиповаяОперация");
	ДанныеДляЗаписи.Вставить("ДополнительныеРеквизиты");
	ДанныеДляЗаписи.Вставить("ТаблицаЗначенийДопРеквизитов");
	ДанныеДляЗаписи.Вставить("ЗаписатьОперацию");
	ДанныеДляЗаписи.Вставить("СформироватьПроводки");
	ДанныеДляЗаписи.Вставить("ПроверитьКонтролируемыеРеквизиты");
	ДанныеДляЗаписи.Вставить("ТаблицаПроводок");
	ДанныеДляЗаписи.Вставить("ОтветственныйИсполнитель");	
	Возврат ДанныеДляЗаписи;
КонецФункции

Функция ЗаполнитьДанныеДляЗаписиОбъекта(ТекущийОбъект)
	
	ДанныеДляЗаписи = НовыйДанныеДляЗаписи();
	
	ДанныеАвтоПроведения = ТекущийОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения;
	ДанныеДляЗаписи.ТиповаяОперация = ДанныеАвтоПроведения.ТиповаяОперация;
	
	Если НЕ ДанныеАвтоПроведения.ВызовИзФормы И НЕ ДанныеАвтоПроведения.ПрограммноеСоздание Тогда
		СформироватьСтруктуруДопРеквизитовИзБазы(ТекущийОбъект,
			ДанныеДляЗаписи.ТиповаяОперация,
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			ДанныеДляЗаписи.ТаблицаЗначенийДопРеквизитов, Истина);
		Если ТипЗнч(ДанныеДляЗаписи.ДополнительныеРеквизиты) = Тип("Структура")
				И ДанныеДляЗаписи.ДополнительныеРеквизиты.Свойство("ОтветственныйИсполнитель") Тогда
			ДанныеДляЗаписи.ОтветственныйИсполнитель = ДанныеДляЗаписи.ДополнительныеРеквизиты.ОтветственныйИсполнитель;
			ДанныеДляЗаписи.ДополнительныеРеквизиты.Удалить("ОтветственныйИсполнитель");
		КонецЕсли; 
	Иначе
		ДанныеДляЗаписи.ДополнительныеРеквизиты      = ДанныеАвтоПроведения.ДополнительныеРеквизиты;
		ДанныеДляЗаписи.ТаблицаЗначенийДопРеквизитов = ДанныеАвтоПроведения.ТаблицаЗначенийДопРеквизитов;
		ДанныеДляЗаписи.ОтветственныйИсполнитель = ДанныеАвтоПроведения.ОтветственныйИсполнитель;
	КонецЕсли;

	РежимЗаписиПроведение = ТекущийОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение;
	РежимЗаписиЗапись = ТекущийОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись;

	ФормированиеПроводокОбособленноОтДокумента = ДанныеАвтоПроведения.ФормированиеПроводокОбособленноОтДокумента;

	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ТекущийОбъект));
	ЭтоДокументПроводкиВсегдаОдновременно = ПроводкиФормируютсяВсегдаОдновременно(ИдентификаторДокумента);

	Если ЭтоДокументПроводкиВсегдаОдновременно Тогда
		ДанныеДляЗаписи.ЗаписатьОперацию = Истина;
		ДанныеДляЗаписи.СформироватьПроводки = РежимЗаписиПроведение;
	ИначеЕсли ФормированиеПроводокОбособленноОтДокумента Тогда
	// проводки формируются только если режим записи - "Проведение" и существуют проводки
		ДанныеДляЗаписи.СформироватьПроводки = РежимЗаписиПроведение И ТекущийОбъект.Проведен
			И ЕстьПроводкиДокумента(ТекущийОбъект.Ссылка);
		ДанныеДляЗаписи.ЗаписатьОперацию = ДанныеАвтоПроведения.ПрограммноеСоздание;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеДляЗаписи.ТиповаяОперация) Тогда
		ДанныеДляЗаписи.СформироватьПроводки = Ложь;
		ДанныеДляЗаписи.ЗаписатьОперацию = Истина;
	ИначеЕсли ТекущийОбъект.ДополнительныеСвойства.ПравоДоступаЕПСБУИзменение Тогда
		ДанныеДляЗаписи.СформироватьПроводки = РежимЗаписиПроведение;
		ДанныеДляЗаписи.ЗаписатьОперацию = РежимЗаписиПроведение ИЛИ РежимЗаписиЗапись;
	Иначе
		ДанныеДляЗаписи.СформироватьПроводки = Ложь;
		ДанныеДляЗаписи.ЗаписатьОперацию = РежимЗаписиЗапись И ЗначениеЗаполнено(ДанныеДляЗаписи.ТиповаяОперация);
	КонецЕсли;

	Если ДанныеДляЗаписи.ЗаписатьОперацию Тогда
		ДанныеДляЗаписи.ТиповаяОперация = ?(ЗначениеЗаполнено(ДанныеДляЗаписи.ТиповаяОперация) ИЛИ ДанныеАвтоПроведения.ВызовИзФормы,
							ДанныеДляЗаписи.ТиповаяОперация,
							БухгалтерскаяОперацияДокумента(ТекущийОбъект.Ссылка));
	КонецЕсли;

	ДанныеДляЗаписи.СформироватьПроводки = ДанныеДляЗаписи.СформироватьПроводки
		ИЛИ (ДанныеАвтоПроведения.ПрограммноеСоздание
		И ДанныеАвтоПроведения.ФормироватьПроводки И РежимЗаписиПроведение);

	ДанныеДляЗаписи.ПроверитьКонтролируемыеРеквизиты = (ДанныеДляЗаписи.СформироватьПроводки
		ИЛИ (ДанныеАвтоПроведения.ПрограммноеСоздание
		И ДанныеАвтоПроведения.ФормироватьПроводки))
		И ФормированиеПроводокОбособленноОтДокумента
		И ДанныеДляЗаписи.СформироватьПроводки
		И НЕ ЭтоДокументПроводкиВсегдаОдновременно;
		
	Возврат ДанныеДляЗаписи;
	
КонецФункции

Процедура ВычислитьПроводкиПриЗаписиОбъекта(ТекущийОбъект, ДанныеДляЗаписи, РеквизитыБухгалтерскойОперации, Отказ)
	
	ФормированиеПроводок = Обработки.ФормированиеБухгалтерскихПроводок.Создать();
	// если в документе есть реквизит Курс и Кратность, то берем значения именно этих реквизитов
	Если ТекущийОбъект.Метаданные().Реквизиты.Найти("Курс") <> Неопределено Тогда
		ФормированиеПроводок.ЕстьКурсКратностьВДокументе = Истина;
		ФормированиеПроводок.Курс = ТекущийОбъект.Курс;
		ФормированиеПроводок.Кратность = ТекущийОбъект.Кратность;
	КонецЕсли;

	Попытка

		ПредставлениеДокумента = Строка(ТекущийОбъект.Ссылка);

		ПараметрыАвтоФормированияПроводок = ФормированиеПроводок.ПараметрыАвтоФормированияПроводок();
		ПараметрыАвтоФормированияПроводок.ДопРеквизиты = ДанныеДляЗаписи.ДополнительныеРеквизиты;
		ПараметрыАвтоФормированияПроводок.ТекущийОбъект = ТекущийОбъект;
		ПараметрыАвтоФормированияПроводок.ТаблицаПроводок = Неопределено;

		ФормированиеПроводок.ДокументОснование = ТекущийОбъект.Ссылка;
		ФормированиеПроводок.ТиповаяОперация = ДанныеДляЗаписи.ТиповаяОперация;
		ФормированиеПроводок.ИсправлениеОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"ИсправлениеОшибки",
			Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.НеОшибка);
		ФормированиеПроводок.ВыявительОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"ВыявительОшибки",
			Перечисления.ВыявительОшибокПрошлыхЛет.ПустаяСсылка());
		ФормированиеПроводок.ПричинаОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"ПричинаОшибки",
			Справочники.ПричиныОшибокПрошлыхЛет.ПустаяСсылка());
		ФормированиеПроводок.АвтоФормированиеПроводок(ПараметрыАвтоФормированияПроводок, Отказ);

		ДанныеДляЗаписи.ТаблицаПроводок = ПараметрыАвтоФормированияПроводок.ТаблицаПроводок;

		ЗаполнитьЗначенияСвойств(РеквизитыБухгалтерскойОперации, ФормированиеПроводок, "Дата, Организация");

	Исключение

		ИнфоОшибки = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Данные.Изменение'",
								 ОбщегоНазначения.КодОсновногоЯзыка()),
								 УровеньЖурналаРегистрации.Ошибка,
								 ТекущийОбъект.Метаданные(),
								 ТекущийОбъект.Ссылка,
								 ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОшибки));
		ТекстОшибки = СтрШаблон(НСтр("ru = 'При проведении документа %1 возникла ошибка:
											|%2
											|Подробная информация записана в журнал регистрации.'"),
								ПредставлениеДокумента,
								ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнфоОшибки));
		ВызватьИсключение ТекстОшибки

	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьЗначенияДополнительныхРеквизитовИзСтруктуры(Документ,
		ДополнительныеРеквизиты, ТиповаяОперация)
	ДополнительныеРеквизитыНабор = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
	ДополнительныеРеквизитыНабор.Отбор.Объект.Установить(Документ);

	ТекТиповаяОперацияДополнительныеРеквизиты = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация);

	Для каждого ТекРеквизит Из ТекТиповаяОперацияДополнительныеРеквизиты Цикл

		ЗначениеТекДопРеквизита = Неопределено;
		Если ДополнительныеРеквизиты.Свойство(ТекРеквизит.ИмяДляФормулы, ЗначениеТекДопРеквизита) Тогда
			НовРеквизит = ДополнительныеРеквизитыНабор.Добавить();
			НовРеквизит.Объект = Документ;
			НовРеквизит.Значение = ЗначениеТекДопРеквизита;
			НовРеквизит.РеквизитОперации = ТекРеквизит.Ссылка;
		КонецЕсли;

	КонецЦикла;

	ДополнительныеРеквизитыНабор.Записать(Истина);
КонецПроцедуры

Процедура ЗаписатьЗначенияДополнительныхРеквизитовИзТаблицы(Документ,
		ЗначенияРеквизитовОперации)
	ЗначенияРеквизитовОперации.ЗаполнитьЗначения(Документ, "Объект");
	ДополнительныеРеквизитыНабор = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
	ДополнительныеРеквизитыНабор.Отбор.Объект.Установить(Документ);
	ДополнительныеРеквизитыНабор.Загрузить(ЗначенияРеквизитовОперации);
	ДополнительныеРеквизитыНабор.Записать(Истина);
КонецПроцедуры

Процедура ЗаписатьПустойНаборДополнительныхРеквизитов(Документ)
	ДополнительныеРеквизитыНабор = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
	ДополнительныеРеквизитыНабор.Отбор.Объект.Установить(Документ);
	ДополнительныеРеквизитыНабор.Записать(Истина);
КонецПроцедуры

Процедура ЗаписатьТиповуюОперациюДокумента(ТекущийОбъект, РеквизитыБухгалтерскойОперации, ДанныеДляЗаписи)

	Если ТипЗнч(ДанныеДляЗаписи.ТаблицаПроводок) = Тип("ТаблицаЗначений") Тогда
		ПроводкиДляСуммирования = ДанныеДляЗаписи.ТаблицаПроводок;
	ИначеЕсли ТекущийОбъект.Проведен
		И ТекущийОбъект.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			
		ПроводкиДляСуммирования = ТекущийОбъект.Движения.ЖурналПроводокЕПСБУ;
		ПроводкиДляСуммирования.Прочитать();
	Иначе
		ПроводкиДляСуммирования = Неопределено;
	КонецЕсли;

	Если ПроводкиДляСуммирования = Неопределено Тогда
		// При проведении из регистра бухгалтерии будет запись нужного значения
		ЕстьПроводки  = Ложь;
		СуммаОперации = 0;
	Иначе
		СуммаОперации = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СуммаПроводокПоНастройкамПоУмолчанию(ПроводкиДляСуммирования);
		ЕстьПроводки  = ПроводкиДляСуммирования.Количество() > 0;
	КонецЕсли;
	
	БухгалтерскаяОперация = РегистрыСведений.ОперацииДокументов.ДанныеДляЗаписи(ТекущийОбъект.Ссылка);
	
	БухгалтерскаяОперация.Операция      = РеквизитыБухгалтерскойОперации.Операция;
	БухгалтерскаяОперация.Дата          = РеквизитыБухгалтерскойОперации.Дата;
	БухгалтерскаяОперация.Организация   = РеквизитыБухгалтерскойОперации.Организация;
	БухгалтерскаяОперация.СуммаОперации = СуммаОперации;
	БухгалтерскаяОперация.ЕстьПроводки  = ЕстьПроводки;
	БухгалтерскаяОперация.ОтветственныйИсполнитель = ДанныеДляЗаписи.ОтветственныйИсполнитель;
	
	Если ТипЗнч(ДанныеДляЗаписи.ДополнительныеРеквизиты) = Тип("Структура") Тогда
		БухгалтерскаяОперация.Курс = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"Курс",
			1);
		БухгалтерскаяОперация.Кратность = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"Кратность",
			1);
		БухгалтерскаяОперация.ИсправлениеОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"ИсправлениеОшибки",
			Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.НеОшибка);
		БухгалтерскаяОперация.ВыявительОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"ВыявительОшибки",
			Перечисления.ВыявительОшибокПрошлыхЛет.ПустаяСсылка());
		БухгалтерскаяОперация.ПричинаОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
			ДанныеДляЗаписи.ДополнительныеРеквизиты,
			"ПричинаОшибки",
			Справочники.ПричиныОшибокПрошлыхЛет.ПустаяСсылка());
	КонецЕсли;
 
 	РегистрыСведений.ОперацииДокументов.ЗаписатьОперацию(ТекущийОбъект.Ссылка, БухгалтерскаяОперация);
	
КонецПроцедуры

Процедура ЗаписатьДанныеДополнительныхТабЧастей(Документ,
		ДанныеДополнительныхТабЧастей)
	НаборЗаписей = РегистрыСведений.ЗначенияКолонокДополнительныхТабличныхЧастей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Документ);
	Для каждого ТекДвижение Из ДанныеДополнительныхТабЧастей Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекДвижение);
		НоваяЗапись.Объект = Документ;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

// Процедура вызывается из подписки на событие.
// Процедура записывает таблицу проводок.
//
Процедура ОбработкаПроведения(ТекущийОбъект, Отказ, РежимПроведения)

	Если Не ДокументПроводитсяПоРегиструБухгалтерии(ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;

	ИнициализироватьБухгалтерскиеОперации(ТекущийОбъект);

	Если ТипЗнч(ТекущийОбъект.Ссылка) = Тип("ДокументСсылка.ОперацияБух") Тогда
		Возврат;
	КонецЕсли;

	ФормироватьПроводки       = ТекущийОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения.ФормироватьПроводки;
	ТаблицаПроводок           = ТекущийОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения.ТаблицаПроводок;
	ДолжнаБытьТаблицаПроводок = ФормироватьПроводки
		И ТекущийОбъект.ДополнительныеСвойства.ДанныеАвтоПроведения.ФормированиеПроводокОбособленноОтДокумента;

	Если ТаблицаПроводок = Неопределено И ДолжнаБытьТаблицаПроводок Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru='Проводки не сформированы. Проверьте заполнение документа, типовой операции и доп. реквизитов'"),
			,
			"ТиповаяОперация",
			,
			Отказ);
	ИначеЕсли ТаблицаПроводок = Неопределено И НЕ ФормироватьПроводки Тогда
		// Очистить проводки
		ТаблицаПроводок = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	КонецЕсли;

	Если НЕ Отказ И ТипЗнч(ТаблицаПроводок) = Тип("ТаблицаЗначений") Тогда

		ЗагрузитьПроводкиДокумента(ТекущийОбъект, ТаблицаПроводок, Отказ);

	КонецЕсли;

	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("МеткаВремениПередЗаписью") Тогда
		ОценкаПроизводительности.ЗакончитьЗамерВремени(
			ОбщегоНазначенияБГУКлиентСервер.ИмяКлючевойОперации(ТекущийОбъект.Ссылка, "Проведение"),
			ТекущийОбъект.ДополнительныеСвойства.МеткаВремениПередЗаписью,
			,
			СтрШаблон(НСтр("ru = 'Неинтерактивное проведение;%1'"), ПараметрыСеанса.КомментарийЗамераВремени),
			Отказ);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокументов

Функция НовыйДанныеАвтопроведения()
	ДанныеАвтоПроведения = Новый Структура;
	ДанныеАвтоПроведения.Вставить("ВызовИзФормы", Ложь);
	ДанныеАвтоПроведения.Вставить("ТиповаяОперация"); 
	ДанныеАвтоПроведения.Вставить("ДополнительныеРеквизиты"); 
	ДанныеАвтоПроведения.Вставить("ТаблицаЗначенийДопРеквизитов");
	ДанныеАвтоПроведения.Вставить("ТаблицаПроводок");
	ДанныеАвтоПроведения.Вставить("ФормированиеПроводокОбособленноОтДокумента",
		ПолучитьФункциональнуюОпцию("ФормированиеПроводокОбособленноОтДокумента"));
	ДанныеАвтоПроведения.Вставить("ТаблицаБлокировок");
	ДанныеАвтоПроведения.Вставить("ФормироватьПроводки", Ложь);
	ДанныеАвтоПроведения.Вставить("ЭтоСторно", Ложь);
	ДанныеАвтоПроведения.Вставить("ЭтоБухоперация", Ложь);
	ДанныеАвтоПроведения.Вставить("ПрограммноеСоздание", Ложь);
	ДанныеАвтоПроведения.Вставить("ОтветственныйИсполнитель");
	ДанныеАвтоПроведения.Вставить("ИдентификаторДокумента");
	Возврат ДанныеАвтоПроведения;
	
КонецФункции

// Создает структуру для передачи параметров из события ПередЗаписью в событие ПриЗаписи.
// Структура добавляется в Объект.ДополнительныеСвойства.
// 
// Параметры:
// Объект - ДокументОбъект - документ.
//
Процедура ИнициализироватьБухгалтерскиеОперации(Объект) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("ДанныеАвтоПроведения") Тогда
		Возврат;
	КонецЕсли;
	ТипОбъекта = ТипЗнч(Объект);

	ДанныеАвтоПроведения = НовыйДанныеАвтопроведения();
	ДанныеАвтоПроведения.ЭтоСторно = ТипОбъекта = Тип("ДокументОбъект.Сторно");
	ДанныеАвтоПроведения.ЭтоБухОперация = ТипОбъекта = Тип("ДокументОбъект.ОперацияБух");
	ДанныеАвтоПроведения.ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипОбъекта);

	Объект.ДополнительныеСвойства.Вставить("ДанныеАвтоПроведения", ДанныеАвтоПроведения);

КонецПроцедуры

// Возвращает структуру параметров для процедуры ЗаписатьТиповуюОперациюИДопРеквизиты
// 
// Возвращаемое значение:
//  Структура - Записать типовую операцию и доп реквизиты параметры:
// * Документ - ДокументСсылка
//            - Неопределено 
// * Операция - СправочникСсылка.ТиповыеОперации 
// * Организация - СправочникСсылка.Организации
// * Дата - Дата
//        - Неопределено
// * ДополнительныеРеквизиты - Структура
//                           - Неопределено 
// * РучнаяКорректировка - Булево -
// * ИсправлениеОшибки - ПеречислениеСсылка.ПорядокИсправленияОшибокПрошлыхЛет -
// * ВыявительОшибки - ПеречислениеСсылка.ВыявительОшибокПрошлыхЛет -
// * ПричинаОшибки - СправочникСсылка.ПричиныОшибокПрошлыхЛет -
// * НеЗаписыватьДополнительныеРеквизиты - Булево -
// * ОтветственныйИсполнитель - СправочникСсылка.Сотрудники
Функция ЗаписатьТиповуюОперациюИДопРеквизиты_Параметры() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Документ", Неопределено);
	Результат.Вставить("Операция", Справочники.ТиповыеОперации.ПустаяСсылка());
	Результат.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Дата", Неопределено);
	Результат.Вставить("ДополнительныеРеквизиты", Неопределено);
	Результат.Вставить("РучнаяКорректировка", Ложь);
	Результат.Вставить("ИсправлениеОшибки", Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.НеОшибка);
	Результат.Вставить("ВыявительОшибки", Перечисления.ВыявительОшибокПрошлыхЛет.ПустаяСсылка());
	Результат.Вставить("ПричинаОшибки", Справочники.ПричиныОшибокПрошлыхЛет.ПустаяСсылка());
	Результат.Вставить("НеЗаписыватьДополнительныеРеквизиты", Ложь);
	Результат.Вставить("ОтветственныйИсполнитель", Справочники.Сотрудники.ПустаяСсылка());

	Возврат Результат;

КонецФункции

// Процедура записывает типовую операцию с доп. реквизитами
//
// Параметры:
//	ПараметрыЗаписи - см. БухгалтерскиеОперацииСервер.ЗаписатьТиповуюОперациюИДопРеквизиты_Параметры
//	Отказ	- Булево - признак ошибки при записи типовой операции или доп. реквизитов
//
Процедура ЗаписатьТиповуюОперациюИДопРеквизиты(ПараметрыЗаписи, Отказ) Экспорт

	Документ = ПараметрыЗаписи.Документ;
	Операция = ПараметрыЗаписи.Операция;
	Организация = ПараметрыЗаписи.Организация;
	Дата = ПараметрыЗаписи.Дата;
	ДополнительныеРеквизиты = ПараметрыЗаписи.ДополнительныеРеквизиты;
	РучнаяКорректировка = ПараметрыЗаписи.РучнаяКорректировка;
	ИсправлениеОшибки = ПараметрыЗаписи.ИсправлениеОшибки;
	ВыявительОшибки = ПараметрыЗаписи.ВыявительОшибки;
	ПричинаОшибки = ПараметрыЗаписи.ПричинаОшибки;
	ЗаписыватьДополнительныеРеквизиты = НЕ ПараметрыЗаписи.НеЗаписыватьДополнительныеРеквизиты;
	
	ПредставлениеДокумента = Строка(Документ);

	ДанныеОперации = РегистрыСведений.ОперацииДокументов.ДанныеДляЗаписи();
	ДанныеОперации.Документ            = Документ;
	ДанныеОперации.Операция            = Операция;
	ДанныеОперации.Организация         = Организация;
	ДанныеОперации.Дата                = Дата;
	ДанныеОперации.РучнаяКорректировка = РучнаяКорректировка;
	ДанныеОперации.ИсправлениеОшибки   = ИсправлениеОшибки;
	ДанныеОперации.ВыявительОшибки     = ВыявительОшибки;
	ДанныеОперации.ПричинаОшибки       = ПричинаОшибки;
	ДанныеОперации.ОтветственныйИсполнитель = ПараметрыЗаписи.ОтветственныйИсполнитель;
	Если ДополнительныеРеквизиты.Свойство("Курс") Тогда
		ДанныеОперации.Курс            = ДополнительныеРеквизиты.Курс;
		ДанныеОперации.Кратность       = ДополнительныеРеквизиты.Кратность;
	КонецЕсли;
	Если ДополнительныеРеквизиты.Свойство("СуммаОперации") Тогда
		ДанныеОперации.СуммаОперации   = ДополнительныеРеквизиты.СуммаОперации;
	КонецЕсли;

	Если ЗаписыватьДополнительныеРеквизиты Тогда
		ЗначенияДопРеквизитов = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей();
		ЗначенияДопРеквизитов.Отбор.Объект.Установить(Документ);

		ДополнительныеРеквизитыОперации = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(Операция, , "Наименование");

		Для каждого ТекРеквизит Из ДополнительныеРеквизитыОперации Цикл
			Если ДополнительныеРеквизиты.Свойство(ТекРеквизит.ИмяДляФормулы) Тогда
				ЗначениеДопРеквизита = ЗначенияДопРеквизитов.Добавить();
				ЗначениеДопРеквизита.Объект = Документ;
				ЗначениеДопРеквизита.РеквизитОперации = ТекРеквизит.Ссылка;
				ЗначениеДопРеквизита.Значение = ДополнительныеРеквизиты[ТекРеквизит.ИмяДляФормулы];
			КонецЕсли;
		КонецЦикла;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьВерсионированиеОбъектов") Тогда
			ДанныеТиповойОперацииВерсионирование = НовыйДанныеТиповойОперацииВерсионирование(Операция);
			ДанныеТиповойОперацииВерсионирование.ОтветственныйИсполнитель = ДанныеОперации.ОтветственныйИсполнитель;

			Для каждого ТекРеквизит Из ДополнительныеРеквизитыОперации Цикл
				Если ДополнительныеРеквизиты.Свойство(ТекРеквизит.ИмяДляФормулы) Тогда

					НоваяСтрокаДанных = ДанныеТиповойОперацииВерсионирование.ТаблицаЗначенийДопРеквизитов.Добавить();
					НоваяСтрокаДанных.Объект = Документ;
					НоваяСтрокаДанных.РеквизитОперации = ТекРеквизит.Ссылка;
					НоваяСтрокаДанных.Значение = ДополнительныеРеквизиты[ТекРеквизит.ИмяДляФормулы];
					НоваяСтрокаДанных.НаименованиеРеквизита = ТекРеквизит.Наименование;

				КонецЕсли;
			КонецЦикла;
			ДокументОбъект = Документ.ПолучитьОбъект();
			ДокументОбъект.ДополнительныеСвойства.Вставить("ДанныеТиповойОперации", ДанныеТиповойОперацииВерсионирование);
			ВерсионированиеОбъектов.ЗаписатьВерсиюОбъекта(ДокументОбъект, РежимЗаписиДокумента.Проведение);
		КонецЕсли;

	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();

	Попытка

		РегистрыСведений.ОперацииДокументов.ЗаписатьОперацию(Документ, ДанныеОперации);
		Если ЗаписыватьДополнительныеРеквизиты Тогда
			ЗначенияДопРеквизитов.Записать(Истина);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();

	Исключение
		
		ОтменитьТранзакцию();
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ТекстОшибки = НСтр("ru = 'Не удалось записать типовую операцию и дополнительные реквизиты документа %Документ% по причине:
								|%ОписаниеОшибки%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ПредставлениеДокумента);
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииФормированиеПроводокПроведение(),
			УровеньЖурналаРегистрации.Ошибка,
			Документ.Метаданные(),
			Документ,
			ТекстОшибки);
			
		ВызватьИсключение;

	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ЗагрузитьПроводкиДокумента(Документ, ТаблицаПроводок, Отказ) Экспорт

	Если Не ДокументПроводитсяПоРегиструБухгалтерии(Документ) Тогда
		ТекстСообщения = НСтр("ru='Документ не проводится по регистру бухгалтерии.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;

	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Документ)) Тогда
		Движения = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Установить(Документ);
		Движения.Загрузить(ТаблицаПроводок);
		ЗаполнитьОрганизациюИФОВПроводках(Движения, Документ);
		Движения.ДополнительныеСвойства.Вставить("ТаблицаОшибок");
		
		//  При проведении устанавливается привелигированный режим, поэтому
		// определить имеет ли пользователь право измеения регистра Рабочие счета
		// надо заранее
		//
		Движения.ДополнительныеСвойства.Вставить("ЕстьПравоИзмененияРабочихСчетов", ПравоДоступа("Изменение", Метаданные.РегистрыСведений.РабочиеСчета));
		
		Попытка
			Движения.Записать(Истина);
		Исключение
			ТаблицаОшибок = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Движения.ДополнительныеСвойства, "ТаблицаОшибок");
			
			Если ТаблицаОшибок <> Неопределено Тогда
				СообщитьОбОшибкахПроведения(ТаблицаОшибок, Отказ);
			Иначе
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);
			КонецЕсли;
		КонецПопытки;
	Иначе
		Движения = Документ.Движения.ЖурналПроводокЕПСБУ;
		ЗаполнитьПредставлениеОперации(Документ.ДополнительныеСвойства);
		Попытка
			Движения.Записывать = Истина;
			Движения.Загрузить(ТаблицаПроводок);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииФормированиеПроводокПроведение(), УровеньЖурналаРегистрации.Ошибка,
				Документ.Метаданные(), Документ.Ссылка, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// Проверяет, что документ может делать проводки по регистру бухгалтерии.
// 
// Параметры:
// 	Документ - ДокументОбъект, ДокументСсылка - проверяемый документ
// Возвращаемое значение:
// 	Булево - Истина, если в коллекции движений есть РБ.ЖурналПроводокЕПСБУ, Ложь - если нет.
//
Функция ДокументПроводитсяПоРегиструБухгалтерии(Документ)
	
	ЭтоСсылка = Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Документ)); 

	Если ЭтоСсылка Тогда
		Возврат Документ.Метаданные().Движения.Содержит(Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ);
	Иначе
		Возврат Документ.Движения.Найти("ЖурналПроводокЕПСБУ") <> Неопределено;
	КонецЕсли;
		
КонецФункции

Процедура ЗаполнитьПредставлениеОперации(ДополнительныеСвойства)
	
	ДанныеАвтоПроведения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ДанныеАвтоПроведения");
	Если ДанныеАвтоПроведения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	 
	ТиповаяОперация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеАвтоПроведения, "ТиповаяОперация");
	
	Если ТипЗнч(ТиповаяОперация) = Тип("Структура") Тогда
		ТиповаяОперация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТиповаяОперация, "Операция");
	КонецЕсли;

	Если ЗначениеЗаполнено(ТиповаяОперация) Тогда
		ДополнительныеСвойства.Вставить("ПредставлениеОперации", Строка(ТиповаяОперация));
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОрганизациюИФОВПроводках(Движения, Документ)

	ЗаполнятьИФО = Ложь;

	ЧитаемыеДанныеДокумента = Новый Структура("Организация");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО")
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("ИФО", Документ.Метаданные()) Тогда
			
		ЧитаемыеДанныеДокумента.Вставить("ИФО");
		ЗаполнятьИФО = Истина;
	КонецЕсли;
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, ЧитаемыеДанныеДокумента);
	
	Для каждого ТекДвижение Из Движения Цикл
		Если НЕ ЗначениеЗаполнено(ТекДвижение.Организация) Тогда
			ТекДвижение.Организация = ДанныеДокумента.Организация;
		КонецЕсли;
		Если ЗаполнятьИФО И НЕ ЗначениеЗаполнено(ТекДвижение.ИФО) Тогда
			ТекДвижение.ИФО = ДанныеДокумента.ИФО;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция КурсИКратностьДляСхемыФормированияПроводок(Документ, НаборСвойств)
	
	Результат = Новый Структура("Курс, Кратность", 1, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
		Возврат Результат;
	КонецЕсли;
	
	// Для заявок на кассовый расход в иностранной валюте курс определяется по регистру СостояниеПлатежноРасчетныхДокументов,
	// кроме договоров с признаком "Оплата в рублях"
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") Тогда
		ВалютаДоговор = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "ВалютаДокумента, Договор");
		Если ВалютаДоговор.ВалютаДокумента <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета()
			И (НЕ ЗначениеЗаполнено(ВалютаДоговор.Договор)
				ИЛИ НЕ РаботаСОбязательствами.СведенияОВалютеОбязательства(ВалютаДоговор.Договор).ОплатаВРублях) Тогда
			ЗаполнитьЗначенияСвойств(Результат, ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(Документ), "Курс, Кратность");
			//Результат.Курс = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(Документ).Курс;
			//Результат.Кратность = 1;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	
	РеквизитыДокумента = БухгалтерскийУчетПовтИсп.ПолучитьМассивРеквизитовОбъекта("Документы", Документ.Метаданные().Имя);
	
	МассивРеквизитов = Новый Массив;
	Если РеквизитыДокумента.Найти("Курс") <> Неопределено Тогда
		МассивРеквизитов.Добавить("Курс");
	КонецЕсли;
	Если РеквизитыДокумента.Найти("Кратность") <> Неопределено Тогда
		МассивРеквизитов.Добавить("Кратность");
	КонецЕсли;
	
	Если МассивРеквизитов.Количество() = 0 Тогда
		КурсИКратностьДокумента = Новый Структура;
	Иначе
		КурсИКратностьДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, МассивРеквизитов);
	Конецесли;
	
	Если НЕ КурсИКратностьДокумента.Свойство("Курс", Результат.Курс) Тогда
		Если НЕ НаборСвойств.Свойство("Курс", Результат.Курс) Тогда
			Результат.Курс = 1;
		КонецЕсли;
	КонецЕсли;
	Если НЕ КурсИКратностьДокумента.Свойство("Кратность", Результат.Кратность) Тогда
		Если НЕ НаборСвойств.Свойство("Кратность", Результат.Кратность) Тогда
			Результат.Кратность = 1;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создать источник данных из шапки объекта.
// 
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Текущий объект
//  ТиповаяОперация - СправочникСсылка.ТиповыеОперации - Типовая операция
//  ДополнительныеРеквизиты - Неопределено - Дополнительные реквизиты
// 
// Возвращаемое значение:
//  Структура - Создать источник данных из шапки объекта:
// * ШапкаДокумента - ТаблицаЗначений 
Функция СоздатьИсточникДанныхИзШапкиОбъекта(ТекущийОбъект, ТиповаяОперация,
		ДополнительныеРеквизиты = Неопределено) Экспорт
	Перем ТиповаяОперацияДляСхемы;

	Если Справочники.ТиповыеОперации.ТиповаяОперацияНеРедактируется(ТиповаяОперация, ТиповаяОперацияДляСхемы) Тогда
		ТипТиповойОперации = Новый ОписаниеТипов("СправочникСсылка.ПоставляемыеТиповыеОперации");
	Иначе
		ТипТиповойОперации = Новый ОписаниеТипов("СправочникСсылка.ТиповыеОперации");
		ТиповаяОперацияДляСхемы = ТиповаяОперация;
	КонецЕсли;

	ИсточникиДанных = Новый Структура;

	МетаданныеДокумента = ТекущийОбъект.Метаданные();

	ТаблицаШапка = Новый ТаблицаЗначений;
	ТаблицаШапка.Колонки.Добавить("Ссылка");
	ТаблицаШапка.Колонки.Добавить("Дата");
	ТаблицаШапка.Колонки.Добавить("Номер");
	ТаблицаШапка.Колонки.Добавить("ДополнительныеРеквизиты");
	ТаблицаШапка.Колонки.Добавить("ФактическаяДатаПроведения",
		Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));

	Для каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл

		ТаблицаШапка.Колонки.Добавить(ТекРеквизит.Имя);

	КонецЦикла;
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") = Неопределено Тогда
		ТаблицаШапка.Колонки.Добавить("ВалютаДокумента");
	КонецЕсли;

	ТаблицаШапка.Колонки.Добавить("ТиповаяОперация", ТипТиповойОперации);
	СтрокаИменДопРеквизитов = "";
	ТаблицаДополнительныеРеквизиты = Справочники.ТиповыеОперации.ДополнительныеРеквизитыТиповойОперации(ТиповаяОперация);
	Для каждого ТекДопРеквизит Из ТаблицаДополнительныеРеквизиты Цикл

		КолонкаТаблицыШапка = ТаблицаШапка.Колонки.Найти(ТекДопРеквизит.ИмяДляФормулы);
		Если КолонкаТаблицыШапка = Неопределено Тогда
			ТаблицаШапка.Колонки.Добавить(ТекДопРеквизит.ИмяДляФормулы, ТекДопРеквизит.ТипЗначения);
		Иначе
			НовыйТипКолонки = Новый ОписаниеТипов(КолонкаТаблицыШапка.ТипЗначения, ТекДопРеквизит.ТипЗначения.Типы());
			ТаблицаШапка.Колонки.Удалить(ТаблицаШапка.Колонки.Индекс(КолонкаТаблицыШапка));
			ТаблицаШапка.Колонки.Добавить(ТекДопРеквизит.ИмяДляФормулы, НовыйТипКолонки);
		КонецЕсли;
		Если ДополнительныеРеквизиты <> Неопределено
				И ДополнительныеРеквизиты.Свойство(ТекДопРеквизит.ИмяДляФормулы) Тогда
			Если НЕ ПустаяСтрока(СтрокаИменДопРеквизитов) Тогда
				СтрокаИменДопРеквизитов = СтрокаИменДопРеквизитов + ",";
			КонецЕсли;
			СтрокаИменДопРеквизитов = СтрокаИменДопРеквизитов
				+ ТекДопРеквизит.ИмяДляФормулы
		КонецЕсли;

	КонецЦикла;
	НовСтрока = ТаблицаШапка.Добавить();

	ЗаполнитьЗначенияСвойств(НовСтрока, ТекущийОбъект);
	НовСтрока.ФактическаяДатаПроведения = БухгалтерскиеОперацииПовтИсп.ФактическаяДатаПроведенияДокумента(
		ТекущийОбъект.Ссылка); 

	ТаблицаШапка.ЗаполнитьЗначения(ТиповаяОперацияДляСхемы, "ТиповаяОперация");
	Если ДополнительныеРеквизиты <> Неопределено
			И НЕ ПустаяСтрока(СтрокаИменДопРеквизитов) Тогда
		ЗаполнитьЗначенияСвойств(НовСтрока, ДополнительныеРеквизиты, СтрокаИменДопРеквизитов);
	КонецЕсли;

	ИсточникиДанных.Вставить("ШапкаДокумента", ТаблицаШапка);
	Возврат ИсточникиДанных;

КонецФункции

Процедура СообщитьОбОшибкахПроведения(ТаблицаОшибок, Отказ) Экспорт

	Если ТаблицаОшибок <> Неопределено Тогда
		Если ТаблицаОшибок.Количество() > 0 Тогда

			Для каждого ТекОшибка Из ТаблицаОшибок Цикл

				Отказ = Истина;
				ОбщегоНазначения.СообщитьПользователю(ТекОшибка.ТекстОшибки, , "БухгалтерскиеПроводки["
					+ ТекОшибка.НомерПроводки + "]." + ТекОшибка.ПолеОшибки);

			КонецЦикла;

		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ДанныеДокументаДляСхемыФормированияПроводок(ДокументОснование, МетаданныеДокумента)
	
	ЧитаемыеРеквизиты = Новый Структура;
	ДобавитьЧитаемыйРеквизитЕслиЕсть(ЧитаемыеРеквизиты, "ВидМежотчетногоПериода", МетаданныеДокумента);
	ДобавитьЧитаемыйРеквизитЕслиЕсть(ЧитаемыеРеквизиты, "ПервичныйДокумент", МетаданныеДокумента);
	ЭтоВходящийПоЭДОАктПриемки0510448 = Ложь;
	Если ЭтоВозможныйТипВходящийПоЭДОАктПриемки0510448(ДокументОснование)
			И ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("НФАПереданыЭлектроннымАктом", МетаданныеДокумента)
			И ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("НомерПервичногоДокумента", МетаданныеДокумента)
			И ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ДатаПервичногоДокумента", МетаданныеДокумента) Тогда
		ЭтоВходящийПоЭДОАктПриемки0510448 = Истина;
		ЧитаемыеРеквизиты.Вставить("НФАПереданыЭлектроннымАктом");
		ЧитаемыеРеквизиты.Вставить("НомерПервичногоДокумента");
		ЧитаемыеРеквизиты.Вставить("ДатаПервичногоДокумента");
	КонецЕсли;
	Если ЗначениеЗаполнено(ЧитаемыеРеквизиты) Тогда
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЧитаемыеРеквизиты);
	Иначе
		ДанныеДокумента = Новый Структура;
	КонецЕсли;
	ДанныеДокумента.Вставить("Ссылка", ДокументОснование);
	ЭтоВходящийПоЭДОАктПриемки0510448 = ЭтоВходящийПоЭДОАктПриемки0510448
		И ДанныеДокумента.НФАПереданыЭлектроннымАктом = Истина
		И ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
			ДанныеДокумента.ПервичныйДокумент, "АктПриемаПередачи0510448");
	ДанныеДокумента.Вставить("ЭтоВходящийПоЭДОАктПриемки0510448", ЭтоВходящийПоЭДОАктПриемки0510448);
	Возврат ДанныеДокумента;
КонецФункции

Функция ЭтоВозможныйТипВходящийПоЭДОАктПриемки0510448(ДокументОснование)
	ТипОбъекта = ТипЗнч(ДокументОснование);
	Возврат ТипОбъекта = Тип("ДокументСсылка.ПоступлениеМЗ")
		Или ТипОбъекта = Тип("ДокументСсылка.ПоступлениеИК")
		Или ТипОбъекта = Тип("ДокументСсылка.ПоступлениеОС")
		Или ТипОбъекта = Тип("ДокументСсылка.ПоступлениеОСИК")
		Или ТипОбъекта = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовОС")
		Или ТипОбъекта = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовИК");
КонецФункции

Процедура ДобавитьЧитаемыйРеквизитЕслиЕсть(ЧитаемыеРеквизиты, ИмяРеквизита, МетаданныеОбъекта)
	Если ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеОбъекта) Тогда
		ЧитаемыеРеквизиты.Вставить(ИмяРеквизита);
	КонецЕсли;
КонецПроцедуры

Функция НаборПроводокДляСхемыФормированияПроводок(ТиповаяОперация)
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ПроводкиТиповыхОпераций.Код,
		|	ПроводкиТиповыхОпераций.Ссылка,
		|	ПроводкиТиповыхОпераций.ПометкаУдаления
		|ИЗ
		|	Справочник.ПроводкиТиповыхОпераций КАК ПроводкиТиповыхОпераций
		|ГДЕ
		|	ПроводкиТиповыхОпераций.Владелец = &Владелец
		|	И НЕ ПроводкиТиповыхОпераций.ПометкаУдаления");
	Запрос.УстановитьПараметр("Владелец", ТиповаяОперация);
	ВыборкаПроводок = Запрос.Выполнить().Выбрать();
	НаборПроводок = Новый Структура;
	Пока ВыборкаПроводок.Следующий() Цикл
		НаборПроводок.Вставить("П" + ВыборкаПроводок.Код, ВыборкаПроводок.Ссылка);
	КонецЦикла;
	Возврат НаборПроводок;
КонецФункции

Функция ЗначениеПараметраДляСхемыФормированияПроводок(ИмяПараметра, ЗаданноеЗначениеПараметра, НаборПроводок)
	
	Если Лев(ИмяПараметра, 9) = "Параметр_" Тогда
	// параметры проводок
		СоставПараметра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяПараметра, "_");
		Если СоставПараметра.Количество() = 3 Тогда
		// реквизит какой то конкретной проводки
			Если НаборПроводок.Свойство("П" + СоставПараметра[2]) Тогда
				Возврат НаборПроводок
					["П" + СоставПараметра[2]]
					[СоставПараметра[1]];
			КонецЕсли;
		ИначеЕсли СоставПараметра.Количество() = 2 Тогда
			Для каждого ТекПроводка Из НаборПроводок Цикл
				Возврат ТекПроводка.Значение[СоставПараметра[1]];
			КонецЦикла;
		КонецЕслИ;
	Иначе
		Возврат ЗаданноеЗначениеПараметра;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура УстановитьЗначениеПараметраСхемыФормированияПроводок(НастройкиСхемы, ПараметрСхемы, ЗначениеПараметра,
		УстанавливатьИспользованиеПустогоЗначения = Ложь)
	Если ЗначениеЗаполнено(ЗначениеПараметра) Или УстанавливатьИспользованиеПустогоЗначения Тогда
		ПараметрНастройки = НастройкиСхемы.Настройки.ПараметрыДанных.Элементы.Найти(ПараметрСхемы.Имя);
		Если ПараметрНастройки <> Неопределено Тогда
			ПараметрНастройки.Значение = ЗначениеПараметра;
			ПараметрНастройки.Использование = Истина;
		КонецЕсли;
		ПараметрСхемы.Значение = ЗначениеПараметра;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
		ИмяПараметраСхемы, ЗначениеПараметра, УстанавливатьИспользованиеПустогоЗначения = Ложь)
	
	Перем ПараметрСхемы;
	Если ВсеПараметрыСхемы.Свойство(ИмяПараметраСхемы, ПараметрСхемы) Тогда
		УстановитьЗначениеПараметраСхемыФормированияПроводок(НастройкиСхемы, ПараметрСхемы, ЗначениеПараметра,
			УстанавливатьИспользованиеПустогоЗначения);
		ВсеПараметрыСхемы.Удалить(ИмяПараметраСхемы);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСчетаДляСхемыФормированияПроводок()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Валютный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Количественный";
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура("ВалютныеСчета, КоличественныеСчета", Новый СписокЗначений, Новый СписокЗначений);
	Результат.ВалютныеСчета.ЗагрузитьЗначения(РезультатЗапроса[0].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Результат.КоличественныеСчета.ЗагрузитьЗначения(РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьПараметрСхемыФормированияПроводокЕстьНеНайден(СхемаКомпоновки, ИмяПараметра)
	ПараметрСхемы = СхемаКомпоновки.Параметры.Найти(ИмяПараметра);
	Если ПараметрСхемы <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПараметрСхемы = СхемаКомпоновки.Параметры.Добавить();
	ПараметрСхемы.Имя = ИмяПараметра;
	ПараметрСхемы.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
КонецПроцедуры

Процедура ЗаполнитьПараметрыСхемыФормированияПроводок(СхемаКомпоновки, НастройкиСхемы, ДанныеДокумента, ПараметрыИнициализации, НаборПроводок)
	Перем ЗначениеВидМежотчетногоПериода;

	ЗначениеПервичныйДокумент = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеДокумента,
		"ПервичныйДокумент"); // СправочникСсылка.ПервичныеДокументы
	ИспользуетсяДокументКонтрагента = Ложь;
	ИспользуетсяАктПриемкиТРУ = Ложь;
	ЗначениеПараметра = "";
	Если ЗначениеЗаполнено(ЗначениеПервичныйДокумент)
			И ТипЗнч(ЗначениеПервичныйДокумент) = Тип("СправочникСсылка.ПервичныеДокументы") Тогда
		Если ЗначениеПервичныйДокумент = ПервичныеДокументыБГУ.ПервичныйДокументДокументКонтрагента() Тогда
			ИспользуетсяДокументКонтрагента = Истина;
		ИначеЕсли ЗначениеПервичныйДокумент = ПервичныеДокументыБГУ.ПервичныйДокументАктПриемкиТРУ() Тогда
			ИспользуетсяАктПриемкиТРУ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеПервичныйДокумент <> Неопределено Тогда
		ДобавитьПараметрСхемыФормированияПроводокЕстьНеНайден(СхемаКомпоновки, "ПервичныйДокумент");
	КонецЕсли;
	Если ИспользуетсяАктПриемкиТРУ Тогда
		ДанныеАктаПриемкиТРУ = АктПриемкиТРУПоДокументу(ДанныеДокумента.Ссылка);
		Если Не ЗначениеЗаполнено(ДанныеАктаПриемкиТРУ.Ссылка) Тогда
			ТекстИсключения = НСтр("ru = 'В документе выбран первичный документ ""Акт приемки товаров, работ, услуг"",
				|но не найден соответствующий ""Акт приемки"" или он помечен на удаление.
				|Проверьте правильность заполнения ""Акта приемки товаров, работ, услуг"" и после этого проведите текущий документ'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
	КонецЕсли;
	Если ИспользуетсяАктПриемкиТРУ Тогда
		ДобавитьПараметрСхемыФормированияПроводокЕстьНеНайден(СхемаКомпоновки, "АктПриемкиТРУ");
		ДобавитьПараметрСхемыФормированияПроводокЕстьНеНайден(СхемаКомпоновки, "АктПриемкиТРУДата");
		ДобавитьПараметрСхемыФормированияПроводокЕстьНеНайден(СхемаКомпоновки, "АктПриемкиТРУНомер");
	КонецЕсли;

	ДокументОснование = ПараметрыИнициализации.ДокументОснование;
	НаборСвойств = ПараметрыИнициализации.НаборСвойств;
	
	ВсеПараметрыСхемы = Новый Структура;
	Для каждого ПараметрСхемы Из СхемаКомпоновки.Параметры Цикл
		ВсеПараметрыСхемы.Вставить(ПараметрСхемы.Имя, ПараметрСхемы);
	КонецЦикла;
	
	ЕстьВидМежотчетногоПериода = ДанныеДокумента.Свойство("ВидМежотчетногоПериода", ЗначениеВидМежотчетногоПериода);
	Если ЕстьВидМежотчетногоПериода Тогда
		ПараметрВидМежотчетногоПериода = СхемаКомпоновки.Параметры.Найти("ВидМежотчетногоПериода");
		Если ПараметрВидМежотчетногоПериода <> Неопределено Тогда
			ПараметрВидМежотчетногоПериода.Значение = ЗначениеВидМежотчетногоПериода;
		КонецЕсли;
	КонецЕсли;

	// Функциональные опции
	СтрокаФО = "ИспользоватьВалютныйУчет,ИспользоватьУчетПоИФО,ИспользоватьУчетПоПодразделениям";
	Для Каждого ИмяФО Из СтрРазделить(СтрокаФО, ",") Цикл
		УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
			ИмяФО, ПолучитьФункциональнуюОпцию(ИмяФО));
	КонецЦикла;
	
	// Константы
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
		"ВалютаРеглУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
		"ИмяТабличнойЧасти", "РасшифровкаПлатежа");
	
	// Списки счетов
	СчетаДляСхемы = ПолучитьСчетаДляСхемыФормированияПроводок();
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
		"ВалютныеСчета", СчетаДляСхемы.ВалютныеСчета);
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
		"КоличественныеСчета", СчетаДляСхемы.КоличественныеСчета);
	
	// Данные документа
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
		"Документ", ДокументОснование);
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
		"Период", ПараметрыИнициализации.Дата);
	СтрокаРеквизитовДокумента = "ТиповаяОперация,Организация";
	Для Каждого ИмяРеквизитаДокумента Из СтрРазделить(СтрокаРеквизитовДокумента, ",") Цикл
		УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
			ИмяРеквизитаДокумента, ПараметрыИнициализации[ИмяРеквизитаДокумента]);
	КонецЦикла;

	// Курс и кратность
	РеквизитыКурсИКратностьДокумента = КурсИКратностьДляСхемыФормированияПроводок(ДокументОснование, НаборСвойств);
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы, "Курс",
		РеквизитыКурсИКратностьДокумента.Курс);
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы, "Кратность",
		РеквизитыКурсИКратностьДокумента.Кратность);
	
	// Первичный документ
	Если ИспользуетсяДокументКонтрагента Тогда
		ЗначениеПараметра = Неопределено;
	ИначеЕсли ЗначениеЗаполнено(ЗначениеПервичныйДокумент) Тогда
		ЗначениеПараметра = ПервичныеДокументыБГУ.ВидПервичногоДокумента(ЗначениеПервичныйДокумент);
	КонецЕсли;
	УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы, "ПервичныйДокумент",
		ЗначениеПараметра, Истина);
	Если ИспользуетсяАктПриемкиТРУ Тогда
		УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
			"АктПриемкиТРУ", ДанныеАктаПриемкиТРУ.Ссылка);
		УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
			"АктПриемкиТРУДата", ДанныеАктаПриемкиТРУ.Дата);
		УстановитьЗначениеПараметраСхемыФормированияПроводокПоИмени(ВсеПараметрыСхемы, НастройкиСхемы,
			"АктПриемкиТРУНомер",
			БухгалтерскиеОперации.ПолучитьНомерДляПечатиПоНастройке(
				ДанныеАктаПриемкиТРУ.Ссылка,
				ДанныеАктаПриемкиТРУ.Номер));
	КонецЕсли;
	
	// Оставшиеся параметры
	Для Каждого ОписаниеПараметраСхемы Из ВсеПараметрыСхемы Цикл
		ПараметрСхемы = ОписаниеПараметраСхемы.Значение;
		ЗначениеПараметра = ЗначениеПараметраДляСхемыФормированияПроводок(ПараметрСхемы.Имя, ПараметрСхемы.Значение,
			НаборПроводок);
		УстановитьЗначениеПараметраСхемыФормированияПроводок(НастройкиСхемы, ПараметрСхемы, ЗначениеПараметра);
	КонецЦикла;
	
КонецПроцедуры

Функция ИспользуетсяПервичныйДокументАктПриемкиТРУ(СхемаКомпоновки)
	Параметр = СхемаКомпоновки.Параметры.Найти("АктПриемкиТРУ");
	Если Параметр = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат ЗначениеЗаполнено(Параметр.Значение);
КонецФункции

Процедура ОбработатьФормулыПервичногоДокумента(СхемаКомпоновки, ДанныеДокумента)
	
	Если Не ДанныеДокумента.Свойство("ПервичныйДокумент") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВходящийАкт0510448 = ДанныеДокумента.ЭтоВходящийПоЭДОАктПриемки0510448;
	ИспользуетсяПервичныйДокументАктПриемкиТРУ = ИспользуетсяПервичныйДокументАктПриемкиТРУ(СхемаКомпоновки);
	
	ВидПервичногоДокумента = СхемаКомпоновки.ВычисляемыеПоля.Найти("ВидПервичногоДокумента");
	Если ЭтоВходящийАкт0510448 Тогда
		ВидПервичногоДокумента.Выражение = "&ПервичныйДокумент";
	Иначе
		ВидПервичногоДокумента.Выражение =
		"ВЫБОР
		|КОГДА НастройкаПроводок.ИспользоватьФормулуПервичногоДокумента = ЛОЖЬ И ЗНАЧЕНИЕЗАПОЛНЕНО(&ПервичныйДокумент)
		|ТОГДА &ПервичныйДокумент
		|ИНАЧЕ " + ВидПервичногоДокумента.Выражение + "
		|КОНЕЦ";
	КонецЕсли;
	
	НомерПервичногоДокумента = СхемаКомпоновки.ВычисляемыеПоля.Найти("НомерПервичногоДокумента");
	Если ЭтоВходящийАкт0510448 Тогда
		НомерПервичногоДокумента.Выражение = "Документ.НомерПервичногоДокумента";
	ИначеЕсли ИспользуетсяПервичныйДокументАктПриемкиТРУ Тогда
		НомерПервичногоДокумента.Выражение =
		"ВЫБОР
		|КОГДА НастройкаПроводок.ИспользоватьФормулуПервичногоДокумента = ЛОЖЬ И ЗНАЧЕНИЕЗАПОЛНЕНО(&ПервичныйДокумент)
		|ТОГДА &АктПриемкиТРУНомер
		|ИНАЧЕ " + НомерПервичногоДокумента.Выражение + "
		|КОНЕЦ";
	Иначе
		НомерПервичногоДокумента.Выражение =
		"ВЫБОР
		|КОГДА НастройкаПроводок.ИспользоватьФормулуПервичногоДокумента = ЛОЖЬ И ЗНАЧЕНИЕЗАПОЛНЕНО(&ПервичныйДокумент)
		|ТОГДА БухгалтерскиеОперации.ПолучитьНомерДляПечатиПоНастройке(Документ.Ссылка, Документ.Номер)
		|ИНАЧЕ " + НомерПервичногоДокумента.Выражение + "
		|КОНЕЦ";
	КонецЕсли;
	
	ДатаПервичногоДокумента = СхемаКомпоновки.ВычисляемыеПоля.Найти("ДатаПервичногоДокумента");
	Если ЭтоВходящийАкт0510448 Тогда
		ДатаПервичногоДокумента.Выражение = "Документ.ДатаПервичногоДокумента";
	ИначеЕсли ИспользуетсяПервичныйДокументАктПриемкиТРУ Тогда
		ДатаПервичногоДокумента.Выражение =
		"ВЫБОР
		|КОГДА НастройкаПроводок.ИспользоватьФормулуПервичногоДокумента = ЛОЖЬ И ЗНАЧЕНИЕЗАПОЛНЕНО(&ПервичныйДокумент)
		|ТОГДА &АктПриемкиТРУДата
		|ИНАЧЕ " + ДатаПервичногоДокумента.Выражение + "
		|КОНЕЦ";
	Иначе
		ДатаПервичногоДокумента.Выражение =
		"ВЫБОР
		|КОГДА НастройкаПроводок.ИспользоватьФормулуПервичногоДокумента = ЛОЖЬ И ЗНАЧЕНИЕЗАПОЛНЕНО(&ПервичныйДокумент)
		|ТОГДА Документ.Дата
		|ИНАЧЕ " + ДатаПервичногоДокумента.Выражение + "
		|КОНЕЦ";
	КонецЕсли;
	
КонецПроцедуры

// Инициализировать схему формирования проводок.
// 
// Параметры:
//  СхемаКомпоновки - СхемаКомпоновкиДанных
//  НастройкиСхемы - КомпоновщикНастроекКомпоновкиДанных
//  ПараметрыИнициализации - Структура
Процедура ИнициализироватьСхемуФормированияПроводок(СхемаКомпоновки,
		НастройкиСхемы, ПараметрыИнициализации) Экспорт

	ТиповаяОперация = ПараметрыИнициализации.ТиповаяОперация;
	ДокументОснование = ПараметрыИнициализации.ДокументОснование;

	НастройкиСхемы = Новый КомпоновщикНастроекКомпоновкиДанных;

	НастройкиСхемы.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки);
	НастройкиСхемы.Инициализировать(ИсточникНастроек);
	
	МетаданныеДокумента = ДокументОснование.Метаданные();
	ДанныеДокумента = ДанныеДокументаДляСхемыФормированияПроводок(ДокументОснование, МетаданныеДокумента);

//	ЕстьВидМежотчетногоПериода = ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ВидМежотчетногоПериода", МетаданныеДокумента);

	НаборПроводок = НаборПроводокДляСхемыФормированияПроводок(ТиповаяОперация);
	ЗаполнитьПараметрыСхемыФормированияПроводок(СхемаКомпоновки, НастройкиСхемы, ДанныеДокумента,
		ПараметрыИнициализации, НаборПроводок);
	
//	ЕстьПервичныйДокумент = ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ПервичныйДокумент", МетаданныеДокумента);
//	Если ЕстьПервичныйДокумент Тогда
//		ИзменитьФормулуЗаполненияПервичногоДокумента(СхемаКомпоновки, НастройкиСхемы, ДанныеДокумента);
//	КонецЕсли;
	ОбработатьФормулыПервичногоДокумента(СхемаКомпоновки, ДанныеДокумента);	
	ДобавитьВФормулыДатуПроведенияДокументаИзРегистра(СхемаКомпоновки, ДокументОснование);

КонецПроцедуры

Функция АктПриемкиТРУПоДокументу(ПоступлениеНФА)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТабДокумент.Ссылка,
	|	ТабДокумент.Номер,
	|	ТабДокумент.Дата
	|ИЗ
	|	Документ.АктПриемкиТоваровРаботУслуг.ДокументыПоступления КАК ТабДокументыПоступления
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктПриемкиТоваровРаботУслуг КАК ТабДокумент
	|	ПО ТабДокументыПоступления.Ссылка = ТабДокумент.Ссылка
	|ГДЕ
	|	ТабДокументыПоступления.ДокументОснование = &ПоступлениеНФА
	|	И Не ТабДокумент.ПометкаУдаления";
	Запрос.УстановитьПараметр("ПоступлениеНФА", ПоступлениеНФА);
	Результат = Новый Структура("Ссылка, Дата, Номер");
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции

Процедура ДобавитьВФормулыДатуПроведенияДокументаИзРегистра(СхемаКомпоновки, ДокументОснование)
	Если Не ПрименяетсяОтдельнаяДатаПроведенияДокументаИзРегистра(ТипЗнч(ДокументОснование.Ссылка)) Тогда
		Возврат;
	КонецЕсли;
	ПолеПериод = СхемаКомпоновки.ВычисляемыеПоля.Найти("Период");
	ПолеПериод.Выражение =
		"ВЫБОР
		|	КОГДА ЗНАЧЕНИЕЗАПОЛНЕНО(ФактическаяДатаПроведения)
		|		ТОГДА ФактическаяДатаПроведения
		|	ИНАЧЕ "
		+ ПолеПериод.Выражение
		+ "
		|	КОНЕЦ";
	НаборДанныеДокумента = СхемаКомпоновки.НаборыДанных.Найти("ДанныеДокумента");
	Для Каждого НаборДанных Из НаборДанныеДокумента.Элементы Цикл
		ПолеДатаПроведения = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеДатаПроведения.Поле = "ФактическаяДатаПроведения";
		ПолеДатаПроведения.ПутьКДанным = "ФактическаяДатаПроведения";
	КонецЦикла;
	ПолеДатаПроведения = НаборДанныеДокумента.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеДатаПроведения.Поле = "ФактическаяДатаПроведения";
	ПолеДатаПроведения.ПутьКДанным = "ФактическаяДатаПроведения";
КонецПроцедуры

Функция ПрименяетсяОтдельнаяДатаПроведенияДокументаИзРегистра(ТипДокумента)
	Возврат Метаданные.ОпределяемыеТипы.ДокументыСОтдельнойДатойПроведения.Тип.СодержитТип(ТипДокумента);
КонецФункции

Процедура ПодготовитьНастройкуДополнительныхИсточниковДанных(ТиповаяОперация,
		НастройкаДополнительныхИсточниковДанных)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.ИмяИсточника КАК ИмяИсточника,
		|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
		|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.ИмяКолонки,
		|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ресурс
		|ИЗ
		|	Справочник.ДополнительныеИсточникиДанныхДляТиповыхОпераций.КолонкиИсточника КАК ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника
		|ГДЕ
		|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.Владелец = &ТиповаяОперация
		|	И ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка.СпособЗаполнения = &СпособЗаполнения
		|ИТОГИ ПО
		|	ДополнительныеИсточникиДанныхДляТиповыхОперацийКолонкиИсточника.Ссылка";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Запрос.УстановитьПараметр("СпособЗаполнения", Перечисления.СпособыЗаполненияДополнительныхИсточниковДанныхТО.ДанныеДокумента);

	НастройкаДополнительныхИсточниковДанных = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл

		КолонкиГруппировки = "";
		КолонкиСуммирования = "";
		ВыборкаДетальная = Выборка.Выбрать();
		Пока ВыборкаДетальная.Следующий() Цикл

			Если ВыборкаДетальная.Ресурс Тогда
				КолонкиСуммирования = КолонкиСуммирования + ","
					+ ВыборкаДетальная.ИмяКолонки;
			Иначе
				КолонкиГруппировки = КолонкиГруппировки + ","
					+ ВыборкаДетальная.ИмяКолонки;
			КонецЕсли;

		КонецЦикла;

		НастройкаДополнительныхИсточниковДанных.Вставить(Выборка.ИмяТабличнойЧасти, Новый Структура("Имя, КолонкиГруппировки, КолонкиСуммирования", Выборка.ИмяИсточника, КолонкиГруппировки, КолонкиСуммирования));

	КонецЦикла;

КонецПроцедуры

Функция СоздатьИсточникДанныхИзОбъекта(ТекущийОбъект,
		ТиповаяОперация = Неопределено) Экспорт
	Перем ДанныеДополнительныхТабЧастей;
	Перем НастройкаДополнительныхИсточниковДанных;

	Если НЕ ТекущийОбъект.ДополнительныеСвойства.Свойство("ДанныеДополнительныхТабЧастей", ДанныеДополнительныхТабЧастей) Тогда
		ДанныеДополнительныхТабЧастей = ПолучитьСохраненныеЗначенияДополнительныхТабличныхЧастей(ТекущийОбъект);
	КонецЕсли;

	ИсточникиДанных = Новый Структура;

	НастройкаДополнительныхТабЧастей = НастройкаДополнительныхТабЧастей(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ТекущийОбъект.Ссылка)));

	МетаданныеДокумента = ТекущийОбъект.Метаданные();

	Если ТиповаяОперация <> Неопределено Тогда

		ПодготовитьНастройкуДополнительныхИсточниковДанных(ТиповаяОперация, НастройкаДополнительныхИсточниковДанных);

	КонецЕсли;

	ТаблицаШапка = Новый ТаблицаЗначений;
	ТаблицаШапка.Колонки.Добавить("ИмяТабличнойЧасти");
	ТаблицаШапка.Колонки.Добавить("Ссылка");
	ТаблицаШапка.Колонки.Добавить("РеквизитШапкиДата");
	ТаблицаШапка.Колонки.Добавить("РеквизитШапкиНомер");
	ОбщаяСтрокаРеквизитов = "ИмяТабличнойЧасти,Ссылка,РеквизитШапкиДата,РеквизитШапкиНомер";

	Для каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл

		ТаблицаШапка.Колонки.Добавить("РеквизитШапки" + ТекРеквизит.Имя);
		ОбщаяСтрокаРеквизитов = ОбщаяСтрокаРеквизитов + ",РеквизитШапки"
			+ ТекРеквизит.Имя;

	КонецЦикла;
	Если МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") = Неопределено Тогда
		ТаблицаШапка.Колонки.Добавить("РеквизитШапкиВалютаДокумента");
		ОбщаяСтрокаРеквизитов = ОбщаяСтрокаРеквизитов
			+ ",РеквизитШапкиВалютаДокумента";
	КонецЕсли;

	СтрокаШапки = ТаблицаШапка.Добавить();
	СтрокаШапки.РеквизитШапкиДата = ТекущийОбъект.Дата;
	СтрокаШапки.РеквизитШапкиНомер = ТекущийОбъект.Номер;
	СтрокаШапки.ИмяТабличнойЧасти = ""; /////////////////////////////////
	СтрокаШапки.Ссылка = ТекущийОбъект.Ссылка;
	Для каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл

		СтрокаШапки["РеквизитШапки"
			+ ТекРеквизит.Имя] = ТекущийОбъект[ТекРеквизит.Имя];

	КонецЦикла;

	ИсточникиДанных.Вставить("Документ", ТаблицаШапка);
	ОбработаныТЧ = Новый Массив;

	Для каждого ТекТабЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл

		ТаблицаТЧ = ТаблицаШапка.СкопироватьКолонки();

		ТаблицаТЧ.Колонки.Добавить("НомерСтроки");

		Для каждого ТекРеквизит Из МетаданныеДокумента.ТабличныеЧасти[ТекТабЧасть.Имя].Реквизиты Цикл

			ТаблицаТЧ.Колонки.Добавить(ТекРеквизит.Имя);

		КонецЦикла;

		///////// добавим колонки доп. таб частей		
		ТекДопТабЧасть = НастройкаДополнительныхТабЧастей.Получить(ТекТабЧасть.Имя);
		Если ТекДопТабЧасть <> Неопределено Тогда
			ОбработаныТЧ.Добавить(ТекТабЧасть.Имя);
			Для каждого ТекДопРеквизит Из ТекДопТабЧасть.Реквизиты Цикл

				ТаблицаТЧ.Колонки.Добавить(ТекДопРеквизит.Значение.ИмяРеквизита, ТекДопРеквизит.Значение.ТипЗначения);

			КонецЦикла;
		КонецЕсли;

		Для Каждого ТекСтрока Из ТекущийОбъект[ТекТабЧасть.Имя] Цикл
			НоваяСтрока = ТаблицаТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШапки);

			Если ТекДопТабЧасть <> Неопределено Тогда
				СтрокиДопРеквизитов = ДанныеДополнительныхТабЧастей.НайтиСтроки(Новый Структура("ТабличнаяЧасть, НомерСтрокиДокумента", ТекДопТабЧасть.СсылкаТабличнойЧасти, ТекСтрока.НомерСтроки));
				Для каждого ТекЗаписьДопРеквизита Из СтрокиДопРеквизитов Цикл

					СвойстваТекДопРеквизита = ТекДопТабЧасть.Реквизиты.Получить(ТекЗаписьДопРеквизита.КолонкаТабличнойЧасти);
					Если СвойстваТекДопРеквизита <> Неопределено Тогда
						НоваяСтрока[СвойстваТекДопРеквизита.ИмяРеквизита] = ТекЗаписьДопРеквизита.Значение;
					КонецЕсли;

				КонецЦикла;

			КонецЕсли;
		КонецЦикла;
		ТаблицаТЧ.ЗаполнитьЗначения(ТекТабЧасть.Имя, "ИмяТабличнойЧасти");

		ИсточникиДанных.Вставить(ТекТабЧасть.Имя, ТаблицаТЧ);

	КонецЦикла;

	Для каждого ТекНастройка Из НастройкаДополнительныхТабЧастей Цикл

		Если ОбработаныТЧ.Найти(ТекНастройка.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ТаблицаТЧ = ТаблицаШапка.СкопироватьКолонки();

		ТаблицаТЧ.Колонки.Добавить("НомерСтроки");

		// добавим колонки доп. таб частей
		ТекДопТабЧасть = ТекНастройка.Значение;
		Если ТекДопТабЧасть <> Неопределено Тогда
			ОбработаныТЧ.Добавить(ТекТабЧасть.Имя);
			Для каждого ТекДопРеквизит Из ТекДопТабЧасть.Реквизиты Цикл

				ТаблицаТЧ.Колонки.Добавить(ТекДопРеквизит.Значение.ИмяРеквизита, ТекДопРеквизит.Значение.ТипЗначения);

			КонецЦикла;
		КонецЕсли;

		СтрокиДопРеквизитов = ДанныеДополнительныхТабЧастей.НайтиСтроки(Новый Структура("ТабличнаяЧасть", ТекДопТабЧасть.СсылкаТабличнойЧасти));
		МаксНомерСтроки = 0;
		Для каждого ТекСтрока Из СтрокиДопРеквизитов Цикл

			МаксНомерСтроки = ?(МаксНомерСтроки < ТекСтрока.НомерСтрокиДокумента, ТекСтрока.НомерСтрокиДокумента, МаксНомерСтроки);

		КонецЦикла;
		Для А = 1 По МаксНомерСтроки Цикл
			НоваяСтрока = ТаблицаТЧ.Добавить();
			НоваяСтрока.НомерСтроки = А;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШапки);
			НоваяСтрока.ИмяТабличнойЧасти = ТекНастройка.Ключ;
		КонецЦикла;
		Для Каждого ТекСтрока Из ТаблицаТЧ Цикл
			СтрокиДопРеквизитов = ДанныеДополнительныхТабЧастей.НайтиСтроки(Новый Структура("ТабличнаяЧасть, НомерСтрокиДокумента", ТекНастройка.Значение.СсылкаТабличнойЧасти, ТекСтрока.НомерСтроки));
			Для каждого ТекЗаписьДопРеквизита Из СтрокиДопРеквизитов Цикл

				СвойстваТекДопРеквизита = ТекДопТабЧасть.Реквизиты.Получить(ТекЗаписьДопРеквизита.КолонкаТабличнойЧасти);
				Если СвойстваТекДопРеквизита <> Неопределено Тогда
					ТекСтрока[СвойстваТекДопРеквизита.ИмяРеквизита] = ТекЗаписьДопРеквизита.Значение;
				КонецЕсли;

			КонецЦикла;
		КонецЦикла;
		ИсточникиДанных.Вставить(ТекНастройка.Ключ, ТаблицаТЧ);

	КонецЦикла;

	Если ПустаяСтрока(ТекущийОбъект.Номер) Тогда

		Для каждого Источник Из ИсточникиДанных Цикл

			Источник.Значение.ЗаполнитьЗначения("<<НомерДокумента>>", "РеквизитШапкиНомер")
		КонецЦикла;

	КонецЕсли;

	Если НастройкаДополнительныхИсточниковДанных <> Неопределено Тогда
		Для каждого ТекДопИсточник Из НастройкаДополнительныхИсточниковДанных Цикл
			Таблица = Неопределено;
			Если НЕ ИсточникиДанных.Свойство(ТекДопИсточник.Ключ, Таблица) Тогда
				Продолжить;
			КонецЕсли;

			КопияТаблицы = Таблица.Скопировать(, ОбщаяСтрокаРеквизитов
				+ ТекДопИсточник.Значение.КолонкиГруппировки
				+ ТекДопИсточник.Значение.КолонкиСуммирования);
			КопияТаблицы.Свернуть(ОбщаяСтрокаРеквизитов
				+ ТекДопИсточник.Значение.КолонкиГруппировки, ТекДопИсточник.Значение.КолонкиСуммирования);

			Для каждого ТекСтрока Из КопияТаблицы Цикл

				ТекСтрока.ИмяТабличнойЧасти = ТекДопИсточник.Значение.Имя;

			КонецЦикла;

			ИсточникиДанных.Вставить(ТекДопИсточник.Значение.Имя, КопияТаблицы);

		КонецЦикла;
	КонецЕсли;

	Возврат ИсточникиДанных;

КонецФункции

Функция ПолучитьИсточникиДанныхИзОбъекта(ИдентификаторОбъекта, ДокументОбъект,
		ТиповаяОперация, ЗначенияДопРеквизитов, ОписаниеИсточников,
		СоответствиеДопИсточников = Неопределено, Отказ = Ложь) Экспорт

	ИсточникиДанных = СоздатьИсточникиДанныхПоОписанию(ОписаниеИсточников);

	// Добавим в структуру ДокументОбъект для использования в функциях общего модуля БухгалтерскиеОперацииИсточникиДанных.
	ИсточникиДанных.Вставить("ДокументОбъект", ДокументОбъект);

	ДанныеДополнительныхТабЧастей = ПолучитьСохраненныеЗначенияДополнительныхТабличныхЧастей(ДокументОбъект.Ссылка);
	НастройкаДополнительныхТабЧастей = НастройкаДополнительныхТабЧастей(ИдентификаторОбъекта);

	// заполнение данных в источники
	ОбщаяСтрокаРеквизитов = "ИмяТабличнойЧасти,";
	Префикс = ПрефиксКолонкиИсточникаДанных("Документ");
	ОбщиеДанныеТаблицы = Новый Структура;
	ОбщиеДанныеТаблицы.Вставить("ТиповаяОперация", ТиповаяОперация);
	Для каждого Реквизит Из ОписаниеИсточников.Реквизиты Цикл

		ОбщиеДанныеТаблицы.Вставить(Префикс
			+ Реквизит.Имя, ДокументОбъект[Реквизит.Имя]);
		ОбщаяСтрокаРеквизитов = ОбщаяСтрокаРеквизитов + Префикс + Реквизит.Имя
			+ ",";

	КонецЦикла;

	// к общим данным добавляются значения доп реквизитов
	Префикс = ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит");
	Для каждого Реквизит Из ОписаниеИсточников.ДополнительныеРеквизиты Цикл

		ЗначениеТекДопРеквизита = Неопределено;
		Если ЗначенияДопРеквизитов.Свойство(Реквизит.Имя, ЗначениеТекДопРеквизита)
				И ЗначениеЗаполнено(ЗначениеТекДопРеквизита) Тогда
			ОбщиеДанныеТаблицы.Вставить(Префикс
				+ Реквизит.Имя, ЗначениеТекДопРеквизита);
		КонецЕсли;

	КонецЦикла;

	ЗаполнитьЗначенияСвойств(ИсточникиДанных.Документ.Добавить(), ОбщиеДанныеТаблицы);
	ЗаполнитьВсеИсточникиДанныхПоТаблицамДокумента(
		ОписаниеИсточников.ТабличныеЧасти,
		НастройкаДополнительныхТабЧастей,
		ИсточникиДанных,
		ДокументОбъект,
		ДанныеДополнительныхТабЧастей,
		ОбщиеДанныеТаблицы);

	Для каждого ТабличнаяЧасть Из ОписаниеИсточников.ТабличныеЧасти Цикл
		ОписаниеТЧ = ТабличнаяЧасть.Значение;

		Если ОписаниеТЧ.Предопределенный Тогда
			Продолжить;
		КонецЕсли;

		ТекДопТабЧасть = НастройкаДополнительныхТабЧастей.Получить(ОписаниеТЧ.Имя);

		Префикс = ПрефиксКолонкиИсточникаДанных(ОписаниеТЧ.Имя);
		ТЧ = Неопределено;
		ИсточникиДанных.Свойство(ОписаниеТЧ.Имя, ТЧ);

		ДанныеТекущейДопТЧ = ДанныеДополнительныхТабЧастей.Скопировать(Новый Структура("ТабличнаяЧасть", ТекДопТабЧасть.СсылкаТабличнойЧасти), "КолонкаТабличнойЧасти, НомерСтрокиДокумента, ИмяКолонкиТабличнойЧасти, Значение");

		НомераСтрокТекущейДопТЧ = ДанныеТекущейДопТЧ.Скопировать(, "НомерСтрокиДокумента");
		НомераСтрокТекущейДопТЧ.Свернуть("НомерСтрокиДокумента");
		НомераСтрокТекущейДопТЧ.Сортировать("НомерСтрокиДокумента");

		Для Каждого НомерСтроки Из НомераСтрокТекущейДопТЧ Цикл

			ТаблицаСтрокиДопТЧ = ДанныеТекущейДопТЧ.Скопировать(Новый Структура("НомерСтрокиДокумента", НомерСтроки.НомерСтрокиДокумента));

			НоваяСтрока = ТЧ.Добавить();
			НоваяСтрока.НомерСтроки = НомерСтроки.НомерСтрокиДокумента;
			НоваяСтрока.ИмяТабличнойЧасти = ОписаниеТЧ.Имя;

			Для каждого РеквизитСтрокиДопТЧ Из ТаблицаСтрокиДопТЧ Цикл

				НоваяСтрока[Префикс
					+ РеквизитСтрокиДопТЧ.ИмяКолонкиТабличнойЧасти] = РеквизитСтрокиДопТЧ.Значение;

			КонецЦикла;

			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОбщиеДанныеТаблицы);

		КонецЦикла;

	КонецЦикла;

	СоответствиеДопИсточников = Новый Соответствие;
	НастройкаДополнительныхИсточниковДанных = Неопределено;
	Если ТиповаяОперация <> Неопределено Тогда

		ПодготовитьНастройкуДополнительныхИсточниковДанных(ТиповаяОперация, НастройкаДополнительныхИсточниковДанных);

		Для каждого ТекДопИсточник Из НастройкаДополнительныхИсточниковДанных Цикл
			Таблица = Неопределено;
			Если НЕ ИсточникиДанных.Свойство(ТекДопИсточник.Ключ, Таблица) Тогда
				Продолжить;
			КонецЕсли;
			СоответствиеДопИсточников.Вставить(ТекДопИсточник.Значение.Имя, ТекДопИсточник.Ключ);

			СтрокаГруппируемыхКолонок = Сред(ОбщаяСтрокаРеквизитов, 1, СтрДлина(ОбщаяСтрокаРеквизитов)
				- ?(Прав(ОбщаяСтрокаРеквизитов, 1) = ",", 1, 0));
			СтрокаСуммируемыхКолонок = "";
			ПрефиксИсходнойТаблицы = ПрефиксКолонкиИсточникаДанных(ТекДопИсточник.Ключ);
			ПрефиксНовойТаблицы = ПрефиксКолонкиИсточникаДанных(ТекДопИсточник.Значение.Имя);

			КолонкиГруппировки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ТекДопИсточник.Значение.КолонкиГруппировки);
			КолонкиСуммирования = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ТекДопИсточник.Значение.КолонкиСуммирования);

			КопияТаблицы = Таблица.СкопироватьКолонки(ОбщаяСтрокаРеквизитов);
			Для каждого ТекИмяКолонки Из КолонкиГруппировки Цикл

				КопияТаблицы.Колонки.Добавить(ПрефиксНовойТаблицы
					+ ТекИмяКолонки, Таблица.Колонки[ПрефиксИсходнойТаблицы
					+ ТекИмяКолонки].ТипЗначения);
				СтрокаГруппируемыхКолонок = СтрокаГруппируемыхКолонок + ","
					+ ПрефиксНовойТаблицы + ТекИмяКолонки;

			КонецЦикла;
			Для каждого ТекИмяКолонки Из КолонкиСуммирования Цикл

				КопияТаблицы.Колонки.Добавить(ПрефиксНовойТаблицы
					+ ТекИмяКолонки, Таблица.Колонки[ПрефиксИсходнойТаблицы
					+ ТекИмяКолонки].ТипЗначения);
				СтрокаСуммируемыхКолонок = СтрокаСуммируемыхКолонок + ПрефиксНовойТаблицы
					+ ТекИмяКолонки + ",";

			КонецЦикла;
			СтрокаСуммируемыхКолонок = Лев(СтрокаСуммируемыхКолонок, СтрДлина(СтрокаСуммируемыхКолонок)
				- 1);

			Для каждого ТекСтрока Из Таблица Цикл

				НоваяСтрока = КопияТаблицы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока, ОбщаяСтрокаРеквизитов);
				Для каждого ТекИмяКолонки Из КолонкиГруппировки Цикл

					НоваяСтрока[ПрефиксНовойТаблицы
						+ ТекИмяКолонки] = ТекСтрока[ПрефиксИсходнойТаблицы + ТекИмяКолонки];

				КонецЦикла;
				Для каждого ТекИмяКолонки Из КолонкиСуммирования Цикл

					НоваяСтрока[ПрефиксНовойТаблицы
						+ ТекИмяКолонки] = ТекСтрока[ПрефиксИсходнойТаблицы + ТекИмяКолонки];

				КонецЦикла;
				НоваяСтрока.ИмяТабличнойЧасти = ТекДопИсточник.Значение.Имя;

			КонецЦикла;

			КопияТаблицы.Свернуть(СтрокаГруппируемыхКолонок, СтрокаСуммируемыхКолонок);

			// добавить колонки доп. реквизитов
			Префикс = ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит");
			Для каждого Реквизит Из ОписаниеИсточников.ДополнительныеРеквизиты Цикл

				КопияТаблицы.Колонки.Добавить(Префикс
					+ Реквизит.Имя, Реквизит.ТипЗначения);
				ЗначениеТекДопРеквизита = Неопределено;
				Если ЗначенияДопРеквизитов.Свойство(Реквизит.Имя, ЗначениеТекДопРеквизита)
						И (ЗначениеТекДопРеквизита = Ложь
						ИЛИ ЗначениеЗаполнено(ЗначениеТекДопРеквизита)) Тогда
					КопияТаблицы.ЗаполнитьЗначения(ЗначениеТекДопРеквизита, Префикс
						+ Реквизит.Имя);
				КонецЕсли;

			КонецЦикла;

			ИсточникиДанных.Вставить(ТекДопИсточник.Значение.Имя, КопияТаблицы);

		КонецЦикла;

	КонецЕсли;

	ВсеДополнительныеИсточники = Справочники.ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПолучитьИсточникиДанных(ТиповаяОперация);
	Для каждого ДополнительныйИсточник Из ВсеДополнительныеИсточники Цикл
		ТаблицаИсточника = Справочники.ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПолучитьЗаполнитьИсточникДанных(ДополнительныйИсточник.Ссылка, ТиповаяОперация, ИсточникиДанных, ДополнительныйИсточник);

		// проверим не изменился ли признак Отказ, после заполнения таблицы источника
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		Если КонтекстПроведения.Отказ = Истина Тогда
			Отказ = Истина;
			Возврат ИсточникиДанных;
		КонецЕсли;

		ТаблицаИсточника.ЗаполнитьЗначения(ДополнительныйИсточник.ИмяИсточника, "ИмяТабличнойЧасти");

		Для каждого ТекРеквизит Из ОписаниеИсточников.Реквизиты Цикл

			ИмяКолонки = ПрефиксКолонкиИсточникаДанных("Документ") + ТекРеквизит.Имя;
			ТаблицаИсточника.Колонки.Добавить(ИмяКолонки, ТекРеквизит.ТипЗначения);
			ТаблицаИсточника.ЗаполнитьЗначения(ИсточникиДанных.Документ[0][ИмяКолонки], ИмяКолонки);

		КонецЦикла;

		Для каждого ТекДопРеквизит Из ОписаниеИсточников.ДополнительныеРеквизиты Цикл

			ИмяКолонки = ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит")
				+ ТекДопРеквизит.Имя;
			ТаблицаИсточника.Колонки.Добавить(ИмяКолонки, ТекДопРеквизит.ТипЗначения);
			ТаблицаИсточника.ЗаполнитьЗначения(ИсточникиДанных.Документ[0][ИмяКолонки], ИмяКолонки);

		КонецЦикла;

		// добавить колонки дополнительных источников данных и заполнить их данными
		Если ТаблицаИсточника.Колонки.Найти("НомерСтроки") <> Неопределено
				И ТаблицаИсточника.Колонки.Найти("ИмяСписка") <> Неопределено
				И ДанныеДополнительныхТабЧастей.Количество() > 0 Тогда

			Для каждого НастройкаТабЧасти Из НастройкаДополнительныхТабЧастей Цикл

				Для каждого КлючРеквизита Из НастройкаТабЧасти.Значение.Реквизиты Цикл

					ИмяКолонкиДопИсточника = КлючРеквизита.Значение.ИмяРеквизита;
					СуществующаяКолонкаДопИсточника = ТаблицаИсточника.Колонки.Найти(ИмяКолонкиДопИсточника);
					Если СуществующаяКолонкаДопИсточника = Неопределено Тогда
						ТаблицаИсточника.Колонки.Добавить(ИмяКолонкиДопИсточника, КлючРеквизита.Значение.ТипЗначения);
					Иначе
						ИсходныйТипИзменяемойКолонки = СуществующаяКолонкаДопИсточника.ТипЗначения;
						ИсходныйТипСоответствует = Истина;
						Для каждого ЧастьНовогоТипаКолонки Из КлючРеквизита.Значение.ТипЗначения.Типы() Цикл

							Если Не ИсходныйТипИзменяемойКолонки.СодержитТип(ЧастьНовогоТипаКолонки) Тогда
								ИсходныйТипСоответствует = Ложь;
								Прервать;
							КонецЕсли;

						КонецЦикла;
						Если Не ИсходныйТипСоответствует Тогда
							ДанныеКолонки = ТаблицаИсточника.ВыгрузитьКолонку(ИмяКолонкиДопИсточника);
							НовыйТипИзменяемойКолонки = Новый ОписаниеТипов(ИсходныйТипИзменяемойКолонки, КлючРеквизита.Значение.ТипЗначения.Типы());
							ТаблицаИсточника.Колонки.Удалить(ИмяКолонкиДопИсточника);
							ТаблицаИсточника.Колонки.Добавить(ИмяКолонкиДопИсточника, НовыйТипИзменяемойКолонки);
							ТаблицаИсточника.ЗагрузитьКолонку(ДанныеКолонки, ИмяКолонкиДопИсточника);
						КонецЕсли;
					КонецЕсли;

				КонецЦикла;

			КонецЦикла;

			Для каждого СтрокаДопИсточника Из ТаблицаИсточника Цикл

				Если ЗначениеЗаполнено(СтрокаДопИсточника.НомерСтроки)
						И ЗначениеЗаполнено(СтрокаДопИсточника.ИмяСписка) Тогда
						
					//  В документах ЕБП список "РасшифровкаПлатежа" заполняется по данным 
					// табличной части "Детализация платежа"
					Если СтрокаДопИсточника.ИмяСписка = "РасшифровкаПлатежа" 
						И (ИдентификаторОбъекта.Имя = "ПоступлениеНаСчет"
						ИЛИ ИдентификаторОбъекта.Имя = "РСКППеречисление"
						ИЛИ ИдентификаторОбъекта.Имя = "РСКПВозврат"
						ИЛИ ИдентификаторОбъекта.Имя = "РСКППеречислениеМир") Тогда
						ИмяДопИсточника = "ДетализацияПлатежа";
					Иначе
						ИмяДопИсточника = СтрокаДопИсточника.ИмяСписка;
					КонецЕсли;	

					НастройкаДопЧасти = НастройкаДополнительныхТабЧастей.Получить(ИмяДопИсточника);
	
					Если НастройкаДопЧасти <> Неопределено Тогда

						ТекущийОтбор = Новый Структура("ТабличнаяЧасть, НомерСтрокиДокумента", НастройкаДопЧасти.СсылкаТабличнойЧасти, СтрокаДопИсточника.НомерСтроки);

						СтрокиДопКолонок = ДанныеДополнительныхТабЧастей.НайтиСтроки(ТекущийОтбор);

						СтруктураДополнительныхДанных = Новый Структура;
						Для каждого ТекЗначениеДопКолонки Из СтрокиДопКолонок Цикл

							СтруктураДополнительныхДанных.Вставить(ТекЗначениеДопКолонки.ИмяКолонкиТабличнойЧасти, ТекЗначениеДопКолонки.Значение);

						КонецЦикла;
						Если СтруктураДополнительныхДанных.Количество() > 0 Тогда
							ЗаполнитьЗначенияСвойств(СтрокаДопИсточника, СтруктураДополнительныхДанных);
						КонецЕсли;

					КонецЕсли;

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

		ИсточникиДанных.Вставить(ДополнительныйИсточник.ИмяИсточника, ТаблицаИсточника);

	КонецЦикла;

	ДобавитьДатуПроведенияВИсточникиДанных(ДокументОбъект, ИсточникиДанных);

	Возврат ИсточникиДанных;

КонецФункции

Процедура ДобавитьДатуПроведенияВИсточникиДанных(ДокументОбъект, ИсточникиДанных)
	ДатаПроведения = БухгалтерскиеОперацииПовтИсп.ФактическаяДатаПроведенияДокумента(
		ДокументОбъект.Ссылка);
	Для Каждого Источник Из ИсточникиДанных Цикл
		ЗначениеИсточника = Источник.Значение; // ТаблицаЗначений
		Если ТипЗнч(ЗначениеИсточника) = Тип("ТаблицаЗначений")
				И ЗначениеИсточника.Колонки.Найти("ФактическаяДатаПроведения") = Неопределено Тогда
			ЗначениеИсточника.Колонки.Добавить("ФактическаяДатаПроведения",
				Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
			ЗначениеИсточника.ЗаполнитьЗначения(ДатаПроведения, "ФактическаяДатаПроведения");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция СоздатьИсточникиДанныхПоОписанию(ОписаниеИсточников)

	ИсточникиДанных = Новый Структура;

	ИсточникиДанных.Вставить("Документ", Новый ТаблицаЗначений);
	ИсточникДокумент = ИсточникиДанных.Документ;

	// общие колонки
	ИсточникДокумент.Колонки.Добавить("ИмяТабличнойЧасти", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(250)));
	ИсточникДокумент.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0)));
	ВсеТипыТиповойОперации = Новый Массив;
	ВсеТипыТиповойОперации.Добавить(Тип("СправочникСсылка.ТиповыеОперации"));
	ВсеТипыТиповойОперации.Добавить(Тип("СправочникСсылка.ПоставляемыеТиповыеОперации"));
	ИсточникДокумент.Колонки.Добавить("ТиповаяОперация", Новый ОписаниеТипов(ВсеТипыТиповойОперации));

	ДобавитьКолонкиИсточникаИзОписания(ИсточникДокумент, ОписаниеИсточников.Реквизиты, ПрефиксКолонкиИсточникаДанных("Документ"));
	ДобавитьКолонкиИсточникаИзОписания(ИсточникДокумент, ОписаниеИсточников.ДополнительныеРеквизиты, ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит"));
	Если ИсточникДокумент.Колонки.Найти(ПрефиксКолонкиИсточникаДанных("Документ")
			+ "ВалютаДокумента") = Неопределено Тогда
		ИсточникДокумент.Колонки.Добавить(ПрефиксКолонкиИсточникаДанных("Документ")
			+ "ВалютаДокумента", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	КонецЕсли;

	Для каждого ОписаниеТЧ Из ОписаниеИсточников.ТабличныеЧасти Цикл

		ИмяТЧ = ОписаниеТЧ.Значение.Имя;

		ИсточникТЧ = ИсточникДокумент.Скопировать();
		Если ИсточникТЧ.Колонки.Найти("НомерСтроки") = Неопределено Тогда
			ИсточникТЧ.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0)));
		КонецЕсли;

		ДобавитьКолонкиИсточникаИзОписания(ИсточникТЧ, ОписаниеТЧ.Значение.Реквизиты, ПрефиксКолонкиИсточникаДанных(ИмяТЧ));

		ИсточникиДанных.Вставить(ИмяТЧ, ИсточникТЧ);

	КонецЦикла;

	Возврат ИсточникиДанных;

КонецФункции

// СоздатьИсточникиДанныхПоОписанию()
Процедура ДобавитьКолонкиИсточникаИзОписания(ТаблицаИсточника, Реквизиты,
		ПрефиксКолонки = "")

	Для каждого ТекущийРеквизит Из Реквизиты Цикл

		ИмяКолонки = ПрефиксКолонки + ТекущийРеквизит.Имя;
		Если ТаблицаИсточника.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
			ТаблицаИсточника.Колонки.Добавить(ИмяКолонки, ТекущийРеквизит.ТипЗначения);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// ДобавитьКолонкиИсточникаИзОписания()
Функция ПрефиксКолонкиИсточникаДанных(ИмяИсточника = "") Экспорт

	Если ПустаяСтрока(ИмяИсточника) Тогда
		Возврат "";
	Иначе
		Возврат ИмяИсточника + "_";
	КонецЕсли;

КонецФункции

// ПрефиксКолонкиИсточникаДанных()
Функция ПолучитьОписаниеСтруктурыОбъекта(ИдентификаторОбъекта) Экспорт

	ВсеРеквизитыОбъекта = Новый Массив;
	ВсеТабличныеЧасти = Новый Структура;

	МетаданныеОбъекта = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторОбъекта);

	Для каждого ТекРеквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл

		ДобавитьВОписаниеИсточникаДанных(ВсеРеквизитыОбъекта, ТекРеквизит.Имя, ТекРеквизит.Тип, Истина);

	КонецЦикла;

	Для каждого ТекРеквизит Из МетаданныеОбъекта.Реквизиты Цикл

		ДобавитьВОписаниеИсточникаДанных(ВсеРеквизитыОбъекта, ТекРеквизит.Имя, ТекРеквизит.Тип, Истина);

	КонецЦикла;

	Для каждого ТекТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл

		НоваяТЧ = ДобавитьТабличнуюЧастьВОписаниеИсточникаДанных(ВсеТабличныеЧасти, ТекТабличнаяЧасть.Имя, Истина);
		ВсеРеквизитыТЧ = НоваяТЧ.Реквизиты;

		Для каждого ТекРеквизит Из ТекТабличнаяЧасть.Реквизиты Цикл

			ДобавитьВОписаниеИсточникаДанных(ВсеРеквизитыТЧ, ТекРеквизит.Имя, ТекРеквизит.Тип, Истина);

		КонецЦикла;

	КонецЦикла;

	ДополнитьСтруктуруОбъектаТабличнымиЧастями(ИдентификаторОбъекта, ВсеТабличныеЧасти);

	ОписаниеСтруктурыОбъекта = Новый Структура("Реквизиты, ТабличныеЧасти", ВсеРеквизитыОбъекта, ВсеТабличныеЧасти);

	Возврат ОписаниеСтруктурыОбъекта;

КонецФункции

// ПолучитьОписаниеСтруктурыОбъекта()
Функция ДобавитьВОписаниеИсточникаДанных(Получатель, ИмяРек, ТипРек,
		ПредопределенныйРек)

	ДобавляемоеЗначение = Новый Структура;
	ДобавляемоеЗначение.Вставить("Имя", ИмяРек);
	ДобавляемоеЗначение.Вставить("ТипЗначения", ТипРек);
	ДобавляемоеЗначение.Вставить("Предопределенный", ПредопределенныйРек);

	Получатель.Добавить(ДобавляемоеЗначение);

	Возврат Получатель[Получатель.ВГраница()];

КонецФункции

// ДобавитьВОписаниеИсточникаДанных()
Функция ДобавитьТабличнуюЧастьВОписаниеИсточникаДанных(Получатель, ИмяТЧ,
		ПредопределеннаяТЧ)

	ДобавляемоеЗначение = Новый Структура;
	ДобавляемоеЗначение.Вставить("Имя", ИмяТЧ);
	ДобавляемоеЗначение.Вставить("Предопределенный", ПредопределеннаяТЧ);
	ДобавляемоеЗначение.Вставить("Реквизиты", Новый Массив);

	Получатель.Вставить(ИмяТЧ, ДобавляемоеЗначение);

	Возврат ДобавляемоеЗначение;

КонецФункции

// ДобавитьТабличнуюЧастьВОписаниеИсточникаДанных()
Процедура ДополнитьСтруктуруОбъектаТабличнымиЧастями(ИдентификаторОбъекта,
		ВсеТабличныеЧасти) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ДополнительныеТабличныеЧастиДокументов.Ссылка КАК ТабличнаяЧасть,
		|	ДополнительныеТабличныеЧастиДокументов.ИмяТабличнойЧасти,
		|	ДополнительныеТабличныеЧастиДокументов.ПредопределеннаяТабличнаяЧасть,
		|	КолонкиДополнительныхТабличныхЧастей.Ссылка КАК КолонкаТабличнойЧасти,
		|	КолонкиДополнительныхТабличныхЧастей.ИмяКолонки,
		|	КолонкиДополнительныхТабличныхЧастей.ОписаниеТипаКолонки.ТипЗначения Как ТипЗначения
		|ИЗ
		|	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДополнительныеТабличныеЧастиДокументов КАК ДополнительныеТабличныеЧастиДокументов
		|		ПО КолонкиДополнительныхТабличныхЧастей.Владелец = ДополнительныеТабличныеЧастиДокументов.Ссылка
		|ГДЕ
		|	ДополнительныеТабличныеЧастиДокументов.ИдентификаторДокумента = &ИдентификаторОбъекта
		|	И КолонкиДополнительныхТабличныхЧастей.ЭтоГруппа = ЛОЖЬ
		|	И ДополнительныеТабличныеЧастиДокументов.ПометкаУдаления = ЛОЖЬ
		|	И КолонкиДополнительныхТабличныхЧастей.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ТекТЧ = Неопределено;
		ИмяТЧ = Выборка.ИмяТабличнойЧасти;

		ВсеТабличныеЧасти.Свойство(ИмяТЧ, ТекТЧ);

		Если ТекТЧ = Неопределено
				И Выборка.ПредопределеннаяТабличнаяЧасть = Истина Тогда
			Продолжить;
		КонецЕсли;

		Если ТекТЧ <> Неопределено
				И Выборка.ПредопределеннаяТабличнаяЧасть <> ТекТЧ.Предопределенный Тогда
			Продолжить;
		КонецЕсли;

		Если ТекТЧ = Неопределено Тогда

			ТекТЧ = ДобавитьТабличнуюЧастьВОписаниеИсточникаДанных(ВсеТабличныеЧасти, ИмяТЧ, Ложь);

		КонецЕсли;

		ДобавитьВОписаниеИсточникаДанных(ТекТЧ.Реквизиты, Выборка.ИмяКолонки, Выборка.ТипЗначения, Ложь);

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьОписаниеСтруктурыТиповойОперации(ТиповаяОперация) Экспорт

	ДопРеквизиты = Новый Массив;

	Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат ДопРеквизиты;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка
	|ПОМЕСТИТЬ УдаленныеГруппы
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.ЭтоГруппа
	|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка
	|ПОМЕСТИТЬ УдаленныеЭлементы
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	НЕ РеквизитыТиповыхОпераций.ЭтоГруппа
	|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.Ссылка В ИЕРАРХИИ
	|		(ВЫБРАТЬ
	|			Ссылка
	|		ИЗ
	|			УдаленныеГруппы)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК ТипЗначения
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ УдаленныеЭлементы КАК УдаленныеЭлементы
	|		ПО РеквизитыТиповыхОпераций.Ссылка = УдаленныеЭлементы.Ссылка
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|	И РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ
	|	И УдаленныеЭлементы.Ссылка ЕСТЬ NULL";

	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		ДобавитьВОписаниеИсточникаДанных(ДопРеквизиты, Выборка.ИмяДляФормулы, Выборка.ТипЗначения, Ложь);

	КонецЦикла;

	Возврат ДопРеквизиты;

КонецФункции

// Функция возвращает структуру - контекст заполнения операции.
// Если параметр "Инициализировать" = Истина,
// то структура будет заново инициализирована и помещена во временное хранилище. Адрес хранилища записывается
// в параметр сеанса КонтекстФормированияБухгалтерскойОперации.
// Если параметр "Инициализировать" = Ложь,
// то будет получена из хранилища ранее сохраненная структура
//
// Параметры:
//  Инициализировать - Булево - необходимость инициализации структуры
// Возвращаемое значение:
//  см. ИнициализироватьКонтекстЗаполненияОперации
Функция ПолучитьКонтекстЗаполненияОперации(Знач Инициализировать = Ложь) Экспорт

	Если НЕ Инициализировать Тогда
		
		КонтекстЗаполненияОперации = ПолучитьСохраненныйКонтекстЗаполненияОперации();
		
		Если КонтекстЗаполненияОперации = Неопределено Тогда
			Инициализировать = Истина;
		КонецЕсли;

	КонецЕсли;

	Если Инициализировать Тогда
		
		УдалитьКонтекстЗаполненияОперации();
		КонтекстЗаполненияОперации = ИнициализироватьКонтекстЗаполненияОперации();

	КонецЕсли;

	Возврат КонтекстЗаполненияОперации;

КонецФункции

// Процедура сохраняет переданный контекст заполнения операции во временное хранилище.
// Перед вызовом должен обязательно быть вызов функции ПолучитьКонтекстЗаполненияОперации(Истина)
//
// Параметры:
//  Контекст - Структура - контекст заполнения операции
Процедура СохранитьКонтекстЗаполненияОперации(Контекст) Экспорт

	АдресВХранилище = АдресХранилищаИзПараметраСеанса();
	ПоместитьВоВременноеХранилище(Контекст, АдресВХранилище);

КонецПроцедуры

Процедура УдалитьКонтекстЗаполненияОперации() Экспорт

	АдресВХранилище = АдресХранилищаИзПараметраСеанса();
	Если ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		УдалитьИзВременногоХранилища(АдресВХранилище);
	КонецЕсли;
	ПараметрыСеанса.КонтекстФормированияБухгалтерскойОперации = "";
	
КонецПроцедуры

Функция ПолучитьСохраненныйКонтекстЗаполненияОперации()
	
	АдресВХранилище = АдресХранилищаИзПараметраСеанса();
	Если Не ЭтоАдресВременногоХранилища(АдресВХранилище) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Контекст = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Если ТипЗнч(Контекст) = Тип("Структура") Тогда
		Если Контекст.ДокументОбъект = Неопределено
				И ТипЗнч(Контекст.ДокументОбъектСериализованный) = Тип("Строка")
				И Не ПустаяСтрока(Контекст.ДокументОбъектСериализованный) Тогда
			Контекст.ДокументОбъект = ОбщегоНазначения.ЗначениеИзСтрокиXML(Контекст.ДокументОбъектСериализованный);
		КонецЕсли;
		Возврат Контекст;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Инициализировать контекст заполнения операции.
// 
// Возвращаемое значение:
//  Структура - Инициализировать контекст заполнения операции:
// * Ссылка - ДокументСсылка 
// * ДокументОбъект - ДокументОбъект
// * ТаблицаАвансов - ТаблицаЗначений
// * ДокументОбъектСериализованный - Строка
// * Отказ - Булево - 
// * ТаблицаОшибок - ТаблицаЗначений - :
// ** ИмяПоля - Строка 
// ** ТекстСообщения - Строка 
// * ТиповаяОперация - СправочникСсылка.ТиповыеОперации - 
// * ДополнительныеСвойства - Структура - 
// * ИсключениеПриПроверкеЗаполнения - Булево - 
// * ПоследняяОшибка - Строка - 
// * ПоследняяФункция - Строка - 
// * УникальныйИдентификатор - УникальныйИдентификатор - 
// * Курс - Число - 
// * Кратность - Число - 
Функция ИнициализироватьКонтекстЗаполненияОперации()

	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("ИмяПоля");
	ТаблицаОшибок.Колонки.Добавить("ТекстСообщения");
	
	Контекст = Новый Структура("Ссылка, ДокументОбъект, ТаблицаАвансов");

	Контекст.Вставить("ДокументОбъектСериализованный",   "");
	Контекст.Вставить("Отказ",                           Ложь);
	Контекст.Вставить("ТаблицаОшибок",                   ТаблицаОшибок);
	Контекст.Вставить("ТиповаяОперация",                 Справочники.ТиповыеОперации.ПустаяСсылка());
	Контекст.Вставить("ДополнительныеСвойства",          Новый Структура);
	Контекст.Вставить("ИсключениеПриПроверкеЗаполнения", Ложь);
	Контекст.Вставить("ПоследняяОшибка",                 "");
	Контекст.Вставить("ПоследняяФункция",                "");
	Контекст.Вставить("УникальныйИдентификатор",         Новый УникальныйИдентификатор);
	Контекст.Вставить("Курс",                            1);
	Контекст.Вставить("Кратность",                       1);
	Контекст.Вставить("ПроверятьЗаполнениеРеквизитов",   Истина);

	АдресВХранилище = ПоместитьВоВременноеХранилище(Контекст);
	ПараметрыСеанса.КонтекстФормированияБухгалтерскойОперации = АдресВХранилище;
	
	Возврат Контекст;
	
КонецФункции

Функция АдресХранилищаИзПараметраСеанса()

	АдресВХранилище = ПараметрыСеанса.КонтекстФормированияБухгалтерскойОперации;
	Возврат АдресВХранилище;

КонецФункции

Функция ПустаяТаблицаЗначенияДопРеквизитов(ПолучатьНаименование)

	ЗначенияДопРеквизитов = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Если ПолучатьНаименование Тогда
		ЗначенияДопРеквизитов.Колонки.Добавить("НаименованиеРеквизита");
	КонецЕсли;
	Возврат ЗначенияДопРеквизитов;

КонецФункции

// Формирует структуру доп. реквизитов и их значения. Вызывается при записи из формы документа.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма документа.
//	ДополнительныеРеквизиты - Произвольный - после выполнения содержит структуру с доп. реквизитами: ключ-ИмяДляФормулы, значение - значение доп. реквизита
//	ЗначенияДопРеквизитов - Произвольный - после выполнения содержит готовую таблицу значений, для записи в РС ЗначенияДополнительныхРеквизитовОперации
//  БезВалюты - Булево - признак необходимости получения реквизитов Курс и Кратность. Если валютный учет не ведется, то реквизиты курс и кратность не получаются
//							не зависимо от параметра.
//	
Процедура СформироватьСтруктуруДопРеквизитовИзБазы(ДокументОбъект,
		ТиповаяОперация, ДополнительныеРеквизиты, ЗначенияДопРеквизитов,
		ПолучатьНаименование = Ложь)
		
	БезВалюты = ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОперацияБух")
			ИЛИ НЕ ИспользоватьВалютныйУчет(ДокументОбъект);

	ДополнительныеРеквизиты = Новый Структура;
	ЗначенияДопРеквизитов = ПустаяТаблицаЗначенияДопРеквизитов(ПолучатьНаименование);
	СсылкаДокумента = ДокументОбъект.Ссылка;

	Если СсылкаДокумента.Пустая() Тогда
		Возврат;
	КонецЕсли;
	ТиповаяОперация = БухгалтерскаяОперацияДокумента(ДокументОбъект.Ссылка);
	Если НЕ ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка КАК РеквизитОперации,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки,
	|	РеквизитыТиповыхОпераций.Наименование КАК НаименованиеРеквизита,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК ТипЗначения,
	|	ЗначенияДополнительныхРеквизитовОпераций.Значение
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК
	|			ЗначенияДополнительныхРеквизитовОпераций
	|		ПО РеквизитыТиповыхОпераций.Ссылка = ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации
	|		И (ЗначенияДополнительныхРеквизитовОпераций.Объект = &Документ)
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И
	|	НЕ РеквизитыТиповыхОпераций.ЭтоГруппа
	|	И
	|	НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацииДокументов.Документ,
	|	ОперацииДокументов.Операция,
	|	ОперацииДокументов.ИсправлениеОшибки,
	|	ОперацииДокументов.ВыявительОшибки,
	|	ОперацииДокументов.ПричинаОшибки,
	|	ОперацииДокументов.Курс,
	|	ОперацииДокументов.Кратность,
	|	ОперацииДокументов.ОтветственныйИсполнитель
	|ИЗ
	|	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|ГДЕ
	|	ОперацииДокументов.Документ = &Документ
	|	И ОперацииДокументов.Операция = &ТиповаяОперация";

	Если НЕ ПолучатьНаименование Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеквизитыТиповыхОпераций.Наименование КАК НаименованиеРеквизита,", "");
	КонецЕсли;

	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Запрос.УстановитьПараметр("Документ", СсылкаДокумента);

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл

		Если ЗначениеЗаполнено(Выборка.ТипЗначения) Тогда

			ЗначениеДопРеквизита = Выборка.ТипЗначения.ПривестиЗначение(Выборка.Значение);

			НовЗначение = ЗначенияДопРеквизитов.Добавить();
			ЗаполнитьЗначенияСвойств(НовЗначение, Выборка);
			НовЗначение.Значение = Выборка.ТипЗначения.ПривестиЗначение(Выборка.Значение);

			ДополнительныеРеквизиты.Вставить(Выборка.ИмяДляФормулы, ЗначениеДопРеквизита);

		КонецЕсли;

	КонецЦикла;

	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Курс = Выборка.Курс;
		Кратность = Выборка.Кратность;
		ИсправлениеОшибки = Выборка.ИсправлениеОшибки;
		ВыявительОшибки = Выборка.ВыявительОшибки;
		ПричинаОшибки = Выборка.ПричинаОшибки;
		ОтветственныйИсполнитель = Выборка.ОтветственныйИсполнитель;
	Иначе 
		Курс = 0;
		Кратность = 0;
		ИсправлениеОшибки = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ПустаяСсылка();
		ВыявительОшибки = Перечисления.ВыявительОшибокПрошлыхЛет.ПустаяСсылка();
		ПричинаОшибки = Справочники.ПричиныОшибокПрошлыхЛет.ПустаяСсылка();
		ОтветственныйИсполнитель = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	ДополнительныеРеквизиты.Вставить("ИсправлениеОшибки", ИсправлениеОшибки);
	ДополнительныеРеквизиты.Вставить("ВыявительОшибки", ВыявительОшибки);
	ДополнительныеРеквизиты.Вставить("ПричинаОшибки", ПричинаОшибки);
	ДополнительныеРеквизиты.Вставить("ОтветственныйИсполнитель", ОтветственныйИсполнитель);

	Если НЕ БезВалюты Тогда

		ДополнительныеРеквизиты.Вставить("Курс", ?(ЗначениеЗаполнено(Курс), Курс, 1));
		ДополнительныеРеквизиты.Вставить("Кратность", ?(ЗначениеЗаполнено(Кратность), Кратность, 1));

	КонецЕсли;

КонецПроцедуры

// Функция проверяет изменение реквизитов, которые нельзя менять пользователю.
//
// Параметры:
// ТекущийОбъект - ДокументОбъект - объект, содержащий измененные данные
// Объект - ДокументОбъект - объект, содержащий записанные данные
//
// Возвращаемое значение:
// Булево - Истина - реквизиты не изменены, Ложь - изменены.
//
Функция КонтролируемыеРеквизитыНеИзменены(ТекущийОбъект, Объект)

	ТекстСообщения = НСтр("ru='Сформированы проводки документа.
		|У Вас отсутствуют права на изменение реквизитов использующихся в проводках.
		|Операция не выполнена.'");
	КонтролируемыеРеквизиты = ПолучитьКонтролируемыеРеквизиты(ТекущийОбъект.Ссылка);

	Если КонтролируемыеРеквизиты <> Неопределено Тогда
		ТаблицаТЧ = КонтролируемыеРеквизиты.Скопировать(, "ИмяТабличнойЧасти");
		ТаблицаТЧ.Свернуть("ИмяТабличнойЧасти");
		МассивТЧ = ТаблицаТЧ.ВыгрузитьКолонку("ИмяТабличнойЧасти");

		ОтборРеквизитов = Новый Структура("ИмяТабличнойЧасти", "");
		ПроверяемыеРеквизиты = КонтролируемыеРеквизиты.Скопировать(ОтборРеквизитов, "ИмяРеквизита");
		Для каждого ТекРеквизит Из ПроверяемыеРеквизиты Цикл

			Если ТекущийОбъект[ТекРеквизит.ИмяРеквизита] <> Объект[ТекРеквизит.ИмяРеквизита] Тогда

				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , );
				Возврат Ложь;

			КонецЕсли;

		КонецЦикла;

		Для каждого ТекТЧ Из МассивТЧ Цикл
			Если ПустаяСтрока(ТекТЧ) Тогда
				Продолжить;
			КонецЕсли;

			Если ТекущийОбъект[ТекТЧ].Количество() <> Объект[ТекТЧ].Количество() Тогда

				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , );
				Возврат Ложь;

			КонецЕсли;

			ОтборРеквизитов = Новый Структура("ИмяТабличнойЧасти", ТекТЧ);
			ПроверяемыеРеквизиты = КонтролируемыеРеквизиты.Скопировать(ОтборРеквизитов, "ИмяРеквизита");
			Для ИндексСтроки = 0 По ТекущийОбъект[ТекТЧ].Количество() - 1 Цикл
				СтрокаТекущийОбъект = ТекущийОбъект[ТекТЧ][ИндексСтроки];
				СтрокаОбъект = Объект[ТекТЧ][ИндексСтроки];
				Для каждого ТекРеквизит Из ПроверяемыеРеквизиты Цикл
					Если СтрокаТекущийОбъект[ТекРеквизит.ИмяРеквизита] <> СтрокаОбъект[ТекРеквизит.ИмяРеквизита] Тогда

						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , );
						Возврат Ложь;

					КонецЕсли;

				КонецЦикла;
			КонецЦикла;

		КонецЦикла;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ТиповаяОперацияСоответствуетДокументу(ТекущийОбъект, ТиповаяОперация)

	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ТекущийОбъект));
	Параметры = ПараметрыДляВыбораТиповойОперации(ТекущийОбъект, ИдентификаторДокумента);

	СписокДопустимыхТиповыхОпераций = Справочники.ТиповыеОперации.ПолучитьСписокТиповыхОперацийПоУсловиям(ИдентификаторДокумента, Параметры);

	Возврат СписокДопустимыхТиповыхОпераций.НайтиПоЗначению(ТиповаяОперация) <> Неопределено;

КонецФункции

Процедура СообщитьТиповаяОперацияНеСоответствуетДокументу(ТекущийОбъект,
		Форма)

	ТекстСообщения = НСтр("ru = 'Выбранная типовая операция не соответствует отбору в документе'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ТекущийОбъект.Ссылка, БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма));

КонецПроцедуры

// Получает список реквизитов для контроля из ссылки на типовую операцию. Список возвращается
// по всем проводкам операции.
//
// Параметры
// Ссылка - СправочникСсылка.ТиповаяОперация.
// ЭтоСторно - Булево - признак получения списка реквизитов для сторнированного документа.
//
// Возвращаемое значение
// ТаблицаЗначений с двумя колонками "ИмяТабличнойЧасти" и "ИмяРеквизита".
//
Функция ПолучитьКонтролируемыеРеквизиты(Ссылка, ЭтоСторно = Ложь)
	ПраваПользователяПросмотр = Ложь;
	БухгалтерскаяОперация = БухгалтерскаяОперацияДокумента(Ссылка);
	// если получаем список реквизитов для сторнированного документа, то права пользователей нас не интересуют. Надо запрещать
	// все и всем.
	Если НЕ ЭтоСторно Тогда

		ПраваПользователяПросмотр = Справочники.ТиповыеОперации.ПраваДоступаКТиповойОперации(БухгалтерскаяОперация).Просмотр;

	КонецЕсли;

	Если ПраваПользователяПросмотр Тогда
		Возврат Неопределено;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПроводкиТиповыхОперацийКонтролируемыеРеквизиты.ИмяТабличнойЧасти,
			|	ПроводкиТиповыхОперацийКонтролируемыеРеквизиты.ИмяРеквизита
			|ИЗ
			|	Справочник.ПроводкиТиповыхОпераций.КонтролируемыеРеквизиты КАК ПроводкиТиповыхОперацийКонтролируемыеРеквизиты
			|ГДЕ
			|	ПроводкиТиповыхОперацийКонтролируемыеРеквизиты.Ссылка.Владелец = &Операция";
		Запрос.УстановитьПараметр("Операция", БухгалтерскаяОперация);
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
КонецФункции

// Получает значения реквизитов объекта и заполняет структуру с этими значениями.
// Используется для получения списка операций, доступных для выбора в конкретный документ.
//
// Параметры:
//  ТекущийОбъект			 - ДанныеФормыСтруктура, ДанныеФормыСтруктураСКоллекцией, ДокументОбъект - документ.
//  ИдентификаторДокумента	 - СправочникСсылка.ИдентификаторыОбъектовМетаданных - идентификатор документа
// 
// Возвращаемое значение:
//  Структура - Содержит ключи - имена реквизитов и их значения. Если реквизитов для выбора не задано, то
//							структура пустая.
//
Функция ПараметрыДляВыбораТиповойОперации(ТекущийОбъект, ИдентификаторДокумента)

	Параметры = Новый Структура;

	ИменаРеквизитов = БухгалтерскиеОперацииПовтИспНаВремяСеанса.ИменаРеквизитовДляПроверкиИспользованияОперации(ИдентификаторДокумента);
	Если ЗначениеЗаполнено(ИменаРеквизитов) Тогда
		ПараметрыИспользования = Новый Структура(ИменаРеквизитов);
		ЗаполнитьЗначенияСвойств(ПараметрыИспользования, ТекущийОбъект);
		ВременнаяСтруктура = Новый Структура("Дата, Организация");
		ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, ТекущийОбъект);
		Если ЗначениеЗаполнено(ВременнаяСтруктура.Дата) Тогда
			ДатаДокумента = ВременнаяСтруктура.Дата;
		Иначе
			ДатаДокумента = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;
		ПараметрыИспользования.Вставить("СлужебныйДляВыбораНаДату", ДатаДокумента);
		ПараметрыИспользования.Вставить("СлужебныйДляВыбораОрганизация", ВременнаяСтруктура.Организация);
		Если ПараметрыИспользования.Свойство("Дата") И ПараметрыИспользования.Дата = '00010101' Тогда
			// В новом документе дата еще не задана, но по-умолчанию она будет задана как ТекущаяДатаПользователя
			ПараметрыИспользования.Дата = ДатаДокумента;
		КонецЕсли;
		Параметры.Вставить("ПараметрыИспользования", ПараметрыИспользования);
	КонецЕсли;

	Возврат Параметры;

КонецФункции

#КонецОбласти

#Область РаботаСФормами

Процедура ЗаполнитьОперандыФормул(Форма,
		ЭтоПоставляемаяПроводка = Ложь) Экспорт

	Дерево = Форма.РеквизитФормыВЗначение("ОперандыФормул");

	Элементы = Форма.Элементы;

	// ДобавитьВОперандыФормулРеквизитыДокумента
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма.АдресСКДРеквизитовДокумента, Новый Структура("ИспользоватьВалютныйУчет", Истина));
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);

	Корень = Дерево.Строки.Добавить();
	Корень.Поле = "Документ.Ссылка";
	Корень.ИмяДляФормулы = "Документ.Ссылка";
	Корень.Представление = "Документ.Ссылка";
	Корень.НомерКартинки = 0;

	ДобавитьДеревоДоступныхПолейВДерево(Корень, КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора, "Документ", "", 0);

	Для каждого ТекСтрока Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл

		Если ТекСтрока.Папка = Истина
				И НЕ ТекСтрока.Поле = Новый ПолеКомпоновкиДанных("СистемныеПоля") Тогда
			Элементы.ИмяТабличнойЧастиДокумента.СписокВыбора.Добавить(Строка(ТекСтрока.Поле), ТекСтрока.Заголовок);
		КонецЕсли;

	КонецЦикла;

	// ДобавитьВОперандыФормулДополнительныеРеквизиты
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма.АдресСКДДополнительныхРеквизитов, Новый Структура("ИспользоватьВалютныйУчет", Истина));
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);

	Корень = Дерево.Строки.Добавить();
	Корень.Поле = "";
	Корень.ИмяДляФормулы = "";
	Корень.Представление = "Дополнительные реквизиты";
	Корень.НомерКартинки = 4;

	ДобавитьДеревоДоступныхПолейВДерево(Корень, КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора, "ДополнительныеРеквизиты", "", 0);

	// ДобавитьВОперандыФормулДополнительныеИсточники
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма.АдресСКДДополнительныхИсточников, Новый Структура("ИспользоватьВалютныйУчет", Истина));
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);

	Корень = Дерево.Строки.Добавить();
	Корень.Поле = "";
	Корень.ИмяДляФормулы = "";
	Корень.Представление = "Дополнительные источники данных";
	Корень.НомерКартинки = 11;

	ДобавитьДеревоДоступныхПолейВДерево(Корень, КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора, "СтрокаТаблицы", "", 0, 1, Истина);

	Для каждого ТекСтрока Из КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл

		Если ТекСтрока.Папка = Истина
				И НЕ ТекСтрока.Поле = Новый ПолеКомпоновкиДанных("СистемныеПоля") Тогда
			Элементы.ИмяТабличнойЧастиДокумента.СписокВыбора.Добавить(Строка(ТекСтрока.Поле), ТекСтрока.Заголовок);
		КонецЕсли;

	КонецЦикла;

	// ДобавитьВОперандыФормулАгрегатныеФункции
	Корень = Дерево.Строки.Добавить();
	Корень.Поле = "АгрегатныеФункции";
	Корень.ИмяДляФормулы = "";
	Корень.Представление = "Агрегатные функции";
	Корень.НомерКартинки = 5;

	Для каждого АгрегатнаяФункция Из Справочники.ПроводкиТиповыхОпераций.ДоступныеАгрегатныеФункции() Цикл

		НовСтрока = Корень.Строки.Добавить();
		НовСтрока.Поле = АгрегатнаяФункция.Поле;
		НовСтрока.ИмяДляФормулы = АгрегатнаяФункция.ИмяДляФормулы;
		НовСтрока.Представление = АгрегатнаяФункция.Представление;
		НовСтрока.НомерКартинки = 8;

	КонецЦикла;
	
	Корень = Дерево.Строки.Добавить();
	Корень.Представление = "Функции общего модуля";
	Корень.НомерКартинки = 6;

	ОписанияФункций = БухгалтерскиеОперации.ПолучитьТаблицуОписанийПользовательскихФункций();
	БухгалтерскиеОперации.ЗаполнитьОписанияПользовательскихФункций(ОписанияФункций);
	ДобавитьФункцииОбщегоМодуляВДеревоОперандов(Корень, ОписанияФункций, "БухгалтерскиеОперации");

	ОписанияФункций.Очистить();
	БухгалтерскиеОперацииПереопределяемый.ЗаполнитьОписанияПользовательскихФункций(ОписанияФункций);
	Если ОписанияФункций.Количество() > 0 Тогда
		Корень = Дерево.Строки.Добавить();
		Корень.Представление = "Функции общего модуля (переопределенные)";
		Корень.НомерКартинки = 6;
		ДобавитьФункцииОбщегоМодуляВДеревоОперандов(Корень, ОписанияФункций, "БухгалтерскиеОперацииПереопределяемый", Истина);
	КонецЕсли;

	// добавить функции из расширения
	МодулиРасширений = ОписанияМодулейРасширений("Функции");
	Для каждого ТекМодуль Из МодулиРасширений Цикл

		ОписанияФункций.Очистить();
		ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ТекМодуль.Ключ);
		ОбщийМодуль.ЗаполнитьОписанияПользовательскихФункций(ОписанияФункций);

		Если ОписанияФункций.Количество() > 0 Тогда
			Корень = Дерево.Строки.Добавить();
			Корень.Представление = СтрШаблон(НСтр("ru = 'Функции общего модуля расширения (%1)'"), ТекМодуль.Значение);
			Корень.НомерКартинки = 6;
			ДобавитьФункцииОбщегоМодуляВДеревоОперандов(Корень, ОписанияФункций, ТекМодуль.Ключ, Истина);
		КонецЕсли;

	КонецЦикла;

	// ДобавитьВОперандыФормулМакросы
	Корень = Дерево.Строки.Добавить();
	Корень.Поле = "";
	Корень.ИмяДляФормулы = "";
	Корень.Представление = "Макросы";
	Корень.НомерКартинки = 9;

	НовМакрос = Корень.Строки.Добавить();
	НовМакрос.НомерКартинки = 8;
	НовМакрос.ИмяДляФормулы = "#ЗначениеЗаполнено";
	НовМакрос.Представление = "#ЗначениеЗаполнено";

	НовМакрос = Корень.Строки.Добавить();
	НовМакрос.НомерКартинки = 8;
	НовМакрос.ИмяДляФормулы = "#ЗначениеЗаполнено/Прервать";
	НовМакрос.Представление = "#ЗначениеЗаполнено/Прервать";

	// ДобавитьВОперандыФормулРеквизитыПроводок
	РеквизитыПроводки = Новый ТаблицаЗначений;
	РеквизитыПроводки.Колонки.Добавить("ИмяДляФормулы", Новый ОписаниеТипов("Строка"));
	РеквизитыПроводки.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));

	НовСтр = РеквизитыПроводки.Добавить();
	НовСтр.ИмяДляФормулы = "Период";
	НовСтр.Порядок = 1;

	ТекПорядок = 1;
	Для каждого ТекРеквизит Из Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Измерения Цикл

		ТекПорядок = ТекПорядок + 1;

		Если ТекРеквизит.Балансовый Тогда
			НовСтр = РеквизитыПроводки.Добавить();
			НовСтр.ИмяДляФормулы = ТекРеквизит.Имя;
			НовСтр.Порядок = ТекПорядок;
		Иначе
			НовСтр = РеквизитыПроводки.Добавить();
			НовСтр.ИмяДляФормулы = ТекРеквизит.Имя + "Дт";
			НовСтр.Порядок = 10 + ТекПорядок;
			НовСтр = РеквизитыПроводки.Добавить();
			НовСтр.ИмяДляФормулы = ТекРеквизит.Имя + "Кт";
			НовСтр.Порядок = 20 + ТекПорядок;
		КонецЕсли;

	КонецЦикла;

	ТекПорядок = 1;

	НовСтр = РеквизитыПроводки.Добавить();
	НовСтр.ИмяДляФормулы = "СчетДт";
	НовСтр.Порядок = 30;

	НовСтр = РеквизитыПроводки.Добавить();
	НовСтр.ИмяДляФормулы = "СчетКт";
	НовСтр.Порядок = 35;

	Для Сч = 1 по 3 Цикл
		НовСтр = РеквизитыПроводки.Добавить();
		НовСтр.ИмяДляФормулы = "СубконтоДт" + Сч;
		НовСтр.Порядок = 30 + ТекПорядок;

		НовСтр = РеквизитыПроводки.Добавить();
		НовСтр.ИмяДляФормулы = "СубконтоКт" + Сч;
		НовСтр.Порядок = 35 + ТекПорядок;
	КонецЦикла;

	ТекПорядок = 1;

	Для каждого ТекРеквизит Из Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Ресурсы Цикл

		ТекПорядок = ТекПорядок + 1;

		Если ТекРеквизит.Балансовый Тогда
			НовСтр = РеквизитыПроводки.Добавить();
			НовСтр.ИмяДляФормулы = ТекРеквизит.Имя;
			НовСтр.Порядок = 40 + ТекПорядок;
		Иначе
			НовСтр = РеквизитыПроводки.Добавить();
			НовСтр.ИмяДляФормулы = ТекРеквизит.Имя + "Дт";
			НовСтр.Порядок = 50 + ТекПорядок;
			НовСтр = РеквизитыПроводки.Добавить();
			НовСтр.ИмяДляФормулы = ТекРеквизит.Имя + "Кт";
			НовСтр.Порядок = 60 + ТекПорядок;
		КонецЕсли;

	КонецЦикла;

	ТекПорядок = 1;

	Для каждого ТекРеквизит Из Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Реквизиты Цикл

		ТекПорядок = ТекПорядок + 1;

		НовСтр = РеквизитыПроводки.Добавить();
		НовСтр.ИмяДляФормулы = ТекРеквизит.Имя;
		НовСтр.Порядок = 70 + ТекПорядок;

	КонецЦикла;

	РеквизитыПроводки.Сортировать("Порядок");

	Корень = Дерево.Строки.Добавить();
	Корень.Поле = "";
	Корень.ИмяДляФормулы = "";
	Корень.Представление = "ТекущаяПроводка";
	Корень.НомерКартинки = 3;

	Для каждого ТекРеквизитПроводки Из РеквизитыПроводки Цикл

		НовСтрока = Корень.Строки.Добавить();
		НовСтрока.НомерКартинки = 8;
		НовСтрока.ИмяДляФормулы = "Проводка." + ТекРеквизитПроводки.ИмяДляФормулы;
		НовСтрока.Представление = ТекРеквизитПроводки.ИмяДляФормулы;

	КонецЦикла;

	Форма.ЗначениеВРеквизитФормы(Дерево, "ОперандыФормул");

КонецПроцедуры

Процедура ДобавитьФункцииОбщегоМодуляВДеревоОперандов(Корень, ОписанияФункций, ИмяМодуля, НеДобавлятьЕдинственнуюГруппу = Ложь)
	
	ВсеГруппы = ОписанияФункций.Скопировать(,"СинонимГруппы, ПорядокГруппы");
	ВсеГруппы.Свернуть("СинонимГруппы, ПорядокГруппы");
	ВсеГруппы.Сортировать("ПорядокГруппы, СинонимГруппы");
	Если НеДобавлятьЕдинственнуюГруппу И ВсеГруппы.Количество() = 1 Тогда
		ДобавитьФункциюОбщегоМодуляВГруппу(Корень, ОписанияФункций, ИмяМодуля);
	Иначе
		Для Каждого ТекГруппа Из ВсеГруппы Цикл
			КореньГруппы = Корень.Строки.Добавить();
			КореньГруппы.Представление = ТекГруппа.СинонимГруппы;
			КореньГруппы.НомерКартинки = 12;
			ДобавитьФункциюОбщегоМодуляВГруппу(КореньГруппы, ОписанияФункций, ИмяМодуля, ТекГруппа.СинонимГруппы);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьФункциюОбщегоМодуляВГруппу(КореньГруппы, ОписанияФункций, ИмяМодуля, СинонимГруппы = Неопределено)
	Для каждого ТекФункция Из ОписанияФункций Цикл

		Если СинонимГруппы <> Неопределено И ТекФункция.СинонимГруппы <> СинонимГруппы Тогда
			Продолжить;
		КонецЕсли;
	
		НовФункция = КореньГруппы.Строки.Добавить();
		НовФункция.Представление = ТекФункция.ИмяФункции;
		НовФункция.ИмяДляФормулы = ИмяМодуля + "." + ТекФункция.ИмяФункции;
		НовФункция.Поле = ТекФункция.ИмяФункции;
		НовФункция.НомерКартинки = 8;
		НовФункция.Описание = ТекФункция.Описание;
		НовФункция.НеОтображать = Не ТекФункция.Используется;

	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьДеревоДоступныхПолейВДерево(КоллекцияПриемник,
		КоллекцияИсточник, Знач ПервоеПоле, ИмяТаблицы, Счетчик,
		МаксОграничение = 2, ЭтоДополнительныйИсточникДанных = Ложь)

	Если Счетчик = МаксОграничение Тогда
		Возврат;
	КонецЕсли;

	Для каждого ТекЭлемент Из КоллекцияИсточник.Элементы Цикл

		Если НевыводимыйРеквизит(ТекЭлемент.Поле) Тогда
			Продолжить;
		КонецЕсли;

		Если (ПервоеПоле = "Документ" И (ТекЭлемент.Таблица ИЛИ ТекЭлемент.Папка))
				ИЛИ ЭтоДополнительныйИсточникДанных Тогда
			ИмяТекущейТаблицы = Сред(ТекЭлемент.Поле, Найти(ТекЭлемент.Поле, ".") + 1);
		Иначе
			ИмяТекущейТаблицы = ИмяТаблицы;
		КонецЕсли;

		Если ТипЗнч(КоллекцияПриемник) = Тип("СтрокаДереваЗначений") Тогда
			Узел = КоллекцияПриемник.Строки.Добавить();
		Иначе
			Узел = КоллекцияПриемник.ПолучитьЭлементы().Добавить();
		КонецЕсли;
		Если ПервоеПоле = "СтрокаТаблицы" Тогда
			Поле = Сред(ТекЭлемент.Поле, Найти(ТекЭлемент.Поле, ".") + 1);
		Иначе
			Поле = ТекЭлемент.Поле;
		КонецЕсли;
		Узел.Поле = ПервоеПоле + "." + Поле;
		Если ПервоеПоле = "Документ" И (ТекЭлемент.Таблица
				ИЛИ ТекЭлемент.Папка) Тогда
			Узел.Представление = "Таблица." + Поле + " (" + ТекЭлемент.Заголовок + ")";
		Иначе
			Узел.ИмяДляФормулы = ПервоеПоле + "." + Поле;
			Узел.Представление = Узел.ИмяДляФормулы + " (" + ТекЭлемент.Заголовок
				+ ")";
		КонецЕсли;
		Узел.Таблица = ТекЭлемент.Таблица ИЛИ ТекЭлемент.Папка;
		Узел.ИмяТаблицы = ИмяТаблицы;
		Если ТекЭлемент.Таблица ИЛИ ТекЭлемент.Папка Тогда
			Узел.НомерКартинки = 2;
		Иначе
			Узел.НомерКартинки = 1;
		КонецЕсли;
		Узел.ЭтоДополнительныйИсточникДанных = ЭтоДополнительныйИсточникДанных;

		Если ТекЭлемент.Таблица ИЛИ ТекЭлемент.Папка Тогда
			ДобавитьДеревоДоступныхПолейВДерево(Узел, ТекЭлемент, ?(ПервоеПоле = "Документ", "СтрокаТаблицы", ПервоеПоле), ИмяТекущейТаблицы, 0, МаксОграничение, ЭтоДополнительныйИсточникДанных);
		Иначе
			ДобавитьДеревоДоступныхПолейВДерево(Узел, ТекЭлемент, ПервоеПоле, ИмяТекущейТаблицы, Счетчик
				+ 1, МаксОграничение, ЭтоДополнительныйИсточникДанных);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// ДобавитьДеревоДоступныхПолейВДерево()
Функция НевыводимыйРеквизит(Поле)

	РазложениеИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Строка(Поле), ".");
	ПоследнееПоле = ВРЕГ(РазложениеИмени[РазложениеИмени.ВГраница()]);

	Возврат ПоследнееПоле = "ВЕРСИЯДАННЫХ" ИЛИ ПоследнееПоле = "СИСТЕМНЫЕПОЛЯ"
		ИЛИ ПоследнееПоле = "ССЫЛКА" ИЛИ ПоследнееПоле = "ИДИСТОЧНИКА"
		ИЛИ Найти(Строка(Поле), "[") > 0;

КонецФункции

// НевыводимыйРеквизит()
Процедура ЗаполнитьОперандыФормулТиповойОперации(Форма,
		ОперацияНаПоддержке = Ложь) Экспорт

	ОписанияФункций = БухгалтерскиеОперации.ПолучитьТаблицуОписанийПользовательскихФункций();
	БухгалтерскиеОперации.ЗаполнитьОписанияПользовательскихФункцийУсловийОпераций(ОписанияФункций);

	СтрФункций = Форма.РеквизитыДокумента.ПолучитьЭлементы().Добавить();
	СтрФункций.Имя = "Функции общего модуля";
	СтрФункций.КодДляФормулы = "БухгалтерскиеОперации";
	Для каждого ТекФункция Из ОписанияФункций Цикл

		ТекСтрФункции = СтрФункций.ПолучитьЭлементы().Добавить();
		ТекСтрФункции.Имя = ТекФункция.ИмяФункции;
		ТекСтрФункции.КодДляФормулы = "БухгалтерскиеОперации."
			+ ТекФункция.ИмяФункции;
		ТекСтрФункции.Описание = ТекФункция.Описание;
		ТекСтрФункции.НеОтображать = Не ТекФункция.Используется;

	КонецЦикла;

	Если Не ОперацияНаПоддержке Тогда
		ОписанияФункций.Очистить();

		БухгалтерскиеОперацииПереопределяемый.ЗаполнитьОписанияПользовательскихФункцийУсловийОпераций(ОписанияФункций);

		Если ОписанияФункций.Количество() > 0 Тогда

			СтрФункций = Форма.РеквизитыДокумента.ПолучитьЭлементы().Добавить();
			СтрФункций.Имя = "Функции общего модуля (переопределенные)";
			СтрФункций.КодДляФормулы = "БухгалтерскиеОперацииПереопределяемый";
			Для каждого ТекФункция Из ОписанияФункций Цикл

				ТекСтрФункции = СтрФункций.ПолучитьЭлементы().Добавить();
				ТекСтрФункции.Имя = ТекФункция.ИмяФункции;
				ТекСтрФункции.КодДляФормулы = "БухгалтерскиеОперацииПереопределяемый."
					+ ТекФункция.ИмяФункции;
				ТекСтрФункции.Описание = ТекФункция.Описание;
				ТекСтрФункции.НеОтображать = Не ТекФункция.Используется;

			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

// Устанавливает в список формы отбор, заданный в настройке операции.
// Отбор передается в сериализованном виде в параметре "ПредустановленныйОтбор".
// Если отображение динамического списка установлено в иерархический список или дерево, то возможно при установке отбора
// список окажется пустым, т.к. родительские элементы не попадают в отбор. Для предотвращения этого необходимо установить
// отображение динамического списка = "Список". Если динамический список имеет имя "Список", то можно передать в процедуру
// саму форму и отображение будет установлено автоматически.
//
// Параметры:
//	Список - ДинамическийСписок - реквизит формы, содержащий динамический список элементов. (Обычно "Список")
//	Параметры - Структура - параметры формы
//	Форма - УправляемаяФорма - сама форма.
Процедура УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры,
		Форма = Неопределено, Знач УстановленныеЭлементы = Неопределено) Экспорт

	Если НЕ Параметры.Свойство("ПредустановленныйОтбор") Тогда
		Возврат;
	КонецЕсли;

	ПредустановленныйОтбор = Параметры.ПредустановленныйОтбор;

	Если ТипЗнч(ПредустановленныйОтбор) = Тип("Строка")
		И ЗначениеЗаполнено(ПредустановленныйОтбор) Тогда
		НастройкиКомпоновки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПредустановленныйОтбор);
	Иначе
		Возврат;
	КонецЕсли;

	Отбор = НастройкиКомпоновки.Отбор;

	СкопироватьОтбор(Список.Отбор, Отбор.Элементы, УстановленныеЭлементы);
	ПроверитьПериодДействияПланаСчетовВОтборе(Отбор,
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НаДату"),
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Организация"));

	Если Форма <> Неопределено Тогда

		Попытка

			ЭлементСписок = Форма.Элементы.Список;
			Если ЭлементСписок.Отображение <> ОтображениеТаблицы.Список Тогда
				ЭлементСписок.Отображение = ОтображениеТаблицы.Список;
			КонецЕсли;

		Исключение

		КонецПопытки;

	КонецЕсли;
КонецПроцедуры

Процедура ПроверитьПериодДействияПланаСчетовВОтборе(Отбор, Знач НаДату, Организация) Экспорт
	Если Отбор = Неопределено Или Не ЗначениеЗаполнено(НаДату) Тогда
		Возврат;
	КонецЕсли;
	НаДату = НачалоДня(НаДату);
	
	ИспользуемыеСчета = Новый Массив;
	ВыбратьСчетаИспользуемыеВОтборе(Отбор, ИспользуемыеСчета);
	Если ИспользуемыеСчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ИспользуемыеСчета, "Код, ДатаНачалаДействия, ДатаОкончанияДействия");
	ЗаменитьНеактуальныеСчетаВОтборе(Отбор, ДанныеСчетов, НаДату, Организация);
	
КонецПроцедуры

Процедура ВыбратьСчетаИспользуемыеВОтборе(Отбор, ИспользуемыеСчета)
	Для Каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ВыбратьСчетаИспользуемыеВОтборе(ЭлементОтбора, ИспользуемыеСчета);
		Иначе
			Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				Для Каждого ЭлементСписка Из ЭлементОтбора.ПравоеЗначение Цикл
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
						ИспользуемыеСчета.Добавить(ЭлементСписка.Значение);
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
				ИспользуемыеСчета.Добавить(ЭлементОтбора.ПравоеЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаменитьНеактуальныеСчетаВОтборе(Отбор, ДанныеСчетов, НаДату, Организация)
	Для Каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЗаменитьНеактуальныеСчетаВОтборе(ЭлементОтбора, ДанныеСчетов, НаДату, Организация);
		Иначе
			Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				Для Каждого ЭлементСписка Из ЭлементОтбора.ПравоеЗначение Цикл
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
						ДанныеСчета = ДанныеСчетов.Получить(ЭлементСписка.Значение);
						ЭлементСписка.Значение = АктуальныйСчетДляОтбора(ЭлементСписка.Значение, ДанныеСчета, НаДату, Организация);
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
				ДанныеСчета = ДанныеСчетов.Получить(ЭлементОтбора.ПравоеЗначение);
				ЭлементОтбора.ПравоеЗначение = АктуальныйСчетДляОтбора(ЭлементОтбора.ПравоеЗначение, ДанныеСчета, НаДату, Организация);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция АктуальныйСчетДляОтбора(Счет, ДанныеСчета, НаДату, Организация)
	Если ДанныеСчета <> Неопределено
		И ((ЗначениеЗаполнено(ДанныеСчета.ДатаНачалаДействия) И ДанныеСчета.ДатаНачалаДействия > НаДату)
			Или (ЗначениеЗаполнено(ДанныеСчета.ДатаОкончанияДействия) И ДанныеСчета.ДатаОкончанияДействия < НаДату)) Тогда
			
		АктуальныйСчет = БухгалтерскийУчет.СчетПоКоду(ДанныеСчета.Код, НаДату, Организация);
		Возврат ?(ЗначениеЗаполнено(АктуальныйСчет), АктуальныйСчет, Счет);
	КонецЕсли;
	Возврат Счет;
КонецФункции

// Получает имена реквизитов формы.
//
// Параметры
//  Форма  - УправляемаяФорма
//  Путь  - Строка - путь к родительскому реквизиту. Если параметр опущен или указана пустая строка, возвращаются
//					имена реквизитов верхнего уровня.
//
// Возвращаемое значение:
//   Массив   - Массив имен реквизитов формы.
//
Функция ПолучитьИменаРеквизитовФормы(Форма, Путь = "",
		ВВерхнемРегистре = Ложь) Экспорт

	Реквизиты = Форма.ПолучитьРеквизиты(Путь);
	Результат = Новый Массив;
	Для каждого ТекРеквизит Из Реквизиты Цикл

		Результат.Добавить(?(ВВерхнемРегистре = Истина, ВРег(ТекРеквизит.Имя), ТекРеквизит.Имя));

	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ДобавитьЭлементыНаФормуПредварительногоПросмотра(ПараметрыПредварительногоПросмотра,
		Отказ) Экспорт

	Форма = ПараметрыПредварительногоПросмотра.Форма;
	ТиповаяОперация = ПараметрыПредварительногоПросмотра.ТиповаяОперация;
	ИдентификаторДокумента = ПараметрыПредварительногоПросмотра.ИдентификаторДокумента;
	МенеджерДокумента = ПараметрыПредварительногоПросмотра.МенеджерДокумента;

	СсылкаДокумента = МенеджерДокумента.ПолучитьСсылку();
	ТипЗначенияСсылки = ТипЗнч(СсылкаДокумента);
	ВалютныйУчет = ВДокументеИспользуетсяВалютныйУчет(ИдентификаторДокумента);

	ПараметрыДобавленияЭлементовФормы = ПараметрыДобавленияЭлементовФормы();
	ПараметрыДобавленияЭлементовФормы.Форма = Форма;
	ПараметрыДобавленияЭлементовФормы.Объект = СсылкаДокумента;
	ПараметрыДобавленияЭлементовФормы.ТипЗначенияСсылки = ТипЗначенияСсылки;
	ПараметрыДобавленияЭлементовФормы.ПолеДляРеквизитовОперации = Форма;
	ПараметрыДобавленияЭлементовФормы.ПолеДляДополнительныхТабЧастей = Форма;
	ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации = Истина;
	ПараметрыДобавленияЭлементовФормы.ТиповаяОперация = ТиповаяОперация;
	ПараметрыДобавленияЭлементовФормы.РеквизитыФормы = Новый Массив;
	ПараметрыДобавленияЭлементовФормы.ВалютныйУчет = ВалютныйУчет;
	ПараметрыДобавленияЭлементовФормы.ПредварительныйПросмотр = Истина;

	БухгалтерскиеОперацииРаботаСФормами.ДобавитьРеквизитыЭлементыНаФорму(ПараметрыДобавленияЭлементовФормы);

КонецПроцедуры

// Документы, по которым проводки всегда формируются одновременно с проведением документа.
// Не включает документ "ОперацияБух", т.к. он не проводится.
//
// Возвращемое значение:
// - Массив - массив элементов типа "СправочникСсылка.ИдентификаторыОбъектовМетаданных"
Функция ДокументыФормирующиеПроводкиВсегдаОдновременно() Экспорт

	Возврат Новый Массив(БухгалтерскиеОперацииПовтИспНаВремяСеанса.ДокументыФормирующиеПроводкиВсегдаОдновременно());

КонецФункции

// Проверяет, что по указанному виду документа проводки формируются всегда при проведении документа,
// независимо от значения константы ФормированиеПроводокПриПроведенииДокумента.
// 
// Параметры:
// 	ИдентификаторДокумента - СправочникСсылка.ИдентификаторыОбъектовМетаданных - проверяемый вид документа.
// Возвращаемое значение:
// 	Булево - Истина, если по этому виду документов проводки всегда формируются при проведении документа.
//
Функция ПроводкиФормируютсяВсегдаОдновременно(ИдентификаторДокумента) Экспорт

	Возврат БухгалтерскиеОперацииПовтИспНаВремяСеанса.ДокументыФормирующиеПроводкиВсегдаОдновременно()
		.Найти(ИдентификаторДокумента) <> Неопределено;
	
КонецФункции

Процедура СкопироватьОтбор(ОтборСписка, ЭлементыОтбора, Знач УстановленныеЭлементы = Неопределено)
	
	Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл

		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда

			ПредставлениеГруппы = ?(ПустаяСтрока(ЭлементОтбора.Представление), "ЭлементГруппыПредопределенногоОтбора"
				+ (ЭлементОтбора.Элементы.Количество() + 1), ЭлементОтбора.Представление);
			Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(ОтборСписка.Элементы, ПредставлениеГруппы, ЭлементОтбора.ТипГруппы);
			СкопироватьОтбор(Группа, ЭлементОтбора.Элементы);

		Иначе

			Элемент = ОтборСписка.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Элемент.ЛевоеЗначение = ЭлементОтбора.ЛевоеЗначение;
			Элемент.ВидСравнения = ЭлементОтбора.ВидСравнения;
			Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			Элемент.ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
			Элемент.Представление = ЭлементОтбора.Представление;
			Элемент.Использование = ЭлементОтбора.Использование;
			
			Если ТипЗнч(УстановленныеЭлементы) = Тип("Массив") Тогда
				УстановленныеЭлементы.Добавить(ЭлементОтбора.ЛевоеЗначение);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПараметрыДобавленияЭлементовФормы() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Форма", Неопределено);
	Результат.Вставить("Объект", Неопределено);
	Результат.Вставить("ТипЗначенияСсылки", Неопределено);
	Результат.Вставить("ПолеДляРеквизитовОперации", Неопределено);
	Результат.Вставить("ПолеДляДополнительныхТабЧастей", Неопределено);
	Результат.Вставить("ДобавлятьДопРеквизитыОперации", Ложь);
	Результат.Вставить("ДобавлятьДопТабЧасти", Истина);
	Результат.Вставить("ТиповаяОперация", Справочники.ТиповыеОперации.ПустаяСсылка());
	Результат.Вставить("ПовторноеЧтениеОбъекта", Ложь);
	Результат.Вставить("РеквизитыФормы", Новый Массив);
	Результат.Вставить("ВалютныйУчет", Ложь);
	Результат.Вставить("ПредварительныйПросмотр", Ложь);
	Результат.Вставить("ЗначенияДопРеквизитов", Новый Структура); // не используется. Оставлено для совместимости

	Возврат Результат;

КонецФункции

Процедура ДобавитьРекурсивноЗависимыеЭлементы(СписокЗависимыхЭлементов,
		ДеревоЭлементовФормы)
	Для каждого ТекущийЭлемент Из ДеревоЭлементовФормы.Строки Цикл

		Если ЗначениеЗаполнено(ТекущийЭлемент.СтруктураСвязиПоТипу) Тогда
			СписокЗависимыхЭлементов.Добавить(ТекущийЭлемент.СтруктураСвязиПоТипу);
		КонецЕсли;

		ДобавитьРекурсивноЗависимыеЭлементы(СписокЗависимыхЭлементов, ТекущийЭлемент);

	КонецЦикла;
КонецПроцедуры

Процедура ВыбратьПодчиненныеЭлементыФормыРекурсивно(ПолеДляЭлементов,
		Исключения, УдаляемыеЭлементыФормы)

	Для каждого ТекЭлемент Из ПолеДляЭлементов.ПодчиненныеЭлементы Цикл

		Если Исключения.Найти(ТекЭлемент.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(ТекЭлемент) = Тип("ГруппаФормы") Тогда

			ВыбратьПодчиненныеЭлементыФормыРекурсивно(ТекЭлемент, Исключения, УдаляемыеЭлементыФормы);

		КонецЕсли;

		УдаляемыеЭлементыФормы.Добавить(ТекЭлемент.Имя);

	КонецЦикла;

КонецПроцедуры

Функция ДетальноеОписаниеСвязиПоТипу(СвязиПоТипу) Экспорт

	Результат = Новый Структура;
	Если НЕ ЗначениеЗаполнено(СвязиПоТипу) Тогда
		Возврат Результат;
	КонецЕсли;

	ПозицияОткрСкобки = СтрНайти(СвязиПоТипу, "(");
	ПозицияЗакрСкобки = СтрНайти(СвязиПоТипу, ")");

	ТипЧисло = Новый ОписаниеТипов("Число");

	Если ПозицияОткрСкобки > 0 И ПозицияЗакрСкобки > ПозицияОткрСкобки Тогда

		Результат.Вставить("ИмяСвязи", Лев(СвязиПоТипу, ПозицияОткрСкобки - 1));
		Результат.Вставить("ПорядокСвязи", ТипЧисло.ПривестиЗначение(Сред(СвязиПоТипу, ПозицияОткрСкобки
			+ 1, ПозицияЗакрСкобки - ПозицияОткрСкобки - 1)));

	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура ЗаполнитьПараметрыДанныхВыбора(Объект, ПараметрыДанныхВыбора,
		ОтборЭлементов, ТекстСвязиПараметровВыбора)

	Если ЗначениеЗаполнено(ОтборЭлементов) Тогда
		ПараметрыДанныхВыбора.Вставить("ПредустановленныйОтбор", ОтборЭлементов);
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстСвязиПараметровВыбора) Тогда
		СвязиПараметровВыбора = ЗначениеИзСтрокиВнутр(ТекстСвязиПараметровВыбора);

		Для каждого ТекСвязьПараметровВыбора Из СвязиПараметровВыбора Цикл
			ЗначениеРеквизита = Неопределено;
			ИмяПоля = "";
			ПолеВОтбор = Ложь;

			Если Лев(ТекСвязьПараметровВыбора.Реквизит, 7) = "Объект." Тогда
				ЗначениеРеквизита = Объект[Сред(ТекСвязьПараметровВыбора.Реквизит, 8)];
			КонецЕсли;
			Если ВРЕГ(Лев(ТекСвязьПараметровВыбора.Имя, 6)) = "ОТБОР." Тогда
				ИмяПоля = СокрП(Сред(ТекСвязьПараметровВыбора.Имя, 7));
				ПолеВОтбор = Истина;
			Иначе
				ИмяПоля = СокрЛП(ТекСвязьПараметровВыбора.Имя);
			КонецЕсли;
			Если ЗначениеЗаполнено(ИмяПоля)
					И ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
				Если ПолеВОтбор Тогда
					ПараметрыДанныхВыбора.Отбор.Вставить(ИмяПоля, ЗначениеРеквизита);
				Иначе
					ПараметрыДанныхВыбора.Вставить(ИмяПоля, ЗначениеРеквизита);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СобытияЖурналаРегистрации

// Возвращает строковую константу для формирования сообщений журнала регистрации.
//
// Возвращаемое значение:
//   Строка - текст события журнала регистрации.
//
Функция СобытиеЖурналаРегистрацииОбновлениеТО() Экспорт

	Возврат НСтр("ru = 'Типовые операции. Обновление типовых операций'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииВычислениеУсловия() Экспорт

	Возврат НСтр("ru = 'Формирование проводок. Вычисление условия'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииУдалениеИзПоставки() Экспорт

	Возврат НСтр("ru = 'Типовые операции. Снятие с поддержки'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииИзменение() Экспорт

	Возврат НСтр("ru = 'Типовые операции. Изменение'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииУстановкаТиповойОперации() Экспорт

	Возврат НСтр("ru = 'Типовые операции. Запись данных объекта'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииВычислениеИсточникаДанных() Экспорт

	Возврат НСтр("ru = 'Типовые операции. Вычисление источника данных'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииЧтениеДополнительныхМодулей() Экспорт

	Возврат НСтр("ru = 'Типовые операции. Чтение дополнительных модулей'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииПроведениеПоВнешнейФункции() Экспорт

	Возврат НСтр("ru = 'Формирование проводок. Проведение по внешней функции'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииЗаменаТиповойОперации() Экспорт

	Возврат НСтр("ru = 'Типовые операции. Замена типовой операции'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииФормированиеПроводокПроведение() Экспорт

	Возврат НСтр("ru = 'Формирование проводок. Проведение'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖурналаРегистрацииФормированиеПроводокСобытиеПослеФормирования() Экспорт

	Возврат НСтр("ru = 'Формирование проводок. После формирования проводок'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура ЗарегистрироватьСнятыеСПоддержкиПоставляемыеОперацииВОбластяхДанных(ПоставляемаяТиповаяОперация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ОбластиДанных.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные
		|ИЗ
		|	РегистрСведений.ОбластиДанных КАК ОбластиДанных
		|ГДЕ
		|	ОбластиДанных.Статус В (Значение(Перечисление.СтатусыОбластейДанных.Новая), Значение(Перечисление.СтатусыОбластейДанных.Используется))";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Набор = РегистрыСведений.ОтключенныеОтПоддержкиПоставляемыеТиповыеОперации.СоздатьНаборЗаписей();
		Набор.Отбор.ОбластьДанныхВспомогательныеДанные.Установить(Выборка.ОбластьДанныхВспомогательныеДанные);
		Набор.Отбор.ПоставляемаяТиповаяОперация.Установить(ПоставляемаяТиповаяОперация);

		ЗаписьНабора = Набор.Добавить();
		ЗаписьНабора.ОбластьДанныхВспомогательныеДанные = Выборка.ОбластьДанныхВспомогательныеДанные;
		ЗаписьНабора.ПоставляемаяТиповаяОперация = ПоставляемаяТиповаяОперация;

		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);

	КонецЦикла;

КонецПроцедуры

Процедура ИзменитьЗначенияДопРеквизитовПередУстановкой(ИдентификаторДокумента,
		Объект, ТиповаяОперация, ДопРеквизиты,
		ЗаполнятьЗначенияПоУмолчанию = Истина) Экспорт

	Если ТипЗнч(ДопРеквизиты) <> Тип("Структура") Тогда
		ДопРеквизиты = Новый Структура;
	КонецЕсли;

	// 1. Проверить значения реквизитов по установленным отборам
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
		|	РеквизитыТиповыхОпераций.ОтборЭлементов КАК ОтборЭлементов,
		|	ВЫБОР
		|		КОГДА РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
		|			ТОГДА ЕСТЬNULL(ПоставляемыеРеквизитыТиповыхОпераций.СвязиПараметровВыбора, """")
		|		ИНАЧЕ ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.СвязиПараметровВыбора, """")
		|	КОНЕЦ КАК СвязиПараметровВыбора,
		|	ВЫБОР
		|		КОГДА РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
		|			ТОГДА ЕСТЬNULL(ПоставляемыеРеквизитыТиповыхОпераций.ЗапретитьИзменение, ЛОЖЬ)
		|		ИНАЧЕ ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.ЗапретитьИзменение, ЛОЖЬ)
		|	КОНЕЦ КАК ЗапретитьИзменение,
		|	РеквизитыТиповыхОпераций.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
		|	ВЫБОР
		|		КОГДА РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
		|			ТОГДА ПоставляемыеРеквизитыТиповыхОпераций.УпакованныеНастройки
		|		ИНАЧЕ ДанныеРеквизитовТиповыхОпераций.УпакованныеНастройки
		|	КОНЕЦ КАК УпакованныеНастройки
		|ИЗ
		|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
		|		ПО РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации = ПоставляемыеРеквизитыТиповыхОпераций.Ссылка
		|			И РеквизитыТиповыхОпераций.Владелец.ПоставляемаяТиповаяОперация = ПоставляемыеРеквизитыТиповыхОпераций.Владелец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
		|		ПО РеквизитыТиповыхОпераций.Ссылка = ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации
		|ГДЕ
		|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		|	И РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ
		|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ЗначениеРеквизитаОперации = Неопределено;

		Если НЕ ДопРеквизиты.Свойство(Выборка.ИмяДляФормулы, ЗначениеРеквизитаОперации)
				ИЛИ НЕ ЗначениеЗаполнено(ЗначениеРеквизитаОперации) Тогда
			Продолжить;
		КонецЕсли;

		ПараметрыДанныхВыбора = Новый Структура("Отбор", Новый Структура);
		ЗаполнитьПараметрыДанныхВыбора(Объект, ПараметрыДанныхВыбора, Выборка.ОтборЭлементов, Выборка.СвязиПараметровВыбора);
		Если ПараметрыДанныхВыбора.Количество() > 1
				ИЛИ ПараметрыДанныхВыбора.Отбор.Количество() > 0 Тогда
				// Если задан отбор, связи параметров выбора или предустановленный отбор, то проверяем
			// соответствует ли ранее выбранное значение новым отборам
			Если НЕ ВыбранноеЗначениеСоответствуетОтбору(ЗначениеРеквизитаОперации, ПараметрыДанныхВыбора) Тогда
				ДопРеквизиты.Удалить(Выборка.ИмяДляФормулы);
			КонецЕсли;

		ИначеЕсли ЗначениеЗаполнено(Выборка.ЗначениеПоУмолчанию) Тогда
		// Если отбор не задан, но реквизит со свойством ТолькоЧтение и заполненным значением по-умолчанию,
			// то проверяем на равенство значению по-умолчанию.
			ТолькоЧтение = Неопределено;
			Если ТипЗнч(Выборка.УпакованныеНастройки) = Тип("ХранилищеЗначения") Тогда
				УпакованныеНастройки = Выборка.УпакованныеНастройки.Получить();
				Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
					УпакованныеНастройки.Свойство("ТолькоЧтение", ТолькоЧтение);
				КонецЕсли;
			КонецЕсли;

			Если ТипЗнч(ТолькоЧтение) <> Тип("Булево") Тогда
				ТолькоЧтение = Выборка.ЗапретитьИзменение = Истина;
			КонецЕсли;

			Если ТолькоЧтение
					И ЗначениеРеквизитаОперации <> Выборка.ЗначениеПоУмолчанию Тогда
				ДопРеквизиты.Удалить(Выборка.ИмяДляФормулы);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	// 2. Дополнить значения реквизитов значениями по умолчанию
	Если Не ЗаполнятьЗначенияПоУмолчанию Тогда
		Возврат;
	КонецЕсли;

	ЗначенияДопРеквизитовПоУмолчанию = РеквизитыТиповойОперацииПоУмолчанию(ИдентификаторДокумента, ТиповаяОперация, Объект.Организация);

	Для каждого ТекЗначениеПоУмолчанию Из ЗначенияДопРеквизитовПоУмолчанию Цикл
		ЗначениеРеквизитаОперации = Неопределено;
		ЗначениеУжеЗадано = ДопРеквизиты.Свойство(ТекЗначениеПоУмолчанию.Ключ, ЗначениеРеквизитаОперации)
			И ЗначениеЗаполнено(ЗначениеРеквизитаОперации);

		Если НЕ ЗначениеУжеЗадано
				ИЛИ ТипЗнч(ЗначениеРеквизитаОперации) = Тип("Булево") Тогда

			ДопРеквизиты.Вставить(ТекЗначениеПоУмолчанию.Ключ, ТекЗначениеПоУмолчанию.Значение);

		КонецЕсли;

	КонецЦикла;

	УстановитьАктуальныеСчетаВСтруктуре(ДопРеквизиты, Объект.Дата, Объект.Организация);

КонецПроцедуры

Процедура УстановитьАктуальныеСчетаВСтруктуре(ЗначенияРеквизитов, Знач Дата,
		Организация) Экспорт

	Если Не ЗначениеЗаполнено(Дата) Тогда

		ЗначенияНастроек = Новый Структура("РабочаяДата");
		ЗаполнениеРеквизитовОбъектов.ПолучитьЗначенияНастроекПользователя(Пользователи.АвторизованныйПользователь(), ЗначенияНастроек);

		Если ЗначениеЗаполнено(ЗначенияНастроек.РабочаяДата) Тогда
			Дата = ЗначенияНастроек.РабочаяДата;
		Иначе
			Дата = ТекущаяДатаСеанса();
		Конецесли;

	КонецЕсли;

	ЗаменяемыеСчета = Новый ТаблицаЗначений;
	ЗаменяемыеСчета.Колонки.Добавить("ИмяДляФормулы", Новый ОписаниеТипов("Строка"));
	ЗаменяемыеСчета.Колонки.Добавить("КодСчета", Новый ОписаниеТипов("Строка"));
	ЗаменяемыеСчета.Колонки.Добавить("ИсходноеЗначение", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ЗаменяемыеСчета.Колонки.Добавить("НовоеЗначение", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));

	Для каждого ТекЗначение Из ЗначенияРеквизитов Цикл

		Если ТипЗнч(ТекЗначение.Значение) = Тип("ПланСчетовСсылка.ЕПСБУ")
				И ЗначениеЗаполнено(ТекЗначение.Значение) Тогда

			СтрокаЗамены = ЗаменяемыеСчета.Добавить();
			СтрокаЗамены.ИмяДляФормулы = ТекЗначение.Ключ;
			СтрокаЗамены.ИсходноеЗначение = ТекЗначение.Значение;

		КонецЕсли;

	КонецЦикла;

	Если ЗаменяемыеСчета.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СрокиДействияСчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ЗаменяемыеСчета.ВыгрузитьКолонку("ИсходноеЗначение"), "Код, ДатаНачалаДействия, ДатаОкончанияДействия, ЭлементГруппа");

	КодыСчетов = Новый Массив;
	ИспользуемыйСчет27 = СчетЭлемент27();
	ДатаНачала2021 = '20210101';

	Для каждого СтрокаПроверки Из ЗаменяемыеСчета Цикл

		ДанныеСчета = СрокиДействияСчетов.Получить(СтрокаПроверки.ИсходноеЗначение);
		СтрокаПроверки.КодСчета = ДанныеСчета.Код;
		
		Если ДанныеСчета.Код = "27" Тогда
			
			Если Дата >= ДатаНачала2021 Тогда
				// Используется новый счет 27.02
				СтрокаПроверки.НовоеЗначение = БухгалтерскийУчет.СчетПоКоду("27.02", Дата);
			ИначеЕсли ДанныеСчета.ЭлементГруппа Тогда
				СтрокаПроверки.НовоеЗначение = ИспользуемыйСчет27;
			Иначе
				СтрокаПроверки.НовоеЗначение = СтрокаПроверки.ИсходноеЗначение;
			КонецЕсли;
			
		ИначеЕсли ДанныеСчета.Код = "27.02" Тогда
			
			Если Дата < ДатаНачала2021 Тогда
				// Используетя старый счет 27
				СтрокаПроверки.НовоеЗначение = ИспользуемыйСчет27;
			Иначе
				СтрокаПроверки.НовоеЗначение = СтрокаПроверки.ИсходноеЗначение;
			КонецЕсли;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеСчета.ДатаНачалаДействия)
				И НЕ ЗначениеЗаполнено(ДанныеСчета.ДатаОкончанияДействия) Тогда
			
			СтрокаПроверки.НовоеЗначение = СтрокаПроверки.ИсходноеЗначение;
			
		Иначе
			
			КодыСчетов.Добавить(СтрокаПроверки.КодСчета);
		КонецЕсли;

		

	КонецЦикла;

	ИспользуемыеСчета = БухгалтерскийУчет.СписокСчетов(КодыСчетов, Дата, Истина, Организация);
	ДанныеСчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ИспользуемыеСчета, "Код");
	ДанныеПоКоду = Новый Соответствие;
	Для каждого ТекДанные Из ДанныеСчетов Цикл

		ДанныеПоКоду.Вставить(ТекДанные.Значение.Код, ТекДанные.Ключ);

	КонецЦикла;

	Для каждого ТекЗначение Из ЗаменяемыеСчета Цикл

		Если Не ЗначениеЗаполнено(ТекЗначение.НовоеЗначение) Тогда

			ТекЗначение.НовоеЗначение = ДанныеПоКоду.Получить(ТекЗначение.КодСчета);

		КонецЕсли;

		Если ТекЗначение.ИсходноеЗначение <> ТекЗначение.НовоеЗначение Тогда

			ЗначенияРеквизитов.Вставить(ТекЗначение.ИмяДляФормулы, ТекЗначение.НовоеЗначение);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ВыбранноеЗначениеСоответствуетОтбору(ЗначениеРеквизитаОперации,
		ПараметрыДанныхВыбора)

		// Если задан отбор, связи параметров выбора или предустановленный отбор, то проверяем
	// соответствует ли ранее выбранное значение новым отборам
	Если ПараметрыДанныхВыбора.Свойство("ПредустановленныйОтбор") Тогда
		НастройкаКомпоновщика = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПараметрыДанныхВыбора.ПредустановленныйОтбор);
	Иначе
		КомпоновщикНастроекКомпоновкиДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		НастройкаКомпоновщика = КомпоновщикНастроекКомпоновкиДанных.Настройки;
	КонецЕсли;
	// Добавим в отбор равенство выбранному значению для сокращения списка
	// Если выбранный элемент соответствует отбору, то будет получен только он,
	// иначе список будет пустой.
	ОтборСсылка = НастройкаКомпоновщика.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборСсылка.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	ОтборСсылка.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборСсылка.ПравоеЗначение = ЗначениеРеквизитаОперации;
	ОтборСсылка.Использование = Истина;
	ПараметрыДанныхВыбора.Вставить("ПредустановленныйОтбор", ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкаКомпоновщика));

	ТипЗначенияРеквизита = ТипЗнч(ЗначениеРеквизитаОперации);
	Если ТипЗначенияРеквизита = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
	// Для плана счетов особая проверка
		ТаблицаСчетов = ПланыСчетов.ЕПСБУ.ОбработкаПолученияДанныхВыбораСчетаЕПСБУ(ПараметрыДанныхВыбора);
		Возврат ТаблицаСчетов.Найти(ЗначениеРеквизитаОперации, "Ссылка") <> Неопределено;
	Иначе
	// Получим список подходящих значений
		ДанныеВыбора = ПолучитьДанныеВыбора(ТипЗнч(ЗначениеРеквизитаОперации), ПараметрыДанныхВыбора);
		Возврат ДанныеВыбора.НайтиПоЗначению(ЗначениеРеквизитаОперации) <> Неопределено;
	КонецЕсли;

КонецФункции

Функция ТиповаяОперацияПоДокументуОснованию(Основание, Объект)
	
	Возврат Справочники.ПравилаЗаполненияТиповойОперацииПриВводеНаОсновании.ПравилаЗаполнения(Основание, Объект);
	
КонецФункции

Функция ПолучитьЗначенияСохраненныхДопКолонок(ОбъектФормы)

	Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ОбъектФормы.Ссылка));

	УстановитьПривилегированныйРежим(Истина);
	ЗначенияДопКолонок = Справочники.ДополнительныеТабличныеЧастиДокументов.ДанныеДополнительныхТабличныхЧастей(Идентификатор, ОбъектФормы.Ссылка);
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ЗначенияДопКолонок;

КонецФункции

// Устанавливает типовую операцию и значения дополнительных реквизитов операции в реквизиты формы.
// Также заполняются реквизиты механизма Исправления ошибок.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения - форма документа:
//   * БухгалтерскиеОперации_ДобавленныеРеквизитыОперации - ТаблицаЗначений
//  ТиповаяОперация			 - СправочникСсылка.ТиповыеОперации - типовая операция документа
//  ЗначенияДопРеквизитов	 - Структура - значения дополнительных реквизитов.Ключ = ИмяДляФормулы.
//  ЗначенияДопКолонок		 - Неопределено - не используется. Оставлено для обратной совместимости.
//
Процедура ЗаполнитьДополнительныеРеквизитыВФорме(Форма, ТиповаяОперация,
		ЗначенияДопРеквизитов, ЗначенияДопКолонок = Неопределено) Экспорт
	Перем ЗначениеДопРеквизита;

	ИмяРеквизитаТиповаяОперация = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма);
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаТиповаяОперация) Тогда
		Форма[ИмяРеквизитаТиповаяОперация] = ТиповаяОперация;
	КонецЕсли;

	ДобавленныеРеквизитыОперации = Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"];

	ИменаТЧ = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
		ДобавленныеРеквизитыОперации.Выгрузить(, "ИмяТаблицы").ВыгрузитьКолонку("ИмяТаблицы"));
	ИмяРеквизитаБухгалтер = ВРег(БухгалтерскиеОперацииКлиентСервер.ИмяДляФормулыРеквизитаОтветственныйИсполнитель());
	СохраненныйБухгалтер = Справочники.Сотрудники.ПустаяСсылка();
	ИмяРеквизитаФормыБухгалтер = "";

	Для каждого ИмяТЧ Из ИменаТЧ Цикл

		РеквизитыТЧ = ДобавленныеРеквизитыОперации.НайтиСтроки(Новый Структура("ИмяТаблицы, ЭтоГруппа", ИмяТЧ, Ложь));

		Если ПустаяСтрока(ИмяТЧ) Тогда

			Для каждого РеквизитТиповойОперации Из РеквизитыТЧ Цикл

				Если РеквизитТиповойОперации.ИмяДляФормулы = "ТиповаяОперация" Тогда

					Продолжить;
				КонецЕсли;
				
				Если РеквизитТиповойОперации.ИмяДляФормулы = ИмяРеквизитаБухгалтер Тогда
					ЗначенияДопРеквизитов.Свойство("ОтветственныйИсполнитель", СохраненныйБухгалтер);
					ИмяРеквизитаФормыБухгалтер = РеквизитТиповойОперации.ИмяРеквизита;
				ИначеЕсли (РеквизитТиповойОперации.ИмяДляФормулы = "Курс"
						ИЛИ РеквизитТиповойОперации.ИмяДляФормулы = "Кратность") Тогда

					Если ЗначенияДопРеквизитов.Свойство(РеквизитТиповойОперации.ИмяДляФормулы, ЗначениеДопРеквизита) Тогда
						Форма[РеквизитТиповойОперации.ИмяРеквизита] = ЗначениеДопРеквизита;
					КонецЕсли;

				ИначеЕсли ЗначениеЗаполнено(РеквизитТиповойОперации.ИмяРеквизита)
						И ЗначениеЗаполнено(РеквизитТиповойОперации.ИмяДляФормулы) Тогда

					ЗначенияДопРеквизитов.Свойство(РеквизитТиповойОперации.ИмяДляФормулы, ЗначениеДопРеквизита);
					Форма[РеквизитТиповойОперации.ИмяРеквизита] = ЗначениеДопРеквизита;

				КонецЕсли;

			КонецЦикла;
		КонецЕсли;

	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИмяРеквизитаФормыБухгалтер) Тогда
		Форма[ИмяРеквизитаФормыБухгалтер] = СохраненныйБухгалтер;
	КонецЕсли;
	
	ИмяРеквизитаИсправлениеОшибок = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФлажокИсправлениеОшибокПрошлыхЛет();
	ЕстьРеквизитИсправлениеОшибок = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаИсправлениеОшибок);
	
	Если ЕстьРеквизитИсправлениеОшибок Тогда
		ПорядокИсправленияОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияДопРеквизитов,
			"ИсправлениеОшибки", Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.НеОшибка);
		ВыявительОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияДопРеквизитов,
			"ВыявительОшибки", Перечисления.ВыявительОшибокПрошлыхЛет.ПустаяСсылка());
		ПричинаОшибки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЗначенияДопРеквизитов,
			"ПричинаОшибки", Справочники.ПричиныОшибокПрошлыхЛет.ПустаяСсылка());
		ЭтоИсправлениеОшибки = ПорядокИсправленияОшибки = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаПрошлогоГода
			               ИЛИ ПорядокИсправленияОшибки = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаРанееПрошлогоГода;
		Форма[ИмяРеквизитаИсправлениеОшибок] = ЭтоИсправлениеОшибки;
		Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательИсправлениеОшибокПрошлыхЛет()] = ПорядокИсправленияОшибки;
		Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательВыявительОшибкиПрошлыхЛет()]   = ВыявительОшибки;
		Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательПричинаОшибкиПрошлыхЛет()]   = ПричинаОшибки;
	КонецЕсли;

КонецПроцедуры

Функция ТаблицаЗначенийИзМассива(МассивСтруктур)

	Таблица = Новый ТаблицаЗначений;

	Если МассивСтруктур.Количество() = 0 Тогда
		Возврат Таблица;
	КонецЕсли;

	Для каждого КолонкиСтроки Из МассивСтруктур[0] Цикл

		Таблица.Колонки.Добавить(КолонкиСтроки.Ключ);

	КонецЦикла;

	Для каждого ЗначениеСтроки Из МассивСтруктур Цикл

		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), ЗначениеСтроки);

	КонецЦикла;

	Возврат Таблица;

КонецФункции

// Устанавливает в форме свойство ТолькоПросмотр = Истина, если есть конфликты имен дополнительных колонок.
// Если в фороме подключена процедура БухгалтерскиеОперацииКлиент.ПриОткрытии, то
// будет выведено предупреждение с описанием причин запрета редактирования.
Процедура УстановитьТолькоПросмотрСКонфликтомИмен(Форма)

	Если Форма.СписокЭлементовСКонфликтамиИмен.Количество() > 0 Тогда
		Форма.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриОбработкеПолученияДанныхВыбораКОСГУ(ДанныеВыбора, Параметры,
		СтандартнаяОбработка) Экспорт
	Перем СтрокаПоиска;
	Перем ПредустановленныйОтбор;

	Если НЕ Параметры.Свойство("ПредустановленныйОтбор", ПредустановленныйОтбор)
			ИЛИ НЕ ЗначениеЗаполнено(ПредустановленныйОтбор) Тогда

		Возврат;
	КонецЕсли;

	Параметры.Вставить("ТекстЗапросаОтбора", "ВЫБРАТЬ
		|	КОСГУ.Ссылка,
		|	КОСГУ.ВерсияДанных,
		|	КОСГУ.ПометкаУдаления,
		|	КОСГУ.Родитель,
		|	КОСГУ.Код,
		|	КОСГУ.НаименованиеПолное,
		|	КОСГУ.Предопределенный,
		|	КОСГУ.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.КОСГУ КАК КОСГУ");
	Если Параметры.Свойство("СтрокаПоиска", СтрокаПоиска)
			И ЗначениеЗаполнено(СтрокаПоиска) Тогда
		НастройкаКомпоновки = ОбщегоНазначения.ЗначениеИзСтрокиXML(ПредустановленныйОтбор);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкаКомпоновки.Отбор, "Код", СтрокаПоиска, ВидСравненияКомпоновкиДанных.Содержит, , Истина);
		Параметры.Вставить("ПредустановленныйОтбор", ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкаКомпоновки));
	КонецЕсли;
	УстановитьОтборБыстрогоВыбораИзНастроекКомпоновки(ДанныеВыбора, Параметры, СтандартнаяОбработка);

КонецПроцедуры

// Процедура добавляет сообщение об ошибке в таблицу "ТаблицаОшибок" контекста проведения документа.
// Контекст может быть передан при вызове, если он не был передан, то он будет получен из временного
// хранилища и, после добавления ошибки, снова помещен во временное хранилище.
//
// Параметры:
//  ТекстОшибки			 - Строка - Текст ошибки,
//  ИмяПоляОшибки		 - Строка - имя поля, к которому относится ошибка,
//  Отказ				 - Булево - при выполнении всегда устанавливается = "Истина",
//  КонтекстПроведения	 - Структура - ранее полученный контекст проведения,
//						- Неопределено - будет получен сохраненный контекст.
Процедура ДобавитьСообщениеОбОшибке(ТекстОшибки, ИмяПоляОшибки = "",
		Отказ = Ложь, Знач КонтекстПроведения = Неопределено) Экспорт

	ПереданКонтекст = ЗначениеЗаполнено(КонтекстПроведения);
	Если Не ПереданКонтекст Тогда
		КонтекстПроведения = ПолучитьКонтекстЗаполненияОперации();
	КонецЕсли;
	Если КонтекстПроведения = Неопределено
			ИЛИ КонтекстПроведения.ТаблицаОшибок = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ИмяПоляОшибки);
	Иначе
		ТаблицаОшибок = КонтекстПроведения.ТаблицаОшибок;
		Если ТаблицаОшибок.Найти(ИмяПоляОшибки, "ИмяПоля") = Неопределено Тогда
			НоваяОшибка = КонтекстПроведения.ТаблицаОшибок.Добавить();
			НоваяОшибка.ИмяПоля = ИмяПоляОшибки;
			НоваяОшибка.ТекстСообщения = ТекстОшибки;
		КонецЕсли;
	КонецЕсли;
	Если Не ПереданКонтекст Тогда
		СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	КонецЕсли;

	Отказ = Истина;

КонецПроцедуры

// Возвращает Истина, если для данной типовой операции нужно вести оценку производительности.
// При этом в параметр КлючеваяОперация возвращается соответствующая Ключевая операция
//
//	Параметры:
//	ТиповаяОперация - СправочникСсылка.ТиповыеОперации
//	КлючеваяОперация - Произвольный - в этот параметр присваивается ключевая операция - СправочникСсылка.КлючевыеОперации
//	Возвращаемое значение:
//	Булево
//
Функция ПоТиповойОперацииВедетсяОценкаПроизводительности(ТиповаяОперация,
		Условие, КлючеваяОперация = Неопределено) Экспорт
	Результат = Ложь;

	МассивПроверяемыхФункций = Новый Массив;
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.КоличествоМЗвПутиДостаточноДляСписания");
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.КоличествоНоменклатурыДостаточноДляСписания");
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.КоличествоОСвПутиДостаточноДляСписания");
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.КоличествоОСДостаточноДляСписания");
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.МожноПровестиСписаниеОСВОперУчете");
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.МожноПровестиСписаниеОСЗабаланс");
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.ПодготовитсяКСписаниюОСБаланс");
	МассивПроверяемыхФункций.Добавить("БухгалтерскиеОперации.РассчитатьСтоимостьВложенияВНФА");

	МассивФункцийМЗ = Новый Массив;
	МассивФункцийМЗ.Добавить("БухгалтерскиеОперации.КоличествоМЗвПутиДостаточноДляСписания");

	Если ТиповаяОперация = Справочники.ТиповыеОперации.ЗакрытиеПроизводственныхСчетов_ЗакрытиеПроизводственныхСчетов Тогда
		Результат = Истина;
		КлючеваяОперация = "ФормированиеПроводокЗакрытиеСчетов";
	ИначеЕсли НЕ ПустаяСтрока(Условие) Тогда
		Для Каждого ТекФункция Из МассивПроверяемыхФункций Цикл
			Если Найти(Условие, ТекФункция) <> 0 Тогда
				Результат = Истина;
				Если МассивФункцийМЗ.Найти(ТекФункция) <> Неопределено Тогда
					КлючеваяОперация = "ФормированиеПроводокРасчетСебестоимостиМЗ";
				Иначе
					КлючеваяОперация = "ФормированиеПроводокРасчетСебестоимостиОС";
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Заполняет данные выбора в соответствии с отбором из настройки типовой операции. В параметр ДополнительныйОтбор можно
// передать массив элементов, который будет добавлен в отбор в виде условия (И Ссылка В Списке (ДополнительныйОтбор)).
// Сам отбор компоновки данных передается в параметре формы "ПредустановленныйОтбор" в сериализованном виде.
// 
// Параметры
//	ДанныеВыбора - Неопределено - в случае получения необходимого отбора или передачи в процедуру массива элементов 
// 				    			  в параметре ДополнительныйОтбор, в параметр помещается список элементов выбора. При этом
//								  параметр СтандартнаяОбработка будет установлен в Ложь.
//	Параметры - Структура - параметры формы.
//	СтандартнаяОбработка - Булево - признак стандартной обработки.
// 	ДополнительныйОтбор - Массив - массив элементов, который добавляется к условию выборки.
//	
Процедура УстановитьОтборБыстрогоВыбораИзНастроекКомпоновки(ДанныеВыбора,
		Параметры, СтандартнаяОбработка, ДополнительныйОтбор = Неопределено,
		НеСортировать = Ложь) Экспорт

	Если Параметры.Свойство("ПредустановленныйОтбор")
			И Параметры.Свойство("ТекстЗапросаОтбора") Тогда
			// передан отбор из настойки типовой операции
		Настройки = Параметры.ПредустановленныйОтбор;

		Если ТипЗнч(Настройки) = Тип("Строка") Тогда
			НастройкиКомпоновки = ОбщегоНазначения.ЗначениеИзСтрокиXML(Настройки);

			Если ТипЗнч(ДополнительныйОтбор) = Тип("Массив") Тогда
				ЭлементОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				ЭлементОтбора.ПравоеЗначение = ДополнительныйОтбор;
				ЭлементОтбора.Использование = Истина;
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;

		СхемаКомпоновки = Новый СхемаКомпоновкиДанных;

		ИсточникДанных = СхемаКомпоновки.ИсточникиДанных.Добавить();
		ИсточникДанных.ТипИсточникаДанных = "Local";
		ИсточникДанных.Имя = "ЭтаИБ";

		НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
		НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
		НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
		НаборДанных.Имя = "РеквизитыДокумента";
		НаборДанных.Запрос = Параметры.ТекстЗапросаОтбора;

		Поле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		Поле.Поле = "Ссылка";
		Поле.ПутьКДанным = "Ссылка";

		Поле = НастройкиКомпоновки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		Поле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
		Поле.Использование = Истина;

		Группировка = НастройкиКомпоновки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		Группировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));

		Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
		Компоновщик.ЗагрузитьНастройки(НастройкиКомпоновки);

		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновки, Компоновщик.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		МассивОтобранныхЭлементов = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных).ВыгрузитьКолонку("Ссылка");

		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(МассивОтобранныхЭлементов);
		СтандартнаяОбработка = Ложь;
	ИначеЕсли ТипЗнч(ДополнительныйОтбор) = Тип("Массив") Тогда
	// передан массив элементов
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(ДополнительныйОтбор);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;

	Если ТипЗнч(ДанныеВыбора) = Тип("СписокЗначений") И НЕ НеСортировать Тогда
		ДанныеВыбора.СортироватьПоЗначению();
	КонецЕсли;

КонецПроцедуры

// Функция определяет наличие проведенного документа "Сторно", сторнирующего текущий документа "Ссылка".
// В параметр СсылкаНаСторно передается ссылка на документ сторно.
//
Функция ДокументСторнирован(Ссылка, СсылкаНаСторно = Неопределено) Экспорт

	Если Ссылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Сторно.Ссылка
		|ИЗ
		|	Документ.Сторно КАК Сторно
		|ГДЕ
		|	Сторно.Проведен
		|	И Сторно.ДокументОснование = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	СсылкаНаСторно = Выборка.Ссылка;
	Возврат Истина;

КонецФункции

// Заполняет колонки "ВидСубконтоХХХ" таблицы проводок.
// ВидСубконтоДт1, ВидСубконтоДт2 и т.д.
//
Процедура ПроверитьЗаполнениеВидовСубконтоТаблицыПроводок(ТаблицаПроводок) Экспорт
	ДополнитьКолонкиТаблицыПроводок(ТаблицаПроводок);

	Для каждого ТекПроводка Из ТаблицаПроводок Цикл

		Если ЗначениеЗаполнено(ТекПроводка.СчетДт) Тогда

			Счетчик = 0;
			Для каждого ТекВидСубконто Из ТекПроводка.СчетДт.ВидыСубконто Цикл
				Счетчик = Счетчик + 1;
				Если Не ЗначениеЗаполнено(ТекПроводка["ВидСубконтоДт" + Счетчик]) Тогда
					ТекПроводка["ВидСубконтоДт" + Счетчик] = ТекВидСубконто.ВидСубконто;
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;

		Если ЗначениеЗаполнено(ТекПроводка.СчетКт) Тогда

			Счетчик = 0;
			Для каждого ТекВидСубконто Из ТекПроводка.СчетКт.ВидыСубконто Цикл
				Счетчик = Счетчик + 1;
				Если Не ЗначениеЗаполнено(ТекПроводка["ВидСубконтоКт" + Счетчик]) Тогда
					ТекПроводка["ВидСубконтоКт" + Счетчик] = ТекВидСубконто.ВидСубконто;
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;

	КонецЦикла;
КонецПроцедуры

// Рассчитывает реквизиты операции: Дата, Организация, Условие, ТекстСообщенияПриОшибке.
// Если в параметр ТребуемыеДанные передается структура, содержащая только часть из перечисленых реквизитов, то будут
// рассчитываться не все данные, а только перечисленные в структуре.
// Если ТребуемыеДанные = Неопределено, то будут вычислены все поля. Результат будет помещен в структуру в этот параметр.
// 
// Параметры:
//	ТиповаяОперация - СправочникСсылка.ТиповыеОперации
//	ИсточникДанных - см. СоздатьИсточникДанныхИзШапкиОбъекта
//	ТребуемыеДанные - Структура, Неопределено - в структуре должны быть заданы 
//
Процедура РассчитатьРеквизитыОперации(ТиповаяОперация, ИсточникДанных,
		ТребуемыеДанные) Экспорт

	Если ТипЗнч(ТребуемыеДанные) <> Тип("Структура") Тогда
		ТребуемыеДанные = Новый Структура("Дата, Организация, УсловиеФормирования");
		ТребуемыеДанные.Вставить("ТекстСообщенияПриОшибке", "");
	КонецЕсли;

	ДанныеТиповойОперации = Справочники.ТиповыеОперации.ДанныеТиповойОперации(ТиповаяОперация,
		"СхемаПроверкиУсловия, ТекстСообщенияПриОшибке");

	Если ДанныеТиповойОперации.СхемаПроверкиУсловия = Неопределено Тогда
		ТребуемыеДанные.Вставить("ТекстСообщенияПриОшибке", НСтр("ru = 'Не задана схема проверки условия.
			|Проверьте корректность заданной формулы проверки условия типовой операции.'"));
		Возврат;
	КонецЕсли;

	СхемаПроверкиУсловия = ДанныеТиповойОперации.СхемаПроверкиУсловия.Получить();
	Если ТипЗнч(СхемаПроверкиУсловия) <> Тип("СхемаКомпоновкиДанных") Тогда
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрацииВычислениеУсловия(),
			УровеньЖурналаРегистрации.Ошибка,
			ТиповаяОперация.Метаданные(),
			ТиповаяОперация,
			НСтр("ru='В типовой операции отстутствует схема вычисления условия'", ОбщегоНазначения.КодОсновногоЯзыка()));
		ТекстСообщения = НСтр("ru='Для формирования проводок выбранная типовая операция должна быть переформирована.
			|Откройте Типовую операцию и нажмите кнопку Записать'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ВызватьИсключение "Отсутствует схема заполнения даты и организации для операции";
	КонецЕсли;

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиСхемы = Новый КомпоновщикНастроекКомпоновкиДанных;

	НастройкиСхемы.ЗагрузитьНастройки(СхемаПроверкиУсловия.НастройкиПоУмолчанию);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаПроверкиУсловия);
	НастройкиСхемы.Инициализировать(ИсточникНастроек);

	Если ТипЗнч(ТребуемыеДанные) = Тип("Структура") Тогда
		Для каждого ТекЭлементВыбора Из НастройкиСхемы.Настройки.Выбор.Элементы Цикл

			Если Не ТребуемыеДанные.Свойство(Строка(ТекЭлементВыбора.Поле)) Тогда
				ТекЭлементВыбора.Использование = Ложь;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

	ПолеОшибки = СхемаПроверкиУсловия.ВычисляемыеПоля.Найти("ТекстСообщенияПриОшибке");
	Если ПустаяСтрока(ДанныеТиповойОперации.ТекстСообщенияПриОшибке) Тогда
		ПолеОшибки.Выражение = """Не выполнено условие формирования операции!""";
	Иначе
		ПолеОшибки.Выражение = """"
			+ СтрЗаменить(ДанныеТиповойОперации.ТекстСообщенияПриОшибке, """", """""")
			+ """";
	КонецЕсли;
	
	ДобавитьФактическуюДатуПроведенияВФормулуДата(ИсточникДанных, СхемаПроверкиУсловия);

	Попытка
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаПроверкиУсловия, НастройкиСхемы.Настройки, , ,
			Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Исключение
		ТребуемыеДанные.Вставить("ТекстСообщенияПриОшибке",
			НСтр("ru = 'Ошибка вычисления условия формирования операции.
				|Проверьте корректность заданной формулы проверки условия типовой операции.'"));
		ВызватьИсключение НСтр("ru = 'Ошибка вычисления условия формирования операции'");
	КонецПопытки;

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ИсточникДанных, , Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ПроцессорВывода.УстановитьОбъект(Новый ТаблицаЗначений);
	Попытка

		ТаблицаРезультатУсловия = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

		Если ТаблицаРезультатУсловия.Количество() = 0 Тогда
			ЗаписьЖурналаРегистрации(
				СобытиеЖурналаРегистрацииВычислениеУсловия(),
				УровеньЖурналаРегистрации.Ошибка,
				ТиповаяОперация.Метаданные(),
				ТиповаяОперация,
				НСтр("ru='В результирующей таблице 0 записей'", ОбщегоНазначения.КодОсновногоЯзыка()));
			ТекстСообщения = НСтр("ru='Ошибка инициализации типовой операции. Подробности в журнале регистрации.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ВызватьИсключение "ТаблицаРезультатУсловия.Количество() = 0";
		Иначе
			ЗаполнитьЗначенияСвойств(ТребуемыеДанные, ТаблицаРезультатУсловия[0]);
		КонецЕсли;

	Исключение
		ЗаписьЖурналаРегистрации(
			СобытиеЖурналаРегистрацииВычислениеУсловия(),
			УровеньЖурналаРегистрации.Ошибка,
			ТиповаяОперация.Метаданные(),
			ТиповаяОперация,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ТекстСообщения = НСтр("ru='Ошибка инициализации типовой операции. Подробности в журнале регистрации.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;

КонецПроцедуры

Процедура ДобавитьФактическуюДатуПроведенияВФормулуДата(ИсточникДанных, СхемаПроверкиУсловия)
	Если Не ПрименяетсяОтдельнаяДатаПроведенияДокументаИзРегистра(ТипЗнч(ИсточникДанных.ШапкаДокумента[0].Ссылка)) Тогда
		Возврат;
	КонецЕсли;
	ПолеПериод = СхемаПроверкиУсловия.ВычисляемыеПоля.Найти("Дата");
	ПолеПериод.Выражение =
		"ВЫБОР
		|	КОГДА ЗНАЧЕНИЕЗАПОЛНЕНО(ФактическаяДатаПроведения)
		|		ТОГДА ФактическаяДатаПроведения
		|	ИНАЧЕ "
		+ ПолеПериод.Выражение
		+ "
		|	КОНЕЦ";
	НаборДанныеДокумента = СхемаПроверкиУсловия.НаборыДанных.Найти("ШапкаДокумента");
	ПолеДатаПроведения = НаборДанныеДокумента.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеДатаПроведения.Поле = "ФактическаяДатаПроведения";
	ПолеДатаПроведения.ПутьКДанным = "ФактическаяДатаПроведения";
КонецПроцедуры

// Получает бухгалтерскую операцию документа из регистра ОперацииДокументов
//
// Параметры
//  Документ  - ДокументСсылка - ссылка на документ
//
// Возвращаемое значение:
//   СправочникСсылка.ТиповыеОперации   - Ссылка на типовую операцию или пустая ссылка.
//
Функция БухгалтерскаяОперацияДокумента(Документ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ОперацииДокументов.Операция
		|ИЗ
		|	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
		|ГДЕ
		|	ОперацииДокументов.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда

		Возврат Справочники.ТиповыеОперации.ПустаяСсылка();

	КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Операция;

КонецФункции

// Функция возвращает структуру содержающую значения, вычисленные из формул типовой операции
// "Дата" - дата операции, "Организация" - организация операции
// Параметры
// Документ - ДокументОбъект
// Операция - СправочникСсылка.ТиповыеОперации
//
// Возвращаемое значение:
// Структура
//
Функция ПолучитьДатуИОрганизациюОперации(Знач Документ, Операция) Экспорт
	ДатаОрганизация = Новый Структура("Дата, Организация");
	РассчитатьРеквизитыОперации(Операция, СоздатьИсточникДанныхИзШапкиОбъекта(Документ, Операция), ДатаОрганизация);
	Возврат ДатаОрганизация;
КонецФункции

// Функция возвращает "Истина" если в журнале проводок есть проводки с регистратором "Ссылка".
//
Функция ЕстьПроводкиДокумента(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
		|ГДЕ
		|	ЖурналПроводокЕПСБУ.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	УстановитьПривилегированныйРежим(Истина);
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Возвращает сохраненные значения дополнительных реквизитов операции.
// Возвращает структуру, в которой "Ключ" - ИмяДляФормулы реквизита, "Значение" - значение реквизита.
// Если в базе ведется валютный учет и в документе может учитываться Валюта, добавляются ключи
// "Курс" и "Кратность".
//
// Параметры
//  Документ  - ДокументСсылка - Документ
//  ТиповаяОперация  - СправочникСсылка.ТиповыеОперации - не используется. Оставлена для обработной совместимости.
//  ВалютныйДокумент - Булево - признак использования Валюты в документе. Если не передан, определяется автоматически.
//
// Возвращаемое значение:
//   Структура   - Структура сохраненных дополнительных реквизитов
//
Функция ЗаполнитьДополнительныеРеквизиты(Документ, ТиповаяОперация = Неопределено,
		Знач ВалютныйДокумент = Неопределено) Экспорт

	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	Если ВалютныйДокумент = Неопределено Тогда
		ВалютныйДокумент = ИспользоватьВалютныйУчет
			И ОбщегоНазначенияБГУ.ЕстьРеквизитДокумента("ВалютаДокумента", Документ.Метаданные());
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации,
	|	ЗначенияДополнительныхРеквизитовОпераций.Значение,
	|	ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации.ИмяДляФормулы КАК ИмяДляФормулы
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	|ГДЕ
	|	ЗначенияДополнительныхРеквизитовОпераций.Объект = &Документ
	|	И
	|		ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации <> ЗНАЧЕНИЕ(Справочник.РеквизитыТиповыхОпераций.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОперацииДокументов.ИсправлениеОшибки,
	|	ОперацииДокументов.ВыявительОшибки,
	|	ОперацииДокументов.ПричинаОшибки,
	|	ОперацииДокументов.ОтветственныйИсполнитель,
	|	Истина Как ВалютныеПоля
	|ИЗ
	|	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|ГДЕ
	|	ОперацииДокументов.Документ = &Документ";
	
	Если ИспользоватьВалютныйУчет Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Истина Как ВалютныеПоля",
			"ЕСТЬNULL(ОперацииДокументов.Курс, 1) КАК Курс,
			|ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК Кратность")
	КонецЕсли;
	Запрос.УстановитьПараметр("Документ", Документ);

	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДопРеквизиты = Новый Структура;
	Выборка = РезультатЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл

		ДопРеквизиты.Вставить(Выборка.ИмяДляФормулы, Выборка.Значение);

	КонецЦикла;

	Курс = 0;
	Кратность = 0;
	ИсправлениеОшибки = Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ПустаяСсылка();
	ВыявительОшибки = Перечисления.ВыявительОшибокПрошлыхЛет.ПустаяСсылка();
	ПричинаОшибки = Справочники.ПричиныОшибокПрошлыхЛет.ПустаяСсылка();
	ОтветственныйИсполнитель = Справочники.Сотрудники.ПустаяСсылка();

	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		ИсправлениеОшибки = Выборка.ИсправлениеОшибки;
		ВыявительОшибки = Выборка.ВыявительОшибки;
		ПричинаОшибки = Выборка.ПричинаОшибки;
		ОтветственныйИсполнитель = Выборка.ОтветственныйИсполнитель;
		Если ИспользоватьВалютныйУчет И ВалютныйДокумент Тогда
			Курс = Выборка.Курс;
			Кратность = Выборка.Кратность;
		КонецЕсли;
	КонецЕсли;
	
	ДопРеквизиты.Вставить("ИсправлениеОшибки", ИсправлениеОшибки);
	ДопРеквизиты.Вставить("ВыявительОшибки",   ВыявительОшибки);
	ДопРеквизиты.Вставить("ПричинаОшибки",     ПричинаОшибки);
	ДопРеквизиты.Вставить("ОтветственныйИсполнитель", ОтветственныйИсполнитель);
	
	Если ИспользоватьВалютныйУчет И ВалютныйДокумент Тогда

		ДопРеквизиты.Вставить("Курс", ?(Курс = 0, 1, Курс));
		ДопРеквизиты.Вставить("Кратность", ?(Кратность = 0, 1, Кратность));

	КонецЕсли;

	Возврат ДопРеквизиты;

КонецФункции

// Возвращает реквизиты операции и саму операцию документа
//  Параметры:
//			ДокументСсылка - ссылка на документ
//			ИсходныйСписокРеквизитов -  1. строка содержащая название нужных реквизитов через запятую
//										2. структура содержащая нужные реквизиты 
//										
Функция ПолучитьРеквизитыОперации(ДокументСсылка,
		ИсходныйСписокРеквизитов = "Операция") экспорт
	Если ТипЗнч(ИсходныйСписокРеквизитов) = Тип("Строка") тогда
		СписокРеквизитов = Новый Структура(ИсходныйСписокРеквизитов);
	ИначеЕсли ТипЗнч(ИсходныйСписокРеквизитов) = Тип("Структура") тогда
		СписокРеквизитов = ОбщегоНазначения.СкопироватьРекурсивно(ИсходныйСписокРеквизитов);
	ИначеЕсли ТипЗнч(ИсходныйСписокРеквизитов) <> Тип("Структура") тогда
		СписокРеквизитов = Новый Структура();
	КонецЕсли;
	Реквизиты = Новый Массив;
	Для каждого Ключ из СписокРеквизитов цикл
		Реквизиты.Добавить(Ключ.Ключ);
	КонецЦикла;
	ТекстЗапроса = "ВЫБРАТЬ
		|	ОперацииДокументов.Курс КАК Курс,
		|	ОперацииДокументов.Кратность КАК Кратность,
		|	ОперацииДокументов.Операция
		|ПОМЕСТИТЬ ОперацияДокумента
		|ИЗ
		|	РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
		|ГДЕ
		|	ОперацииДокументов.Документ = &Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации.ИмяДляФормулы КАК Ключ,
		|	ЗначенияДополнительныхРеквизитовОпераций.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
		|ГДЕ
		|	ЗначенияДополнительныхРеквизитовОпераций.Объект = &Документ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Операция"",
		|	ЕСТЬNULL(ОперацияДокумента.Операция, Значение(Справочник.ТиповыеОперации.ПустаяСсылка))
		|ИЗ
		|	ОперацияДокумента КАК ОперацияДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Курс"",
		|	ЕСТЬNULL(ОперацияДокумента.Курс, 0)
		|ИЗ
		|	ОперацияДокумента КАК ОперацияДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Кратность"",
		|	ЕСТЬNULL(ОперацияДокумента.Кратность, 0)
		|ИЗ
		|	ОперацияДокумента КАК ОперацияДокумента";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);

	УстановитьПривилегированныйРежим(Истина);

	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() цикл
		Если СписокРеквизитов.Свойство(Результат.Ключ) тогда
			СписокРеквизитов[Результат.Ключ] = Результат.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат СписокРеквизитов;
КонецФункции

// Возвращает массив имен табличных частей документа, используемых при формировании проводок.
// Если имя табличной части не заполнено, то вставляется имя "Документ".
//
// Параметры:
// ТиповаяОперация - СправочникСсылка.ТиповыеОперации - ссылка на типовую операцию.
//
// Возвращаемое значение:
// Массив - Массив имен табличных частей.
//
Функция ПолучитьИспользуемыеВПроводкахТЧ(ТиповаяОперация) Экспорт
	Перем ПоставляемаяТиповаяОперация;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента = """"
		|				ИЛИ ПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента = ""<>""
		|			ТОГДА ""Документ""
		|		ИНАЧЕ ПроводкиТиповыхОпераций.ИмяТабличнойЧастиДокумента
		|	КОНЕЦ КАК ИмяТабличнойЧастиДокумента
		|ИЗ
		|	Справочник.ПроводкиТиповыхОпераций КАК ПроводкиТиповыхОпераций
		|ГДЕ
		|	ПроводкиТиповыхОпераций.Владелец = &ТиповаяОперация";
	Если Справочники.ТиповыеОперации.ТиповаяОперацияНеРедактируется(ТиповаяОперация, ПоставляемаяТиповаяОперация) Тогда

		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ПроводкиТиповыхОпераций", "Справочник.ПоставляемыеПроводкиТиповыхОпераций");
		Запрос.УстановитьПараметр("ТиповаяОперация", ПоставляемаяТиповаяОперация);

	Иначе

		Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);

	КонецЕсли;

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяТабличнойЧастиДокумента");
КонецФункции

Функция СформироватьСхемуУсловияТиповойОперации(ДанныеТиповойОперации,
		ОписаниеОшибки = "") Экспорт
	Перем РеквизитыТиповойОперации;
	Перем ДополнительныеРеквизитыОперации;
	Перем ТиповаяОперация;

	ДанныеТиповойОперации.Свойство("ДанныеОперации", РеквизитыТиповойОперации);
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(
		РеквизитыТиповойОперации.ИдентификаторДокумента, Ложь);
	Если ТипЗнч(МетаданныеДокумента) <> Тип("ОбъектМетаданных") Тогда
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииИзменение(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			НСтр("ru = 'В метаданных не найден документ, к которому относится типовая операция'"));
		Возврат Неопределено;
	КонецЕсли;

	РеквизитыКЭКПроводки = Новый Массив;

	ДанныеТиповойОперации.Свойство("ТиповаяОперация", ТиповаяОперация);
	ДанныеТиповойОперации.Свойство("ДополнительныеРеквизиты", ДополнительныеРеквизитыОперации);

	СхемаКомпоновкиУсловие = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиУсловие.ИсточникиДанных.Добавить();
	ИсточникДанных.ТипИсточникаДанных = "Local";
	ИсточникДанных.Имя = "ИсточникДанных1";

	НаборДанных = СхемаКомпоновкиУсловие.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "ШапкаДокумента";
	НаборДанных.ИсточникДанных = СхемаКомпоновкиУсловие.ИсточникиДанных[0].Имя;
	НаборДанных.ИмяОбъекта = "ШапкаДокумента";

	ТипЗначенияПараметра = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ТиповаяОперация)));

	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "Ссылка", "Документ", "", Новый ОписаниеТипов("ДокументСсылка."
		+ МетаданныеДокумента.Имя));
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "Дата", "Документ", "", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты()));
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "Номер", "Документ", "", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(15)));
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "ТиповаяОперация", "", "", ТипЗначенияПараметра);
	Для Каждого ТекДопРеквизит Из ДополнительныеРеквизитыОперации Цикл
		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ТекДопРеквизит.ИмяДляФормулы, "ДополнительныеРеквизиты", , ?(ТекДопРеквизит.РеквизитПроводкиТипЗначения = Неопределено, Новый ОписаниеТипов("Неопределено"), ТекДопРеквизит.РеквизитПроводкиТипЗначения));
	КонецЦикла;

	Для каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл

		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ТекРеквизит.Имя, "Документ", , ТекРеквизит.Тип);

	КонецЦикла;

	ТекРеквизит = МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента");
	Если ТекРеквизит <> Неопределено Тогда
		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ТекРеквизит.Имя, "Документ", , ТекРеквизит.Тип);
	КонецЕсли;

	ПолеДата = СхемаКомпоновкиУсловие.ВычисляемыеПоля.Добавить();
	ПолеДата.ПутьКДанным = "Дата";
	Формула = "";
	ОбработатьФормулуРеквизитаПроводки(РеквизитыТиповойОперации.ФормулаДата, Формула, "", Новый Массив, "", "", ОписаниеОшибки, , , РеквизитыКЭКПроводки);
	ПолеДата.Выражение = Формула; //ОбработаннаяФормулаРеквизитаПроводки(РеквизитыТиповойОперации.ФормулаДата, "", Новый Массив, ОписаниеОшибки);
	ПолеДата.ТипЗначения = Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
	ПолеДата.Заголовок = "Дата";

	ПолеОрганизация = СхемаКомпоновкиУсловие.ВычисляемыеПоля.Добавить();
	ПолеОрганизация.ПутьКДанным = "Организация";
	Формула = "";
	ОбработатьФормулуРеквизитаПроводки(РеквизитыТиповойОперации.ФормулаОрганизация, Формула, "", Новый Массив, "", "", ОписаниеОшибки, , , РеквизитыКЭКПроводки);
	ПолеОрганизация.Выражение = Формула;
	ПолеОрганизация.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ПолеОрганизация.Заголовок = "Организация";

	ПолеУсловие = СхемаКомпоновкиУсловие.ВычисляемыеПоля.Добавить();
	ПолеУсловие.ПутьКДанным = "УсловиеФормирования";
	Если ПустаяСтрока(РеквизитыТиповойОперации.Условие) Тогда
		ПолеУсловие.Выражение = "Истина";
	Иначе
		Формула = "";
		ОбработатьФормулуРеквизитаПроводки(РеквизитыТиповойОперации.Условие, Формула, "", Новый Массив, "", "", ОписаниеОшибки, , , РеквизитыКЭКПроводки);
		ПолеУсловие.Выражение = Формула;
	КонецЕсли;
	ПолеУсловие.ТипЗначения = Новый ОписаниеТипов("Булево");
	ПолеУсловие.Заголовок = "УсловиеФормирования";

	ПолеТекстПриОшибке = СхемаКомпоновкиУсловие.ВычисляемыеПоля.Добавить();
	ПолеТекстПриОшибке.ПутьКДанным = "ТекстСообщенияПриОшибке";
	ПолеТекстПриОшибке.Выражение = "Выразить(Выбор Когда Подстрока(ТиповаяОперация.ТекстСообщенияПриОшибке,1,100)="""" Тогда ""Не выполнено условие формирования операции!"" Иначе ТиповаяОперация.ТекстСообщенияПриОшибке Конец, ""Строка"")";
	ПолеТекстПриОшибке.Заголовок = "ТекстСообщенияПриОшибке";

	ПолеВывода = СхемаКомпоновкиУсловие.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеВывода.Поле = Новый ПолеКомпоновкиДанных("Дата");
	//ПолеВывода.Использование = Истина;
	ПолеВывода = СхемаКомпоновкиУсловие.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеВывода.Поле = Новый ПолеКомпоновкиДанных("Организация");
	ПолеВывода = СхемаКомпоновкиУсловие.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеВывода.Поле = Новый ПолеКомпоновкиДанных("УсловиеФормирования");
	ПолеВывода = СхемаКомпоновкиУсловие.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ПолеВывода.Поле = Новый ПолеКомпоновкиДанных("ТекстСообщенияПриОшибке");

	Структура = СхемаКомпоновкиУсловие.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));

	Возврат СхемаКомпоновкиУсловие;

КонецФункции

Функция СформироватьСхемуФормированияПроводок(ДанныеТиповойОперации,
		ОписаниеОшибки = "") Экспорт
	Перем РеквизитыТиповойОперации;
	Перем ЗначенияРеквизитовПроводок;
	Перем ДополнительныеРеквизитыОперации;
	Перем ДополнительныеИсточникиДанных;

	ДанныеТиповойОперации.Свойство("ДанныеОперации", РеквизитыТиповойОперации);
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(
		РеквизитыТиповойОперации.ИдентификаторДокумента, Ложь);
	Если ТипЗнч(МетаданныеДокумента) <> Тип("ОбъектМетаданных") Тогда
		ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииИзменение(),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			НСтр("ru = 'В метаданных не найден документ, к которому относится типовая операция'"));
		Возврат Неопределено;
	КонецЕсли;
	
	СхемаКомпоновки = Справочники.ТиповыеОперации.ПолучитьМакет("ОбразецСКД");
	ДанныеТиповойОперации.Свойство("Проводки", ЗначенияРеквизитовПроводок);
	ДанныеТиповойОперации.Свойство("ДополнительныеРеквизиты", ДополнительныеРеквизитыОперации);
	ДанныеТиповойОперации.Свойство("ДополнительныеИсточникиДанных", ДополнительныеИсточникиДанных);

	ЕстьВалютаВДокументе = МетаданныеДокумента.Реквизиты.Найти("ВалютаДокумента") <> Неопределено;

	НастройкаПроводок = ПустаяТаблицаНастройкиПроводок();
	Символ0 = Символ(0);

	Для каждого ТекСтрокаПроводки Из ЗначенияРеквизитовПроводок Цикл

		НастройкаНовойПроводки = НастройкаПроводок.Добавить();
		НастройкаНовойПроводки.ТекущаяПроводка = ТекСтрокаПроводки.Ссылка;
		НастройкаНовойПроводки.КодПроводки = ИмяПараметраПроводка(ТекСтрокаПроводки.Ссылка);

		ОбщиеПараметрыЗаполнения = Новый Структура();
		ОбщиеПараметрыЗаполнения.Вставить("ТекСтрокаПроводки", ТекСтрокаПроводки);
		ОбщиеПараметрыЗаполнения.Вставить("ВычисляемыеПоля", СхемаКомпоновки.ВычисляемыеПоля);
		ОбщиеПараметрыЗаполнения.Вставить("НастройкаНовойПроводки", НастройкаНовойПроводки);
		ОбщиеПараметрыЗаполнения.Вставить("ИспользуемыеРеквизиты", Новый Массив);
		ОбщиеПараметрыЗаполнения.Вставить("ОписаниеОшибки", "");
		ОбщиеПараметрыЗаполнения.Вставить("РеквизитыКЭКПроводки", Новый Массив);

		ВычислитьФормулыЗаполненияРеквизитов(ОбщиеПараметрыЗаполнения);

		Если Не ПустаяСтрока(ОбщиеПараметрыЗаполнения.ОписаниеОшибки) Тогда
			ОписаниеОшибки = ОбщиеПараметрыЗаполнения.ОписаниеОшибки;
			Возврат Неопределено;
		КонецЕсли;

		ЗаменитьФункциюКЭКПроводки(ОбщиеПараметрыЗаполнения);

		РеквизитыДляПроверки = Новый Массив;
		Для каждого ТекПоле Из ОбщиеПараметрыЗаполнения.ИспользуемыеРеквизиты Цикл

			Если ТекПоле.ИспользуемыеРеквизиты.Количество() > 0 Тогда
				РеквизитыДляПроверки.Добавить(ТекПоле.ИмяПоля);
			КонецЕсли;

		КонецЦикла;

		Пока РеквизитыДляПроверки.Количество() > 0 Цикл

			ЕстьОбработанныеПоля = Ложь;
			ПоляКУдалению = Новый Массив;
			Для каждого ТекПоле Из РеквизитыДляПроверки Цикл

				ТекстФормулы = НастройкаНовойПроводки[ТекПоле];
				Если ТекПоле = "УсловиеВыполнено" ИЛИ ТекПоле = "Период"
						ИЛИ ТекПоле = "Активность" Тогда
					ТекстФормулыБезМакроса = НастройкаНовойПроводки[ТекПоле];
				Иначе
					ТекстФормулыБезМакроса = НастройкаНовойПроводки[ТекПоле + "БезМакроса"];
				КонецЕсли;

				ПозицияНачала = Найти(ТекстФормулы, Символ0);
				ОбработкаПрервана = Ложь;
				Пока ПозицияНачала <> 0 Цикл
					Длина = 1;
					Пока Сред(ТекстФормулы, ПозицияНачала + Длина, 1) <> Символ0 Цикл
						Длина = Длина + 1;
					КонецЦикла;
					ИмяЗаменяемогоРеквизита = Сред(ТекстФормулы, ПозицияНачала + 1, Длина
						- 1);
					ИмяЗаменяемогоПоля = Сред(ИмяЗаменяемогоРеквизита, 10);
					Если ИмяЗаменяемогоПоля = "ПЕРИОД" ИЛИ ИмяЗаменяемогоПоля = "АКТИВНОСТЬ"
							ИЛИ ПустаяСтрока(НастройкаНовойПроводки[ИмяЗаменяемогоПоля
							+ "БезМакроса"]) Тогда
						ЗаменяющийТекст = НастройкаНовойПроводки[ИмяЗаменяемогоПоля];
					Иначе
						ЗаменяющийТекст = НастройкаНовойПроводки[ИмяЗаменяемогоПоля
							+ "БезМакроса"];
					КонецЕсли;
					Если Найти(ЗаменяющийТекст, Символ0) = 0 Тогда
						ЕстьОбработанныеПоля = Истина;
						ТекстФормулы = СтрЗаменить(ТекстФормулы, Символ0
							+ ИмяЗаменяемогоРеквизита + Символ0, ЗаменяющийТекст);
						ТекстФормулыБезМакроса = СтрЗаменить(ТекстФормулыБезМакроса, Символ0
							+ ИмяЗаменяемогоРеквизита + Символ0, ЗаменяющийТекст);
						НастройкаНовойПроводки[ТекПоле] = ТекстФормулы;
						Если ТекПоле <> "УсловиеВыполнено" И ТекПоле <> "Период"
								И ТекПоле <> "Активность" Тогда

							НастройкаНовойПроводки[ТекПоле
								+ "БезМакроса"] = ТекстФормулыБезМакроса;
						КонецЕсли;
					Иначе
						ОбработкаПрервана = Истина;
						Прервать;
					КонецЕсли;
					ПозицияНачала = Найти(ТекстФормулы, Символ0);
				КонецЦикла;
				Если Не ОбработкаПрервана Тогда
					ПоляКУдалению.Добавить(ТекПоле);
				КонецЕсли;
			КонецЦикла;

			Если НЕ ЕстьОбработанныеПоля Тогда
				ОписаниеОшибки = НСтр("ru = 'В настройках проводок используются циклические ссылки на реквизиты проводки'");
				Возврат Неопределено;
			КонецЕсли;
			Для каждого ПолеКУдалению Из ПоляКУдалению Цикл

				РеквизитыДляПроверки.Удалить(РеквизитыДляПроверки.Найти(ПолеКУдалению));

			КонецЦикла;

		КонецЦикла;

		ДополнительноОбработатьРеквизитыКоличество(НастройкаНовойПроводки);
		ДополнительноОбработатьРеквизитыВалюта(НастройкаНовойПроводки);

		Если ЕстьВалютаВДокументе И НЕ ТекСтрокаПроводки.НеПересчитыватьСумму Тогда
			ДобавитьВалютныйУчетВФормулуСуммы(НастройкаНовойПроводки.Сумма);
			ДобавитьВалютныйУчетВФормулуСуммы(НастройкаНовойПроводки.СуммаНеУчитываетсяНУ);
			ДобавитьВалютныйУчетВФормулуСуммы(НастройкаНовойПроводки.СуммаЕНВД);
			ДобавитьВалютныйУчетВФормулуСуммы(НастройкаНовойПроводки.СуммаНДС);
		КонецЕсли;

	КонецЦикла;

	ВычисляемыеПоля = СхемаКомпоновки.ВычисляемыеПоля;

	СформироватьТекстыВычисляемыхПолей(НастройкаПроводок, ВычисляемыеПоля);

	Если МетаданныеДокумента.Реквизиты.Найти("ВидМежотчетногоПериода") <> Неопределено Тогда

		// Настроить заполнение поля "УточнениеПериода" и "ВидМежотчетногоПериода".
		// Поля заполняются только если проводка формируется последней секундой года.
		ПолеПериод = СхемаКомпоновки.ВычисляемыеПоля.Найти("Период");

		// УточнениеПериода
		ПолеУточнениеПериода = СхемаКомпоновки.ВычисляемыеПоля.Найти("УточнениеПериода");
		ПолеУточнениеПериода.Выражение = ДоработатьФормулуУточненияПериода(ПолеПериод.Выражение,
			"БухгалтерскиеОперации.ЗначениеУточненияПериода(&ВидМежотчетногоПериода)",
			"БухгалтерскиеОперации.ЗначениеУточненияПериода(Перечисления.ВидыМежотчетногоПериода.ПустаяСсылка())");

		ВыбранноеПолеУточнениеПериода = СхемаКомпоновки.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(
			Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеУточнениеПериода.Поле = Новый ПолеКомпоновкиДанных("УточнениеПериода");
		ВыбранноеПолеУточнениеПериода.Использование = Истина;

		// ВидМежотчетногоПериода
		ПолеВидМежотчетногоПериода = СхемаКомпоновки.ВычисляемыеПоля.Найти("ВидМежотчетногоПериода");
		ПолеВидМежотчетногоПериода.Выражение = ДоработатьФормулуУточненияПериода(ПолеПериод.Выражение,
			"&ВидМежотчетногоПериода",
			"Перечисления.ВидыМежотчетногоПериода.ПустаяСсылка()");

		ВыбранноеПолеВидМежотчетногоПериода = СхемаКомпоновки.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(
			Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеВидМежотчетногоПериода.Поле = Новый ПолеКомпоновкиДанных("ВидМежотчетногоПериода");
		ВыбранноеПолеВидМежотчетногоПериода.Использование = Истина;

	КонецЕсли;

	Если ОбщегоНазначения.РазделениеВключено()
			И НЕ ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		ДополнительныеТабличныеЧасти = Новый ДеревоЗначений;
		ДополнительныеТабличныеЧасти.Колонки.Добавить("ИмяТабличнойЧасти");
		ДополнительныеТабличныеЧасти.Колонки.Добавить("Тип");
		ДополнительныеТабличныеЧасти.Колонки.Добавить("Имя");
		ДополнительныеТабличныеЧасти.Колонки.Добавить("Обработано");
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
			|	КолонкиДополнительныхТабличныхЧастей.Владелец.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
			|	КолонкиДополнительныхТабличныхЧастей.ОписаниеТипаКолонки.ТипЗначения КАК Тип,
			|	КолонкиДополнительныхТабличныхЧастей.ИмяКолонки КАК Имя, ЛОЖЬ КАК Обработано
			|ИЗ
			|	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
			|ГДЕ
			|	КолонкиДополнительныхТабличныхЧастей.Владелец.ИдентификаторДокумента = &ИдентификаторДокумента
			|	И НЕ КолонкиДополнительныхТабличныхЧастей.ПометкаУдаления
			|	И НЕ КолонкиДополнительныхТабличныхЧастей.Владелец.ПометкаУдаления
			|ИТОГИ ПО
			|	ИмяТабличнойЧасти";
		Запрос.УстановитьПараметр("ИдентификаторДокумента", РеквизитыТиповойОперации.ИдентификаторДокумента);
		ДополнительныеТабличныеЧасти = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;

	ИмяДокумента = МетаданныеДокумента.Имя;
	//ДополнительныеРеквизитыОперации = РеквизитыТиповойОперации.ДополнительныеРеквизиты.Выгрузить();
	ДополнительныеРеквизитыОперации.Колонки.Добавить("ТипЗначенияРеквизита", Новый ОписаниеТипов("ОписаниеТипов"));
	Для каждого ТекДопРеквизит Из ДополнительныеРеквизитыОперации Цикл

		Если ТипЗнч(ТекДопРеквизит.РеквизитПроводки) = Тип("Строка") Тогда
			ТекДопРеквизит.ТипЗначенияРеквизита = Новый ОписаниеТипов("Неопределено");
		Иначе
			ТекДопРеквизит.ТипЗначенияРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекДопРеквизит.РеквизитПроводки, "ТипЗначения");
		КонецЕсли;

	КонецЦикла;

	ОбязательныеПоляТаблиц = Новый Массив;
	ОбязательныеПоляТаблиц.Добавить(Новый Структура);
	ОбязательныеПоляТаблиц[0].Вставить("Имя", "ИмяТабличнойЧасти");
	ОбязательныеПоляТаблиц[0].Вставить("Префикс", "");
	ОбязательныеПоляТаблиц[0].Вставить("Префикс2", "");
	ОбязательныеПоляТаблиц[0].Вставить("Тип", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));
	ОбязательныеПоляТаблиц.Добавить(Новый Структура);
	ОбязательныеПоляТаблиц[1].Вставить("Имя", "Ссылка");
	ОбязательныеПоляТаблиц[1].Вставить("Префикс", "Документ");
	ОбязательныеПоляТаблиц[1].Вставить("Префикс2", "");
	ОбязательныеПоляТаблиц[1].Вставить("Тип", Новый ОписаниеТипов("ДокументСсылка."
		+ ИмяДокумента));
	ОбязательныеПоляТаблиц.Добавить(Новый Структура);
	ОбязательныеПоляТаблиц[2].Вставить("Имя", "Дата");
	ОбязательныеПоляТаблиц[2].Вставить("Префикс", "Документ");
	ОбязательныеПоляТаблиц[2].Вставить("Префикс2", "РеквизитШапки");
	ОбязательныеПоляТаблиц[2].Вставить("Тип", Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты()));
	ОбязательныеПоляТаблиц.Добавить(Новый Структура);
	ОбязательныеПоляТаблиц[3].Вставить("Имя", "Номер");
	ОбязательныеПоляТаблиц[3].Вставить("Префикс", "Документ");
	ОбязательныеПоляТаблиц[3].Вставить("Префикс2", "РеквизитШапки");
	ОбязательныеПоляТаблиц[3].Вставить("Тип", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(МетаданныеДокумента.ДлинаНомера)));
	ОбязательныеПоляТаблиц.Добавить(Новый Структура);
	ОбязательныеПоляТаблиц[4].Вставить("Имя", "ИмяТабличнойЧасти");
	ОбязательныеПоляТаблиц[4].Вставить("Префикс", "");
	ОбязательныеПоляТаблиц[4].Вставить("Префикс2", "");
	ОбязательныеПоляТаблиц[4].Вставить("Тип", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(150)));

	Для каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл

		ОбязательноеПоле = Новый Структура;
		ОбязательноеПоле.Вставить("Имя", ТекРеквизит.Имя);
		ОбязательноеПоле.Вставить("Префикс", "Документ");
		ОбязательноеПоле.Вставить("Префикс2", "РеквизитШапки");
		ОбязательноеПоле.Вставить("Тип", ТекРеквизит.Тип);
		ОбязательныеПоляТаблиц.Добавить(ОбязательноеПоле);

	КонецЦикла;

	Если НЕ ЕстьВалютаВДокументе Тогда

		ОбязательноеПоле = Новый Структура;
		ОбязательноеПоле.Вставить("Имя", "ВалютаДокумента");
		ОбязательноеПоле.Вставить("Префикс", "Документ");
		ОбязательноеПоле.Вставить("Префикс2", "РеквизитШапки");
		ОбязательноеПоле.Вставить("Тип", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
		ОбязательныеПоляТаблиц.Добавить(ОбязательноеПоле);

	КонецЕсли;

	Для каждого ТекДопРеквизит Из ДополнительныеРеквизитыОперации Цикл

		ОбязательноеПоле = Новый Структура;
		ОбязательноеПоле.Вставить("Имя", ТекДопРеквизит.ИмяДляФормулы);
		ОбязательноеПоле.Вставить("Префикс", "ДополнительныеРеквизиты");
		ОбязательноеПоле.Вставить("Префикс2", "ДополнительныйРеквизит_");
		ОбязательноеПоле.Вставить("Тип", ТекДопРеквизит.ТипЗначенияРеквизита);
		ОбязательныеПоляТаблиц.Добавить(ОбязательноеПоле);

	КонецЦикла;

	Объединение = СхемаКомпоновки.НаборыДанных.Найти("ДанныеДокумента");
	ИмяИсточникаДанных = СхемаКомпоновки.ИсточникиДанных[0].Имя;

	НаборДанных = Объединение.Элементы.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.ИсточникДанных = ИмяИсточникаДанных;
	НаборДанных.Имя = "Документ";
	НаборДанных.ИмяОбъекта = "Документ";

	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "НомерСтроки", "", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "НомерСтроки", "", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	Для каждого ОбязательноеПолеТаблицы Из ОбязательныеПоляТаблиц Цикл

		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, ОбязательноеПолеТаблицы.Префикс2, ОбязательноеПолеТаблицы.Тип);
		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, , ОбязательноеПолеТаблицы.Тип);

	КонецЦикла;

	Для каждого ТекТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл

		ИмяТЧ = ТекТабличнаяЧасть.Имя;

		НаборДанных = Объединение.Элементы.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
		НаборДанных.ИсточникДанных = ИмяИсточникаДанных;
		НаборДанных.Имя = ТекТабличнаяЧасть.Имя;
		НаборДанных.ИмяОбъекта = ТекТабличнаяЧасть.Имя;

		Для каждого ОбязательноеПолеТаблицы Из ОбязательныеПоляТаблиц Цикл

			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, ОбязательноеПолеТаблицы.Префикс2, ОбязательноеПолеТаблицы.Тип);
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, , ОбязательноеПолеТаблицы.Тип);

		КонецЦикла;

		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "НомерСтроки", "СтрокаТаблицы", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "НомерСтроки", "СтрокаТаблицы", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
		Сч = 0;
		МетаданныеТабличнаяЧасть = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТЧ);
		Если МетаданныеТабличнаяЧасть <> Неопределено Тогда
			Для Каждого ТекРеквизит Из МетаданныеТабличнаяЧасть.Реквизиты Цикл
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ТекРеквизит.Имя, "СтрокаТаблицы", , ТекРеквизит.Тип);
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ТекРеквизит.Имя, "СтрокаТаблицы", , ТекРеквизит.Тип);
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
		РеквизитыДополнительнойТабЧасти = ДополнительныеТабличныеЧасти.Строки.НайтиСтроки(Новый Структура("ИмяТабличнойЧасти", ИмяТЧ), Истина);
		Для каждого ТекРеквизит Из РеквизитыДополнительнойТабЧасти Цикл

			Если ЗначениеЗаполнено(ТекРеквизит.Имя) Тогда

				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ТекРеквизит.Имя, "СтрокаТаблицы", , ТекРеквизит.Тип);
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ТекРеквизит.Имя, "СтрокаТаблицы", , ТекРеквизит.Тип);
				Сч = Сч + 1;

			Иначе

				ТекРеквизит.Обработано = ИСТИНА;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Для каждого ДопТабличнаяЧасть Из ДополнительныеТабличныеЧасти.Строки Цикл

		Если ДопТабличнаяЧасть.Обработано = ИСТИНА Тогда
			Продолжить;
		КонецЕсли;

		ИмяТЧ = ДопТабличнаяЧасть.ИмяТабличнойЧасти;

		НаборДанных = Объединение.Элементы.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
		НаборДанных.ИсточникДанных = ИмяИсточникаДанных;
		НаборДанных.Имя = ИмяТЧ;
		НаборДанных.ИмяОбъекта = ИмяТЧ;

		Для каждого ОбязательноеПолеТаблицы Из ОбязательныеПоляТаблиц Цикл

			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, ОбязательноеПолеТаблицы.Префикс2, ОбязательноеПолеТаблицы.Тип);
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, , ОбязательноеПолеТаблицы.Тип);

		КонецЦикла;

		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "НомерСтроки", "СтрокаТаблицы", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "НомерСтроки", "СтрокаТаблицы", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
		Для каждого ТекРеквизит Из ДопТабличнаяЧасть.Строки Цикл

			Если ЗначениеЗаполнено(ТекРеквизит.Имя) Тогда

				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ТекРеквизит.Имя, "СтрокаТаблицы", , ТекРеквизит.Тип);
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ТекРеквизит.Имя, "СтрокаТаблицы", , ТекРеквизит.Тип);

			Иначе

				ТекРеквизит.Обработано = ИСТИНА;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Для каждого ДополнительныйИсточникДанных Из ДополнительныеИсточникиДанных.Строки Цикл

		ИмяТЧ = ДополнительныйИсточникДанных.ИмяИсточника;

		НаборДанных = Объединение.Элементы.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
		НаборДанных.ИсточникДанных = ИмяИсточникаДанных;
		НаборДанных.Имя = ИмяТЧ;
		НаборДанных.ИмяОбъекта = ИмяТЧ;

		Для каждого ОбязательноеПолеТаблицы Из ОбязательныеПоляТаблиц Цикл

			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, ОбязательноеПолеТаблицы.Префикс2, ОбязательноеПолеТаблицы.Тип);
			ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ОбязательноеПолеТаблицы.Имя, ОбязательноеПолеТаблицы.Префикс, , ОбязательноеПолеТаблицы.Тип);

		КонецЦикла;

		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, "НомерСтроки", "СтрокаТаблицы", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5)));
		ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, "НомерСтроки", "СтрокаТаблицы", , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5)));
		Для каждого ТекРеквизит Из ДополнительныйИсточникДанных.Строки Цикл

			Если ЗначениеЗаполнено(ТекРеквизит.ИмяКолонки) Тогда

				ТипКолонки = Справочники.ДополнительныеИсточникиДанныхДляТиповыхОпераций.ТипЗначенияКолонкиДополнительногоИсточника(МетаданныеДокумента, ТекРеквизит.ИмяИсточника, ТекРеквизит.ИмяКолонки);

				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ТекРеквизит.ИмяКолонки, "СтрокаТаблицы", , ТипКолонки);
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ТекРеквизит.ИмяКолонки, "СтрокаТаблицы", , ТипКолонки);

			КонецЕсли;

		КонецЦикла;

		// в дополнительный источник данных добавим колонки из справочника дополнительные колонки
		Для каждого ДопТабличнаяЧасть Из ДополнительныеТабличныеЧасти.Строки Цикл

			Для каждого ДопКолонкаТЧ Из ДопТабличнаяЧасть.Строки Цикл

				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(НаборДанных, ДопКолонкаТЧ.Имя, "СтрокаТаблицы", , ДопКолонкаТЧ.Тип);
				ОбщийМодульСКД.ДобавитьПолеВНаборДанных(Объединение, ДопКолонкаТЧ.Имя, "СтрокаТаблицы", , ДопКолонкаТЧ.Тип);

			КонецЦикла;

		КонецЦикла;

	КонецЦикла;

	Если ЗначенияРеквизитовПроводок.Количество() > 0 Тогда
		ТипЗначенияПараметра = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(ЗначенияРеквизитовПроводок[0].Ссылка)));

		Для каждого ТекСтрокаПроводки Из ЗначенияРеквизитовПроводок Цикл

			НовПараметр = СхемаКомпоновки.Параметры.Добавить();
			НовПараметр.Имя = ИмяПараметраПроводка(ТекСтрокаПроводки.Ссылка);
			НовПараметр.ОграничениеИспользования = Истина;
			НовПараметр.ТипЗначения = ТипЗначенияПараметра;
			НовПараметр.Значение = ТекСтрокаПроводки.Ссылка;

		КонецЦикла;
	КонецЕсли;

	Возврат СхемаКомпоновки;

КонецФункции

Функция ИмяПараметраПроводка(Ссылка)

	Возврат "Проводка_"
		+ СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()), "-", "");

КонецФункции

Процедура ЗаменитьФункциюКЭКПроводки(ОбщиеПараметрыЗаполнения)

	ПроверяемыеФункции = Новый Соответствие;
	ПроверяемыеФункции.Вставить("БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИ", Новый Массив);
	ПроверяемыеФункции.Вставить("БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИСВЫБОРОМДТКТ", Новый Массив);
	ПроверяемыеФункции.Вставить("БУХГАЛТЕРСКИЕОПЕРАЦИИ.ДОПУСТИМЫЙКЭКПРОВОДКИ", Новый Массив);

	ПроверяемыеФункции["БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИ"].Добавить(Новый Структура("Дт, Кт"));
	ПроверяемыеФункции["БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИСВЫБОРОМДТКТ"].Добавить(Новый Структура("Дт, Кт"));
	ПроверяемыеФункции["БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИСВЫБОРОМДТКТ"].Добавить(Новый Структура("Дт, Кт"));
	ПроверяемыеФункции["БУХГАЛТЕРСКИЕОПЕРАЦИИ.ДОПУСТИМЫЙКЭКПРОВОДКИ"].Добавить(Неопределено);
	ПроверяемыеФункции["БУХГАЛТЕРСКИЕОПЕРАЦИИ.ДОПУСТИМЫЙКЭКПРОВОДКИ"].Добавить(Новый Структура("Дт, Кт"));

	ДопустимыеЗначенияСтроковогоРеквизита = Новый Структура("Дт, Кт", Новый Структура("Счет, Субконто1, Субконто2, Субконто3", "СчетДт", "СубконтоДт1", "СубконтоДт2", "СубконтоДт3"), Новый Структура("Счет, Субконто1, Субконто2, Субконто3", "СчетКт", "СубконтоКт1", "СубконтоКт2", "СубконтоКт3"));
	Для каждого ИмяРеквизита Из ОбщегоНазначенияКлиентСервер.СвернутьМассив(ОбщиеПараметрыЗаполнения.РеквизитыКЭКПроводки) Цикл

		ПроверяемыеИмена = Новый Массив;
		ПроверяемыеИмена.Добавить(ИмяРеквизита);
		ПроверяемыеИмена.Добавить(ИмяРеквизита + "БезМакроса");

		Для Каждого ШаблонФункции Из ПроверяемыеФункции Цикл

			Для Каждого ПроверяемоеИмя Из ПроверяемыеИмена Цикл

				ТекстФормулы = ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ПроверяемоеИмя];
				СборкаСтроки = Новый Массив;
				ДлинаФормулы = СтрДлина(ТекстФормулы);
				ИндексВхождения = 1;

				ИндексПараметров = ИндексНачалаПараметровФункции(ТекстФормулы, ДлинаФормулы, ШаблонФункции.Ключ, ИндексВхождения);

				Пока ИндексПараметров > 0 Цикл

				// Добавить часть формулы до параметров
					СборкаСтроки.Добавить(Сред(ТекстФормулы, ИндексВхождения, ИндексПараметров
						- ИндексВхождения));

						// Определить параметры функции
					ПроверяемыйИндекс = ИндексПараметров;

					ПараметрыФункции = ПрочитатьПараметрыФункции(ТекстФормулы, ДлинаФормулы, ПроверяемыйИндекс);

					СборкаСтроки.Добавить(ПараметрыФункции);

					ИндексВхождения = ПроверяемыйИндекс;
					ИндексПараметров = ИндексНачалаПараметровФункции(ТекстФормулы, ДлинаФормулы, ШаблонФункции.Ключ, ИндексВхождения);

				КонецЦикла;

				СборкаСтроки.Добавить(Сред(ТекстФормулы, ИндексВхождения, СтрДлина(ТекстФормулы)
					- ИндексВхождения + 1));

					// Проверка параметров и сборка новой функции
				Индекс = 2;
				КоличествоСтрок = СборкаСтроки.Количество();
				Пока Индекс < КоличествоСтрок Цикл

					ПараметрыФункции = СборкаСтроки[Индекс - 1];
					Если ТипЗнч(ПараметрыФункции) <> Тип("Массив")
							ИЛИ ПараметрыФункции.Количество() = 0 Тогда
						ВызватьИсключение СтрШаблон(НСтр("ru = 'В функции %1 не определены параметры'"), ШаблонФункции.Ключ);
					КонецЕсли;

					СторонаПроводки = ПараметрыФункции[0];
					ИменаСубконто = Неопределено;
					Если НЕ ДопустимыеЗначенияСтроковогоРеквизита.Свойство(СтрЗаменить(СторонаПроводки, """", ""), ИменаСубконто) Тогда
						ВызватьИсключение СтрШаблон(НСтр("ru = 'В функции КЭКПроводки необходимо указать сторону проводки ""Дт"" или ""Кт"".
							|В поле ""%1"" в функции %2 установлено значение аргумента 1:
							|%3'"), ИмяРеквизита, ШаблонФункции.Ключ, СторонаПроводки);
					КонецЕсли;
					НовыеПараметры = Новый Массив;
					ТекстФормулы = СтрШаблон("%1, %2, %3, %4, %5, %6, %7, %8, %9", ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["ОрганизацияБезМакроса"], ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["ИФОБезМакроса"], ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["КФОБезМакроса"], ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["Период"], ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Счет
						+ "БезМакроса"], ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Субконто1
						+ "БезМакроса"], ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Субконто2
						+ "БезМакроса"], ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Субконто3
						+ "БезМакроса"], ?(ШаблонФункции.Ключ = "БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИСВЫБОРОМДТКТ", ПараметрыФункции[1], СторонаПроводки));
					НовыеПараметры.Добавить(ТекстФормулы);
					Если ШаблонФункции.Ключ <> "БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИСВЫБОРОМДТКТ" Тогда
						Для ИндексПараметра = 1 По ПараметрыФункции.ВГраница() Цикл

							НовыеПараметры.Добавить(ПараметрыФункции[ИндексПараметра]);

						КонецЦикла;
					КонецЕсли;

					ДополнитьИспользуемыеРеквизиты(ОбщиеПараметрыЗаполнения, ИмяРеквизита, ИменаСубконто);

					СборкаСтроки[Индекс - 1] = СтрСоединить(НовыеПараметры, ",");
					Индекс = Индекс + 2;
				КонецЦикла;

				ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ПроверяемоеИмя] = СтрСоединить(СборкаСтроки);

			КонецЦикла;
		КонецЦикла;

		//ТекстФормулы = ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИмяРеквизита];
		//СборкаСтроки = Новый Массив;
		//НачальныйНомер = 1;
		//ШаблонФункции = "БУХГАЛТЕРСКИЕОПЕРАЦИИ.КЭКПРОВОДКИ(";
		//ДлинаШаблона = СтрДлина(ШаблонФункции);
		//НомерПозиции = СтрНайти(ТекстФормулы, ШаблонФункции);
		//Пока НомерПозиции > 0 Цикл
		//	
		//	СборкаСтроки.Добавить(Сред(ТекстФормулы, НачальныйНомер, ДлинаШаблона + НомерПозиции - НачальныйНомер));
		//	
		//	ДлинаПараметра = 4;
		//	РазмерПоправки = 0;
		//	Если ПустаяСтрока(Сред(ТекстФормулы, НомерПозиции + ДлинаШаблона + РазмерПоправки, 1)) Тогда
		//		РазмерПоправки = РазмерПоправки + 1;
		//	КонецЕсли;
		//	СборкаСтроки.Добавить(Сред(ТекстФормулы, НомерПозиции + ДлинаШаблона + РазмерПоправки, ДлинаПараметра));
		//	
		//	НачальныйНомер = НомерПозиции + ДлинаШаблона + РазмерПоправки + ДлинаПараметра;
		//	НомерПозиции = СтрНайти(ТекстФормулы, ШаблонФункции,,НачальныйНомер);
		//	
		//КонецЦикла;
		//
		//СборкаСтроки.Добавить(Сред(ТекстФормулы, НачальныйНомер, СтрДлина(ТекстФормулы) - НачальныйНомер + 1));
		//
		//Индекс = 2;
		//КоличествоСтрок = СборкаСтроки.Количество();
		//Пока Индекс < КоличествоСтрок Цикл
		//	СторонаПроводки = СборкаСтроки[Индекс - 1];
		//	ИменаСубконто = Неопределено;
		//	Если НЕ ДопустимыеЗначенияСтроковогоРеквизита.Свойство(СтрЗаменить(СторонаПроводки, """", ""), ИменаСубконто) Тогда
		//		ВызватьИсключение СтрШаблон(НСтр("ru = 'В функции КЭКПроводки необходимо указать ""Дт"" или ""Кт"".
		//		|В поле ""%1"" в функции КЭКПроводки значение аргумента:
		//		|%2'"), ИмяРеквизита, СторонаПроводки);
		//	КонецЕсли;
		//	ТекстФормулы = СтрШаблон("%1, %2, %3, %4, %5, %6, %7, %8, %9",
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["ОрганизацияБезМакроса"],
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["ИФОБезМакроса"],
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["КФОБезМакроса"],
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки["Период"],
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Счет + "БезМакроса"],
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Субконто1 + "БезМакроса"],
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Субконто2 + "БезМакроса"],
		//		ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИменаСубконто.Субконто3 + "БезМакроса"],
		//		СторонаПроводки);
		//		
		//	ДополнитьИспользуемыеРеквизиты(ОбщиеПараметрыЗаполнения, ИмяРеквизита, ИменаСубконто);
		//	
		//	СборкаСтроки[Индекс - 1] = ТекстФормулы;
		//	Индекс = Индекс + 2;
		//КонецЦикла;
		//
		//ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки[ИмяРеквизита] = СтрСоединить(СборкаСтроки);
	КонецЦикла;

КонецПроцедуры

Функция ИндексНачалаПараметровФункции(ТекстФормулы, ДлинаФормулы,
		ШаблонФункции, НачальныйИндекс)

	ДлинаШаблона = СтрДлина(ШаблонФункции);
	ПредварительныйИндекс = СтрНайти(ТекстФормулы, ШаблонФункции, , НачальныйИндекс);
	Пока ПредварительныйИндекс > 0 Цикл

	// Проверить, что следующий символ = "("
		ПроверяемыйИндекс = ПредварительныйИндекс + ДлинаШаблона;
		Пока ПроверяемыйИндекс <= ДлинаФормулы
			И ПустаяСтрока(Сред(ТекстФормулы, ПроверяемыйИндекс, 1)) Цикл

			ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
		КонецЦикла;

		Если Сред(ТекстФормулы, ПроверяемыйИндекс, 1) <> "(" Тогда
		// формула найдена ошибочно. Продолжить поиск
			ПредварительныйИндекс = СтрНайти(ТекстФормулы, ШаблонФункции, , ПроверяемыйИндекс);
			Продолжить;
		КонецЕсли;

		// Найдено
		Возврат ПроверяемыйИндекс + 1;

	КонецЦикла;

	Возврат 0;

КонецФункции

Функция ПрочитатьПараметрыФункции(ТекстФормулы, ДлинаФормулы,
		ПроверяемыйИндекс)

	НачальныйИндексПараметра = ПроверяемыйИндекс;
	ОткрытаКавычка = Ложь;
	ПараметрыФункции = Новый Массив;
	ОткрытыеБлоки = Новый Массив;
	Пока ПроверяемыйИндекс <= ДлинаФормулы Цикл

		ПроверяемыйСимвол = Сред(ТекстФормулы, ПроверяемыйИндекс, 1);

		Если ПустаяСтрока(ПроверяемыйСимвол) И ОткрытыеБлоки.Количество() = 0 Тогда
			ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
			Продолжить;
		КонецЕсли;

		Если ПроверяемыйСимвол = "(" Тогда
			ОткрытыеБлоки.Добавить("(");
			ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
			Продолжить;
		ИначеЕсли ПроверяемыйСимвол = """" Тогда

			Если Сред(ТекстФормулы, ПроверяемыйИндекс + 1, 1) <> """"
					ИЛИ Не ОткрытаКавычка Тогда
					// Одинарная кавычка или несколько кавычек, начинающих строку - первая кавычка "открывающая"
				ОткрытаКавычка = Не ОткрытаКавычка;
				ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
				Продолжить;
			Иначе
			// Двойная кавычка
				ПроверяемыйИндекс = ПроверяемыйИндекс + 2;
				Продолжить;
			КонецЕсли;

		ИначеЕсли ПроверяемыйСимвол = ")" Тогда
			Если ОткрытыеБлоки.Количество() = 0 Тогда

			// Добавить параметр
				ПараметрыФункции.Добавить(Сред(ТекстФормулы, НачальныйИндексПараметра, ПроверяемыйИндекс
					- НачальныйИндексПараметра));

				Прервать;

			ИначеЕсли ОткрытыеБлоки[ОткрытыеБлоки.ВГраница()] <> "(" Тогда
				ВызватьИсключение "Не обнаружена парная открывающая скобка";
			Иначе
				ОткрытыеБлоки.Удалить(ОткрытыеБлоки.ВГраница());
				ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
				Продолжить;
			КонецЕсли;

		ИначеЕсли ПроверяемыйСимвол = "," Тогда

		// ДобавитьПараметр
			ПараметрыФункции.Добавить(Сред(ТекстФормулы, НачальныйИндексПараметра, ПроверяемыйИндекс
				- НачальныйИндексПараметра));

			ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
			НачальныйИндексПараметра = ПроверяемыйИндекс;
			Продолжить;

		Иначе

			ПроверяемыйИндекс = ПроверяемыйИндекс + 1;
			Продолжить;

		КонецЕсли;

	КонецЦикла;

	Возврат ПараметрыФункции;

КонецФункции

Процедура ДополнитьИспользуемыеРеквизиты(ОбщиеПараметрыЗаполнения,
		ИмяРеквизита, ИменаСубконто)

	ИспользуемыеРеквизиты = ПолучитьИспользуемыеРеквизиты(ОбщиеПараметрыЗаполнения, ИмяРеквизита);

	Если ИспользуемыеРеквизиты = Неопределено Тогда
		ИспользуемыеРеквизиты = Новый Массив;
		ОбщиеПараметрыЗаполнения.Добавить(Новый Структура("ИмяПоля, ИспользуемыеРеквизиты", ИмяРеквизита, ИспользуемыеРеквизиты));
	КонецЕсли;

	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("Организация");
	ИменаРеквизитов.Добавить("ИФО");
	ИменаРеквизитов.Добавить("КФО");
	ИменаРеквизитов.Добавить("Период");
	ИменаРеквизитов.Добавить(ИменаСубконто.Счет);
	ИменаРеквизитов.Добавить(ИменаСубконто.Субконто1);
	ИменаРеквизитов.Добавить(ИменаСубконто.Субконто2);
	ИменаРеквизитов.Добавить(ИменаСубконто.Субконто3);

	Для каждого ТекИмя Из ИменаРеквизитов Цикл

		ТекИспользуемыеРеквизиты = ПолучитьИспользуемыеРеквизиты(ОбщиеПараметрыЗаполнения, ТекИмя);
		Если ТекИспользуемыеРеквизиты <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИспользуемыеРеквизиты, ТекИспользуемыеРеквизиты, Истина);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьИспользуемыеРеквизиты(ОбщиеПараметрыЗаполнения, ИмяРеквизита)

	ИспользуемыеРеквизиты = Неопределено;

	Для каждого Элемент Из ОбщиеПараметрыЗаполнения.ИспользуемыеРеквизиты Цикл

		Если Элемент.ИмяПоля = ИмяРеквизита Тогда
			ИспользуемыеРеквизиты = Элемент.ИспользуемыеРеквизиты;
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат ИспользуемыеРеквизиты;

КонецФункции

Процедура ОбработатьФормулуРеквизитаПроводки(Знач ФормулаПроводки, Формула,
		ФормулаБезМакросов, ИспользуемыеРеквизиты, ИмяТабличойЧасти, ИмяРеквизита,
		ОписаниеОшибки, ЭтоТиповаяОперация = Истина,
		ИспользуемыеПараметры = Неопределено,
		РеквизитыКЭКПроводки = Неопределено) Экспорт

	Если ИспользуемыеПараметры = Неопределено Тогда
		ИспользуемыеПараметры = Новый Массив;
	КонецЕсли;

	ДлинаТекста = СтрДлина(ФормулаПроводки);

	ОбщиеПараметры = Новый Структура;
	ОбщиеПараметры.Вставить("Текст", ФормулаПроводки);
	ОбщиеПараметры.Вставить("ТекущаяТЧ", ИмяТабличойЧасти);
	ОбщиеПараметры.Вставить("ТекущийРеквизит", ИмяРеквизита);
	ОбщиеПараметры.Вставить("НомерСтроки", 1);
	ОбщиеПараметры.Вставить("ИндексСимвола", 1);
	ОбщиеПараметры.Вставить("ДлинаТекста", ДлинаТекста);
	ОбщиеПараметры.Вставить("Ошибка", Ложь);
	ОбщиеПараметры.Вставить("ОписаниеОшибки", "");
	ОбщиеПараметры.Вставить("ИспользуемыеРеквизиты", ИспользуемыеРеквизиты);
	ОбщиеПараметры.Вставить("ИспользуемыеПараметры", ИспользуемыеПараметры);
	ОбщиеПараметры.Вставить("ЭтоТиповаяОперация", ЭтоТиповаяОперация);
	ОбщиеПараметры.Вставить("РеквизитыКЭКПроводки", Новый Массив);

	Формула = "";
	ФормулаБезМакросов = "";

	Индекс = 1;
	Пока ОбщиеПараметры.ИндексСимвола <= ДлинаТекста Цикл
		Индекс = Индекс + 1;
		Если Индекс = 1000 Тогда
		// ушли в бесконечный цикл: в формуле попалось что то неожиданное
			ОбщиеПараметры.Ошибка = Истина;
			ОписаниеОшибки = НСтр("ru = 'Ошибка разбора текста формулы'") + Символы.ПС
				+ СтрЗаменить(ФормулаПроводки, """", """""");
			Возврат;
		КонецЕсли;
		ТокенБезМакроса = "";
		Токен = "";
		ПрочитатьТокен(ОбщиеПараметры, Токен, ТокенБезМакроса, Ложь);
		Формула = Формула + Токен;
		ФормулаБезМакросов = ФормулаБезМакросов + ТокенБезМакроса;

		Если ОбщиеПараметры.Ошибка Тогда
			ОписаниеОшибки = ОбщиеПараметры.ОписаниеОшибки;
			Возврат;
		КонецЕсли;

	КонецЦикла;

	Если ТипЗнч(РеквизитыКЭКПроводки) = Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РеквизитыКЭКПроводки, ОбщиеПараметры.РеквизитыКЭКПроводки);
	КонецЕсли;

КонецПроцедуры

// Формирует структуру доп. реквизитов и их значения. Вызывается при записи из формы документа.
//
// Параметры:
//	Форма - УправляемаяФорма - Форма документа.
//	ДополнительныеРеквизиты - Произвольный - после выполнения содержит структуру с доп. реквизитами: ключ-ИмяДляФормулы, значение - значение доп. реквизита
//	ЗначенияДопРеквизитов - Произвольный - после выполнения содержит готовую таблицу значений, для записи в РС ЗначенияДополнительныхРеквизитовОперации
//  БезВалюты - Булево - признак необходимости получения реквизитов Курс и Кратность. Если валютный учет не ведется, то реквизиты курс и кратность не получаются
//							не зависимо от параметра.
//	
Процедура СформироватьСтруктуруДопРеквизитов(Форма, ДополнительныеРеквизиты,
		ЗначенияДопРеквизитов, БезВалюты = Ложь) Экспорт

	ТекТиповаяОперация = Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитыФормыТиповаяОперацияФактическое(Форма)];
	Если НЕ ЗначениеЗаполнено(ТекТиповаяОперация) Тогда
		Возврат;
	КонецЕсли;

	ЗначенияДопРеквизитов = РегистрыСведений.ЗначенияДополнительныхРеквизитовОпераций.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ЗначенияДопРеквизитов.Колонки.Добавить("НаименованиеРеквизита");
	ДобавленныеРеквизиты = Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"];
	ДополнительныеРеквизиты = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	РеквизитыТиповыхОпераций.Ссылка,
		|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
		|	РеквизитыТиповыхОпераций.РеквизитПроводки,
		|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК ТипЗначения,
		|	РеквизитыТиповыхОпераций.Наименование Как НаименованиеРеквизита
		|ИЗ
		|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|ГДЕ
		|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
		|	И НЕ РеквизитыТиповыхОпераций.ЭтоГруппа
		|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТекТиповаяОперация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ТекСоответствие = ДобавленныеРеквизиты.НайтиСтроки(Новый Структура("ИмяДляФормулы", ВРег(Выборка.ИмяДляФормулы)));
		Если ТекСоответствие.Количество() > 0 Тогда

			НовЗначение = ЗначенияДопРеквизитов.Добавить();
			НовЗначение.РеквизитОперации = Выборка.Ссылка;
			НовЗначение.Значение = Форма[ТекСоответствие[0].ИмяРеквизита];

			ДополнительныеРеквизиты.Вставить(Выборка.ИмяДляФормулы, Форма[ТекСоответствие[0].ИмяРеквизита]);

		КонецЕсли;

	КонецЦикла;

	Если Не БезВалюты Тогда
		ДополнительныеРеквизиты.Вставить("Курс",
			БухгалтерскиеОперацииКлиентСервер.ЗначениеДополнительногоРеквизитаИзФормы(
				Форма,
				"Курс"));
		ДополнительныеРеквизиты.Вставить("Кратность",
			БухгалтерскиеОперацииКлиентСервер.ЗначениеДополнительногоРеквизитаИзФормы(
				Форма,
				"Кратность"));
	КонецЕсли;
	
	ИмяРеквизитаИспавлениеОшибок = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФлажокИсправлениеОшибокПрошлыхЛет();
	ЭтоИсправлениеОшибок = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяРеквизитаИспавлениеОшибок)
		И Форма[ИмяРеквизитаИспавлениеОшибок];
	
	Если ЭтоИсправлениеОшибок Тогда
		ДополнительныеРеквизиты.Вставить("ИсправлениеОшибки", Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательИсправлениеОшибокПрошлыхЛет()]);
		ДополнительныеРеквизиты.Вставить("ВыявительОшибки",   Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательВыявительОшибкиПрошлыхЛет()]);
		ДополнительныеРеквизиты.Вставить("ПричинаОшибки",     Форма[БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательПричинаОшибкиПрошлыхЛет()]);
	Иначе
		ДополнительныеРеквизиты.Вставить("ИсправлениеОшибки", Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.НеОшибка);
		ДополнительныеРеквизиты.Вставить("ВыявительОшибки",   Перечисления.ВыявительОшибокПрошлыхЛет.ПустаяСсылка());
		ДополнительныеРеквизиты.Вставить("ПричинаОшибки",     Справочники.ПричиныОшибокПрошлыхЛет.ПустаяСсылка());
	КонецЕсли;

КонецПроцедуры

Функция ВДокументеИспользуетсяВалютныйУчет(Идентификатор)

	Если ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
		Возврат БухгалтерскиеОперацииПовтИспНаВремяСеанса.ПоДокументуВедетсяВалютныйУчет(Идентификатор);
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

// Проверяет наличие в документе реквизита ПервичныйДокумент с типом СправочникСсылка.ПервичныеДокументы
//
// Параметры:
//  Идентификатор - СправочникСсылка.ИдентификаторыОбъектовМетаданных
// 
// Возвращаемое значение:
//  Булево
//
Функция ВДокументеЕстьПервичныйДокумент(Идентификатор) Экспорт
	Возврат БухгалтерскиеОперацииПовтИспНаВремяСеанса.ВДокументеЕстьПервичныйДокумент(Идентификатор);
КонецФункции

// Добавляет, при необходимости, в таблицу проводок колонки видов субконто
//
Процедура ДополнитьКолонкиТаблицыПроводок(ТаблицаПроводок)

	ТипВидСубконто = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыСубконто");
	Если ТаблицаПроводок.Колонки.Найти("ВидСубконтоДт1") = Неопределено Тогда
		ТаблицаПроводок.Колонки.Добавить("ВидСубконтоДт1", ТипВидСубконто);
	КонецЕсли;
	Если ТаблицаПроводок.Колонки.Найти("ВидСубконтоДт2") = Неопределено Тогда
		ТаблицаПроводок.Колонки.Добавить("ВидСубконтоДт2", ТипВидСубконто);
	КонецЕсли;
	Если ТаблицаПроводок.Колонки.Найти("ВидСубконтоДт3") = Неопределено Тогда
		ТаблицаПроводок.Колонки.Добавить("ВидСубконтоДт3", ТипВидСубконто);
	КонецЕсли;
	Если ТаблицаПроводок.Колонки.Найти("ВидСубконтоКт1") = Неопределено Тогда
		ТаблицаПроводок.Колонки.Добавить("ВидСубконтоКт1", ТипВидСубконто);
	КонецЕсли;
	Если ТаблицаПроводок.Колонки.Найти("ВидСубконтоКт2") = Неопределено Тогда
		ТаблицаПроводок.Колонки.Добавить("ВидСубконтоКт2", ТипВидСубконто);
	КонецЕсли;
	Если ТаблицаПроводок.Колонки.Найти("ВидСубконтоКт3") = Неопределено Тогда
		ТаблицаПроводок.Колонки.Добавить("ВидСубконтоКт3", ТипВидСубконто);
	КонецЕсли;

КонецПроцедуры

Функция ПустаяТаблицаНастройкиПроводок()

	ТипСтрока = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки());
	НастройкаПроводок = Новый ТаблицаЗначений;
	НастройкаПроводок.Колонки.Добавить("ТекущаяПроводка", Новый ОписаниеТипов("СправочникСсылка.ПроводкиТиповыхОпераций"));
	НастройкаПроводок.Колонки.Добавить("КодПроводки", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("Период", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("Активность", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("Организация", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ОрганизацияБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ИФО", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ИФОБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КФО", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КФОБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ЖурналОпераций", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ЖурналОперацийБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("Сумма", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СуммаБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СуммаНеУчитываетсяНУ", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СуммаНеУчитываетсяНУБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СуммаЕНВД", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СуммаЕНВДБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СуммаНДС", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СуммаНДСБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("Содержание", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СодержаниеБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидПервичногоДокумента", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидПервичногоДокументаБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ДатаПервичногоДокумента", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ДатаПервичногоДокументаБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("НомерПервичногоДокумента", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("НомерПервичногоДокументаБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КПСКт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КПСКтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КЭККт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КЭККтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютаКт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютаКтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютнаяСуммаКт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютнаяСуммаКтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КоличествоКт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КоличествоКтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ПодразделениеКт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ПодразделениеКтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СчетКт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СчетКтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоКт1", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоКт1БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоКт1", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоКт1БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоКт2", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоКт2БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоКт2", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоКт2БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоКт3", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоКт3БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоКт3", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоКт3БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ХарактеристикаДвиженияКт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ХарактеристикаДвиженияКтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КПСДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КПСДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КЭКДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КЭКДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютаДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютаДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютнаяСуммаДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВалютнаяСуммаДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КоличествоДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("КоличествоДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ПодразделениеДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ПодразделениеДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СчетДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СчетДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоДт1", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоДт1БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоДт1", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоДт1БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоДт2", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоДт2БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоДт2", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоДт2БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоДт3", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ВидСубконтоДт3БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоДт3", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("СубконтоДт3БезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ХарактеристикаДвиженияДт", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("ХарактеристикаДвиженияДтБезМакроса", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("НомерСтроки", ТипСтрока);
	НастройкаПроводок.Колонки.Добавить("УсловиеВыполнено", ТипСтрока);
	Возврат НастройкаПроводок;

КонецФункции

Функция ОтобратьПодчиненныеСтроки(Таблица, ИмяТЧ, ИдентификаторСтроки,
		НомерСтроки) Экспорт

	Результат = Таблица.СкопироватьКолонки();
	СтрПоиска = ИдентификаторСтроки
		+ ?(ЗначениеЗаполнено(ИдентификаторСтроки), ".", "")
		+ Формат(НомерСтроки, "ЧГ=");
	ДлинаСтроки = СтрДлина(СтрПоиска);

	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Если СтрокаТаблицы.СлужебноеПоле_Путь = ИмяТЧ
				И Сред(СтрокаТаблицы.СлужебноеПоле_НомераСтрокПути, 1, ДлинаСтроки) = СтрПоиска Тогда
			ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;

	Результат.Сортировать("СлужебноеПоле_Путь, СлужебноеПоле_НомераСтрокПути, СлужебноеПоле_НомерСтрокиПоля");

	Результат.Колонки.Удалить("СлужебноеПоле_Путь");
	Результат.Колонки.Удалить("СлужебноеПоле_НомераСтрокПути");
	Результат.Колонки.Удалить("СлужебноеПоле_НомерСтрокиПоля");

	Возврат Результат;

КонецФункции

Функция СоединитьСтроки(Таблица, Разделитель = "; ") Экспорт

	Результат = Новый Массив;

	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Значение = СтрокаТаблицы[Колонка.Имя];
			Если ЗначениеЗаполнено(Значение) Тогда
				Результат.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Результат = СтрСоединить(Результат, Разделитель);

	Возврат Результат;

КонецФункции

Функция СчетЭлемент27()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Код = &Код
	|	И ЕПСБУ.ДатаНачалаДействия = ДатаВремя(1,1,1)
	|	И ЕПСБУ.ДатаОкончанияДействия = &ДатаОкончанияДействия
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|	И НЕ ЕПСБУ.ПометкаУдаления";
	Запрос.УстановитьПараметр("Код", "27");
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", Дата('20201231'));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат ПланыСчетов.ЕПСБУ.ПустаяСсылка();

КонецФункции

#КонецОбласти

#Область ДополнительныеКолонкиТабличныхЧастей

Функция ПолучитьТаблицуДляЗаписиЗначенийДополнительныхКолонок()

	ТаблицаДвижений = РегистрыСведений.ЗначенияКолонокДополнительныхТабличныхЧастей.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ТаблицаДвижений.Колонки.Добавить("НаименованиеКолонки"); // используется при записи версий объектов
	ТаблицаДвижений.Колонки.Добавить("ИмяКолонкиТабличнойЧасти");
	Возврат ТаблицаДвижений;

КонецФункции

Функция НастройкаДополнительныхТабЧастей(Идентификатор)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Т.Владелец.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
		|	Т.Владелец КАК ТабличнаяЧасть,
		|	Т.ИмяКолонки КАК ИмяРеквизита,
		|	Т.Ссылка КАК СсылкаРеквизита,
		|	Т.ОписаниеТипаКолонки.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	Справочник.КолонкиДополнительныхТабличныхЧастей КАК Т
		|ГДЕ
		|	НЕ Т.ЭтоГруппа
		|	И Т.Владелец.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И НЕ Т.ПометкаУдаления
		|	И НЕ Т.Владелец.ПометкаУдаления
		|ИТОГИ ПО
		|	ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", Идентификатор);

	Результат = Новый Соответствие;
	ВыборкаТЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТЧ.Следующий() Цикл

		МассивРеквизитов = Новый Соответствие;
		Выборка = ВыборкаТЧ.Выбрать();
		Пока Выборка.Следующий() Цикл

			МассивРеквизитов.Вставить(Выборка.СсылкаРеквизита, Новый Структура("ИмяРеквизита, ТипЗначения", Выборка.ИмяРеквизита, Выборка.ТипЗначения))
		КонецЦикла;

		Результат.Вставить(ВыборкаТЧ.ИмяТабличнойЧасти, Новый Структура("СсылкаТабличнойЧасти, Реквизиты", ВыборкаТЧ.ТабличнаяЧасть, МассивРеквизитов));

	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьЗначенияДополнительныхТабличныхЧастейИзФормы(Форма)

	Объект = Форма.Объект;
	Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Ссылка));

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	КолонкиТабличныхЧастей.Владелец.ИмяТабличнойЧасти КАК ИмяТаблицы,
		|	КолонкиТабличныхЧастей.Владелец.ПредопределеннаяТабличнаяЧасть КАК ПредопределеннаяТабличнаяЧасть,
		|	КолонкиТабличныхЧастей.ИмяКолонки КАК ИмяРеквизита,
		|	КолонкиТабличныхЧастей.Наименование КАК НаименованиеКолонки,
		|	КолонкиТабличныхЧастей.ОписаниеТипаКолонки.ТипЗначения КАК ТипЗначенияНастройки,
		|	КолонкиТабличныхЧастей.Владелец КАК ТабличнаяЧасть,
		|	КолонкиТабличныхЧастей.Ссылка КАК Реквизит
		|ИЗ
		|	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиТабличныхЧастей
		|ГДЕ
		|	КолонкиТабличныхЧастей.Владелец.ИдентификаторДокумента = &ИдентификаторДокумента
		|	И НЕ КолонкиТабличныхЧастей.Владелец.ПометкаУдаления
		|	И НЕ КолонкиТабличныхЧастей.ПометкаУдаления
		|	И НЕ КолонкиТабличныхЧастей.ЭтоГруппа
		|ИТОГИ ПО
		|	ТабличнаяЧасть";
	Запрос.УстановитьПараметр("ИдентификаторДокумента", Идентификатор);

	ТаблицаДвижений = ПолучитьТаблицуДляЗаписиЗначенийДополнительныхКолонок();

	ОписаниеТипов = Новый Соответствие;
	ДобавленныеРеквизиты = Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"];

	ВыборкаТЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТЧ.Следующий() Цикл

		ВыборкаКолонок = ВыборкаТЧ.Выбрать();
		Пока ВыборкаКолонок.Следующий() Цикл

			ОписаниеРеквизита = ДобавленныеРеквизиты.НайтиСтроки(Новый Структура("ИмяТаблицы, ИмяДляФормулы", ВыборкаКолонок.ИмяТаблицы, ВыборкаКолонок.ИмяРеквизита));

			Если ОписаниеРеквизита.Количество() = 0 Тогда
			// такой реквизит не найден
				Продолжить;
			КонецЕсли;

			СоставнойТип = ОписаниеТипов.Получить(ВыборкаКолонок.Реквизит);
			Если СоставнойТип = Неопределено Тогда
				ОписаниеТипов.Вставить(ВыборкаКолонок.Реквизит, ВыборкаКолонок.ТипЗначенияНастройки.Типы().Количество() > 1);
				СоставнойТип = ОписаниеТипов.Получить(ВыборкаКолонок.Реквизит);
			КонецЕсли;

			Если ВыборкаТЧ.ПредопределеннаяТабличнаяЧасть Тогда

				Для каждого СтрокаТЧ Из Объект[ВыборкаТЧ.ИмяТаблицы] Цикл

					Если СоставнойТип
							ИЛИ ЗначениеЗаполнено(СтрокаТЧ[ОписаниеРеквизита[0].ИмяРеквизита]) Тогда

						Движение = ТаблицаДвижений.Добавить();
						Движение.ТабличнаяЧасть = ВыборкаТЧ.ТабличнаяЧасть;
						Движение.КолонкаТабличнойЧасти = ВыборкаКолонок.Реквизит;
						Движение.НомерСтрокиДокумента = СтрокаТЧ.НомерСтроки;
						Движение.Значение = СтрокаТЧ[ОписаниеРеквизита[0].ИмяРеквизита];
						Движение.НаименованиеКолонки = ВыборкаКолонок.НаименованиеКолонки;

					КонецЕсли;

				КонецЦикла;

			Иначе

				ОписаниеТЧ = ДобавленныеРеквизиты.НайтиСтроки(Новый Структура("ИмяДляФормулы, ИмяТаблицы", ВыборкаТЧ.ИмяТаблицы, ""));
				Если ОписаниеТЧ.Количество() > 0 Тогда
					ИмяТаблицы = ОписаниеТЧ[0].ИмяРеквизита;
				Иначе
					ИмяТаблицы = ВыборкаТЧ.ИмяТаблицы;
				КонецЕсли;

				НомерСтроки = 0;
				Для каждого СтрокаТЧ Из Форма[ИмяТаблицы] Цикл
					НомерСтроки = НомерСтроки + 1;

					Если СоставнойТип
							ИЛИ ЗначениеЗаполнено(СтрокаТЧ[ОписаниеРеквизита[0].ИмяРеквизита]) Тогда
							// в базу записываются только заполненные значения
						Движение = ТаблицаДвижений.Добавить();
						Движение.ТабличнаяЧасть = ВыборкаТЧ.ТабличнаяЧасть;
						Движение.КолонкаТабличнойЧасти = ВыборкаКолонок.Реквизит;
						Движение.НомерСтрокиДокумента = НомерСтроки;
						Движение.Значение = СтрокаТЧ[ОписаниеРеквизита[0].ИмяРеквизита];
						Движение.НаименованиеКолонки = ВыборкаКолонок.НаименованиеКолонки;

					КонецЕсли;

				КонецЦикла;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат ТаблицаДвижений;

КонецФункции

Функция ПолучитьСохраненныеЗначенияДополнительныхТабличныхЧастей(ТекущийОбъект)

	Ссылка = ТекущийОбъект.Ссылка;
	Если Ссылка.Пустая() Тогда
		Возврат ПолучитьТаблицуДляЗаписиЗначенийДополнительныхКолонок();
	КонецЕсли;

	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Ссылка));
	Если НЕ БухгалтерскиеОперацииПовтИспНаВремяСеанса.ПараметрыИспользованияОперацийИДопРеквизитов(ИдентификаторДокумента).ТабличныеЧасти Тогда

		Возврат ПолучитьТаблицуДляЗаписиЗначенийДополнительныхКолонок();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЗначенияКолонокДополнительныхТабличныхЧастей.ТабличнаяЧасть,
		|	ЗначенияКолонокДополнительныхТабличныхЧастей.КолонкаТабличнойЧасти,
		|	ЗначенияКолонокДополнительныхТабличныхЧастей.КолонкаТабличнойЧасти.Наименование КАК НаименованиеКолонки,
		|	ЗначенияКолонокДополнительныхТабличныхЧастей.НомерСтрокиДокумента,
		|	ЗначенияКолонокДополнительныхТабличныхЧастей.Значение,
		|	ЗначенияКолонокДополнительныхТабличныхЧастей.КолонкаТабличнойЧасти.ИмяКолонки КАК ИмяКолонкиТабличнойЧасти
		|ИЗ
		|	РегистрСведений.ЗначенияКолонокДополнительныхТабличныхЧастей КАК ЗначенияКолонокДополнительныхТабличныхЧастей
		|ГДЕ
		|	ЗначенияКолонокДополнительныхТабличныхЧастей.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Ссылка);

	УстановитьПривилегированныйРежим(Истина);
	СохраненныеЗначения = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СохраненныеЗначения;

КонецФункции

#КонецОбласти

#Область УправляемыеБлокировки

// Функция создает таблицу значений, каждая колонка которой - блокируемое поле журнала проводок
// Колонки содержат блокируемые значения.
// Пустые значения в колонке заполняются соответствующими значениями из первой строки таблицы.
// Параметры:
// ТаблицаПроводок - ТаблицаЗначений - Таблица проводок, которую будем записывать в регистр.
//
// Возвращаемое значение:
// ТаблицаЗначений - источник данных для объекта блокировка данных
//
Функция СобратьТаблицуБлокировок(ТаблицаПроводок)

	ТаблицаБлокировок = Новый ТаблицаЗначений;
	ТаблицаБлокировок.Колонки.Добавить("Период");
	ТаблицаБлокировок.Колонки.Добавить("Организация");

	Если ТаблицаПроводок.Количество() = 0 Тогда
		Возврат ТаблицаБлокировок;
	КонецЕсли;

	Период = ТаблицаПроводок[0].Период;
	Организация = ТаблицаПроводок[0].Организация;

	ИФО = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ИФО, ТаблицаПроводок.ВыгрузитьКолонку("ИФО"), ИСТИНА);

	КФО = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КФО, ТаблицаПроводок.ВыгрузитьКолонку("КФО"), ИСТИНА);

	ЖурналОпераций = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ЖурналОпераций, ТаблицаПроводок.ВыгрузитьКолонку("ЖурналОпераций"), ИСТИНА);

	Счет = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счет, ТаблицаПроводок.ВыгрузитьКолонку("СчетДт"), ИСТИНА);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Счет, ТаблицаПроводок.ВыгрузитьКолонку("СчетКт"), ИСТИНА);

	Субконто1 = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субконто1, ТаблицаПроводок.ВыгрузитьКолонку("СубконтоДт1"), ИСТИНА);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субконто1, ТаблицаПроводок.ВыгрузитьКолонку("СубконтоКт1"), ИСТИНА);

	Субконто2 = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субконто2, ТаблицаПроводок.ВыгрузитьКолонку("СубконтоДт2"), ИСТИНА);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субконто2, ТаблицаПроводок.ВыгрузитьКолонку("СубконтоКт2"), ИСТИНА);

	Субконто3 = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субконто3, ТаблицаПроводок.ВыгрузитьКолонку("СубконтоДт3"), ИСТИНА);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Субконто3, ТаблицаПроводок.ВыгрузитьКолонку("СубконтоКт3"), ИСТИНА);

	КоличествоСтрок = 0;

	Если ИФО.Количество() > 0 Тогда
		ТаблицаБлокировок.Колонки.Добавить("ИФО");
		КоличествоСтрок = Макс(КоличествоСтрок, ИФО.Количество());
	КонецЕсли;

	Если КФО.Количество() > 0 Тогда
		ТаблицаБлокировок.Колонки.Добавить("КФО");
		КоличествоСтрок = Макс(КоличествоСтрок, КФО.Количество());
	КонецЕсли;

	Если ЖурналОпераций.Количество() > 0 Тогда
		ТаблицаБлокировок.Колонки.Добавить("ЖурналОпераций");
		КоличествоСтрок = Макс(КоличествоСтрок, ЖурналОпераций.Количество());
	КонецЕсли;

	Если Счет.Количество() > 0 Тогда
		ТаблицаБлокировок.Колонки.Добавить("Счет");
		КоличествоСтрок = Макс(КоличествоСтрок, Счет.Количество());
	КонецЕсли;

	Если Субконто1.Количество() > 0 Тогда
		ТаблицаБлокировок.Колонки.Добавить("Субконто1");
		КоличествоСтрок = Макс(КоличествоСтрок, Субконто1.Количество());
	КонецЕсли;

	Если Субконто2.Количество() > 0 Тогда
		ТаблицаБлокировок.Колонки.Добавить("Субконто2");
		КоличествоСтрок = Макс(КоличествоСтрок, Субконто2.Количество());
	КонецЕсли;

	Если Субконто3.Количество() > 0 Тогда
		ТаблицаБлокировок.Колонки.Добавить("Субконто3");
		КоличествоСтрок = Макс(КоличествоСтрок, Субконто3.Количество());
	КонецЕсли;

	Для Счетчик = 1 по КоличествоСтрок Цикл
		ТаблицаБлокировок.Добавить();
	КонецЦикла;

	ТаблицаБлокировок.ЗаполнитьЗначения(Период, "Период");
	ТаблицаБлокировок.ЗаполнитьЗначения(Организация, "Организация");
	Если ИФО.Количество() > 0 Тогда
		ТаблицаБлокировок.ЗагрузитьКолонку(ИФО, "ИФО");
	КонецЕсли;
	Если КФО.Количество() > 0 Тогда
		ТаблицаБлокировок.ЗагрузитьКолонку(КФО, "КФО");
	КонецЕсли;
	Если ЖурналОпераций.Количество() > 0 Тогда
		ТаблицаБлокировок.ЗагрузитьКолонку(ЖурналОпераций, "ЖурналОпераций");
	КонецЕсли;
	Если Счет.Количество() > 0 Тогда
		ТаблицаБлокировок.ЗагрузитьКолонку(Счет, "Счет");
	КонецЕсли;
	Если Субконто1.Количество() > 0 Тогда
		ТаблицаБлокировок.ЗагрузитьКолонку(Субконто1, "Субконто1");
	КонецЕсли;
	Если Субконто2.Количество() > 0 Тогда
		ТаблицаБлокировок.ЗагрузитьКолонку(Субконто2, "Субконто2");
	КонецЕсли;
	Если Субконто3.Количество() > 0 Тогда
		ТаблицаБлокировок.ЗагрузитьКолонку(Субконто3, "Субконто3");
	КонецЕсли;

	// заполним все колонки непустыми значениями
	НепустаяТаблица = ТаблицаБлокировок.СкопироватьКолонки();
	ЗаполнитьЗначенияСвойств(НепустаяТаблица.Добавить(), ТаблицаБлокировок[0]);
	НепустаяСтрока = НепустаяТаблица[0];

	Для каждого ТекБлокировка Из ТаблицаБлокировок Цикл

		Для каждого ТекКолонка Из ТаблицаБлокировок.Колонки Цикл

			Если НЕ ЗначениеЗаполнено(ТекБлокировка[ТекКолонка.Имя]) Тогда
				ТекБлокировка[ТекКолонка.Имя] = НепустаяСтрока[ТекКолонка.Имя];
			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат ТаблицаБлокировок;

КонецФункции

#КонецОбласти

#Область ФормированиеСхемыКомпоновкиДанныхДляТиповыхОпераций

Процедура ВычислитьФормулыЗаполненияРеквизитов(ОбщиеПараметрыЗаполнения)
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "Активность");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "Период");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "Организация");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ИФО");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "КФО");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ЖурналОпераций");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "Сумма");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СуммаНеУчитываетсяНУ");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СуммаЕНВД");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СуммаНДС");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "Содержание");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВидПервичногоДокумента");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ДатаПервичногоДокумента");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "НомерПервичногоДокумента");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "КПСКт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "КЭККт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВалютаКт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВалютнаяСуммаКт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "КоличествоКт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ПодразделениеКт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СчетКт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВидСубконтоКт1", Истина);
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СубконтоКт1");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВидСубконтоКт2", Истина);
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СубконтоКт2");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВидСубконтоКт3", Истина);
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СубконтоКт3");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ХарактеристикаДвиженияКт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "КПСДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "КЭКДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВалютаДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВалютнаяСуммаДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "КоличествоДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ПодразделениеДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СчетДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВидСубконтоДт1", Истина);
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СубконтоДт1");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВидСубконтоДт2", Истина);
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СубконтоДт2");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ВидСубконтоДт3", Истина);
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "СубконтоДт3");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "ХарактеристикаДвиженияДт");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "НомерСтроки");
	ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения, "УсловиеВыполнено");
КонецПроцедуры

Процедура ДобавитьВалютныйУчетВФормулуСуммы(Сумма)

	Сумма = "ВЫБОР
		|КОГДА &ИСПОЛЬЗОВАТЬВАЛЮТНЫЙУЧЕТ И ЗНАЧЕНИЕЗАПОЛНЕНО(ДОКУМЕНТ.ВАЛЮТАДОКУМЕНТА)
		|ТОГДА БУХГАЛТЕРСКИЕОПЕРАЦИИ.ПЕРЕСЧИТАТЬИЗВАЛЮТЫВВАЛЮТУ(" + Сумма + "
		|	ДОКУМЕНТ.ВАЛЮТАДОКУМЕНТА,
		|	&ВАЛЮТАРЕГЛУЧЕТА,
		|	&КУРС,
		|	1,
		|	&КРАТНОСТЬ,
		|	1)
		|ИНАЧЕ " + Сумма + "
		|КОНЕЦ";

КонецПроцедуры

Процедура ВычислитьФормулуЗаполненияРеквизита(ОбщиеПараметрыЗаполнения,
		ИмяПоля, ЭтоВидСубконто = Ложь)

	СтрокаПроводки = ОбщиеПараметрыЗаполнения.ТекСтрокаПроводки;
	НастройкаНовойПроводки = ОбщиеПараметрыЗаполнения.НастройкаНовойПроводки;
	ВычисляемыеПоля = ОбщиеПараметрыЗаполнения.ВычисляемыеПоля;
	ИспользуемыеРеквизиты = Новый Массив;

	Если ИмяПоля = "Период" Тогда

		Если ПустаяСтрока(СтрокаПроводки.ФормулаПериод) Тогда

			НастройкаНовойПроводки.Период = "&ПЕРИОД";

		Иначе

			Формула = "";
			ФормулаБезМакроса = "";

			ОбработатьФормулуРеквизитаПроводки(СтрокаПроводки.ФормулаПериод, Формула, ФормулаБезМакроса, ИспользуемыеРеквизиты, СтрокаПроводки.ИмяТабличнойЧастиДокумента, ИмяПоля, ОбщиеПараметрыЗаполнения.ОписаниеОшибки, , , ОбщиеПараметрыЗаполнения.РеквизитыКЭКПроводки);

			НастройкаНовойПроводки.Период = Формула;

		КонецЕсли;

	ИначеЕсли ИмяПоля = "ЖурналОпераций" Тогда

		ИмяПоляПроводки = "НомерЖурнала";

		Если ЗначениеЗаполнено(СтрокаПроводки[ИмяПоляПроводки]) Тогда

			НастройкаНовойПроводки[ИмяПоля] = "НАСТРОЙКАПРОВОДОК."
				+ ВРЕГ(ИмяПоляПроводки);
			НастройкаНовойПроводки[ИмяПоля + "БезМакроса"] = "НАСТРОЙКАПРОВОДОК."
				+ ВРЕГ(ИмяПоляПроводки);

		ИначеЕсли ЗначениеЗаполнено(СтрокаПроводки["Формула"
				+ ИмяПоляПроводки]) Тогда

			Формула = "";
			ФормулаБезМакроса = "";
			ОбработатьФормулуРеквизитаПроводки(СтрокаПроводки["Формула"
				+ ИмяПоляПроводки], Формула, ФормулаБезМакроса, ИспользуемыеРеквизиты, СтрокаПроводки.ИмяТабличнойЧастиДокумента, ИмяПоля, ОбщиеПараметрыЗаполнения.ОписаниеОшибки, , , ОбщиеПараметрыЗаполнения.РеквизитыКЭКПроводки);
			НастройкаНовойПроводки[ИмяПоля] = Формула;
			НастройкаНовойПроводки[ИмяПоля + "БезМакроса"] = ФормулаБезМакроса;

		Иначе

			Формула = "";
			ОбработатьФормулуРеквизитаПроводки("БУХГАЛТЕРСКИЕОПЕРАЦИИ.НОМЕРЖУРНАЛА(ПРОВОДКА.СЧЕТДТ, ПРОВОДКА.СЧЕТКТ)", Формула, "", ИспользуемыеРеквизиты, СтрокаПроводки.ИмяТабличнойЧастиДокумента, ИмяПоля, ОбщиеПараметрыЗаполнения.ОписаниеОшибки, , , ОбщиеПараметрыЗаполнения.РеквизитыКЭКПроводки);
			НастройкаНовойПроводки[ИмяПоля] = Формула;

		КонецЕсли;

	ИначеЕсли ИмяПоля = "НомерСтроки" Тогда

		Если ПустаяСтрока(СтрокаПроводки.ИмяТабличнойЧастиДокумента)
				ИЛИ СокрЛП(СтрокаПроводки.ИмяТабличнойЧастиДокумента) = "<>" Тогда

		Иначе

			НастройкаНовойПроводки.НомерСтроки = "СТРОКАТАБЛИЦЫ.НОМЕРСТРОКИ";

		КонецЕсли;

	ИначеЕсли ИмяПоля = "УсловиеВыполнено" Тогда

		Если ПустаяСтрока(СтрокаПроводки.Условие) Тогда

		Иначе

			Формула = "";
			ОбработатьФормулуРеквизитаПроводки(СтрокаПроводки.Условие, Формула, "", ИспользуемыеРеквизиты, СтрокаПроводки.ИмяТабличнойЧастиДокумента, ИмяПоля, ОбщиеПараметрыЗаполнения.ОписаниеОшибки, , , ОбщиеПараметрыЗаполнения.РеквизитыКЭКПроводки);
			НастройкаНовойПроводки.УсловиеВыполнено = "НастройкаПроводок.ИмяТабличнойЧастиДокумента = ИмяТабличнойЧасти И ("
				+ Формула + ")";

		КонецЕсли;

	ИначеЕсли ИмяПоля = "Организация" Тогда

	ИначеЕсли ИмяПоля = "Активность" Тогда

	ИначеЕсли ЭтоВидСубконто Тогда

		Если ЗначениеЗаполнено(СтрокаПроводки[ИмяПоля]) Тогда
			НастройкаНовойПроводки[ИмяПоля] = "НАСТРОЙКАПРОВОДОК." + ВРЕГ(ИмяПоля);
		КонецЕсли;

	Иначе

		Если ЗначениеЗаполнено(СтрокаПроводки[ИмяПоля]) Тогда

			НастройкаНовойПроводки[ИмяПоля] = "НАСТРОЙКАПРОВОДОК." + ВРЕГ(ИмяПоля);
			НастройкаНовойПроводки[ИмяПоля + "БезМакроса"] = "НАСТРОЙКАПРОВОДОК."
				+ ВРЕГ(ИмяПоля);

		Иначе

			Формула = "";
			ФормулаБезМакроса = "";
			ОбработатьФормулуРеквизитаПроводки(СтрокаПроводки["Формула"
				+ ИмяПоля], Формула, ФормулаБезМакроса, ИспользуемыеРеквизиты, СтрокаПроводки.ИмяТабличнойЧастиДокумента, ИмяПоля, ОбщиеПараметрыЗаполнения.ОписаниеОшибки, , , ОбщиеПараметрыЗаполнения.РеквизитыКЭКПроводки);
			НастройкаНовойПроводки[ИмяПоля] = Формула;
			НастройкаНовойПроводки[ИмяПоля + "БезМакроса"] = ФормулаБезМакроса;

		КонецЕсли;

	КонецЕсли;

	Если ПустаяСтрока(НастройкаНовойПроводки[ИмяПоля]) Тогда
		НастройкаНовойПроводки[ИмяПоля] = ВычисляемыеПоля.Найти(ИмяПоля).Выражение;
		Если ИмяПоля <> "Активность" И ИмяПоля <> "НомерСтроки"
				И ИмяПоля <> "Период" И ИмяПоля <> "УсловиеВыполнено" Тогда
			НастройкаНовойПроводки[ИмяПоля
				+ "БезМакроса"] = ВычисляемыеПоля.Найти(ИмяПоля).Выражение;
		КонецЕсли;
	КонецЕсли;

	ОбщиеПараметрыЗаполнения.ИспользуемыеРеквизиты.Добавить(Новый Структура("ИмяПоля, ИспользуемыеРеквизиты", ИмяПоля, ИспользуемыеРеквизиты));

КонецПроцедуры

Процедура ПрочитатьТокен(ОбщиеПараметры, Токен, ТокенБезМакроса,
		Знач ПредыдущийИдентификатор)

	Токен = "";
	ТокенБезМакроса = "";
	ПервыйСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);

	Если ПервыйСимвол = "(" Тогда
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
		Токен = Токен + "(" + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + "(" + ТекущийТокенБезМакроса;

		СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");

		Токен = Токен + ")";
		ТокенБезМакроса = ТокенБезМакроса + ")";

		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		ПредыдущийИдентификатор = Истина;
	ИначеЕсли ПервыйСимвол = ")" ИЛИ ПервыйСимвол = "," Тогда
		Возврат;
	ИначеЕсли ПервыйСимвол = "#" Тогда
		Токен = "#";
		Возврат;
	ИначеЕсли ПервыйСимвол = "?" Тогда
		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		РазборФормулыПрочитатьУсловныйОператор(ТекущийТокен, ТекущийТокенБезМакроса, ОбщиеПараметры);
		Токен = Токен + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;
	ИначеЕсли ПервыйСимвол = "&" Тогда
		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		РазборФормулыПрочитатьПараметр(ТекущийТокен, ТекущийТокенБезМакроса, ОбщиеПараметры);
		Токен = Токен + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;
	ИначеЕсли Найти("-+/*%", ПервыйСимвол) > 0 И ПредыдущийИдентификатор Тогда
		Токен = Токен + ПервыйСимвол;
		ТокенБезМакроса = ТокенБезМакроса + ПервыйСимвол;
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		ПредыдущийИдентификатор = Ложь;
	ИначеЕсли Найти("><=", ПервыйСимвол) > 0 И ПредыдущийИдентификатор Тогда
		Токен = Токен + ПервыйСимвол;
		ТокенБезМакроса = ТокенБезМакроса + ПервыйСимвол;
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		Если ПервыйСимвол = ">" ИЛИ ПервыйСимвол = "<" Тогда
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			Если СледующийСимвол = "=" ИЛИ (СледующийСимвол = ">"
					И ПервыйСимвол = "<") Тогда
				Токен = Токен + СледующийСимвол;
				ТокенБезМакроса = ТокенБезМакроса + СледующийСимвол;
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			КонецЕсли;
		КонецЕсли;
		ПредыдущийИдентификатор = Ложь;
	ИначеЕсли Найти("-+0123456789", ПервыйСимвол) > 0 Тогда
		РазборФормулыПрочитатьЧисло(ПервыйСимвол, Токен, ТокенБезМакроса, ОбщиеПараметры, ПредыдущийИдентификатор);
	ИначеЕсли ПервыйСимвол = """" Тогда
		РазборФормулыПрочитатьСтроку(ПервыйСимвол, Токен, ТокенБезМакроса, ОбщиеПараметры, ПредыдущийИдентификатор);
	Иначе
		Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
		Если Идентификатор = "ПОДОБНО" Тогда
			Токен = Токен + " " + Идентификатор;
			ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор;
			ПервыйСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
			РазборФормулыПрочитатьСтроку(ПервыйСимвол, Токен, ТокенБезМакроса, ОбщиеПараметры, ПредыдущийИдентификатор);
		ИначеЕсли Идентификатор = "И" ИЛИ Идентификатор = "ИЛИ" Тогда
			Токен = Токен + " " + Идентификатор + " ";
			ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор + " ";
			ПредыдущийИдентификатор = Ложь;
		ИначеЕсли Идентификатор = "РАЗЛИЧНЫЕ" Тогда
			Токен = Идентификатор;
			ТокенБезМакроса = Идентификатор;
			ПредыдущийИдентификатор = Ложь;
			Возврат;
		ИначеЕсли Идентификатор = "НЕОПРЕДЕЛЕНО" ИЛИ Идентификатор = "NULL" Тогда
			Токен = Токен + Идентификатор;
			ТокенБезМакроса = ТокенБезМакроса + Идентификатор;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли Идентификатор = "ЕСТЬ" Тогда
			Токен = Токен + " " + Идентификатор;
			ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор;
			Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
			Если Идентификатор = "НЕ" Тогда
				Токен = Токен + " " + Идентификатор;
				ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор;
				Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
			КонецЕсли;
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, Идентификатор, "NULL");
			Токен = Токен + " " + Идентификатор;
			ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли Идентификатор = "ВЫБОР" Тогда
			ТекущийТокен = "";
			ТекущийТокенБезМакроса = "";
			РазборФормулыПрочитатьОператорВыбора(Идентификатор, ТекущийТокен, ТекущийТокенБезМакроса, ОбщиеПараметры);
			Токен = Токен + ТекущийТокен;
			ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли Найти(",ИСТИНА,ЛОЖЬ,", "," + Идентификатор + ",") > 0 Тогда
			Токен = Токен + " " + Идентификатор;
			ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли Идентификатор = "ЗНАЧЕНИЕ" Тогда
			РазборФормулыПрочитатьЗначение(Идентификатор, Токен, ТокенБезМакроса, ОбщиеПараметры);
			Если ОбщиеПараметры.Ошибка Тогда
				Возврат;
			КонецЕсли;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли ОбщиеПараметры.ЭтоТиповаяОперация И (Идентификатор = "ДОКУМЕНТ"
				ИЛИ Идентификатор = "СТРОКАТАБЛИЦЫ"
				ИЛИ Идентификатор = "ДОПОЛНИТЕЛЬНЫЕРЕКВИЗИТЫ"
				ИЛИ Идентификатор = "ТИПОВАЯОПЕРАЦИЯ") Тогда
			Массив = Новый Массив;
			Массив.Добавить(Идентификатор);
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			Пока СледующийСимвол = "." Цикл
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
				Массив.Добавить(Идентификатор);
				СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			КонецЦикла;
			ТекстТокена = ОбработатьРеквизитыЧерезТочку(Массив);
			Токен = Токен + ТекстТокена;
			ТокенБезМакроса = ТокенБезМакроса + ТекстТокена;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли ОбщиеПараметры.ЭтоТиповаяОперация
				И Идентификатор = "ТЕКУЩИЙИТЕРАТОР" Тогда
			Токен = Идентификатор;
			ТокенБезМакроса = Идентификатор;
			Возврат;
		ИначеЕсли Идентификатор = "ЗНАЧЕНИЕРЕКВИЗИТАСТРОКИ" Тогда
		// ЗначениеРеквизитаСтроки оставлено для совместимости ранее созданных типовый операций пользователя.
			// В формулах ее можно заменить аналогом БухгалтерскиеОперации.ЗначениеРеквизитаСтроки.
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, "(");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ",");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			ИмяТЧ = СокрЛП(СтрЗаменить(ТекущийТокен, """", ""));

			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ",");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			НомерСтроки = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);

			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			// если токен содержит кавычки, то их нужно удвоить перед помещением текста в кавычки агрегатной функции
			ТекущийТокен = СтрЗаменить(ТекущийТокен, """", """""");
			ТекущийТокенБезМакроса = СтрЗаменить(ТекущийТокенБезМакроса, """", """""");

			Токен = Токен + "Вычислить(""МАКСИМУМ(ВЫБОР
				|	КОГДА ИмяТабличнойЧасти = """"" + ИмяТЧ
				+ """"" И СтрокаТаблицы.НомерСтроки = " + НомерСтроки + "
				|		ТОГДА " + ТекущийТокен + "
				|КОНЕЦ)"", ""ОбщийИтог"")";

			ТекущийТокенБезМакроса = ТекущийТокенБезМакроса
				+ "Вычислить(""МАКСИМУМ(ВЫБОР
				|	КОГДА ИмяТабличнойЧасти = """"" + ИмяТЧ
				+ """"" И СтрокаТаблицы.НомерСтроки = " + НомерСтроки + "
				|		ТОГДА " + ТекущийТокен + "
				|КОНЕЦ)"", ""ОбщийИтог"")";

			ПредыдущийИдентификатор = Истина;

		ИначеЕсли НЕ ОбщиеПараметры.ЭтоТиповаяОперация И (Идентификатор = "ОБЪЕКТ"
				ИЛИ Идентификатор = "ЗАДАНИЕ" ИЛИ Идентификатор = "ОБРАБАТЫВАЕМЫЙФОРМАТ"
				ИЛИ Идентификатор = "ДОКУМЕНТ" ИЛИ Идентификатор = "РЕКВИЗИТЫ") Тогда
				// Для форматов обмена	
			// дочитать до конца
			ИмяОбъекта = Идентификатор;
			Массив = Новый Массив;
			Массив.Добавить(Идентификатор);
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			Пока СледующийСимвол = "." Цикл
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
				Массив.Добавить(Идентификатор);
				СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			КонецЦикла;
			Если Массив.Количество() >= 2 Тогда
				ОбщиеПараметры.ИспользуемыеРеквизиты.Добавить(ИмяОбъекта + "."
					+ Массив[1]);
			КонецЕсли;
			Если Массив[0] = "ДОКУМЕНТ" Тогда
				ТекстТокена = СтрСоединить(Массив, ".");
			Иначе
				ТекстТокена = ОбработатьРеквизитыЧерезТочку(Массив, 2, ОбщиеПараметры.ЭтоТиповаяОперация);
			КонецЕсли;
			Токен = Токен + ТекстТокена;
			ТокенБезМакроса = ТокенБезМакроса + ТекстТокена;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли НЕ ОбщиеПараметры.ЭтоТиповаяОперация
				И Идентификатор = "ПРОИЗВОЛЬНЫЕПАРАМЕТРЫ" Тогда
			ИмяОбъекта = Идентификатор;
			Массив = Новый Массив;
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			Если СледующийСимвол = "." Тогда
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
				Массив.Добавить(ИмяОбъекта + "_" + Идентификатор);
				СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			КонецЕсли;
			Пока СледующийСимвол = "." Цикл
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
				Массив.Добавить(Идентификатор);
				СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			КонецЦикла;
			Если Массив.Количество() > 1 Тогда
				ТекстТокена = ОбработатьРеквизитыЧерезТочку(Массив, 2, ОбщиеПараметры.ЭтоТиповаяОперация);
			Иначе
				ТекстТокена = Массив[0];
			КонецЕсли;
			Токен = Токен + ТекстТокена;
			ТокенБезМакроса = ТокенБезМакроса + ТекстТокена;
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли НЕ ОбщиеПараметры.ЭтоТиповаяОперация И (Идентификатор = "ТЧ"
				Или Идентификатор = "ТД") Тогда
				// Для форматов обмена	
			// дочитать до конца		
			Идентификатор = ОбщиеПараметры.ТекущаяТЧ;
			Массив = Новый Массив;
			Массив.Добавить(Идентификатор);
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			Пока СледующийСимвол = "." Цикл
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
				Массив.Добавить(Идентификатор);
				СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			КонецЦикла;
			Если Массив.Количество() >= 2 Тогда
				ОбщиеПараметры.ИспользуемыеРеквизиты.Добавить(ОбщиеПараметры.ТекущаяТЧ
					+ "." + Массив[1]);
			КонецЕсли;
			ТекстТокена = ОбработатьРеквизитыЧерезТочку(Массив, 2, ОбщиеПараметры.ЭтоТиповаяОперация);
			Токен = Токен + ТекстТокена;
			ТокенБезМакроса = ТокенБезМакроса + ТекстТокена;
			ПредыдущийИдентификатор = Истина;

		ИначеЕсли Идентификатор = "ПРОВОДКА" Тогда
			Токен = Токен + Символ(0) + Идентификатор;
			ТокенБезМакроса = ТокенБезМакроса + Символ(0) + Идентификатор;;

			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ".");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
			Токен = Токен + "." + Идентификатор + Символ(0);
			ТокенБезМакроса = ТокенБезМакроса + "." + Идентификатор + Символ(0);
			ОбщиеПараметры.ИспользуемыеРеквизиты.Добавить(Идентификатор);
			ПредыдущийИдентификатор = Истина;
		ИначеЕсли ОбщиеПараметры.ЭтоТиповаяОперация
				И ЭтоИмяМодуляТиповыеОперации(Идентификатор) Тогда
			ИмяМодуля = Идентификатор;
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);

			РазборФормулыПрочитатьФункциюБухгалтерскиеОперации(Идентификатор, Токен, ТокенБезМакроса, ОбщиеПараметры, ИмяМодуля);

			ПредыдущийИдентификатор = Истина;
		ИначеЕсли НЕ ОбщиеПараметры.ЭтоТиповаяОперация
				И (Идентификатор = "БИБЛИОТЕКАФУНКЦИЙОБМЕНА"
				ИЛИ Идентификатор = "СТРОКОВЫЕФУНКЦИИКЛИЕНТСЕРВЕР"
				ИЛИ Идентификатор = "РЕЕСТРИМУЩЕСТВА") Тогда // ИЛИ Идентификатор = "ГОСУСЛУГИ" 
			// Для форматов обмена
			ТекущийТокен = "";
			ТекущийТокенБезМакроса = "";

			ИмяОбщегоМодуля = Идентификатор;
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);

			РазборФормулыПрочитатьФункциюОбщегоМодуля(Идентификатор, ТекущийТокен, ТекущийТокенБезМакроса, ОбщиеПараметры, ИмяОбщегоМодуля);

			Токен = Токен + ТекущийТокен;
			ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;

			ПредыдущийИдентификатор = Истина;
		ИначеЕсли Идентификатор = "СУММА" ИЛИ Идентификатор = "МАКСИМУМ"
				ИЛИ Идентификатор = "МИНИМУМ" ИЛИ Идентификатор = "СРЕДНЕЕ"
				ИЛИ Идентификатор = "КОЛИЧЕСТВО" Тогда
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, "(");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			Модификатор_РАЗЛИЧНЫЕ = "";

			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
			Если Идентификатор = "КОЛИЧЕСТВО" Тогда
				Если ТекущийТокен = "РАЗЛИЧНЫЕ" Тогда
					Модификатор_РАЗЛИЧНЫЕ = "РАЗЛИЧНЫЕ ";
					ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
				КонецЕсли;
			КонецЕсли;

			ИмяТЧ = СокрЛП(СтрЗаменить(ТекущийТокен, """", ""));

			СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ",");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

			// если токен содержит кавычки, то их нужно удвоить перед помещением текста в кавычки агрегатной функции
			ТекущийТокен = СтрЗаменить(ТекущийТокен, """", """""");
			ТекущийТокенБезМакроса = СтрЗаменить(ТекущийТокенБезМакроса, """", """""");

			СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			ПолеТабличнойЧасти = ?(ОбщиеПараметры.ЭтоТиповаяОперация, "ИмяТабличнойЧасти", "СлужебноеПоле_Путь");

			Токен = Токен + "Вычислить(""" + Идентификатор + "("
				+ Модификатор_РАЗЛИЧНЫЕ + "ВЫБОР
				|	КОГДА " + ПолеТабличнойЧасти + " = """"" + ИмяТЧ + """""
				|		ТОГДА " + ТекущийТокен + "
				|КОНЕЦ)"", ""ОбщийИтог"")";

			ТекущийТокенБезМакроса = ТекущийТокенБезМакроса + "Вычислить("""
				+ Идентификатор + "(" + Модификатор_РАЗЛИЧНЫЕ + "ВЫБОР
				|	КОГДА " + ПолеТабличнойЧасти + " = """"" + ИмяТЧ + """""
				|		ТОГДА " + ТекущийТокен + "
				|КОНЕЦ)"", ""ОбщийИтог"")";

			ПредыдущийИдентификатор = Истина;

		ИначеЕсли НЕ ОбщиеПараметры.ЭтоТиповаяОперация
				И Идентификатор = "СОЕДИНИТЬСТРОКИ" Тогда

			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, "(");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
			ИмяТЧ = СокрЛП(СтрЗаменить(ТекущийТокен, """", ""));

			СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ",");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

			// если токен содержит кавычки, то их нужно удвоить перед помещением текста в кавычки агрегатной функции
			Колонки = СтрЗаменить(ТекущийТокен, """", """""");
			ТекущийТокенБезМакроса = СтрЗаменить(ТекущийТокенБезМакроса, """", """""");

			СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);

			Если СледующийСимвол = "," Тогда

			//Колонки = ТекущийТокен;
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
				ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

				РазделительСтрок = ", " + ТекущийТокен;

				СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);

			Иначе
				РазделительСтрок = "";
			КонецЕсли;

			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

			Токен = Токен + "БухгалтерскиеОперацииСервер.СоединитьСтроки(
				|	БухгалтерскиеОперацииСервер.ОтобратьПодчиненныеСтроки(
				|		Вычислить(""
				|			ТаблицаЗначений(
				|				СлужебноеПоле_Путь КАК СлужебноеПоле_Путь,
				|				СлужебноеПоле_НомераСтрокПути КАК СлужебноеПоле_НомераСтрокПути,
				|				СлужебноеПоле_НомерСтрокиПоля КАК СлужебноеПоле_НомерСтрокиПоля,
				|				" + Колонки + ")"",
				|			""ОбщийИтог""),
				| 		""" + ВРег(ИмяТЧ) + """,
				|		СлужебноеПоле_НомераСтрокПути,
				|		СлужебноеПоле_НомерСтрокиПоля)
				|	" + РазделительСтрок + ")";

		ИначеЕсли Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1) = "(" Тогда

			ТекущийТокен = "";
			ТекущийТокенБезМакроса = "";

			Если ЭтоФункцияСКД(Идентификатор) Тогда
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				ПрочитатьФункциюСКД(Идентификатор, ТекущийТокен, ТекущийТокенБезМакроса, ОбщиеПараметры);
			Иначе
				Если ОбщиеПараметры.ЭтоТиповаяОперация Тогда
					РазборФормулыПрочитатьФункциюБухгалтерскиеОперации(Идентификатор, ТекущийТокен, ТекущийТокенБезМакроса, ОбщиеПараметры);
				Иначе
					РазборФормулыПрочитатьФункциюОбщегоМодуля(Идентификатор, ТекущийТокен, ТекущийТокенБезМакроса, ОбщиеПараметры, "БИБЛИОТЕКАФУНКЦИЙОБМЕНА");
				КонецЕсли;
			КонецЕсли;

			Токен = Токен + ТекущийТокен;
			ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;

			ПредыдущийИдентификатор = Истина;
		ИначеЕсли Идентификатор = "ТОГДА" ИЛИ Идентификатор = "КОГДА"
				ИЛИ Идентификатор = "КОНЕЦ" ИЛИ Идентификатор = "ИНАЧЕ" Тогда
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола
				- СтрДлина(Идентификатор);
			Возврат;
		ИначеЕсли Идентификатор = "НЕ" Тогда
			ТекущийТокен = "";
			ТекущийТокенБезМакроса = "";
			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
			Токен = Токен + " " + Идентификатор + " " + ТекущийТокен;
			ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор + " "
				+ ТекущийТокенБезМакроса;
			ПредыдущийИдентификатор = Ложь;
		ИначеЕсли Идентификатор = "В" Тогда
			СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
			Если СледующийСимвол = "И" Тогда
				Идентификатор = Идентификатор + " "
					+ ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
				СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
			КонецЕсли;
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, "(");

			Токен = Токен + " " + Идентификатор + "(";
			ТокенБезМакроса = ТокенБезМакроса + " " + Идентификатор + "(";
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			ТекущийТокен = "";
			ТекущийТокенБезМакроса = "";
			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
			Токен = Токен + ТекущийТокен;
			ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;

			СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
			Пока СледующийСимвол = "," Цикл
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				ТекущийТокен = "";
				ТекущийТокенБезМакроса = "";
				ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
				Токен = Токен + "," + ТекущийТокен;
				ТокенБезМакроса = ТокенБезМакроса + "," + ТекущийТокенБезМакроса;
				СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);
				Если ОбщиеПараметры.Ошибка Тогда
					Возврат;
				КонецЕсли;
			КонецЦикла;
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");
			Токен = Токен + ")";
			ТокенБезМакроса = ТокенБезМакроса + ")";
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			ПредыдущийИдентификатор = Ложь;
		ИначеЕсли Идентификатор = "" Тогда
			Возврат;
		Иначе
			РазборФормулыОбработатьОшибкуРазбора(ОбщиеПараметры, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неизвестный идентификатор %1'"), СтрЗаменить(Идентификатор, """", """""")));
		КонецЕсли;

	КонецЕсли;

	Если ОбщиеПараметры.Ошибка Тогда
		Возврат;
	КонецЕсли;

	СледующийСимвол = ПропуститьНезначащийТекст(ОбщиеПараметры);

	Если СледующийСимвол = "" Тогда
		Возврат;
	КонецЕсли;

	ТекущийТокен = "";
	ТекущийТокенБезМакроса = "";
	ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, ПредыдущийИдентификатор);
	Если СледующийСимвол = "#" И ОбщиеПараметры.ЭтоТиповаяОперация Тогда

		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);

		Если Идентификатор = "ЗНАЧЕНИЕЗАПОЛНЕНО" Тогда

			Если Найти(Токен, "(") > 0 Тогда
				ИмяПроверяемойФункции = Лев(Токен, Найти(Токен, "(") - 1);
			Иначе
				ИмяПроверяемойФункции = Токен;
			КонецЕсли;
			Токен = "БУХГАЛТЕРСКИЕОПЕРАЦИИ.ПРОВЕРИТЬЗАПОЛНЕНИЕ(" + Токен + ","""
				+ СтрЗаменить(СтрЗаменить(ИмяПроверяемойФункции, Символ(0), ""), """", """""")
				+ """, ";
			Токен = Токен + """" + ОбщиеПараметры.ТекущаяТЧ + """, ";
			Если НЕ ПустаяСтрока(ОбщиеПараметры.ТекущаяТЧ)
					И ОбщиеПараметры.ТекущаяТЧ <> "<>" Тогда
				Токен = Токен + "СТРОКАТАБЛИЦЫ.НОМЕРСТРОКИ"
			КонецЕсли;
			ПропуститьНезначащийТекст(ОбщиеПараметры);
			СледующийСимвол = ВРЕГ(Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1));
			Если СледующийСимвол = "/" Тогда
				ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
				Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
				Если Идентификатор <> "ПРЕРВАТЬ" Тогда

					ВызватьИсключение "Неизвестный модификатор макроса ""ЗначениеЗаполнено"": "
						+ Идентификатор;
				КонецЕсли;
				Токен = Токен + ", ИСТИНА";
			КонецЕсли;
			Токен = Токен + ")";
		КонецЕсли;
		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, ПредыдущийИдентификатор);
	КонецЕсли;

	Токен = Токен + ТекущийТокен;
	ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;

КонецПроцедуры

Функция ЭтоИмяМодуляТиповыеОперации(Идентификатор)

	Если Идентификатор = "БУХГАЛТЕРСКИЕОПЕРАЦИИ"
			ИЛИ Идентификатор = "БУХГАЛТЕРСКИЕОПЕРАЦИИПЕРЕОПРЕДЕЛЯЕМЫЙ" Тогда
		Возврат Истина;
	КонецЕсли;

	ИменаМодулей = ОписанияМодулейРасширений("Функции");
	Если ИменаМодулей.Свойство(Идентификатор) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции

Функция ПропуститьНезначащийТекст(ОбщиеПараметры)

	Пока ОбщиеПараметры.ИндексСимвола <= ОбщиеПараметры.ДлинаТекста Цикл
		ТекущийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		Если ЗначащийСимвол(ТекущийСимвол, ОбщиеПараметры.НомерСтроки) Тогда
			Возврат ВРег(ТекущийСимвол);
		КонецЕсли;

		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

	КонецЦикла;

	Возврат "";

КонецФункции

Функция ЗначащийСимвол(Буква, НомерСтроки)

	Если ПустаяСтрока(Буква) Тогда
		Если Буква = Символы.ПС Тогда
			НомерСтроки = НомерСтроки + 1;
		КонецЕсли;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ПроверитьОжидаемыйТокен(ОбщиеПараметры, Идентификатор, ОжидаемыйТокен)

	Если Идентификатор <> ОжидаемыйТокен Тогда
		ВызватьИсключение "Ожидается """ + ОжидаемыйТокен + """
			|Строка " + ОбщиеПараметры.НомерСтроки;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Процедура РазборФормулыПрочитатьУсловныйОператор(Токен, ТокенБезМакроса,
		ОбщиеПараметры)

	Токен = Токен + "ВЫБОР";
	ТокенБезМакроса = ТокенБезМакроса + "ВЫБОР";
	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
	ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, "(");
	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	ТекущийТокен = "";
	ТекущийТокенБезМакроса = "";
	ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
	Токен = Токен + " КОГДА " + ТекущийТокен;
	ТокенБезМакроса = ТокенБезМакроса + " КОГДА " + ТекущийТокенБезМакроса;
	СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
	ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ",");
	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	ТекущийТокен = "";
	ТекущийТокенБезМакроса = "";
	ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
	Токен = Токен + " ТОГДА " + ТекущийТокен;
	ТокенБезМакроса = ТокенБезМакроса + " ТОГДА " + ТекущийТокенБезМакроса;
	СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
	ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ",");
	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	ТекущийТокен = "";
	ТекущийТокенБезМакроса = "";
	ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
	Токен = Токен + " ИНАЧЕ " + ТекущийТокен;
	ТокенБезМакроса = ТокенБезМакроса + " ИНАЧЕ " + ТекущийТокенБезМакроса;
	СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
	ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");
	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	Токен = Токен + " КОНЕЦ";
	ТокенБезМакроса = ТокенБезМакроса + " КОНЕЦ";

КонецПроцедуры

Процедура РазборФормулыПрочитатьПараметр(Токен, ТокенБезМакроса,
		ОбщиеПараметры)

	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	Массив = Новый Массив;
	ИмяПараметра = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
	Массив.Добавить("&" + ИмяПараметра);
	Если ОбщиеПараметры.ИспользуемыеПараметры.Найти(ИмяПараметра) = Неопределено Тогда
		ОбщиеПараметры.ИспользуемыеПараметры.Добавить(ИмяПараметра);
	КонецЕсли;

	СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
	Пока СледующийСимвол = "." Цикл
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		Массив.Добавить(ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст));
		СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
	КонецЦикла;
	ТекстТокена = ОбработатьРеквизитыЧерезТочку(Массив, 1, ОбщиеПараметры.ЭтоТиповаяОперация);
	Токен = Токен + " " + ТекстТокена;
	ТокенБезМакроса = ТокенБезМакроса + " " + ТекстТокена;

КонецПроцедуры

Функция ПрочитатьИдентификатор(ОбщиеПараметры, ИндексСимвола, ДлинаТекста,
		Текст)
	ПропуститьНезначащийТекст(ОбщиеПараметры);

	Токен = "";
	Пока ИндексСимвола <= ДлинаТекста Цикл
		Буква = ВРЕГ(Сред(Текст, ИндексСимвола, 1));
		Если Найти("еоатинркулмДСвПдОсКцчыгзпбТНИьБФхВяРАЗЭйУЕГМЦжщЙШЩЫЛЯЧЬХЪЖЮЁёшъфэю_1234567890QWERTYUIOPASDFGHJKLZXCVBNMqwertyuiopasdfghjklzxcvbnm", Буква) = 0 Тогда
			ОбщиеПараметры.ИндексСимвола = ИндексСимвола;
			Возврат Токен;
		КонецЕсли;

		Токен = Токен + Буква;
		ИндексСимвола = ИндексСимвола + 1;
	КонецЦикла;
	ОбщиеПараметры.ИндексСимвола = ИндексСимвола;
	Возврат Токен;

КонецФункции

Функция ОбработатьРеквизитыЧерезТочку(Массив, ПредельноеКоличество = 2,
		ЭтоТиповаяОперация = Истина)

	Если Массив.Количество() = ПредельноеКоличество Тогда
		Результат = "";
		Для ИндексМассива = 0 По ПредельноеКоличество - 1 Цикл
			Результат = Результат + Массив[ИндексМассива]
				+ ?(ИндексМассива = (ПредельноеКоличество - 1)
				Или Массив[ИндексМассива] = "", "", ".");
		КонецЦикла;
		Возврат Результат;
	ИначеЕсли Массив.Количество() = 1 Тогда
		ВызватьИсключение "Ожидается имя реквизита";
	Иначе
		Если ЭтоТиповаяОперация Тогда
			Результат = "БУХГАЛТЕРСКИЕОПЕРАЦИИ.ЗНАЧЕНИЕРЕКВИЗИТА(";
		Иначе
			Результат = "БИБЛИОТЕКАФУНКЦИЙОБМЕНА.ЗНАЧЕНИЕРЕКВИЗИТАОБЪЕКТА(";
		КонецЕсли;
		Для ИндексМассива = 0 По ПредельноеКоличество - 1 Цикл
			Результат = Результат + Массив[ИндексМассива]
				+ ?(ИндексМассива = (ПредельноеКоличество - 1)
				Или Массив[ИндексМассива] = "", "", ".");
		КонецЦикла;
		Результат = Результат + ", """;
		КоличествоРеквизитов = Массив.ВГраница();
		Для ИндексМассива = ПредельноеКоличество По КоличествоРеквизитов Цикл

			Результат = Результат + Массив[ИндексМассива]
				+ ?(ИндексМассива = КоличествоРеквизитов, "", ".");

		КонецЦикла;
		Результат = Результат + """)";
	КонецЕсли;
	Возврат Результат;

КонецФункции

Процедура РазборФормулыПрочитатьЧисло(ПервыйСимвол, Токен, ТокенБезМакроса,
		ОбщиеПараметры, ПредыдущийИдентификатор)

	ТекстТокена = "";

	Если ПервыйСимвол = "-" ИЛИ ПервыйСимвол = "+" Тогда
		ТекстТокена = ТекстТокена + ПервыйСимвол;
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		ПропуститьНезначащийТекст(ОбщиеПараметры);
	КонецЕсли;

	ЕстьТочка = Ложь;
	Пока ОбщиеПараметры.ИндексСимвола <= ОбщиеПараметры.ДлинаТекста Цикл
		Буква = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		Если ЭтоЦифра(Буква) Тогда
			ТекстТокена = ТекстТокена + Буква;
		ИначеЕсли Буква = "." Тогда
			Если ЕстьТочка Тогда
				РазборФормулыОбработатьОшибкуРазбора(ОбщиеПараметры, НСтр("ru = 'Вторая точка в числе'"));
				Возврат;
			КонецЕсли;
			ЕстьТочка = Истина;
			ТекстТокена = ТекстТокена + Буква;
		Иначе
			Прервать;
		КонецЕсли;
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	КонецЦикла;
	ПредыдущийИдентификатор = Истина;
	Токен = Токен + " " + ТекстТокена;
	ТокенБезМакроса = ТокенБезМакроса + " " + ТекстТокена;

КонецПроцедуры

Функция ЭтоЦифра(Буква)

	Возврат Найти("1234567890", Буква) > 0;

КонецФункции

Процедура РазборФормулыОбработатьОшибкуРазбора(ОбщиеПараметры, ТекстОшибки)

	ОбщиеПараметры.Ошибка = Истина;
	ОписаниеОшибки = НСтр("ru = 'Ошибка в формуле реквизита ""%1"":
		|строка %2, позиция %3: %4'");

	ОбщиеПараметры.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ОбщиеПараметры.ТекущийРеквизит, ОбщиеПараметры.НомерСтроки, ОбщиеПараметры.ИндексСимвола, ТекстОшибки);
	Если ОбщиеПараметры.ЭтоТиповаяОперация Тогда
		ЗаписьЖурналаРегистрации("Типовые операции.Создание схемы", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ТиповыеОперации, , ОбщиеПараметры.ОписаниеОшибки);
	КонецЕсли;

КонецПроцедуры

Процедура РазборФормулыПрочитатьСтроку(ПервыйСимвол, Токен, ТокенБезМакроса,
		ОбщиеПараметры, ПредыдущийИдентификатор)

	ТекстТокена = ПервыйСимвол;
	Пока ИСТИНА Цикл
		ЕстьОкончаниеСтроки = Ложь;
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		Пока ОбщиеПараметры.ИндексСимвола <= ОбщиеПараметры.ДлинаТекста Цикл
			Буква = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			ТекстТокена = ТекстТокена + Буква;
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			Если Буква = """" Тогда
				ЕстьОкончаниеСтроки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьОкончаниеСтроки
				И ОбщиеПараметры.ИндексСимвола < ОбщиеПараметры.ДлинаТекста Тогда
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
			Если СледующийСимвол = """" Тогда
				ТекстТокена = ТекстТокена + СледующийСимвол;
			Иначе
				Прервать;
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЕстьОкончаниеСтроки Тогда
		РазборФормулыОбработатьОшибкуРазбора(ОбщиеПараметры, НСтр("ru = 'Ожидается символ "" (двойная кавычка)'"));
	КонецЕсли;
	ПредыдущийИдентификатор = Истина;
	Токен = Токен + " " + ТекстТокена;
	ТокенБезМакроса = ТокенБезМакроса + " " + ТекстТокена;

КонецПроцедуры

Процедура РазборФормулыПрочитатьОператорВыбора(Идентификатор, Токен,
		ТокенБезМакроса, ОбщиеПараметры)

	Токен = Токен + Идентификатор;
	ТокенБезМакроса = ТокенБезМакроса + Идентификатор;

	Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
	ПроверитьОжидаемыйТокен(ОбщиеПараметры, Идентификатор, "КОГДА");

	ТекущийТокен = "";
	ТекущийТокенБезМакроса = "";
	ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

	Токен = Токен + Символы.ПС + Идентификатор + " " + ТекущийТокен;
	ТокенБезМакроса = ТокенБезМакроса + Символы.ПС + Идентификатор + " "
		+ ТекущийТокенБезМакроса;

	Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
	ПроверитьОжидаемыйТокен(ОбщиеПараметры, Идентификатор, "ТОГДА");

	ТекущийТокен = "";
	ТекущийТокенБезМакроса = "";
	ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

	Токен = Токен + Символы.ПС + Идентификатор + " " + ТекущийТокен;
	ТокенБезМакроса = ТокенБезМакроса + Символы.ПС + Идентификатор + " "
		+ ТекущийТокенБезМакроса;
	Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
	Пока Идентификатор = "КОГДА" Цикл

		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

		Токен = Токен + Символы.ПС + Идентификатор + " " + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + Символы.ПС + Идентификатор + " "
			+ ТекущийТокенБезМакроса;

		Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
		ПроверитьОжидаемыйТокен(ОбщиеПараметры, Идентификатор, "ТОГДА");

		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

		Токен = Токен + Символы.ПС + Идентификатор + " " + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + Символы.ПС + Идентификатор + " "
			+ ТекущийТокенБезМакроса;

		Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
	КонецЦикла;
	Если Идентификатор = "ИНАЧЕ" Тогда

		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

		Токен = Токен + Символы.ПС + Идентификатор + " " + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + Символы.ПС + Идентификатор + " "
			+ ТекущийТокенБезМакроса;
		Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
	КонецЕсли;
	ПроверитьОжидаемыйТокен(ОбщиеПараметры, Идентификатор, "КОНЕЦ");
	Токен = Токен + Символы.ПС + Идентификатор;
	ТокенБезМакроса = ТокенБезМакроса + Символы.ПС + Идентификатор;

КонецПроцедуры

Процедура РазборФормулыПрочитатьЗначение(Идентификатор, Токен,
		ТокенБезМакроса, ОбщиеПараметры)

	СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
	Если СледующийСимвол = "(" Тогда
	//Это разбор предопределенного значения
		ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, "(");
		ТекстТокена = Идентификатор + "(";
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);

		ТекстТокена = ТекстТокена + Идентификатор + ".";
		СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ".");

		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
		ТекстТокена = ТекстТокена + Идентификатор;
		СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);

		Если СледующийСимвол = "." Тогда
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
			ТекстТокена = ТекстТокена + "." + Идентификатор;
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		КонецЕсли;

		ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");

		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
		ТекстТокена = ТекстТокена + ")";
	Иначе
	//Это разбор значения в форматах обмена
		Массив = Новый Массив;
		Массив.Добавить("<ЗНАЧЕНИЕ>");
		СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		Пока СледующийСимвол = "." Цикл
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
			Массив.Добавить(Идентификатор);
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		КонецЦикла;
		ТекстТокена = ОбработатьРеквизитыЧерезТочку(Массив, 1, ОбщиеПараметры.ЭтоТиповаяОперация);

	КонецЕсли;

	Токен = Токен + " " + ТекстТокена;
	ТокенБезМакроса = ТокенБезМакроса + " " + ТекстТокена;

КонецПроцедуры

// объединить со следующей
Процедура РазборФормулыПрочитатьФункциюБухгалтерскиеОперации(Идентификатор,
		Токен, ТокенБезМакроса, ОбщиеПараметры, ИмяМодуля = "БУХГАЛТЕРСКИЕОПЕРАЦИИ")

	Токен = Токен + ИмяМодуля + "." + Идентификатор + "(";
	ТокенБезМакроса = ТокенБезМакроса + ИмяМодуля + "." + Идентификатор + "(";

	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	ПропуститьНезначащийТекст(ОбщиеПараметры);
	Если Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1) <> ")" Тогда
		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

		Токен = Токен + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;
		ПропуститьНезначащийТекст(ОбщиеПараметры);
		Пока Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1) = "," Цикл
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			ТекущийТокен = "";
			ТекущийТокенБезМакроса = "";
			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
			Токен = Токен + ", " + ТекущийТокен;
			ТокенБезМакроса = ТокенБезМакроса + ", " + ТекущийТокенБезМакроса;
		КонецЦикла;
	КонецЕсли;

	Если Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1) <> ")" Тогда
		РазборФормулыОбработатьОшибкуРазбора(ОбщиеПараметры, НСтр("ru = 'Ожидается "")"" в конце функции'"));
		Возврат;
	КонецЕсли;

	Если ИмяМодуля = "БУХГАЛТЕРСКИЕОПЕРАЦИИ" И (Идентификатор = "КЭКПРОВОДКИ"
			ИЛИ Идентификатор = "КЭКПРОВОДКИСВЫБОРОМДТКТ"
			ИЛИ Идентификатор = "ДОПУСТИМЫЙКЭКПРОВОДКИ") Тогда
		ОбщиеПараметры.РеквизитыКЭКПроводки.Добавить(ОбщиеПараметры.ТекущийРеквизит);
	КонецЕсли;

	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	Токен = Токен + ")";
	ТокенБезМакроса = ТокенБезМакроса + ")";

КонецПроцедуры

// Объединить с предыдущей
Процедура РазборФормулыПрочитатьФункциюОбщегоМодуля(Идентификатор, Токен,
		ТокенБезМакроса, ОбщиеПараметры, ИмяОбщегоМодуля)

	ТекстТокена = "";

	Токен = Токен + ИмяОбщегоМодуля + "." + Идентификатор + "(";
	ТокенБезМакроса = ТокенБезМакроса + ИмяОбщегоМодуля + "." + Идентификатор
		+ "(";

	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	ПропуститьНезначащийТекст(ОбщиеПараметры);
	Если Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1) <> ")" Тогда
		ТекущийТокен = "";
		ТекущийТокенБезМакроса = "";
		ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);

		Токен = Токен + ТекущийТокен;
		ТокенБезМакроса = ТокенБезМакроса + ТекущийТокенБезМакроса;
		ПропуститьНезначащийТекст(ОбщиеПараметры);
		Пока Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1) = "," Цикл
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			ТекущийТокен = "";
			ТекущийТокенБезМакроса = "";
			ПрочитатьТокен(ОбщиеПараметры, ТекущийТокен, ТекущийТокенБезМакроса, Ложь);
			Токен = Токен + ", " + ТекущийТокен;
			ТокенБезМакроса = ТокенБезМакроса + ", " + ТекущийТокенБезМакроса;
		КонецЦикла;
	КонецЕсли;

	Если Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1) <> ")" Тогда
		РазборФормулыОбработатьОшибкуРазбора(ОбщиеПараметры, НСтр("ru = 'Ожидается "")"" в конце функции'"));
		Возврат;
	КонецЕсли;

	ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
	Токен = Токен + ")";
	ТокенБезМакроса = ТокенБезМакроса + ")";

	СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);

	Если СледующийСимвол = "." Тогда
		Массив = Новый Массив;
		Массив.Добавить(Токен);

		Пока СледующийСимвол = "." Цикл
			ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;
			Идентификатор = ПрочитатьИдентификатор(ОбщиеПараметры, ОбщиеПараметры.ИндексСимвола, ОбщиеПараметры.ДлинаТекста, ОбщиеПараметры.Текст);
			Массив.Добавить(Идентификатор);
			СледующийСимвол = Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1);
		КонецЦикла;

		ТекстТокена = ОбработатьРеквизитыЧерезТочку(Массив, 1, ОбщиеПараметры.ЭтоТиповаяОперация);
		Токен = ТекстТокена;
		ТокенБезМакроса = ТекстТокена;
	КонецЕсли;

КонецПроцедуры

Функция ЭтоФункцияСКД(Идентификатор)

	Возврат Найти(",ПОДОБНО,ФОРМАТ,НАЧАЛОПЕРИОДА,КОНЕЦПЕРИОДА,ДОБАВИТЬКДАТЕ,РАЗНОСТЬДАТ,ДАТАВРЕМЯ,"
		+ "ПОДСТРОКА,ДЛИНАСТРОКИ,ГОД,КВАРТАЛ,МЕСЯЦ,ДЕНЬГОДА,ДЕНЬ,НЕДЕЛЯ,ДЕНЬНЕДЕЛИ,ТИПЗНАЧЕНИЯ,ТИП,"
		+ "ЧАС,МИНУТА,СЕКУНДА,ВЫРАЗИТЬ,ЕСТЬNULL,ПРЕДСТАВЛЕНИЕ,СТРОКА,ЗНАЧЕНИЕЗАПОЛНЕНО,", ","
		+ Идентификатор + ",") > 0;

КонецФункции

Процедура ПрочитатьФункциюСКД(ИдентификаторФункции, Токен, ТокенБезМакроса,
		ОбщиеПараметры)

	Токен = Токен + ИдентификаторФункции + "(";
	ТокенБезМакроса = ТокенБезМакроса + ИдентификаторФункции + "(";

	ПараметрыФункций = ПараметрыФункцийСКД();

	СтрокаФункции = ПараметрыФункций.Найти(ИдентификаторФункции, "Имя");
	КоличествоПараметров = СтрокаФункции.КоличествоПараметров;

	Для СчетчикПараметров = 1 По КоличествоПараметров Цикл

		Токен1 = "";
		ТокенБезМакроса1 = "";
		ПрочитатьТокен(ОбщиеПараметры, Токен1, ТокенБезМакроса1, Ложь);

		Идентификатор = Токен1;

		Токен = Токен + Идентификатор;
		ТокенБезМакроса = ТокенБезМакроса + ТокенБезМакроса1;
		ПропуститьНезначащийТекст(ОбщиеПараметры);
		СледующийСимвол = ВРЕГ(Сред(ОбщиеПараметры.Текст, ОбщиеПараметры.ИндексСимвола, 1));

		Если СчетчикПараметров = КоличествоПараметров Тогда
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ")");
		Иначе
			ПроверитьОжидаемыйТокен(ОбщиеПараметры, СледующийСимвол, ",");
		КонецЕсли;

		Если ОбщиеПараметры.Ошибка Тогда
			Возврат;
		КонецЕсли;

		Токен = Токен + СледующийСимвол;
		ТокенБезМакроса = ТокенБезМакроса + СледующийСимвол;
		ОбщиеПараметры.ИндексСимвола = ОбщиеПараметры.ИндексСимвола + 1;

	КонецЦикла;

КонецПроцедуры

Функция ПараметрыФункцийСКД()

	ПараметрыФункций = Новый ТаблицаЗначений;
	ПараметрыФункций.Колонки.Добавить("Имя");
	ПараметрыФункций.Колонки.Добавить("КоличествоПараметров");

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ПОДОБНО";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ФОРМАТ";
	ФункцияСКД.КоличествоПараметров = 2;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "НАЧАЛОПЕРИОДА";
	ФункцияСКД.КоличествоПараметров = 2;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "КОНЕЦПЕРИОДА";
	ФункцияСКД.КоличествоПараметров = 2;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ДОБАВИТЬКДАТЕ";
	ФункцияСКД.КоличествоПараметров = 3;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "РАЗНОСТЬДАТ";
	ФункцияСКД.КоличествоПараметров = 3;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ДАТАВРЕМЯ";
	ФункцияСКД.КоличествоПараметров = 6;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ПОДСТРОКА";
	ФункцияСКД.КоличествоПараметров = 3;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ДЛИНАСТРОКИ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ГОД";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "КВАРТАЛ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "МЕСЯЦ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ДЕНЬГОДА";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ДЕНЬ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "НЕДЕЛЯ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ДЕНЬНЕДЕЛИ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ЧАС";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "МИНУТА";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "СЕКУНДА";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ВЫРАЗИТЬ";
	ФункцияСКД.КоличествоПараметров = 2;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ЕСТЬNULL";
	ФункцияСКД.КоличествоПараметров = 2;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ПРЕДСТАВЛЕНИЕ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "СТРОКА";
	ФункцияСКД.КоличествоПараметров = 1;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "СОКРЛ";
	ФункцияСКД.КоличествоПараметров = 1;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "СОКРП";
	ФункцияСКД.КоличествоПараметров = 1;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "СОКРЛП";
	ФункцияСКД.КоличествоПараметров = 1;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ЛЕВ";
	ФункцияСКД.КоличествоПараметров = 2;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ПРАВ";
	ФункцияСКД.КоличествоПараметров = 2;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "СТРНАЙТИ";
	ФункцияСКД.КоличествоПараметров = 2;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ВРЕГ";
	ФункцияСКД.КоличествоПараметров = 1;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "НРЕГ";
	ФункцияСКД.КоличествоПараметров = 1;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "СТРЗАМЕНИТЬ";
	ФункцияСКД.КоличествоПараметров = 3;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "НСТР";
	ФункцияСКД.КоличествоПараметров = 2;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ОКР";
	ФункцияСКД.КоличествоПараметров = 2;
	
	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ЦЕЛ";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ЗНАЧЕНИЕЗАПОЛНЕНО";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ТИП";
	ФункцияСКД.КоличествоПараметров = 1;

	ФункцияСКД = ПараметрыФункций.Добавить();
	ФункцияСКД.Имя = "ТИПЗНАЧЕНИЯ";
	ФункцияСКД.КоличествоПараметров = 1;

	Возврат ПараметрыФункций;

КонецФункции

Процедура ДополнительноОбработатьРеквизитыКоличество(НастройкаНовойПроводки)
	Если ПустаяСтрока(НастройкаНовойПроводки.КоличествоКт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.КоличествоКт) = "NULL"
			ИЛИ ПустаяСтрока(НастройкаНовойПроводки.СчетКт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.СчетКт) = "NULL" Тогда
		НастройкаНовойПроводки.КоличествоКт = "NULL";
	Иначе
		НастройкаНовойПроводки.КоличествоКт = "ВЫБОР
			|КОГДА " + НастройкаНовойПроводки.СчетКтБезМакроса
			+ " В (&КОЛИЧЕСТВЕННЫЕСЧЕТА)
			|ТОГДА ВЫРАЗИТЬ(" + НастройкаНовойПроводки.КоличествоКт
			+ ", ""ЧИСЛО(15,3)"")
			|ИНАЧЕ NULL
			|КОНЕЦ";
	КонецЕсли;
	Если ПустаяСтрока(НастройкаНовойПроводки.КоличествоДт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.КоличествоДт) = "NULL"
			ИЛИ ПустаяСтрока(НастройкаНовойПроводки.СчетДт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.СчетДт) = "NULL" Тогда
		НастройкаНовойПроводки.КоличествоДт = "NULL";
	Иначе
		НастройкаНовойПроводки.КоличествоДт = "ВЫБОР
			|КОГДА " + НастройкаНовойПроводки.СчетДтБезМакроса
			+ " В (&КОЛИЧЕСТВЕННЫЕСЧЕТА)
			|ТОГДА ВЫРАЗИТЬ(" + НастройкаНовойПроводки.КоличествоДт
			+ ", ""ЧИСЛО(15,3)"")
			|ИНАЧЕ NULL
			|КОНЕЦ";
	КонецЕсли;
КонецПроцедуры

Процедура ДополнительноОбработатьРеквизитыВалюта(НастройкаНовойПроводки)
	Если ПустаяСтрока(НастройкаНовойПроводки.ВалютаКт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.ВалютаКт) = "NULL"
			ИЛИ ПустаяСтрока(НастройкаНовойПроводки.СчетКт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.СчетКт) = "NULL" Тогда
		НастройкаНовойПроводки.ВалютаКт = "NULL";
		НастройкаНовойПроводки.ВалютнаяСуммаКт = "NULL";
	Иначе
		НастройкаНовойПроводки.ВалютаКт = "ВЫБОР
			|КОГДА " + НастройкаНовойПроводки.СчетКтБезМакроса + " В (&ВАЛЮТНЫЕСЧЕТА)
			|ТОГДА ВЫРАЗИТЬ(" + НастройкаНовойПроводки.ВалютаКтБезМакроса
			+ ", ""Справочник.Валюты"")
			|ИНАЧЕ NULL
			|КОНЕЦ";
		НастройкаНовойПроводки.ВалютнаяСуммаКт = "ВЫБОР
			|КОГДА " + НастройкаНовойПроводки.СчетКтБезМакроса + " В (&ВАЛЮТНЫЕСЧЕТА)
			|ТОГДА ВЫРАЗИТЬ(" + НастройкаНовойПроводки.ВалютнаяСуммаКтБезМакроса
			+ ", ""ЧИСЛО(18,2)"")
			|ИНАЧЕ NULL
			|КОНЕЦ";
	КонецЕсли;
	Если ПустаяСтрока(НастройкаНовойПроводки.ВалютаДт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.ВалютаДт) = "NULL"
			ИЛИ ПустаяСтрока(НастройкаНовойПроводки.СчетДт)
			ИЛИ ВРЕГ(НастройкаНовойПроводки.СчетДт) = "NULL" Тогда
		НастройкаНовойПроводки.ВалютаДт = "NULL";
		НастройкаНовойПроводки.ВалютнаяСуммаДт = "NULL";
	Иначе
		НастройкаНовойПроводки.ВалютаДт = "ВЫБОР
			|КОГДА " + НастройкаНовойПроводки.СчетДтБезМакроса + " В (&ВАЛЮТНЫЕСЧЕТА)
			|ТОГДА ВЫРАЗИТЬ(" + НастройкаНовойПроводки.ВалютаДтБезМакроса
			+ ", ""Справочник.Валюты"")
			|ИНАЧЕ NULL
			|КОНЕЦ";
		НастройкаНовойПроводки.ВалютнаяСуммаДт = "ВЫБОР
			|КОГДА " + НастройкаНовойПроводки.СчетДтБезМакроса + " В (&ВАЛЮТНЫЕСЧЕТА)
			|ТОГДА ВЫРАЗИТЬ(" + НастройкаНовойПроводки.ВалютнаяСуммаДтБезМакроса
			+ ", ""ЧИСЛО(18,2)"")
			|ИНАЧЕ NULL
			|КОНЕЦ";
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьТекстыВычисляемыхПолей(НастройкаПроводок,
		ВычисляемыеПоля)
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "Активность");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "Период");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "Организация", "Справочник.Организации");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ИФО", "Справочник.ИсточникиФинансовогоОбеспечения");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "КФО", "Перечисление.КВД");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ЖурналОпераций", "Справочник.Журналы");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "Сумма");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СуммаЕНВД");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СуммаНеУчитываетсяНУ");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СуммаНДС");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "Содержание", "Строка(254)");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВидПервичногоДокумента", "Строка(100)");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ДатаПервичногоДокумента", "Дата");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "НомерПервичногоДокумента", "Строка(40)");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "КПСКт", "Справочник.КлассификационныеПризнакиСчетов");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "КЭККт", "Справочник.КОСГУ");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВалютаКт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВалютнаяСуммаКт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "КоличествоКт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ПодразделениеКт", "Справочник.Подразделения");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СчетКт", "ПланСчетов.ЕПСБУ");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВидСубконтоКт1");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СубконтоКт1");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВидСубконтоКт2");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СубконтоКт2");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВидСубконтоКт3");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СубконтоКт3");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ХарактеристикаДвиженияКт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "КПСДт", "Справочник.КлассификационныеПризнакиСчетов");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "КЭКДт", "Справочник.КОСГУ");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВалютаДт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВалютнаяСуммаДт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "КоличествоДт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ПодразделениеДт", "Справочник.Подразделения");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СчетДт", "ПланСчетов.ЕПСБУ");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВидСубконтоДт1");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СубконтоДт1");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВидСубконтоДт2");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СубконтоДт2");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ВидСубконтоДт3");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "СубконтоДт3");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "ХарактеристикаДвиженияДт");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "НомерСтроки");
	СформироватьТекстВычисляемогоПоля(НастройкаПроводок, ВычисляемыеПоля, "УсловиеВыполнено", "Булево");

	ДополнитьСписокТиповЗначенийСубконто(ВычисляемыеПоля);
	ПолеСумма = ВычисляемыеПоля.Найти("Сумма");
	ПолеСумма.Выражение = "ВЫРАЗИТЬ(" + ПолеСумма.Выражение
		+ ", ""ЧИСЛО(18,2)"")";
	ПолеСумма = ВычисляемыеПоля.Найти("СуммаЕНВД");
	ПолеСумма.Выражение = "ВЫРАЗИТЬ(" + ПолеСумма.Выражение
		+ ", ""ЧИСЛО(18,2)"")";
	ПолеСумма = ВычисляемыеПоля.Найти("СуммаНеУчитываетсяНУ");
	ПолеСумма.Выражение = "ВЫРАЗИТЬ(" + ПолеСумма.Выражение
		+ ", ""ЧИСЛО(18,2)"")";
	ПолеСумма = ВычисляемыеПоля.Найти("СуммаНДС");
	ПолеСумма.Выражение = "ВЫРАЗИТЬ(" + ПолеСумма.Выражение
		+ ", ""ЧИСЛО(18,2)"")";
КонецПроцедуры

Процедура СформироватьТекстВычисляемогоПоля(НастройкаПроводок,
		ВычисляемыеПоля, ИмяПоля, ТипВыражения = Неопределено)

	ВременнаяТаблица1 = НастройкаПроводок.Скопировать(, "ТекущаяПроводка, КодПроводки,"
		+ ИмяПоля);
	ВременнаяТаблица2 = ВременнаяТаблица1.Скопировать();
	ВременнаяТаблица2.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ВременнаяТаблица2.ЗаполнитьЗначения(1, "Количество");
	ВременнаяТаблица2.Свернуть(ИмяПоля, "Количество");

	ТекущееВычисляемоеПоле = ВычисляемыеПоля.Найти(ИмяПоля);
	ВыражениеВычисляемогоПоля = "";
	Если ВременнаяТаблица2.Количество() = 1 Тогда
		ВыражениеВычисляемогоПоля = ВременнаяТаблица2[0][ИмяПоля];
	Иначе
		ЗначениеПоУмолчанию = ТекущееВычисляемоеПоле.Выражение;
		Если ПустаяСтрока(ЗначениеПоУмолчанию) Тогда
			ЗначениеПоУмолчанию = "NULL";
		КонецЕсли;
		ВременнаяТаблица2.Сортировать("Количество");
		ВыражениеВычисляемогоПоля = "Выбор";
		Индекс = 0;
		КоличествоСтрок = ВременнаяТаблица2.Количество();
		Для каждого ТекСтрокаФормулы Из ВременнаяТаблица2 Цикл
			Индекс = Индекс + 1;
			Если Индекс = КоличествоСтрок Тогда
				ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля + "
					|Иначе ";
			Иначе
				ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля + "
					|Когда";
				МассивПроводок = ВременнаяТаблица1.НайтиСтроки(Новый Структура(ИмяПоля, ТекСтрокаФормулы[ИмяПоля]));
				ПерваяПроводка = Истина;
				Для каждого ТекущаяОбрабатываемаяПроводка Из МассивПроводок Цикл
					Если ПерваяПроводка Тогда
						ПерваяПроводка = Ложь;
					Иначе
						ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля + "
							|ИЛИ";
					КонецЕсли;
					ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля
						+ " НастройкаПроводок.ТекущаяПроводка = &"
						+ ТекущаяОбрабатываемаяПроводка.КодПроводки;
				КонецЦикла;
				ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля + "
					|Тогда ";
			КонецЕсли;
			Если ПустаяСтрока(ТекСтрокаФормулы[ИмяПоля]) Тогда
				ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля
					+ ЗначениеПоУмолчанию;
			Иначе
				ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля
					+ ТекСтрокаФормулы[ИмяПоля];
			КонецЕсли;

		КонецЦикла;
		ВыражениеВычисляемогоПоля = ВыражениеВычисляемогоПоля + "
			|Конец";
	КонецЕсли;
	Если ТипВыражения <> Неопределено Тогда
		ТекущееВычисляемоеПоле.Выражение = "ВЫРАЗИТЬ(" + ВыражениеВычисляемогоПоля
			+ ", """ + ТипВыражения + """)";
	Иначе
		ТекущееВычисляемоеПоле.Выражение = ВыражениеВычисляемогоПоля;
	КонецЕсли;

КонецПроцедуры

Функция ДоработатьФормулуУточненияПериода(ВыражениеПериод, ВыражениеИстина, ВыражениеЛожь)

	Возврат СтрШаблон("ВЫБОР
		|	КОГДА %1 = КОНЕЦПЕРИОДА(%1, ""ДЕНЬ"")
		|		ТОГДА %2
		|	ИНАЧЕ %3
		|КОНЕЦ", ВыражениеПериод, ВыражениеИстина, ВыражениеЛожь);


КонецФункции

Процедура ДополнитьСписокТиповЗначенийСубконто(ВычисляемыеПоля)

	МассивИменПолей = Новый Массив;
	МассивИменПолей.Добавить("СубконтоКт1");
	МассивИменПолей.Добавить("СубконтоКт2");
	МассивИменПолей.Добавить("СубконтоКт3");
	МассивИменПолей.Добавить("СубконтоДт1");
	МассивИменПолей.Добавить("СубконтоДт2");
	МассивИменПолей.Добавить("СубконтоДт3");
	МассивИменПолей.Добавить("ХарактеристикаДвиженияКт");
	МассивИменПолей.Добавить("ХарактеристикаДвиженияДт");

	ФиктивноеУсловие = "";
	СписокТиповСубконто = БухгалтерскиеОперацииПовтИсп.СписокТиповСубконто();
	Для каждого ТекТипСубконто Из СписокТиповСубконто Цикл
		ФиктивноеУсловие = ФиктивноеУсловие + "
			|КОГДА ЛОЖЬ ТОГДА ЗНАЧЕНИЕ(" + ВРЕГ(ТекТипСубконто.Представление)
			+ ".ПУСТАЯССЫЛКА)";
	КонецЦикла;
	ФиктивноеУсловие = ФиктивноеУсловие + "
		|ИНАЧЕ NULL КОНЕЦ";

	Для каждого ИмяПоля Из МассивИменПолей Цикл

		ПолеСубконто = ВычисляемыеПоля.Найти(ИмяПоля);
		ПолеСубконто.Выражение = "ВЫБОР 
			|КОГДА ИСТИНА
			|ТОГДА " + ПолеСубконто.Выражение + ФиктивноеУсловие;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Устаревшие

// Устарела.
// В документе есть идентфикатор первичного документа.
// 
// Параметры:
//  Идентификатор - СправочникСсылка.ИдентификаторыОбъектовМетаданных
// 
// Возвращаемое значение:
//  Булево
Функция ВДокументеЕстьИдентфикаторПервичногоДокумента(Идентификатор) Экспорт
	Возврат БухгалтерскиеОперацииПовтИспНаВремяСеанса.ВДокументеЕстьИдентфикаторПервичногоДокумента(Идентификатор);
КонецФункции

// Устарел. Следует использовать БухгалтерскиеОперацииРаботаСФормами.ДобавитьРеквизитыЭлементыНаФорму 
Процедура ДобавитьРеквизитыЭлементыНаФорму(ПараметрыДобавленияЭлементовФормы) Экспорт

	БухгалтерскиеОперацииРаботаСФормами.ДобавитьРеквизитыЭлементыНаФорму(ПараметрыДобавленияЭлементовФормы);

КонецПроцедуры

// Устарела. Следует использовать БухгалтерскиеОперацииРаботаСФормами.ШаблонСвойствЭлементаФормы
Функция ШаблонСвойствЭлементаФормы(ЭтоГруппа) Экспорт

	Возврат БухгалтерскиеОперацииРаботаСФормами.ШаблонСвойствЭлементаФормы(ЭтоГруппа);

КонецФункции

// Устарела. Следует использовать БухгалтерскиеОперацииРаботаСФормами.ЗаполнитьСвойстваЭлементаФормыИзСтарогоФорматаНастроек
Процедура ЗаполнитьСвойстваЭлементаФормыИзСтарогоФорматаНастроек(СвойстваЭлемента,
		СтарыеНастройки, ЭтоГруппа) Экспорт

	БухгалтерскиеОперацииРаботаСФормами.ЗаполнитьСвойстваЭлементаФормыИзСтарогоФорматаНастроек(СвойстваЭлемента, СтарыеНастройки, ЭтоГруппа);

КонецПроцедуры

// Устарела. Следует использовать Справочники.ТиповыеОперации.ПустаяСтруктураДопРеквизитовОперации
//
Функция ПустаяСтруктураДопРеквизитовОперации(ТиповаяОперация,
		ТипыДопРеквизитов = Неопределено, БезВалюты = Ложь) Экспорт
	Возврат Справочники.ТиповыеОперации.ПустаяСтруктураДопРеквизитовОперации(ТиповаяОперация, ТипыДопРеквизитов, БезВалюты);
КонецФункции

// Устарела. Следует использовать Справочники.ТиповыеОперации.ДанныеТиповойОперации
Функция ДанныеТиповойОперации(ТиповаяОперация, ТребуемыеДанные = "*") Экспорт
	Возврат Справочники.ТиповыеОперации.ДанныеТиповойОперации(ТиповаяОперация, ТребуемыеДанные);
КонецФункции

// Устарела.  Следует использовать БухгалтерскиеОперацииКлиентСервер.УстановитьДоступностьЗависимыхРеквизитовФормы()
Процедура УстановитьДоступностьЗависимыхРеквизитовФормы(Форма, ПолеДляРеквизитов = Неопределено) Экспорт

	ВедущиеЭлементы = Новый Массив;

	Для каждого ОписаниеЗависимости Из Форма["БухгалтерскиеОперации_СписокЗависимыхЭлементов"] Цикл

		Если ВедущиеЭлементы.Найти(ОписаниеЗависимости.Значение.ВедущийРеквизит) = Неопределено Тогда

			РеквизитыФормы = Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"].НайтиСтроки(Новый Структура("ИмяРеквизита", ОписаниеЗависимости.Значение.ВедущийРеквизит));
			Если РеквизитыФормы.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;

			ВедущиеЭлементы.Добавить(Новый Структура("ИмяРеквизита, ИмяЭлемента", РеквизитыФормы[0].ИмяРеквизита, РеквизитыФормы[0].ИмяЭлемента));
		КонецЕсли;

	КонецЦикла;

	Для каждого ВедущийЭлемент Из ВедущиеЭлементы Цикл

		ИзменяемыеЭлементы = БухгалтерскиеОперацииКлиентСервер.ПолучитьСписокЗависимыхЭлементовФормы(Форма["БухгалтерскиеОперации_СписокЗависимыхЭлементов"], ВедущийЭлемент.ИмяРеквизита);

		Если ИзменяемыеЭлементы.Количество() > 0 Тогда

			СтруктураИменЭлементов = Новый Структура;
			Если СтрНачинаетсяС(ВедущийЭлемент.ИмяРеквизита, "Объект.") Тогда
				СтруктураИменЭлементов.Вставить("СчетОбъекта", СтрРазделить(ВедущийЭлемент.ИмяРеквизита, ".")[1]);
			Иначе
				СтруктураИменЭлементов.Вставить("СчетФормы", ВедущийЭлемент.ИмяРеквизита);
			КонецЕсли;
			Для каждого ТекЭлемент Из ИзменяемыеЭлементы Цикл

				СтруктураИменЭлементов.Вставить("Субконто"
					+ ТекЭлемент.НомерСубконто, ТекЭлемент.ИмяЭлемента);
				СтруктураИменЭлементов.Вставить("СубконтоФормы"
					+ ТекЭлемент.НомерСубконто, ТекЭлемент.ИмяЭлемента);

			КонецЦикла;

			ОбщегоНазначенияБГУКлиентСервер.УстановитьЗаголовкиСубконто(Форма, Форма.Объект, СтруктураИменЭлементов);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
