
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект); 
	
	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда 
		ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы(ЭтотОбъект, Объект);
		ЗаполнитьОтветственныеЛица();
	КонецЕсли;
	
	ЭтоКапВложения = ЭтоПоступлениеКапВложений();
	РассчитатьИтогиПоДокументамУчета();
	ЗаполнитьЕдиницыИзмеренияИтогов();
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
	ОбновитьТекстЗаголовковВсехСтрокТаблицыСведенияОПринятыхОбъектахНФА(ЭтотОбъект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект); 
	
	ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыСведенияОПринятыхОбъектахНФА(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьДоговора();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.СведенияЭлектронногоАктаОПриемеПередачеНФА" Тогда
		ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ВыбранноеЗначение);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыАктаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаДополнительно" Тогда
		ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьДоступностьДоговора();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьДоступностьДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	ДокументОснованиеПриИзмененииНаСервере();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Функция НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448()
	Возврат ЭлектронныеДокументыБГУ.НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
КонецФункции

&НаКлиенте
Процедура НадписьДопСведенияЭлектронногоАктаПоФорме0510448Нажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Параметры.Ключ.Пустая() Тогда
		ТекстОшибки = НСтр("ru='Необходимо записать документ для заполнение сведений электронного акта о приеме-передаче НФА.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыДопСведений = НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
	
	ПараметрыДопСведений.Ссылка = Объект.Ссылка;
	ПараметрыДопСведений.ДатаСведений = Объект.Дата;
	ПараметрыДопСведений.Организация = Объект.Организация;
	
	ЭлектронныеДокументыБГУКлиент.ОткрытьФормуДопСведенийДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, Объект, ПараметрыДопСведений);
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСостояниеЭДОАктыОПриемеПередачеНФАНажатие(Элемент)

	ЭлектронныеДокументыБГУКлиент.ОткрытьСостояниеЭДОАктамиОПриемеПередачеНФА(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураЗаполненаПоДаннымПолучателяПриИзменении(Элемент)
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
	НоменклатураЗаполненаПоДаннымПолучателяПриИзмененииНаСервере();
	РассчитатьИтогиПоДокументамУчета();
	ЗаполнитьЕдиницыИзмеренияИтогов();
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыСведенияОПринятыхОбъектахНФАНоменклатура

&НаКлиенте
Процедура СведенияОПринятыхОбъектахНФАНоменклатураПриИзменении(Элемент)
	Если Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные <> Неопределено Тогда
		ВыбранноеЗначение = Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НФА;
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			НовыеЗначения = ЗаполнитьДанныеНФАДляАкта(ВыбранноеЗначение, Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НФАУОтправителя, 
				Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НаименованиеНФАУОтправителя);
			Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НаименованиеНФА = НовыеЗначения.НаименованиеНФА;
			Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.ЕдИзмКод = НовыеЗначения.ЕдИзмКод;
			Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.ЕдИзмНаим = НовыеЗначения.ЕдИзмНаим;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПринятыхОбъектахНФАНоменклатураОчистка(Элемент, СтандартнаяОбработка)
	ВыбранноеЗначение = Неопределено;
	НовыеЗначения = ЗаполнитьДанныеНФАДляАкта(ВыбранноеЗначение, Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НФАУОтправителя, 
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НаименованиеНФАУОтправителя);
	Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НаименованиеНФА = НовыеЗначения.НаименованиеНФА;
	Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.ЕдИзмКод = НовыеЗначения.ЕдИзмКод;
	Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.ЕдИзмНаим = НовыеЗначения.ЕдИзмНаим;
КонецПроцедуры

&НаКлиенте
Процедура СведенияОПринятыхОбъектахНФАОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные <> Неопределено Тогда
		НовыеЗначения = ЗаполнитьДанныеНФАДляАкта(ВыбранноеЗначение.НФА, 
			Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НФАУОтправителя, 
			Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НаименованиеНФАУОтправителя);
				
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НФА = ВыбранноеЗначение.НФА;
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НаименованиеНФА = НовыеЗначения.НаименованиеНФА;
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.ЕдИзмКод = НовыеЗначения.ЕдИзмКод;
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.ЕдИзмНаим = НовыеЗначения.ЕдИзмНаим;
		
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.Количество = ВыбранноеЗначение.Количество;
		Если ЭтоКапВложения Тогда
			Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.СуммаФактКапВложений = ВыбранноеЗначение.Сумма;
		Иначе	
			Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.БалансоваяСтоимость = ВыбранноеЗначение.Сумма;
		КонецЕсли;
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.СчетУчета = ВыбранноеЗначение.СчетУчета;
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.КПС = ВыбранноеЗначение.КПС;
		Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.КФО = ВыбранноеЗначение.КФО;
	КонецЕсли;
	ЗаполнитьЕдиницыИзмеренияИтогов();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи

&НаКлиенте
Процедура ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиИмяФайла" Тогда
		УправлениеНФАКлиент.ОткрытьЭлектронныйДокументПриложенияИзФайла(
			ВыбраннаяСтрока, 
			ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи, 
			УникальныйИдентификатор);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыОтраженияВУчете

&НаКлиенте
Процедура ДокументыОтраженияВУчетеДляАктаОПриемеПередачеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ДокументОтражения", ВыбранноеЗначение);
		НайденныеСтроки = Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче.Добавить().ДокументОтражения = ВыбранноеЗначение;
			
			ЗаполнитьДанныеПоДокументуУчета(ВыбранноеЗначение);
		
			РассчитатьИтогиПоДокументамУчета();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОтраженияВУчетеДляАктаОПриемеПередачеДокументОтраженияПриИзменении(Элемент)
	Если Элементы.ДокументыОтраженияВУчете.ТекущиеДанные <> Неопределено Тогда
		ВыбранноеЗначение = Элементы.ДокументыОтраженияВУчете.ТекущиеДанные.ДокументОтражения;
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			ЗаполнитьДанныеПоДокументуУчета(ВыбранноеЗначение);
			РассчитатьИтогиПоДокументамУчета();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОтраженияВУчетеДляАктаОПриемеПередачеПриИзменении(Элемент)
	РассчитатьИтогиПоДокументамУчета();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыОтраженияВУчетеДляАктаОПриемеПередачеПослеУдаления(Элемент)
	РассчитатьИтогиПоДокументамУчета();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборДокументов(Команда)
	
	ПараметрыДляВыбора = Новый Структура;
	ПараметрыДляВыбора.Вставить("ЗакрыватьПриВыборе", 	Истина);
	ПараметрыДляВыбора.Вставить("Организация",        	Объект.Организация);
	ПараметрыДляВыбора.Вставить("ЗаДату",             	Объект.Дата);
	ПараметрыДляВыбора.Вставить("ЗаказчикПоКонтракту",	Объект.Контрагент);
	ПараметрыДляВыбора.Вставить("Поставщик",			Объект.Поставщик);
	ПараметрыДляВыбора.Вставить("ДоговорСПоставщиком",	Объект.ДоговорСПоставщиком);
	ПараметрыДляВыбора.Вставить("Подразделение",		Объект.Подразделение);
	ПараметрыДляВыбора.Вставить("КодВидаПодбора",     	1);
	
	ОткрытьФорму("Документ.ПрочееОтражениеЭлектронногоДокументаВУчете.Форма.ФормаПодбораДокументов", ПараметрыДляВыбора, Элементы.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче);
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатурыАкта(Команда)
	
	Если Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru='Необходимо заполнить список документов отражения в учете на закладке ""Документы поступления НФА"".'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	Если Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные <> Неопределено Тогда
		
		ЗаполнитьТаблицуНФАПолучателя();
		АдресДанныхНФАПолученныхВХранилище = ПоместитьТаблицуНФАПолученныхВХранилище();
		АдресДанныхНФАУчтенныхВХранилище = ПоместитьТаблицуНФАУчтенныхВХранилище();
		
		ПараметрыДляВыбора = Новый Структура;
		ПараметрыДляВыбора.Вставить("ЗакрыватьПриВыборе", 		Истина);
		ПараметрыДляВыбора.Вставить("Организация",        		Объект.Организация);
		ПараметрыДляВыбора.Вставить("НоменклатураОтправителя",	Элементы.СведенияОПринятыхОбъектахНФА.ТекущиеДанные.НФАУОтправителя);
		ПараметрыДляВыбора.Вставить("ЗаДату",             		Объект.Дата);
		ПараметрыДляВыбора.Вставить("Контрагент",          		Объект.Контрагент);
		
		ПараметрыДляВыбора.Вставить("АдресДанныхНФАПолученныхВХранилище",	АдресДанныхНФАПолученныхВХранилище);
		ПараметрыДляВыбора.Вставить("АдресДанныхНФАУчтенныхВХранилище",		АдресДанныхНФАУчтенныхВХранилище);
		
		ОткрытьФорму("Документ.ПрочееОтражениеЭлектронногоДокументаВУчете.Форма.ФормаПодбораНоменклатурыИзДокументаУчета", ПараметрыДляВыбора, Элементы.СведенияОПринятыхОбъектахНФА);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуНФАПолученныхВХранилище()
	
	Результат =  ПоместитьВоВременноеХранилище(ТаблицаНФАПолучателя.Выгрузить(), ЭтотОбъект.УникальныйИдентификатор);
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПоместитьТаблицуНФАУчтенныхВХранилище()
	
	ТаблицаДокументовУчета = Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеМЗМатериалы.Номенклатура КАК НФА,
	               |	ПоступлениеМЗМатериалы.Количество КАК Количество,
	               |	ПоступлениеМЗМатериалы.Всего КАК Сумма,
	               |	ПоступлениеМЗМатериалы.СчетУчета КАК СчетУчета,
	               |	ПоступлениеМЗМатериалы.КПС КАК КПС,
	               |	ПоступлениеМЗМатериалы.КФО КАК КФО
	               |ИЗ
	               |	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	               |ГДЕ
	               |	ПоступлениеМЗМатериалы.Ссылка В(&ДокументыУчета)";
	Запрос.УстановитьПараметр("ДокументыУчета", ТаблицаДокументовУчета.ВыгрузитьКолонку("ДокументОтражения"));
	НоменклатураИзПоступленияНФА = Запрос.Выполнить().Выгрузить();
	
	Возврат ПоместитьВоВременноеХранилище(НоменклатураИзПоступленияНФА);

КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьДоговора()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент));

КонецПроцедуры // УстановитьДоступностьДоговора()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоОтражениеЭДП = Истина;
	ЭтоОтражениеВходящегоАкта = Ложь;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
		ЭтоОтражениеЭДП = Истина;
	КонецЕсли;	

	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
		ЭтоОтражениеЭДП = Ложь;
		ЭтоОтражениеВходящегоАкта = Истина;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	"ГруппаОтражениеВУчетеЭДП", "Видимость", ЭтоОтражениеЭДП);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	"ГруппаОтражениеВУчетеВходящегоАкта", "Видимость", ЭтоОтражениеВходящегоАкта);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
	"ГруппаСумма", "Видимость", НЕ ЭтоОтражениеВходящегоАкта);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда	
		
		УстановитьРеквизитыИзЭДП();
		
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда	

		ДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументОснование,
			"Организация, Контрагент, Договор, СуммаДокумента, ВидПервичногоДокумента, ДатаПервичногоДокумента, НомерПервичногоДокумента");
		
		Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		Объект.НФАПереданыЭлектроннымАктом = Истина; 
		Объект.Организация = ДанныеЗаполнения.Организация;
		Объект.Контрагент = ДанныеЗаполнения.Контрагент;
		Объект.Договор = ДанныеЗаполнения.Договор;
		Объект.СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Объект.НоменклатураЗаполненаПоДаннымПолучателя = ЭлектронныеДокументыБГУ.ИспользоватьНоменклатуруПолучателяВОтветномАктеОПриемеПередачеНФА(ДанныеЗаполнения.Организация);

		
		Объект.ВидПервичногоДокумента = ДанныеЗаполнения.ВидПервичногоДокумента;
		Объект.ДатаПервичногоДокумента = ДанныеЗаполнения.ДатаПервичногоДокумента;
		Объект.НомерПервичногоДокумента = ДанныеЗаполнения.НомерПервичногоДокумента;

		Объект.СведенияОПринятыхОбъектахНФА.Очистить();
		
		//Заполняем по данным отправителя НФА
		СчСтрок = 0;
		Для Каждого ТекСтрока Из Объект.ДокументОснование.ПереданныеНФА Цикл
			СчСтрок = СчСтрок + 1;
			НоваяСтрока = Объект.СведенияОПринятыхОбъектахНФА.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			НоваяСтрока.КодСтроки = Формат(СчСтрок, "ЧЦ=3; ЧВН=");
			НоваяСтрока.НФА = "";
			НоваяСтрока.НФАУОтправителя = ТекСтрока.НФА;
			НоваяСтрока.НаименованиеНФАУОтправителя = ТекСтрока.НаименованиеНФА;
			НоваяСтрока.КоличествоУОтправителя = ТекСтрока.Количество;
		КонецЦикла;
		
		ОбновитьТекстЗаголовковВсехСтрокТаблицыСведенияОПринятыхОбъектахНФА(ЭтотОбъект);
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиПоДокументамУчета() 
	Запрос = Новый Запрос;
	
	ЗапросТекст = "ВЫБРАТЬ
	              |	ПоступлениеМЗМатериалы.Количество КАК Количество,
	              |	ПоступлениеМЗМатериалы.Всего КАК Всего
	              |ИЗ
	              |	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	              |ГДЕ
	              |	ПоступлениеМЗМатериалы.Ссылка В(&ДокументыУчета)
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |	ПоступлениеМЗМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	              |ИЗ
	              |	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	              |ГДЕ
	              |	ПоступлениеМЗМатериалы.Ссылка В(&ДокументыУчета)";
	
	Запрос.Текст = ЗапросТекст;

	ДокументыУчета = Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче.Выгрузить();
	Запрос.УстановитьПараметр("ДокументыУчета", ДокументыУчета.ВыгрузитьКолонку("ДокументОтражения"));
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();	
	
	ВсеНФАДокументовУчета = РезультатыЗапросов[0].Выгрузить();
	ВсеЕдИзмНФАДокументовУчета = РезультатыЗапросов[1].Выгрузить();

	СуммаИтоговПоДокументам = ВсеНФАДокументовУчета.Итог("Всего");
	КоличествоИтоговПоДокументам = ВсеНФАДокументовУчета.Итог("Количество");
	ЕдиницыИзмеренияИтоговПоДокументам = НСтр("ru='ед.'");
	Если ВсеЕдИзмНФАДокументовУчета.Количество() = 1 Тогда
		ОбщаяЕдИзм = ВсеЕдИзмНФАДокументовУчета[0].ЕдиницаИзмерения;
		Если ЗначениеЗаполнено(ОбщаяЕдИзм) Тогда
			ЕдиницыИзмеренияИтоговПоДокументам = СокрЛП(ОбщаяЕдИзм);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоДокументуУчета(ДокументУчета)
	Если ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументУчета,
			"Контрагент, Договор, ЦМО, Подразделение, СчетУчета");
		Объект.ЦМО = СтруктураДанных.ЦМО;
		Объект.Подразделение = СтруктураДанных.Подразделение;
		Объект.Поставщик = СтруктураДанных.Контрагент;
		Объект.ДоговорСПоставщиком = СтруктураДанных.Договор;
		
		ЭтоКапВложения = Ложь;
		Если СокрЛП(СтруктураДанных.СчетУчета) = "106.00" Тогда
			ЭтоКапВложения = Истина;
		КонецЕсли;	
		
		ДанныеУчетаМЗ = ДанныеУчетаМЗ(ДокументУчета);
		ДанныеУчетаМЗ.Свернуть("СчетУчета, КПС, КФО");
		
		Для Каждого ТекСтрока Из Объект.СведенияОПринятыхОбъектахНФА Цикл
			ТекСтрока.АналитическаяГруппа = НСтр("ru='30'");
			Если ЭтоКапВложения Тогда
				ТекСтрока.ВидИмущества = НСтр("ru='вложения в нефинансовые активы'");
			Иначе	
				ТекСтрока.ВидИмущества = НСтр("ru='иное движимое'");
			КонецЕсли;
			
			Если ДанныеУчетаМЗ.Количество() > 0 Тогда
				ТекСтрока.СчетУчета = ДанныеУчетаМЗ[0].СчетУчета;
				Если НЕ ЗначениеЗаполнено(ТекСтрока.СчетУчета) Тогда
					ТекСтрока.СчетУчета = СтруктураДанных.СчетУчета;
				КонецЕсли;	
				ТекСтрока.КПС = ДанныеУчетаМЗ[0].КПС;
				ТекСтрока.КФО = ДанныеУчетаМЗ[0].КФО;
			КонецЕсли;
			
			Если ЭтоКапВложения Тогда
				ТекСтрока.СуммаФактКапВложений = ТекСтрока.БалансоваяСтоимость;
				ТекСтрока.БалансоваяСтоимость = 0;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	ЗаполнитьДанныеПоВсемДокументамУчета();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоВсемДокументамУчета()
	СписокНоменклатурыОтправителя = Объект.СведенияОПринятыхОбъектахНФА.Выгрузить();
	МассивНоменклатурыОтправителя = СписокНоменклатурыОтправителя.ВыгрузитьКолонку("НФАУОтправителя");
	ВсяНоменклатураПолучателя = ВсяНоменклатураПолучателяАкта0510448(Объект.Организация, МассивНоменклатурыОтправителя);

	ВсеДанныеИзДокументовУчета = ВсеДанныеИзДокументовУчета();
	
	Для Каждого ТекСтрока Из объект.СведенияОПринятыхОбъектахНФА Цикл
		Если Объект.НоменклатураЗаполненаПоДаннымПолучателя Тогда
			Если НЕ ЗначениеЗаполнено(ТекСтрока.НФА) Тогда
				ПараметрыОтбораНФА = Новый Структура;
				ПараметрыОтбораНФА.Вставить("Номенклатура", ТекСтрока.НФАУОтправителя);
				
				НайденныеСтроки = ВсяНоменклатураПолучателя.НайтиСтроки(ПараметрыОтбораНФА);
				Если НайденныеСтроки.Количество() = 1 Тогда
					СоответствующаяНоменклатураПолучателя = НайденныеСтроки[0].СоответствующаяНоменклатура;
					
					ПараметрыОтбораНФАИзДокументов = Новый Структура;
					ПараметрыОтбораНФАИзДокументов.Вставить("Номенклатура", СоответствующаяНоменклатураПолучателя);
					
					НайденныеСтрокиИзДокументовУчета = ВсеДанныеИзДокументовУчета.НайтиСтроки(ПараметрыОтбораНФАИзДокументов);
					Если НайденныеСтрокиИзДокументовУчета.Количество() = 1 Тогда
						Номенклатура = НайденныеСтрокиИзДокументовУчета[0].Номенклатура;
						Количество = НайденныеСтрокиИзДокументовУчета[0].Количество;
						Всего = НайденныеСтрокиИзДокументовУчета[0].Всего;
						СчетУчета = НайденныеСтрокиИзДокументовУчета[0].СчетУчета;
						КПС = НайденныеСтрокиИзДокументовУчета[0].КПС;
						КФО = НайденныеСтрокиИзДокументовУчета[0].КФО;
						ЕдиницаИзмерения = НайденныеСтрокиИзДокументовУчета[0].ЕдиницаИзмерения;
						
						ТекСтрока.НФА = Номенклатура;
						ТекСтрока.Количество = Количество;
						Если ЭтоКапВложения Тогда
							ТекСтрока.СуммаФактКапВложений = Всего;
						Иначе
							ТекСтрока.БалансоваяСтоимость = Всего;
						КонецЕсли;
						
						Реквизиты = "НаименованиеПолное, ЕдиницаИзмерения";
						СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, Реквизиты);
						
						ТекСтрока.НаименованиеНФА = СтруктураДанных.НаименованиеПолное;
						
						ЕдИзмКод = "";
						ЕдИзмНаим = "";
						Если НЕ ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
							ЕдиницаИзмерения = СтруктураДанных.ЕдиницаИзмерения;
							Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
								РеквизитыЕдИзм = "Код, Наименование";
								СтруктураДанныхЕдИзм = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.ЕдиницаИзмерения, РеквизитыЕдИзм);
								ЕдИзмКод = СокрЛП(СтруктураДанныхЕдИзм.Код);
								ЕдИзмНаим = СокрЛП(СтруктураДанныхЕдИзм.Наименование);
							КонецЕсли;	
						КонецЕсли;	
						
						ТекСтрока.СчетУчета = СчетУчета;
						ТекСтрока.КПС = КПС;
						ТекСтрока.КФО = КФО;
						ТекСтрока.ЕдИзмКод = ЕдИзмКод;
						ТекСтрока.ЕдИзмНаим = ЕдИзмНаим;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ВсеДанныеИзДокументовУчета()
	ДокументыОтраженияТЗ = Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче.Выгрузить();
	ДокументыОтражения = ДокументыОтраженияТЗ.ВыгрузитьКолонку("ДокументОтражения");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеМЗМатериалы.Номенклатура КАК Номенклатура,
	               |	ПоступлениеМЗМатериалы.Количество КАК Количество,
	               |	ПоступлениеМЗМатериалы.СчетУчета КАК СчетУчета,
	               |	ПоступлениеМЗМатериалы.КПС КАК КПС,
	               |	ПоступлениеМЗМатериалы.КФО КАК КФО,
	               |	ПоступлениеМЗМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ПоступлениеМЗМатериалы.Всего КАК Всего
	               |ИЗ
	               |	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	               |ГДЕ
	               |	ПоступлениеМЗМатериалы.Ссылка В(&ДокументыУчета)";
	Запрос.УстановитьПараметр("ДокументыУчета", ДокументыОтражения);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

&НаСервере
Функция ВсяНоменклатураПолучателяАкта0510448(Организация, НоменклатураОтправителя) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Результат = Справочники.Номенклатура.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СопоставлениеНоменклатурыБГУ.Номенклатура КАК Номенклатура,
	|	СопоставлениеНоменклатурыБГУ.СоответствующаяНоменклатура КАК СоответствующаяНоменклатура
	|ИЗ
	|	РегистрСведений.СопоставлениеНоменклатурыБГУ КАК СопоставлениеНоменклатурыБГУ
	|ГДЕ
	|	СопоставлениеНоменклатурыБГУ.Организация = &Организация
	|	И СопоставлениеНоменклатурыБГУ.Номенклатура В(&Номенклатура)
	|	И СопоставлениеНоменклатурыБГУ.КодВидаСопоставления = &КодВидаСопоставления";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураОтправителя);
	Запрос.УстановитьПараметр("КодВидаСопоставления", 1);
    Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ДанныеУчетаМЗ(ПоступлениеМЗ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеМЗМатериалы.КПС КАК КПС,
	               |	ПоступлениеМЗМатериалы.КФО КАК КФО,
	               |	ПоступлениеМЗМатериалы.СчетУчета КАК СчетУчета
	               |ИЗ
	               |	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	               |ГДЕ
	               |	ПоступлениеМЗМатериалы.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", ПоступлениеМЗ);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура УстановитьРеквизитыИзЭДП() 
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументОснование,
			"Организация, Контрагент, Договор, ВалютаДокумента, СуммаДокумента");
		ЗаполнитьЗначенияСвойств(Объект, СтруктураДанных);
		Объект.Дата = ЭлектронныеДокументыБГУ.ДатаВходящегоИзвещенияЭДП(Объект.ДокументОснование);
		
		ДокументыОтражения = ЭлектронныеДокументыБГУВызовСервера.ДокументыОтраженияДляЭДП(Объект.ДокументОснование);
		СуммаОтраженияВучете = ДокументыОтражения.Итог("Сумма");
		Объект.СуммаДокумента = СтруктураДанных.СуммаДокумента - СуммаОтраженияВучете;
	Иначе
		Объект.Контрагент = "";
		Объект.Договор = "";
		Объект.ВалютаДокумента = "";
		Объект.СуммаДокумента = 0;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственныеЛица()
	ДатаДокумента = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ОбщегоНазначения.ТекущаяДатаПользователя());
	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
		ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"),
		Объект.Организация, ДатаДокумента, Объект.Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
			И Объект.Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Объект.Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
	КонецЕсли;

	Объект.ОтветственныйИсполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(
		Объект.Ответственный, Объект.Организация, "Документ.ПрочееОтражениеЭлектронногоДокументаВУчете");
	
КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений = "")
	ЭлектронныеДокументыБГУ.ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, ТекстСведений);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ДанныеДляАкта)
	КоличествоФайлов = ДанныеДляАкта.КоличествоФайлов;
	
	ТекстСведений = ЭлектронныеДокументыБГУКлиент.ТекстПриложеноФайлов(КоличествоФайлов);

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений);
КонецПроцедуры	
	
&НаСервере
Процедура ЗаполнитьЕдиницыИзмеренияИтогов()
	ЕдиницыИзмеренияИтогов = НСтр("ru='ед.'");
	
	ЕдинаяЕдИзм = Истина;
	ТекЕдИзм = "";
	ТекКодЕдИзм = "";
	Для Каждого ТекСтрока Из Объект.СведенияОПринятыхОбъектахНФА Цикл
		Если НЕ ЗначениеЗаполнено(ТекКодЕдИзм) Тогда
			ТекКодЕдИзм = ТекСтрока.ЕдИзмКод;
			ТекЕдИзм = ТекСтрока.ЕдИзмНаим;
		Иначе
			Если НЕ СокрЛП(ТекКодЕдИзм) = СокрЛП(ТекСтрока.ЕдИзмКод) Тогда
				ЕдинаяЕдИзм = Ложь;
				Прервать;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Если ЕдинаяЕдИзм Тогда
		ЕдиницыИзмеренияИтогов = ТекЕдИзм;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере()
	ЭлектронныеДокументыБГУ.ЗаполнитьСостояниеЭДОАктаПоФорме0510448(Объект.Ссылка, Элементы.ДекорацияСостояниеЭДОАкты);
	Если Элементы.ДекорацияСостояниеЭДОАкты.Заголовок = "Не начат" Тогда
		ВидимостьЭДОАктами = Ложь;
	Иначе		
		ВидимостьЭДОАктами = Истина;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСостояниеЭДОБГУ", "Видимость", ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияЭДОУПД", "Видимость", НЕ ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", НЕ ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СведенияОПринятыхОбъектахНФАГруппаНоменклатура", "Видимость", Объект.НоменклатураЗаполненаПоДаннымПолучателя);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СведенияОПринятыхОбъектахНФАКоличествоУОтправителя", "Видимость", Объект.НоменклатураЗаполненаПоДаннымПолучателя);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СведенияОПринятыхОбъектахНФАПодборНоменклатурыАкта", "Видимость", Объект.НоменклатураЗаполненаПоДаннымПолучателя);

КонецПроцедуры

&НаСервере
Функция ЭтоПоступлениеКапВложений()
	Результат = Ложь;
	
	Если Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче.Количество() > 0 Тогда
		ДокументУчета = Объект.ДокументыОтраженияВУчетеДляАктаОПриемеПередаче[0].ДокументОтражения;
		Если ТипЗнч(ДокументУчета) = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
			СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументУчета,
				"СчетУчета");
			
			Если СокрЛП(СтруктураДанных.СчетУчета) = "106.00" Тогда
				Результат = Истина;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

&НаСервере
Функция ЗаполнитьДанныеНФАДляАкта(ВыбранноеНФА, НФАУОтправителя = Неопределено, НаименованиеНФАУОтправителя = "")
	Результат = Новый Структура;
 	Если ВыбранноеНФА = Неопределено Тогда
		Реквизиты = "НаименованиеПолное, ЕдиницаИзмерения";
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НФАУОтправителя, Реквизиты);
		РеквизитыЕдИзм = "Код, Наименование";
		СтруктураДанныхЕдИзм = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.ЕдиницаИзмерения, РеквизитыЕдИзм);
		
		Результат.Вставить("НаименованиеНФА", НаименованиеНФАУОтправителя);
		Результат.Вставить("ЕдИзмКод", СтруктураДанныхЕдИзм.Код);
		Результат.Вставить("ЕдИзмНаим", СтруктураДанныхЕдИзм.Наименование);
	Иначе
		Реквизиты = "НаименованиеПолное, ЕдиницаИзмерения";
		СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбранноеНФА, Реквизиты);
		РеквизитыЕдИзм = "Код, Наименование";
		СтруктураДанныхЕдИзм = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанных.ЕдиницаИзмерения, РеквизитыЕдИзм);
		
		Результат.Вставить("НаименованиеНФА", СтруктураДанных.НаименованиеПолное);
		Результат.Вставить("ЕдИзмКод", СтруктураДанныхЕдИзм.Код);
		Результат.Вставить("ЕдИзмНаим", СтруктураДанныхЕдИзм.Наименование);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура НоменклатураЗаполненаПоДаннымПолучателяПриИзмененииНаСервере()
	Если НЕ Объект.НоменклатураЗаполненаПоДаннымПолучателя Тогда
		Для Каждого ТекСтрока Из Объект.СведенияОПринятыхОбъектахНФА Цикл
			ВыбранноеЗначение = Неопределено;
			НовыеЗначения = ЗаполнитьДанныеНФАДляАкта(ВыбранноеЗначение, ТекСтрока.НФАУОтправителя, 
				ТекСтрока.НаименованиеНФАУОтправителя);
			ТекСтрока.НаименованиеНФА = НовыеЗначения.НаименованиеНФА;
			ТекСтрока.ЕдИзмКод = НовыеЗначения.ЕдИзмКод;
			ТекСтрока.ЕдИзмНаим = НовыеЗначения.ЕдИзмНаим;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи()

	УправлениеНФА.ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи(Объект, ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНФАПолучателя()
	ТаблицаНФА = Объект.СведенияОПринятыхОбъектахНФА.Выгрузить(, "НФА, Количество, БалансоваяСтоимость, СчетУчета, КПС, КФО");
	ТаблицаНФА.Свернуть("НФА, СчетУчета, КПС, КФО", "Количество, БалансоваяСтоимость");
	ТаблицаНФАПолучателя.Очистить();
	Для Каждого ТекСтрока Из ТаблицаНФА Цикл
		Если ЗначениеЗаполнено(ТекСтрока.НФА) Тогда
			НоваяСтрока = ТаблицаНФАПолучателя.Добавить();
			НоваяСтрока.НФА = ТекСтрока.НФА;
			НоваяСтрока.СчетУчета = ТекСтрока.СчетУчета;
			НоваяСтрока.КПС = ТекСтрока.КПС;
			НоваяСтрока.КФО = ТекСтрока.КФО;
			НоваяСтрока.Количество = ТекСтрока.Количество;
			НоваяСтрока.Сумма = ТекСтрока.БалансоваяСтоимость;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыСведенияОПринятыхОбъектахНФА(ТекущаяСтрока)

	ТекущаяСтрока.ЗаголовокНФАУОтправителя = НСтр("ru = 'Номенклатура у отправителя:'");
	ТекущаяСтрока.ЗаголовокНФАУПолучателя = НСтр("ru = 'Номенклатура у получателя:'");
	ТекущаяСтрока.ЗаголовокСчетУчета = НСтр("ru = 'Счет учета:'");
	ТекущаяСтрока.ЗаголовокКФО = НСтр("ru = 'КФО:'");
	ТекущаяСтрока.ЗаголовокКПС = НСтр("ru = 'КПС:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыСведенияОПринятыхОбъектахНФА(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.СведенияОПринятыхОбъектахНФА Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыСведенияОПринятыхОбъектахНФА(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
