
// Процедура инициализирует запись регистра с датой регистрации изменений в бухгалтерском регистре.
//
// Параметры :
//	Запись - РегистрСведенийЗапись.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ.
//
Процедура ИнициализироватьДатуРегистрации(Знач Запись) Экспорт
	Перем Отбор, Текст, МД, Таб;
	
	МД = НачалоДня(НачалоГода(ТекущаяДатаСеанса()) - 1);
	Если (МД <= Запись.ДатаРегистрации) Тогда
		Возврат;
	КонецЕсли;	
	Отбор = Новый Структура;
	Отбор.Вставить("Начало", Запись.ДатаРегистрации);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	ЕПСБУ.Период КАК Период
	        |ИЗ	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЕПСБУ
			|ГДЕ ЕПСБУ.Активность И (&Начало <= ЕПСБУ.Период)
			|УПОРЯДОЧИТЬ ПО ЕПСБУ.Период";
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() = 0) Тогда
		Запись.ДатаРегистрации = ФИББГУМенеджерОбмена.ДатаГоризонта();
	Иначе
		Запись.ДатаРегистрации = Таб[0].Период;
	КонецЕсли;
	
КонецПроцедуры	

// Процедура увеличивает дату регистрации изменений в бухгалтерском регистре.
//
// Параметры :
//	ДатаРегистрации - Дата - новое значение даты регистрации.
//	ПервоеУвеличение - Булево - это первое увеличение даты регистрации.
//	ПериодРегистрацииВМесяцахЕПСБУ - Число - шаг периода регистрации в месяцах. 
//
Процедура УвеличитьДатуРегистрации(ДатаРегистрации, 
								   Знач ПервоеУвеличение,
								   Знач ПериодРегистрацииВМесяцахЕПСБУ) Экспорт
	
	Если (ПервоеУвеличение И (КонецГода(ДатаРегистрации) = КонецДня(ДатаРегистрации))) Тогда
		ДатаРегистрации = КонецДня(ДатаРегистрации) + 1;
	Иначе	
		ДатаРегистрации = НачалоДня(ДобавитьМесяц(ДатаРегистрации, ПериодРегистрацииВМесяцахЕПСБУ));
	КонецЕсли;	
	
КонецПроцедуры	

// Регистрация за период изменений в бухгалтерском регистре.
//
// Параметры :
// 	Узел - ПланОбменаСсылка.ФИБОбменБГУ - узел плана обмена, в который требуется выгрузить данные.
//  Начало - Дата - начало периода регистрации.
//  Конец - Дата, Неопределено - конец периода регистрации (все до этой даты, т.е. <, если не заполнено,
//								 то без ограничений сверху).
//	Организации - Массив - ограничение по организациям.
//  Счета - Массив, Неопределено - ограничение по счетам. 
//  ВыгружатьДанныеПоЗабалансовымСчетам - Булево - выгружать данные по забалансовым счетам.
//	СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура РегистрацияИзмененийВБухгалтерскомРегистре(Знач Узел,
													 Знач Начало,
													 Знач Конец,
													 Знач Организации,
													 Знач Счета,
													 Знач ВыгружатьДанныеПоЗабалансовымСчетам,
													 СтандартнаяОбработка) Экспорт
													 
КонецПроцедуры													 
													 
// Обработчик регистрации изменений для начальной выгрузки данных.
//
// Параметры:
// 	Получатель - ПланОбменаСсылка.ФИБОбменБГУ - узел плана обмена, в который требуется выгрузить данные.
//	СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки
//                                 события.
//	Отбор - Массив - регистрируемые объекты метаданных.
//
Процедура РегистрацияИзмененийНачальнойВыгрузкиДанных(Знач Получатель, СтандартнаяОбработка, Знач Отбор) Экспорт

КонецПроцедуры	

// Вызывается перед выполнением синхронизации данных.
//
// Параметры:
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализируемые
//								   в рамках выполнения сеанса обмена.
//
Процедура ПередКонвертацией(Знач КомпонентыОбмена) Экспорт

КонецПроцедуры	

// Вызывается после выполнения синхронизации данных.
//
// Параметры:
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные
//								   в рамках выполнения сеанса обмена.
//
Процедура ПослеКонвертации(Знач КомпонентыОбмена) Экспорт

КонецПроцедуры	

// Вызывается перед выполнением отложенного заполнения.
//
// Параметры:
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные
//								   в рамках выполнения сеанса обмена.
//
Процедура ПередОтложеннымЗаполнением(Знач КомпонентыОбмена) Экспорт

КонецПроцедуры	
	
// Заполняет таблицу правил обработки данных.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаОбработкиДанных - таблица значений, в которую добавляются правила. 
//
Процедура ЗаполнитьПравилаОбработкиДанных(Знач НаправлениеОбмена, Знач ПравилаОбработкиДанных) Экспорт
	
КонецПроцедуры

// Заполняет таблицу правил конвертации объектов.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаКонвертации - таблица значений, в которую добавляются правила.
//
Процедура ЗаполнитьПравилаКонвертацииОбъектов(Знач НаправлениеОбмена, Знач ПравилаКонвертации) Экспорт

КонецПроцедуры

// Заполняет таблицу правил конвертации предопределенных данных.
//
// Параметры:
//  НаправлениеОбмена - строка ("Отправка" либо "Получение").
//  ПравилаКонвертации - таблица значений, в которую будут добавлены правила. 
//
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(Знач НаправлениеОбмена, Знач ПравилаКонвертации) Экспорт

КонецПроцедуры
	
// Заполняет параметры конвертации.
//
// Параметры:
//  ПараметрыКонвертации - Структура, в которую добавляются параметры конвертации.
//
Процедура ЗаполнитьПараметрыКонвертации(Знач ПараметрыКонвертации) Экспорт

КонецПроцедуры
	
// Процедура-обертка, выполняет запуск указанной в параметрах процедуры модуля менеджера обмена через формат.
//
// Параметры:
//  ИмяПроцедуры - Строка.
//  СтруктураПараметров - Структура, содержащая передаваемые параметры.
//
Процедура ВыполнитьПроцедуруМодуляМенеджера(Знач ИмяПроцедуры, Знач Параметры) Экспорт

КонецПроцедуры

// Обработчик вызывается после конвертации данных из контрагента в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Контрагенты - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура Отправка_ПослеЗаполненияДанныхКонтрагента(Знач ДанныеИБ,
													Знач ДанныеXDTO,
													Знач КомпонентыОбмена,
													Знач СтекВыгрузки,
													Пропустить) Экспорт
									
КонецПроцедуры

// Обработчик вызывается после конвертации данных из договора в пакет XDTO.
// 
// Параметры :
//	ДанныеИБ - СправочникОбъект.Договора - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура Отправка_ПослеЗаполненияДанныхДоговора(Знач ДанныеИБ,
												 Знач ДанныеXDTO,
												 Знач КомпонентыОбмена,
												 Знач СтекВыгрузки,
												 Пропустить) Экспорт
									
КонецПроцедуры

// Процедура вызывается перед заполнением корреспонденции счета по субконто при выгрузке данных.
//
// Параметры :
//	ЭлемXDTO - Структура - с данными объекта XDTO.
//	Запись - РегистрБухгалтерииЗапись - обрабатываемая запись информационной базы.
//	КтДт - Строка - субконто по дебету/кредиту.
//	ХарактеристикаДвижения - значение характеристики движения.
//	СубконтоКтДт - содержит коллекцию значений дополнительных измерений, относящихся к счету.
// 
Процедура Отправка_ПередЗаполнениемПоСубконто(Знач ЭлемXDTO, Знач Запись, Знач КтДт, ХарактеристикаДвижения, СубконтоКтДт) Экспорт
	
КонецПроцедуры	

// Процедура вызывается после заполнения корреспонденции счета по субконто при выгрузке данных.
//
// Параметры :
//	ЭлемXDTO - Структура - с данными объекта XDTO.
//	Запись - РегистрБухгалтерииЗапись - обрабатываемая запись информационной базы.
//	КтДт - Строка - субконто по дебету/кредиту.
// 
Процедура Отправка_ПослеЗаполненияПоСубконто(Знач ЭлемXDTO, Знач Запись, Знач КтДт) Экспорт
	
КонецПроцедуры	

// Процедура вызывается перед добавлением данных о платежных реквизитах при выгрузке данных.
// 
// Параметры :
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	Ссылка - ДокументСсылка - регистратор.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках выполнения сеанса обмена.
//
Процедура Отправка_ПередДобавлениемРеквизитовПлатежныхДокументов(Знач ДанныеXDTO, Ссылка, Знач КомпонентыОбмена) Экспорт
	
	Если (Не КомпонентыОбмена.УзелКорреспондентаОбъект.ЭтоБМО) Тогда
		Ссылка = Неопределено;
	КонецЕсли;

КонецПроцедуры	

// Процедура вызывается после обработчика конвертации данных из бухгалтерского регистра в пакет XDTO.
// 
// Параметры :
//	Регистратор - ДокументСсылка - регистратор изменений в бухгалтерском регистре.
//	ДанныеИБ - РегистрБухгалтерииНаборЗаписей - обрабатываемый объект информационной базы.
//	ДанныеXDTO - Структура - с данными объекта XDTO.
//	КомпонентыОбмена - Структура - параметры и правила обмена, инициализированные в рамках 
//								   выполнения сеанса обмена.
//	СтекВыгрузки - Массив - содержит ссылки на выгружаемые объекты с учетом вложенности.
//	Пропустить - Булево - отмена выгрузки.
//
Процедура Отправка_ПослеЗаполненияБухгалтерскойСправки(Знач Регистратор,
													   Знач ДанныеИБ,
													   Знач ДанныеXDTO,
													   Знач КомпонентыОбмена,
													   Знач СтекВыгрузки,
													   Пропустить) Экспорт

КонецПроцедуры

// Процедура представляет собой «точку входа», позволяющую механизмам подсистемы «Обмен данными» 
// получить доступ ко всем свойствам и методам плана обмена, отвечающим за технологическую 
// и прикладную специфику конкретного обмена.
//
// Параметры :
//	Настройки - Структура - настройки обмена заполняются процедурой.
//
Процедура УзелОбмена_ПриПолученииНастроек(Знач Настройки) Экспорт
	
КонецПроцедуры	

// Заполнение свойств варианата настройки.
//
// Параметры :
//	ОписаниеВарианта - Структура - содержит перечень доступных свойств варианта настройки.
//	ИдентификаторНастройки - Строка - строковый идентификатор варианта настройки.
//	ПараметрыКонтекста - Структура - контекст выполнения.
// 
Процедура УзелОбмена_ПриПолученииОписанияВариантаНастройки(Знач ОписаниеВарианта, Знач ИдентификаторНастройки, Знач ПараметрыКонтекста) Экспорт

КонецПроцедуры	
	
// Процедура вызывается при заполнении нового узла обмена.
// 
// Параметры :                                      
//	Объект - ПланОбменаОбъект.ФИБОбменБГУ.
//  ДанныеЗаполнения - Произвольный.
//  ТекстЗаполнения -  Строка, Неопределено.
//  СтандартнаяОбработка - Булево.
//
Процедура УзелОбмена_ОбработкаЗаполнения(Знач Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры	

// Процедура вызывается перед записью узла обмена.
// 
// Параметры :                                      
//	Объект - ПланОбменаОбъект.ФИБОбменБГУ.
//  Отказ - Булево.
//
Процедура УзелОбмена_ПередЗаписью(Знач Объект, Отказ) Экспорт

КонецПроцедуры	

// Процедура вызывается перед удалением узла обмена.
// 
// Параметры :                                      
//	Объект - ПланОбменаОбъект.ФИБОбменБГУ.
//  Отказ - Булево.
//
Процедура УзелОбмена_ПередУдалением(Знач Объект, Отказ) Экспорт
	
КонецПроцедуры	

// Процедура вызывается при создании формы узла обмена.
// 
// Параметры :
//  Форма - ФормаКлиентскогоПриложения.
//  Отказ - Булево.
//  СтандартнаяОбработка - Булево.
//
Процедура ФормаУзлаОбмена_ПриСозданииНаСервере(Знач Форма, Отказ, СтандартнаяОбработка) Экспорт

КонецПроцедуры

// Обработчик при коллизии изменений данных.
// Событие возникает при получении данных, если в текущей информационной базе изменен тот же объект,
// что получен из сообщения обмена и эти объекты различаются.
// Используется для переопределения стандартной обработки коллизий изменений данных.
// Стандартная обработка коллизий предполагает получение изменений от главного узла
// и игнорирование изменений, полученных от подчиненного узла.
// В данном обработчике должен быть переопределен параметр ПолучениеЭлемента,
// если требуется изменить поведение по умолчанию.
// В данном обработчике можно задать поведение системы при возникновении коллизии изменений данных в разрезе данных,
// в разрезе свойств данных, в разрезе отправителей или для всей информационной базы в целом, или для всех данных в
// целом.
// Обработчик вызывается как в обмене в распределенной информационной базе (РИБ),
// так и во всех остальных обменах, в том числе в обменах по правилам обмена.
//
// Параметры:
//  ЭлементДанных - Произвольный - элемент данных, прочитанный из сообщения обмена данными.
//                  Элементами данных могут быть КонстантаМенеджерЗначения.<Имя константы>,
//                  объекты базы данных (кроме объекта "Удаление объекта"), наборы записей регистров,
//                  последовательностей или перерасчетов.
//
//  ПолучениеЭлемента - ПолучениеЭлементаДанных - определяет, будет ли прочитанный элемент данных записан в базу данных
//                                               или нет в случае коллизии.
//   При вызове обработчика параметр имеет значение Авто, что означает действия по умолчанию
//   (принимать от главного, игнорировать от подчиненного).
//   Значение данного параметра может быть переопределено в обработчике.
//
//  Отправитель - ПланОбменаСсылка - узел плана обмена, от имени которого выполняется получение данных.
//
//  ПолучениеОтГлавного - Булево -  в распределенной информационной базе обозначает признак получения данных от главного
//                                узла.
//   Истина - выполняется получение данных от главного узла, Ложь - от подчиненного.
//   В обменах по правилам обмена принимает значение Истина - если в правилах обмена приоритет объекта
//   при коллизии установлен в значение "Выше" (значение по умолчанию) или не указан;
//   Ложь - если в правилах обмена приоритет объекта при коллизии установлен в значение "Ниже" или "Совпадает".
//   Во всех остальных типах обмена данными параметр принимает значение Истина.
//
Процедура ПриКоллизииИзмененийДанных(Знач ЭлементДанных, ПолучениеЭлемента, Знач Отправитель, Знач ПолучениеОтГлавного) Экспорт
	
	ПолучениеЭлемента = ПолучениеЭлементаДанных.Принять;
	
КонецПроцедуры

// Получает доступные для использования версии формата.
//
// Параметры:
//   ВерсииФормата - Соответствие - соответствие номера версии формата,
//                   общему модулю, в котором находятся обработчики выгрузки/загрузки для данной версии.
//
// Пример:
//   ВерсииФормата.Вставить("1.2", <ИмяОбщегоМодуляСПравиламиКонвертации>);
//
Процедура ПриПолученииДоступныхВерсийФормата(Знач ВерсииФормата) Экспорт

КонецПроцедуры
	
// Получает доступные для использования расширения формата.
//
// Параметры:
//   РасширенияФормата - Соответствие из КлючИЗначение:
//     * Ключ - Строка - URI пространства имен схемы расширения формата.
//     * Значение - Строка - номер расширяемой версии формата.
//
// Пример:
//   РасширенияФормата.Вставить("http://v8.1c.ru/edi/edi_stnd/StateAccountingSFR/2.0", "2.0");
//
Процедура ПриПолученииДоступныхРасширенийФормата(Знач РасширенияФормата) Экспорт
	
КонецПроцедуры
