#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем НаборПоказателей Экспорт; // Массив показателей отчета
Перем ИмяМакетПроводок;         // Имя макета проводок
Перем мТекущийНаборПоказателей; // Набор текущих показателей отчета

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СтандартныеОтчеты.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// РАЗДЕЛ ИНИЦИАЛИЗАЦИИ

НаборПоказателей = Новый Массив;
НаборПоказателей.Добавить("БУ");

#КонецЕсли

