#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидОперации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", "Передача групп объектов ОС (Акт приема-передачи ОС-1б)");
	
	ЭтоПередачаВПользование = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВПользование(РеквизитыДокумента.ВидОперации);
	ЭтоПередачаВАренду = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПередачаВАренду(РеквизитыДокумента.ВидОперации);
	Запрос.УстановитьПараметр("ЭтоПередачаВПользование", ЭтоПередачаВПользование);
	Запрос.УстановитьПараметр("ЭтоПередачаВАренду",      ЭтоПередачаВАренду);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.Ссылка.ДатаСписанияСБухУчета КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Ссылка.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	"""" КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.ПередачаГруппОбъектовОС.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.ЦМОПолучатель
	|		ИНАЧЕ ТаблицаОсновныеСредства.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.ПодразделениеПолучатель
	|		ИНАЧЕ ТаблицаОсновныеСредства.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|	КОНЕЦ КАК Состояние,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|	КОНЕЦ КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВАренду = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.СдачаВАренду)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование)
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.Дата,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВПользование = ИСТИНА
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	&ЭтоПередачаВПользование = ИСТИНА";
	
	НомераТаблиц.Вставить("ОсновныеСредстваВПользовании", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаВАренду = ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.СдачаВАренду)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование)
	|	КОНЕЦ КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	&ЭтоПередачаВПользование = ИСТИНА";
					
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.										
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(РеквизитыДокумента.ВидОперации);
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаГруппОбъектовОС";
	КомандаПечати.Идентификатор		= "ОС1б";
	КомандаПечати.Представление		= НСтр("ru = 'Акт приема-передачи групп объектов ОС (ОС-1б)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаГруппОбъектовОС";
	КомандаПечати.Идентификатор		= "ПечатьТТН_1208";
	КомандаПечати.Представление		= Нстр("ru='Товарно-транспортная накладная (ф. № 1-Т)'");
	КомандаПечати.Обработчик		= "УправлениеПечатьюБГУКлиент.ПечатьТТН";
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент, ТабличныйДокумент2, ТабличныйДокумент3, ТабличныйДокумент4;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС1б") Тогда
		
		ДанныеДокументов = УправлениеОсновнымиСредствами.ДокументыДляПечатиАктОС1_Передача(МассивОбъектов, Ложь, Ложь, Истина);
		УправлениеОсновнымиСредствами.НапечататьОС1(ДанныеДокументов, ОбъектыПечати, ТабличныйДокумент); 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1б","ОС-1б", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеДляТТН(Ссылка, ОбщийИтог = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Запрос.Текст  = "ВЫБРАТЬ
	|	Шапка.Дата КАК Дата,
	|	Шапка.Организация КАК Грузоотправитель,
	|	Шапка.Контрагент КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Шапка.Договор.СчетКонтрагента, ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)) 
	|					= ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)
	|			ТОГДА Шапка.РасчетныйСчетКонтрагента
	|		ИНАЧЕ Шапка.Договор.СчетКонтрагента
	|	КОНЕЦ КАК РасчетныйСчетГрузополучателя,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Перевозчик,
	|	Шапка.Организация КАК Организация
	|ИЗ
	|	Документ.ПередачаГруппОбъектовОС КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.ОсновноеСредство КАК Номенклатура,
	|	Таблица.ОсновноеСредство.Код КАК ТоварКод,
	|	Таблица.ИнвентарныйНомер КАК ТоварАртикул,
	|	Таблица.ОсновноеСредство.Наименование КАК ТоварНаименование,
	|	""шт"" КАК БазоваяЕдиницаНаименование,
	|	СУММА(Таблица.Количество) КАК Количество,
	|	СУММА(Таблица.Количество) КАК КоличествоМест,
	|	ВЫБОР
	|		КОГДА НЕ Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.Количество = 0
	|						ТОГДА 0
	|					ИНАЧЕ Таблица.Всего / Таблица.Количество
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.ЦенаПродажи
	|	КОНЕЦ КАК Цена,
	|	СУММА(Таблица.Всего) КАК СуммаСНДС,
	|	"""" КАК НомерПрейскуранта,
	|	"""" КАК ВидУпаковки,
	|	"""" КАК Масса,
	|	"""" КАК НомерЗаписиВКартотеке
	|ИЗ
	|	Документ.ПередачаГруппОбъектовОС.ОсновныеСредства КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.ОсновноеСредство,
	|	Таблица.ОсновноеСредство.Код,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ОсновноеСредство.Наименование,
	|	ВЫБОР
	|		КОГДА НЕ Таблица.Ссылка.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА Таблица.Количество = 0
	|						ТОГДА 0
	|					ИНАЧЕ Таблица.Всего / Таблица.Количество
	|				КОНЕЦ
	|		ИНАЧЕ Таблица.ЦенаПродажи
	|	КОНЕЦ";
	
	Если ОбщийИтог  Тогда
		Запрос.Текст = Запрос.Текст + "
		|ИТОГИ ПО
		|	ОБЩИЕ";
	КонецЕсли;
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#КонецОбласти

#КонецЕсли
