
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Параметры.ВидОтчета;
	ПравилоЗаполнения = Параметры.ПравилоЗаполнения;
	Событие = Параметры.Событие;
	
	Если Параметры.Свойство("РеквизитыДокумента") И ЗначениеЗаполнено(Параметры.РеквизитыДокумента) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данный метод нельзя выполнять из формы документа.'"));
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	// Заполнение списков выбора
	СоответствиеКолонок = Новый Соответствие;
	
	ТаблицаКарт = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	Для каждого СтрокаТаблицы Из ТаблицаКарт Цикл
		
		Представление = СтрокаТаблицы.Ключ;
		
		Элементы.КартаСчетов.СписокВыбора.Добавить(Представление);
		
		ТаблицаДанных = СтрокаТаблицы.Значение;
		
		СписокКолонок = Новый СписокЗначений;
		
		Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
			
			Для каждого КолонкаТаблицы Из ТаблицаДанных.Колонки Цикл
				
				СтруктураДанных = Новый Структура("Имя, Заголовок, ТипЗначения", КолонкаТаблицы.Имя, КолонкаТаблицы.Заголовок, КолонкаТаблицы.ТипЗначения);
				
				СписокКолонок.Добавить(СтруктураДанных, КолонкаТаблицы.Имя);
				
			КонецЦикла;
			
		КонецЕсли;
		
		СоответствиеКолонок.Вставить(Представление, СписокКолонок);
		
	КонецЦикла;
	
	СтруктураКартДанных = Новый ФиксированноеСоответствие(СоответствиеКолонок);
	
	// Заполнение значений параметров
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыМетода) Тогда
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("ОбластьЗаполнения",ЗначениеПараметра) Тогда
			ОбластьЗаполнения = ЗначениеПараметра;
		КонецЕсли;
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("КартаСчетов",ЗначениеПараметра) Тогда
			КартаСчетов = ЗначениеПараметра;
			ПриИзмененииКартыСчетов(ЭтаФорма);
		КонецЕсли;
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("КолонкаСтрока",ЗначениеПараметра) Тогда
			КолонкаСтрока = ЗначениеПараметра;
		КонецЕсли;
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("КолонкаСчет",ЗначениеПараметра) Тогда
			КолонкаСчет = ЗначениеПараметра;
		КонецЕсли;
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("КолонкаСчетОбласти",ЗначениеПараметра) Тогда
			КолонкаСчетОбласти = ЗначениеПараметра;
		КонецЕсли;
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("ТаблицаОтбора",ЗначениеПараметра)
				И ТипЗнч(ЗначениеПараметра) = Тип("ТаблицаЗначений") И ЗначениеЗаполнено(ЗначениеПараметра) Тогда
				
				Для каждого СтрокаТаблицы Из ЗначениеПараметра Цикл
					
					НоваяСтрока = ТаблицаОтбора.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
					
				КонецЦикла;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТаблицы Из ТаблицаОтбора Цикл
		
		Если СтрокаТаблицы.Колонка = КолонкаСчет ИЛИ СтрокаТаблицы.Колонка = КолонкаСтрока ИЛИ ПустаяСтрока(СтрокаТаблицы.Колонка) Тогда
			
			Отказ = Истина;
			
			Если Не ПустаяСтрока(СтрокаТаблицы.Колонка) Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru = 'Недопустимое значение колонки. Значения %1 и %2 задаются в реквизитах'"),
										КолонкаСчет,
										КолонкаСтрока);
				
			Иначе
				
				ТекстСообщения = НСтр("ru = 'Не задано имя колонки'");
				
			КонецЕсли;
			
			ИндексСтроки = ТаблицаОтбора.Индекс(СтрокаТаблицы);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ТаблицаОтбора["+ИндексСтроки+"].Колонка");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КартаСчетовПриИзменении(Элемент)
	
	ПриИзмененииКартыСчетов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтбораЗначениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ТаблицаОтбора.ТекущиеДанные.Значение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьЗаполненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Владелец", ПравилоЗаполнения);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.ОбластиЗаполнения.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ТаблицаОтбора

&НаКлиенте
Процедура ТаблицаОтбораКолонкаПриИзменении(Элемент)
	
	СписокКолонок = СтруктураКартДанных.Получить(КартаСчетов);
	
	Если ТипЗнч(СписокКолонок) = Тип("СписокЗначений") Тогда
		
		Для каждого ЭлементСписка Из СписокКолонок Цикл
			
			Если ЭлементСписка.Представление = Элементы.ТаблицаОтбора.ТекущиеДанные.Колонка Тогда
				
				Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") Тогда
					
					Значение = Неопределено;
					Если ТипЗнч(ЭлементСписка.Значение) = Тип("Структура") И ЭлементСписка.Значение.Свойство("ТипЗначения", Значение) И ТипЗнч(Значение) = Тип("ОписаниеТипов") И ЗначениеЗаполнено(Значение) Тогда
						
						Элементы.ТаблицаОтбора.ТекущиеДанные.ТипЗначения = Значение;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = СохранитьПараметры();
	
	Если СтруктураВозврата <> Неопределено Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииКартыСчетов(ЭтаФорма)
	
	СписокКолонок = ЭтаФорма.СтруктураКартДанных.Получить(ЭтаФорма.КартаСчетов);
	
	ЭтаФорма.Элементы.КолонкаСтрока.СписокВыбора.Очистить();
	ЭтаФорма.Элементы.КолонкаСчет.СписокВыбора.Очистить();
	
	Если ТипЗнч(СписокКолонок) = Тип("СписокЗначений") И СписокКолонок.Количество() <> 0 Тогда
		
		Для каждого ЭлементСписка Из СписокКолонок Цикл
			
			СтруктураКолонки = ЭлементСписка.Значение;
			
			Имя = Неопределено;
			Заголовок = Неопределено;
			Если ТипЗнч(СтруктураКолонки) = Тип("Структура") Тогда
				
				Если СтруктураКолонки.Свойство("Имя",Имя) И ЗначениеЗаполнено(Имя)
							И СтруктураКолонки.Свойство("Заголовок",Заголовок) Тогда
					
					ЭтаФорма.Элементы.КолонкаСтрока.СписокВыбора.Добавить(СтруктураКолонки.Имя,СтруктураКолонки.Заголовок);
					ЭтаФорма.Элементы.КолонкаСчет.СписокВыбора.Добавить(СтруктураКолонки.Имя,СтруктураКолонки.Заголовок);
					ЭтаФорма.Элементы.ТаблицаОтбораКолонка.СписокВыбора.Добавить(СтруктураКолонки.Имя,СтруктураКолонки.Заголовок);
					
				КонецЕсли;
				
			КонецЕсли;
			
			
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт
	
	Возврат СохранитьПараметры(); 
	
КонецФункции


&НаКлиенте
Функция СохранитьПараметры()
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбластьЗаполнения", ОбластьЗаполнения);
		СтруктураПараметров.Вставить("КартаСчетов", КартаСчетов);
		СтруктураПараметров.Вставить("КолонкаСчет", КолонкаСчет);
		СтруктураПараметров.Вставить("КолонкаСтрока", КолонкаСтрока);
		СтруктураПараметров.Вставить("КолонкаСчетОбласти", КолонкаСчетОбласти);
		
		ТаблицаОтбораСохр = Новый ТаблицаЗначений;
		ТаблицаОтбораСохр.Колонки.Добавить("Колонка");
		ТаблицаОтбораСохр.Колонки.Добавить("Значение");
		ТаблицаОтбораСохр.Колонки.Добавить("ТипЗначения");
		
		Для каждого СтрокаТаблицы Из ТаблицаОтбора Цикл
			НоваяСтрока = ТаблицаОтбораСохр.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		КонецЦикла;
		
		СтруктураПараметров.Вставить("ТаблицаОтбора", ТаблицаОтбораСохр);
		
		ПредставлениеПараметров();
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров()
	
	ПредставлениеПараметров = "Область заполнения:" + КолонкаСчетОбласти + " - Карта данных:" + КартаСчетов + " (" + КолонкаСчет + ", " +КолонкаСтрока + ")";
	
КонецПроцедуры
