
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьВФайл(Команда)
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда
		СохранитьФайлНаСервере(ТекДанные.Ссылка,АдресФайла,ЭтаФорма.УникальныйИдентификатор);
		ПолучитьФайл(АдресФайла, "НастройкаВариантовДействий.xml", Истина);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ЗагрузитьИзФайлаЗавершение", ЭтотОбъект), АдресФайла,,Истина,ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		Если ЗагрузитьИзФайлаСервер(АдресФайла) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Настройка загружена.'"));
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось загрузить настройку из файла.'"));	
		КонецЕсли;
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзМакета(Команда)
	
	Если ПроверитьНаличиеНастройкиИзМакета() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьИзМакетаЗавершение", ЭтотОбъект), Нстр("ru='Настройка из макета ранее загружалась. 
			|При повторной загрузке все изменения данной настройки будут потеряны.
			|Загрузить настройку?'"),РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзМакетаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзМакетаСервер();
	
	Элементы.Список.Обновить();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьФайлНаСервере(Настройка,Адрес,УИД)
	Справочники.НастройкаВариантовДействийАктуализацииНачислений.СохранитьНастройкуВФайл(Настройка,Адрес,УИД);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗагрузитьИзФайлаСервер(АдресФайла)
	
	Возврат Справочники.НастройкаВариантовДействийАктуализацииНачислений.ЗагрузитьНастройкуИзФайла(АдресФайла);	
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗагрузитьИзМакетаСервер()
	
	Справочники.НастройкаВариантовДействийАктуализацииНачислений.ЗагрузитьНастройкуИзМакета();	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьНаличиеНастройкиИзМакета()
	УИНЗагружаемогоЭлемента = Новый УникальныйИдентификатор("46f9a3de-9886-11e3-a932-bcaec5d977ce");
	СсылкаНаЭлемент = Справочники.НастройкаВариантовДействийАктуализацииНачислений.ПолучитьСсылку(УИНЗагружаемогоЭлемента);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(СсылкаНаЭлемент) Тогда 
		ЗагрузитьИзМакетаСервер();
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти
