#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

Процедура СформироватьОписаниеДокументовСТабличнымиЧастями(Форма, Описание) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписаниеТабличныхЧастей(
	Форма, Описание, "СписокКонтрагентов", "СписокКонтрагентовКонтрагент", "");

КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация,Дата,Номер");
	
	ИспользоватьУчетСтудентов = ПолучитьФункциональнуюОпцию("ИспользоватьУчетСтудентов");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИспользоватьУчетСтудентов", ИспользоватьУчетСтудентов);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("Задолженность", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Задолженность.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Задолженность.Ссылка.Дата КАК Период,
	|	Задолженность.Ссылка.Организация КАК Организация,
	|	Задолженность.Факультет КАК Факультет,
	|	Задолженность.Студент КАК Студент,
	|	Задолженность.Контрагент КАК Контрагент,
	|	Задолженность.Договор КАК ДоговорКонтрагента,
	|	Задолженность.Валюта КАК ВалютаВзаиморасчетов,
	|	Задолженность.НачислениеЗаУслугу КАК НачислениеЗаУслугу,
	|	ВЫБОР
	|		КОГДА Задолженность.Валюта = &ВалютаРеглУчета
	|				ИЛИ Задолженность.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА Задолженность.СписатьСумма
	|		ИНАЧЕ Задолженность.СписатьСуммаВал
	|	КОНЕЦ КАК СуммаВзаиморасчетов,
	|	Задолженность.СписатьСумма КАК СуммаРегл
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.Задолженность КАК Задолженность
	|ГДЕ
	|	Задолженность.Ссылка = &Ссылка
	|	И &ИспользоватьУчетСтудентов
	|	И Задолженность.Ссылка.ОтразитьПоРасчетамСоСтудентами
	|	И Задолженность.Студент <> ЗНАЧЕНИЕ(Справочник.Студенты.ПустаяСсылка)";
	
	Результат = Запрос.ВыполнитьПакет();
	
	РезультатыГолосования = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(ДокументСсылка);
	
	Если ИспользоватьУчетСтудентов Тогда
		
		РасчетыСоСтудентами = РегистрыНакопления.РасчетыСоСтудентами.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		РасчетыСоСтудентамиДопУслуги = РегистрыНакопления.РасчетыСоСтудентамиДопУслуги.СоздатьНаборЗаписей().ВыгрузитьКолонки();
		ДоговорыУчащихсяЗаПрочиеУслуги = Документы.СписаниеВосстановлениеЗадолженностиПоДоходам.ДоговорыУчащихсяЗаПрочиеУслуги(ДокументСсылка);
		
		Задолженность = Результат[НомераТаблиц.Задолженность].Выгрузить();
		Для Каждого СтрокаЗадолженности Из Задолженность Цикл
			
			РезультатГолосования = РезультатыГолосования.Найти(СтрокаЗадолженности.ИдентификаторСтроки, "ИдентификаторСтроки");
			Если РезультатГолосования = Неопределено ИЛИ Не РезультатГолосования.РезолюцияКомиссииОдобрена Тогда
				Продолжить; // Движения формируются только по строкам, одобренным комиссией в результате голосования, как и бух.записи.
			КонецЕсли;
			
			Если ДоговорыУчащихсяЗаПрочиеУслуги.Найти(СтрокаЗадолженности.ДоговорКонтрагента) = Неопределено Тогда // За услуги образования.
				
				НоваяСтрока = РасчетыСоСтудентами.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадолженности,
					"Период,Организация,Факультет,Студент,Контрагент,ДоговорКонтрагента,ВалютаВзаиморасчетов,СуммаВзаиморасчетов,СуммаРегл");
				
			Иначе // За прочие услуги.
				
				НоваяСтрока = РасчетыСоСтудентамиДопУслуги.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗадолженности,
					"Период,Организация,Факультет,Студент,Контрагент,ДоговорКонтрагента,ВалютаВзаиморасчетов,НачислениеЗаУслугу,СуммаВзаиморасчетов,СуммаРегл");
				
			КонецЕсли;
			
		КонецЦикла;
		
		ВидПервичногоДокумента = НСтр("ru = 'Акт о признании безнадежной к взысканию задолженности по доходам'");
		НомерПервичногоДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, ЗначенияРеквизитов.Номер);
		ДатаПервичногоДокумента = ЗначенияРеквизитов.Дата;
		
		РасчетыСоСтудентами.ЗаполнитьЗначения(Истина, "Активность");
		РасчетыСоСтудентами.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
		РасчетыСоСтудентами.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
		РасчетыСоСтудентами.ЗаполнитьЗначения(ВидПервичногоДокумента, "ВидПервичногоДокумента");
		РасчетыСоСтудентами.ЗаполнитьЗначения(НомерПервичногоДокумента, "НомерПервичногоДокумента");
		РасчетыСоСтудентами.ЗаполнитьЗначения(ДатаПервичногоДокумента, "ДатаПервичногоДокумента");
		ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("РасчетыСоСтудентами", РасчетыСоСтудентами);
		
		РасчетыСоСтудентамиДопУслуги.ЗаполнитьЗначения(Истина, "Активность");
		РасчетыСоСтудентамиДопУслуги.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
		РасчетыСоСтудентамиДопУслуги.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
		РасчетыСоСтудентамиДопУслуги.ЗаполнитьЗначения(ВидПервичногоДокумента, "ВидПервичногоДокумента");
		РасчетыСоСтудентамиДопУслуги.ЗаполнитьЗначения(НомерПервичногоДокумента, "НомерПервичногоДокумента");
		РасчетыСоСтудентамиДопУслуги.ЗаполнитьЗначения(ДатаПервичногоДокумента, "ДатаПервичногоДокумента");
		ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("РасчетыСоСтудентамиДопУслуги", РасчетыСоСтудентамиДопУслуги);
		
	КонецЕсли;
	
	БухгалтерскийУчет.УстановитьПериодВТаблицахДляПроведения(ДополнительныеСвойства.ТаблицыДляДвижений, ДокументСсылка);
	
КонецПроцедуры

// Для списка договоров в документе возвращает массив договоров с учащимися за прочие услуги.
// Договоры за прочие услуги определяются по наличию движений в регистре РасчетыСоСтудентамиДопУслуги.
//
Функция ДоговорыУчащихсяЗаПрочиеУслуги(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСоСтудентамиДопУслуги.ДоговорКонтрагента КАК Договор
	|ИЗ
	|	РегистрНакопления.РасчетыСоСтудентамиДопУслуги КАК РасчетыСоСтудентамиДопУслуги
	|ГДЕ
	|	РасчетыСоСтудентамиДопУслуги.ДоговорКонтрагента В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Задолженность.Договор
	|			ИЗ
	|				Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.Задолженность КАК Задолженность
	|			ГДЕ
	|				Задолженность.Ссылка = &Ссылка
	|				И Задолженность.Студент <> ЗНАЧЕНИЕ(Справочник.Студенты.ПустаяСсылка))";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");
	
КонецФункции

// Проверяет данные в документе списания задолженности на соответствие инвентаризационной описи расчетов.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.СписаниеВосстановлениеЗадолженностиПоДоходам, ДокументСсылка.СписаниеКредиторскойЗадолженности - ссылка на документ списания задолженности,
//  ДокументОснование - ДокументСсылка.ИнвентаризационнаяОписьРасчетовПоПоступлениям, ДокументСсылка.ИнвентаризационнаяОписьРасчетовСКонтрагентами - ссылка на инв.опись,
//  Отказ - Булево - признак блокирования проведения документа при обнаружении ошибок.
//
// Возвращаемое значение:
//  Структура - результат проверки соответствия документа списания задолженности инвентаризационной описи расчетов^:
//      Отказ - Булево - признак обнаружения ошибок при проверке.
//      СообщенияПользователю - Массив - сообщения об ошибках пользователю.
//
Функция ПроверитьСоответствиеИнвентаризационнойОписиРасчетов(ДокументСсылка, ДокументОснование, Отказ = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Отказ", Отказ);
	Результат.Вставить("СообщенияПользователю", Новый Массив);
	
	Если ЗначениеЗаполнено(ДокументОснование)
		И ( ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьРасчетовПоПоступлениям")
		ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьРасчетовСКонтрагентами") ) Тогда
		
		Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СписаниеВосстановлениеЗадолженностиПоДоходам") Тогда
			ИмяТабЧасти = "Раздел21"; // Дебиторская задолженность.
		ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СписаниеКредиторскойЗадолженности") Тогда
			ИмяТабЧасти = "Раздел22"; // Кредиторская задолженность.
		Иначе
			Возврат Результат;
		КонецЕсли;
		
		ТаблицаИнвОписи = ДокументОснование[ИмяТабЧасти].Выгрузить(, "Контрагент,Договор,Счет");
		
		Для Каждого СтрокаЗадолженность Из ДокументСсылка["Задолженность"] Цикл
			
			Отбор = Новый Структура;
			Если ЗначениеЗаполнено(СтрокаЗадолженность.Счет) Тогда
				Отбор.Вставить("Счет", СтрокаЗадолженность.Счет);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаЗадолженность.Контрагент) Тогда
				Отбор.Вставить("Контрагент", СтрокаЗадолженность.Контрагент);
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаЗадолженность.Договор) Тогда
				Отбор.Вставить("Договор", СтрокаЗадолженность.Договор);
			КонецЕсли;
			
			НайденныеСтроки = ТаблицаИнвОписи.НайтиСтроки(Отбор);
			Если НайденныеСтроки.Количество() = 0 Тогда 
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='В инвентаризационной описи ""%1"" отсутствуют данные о задолженности по счету %2, контрагенту ""%3"", договору ""%4"".'"),
						ДокументОснование,
						Отбор.Счет,
						Отбор.Контрагент,
						Отбор.Договор);
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					НСтр("ru = 'Счет'"), СтрокаЗадолженность.НомерСтроки, НСтр("ru = 'Задолженность'"), ТекстСообщения);
				ПолеОшибки = "Задолженность[" + Формат(СтрокаЗадолженность.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Счет";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументСсылка, ПолеОшибки, "Объект", Отказ);
				
				Результат.СообщенияПользователю.Добавить(ТекстСообщения);
				Результат.Отказ = Отказ;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ГолосованиеКомиссии

Процедура ЗаполнитьРезультатГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ЗаполнитьРезультатыГолосования = Не Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	Если ЗаполнитьРезультатыГолосования Тогда
		РезультатГолосованияСотрудника = ОбщегоНазначенияБГУ.РезультатыГолосованияСотрудникаПоДокументу(
			Форма.Сотрудник, Объект.Ссылка, Объект.Комиссия, Объект.Организация);
		РезультатГолосованияКомиссии = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(
			Объект.Ссылка, Объект.Комиссия, Объект.Организация);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.Задолженность Цикл
		
		СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Неопределено;
		СтрокаТаблицы.ИтогГолосования = 0;
		СтрокаТаблицы.РезолюцияКомиссииОдобрена = Ложь;
		Если ЗаполнитьРезультатыГолосования Тогда
			
			Если РезультатГолосованияСотрудника.Количество() > 0 Тогда
				Результаты = РезультатГолосованияСотрудника.Найти(СтрокаТаблицы.ИдентификаторСтроки, "ИдентификаторСтроки");
				Если Результаты <> Неопределено Тогда
					СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Результаты.РезультатГолосования;
				КонецЕсли;
			КонецЕсли;
			
			Если РезультатГолосованияКомиссии.Количество() > 0 Тогда
				ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
					Объект.Ссылка, СтрокаТаблицы.ИдентификаторСтроки);
				РезультатыГолосованияПоСтроке = РезультатГолосованияКомиссии.НайтиСтроки(ОтборПоИдентификаторуСтроки);
				Если РезультатыГолосованияПоСтроке.Количество() > 0 Тогда
					СтрокаТаблицы.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
					СтрокаТаблицы.РезолюцияКомиссииОдобрена = РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеЭлементамиГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ДоступностьГолосования = Не Объект.Ссылка.Пустая() И Не Объект.Проведен
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ГруппаГолосование");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Доступность", ДоступностьГолосования);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ЗадолженностьИтогГолосования");
	ЭлементыГолосование.Добавить("ЗадолженностьРезолюцияКомиссииОдобрена");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования ИЛИ Объект.Проведен);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ЗадолженностьУстановитьРешениеЕдиногласноЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ЗадолженностьУстановитьРешениеЕдиногласноПротивВоВсехСтроках");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И Не ЗначениеЗаполнено(Форма.Сотрудник));
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ЗадолженностьУстановитьРешениеЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ЗадолженностьУстановитьРешениеПротивВоВсехСтроках");
	ЭлементыГолосование.Добавить("ЗадолженностьУстановитьРешениеЗаВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ЗадолженностьУстановитьРешениеПротивВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ЗадолженностьРешениеСотрудникаПоРезолюции");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СохранитьРезультатыГолосования", "Доступность",
			ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Решение о признании (восстановлении) сомнительной задолженности по доходам (ф.0510445).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор       = "СписаниеСомнительнойЗадолженности_Форма0510445";
	КомандаПечати.Представление       = НСтр("ru = 'Решение о признании сомнительной задолженности по доходам (ф.0510445)'");
	КомандаПечати.МенеджерПечати      = "Документ.СписаниеВосстановлениеЗадолженностиПоДоходам";
	КомандаПечати.Порядок             = 1;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидОперации",
		Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеСомнительнойЗадолженности);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор       = "ВосстановлениеСомнительнойЗадолженности_Форма0510445";
	КомандаПечати.Представление       = НСтр("ru = 'Решение о восстановлении сомнительной задолженности по доходам (ф.0510445)'");
	КомандаПечати.МенеджерПечати      = "Документ.СписаниеВосстановлениеЗадолженностиПоДоходам";
	КомандаПечати.Порядок             = 2;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидОперации",
		Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности);
	
	// Акт о признании безнадежной к взысканию задолженности по доходам (ф.0510436).
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор       = "СписаниеБезнадежнойКВзысканиюЗадолженности_Форма0510436";
	КомандаПечати.Представление       = НСтр("ru = 'Акт о признании безнадежной к взысканию задолженности по доходам (ф.0510436)'");
	КомандаПечати.МенеджерПечати      = "Документ.СписаниеВосстановлениеЗадолженностиПоДоходам";
	КомандаПечати.Порядок             = 3;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидОперации",
		Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеБезнадежнойКВзысканиюЗадолженности);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписаниеСомнительнойЗадолженности_Форма0510445") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СписаниеСомнительнойЗадолженности_Форма0510445",
			"Решение о признании сомнительной задолженности по доходам (ф.0510445)",
			ПечатьФормы0510445(МассивОбъектов, ОбъектыПечати, 1));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВосстановлениеСомнительнойЗадолженности_Форма0510445") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ВосстановлениеСомнительнойЗадолженности_Форма0510445",
			"Решение о восстановлении сомнительной задолженности по доходам (ф.0510445)",
			ПечатьФормы0510445(МассивОбъектов, ОбъектыПечати, 2));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписаниеБезнадежнойКВзысканиюЗадолженности_Форма0510436") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СписаниеБезнадежнойКВзысканиюЗадолженности_Форма0510436",
			"Решение о признании безнадежной к взысканию задолженности по доходам (ф.0510436)",
			ПечатьФормы0510436(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьФормы0510445(МассивОбъектов, ОбъектыПечати, КодОперации)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.ПФ_MXL_Ф0510445");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб				= Истина;
	ТабДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеВосстановлениеЗадолженностиПоДоходам_ф0510445";
	
	ДанныеДляПечати = ПолучитьДанныеДляПечати(МассивОбъектов);
	ВыборкаШапка = ДанныеДляПечати.Шапка.Выбрать();
	ВыборкаСписокКонтрагентов = ДанныеДляПечати.СписокКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЗадолженность = ДанныеДляПечати.Задолженность.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл // Цикл по документам.
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ОбщиеСведенияПоДокументу = ДанныеДляПечати.ОбщиеСведения.Получить(ВыборкаШапка.Ссылка);
		
		ВывестиШапку(Макет, ТабДокумент, ВыборкаШапка, ОбщиеСведенияПоДокументу, КодОперации);
		ВывестиРаздел1РеквизитыКонтрагента(Макет, ТабДокумент, ВыборкаШапка, ВыборкаСписокКонтрагентов);
		ВывестиРаздел2СведенияОЗадолженности(Макет, ТабДокумент, ВыборкаШапка, ВыборкаЗадолженность);
		ВывестиРаздел3ЗаключениеКомиссии(Макет, ТабДокумент, ВыборкаШапка, ВыборкаЗадолженность, ДанныеДляПечати.РезультатыГолосования);
		ВывестиПодвал(Макет, ТабДокумент, ВыборкаШапка, ОбщиеСведенияПоДокументу, ДанныеДляПечати.СоставКомиссий);
		
		// В табличном документе зададим имя области, в которую был выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	ТабДокумент.ВерхнийКолонтитул.Выводить			= Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница	= 2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа		= НСтр("ru='Форма 0510445 с.[&НомерСтраницы]'");
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьФормы0510436(МассивОбъектов, ОбъектыПечати)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.ПФ_MXL_Ф0510436");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб				= Истина;
	ТабДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеВосстановлениеЗадолженностиПоДоходам_ф0510436";
	
	ДанныеДляПечати = ПолучитьДанныеДляПечати(МассивОбъектов);
	ВыборкаШапка = ДанныеДляПечати.Шапка.Выбрать();
	ВыборкаСписокКонтрагентов = ДанныеДляПечати.СписокКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаЗадолженность = ДанныеДляПечати.Задолженность.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл // Цикл по документам.
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ОбщиеСведенияПоДокументу = ДанныеДляПечати.ОбщиеСведения.Получить(ВыборкаШапка.Ссылка);
		
		ВывестиШапку(Макет, ТабДокумент, ВыборкаШапка, ОбщиеСведенияПоДокументу);
		ВывестиРаздел1РеквизитыКонтрагента(Макет, ТабДокумент, ВыборкаШапка, ВыборкаСписокКонтрагентов);
		ВывестиРаздел2СведенияОЗадолженности(Макет, ТабДокумент, ВыборкаШапка, ВыборкаЗадолженность);
		ВывестиРаздел3ЗаключениеКомиссии(Макет, ТабДокумент, ВыборкаШапка, ВыборкаЗадолженность, ДанныеДляПечати.РезультатыГолосования);
		ВывестиПодвал(Макет, ТабДокумент, ВыборкаШапка, ОбщиеСведенияПоДокументу, ДанныеДляПечати.СоставКомиссий);
		
		// В табличном документе зададим имя области, в которую был выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	ТабДокумент.ВерхнийКолонтитул.Выводить			= Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница	= 2;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа		= НСтр("ru='Форма 0510436 с.[&НомерСтраницы]'");
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьДанныеДляПечати(МассивОбъектов)
	
	ТекстыЗапросов     = Новый Массив;
	ИндексыРезультатов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	ИндексыРезультатов.Вставить("Шапка", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Ссылка КАК Ссылка,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Номер КАК пНомер,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Дата КАК пДата,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Организация КАК Организация,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Руководитель КАК Руководитель,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Ответственный КАК Ответственный,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Комиссия.НаименованиеПриказа КАК ДокументОСозданииКомиссии,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Комиссия.НомерПриказа КАК ДокументОСозданииКомиссииНомер,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Комиссия.ДатаПриказа КАК ДокументОСозданииКомиссииДата,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.ВидЛокальногоАкта КАК ВидЛокальногоАкта,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.НомерЛокальногоАкта КАК НомерЛокальногоАкта,
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.ДатаЛокальногоАкта КАК ДатаЛокальногоАкта,
	|	ВЫБОР
	|		КОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование ССЫЛКА Документ.ИнвентаризацияРасчетовПоПоступлениям
	|			ТОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование.Номер
	|		КОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование ССЫЛКА Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям
	|			ТОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование.Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИнвентаризационнаяОписьРасчетовПоПоступлениямНомер,
	|	ВЫБОР
	|		КОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование ССЫЛКА Документ.ИнвентаризацияРасчетовПоПоступлениям
	|			ТОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование.Дата
	|		КОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование ССЫЛКА Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям
	|			ТОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование.Дата
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИнвентаризационнаяОписьРасчетовПоПоступлениямДата,
	|	ВЫБОР
	|		КОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование ССЫЛКА Документ.СписаниеВосстановлениеЗадолженностиПоДоходам
	|			ТОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование.Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК РешениеОПризнанииСомнительнойЗадолженностиНомер,
	|	ВЫБОР
	|		КОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование ССЫЛКА Документ.СписаниеВосстановлениеЗадолженностиПоДоходам
	|			ТОГДА СписаниеВосстановлениеЗадолженностиПоДоходам.ДокументОснование.Дата
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК РешениеОПризнанииСомнительнойЗадолженностиДата
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам КАК СписаниеВосстановлениеЗадолженностиПоДоходам
	|ГДЕ
	|	СписаниеВосстановлениеЗадолженностиПоДоходам.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	пДата,
	|	пНомер");
	
	ИндексыРезультатов.Вставить("СписокКонтрагентов", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокКонтрагентов.Ссылка КАК Ссылка,
	|	СписокКонтрагентов.НомерСтроки КАК КодСтроки,
	|	СписокКонтрагентов.Контрагент КАК Контрагент,
	|	СписокКонтрагентов.ИдентификаторПлательщика КАК ИдентификаторКонтрагента,
	|	СписокКонтрагентов.Контрагент.ИНН КАК КонтрагентИНН,
	|	СписокКонтрагентов.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА СписокКонтрагентов.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		КОГДА СписокКонтрагентов.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо.ОГРНИП = """"
	|			ТОГДА СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо.Наименование
	|		КОГДА СписокКонтрагентов.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|				И НЕ СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо.ОГРНИП = """"
	|			ТОГДА СписокКонтрагентов.Контрагент.НаименованиеСокращенное
	|		ИНАЧЕ СписокКонтрагентов.Контрагент.Наименование
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	ВЫБОР
	|		КОГДА СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо.ОГРН
	|		КОГДА СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА СписокКонтрагентов.Контрагент.ЮридическоеФизическоеЛицо.ОГРНИП
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентОГРН
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.СписокКонтрагентов КАК СписокКонтрагентов
	|ГДЕ
	|	СписокКонтрагентов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	СписокКонтрагентов.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка");
	
	ИндексыРезультатов.Вставить("Задолженность", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Задолженность.Ссылка КАК Ссылка,
	|	Задолженность.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Задолженность.НомерСтроки КАК НомерСтроки,
	|	СписокКонтрагентов.НомерСтроки КАК КодСтроки,
	|	Задолженность.ИФО КАК ИФО,
	|	Задолженность.КФО КАК КФО,
	|	Задолженность.Подразделение КАК Подразделение,
	|	Задолженность.Счет КАК Счет,
	|	ЕСТЬNULL(Задолженность.Счет.Код, """") КАК СчетКод,
	|	ЕСТЬNULL(Задолженность.Счет.Забалансовый, ЛОЖЬ) КАК СчетЗабалансовый,
	|	ЕСТЬNULL(Задолженность.Счет.БезДетализацииКОСГУ, ЛОЖЬ) КАК СчетБезДетализацииКОСГУ,
	|	Задолженность.КПС КАК КПС,
	|	Задолженность.КПС.Представление КАК КодДохода,
	|	Задолженность.КПС.Наименование КАК НаименованиеДохода,
	|	Задолженность.КЭК КАК КЭК,
	|	Задолженность.Контрагент КАК Контрагент,
	|	Задолженность.Контрагент.ТипКонтрагента.Код КАК ТипКонтрагентаКод,
	|	СписокКонтрагентов.ИдентификаторПлательщика КАК ИдентификаторКонтрагента,
	|	Задолженность.Договор КАК Договор,
	|	Задолженность.Договор.ВидОбязательства КАК ДоговорВидОбязательства,
	|	Задолженность.Договор.НомерДоговора КАК ДоговорНомерДоговора,
	|	Задолженность.Договор.ДатаДоговора КАК ДоговорДатаДоговора,
	|	Задолженность.Договор.УИН КАК ДоговорУИН,
	|	Задолженность.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
	|	Задолженность.Валюта КАК Валюта,
	|	Задолженность.Валюта.Код КАК КодВалюты,
	|	Задолженность.СписатьСумма КАК ЗадолженностьРуб,
	|	ВЫБОР
	|		КОГДА Задолженность.Валюта <> &ВалютаРегламентированногоУчета
	|			ТОГДА Задолженность.СписатьСуммаВал
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЗадолженностьВал,
	|	Задолженность.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	Задолженность.СлучайСписанияВосстановленияЗадолженности.НаименованиеПолное КАК СлучайСписанияВосстановленияЗадолженности,
	|	Задолженность.МерыПоВзысканиюЗадолженности.НаименованиеПолное КАК МерыПоВзысканиюЗадолженности,
	|	Задолженность.ДатаОбразованияЗадолженности КАК ДатаОбразованияЗадолженности,
	|	Задолженность.НомерРеестровойЗаписи КАК НомерРеестровойЗаписи,
	|	Задолженность.ОснованиеВозникновенияЗадолженности КАК ОснованиеВозникновенияЗадолженности,
	|	Задолженность.ОснованиеВозникновенияЗадолженностиНомер КАК ОснованиеВозникновенияЗадолженностиНомер,
	|	Задолженность.ОснованиеВозникновенияЗадолженностиДата КАК ОснованиеВозникновенияЗадолженностиДата,
	|	Задолженность.ОснованиеПризнанияСомнительнойЗадолженности КАК ОснованиеПризнанияСомнительнойЗадолженности,
	|	Задолженность.ОснованиеПризнанияСомнительнойЗадолженностиНомер КАК ОснованиеПризнанияСомнительнойЗадолженностиНомер,
	|	Задолженность.ОснованиеПризнанияСомнительнойЗадолженностиДата КАК ОснованиеПризнанияСомнительнойЗадолженностиДата,
	|	Задолженность.КодФормыБухгалтерскойОтчетности КАК КодФормыБухгалтерскойОтчетности
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.Задолженность КАК Задолженность
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.СписокКонтрагентов КАК СписокКонтрагентов
	|		ПО Задолженность.Ссылка = СписокКонтрагентов.Ссылка
	|			И Задолженность.Контрагент = СписокКонтрагентов.Контрагент
	|ГДЕ
	|	Задолженность.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	КодСтроки,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(ИдентификаторКонтрагента),
	|	СУММА(ЗадолженностьРуб)
	|ПО
	|	Ссылка,
	|	Контрагент,
	|	КПС");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("Шапка",              Результаты[ИндексыРезультатов.Шапка]);
	ДанныеДляПечати.Вставить("СписокКонтрагентов", Результаты[ИндексыРезультатов.СписокКонтрагентов]);
	ДанныеДляПечати.Вставить("Задолженность",      Результаты[ИндексыРезультатов.Задолженность]);
	
	// Добавим состав и результаты голосования комиссии по документам.
	ДанныеДляПечати.Вставить("РезультатыГолосования", 
		ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(МассивОбъектов));
	ДанныеДляПечати.Вставить("СоставКомиссий", 
		ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов));
	
	// Добавим общие сведения для печати.
	ДанныеДляПечати.Вставить("ОбщиеСведения", 
		УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ВывестиШапку(Макет, ТабДокумент, ВыборкаШапка, ОбщиеСведения, КодОперации = 0)
	
	ОбластьШапка         = Макет.ПолучитьОбласть("Шапка");
	ОбластьТитул1        = Макет.ПолучитьОбласть("Титул1");
	ОбластьТитулКомиссия = Макет.ПолучитьОбласть("ТитулКомиссия");
	
	ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
	ОбластьШапка.Параметры.ФИОРуководителя =
		Справочники.Сотрудники.ФамилияИО(ВыборкаШапка.Руководитель, Ложь, ВыборкаШапка.пДата);
	ДанныеПодписанта = Новый Структура("СсылкаНаОбъект, Период, Должность", ВыборкаШапка.Руководитель, ВыборкаШапка.пДата);
	Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПодписанта);
	ОбластьШапка.Параметры.ДолжностьРуководителя = ДанныеПодписанта.Должность;
	
	ОбластьТитул1.Параметры.Заполнить(ВыборкаШапка);
	
	ЗаполнитьЗначенияСвойств(ОбластьТитул1.Параметры, ОбщиеСведения,
		"НаименованиеОрганизации, НаименованиеОбособленногоПодразделения, НаименованиеСтруктурногоПодразделения, СтруктурноеПодразделение,
		|Учредитель, БюджетНаименование, КодРПБС, КодРПБСОбособленногоПодразделения, ГлаваБК, ОКТМО");
	
	РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьТитул1,
		"пНомер",ВыборкаШапка.пНомер, ВыборкаШапка.Ссылка, Неопределено, Истина);
	
	ОбластьТитул1.Параметры.ДатаСтрокой = Формат(ВыборкаШапка.пДата, "ДЛФ=ДД");
	
	Если КодОперации = 1 Тогда
		ОбластьТитул1.Параметры.КодОперации = КодОперации;
		ОбластьТитул1.Параметры.НаименованиеОперации = НСтр("ru = 'признание сомнительной задолженности'");
	ИначеЕсли КодОперации = 2 Тогда
		ОбластьТитул1.Параметры.КодОперации = КодОперации;
		ОбластьТитул1.Параметры.НаименованиеОперации = НСтр("ru = 'восстановление сомнительной задолженности'");
	Иначе
		// Не требуется в решении о признании безнадежной к взысканию задолженности по доходам.
	КонецЕсли;
	
	ОбластьТитулКомиссия.Параметры.Заполнить(ВыборкаШапка);
	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.Вывести(ОбластьТитул1);
	ТабДокумент.Вывести(ОбластьТитулКомиссия);
	
КонецФункции

Функция ВывестиРаздел1РеквизитыКонтрагента(Макет, ТабДокумент, ВыборкаШапка, ВыборкаСписокКонтрагентов)
	
	// Реквизиты контрагента.
	ОбластьЗаголовокРеквизитыКонтрагента = Макет.ПолучитьОбласть("ЗаголовокРеквизитыКонтрагента");
	ОбластьЗаголовокГруппаУчета1         = Макет.ПолучитьОбласть("ЗаголовокГруппаУчета1");
	ОбластьЗаголовокТаблицыКонтрагентов  = Макет.ПолучитьОбласть("ЗаголовокТаблицыКонтрагентов");
	ОбластьСтрокаТаблицыКонтрагентов     = Макет.ПолучитьОбласть("СтрокаТаблицыКонтрагентов");
	ОбластьПодвалТаблицыКонтрагентов     = Макет.ПолучитьОбласть("ПодвалТаблицыКонтрагентов");
	
	ТабДокумент.Вывести(ОбластьЗаголовокРеквизитыКонтрагента);
	
	ОбластьЗаголовокГруппаУчета1.Параметры.ГруппаУчета1Заголовок = НСтр("ru = '1.1 Группа учета'");
	ОбластьЗаголовокГруппаУчета1.Параметры.ГруппаУчета1 = НСтр("ru = ''");
	ТабДокумент.Вывести(ОбластьЗаголовокГруппаУчета1);
	
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицыКонтрагентов);
	
	ВыборкаСписокКонтрагентов.Сбросить();
	ОтборСтрок = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
	Если ВыборкаСписокКонтрагентов.НайтиСледующий(ОтборСтрок) Тогда
		ВыборкаСтрок = ВыборкаСписокКонтрагентов.Выбрать();
		КоличествоСтрок = ВыборкаСтрок.Количество();
	Иначе
		КоличествоСтрок = 0;
	КонецЕсли;
	
	Если КоличествоСтрок > 0 Тогда
		
		Пока ВыборкаСтрок.Следующий() Цикл
			
			Попытка 
				
				Если НЕ ТабДокумент.ПроверитьВывод(ОбластьСтрокаТаблицыКонтрагентов) Тогда
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабДокумент.Вывести(ОбластьЗаголовокТаблицыКонтрагентов);
				КонецЕсли;	
				
			Исключение
				//Сообщить("В системе не установлено ни одного принтера.");
			КонецПопытки;
			
			ОбластьСтрокаТаблицыКонтрагентов.Параметры.Заполнить(ВыборкаСтрок);
			
			ТабДокумент.Вывести(ОбластьСтрокаТаблицыКонтрагентов);
			
		КонецЦикла;
		
	Иначе
		ТабДокумент.Вывести(ОбластьСтрокаТаблицыКонтрагентов);
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвалТаблицыКонтрагентов);
	
КонецФункции

Функция ВывестиРаздел2СведенияОЗадолженности(Макет, ТабДокумент, ВыборкаШапка, ВыборкаЗадолженность)
	
	ОбластьЗаголовокСведенияОЗадолженности = Макет.ПолучитьОбласть("ЗаголовокСведенияОЗадолженности");
	ОбластьЗаголовокГруппаУчета2           = Макет.ПолучитьОбласть("ЗаголовокГруппаУчета2");
	ОбластьЗаголовокТаблицыЗадолженности   = Макет.ПолучитьОбласть("ЗаголовокТаблицыЗадолженности");
	ОбластьСтрокаТаблицыЗадолженности      = Макет.ПолучитьОбласть("СтрокаТаблицыЗадолженности");
	ОбластьИтогПоКодуДохода                = Макет.ПолучитьОбласть("ИтогПоКодуДоходаТаблицыЗадолженности");
	ОбластьИтогПоКонтрагенту               = Макет.ПолучитьОбласть("ИтогПоКонтрагентуТаблицыЗадолженности");
	ОбластьОбщийИтог                       = Макет.ПолучитьОбласть("ИтогТаблицыЗадолженности");
	
	ТабДокумент.Вывести(ОбластьЗаголовокСведенияОЗадолженности);
	
	ОбластьЗаголовокГруппаУчета2.Параметры.ГруппаУчета2Заголовок = НСтр("ru = '2.1 Группа учета'");
	ОбластьЗаголовокГруппаУчета2.Параметры.ГруппаУчета2 = НСтр("ru = ''");
	ТабДокумент.Вывести(ОбластьЗаголовокГруппаУчета2);
	
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицыЗадолженности);
	
	ВыборкаЗадолженность.Сбросить();
	ОтборСтрок = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
	Если ВыборкаЗадолженность.НайтиСледующий(ОтборСтрок) Тогда
		ОбластьОбщийИтог.Параметры.Заполнить(ВыборкаЗадолженность);
		ВыборкаИтогиПоКонтрагентам = ВыборкаЗадолженность.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КоличествоСтрок = ВыборкаИтогиПоКонтрагентам.Количество();
	Иначе
		КоличествоСтрок = 0;
	КонецЕсли;
	
	Если КоличествоСтрок > 0 Тогда
		
		Пока ВыборкаИтогиПоКонтрагентам.Следующий() Цикл
			
			ОбластьИтогПоКонтрагенту.Параметры.Заполнить(ВыборкаИтогиПоКонтрагентам);
			
			ВыборкаИтогиПоКПС = ВыборкаИтогиПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИтогиПоКПС.Следующий() Цикл
				
				ОбластьИтогПоКодуДохода.Параметры.Заполнить(ВыборкаИтогиПоКПС);
				
				ВыборкаСтрок = ВыборкаИтогиПоКПС.Выбрать();
				Пока ВыборкаСтрок.Следующий() Цикл
				
					Попытка 
						
						Если НЕ ТабДокумент.ПроверитьВывод(ОбластьСтрокаТаблицыЗадолженности) Тогда
							ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							ТабДокумент.Вывести(ОбластьЗаголовокТаблицыЗадолженности);
						КонецЕсли;	
						
					Исключение
						//Сообщить("В системе не установлено ни одного принтера.");
					КонецПопытки;
					
					ОбластьСтрокаТаблицыЗадолженности.Параметры.Заполнить(ВыборкаСтрок);
					
					Если Не ЗначениеЗаполнено(ВыборкаСтрок.ОснованиеВозникновенияЗадолженности)
						И Не ЗначениеЗаполнено(ВыборкаСтрок.ОснованиеВозникновенияЗадолженностиНомер)
						И Не ЗначениеЗаполнено(ВыборкаСтрок.ОснованиеВозникновенияЗадолженностиДата) Тогда // Из реквизитов договора.
						ОбластьСтрокаТаблицыЗадолженности.Параметры.ДокументОснование      = ВыборкаСтрок.ДоговорВидОбязательства;
						ОбластьСтрокаТаблицыЗадолженности.Параметры.ДокументОснованиеНомер = ВыборкаСтрок.ДоговорНомерДоговора;
						ОбластьСтрокаТаблицыЗадолженности.Параметры.ДокументОснованиеДата  = ВыборкаСтрок.ДоговорДатаДоговора;
					Иначе // Из реквизитов документа.
						ОбластьСтрокаТаблицыЗадолженности.Параметры.ДокументОснование      = ВыборкаСтрок.ОснованиеВозникновенияЗадолженности;
						ОбластьСтрокаТаблицыЗадолженности.Параметры.ДокументОснованиеНомер = ВыборкаСтрок.ОснованиеВозникновенияЗадолженностиНомер;
						ОбластьСтрокаТаблицыЗадолженности.Параметры.ДокументОснованиеДата  = ВыборкаСтрок.ОснованиеВозникновенияЗадолженностиДата;
					КонецЕсли;
					
					ТабДокумент.Вывести(ОбластьСтрокаТаблицыЗадолженности);
					
				КонецЦикла;
				
				ТабДокумент.Вывести(ОбластьИтогПоКодуДохода);
				
			КонецЦикла;
			
			ТабДокумент.Вывести(ОбластьИтогПоКонтрагенту);
			
		КонецЦикла;
		
	Иначе
		ТабДокумент.Вывести(ОбластьСтрокаТаблицыЗадолженности);
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьОбщийИтог);
	
КонецФункции

Функция ВывестиРаздел3ЗаключениеКомиссии(Макет, ТабДокумент, ВыборкаШапка, ВыборкаЗадолженность, РезультатыГолосования)
	
	ОбластьЗаголовокЗаключениеКомиссии        = Макет.ПолучитьОбласть("ЗаголовокЗаключениеКомиссии");
	ОбластьЗаголовокГруппаУчета3              = Макет.ПолучитьОбласть("ЗаголовокГруппаУчета3");
	ОбластьЗаголовокТаблицыЗаключениеКомиссии = Макет.ПолучитьОбласть("ЗаголовокТаблицыЗаключениеКомиссии");
	ОбластьСтрокаТаблицыЗаключениеКомиссии    = Макет.ПолучитьОбласть("СтрокаТаблицыЗаключениеКомиссии");
	ОбластьПодвалТаблицыЗаключениеКомиссии    = Макет.ПолучитьОбласть("ПодвалТаблицыЗаключениеКомиссии");
	
	ТабДокумент.Вывести(ОбластьЗаголовокЗаключениеКомиссии);
	
	ОбластьЗаголовокГруппаУчета3.Параметры.ГруппаУчета3Заголовок = НСтр("ru = '3.1 Группа учета'");
	ОбластьЗаголовокГруппаУчета3.Параметры.ГруппаУчета3 = НСтр("ru = ''");
	ТабДокумент.Вывести(ОбластьЗаголовокГруппаУчета3);
	
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицыЗаключениеКомиссии);
	
	ВыборкаЗадолженность.Сбросить();
	ОтборСтрок = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
	Если ВыборкаЗадолженность.НайтиСледующий(ОтборСтрок) Тогда
		ВыборкаИтогиПоКонтрагентам = ВыборкаЗадолженность.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КоличествоСтрок = ВыборкаИтогиПоКонтрагентам.Количество();
	Иначе
		КоличествоСтрок = 0;
	КонецЕсли;
	
	Если КоличествоСтрок > 0 Тогда
		
		Пока ВыборкаИтогиПоКонтрагентам.Следующий() Цикл
			ВыборкаИтогиПоКПС = ВыборкаИтогиПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаИтогиПоКПС.Следующий() Цикл
				ВыборкаСтрок = ВыборкаИтогиПоКПС.Выбрать();
				Пока ВыборкаСтрок.Следующий() Цикл
					
					Попытка 
						
						Если НЕ ТабДокумент.ПроверитьВывод(ОбластьСтрокаТаблицыЗаключениеКомиссии) Тогда
							ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							ТабДокумент.Вывести(ОбластьЗаголовокТаблицыЗаключениеКомиссии);
						КонецЕсли;	
						
					Исключение
						//Сообщить("В системе не установлено ни одного принтера.");
					КонецПопытки;
					
					ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.Заполнить(ВыборкаСтрок);
					
					// Результаты голосования комиссии по строке документа.
					ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
						ВыборкаШапка.Ссылка, ВыборкаСтрок.ИдентификаторСтроки);
					РезультатыГолосованияПоСтроке = РезультатыГолосования.НайтиСтроки(ОтборПоИдентификаторуСтроки);
					Если РезультатыГолосованияПоСтроке.Количество() > 0
						И РезультатыГолосованияПоСтроке[0].ГолосованиеПоСтрокеЗавершено Тогда // Результаты голосования выводим, только если голосование по документу завершено.
						
						ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
						
						Если РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена Тогда
							ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.РезолюцияПоИтогуГолосования = "";
						Иначе
							ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.РезолюцияПоИтогуГолосования = НСтр("ru = 'снято с обсуждения'");
						КонецЕсли;
						
					Иначе // Результаты голосования по строке документа не найдены.
						ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.ИтогГолосования = 0;
						ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.РезолюцияПоИтогуГолосования = "";
					КонецЕсли;
					
					Если ВыборкаСтрок.СчетЗабалансовый Тогда
						КЭКУчета = СокрЛП(ВыборкаСтрок.КЭК);
					ИначеЕсли ВыборкаСтрок.СчетБезДетализацииКОСГУ Тогда
						КЭКУчета = "000";
					Иначе
						КЭКУчета = "00" + ВыборкаСтрок.ТипКонтрагентаКод;
					КонецЕсли;
					
					ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.НомерСчета = СтрШаблон("%1 %2 %3 %4",
						СокрЛП(ВыборкаСтрок.КПС),
						СокрЛП(ВыборкаСтрок.КФО),
						СтрЗаменить(ВыборкаСтрок.СчетКод, ".", " "),
						КЭКУчета);
					
					ОбластьСтрокаТаблицыЗаключениеКомиссии.Параметры.КОСГУ = ВыборкаСтрок.КЭК;
					
					ТабДокумент.Вывести(ОбластьСтрокаТаблицыЗаключениеКомиссии);
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		ТабДокумент.Вывести(ОбластьСтрокаТаблицыЗаключениеКомиссии);
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПодвалТаблицыЗаключениеКомиссии);
	
КонецФункции

Функция ВывестиПодвал(Макет, ТабДокумент, ВыборкаШапка, ОбщиеСведения, СоставКомиссий)
	
	// Приложение.
	Файлы = УправлениеПечатьюБГУ.ПолучитьСписокФайловДокумента(ВыборкаШапка.Ссылка);
	Для Каждого Приложение Из Файлы Цикл
		ОбластьМакетаПриложение = Макет.ПолучитьОбласть("Приложение");
		ОбластьМакетаПриложение.Параметры.Заполнить(Приложение);
		ТабДокумент.Вывести(ОбластьМакетаПриложение);
	КонецЦикла;
	
	// Состав комиссии.
	Если СоставКомиссий.Количество() > 0 Тогда
		
		ВыводимыеОбласти = Новый Массив;
		
		// Председатель.
		Отбор = Новый Структура("Ссылка,Председатель", ВыборкаШапка.Ссылка, Истина);
		СтрокиПредседатель = СоставКомиссий.НайтиСтроки(Отбор);
		Для Каждого Председатель Из СтрокиПредседатель Цикл
			ОбластьМакетаЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
			ОбластьМакетаЧленКомиссии.Параметры.Заполнить(Председатель);
			ОбластьМакетаЧленКомиссии.Параметры.Заголовок = НСтр("ru = 'Председатель комиссии'");
			ОбластьМакетаЧленКомиссии.Параметры.ДолжностьЧленаКомиссии = Председатель.Должность;
			ОбластьМакетаЧленКомиссии.Параметры.ФИОЧленаКомиссии = КорреспондентыКлиентСервер.ФИО(Председатель);
			ВыводимыеОбласти.Добавить(ОбластьМакетаЧленКомиссии);
		КонецЦикла;
		
		// Члены комиссии.
		Отбор = Новый Структура("Ссылка,Председатель", ВыборкаШапка.Ссылка, Ложь);
		СтрокиЧленыКомиссии = СоставКомиссий.НайтиСтроки(Отбор);
		ПерваяСтрока = Истина;
		Для Каждого ЧленКомиссии Из СтрокиЧленыКомиссии Цикл
			ОбластьМакетаЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
			ОбластьМакетаЧленКомиссии.Параметры.Заполнить(ЧленКомиссии);
			ОбластьМакетаЧленКомиссии.Параметры.Заголовок = ?(ПерваяСтрока, НСтр("ru = 'Члены комиссии:'"), "");
			ОбластьМакетаЧленКомиссии.Параметры.ДолжностьЧленаКомиссии = ЧленКомиссии.Должность;
			ОбластьМакетаЧленКомиссии.Параметры.ФИОЧленаКомиссии = КорреспондентыКлиентСервер.ФИО(ЧленКомиссии);
			ВыводимыеОбласти.Добавить(ОбластьМакетаЧленКомиссии);
			ПерваяСтрока = Ложь;
		КонецЦикла;
		
		Попытка
			Если НЕ ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		Исключение
		КонецПопытки;
		Для Каждого Область Из ВыводимыеОбласти Цикл
			ТабДокумент.Вывести(Область);
		КонецЦикла;
		
	КонецЕсли;
	
	// Подвал.
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");
	ЗаполнитьЗначенияСвойств(ОбластьМакетаПодвал.Параметры, ОбщиеСведения,
		"ОтветственныйФИО, ОтветственныйДолжность, ОтветственныйТелефон, ОтветственныйЭлПочта");
	ОбластьМакетаПодвал.Параметры.ДатаСтрокой = Формат(ВыборкаШапка.пДата, "ДЛФ=ДД");
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Функция ЗаполнитьПоДаннымУчета(Объект, Контрагент = Неопределено) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Объект.Организация);
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая));
	
	СчетаЗадолженностиПоДоходам = "205.00,207.00,209.00,210.05";
	СчетаСомнительнойЗадолженности = "04";
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеСомнительнойЗадолженности Тогда
		Запрос.УстановитьПараметр("СчетаОстатковБаланс",   БухгалтерскийУчет.СписокСчетов(СчетаЗадолженностиПоДоходам));
		Запрос.УстановитьПараметр("СчетаОстатковЗабаланс", Новый Массив); // Не требуется.
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности Тогда
		Запрос.УстановитьПараметр("СчетаОстатковБаланс",   Новый Массив); // Не требуется.
		Запрос.УстановитьПараметр("СчетаОстатковЗабаланс", БухгалтерскийУчет.СписокСчетов(СчетаСомнительнойЗадолженности));
		
	Иначе // СписаниеБезнадежнойКВзысканиюЗадолженности
		Запрос.УстановитьПараметр("СчетаОстатковБаланс",   БухгалтерскийУчет.СписокСчетов(СчетаЗадолженностиПоДоходам));
		Запрос.УстановитьПараметр("СчетаОстатковЗабаланс", БухгалтерскийУчет.СписокСчетов(СчетаСомнительнойЗадолженности));
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	
	СписокКонтрагентов = Объект.СписокКонтрагентов.Выгрузить();
	
	Если Контрагент = Неопределено Тогда // По всем контрагентам в документе.
		
		Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов.ВыгрузитьКолонку("Контрагент"));
		
		// Удаляем строки по всем Контрагентам.
		Объект.Задолженность.Очистить();
		
	Иначе // По выбранному контрагенту (группе учета).
		
		Запрос.УстановитьПараметр("СписокКонтрагентов", Контрагент);
		
		// Удаляем строки по Контрагенту.
		Отбор = Новый Структура("Контрагент", Контрагент);
		СтрокиКУдалению = Объект.Задолженность.НайтиСтроки(Отбор);
		Для Каждого Строка Из СтрокиКУдалению Цикл
			Объект.Задолженность.Удалить(Строка);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Организация КАК Организация,
	|	ЕСТЬNULL(Остатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	Остатки.КФО КАК КФО,
	|	Остатки.КПС КАК КПС,
	|	ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) КАК КЭК,
	|	Остатки.Счет КАК Счет,
	|	Остатки.Счет.Код КАК СчетКод,
	|	Остатки.Счет.УчетПоПодразделениям КАК СчетУчетПоПодразделениям,
	|	Остатки.Счет.Забалансовый КАК СчетЗабалансовый,
	|	Остатки.Подразделение КАК Подразделение,
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Контрагенты) КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Остатки.Субконто2 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто2
	|		КОГДА Остатки.Субконто3 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА НЕ Остатки.Субконто2 ССЫЛКА Справочник.Контрагенты
	|				И НЕ Остатки.Субконто2 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто2
	|		КОГДА НЕ Остатки.Субконто3 ССЫЛКА Справочник.Контрагенты
	|				И НЕ Остатки.Субконто3 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДопСубконтоРасчетов,
	|	ВЫБОР
	|		КОГДА Остатки.Валюта ЕСТЬ NULL
	|				ИЛИ Остатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ Остатки.Валюта
	|	КОНЕЦ КАК Валюта,
	|	Остатки.СуммаОстатокДт КАК ОстатокСумма,
	|	Остатки.ВалютнаяСуммаОстатокДт КАК ОстатокСуммаВал
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонецПериода,
	|			Счет В (&СчетаОстатковБаланс),
	|			,
	|			Организация = &Организация
	|				И &УсловиеПоИФО
	|				И Субконто1 В (&СписокКонтрагентов)) КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Остатки.Организация,
	|	ЕСТЬNULL(Остатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)),
	|	Остатки.КФО,
	|	Остатки.КПС,
	|	Остатки.КЭК,
	|	Остатки.Счет,
	|	Остатки.Счет.Код,
	|	Остатки.Счет.УчетПоПодразделениям,
	|	Остатки.Счет.Забалансовый,
	|	Остатки.Подразделение,
	|	ВЫРАЗИТЬ(Остатки.Субконто1 КАК Справочник.Контрагенты),
	|	ВЫБОР
	|		КОГДА Остатки.Субконто2 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто2
	|		КОГДА Остатки.Субконто3 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто3
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ Остатки.Субконто2 ССЫЛКА Справочник.Контрагенты
	|				И НЕ Остатки.Субконто2 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто2
	|		КОГДА НЕ Остатки.Субконто3 ССЫЛКА Справочник.Контрагенты
	|				И НЕ Остатки.Субконто3 ССЫЛКА Справочник.Договоры
	|			ТОГДА Остатки.Субконто3
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Остатки.Валюта ЕСТЬ NULL
	|				ИЛИ Остатки.Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ Остатки.Валюта
	|	КОНЕЦ,
	|	Остатки.СуммаОстаток,
	|	Остатки.ВалютнаяСуммаОстаток
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонецПериода,
	|			Счет В (&СчетаОстатковЗабаланс),
	|			,
	|			Организация = &Организация
	|				И &УсловиеПоИФО
	|				И Субконто1 В (&СписокКонтрагентов)) КАК Остатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	Договор,
	|	ИФО,
	|	КФО,
	|	СчетКод,
	|	КПС,
	|	КЭК";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", Объект.ИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоИФО", "ИСТИНА");
	КонецЕсли;
	
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	ОстаткиЗадолженности = Запрос.Выполнить().Выгрузить();
	
	РеквизитыДоговоров = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		ОстаткиЗадолженности.ВыгрузитьКолонку("Договор"), "ВидОбязательства,НомерДоговора,ДатаДоговора");
	
	Для Каждого СтрокаОстатков Из ОстаткиЗадолженности Цикл
		
		Если ИспользоватьУчетПоПодразделениям
			И СтрокаОстатков.СчетУчетПоПодразделениям
			И ЗначениеЗаполнено(Объект.Подразделение)
			И СтрокаОстатков.Подразделение <> Объект.Подразделение Тогда
			Продолжить; // Отбор остатков активен, только если заполнено Подразделение в шапке документа.
		КонецЕсли;
		
		НоваяСтрока = Объект.Задолженность.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки задолженности.
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков,
			"ИФО,КФО,Подразделение,Счет,КПС,Контрагент,Договор,ДопСубконтоРасчетов,Валюта,
			|ОстатокСумма,ОстатокСуммаВал");
		
		Если СтрокаОстатков.СчетЗабалансовый Тогда
			НоваяСтрока.КЭК = СтрокаОстатков.КЭК;
		Иначе
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(СтрокаОстатков.Счет);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаОстатков.Валюта) Тогда
			НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
		КонецЕсли;
		
		НоваяСтрока.СписатьСумма    = НоваяСтрока.ОстатокСумма;
		НоваяСтрока.СписатьСуммаВал = НоваяСтрока.ОстатокСуммаВал;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.СчетПоКоду("04", Объект.Дата, Объект.Организация);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность сомнительной'");
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(СтрокаОстатков.КЭК,
				СчетаЗадолженностиПоДоходам, Ложь, Объект.Дата, Объект.Организация, Объект.ИФО);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'восстановить сомнительную задолженность'");
			
		Иначе // СписаниеБезнадежнойКВзысканиюЗадолженности
			
			НоваяСтрока.СчетСписания = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность безнадежной к взысканию'");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.Договор) Тогда
			НоваяСтрока.ОснованиеВозникновенияЗадолженности      = РеквизитыДоговоров[НоваяСтрока.Договор].ВидОбязательства;
			НоваяСтрока.ОснованиеВозникновенияЗадолженностиНомер = РеквизитыДоговоров[НоваяСтрока.Договор].НомерДоговора;
			НоваяСтрока.ОснованиеВозникновенияЗадолженностиДата  = РеквизитыДоговоров[НоваяСтрока.Договор].ДатаДоговора;
		КонецЕсли;
		
		Если БухгалтерскийУчетПовтИсп.НаСчетеВедетсяУчетПоДокументамРасчетов(СтрокаОстатков.Счет)
			И ЗначениеЗаполнено(СтрокаОстатков.ДопСубконтоРасчетов)
			И Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СтрокаОстатков.ДопСубконтоРасчетов)) Тогда
			НоваяСтрока.ДатаОбразованияЗадолженности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаОстатков.ДопСубконтоРасчетов, "Дата");
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

Функция ЗаполнитьНаОснованииИнвентаризацииРасчетовСКонтрагентами(Объект, ДокументОснование, ВидОперации, НомераСтрок = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДебиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	ДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ДебиторскаяЗадолженность.Договор КАК Договор,
	|	ДебиторскаяЗадолженность.Счет КАК Счет,
	|	ДебиторскаяЗадолженность.Счет.Забалансовый КАК СчетЗабалансовый,
	|	ДебиторскаяЗадолженность.КПС КАК КПС,
	|	ДебиторскаяЗадолженность.КЭК КАК КЭК,
	|	ДебиторскаяЗадолженность.КФО КАК КФО,
	|	ДебиторскаяЗадолженность.ИФО КАК ИФО,
	|	ДебиторскаяЗадолженность.Всего КАК Всего,
	|	ДебиторскаяЗадолженность.Подтверждено КАК Подтверждено,
	|	ДебиторскаяЗадолженность.НеПодтверждено КАК НеПодтверждено,
	|	ДебиторскаяЗадолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	|	ДебиторскаяЗадолженность.Долгосрочная КАК Долгосрочная,
	|	ДебиторскаяЗадолженность.Просроченная КАК Просроченная,
	|	ДебиторскаяЗадолженность.ДатаВозникновения КАК ДатаВозникновения,
	|	ДебиторскаяЗадолженность.ДатаИсполнения КАК ДатаИсполнения
	|ПОМЕСТИТЬ СтрокиИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовСКонтрагентами.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	И &УсловиеПоНомерамСтрок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.ДокументОснование.Организация КАК Организация,
	|	СтрокиИнвентаризации.ДокументОснование.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.ИФО КАК ИФО
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиИнвентаризации.ДокументОснование КАК ДокументОснование,
	|	СтрокиИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент,
	|	СтрокиИнвентаризации.Договор КАК Договор,
	|	СтрокиИнвентаризации.Договор.ВидОбязательства КАК ДоговорВидОбязательства,
	|	СтрокиИнвентаризации.Договор.НомерДоговора КАК ДоговорНомерДоговора,
	|	СтрокиИнвентаризации.Договор.ДатаДоговора КАК ДоговорДатаДоговора,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.СчетЗабалансовый КАК СчетЗабалансовый,
	|	СтрокиИнвентаризации.КПС КАК КПС,
	|	СтрокиИнвентаризации.КЭК КАК КЭК,
	|	СтрокиИнвентаризации.КФО КАК КФО,
	|	СтрокиИнвентаризации.ИФО КАК ИФО,
	|	СтрокиИнвентаризации.Всего КАК Всего,
	|	СтрокиИнвентаризации.Подтверждено КАК Подтверждено,
	|	СтрокиИнвентаризации.НеПодтверждено КАК НеПодтверждено,
	|	СтрокиИнвентаризации.ИстекСрокДавности КАК ИстекСрокДавности,
	|	СтрокиИнвентаризации.Долгосрочная КАК Долгосрочная,
	|	СтрокиИнвентаризации.Просроченная КАК Просроченная,
	|	СтрокиИнвентаризации.ДатаВозникновения КАК ДатаВозникновения,
	|	СтрокиИнвентаризации.ДатаИсполнения КАК ДатаИсполнения
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если НомераСтрок <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНомерамСтрок", "ДебиторскаяЗадолженность.НомерСтроки В(&НомераСтрок)");
		Запрос.УстановитьПараметр("НомераСтрок", НомераСтрок);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Шапка", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Контрагенты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Задолженность", НомераТаблиц.Количество());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	СчетаЗадолженностиПоДоходам = "205.00,207.00,209.00,210.05";
	
	// Реквизиты шапки.
	Шапка = Результат[НомераТаблиц.Шапка].Выбрать();
	Если Шапка.Следующий() Тогда
		
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Организация = Шапка.Организация;
		Если ИспользоватьУчетПоИФО Тогда
			Объект.ИФО = Шапка.ИФО;
		КонецЕсли;
		
		Объект.ВидОперации = ВидОперации;
		
	КонецЕсли;
	
	// Список контрагентов.
	Контрагенты = Результат[НомераТаблиц.Контрагенты].Выбрать();
	Пока Контрагенты.Следующий() Цикл
		НоваяСтрока = Объект.СписокКонтрагентов.Добавить();
		НоваяСтрока.Контрагент = Контрагенты.Контрагент;
		НоваяСтрока.ИдентификаторПлательщика = БухгалтерскийУчет.ИдентификаторКонтрагента(НоваяСтрока.Контрагент, Объект.ВидДокументаФизЛиц);
	КонецЦикла;
	
	// Задолженность.
	Задолженность = Результат[НомераТаблиц.Задолженность].Выбрать();
	Пока Задолженность.Следующий() Цикл
		
		НоваяСтрока = Объект.Задолженность.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки задолженности.
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Задолженность, "Контрагент,Договор,Счет,ИФО,КФО,КПС");
		
		НоваяСтрока.ОснованиеВозникновенияЗадолженности      = Задолженность.ДоговорВидОбязательства;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиНомер = Задолженность.ДоговорНомерДоговора;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиДата  = Задолженность.ДоговорДатаДоговора;
		
		Если Задолженность.СчетЗабалансовый Тогда
			НоваяСтрока.КЭК = Задолженность.КЭК;
		Иначе
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(Задолженность.Счет);
		КонецЕсли;
		
		НоваяСтрока.ДатаОбразованияЗадолженности = Задолженность.ДатаВозникновения;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.ОстатокСумма = Задолженность.Всего;
			НоваяСтрока.СписатьСумма = Задолженность.Всего;
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.СчетПоКоду("04", Объект.Дата, Объект.Организация);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность сомнительной'");
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.ОстатокСумма = Задолженность.Всего;
			НоваяСтрока.СписатьСумма = Задолженность.Всего;
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
				СчетаЗадолженностиПоДоходам, Ложь, Объект.Дата, Объект.Организация, Объект.ИФО);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'восстановить сомнительную задолженность'");
			
		Иначе // СписаниеБезнадежнойКВзысканиюЗадолженности
			
			НоваяСтрока.ОстатокСумма = Задолженность.Всего;
			НоваяСтрока.СписатьСумма = Задолженность.ИстекСрокДавности;
			
			НоваяСтрока.СчетСписания = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность безнадежной к взысканию'");
			
		КонецЕсли;
		
		НоваяСтрока.Валюта = ВалютаРегламентированногоУчета; // Инвентаризация расчетов производится в рублях.
		НоваяСтрока.ОстатокСуммаВал = НоваяСтрока.ОстатокСумма;
		НоваяСтрока.СписатьСуммаВал = НоваяСтрока.СписатьСумма;
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьНаОснованииИнвентаризацииРасчетовПоПоступлениям(Объект, ДокументОснование, ВидОперации, НомераСтрок = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДебиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	ДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ДебиторскаяЗадолженность.Договор КАК Договор,
	|	ДебиторскаяЗадолженность.Счет КАК Счет,
	|	ДебиторскаяЗадолженность.Счет.Забалансовый КАК СчетЗабалансовый,
	|	ДебиторскаяЗадолженность.ИФО КАК ИФО,
	|	ДебиторскаяЗадолженность.КПС КАК КПС,
	|	ДебиторскаяЗадолженность.КФО КАК КФО,
	|	ДебиторскаяЗадолженность.КЭК КАК КЭК,
	|	ДебиторскаяЗадолженность.Всего КАК Всего,
	|	ДебиторскаяЗадолженность.Подтверждено КАК Подтверждено,
	|	ДебиторскаяЗадолженность.НеПодтверждено КАК НеПодтверждено,
	|	ДебиторскаяЗадолженность.ИстекСрокДавности КАК ИстекСрокДавности,
	|	ДебиторскаяЗадолженность.Долгосрочная КАК Долгосрочная,
	|	ДебиторскаяЗадолженность.Просроченная КАК Просроченная,
	|	ДебиторскаяЗадолженность.ДатаВозникновения КАК ДатаВозникновения,
	|	ДебиторскаяЗадолженность.ДатаИсполнения КАК ДатаИсполнения
	|ПОМЕСТИТЬ СтрокиИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям.Задолженность КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	И &УсловиеПоНомерамСтрок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.ДокументОснование.Организация КАК Организация,
	|	СтрокиИнвентаризации.ДокументОснование.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.ИФО КАК ИФО
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиИнвентаризации.ДокументОснование КАК ДокументОснование,
	|	СтрокиИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент,
	|	СтрокиИнвентаризации.Договор КАК Договор,
	|	СтрокиИнвентаризации.Договор.ВидОбязательства КАК ДоговорВидОбязательства,
	|	СтрокиИнвентаризации.Договор.НомерДоговора КАК ДоговорНомерДоговора,
	|	СтрокиИнвентаризации.Договор.ДатаДоговора КАК ДоговорДатаДоговора,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.СчетЗабалансовый КАК СчетЗабалансовый,
	|	СтрокиИнвентаризации.ИФО КАК ИФО,
	|	СтрокиИнвентаризации.КФО КАК КФО,
	|	СтрокиИнвентаризации.КПС КАК КПС,
	|	СтрокиИнвентаризации.КЭК КАК КЭК,
	|	СтрокиИнвентаризации.Всего КАК Всего,
	|	СтрокиИнвентаризации.Подтверждено КАК Подтверждено,
	|	СтрокиИнвентаризации.НеПодтверждено КАК НеПодтверждено,
	|	СтрокиИнвентаризации.ИстекСрокДавности КАК ИстекСрокДавности,
	|	СтрокиИнвентаризации.Долгосрочная КАК Долгосрочная,
	|	СтрокиИнвентаризации.Просроченная КАК Просроченная,
	|	СтрокиИнвентаризации.ДатаВозникновения КАК ДатаВозникновения,
	|	СтрокиИнвентаризации.ДатаИсполнения КАК ДатаИсполнения
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если НомераСтрок <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНомерамСтрок", "ДебиторскаяЗадолженность.НомерСтроки В(&НомераСтрок)");
		Запрос.УстановитьПараметр("НомераСтрок", НомераСтрок);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Шапка", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Контрагенты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Задолженность", НомераТаблиц.Количество());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	СчетаЗадолженностиПоДоходам = "205.00,207.00,209.00,210.05";
	
	// Реквизиты шапки.
	Шапка = Результат[НомераТаблиц.Шапка].Выбрать();
	Если Шапка.Следующий() Тогда
		
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Организация = Шапка.Организация;
		Если ИспользоватьУчетПоИФО Тогда
			Объект.ИФО = Шапка.ИФО;
		КонецЕсли;
		
		Объект.ВидОперации = ВидОперации;
		
	КонецЕсли;
	
	// Список контрагентов.
	Контрагенты = Результат[НомераТаблиц.Контрагенты].Выбрать();
	Пока Контрагенты.Следующий() Цикл
		НоваяСтрока = Объект.СписокКонтрагентов.Добавить();
		НоваяСтрока.Контрагент = Контрагенты.Контрагент;
		НоваяСтрока.ИдентификаторПлательщика = БухгалтерскийУчет.ИдентификаторКонтрагента(НоваяСтрока.Контрагент, Объект.ВидДокументаФизЛиц);
	КонецЦикла;
	
	// Задолженность.
	Задолженность = Результат[НомераТаблиц.Задолженность].Выбрать();
	Пока Задолженность.Следующий() Цикл
		
		НоваяСтрока = Объект.Задолженность.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки задолженности.
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Задолженность, "Контрагент,Договор,Счет,ИФО,КФО,КПС");
		
		НоваяСтрока.ОснованиеВозникновенияЗадолженности      = Задолженность.ДоговорВидОбязательства;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиНомер = Задолженность.ДоговорНомерДоговора;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиДата  = Задолженность.ДоговорДатаДоговора;
		
		Если Задолженность.СчетЗабалансовый Тогда
			НоваяСтрока.КЭК = Задолженность.КЭК;
		Иначе
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(Задолженность.Счет);
		КонецЕсли;
		
		НоваяСтрока.ДатаОбразованияЗадолженности = Задолженность.ДатаВозникновения;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.ОстатокСумма = Задолженность.Всего;
			НоваяСтрока.СписатьСумма = Задолженность.Всего;
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.СчетПоКоду("04", Объект.Дата, Объект.Организация);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность сомнительной'");
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.ОстатокСумма = Задолженность.Всего;
			НоваяСтрока.СписатьСумма = Задолженность.Всего;
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
				СчетаЗадолженностиПоДоходам, Ложь, Объект.Дата, Объект.Организация, Объект.ИФО);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'восстановить сомнительную задолженность'");
			
		Иначе // СписаниеБезнадежнойКВзысканиюЗадолженности
			
			НоваяСтрока.ОстатокСумма = Задолженность.Всего;
			НоваяСтрока.СписатьСумма = Задолженность.ИстекСрокДавности;
			
			НоваяСтрока.СчетСписания = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность безнадежной к взысканию'");
			
		КонецЕсли;
		
		НоваяСтрока.Валюта = ВалютаРегламентированногоУчета; // Инвентаризация расчетов производится в рублях.
		НоваяСтрока.ОстатокСуммаВал = НоваяСтрока.ОстатокСумма;
		НоваяСтрока.СписатьСуммаВал = НоваяСтрока.СписатьСумма;
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьНаОснованииРешенияОПризнанииСомнительнойЗадолженности(Объект, ДокументОснование, НомераСтрок = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДебиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	ДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ДебиторскаяЗадолженность.Счет КАК Счет,
	|	ДебиторскаяЗадолженность.ИФО КАК ИФО,
	|	ДебиторскаяЗадолженность.КФО КАК КФО,
	|	ДебиторскаяЗадолженность.КПС КАК КПС,
	|	ДебиторскаяЗадолженность.КЭК КАК КЭК,
	|	ДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ДебиторскаяЗадолженность.Договор КАК Договор,
	|	ДебиторскаяЗадолженность.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
	|	ДебиторскаяЗадолженность.Валюта КАК Валюта,
	|	ДебиторскаяЗадолженность.СписатьСумма КАК СписатьСумма,
	|	ДебиторскаяЗадолженность.СписатьСуммаВал КАК СписатьСуммаВал,
	|	ДебиторскаяЗадолженность.СчетСписания КАК СчетСписания,
	|	ДебиторскаяЗадолженность.ОснованиеВозникновенияЗадолженности КАК ОснованиеВозникновенияЗадолженности,
	|	ДебиторскаяЗадолженность.ОснованиеВозникновенияЗадолженностиНомер КАК ОснованиеВозникновенияЗадолженностиНомер,
	|	ДебиторскаяЗадолженность.ОснованиеВозникновенияЗадолженностиДата КАК ОснованиеВозникновенияЗадолженностиДата,
	|	ДебиторскаяЗадолженность.ДатаОбразованияЗадолженности КАК ДатаОбразованияЗадолженности,
	|	ДебиторскаяЗадолженность.НомерРеестровойЗаписи КАК НомерРеестровойЗаписи
	|ПОМЕСТИТЬ СтрокиИнвентаризации
	|ИЗ
	|	Документ.СписаниеВосстановлениеЗадолженностиПоДоходам.Задолженность КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	И &УсловиеПоНомерамСтрок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.ДокументОснование.Организация КАК Организация,
	|	СтрокиИнвентаризации.ИФО КАК ИФО
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиИнвентаризации.ДокументОснование КАК ДокументОснование,
	|	СтрокиИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.ИФО КАК ИФО,
	|	СтрокиИнвентаризации.КФО КАК КФО,
	|	СтрокиИнвентаризации.КПС КАК КПС,
	|	СтрокиИнвентаризации.КЭК КАК КЭК,
	|	СтрокиИнвентаризации.Подразделение КАК Подразделение,
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент,
	|	СтрокиИнвентаризации.Договор КАК Договор,
	|	СтрокиИнвентаризации.Договор.ВидОбязательства КАК ДоговорВидОбязательства,
	|	СтрокиИнвентаризации.Договор.НомерДоговора КАК ДоговорНомерДоговора,
	|	СтрокиИнвентаризации.Договор.ДатаДоговора КАК ДоговорДатаДоговора,
	|	СтрокиИнвентаризации.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
	|	СтрокиИнвентаризации.Валюта КАК Валюта,
	|	СтрокиИнвентаризации.СписатьСумма КАК СписатьСумма,
	|	СтрокиИнвентаризации.СписатьСуммаВал КАК СписатьСуммаВал,
	|	СтрокиИнвентаризации.СчетСписания КАК СчетСписания,
	|	СтрокиИнвентаризации.ОснованиеВозникновенияЗадолженности КАК ОснованиеВозникновенияЗадолженности,
	|	СтрокиИнвентаризации.ОснованиеВозникновенияЗадолженностиНомер КАК ОснованиеВозникновенияЗадолженностиНомер,
	|	СтрокиИнвентаризации.ОснованиеВозникновенияЗадолженностиДата КАК ОснованиеВозникновенияЗадолженностиДата,
	|	СтрокиИнвентаризации.ДатаОбразованияЗадолженности КАК ДатаОбразованияЗадолженности,
	|	СтрокиИнвентаризации.НомерРеестровойЗаписи КАК НомерРеестровойЗаписи
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если НомераСтрок <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНомерамСтрок", "ДебиторскаяЗадолженность.НомерСтроки В(&НомераСтрок)");
		Запрос.УстановитьПараметр("НомераСтрок", НомераСтрок);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Шапка", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Контрагенты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Задолженность", НомераТаблиц.Количество());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	
	// Реквизиты шапки.
	Шапка = Результат[НомераТаблиц.Шапка].Выбрать();
	Если Шапка.Следующий() Тогда
		
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Организация = Шапка.Организация;
		Если ИспользоватьУчетПоИФО Тогда
			Объект.ИФО = Шапка.ИФО;
		КонецЕсли;
		
		Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности;
		
	КонецЕсли;
	
	// Список контрагентов.
	Контрагенты = Результат[НомераТаблиц.Контрагенты].Выбрать();
	Пока Контрагенты.Следующий() Цикл
		НоваяСтрока = Объект.СписокКонтрагентов.Добавить();
		НоваяСтрока.Контрагент = Контрагенты.Контрагент;
		НоваяСтрока.ИдентификаторПлательщика = БухгалтерскийУчет.ИдентификаторКонтрагента(НоваяСтрока.Контрагент, Объект.ВидДокументаФизЛиц);
	КонецЦикла;
	
	// Задолженность.
	Задолженность = Результат[НомераТаблиц.Задолженность].Выбрать();
	Пока Задолженность.Следующий() Цикл
		
		НоваяСтрока = Объект.Задолженность.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки задолженности.
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Задолженность,
			"ИФО,КФО,КПС,КЭК,Подразделение,Контрагент,Договор,ДопСубконтоРасчетов,Валюта,ДатаОбразованияЗадолженности,НомерРеестровойЗаписи");
		
		Если Не ЗначениеЗаполнено(Задолженность.ОснованиеВозникновенияЗадолженности)
			И Не ЗначениеЗаполнено(Задолженность.ОснованиеВозникновенияЗадолженностиНомер)
			И Не ЗначениеЗаполнено(Задолженность.ОснованиеВозникновенияЗадолженностиДата) Тогда // Из реквизитов договора.
			НоваяСтрока.ОснованиеВозникновенияЗадолженности      = Задолженность.ДоговорВидОбязательства;
			НоваяСтрока.ОснованиеВозникновенияЗадолженностиНомер = Задолженность.ДоговорНомерДоговора;
			НоваяСтрока.ОснованиеВозникновенияЗадолженностиДата  = Задолженность.ДоговорДатаДоговора;
		Иначе // Из реквизитов документа.
			НоваяСтрока.ОснованиеВозникновенияЗадолженности      = Задолженность.ОснованиеВозникновенияЗадолженности;
			НоваяСтрока.ОснованиеВозникновенияЗадолженностиНомер = Задолженность.ОснованиеВозникновенияЗадолженностиНомер;
			НоваяСтрока.ОснованиеВозникновенияЗадолженностиДата  = Задолженность.ОснованиеВозникновенияЗадолженностиДата;
		КонецЕсли;
		
		НоваяСтрока.Счет = Задолженность.СчетСписания;
		НоваяСтрока.СчетСписания = Задолженность.Счет;
		
		НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'восстановить сомнительную задолженность'");
		
		НоваяСтрока.ОстатокСумма    = Задолженность.СписатьСумма;
		НоваяСтрока.СписатьСумма    = Задолженность.СписатьСумма;
		НоваяСтрока.ОстатокСуммаВал = Задолженность.СписатьСуммаВал;
		НоваяСтрока.СписатьСуммаВал = Задолженность.СписатьСуммаВал;
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьНаОснованииИнвентаризационнойОписиРасчетовПоПоступлениям(Объект, ДокументОснование, ВидОперации, НомераСтрок = Неопределено, ВидСуммы = "") Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДебиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	ДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ДебиторскаяЗадолженность.Договор КАК Договор,
	|	ДебиторскаяЗадолженность.Счет КАК Счет,
	|	ДебиторскаяЗадолженность.Счет.Забалансовый КАК СчетЗабалансовый,
	|	ДебиторскаяЗадолженность.Счет.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	ДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ДебиторскаяЗадолженность.КПС КАК КПС,
	|	ДебиторскаяЗадолженность.КЭК КАК КЭК,
	|	ДебиторскаяЗадолженность.КФО КАК КФО,
	|	ДебиторскаяЗадолженность.ИФО КАК ИФО,
	|	ДебиторскаяЗадолженность.Валюта КАК Валюта,
	|	ДебиторскаяЗадолженность.СуммаВал КАК СуммаВал,
	|	ДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ДебиторскаяЗадолженность.СуммаРубСомнительная КАК СуммаРубСомнительная,
	|	ДебиторскаяЗадолженность.СуммаРубБезнадежная КАК СуммаРубБезнадежная,
	|	ДебиторскаяЗадолженность.СуммаВалСомнительная КАК СуммаВалСомнительная,
	|	ДебиторскаяЗадолженность.СуммаВалБезнадежная КАК СуммаВалБезнадежная,
	|	ДебиторскаяЗадолженность.ДатаВозникновения КАК ДатаВозникновения,
	|	ДебиторскаяЗадолженность.ДатаИсполнения КАК ДатаИсполнения
	|ПОМЕСТИТЬ СтрокиИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьРасчетовПоПоступлениям.Раздел21 КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	И &УсловиеПоНомерамСтрок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.ДокументОснование.Организация КАК Организация,
	|	СтрокиИнвентаризации.ДокументОснование.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.ИФО КАК ИФО
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиИнвентаризации.ДокументОснование КАК ДокументОснование,
	|	СтрокиИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент,
	|	СтрокиИнвентаризации.Договор КАК Договор,
	|	СтрокиИнвентаризации.Договор.ВидОбязательства КАК ДоговорВидОбязательства,
	|	СтрокиИнвентаризации.Договор.НомерДоговора КАК ДоговорНомерДоговора,
	|	СтрокиИнвентаризации.Договор.ДатаДоговора КАК ДоговорДатаДоговора,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.СчетЗабалансовый КАК СчетЗабалансовый,
	|	СтрокиИнвентаризации.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	СтрокиИнвентаризации.Подразделение КАК Подразделение,
	|	СтрокиИнвентаризации.КПС КАК КПС,
	|	СтрокиИнвентаризации.КЭК КАК КЭК,
	|	СтрокиИнвентаризации.КФО КАК КФО,
	|	СтрокиИнвентаризации.ИФО КАК ИФО,
	|	СтрокиИнвентаризации.Валюта КАК Валюта,
	|	СтрокиИнвентаризации.СуммаВал КАК СуммаВал,
	|	СтрокиИнвентаризации.СуммаРуб КАК СуммаРуб,
	|	СтрокиИнвентаризации.СуммаВалСомнительная КАК СуммаВалСомнительная,
	|	СтрокиИнвентаризации.СуммаРубСомнительная КАК СуммаРубСомнительная,
	|	СтрокиИнвентаризации.СуммаВалБезнадежная КАК СуммаВалБезнадежная,
	|	СтрокиИнвентаризации.СуммаРубБезнадежная КАК СуммаРубБезнадежная,
	|	СтрокиИнвентаризации.ДатаВозникновения КАК ДатаВозникновения,
	|	СтрокиИнвентаризации.ДатаИсполнения КАК ДатаИсполнения
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если НомераСтрок <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНомерамСтрок", "ДебиторскаяЗадолженность.НомерСтроки В(&НомераСтрок)");
		Запрос.УстановитьПараметр("НомераСтрок", НомераСтрок);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Шапка", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Контрагенты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Задолженность", НомераТаблиц.Количество());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	СчетаЗадолженностиПоДоходам = "205.00,207.00,209.00,210.05";
	
	// Реквизиты шапки.
	Шапка = Результат[НомераТаблиц.Шапка].Выбрать();
	Если Шапка.Следующий() Тогда
		
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Организация = Шапка.Организация;
		Если ИспользоватьУчетПоИФО Тогда
			Объект.ИФО = Шапка.ИФО;
		КонецЕсли;
		
		Объект.ВидОперации = ВидОперации;
		
	КонецЕсли;
	
	// Список контрагентов.
	Контрагенты = Результат[НомераТаблиц.Контрагенты].Выбрать();
	Пока Контрагенты.Следующий() Цикл
		НоваяСтрока = Объект.СписокКонтрагентов.Добавить();
		НоваяСтрока.Контрагент = Контрагенты.Контрагент;
		НоваяСтрока.ИдентификаторПлательщика = БухгалтерскийУчет.ИдентификаторКонтрагента(НоваяСтрока.Контрагент, Объект.ВидДокументаФизЛиц);
	КонецЦикла;
	
	// Задолженность.
	Задолженность = Результат[НомераТаблиц.Задолженность].Выбрать();
	Пока Задолженность.Следующий() Цикл
		
		НоваяСтрока = Объект.Задолженность.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки задолженности.
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Задолженность, "Контрагент,Договор,Счет,ИФО,КФО,КПС");
		
		НоваяСтрока.ОснованиеВозникновенияЗадолженности      = Задолженность.ДоговорВидОбязательства;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиНомер = Задолженность.ДоговорНомерДоговора;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиДата  = Задолженность.ДоговорДатаДоговора;
		
		Если Задолженность.УчетПоПодразделениям Тогда
			НоваяСтрока.Подразделение = Задолженность.Подразделение;
		КонецЕсли;
		
		Если Задолженность.СчетЗабалансовый Тогда
			НоваяСтрока.КЭК = Задолженность.КЭК;
		Иначе
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(Задолженность.Счет);
		КонецЕсли;
		
		НоваяСтрока.ДатаОбразованияЗадолженности = Задолженность.ДатаВозникновения;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.СчетПоКоду("04", Объект.Дата, Объект.Организация);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность сомнительной'");
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
				СчетаЗадолженностиПоДоходам, Ложь, Объект.Дата, Объект.Организация, Объект.ИФО);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'восстановить сомнительную задолженность'");
			
		Иначе // СписаниеБезнадежнойКВзысканиюЗадолженности
			
			НоваяСтрока.СчетСписания = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность безнадежной к взысканию'");
			
		КонецЕсли;
		
		НоваяСтрока.Валюта          = Задолженность.Валюта;
		НоваяСтрока.ОстатокСумма    = Задолженность.СуммаРуб;
		НоваяСтрока.ОстатокСуммаВал = Задолженность.СуммаВал;
		
		НоваяСтрока.СписатьСумма    = Задолженность["СуммаРуб" + ВидСуммы];
		НоваяСтрока.СписатьСуммаВал = Задолженность["СуммаВал" + ВидСуммы];
		
	КонецЦикла;
	
КонецФункции

Функция ЗаполнитьНаОснованииИнвентаризационнойОписиРасчетовСКонтрагентами(Объект, ДокументОснование, ВидОперации, НомераСтрок = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",  ДокументОснование);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДебиторскаяЗадолженность.Ссылка КАК ДокументОснование,
	|	ДебиторскаяЗадолженность.НомерСтроки КАК НомерСтроки,
	|	ДебиторскаяЗадолженность.Контрагент КАК Контрагент,
	|	ДебиторскаяЗадолженность.Договор КАК Договор,
	|	ДебиторскаяЗадолженность.Счет КАК Счет,
	|	ДебиторскаяЗадолженность.Счет.Забалансовый КАК СчетЗабалансовый,
	|	ДебиторскаяЗадолженность.Счет.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	ДебиторскаяЗадолженность.Подразделение КАК Подразделение,
	|	ДебиторскаяЗадолженность.КПС КАК КПС,
	|	ДебиторскаяЗадолженность.КЭК КАК КЭК,
	|	ДебиторскаяЗадолженность.КФО КАК КФО,
	|	ДебиторскаяЗадолженность.ИФО КАК ИФО,
	|	ДебиторскаяЗадолженность.Валюта КАК Валюта,
	|	ДебиторскаяЗадолженность.СуммаВал КАК СуммаВал,
	|	ДебиторскаяЗадолженность.СуммаРуб КАК СуммаРуб,
	|	ДебиторскаяЗадолженность.ДатаВозникновения КАК ДатаВозникновения,
	|	ДебиторскаяЗадолженность.ДатаИсполнения КАК ДатаИсполнения
	|ПОМЕСТИТЬ СтрокиИнвентаризации
	|ИЗ
	|	Документ.ИнвентаризационнаяОписьРасчетовСКонтрагентами.Раздел21 КАК ДебиторскаяЗадолженность
	|ГДЕ
	|	ДебиторскаяЗадолженность.Ссылка = &Ссылка
	|	И &УсловиеПоНомерамСтрок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.ДокументОснование.Организация КАК Организация,
	|	СтрокиИнвентаризации.ДокументОснование.ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.ИФО КАК ИФО
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиИнвентаризации.ДокументОснование КАК ДокументОснование,
	|	СтрокиИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	СтрокиИнвентаризации.Контрагент КАК Контрагент,
	|	СтрокиИнвентаризации.Договор КАК Договор,
	|	СтрокиИнвентаризации.Договор.ВидОбязательства КАК ДоговорВидОбязательства,
	|	СтрокиИнвентаризации.Договор.НомерДоговора КАК ДоговорНомерДоговора,
	|	СтрокиИнвентаризации.Договор.ДатаДоговора КАК ДоговорДатаДоговора,
	|	СтрокиИнвентаризации.Счет КАК Счет,
	|	СтрокиИнвентаризации.СчетЗабалансовый КАК СчетЗабалансовый,
	|	СтрокиИнвентаризации.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	СтрокиИнвентаризации.Подразделение КАК Подразделение,
	|	СтрокиИнвентаризации.КПС КАК КПС,
	|	СтрокиИнвентаризации.КЭК КАК КЭК,
	|	СтрокиИнвентаризации.КФО КАК КФО,
	|	СтрокиИнвентаризации.ИФО КАК ИФО,
	|	СтрокиИнвентаризации.Валюта КАК Валюта,
	|	СтрокиИнвентаризации.СуммаВал КАК СуммаВал,
	|	СтрокиИнвентаризации.СуммаРуб КАК СуммаРуб,
	|	СтрокиИнвентаризации.ДатаВозникновения КАК ДатаВозникновения,
	|	СтрокиИнвентаризации.ДатаИсполнения КАК ДатаИсполнения
	|ИЗ
	|	СтрокиИнвентаризации КАК СтрокиИнвентаризации
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Если НомераСтрок <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоНомерамСтрок", "ДебиторскаяЗадолженность.НомерСтроки В(&НомераСтрок)");
		Запрос.УстановитьПараметр("НомераСтрок", НомераСтрок);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ДебиторскаяЗадолженность", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Шапка", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Контрагенты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Задолженность", НомераТаблиц.Количество());
	
	Результат = Запрос.ВыполнитьПакет();
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	СчетаЗадолженностиПоДоходам = "205.00,207.00,209.00,210.05";
	
	// Реквизиты шапки.
	Шапка = Результат[НомераТаблиц.Шапка].Выбрать();
	Если Шапка.Следующий() Тогда
		
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.Организация = Шапка.Организация;
		Если ИспользоватьУчетПоИФО Тогда
			Объект.ИФО = Шапка.ИФО;
		КонецЕсли;
		
		Объект.ВидОперации = ВидОперации;
		
	КонецЕсли;
	
	// Список контрагентов.
	Контрагенты = Результат[НомераТаблиц.Контрагенты].Выбрать();
	Пока Контрагенты.Следующий() Цикл
		НоваяСтрока = Объект.СписокКонтрагентов.Добавить();
		НоваяСтрока.Контрагент = Контрагенты.Контрагент;
		НоваяСтрока.ИдентификаторПлательщика = БухгалтерскийУчет.ИдентификаторКонтрагента(НоваяСтрока.Контрагент, Объект.ВидДокументаФизЛиц);
	КонецЦикла;
	
	// Задолженность.
	Задолженность = Результат[НомераТаблиц.Задолженность].Выбрать();
	Пока Задолженность.Следующий() Цикл
		
		НоваяСтрока = Объект.Задолженность.Добавить();
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор); // Новый GUID для каждой строки задолженности.
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Задолженность, "Контрагент,Договор,Счет,ИФО,КФО,КПС");
		
		НоваяСтрока.ОснованиеВозникновенияЗадолженности      = Задолженность.ДоговорВидОбязательства;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиНомер = Задолженность.ДоговорНомерДоговора;
		НоваяСтрока.ОснованиеВозникновенияЗадолженностиДата  = Задолженность.ДоговорДатаДоговора;
		
		Если Задолженность.УчетПоПодразделениям Тогда
			НоваяСтрока.Подразделение = Задолженность.Подразделение;
		КонецЕсли;
		
		Если Задолженность.СчетЗабалансовый Тогда
			НоваяСтрока.КЭК = Задолженность.КЭК;
		Иначе
			НоваяСтрока.КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(Задолженность.Счет);
		КонецЕсли;
		
		НоваяСтрока.ДатаОбразованияЗадолженности = Задолженность.ДатаВозникновения;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.СписаниеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.СчетПоКоду("04", Объект.Дата, Объект.Организация);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность сомнительной'");
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийСписанияЗадолженностиПоДоходам.ВосстановлениеСомнительнойЗадолженности Тогда
			
			НоваяСтрока.СчетСписания = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(НоваяСтрока.КЭК,
				СчетаЗадолженностиПоДоходам, Ложь, Объект.Дата, Объект.Организация, Объект.ИФО);
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'восстановить сомнительную задолженность'");
			
		Иначе // СписаниеБезнадежнойКВзысканиюЗадолженности
			
			НоваяСтрока.СчетСписания = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			НоваяСтрока.РезолюцияКомиссии = НСтр("ru = 'признать задолженность безнадежной к взысканию'");
			
		КонецЕсли;
		
		НоваяСтрока.Валюта          = Задолженность.Валюта;
		НоваяСтрока.ОстатокСумма    = Задолженность.СуммаРуб;
		НоваяСтрока.ОстатокСуммаВал = Задолженность.СуммаВал;
		
		НоваяСтрока.СписатьСумма    = Задолженность.СуммаРуб;
		НоваяСтрока.СписатьСуммаВал = Задолженность.СуммаВал;
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли


