&НаКлиенте
Перем ТекстЗаголовкаСообщений;

&НаКлиенте
Перем СчетГруппаПрежнееЗначение;

// Структура с необходимыми полями строки, которая была отредактирована в таблице.
// Содержит значения полей на момент начала редактирования.
// Используется для расчета дельт излишка и недостачи, для отмены редактирования.
&НаКлиенте
Перем РедактируемаяСтрока;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.Подвал);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекстЗаголовкаСообщений = НСтр("ru='Инвентаризация материалов'");

	СчетГруппаЗапомнитьТекущееЗначение();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	//
	// Обновляем выводимое на форме количество документов, введенных на основании данного документа.
	//
	ЗаписанДокументНаОсновании = (Источник = Неопределено И (ТипЗнч(Параметр) = Тип("ДокументСсылка.АктСписанияМЗ") ИЛИ ТипЗнч(Параметр) = Тип("ДокументСсылка.ПоступлениеМЗ")));
	Если ЗаписанДокументНаОсновании Тогда
		ОпределитьКоличествоДокументовВведенныхНаОсновании();
	КонецЕсли;
	
	//
	// Изменили список счетов для текущей организации
	//
	ОбновленСписокСчетов = (ИмяСобытия = "ЗаписанСписокДополнительныхГруппСчетовУчета" И Параметр = Объект["Организация"]);
	Если ОбновленСписокСчетов Тогда
		НастроитьФормуПоВыбраннойГруппеСчетов(, Истина);
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ИнициализироватьФорму();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	Документы.ИнвентаризацияМЗ.ОбновитьРеальныеДополнительныеСубконто(ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииКлиент();
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетГруппаПриИзменении(Элемент)
	
	Если НЕ СчетГруппаЗначениеИзменено() Тогда
		Возврат;
	КонецЕсли;
	
	ЕстьЗаполненныеТЧ = (Объект["Материалы"].Количество() > 0
		ИЛИ	Объект["Недостачи"].Количество() > 0
		ИЛИ	Объект["Излишки"].Количество() > 0);
		
	Если ЕстьЗаполненныеТЧ Тогда
		ТекстСообщения = НСтр("ru='Изменение группы счетов учета вызовет очистку
			|табличных частей Материалы, Недостачи и Излишки.
			|
			|Продолжить и сменить группу счетов?'");
			
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("СчетГруппаПриИзменении_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 40, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	Иначе
		СчетГруппаПриИзменении_ЗавершитьОбработку();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СчетГруппаПриИзменении_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		СчетГруппаПриИзменении_ЗавершитьОбработку();
	Иначе
		СчетГруппаВосстановитьПрежнееЗначение();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СчетГруппаПриИзменении_ЗавершитьОбработку(ИзмененаГруппаСчетов = Истина)
	
	СчетГруппаЗапомнитьТекущееЗначение();
	
	НастроитьФормуПоВыбраннойГруппеСчетов(ИзмененаГруппаСчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Счет) Тогда
		Объект["Счет"] = Объект["СчетГруппа"];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитСсылка_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура БезУчетаИФОПриИзменении(Элемент)
	
	//---
	// Флажок <без ограничения>
	//---
	ОбщегоНазначенияБГУКлиентСервер.ФлажокБезОграничения_РеквизитФлажок_ПриИзменении(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВсегоДокументовНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОснованиеСсылка",	Объект["Ссылка"]);
	
	ОткрытьФорму("ОбщаяФорма.СписокДокументовВведенныхНаОсновании", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияОписиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущееЗначениеВарианта = Объект["ВариантФормированияОписи"];
	
	НовоеЗначениеВарианта = ВыбранноеЗначение;
	
	БудутОчищеныКолонки = ИнвентаризацияКлиент.Редактирование0504087_БудутОчищеныКолонкиПриИзмененииВариантаФормированияОписи(
		ТекущееЗначениеВарианта,
		НовоеЗначениеВарианта);
	
	Если БудутОчищеныКолонки И Объект.Материалы.Количество() > 0 Тогда
		
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("НовоеЗначениеВарианта", НовоеЗначениеВарианта);
		
		ТекстСообщения = НСтр("ru='Изменение варианта формирования описи вызовет очистку
			|некоторых колонок таблицы Материалы.
			|
			|Продолжить и сменить вариант формирования описи?'");
		ОписаниеОповещенияОтвет = Новый ОписаниеОповещения("ВариантФормированияОписиОбработкаВыбора_Ответ", ЭтотОбъект, ПараметрыОповещения);
		ПоказатьВопрос(ОписаниеОповещенияОтвет, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ВариантФормированияОписи0504087_ИзменитьВариант(НовоеЗначениеВарианта);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантФормированияОписиОбработкаВыбора_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		НовоеЗначениеВарианта = ПараметрыОповещения["НовоеЗначениеВарианта"];
		
		ВариантФормированияОписи0504087_ИзменитьВариант(НовоеЗначениеВарианта);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ДатаИнвентаризацииПриИзменении(Элемент)
	
	// Необходимый код следует размещать в следующих процедурах:
	//	- ДатаИнвентаризацииПриИзменении_ПодтвержденоИзменениеСоставаГруппСчетов
	//	- ДатаИнвентаризацииПриИзменении_ИзменениеСоставаГруппСчетовНеТребуется
	
	// Эти процедуры вызываются далее автоматически, после анализа данных и ответа пользователя.
	
	ИнвентаризацияКлиент.ДатаИнвентаризацииПриИзменении_ПроверитьНеобходимостьИзмененияСоставаГруппСчетов(ЭтаФорма);
	
КонецПроцедуры

// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура РешениеОПроведенииИнвентаризацииПриИзменении(Элемент)
	
	ИнвентаризацияКлиент.ВыбраноРешениеОПроведенииИнвентаризации(ЭтаФорма);
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Материалы

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы["Материалы"].ТекущиеДанные;
	
	// При копировании очищаем поля, заполняемые по данным учета:
	Если Копирование Тогда
		ОчищающаяСтруктура = Новый Структура("
			|КоличествоУчет,
			|СуммаУчет,
			|НедостачаКоличество,
			|НедостачаСумма,
			|ИзлишекКоличество,
			|ИзлишекСумма");
		ЗаполнитьЗначенияСвойств(ТекДанные, ОчищающаяСтруктура);
	КонецЕсли;
	
	// Запоминаем значения полей строки в начале ее редактирования:
	РедактируемаяСтрока = Новый Структура("Субконто3, Номенклатура, Цена, КоличествоФакт, СуммаФакт,
		|КоличествоУчет,
		|СуммаУчет,
		|НедостачаКоличество,
		|НедостачаСумма,
		|ИзлишекКоличество,
		|ИзлишекСумма");
	ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы["Материалы"].ТекущиеДанные;
	
	Если ОтменаРедактирования Тогда
		
		Если НЕ НоваяСтрока Тогда
			// Восстанавливаем значение всех полей строки,
			// которые были запомнены в момент начала ее редактирования:
			ЗаполнитьЗначенияСвойств(ТекДанные, РедактируемаяСтрока);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	РассчитатьНедостачуИзлишек(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы["Материалы"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Прослеживаемость
	ТекДанные.ПрослеживаемыйТовар = Ложь;
	// Конец Прослеживаемость
	
	Номенклатура = ТекДанные["Номенклатура"];
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваНоменклатуры = ПолучитьСвойстваНоменклатурыСервер(Объект.Организация, Номенклатура, Объект.ТипЦен, Объект.ДатаИнвентаризации);
	
	ЗаполнитьЗначенияСвойств(ТекДанные, СвойстваНоменклатуры);
	
	Если ЗначениеЗаполнено(Объект.ТипЦен) Тогда
		РассчитатьЦенуСумму(ТекДанные, Элементы.МатериалыЦена);
		
		РассчитатьНедостачуИзлишек(ТекДанные);
	КонецЕсли;
	
	// Прослеживаемость
	ВозможноИзменениеВидимостиКолонкиПрослеживаемыйТовар = (СвойстваНоменклатуры.ПрослеживаемыйТовар <> ЕстьПрослеживаемыеТовары);
	Если ВозможноИзменениеВидимостиКолонкиПрослеживаемыйТовар Тогда
		НастроитьФормуПрослеживаемостьСервер();
	КонецЕсли;
	// Конец Прослеживаемость
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	РассчитатьЦенуСумму(ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоФактПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	РассчитатьЦенуСумму(ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСуммаФактПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	
	РассчитатьЦенуСумму(ТекущиеДанные, Элемент);
	
КонецПроцедуры


&НаКлиенте
Процедура МатериалыСтатусОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.ВыбратьИУстановитьСтатусОбъектаДляИнвентаризации(ЭтаФорма, Элементы.Материалы.ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦелеваяФункцияАктиваНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьФорму("Справочник.ЦелевыеФункцииАктивовДляИнвентаризации.ФормаВыбора",,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Недостачи

&НаКлиенте
Процедура НедостачиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы["Недостачи"].ТекущиеДанные;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, ЭтаФорма["ЗначенияАвтоподстановки"]);
	КонецЕсли;
	
	// Запоминаем значения полей строки в начале ее редактирования:
	РедактируемаяСтрока = Новый Структура("Субконто3, Номенклатура, ИФО, КФО, КПС, Счет, ЦМО,
		|Количество, Цена, Сумма");
	ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы["Недостачи"].ТекущиеДанные;
	
	Если ОтменаРедактирования Тогда
		
		Если НЕ НоваяСтрока Тогда
			// Восстанавливаем значение всех полей строки,
			// которые были запомнены в момент начала ее редактирования:
			ЗаполнитьЗначенияСвойств(ТекДанные, РедактируемаяСтрока);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачиНоменклатураПриИзменении(Элемент)
	
	УстановитьСчетВТекущейСтрокеПоНоменклатуре(Истина); // ЭтоНедостача
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачиСчетПриИзменении(Элемент)
	
	УстановитьРеальноеДополнительноеСубконтоВТекущейСтроке(Элементы["Недостачи"].ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Излишки

&НаКлиенте
Процедура ИзлишкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы["Излишки"].ТекущиеДанные;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ЗаполнитьЗначенияСвойств(ТекДанные, ЭтаФорма["ЗначенияАвтоподстановки"]);
	КонецЕсли;
	
	// Запоминаем значения полей строки в начале ее редактирования:
	РедактируемаяСтрока = Новый Структура("Субконто3, Номенклатура, ИФО, КФО, КПС, Счет, ЦМО,
		|Количество, Цена, Сумма");
	ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекДанные = Элементы["Излишки"].ТекущиеДанные;
	
	Если ОтменаРедактирования Тогда
		
		Если НЕ НоваяСтрока Тогда
			// Восстанавливаем значение всех полей строки,
			// которые были запомнены в момент начала ее редактирования:
			ЗаполнитьЗначенияСвойств(ТекДанные, РедактируемаяСтрока);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Излишки.ТекущиеДанные;
	
	РассчитатьЦенуСумму(ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Излишки.ТекущиеДанные;
	
	РассчитатьЦенуСумму(ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Излишки.ТекущиеДанные;
	
	РассчитатьЦенуСумму(ТекущиеДанные, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиНоменклатураПриИзменении(Элемент)
	
	УстановитьСчетВТекущейСтрокеПоНоменклатуре(Ложь); // ЭтоНедостача
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиСчетПриИзменении(Элемент)
	
	УстановитьРеальноеДополнительноеСубконтоВТекущейСтроке(Элементы["Излишки"].ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПорядокСписанияНедостач

&НаКлиенте
Процедура ПорядокСписанияНедостачПриИзменении(Элемент)
	ИзмененПорядокСписанияНедостач = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСписанияНедостачПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПорядокСписанияНедостачПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьСписокСчетов(Команда)
	
	Если ЗначениеЗаполнено(Объект["Организация"]) Тогда
		ПараметрыФормы = Новый Структура("Организация, ИФО, СчетГруппа");
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, Объект);
		
		ПараметрыФормы.Вставить("Дата", Объект.ДатаИнвентаризации);
		
		ОткрытьФорму("РегистрСведений.ДополнительныеГруппыСчетовИнвентаризацииМЗ.Форма.НастройкаСпискаСчетов", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено. Список счетов редактируется только для конкретной организации, поэтому сначала выберите ее.'");
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
		
	КонецЕсли;
	
КонецПроцедуры

// Страница "Материалы"

&НаКлиенте
Процедура ЗаполнитьПоДаннымУчета(Команда)
	
	ПроверитьИЗаполнитьПоДаннымУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактическоеНаличие(Команда)
	
	ПроверитьИЗаполнитьФактическоеНаличие();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеМатериалы(Команда)
	
	ИнвентаризацияКлиент.ОткрытьФормуГрупповогоЗаполненияСтрок(ЭтаФорма, "Материалы");
	
КонецПроцедуры

// Страница "Недостачи"

&НаКлиенте
Процедура ЗаполнитьНедостачи(Команда)
	
	ПроверитьИЗаполнитьНедостачи();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеНедостачи(Команда)
	
	ИнвентаризацияКлиент.ОткрытьФормуГрупповогоЗаполненияСтрок(ЭтаФорма, "Недостачи");
	
КонецПроцедуры

// Страница "Излишки"

&НаКлиенте
Процедура ЗаполнитьИзлишки(Команда)
	
	ПроверитьИЗаполнитьИзлишки();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеЗаполнениеИзлишки(Команда)
	
	ИнвентаризацияКлиент.ОткрытьФормуГрупповогоЗаполненияСтрок(ЭтаФорма, "Излишки");
	
КонецПроцедуры

// Страница "Инвентаризация"

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",	Объект["ДатаНачала"]);
	СтруктураПараметров.Вставить("КонецПериода",	Объект["ДатаОкончания"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["ДатаНачала"]	= РезультатВыбора["НачалоПериода"];
		Объект["ДатаОкончания"]	= РезультатВыбора["КонецПериода"];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКомиссию(Команда)
	
	ИнвентаризацияКлиент.ОткрытьВыборКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИнвентаризацияКлиент.ОткрытьВыборПредседателяКомиссии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ИнвентаризацияКлиент.ОткрытьПодборКомиссии(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ПараметрыФормы = ИнвентаризацияКлиент.ПараметрыФормыРазбивкиСтрокиИнвентаризацииНфа();
	
	ПараметрыФормы.ИмяТабличнойЧасти = "Материалы";
	ПараметрыФормы.ТочностьКоличества = 3;
	
	ПараметрыФормы.СоответствиеИмен.КоличествоФакт	= "КоличествоФакт";
	ПараметрыФормы.СоответствиеИмен.СуммаФакт		= "СуммаФакт";
	ПараметрыФормы.СоответствиеИмен.КоличествоУчет	= "КоличествоУчет";
	ПараметрыФормы.СоответствиеИмен.СуммаУчет		= "СуммаУчет";
	
	ИнвентаризацияКлиент.ОткрытьФормуРазбивкиСтрокиИнвентаризацииНфа(ЭтаФорма, Элементы.Материалы.ТекущиеДанные, ПараметрыФормы);
	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПрослеживаемыеТоварыПоДаннымУчета(Команда)
	
	ПроверитьИЗаполнитьПрослеживаемыеТовары(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПрослеживаемыеТоварыПоИзлишкам(Команда)
	
	ПроверитьИЗаполнитьПрослеживаемыеТовары(Истина);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

// РешениеОПроведенииИнвентаризации
&НаКлиенте
Процедура ЗакрытаФормаВыбораДанныхИзРешенияОПроведенииИнвентаризации(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора);
	
	ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОписьПоРешениюОПроведенииИнвентаризацииСервер(РезультатВыбора)
	
	ИнвентаризацияСервер.ЗаполнитьОписьПоРешениюИзФормыОписи(ЭтотОбъект, РезультатВыбора);
	
	Объект.Субконто3 = Неопределено;
	
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаполненияОписиПоРешениюОПроведенииИнвентаризацииКлиент(РезультатВыбора)
	
	СчетГруппаПриИзменении_ЗавершитьОбработку(Ложь);
	
	ИнвентаризацияКлиент.СообщитьОЗаполненииНаОснованииРешенияОПроведенииИнвентаризации();
	
КонецПроцедуры
// Конец РешениеОПроведенииИнвентаризации

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ИнициализироватьФорму();
	
	Если Объект.Ссылка.Пустая() Тогда
		
		// Этот документ создан копированием?
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			// Это копия существующего документа
			
			// Очищаем некоторые реквизиты
			Объект["Материалы"].Очистить();
			Объект["Недостачи"].Очистить();
			Объект["Излишки"].Очистить();
			Объект["Остатки"].Очистить();
			Объект["ПорядокСписания"].Очистить();
			
			// Выводим сообщение:
			ТекстСообщения = НСтр("ru='Этот документ был создан путем копирования другого документа. Поэтому некоторые табличные части и реквизиты копии были очищены.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
	НастроитьФормуПоВыбраннойГруппеСчетов();
	
	НастроитьВидимостьКолонокТаблицыПорядокСписанияНедостач();
	
	ОпределитьКоличествоДокументовВведенныхНаОсновании();
	
	
	ИгнорироватьРеквизитКПС = НЕ НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["СвойстваДопустимыхСчетов"]["УчетПоКПС"];
	
	ИнвентаризацияСервер.ВариантФормированияОписи0504087_ИнициализироватьФорму(ЭтаФорма, ИгнорироватьРеквизитКПС);
	
	ОбновитьКэшДатаИнвентаризации(ЭтаФорма);
	
	ДатыИзмененияСоставаГруппСчетов = Документы.ИнвентаризацияМЗ.ПолучитьДатыИзмененияСоставаГруппСчетов();
	
	//---
	// Флажок <без ограничения>
	//---
	НастройкиМеханизма = Документы.ИнвентаризацияМЗ.ФлажокБезОграничения_ПолучитьНастройкиМеханизма();
	ОбщегоНазначенияБГУ.ФлажокБезОграничения_ИнициализироватьФорму(ЭтаФорма, НастройкиМеханизма);
	
	// Если нет прав на изменение документа, то дополнительно отключаем еще элементы:
	ОбщегоНазначенияБГУ.УстановитьНедоступныеЭлементыФормы(Элементы, Объект,
		// Кнопки (6)
		"МатериалыЗаполнитьПоДаннымУчета, МатериалыЗаполнитьФактическоеНаличие,"
		+ "НедостачиЗаполнитьНедостачи,"
		+ "ИзлишкиЗаполнитьИзлишки,"
		
		// Инвентаризационная комиссия
		+ "УстановитьПериод, КомандаВыбратьКомиссию, ВыбратьПредседателяКомиссии, СоставКомиссииПодобратьСотрудников"
		);
		
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//
	// 1. Недостачи - недоступно Субконто3 при пустом Счете
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Недостачи - недоступно Субконто3 при пустом Счете";
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Недостачи.НомерРеальногоДополнительногоСубконто");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НедостачиСубконто3");
	
	//
	// 2. Излишки - недоступно Субконто3 при пустом Счете
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Излишки - недоступно Субконто3 при пустом Счете";
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Излишки.НомерРеальногоДополнительногоСубконто");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИзлишкиСубконто3");
	
	//
	// 3. Недостачи - текст <...> в пустом поле Субконто3, если оно может быть
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Недостачи - текст <...> в пустом поле Субконто3, если оно может быть";
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Недостачи.НомерРеальногоДополнительногоСубконто");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Условие.ПравоеЗначение = Истина;
	
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Недостачи.Субконто3");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",	ЦветаСтиля.НедоступныеДанныеЦвет);
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",		"<...>");
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НедостачиСубконто3");
	
	//
	// 4. Излишки - текст <...> в пустом поле Субконто3, если оно может быть
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Излишки - текст <...> в пустом поле Субконто3, если оно может быть";
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Излишки.НомерРеальногоДополнительногоСубконто");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Условие.ПравоеЗначение = Истина;
	
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Излишки.Субконто3");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",	ЦветаСтиля.НедоступныеДанныеЦвет);
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",		"<...>");
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ИзлишкиСубконто3");
	
	//
	// 5. Материалы - поля Цена и СуммаФакт являются балансовыми и не редактируются
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Материалы - поля Цена и СуммаФакт являются балансовыми при недостаче, и не редактируются";
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.КоличествоУчет");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	Условие.ПравоеЗначение = 0;
	
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.КоличествоФакт");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
	Условие.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.КоличествоУчет");
	
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВариантФормированияОписи");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 0; // 0. Опись до 2018 г. Счет в шапке
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",	Истина);
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста",	ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МатериалыЦена");
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МатериалыСуммаФакт");
	
	//
	// 6. Материалы - надпись "кол-во"
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Материалы - надпись ""кол-во""";
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Ложь;
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='кол-во'"));
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МатериалыПолеНадписьКоличество");
	
	//
	// 7. Материалы - надпись "сумма"
	//
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = "Материалы - надпись ""сумма""";
	
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Ложь;
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='сумма'"));
	
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("МатериалыПолеНадписьСумма");
	
	ИнвентаризацияСервер.ДобавитьУсловноеОформлениеКолонкаЕдИзм(ЭтаФорма, "Материалы", "Материалы", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	
	ТекстСообщения = НСтр("ru='Изменение организации вызовет полную очистку
		|табличных частей документа.
		|
		|Продолжить и сменить организацию?'");
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОрганизацияПередИзменениемКлиент_Ответ", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		Объект["Организация"] = ПараметрыОповещения["ВыбранноеЗначение"];
		ЭтаФорма.Модифицированность = Истина;
		ОрганизацияПриИзмененииКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзмененииКлиент()
	
	НастроитьФормуСервер_ПриИзмененииОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_ПриИзмененииОрганизации()
	
	// Очищаем реквизиты документа:
	ОчищающаяСтруктура = Новый Структура("
		|ДолжностьПредседателяКомиссии,
		|ФамилияПредседателяКомиссии,
		|ИмяПредседателяКомиссии,
		|ОтчествоПредседателяКомиссии,
		|НомерПриказа,
		|ДатаПриказа,
		|МестоИнвентаризации");
	ЗаполнитьЗначенияСвойств(Объект, ОчищающаяСтруктура);
	
	// Очищаем все табличные части документа:
	Объект["Материалы"].Очистить();
	Объект["Излишки"].Очистить();
	Объект["Недостачи"].Очистить();
	Объект["Остатки"].Очистить();
	Объект["ПорядокСписания"].Очистить();
	Объект["СоставКомиссии"].Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьКоличествоДокументовВведенныхНаОсновании()
	
	// Общее количество документов
	КоличествоДокументов	= Документы.ИнвентаризацияМЗ.ПолучитьКоличествоДокументовВведенныхНаОсновании(Объект);
	КоличествоСписаний		= КоличествоДокументов["КоличествоСписаний"];
	КоличествоПоступлений	= КоличествоДокументов["КоличествоПоступлений"];
	
	// Надпись общее количество документов
	Элементы["НадписьВсегоДокументов"].Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='%1 шт.'"),
		КоличествоПоступлений + КоличествоСписаний);
	
	НовыйЗаголовокВсегоДокументовКон = "";
	
	//Если (КоличествоПоступлений + КоличествоСписаний) > 0 Тогда
	//	// Категории для русского языка:
	//	//	Ноль	(-);
	//	//	Один	(1 шт);
	//	//	Два		(-);
	//	//	Немного	(2 шт);
	//	//	Много	(5 шт);
	//	//	Другое	(-)
	//	
	//	// Надпись Х списаний
	//	НадписьСписания = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
	//		НСтр("ru=';%1 списание;;%1 списания;%1 списаний;'"),
	//		КоличествоСписаний);
	//	
	//	// Надпись У поступлений
	//	НадписьПоступления = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
	//		НСтр("ru=';%1 поступление;;%1 поступления;%1 поступлений;'"),
	//		КоличествоПоступлений);
	//	
	//	НовыйЗаголовокВсегоДокументовКон = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	//		НСтр("ru='(%1, %2)'"),
	//		НадписьСписания,
	//		НадписьПоступления);;
	//КонецЕсли;
	//
	//// Надпись количество документов списаний и поступлений
	//Элементы["НадписьВсегоДокументовКон"].Заголовок = НовыйЗаголовокВсегоДокументовКон;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКолонокТаблицыПорядокСписанияНедостач()
	
	ПризнакиИспользования = Документы.ИнвентаризацияМЗ.ПолучитьПризнакиИспользованияКолонокТаблицыПорядокСписания();
	
	ИмяЭлементаТаблица = "ПорядокСписанияНедостач";
	
	Для Каждого ПризнакИспользования Из ПризнакиИспользования Цикл
		ИмяЭлемента		= ИмяЭлементаТаблица + ПризнакИспользования.Ключ;
		НоваяВидимость	= ПризнакИспользования.Значение;
		
		Элементы[ИмяЭлемента].Видимость = ПризнакИспользования.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетВТекущейСтрокеПоНоменклатуре(ЭтоНедостача)
	
	// Входная проверка
	Если НЕ ЭтоНедостача = Истина Тогда
		ЭтоНедостача = Ложь;
	КонецЕсли;
		
	ТекДанные = Элементы[?(ЭтоНедостача, "Недостачи", "Излишки")].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетНоменклатуры = ПолучитьСчетНоменклатурыСервер(ТекДанные["Номенклатура"]);
	
	// Если счет номенклатуры находится в списке Допустимых счетов,
	// то принимаем его значение.
	СвойстваВыбраннойГруппыСчетов	= ЭтаФорма["НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов"];
	ДопустимыеСчета					= СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["ДопустимыеСчета"];
	
	СчетНоменклатурыДопустимый		= НЕ (ДопустимыеСчета.Найти(СчетНоменклатуры) = Неопределено);
	
	Если СчетНоменклатурыДопустимый Тогда
		ТекДанные["Счет"] = СчетНоменклатуры;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСчетНоменклатурыСервер(НоменклатураСсылка)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
		Результат = УправлениеМатериальнымиЗапасами.СчетУчетаСсылкаИзНоменклатуры(НоменклатураСсылка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СчетГруппаЗапомнитьТекущееЗначение()
	
	СчетГруппаПрежнееЗначение = Объект["СчетГруппа"];
	
КонецПроцедуры

&НаКлиенте
Процедура СчетГруппаВосстановитьПрежнееЗначение()
	
	Объект["СчетГруппа"] = СчетГруппаПрежнееЗначение;
	
КонецПроцедуры

&НаКлиенте
Функция СчетГруппаЗначениеИзменено()
	
	Возврат НЕ (Объект["СчетГруппа"] = СчетГруппаПрежнееЗначение);
	
КонецФункции

&НаСервере
Процедура НастроитьФормуПоВыбраннойГруппеСчетов(ИзмененаГруппаСчетов = Ложь, ИзмененСписокГруппСчетов = Ложь)
	
	Документы.ИнвентаризацияМЗ.ОбновитьИКэшироватьНастройкиГруппСчетов(ЭтаФорма);
	
	Документы.ИнвентаризацияМЗ.ОбновитьРеальныеДополнительныеСубконто(ЭтаФорма);
	
	СвойстваВыбраннойГруппыСчетов = ЭтаФорма["НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов"];
	
	НастроитьПоляОтбораПоВыбраннойГруппеСчетов(СвойстваВыбраннойГруппыСчетов, ИзмененаГруппаСчетов, ИзмененСписокГруппСчетов);
	
	НастроитьТабличныеЧастиПоВыбраннойГруппеСчетов(СвойстваВыбраннойГруппыСчетов);
	
	ДополнительноНастроитьФормуЕслиГруппаСчетовНеПоддерживается();
	
	НастроитьДоступностьЭлементов();
	
	НастроитьВидимостьКолонкиЕдИзм();
	
	// Обновляем данные при необходимости
	
	Если ИзмененаГруппаСчетов Тогда
		Объект["Материалы"].Очистить();
		Объект["Излишки"].Очистить();
		Объект["Недостачи"].Очистить();
		Объект["Остатки"].Очистить();
		Объект["ПорядокСписания"].Очистить();
	КонецЕсли;
	
	Если ИзмененаГруппаСчетов ИЛИ ИзмененСписокГруппСчетов Тогда
		ОчиститьНеподдерживаемоеЗначениеСубконтоДляМОЛ(СвойстваВыбраннойГруппыСчетов);
		
		ОчиститьНеподдерживаемоеЗначениеДополнительногоСубконто(СвойстваВыбраннойГруппыСчетов);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьКолонкиЕдИзм()
	
	НовВидимость = ИнвентаризацияСервер.УстанавливатьКоличествоПоУмолчанию(Объект);
	
	Элементы.МатериалыЕдИзм.Видимость = НовВидимость;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьПоляОтбораПоВыбраннойГруппеСчетов(СвойстваВыбраннойГруппыСчетов, ИзмененаГруппаСчетов, ИзмененСписокГруппСчетов)
	
	Перем	ИнициализацияФормыНовогоДокументаНеКопирование,
			ЗначениеКопирования;
	
	Если Параметры.Свойство("ЗначениеКопирования", ЗначениеКопирования) Тогда
		ИнициализацияФормыНовогоДокументаНеКопирование = (Объект.Ссылка.Пустая() И НЕ ЗначениеЗаполнено(ЗначениеКопирования));
	Иначе
		ИнициализацияФормыНовогоДокументаНеКопирование = Ложь;
	КонецЕсли;
	
	ОсновныеСвойства	= СвойстваВыбраннойГруппыСчетов["ОсновныеСвойства"];
	ДетальныеСвойства	= СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"];
	
	//
	// МОЛ
	//
	СвойстваСубконтоДляМОЛ	= ДетальныеСвойства["СвойстваСубконтоДляМОЛ"];
	ТипыЗначений			= СвойстваСубконтоДляМОЛ["ТипыЗначенийДляПоляОтбора"];
	Элементы["ЦМО"].ОграничениеТипа = Новый ОписаниеТипов(ТипыЗначений);
	
	//
	// Счет
	//
	НовыйПараметр = Новый ПараметрВыбора("ОграниченияСписокСчетов", ДетальныеСвойства["СчетаОтбора"]);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы["Счет"].ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
	
	УстановитьПолеСчет	= (ИзмененаГруппаСчетов ИЛИ ИзмененСписокГруппСчетов ИЛИ ИнициализацияФормыНовогоДокументаНеКопирование);
	
	Если УстановитьПолеСчет Тогда
		Объект["Счет"] = Объект["СчетГруппа"];
	КонецЕсли;
	
	//
	// КПС
	//
	УчетПоКПС = ДетальныеСвойства["СвойстваДопустимыхСчетов"]["УчетПоКПС"];
	Элементы["КПС"].Видимость = УчетПоКПС;
	
	УстановитьПолеКПС	= (ИзмененаГруппаСчетов ИЛИ ИзмененСписокГруппСчетов) И НЕ УчетПоКПС;
	
	Если УстановитьПолеКПС Тогда
		Объект["КПС"] = Неопределено;
	КонецЕсли;
	
	//
	// Дополнительное субконто
	//
	КорректностьНастроек						= ДетальныеСвойства["КорректностьНастроекДополнительногоСубконто"];
	ТипыЗначенийРеальныхДополнительныхСубконто	= ДетальныеСвойства["СвойстваДопустимыхСчетов"]["ТипыЗначенийРеальныхДополнительныхСубконто"];
	
	НоваяВидимость = КорректностьНастроек["СледуетИспользовать"];
	Элементы["Субконто3"].Видимость = НоваяВидимость;
	
	Если КорректностьНастроек["СледуетИспользовать"] Тогда
		Элементы["Субконто3"].Заголовок = ОсновныеСвойства["ЗаголовокДополнительногоСубконто"];
		
		Элементы["Субконто3"].ОграничениеТипа = Новый ОписаниеТипов(ТипыЗначенийРеальныхДополнительныхСубконто);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТабличныеЧастиПоВыбраннойГруппеСчетов(СвойстваВыбраннойГруппыСчетов)
	
	ОсновныеСвойства	= СвойстваВыбраннойГруппыСчетов["ОсновныеСвойства"];
	ДетальныеСвойства	= СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"];
	
	//
	// МОЛ
	//
	СвойстваСубконтоДляМОЛ	= ДетальныеСвойства["СвойстваСубконтоДляМОЛ"];
	ТипыЗначений			= СвойстваСубконтоДляМОЛ["ТипыЗначений"];
	НовоеЗначение			= СвойстваСубконтоДляМОЛ["Заголовок"];
	
	Элементы["НедостачиЦМО"].Заголовок					= НовоеЗначение;
	Элементы["ИзлишкиЦМО"].Заголовок					= НовоеЗначение;
	Элементы["ПорядокСписанияНедостачЦМО"].Заголовок	= НовоеЗначение;
	
	Элементы["НедостачиЦМО"].ОграничениеТипа				= Новый ОписаниеТипов(ТипыЗначений);
	Элементы["ИзлишкиЦМО"].ОграничениеТипа					= Новый ОписаниеТипов(ТипыЗначений);
	Элементы["ПорядокСписанияНедостачЦМО"].ОграничениеТипа	= Новый ОписаниеТипов(ТипыЗначений);
	
	//
	// КПС
	//
	НоваяВидимость = ДетальныеСвойства["СвойстваДопустимыхСчетов"]["УчетПоКПС"];
	Элементы["НедостачиКПС"].Видимость						= НоваяВидимость;
	Элементы["ИзлишкиКПС"].Видимость						= НоваяВидимость;
	Элементы["МатериалыКПС"].Видимость						= НоваяВидимость;
	
	//
	// Счет
	//
	НовыйПараметр = Новый ПараметрВыбора("ОграниченияСписокСчетов", ДетальныеСвойства["ДопустимыеСчета"]);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	Элементы["НедостачиСчет"].ПараметрыВыбора	= Новый ФиксированныйМассив(НовыйМассив);
	Элементы["ИзлишкиСчет"].ПараметрыВыбора		= Новый ФиксированныйМассив(НовыйМассив);
	Элементы["МатериалыСчет"].ПараметрыВыбора	= Новый ФиксированныйМассив(НовыйМассив);
	
	//
	// Дополнительное субконто
	//
	КорректностьНастроек						= ДетальныеСвойства["КорректностьНастроекДополнительногоСубконто"];
	ТипыЗначенийРеальныхДополнительныхСубконто	= ДетальныеСвойства["СвойстваДопустимыхСчетов"]["ТипыЗначенийРеальныхДополнительныхСубконто"];
	
	НоваяВидимость = КорректностьНастроек["СледуетИспользовать"];
	Элементы["МатериалыСубконто3"].Видимость	= НоваяВидимость;
	Элементы["НедостачиСубконто3"].Видимость	= НоваяВидимость;
	Элементы["ИзлишкиСубконто3"].Видимость		= НоваяВидимость;
	
	Если КорректностьНастроек["СледуетИспользовать"] Тогда
		НовоеЗначение = ОсновныеСвойства["ЗаголовокДополнительногоСубконто"];
		
		Элементы["МатериалыСубконто3"].Заголовок	= НовоеЗначение;
		Элементы["НедостачиСубконто3"].Заголовок	= НовоеЗначение;
		Элементы["ИзлишкиСубконто3"].Заголовок		= НовоеЗначение;
		
		Элементы["МатериалыСубконто3"].ОграничениеТипа	= Новый ОписаниеТипов(ТипыЗначенийРеальныхДополнительныхСубконто);
		Элементы["НедостачиСубконто3"].ОграничениеТипа	= Новый ОписаниеТипов(ТипыЗначенийРеальныхДополнительныхСубконто);
		Элементы["ИзлишкиСубконто3"].ОграничениеТипа	= Новый ОписаниеТипов(ТипыЗначенийРеальныхДополнительныхСубконто);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнительноНастроитьФормуЕслиГруппаСчетовНеПоддерживается()
	
	Если ГруппаСчетовПоддерживается Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Указанная группа счетов более не поддерживается документом.
		|Возможность редактирования документа частично отключена.'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		,
		"СчетГруппа",
		"Объект");
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДоступностьЭлементов()
	
	Если ПравоДоступаИзменение Тогда
		
		НовДоступностьТаблицы	= ЗначениеЗаполнено(Объект["Организация"]) И ГруппаСчетовПоддерживается;
		НовДоступностьКомиссия	= ЗначениеЗаполнено(Объект["Организация"]);
		
		// Отдельные элементы
		Элементы["СтраницаМатериалы"].ТолькоПросмотр	= НЕ НовДоступностьТаблицы;
		Элементы["СтраницаНедостачи"].ТолькоПросмотр	= НЕ НовДоступностьТаблицы;
		Элементы["СтраницаИзлишки"].ТолькоПросмотр		= НЕ НовДоступностьТаблицы;
		
		// Кнопки (6)
		Элементы["МатериалыЗаполнитьПоДаннымУчета"].Доступность			= НовДоступностьТаблицы;
		Элементы["МатериалыЗаполнитьФактическоеНаличие"].Доступность	= НовДоступностьТаблицы;
		Элементы["НедостачиЗаполнитьНедостачи"].Доступность				= НовДоступностьТаблицы;
		Элементы["ИзлишкиЗаполнитьИзлишки"].Доступность					= НовДоступностьТаблицы;
		
		// Инвентаризационная комиссия
		Элементы["СтраницаИнвентаризация"].ТолькоПросмотр			= НЕ НовДоступностьКомиссия;
		Элементы["УстановитьПериод"].Доступность					= НовДоступностьКомиссия;
		Элементы["КомандаВыбратьКомиссию"].Доступность				= НовДоступностьКомиссия;
		Элементы["ВыбратьПредседателяКомиссии"].Доступность			= НовДоступностьКомиссия;
		Элементы["СоставКомиссииПодобратьСотрудников"].Доступность	= НовДоступностьКомиссия;
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОчиститьНеподдерживаемоеЗначениеСубконтоДляМОЛ(СвойстваВыбраннойГруппыСчетов)
	
	ПроверяемоеЗначение = Объект["ЦМО"];
	
	ТипыЗначений = СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["СвойстваСубконтоДляМОЛ"]["ТипыЗначений"];
	
	Если ЗначениеЗаполнено(ПроверяемоеЗначение) Тогда
		// Оставляем текущее значение, если его тип по-прежнему является допустимым
		
		ТипЗначения = ТипЗнч(ПроверяемоеЗначение);
		
		ТипЗначенияДопустимый = НЕ (ТипыЗначений.Найти(ТипЗначения) = Неопределено);
		
		Если ТипЗначенияДопустимый Тогда
			НовоеЗначение = ПроверяемоеЗначение;
		Иначе
			НовоеЗначение = Неопределено;
		КонецЕсли;
		
	Иначе
		// Очищаем значение
		
		НовоеЗначение = Неопределено;
	КонецЕсли;
	
	Если НЕ ПроверяемоеЗначение = НовоеЗначение Тогда
		ПроверяемоеЗначение = НовоеЗначение;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНеподдерживаемоеЗначениеДополнительногоСубконто(СвойстваВыбраннойГруппыСчетов)
	
	КорректностьНастроек						= СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["КорректностьНастроекДополнительногоСубконто"];
	ТипыЗначенийРеальныхДополнительныхСубконто	= СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["СвойстваДопустимыхСчетов"]["ТипыЗначенийРеальныхДополнительныхСубконто"];
	
	ТекущееЗначение = Объект["Субконто3"];
	
	Если КорректностьНастроек["СледуетИспользовать"]
		И ЗначениеЗаполнено(ТекущееЗначение) Тогда
		// Дополнительное субконто используется
		// Оставляем текущее значение, если его тип по-прежнему является допустимым
		
		ТипЗначения = ТипЗнч(ТекущееЗначение);
		
		ТипЗначенияДопустимый = НЕ (ТипыЗначенийРеальныхДополнительныхСубконто.Найти(ТипЗначения) = Неопределено);
		
		Если ТипЗначенияДопустимый Тогда
			НовоеЗначение = ТекущееЗначение;
		Иначе
			НовоеЗначение = Неопределено;
		КонецЕсли;
		
	Иначе
		// Дополнительное субконто не используется
		// Очищаем значение
		
		НовоеЗначение = Неопределено;
	КонецЕсли;
	
	Если НЕ ТекущееЗначение = НовоеЗначение Тогда
		Объект["Субконто3"] = НовоеЗначение;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()
	
	Если ИнициализацияВыполнена Тогда
		Возврат;
	КонецЕсли;
	
	ПравоДоступаИзменение = ПравоДоступа("Изменение", Объект.Ссылка.Метаданные());
	
	Документы.ИнвентаризацияМЗ.ИнициализироватьРеквизитыФормыДляНастроекГруппСчетов(ЭтаФорма);
	
	УстановитьУсловноеОформление();
	
	ИнициализацияВыполнена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРеальноеДополнительноеСубконтоВТекущейСтроке(ТекущиеДанные)
	
	ВставляемыеЗначения = Новый Структура("
		|РеальноеДополнительноеСубконто,
		|НомерРеальногоДополнительногоСубконто,
		|Субконто3");
	
	// Обновляем служебную колонку
	ТаблицаАналитики = ЭтаФорма["НастройкиГруппСчетов_ТаблицаАналитикиДопустимыхСчетов"];
	Поиск = Новый Структура("Счет");
	ЗаполнитьЗначенияСвойств(Поиск, ТекущиеДанные);
	МассивСтрок = ТаблицаАналитики.НайтиСтроки(Поиск);
	Если МассивСтрок.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ВставляемыеЗначения, МассивСтрок[0]);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВставляемыеЗначения);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьКэшДатаИнвентаризации(Форма)
	
	Форма["КэшДатаИнвентаризации"] = Форма.Объект["ДатаИнвентаризации"];
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВосстановитьИзКэшаДатаИнвентаризации(Форма)
	
	Форма.Объект["ДатаИнвентаризации"] = Форма["КэшДатаИнвентаризации"];
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДатаИнвентаризацииПриИзменении_ИзменениеСоставаГруппСчетовНеТребуется(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИнвентаризацииПриИзменении_ПодтвержденоИзменениеСоставаГруппСчетов(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		ОбновитьКэшДатаИнвентаризации(ЭтаФорма);
		
		ЭтаФорма.Модифицированность = Истина;
		
		НастроитьФормуПоВыбраннойГруппеСчетов(Истина, Истина);
		
		// Прослеживаемость
		НастроитьФормуПрослеживаемостьСервер();
		// Конец Прослеживаемость
		
	Иначе
		
		ВосстановитьИзКэшаДатаИнвентаризации(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

//---
// Заполнение табличных частей
//---

&НаКлиенте
Функция НеобходимыеРеквизитыЗаполнены()
	
	Результат = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаИнвентаризации) Тогда
		Результат = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не указана дата проведения инвентаризации'"),
			Объект["Ссылка"],
			"Объект.ДатаИнвентаризации");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле Организация не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.Организация");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЦМО) Тогда
		Результат = Ложь;
		ТекстСообщения = НСтр("ru='Поле МОЛ не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Объект.Ссылка,
			"Объект.ЦМО");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьНедостачуИзлишек(ТекДанные)
	
	Если Объект["ВариантФормированияОписи"] = 0 Тогда
		// 0. Опись до 2018 г. Счет в шапке
		
		ДельтаКолво = ТекДанные["КоличествоУчет"] - ТекДанные["КоличествоФакт"];
		ДельтаСумма = ТекДанные["СуммаУчет"] - ТекДанные["СуммаФакт"];
			
		// Недостача
		ТекДанные["НедостачаКоличество"]	= ?(ДельтаКолво>0, ДельтаКолво, 0);
		ТекДанные["НедостачаСумма"]			= ?(ДельтаСумма>0, ДельтаСумма, 0);
		
		// Излишек
		ТекДанные["ИзлишекКоличество"]		= ?(ДельтаКолво<0, -ДельтаКолво, 0);
		ТекДанные["ИзлишекСумма"]			= ?(ДельтаСумма<0, -ДельтаСумма, 0);
		
	Иначе
		// 1. Опись с 2018 г. Счет в таблице (26 знаков)
		// 2. Опись с 2018 г. Счет в таблице (5 знаков)
		// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
		
		ИнвентаризацияКлиентСервер.Редактирование0504087_РассчитатьРасхождениеВСтроке(ЭтаФорма, ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначениеЦеныПоДаннымУчета(ТекущиеДанныеТаблицыМатериалы)
	
	Если ЗначениеЗаполнено(ТекущиеДанныеТаблицыМатериалы["КоличествоУчет"]) Тогда
		Возврат ТекущиеДанныеТаблицыМатериалы["СуммаУчет"] / ТекущиеДанныеТаблицыМатериалы["КоличествоУчет"];
		
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьЦенуСумму(ТекущиеДанные, Элемент)
	
	Перем ЦенаПоДаннымУчета;
	
	ИмяЭлемента = Элемент.Имя;
	
	// Таблица Материалы
	Если ИмяЭлемента = "МатериалыКоличествоФакт" Тогда
		ИмяИзмененногоПоля	= "КоличествоФакт";
		ИмяТабличнойЧасти	= "Материалы";
		
	ИначеЕсли ИмяЭлемента = "МатериалыЦена" Тогда
		ИмяИзмененногоПоля	= "Цена";
		ИмяТабличнойЧасти	= "Материалы";
		
	ИначеЕсли ИмяЭлемента = "МатериалыСуммаФакт" Тогда
		ИмяИзмененногоПоля	= "СуммаФакт";
		ИмяТабличнойЧасти	= "Материалы";
		
	// Таблица Излишки
	ИначеЕсли ИмяЭлемента = "ИзлишкиКоличество" Тогда
		ИмяИзмененногоПоля	= "Количество";
		ИмяТабличнойЧасти	= "Излишки";
		
	ИначеЕсли ИмяЭлемента = "ИзлишкиЦена" Тогда
		ИмяИзмененногоПоля	= "Цена";
		ИмяТабличнойЧасти	= "Излишки";
		
	ИначеЕсли ИмяЭлемента = "ИзлишкиСумма" Тогда
		ИмяИзмененногоПоля	= "Сумма";
		ИмяТабличнойЧасти	= "Излишки";
		
	Иначе
		Возврат;
	КонецЕсли;
	
	//
	// Материалы
	//
	Если ИмяТабличнойЧасти = "Материалы" Тогда
		
		Если Объект["ВариантФормированияОписи"] = 0 Тогда
			// 0. Опись до 2018 г. Счет в шапке
			
			РассчитатьЦенуСумму_Материалы_Вариант0(ТекущиеДанные, ИмяИзмененногоПоля);
		Иначе
			// 1. Опись с 2018 г. Счет в таблице (26 знаков)
			// 2. Опись с 2018 г. Счет в таблице (5 знаков)
			// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
			
			РассчитатьЦенуСумму_Материалы_Вариант123(ТекущиеДанные, ИмяИзмененногоПоля);
		КонецЕсли;
		
	//
	// Излишки
	//
	ИначеЕсли ИмяТабличнойЧасти = "Излишки" Тогда
		
		Если ИмяИзмененногоПоля = "Количество" ИЛИ ИмяИзмененногоПоля = "Цена" Тогда
			ТекущиеДанные["Сумма"] = ТекущиеДанные["Количество"] * ТекущиеДанные["Цена"];
			
		ИначеЕсли ИмяИзмененногоПоля = "Сумма" Тогда
			Если ТекущиеДанные["Количество"] = 0 Тогда
				Цена = 0;
			Иначе
				Цена = ТекущиеДанные["Сумма"] / ТекущиеДанные["Количество"];
			КонецЕсли;
			
			ТекущиеДанные["Цена"] = Цена;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуСумму_Материалы_Вариант0(ТекущиеДанные, ИмяИзмененногоПоля)
	
	// п.1 Недостача
	Недостача = (ТекущиеДанные["КоличествоУчет"] > 0 И ТекущиеДанные["КоличествоФакт"] < ТекущиеДанные["КоличествоУчет"]);
	
	// п.2 Расхождение отсутствует
	РасхождениеОтсутствует = (ТекущиеДанные["КоличествоУчет"] > 0 И ТекущиеДанные["КоличествоФакт"] = ТекущиеДанные["КоличествоУчет"]);
	
	// п.3 Излишек в отдельной строке
	ИзлишекВОтдельнойСтроке = (ТекущиеДанные["КоличествоУчет"] = 0);
	
	// п.4 Излишек в общей строке
	ИзлишекВОбщейСтроке = (ТекущиеДанные["КоличествоУчет"] > 0 И ТекущиеДанные["КоличествоФакт"] > ТекущиеДанные["КоличествоУчет"]);
	
	Если РасхождениеОтсутствует Тогда
		// Расхождение отсутствует, поэтому сумма по факту определяется как сумма по учету.
		// Цена является балансовой, и поэтому не редактируется
		
		ТекущиеДанные["Цена"] = ПолучитьЗначениеЦеныПоДаннымУчета(ТекущиеДанные);
		
		ТекущиеДанные["СуммаФакт"] = ТекущиеДанные["СуммаУчет"];
		
		Возврат;
		
	ИначеЕсли Недостача Тогда
		// При недостаче цена является балансовой, и поэтому не редактируется
		
		Цена = ПолучитьЗначениеЦеныПоДаннымУчета(ТекущиеДанные); // точность без округления
		
		ТекущиеДанные["Цена"] = Цена;
		
		ТекущиеДанные["СуммаФакт"] = ТекущиеДанные["КоличествоФакт"] * Цена;
		
		Возврат;
	КонецЕсли;
	
	Если ИзлишекВОбщейСтроке Тогда
		// Для излишка в общей строке доступно редактирование цены и суммы,
		// но только с соблюдением минимальных значений.
		
		МинимальнаяСумма	= ТекущиеДанные["СуммаУчет"];
		МинимальнаяЦена		= Окр(МинимальнаяСумма / ТекущиеДанные["КоличествоФакт"], 2);
	КонецЕсли;
	
	Если ИмяИзмененногоПоля = "КоличествоФакт" ИЛИ ИмяИзмененногоПоля = "Цена" Тогда
		// Рассчитываем поле СуммаФакт
		
		Если ИзлишекВОбщейСтроке Тогда
			Если ТекущиеДанные["Цена"] <= МинимальнаяЦена Тогда
				ТекущиеДанные["Цена"]		= МинимальнаяЦена;
				ТекущиеДанные["СуммаФакт"]	= МинимальнаяСумма;
				
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ТекущиеДанные["СуммаФакт"] = ТекущиеДанные["КоличествоФакт"] * ТекущиеДанные["Цена"];
		
	ИначеЕсли ИмяИзмененногоПоля = "СуммаФакт" Тогда
		// Рассчитываем поле Цена
		
		Если ИзлишекВОбщейСтроке Тогда
			Если ТекущиеДанные["СуммаФакт"] <= МинимальнаяСумма Тогда
				ТекущиеДанные["Цена"]		= МинимальнаяЦена;
				ТекущиеДанные["СуммаФакт"]	= МинимальнаяСумма;
				
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекущиеДанные["КоличествоФакт"] = 0 Тогда
			Цена = 0;
		Иначе
			Цена = ТекущиеДанные["СуммаФакт"] / ТекущиеДанные["КоличествоФакт"];
		КонецЕсли;
		
		ТекущиеДанные["Цена"] = Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦенуСумму_Материалы_Вариант123(ТекущиеДанные, ИмяИзмененногоПоля)
	
	ИнвентаризацияКлиентСервер.Редактирование0504087_РассчитатьФактическиеПоказатели(ЭтаФорма, ТекущиеДанные, ИмяИзмененногоПоля);
	
КонецПроцедуры
		
&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета()
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		Если Объект["Материалы"].Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru='Перед заполнением по данным учета будет очищена
				|табличная часть Материалы.
				|
				|Продолжить и заполнить по данным учета?'");
			
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьПоДаннымУчета_Выбор", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		Иначе
			ЗаполнитьПоДаннымУчетаКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьПоДаннымУчета_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДаннымУчетаКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьПоДаннымУчетаКлиент()
	
	ЗаполнитьПоДаннымУчетаСервер();
	
	// Если по данным учета не было добавлено ни одной строки, выведем сообщение:
	Если Объект["Материалы"].Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Остатки материалов, соответствующие условиям поиска, отсутствуют'");
		ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПоДаннымУчетаСервер()
	
	Документы.ИнвентаризацияМЗ.ЗаполнитьПоДаннымУчета(ЭтаФорма);
	
	// Прослеживаемость
	НастроитьФормуПрослеживаемостьСервер();
	// Конец Прослеживаемость
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьФактическоеНаличие()
	
	Если Объект["Материалы"].Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Заполнить колонку ""Количество по факту"" данными из колонки ""Количество по учету""?'");
		
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьФактическоеНаличие_Выбор", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьФактическоеНаличие_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьФактическоеНаличиеСервер();
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьФактическоеНаличиеСервер()
	
	Документы.ИнвентаризацияМЗ.ЗаполнитьФактическоеНаличие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьНедостачи()
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		Если Объект["Недостачи"].Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru='Перед заполнением недостачами будет очищена
				|табличная часть Списание недостач.
				|
				|Продолжить и заполнить?'");
			
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьНедостачи_Выбор", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		Иначе
			ЗаполнитьНедостачиКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьНедостачи_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНедостачиКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьНедостачиКлиент()
	
	Если ЗаполнитьРасхожденияСервер(Истина) Тогда
		// Если по данным учета не было добавлено ни одной строки, выведем сообщение:
		Если Объект["Недостачи"].Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='Недостачи материалов отсутствуют'");
			ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
		КонецЕсли;
	Иначе
		// Заполнение не было выполнено.
		ТекстСообщения = НСтр("ru='Не удалось заполнить таблицу ""Списание недостач"", т.к. таблица ""Материалы"" заполнена с ошибками.'");
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьИзлишки()
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		Если Объект["Излишки"].Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru='Перед заполнением излишками будет очищена
				|табличная часть Оприходование излишков.
				|
				|Продолжить и заполнить?'");
			
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьИзлишки_Выбор", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		Иначе
			ЗаполнитьИзлишкиКлиент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	
&НаКлиенте
Процедура ПроверитьИЗаполнитьИзлишки_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзлишкиКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьИзлишкиКлиент()
	
	Если ЗаполнитьРасхожденияСервер(Ложь) Тогда
		// Если по данным учета не было добавлено ни одной строки, выведем сообщение:
		Если Объект["Излишки"].Количество() = 0 Тогда
			ТекстСообщения = НСтр("ru='Излишки материалов отсутствуют'");
			ПоказатьПредупреждение(, ТекстСообщения, 10, ТекстЗаголовкаСообщений);
		КонецЕсли;
	Иначе
		// Заполнение не было выполнено.
		ТекстСообщения = НСтр("ru='Не удалось заполнить таблицу ""Оприходование излишков"", т.к. таблица ""Материалы"" заполнена с ошибками.'");
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРасхожденияСервер(ЭтоНедостача)
	
	СвойстваВыбраннойГруппыСчетов = ЭтаФорма["НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов"];
	
	Если Документы.ИнвентаризацияМЗ.ЕстьОшибкиЗаполненияТаблицыМатериалы(Объект, СвойстваВыбраннойГруппыСчетов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Документы.ИнвентаризацияМЗ.ЗаполнитьРасхождения(ЭтаФорма, ЭтоНедостача);
	
	Документы.ИнвентаризацияМЗ.ОбновитьРеальныеДополнительныеСубконто(ЭтаФорма);
	
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Функция ПолучитьПараметрыФормыГрупповогоЗаполненияСтрок(ИмяТабличнойЧасти, КоличествоСтрок) Экспорт
	
	ДопустимыеСчета				= НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["ДопустимыеСчета"];
	СвойстваДопустимыхСчетов	= НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["СвойстваДопустимыхСчетов"];
	СубконтоДляМОЛ				= НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов["ОсновныеСвойства"]["СубконтоДляМОЛ"];
	
	СвязиПараметровВыбора = Новый Структура("Дата, Организация, ИФО");
	ЗаполнитьЗначенияСвойств(СвязиПараметровВыбора, Объект);
	
	СвязиПараметровВыбора.Вставить("СчетГруппа", Объект["Счет"]);
	
	НеиспользуемыеПоля = Новый Массив();
	НеиспользуемыеПоля.Добавить("Подразделение");
	Если НЕ СвойстваДопустимыхСчетов["УчетПоКПС"] Тогда
		НеиспользуемыеПоля.Добавить("КПС");
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура();
	
	Если ДопустимыеСчета.Количество() = 1 Тогда
		ЗначенияЗаполнения.Вставить("Счет", ДопустимыеСчета[0]);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	
	Если ИмяТабличнойЧасти = "Материалы" Тогда
		
		Если Объект["ВариантФормированияОписи"] = 1 Тогда
			// 1. Опись с 2018 г. Счет в таблице (26 знаков)
			
			ЗначенияЗаполнения.Вставить("КПС", Объект["КПС"]);
			ЗначенияЗаполнения.Вставить("КФО", Объект["КФО"]);
		Иначе
			// 2. Опись с 2018 г. Счет в таблице (5 знаков)
			// 3. Опись с 2018 г. Счет в таблице (5 знаков). Одна строка - один объект
			
			НеиспользуемыеПоля.Добавить("КПС");
			НеиспользуемыеПоля.Добавить("КФО");
		КонецЕсли;
		
	ИначеЕсли ИмяТабличнойЧасти = "Излишки" ИЛИ ИмяТабличнойЧасти = "Недостачи" Тогда
		
		ЗначенияЗаполнения.Вставить("ИФО", Объект["ИФО"]);
		ЗначенияЗаполнения.Вставить("ЦМО", Объект["ЦМО"]);
		
		НеиспользуемыеПоля.Добавить("КЭК");
		НеиспользуемыеПоля.Добавить("ВидДокумента");
		
		ПараметрыФормы.Вставить("СубконтоДляМОЛ", СубконтоДляМОЛ);
		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("СвязиПараметровВыбора",	СвязиПараметровВыбора);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",		ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("КоличествоСтрок",			КоличествоСтрок);
	ПараметрыФормы.Вставить("НеиспользуемыеПоля",		НеиспользуемыеПоля);
	
	Возврат ПараметрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытаФормаГрупповогоЗаполненияСтрок(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТабличнойЧасти = ПараметрыОповещения["ИмяТабличнойЧасти"];
	
	ВыделенныеСтроки = Элементы[ИмяТабличнойЧасти].ВыделенныеСтроки;
	
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	
	Если ИмяТабличнойЧасти = "Материалы" Тогда
		
		ИзмененаЦена = РезультатВыбора.Свойство("Цена");
		
		ИзмененоКоличествоНеСоответствует = РезультатВыбора.Свойство("КоличествоНеСоответствует");
		
		ЭлементЦены = Элементы["МатериалыЦена"];
		
		Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдСтроки);
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыбора);
			
			Если ИзмененаЦена Тогда
				РассчитатьЦенуСумму(СтрокаТаблицы, ЭлементЦены);
			КонецЕсли;
			
			Если ИзмененаЦена ИЛИ ИзмененоКоличествоНеСоответствует Тогда
				РассчитатьНедостачуИзлишек(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ИмяТабличнойЧасти = "Недостачи" ИЛИ ИмяТабличнойЧасти = "Излишки" Тогда
		
		Для Каждого ИдСтроки Из ВыделенныеСтроки Цикл
			СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдСтроки);
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, РезультатВыбора);
		КонецЦикла;
		
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ВариантФормированияОписи0504087_ИзменитьВариант(НовоеЗначениеВарианта)
	
	ИгнорироватьРеквизитКПС = НЕ НастройкиГруппСчетов_СвойстваВыбраннойГруппыСчетов["ДетальныеСвойства"]["СвойстваДопустимыхСчетов"]["УчетПоКПС"];
	
	ИнвентаризацияСервер.ВариантФормированияОписи_НастроитьВидимостьРеквизитов_ПриИзмененииВарианта(
		ЭтаФорма,
		НовоеЗначениеВарианта,
		ИгнорироватьРеквизитКПС);
		
	ИнвентаризацияСервер.ВариантФормированияОписи0504087_РассчитатьПеременныеРеквизиты_ПриИзмененииВарианта(ЭтаФорма, НовоеЗначениеВарианта);
	
	Объект["ВариантФормированияОписи"] = НовоеЗначениеВарианта;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#Область РазбивкаСтрокиИнвентаризацииНФА

&НаКлиенте
Процедура ПослеРазбивкиСтрокиИнвентаризацииНфа(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент = Элементы.МатериалыСуммаФакт;
	
	ИндексыСтрок = РезультатВыбора;
	
	Для Каждого ИндексСтроки Из ИндексыСтрок Цикл
		СтрокаТаблицы = Объект.Материалы[ИндексСтроки];
		
		РассчитатьЦенуСумму(СтрокаТаблицы, Элемент);
		
		РассчитатьНедостачуИзлишек(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
&НаСервереБезКонтекста
Функция ПолучитьСвойстваНоменклатурыСервер(Организация, Номенклатура, ТипЦены, ДатаЦены)
	
	СвойстваНоменклатуры = УправлениеМатериальнымиЗапасами.ПризнакиПрослеживаемостиНоменклатуры(
	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Номенклатура),
	ДатаЦены);
	
	Если ЗначениеЗаполнено(ТипЦены) Тогда
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("Организация",		Организация);
		СтруктураПараметров.Вставить("Номенклатура",	Номенклатура);
		СтруктураПараметров.Вставить("ТипЦены",			ТипЦены);
		СтруктураПараметров.Вставить("ДатаЦены",		ДатаЦены);
		
		СвойстваНоменклатуры.Вставить("Цена", УправлениеМатериальнымиЗапасамиВызовСервера.ЦенаНоменклатурыВвалюте(СтруктураПараметров));
	КонецЕсли;
	
	Возврат СвойстваНоменклатуры;
	
КонецФункции

// Прослеживаемость
&НаСервере
Процедура НастроитьФормуПрослеживаемостьСервер()
	
	ПрослеживаемостьФормыБГУ.НастроитьФормуИКолонкуПрослеживаемыйТовар(
		ЭтаФорма,
		Объект.ДатаИнвентаризации,
		"Материалы",
		"Номенклатура");
	
КонецПроцедуры
// Конец Прослеживаемость

&НаКлиенте
Процедура ПроверитьИЗаполнитьПрослеживаемыеТовары(ТолькоИзлишки)
	
	Если НеобходимыеРеквизитыЗаполнены() Тогда
		Если Объект["ПрослеживаемыеТовары"].Количество() > 0 Тогда
			ТекстСообщения = НСтр("ru='Перед заполнением прослеживаемых товаров будет очищена
				|табличная часть ""Прослеживаемые товары"".
				|
				|Продолжить и заполнить прослеживаемые товары?'");
			
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ТолькоИзлишки", ТолькоИзлишки);
			
			ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПроверитьИЗаполнитьПрослеживаемыеТовары_Выбор", ЭтотОбъект, ДополнительныеПараметры);
			
			ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
		Иначе
			ЗаполнитьПрослеживаемыеТоварыКлиент(ТолькоИзлишки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПроверитьИЗаполнитьПрослеживаемыеТовары_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПрослеживаемыеТоварыКлиент(ПараметрыОповещения.ТолькоИзлишки);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьПрослеживаемыеТоварыКлиент(ТолькоИзлишки)
	
	ЗаполнитьПрослеживаемыеТоварыСервер(ТолькоИзлишки);
	
	Если Объект["ПрослеживаемыеТовары"].Количество() = 0 Тогда
		
		ТекстШаблон = "%1
			|
			|%2";
		
		Если ТолькоИзлишки Тогда
			Текст1 = НСтр("ru='В излишках табличной части ""Материалы"" не выявлены прослеживаемые товары.'");
		Иначе
			Текст1 = НСтр("ru='В данных учёта табличной части ""Материалы"" не выявлены прослеживаемые товары.'");
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(ТекстШаблон, Текст1,
			НСтр("ru='Либо эти товары в полном объеме уже были зарегистрированы в системе прослеживаемости ранее.
				|В этом случае не требуется их повторная регистрация.'"));
		
		ПоказатьПредупреждение(, ТекстСообщения,, ТекстЗаголовкаСообщений);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПрослеживаемыеТоварыСервер(ТолькоИзлишки)
	
	ПрослеживаемостьБГУ.ЗаполнитьПрослеживаемыеТовары(Объект, ТолькоИзлишки);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
