
#Область ЗаполнениеПоОстаткам

&НаКлиенте
Процедура ЗаполнитьПоОстаткамМЗ(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаКорректировки) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Дата корректировки'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ДатаКорректировки");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоОстаткамМЗНаСервере();
	
	// Раскрываем первый уровень дерева.
	ЭлементыДерева = ДеревоОстатковМЗвНУ.ПолучитьЭлементы();
	Если ЭлементыДерева.Количество() > 0 Тогда
		Элементы.ДеревоОстатковМЗвНУ.Развернуть(ЭлементыДерева[0].ПолучитьИдентификатор());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОстаткамМЗНаСервере()
	
	НомераТаблиц = Новый Структура;
	Запрос = Новый Запрос;
	
	Запрос.Текст = НалоговыйУчет.ТекстЗапросаСчетаУчетаМПЗ(НомераТаблиц);
	
	НомераТаблиц.Вставить("ОстаткиМЗвНУ1",  НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОстаткиМЗвБУ1",  НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОстаткиМЗвНУ",   НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОстаткиМЗвБУ",   НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ДеревоОстатков", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ОстаткиМЗвНУ.Организация,
	|	ОстаткиМЗвНУ.КФО,
	|	ОстаткиМЗвНУ.Счет КАК СчетНУ,
	|	ВЫРАЗИТЬ(ОстаткиМЗвНУ.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ОстаткиМЗвНУ.Субконто2,
	|	ОстаткиМЗвНУ.Субконто3,
	|	ОстаткиМЗвНУ.ИФО,
	|	ОстаткиМЗвНУ.Подразделение,
	|	ОстаткиМЗвНУ.КПС,
	|	ОстаткиМЗвНУ.КоличествоОстаток КАК Количество,
	|	ОстаткиМЗвНУ.СуммаОстаток КАК Сумма,
	|	ОстаткиМЗвНУ.СуммаНеУчитываетсяНУОстаток КАК СуммаНеУчитываетсяНУ,
	|	ОстаткиМЗвНУ.СуммаЕНВДОстаток КАК СуммаЕНВД
	|ПОМЕСТИТЬ ОстаткиМЗвНУ1
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаСреза,
	|			Счет В (&СчетаНалоговогоУчетаМЗ),
	|			,
	|			Организация = &Организация
	|				И КФО В (&КФО)) КАК ОстаткиМЗвНУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиМЗвБУ.Организация,
	|	ОстаткиМЗвБУ.КФО,
	|	ОстаткиМЗвБУ.Счет КАК СчетБУ,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ОстаткиМЗвБУ.Счет В
	|					(ВЫБРАТЬ
	|						СчетаУчетаГотовойПродукции.Счет
	|					ИЗ
	|						СчетаУчетаГотовойПродукции)
	|				ТОГДА &СчетГотовойПродукцииНУ
	|			КОГДА ОстаткиМЗвБУ.Счет В
	|					(ВЫБРАТЬ
	|						СчетаУчетаТоваровНаСкладах.Счет
	|					ИЗ
	|						СчетаУчетаТоваровНаСкладах)
	|				ТОГДА &СчетТоваровНУ
	|			ИНАЧЕ &СчетМатериаловНУ
	|		КОНЕЦ КАК ПланСчетов.ЕПСБУ) КАК СчетНУ,
	|	ВЫРАЗИТЬ(ОстаткиМЗвБУ.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ОстаткиМЗвБУ.Субконто2,
	|	ОстаткиМЗвБУ.Субконто3,
	|	ОстаткиМЗвБУ.ИФО,
	|	ОстаткиМЗвБУ.Подразделение,
	|	ОстаткиМЗвБУ.КПС,
	|	ОстаткиМЗвБУ.КоличествоОстаток КАК Количество,
	|	ОстаткиМЗвБУ.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ОстаткиМЗвБУ1
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаСреза,
	|			Счет В
	|					(ВЫБРАТЬ
	|						СчетаУчетаМатериальныхЗапасов.Счет
	|					ИЗ
	|						СчетаУчетаМатериальныхЗапасов)
	|				И НЕ Счет В
	|						(ВЫБРАТЬ
	|							СчетаУчетаТоваровВРознице.Счет
	|						ИЗ
	|							СчетаУчетаТоваровВРознице)
	|				И НЕ Счет В
	|						(ВЫБРАТЬ
	|							СчетаУчетаТорговойНаценки.Счет
	|						ИЗ
	|							СчетаУчетаТорговойНаценки),
	|			,
	|			Организация = &Организация
	|				И КФО В (&КФО)) КАК ОстаткиМЗвБУ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиМЗвНУ.Организация,
	|	ОстаткиМЗвНУ.КФО,
	|	ОстаткиМЗвНУ.СчетНУ,
	|	ОстаткиМЗвНУ.Номенклатура,
	|	ОстаткиМЗвНУ.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ВидыСубконто2.ВидСубконто КАК ВидСубконто2,
	|	ОстаткиМЗвНУ.Субконто2,
	|	ВидыСубконто3.ВидСубконто КАК ВидСубконто3,
	|	ОстаткиМЗвНУ.Субконто3,
	|	ОстаткиМЗвНУ.ИФО,
	|	ОстаткиМЗвНУ.СчетНУ.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	ОстаткиМЗвНУ.Подразделение,
	|	ОстаткиМЗвНУ.СчетНУ.УчетПоКПС КАК УчетПоКПС,
	|	ОстаткиМЗвНУ.КПС,
	|	ОстаткиМЗвНУ.Количество,
	|	ОстаткиМЗвНУ.Сумма,
	|	ОстаткиМЗвНУ.СуммаНеУчитываетсяНУ,
	|	ОстаткиМЗвНУ.СуммаЕНВД
	|ПОМЕСТИТЬ ОстаткиМЗвНУ
	|ИЗ
	|	ОстаткиМЗвНУ1 КАК ОстаткиМЗвНУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконто2
	|		ПО ОстаткиМЗвНУ.СчетНУ = ВидыСубконто2.Ссылка
	|			И (ВидыСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконто3
	|		ПО ОстаткиМЗвНУ.СчетНУ = ВидыСубконто3.Ссылка
	|			И (ВидыСубконто3.НомерСтроки = 3)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиМЗвБУ.Организация,
	|	ОстаткиМЗвБУ.КФО,
	|	ОстаткиМЗвБУ.СчетБУ,
	|	ОстаткиМЗвБУ.СчетНУ КАК СчетНУ,
	|	ОстаткиМЗвБУ.Номенклатура,
	|	ОстаткиМЗвБУ.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ВЫБОР
	|		КОГДА ВидыСубконтоНУ2.ВидСубконто ЕСТЬ NULL 
	|			ТОГДА NULL
	|		ИНАЧЕ ВидыСубконто2.ВидСубконто
	|	КОНЕЦ КАК ВидСубконто2,
	|	ВЫБОР
	|		КОГДА ВидыСубконтоНУ2.ВидСубконто ЕСТЬ NULL 
	|			ТОГДА NULL
	|		ИНАЧЕ ОстаткиМЗвБУ.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА ВидыСубконтоНУ3.ВидСубконто ЕСТЬ NULL 
	|			ТОГДА NULL
	|		ИНАЧЕ ВидыСубконто3.ВидСубконто
	|	КОНЕЦ КАК ВидСубконто3,
	|	ВЫБОР
	|		КОГДА ВидыСубконтоНУ3.ВидСубконто ЕСТЬ NULL 
	|			ТОГДА NULL
	|		ИНАЧЕ ОстаткиМЗвБУ.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ОстаткиМЗвБУ.ИФО,
	|	ВЫБОР
	|		КОГДА НЕ ОстаткиМЗвБУ.СчетНУ.УчетПоПодразделениям
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ОстаткиМЗвБУ.СчетБУ.УчетПоПодразделениям
	|	КОНЕЦ КАК УчетПоПодразделениям,
	|	ВЫБОР
	|		КОГДА НЕ ОстаткиМЗвБУ.СчетНУ.УчетПоПодразделениям
	|			ТОГДА NULL
	|		ИНАЧЕ ОстаткиМЗвБУ.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА НЕ ОстаткиМЗвБУ.СчетНУ.УчетПоКПС
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ОстаткиМЗвБУ.СчетБУ.УчетПоКПС
	|	КОНЕЦ КАК УчетПоКПС,
	|	ВЫБОР
	|		КОГДА НЕ ОстаткиМЗвБУ.СчетНУ.УчетПоКПС
	|			ТОГДА NULL
	|		ИНАЧЕ ОстаткиМЗвБУ.КПС
	|	КОНЕЦ КАК КПС,
	|	ОстаткиМЗвБУ.Количество,
	|	ОстаткиМЗвБУ.Сумма
	|ПОМЕСТИТЬ ОстаткиМЗвБУ
	|ИЗ
	|	ОстаткиМЗвБУ1 КАК ОстаткиМЗвБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконто2
	|		ПО ОстаткиМЗвБУ.СчетБУ = ВидыСубконто2.Ссылка
	|			И (ВидыСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконто3
	|		ПО ОстаткиМЗвБУ.СчетБУ = ВидыСубконто3.Ссылка
	|			И (ВидыСубконто3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконтоНУ2
	|		ПО (ОстаткиМЗвБУ.СчетНУ = ВидыСубконто2.Ссылка)
	|			И (ВидыСубконтоНУ2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ВидыСубконтоНУ3
	|		ПО (ОстаткиМЗвБУ.СчетНУ = ВидыСубконто3.Ссылка)
	|			И (ВидыСубконтоНУ3.НомерСтроки = 3)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.КФО КАК КФО,
	|	ВложенныйЗапрос.СчетНУ КАК СчетНУ,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.НоменклатураНаименование КАК НоменклатураНаименование,
	|	ВложенныйЗапрос.ВидСубконто2,
	|	ВложенныйЗапрос.Субконто2 КАК Субконто2,
	|	ВложенныйЗапрос.ВидСубконто3,
	|	ВложенныйЗапрос.Субконто3 КАК Субконто3,
	|	ВложенныйЗапрос.ИФО КАК ИФО,
	|	ВложенныйЗапрос.УчетПоПодразделениям,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.УчетПоКПС,
	|	ВложенныйЗапрос.КПС КАК КПС,
	|	СУММА(ВложенныйЗапрос.КоличествоНУ) КАК КоличествоНУ,
	|	СУММА(ВложенныйЗапрос.СуммаНУ) КАК СуммаНУ,
	|	СУММА(ВложенныйЗапрос.СуммаНеУчитываетсяНУ) КАК СуммаНеУчитываетсяНУ,
	|	СУММА(ВложенныйЗапрос.СуммаЕНВД) КАК СуммаЕНВД,
	|	СУММА(ВложенныйЗапрос.КоличествоБУ) КАК КоличествоБУ,
	|	СУММА(ВложенныйЗапрос.СуммаБУ) КАК СуммаБУ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОстаткиМЗвНУ.Организация КАК Организация,
	|		ОстаткиМЗвНУ.КФО КАК КФО,
	|		ОстаткиМЗвНУ.СчетНУ КАК СчетНУ,
	|		ОстаткиМЗвНУ.Номенклатура КАК Номенклатура,
	|		ОстаткиМЗвНУ.НоменклатураНаименование КАК НоменклатураНаименование,
	|		ОстаткиМЗвНУ.ВидСубконто2 КАК ВидСубконто2,
	|		ОстаткиМЗвНУ.Субконто2 КАК Субконто2,
	|		ОстаткиМЗвНУ.ВидСубконто3 КАК ВидСубконто3,
	|		ОстаткиМЗвНУ.Субконто3 КАК Субконто3,
	|		ОстаткиМЗвНУ.ИФО КАК ИФО,
	|		ОстаткиМЗвНУ.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|		ОстаткиМЗвНУ.Подразделение КАК Подразделение,
	|		ОстаткиМЗвНУ.УчетПоКПС КАК УчетПоКПС,
	|		ОстаткиМЗвНУ.КПС КАК КПС,
	|		ОстаткиМЗвНУ.Количество КАК КоличествоНУ,
	|		ОстаткиМЗвНУ.Сумма КАК СуммаНУ,
	|		ОстаткиМЗвНУ.СуммаНеУчитываетсяНУ КАК СуммаНеУчитываетсяНУ,
	|		ОстаткиМЗвНУ.СуммаЕНВД КАК СуммаЕНВД,
	|		0 КАК КоличествоБУ,
	|		0 КАК СуммаБУ
	|	ИЗ
	|		ОстаткиМЗвНУ КАК ОстаткиМЗвНУ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиМЗвБУ.Организация,
	|		ОстаткиМЗвБУ.КФО,
	|		ОстаткиМЗвБУ.СчетНУ,
	|		ОстаткиМЗвБУ.Номенклатура,
	|		ОстаткиМЗвБУ.НоменклатураНаименование,
	|		ОстаткиМЗвБУ.ВидСубконто2,
	|		ОстаткиМЗвБУ.Субконто2,
	|		ОстаткиМЗвБУ.ВидСубконто3,
	|		ОстаткиМЗвБУ.Субконто3,
	|		ОстаткиМЗвБУ.ИФО,
	|		ОстаткиМЗвБУ.УчетПоПодразделениям,
	|		ОстаткиМЗвБУ.Подразделение,
	|		ОстаткиМЗвБУ.УчетПоКПС,
	|		ОстаткиМЗвБУ.КПС,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ОстаткиМЗвБУ.Количество,
	|		ОстаткиМЗвБУ.Сумма
	|	ИЗ
	|		ОстаткиМЗвБУ КАК ОстаткиМЗвБУ) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.КФО,
	|	ВложенныйЗапрос.СчетНУ,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НоменклатураНаименование,
	|	ВложенныйЗапрос.ВидСубконто2,
	|	ВложенныйЗапрос.Субконто2,
	|	ВложенныйЗапрос.ВидСубконто3,
	|	ВложенныйЗапрос.Субконто3,
	|	ВложенныйЗапрос.ИФО,
	|	ВложенныйЗапрос.УчетПоПодразделениям,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.УчетПоКПС,
	|	ВложенныйЗапрос.КПС
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование,
	|	ИФО,
	|	Подразделение,
	|	КПС,
	|	Субконто2,
	|	Субконто3
	|ИТОГИ
	|	СУММА(КоличествоНУ),
	|	СУММА(СуммаНУ),
	|	СУММА(СуммаНеУчитываетсяНУ),
	|	СУММА(СуммаЕНВД),
	|	СУММА(КоличествоБУ),
	|	СУММА(СуммаБУ)
	|ПО
	|	КФО,
	|	СчетНУ,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(КонецДня(Объект.ДатаКорректировки), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КФО", НалоговыйУчетКлиентСервер.ПолучитьМассивКФОдляНалоговогоУчета());
	
	Запрос.УстановитьПараметр("СчетаНалоговогоУчетаМЗ",
		БухгалтерскийУчетПовтИсп.ПолучитьМассивСчетов("Н10,Н41.01,Н43"));
	Запрос.УстановитьПараметр("СчетГотовойПродукцииНУ", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("Н43"));
	Запрос.УстановитьПараметр("СчетТоваровНУ", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("Н41.01"));
	Запрос.УстановитьПараметр("СчетМатериаловНУ", БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("Н10"));
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Заполним дерево остатков МЗ на форме.
	ДеревоОстатков = РеквизитФормыВЗначение("ДеревоОстатковМЗвНУ");
	ДеревоОстатков = Результат[НомераТаблиц.ДеревоОстатков].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ДеревоОстатков.Колонки.Добавить("ГруппировкаОстатков");
	ДеревоОстатков.Колонки.Добавить("Уровень", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	ДеревоОстатков.Колонки.Добавить("Обрабатывать", Новый ОписаниеТипов("Булево"));
	ДеревоОстатков.Колонки.Добавить("ТипСтроки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДеревоОстатков.Колонки.Добавить("ЗаголовокБУ", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	ДеревоОстатков.Колонки.Добавить("ЗаголовокНУ", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	
	Для Каждого СтрокаКФО Из ДеревоОстатков.Строки Цикл
		СтрокаКФО.ГруппировкаОстатков = СтрокаКФО.КФО;
		СтрокаКФО.Уровень = 1;
		СтрокаКФО.Обрабатывать = Истина;
		СтрокаКФО.ЗаголовокБУ = НСтр("ru = 'БУ:'");
		СтрокаКФО.ЗаголовокНУ = НСтр("ru = 'НУ:'");
		
		Для Каждого СтрокаСчетНУ Из СтрокаКФО.Строки Цикл
			СтрокаСчетНУ.ГруппировкаОстатков = СтрокаСчетНУ.СчетНУ;
			СтрокаСчетНУ.Уровень = 2;
			СтрокаСчетНУ.Обрабатывать = Истина;
			СтрокаСчетНУ.ЗаголовокБУ = НСтр("ru = 'БУ:'");
			СтрокаСчетНУ.ЗаголовокНУ = НСтр("ru = 'НУ:'");
			
			Для Каждого СтрокаНоменклатура Из СтрокаСчетНУ.Строки Цикл
				СтрокаНоменклатура.ГруппировкаОстатков = СтрокаНоменклатура.Номенклатура;
				СтрокаНоменклатура.Уровень = 3;
				СтрокаНоменклатура.Обрабатывать = Истина;
				СтрокаНоменклатура.ЗаголовокБУ = НСтр("ru = 'БУ:'");
				СтрокаНоменклатура.ЗаголовокНУ = НСтр("ru = 'НУ:'");
				
				Для Каждого СтрокаДетальная Из СтрокаНоменклатура.Строки Цикл
					СтрокаДетальная.Уровень = 4;
					СтрокаДетальная.Обрабатывать = Истина;
					СтрокаДетальная.ЗаголовокБУ = НСтр("ru = 'БУ:'");
					СтрокаДетальная.ЗаголовокНУ = НСтр("ru = 'НУ:'");
					
					ЕстьОстаткиБУ = Истина;
					ЕстьОстаткиНУ = Истина;
					Если СтрокаДетальная.КоличествоБУ = 0 И СтрокаДетальная.СуммаБУ = 0 Тогда
						ЕстьОстаткиБУ = Ложь;
					КонецЕсли;
					Если СтрокаДетальная.КоличествоНУ = 0 И СтрокаДетальная.СуммаНУ = 0
						И СтрокаДетальная.СуммаНеУчитываетсяНУ = 0 И СтрокаДетальная.СуммаЕНВД = 0 Тогда
						ЕстьОстаткиНУ = Ложь;
					КонецЕсли;
					
					Если ЕстьОстаткиБУ И ЕстьОстаткиНУ Тогда // Остатки БУ и НУ соединились по аналитике, не нужно обрабатывать.
						СтрокаДетальная.ТипСтроки = "Пропустить";
					ИначеЕсли ЕстьОстаткиБУ Тогда
						СтрокаДетальная.ТипСтроки = "ЭтоОстатокБУ";
					ИначеЕсли ЕстьОстаткиНУ Тогда
						СтрокаДетальная.ТипСтроки = "ЭтоОстатокНУ";
					Иначе // Такого быть не должно, хотя бы один остаток должен быть.
						СтрокаДетальная.ТипСтроки = "Пропустить";
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоОстатков, "ДеревоОстатковМЗвНУ");
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеОпераций

&НаКлиенте
Процедура СформироватьДокументКорректировкиАналитики(Команда)
	
	СформироватьДокументКорректировкиАналитикиНаСервере();
	
	// Раскрываем элементы, которые остались отмеченными.
	ЭлементыДерева = ДеревоОстатковМЗвНУ.ПолучитьЭлементы();
	РаскрытьОтмеченныеЭлементыДерева(ЭлементыДерева);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументКорректировкиАналитикиНаСервере()
	
	ДокументКорректировки = Документы.КорректировкаРегистров.СоздатьДокумент();
	ДокументКорректировки.Организация = Объект.Организация;
	ДокументКорректировки.Дата = КонецДня(Объект.ДатаКорректировки);
	ДокументКорректировки.Комментарий = НСтр("ru = '#КорректировкаАналитикиНалоговогоУчета'");
	
	Проводки = ДокументКорректировки.Движения.ЖурналПроводокЕПСБУ;
	ТаблицаПроводок = Проводки.ВыгрузитьКолонки();
	
	БазаРаспределения = Новый ТаблицаЗначений;
	БазаРаспределения.Колонки.Добавить("ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	БазаРаспределения.Колонки.Добавить("КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	БазаРаспределения.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	БазаРаспределения.Колонки.Добавить("Субконто2", ОписаниеТиповСубконто);
	БазаРаспределения.Колонки.Добавить("Субконто3", ОписаниеТиповСубконто);
	БазаРаспределения.Колонки.Добавить("КоличествоБУ",         ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	БазаРаспределения.Колонки.Добавить("КоличествоНУ",         ОбщегоНазначения.ОписаниеТипаЧисло(15, 3));
	БазаРаспределения.Колонки.Добавить("СуммаБУ",              ОбщегоНазначения.ОписаниеТипаЧисло(18, 2));
	БазаРаспределения.Колонки.Добавить("СуммаНУ",              ОбщегоНазначения.ОписаниеТипаЧисло(18, 2));
	БазаРаспределения.Колонки.Добавить("СуммаНеУчитываетсяНУ", ОбщегоНазначения.ОписаниеТипаЧисло(18, 2));
	БазаРаспределения.Колонки.Добавить("СуммаЕНВД",            ОбщегоНазначения.ОписаниеТипаЧисло(18, 2));
	
	ДеревоОстатков = РеквизитФормыВЗначение("ДеревоОстатковМЗвНУ");
	
	Для Каждого СтрокаКФО Из ДеревоОстатков.Строки Цикл
		Для Каждого СтрокаСчетНУ Из СтрокаКФО.Строки Цикл
			Для Каждого СтрокаНоменклатура Из СтрокаСчетНУ.Строки Цикл
				
				Если НЕ СтрокаНоменклатура.Обрабатывать Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаНоменклатура.КоличествоБУ <> СтрокаНоменклатура.КоличествоНУ Тогда
					ТекстОшибки = НСтр("ru='По номенклатуре %1 на счете %2 количество в БУ и НУ различаются:
						|БУ: %3, НУ: %4.
						|Скорректируйте остатки и проведите корректировку аналитики налогового учета повторно.'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
						СтрокаНоменклатура.Номенклатура,
						СтрокаНоменклатура.СчетНУ,
						СтрокаНоменклатура.КоличествоБУ,
						СтрокаНоменклатура.КоличествоНУ);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
					Продолжить;
				КонецЕсли;
				
				СтрокаНоменклатура.Обрабатывать = Ложь;
				
				РаспределениеОстатковНУ = БазаРаспределения.Скопировать();
				Для Каждого СтрокаДетальная Из СтрокаНоменклатура.Строки Цикл
					
					Если СтрокаДетальная.ТипСтроки = "ЭтоОстатокБУ" Тогда
						НоваяСтрокаБазы = РаспределениеОстатковНУ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаБазы, СтрокаДетальная,
							"ИФО,КПС,Подразделение,Субконто2,Субконто3,КоличествоБУ,СуммаБУ");
					КонецЕсли;
					
				КонецЦикла;
				
				// Распределим остатки НУ по базе.
				Для Каждого СтрокаДетальная Из СтрокаНоменклатура.Строки Цикл
					
					Если СтрокаДетальная.ТипСтроки = "ЭтоОстатокНУ" Тогда
						
						Если РаспределениеОстатковНУ.Количество() = 0 Тогда
							ТекстОшибки = НСтр("ru='Для номенклатуры %1 на счете %2 не найдены остатки на соответствующих счетах БУ (105.00):
								|Невозможно определить базу распределения.
								|Скорректируйте остатки и проведите корректировку аналитики налогового учета повторно.'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
								СтрокаНоменклатура.Номенклатура,
								СтрокаНоменклатура.СчетНУ);
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
							СтрокаНоменклатура.Обрабатывать = Истина;
							Прервать;
						КонецЕсли;
						
						Отбор = Новый Структура;
						Если СтрокаДетальная.ИФО <> Объект.ИФОдляПереносаИзБГУ1 Тогда
							Отбор.Вставить("ИФО", СтрокаДетальная.ИФО);
						КонецЕсли;
						Если СтрокаДетальная.УчетПоПодразделениям И ЗначениеЗаполнено(СтрокаДетальная.Подразделение) Тогда
							Отбор.Вставить("Подразделение", СтрокаДетальная.Подразделение);
						КонецЕсли;
						Если СтрокаДетальная.УчетПоКПС И ЗначениеЗаполнено(СтрокаДетальная.КПС) Тогда
							Отбор.Вставить("КПС", СтрокаДетальная.КПС);
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаДетальная.ВидСубконто2) И ЗначениеЗаполнено(СтрокаДетальная.Субконто2) Тогда
							Отбор.Вставить("Субконто2", СтрокаДетальная.Субконто2);
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаДетальная.ВидСубконто3) И ЗначениеЗаполнено(СтрокаДетальная.Субконто3) Тогда
							Отбор.Вставить("Субконто3", СтрокаДетальная.Субконто3);
						КонецЕсли;
						СтрокиРаспределения = ?(Отбор.Количество() = 0, РаспределениеОстатковНУ,
							РаспределениеОстатковНУ.НайтиСтроки(Отбор) );
						
						// Количество НУ будем распределять по строкам, где есть остаток с количеством БУ.
						// Суммы НУ будем распределять по строкам, где есть остаток с суммой БУ.
						БазаРаспределенияКоличества = Новый Массив;
						БазаРаспределенияСумм = Новый Массив;
						Для Каждого Строка Из СтрокиРаспределения Цикл
							БазаРаспределенияКоличества.Добавить(Строка.КоличествоБУ);
							БазаРаспределенияСумм.Добавить(Строка.СуммаБУ);
						КонецЦикла;
						
						Если СтрокаДетальная.КоличествоНУ <> 0 Тогда
							
							РаспределениеКоличестваНУ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
								СтрокаДетальная.КоличествоНУ, БазаРаспределенияКоличества);
							Для Инд = 0 По СтрокиРаспределения.Количество() - 1 Цикл
								Строка = СтрокиРаспределения[Инд];
								Строка.КоличествоНУ = Строка.КоличествоНУ +
									?(РаспределениеКоличестваНУ = Неопределено, 0, РаспределениеКоличестваНУ[Инд]);
							КонецЦикла;
							
						КонецЕсли;
						
						Если СтрокаДетальная.СуммаНУ <> 0
						 ИЛИ СтрокаДетальная.СуммаНеУчитываетсяНУ <> 0
						 ИЛИ СтрокаДетальная.СуммаЕНВД <> 0 Тогда
							
							РаспределениеСуммыНУ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
								СтрокаДетальная.СуммаНУ, БазаРаспределенияСумм);
							РаспределениеСуммыНеУчитываетсяНУ = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
								СтрокаДетальная.СуммаНеУчитываетсяНУ, БазаРаспределенияСумм);
							РаспределениеСуммыЕНВД = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
								СтрокаДетальная.СуммаЕНВД, БазаРаспределенияСумм);
							Для Инд = 0 По СтрокиРаспределения.Количество() - 1 Цикл
								Строка = СтрокиРаспределения[Инд];
								Строка.СуммаНУ = Строка.СуммаНУ +
									?(РаспределениеСуммыНУ = Неопределено, 0, РаспределениеСуммыНУ[Инд]);
								Строка.СуммаНеУчитываетсяНУ = Строка.СуммаНеУчитываетсяНУ +
									?(РаспределениеСуммыНеУчитываетсяНУ = Неопределено, 0, РаспределениеСуммыНеУчитываетсяНУ[Инд]);
								Строка.СуммаЕНВД = Строка.СуммаЕНВД +
									?(РаспределениеСуммыЕНВД = Неопределено, 0, РаспределениеСуммыЕНВД[Инд]);
							КонецЦикла;
							
						КонецЕсли;
						
						// Сторнируем остаток НУ со старой аналитикой.
						НоваяПроводка = ТаблицаПроводок.Добавить();
						НоваяПроводка.ИФО = СтрокаДетальная.ИФО;
						НоваяПроводка.КФО = СтрокаНоменклатура.КФО;
						
						НоваяПроводка.СчетДт = СтрокаДетальная.СчетНУ;
						Если СтрокаДетальная.УчетПоПодразделениям Тогда
							НоваяПроводка.ПодразделениеДт = СтрокаДетальная.Подразделение;
						КонецЕсли;
						Если СтрокаДетальная.УчетПоКПС Тогда
							НоваяПроводка.КПСДт = СтрокаДетальная.КПС;
						КонецЕсли;
						БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Номенклатура", СтрокаДетальная.Номенклатура);
						Если ЗначениеЗаполнено(СтрокаДетальная.ВидСубконто2) Тогда
							БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", СтрокаДетальная.ВидСубконто2, СтрокаДетальная.Субконто2);
						КонецЕсли;
						Если ЗначениеЗаполнено(СтрокаДетальная.ВидСубконто3) Тогда
							БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", СтрокаДетальная.ВидСубконто3, СтрокаДетальная.Субконто3);
						КонецЕсли;
						
						НоваяПроводка.КоличествоДт         = - СтрокаДетальная.КоличествоНУ;
						НоваяПроводка.Сумма                = - СтрокаДетальная.СуммаНУ;
						НоваяПроводка.СуммаНеУчитываетсяНУ = - СтрокаДетальная.СуммаНеУчитываетсяНУ;
						НоваяПроводка.СуммаЕНВД            = - СтрокаДетальная.СуммаЕНВД;
						
					КонецЕсли;
					
					СтрокаДетальная.Обрабатывать = Ложь; // Все успешно.
					
				КонецЦикла;
				
				// Учтем возможность разной детализации в БУ и НУ.
				СвойстваСчетаНУ = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаНоменклатура.СчетНУ);
				РаспределениеОстатковНУ.Свернуть("ИФО,КПС,Подразделение,Субконто2,Субконто3",
					"КоличествоНУ,СуммаНУ,СуммаНеУчитываетсяНУ,СуммаЕНВД");
				
				// Формируем остаток НУ с новой аналитикой.
				Для Каждого СтрокаРаспределенияНУ Из РаспределениеОстатковНУ Цикл
					
					НоваяПроводка = ТаблицаПроводок.Добавить();
					НоваяПроводка.ИФО = СтрокаРаспределенияНУ.ИФО;
					НоваяПроводка.КФО = СтрокаНоменклатура.КФО;
					
					НоваяПроводка.СчетДт = СтрокаНоменклатура.СчетНУ;
					Если СвойстваСчетаНУ.УчетПоПодразделениям Тогда
						НоваяПроводка.ПодразделениеДт = СтрокаРаспределенияНУ.Подразделение;
					КонецЕсли;
					Если СвойстваСчетаНУ.УчетПоКПС Тогда
						НоваяПроводка.КПСДт = СтрокаРаспределенияНУ.КПС;
					КонецЕсли;
					БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", "Номенклатура", СтрокаНоменклатура.Номенклатура);
					Если ЗначениеЗаполнено(СвойстваСчетаНУ.ВидСубконто2) Тогда
						БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", СвойстваСчетаНУ.ВидСубконто2, СтрокаРаспределенияНУ.Субконто2);
					КонецЕсли;
					Если ЗначениеЗаполнено(СвойстваСчетаНУ.ВидСубконто3) Тогда
						БухгалтерскийУчет.УстановитьСубконто(НоваяПроводка, "Дт", СвойстваСчетаНУ.ВидСубконто3, СтрокаРаспределенияНУ.Субконто3);
					КонецЕсли;
					
					НоваяПроводка.КоличествоДт         = СтрокаРаспределенияНУ.КоличествоНУ;
					НоваяПроводка.Сумма                = СтрокаРаспределенияНУ.СуммаНУ;
					НоваяПроводка.СуммаНеУчитываетсяНУ = СтрокаРаспределенияНУ.СуммаНеУчитываетсяНУ;
					НоваяПроводка.СуммаЕНВД            = СтрокаРаспределенияНУ.СуммаЕНВД;
					
				КонецЦикла;
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоОстатков, "ДеревоОстатковМЗвНУ");
	
	СвернутьТаблицуПроводок(ТаблицаПроводок);
	
	Если ТаблицаПроводок.Количество() > 0 Тогда
		
		Проводки.Загрузить(ТаблицаПроводок);
		Проводки.Записывать = Истина;
		
		Попытка
			ДокументКорректировки.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Не удалось сформировать документ: %1.'"),
					ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
		
		Объект.ДокументКорректировки = ДокументКорректировки.Ссылка;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сформирован документ %1.'"),
				Объект.ДокументКорректировки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ДокументКорректировки");
		
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='По результатам обработки не сформировано ни одной проводки по счетам НУ.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СвернутьТаблицуПроводок(ТаблицаПроводок)
	
	// Сворачиваем таблицу проводок.
	КолонкиСуммирования = "Сумма,СуммаНеУчитываетсяНУ,СуммаЕНВД,СуммаНДС,ВалютнаяСуммаДт,ВалютнаяСуммаКт,КоличествоДт,КоличествоКт";
	ОбщегоНазначенияБГУ.СвернутьТаблицуИСуммироватьКолонки(ТаблицаПроводок, КолонкиСуммирования);
	
	// Если в результате получились проводки с нулевыми количествами и суммами, удалим их.
	РесурсыПроводки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КолонкиСуммирования, ",");
	ПроводкиКУдалению = Новый Массив;
	Для Каждого Проводка Из ТаблицаПроводок Цикл
		
		ВсеРесурсыНулевые = Истина;
		Для Каждого Ресурс Из РесурсыПроводки Цикл
			Если Проводка[Ресурс] <> 0 Тогда
				ВсеРесурсыНулевые = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		Если ВсеРесурсыНулевые Тогда
			ПроводкиКУдалению.Добавить(Проводка);
		КонецЕсли;
		
	КонецЦикла;
	Для Каждого ПроводкаКУдалению Из ПроводкиКУдалению Цикл
		ТаблицаПроводок.Удалить(ПроводкаКУдалению);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормой

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОчиститьДеревоОстатков();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКорректировкиПриИзменении(Элемент)
	
	ОчиститьДеревоОстатков();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОстатковМЗвНУОбрабатыватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоОстатковМЗвНУ.ТекущиеДанные;
	
	Действие = ?(ТекущиеДанные.Обрабатывать, "Установить", "Снять");
	УстановитьСнятьФлажки(Действие, ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	
	УстановитьСнятьФлажки("Установить");
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	
	УстановитьСнятьФлажки("Снять");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьФлажки(Действие, ИдентификаторСтроки = "")
	
	Если Действие = "Установить" Тогда
		ЗначениеФлажка = Истина;
	ИначеЕсли Действие = "Снять" Тогда
		ЗначениеФлажка = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторСтроки = "" Тогда // Во всех строках.
		
		ЭлементыДерева = ДеревоОстатковМЗвНУ.ПолучитьЭлементы();
		Для Индекс = 0 по ЭлементыДерева.Количество() - 1 Цикл
			СтрокаДерева = ЭлементыДерева.Получить(Индекс);
			УстановитьСнятьФлажки(Действие, СтрокаДерева.ПолучитьИдентификатор());
		КонецЦикла;
		
	Иначе // В выбранной строке.
		
		СтрокаДерева = ДеревоОстатковМЗвНУ.НайтиПоИдентификатору(ИдентификаторСтроки);
		СтрокаДерева.Обрабатывать = ЗначениеФлажка;
		ЭлементыДерева = СтрокаДерева.ПолучитьЭлементы();
		Для Индекс = 0 по ЭлементыДерева.Количество() - 1 Цикл
			СтрокаДерева = ЭлементыДерева.Получить(Индекс);
			УстановитьСнятьФлажки(Действие, СтрокаДерева.ПолучитьИдентификатор());
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьОтмеченныеЭлементыДерева(ЭлементыДерева)
	
	Для Каждого ЭлементДерева Из ЭлементыДерева Цикл
		Если ЭлементДерева.Обрабатывать Тогда
			Элементы.ДеревоОстатковМЗвНУ.Развернуть(ЭлементДерева.ПолучитьИдентификатор());
			РаскрытьОтмеченныеЭлементыДерева(ЭлементДерева.ПолучитьЭлементы());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьДеревоОстатков()
	
	ДеревоОстатков = РеквизитФормыВЗначение("ДеревоОстатковМЗвНУ");
	ДеревоОстатков.Строки.Очистить();
	ЗначениеВРеквизитФормы(ДеревоОстатков, "ДеревоОстатковМЗвНУ");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ИФОдляПереносаИзБГУ1 =
		Справочники.ИсточникиФинансовогоОбеспечения.НайтиПоНаименованию("Служебный ИФО(для переноса)");
	
КонецПроцедуры

#КонецОбласти

