#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти
	
#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт

	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация,Дата,КФО,
		|ВидПоступления,СчетУчетаЗатрат,ПорядокВключенияСтоимостиВСоставРасходовНУ,СтатьяПрочихРасходов,СчетОС.Забалансовый");
	
	ЭтоПоступлениеИзПользования = УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(ЗначенияРеквизитов.ВидПоступления);
	ЭтоПоступлениеНаБаланс = Не ЭтоПоступлениеИзПользования И Не ЗначенияРеквизитов.СчетОСЗабалансовый; 
	
	// Параметры налогового учета
	ОтражатьВНалоговомУчете = УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(ЗначенияРеквизитов);	
	СубконтоНУ = Справочники.ПрочиеДоходыИРасходы.ПустаяСсылка();
	Если ОтражатьВНалоговомУчете Тогда
		Если НалоговыйУчетКлиентСервер.ЭтоПрочиеРасходы(ЗначенияРеквизитов.СчетУчетаЗатрат)
			И ЗначенияРеквизитов.ПорядокВключенияСтоимостиВСоставРасходовНУ <> Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.СтоимостьНеВключаетсяВРасходы Тогда
			СубконтоНУ = ЗначенияРеквизитов.СтатьяПрочихРасходов;
		КонецЕсли;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"						, ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента"				, "Принятие к учету групп объектов ОС (ОС-1б)");
	Запрос.УстановитьПараметр("ЭтоПоступлениеИзПользования"	, ЭтоПоступлениеИзПользования);
	Запрос.УстановитьПараметр("УчетПоПодразделениям"		, УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям());
	Запрос.УстановитьПараметр("СубконтоНУ"					, СубконтоНУ);
	Запрос.УстановитьПараметр("ЭтоПоступлениеНаБаланс"		, ЭтоПоступлениеНаБаланс);
	Запрос.УстановитьПараметр("Счет01"						, БухгалтерскийУчет.СписокСчетов("01"));
	Запрос.УстановитьПараметр("Счет02"						, БухгалтерскийУчет.СписокСчетов("02"));
	Запрос.УстановитьПараметр("Счет21"						, БухгалтерскийУчет.СписокСчетов("21"));
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ПринятиеКУчетуОСОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ЭтоПоступлениеИзПользования
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию
	|						ИЛИ ПринятиеКУчетуОСОсновныеСредства.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1)
	|						ИЛИ ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|			КОНЕЦ
	|	КОНЕЦ КАК Состояние,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|ГДЕ
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	СобытияОС.ОсновноеСредство,
	|	СобытияОС.Организация,
	|	СобытияОС.ИнвНомер,
	|	СобытияОС.Событие,
	|	СобытияОС.ДатаСобытия,
	|	СобытияОС.НомерДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	СобытияОС.Номер КАК НомерДокумента,
	|	СобытияОС.ДатаДокумента,
	|	СобытияОС.Период,
	|	&Ссылка КАК Регистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Номер КАК Номер,
	|		ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
	|		ПринятиеКУчетуОСОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|		ВЫБОР
	|			КОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды)
	|					ИЛИ ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВозвратИзАренды)
	|			КОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования)
	|					ИЛИ ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВозвратИзБезвозмездногоПользования)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|		КОНЕЦ КАК Событие,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК ДатаСобытия,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|		1 КАК Порядок,
	|		ИСТИНА КАК Включать,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период
	|	ИЗ
	|		Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|	ГДЕ
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Номер,
	|		ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация,
	|		ПринятиеКУчетуОСОсновныеСредства.ИнвентарныйНомер,
	|		ВЫБОР
	|			КОГДА &ЭтоПоступлениеИзПользования
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ЭтоПоступлениеИзПользования
	|					ИЛИ ПринятиеКУчетуОСОсновныеСредства.ДатаВводаВЭксплуатацию = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата
	|			ИНАЧЕ ПринятиеКУчетуОСОсновныеСредства.ДатаВводаВЭксплуатацию
	|		КОНЕЦ,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Номер,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата,
	|		2,
	|		ВЫБОР
	|			КОГДА &ЭтоПоступлениеИзПользования
	|					ИЛИ ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21)
	|					ИЛИ ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию
	|					ИЛИ ПринятиеКУчетуОСОсновныеСредства.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата
	|	ИЗ
	|		Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|	ГДЕ
	|		ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка) КАК СобытияОС
	|ГДЕ
	|	СобытияОС.Включать
	|
	|УПОРЯДОЧИТЬ ПО
	|	СобытияОС.Порядок";
	
	НомераТаблиц.Вставить("НачислениеАмортизацииОСБухгалтерскийУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОС.Организация КАК Организация,
	|	ПринятиеКУчетуОС.НачислятьАмортизацию,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуОС.Дата КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОСОсновныеСредства.Ссылка = ПринятиеКУчетуОС.Ссылка
	|ГДЕ
	|	НЕ &ЭтоПоступлениеИзПользования И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21)
	|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОС.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОС.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|	И ПринятиеКУчетуОС.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)";
	
	НомераТаблиц.Вставить("ПараметрыАмортизацииОСБухгалтерскийУчет", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОС.Организация КАК Организация,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуОС.Дата КАК Период,
	|	ПринятиеКУчетуОС.СпособНачисленияАмортизации,
	|	ПринятиеКУчетуОС.ПорядокПогашенияСтоимости
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОСОсновныеСредства.Ссылка = ПринятиеКУчетуОС.Ссылка
	|ГДЕ
	|	НЕ &ЭтоПоступлениеИзПользования
	|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21)
	|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОС.Ссылка = &Ссылка";
	
	НомераТаблиц.Вставить("АмортизацияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуОС.Дата КАК Период,
	|	ПринятиеКУчетуОС.СчетУчетаЗатрат,
	|	ПринятиеКУчетуОС.КЭКЗатрат КАК КЭК,
	|	ПринятиеКУчетуОС.СубконтоЗатрат1 КАК Субконто1,
	|	ПринятиеКУчетуОС.СубконтоЗатрат2 КАК Субконто2,
	|	ПринятиеКУчетуОС.СубконтоЗатрат3 КАК Субконто3,
	|	&СубконтоНУ КАК СубконтоНУ,
	|	ПринятиеКУчетуОС.КПСЗатрат КАК КПС,
	|	ПринятиеКУчетуОС.ПодразделениеЗатрат КАК Подразделение,
	|	ПринятиеКУчетуОС.Организация
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
	|		ПО ПринятиеКУчетуОСОсновныеСредства.Ссылка = ПринятиеКУчетуОС.Ссылка
	|ГДЕ
	|	НЕ &ЭтоПоступлениеИзПользования
	|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21)
	|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОС.Ссылка = &Ссылка
	|	И ПринятиеКУчетуОС.ПорядокПогашенияСтоимости <> ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СтоимостьНеПогашается)";
	
	НомераТаблиц.Вставить("РасчетАмортизацииОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	&Ссылка КАК Регистратор,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.СрокПолезногоИспользования,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ПринятиеКУчетуОСОсновныеСредства.Ссылка.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ПринятиеКУчетуОСОсновныеСредства.ОставшийсяСрокПолезногоИспользования
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СрокИспользованияДляВычисленияАмортизации,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И ПринятиеКУчетуОСОсновныеСредства.Ссылка.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|			ТОГДА ПринятиеКУчетуОСОсновныеСредства.Сумма - ПринятиеКУчетуОСОсновныеСредства.СуммаАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтоимостьДляВычисленияАмортизации,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|ГДЕ
	|	НЕ &ЭтоПоступлениеИзПользования
	|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
	|	И (ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|			ИЛИ ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию))";
	
	НомераТаблиц.Вставить("ВТ_Стоимость", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СтоимостьОбъектовОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.Ссылка.Дата КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ОсновныеСредства.Ссылка.ЦМООтправитель КАК ЦМООтправитель,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ОсновныеСредства.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ОсновныеСредства.Ссылка.ПодразделениеОтправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеОтправитель,
	|	ОсновныеСредства.Сумма КАК Стоимость,
	|	ОсновныеСредства.Количество КАК Количество,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	&ЭтоПоступлениеНаБаланс КАК ЭтоПоступлениеБаланс,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ЦМО <> ОсновныеСредства.Ссылка.ЦМООтправитель
	|				ИЛИ ВЫБОР
	|					КОГДА &УчетПоПодразделениям
	|						ТОГДА ОсновныеСредства.Ссылка.Подразделение <> ОсновныеСредства.Ссылка.ПодразделениеОтправитель
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьПеремещение,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды)
	|				ИЛИ ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПеремещениеБаланс,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет)
	|				ИЛИ ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПеремещениеОперУчет,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21)
	|				ИЛИ &ЭтоПоступлениеНаБаланс
	|					И ОсновныеСредства.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию)
	|					И ОсновныеСредства.Ссылка.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПоступлениеОперУчет
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И ОсновныеСредства.Сумма <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПеремещениеОперУчет
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	Таблица.Период КАК Период,
	|	Таблица.Организация КАК Организация,
	|	Таблица.ОсновноеСредство КАК ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	Таблица.ЦМООтправитель КАК ЦМО,
	|	Таблица.ПодразделениеОтправитель КАК Подразделение,
	|	Таблица.Стоимость КАК Стоимость,
	|	Таблица.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение) КАК Событие,
	|	Таблица.НазваниеДокумента КАК НазваниеДокумента,
	|	Таблица.НомерДокумента КАК НомерДокумента,
	|	Таблица.ДатаДокумента КАК ДатаДокумента,
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	1 КАК НомерТаблицы
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	(Таблица.ЭтоПеремещениеБаланс
	|			ИЛИ Таблица.ЭтоПеремещениеОперУчет)
	|	И Таблица.ЕстьПеремещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПеремещениеОперУчет
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ,
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.Подразделение,
	|	Таблица.Стоимость,
	|	Таблица.Количество,
	|	ВЫБОР
	|		КОГДА Таблица.ЭтоПоступлениеБаланс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|	КОНЕЦ,
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	2
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	(Таблица.ЭтоПоступлениеБаланс
	|			ИЛИ (Таблица.ЭтоПеремещениеБаланс
	|				ИЛИ Таблица.ЭтоПеремещениеОперУчет)
	|				И Таблица.ЕстьПеремещение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.Подразделение,
	|	Таблица.Стоимость,
	|	Таблица.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	3
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеБаланс
	|	И Таблица.ЭтоПоступлениеОперУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет),
	|	Таблица.Период,
	|	Таблица.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.ЦМО,
	|	Таблица.Подразделение,
	|	Таблица.Стоимость,
	|	Таблица.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету),
	|	Таблица.НазваниеДокумента,
	|	Таблица.НомерДокумента,
	|	Таблица.ДатаДокумента,
	|	Таблица.НомерСтроки,
	|	4
	|ИЗ
	|	ВТ_Стоимость КАК Таблица
	|ГДЕ
	|	Таблица.ЭтоПоступлениеОперУчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	НомерТаблицы";

	НомераТаблиц.Вставить("АмортизацияОбъектовОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Таблица.Ссылка.Дата КАК Период,
	|	Таблица.Ссылка.Организация,
	|	Таблица.ОсновноеСредство,
	|	Таблица.ИнвентарныйНомер,
	|	Таблица.Ссылка.Подразделение,
	|	ВЫБОР
	|		КОГДА Таблица.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|				И Таблица.Ссылка.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|				И Таблица.Ссылка.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию
	|			ТОГДА Таблица.Сумма
	|		ИНАЧЕ Таблица.СуммаАмортизации
	|	КОНЕЦ КАК СуммаАмортизации
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК Таблица
	|ГДЕ
	|	&ЭтоПоступлениеНаБаланс
	|	И Таблица.Ссылка = &Ссылка
	|	И ВЫБОР
	|			КОГДА Таблица.Ссылка.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|					И Таблица.Ссылка.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|					И Таблица.Ссылка.ПринятиеКУчетуОдновременноСВводомВЭксплуатацию
	|				ТОГДА Таблица.Сумма
	|			ИНАЧЕ Таблица.СуммаАмортизации
	|		КОНЕЦ <> 0";	
	
	НомераТаблиц.Вставить("ОсновныеСредстваВПользовании", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ПринятиеКУчетуОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды)
	|				ИЛИ ПринятиеКУчетуОСОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВозвратИзАренды)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВозвратИзБезвозмездногоПользования)
	|	КОНЕЦ КАК Событие,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК ДатаСобытия,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
	|ГДЕ
	|	&ЭтоПоступлениеИзПользования
	|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка";
	
	НомераТаблиц.Вставить("СтоимостьОбъектовОСПоКонтрагентам", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды)
	|		или ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВАренду)
	|		КОГДА ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования)
	|		или ОсновныеСредства.Ссылка.ВидПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользованияОперУчет)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПереданоВПользование)
	|		КОГДА ОсновныеСредства.Ссылка.СчетОС В (&Счет01)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПолученоВПользование)
	|		КОГДА ОсновныеСредства.Ссылка.СчетОС В (&Счет02)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ПустаяСсылка)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	ОсновныеСредства.Ссылка.Дата КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ОсновныеСредства.Ссылка.Контрагент КАК Контрагент,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.Сумма КАК Стоимость
	|ИЗ
	|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|	И (&ЭтоПоступлениеИзПользования
	|			ИЛИ ОсновныеСредства.Ссылка.СчетОС В (&Счет01)
	|			ИЛИ ОсновныеСредства.Ссылка.СчетОС В (&Счет02))";	
	
	Если НЕ ЭтоПоступлениеИзПользования Тогда
		
		НомераТаблиц.Вставить("ПервоначальныеСведенияОСБухгалтерскийУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ВЫБОР
		|		КОГДА СУММА(ПринятиеКУчетуОСОсновныеСредства.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ПринятиеКУчетуОСОсновныеСредства.Сумма) / СУММА(ПринятиеКУчетуОСОсновныеСредства.Количество)
		|	КОНЕЦ КАК ПервоначальнаяСтоимость,
		|	ВЫБОР
		|		КОГДА СУММА(ПринятиеКУчетуОСОсновныеСредства.Количество) = 0
		|			ТОГДА 0
		|		ИНАЧЕ СУММА(ПринятиеКУчетуОСОсновныеСредства.Сумма) / СУММА(ПринятиеКУчетуОСОсновныеСредства.Количество)
		|	КОНЕЦ КАК ПервоначальнаяСтоимостьВВалюте,
		|	ВалютаРегламентированногоУчета.Значение КАК ВалютаПоступления,
		|	СУММА(ПринятиеКУчетуОСОсновныеСредства.Количество) КАК Количество,
		|	1 КАК Курс,
		|	1 КАК Кратность,
		|	СУММА(ПринятиеКУчетуОСОсновныеСредства.СуммаАмортизации) КАК ПервоначальнаяСуммаАмортизации
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства,
		|	Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ГДЕ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация,
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство,
		|	ВалютаРегламентированногоУчета.Значение";
		
	КонецЕсли;
	
	#Область НалоговыйУчет	
	Если ОтражатьВНалоговомУчете Тогда
		
		НомераТаблиц.Вставить("НачислениеАмортизацииОСНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.НачислятьАмортизациюНУ КАК НачислятьАмортизацию,
		|	&Ссылка КАК Регистратор,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
		|ГДЕ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
		|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)";
		
		НомераТаблиц.Вставить("ПараметрыАмортизацииОСНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.СрокПолезногоИспользованияНУ КАК СрокПолезногоИспользования,
		|	&Ссылка КАК Регистратор,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
		|ГДЕ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
		|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)";
		
		НомераТаблиц.Вставить("ПараметрыАмортизационнойПремииНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.СчетУчетаЗатратПоАмортизационнойПремии КАК СчетУчетаРасходов,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.СубконтоПоАмортизационнойПремии1 КАК СубконтоРасходов1,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.СубконтоПоАмортизационнойПремии2 КАК СубконтоРасходов2,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.СубконтоПоАмортизационнойПремии3 КАК СубконтоРасходов3,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПодразделениеПоАмортизационнойПремии КАК ПодразделениеРасходов,
		|	&Ссылка КАК Регистратор,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
		|ГДЕ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
		|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
		|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПроцентКапитальныхВложенийВключаемыхВРасходыНУ > 0";
		
		НомераТаблиц.Вставить("НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.СпециальныйКоэффициентНУ КАК СпециальныйКоэффициент,
		|	&Ссылка КАК Регистратор,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
		|ГДЕ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка
		|	И ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокВключенияСтоимостиВСоставРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)";
		
		НомераТаблиц.Вставить("ПервоначальныеСведенияОСНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокВключенияСтоимостиВСоставРасходовНУ КАК ПорядокВключенияСтоимостиВСоставРасходов,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПервоначальнаяСтоимостьНУ КАК ПервоначальнаяСтоимостьНУ,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.РасходыНеУчитываетсяНУ КАК РасходыНеУчитываетсяНУ,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.РасходыЕНВД КАК РасходыЕНВД,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК ДатаПринятияКУчету,
		|	&Ссылка КАК Регистратор,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
		|ГДЕ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка";
		
	КонецЕсли;
	#КонецОбласти
	
	#Область УпрощеннаяСистемаНалогообложения
	Если УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(ДокументСсылка) Тогда
		
		НомераТаблиц.Вставить("ПервоначальныеСведенияОСНалоговыйУчетУСН", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПринятиеКУчетуОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокВключенияСтоимостиВСоставРасходовУСН КАК ПорядокВключенияСтоимостиВСоставРасходовУСН,
		|	ВЫБОР
		|		КОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.ПорядокВключенияСтоимостиВСоставРасходовУСН = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА)
		|			ТОГДА ПринятиеКУчетуОСОсновныеСредства.Ссылка.СрокПолезногоИспользованияУСН
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СрокПолезногоИспользования,
		|	&Ссылка КАК Регистратор,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Дата КАК Период,
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка.Организация КАК Организация
		|ИЗ
		|	Документ.ПринятиеКУчетуОС.ОсновныеСредства КАК ПринятиеКУчетуОСОсновныеСредства
		|ГДЕ
		|	ПринятиеКУчетуОСОсновныеСредства.Ссылка = &Ссылка";
		
	КонецЕсли;
	#КонецОбласти
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПринятиеКУчетуОС";
	КомандаПечати.Идентификатор		= "ОС1б";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о приеме - передаче групп объектов ОС (ОС-1б)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС1б") Тогда
		
		ДанныеДокументов = УправлениеОсновнымиСредствами.ДокументыДляПечатиАктОС1_ПринятиеКУчету(МассивОбъектов, Ложь, Ложь, Истина);
		УправлениеОсновнымиСредствами.НапечататьОС1(ДанныеДокументов, ОбъектыПечати, ТабличныйДокумент); 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1б","ОС-1б", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
