#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТаблицаОС = ОсновныеСредства.Выгрузить(,"ОсновноеСредство, ИнвентарныйНомер, Количество, НомерСтроки");
	ТаблицаОС.Колонки.Добавить("СчетУчета", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаОС.ЗаполнитьЗначения(СчетОС, "СчетУчета");
	ПределыОС = УправлениеОсновнымиСредствамиКлиентСервер.ПолучитьПределыОС(Дата);
	Если НЕ УправлениеОсновнымиСредствами.ПроверитьЗаполнениеТаблицыОС(	ТаблицаОС,
																		ПервоначальнаяСтоимость, 
																		ПределыОС.ПервыйПределОС,
																		ПределыОС.ВторойПределОС,
																		Дата) Тогда
		Отказ = Истина;
	КонецЕсли;		
		
	Если Отказ Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПоступлениеИзПользования(ВидПоступления) Тогда
		Если ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды
				ИЛИ ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования Тогда
			
			УправлениеОсновнымиСредствами.ПроверитьСобытиеОСвПользовании(
				ОсновныеСредства.Выгрузить(,"НомерСтроки, ОсновноеСредство, ИнвентарныйНомер"),
				Организация,
				Дата,
				Ссылка,
				Ложь,
				?(ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды
					ИЛИ ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет,
					Перечисления.ВидыСобытийОС.СдачаВАренду,
					Перечисления.ВидыСобытийОС.ПередачаВБезвозмездноеПользование),
				Отказ);
		КонецЕсли;
			
		Если Отказ Тогда
			ПроверяемыеРеквизиты.Очистить();
			Возврат;
		КонецЕсли;
		
		Если ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды
			ИЛИ ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАрендыОперУчет Тогда
			СчетОбъекта = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("25");
		Иначе
			СчетОбъекта = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("26");
		КонецЕсли;
		
		ПризнакиУчета = БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета(СчетОбъекта);
		
		МассивНепроверяемыхРеквизитов.Добавить("ВнеоборотныйАктив");
		МассивНепроверяемыхРеквизитов.Добавить("СчетКредита");
		МассивНепроверяемыхРеквизитов.Добавить("ПервоначальнаяСтоимость");
		
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользования");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатрат");
		МассивНепроверяемыхРеквизитов.Добавить("СубконтоЗатрат1");
		МассивНепроверяемыхРеквизитов.Добавить("СубконтоЗатрат2");
		МассивНепроверяемыхРеквизитов.Добавить("СубконтоЗатрат3");
		МассивНепроверяемыхРеквизитов.Добавить("КЭКЗатрат");
		МассивНепроверяемыхРеквизитов.Добавить("ПодразделениеЗатрат");
		Если Не ПризнакиУчета.УчетПоКПС Тогда
			МассивНепроверяемыхРеквизитов.Добавить("КПС");
		КонецЕсли;
		Если Не ПризнакиУчета.УчетПоПодразделениям Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Подразделение");
			МассивНепроверяемыхРеквизитов.Добавить("ПодразделениеОтправитель");
		КонецЕсли;
			
		МассивНепроверяемыхРеквизитов.Добавить("СпособНачисленияАмортизации");
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокПогашенияСтоимости");
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатратПоАмортизационнойПремии");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовУСН");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияУСН");
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		Возврат;
		
	Иначе
			
		МассивНепроверяемыхРеквизитов.Добавить("ЦМООтправитель");
		МассивНепроверяемыхРеквизитов.Добавить("ПодразделениеОтправитель");
		
	КонецЕсли;
	
	Если ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет101
		ИЛИ ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВнеоборотныйАктив");
		МассивНепроверяемыхРеквизитов.Добавить("СчетКредита");
		МассивНепроверяемыхРеквизитов.Добавить("ПервоначальнаяСтоимость");
	КонецЕсли;		
	
	Если ОсновныеСредстваУжеПринятыКУчету() Тогда
		ПроверяемыеРеквизиты.Очистить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПараметрыАмортизацииСовпадаютСРанееПринятыми() Тогда
		ПроверяемыеРеквизиты.Очистить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		ПроверяемыеРеквизиты.Очистить();
		Возврат;
	КонецЕсли;
	
	СтоимостьНеПогашается = ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21;
	УправлениеОсновнымиСредствами.ДобавитьНепроверяемыеРеквизитыСчетаЗатрат(СтоимостьНеПогашается, ПорядокПогашенияСтоимости, СчетУчетаЗатрат, МассивНепроверяемыхРеквизитов);

	Если ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет21") Тогда
		Если НЕ БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетОС).УчетПоКПС Тогда
			МассивНепроверяемыхРеквизитов.Добавить("КПС");
		КонецЕсли;
	ИначеЕсли ОсновныеСредства.Количество()>0 Тогда
		Если НЕ БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетОС).УчетПоКПС Тогда
			МассивНепроверяемыхРеквизитов.Добавить("КПС");
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("КПС");
	КонецЕсли;
	
	#Область НалоговыйУчет
	
	Если НЕ УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеПринятиеКУчету(ЭтотОбъект) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатратПоАмортизационнойПремии");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
	КонецЕсли;
	
	Если НЕ НалоговыйУчетКлиентСервер.ЭтоПрочиеРасходы(СчетУчетаЗатрат)
	 ИЛИ ПорядокВключенияСтоимостиВСоставРасходовНУ = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.СтоимостьНеВключаетсяВРасходы Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
	КонецЕсли;
	
	Если НЕ ПорядокВключенияСтоимостиВСоставРасходовНУ = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если НЕ НачислятьАмортизациюНУ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если ПорядокВключенияСтоимостиВСоставРасходовНУ <> Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации
			ИЛИ ПроцентКапитальныхВложенийВключаемыхВРасходыНУ = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатратПоАмортизационнойПремии");
	КонецЕсли;
	
	#КонецОбласти
	
	#Область УпрощеннаяСистемаНалогообложения
	
	Если НЕ УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВУСНДоходыМинусРасходыПринятиеКУчету(ЭтотОбъект) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовУСН");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияУСН");
	КонецЕсли;
	
	Если ПорядокВключенияСтоимостиВСоставРасходовУСН <>
			Перечисления.ПорядокВключенияСтоимостиОСиНМАВСоставРасходовУСН.ВключитьВСоставРасходовНаОСиНМА Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияУСН");
	КонецЕсли;
	
	#КонецОбласти
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	УправлениеОсновнымиСредствами.ПроверитьДублиИнвентарныхНомеровВТабЧасти(ЭтотОбъект, "ОсновныеСредства", Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбъектКопирования.ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет101 Тогда
		ПервоначальнаяСтоимость = 0;
		ПервоначальнаяСтоимостьНУ = 0;
		Количество = 0;
		Для каждого ТекСтр Из ОсновныеСредства Цикл
			ТекСтр.Сумма = 0;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ОсновныеСредства.Итог("Количество")>Количество Тогда
			ТекстСообщения = НСтр("ru='В табличной части превышено допустимое количество ОС'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	СуммаДокумента = ОсновныеСредства.Итог("Сумма");
	
	Если ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет101 Тогда
		Для каждого ТекСтр Из ОсновныеСредства Цикл
			Если ТекСтр.СуммаАмортизации <> 0 Тогда
				ТекСтр.СуммаАмортизации = 0;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекСтр.ДатаВводаВЭксплуатацию) Тогда
				ТекСтр.ДатаВводаВЭксплуатацию = '00010101';
			КонецЕсли;
			Если ТекСтр.ОставшийсяСрокПолезногоИспользования<>0 Тогда
				ТекСтр.ОставшийсяСрокПолезногоИспользования = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление
		И ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение Тогда
		
		ВнеоборотныйАктив = Неопределено;
		СчетКредита = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОсновныеСредстваУжеПринятыКУчету()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СобытияОС.Организация,
	               |	СобытияОС.ОсновноеСредство,
	               |	СобытияОС.ИнвНомер,
	               |	СобытияОС.Событие,
	               |	СобытияОС.Регистратор,
	               |	СобытияОС.МоментВремени,
	               |	ВЫБОР
	               |		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	               |			ТОГДА 1
	               |		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК Поле1
	               |ПОМЕСТИТЬ СобытияОС
	               |ИЗ
	               |	РегистрСведений.СобытияОС КАК СобытияОС
	               |ГДЕ
	               |	СобытияОС.Организация = &Организация
	               |	И СобытияОС.ОсновноеСредство В (&ОсновноеСредство)
	               |	И СобытияОС.ИнвНомер В(&ИнвНомер)
	               |	И &УсловиеПоПериоду
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СобытияОС.Организация,
	               |	СобытияОС.ОсновноеСредство,
	               |	СобытияОС.ИнвНомер КАК ИнвентарныйНомер,
	               |	ПРЕДСТАВЛЕНИЕ(СобытияОС.ИнвНомер) КАК ПредставлениеИнвентарныйНомер,
	               |	СобытияОС.Регистратор,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(СобытияОС.ИнвНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК БезИнвНомера,
	               |	ПРЕДСТАВЛЕНИЕ(СобытияОС.Событие) КАК Событие,
	               |	ПРЕДСТАВЛЕНИЕ(СобытияОС.Регистратор) Как ПредставлениеРегистратора
	               |ИЗ
	               |	СобытияОС КАК СобытияОС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			СобытияОС.Организация КАК Организация,
	               |			СобытияОС.ОсновноеСредство КАК ОсновноеСредство,
	               |			СобытияОС.ИнвНомер КАК ИнвНомер,
	               |			МИНИМУМ(СобытияОС.Поле1) КАК МинимумПорядок
	               |		ИЗ
	               |			СобытияОС КАК СобытияОС
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			СобытияОС.Организация,
	               |			СобытияОС.ОсновноеСредство,
	               |			СобытияОС.ИнвНомер) КАК ВложенныйЗапрос
	               |		ПО СобытияОС.Организация = ВложенныйЗапрос.Организация
	               |			И СобытияОС.ОсновноеСредство = ВложенныйЗапрос.ОсновноеСредство
	               |			И СобытияОС.ИнвНомер = ВложенныйЗапрос.ИнвНомер
	               |			И СобытияОС.Поле1 = ВложенныйЗапрос.МинимумПорядок";
	Если ЭтотОбъект.ЭтоНовый() Тогда
		УсловиеПоПериоду = "СобытияОС.Период <= &Период";
		Запрос.УстановитьПараметр("Период", 		КонецДня(Дата));
	Иначе
		УсловиеПоПериоду = "СобытияОС.МоментВремени <= &МоментВремени
	               |	И СобытияОС.Регистратор <> &Регистратор";
		Запрос.УстановитьПараметр("МоментВремени",	МоментВремени());
		Запрос.УстановитьПараметр("Регистратор",	Ссылка);
	КонецЕсли;	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоПериоду", УсловиеПоПериоду);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство",	ОсновныеСредства.ВыгрузитьКолонку("ОсновноеСредство"));
	Запрос.УстановитьПараметр("ИнвНомер",			ОсновныеСредства.ВыгрузитьКолонку("ИнвентарныйНомер"));
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		УжеПринятыКУчету = Ложь;
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ИнвентарныйНомер) Тогда
				УжеПринятыКУчету = Истина;
				ТекстСообщения = НСтр("ru='По выбранному инвентарному номеру [ИнвентарныйНомер] уже произведено [ВидСобытияОС] документом [Регистратор]'");
				ВставляемыеПараметры = Новый Структура("ИнвентарныйНомер, ВидСобытияОС, Регистратор", Выборка.ПредставлениеИнвентарныйНомер, Выборка.Событие, Выборка.ПредставлениеРегистратора);
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения, ВставляемыеПараметры);
				ТекСтр = ОсновныеСредства.Найти(Выборка.ИнвентарныйНомер, "ИнвентарныйНомер");
				Если ТекСтр=Неопределено Тогда
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Иначе
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновныеСредства["+(ТекСтр.НомерСтроки-1)+"].ИнвентарныйНомер");
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат УжеПринятыКУчету;
	КонецЕсли;
				
КонецФункции

Функция ПараметрыАмортизацииСовпадаютСРанееПринятыми()

	Результат = Истина;
	
	Если ОсновныеСредства.Количество()>0
		И (СпособНачисленияАмортизации = Перечисления.СпособНачисленияАмортизации.Линейный
			ИЛИ СпособНачисленияАмортизации = Перечисления.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
		И ЗначениеЗаполнено(СчетУчетаЗатрат) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АмортизацияОС.СчетУчетаЗатрат,
		               |	АмортизацияОС.Подразделение,
		               |	АмортизацияОС.КПС,
		               |	АмортизацияОС.КЭК,
		               |	АмортизацияОС.Субконто1,
		               |	АмортизацияОС.Субконто2,
		               |	АмортизацияОС.Субконто3,
		               |	АмортизацияОС.Регистратор,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.СчетУчетаЗатрат) КАК ПредставлениеСчетУчетаЗатрат,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.Подразделение) КАК ПредставлениеПодразделение,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.КПС) КАК ПредставлениеКПС,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.КЭК) КАК ПредставлениеКЭК,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.Субконто1) КАК ПредставлениеСубконто1,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.Субконто2) КАК ПредставлениеСубконто2,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.Субконто3) КАК ПредставлениеСубконто3,
		               |	ПРЕДСТАВЛЕНИЕ(АмортизацияОС.Регистратор) КАК ПредставлениеРегистратор
		               |ИЗ
		               |	РегистрСведений.АмортизацияОС КАК АмортизацияОС
		               |ГДЕ
		               |	АмортизацияОС.ОсновноеСредство = &ОсновноеСредство
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	АмортизацияОС.МоментВремени";
		Запрос.УстановитьПараметр("ОсновноеСредство", ОсновныеСредства[0].ОсновноеСредство);					   
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Истина;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Если Выборка.Регистратор = Ссылка Тогда
			Возврат Истина;
		КонецЕсли;
		
		Результат =	Выборка.СчетУчетаЗатрат = СчетУчетаЗатрат
					И (Выборка.КПС = КПСЗатрат
						ИЛИ (Не ЗначениеЗаполнено(Выборка.КПС) И НЕ ЗначениеЗаполнено(КПСЗатрат)))
					И Выборка.КЭК = КЭКЗатрат
					И (Выборка.Подразделение = ПодразделениеЗатрат
						ИЛИ (НЕ ЗначениеЗаполнено(Выборка.Подразделение) И НЕ ЗначениеЗаполнено(ПодразделениеЗатрат)))
					И (Выборка.Субконто1 = СубконтоЗатрат1
						ИЛИ (НЕ ЗначениеЗаполнено(Выборка.Субконто1) И НЕ ЗначениеЗаполнено(СубконтоЗатрат1)))
					И (Выборка.Субконто2 = СубконтоЗатрат2
						ИЛИ (НЕ ЗначениеЗаполнено(Выборка.Субконто2) И НЕ ЗначениеЗаполнено(СубконтоЗатрат2)))
					И (Выборка.Субконто3 = СубконтоЗатрат3
						ИЛИ (НЕ ЗначениеЗаполнено(Выборка.Субконто3) И НЕ ЗначениеЗаполнено(СубконтоЗатрат3)));
						
		Если НЕ Результат Тогда
			ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
																НСтр("ru='Реквизиты начисления амортизации не совпадают с реквизитами,"
																+ "указанными при первом приеме к учету документом [Регистратор]'"),
																Новый Структура("Регистратор", Выборка.ПредставлениеРегистратор)));
			СтрокаОшибки = НСтр("ru='Был указан ""[ИмяРеквизита]"": [ЗначениеРеквизита]'");													
			Если НЕ Выборка.СчетУчетаЗатрат = СчетУчетаЗатрат Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(СтрокаОшибки,
																		Новый Структура("ИмяРеквизита, ЗначениеРеквизита",
																						"счет затрат",
																						Выборка.ПредставлениеСчетУчетаЗатрат)),
																	,"Объект.СчетУчетаЗатрат");
			КонецЕсли;
			Если НЕ (Выборка.КПС = КПСЗатрат
					ИЛИ (Не ЗначениеЗаполнено(Выборка.КПС) И НЕ ЗначениеЗаполнено(КПСЗатрат))) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(СтрокаОшибки,
																		Новый Структура("ИмяРеквизита, ЗначениеРеквизита",
																						"КПС затрат",
																						Выборка.ПредставлениеКПС)),
																	,"Объект.КПСЗатрат");
			КонецЕсли;
			Если НЕ Выборка.КЭК = КЭКЗатрат Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(СтрокаОшибки,
																		Новый Структура("ИмяРеквизита, ЗначениеРеквизита",
																						"КЭК затрат",
																						Выборка.ПредставлениеКЭК)),
																	,"Объект.КЭКЗатрат");
			КонецЕсли;
			СтрокаОшибки = НСтр("ru='Было указано ""[ИмяРеквизита]"": [ЗначениеРеквизита]'");													
			Если НЕ (Выборка.Субконто1 = СубконтоЗатрат1
						ИЛИ (НЕ ЗначениеЗаполнено(Выборка.Субконто1) И НЕ ЗначениеЗаполнено(СубконтоЗатрат1))) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(СтрокаОшибки,
																		Новый Структура("ИмяРеквизита, ЗначениеРеквизита",
																						"Субконто затрат 1",
																						Выборка.ПредставлениеСубконто1)),
																	,"Объект.СубконтоЗатрат1");
			КонецЕсли;
			Если НЕ (Выборка.Субконто2 = СубконтоЗатрат2
						ИЛИ (НЕ ЗначениеЗаполнено(Выборка.Субконто2) И НЕ ЗначениеЗаполнено(СубконтоЗатрат2))) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(СтрокаОшибки,
																		Новый Структура("ИмяРеквизита, ЗначениеРеквизита",
																						"Субконто затрат 2",
																						Выборка.ПредставлениеСубконто2)),
																	,"Объект.СубконтоЗатрат2");
			КонецЕсли;
			Если НЕ (Выборка.Субконто3 = СубконтоЗатрат3
						ИЛИ (НЕ ЗначениеЗаполнено(Выборка.Субконто3) И НЕ ЗначениеЗаполнено(СубконтоЗатрат3))) Тогда
				ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(СтрокаОшибки,
																		Новый Структура("ИмяРеквизита, ЗначениеРеквизита",
																						"Субконто затрат 3",
																						Выборка.ПредставлениеСубконто3)),
																	,"Объект.СубконтоЗатрат3");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции // ПараметрыАмортизацииСовпадаютСРанееПринятыми()

#КонецОбласти

#КонецЕсли