#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьОтчет(Знач ПараметрыОтчета, ВозвратАдресХранилищаРезультата, ДокументРезультат = Неопределено) Экспорт
	
	Перем	ЗаполнитьДанныеДляДекларации,
		ДанныеДляДекларации;
	
	// Установленные параметры отчета:
	Если ЗначениеЗаполнено(ПараметрыОтчета["ДатаНачала"]) Тогда
		ПараметрыОтчета["ДатаНачала"] = НачалоДня(ПараметрыОтчета["ДатаНачала"]);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета["ДатаКонца"]) Тогда
		ПараметрыОтчета["ДатаКонца"] = КонецДня(ПараметрыОтчета["ДатаКонца"]);
	КонецЕсли;
	
	ДобавитьРедакциюПостановления(ПараметрыОтчета);
	
	// Декларация
	ПараметрыОтчета.Свойство("ЗаполнитьДанныеДляДекларации", ЗаполнитьДанныеДляДекларации);
	ЗаполнитьДанныеДляДекларации = (ЗаполнитьДанныеДляДекларации = Истина);
	ПараметрыОтчета.Вставить("ЗаполнитьДанныеДляДекларации", ЗаполнитьДанныеДляДекларации);
	Если ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
		
		ДанныеДляДекларации = Новый Структура();
		ИнициализироватьТаблицыДляДекларацииПоНДС(ДанныеДляДекларации);
		
	КонецЕсли;
	
	СформироватьЖурналУчета(ПараметрыОтчета, ДанныеДляДекларации, ДокументРезультат);
	
КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Регистры учета

Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции	

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	СвойстваРегистраУчета.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	СвойстваРегистраУчета.Вставить("ДатаНачала", '00010101');
	СвойстваРегистраУчета.Вставить("ДатаКонца", '00010101');
	СвойстваРегистраУчета.Вставить("Подразделение", Справочники.Подразделения.ПустаяСсылка());
	
	НастройкиОтчета = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПериод = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ПараметрПериод <> Неопределено Тогда
		Период = ПараметрПериод.Значение; // СтандартныйПериод
		СвойстваРегистраУчета.ДатаНачала = Период.ДатаНачала;
		СвойстваРегистраУчета.ДатаКонца = Период.ДатаОкончания;
	КонецЕсли;
	
	ПараметрОрганизация = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если ПараметрОрганизация <> Неопределено Тогда
		СвойстваРегистраУчета.Организация = ПараметрОрганизация.Значение;
	КонецЕсли;
	
	ПараметрПодразделение = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Подразделение"));
	Если ПараметрПодразделение <> Неопределено
			И ПараметрПодразделение.Использование Тогда
		СвойстваРегистраУчета.Подразделение = ПараметрПодразделение.Значение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СвойстваРегистраУчета.ДатаНачала)
			Или Не ЗначениеЗаполнено(СвойстваРегистраУчета.КонецПериода)
			Или Не ЗначениеЗаполнено(СвойстваРегистраУчета.Организация) Тогда
		СвойстваРегистраУчета.Вставить("НетДанных", Истина);
	КонецЕсли;				
КонецПроцедуры	

#КонецОбласти

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Настройки

Функция ПолучитьИспользуемыйМакет(ПараметрыОтчета)
	
	РедакцияПостановления = ПараметрыОтчета.РедакцияПостановления;
	
	Если РедакцияПостановления = "№ 26 от 23.01.2026" Тогда
		ИмяМакета = "ОбщийМакет.ПФ_MXL_ЖурналУчетаПолученныхВыставленныхСчетовФактур1137_26";
	Иначе
		ИмяМакета = "ОбщийМакет.ПФ_MXL_ЖурналУчетаПолученныхВыставленныхСчетовФактур1137_534";
	КонецЕсли;
	
	Возврат УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
КонецФункции

Процедура ДобавитьРедакциюПостановления(ПараметрыОтчета)
	
	НаДату = ПараметрыОтчета.ДатаКонца;
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		НаДату = Неопределено;
	КонецЕсли;
	
	РедакцияПостановления = УчетНДС.ПолучитьПостановлениеПоУмолчаниюДляЗаполненияКниги("Журнал", НаДату); 
	
	ПараметрыОтчета.Вставить("РедакцияПостановления", РедакцияПостановления);
	
КонецПроцедуры

Функция ПолучитьНастройкиСКД(ПараметрыОтчета)
	
	Результат = Новый Структура("
		|ИспользуемаяСхемаКомпоновкиДанных,
		|НовыйКомпоновщикНастроек");
	
	// Возвращаемые объекты:
	ИспользуемаяСхемаКомпоновкиДанных	= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НовыйКомпоновщикНастроек			= Новый КомпоновщикНастроекКомпоновкиДанных();
	НовыйКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ИспользуемаяСхемаКомпоновкиДанных));
	НовыйКомпоновщикНастроек.ЗагрузитьНастройки(ИспользуемаяСхемаКомпоновкиДанных.ВариантыНастроек["Основной"].Настройки);
	
	// Настраиваем схему.
	УстановитьПараметрыСКД(НовыйКомпоновщикНастроек, ПараметрыОтчета);
	
	// Копируем отбор, установленный в форме отчета:
	СтандартныеОтчетыКлиентСервер.СкопироватьОтбор(
		НовыйКомпоновщикНастроек.Настройки.Отбор,
		ПараметрыОтчета["КомпоновщикНастроек"].Настройки.Отбор);
	
	// Настройки группировок:
	Настройки = НовыйКомпоновщикНастроек.Настройки;
	ГруппировкаНалоговыйПериод				= Настройки.Структура[0];
	ГруппировкаОднимСписком					= Настройки.Структура[1];
	
	Если ПараметрыОтчета["ЗаполнитьДанныеДляДекларации"] Тогда
		ГруппировкаНалоговыйПериод.Использование			= Истина;
		ГруппировкаОднимСписком.Использование				= Ложь;
	Иначе
		ГруппировкаНалоговыйПериод.Использование			= Ложь;
		ГруппировкаОднимСписком.Использование				= Истина;
	КонецЕсли;
	
	Результат["ИспользуемаяСхемаКомпоновкиДанных"]	= ИспользуемаяСхемаКомпоновкиДанных;
	Результат["НовыйКомпоновщикНастроек"]			= НовыйКомпоновщикНастроек;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрыСКД(КомпоновщикНастроек, ПараметрыОтчета)
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаНачала", ПараметрыОтчета["ДатаНачала"]);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ДатаКонца", ПараметрыОтчета["ДатаКонца"]);
	
	ВыводимыеЧастиЖурнала = Новый СписокЗначений();
	Если ПараметрыОтчета["ВыводитьЧасть1"] Тогда
		ВыводимыеЧастиЖурнала.Добавить(Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры);
	КонецЕсли;
	Если ПараметрыОтчета["ВыводитьЧасть2"] Тогда
		ВыводимыеЧастиЖурнала.Добавить(Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры);
	КонецЕсли;
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводимыеЧастиЖурнала",	ВыводимыеЧастиЖурнала);
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ИспользоватьУчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	ПричиныНалогообложенияШкурыЛом = Новый СписокЗначений();
	ПричиныНалогообложенияШкурыЛом.Добавить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученныйЛом);
	ПричиныНалогообложенияШкурыЛом.Добавить(Перечисления.ПричиныНалогообложенияНДС.РеализацияЛом);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПричиныНалогообложенияШкурыЛом", ПричиныНалогообложенияШкурыЛом);
	
	ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВалютаРУ", ВалютаРУ);
	
КонецПроцедуры

#КонецОбласти

#Область ВыводТаблицы

Процедура СформироватьЖурналУчета(ПараметрыОтчета, ДанныеДляДекларации, ДокументРезультат = Неопределено)
	
	РезультатДерево = Новый ДеревоЗначений();
	
	// Настраиваем схему КД:
	НастройкиСКД = ПолучитьНастройкиСКД(ПараметрыОтчета);
	ИспользуемаяСхемаКомпоновкиДанных	= НастройкиСКД["ИспользуемаяСхемаКомпоновкиДанных"];
	НовыйКомпоновщикНастроек			= НастройкиСКД["НовыйКомпоновщикНастроек"];
	
	// Декларация
	// СегментацияДанныхДекларации
	Если ПараметрыОтчета["ЗаполнитьДанныеДляДекларации"] Тогда
		УчетНДС.СегментацияДанныхДекларации_ИнициализироватьПараметры(ПараметрыОтчета, "10, 11");
	КонецЕсли;
	
	// Выполняем схему:
	Попытка
		// Выводим результат в дерево:
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(
			ИспользуемаяСхемаКомпоновкиДанных,				// 1
			НовыйКомпоновщикНастроек.ПолучитьНастройки(),	// 2
			,												// 3
			,												// 4
			Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));// 5
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных();
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
		ПроцессорВывода.УстановитьОбъект(РезультатДерево);
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
		УчетНДС.СвернутьОдноименныеКолонкиДерева(РезультатДерево);
		
		Для Каждого СтрокаГруппировки Из РезультатДерево.Строки Цикл
			
			ВывестиЖурналВТабличныйДокумент(ПараметрыОтчета, СтрокаГруппировки, ДанныеДляДекларации, ДокументРезультат);
			
		КонецЦикла;
		
	Исключение
		
		СообщитьОбОшибке(ИнформацияОбОшибке());
		
	КонецПопытки;
		
КонецПроцедуры

Процедура ВывестиЖурналВТабличныйДокумент(ПараметрыОтчета, ГруппировкаНалоговыйПериод, ДанныеДляДекларации, ТабДокумент = Неопределено)
	
	ДетальныеЗаписи = ГруппировкаНалоговыйПериод.Строки;
	
	// Возвращаемое значение:
	Если ТабДокумент = Неопределено Тогда
		ТабДокумент = Новый ТабличныйДокумент();
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент.АвтоМасштаб = Истина;
		ТабДокумент.КлючПараметровПечати = "ЖурналУчетаСчетовФактур";
	Иначе
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент.АвтоМасштаб = Истина;
		ТабДокумент.КлючПараметровПечати = "ЖурналУчетаСчетовФактур";
	КонецЕсли;

	// Используемый макет:
	Макет = ПолучитьИспользуемыйМакет(ПараметрыОтчета);
	
	//---
	// Заголовок
	//---
	Если НЕ ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
		ВывестиЗаголовок(ТабДокумент, Макет, ПараметрыОтчета);
		
		Если НеобходимоВывестиОтбор(ПараметрыОтчета) Тогда
			ВывестиОтбор(ТабДокумент, Макет, ПараметрыОтчета);
		КонецЕсли;
	КонецЕсли;
	
	//---
	// Таблицы частей 1 и 2
	//---
	ВывестиЧастиЖурнала(ТабДокумент, Макет, ГруппировкаНалоговыйПериод, ПараметрыОтчета, ДетальныеЗаписи, ДанныеДляДекларации);
	
	//---
	// Подвал
	//---
	Если ПараметрыОтчета.ВыводитьПодвал Тогда
		ПараметрыОбласти = Новый Структура();
		ПараметрыОбласти.Вставить("Организация",	ПараметрыОтчета["Организация"]);
		ПараметрыОбласти.Вставить("Дата",			ГруппировкаНалоговыйПериод["ДатаОкончанияПериода"]);
		ВывестиПодвал(ТабДокумент, ПараметрыОбласти, Макет);
	КонецЕсли;
		
	// Колонтитулы:
	СтандартныеОтчеты.УстановитьКолонтитулыПоУмолчанию(ТабДокумент,
		ПараметрыОтчета["Колонтитулы_НаименованиеОтчета"],
		ПараметрыОтчета["Колонтитулы_ТекущийПользователь"],
		ПараметрыОтчета["Организация"]);
		
КонецПроцедуры

Процедура ВывестиЗаголовок(ЗаполняемыйТабличныйДокумент, ИспользуемыйМакет, ПараметрыОтчета)
	
	СвойстваОрганизации = ПолучитьСвойстваОрганизации(ПараметрыОтчета);
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("ОрганизацияПредставление",	СвойстваОрганизации.Представление);
	ЗначенияПараметров.Вставить("ИНН",						СвойстваОрганизации.ИНН);
	ЗначенияПараметров.Вставить("КПП",						СвойстваОрганизации.КПП);
	
	Если ПараметрыОтчета.РедакцияПостановления = "№ 26 от 23.01.2026" Тогда
		НаДату = ПараметрыОтчета.ДатаКонца;
		
		Если Не ЗначениеЗаполнено(НаДату) Тогда
			НаДату = ТекущаяДатаСеанса();
		КонецЕсли;
		
		КомпонентыДаты = ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(НаДату, Истина);
		
		ЗначенияПараметров.Вставить("НомерКвартала", ПолучитьНомерКвартала(НаДату));
		ЗначенияПараметров.Вставить("Года", КомпонентыДаты.Года);
	Иначе
		ЗначенияПараметров.Вставить("ПериодПредставление", ПолучитьПредставлениеПериода(ПараметрыОтчета));
	КонецЕсли;
	
	ОбластьЗаголовок = ИспользуемыйМакет.ПолучитьОбласть("Заголовок");
	
	ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
	
	ЗаполняемыйТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
КонецПроцедуры

Функция ПолучитьСвойстваОрганизации(ПараметрыОтчета)
	
	СвойстваОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыОтчета["Организация"],
		"Наименование,НаименованиеПолное,НаименованиеСокращенное,ИНН,КПП");
	
	Наименование1 = СвойстваОрганизации["НаименованиеПолное"];
	Наименование2 = СвойстваОрганизации["НаименованиеСокращенное"];
	Наименование3 = СвойстваОрганизации["Наименование"];
	
	Если ЗначениеЗаполнено(Наименование1) Тогда
		ОрганизацияПредставление = Наименование1;
	ИначеЕсли ЗначениеЗаполнено(Наименование2) Тогда
		ОрганизацияПредставление = Наименование2;
	Иначе
		ОрганизацияПредставление = Наименование3;
	КонецЕсли;
	
	СвойстваОрганизации.Вставить("Представление", ОрганизацияПредставление);
	
	Возврат СвойстваОрганизации;
	
КонецФункции

Функция ПолучитьПредставлениеПериода(ПараметрыОтчета)
	
	Если Не ЗначениеЗаполнено(ПараметрыОтчета.ДатаНачала) И Не ЗначениеЗаполнено(ПараметрыОтчета.ДатаКонца) Тогда
		Возврат "... - ...";
	КонецЕсли;
	
	Возврат ПредставлениеПериода(ПараметрыОтчета.ДатаНачала, ПараметрыОтчета.ДатаКонца, "ФП");
	
КонецФункции

Функция	НеобходимоВывестиОтбор(ПараметрыОтчета)
	
	Если ПараметрыОтчета.РедакцияПостановления <> "№ 26 от 23.01.2026" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РеквизитыШапки = Новый Структура("Организация", ПараметрыОтчета.Организация);
	
	Если СтандартныеОтчетыКлиентСервер.УстановленДополнительныйОтбор(
		ПараметрыОтчета.КомпоновщикНастроек.Настройки.Отбор, РеквизитыШапки) Тогда
		
		Возврат Истина;
	КонецЕсли;
	
	Если Не ПериодОтчетаСовпадаетСГраницамиКвартала(ПараметрыОтчета) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ВывестиОтбор(ТабличныйДокумент, ИспользуемыйМакет, ПараметрыОтчета)
	
	ПредставлениеОтбораСКД = Строка(ПараметрыОтчета.КомпоновщикНастроек.Настройки.Отбор);
	
	ТекстыОтбора = Новый Массив();
	
	Если Не ПараметрыОтчета.ВыводитьЧасть1 Тогда
		ТекстыОтбора.Добавить(НСтр("ru='Не выводить часть 1 журнала'"));
	КонецЕсли;
	
	Если Не ПараметрыОтчета.ВыводитьЧасть2 Тогда
		ТекстыОтбора.Добавить(НСтр("ru='Не выводить часть 2 журнала'"));
	КонецЕсли;
	
	Если Не ПериодОтчетаСовпадаетСГраницамиКвартала(ПараметрыОтчета) Тогда
		ТекстыОтбора.Добавить(ПолучитьПредставлениеПериода(ПараметрыОтчета));
	КонецЕсли;
	
	ТекстыОтбора.Добавить(ПредставлениеОтбораСКД);
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("Отбор", СтрСоединить(ТекстыОтбора, НСтр("ru=' И '")));
	
	ОбластьОтбор = ИспользуемыйМакет.ПолучитьОбласть("Отбор");
	
	ОбластьОтбор.Параметры.Заполнить(ЗначенияПараметров);
	
	ТабличныйДокумент.Вывести(ОбластьОтбор);
	
КонецПроцедуры

Функция ПериодОтчетаСовпадаетСГраницамиКвартала(ПараметрыОтчета)
	
	НомерКвартала = 0;
	
	Если Не ЗначениеЗаполнено(ПараметрыОтчета.ДатаНачала) Или Не ЗначениеЗаполнено(ПараметрыОтчета.ДатаКонца) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НаДату = ПараметрыОтчета.ДатаНачала;
	
	ДатаНачалаКвартала = НачалоКвартала(НаДату);
	ДатаКонцаКвартала = КонецКвартала(НаДату);
	
	Возврат НачалоДня(ПараметрыОтчета.ДатаНачала) = ДатаНачалаКвартала
		И КонецДня(ПараметрыОтчета.ДатаКонца) = ДатаКонцаКвартала;
	
КонецФункции

Функция ПолучитьНомерКвартала(НаДату)
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		Возврат 0;
	КонецЕсли;
	
	НомерМесяца = Месяц(НаДату);
	
	Возврат Цел((НомерМесяца + 2) / 3);
	
КонецФункции

Процедура ВывестиЧастиЖурнала(ЗаполняемыйТабличныйДокумент, ИспользуемыйМакет, СтрокаВерхнейГруппировки, ПараметрыОтчета, ДетальныеЗаписи, ДанныеДляДекларации)
	
	// Определяем заполненность частей журнала:
	СтатусыЧастейЖурнала = ПолучитьТаблицуСтатусовЧастейЖурнала();
	ИндексВВерхнейГруппировке = 0;
	Для Каждого СтрокаГруппировкаЧастьЖурнала Из СтрокаВерхнейГруппировки.Строки Цикл
		СтрокаСтатуса = СтатусыЧастейЖурнала.Найти(СтрокаГруппировкаЧастьЖурнала["ЧастьЖурнала"], "ЧастьЖурнала");
		Если НЕ СтрокаСтатуса = Неопределено Тогда
			СтрокаСтатуса["ИндексВВерхнейГруппировке"] = ИндексВВерхнейГруппировке;
		КонецЕсли;
		ИндексВВерхнейГруппировке = ИндексВВерхнейГруппировке + 1;
	КонецЦикла;
	
	// Выводим части журнала (таблицу, если есть данные)
	// или только шапки таблиц (если данных в этих частях журнала нет):
	Для Каждого СтрокаСтатуса Из СтатусыЧастейЖурнала Цикл
		ИндексВВерхнейГруппировке = СтрокаСтатуса["ИндексВВерхнейГруппировке"];
		Если ИндексВВерхнейГруппировке >= 0 Тогда
			СтрокаГруппировкаЧастьЖурнала = СтрокаВерхнейГруппировки.Строки[ИндексВВерхнейГруппировке];
		Иначе
			СтрокаГруппировкаЧастьЖурнала = Неопределено;
		КонецЕсли;
		
		ПараметрыВыводаТаблицы = Новый Структура();
		ПараметрыВыводаТаблицы.Вставить("НПП",							1);
		ПараметрыВыводаТаблицы.Вставить("НомерЧастиЖурнала",			СтрокаСтатуса["НомерЧастиЖурнала"]);
		ПараметрыВыводаТаблицы.Вставить("ЗаполняемыйТабличныйДокумент",	ЗаполняемыйТабличныйДокумент);
		ПараметрыВыводаТаблицы.Вставить("ИспользуемыйМакет",			ИспользуемыйМакет);
		ПараметрыВыводаТаблицы.Вставить("СтрокаГруппировки",			СтрокаГруппировкаЧастьЖурнала);
		ПараметрыВыводаТаблицы.Вставить("НумероватьВнутриКонтрагента",	ПараметрыОтчета["НумероватьВнутриКонтрагента"]);
		
		ВывестиЧастьЖурнала(ПараметрыОтчета, ПараметрыВыводаТаблицы, ДетальныеЗаписи, ДанныеДляДекларации);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиЧастьЖурнала(ПараметрыОтчета, ПараметрыВыводаТаблицы, ДетальныеЗаписи, ДанныеДляДекларации)
	
	НомерЧастиЖурнала				= ПараметрыВыводаТаблицы["НомерЧастиЖурнала"];
	СтрокаГруппировкаЧастьЖурнала	= ПараметрыВыводаТаблицы["СтрокаГруппировки"];
	ЗаполняемыйТабличныйДокумент	= ПараметрыВыводаТаблицы["ЗаполняемыйТабличныйДокумент"];
	ИспользуемыйМакет				= ПараметрыВыводаТаблицы["ИспользуемыйМакет"];
	
	Если НомерЧастиЖурнала = 1 Тогда
		ОбозначениеРаздела = "10";
	Иначе
		ОбозначениеРаздела = "11";
	КонецЕсли;
	
	// Декларация
	// СегментацияДанныхДекларации
	Если ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
		
		УчетНДС.СегментацияДанныхДекларации_НастроитьСтатистикуПередВыводомТаблицы(
		ОбозначениеРаздела,
		ЗаполняемыйТабличныйДокумент,
		ДетальныеЗаписи.Количество(),
		ПараметрыОтчета);
	КонецЕсли;
	
	//---
	// Шапка раздела
	//---
	Если ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
		Если НомерЧастиЖурнала = 1 Тогда
			ОбластьЗаголовокТаблицы = ИспользуемыйМакет.ПолучитьОбласть("ШапкаРаздел10");
		Иначе
			ОбластьЗаголовокТаблицы = ИспользуемыйМакет.ПолучитьОбласть("ШапкаРаздел11");
		КонецЕсли;
		ЗаполняемыйТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
	КонецЕсли;
	
	//---
	// Заголовок таблицы
	//---
	Если НЕ ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
		Если НомерЧастиЖурнала = 1 Тогда
			ОбластьЗаголовокТаблицы = ИспользуемыйМакет.ПолучитьОбласть("ЗаголовокТаблицы1");
		Иначе
			ОбластьЗаголовокТаблицы = ИспользуемыйМакет.ПолучитьОбласть("ЗаголовокТаблицы2");
		КонецЕсли;
		ЗаполняемыйТабличныйДокумент.Вывести(ОбластьЗаголовокТаблицы);
	КонецЕсли;
	
	//---
	// Шапка таблицы
	//---
	Если НомерЧастиЖурнала = 1 Тогда
		ОбластьШапка = ИспользуемыйМакет.ПолучитьОбласть("Шапка1");
	Иначе
		ОбластьШапка = ИспользуемыйМакет.ПолучитьОбласть("Шапка2");
	КонецЕсли;
	ЗаполняемыйТабличныйДокумент.Вывести(ОбластьШапка);
	
	// Если часть журнала пустая, то выводим только шапку таблицы, и больше ничего:
	Если СтрокаГруппировкаЧастьЖурнала = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//---
	// Строки таблицы
	//---
	ВывестиСтрокиЧастиЖурнала(ПараметрыОтчета, ПараметрыВыводаТаблицы, ДанныеДляДекларации, ОбозначениеРаздела);
	
	
	// Декларация
	Если ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
		
		// СегментацияДанныхДекларации
		// Записываем текущий сегмент, обновляем статистику
		УчетНДС.СегментацияДанныхДекларации_ЗаписатьТекущийСегмент(
			ОбозначениеРаздела,	// ОбозначениеРаздела
			ЗаполняемыйТабличныйДокумент,
			ПолучитьИспользуемыйМакет(ПараметрыОтчета),
			ПараметрыОтчета,
			ДанныеДляДекларации,
			Истина);	// ЗакончиласьТаблица
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСтрокиЧастиЖурнала(ПараметрыОтчета, ПараметрыВыводаТаблицы, ДанныеДляДекларации, ОбозначениеРаздела)
	
	// Декларация
	// СегментацияДанныхДекларации
	Перем	ОбозначениеРазделаКнига,
	СегментацияДанныхРазделаКнига,
	ТаблицаДанныхКнига;
	
	СтрокаГруппировки = ПараметрыВыводаТаблицы["СтрокаГруппировки"];
	
	СимволПрочерка = "---";
	
	// Декларация
	// СегментацияДанныхДекларации
	Если ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
		// Разделы 10, 11
		ОбозначениеРазделаКнига = ОбозначениеРаздела;
		ОписаниеРаздела					= УчетНДС.СегментацияДанныхДекларации_ПолучитьОписаниеРаздела(ОбозначениеРазделаКнига);
		ИмяРаздела						= ОписаниеРаздела["ИмяВРегламентированнойОтчетности"];
		СегментацияДанныхРазделаКнига	= ПараметрыОтчета["СегментацияДанныхДекларации"][ИмяРаздела];
		ИмяТаблицыДанных				= ОписаниеРаздела["ИмяТаблицыДанных"];
		ТаблицаДанныхКнига				= ДанныеДляДекларации[ИмяТаблицыДанных];
	КонецЕсли;
	
	ТекстБезНДС = "без НДС";
	ТекстПустаяСтрока = "";
	
	НомерПП = 1;
	
	Для Каждого СтрокаДереваГруппировки Из СтрокаГруппировки.Строки Цикл
		
		НомерСтрокиГруппировки = 1;
		
		Для каждого СтрокаДерева Из СтрокаДереваГруппировки.Строки Цикл
			
			
			НомерЧастиЖурнала				= ПараметрыВыводаТаблицы["НомерЧастиЖурнала"];
			ЗаполняемыйТабличныйДокумент	= ПараметрыВыводаТаблицы["ЗаполняемыйТабличныйДокумент"];
			ИспользуемыйМакет				= ПараметрыВыводаТаблицы["ИспользуемыйМакет"];
			НумероватьВнутриКонтрагента		= ПараметрыВыводаТаблицы["НумероватьВнутриКонтрагента"];
			
			ЗакупкаКомиссия = СтрокаДерева["ПричинаНалогообложения"] = Перечисления.ПричиныНалогообложенияНДС.СчетФактураКомиссионераНаПокупку
				ИЛИ СтрокаДерева["ПричинаНалогообложения"] = Перечисления.ПричиныНалогообложенияНДС.СчетФактураКомиссионераНаАванс;
			
			//---
			// Строка таблицы
			//---
			ЗначенияПараметров = Новый Структура();
			
			Если НомерСтрокиГруппировки = 1 ИЛИ СтрокаДерева.ЧастьЖурнала = Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры Тогда
				ОбластьСтрока = ИспользуемыйМакет.ПолучитьОбласть("СтрокаЧасть" + НомерЧастиЖурнала);
				
				// 1
				Параметр_НПП = НомерПП;
				
				ЗначенияПараметров.Вставить("НПП",					Параметр_НПП);
				НомерПП = НомерПП + 1;
				ПараметрыВыводаТаблицы["НПП"] = НомерПП;
				
			Иначе
				ОбластьСтрока = ИспользуемыйМакет.ПолучитьОбласть("СтрокаЧасть1Группировка");
				// 1
				ЗначенияПараметров.Вставить("НПП",					Параметр_НПП);
				ПараметрыВыводаТаблицы["НПП"] = Параметр_НПП;
				
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаДерева);
			
			Если НомерЧастиЖурнала = 1 Тогда
				СторонаCделки = УчетНДС.ОпределитьПокупателя(СтрокаДерева)["Покупатель"];
			Иначе
				СторонаCделки = УчетНДС.ОпределитьПродавца(СтрокаДерева)["Продавец"];
			КонецЕсли;
			
			Параметр_ПокупательПродавецПредставление	= СторонаCделки["Наименование"];
			Параметр_ПокупательПродавецИНН				= СторонаCделки["ИНН"];
			Параметр_ПокупательПродавецКПП				= СторонаCделки["КПП"];
			Параметр_ПокупательПродавецСсылка			= СторонаCделки["Ссылка"];
			
			СтруктураНомерСФ = УчетНДС.ОпределитьНомерСФДляВыводаВРегистрыУчета(СтрокаДерева);
			
			// 4
			ЗначенияПараметров.Вставить("НомерДатаСФ",
			УчетНДСКлиентСервер.ПолучитьПредставлениеНомерДатаДокумента(
			СтруктураНомерСФ["Номер"], СтрокаДерева["Дата"]));
			
			// 5
			ЗначенияПараметров.Вставить("НомерДатаИсправленияСФ",
			УчетНДСКлиентСервер.ПолучитьПредставлениеНомерДатаДокумента(
			СтрокаДерева["НомерИсправления"], СтрокаДерева["ДатаИсправления"]));
			
			// 6
			ЗначенияПараметров.Вставить("НомерДатаКСФ",
			УчетНДСКлиентСервер.ПолучитьПредставлениеНомерДатаДокумента(
			СтруктураНомерСФ["НомерКСФ"], СтрокаДерева["ДатаКСФ"]));
			
			// 7
			ЗначенияПараметров.Вставить("НомерДатаИсправленияКСФ",
			УчетНДСКлиентСервер.ПолучитьПредставлениеНомерДатаДокумента(
			СтрокаДерева["НомерИсправленияКСФ"], СтрокаДерева["ДатаИсправленияКСФ"]));
			
			// 8
			ЗначенияПараметров.Вставить("ПокупательПродавецПредставление",	Параметр_ПокупательПродавецПредставление);
			ЗначенияПараметров.Вставить("ПокупательПродавецСсылка",			Параметр_ПокупательПродавецСсылка);
			
			// 9
			Если ЗначениеЗаполнено(Параметр_ПокупательПродавецИНН) ИЛИ ЗначениеЗаполнено(Параметр_ПокупательПродавецКПП) Тогда
				Параметр_ИННКПП = Строка(Параметр_ПокупательПродавецИНН) + " / " + Строка(Параметр_ПокупательПродавецКПП);
			Иначе
				Параметр_ИННКПП = "";
			КонецЕсли;
			ЗначенияПараметров.Вставить("ИННКПП", Параметр_ИННКПП);
			
			//10
			Если ЗакупкаКомиссия Тогда
				Параметр_ПосредникНаименование	= СтрокаДерева["ПродавецПредставление"];
				ЗначенияПараметров.Вставить("ПосредникНаименование", Параметр_ПосредникНаименование);
			КонецЕсли;
			
			//11 
			Если ЗакупкаКомиссия Тогда
				Если ЗначениеЗаполнено(СтрокаДерева["ПродавецИНН"]) ИЛИ ЗначениеЗаполнено(СтрокаДерева["ПродавецКПП"]) Тогда
					Параметр_ПосредникИННКПП = Строка(СтрокаДерева["ПродавецИНН"]) + " / " + Строка(СтрокаДерева["ПродавецКПП"]);
				Иначе
					Параметр_ПосредникИННКПП = "";
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(СтрокаДерева.ИННПосредник) ИЛИ ЗначениеЗаполнено(СтрокаДерева.КПППосредник) Тогда
					Параметр_ПосредникИННКПП = Строка(СтрокаДерева["ИННПосредник"]) + " / " + Строка(СтрокаДерева["КПППосредник"]);
				Иначе
					Параметр_ПосредникИННКПП = "";
				КонецЕсли;
			КонецЕсли;
			ЗначенияПараметров.Вставить("ПосредникИННКПП", Параметр_ПосредникИННКПП); 
			
			//12
			Если ЗакупкаКомиссия Тогда
				Если ЗначениеЗаполнено(СтрокаДерева["ДатаСчетаФактурыПродавца"]) И ЗначениеЗаполнено(СтрокаДерева["НомерСчетаФактурыПродавца"]) Тогда
					Параметр_ПосредникНомерДатаСФ = УчетНДСКлиентСервер.ПолучитьПредставлениеНомерДатаДокумента(СтрокаДерева["НомерСчетаФактурыПродавца"], СтрокаДерева["ДатаСчетаФактурыПродавца"]);
				Иначе
					Параметр_ПосредникНомерДатаСФ = "";
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(СтрокаДерева["ПосредникДатаСФ"]) И ЗначениеЗаполнено(СтрокаДерева["ПосредникНомерСФ"]) Тогда
					Параметр_ПосредникНомерДатаСФ = УчетНДСКлиентСервер.ПолучитьПредставлениеНомерДатаДокумента(СтрокаДерева["ПосредникНомерСФ"], СтрокаДерева["ПосредникДатаСФ"]);
				Иначе
					Параметр_ПосредникНомерДатаСФ = "";
				КонецЕсли;
			КонецЕсли;
			ЗначенияПараметров.Вставить("ПосредникНомерДатаСФ", Параметр_ПосредникНомерДатаСФ);	
			
			// 14, 15
			Если ЗначениеЗаполнено(СтрокаДерева["ЭтоШкурыЛом"]) Тогда
				Если СтрокаДерева["ЭтоШкурыЛом"] Тогда
					ЗначенияПараметров.Вставить("СуммаПоСчетуФактуре",	СимволПрочерка);
					ЗначенияПараметров.Вставить("СуммаНДС",				СимволПрочерка);
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаДерева.КодВидаОперации = "15" Тогда
				ЗначенияПараметров.Вставить("СуммаПоСчетуФактуреКомиссия",	СтрокаДерева.СуммаПоСчетуФактуре);
				ЗначенияПараметров.Вставить("СуммаНДСКомиссия",				СтрокаДерева.СуммаНДС);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Заполнить(ЗначенияПараметров);
			
			ЗаполняемыйТабличныйДокумент.Вывести(ОбластьСтрока);
			
			//---
			// Декларация
			//---
			Если ПараметрыОтчета.ЗаполнитьДанныеДляДекларации Тогда
				//
				// Разделы 10, 11
				//
				ДополнительныеСведения = Новый Структура("Контрагент,ПредставлениеКонтрагента,Документ,ПредставлениеДокумента");
				ДополнительныеСведения.Документ = СтрокаДерева.СчетФактура;
				ДополнительныеСведения.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
				ДополнительныеСведения.ПредставлениеКонтрагента = ""; 
				
				Если ОбозначениеРаздела = "10" Тогда
					// Раздел 10
					
					ДополнительныеСведения.ПредставлениеДокумента = СтрШаблон(
					НСтр("ru='Счет-фактура выданный № %1 от %2 на сумму %3 %4'"), 
					СтрокаДерева.Номер, 
					Формат(СтрокаДерева.Дата, "ДФ=dd.MM.yyyy"),
					Формат(СтрокаДерева.СуммаПоСчетуФактуре, "ЧДЦ=2; ЧН="),
					СтрокаДерева.ВалютаНаименование);
					
					// Массив структур со сведениями о посреднической деятельности
					СтруктураСвПосрДеят = Новый Структура(
					"НомСчФОтПрод,ДатаСчФОтПрод,ОКВ,СтоимТовСчФВс,СумНДССчФ,РазСтКСчФУм,РазСтКСчФУв,РазНДСКСчФУм,РазНДСКСчФУв,СвПрод");
					
					МассивСвРегНом = Новый Массив();
					СтруктураСвПосрДеят.Вставить("СвРегНом", МассивСвРегНом);
					
					Если ЗакупкаКомиссия Тогда
						СтруктураСвПосрДеят.НомСчФОтПрод  = СокрЛП(СтрокаДерева.НомерСчетаФактурыПродавца);
						СтруктураСвПосрДеят.ДатаСчФОтПрод = Формат(СтрокаДерева.ДатаСчетаФактурыПродавца, "ДФ=dd.MM.yyyy");
					Иначе
						СтруктураСвПосрДеят.НомСчФОтПрод  = СокрЛП(СтрокаДерева.ПосредникНомерСФ);
						СтруктураСвПосрДеят.ДатаСчФОтПрод = Формат(СтрокаДерева.ПосредникДатаСФ, "ДФ=dd.MM.yyyy");
					КонецЕсли;
					СтруктураСвПосрДеят.ОКВ           = СтрокаДерева.ВалютаКод;
					
					СтруктураСвПосрДеят.СтоимТовСчФВс =
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаПоСчетуФактуреКомиссия, ТекстБезНДС, ТекстПустаяСтрока);
					СтруктураСвПосрДеят.СумНДССчФ =
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаНДСКомиссия, ТекстБезНДС, ТекстПустаяСтрока);
					СтруктураСвПосрДеят.РазСтКСчФУм =
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаПоСчетуФактуреРазницаУменьшение, ТекстБезНДС, ТекстПустаяСтрока);
					СтруктураСвПосрДеят.РазСтКСчФУв =
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаПоСчетуФактуреРазницаУвеличение, ТекстБезНДС, ТекстПустаяСтрока);
					СтруктураСвПосрДеят.РазНДСКСчФУм =
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаНДСРазницаУменьшение, ТекстБезНДС, ТекстПустаяСтрока);
					СтруктураСвПосрДеят.РазНДСКСчФУв =
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаНДСРазницаУвеличение, ТекстБезНДС, ТекстПустаяСтрока);
					
					Если ЗакупкаКомиссия Тогда
						Если ЗначениеЗаполнено(СтрокаДерева.ПродавецИНН)
							ИЛИ ЗначениеЗаполнено(СтрокаДерева.ПродавецКПП) Тогда
							СтруктуруРеквизитовПродавца = УчетНДС.ПолучитьСтруктуруРеквизитовКонтрагента(
								СтрокаДерева.ПродавецИНН, СтрокаДерева.ПродавецКПП);
							СтруктуруРеквизитовПродавца.Вставить("Контрагент", СтрокаДерева.Продавец);
							СтруктуруРеквизитовПродавца.Вставить("КонтрагентНаименование", СтрокаДерева.ПродавецПредставление);
							СтруктураСвПосрДеят.СвПрод = СтруктуруРеквизитовПродавца;
						КонецЕсли;
					Иначе
						Если ЗначениеЗаполнено(СтрокаДерева.ИННПосредник)
							ИЛИ ЗначениеЗаполнено(СтрокаДерева.КПППосредник) Тогда
							СтруктуруРеквизитовКомитента = УчетНДС.ПолучитьСтруктуруРеквизитовКонтрагента(
							СтрокаДерева.ИННПосредник, СтрокаДерева.КПППосредник);
							СтруктуруРеквизитовКомитента.Вставить("Контрагент", СтрокаДерева.ПосредникНаименование);
							СтруктуруРеквизитовКомитента.Вставить("КонтрагентНаименование", СтрокаДерева.ПосредникНаименование);
							СтруктураСвПосрДеят.СвПрод = СтруктуруРеквизитовКомитента;
						КонецЕсли;
					КонецЕсли;
					
					СтруктураОтбора = Новый Структура("НомерПор", Параметр_НПП);
					// Осуществляем поиск по таблице, в случае если записи нет - добавляем новую строку,
					// иначе добавляем сведения о комитенте в колонку "СвПосрДеят" (с 1 кв 2017 года в "СвСчФОтПрод").
					СтрокиРаздела10 = ТаблицаДанныхКнига.НайтиСтроки(СтруктураОтбора);
					
					Если СтрокиРаздела10.Количество() = 0 Тогда
						
						НоваяСтрока = ТаблицаДанныхКнига.Добавить();
						
						НоваяСтрока["НомерПор"]		= Параметр_НПП;
						
						НоваяСтрока["НомСчФПрод"]	= СтруктураНомерСФ["Номер"];
						НоваяСтрока["ДатаСчФПрод"]	= Формат(СтрокаДерева.Дата, "ДФ=dd.MM.yyyy");
						
						НоваяСтрока["НомИспрСчФ"]	= СтрокаДерева.НомерИсправления;
						НоваяСтрока["ДатаИспрСчФ"]	= Формат(СтрокаДерева.ДатаИсправления, "ДФ=dd.MM.yyyy");
						
						НоваяСтрока["НомКСчФПрод"]	= СтруктураНомерСФ["НомерКСФ"];
						НоваяСтрока["ДатаКСчФПрод"]	= Формат(СтрокаДерева.ДатаКСФ, "ДФ=dd.MM.yyyy");
						
						НоваяСтрока["НомИспрКСчФ"]	= СтрокаДерева.НомерИсправленияКСФ;
						НоваяСтрока["ДатаИспрКСчФ"]	= Формат(СтрокаДерева.ДатаИсправленияКСФ, "ДФ=dd.MM.yyyy");
						
						МассивКодовОпераций = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДерева.КодВидаОперации, ";");
						НоваяСтрока["КодВидОпер"] = МассивКодовОпераций;
						
						Если ЗначениеЗаполнено(СтрокаДерева.КонтрагентИНН)
							ИЛИ ЗначениеЗаполнено(СтрокаДерева.КонтрагентКПП) Тогда
							СтруктураРеквизитовКонтрагента = УчетНДС.ПолучитьСтруктуруРеквизитовКонтрагента(
							СтрокаДерева.КонтрагентИНН, СтрокаДерева.КонтрагентКПП);
							СтруктураРеквизитовКонтрагента.Вставить("Контрагент", СтрокаДерева.Контрагент);
							СтруктураРеквизитовКонтрагента.Вставить("КонтрагентНаименование", СтрокаДерева.КонтрагентПредставление);
							НоваяСтрока["СвПокуп"] = СтруктураРеквизитовКонтрагента;
						КонецЕсли;
						
						ДополнительныеСведения.Контрагент = СтрокаДерева.Контрагент;
						ДополнительныеСведения.ПредставлениеКонтрагента = СтрокаДерева.КонтрагентПредставление;
						
						МассивСвПосрДеят = Новый Массив();
						МассивСвПосрДеят.Добавить(СтруктураСвПосрДеят);
						
						НоваяСтрока["СвСчФОтПрод"] =  МассивСвПосрДеят; 
						
						НоваяСтрока["СуммаПосрДеят"] = СтруктураСвПосрДеят.СтоимТовСчФВс;
						
						НоваяСтрока["ДополнительныеСведения"] = ДополнительныеСведения;
						
					Иначе
						
						СтрокаРаздела = СтрокиРаздела10[0];
						СтрокаРаздела.СуммаПосрДеят = СтрокаРаздела.СуммаПосрДеят + СтруктураСвПосрДеят.СтоимТовСчФВс;
						МассивСвПосрДеят = СтрокаРаздела.СвСчФОтПрод;
						МассивСвПосрДеят.Добавить(СтруктураСвПосрДеят);
						
						ДополнительныеСведения.ПредставлениеДокумента = СтрШаблон(
						НСтр("ru='Счет-фактура выданный № %1 от %2 на сумму %3 %4'"), 
						СтрокаДерева.Номер, 
						Формат(СтрокаДерева.Дата, "ДФ=dd.MM.yyyy"),
						Формат(СтрокаДерева.СуммаПоСчетуФактуре, "ЧДЦ=2; ЧН="),
						СтрокаДерева.ВалютаНаименование);					
					
					КонецЕсли;
						
				Иначе
					// Раздел 11
					
					ДополнительныеСведения.ПредставлениеДокумента = СтрШаблон(
					НСтр("ru='Счет-фактура полученный № %1 от %2 на сумму %3 %4'"), 
					СтрокаДерева.Номер, 
					Формат(СтрокаДерева.Дата, "ДФ=dd.MM.yyyy"),
					Формат(СтрокаДерева.СуммаПоСчетуФактуре, "ЧДЦ=2; ЧН="),
					СтрокаДерева.ВалютаНаименование);
					
					НоваяСтрока = ТаблицаДанныхКнига.Добавить();
					
					НоваяСтрока["НомерПор"]		= Параметр_НПП;
					
					МассивСвРегНом = Новый Массив();
					НоваяСтрока["СвРегНом"] = МассивСвРегНом;
					
					НоваяСтрока["НомСчФПрод"]	= СтруктураНомерСФ["Номер"];
					НоваяСтрока["ДатаСчФПрод"]	= Формат(СтрокаДерева.Дата, "ДФ=dd.MM.yyyy");
					
					НоваяСтрока["НомИспрСчФ"]	= СтрокаДерева.НомерИсправления;
					НоваяСтрока["ДатаИспрСчФ"]	= Формат(СтрокаДерева.ДатаИсправления, "ДФ=dd.MM.yyyy");
					
					НоваяСтрока["НомКСчФПрод"]	= СтруктураНомерСФ["НомерКСФ"];
					НоваяСтрока["ДатаКСчФПрод"]	= Формат(СтрокаДерева.ДатаКСФ, "ДФ=dd.MM.yyyy");
					
					НоваяСтрока["НомИспрКСчФ"]	= СтрокаДерева.НомерИсправленияКСФ;
					НоваяСтрока["ДатаИспрКСчФ"]	= Формат(СтрокаДерева.ДатаИсправленияКСФ, "ДФ=dd.MM.yyyy");
					
					МассивКодовОпераций = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДерева.КодВидаОперации, ";");
					НоваяСтрока["КодВидОпер"] = МассивКодовОпераций;
					
					НоваяСтрока["КодВидСд"] = СтрокаДерева.КодВидаСделки;
					
					НоваяСтрока["ОКВ"] = СтрокаДерева.ВалютаКод;
					
					НоваяСтрока["СтоимТовСчФВс"] = 
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаПоСчетуФактуре, ТекстБезНДС, ТекстПустаяСтрока);
					НоваяСтрока["СумНДССчФ"] = 
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаНДС, ТекстБезНДС, ТекстПустаяСтрока);
					НоваяСтрока["РазСтКСчФУм"] = 
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаПоСчетуФактуреРазницаУменьшение, ТекстБезНДС, ТекстПустаяСтрока);
					НоваяСтрока["РазСтКСчФУв"] = 
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаПоСчетуФактуреРазницаУвеличение, ТекстБезНДС, ТекстПустаяСтрока);
					НоваяСтрока["РазНДСКСчФУм"] = 
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаНДСРазницаУменьшение, ТекстБезНДС, ТекстПустаяСтрока);
					НоваяСтрока["РазНДСКСчФУв"] = 
					ПреобразоватьСтрокуВФорматДекларации(СтрокаДерева.СуммаНДСРазницаУвеличение, ТекстБезНДС, ТекстПустаяСтрока);
					
					Если ЗначениеЗаполнено(СтрокаДерева.КонтрагентИНН)
						ИЛИ ЗначениеЗаполнено(СтрокаДерева.КонтрагентКПП) Тогда
						СтруктураРеквизитовКонтрагента = УчетНДС.ПолучитьСтруктуруРеквизитовКонтрагента(
						СтрокаДерева.КонтрагентИНН, СтрокаДерева.КонтрагентКПП);
						СтруктураРеквизитовКонтрагента.Вставить("Контрагент", СтрокаДерева.Контрагент);
						СтруктураРеквизитовКонтрагента.Вставить("КонтрагентНаименование", СтрокаДерева.КонтрагентПредставление);
						НоваяСтрока["СвПрод"] = СтруктураРеквизитовКонтрагента;
					КонецЕсли;
					
					ДополнительныеСведения.Контрагент = СтрокаДерева.Контрагент;
					ДополнительныеСведения.ПредставлениеКонтрагента = СтрокаДерева.КонтрагентПредставление;
					
					НоваяСтрока["ДополнительныеСведения"] = ДополнительныеСведения;
					
				КонецЕсли;
				// СегментацияДанныхДекларации
				УчетНДС.СегментацияДанныхДекларации_НастроитьСтатистикуПослеДобавленияСтрокиТаблицы(СегментацияДанныхРазделаКнига, ПараметрыОтчета);
				
				Если УчетНДС.СегментацияДанныхДекларации_СегментДостигПредельногоРазмера(СегментацияДанныхРазделаКнига, ПараметрыОтчета) Тогда
					// Записываем текущий сегмент, обновляем статистику
					УчетНДС.СегментацияДанныхДекларации_ЗаписатьТекущийСегмент(
					ОбозначениеРазделаКнига,
					ЗаполняемыйТабличныйДокумент,
					ИспользуемыйМакет,
					ПараметрыОтчета,
					ДанныеДляДекларации,
					Ложь);		// ЗакончиласьТаблица
					
				КонецЕсли;
				
			КонецЕсли;
			
		НомерСтрокиГруппировки = НомерСтрокиГруппировки + 1;
		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиПодвал(ЗаполняемыйТабличныйДокумент, ПараметрыОбласти, ИспользуемыйМакет)
	
	ОбластьПодвал = ИспользуемыйМакет.ПолучитьОбласть("Подвал");
	
	ЗначенияПараметров = Новый Структура();
	Если ЗначениеЗаполнено(ПараметрыОбласти["Организация"]) Тогда
		ОтветственныеЛица = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
		Перечисления.ОтветственныеЛицаОрганизаций.Руководитель,
		ПараметрыОбласти["Организация"],
		ПараметрыОбласти["Дата"]);
		
		ЗначенияПараметров.Вставить("РуководительФИО", Справочники.Сотрудники.ФамилияИО(
		ОтветственныеЛица["ОтветственноеЛицоСсылка"],, ПараметрыОбласти["Дата"]));
	КонецЕсли;
	// Выводим область:
	ОбластьПодвал.Параметры.Заполнить(ЗначенияПараметров);
	ЗаполняемыйТабличныйДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры	

Функция ПолучитьТаблицуСтатусовЧастейЖурнала()
	
	СтатусЧастейЖурнала = Новый ТаблицаЗначений();
	СтатусЧастейЖурнала.Колонки.Добавить("НомерЧастиЖурнала",			Новый ОписаниеТипов("Число"));
	СтатусЧастейЖурнала.Колонки.Добавить("ЧастьЖурнала",				Новый ОписаниеТипов("ПеречислениеСсылка.ЧастиЖурналаУчетаСчетовФактур"));
	СтатусЧастейЖурнала.Колонки.Добавить("ИндексВВерхнейГруппировке",	Новый ОписаниеТипов("Число"));
	НоваяСтрока = СтатусЧастейЖурнала.Добавить();
	НоваяСтрока["НомерЧастиЖурнала"]			= 1;
	НоваяСтрока["ЧастьЖурнала"]					= Перечисления.ЧастиЖурналаУчетаСчетовФактур.ВыставленныеСчетаФактуры;
	НоваяСтрока["ИндексВВерхнейГруппировке"]	= -1;
	НоваяСтрока = СтатусЧастейЖурнала.Добавить();
	НоваяСтрока["НомерЧастиЖурнала"]			= 2;
	НоваяСтрока["ЧастьЖурнала"]					= Перечисления.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры;
	НоваяСтрока["ИндексВВерхнейГруппировке"]	= -1;
	
	Возврат СтатусЧастейЖурнала;
	
КонецФункции

Процедура СообщитьОбОшибке(ИнформацияОбОшибке)
	
	Пока НЕ ИнформацияОбОшибке.Причина = Неопределено Цикл
		ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
	КонецЦикла;
	ТекстСообщения = НСтр("ru='Отчет не сформирован!'") + Символы.ПС + ИнформацияОбОшибке.Описание;
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область Декларация

Процедура ИнициализироватьТаблицыДляДекларацииПоНДС(СтруктураПараметров)
	
	Раздел10 = Новый ТаблицаЗначений; // Часть 1: выставленные счета-фактуры
	
	Раздел10.Колонки.Добавить("НомерПор", ОбщегоНазначения.ОписаниеТипаЧисло(12, 0));
	
	Раздел10.Колонки.Добавить("НомСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Раздел10.Колонки.Добавить("ДатаСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел10.Колонки.Добавить("НомИспрСчФ", ОбщегоНазначения.ОписаниеТипаЧисло(3, 0));
	Раздел10.Колонки.Добавить("ДатаИспрСчФ", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел10.Колонки.Добавить("НомКСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Раздел10.Колонки.Добавить("ДатаКСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел10.Колонки.Добавить("НомИспрКСчФ", ОбщегоНазначения.ОписаниеТипаЧисло(3, 0));
	Раздел10.Колонки.Добавить("ДатаИспрКСчФ", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел10.Колонки.Добавить("КодВидОпер", Новый ОписаниеТипов("Массив"));
	
	Раздел10.Колонки.Добавить("СвПокуп");
	
	Раздел10.Колонки.Добавить("СвСчФОтПрод");
	
	Раздел10.Колонки.Добавить("ДополнительныеСведения");
	
	Раздел10.Колонки.Добавить("СуммаПосрДеят", ОбщегоНазначения.ОписаниеТипаЧисло(19, 2));
	
	Раздел11 = Новый ТаблицаЗначений; // Часть 2: полученные счета-фактуры
	
	Раздел11.Колонки.Добавить("НомерПор", ОбщегоНазначения.ОписаниеТипаЧисло(12, 0));
	
	Раздел11.Колонки.Добавить("СвРегНом", Новый ОписаниеТипов("Массив"));
	
	Раздел11.Колонки.Добавить("НомСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Раздел11.Колонки.Добавить("ДатаСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел11.Колонки.Добавить("НомИспрСчФ", ОбщегоНазначения.ОписаниеТипаЧисло(3, 0));
	Раздел11.Колонки.Добавить("ДатаИспрСчФ", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел11.Колонки.Добавить("НомКСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	Раздел11.Колонки.Добавить("ДатаКСчФПрод", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел11.Колонки.Добавить("НомИспрКСчФ", ОбщегоНазначения.ОписаниеТипаЧисло(3, 0));
	Раздел11.Колонки.Добавить("ДатаИспрКСчФ", ОбщегоНазначения.ОписаниеТипаСтрока(10));
	
	Раздел11.Колонки.Добавить("КодВидСд", ОбщегоНазначения.ОписаниеТипаСтрока(1));
	Раздел11.Колонки.Добавить("ОКВ", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	
	Раздел11.Колонки.Добавить("СтоимТовСчФВс", ОбщегоНазначения.ОписаниеТипаЧисло(19, 2));
	Раздел11.Колонки.Добавить("СумНДССчФ", ОбщегоНазначения.ОписаниеТипаЧисло(19, 2));
	
	Раздел11.Колонки.Добавить("РазСтКСчФУм", ОбщегоНазначения.ОписаниеТипаЧисло(19, 2));
	Раздел11.Колонки.Добавить("РазСтКСчФУв", ОбщегоНазначения.ОписаниеТипаЧисло(19, 2));
	Раздел11.Колонки.Добавить("РазНДСКСчФУм", ОбщегоНазначения.ОписаниеТипаЧисло(19, 2));
	Раздел11.Колонки.Добавить("РазНДСКСчФУв", ОбщегоНазначения.ОписаниеТипаЧисло(19, 2));
	
	Раздел11.Колонки.Добавить("КодВидОпер", Новый ОписаниеТипов("Массив"));
	Раздел11.Колонки.Добавить("СвПрод");
	Раздел11.Колонки.Добавить("СвКомис");
	Раздел11.Колонки.Добавить("ДополнительныеСведения");
	
	СтруктураПараметров.Вставить("ТаблицаРаздел10", Раздел10);
	СтруктураПараметров.Вставить("ТаблицаРаздел11", Раздел11);
	
	СтруктураПараметров.Вставить("ТабличныйДокументРаздел10");
	СтруктураПараметров.Вставить("ТабличныйДокументРаздел11");
	
КонецПроцедуры

Функция ПреобразоватьСтрокуВФорматДекларации(ИсходныйПоказатель, ТекстБезНДС, ТекстПустаяСтрока)
	
	Если Строка(ИсходныйПоказатель) = ТекстБезНДС
		ИЛИ Строка(ИсходныйПоказатель) = ТекстПустаяСтрока Тогда
		Возврат 0;
	Иначе
		Возврат ИсходныйПоказатель;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли