#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения, Неопределено -
//   КлючВарианта - Строка, Неопределено -
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	ИсполняемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыОтчета = Новый Структура();
	
	ПараметрКД = ИсполняемыеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ПараметрыОтчета.Вставить("ДатаНачала", ПараметрКД.Значение.ДатаНачала);
	ПараметрыОтчета.Вставить("ДатаКонца", ПараметрКД.Значение.ДатаОкончания);
	
	ПараметрКД = ИсполняемыеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	ПараметрыОтчета.Вставить("Организация", ПараметрКД.Значение);
	
	ПараметрКД = ИсполняемыеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьПодвал"));
	ПараметрыОтчета.Вставить("ВыводитьПодвал", ПараметрКД.Значение);
	
	// Отбор по организации
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(КомпоновщикНастроек.Настройки.Отбор, "Организация", ПараметрыОтчета.Организация,
		ВидСравненияКомпоновкиДанных.Равно,,Истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ПараметрыОтчета.Вставить("ВыводитьЧасть1", Истина);
	ПараметрыОтчета.Вставить("ВыводитьЧасть2", Истина);
	ПараметрыОтчета.Вставить("ВыводитьОтбор", Ложь);
	ПараметрыОтчета.Вставить("НумероватьВнутриКонтрагента", Ложь);
	ПараметрыОтчета.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
	ПараметрыОтчета.Вставить("Колонтитулы_НаименованиеОтчета", "Журнал учета полученных, выставленных счетов фактур (534)");
	ПараметрыОтчета.Вставить("Колонтитулы_ТекущийПользователь", Строка(ПользователиКлиентСервер.АвторизованныйПользователь()));	
	ПараметрыОтчета.Вставить("ЗаполнитьДанныеДляДекларации", Ложь);
	
	Адрес = Неопределено;
	Отчеты.ЖурналУчетаПолученныхВыставленныхСчетовФактур534.СформироватьОтчет(ПараметрыОтчета, Адрес, ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли