
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьТипОбъектаУчета();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияПерейтиВСписокНажатие(Элемент)
	
	Отбор = Новый Структура("Организация", Объект.Организация);	
	ПараметрыФормы = Новый Структура("Отбор", Отбор);	
	ОткрытьФорму("Справочник.ОбъектыУчетаСистемыУчетаИмущества.ФормаВыбора", ПараметрыФормы, ВладелецФормы);
	
	Модифицированность = Ложь;
	Закрыть();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	Если Записать() Тогда
		ОповеститьОВыборе(Объект.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УстановитьТипОбъектаУчета()
	
	ТипОбъектаУчета = Объект.ВидКарты.ТипОбъектаУчета.Получить();
	Элементы.ОбъектУчета.ОграничениеТипа = ?(ТипОбъектаУчета = Неопределено, Новый ОписаниеТипов, ТипОбъектаУчета);
	
	ПараметрыВыбораОбъектаУчета = Новый Массив;
	
	ОтборОбъектаУчета = Объект.ВидКарты.ОтборОбъектаУчета;
	Если Не ПустаяСтрока(ОтборОбъектаУчета) Тогда				
		ПараметрыВыбораОбъектаУчета.Добавить(Новый ПараметрВыбора("ПредустановленныйОтбор", ОтборОбъектаУчета));		
	КонецЕсли;	
	
	Элементы.ОбъектУчета.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораОбъектаУчета);
	
КонецФункции

#КонецОбласти
