
&НаКлиенте
Перем СоответствиеВидовОбластей;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыРаскрытия	= ПолучитьИзВременногоХранилища(Параметры.АдресДанныхРаскрытия);
	АдресКонтекстаОтчета= Параметры.АдресКонтекстаОтчета;
	КодСтрокиРаскрытия 	= Параметры.КодСтроки;
	ГруппаРаскрытия		= Параметры.ГруппаРаскрытия;
	ВидОтчета			= Параметры.ВидОтчета;
	Точность			= Параметры.Точность;
	ЕдиницаИзмерения	= Параметры.ЕдиницаИзмерения;
	АдресПараметрыОтборПоКоду = Параметры.АдресПараметрыОтборПоКоду;
	
	ИменаЯчеекДлинныхСтрок = Параметры.ИменаЯчеекДлинныхСтрок;
	ВыводитьДлинныеПоляВОднуСтроку = Параметры.ВыводитьДлинныеПоляВОднуСтроку;
	
	Элементы.ФормаВыводитьДлинныеПоляВОднуСтроку.Пометка = ВыводитьДлинныеПоляВОднуСтроку;
	
	Если ЭтоАдресВременногоХранилища(АдресПараметрыОтборПоКоду) Тогда
		ТаблицаФильтровПоЗначению.Загрузить(ПолучитьИзВременногоХранилища(АдресПараметрыОтборПоКоду));
	КонецЕсли;
	
	НаДату				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ПериодОтчета,"ДатаОкончания");
	
	ОтобразитьДанныеОтчета(ПараметрыРаскрытия);
	
	УдалитьИзВременногоХранилища(Параметры.АдресДанныхРаскрытия);
	АдресДанныхРаскрытия = ПоместитьВоВременноеХранилище(ПараметрыРаскрытия,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ (ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") 
		 И ВладелецФормы.ИмяФормы = "Документ.УниверсальныйРегламентированныйОтчет.Форма.ФормаДокумента") Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность = Ложь Тогда 
		Возврат;
	КонецЕсли;
	Если ТолькоПросмотр Тогда 
		Возврат;
	КонецЕсли;	
	
	Отказ = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Источник","ПередЗакрытием");	
	
	
	ТекстВопроса = НСтр("ru = 'Сохранить произведенные изменения?'");
	Кнопки = РежимДиалогаВопрос.ДаНет;
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаРезультатаВопроса",ЭтаФорма,ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , , , );
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТабличныйДокументБланкВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если ТипЗнч(Область) <> Тип("ОбластьЯчеекТабличногоДокумента")
		 или Область.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Прямоугольник Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	ИменованаяОбласть = ТабличныйДокументБланк.Области.Найти(Область.Имя) <> Неопределено;
	Если Не ИменованаяОбласть Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Область.Расшифровка = Ложь Тогда //Это пустая область
		Возврат;
	КонецЕсли;  
		
	ИмяОбласти = Область.Имя;
	
	РеквизитыИмениОбласти = БюджетнаяОтчетностьКлиентСервер.РазобратьИмяОбласти(ИмяОбласти);
	
	ПараметрыОбласти = ПолучитьПараметрыОбласти(РеквизитыИмениОбласти.ИмяИсходнойОбласти);
	Если ПараметрыОбласти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыОбласти.ВидОбласти = 0 
		ИЛИ ПараметрыОбласти.ВидОбласти = 5 Тогда  // показатель отчета,показатель раскрытия
		
		Если Область.СодержитЗначение 
			И ТипЗнч(Область.Значение) = Тип("Булево") Тогда
			
			//сразу изменим булевое значение, без отображения списка
			
			Область.Значение = НЕ Область.Значение;
			
			ЭтотОбъект.Модифицированность = Истина;
			
			ТабличныйДокументБланкПриИзмененииСодержимогоОбласти(Элемент,Область);
			
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;
		
		СтандартнаяОбработка = Истина;
		Возврат;
	ИначеЕсли ПараметрыОбласти.ВидОбласти = 1 Тогда  //реквизит отчета
		ТекущееЗначение = ВладелецФормы.Объект[РеквизитыИмениОбласти.ИмяИсходнойОбласти];
	ИначеЕсли ПараметрыОбласти.ВидОбласти = 2 Тогда //параметр отчета 
		СтрокиПараметров = ВладелецФормы.Объект.ПараметрыОтчета.НайтиСтроки(Новый Структура("Код", РеквизитыИмениОбласти.ИмяИсходнойОбласти));
		Если СтрокиПараметров.Количество() Тогда
			ТекущееЗначение = СтрокиПараметров[0].Значение;
		Иначе
			Возврат;
		КонецЕсли;
	ИначеЕсли ПараметрыОбласти.ВидОбласти = 3 
		ИЛИ ПараметрыОбласти.ВидОбласти = 4 Тогда	//доп реквезит,аналитика раскрытия
		ТекущееЗначение = Область.Расшифровка;
	Иначе 
		ВызватьИсключение НСтр("ru = 'Неизвестный тип области.'"); 
	КонецЕсли;
	
	ПараметрыОбласти = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыОбласти);
	
	Если ЗначениеЗаполнено(ПараметрыОбласти.НастройкиЯчейки) 
		И ПараметрыОбласти.НастройкиЯчейки.ЕстьСвязанныеРеквизиты Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресДокументаОбъект"	, АдресКонтекстаОтчета);
		ПараметрыФормы.Вставить("ИмяОбласти"			, РеквизитыИмениОбласти.ИмяИсходнойОбласти);
		ПараметрыФормы.Вставить("ИдентификаторОбласти"	, РеквизитыИмениОбласти.Идентификатор);
		ПараметрыФормы.Вставить("ВидОтчета"				, ВидОтчета);
		ПараметрыФормы.Вставить("АдресПараметрыОтборПоКоду", АдресПараметрыОтборПоКоду);
		ПараметрыФормы.Вставить("УровеньТочности"	, Точность);
		ПараметрыФормы.Вставить("НаДату", НаДату);
		ПараметрыФормы.Вставить("ГруппаРаскрытия",ГруппаРаскрытия);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораСоставныхРеквизитовБланка",ЭтотОбъект,РеквизитыИмениОбласти);
		
		ТекКлючСохраненияРазмераОкна = Строка(ВидОтчета.УникальныйИдентификатор())+"/" +РеквизитыИмениОбласти.ИмяИсходнойОбласти;
		
		ПараметрыФормы.Вставить("КлючСохраненияПоложенияОкна",ТекКлючСохраненияРазмераОкна);
		
		ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.Форма.ФормаСоставныхРеквизитов",
			ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	ИначеЕсли ПараметрыОбласти.СценарийВвода <> Неопределено Тогда
		
		ВидАналитики = ПараметрыОбласти.ВидАналитики;
		
		ИдентификаторСтроки = РеквизитыИмениОбласти.Идентификатор;
		
		ЭтоПЦСР = Ложь;
		// для устаревшей классификации расходов до 2014 года
		Если ЗначениеЗаполнено(ТекущееЗначение)
			И ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ПрограммыЦелевыхСтатейКРБ") Тогда
			ЭтоПЦСР = Истина;	
		КонецЕсли;
		
		ВозможноЭтоДоходы = Ложь;
		ЭКЛДоходов = 0;//элемент классификации - 1 - вид дохода, 2 - подвид, 3 - ан. група/КЭК
		Если ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.КОСГУ")
			ИЛИ ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.КОСГУ") Тогда
			ВозможноЭтоДоходы = Истина;
			ЭКЛДоходов = 3;
		ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ГруппыПодвидовКДБ")
			ИЛИ ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.ГруппыПодвидовКДБ") Тогда
			ВозможноЭтоДоходы = Истина;
			ЭКЛДоходов = 2;
		ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ВидыДоходовКДБ")
			ИЛИ ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.ВидыДоходовКДБ") Тогда
			ВозможноЭтоДоходы = Истина;
			ЭКЛДоходов = 1;
		КонецЕсли;
		
		ВозможноЭтоЦС = Ложь;
		ЭлКлассификацииРасходов = 0;
		//элемент классификации - 1 - ЦС, 2 - Программа
		//только если строковая аналитика - будем искать строку по коду
		Если ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.ЦелевыеСтатьиКРБ") Тогда
			ВозможноЭтоЦС = Истина;
			ЭлКлассификацииРасходов = 1;
		ИначеЕсли ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.ПрограммыЦелевыхСтатейКРБ") Тогда
			ВозможноЭтоЦС = Истина;
			ЭлКлассификацииРасходов = 2;
		КонецЕсли;
		
		ВозможноЭтоКИФ = Ложь;
		ЭлКлКИФ = 0;//элемент классификации - 1 - Группа , 2 - Статья, 3 - Подвид, 4 - ан. група/КЭК
		Если ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.КОСГУ")
			ИЛИ ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.КОСГУ") Тогда
			ВозможноЭтоКИФ = Истина;
			ЭлКлКИФ = 4;
		ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ВидыКИФ")
			ИЛИ ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.ВидыКИФ") Тогда
			ВозможноЭтоКИФ = Истина;
			ЭлКлКИФ = 3;
		ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.СтатьиКИФ")
			ИЛИ ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.СтатьиКИФ") Тогда
			ВозможноЭтоКИФ = Истина;
			ЭлКлКИФ = 2;
		ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.ГруппыПодгруппыКИФ")
			ИЛИ ПараметрыОбласти.ВидКлассификатораБК = ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовОтчетов.ГруппыПодгруппыКИФ") Тогда
			ВозможноЭтоКИФ = Истина;
			ЭлКлКИФ = 1;
		КонецЕсли;
		
		СценарийВводаПП = Неопределено;
		СценарийВводаВидаДохода = Неопределено;
		СценарийВводаЦС = Неопределено;
		СценарийВводаКИФ = Неопределено;
		
		Если ЭтоПЦСР Тогда
			СценарийВводаПП = ПодготовитьВыборПрограммыЦССервер(ВидАналитики, ТекущееЗначение, ИдентификаторСтроки);
		ИначеЕсли ВозможноЭтоДоходы Тогда
			СценарийВводаВидаДохода = ПодготовитьВыборВидаДоходаСервер(ВидАналитики, ТекущееЗначение, ИдентификаторСтроки,ЭКЛДоходов);			
		ИначеЕсли ВозможноЭтоЦС Тогда
			СценарийВводаЦС = ПодготовитьВыборПоЦССервер(ВидАналитики, ТекущееЗначение, ИдентификаторСтроки, ЭлКлассификацииРасходов);	
		КонецЕсли;			
			
		Если СценарийВводаВидаДохода = Неопределено
			И ВозможноЭтоКИФ Тогда
			СценарийВводаКИФ = ПодготовитьВыборКИФСервер(ВидАналитики, ТекущееЗначение, ИдентификаторСтроки,ЭлКлКИФ);
		КонецЕсли;
		
		Если СценарийВводаПП <> Неопределено Тогда 
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ДополнительныйОтбор",СценарийВводаПП.СценарийВвода.ФиксированныйОтбор);
			ПараметрыФормы.Вставить("ТекущаяСтрока"		 ,СценарийВводаПП.ТекущееЗначение);
			ПараметрыФормы.Вставить("РежимВыбора"		 ,Истина);
			
			ИмяФормыВыбора = СценарийВводаПП.СценарийВвода.ФормаВыбора;
	    ИначеЕсли СценарийВводаВидаДохода <> Неопределено Тогда
			
			ПараметрыОбласти.СценарийВвода = СценарийВводаВидаДохода.СценарийВвода;
			
	    	ПараметрыФормы = Новый Структура;
	    	ТекОтбор = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СценарийВводаВидаДохода.СценарийВвода.ФиксированныйОтбор);
	    	ТекОтбор.Вставить("ВидДохода",СценарийВводаВидаДохода.ТекущееЗначение);
	    	
	    	ПараметрыФормы.Вставить("ДополнительныйОтбор",ТекОтбор);
	    	ПараметрыФормы.Вставить("ТекущаяСтрока",СценарийВводаВидаДохода.ТекущееЗначение);
	    	ПараметрыФормы.Вставить("РежимВыбора"		 ,Истина);	 
	    	
	    	ИмяФормыВыбора = СценарийВводаВидаДохода.СценарийВвода.ФормаВыбора;
			
		ИначеЕсли СценарийВводаЦС <> Неопределено Тогда 
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ДополнительныйОтбор",СценарийВводаЦС.СценарийВвода.ФиксированныйОтбор);
			ПараметрыФормы.Вставить("ТекущаяСтрока"		 ,СценарийВводаЦС.ТекущееЗначение);
			ПараметрыФормы.Вставить("РежимВыбора"		 ,Истина);
			
			ИмяФормыВыбора = СценарийВводаЦС.СценарийВвода.ФормаВыбора;
			
		ИначеЕсли СценарийВводаКИФ <> Неопределено Тогда
			
			ПараметрыОбласти.СценарийВвода = СценарийВводаКИФ.СценарийВвода;
			
	    	ПараметрыФормы = Новый Структура;
			
			ПараметрыФормы.Вставить("ТекущаяСтрока",СценарийВводаКИФ.ТекущееЗначение);
			
	    	ПараметрыФормы.Вставить("РежимВыбора"		 ,Истина);	 
	    	
	    	ИмяФормыВыбора = СценарийВводаКИФ.СценарийВвода.ФормаВыбора;
				
		Иначе
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ТекущееЗначение",ТекущееЗначение);
			ДополнительныеПараметры.Вставить("ВидАналитики",ПараметрыОбласти.ВидАналитики);
			ДополнительныеПараметры.Вставить("ИдентификаторСтроки",РеквизитыИмениОбласти.Идентификатор);
			ДополнительныеПараметры.Вставить("СценарийВвода",ПараметрыОбласти.СценарийВвода);
	
			ПараметрыФормы = БюджетнаяОтчетностьКлиент.СформироватьПараметрыВыбораПоСценарию(ДополнительныеПараметры, ТабличныйДокументБланк, ГруппаРаскрытия, ЭтаФорма);
			
			ИмяФормыВыбора = ПараметрыОбласти.СценарийВвода.ФормаВыбора;
			
		КонецЕсли;
		
		Если ПараметрыОбласти.СценарийВвода.Свойство("ВидАналитикиСценария") Тогда
			ПараметрыОбласти.ВидАналитики = ПараметрыОбласти.СценарийВвода.ВидАналитикиСценария;
		КонецЕсли;	
		
		ДополнительныеПараметры = Новый Структура;
		
		Если ПараметрыОбласти.СценарийВвода.ЕстьСвязиВыбора Тогда
			ИмяПроцедурыОбработкиВыбора = "ПослеВыбораЗначенияПоСценариюВвода";
			
			ДополнительныеПараметры.Вставить("ГруппаРаскрытия",ГруппаРаскрытия);
			ДополнительныеПараметры.Вставить("ВидАналитики",ПараметрыОбласти.ВидАналитики);
			ДополнительныеПараметры.Вставить("Идентификатор",РеквизитыИмениОбласти.Идентификатор);
		Иначе 
			ИмяПроцедурыОбработкиВыбора = "ПослеВыбораОбычногоЗначения";
			
			ДополнительныеПараметры.Вставить("РеквизитыИмениОбласти",РеквизитыИмениОбласти);
			ДополнительныеПараметры.Вставить("ВидОбласти",ПараметрыОбласти.ВидОбласти);
			ДополнительныеПараметры.Вставить("Область",Область);
		КонецЕсли; 
		

		Если ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
			ПараметрыОтбора = Новый Структура;
			ПараметрыФормы.Вставить("ОтборПоВидуКонтрагента",ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо"));
		КонецЕсли;

		
		ПараметрыФормы.Вставить("ОтветСтруктурой", Истина);
		ПараметрыФормы.Вставить("НаДату", НаДату);
				
		ОписаниеОповещения = Новый ОписаниеОповещения(ИмяПроцедурыОбработкиВыбора,ЭтотОбъект,ДополнительныеПараметры);
		
		ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе
		
		Если ПараметрыОбласти.ИмяТипа = "Справочник.КОСГУ_ВидыРасходовКРБ" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НаДату", НаДату);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("РеквизитыИмениОбласти",РеквизитыИмениОбласти);
			ДополнительныеПараметры.Вставить("ВидОбласти",ПараметрыОбласти.ВидОбласти);
			ДополнительныеПараметры.Вставить("Область",Область);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОбычногоЗначения",ЭтотОбъект,ДополнительныеПараметры);
			
			ОткрытьФорму("Документ.УниверсальныйРегламентированныйОтчет.Форма.ФормаВыбораРеквизитовКОСГУ_КРБ", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
			
		ИначеЕсли ТекущееЗначение = Неопределено И Лев(ПараметрыОбласти.ИмяТипа, 10) = "Справочник" Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("НаДату", НаДату);
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("РеквизитыИмениОбласти",РеквизитыИмениОбласти);
			ДополнительныеПараметры.Вставить("ВидОбласти",ПараметрыОбласти.ВидОбласти);
			ДополнительныеПараметры.Вставить("Область",Область);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОбычногоЗначения",ЭтотОбъект,ДополнительныеПараметры);
			
			ОткрытьФорму(ПараметрыОбласти.ИмяТипа + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Возврат;
		КонецЕсли;
		
		ИмяТипа = ПараметрыОбласти.ИмяТипа; 
		ВидАналитики = ПараметрыОбласти.ВидАналитики;
		
		Если ТекущееЗначение = Неопределено Тогда
			ПоказатьПредупреждение(,
				НСтр("ru = 'Невозможно выбрать значение для неопределенного типа. 
					|Не установлен тип по умолчанию для данного реквизита.'"));
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИмяТипа) Тогда
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВидОбласти",ПараметрыОбласти.ВидОбласти);
			ДополнительныеПараметры.Вставить("Область",Область);
		    ДополнительныеПараметры.Вставить("РеквизитыИмениОбласти",РеквизитыИмениОбласти);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОбычногоЗначения",ЭтотОбъект,ДополнительныеПараметры);
			
			ПоказатьВводЗначения(ОписаниеОповещения,ТекущееЗначение,Нстр("ru='Введите значение реквизита'"));
			
		Иначе 
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ТекущаяСтрока",ТекущееЗначение);
			ПараметрыФормы.Вставить("НаДату", НаДату);
			

			Если  ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.Субконто") 
				И ВидАналитики <> Неопределено  Тогда
				
				ВладелецСубконто = ПолучитьВладельцаСубконто(ВидАналитики);
				
				ПараметрыОтбораСубконто = Новый Структура;
				ПараметрыОтбораСубконто.Вставить("Владелец",ВладелецСубконто);
				ЗаполнитьПараметрыОтбораПоФильтру(ПараметрыОтбораСубконто, РеквизитыИмениОбласти.ИмяИсходнойОбласти);
				
				ПараметрыФормы.Вставить("Отбор",ПараметрыОтбораСубконто);
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
				
				ПараметрыОтбораСубконто = Новый Структура;
				ЗаполнитьПараметрыОтбораПоФильтру(ПараметрыОтбораСубконто, РеквизитыИмениОбласти.ИмяИсходнойОбласти);
				Если ПараметрыОтбораСубконто.Свойство("Код") Тогда
					ПараметрыФормы.Вставить("ОтборПоПараметруБланка",ПараметрыОтбораСубконто.Код);
				КонецЕсли;	
				
			ИначеЕсли ТипЗнч(ТекущееЗначение) = Тип("СправочникСсылка.Контрагенты") Тогда
				
				ПараметрыФормы.Вставить("ОтборПоВидуКонтрагента",ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо"));
				
			ИначеЕсли ИмяТипа = "Справочник.СтраныМира" Тогда	
				ПараметрыФормы.Вставить("РежимВыбора", Истина);				
			КонецЕсли;


			ИмяФормыВыбора = ИмяТипа+".ФормаВыбора";
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВидОбласти",ПараметрыОбласти.ВидОбласти);
			ДополнительныеПараметры.Вставить("Область",Область);
		    ДополнительныеПараметры.Вставить("РеквизитыИмениОбласти",РеквизитыИмениОбласти);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораОбычногоЗначения",ЭтотОбъект,ДополнительныеПараметры);
		
			ОткрытьФорму(ИмяФормыВыбора, ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументБланкПриИзмененииСодержимогоОбласти(Элемент, Область)
	
	ИмяОбласти = Область.Имя;
	Если Найти(ИмяОбласти,"_") = 0 Тогда
		Возврат;
	Иначе
		
		ВладелецФормы.ОбработатьРедактированиеФормы();
		
		РеквизитыИмениОбласти = БюджетнаяОтчетностьКлиентСервер.РазобратьИмяОбласти(ИмяОбласти);
		Значение = ?(Область.СодержитЗначение,Область.Значение,Область.Текст);
		
		ОтразитьВыборЗначенияВДанныхФормы(ЭтаФорма, Значение, 5, РеквизитыИмениОбласти);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Добавление строки раскрытия в бланк
//
&НаКлиенте
Процедура Подключаемый_ДобавитьСтроку(Команда)

	Стр    = ТаблицаРаскрытия.Добавить();
	Стр.ID = ТаблицаРаскрытия.Количество() - 1;
	
	ОбновитьСодержимоеБланка();
	ТабличныйДокументБланк.ТекущаяОбласть = ТабличныйДокументБланк.Область(1, ТабличныйДокументБланк.ВысотаТаблицы);
	
КонецПроцедуры // Подключаемый_ДобавитьСтроку()

// Копирование строки раскрытия в бланке
//
&НаКлиенте
Процедура Подключаемый_СкопироватьСтроку(Команда)

	ТекущаяОбласть = ТабличныйДокументБланк.ТекущаяОбласть;
	Если ТабличныйДокументБланк.Области.Найти(ТекущаяОбласть.Имя) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОбласти = БюджетнаяОтчетностьКлиентСервер.РазобратьИмяОбласти(ТекущаяОбласть.Имя);
	Если РеквизитыОбласти <> Неопределено Тогда
		
		СтрИсточник = ПолучитьСтрокуРаскрытияПоИдентификатору(ТаблицаРаскрытия, РеквизитыОбласти.Идентификатор);
		Если СтрИсточник <> Неопределено Тогда
			Стр = ТаблицаРаскрытия.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, СтрИсточник);
			Стр.ID = ТаблицаРаскрытия.Количество() - 1;
			ОбновитьСодержимоеБланка();
			ТабличныйДокументБланк.ТекущаяОбласть = ТабличныйДокументБланк.Область(1, ТабличныйДокументБланк.ВысотаТаблицы);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // Подключаемый_ДобавитьСтроку()

// Копирование строки раскрытия в бланке
//
&НаКлиенте
Процедура Подключаемый_УдалитьСтроку(Команда)

	ТекущаяОбласть = ТабличныйДокументБланк.ТекущаяОбласть;
	Если ТабличныйДокументБланк.Области.Найти(ТекущаяОбласть.Имя) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОбласти = БюджетнаяОтчетностьКлиентСервер.РазобратьИмяОбласти(ТекущаяОбласть.Имя);
	Если РеквизитыОбласти <> Неопределено Тогда
		
		СтрИсточник = ПолучитьСтрокуРаскрытияПоИдентификатору(ТаблицаРаскрытия, РеквизитыОбласти.Идентификатор);
		Если СтрИсточник <> Неопределено Тогда
			ТаблицаРаскрытия.Удалить(СтрИсточник);
			ОбновитьСодержимоеБланка();
		КонецЕсли;
		
	КонецЕсли;


КонецПроцедуры // Подключаемый_ДобавитьСтроку()

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидОтчета"			,ВидОтчета);
	ПараметрыФормы.Вставить("ТекущиеНастройки"	,АдресДанныхРаскрытия);
	ПараметрыФормы.Вставить("ГруппаРаскрытия"	,ГруппаРаскрытия);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяФормы","Документ.УниверсальныйРегламентированныйОтчет.Форма.НастройкаСписка"); 
	ДополнительныеПараметры.Вставить("ПараметрыФормы",ПараметрыФормы);
	ДополнительныеПараметры.Вставить("ВладелецФормы",ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПервичнаяПроверка","Результат <> Неопределено");
	ДополнительныеПараметры.Вставить("ОбработкаРезультата", Новый ОписаниеОповещения("ПослеЗакрытияДочернейФормы",ЭтаФорма)); 
	
	БюджетнаяОтчетностьКлиент.ОткрытьФормуСПростойОбработкой(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ВернутьДанные();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВыделенныеЯчейки(Команда)
	Для Каждого Обл Из Элементы.ТабличныйДокументБланк.ПолучитьВыделенныеОбласти() Цикл
		
		Для СчСтрок = Обл.Верх По Обл.Низ Цикл
			Для СчКолонок = Обл.Лево По Обл.Право Цикл
				
				ТекОбласть = ТабличныйДокументБланк.Область(СчСтрок,СчКолонок);
				
				Если ТекОбласть.СодержитЗначение Тогда
					ИмяОбласти = ТекОбласть.Имя;
					Если Найти(ИмяОбласти,"_") > 0 Тогда
						ТекОбласть.Значение = Неопределено;
						РеквизитыИмениОбласти = БюджетнаяОтчетностьКлиентСервер.РазобратьИмяОбласти(ИмяОбласти);
						ПараметрыОбл = ПолучитьПараметрыОбласти(ИмяОбласти);
						ОтразитьВыборЗначенияВДанныхФормы(ЭтаФорма, Неопределено, ПараметрыОбл.ВидОбласти, РеквизитыИмениОбласти);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	ВладелецФормы.ОбработатьРедактированиеФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаРезультатаВопроса(Результат, ДополнительныеПараметры) Экспорт 
	
	Если ДополнительныеПараметры.Источник = "ПередЗакрытием" Тогда 
		
		Если Результат = КодВозвратаДиалога.Да Тогда 
			
			Модифицированность = Ложь;
			ВернутьДанные();
			
		ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда 
			
			Модифицированность = Ложь;
			Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДочернейФормы(Результат, ДополнительныеПараметры) Экспорт 
	
	ПрименитьНастройкуСписка(Результат);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// Процедуры отображения в таблице формы

&НаСервере
Процедура ПодготовитьТаблицуПоказателей(ГруппаРаскрытия)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоказателиОтчетов.Код,
	|	ПоказателиОтчетов.ТипЗначения,
	|	ПоказателиОтчетов.СпособОбработки,
	|	ПоказателиОтчетов.Ссылка,
	|	ПоказателиОтчетов.Колонка.Наименование КАК Наименование,
	|	ПоказателиОтчетов.НеМасштабируется,
	|	ПоказателиОтчетов.РазрешитьПромежуточныеИтоги,
	|	ПоказателиОтчетов.ВидИтога,
	|	ПоказателиОтчетов.НеФинансовый,
	|	ПоказателиОтчетов.НеМасштабируется КАК НеМасштабируется1,
	|	ПоказателиОтчетов.РазрешитьПромежуточныеИтоги КАК РазрешитьПромежуточныеИтоги1
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &ВидОтчета
	|	И ПоказателиОтчетов.ГруппаРаскрытия = &ГруппаРаскрытия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоказателиОтчетов.Колонка.ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("ВидОтчета"		,ВидОтчета);
	Запрос.УстановитьПараметр("ГруппаРаскрытия"	,ГруппаРаскрытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = ТаблицаПоказателей.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Выборка);
		Стр.Код = СокрП(Стр.Код);
	КонецЦикла;

КонецПроцедуры // ПодготовитьТаблицуПоказателей()

&НаСервере
Процедура ПодготовитьТаблицуАналитики(ГруппаРаскрытия)

	ТаблицаВсехАналитик 	= БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	АналитикаТекущейГруппы  = ТаблицаВсехАналитик.НайтиСтроки(Новый Структура("ГруппаРаскрытия",ГруппаРаскрытия));
	
	Для Каждого СтрАналитика Из АналитикаТекущейГруппы Цикл
		
		Стр = ТаблицаАналитики.Добавить();
		
		Стр.ВидАналитики = СтрАналитика.ВидАналитики;
		Стр.Код			 = СтрАналитика.КодВидаАналитики;
		Стр.ТипЗначения	 = СтрАналитика.ТипЗначения;
		Стр.ИмяАналитики = СтрАналитика.ИмяОбъектаАналитики;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СгенерироватьТаблицу(ПараметрыРаскрытия)

	ДобавляемыеЭлементы = СоздатьРеквизитТаблицаРаскрытия(ПараметрыРаскрытия);
	
	СоздатьЭлементФормыТаблицаРаскрытия(ДобавляемыеЭлементы);
	
	Для Каждого СтрДанных Из ПараметрыРаскрытия.ТаблицаРаскрытия Цикл
		СтрФормы = ТаблицаРаскрытия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрФормы,СтрДанных);
	КонецЦикла;
	
КонецПроцедуры // СгенерироватьТаблицу()

&НаСервере
Процедура СоздатьЭлементФормыТаблицаРаскрытия(Знач ДобавляемыеЭлементы)

	// Создание элементов формы
	Для Каждого СтрЭлемент Из ДобавляемыеЭлементы Цикл
		
		РеквизитФормы = СтрЭлемент.РеквизитФормы;
		
		ЭлементФормы			 = Элементы.Добавить("ТаблицаРаскрытия"+РеквизитФормы.Имя,Тип("ПолеФормы"),Элементы.ТаблицаРаскрытия);
		ЭлементФормы.Вид 		 = ВидПоляФормы.ПолеВвода;
		ЭлементФормы.ПутьКДанным = "ТаблицаРаскрытия." + РеквизитФормы.Имя;
		
		Если СтрЭлемент.ЭтоПоказатель Тогда
			
			СтрПоказатель = ТаблицаПоказателей.НайтиСтроки(Новый Структура("Код",СтрЭлемент.Ключ))[0];
			Если СтрПоказатель.СпособОбработки = Перечисления.СпособыОбработкиПоказателейОтчетов.Вычисление Тогда
				ЭлементФормы.ЦветФона 		= ЦветаСтиля.ЦветВычисляемогоПоказателя;
				ЭлементФормы.ТолькоПросмотр = Истина;
			Иначе
				ЭлементФормы.ЦветФона = ЦветаСтиля.ЦветЗаполняемогоПоказателя;
			КонецЕсли;
						
			ЭлементФормы.РежимРедактирования 	  = РежимРедактированияКолонки.ВходПриВводе;
			ЭлементФормы.РастягиватьПоГоризонтали = Истина;
			МаксимальнаяДлинаЗаголовка 			  = 50;
			
			Если СтрДлина(РеквизитФормы.Заголовок) > МаксимальнаяДлинаЗаголовка Тогда
				ЭлементФормы.Заголовок = Лев(РеквизитФормы.Заголовок,МаксимальнаяДлинаЗаголовка)+"...";
				ЭлементФормы.Подсказка = РеквизитФормы.Заголовок;
				РеквизитФормы.Заголовок = "";
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(СтрЭлемент.ВидАналитикиПараметрВыбора) Тогда
			
			МассивПараметровВыбора = Новый Массив;
			МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец",СтрЭлемент.ВидАналитикиПараметрВыбора));
			ЭлементФормы.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // СоздатьЭлементФормыТаблицаРаскрытия()

&НаСервере
Процедура СортироватьТаблицуРаскрытия(ПараметрыРаскрытия)
    Перем ТаблицаРаскрытия;
	
	ТаблицаРаскрытия 	= ПараметрыРаскрытия.ТаблицаРаскрытия;
	НастройкаСортировки = ПараметрыРаскрытия.ПоляСортировки;
	
	РазрешенныеПоля = НастройкаСортировки.СкопироватьКолонки();
	РазрешенныеПоля.Колонки.Добавить("ПолеВладелец");
	РазрешенныеПоля.Колонки.Добавить("ПолеРеквизит");
	
	Для Каждого Поле Из НастройкаСортировки Цикл
		
		ИмяПоля		= Поле.ИмяПоля;
		Направление = Поле.НаправлениеСортировки;
		
		Если Не ТаблицаРаскрытия.Колонки.Найти(ИмяПоля) = Неопределено Тогда
			
			Стр = РазрешенныеПоля.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Поле);
			
		ИначеЕсли Лев(ИмяПоля,9) = "Аналитика" Тогда
			
			Расширение = Найти(ИмяПоля,"_");
			Если Расширение <> 0 Тогда
								
				Окончание = Сред(ИмяПоля,Расширение + 1);
				ИдентификаторПоля = Лев(ИмяПоля,Расширение - 1);
				
				Если ТаблицаРаскрытия.Колонки.Найти(ИдентификаторПоля) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Стр = РазрешенныеПоля.Добавить();
				Стр.ИмяПоля 	 = ИдентификаторПоля + "." + Окончание;
				Стр.ПолеВладелец = ИдентификаторПоля;
				Стр.ПолеРеквизит = Окончание;
				Стр.НаправлениеСортировки = Направление;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если РазрешенныеПоля.Количество() > 0 Тогда
		
		ТекстПоля = "";
		Для Каждого Колонка Из ТаблицаРаскрытия.Колонки Цикл
			Если Не (Колонка.Имя = "ID" или Колонка.Имя = "Индекс") Тогда
			    ТекстПоля = ТекстПоля + ",
				|	ТаблицаРаскрытия." + Колонка.Имя;
			КонецЕсли;
		КонецЦикла;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ"
		+ Сред(ТекстПоля,2) + "
		|ПОМЕСТИТЬ ТаблицаРаскрытия
		|ИЗ
		|	&ТаблицаРаскрытия КАК ТаблицаРаскрытия
		|;
		|ВЫБРАТЬ"
		+ Сред(ТекстПоля,2) + "
		|ИЗ
		|	ТаблицаРаскрытия КАК ТаблицаРаскрытия";
		
		ТекстСортировка = "";
		
		Для Каждого Поле Из РазрешенныеПоля Цикл
			ТекстСортировка = ТекстСортировка + ",			
			|	" + Поле.ИмяПоля + ?(Поле.НаправлениеСортировки = НаправлениеСортировкиКомпоновкиДанных.Убыв," УБЫВ"," ВОЗР");
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО"
		+ Сред(ТекстСортировка,2)+"
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТаблицаРаскрытия",ТаблицаРаскрытия);
		
		Попытка
			ВремТаблица = Запрос.Выполнить().Выгрузить();
		Исключение
			Сообщить("Ошибка в настройке сортировки. " + ИнформацияОбОшибке().Описание);
			Возврат;
		КонецПопытки;
		
		ПараметрыРаскрытия.ТаблицаРаскрытия.Очистить();
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ВремТаблица,ПараметрыРаскрытия.ТаблицаРаскрытия);
		ПеренумероватьТаблицуРаскрытия(ПараметрыРаскрытия.ТаблицаРаскрытия);
		
	КонецЕсли;

КонецПроцедуры // СортироватьТаблицуРаскрытия()

&НаСервере
Процедура ПеренумероватьТаблицуРаскрытия(ТаблицаРаскрытия)

	Счетчик = 0;
	Для Каждого Стр Из ТаблицаРаскрытия Цикл
		
		Стр.ID 		= Счетчик;
		Стр.Индекс  = Счетчик + 1;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;

КонецПроцедуры // ПеренумероватьТаблицуРаскрытия()

&НаСервере
Процедура ПрименитьНастройкуСписка(РезультатНастройки) 
 
	Результат 			= ПолучитьИзВременногоХранилища(РезультатНастройки);
	ПараметрыРаскрытия 	= ПолучитьИзВременногоХранилища(АдресДанныхРаскрытия);
	
	// Синхронизация изменений.
	ПрименитьРедактированиеТаблицы(ПараметрыРаскрытия);
	
	Если Результат.Сортировка.Количество() Тогда
		ПараметрыРаскрытия.ПоляСортировки 	= Результат.Сортировка.Скопировать();
		СортироватьТаблицуРаскрытия(ПараметрыРаскрытия);
	КонецЕсли;
		
	СтруктураОтбора = Новый Структура;
	Для Каждого ПолеОтбора Из Результат.Отбор Цикл
		СтруктураЗначения = Новый Структура;
		СтруктураЗначения.Вставить("ВидСравнения",ПолеОтбора.ВидСравнения);
		СтруктураЗначения.Вставить("Значение"	 ,ПолеОтбора.Значение);
		
		СтруктураОтбора.Вставить(ПолеОтбора.ИмяПоля,СтруктураЗначения);
		
	КонецЦикла;
	
	ПараметрыРаскрытия.ОтборПоРаскрытию = СтруктураОтбора;
	
	ОбновитьОтображаемыеДанные(ПараметрыРаскрытия);

КонецПроцедуры // ПрименитьНастройкуСписка()

&НаСервере
Функция ВернутьЗначениеДелителя()
	
	Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		Возврат 1000000;
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда
		Возврат 1000;
	Иначе
		Возврат 1;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПрименитьРедактированиеТаблицы(Знач ПараметрыРаскрытия = Неопределено)

	Если ПараметрыРаскрытия = Неопределено Тогда
		ПараметрыРаскрытия 	= ПолучитьИзВременногоХранилища(АдресДанныхРаскрытия);
	КонецЕсли;
	
	СохраненнаяТаблица  = ПараметрыРаскрытия.ТаблицаРаскрытия;
	ТаблицаФормы		= РеквизитФормыВЗначение("ТаблицаРаскрытия");
	
	ТабПоказатели = РеквизитФормыВЗначение("ТаблицаПоказателей");
	ТабПоказатели.Индексы.Добавить("Код");
	
	СтрокиКУдалению = Новый Массив;
	
	Для Каждого СтрСохраненная Из СохраненнаяТаблица Цикл
		СтрФормы = ТаблицаФормы.Найти(СтрСохраненная.ID,"ID");
		Если СтрФормы = Неопределено Тогда
			СтрокиКУдалению.Добавить(СтрСохраненная);
		Иначе
			ЗаполнитьЗначенияСвойств(СтрСохраненная,СтрФормы,,"ID");
			
			Для Каждого СтрПоказатель Из ТабПоказатели Цикл
				Если СтрПоказатель.НеМасштабируется Тогда
					СтрСохраненная[СтрПоказатель.Код] = СтрФормы[СтрПоказатель.Код + "_Отображение"];
				Иначе
					СтрСохраненная[СтрПоказатель.Код] = СтрФормы[СтрПоказатель.Код + "_Отображение"] * ВернутьЗначениеДелителя();
				КонецЕсли;
			КонецЦикла;
			ТаблицаФормы.Удалить(СтрФормы);
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрУдаления Из СтрокиКУдалению Цикл
		СохраненнаяТаблица.Удалить(СтрУдаления);
	КонецЦикла;
	
	Для Каждого СтрФормы Из ТаблицаФормы Цикл
		СтрСохраненная = СохраненнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(СтрСохраненная,СтрФормы);
		Для Каждого СтрПоказатель Из ТабПоказатели Цикл
			Если СтрПоказатель.НеМасштабируется Тогда
				СтрСохраненная[СтрПоказатель.Код] = СтрФормы[СтрПоказатель.Код + "_Отображение"];
			Иначе
				СтрСохраненная[СтрПоказатель.Код] = СтрФормы[СтрПоказатель.Код + "_Отображение"] * ВернутьЗначениеДелителя();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ПеренумероватьТаблицуРаскрытия(СохраненнаяТаблица);
	ОбновитьОтображаемыеДанные(ПараметрыРаскрытия);
	
	ПоместитьВоВременноеХранилище(ПараметрыРаскрытия,АдресДанныхРаскрытия);
	
КонецПроцедуры // ПрименитьРедактированиеТаблицы()

&НаСервере
Процедура ОтобразитьТаблицуРаскрытияВФорме(Знач ПараметрыРаскрытия)
	
	ТаблицаРаскрытия.Очистить();
	
	Если ЗначениеЗаполнено(ПараметрыРаскрытия.ОтборПоРаскрытию) Тогда
		РезультатЗапроса = БюджетнаяОтчетность.РезультатЗапросаПоТаблицеЗначений(ПараметрыРаскрытия.ТаблицаРаскрытия,ПараметрыРаскрытия.ОтборПоРаскрытию);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РезультатЗапроса.Выгрузить(),ТаблицаРаскрытия);
	Иначе
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПараметрыРаскрытия.ТаблицаРаскрытия,ТаблицаРаскрытия);
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
// Процедуры отображения в табличном документе

&НаСервере
Процедура СгенерироватьБланк(Знач ПараметрыРаскрытия)

	СоздатьРеквизитТаблицаРаскрытия(ПараметрыРаскрытия);
	СоздатьЭлементыУправленияТаблицейБланка(ПараметрыРаскрытия);
	
	Для Каждого СтрДанных Из ПараметрыРаскрытия.ТаблицаРаскрытия Цикл
		СтрФормы = ТаблицаРаскрытия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрФормы,СтрДанных);
	КонецЦикла;
	
	Если ТаблицаРаскрытия.Количество() = 0 Тогда
		ТаблицаРаскрытия.Добавить();
	КонецЕсли;
	
	НарисоватьБланк(ТаблицаРаскрытия.Выгрузить(), ПараметрыРаскрытия.МакетыРаскрытия);
	
КонецПроцедуры // СгенерироватьБланк()

&НаСервере
Процедура ОбновитьСодержимоеБланка()

	ПараметрыРаскрытия = ПолучитьИзВременногоХранилища(АдресДанныхРаскрытия);
	
	Если ТаблицаРаскрытия.Количество() = 0 Тогда
		ТаблицаРаскрытия.Добавить();
	КонецЕсли;
	
	НарисоватьБланк(ТаблицаРаскрытия.Выгрузить(), ПараметрыРаскрытия.МакетыРаскрытия);

КонецПроцедуры // ОбновитьСодержимоеБланка()

&НаСервере
Процедура НарисоватьБланк(Знач ТЗТаблицаРаскрытия, Знач МакетыРаскрытия)

	ТабличныйДокументБланк.Очистить();
	
	Контекст = ПолучитьИзВременногоХранилища(АдресКонтекстаОтчета);
	ОтчетОбъект = Документы.УниверсальныйРегламентированныйОтчет.СоздатьДокумент();
	ОтчетОбъект.ВидОтчета        = ВидОтчета;
	ОтчетОбъект.ЕдиницаИзмерения = ЕдиницаИзмерения;
	ОтчетОбъект.УровеньТочности  = Точность;
	ОтчетОбъект.ЗагрузитьВнутренниеСвойства(Контекст);
	
	Макет = ОтчетОбъект.СгенерироватьМакетРаскрытия(Неопределено, ГруппаРаскрытия, ТЗТаблицаРаскрытия, МакетыРаскрытия);
	
	ТабличныйДокументБланк.Вывести(Макет);
	ПрименитьНастройкуВыводаДлинныхСтрок(ТабличныйДокументБланк,ИменаЯчеекДлинныхСтрок,ВыводитьДлинныеПоляВОднуСтроку);
	
КонецПроцедуры // НарисоватьБланк()

&НаСервере
Процедура СоздатьЭлементыУправленияТаблицейБланка(Знач ПараметрыРаскрытия)
	
	ДобавитьКомандуВПанель("ДобавитьСтроку"   , НСтр("ru = 'Добавить строку'"), БиблиотекаКартинок.ДобавитьЭлементСписка);
	ДобавитьКомандуВПанель("СкопироватьСтроку", НСтр("ru = 'Скопировать строку'"), БиблиотекаКартинок.СкопироватьЭлементСписка);
	ДобавитьКомандуВПанель("УдалитьСтроку"    , НСтр("ru = 'Удалить строку'"), БиблиотекаКартинок.УдалитьЭлементСписка);
	
КонецПроцедуры

&НаСервере
Функция ДобавитьКомандуВПанель(Знач Имя, Знач Заголовок, Знач Картинка, Знач ГруппаФормы = Неопределено, Знач ИзменяетДанные = Истина)

	Команда = Команды.Добавить(Имя);
	Команда.ИзменяетСохраняемыеДанные = ИзменяетДанные;
	Если Картинка <> Неопределено Тогда
		Команда.Картинка = Картинка;
	КонецЕсли;
	
	Команда.Действие = "Подключаемый_" + Имя;
	
	Если ГруппаФормы = Неопределено Тогда
		ГруппаФормы = Элементы.Найти("КнопкиУправленияСпискомБланка");
		Если ГруппаФормы = Неопределено Тогда
			
			МестоВставки = ?(Элементы.КнопкиУправленияТаблицей.ПодчиненныеЭлементы.Количество() = 0,
					Неопределено,
					Элементы.КнопкиУправленияТаблицей.ПодчиненныеЭлементы[0]);
					
			ГруппаФормы = Элементы.Вставить("КнопкиУправленияСпискомБланка", 
						Тип("ГруппаФормы"), 
						Элементы.КнопкиУправленияТаблицей,
						МестоВставки);
						
			ГруппаФормы.Вид = ВидГруппыФормы.ГруппаКнопок;
						
		КонецЕсли;
		
	КонецЕсли;
	
	Кнопка = Элементы.Добавить("КомандаБланка"+Имя, 
					Тип("КнопкаФормы"), 
					ГруппаФормы);
					
	Кнопка.ИмяКоманды = Имя;
	
	Возврат Кнопка;
	
КонецФункции // ДобавитьКомандуВПанель()

// Запрашивает тип области для открытия нужной формы выбора.
//
&НаКлиенте
Функция ПолучитьПараметрыОбласти(ИмяОбласти)

	Если СоответствиеВидовОбластей = Неопределено Тогда
		СоответствиеВидовОбластей = Новый Соответствие;
	КонецЕсли;
	
	Результат = СоответствиеВидовОбластей[ИмяОбласти];
	Если Результат = Неопределено Тогда
		Результат = БюджетнаяОтчетность.ПолучитьПараметрыОбласти(ВидОтчета, ВладелецФормы.АдресНастроекОтчета, ИмяОбласти, "ВОтдельномОкне");
		
		Если Результат = Неопределено Тогда
			Результат = 0;
		КонецЕсли;
		
		СоответствиеВидовОбластей.Вставить(ИмяОбласти,Результат);
		
	КонецЕсли;

	Возврат ?(Результат = 0,Неопределено,Результат);
	
КонецФункции // ПолучитьПараметрыОбласти()

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтрокуРаскрытияПоИдентификатору(Знач ТаблицаРаскрытия, Знач Идентификатор)

	СтрокиДанных = ТаблицаРаскрытия.НайтиСтроки(Новый Структура("ID", Идентификатор));
	Если СтрокиДанных.Количество() Тогда
		Возврат СтрокиДанных[0];
	Иначе 
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьСтрокуРаскрытияПоИдентификатору()

&НаКлиентеНаСервереБезКонтекста
Процедура ОтразитьВыборЗначенияВДанныхФормы(Знач Форма, Знач ЗначениеВыбора, Знач ВидОбласти, Знач РеквизитыИмениОбласти)

	Если ВидОбласти = Неопределено Тогда
		ВидОбласти = ПолучитьВидИсточникаДанных(Форма.ВидОтчета, РеквизитыИмениОбласти.ИмяИсходнойОбласти);
	КонецЕсли;
	
	СтрокаДанных = ПолучитьСтрокуРаскрытияПоИдентификатору(Форма.ТаблицаРаскрытия, РеквизитыИмениОбласти.Идентификатор);
	
	УстановитьЗначениеВСтрокеТаблицы(Форма, СтрокаДанных, ВидОбласти, РеквизитыИмениОбласти, ЗначениеВыбора);
	
КонецПроцедуры // ОтразитьВыборЗначенияВДанныхФормы()

&НаСервереБезКонтекста
Функция ПолучитьВидИсточникаДанных(ВидОтчета,ИмяОбласти)
	Возврат БюджетнаяОтчетностьСервер.ПолучитьВидИсточникаДанныхОбласти(ВидОтчета, ИмяОбласти);	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеВСтрокеТаблицы(Знач Форма, Знач СтрокаТаблицы, Знач ВидОбласти, Знач РеквизитыИмениОбласти, Знач Значение)

	Если ВидОбласти = 4 Тогда
		
		ПозИмени = Найти(РеквизитыИмениОбласти.ИмяИсходнойОбласти, "_Аналитика");
		Если ПозИмени = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Числа = "1234567890";
		ПозИндекса = ПозИмени+10;
		ИмяАналитики = Сред(РеквизитыИмениОбласти.ИмяИсходнойОбласти, ПозИмени+1, 9);
		Пока Истина Цикл
			ТекСимвол = Сред(РеквизитыИмениОбласти.ИмяИсходнойОбласти, ПозИндекса, 1);
			Если Не ПустаяСтрока(ТекСимвол) и Найти(Числа, ТекСимвол) > 0 Тогда
				ИмяАналитики = ИмяАналитики + ТекСимвол;
				ПозИндекса = ПозИндекса + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОписательАналитики = Форма.ТаблицаАналитики.НайтиСтроки(Новый Структура("ИмяАналитики", ИмяАналитики));
		Если ОписательАналитики.Количество() Тогда
			СтрокаТаблицы[ИмяАналитики] = Значение;
		КонецЕсли;
		
	ИначеЕсли ВидОбласти = 5 Тогда
		
		ПозИмени = Найти(РеквизитыИмениОбласти.ИмяИсходнойОбласти, "_Показатель_");
		Если ПозИмени = 0 Тогда
			Возврат;
		КонецЕсли;
		
		КодПоказателя = Сред(РеквизитыИмениОбласти.ИмяИсходнойОбласти, ПозИмени + 12);
		СтрокаТаблицы[КодПоказателя+"_Отображение"] = Значение;
		
	КонецЕсли;

КонецПроцедуры // УстановитьЗначениеВСтрокеТаблицы()

&НаСервере
Процедура ОтразитьВыборПоСценариюВвода(Знач ПредыдущийВидАналитики, Знач ИдентификаторСтроки, Знач ВыбранноеЗначение)

	ИзмененныеЗначенияАналитик = БюджетнаяОтчетностьСервер.ЗначенияОбработкиВыбораПоСценариюВвода(ГруппаРаскрытия, ПредыдущийВидАналитики, ВыбранноеЗначение);
	Если ИзмененныеЗначенияАналитик = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоллекцияАналитик = БюджетнаяОтчетностьСервер.КоллекцияАналитикГруппыРаскрытия(ГруппаРаскрытия);
	СтрокаРаскрытия   = ТаблицаРаскрытия.НайтиСтроки(Новый Структура("ID", ИдентификаторСтроки))[0];
	
	Для Каждого ИзмененнаяАналитика Из ИзмененныеЗначенияАналитик Цикл
		
		СтрокаАналитики = КоллекцияАналитик.Найти(ИзмененнаяАналитика.Ключ, "КодВидаАналитики");
		Если СтрокаАналитики <> Неопределено Тогда
			СтрокаРаскрытия[СтрокаАналитики.ИмяОбъектаАналитики] = ?(ЗначениеЗаполнено(СтрокаАналитики.ВидКлассификатораБК), СокрЛП(ИзмененнаяАналитика.Значение), ИзмененнаяАналитика.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбновитьСодержимоеБланка();
	
КонецПроцедуры 

// Получает значения окружающих аналитик из контекста отчета.
//
&НаСервере
Функция ПолучитьОтборИзКонтекстаОтчета(Знач ГруппаРаскрытия, Знач ИдентификаторСтроки, Знач СвязиОтбора) Экспорт 
 
	УсловиеПоиска = Новый Структура("ID", ИдентификаторСтроки);
	
	ТекСтрокаДанных = ТаблицаРаскрытия.НайтиСтроки(УсловиеПоиска)[0];
	
	КонтекстныйОтбор = Новый Структура;
	
	Для Каждого Связь Из СвязиОтбора Цикл
		ЗначениеПоля = Неопределено;
		Если ТекСтрокаДанных.Свойство(Связь.ИмяОбласти, ЗначениеПоля) Тогда
			КонтекстныйОтбор.Вставить(Связь.ИмяПоля, ЗначениеПоля);
		КонецЕсли;
	КонецЦикла;
	
	Возврат КонтекстныйОтбор;
	
КонецФункции 

//////////////////////////////////////////////////////////////////////////
// Общие процедуры отображения данных

&НаСервере
Процедура ОтобразитьДанныеОтчета(Знач ПараметрыРаскрытия)

	Если ПараметрыРаскрытия.МакетыРаскрытия = Неопределено или ПараметрыРаскрытия.МакетыРаскрытия.Строка = Неопределено Тогда
		СгенерироватьТаблицу(ПараметрыРаскрытия);
		Элементы.ПанельДанных.ТекущаяСтраница = Элементы.СтраницаТаблицаФормы;
		Элементы.ФормаВыводитьДлинныеПоляВОднуСтроку.Видимость = Ложь;
		Элементы.ФормаЗафиксироватьТаблицу.Видимость = Ложь;
	Иначе
		СгенерироватьБланк(ПараметрыРаскрытия);
		Элементы.ПанельДанных.ТекущаяСтраница = Элементы.СтраницаБланк;
		Элементы.ФормаВыводитьДлинныеПоляВОднуСтроку.Видимость = Истина;
		Элементы.ФормаЗафиксироватьТаблицу.Видимость = Истина;
	КонецЕсли;

КонецПроцедуры // ОтобразитьДанныеОтчета()

&НаСервере
Функция СоздатьРеквизитТаблицаРаскрытия(Знач ПараметрыРаскрытия)

	ТекТаблицаРаскрытия = ПараметрыРаскрытия.ТаблицаРаскрытия;
	
	Если ЗначениеЗаполнено(ПараметрыРаскрытия.ОтборПоРаскрытию) Тогда
		РезультатЗапроса = БюджетнаяОтчетность.РезультатЗапросаПоТаблицеЗначений(ТекТаблицаРаскрытия,ПараметрыРаскрытия.ОтборПоРаскрытию);
		ТекТаблицаРаскрытия = РезультатЗапроса.Выгрузить();
		РезультатЗапроса = Неопределено;
	КонецЕсли;
	
	ПодготовитьТаблицуПоказателей(Параметры.ГруппаРаскрытия);
	ПодготовитьТаблицуАналитики(Параметры.ГруппаРаскрытия);
	
	МассивРеквизитов 	= Новый Массив;
	ДобавляемыеЭлементы = Новый ТаблицаЗначений;
	ДобавляемыеЭлементы.Колонки.Добавить("РеквизитФормы");
	ДобавляемыеЭлементы.Колонки.Добавить("ВидАналитикиПараметрВыбора");
	ДобавляемыеЭлементы.Колонки.Добавить("ЭтоПоказатель",Новый ОписаниеТипов("Булево"));
	ДобавляемыеЭлементы.Колонки.Добавить("Ключ");
	
	// Добавление полей аналитики.
	Для Каждого СтрАналитика Из ТаблицаАналитики Цикл
		
		РеквизитФормы = Новый РеквизитФормы(СтрАналитика.ИмяАналитики,СтрАналитика.ТипЗначения,"ТаблицаРаскрытия",СокрП(СтрАналитика.Код),Истина);
		МассивРеквизитов.Добавить(РеквизитФормы);
		
		СтрЭлемент = ДобавляемыеЭлементы.Добавить();
		СтрЭлемент.РеквизитФормы = РеквизитФормы;
		СтрЭлемент.Ключ			 = СтрАналитика.ИмяАналитики;
		
		Если СтрАналитика.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Субконто")) Тогда
			СтрЭлемент.ВидАналитикиПараметрВыбора = СтрАналитика.ВидАналитики;
		КонецЕсли;
				
	КонецЦикла;
	
	// Добавление полей показателей.
	КвалификаторЧисла  = БюджетнаяОтчетность.ОписаниеТиповЧисловогоЗначенияПоказателя().КвалификаторыЧисла;
	РазрядностьЧисла   = КвалификаторЧисла.Разрядность -(КвалификаторЧисла.РазрядностьДробнойЧасти - Точность);
	Квалификатор       = Новый КвалификаторыЧисла(РазрядностьЧисла, Точность);
	
	Для Каждого СтрПоказатель Из ТаблицаПоказателей Цикл
		
		ОписаниеТиповПоказателя = БюджетнаяОтчетность.ПолучитьОписаниеТиповДляЗначенияПоказателя(СтрПоказатель.ТипЗначения);
		ТипЗначенияКолонки		= Новый ОписаниеТипов(ОписаниеТиповПоказателя,,,Квалификатор);
		
		РеквизитФормы = Новый РеквизитФормы(СокрП(СтрПоказатель.Код),ТипЗначенияКолонки,"ТаблицаРаскрытия",СтрПоказатель.Наименование,Истина);
		МассивРеквизитов.Добавить(РеквизитФормы);
		
		РеквизитФормы = Новый РеквизитФормы(СокрП(СтрПоказатель.Код)+"_Отображение",ТипЗначенияКолонки,"ТаблицаРаскрытия",СтрПоказатель.Наименование,Истина);
		МассивРеквизитов.Добавить(РеквизитФормы);
		
		СтрЭлемент = ДобавляемыеЭлементы.Добавить();
		СтрЭлемент.РеквизитФормы = РеквизитФормы;
		СтрЭлемент.Ключ			 = СокрП(СтрПоказатель.Код);
		СтрЭлемент.ЭтоПоказатель = Истина;
		
	КонецЦикла;
	
	// Добавление служебных полей.
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ID",Новый ОписаниеТипов("Число"),"ТаблицаРаскрытия"));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("ПромежуточныеИтоги",Новый ОписаниеТипов("Строка"),"ТаблицаРаскрытия"));
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Возврат ДобавляемыеЭлементы;

КонецФункции // СоздатьРеквизитТаблицаРаскрытия()

&НаСервере
Процедура ОбновитьОтображаемыеДанные(Знач ПараметрыРаскрытия)

	ОтобразитьТаблицуРаскрытияВФорме(ПараметрыРаскрытия);
	Если ПараметрыРаскрытия.МакетыРаскрытия <> Неопределено Тогда
		ОбновитьСодержимоеБланка();
	КонецЕсли;

КонецПроцедуры // ОбновитьОтображаемыеДанные()

&НаКлиенте
Процедура ВернутьДанные()
	
	ПрименитьРедактированиеТаблицы();
	Модифицированность = Ложь;
	
	РезультатВыбора = Новый Структура("КодСтроки,АдресДанныхРаскрытия",КодСтрокиРаскрытия,АдресДанныхРаскрытия);
	
	#Если Не ВебКлиент Тогда
		ОповеститьОВыборе(РезультатВыбора);
	#Иначе
		ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(РезультатВыбора);
		Закрыть();
	#КонецЕсли
	
КонецПроцедуры	


&НаКлиенте
Процедура ЗаполнитьПараметрыОтбораПоФильтру(ПараметрыОтбораСубконто, Знач ИмяЯчейки)
	
	ЗначенияОтбораПоКоду = ТаблицаФильтровПоЗначению.НайтиСтроки(Новый Структура("ИмяЯчейки", ИмяЯчейки));
	Если ЗначенияОтбораПоКоду.Количество() > 0 Тогда
		ПараметрыОтбораСубконто.Вставить("Код",ЗначенияОтбораПоКоду[0].ТаблицаКодов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСоставныхРеквизитовБланка(РезультатВыбора, РеквизитыИмениОбласти) Экспорт
	Если РезультатВыбора <> Неопределено Тогда
		ОтразитьВыборСвязанныхРеквизитов(РезультатВыбора, РеквизитыИмениОбласти);
		Модифицированность = Истина;
	КонецЕсли;		
КонецПроцедуры

// Выполняет отражение данных, выбранных в форме связанных реквизитов.
//
&НаСервере
Процедура ОтразитьВыборСвязанныхРеквизитов(РезультатВыбора, РеквизитыИмениОбласти)

	ТаблицаДанных = ПолучитьИзВременногоХранилища(РезультатВыбора);
	
	СтрокаДанных = ПолучитьСтрокуРаскрытияПоИдентификатору(ЭтаФорма.ТаблицаРаскрытия, РеквизитыИмениОбласти.Идентификатор);
	
	Для Каждого СтрРеквизит Из ТаблицаДанных Цикл
		
		Если СтрРеквизит.ВидИсточника = 4 Тогда
			
			УстановитьЗначениеВСтрокеТаблицы(ЭтаФорма, СтрокаДанных, 4, РеквизитыИмениОбласти, СтрРеквизит.Значение);
					
		КонецЕсли;		
		
	КонецЦикла;
	
	ОбновитьСодержимоеБланка();
	
КонецПроцедуры // ОтразитьВыборСвязанныхРеквизитов()

&НаКлиенте
Процедура ПослеВыбораЗначенияПоСценариюВвода(Результат,ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
		
	ВладелецФормы.ОбработатьРедактированиеФормы();
	
	ВидАналитики = ДополнительныеПараметры.ВидАналитики;
	Идентификатор = ДополнительныеПараметры.Идентификатор;
	
	ОтразитьВыборПоСценариюВвода(ВидАналитики, Идентификатор, Результат);
	
	Модифицированность = Истина;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВыбораОбычногоЗначения(Результат,ДополнительныеПараметры)Экспорт
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ВладелецФормы.ОбработатьРедактированиеФормы();
	
	ДополнительныеПараметры.Область.Значение    = Результат;
	ДополнительныеПараметры.Область.Расшифровка = Результат;
	
	ОтразитьВыборЗначенияВДанныхФормы(ЭтотОбъект, Результат, ДополнительныеПараметры.ВидОбласти, ДополнительныеПараметры.РеквизитыИмениОбласти);
	
	Модифицированность = Истина;
				
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВладельцаСубконто(ВидАналитики)
	Возврат БюджетнаяОтчетностьСервер.ПолучитьВладельцаСубконтоДляАналитики(ВидАналитики);	
КонецФункции

&НаСервере
Функция ПодготовитьВыборВидаДоходаСервер(Знач ВидАналитики, Знач ТекущееЗначение, Знач ИдентификаторСтроки,ЭлКлДоходов)
	
	Ответ = Неопределено;
	
	УсловиеПоиска = Новый Структура("ID", ИдентификаторСтроки);	
	ТекСтрокаДанных = ТаблицаРаскрытия.НайтиСтроки(УсловиеПоиска)[0];
	
	ПереченьАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	УсловияПоиска    = Новый Структура("ГруппаРаскрытия", ГруппаРаскрытия);
	ПереченьАналитик = ПереченьАналитик.Скопировать(УсловияПоиска);
	
	СтрВидаАналитики = ПереченьАналитик.Найти(ВидАналитики, "ВидАналитики");
	Если СтрВидаАналитики <> Неопределено Тогда
		
		ПолныйКод = "";//ВидДохода + Подвид + АнГруппа
	
		ЗначениеВида = Неопределено;
		ЗначениеПодвида = Неопределено;	
		ЗначениеАнГруппы = Неопределено;
		
		ПозицияВида = 0;
		ПозицияПодвида = 0;
		ПозицияАнГруппы = 0;
		
		СтрВидаАналитики = ПереченьАналитик.Найти(ВидАналитики, "ВидАналитики");
		Если СтрВидаАналитики <> Неопределено Тогда
			Позиция = ПереченьАналитик.Индекс(СтрВидаАналитики);
			
			Если ЭлКлДоходов = 1 Тогда			
				ПозицияВида = Позиция;
				ПозицияПодвида = Позиция + 1;					
				ПозицияАнГруппы = Позиция + 2;
			КонецЕсли;	
			
			Если ЭлКлДоходов = 2 Тогда			
				ПозицияВида = Позиция - 1;
				ПозицияПодвида = Позиция;
				ПозицияАнГруппы = Позиция + 1;
			КонецЕсли;
			
			Если ЭлКлДоходов = 3 Тогда			
				ПозицияВида = Позиция - 2;
				ПозицияПодвида = Позиция - 1;
				ПозицияАнГруппы = Позиция;
			КонецЕсли;
							
			Если ПозицияАнГруппы <= ПереченьАналитик.Количество()-1 
				И ПозицияАнГруппы >= 0 Тогда
				СтрокаПП = ПереченьАналитик[ПозицияАнГруппы];
				ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
				Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.КОСГУ")) Тогда
					ЗначениеАнГруппы = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
				КонецЕсли;
			КонецЕсли;
			
			Если ПозицияВида <= ПереченьАналитик.Количество()-1 
				И ПозицияВида >= 0 Тогда
				СтрокаПП = ПереченьАналитик[ПозицияВида];
				ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
				Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.ВидыДоходовКДБ")) Тогда
					ЗначениеВида = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
					
					КодВидаДоходов = ПолучитьКодЭлементаКлассификатора(ЗначениеВида,"0000000000");
					КодПодвида = ПолучитьКодЭлементаКлассификатора(ЗначениеПодвида,"0000");
					КодАнГруппы = ПолучитьКодЭлементаКлассификатора(ЗначениеАнГруппы,"000");
					
					ПолныйКод = Сред(КодВидаДоходов,1,1) +" "+Сред(КодВидаДоходов,2,2) +" "+Сред(КодВидаДоходов,4,5) +" "+Сред(КодВидаДоходов,9,2) +" "+ КодПодвида +" "+ КодАнГруппы;//КодВидаДоходов + КодПодвида + КодАнГруппы;
					
					Если ЗначениеЗаполнено(ЗначениеВида) ИЛИ ЭлКлДоходов <> 3 Тогда
						
						ИспользуемыйВидАналитики = Неопределено;
						СценарийВвода = БюджетнаяОтчетностьСервер.ПодобратьСценарийВводаАналитики(ПереченьАналитик, СтрокаПП.ВидАналитики,,ИспользуемыйВидАналитики);
						Если СценарийВвода <> Неопределено Тогда
							КлиентскийСценарий = БюджетнаяОтчетностьСервер.КлиентскийСценарийВвода(СценарийВвода);
							
							МассивСвязейОтбора = Новый Массив;
							
							Для Каждого СтрСвязь Из СценарийВвода.СвязиОтбора Цикл
								Индекс = Позиция+1+СтрСвязь.Смещение;
								СтрокаАналитики = ПереченьАналитик[Индекс];
								Если Индекс >= 0 и Индекс < ПереченьАналитик.Количество() Тогда
									КлиентскийСценарий.ФиксированныйОтбор.Вставить(СтрСвязь.ПолеОтбора, ТекСтрокаДанных[СтрокаАналитики.ИмяОбъектаАналитики]);
								КонецЕсли;
							КонецЦикла;
							
							КлиентскийСценарий.Вставить("ТребуетсяВызовСервера",Ложь);
							КлиентскийСценарий.Вставить("СвязиОтбора"          ,Новый Массив);
							Если ЗначениеЗаполнено(ИспользуемыйВидАналитики) Тогда
								КлиентскийСценарий.Вставить("ВидАналитикиСценария" ,ИспользуемыйВидАналитики);
							КонецЕсли;
							
							ТекущееЗначениеКода = ПолныйКод;
							
						КонецЕсли;
					ИначеЕсли ЭлКлДоходов = 3 Тогда
						
						КлиентскийСценарий = Новый Структура;
						КлиентскийСценарий.Вставить("ФормаВыбора"			,"Справочник.КОСГУ.ФормаВыбора");
						КлиентскийСценарий.Вставить("ЕстьКонтекстныйОтбор"	,Ложь);
						КлиентскийСценарий.Вставить("ЕстьСвязиВыбора"		,Ложь);
						КлиентскийСценарий.Вставить("ФиксированныйОтбор"	,Новый Структура);

						КлиентскийСценарий.Вставить("ТребуетсяВызовСервера",Ложь);
						КлиентскийСценарий.Вставить("СвязиОтбора"          ,Новый Массив);
							
						ТекущееЗначениеКода = ТекущееЗначение;
					КонецЕсли;
					
					Ответ = Новый Структура;
					Ответ.Вставить("СценарийВвода", КлиентскийСценарий);
					Ответ.Вставить("ТекущееЗначение", ТекущееЗначениеКода);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПодготовитьВыборКИФСервер(Знач ВидАналитики, Знач ТекущееЗначение, Знач ИдентификаторСтроки, ЭлКлКИФ)
	
	Ответ = Неопределено;
	
	УсловиеПоиска = Новый Структура("ID", ИдентификаторСтроки);	
	ТекСтрокаДанных = ТаблицаРаскрытия.НайтиСтроки(УсловиеПоиска)[0];
	
	ПереченьАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	УсловияПоиска    = Новый Структура("ГруппаРаскрытия", ГруппаРаскрытия);
	ПереченьАналитик = ПереченьАналитик.Скопировать(УсловияПоиска);
	
	ПолныйКод = "";//Группа(4) + Статья(6) + Подвид(4) + АнГруппа(3)
	
	ЗначениеГруппы = Неопределено;
	ЗначениеСтатьи = Неопределено;
	ЗначениеПодвида = Неопределено;	
	ЗначениеАнГруппы = Неопределено;
	
	ПозицияГруппы = 0;
	ПозицияСтатьи = 0;
	ПозицияПодвида = 0;
	ПозицияАнГруппы = 0;
	
	СтрВидаАналитики = ПереченьАналитик.Найти(ВидАналитики, "ВидАналитики");
	Если СтрВидаАналитики <> Неопределено Тогда
		Позиция = ПереченьАналитик.Индекс(СтрВидаАналитики);
		
		Если ЭлКлКИФ = 1 Тогда			
			ПозицияГруппы = Позиция;
			ПозицияСтатьи = Позиция + 1;
			ПозицияПодвида = Позиция + 2;					
			ПозицияАнГруппы = Позиция + 3;
		КонецЕсли;	
		
		Если ЭлКлКИФ = 2 Тогда			
			ПозицияГруппы = Позиция - 1;
			ПозицияСтатьи = Позиция;
			ПозицияПодвида = Позиция + 1;
			ПозицияАнГруппы = Позиция + 2;
		КонецЕсли;
		
		Если ЭлКлКИФ = 3 Тогда			
			ПозицияГруппы = Позиция - 2;
			ПозицияСтатьи = Позиция - 1;
			ПозицияПодвида = Позиция;
			ПозицияАнГруппы = Позиция + 1;
		КонецЕсли;
		
		Если ЭлКлКИФ = 4 Тогда			
			ПозицияГруппы = Позиция - 3;
			ПозицияСтатьи = Позиция - 2;
			ПозицияПодвида = Позиция - 1;
			ПозицияАнГруппы = Позиция;
		КонецЕсли;
						
		Если ПозицияАнГруппы <= ПереченьАналитик.Количество()-1 
			И ПозицияАнГруппы >= 0 Тогда
			СтрокаПП = ПереченьАналитик[ПозицияАнГруппы];
			ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
			Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.КОСГУ")) Тогда
				ЗначениеАнГруппы = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
			КонецЕсли;
		КонецЕсли;
		
		Если ПозицияПодвида <= ПереченьАналитик.Количество()-1 
			И ПозицияПодвида >= 0 Тогда
			СтрокаПП = ПереченьАналитик[ПозицияПодвида];
			ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
			Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.ВидыКИФ")) Тогда
				ЗначениеПодвида = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
			КонецЕсли;
		КонецЕсли;
		
		Если ПозицияСтатьи <= ПереченьАналитик.Количество()-1 
			И ПозицияСтатьи >= 0 Тогда
			СтрокаПП = ПереченьАналитик[ПозицияСтатьи];
			ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
			Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.СтатьиКИФ")) Тогда
				ЗначениеСтатьи = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
			КонецЕсли;
		КонецЕсли;
		
		Если ПозицияГруппы <= ПереченьАналитик.Количество()-1 
			И ПозицияГруппы >= 0 Тогда
			СтрокаПП = ПереченьАналитик[ПозицияГруппы];
			ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
			Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.ГруппыПодгруппыКИФ")) Тогда
				ЗначениеГруппы = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
				
				КодГруппы = ПолучитьКодЭлементаКлассификатора(ЗначениеГруппы,"0000");
				КодСтатьи = ПолучитьКодЭлементаКлассификатора(ЗначениеСтатьи,"000000");
				КодПодвида = ПолучитьКодЭлементаКлассификатора(ЗначениеПодвида,"0000");
				КодАнГруппы = ПолучитьКодЭлементаКлассификатора(ЗначениеАнГруппы,"000");
				
				ПолныйКод = КодГруппы + КодСтатьи + КодПодвида + КодАнГруппы;
				
				ИспользуемыйВидАналитики = Неопределено;
				СценарийВвода = БюджетнаяОтчетностьСервер.ПодобратьСценарийВводаАналитики(ПереченьАналитик, СтрокаПП.ВидАналитики,,ИспользуемыйВидАналитики);
				КлиентскийСценарий = Неопределено;
				Если СценарийВвода <> Неопределено Тогда
					КлиентскийСценарий = БюджетнаяОтчетностьСервер.КлиентскийСценарийВвода(СценарийВвода);					
					МассивСвязейОтбора = Новый Массив;
					
					Для Каждого СтрСвязь Из СценарийВвода.СвязиОтбора Цикл
						Индекс = Позиция+1+СтрСвязь.Смещение;
						СтрокаАналитики = ПереченьАналитик[Индекс];
						Если Индекс >= 0 и Индекс < ПереченьАналитик.Количество() Тогда
							КлиентскийСценарий.ФиксированныйОтбор.Вставить(СтрСвязь.ПолеОтбора, ТекСтрокаДанных[СтрокаАналитики.ИмяОбъектаАналитики]);
						КонецЕсли;
					КонецЦикла;
					
					КлиентскийСценарий.Вставить("ТребуетсяВызовСервера",Ложь);
					КлиентскийСценарий.Вставить("СвязиОтбора"          ,Новый Массив);
					Если ЗначениеЗаполнено(ИспользуемыйВидАналитики) Тогда
						КлиентскийСценарий.Вставить("ВидАналитикиСценария" ,ИспользуемыйВидАналитики);
					КонецЕсли;
										
				КонецЕсли;
				
				Ответ = Новый Структура;
				Ответ.Вставить("СценарийВвода", КлиентскийСценарий);
				Ответ.Вставить("ТекущееЗначение", ПолныйКод);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
		
	Возврат Ответ;
	
КонецФункции

&НаСервере
Функция ПолучитьКодЭлементаКлассификатора(ЗначениеЭлемента,ПустоеЗначение)
	Если ЗначениеЗаполнено(ЗначениеЭлемента) Тогда
		Если ТипЗнч(ЗначениеЭлемента) = Тип("Строка") Тогда
			КодЭлемента = ЗначениеЭлемента;
		Иначе
			КодЭлемента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначениеЭлемента,"Код");
		КонецЕсли;
	Иначе
		КодЭлемента = ПустоеЗначение;
	КонецЕсли;
	
	Возврат КодЭлемента;
КонецФункции

&НаСервере
Функция ПодготовитьВыборПрограммыЦССервер(Знач ВидАналитики, Знач ТекущееЗначение, Знач ИдентификаторСтроки)

	УсловиеПоиска = Новый Структура("ID", ИдентификаторСтроки);	
	ТекСтрокаДанных = ТаблицаРаскрытия.НайтиСтроки(УсловиеПоиска)[0];
	
	ПереченьАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	УсловияПоиска    = Новый Структура("ГруппаРаскрытия", ГруппаРаскрытия);
	ПереченьАналитик = ПереченьАналитик.Скопировать(УсловияПоиска);
	
	СтрВидаАналитики = ПереченьАналитик.Найти(ВидАналитики, "ВидАналитики");
	Если СтрВидаАналитики <> Неопределено Тогда
		Позиция = ПереченьАналитик.Индекс(СтрВидаАналитики);
		Если Позиция <= ПереченьАналитик.Количество()-1 Тогда
			СтрокаПП = ПереченьАналитик[Позиция+1];
			Если СтрокаПП.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ПодпрограммыЦелевыхСтатейКРБ")) Тогда
				ЗначениеПП = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
				Если ЗначениеЗаполнено(ЗначениеПП) Тогда
					
					СценарийВвода = БюджетнаяОтчетностьСервер.ПодобратьСценарийВводаАналитики(ПереченьАналитик, СтрокаПП.ВидАналитики);
					Если СценарийВвода <> Неопределено Тогда
						КлиентскийСценарий = БюджетнаяОтчетностьСервер.КлиентскийСценарийВвода(СценарийВвода);
						
						МассивСвязейОтбора = Новый Массив;
						
						Для Каждого СтрСвязь Из СценарийВвода.СвязиОтбора Цикл
							Индекс = Позиция+1+СтрСвязь.Смещение;
							СтрокаАналитики = ПереченьАналитик[Индекс];
							Если Индекс >= 0 и Индекс < ПереченьАналитик.Количество() Тогда
								КлиентскийСценарий.ФиксированныйОтбор.Вставить(СтрСвязь.ПолеОтбора, ТекСтрокаДанных[СтрокаАналитики.ИмяОбъектаАналитики]);
							КонецЕсли;
						КонецЦикла;
						
						КлиентскийСценарий.Вставить("ТребуетсяВызовСервера",Ложь);
						КлиентскийСценарий.Вставить("СвязиОтбора"          ,Новый Массив);
						
						Ответ = Новый Структура;
						Ответ.Вставить("СценарийВвода", КлиентскийСценарий);
						Ответ.Вставить("ТекущееЗначение", ЗначениеПП);
						Возврат Ответ;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция ПодготовитьВыборПоЦССервер(Знач ВидАналитики, Знач ТекущееЗначение, Знач ИдентификаторСтроки,ЭлКлассификации)

	Ответ = Неопределено;
	
	УсловиеПоиска = Новый Структура("ID", ИдентификаторСтроки);	
	ТекСтрокаДанных = ТаблицаРаскрытия.НайтиСтроки(УсловиеПоиска)[0];
	
	ПереченьАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	УсловияПоиска    = Новый Структура("ГруппаРаскрытия", ГруппаРаскрытия);
	ПереченьАналитик = ПереченьАналитик.Скопировать(УсловияПоиска);
	
	ПолныйКод = "";//ЦС + Программа
	
	ЗначениеЦС = Неопределено;
	ЗначениеПрограммы = Неопределено;	
	
	ПозицияЦС = 0;
	ПозицияПрограммы = 0;
	
	СтрВидаАналитики = ПереченьАналитик.Найти(ВидАналитики, "ВидАналитики");
	Если СтрВидаАналитики <> Неопределено Тогда
		Позиция = ПереченьАналитик.Индекс(СтрВидаАналитики);
		
		Если ЭлКлассификации = 1 Тогда			
			ПозицияЦС = Позиция;
			ПозицияПрограммы = Позиция + 1;					
		КонецЕсли;	
		
		Если ЭлКлассификации = 2 Тогда			
			ПозицияЦС = Позиция - 1;
			ПозицияПрограммы = Позиция;
		КонецЕсли;
								
		Если ПозицияЦС <= ПереченьАналитик.Количество()-1 
			И ПозицияЦС >= 0 Тогда
			СтрокаПП = ПереченьАналитик[ПозицияЦС];
			ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
			Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.ЦелевыеСтатьиКРБ")) Тогда
				ЗначениеЦС = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
			КонецЕсли;
		КонецЕсли;
		
		Если ПозицияПрограммы <= ПереченьАналитик.Количество()-1 
			И ПозицияПрограммы >= 0 Тогда
			СтрокаПП = ПереченьАналитик[ПозицияПрограммы];
			ОписаниеТиповТекСтр = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаПП.ВидАналитики);
			Если ОписаниеТиповТекСтр.СодержитТип(Тип("СправочникСсылка.ПрограммыЦелевыхСтатейКРБ")) Тогда
				ЗначениеПрограммы = ТекСтрокаДанных[СтрокаПП.ИмяОбъектаАналитики];
			КонецЕсли;
		КонецЕсли;
		
		КодЦС = ПолучитьКодЭлементаКлассификатора(ЗначениеЦС,"00000");
		КодПрограммы = ПолучитьКодЭлементаКлассификатора(ЗначениеПрограммы,"00000");
				
		ПолныйКод = КодЦС + КодПрограммы;
		
		СценарийВвода = БюджетнаяОтчетностьСервер.ПодобратьСценарийВводаАналитики(ПереченьАналитик, СтрокаПП.ВидАналитики);
		Если СценарийВвода <> Неопределено Тогда
			КлиентскийСценарий = БюджетнаяОтчетностьСервер.КлиентскийСценарийВвода(СценарийВвода);
			
			МассивСвязейОтбора = Новый Массив;
			
			Для Каждого СтрСвязь Из СценарийВвода.СвязиОтбора Цикл
				Индекс = Позиция+1+СтрСвязь.Смещение;
				СтрокаАналитики = ПереченьАналитик[Индекс];
				Если Индекс >= 0 и Индекс < ПереченьАналитик.Количество() Тогда
					КлиентскийСценарий.ФиксированныйОтбор.Вставить(СтрСвязь.ПолеОтбора, ТекСтрокаДанных[СтрокаАналитики.ИмяОбъектаАналитики]);
				КонецЕсли;
			КонецЦикла;
			
			КлиентскийСценарий.Вставить("ТребуетсяВызовСервера",Ложь);
			КлиентскийСценарий.Вставить("СвязиОтбора"          ,Новый Массив);
			
			Ответ = Новый Структура;
			Ответ.Вставить("СценарийВвода", КлиентскийСценарий);
			Ответ.Вставить("ТекущееЗначение", ПолныйКод);
						
		КонецЕсли;
		
	КонецЕсли;
			
	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область ОтображениеДлинныхПолей

&НаКлиенте
Процедура ВыводитьДлинныеПоляВОднуСтроку(Команда)
	
	ВыводитьДлинныеПоляВОднуСтроку = НЕ ВыводитьДлинныеПоляВОднуСтроку;
	Элементы.ФормаВыводитьДлинныеПоляВОднуСтроку.Пометка = ВыводитьДлинныеПоляВОднуСтроку;
	
	ПрименитьНастройкуВыводаДлинныхСтрок(ТабличныйДокументБланк,ИменаЯчеекДлинныхСтрок,ВыводитьДлинныеПоляВОднуСтроку);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПрименитьНастройкуВыводаДлинныхСтрок(ТабДок,ИменаЯчеекДлинныхСтрок,ВыводитьДлинныеПоляВОднуСтроку)
	
	Если ИменаЯчеекДлинныхСтрок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураНастроекОтображения = Новый Структура;
	
	МинимальнаяДлинаАнализируемойОбласти = 1000;
	Для Каждого ИмяЯчейкиДлСтр Из ИменаЯчеекДлинныхСтрок Цикл 
		
		ДлинаИмени = СтрДлина(ИмяЯчейкиДлСтр);	
		
		СтруктураНастроекОтображения.Вставить(ИмяЯчейкиДлСтр,ДлинаИмени);
		
		МинимальнаяДлинаАнализируемойОбласти = Мин(МинимальнаяДлинаАнализируемойОбласти,ДлинаИмени);
	КонецЦикла;
	
	КоллекцияОбластей = ТабДок.Области;
	Для Каждого ТекОбл Из КоллекцияОбластей Цикл
		Если ТипЗнч(ТекОбл) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		
		ДлинаИмениОбласти = СтрДлина(ТекОбл.Имя);
		
		Если ДлинаИмениОбласти < МинимальнаяДлинаАнализируемойОбласти Тогда
			//длина имени области меньше чем длина самого короткого имени из перечня нужных областей,
			//нет смысла проверять подробнее
			Продолжить;
		КонецЕсли;
		
		Для Каждого ИмяЯчейкиДлСтр Из ИменаЯчеекДлинныхСтрок Цикл
			ДлинаИмени = СтруктураНастроекОтображения[ИмяЯчейкиДлСтр];
			
			Если Найти(ТекОбл.Имя,ИмяЯчейкиДлСтр) <> 1 Тогда
				Продолжить;
			КонецЕсли; 
			
			Если ДлинаИмениОбласти > ДлинаИмени 
				И Найти("0123456789",Сред(ТекОбл.Имя,ДлинаИмени+2,1)) = 0 Тогда
				Продолжить;
			КонецЕсли;
				 			
			Если ВыводитьДлинныеПоляВОднуСтроку Тогда				
				ТекОбл.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Обрезать;
			Иначе
				ТекОбл.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			КонецЕсли;
			СтрокаОбласти = ТабДок.Область(ТекОбл.Верх,,ТекОбл.Низ);
			Если СтрокаОбласти.АвтоВысотаСтроки = Ложь Тогда
				СтрокаОбласти.АвтоВысотаСтроки = Истина;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти