
&НаКлиенте
Перем ОтветПередЗакрытием;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ТекущиеЗначения);
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СчетДт);
	УстановитьПараметрыПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтветПередЗакрытием <> Истина Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения(
			"ПередЗакрытиемЗавершение",
			ЭтотОбъект);
			
		ТекстВопроса = НСтр("ru='Данные изменены. Перенести изменения в документ?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 15, КодВозвратаДиалога.Отмена);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОтветПередЗакрытием = Истина;
		ПараметрыЗакрытия = ПолучитьПараметрыЗакрытия();
		Закрыть(ПараметрыЗакрытия);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОтветПередЗакрытием = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, СчетДт);
	УстановитьПараметрыПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> СчетДт Тогда
		КПСДт = Неопределено;
		КЭКДт = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КПСДтПриИзменении(Элемент)
	
	УстановитьПараметрыПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КПСДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(СчетДт) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не заполнено поле ""Счет""'"),,"Счет");
		Возврат;
	КонецЕсли;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													КПСДт, 
													Организация,
													ИФО,
													КФО,
													СчетДт,
													Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура КЭКДтПриИзменении(Элемент)
	
	УстановитьПараметрыПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура КЭКДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
												  СтандартнаяОбработка,
												  КЭКДт,
												  Организация, 
												  ИФО,
												  КФО, 
												  СчетДт,
												  Дата,
												  "Дт");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеДтПриИзменении(Элемент)
	
	УстановитьПараметрыПолейФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураВыбораСубконто = БухгалтерскийУчетКлиент.ИнициализироватьСтруктуруНачалаВыбораСубконто(1,
		Организация, КФО, КПСДт, КЭКДт, СчетДт, СубконтоДт1, СубконтоДт2, СубконтоДт3);
	БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураВыбораСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураВыбораСубконто = БухгалтерскийУчетКлиент.ИнициализироватьСтруктуруНачалаВыбораСубконто(2,
		Организация, КФО, КПСДт, КЭКДт, СчетДт, СубконтоДт1, СубконтоДт2, СубконтоДт3);
	БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураВыбораСубконто);
	
КонецПроцедуры

&НаКлиенте
Процедура СубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураВыбораСубконто = БухгалтерскийУчетКлиент.ИнициализироватьСтруктуруНачалаВыбораСубконто(3,
		Организация, КФО, КПСДт, КЭКДт, СчетДт, СубконтоДт1, СубконтоДт2, СубконтоДт3);
	БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, СтруктураВыбораСубконто);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Модифицированность = Ложь;
	ПараметрыЗакрытия = ПолучитьПараметрыЗакрытия();
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьПараметрыЗакрытия()
	
	ПараметрыЗакрытия = Новый Структура("СчетДт, КПСДт, КЭКДт, ПодразделениеДт, СубконтоДт1, СубконтоДт2, СубконтоДт3");
	ЗаполнитьЗначенияСвойств(ПараметрыЗакрытия, ЭтаФорма);
	
	Возврат ПараметрыЗакрытия;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыПолейФормы()
	
	// Устанавливаем текст "<Взять из ... Кт>" в поля ввода КПС, КЭК, Подразделение.
	СчетДт40120 = БухгалтерскийУчетКлиентСервер.СчетВИерархии(СчетДт, "401.20");
	НужноЗаполнитьКПСДт = НЕ ЗначениеЗаполнено(КПСДт) И НЕ СчетДт40120 И НЕ ЭтаФорма.ПроизвольнаяАналитикаКПС;
	НужноЗаполнитьКЭКДт = НЕ ЗначениеЗаполнено(КЭКДт) И НЕ СчетДт40120;
	
	Если НЕ ЗначениеЗаполнено(КПСДт) И НЕ НужноЗаполнитьКПСДт Тогда
		Элементы.КПСДт.ПодсказкаВвода = НСтр("ru = '<Взять из КПС Кт>'");
		Элементы.КПСДт.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КПСДт.ОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.КПСДт.ПодсказкаВвода = "";
		Элементы.КПСДт.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КЭКДт) И НЕ НужноЗаполнитьКЭКДт Тогда
		Элементы.КЭКДт.ПодсказкаВвода = НСтр("ru = '<Взять из КЭК Кт>'");
		Элементы.КЭКДт.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КЭКДт.ОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.КЭКДт.ПодсказкаВвода = "";
		Элементы.КЭКДт.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
	ЕстьПодразделениеСписания = Элементы.ПодразделениеДт.Доступность;
	Если НЕ ЕстьПодразделениеСписания Тогда
		ПодразделениеДт = Неопределено;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПодразделениеДт) И ЕстьПодразделениеСписания Тогда
		Элементы.ПодразделениеДт.ПодсказкаВвода = НСтр("ru = '<Взять из Подразделение Кт>'");
		Элементы.ПодразделениеДт.АвтоОтметкаНезаполненного = Ложь;
		Элементы.ПодразделениеДт.ОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.ПодразделениеДт.ПодсказкаВвода = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Счет)

	МассивПолей = Новый Массив;
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Подразделение", "ПодразделениеДт", "ПодразделениеДт", Истина, "ПодразделениеДт", Истина, Ложь, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто1", "СубконтоДт1", "СубконтоДт1", Истина, "СубконтоДт1", Истина, Ложь, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто2", "СубконтоДт2", "СубконтоДт2", Истина, "СубконтоДт2", Истина, Ложь, Истина);
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Субконто3", "СубконтоДт3", "СубконтоДт3", Истина, "СубконтоДт3", Истина, Ложь, Истина);
	БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Форма.СчетДт, Форма, Форма, МассивПолей);

КонецПроцедуры

#КонецОбласти

