#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

Функция ЗаполнитьНаОсновании(Знач Основание, Объект, ОписаниеОшибки = "", ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен документ основания.'");
		Возврат Ложь;
	КонецЕсли;	
	
	ТипДокументаОснования = ТипЗнч(Основание);
	
	Если ТипДокументаОснования = Тип("ДокументСсылка.СчетФактураПолученный") тогда
		Если НЕ ЭлектронныеДокументыБГУ.ДляДокументаСуществуетЭД(Объект.Ссылка) Тогда
			ЗаполнитьНаОснованииСчетФактураПолученный(Основание,Объект);
			Объект.ДокументОснование = Основание;
		КонецЕсли;
		
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ИсправительныйСчетФактураПолученный") тогда
		Если НЕ ЭлектронныеДокументыБГУ.ДляДокументаСуществуетЭД(Объект.Ссылка) Тогда
			ЗаполнитьНаОснованииИсправительныйСчетФактураПолученный(Основание, Объект);
			Объект.ДокументОснование = Основание;
		КонецЕсли;
		
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.КорректировочныйСчетФактураПолученный") тогда
		Если НЕ ЭлектронныеДокументыБГУ.ДляДокументаСуществуетЭД(Объект.Ссылка) Тогда
			ЗаполнитьНаОснованииКорректировочныйСчетФактураПолученный(Основание, Объект);
			Объект.ДокументОснование = Основание;
		КонецЕсли;
		
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		Если НЕ УчетНДС.ДопустимВводКСФНаОснованииПоступления(Основание, ОписаниеОшибки) Тогда
			ОписаниеОшибки = НСтр("ru='Ввод корректировочного счета-фактуры на основании отменен.
				|'") + ОписаниеОшибки;
			
			Возврат Ложь;
		КонецЕсли;
		
		ЗаполнитьНаОснованииПоступлениеМЗ(Основание, Объект, ДополнительныеПараметры);
	КонецЕсли;
	
	ЗаполнитьРеквизитыСторонСделки(Объект);
	
	Если не ЗначениеЗаполнено(Объект.ВалютаДокумента) тогда
		Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура СформироватьДвиженияПоРегистрам(ДокументОбъект, Отказ) Экспорт
	
	Движения = ДокументОбъект.Движения;
	Для каждого РегистрДвижения из Движения цикл
		Если ТипЗнч(РегистрДвижения) <> Тип("РегистрБухгалтерииНаборЗаписей.ЖурналПроводокЕПСБУ")
			И ТипЗнч(РегистрДвижения) <> Тип("РегистрСведенийНаборЗаписей.ОперацииСПрослеживаемымиТоварами") Тогда
			РегистрДвижения.Записывать = Истина;
			РегистрДвижения.Очистить();
		КонецЕсли;	
	КонецЦикла;
	
	ОперацияДокумента = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(ДокументОбъект.Ссылка,Новый Структура("КФО,Операция,Курс,Кратность"));
	
	КомиссионныеСчетаФактуры = Ложь;
	Если УчетНДС.ЭтоКомиссионнаяРеализация(ДокументОбъект.ПричинаНалогообложения) Тогда
		КомиссионныеСчетаФактуры = Истина;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(ОперацияДокумента.Операция) тогда
	Если ЗначениеЗаполнено(ОперацияДокумента.Операция) ИЛИ КомиссионныеСчетаФактуры Тогда
		СтруктураШапкиДокумента = ОбщегоНазначенияБГУ.СформироватьСтруктуруШапкиДокументаПоСсылке(ДокументОбъект.Ссылка);
		
		СтруктураШапкиДокумента.Вставить("Ссылка",				ДокументОбъект.Ссылка);
		СтруктураШапкиДокумента.Вставить("КФО",					ОперацияДокумента.КФО);
		СтруктураШапкиДокумента.Вставить("Дата",				ДокументОбъект.Дата);
		СтруктураШапкиДокумента.Вставить("ДокументОснование",	ДокументОбъект.ДокументОснование);
		
		СтруктураШапкиДокумента.Вставить("Курс",		ОперацияДокумента.Курс);
		СтруктураШапкиДокумента.Вставить("Кратность",	ОперацияДокумента.Кратность);
		СтруктураШапкиДокумента.Вставить("ЭтоАванс",	УчетНДСПовтИсп.Аванс(СтруктураШапкиДокумента.ПричинаНалогообложения));
		
		ТабОснования = ПолучитьДанныеДляВходящегоНДСпоДокументу(СтруктураШапкиДокумента);
		
		Отказ = не СформироватьДвижения(СтруктураШапкиДокумента, ТабОснования, Движения);	
		
		Если не Отказ тогда
			УчетНДС.ЗарегестрироватьСчетФактуру(ДокументОбъект.Ссылка,Движения);
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОчиститьАналитикуЗатрат(ДокументОбъект) Экспорт
	
	ОчищающаяСтруктура = Новый Структура("
		|СчетДт,
		|КЭКСчетаДебета,
		|КПССчетаДебета,
		|СубконтоДт1,
		|СубконтоДт2,
		|СубконтоДт3");
	
	ОчищающаяСтруктура.Вставить("ПроцентНДСкВычету", 100);
	
	Для Каждого СтрокаТаблицы Из ДокументОбъект.СоставНФА Цикл
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ОчищающаяСтруктура);
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСКонтрагентами
Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписание(
		Описание, 
		ДокументСсылка, 
		Форма.Элементы["Контрагент"],
		ДокументОбъект["Контрагент"],
		Форма.Элементы["ГруппаКонтрагент"]);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами 

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииСчетФактураПолученный(Знач ДокументОснования, Объект)
	
	ПричинаНалогообложения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснования, "ПричинаНалогообложения");
	
	ЭтоАванс = УчетНДСПовтИсп.Аванс(ПричинаНалогообложения);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка",		ДокументОснования);
	Запрос.УстановитьПараметр("ЭтоАванс",	ЭтоАванс);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетФактураПолученный.Организация,
	|	СчетФактураПолученный.ИФО,
	|	СчетФактураПолученный.Подразделение,
	|	СчетФактураПолученный.Контрагент,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его:
	|		КОГДА НЕ СчетФактураПолученный.Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			СчетФактураПолученный.Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное:
	|		КОГДА СчетФактураПолученный.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			СчетФактураПолученный.Контрагент.Наименование
	|	КОНЕЦ КАК НаименованиеПродавца,
	|	СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.ИНН	КАК ИННПродавца,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица) ТОГДА
	|			СчетФактураПолученный.Контрагент.ЮридическоеФизическоеЛицо.КПП
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КПППродавца,
	|	СчетФактураПолученный.НомерПервичногоДокумента КАК НомерСчетФактуры,
	|	СчетФактураПолученный.ДатаПервичногоДокумента КАК ДатаСчетФактуры,
	|	СчетФактураПолученный.Ссылка КАК ИсправляемыйДокумент,
	|	СчетФактураПолученный.Дата КАК КорректируемыйПериод,
	|	СчетФактураПолученный.Договор,
	|	СчетФактураПолученный.СуммаДокумента,
	|	СчетФактураПолученный.СуммаНДС,
	|	СчетФактураПолученный.ПричинаНалогообложения,
	|	СчетФактураПолученный.ВидЦенности,
	|	СчетФактураПолученный.ВалютаДокумента,
	|	ПродавецКомиссионера,
	|	КодВидаОперации,
	|	СчетФактураПолученный.СоставНФА.(
	|		НомерСтроки,
	|		НФА,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Сумма,
	|		СтавкаНДС,
	|		СуммаНДС,
	|		Всего,
	|		СуммаАкциза,
	|		Количество КАК КоличествоДоИзменения,
	|		СтавкаНДС КАК СтавкаНДСДоИзменения,
    |		Сумма КАК СуммаДоИзменения,
    |		СуммаНДС КАК СуммаНДСДоИзменения,
    |		Всего КАК ВсегоДоИзменения,
	|		СуммаАкциза КАК СуммаАкцизаДоИзменения,
	|		НДСКВычету,
	|		КПСВычетКт,
	|       КФО,
	|       СчетВычетКт,
	|		Счет30304,
	|		КомиссионнаяТорговля,
	|       ВЫБОР
	|			КОГДА ДокументОснование = НЕОПРЕДЕЛЕНО ТОГДА
	|				Ссылка
	|			ИНАЧЕ
	|				ДокументОснование
	|		КОНЕЦ	КАК ДокументОснование,
	|
	|		Ссылка.ВидЦенности	КАК ВидЦенности
	// Пока в документе применяется реквизит шапки
	//|		ВЫБОР
	//|			КОГДА &ЭтоАванс ТОГДА
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	//|				
	//|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) И НФА.ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ПраваПользованияИмуществом) ТОГДА
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	//|				
	//|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) ТОГДА
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.ОС)
	//|				
	//|			КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.Номенклатура) ТОГДА
	//|				ВЫБОР
	//|					КОГДА НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ИЛИ НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
	//|						ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	//|					ИНАЧЕ
	//|						ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Материалы)
	//|				КОНЕЦ
	//|				
	//|			ИНАЧЕ
	//|				ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Прочее)
	//|				
	//|		КОНЕЦ										КАК ВидЦенности
	|	)  Как ОснованиеСоставНФА,
	|	СчетФактураПолученный.ПлатежноРасчетныеДокументы.(
    |		ДатаДокумента	КАК ДатаДокумента,
    |		НомерДокумента	КАК НомерДокумента
	|	) КАК ОснованиеПлатежноРасчетныеДокументы
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка = &Ссылка";
	
	ДанныеЗаполнения = Запрос.Выполнить().Выгрузить();
	
	Шапка		= ДанныеЗаполнения[0];
	СоставНФА	= ДанныеЗаполнения[0]["ОснованиеСоставНФА"];
	ОснованиеПлатежноРасчетныеДокументы	= ДанныеЗаполнения[0]["ОснованиеПлатежноРасчетныеДокументы"];
	
	Объект.ПлатежноРасчетныеДокументы.Загрузить(ОснованиеПлатежноРасчетныеДокументы);
	
	//
	// Аналитика затрат
	//
	Переименование = Новый Структура();
	Переименование.Вставить("ДокументОснование", "ОбъектНалогообложения");
	
	УчетНДС.ПереименоватьКолонки(СоставНФА, Переименование, "вперед");
	
	УчетНДС.ЗаполнитьАналитикуЗатрат(СоставНФА);
	
	УчетНДС.ПереименоватьКолонки(СоставНФА, Переименование, "назад");
	
	//
	// Счет расчетов
	//
	УчетНДС.ЗаполнитьСчетРасчетов(СоставНФА);
	
	
	ЗаполнитьЗначенияСвойств(Объект, Шапка);
	
	Объект.СоставНФА.Загрузить(СоставНФА);
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииИсправительныйСчетФактураПолученный(Знач ДокументОснования, Объект, ЗаполнятьШапкуПоОснованию = истина)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДокументОснования);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СчетФактураПолученный.Организация КАК Организация,
	               |	СчетФактураПолученный.ИФО КАК ИФО,
	               |	СчетФактураПолученный.Подразделение КАК Подразделение,
	               |	СчетФактураПолученный.Контрагент КАК Контрагент,
	               |	СчетФактураПолученный.НаименованиеПродавца КАК НаименованиеПродавца,
	               |	СчетФактураПолученный.ИННПродавца КАК ИННПродавца,
	               |	СчетФактураПолученный.КПППродавца КАК КПППродавца,
	               |	СчетФактураПолученный.НомерСчетаФактуры КАК НомерСчетаФактуры,
	               |	СчетФактураПолученный.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	               |	СчетФактураПолученный.Договор КАК Договор,
	               |	СчетФактураПолученный.ПричинаНалогообложения КАК ПричинаНалогообложения,
	               |	СчетФактураПолученный.ВалютаДокумента КАК ВалютаДокумента,
	               |	СчетФактураПолученный.ИсправляемыйДокумент КАК ИсправляемыйДокумент,
					|	КодВидаОперации,
	               |	СчетФактураПолученный.СоставНФА.(
	               |		НФА,
	               |		ЕдиницаИзмерения,
	               |		Количество,
	               |		Сумма,
	               |		СтавкаНДС,
	               |		СтавкаНДСДоКорректировки КАК СтавкаНДСДоКорректировки,
	               |		СтавкаНДС КАК СтавкаНДСДоИзменения,
	               |		СуммаНДС,
	               |		Всего,
	               |		Количество КАК КоличествоДоИзменения,
	               |		Сумма КАК СуммаДоИзменения,
	               |		СуммаНДС КАК СуммаНДСДоИзменения,
	               |		Всего КАК ВсегоДоИзменения,
	               |		КоличествоДоКорректировки КАК КоличествоДоКорректировки,
	               |		СуммаДоКорректировки КАК СуммаДоКорректировки,
	               |		СуммаНДСДоКорректировки КАК СуммаНДСДоКорректировки,
	               |		ВсегоДоКорректировки КАК ВсегоДоКорректировки,
	               |		НДСКВычету,
	               |		КПСВычетКт,
	               |		КФО,
	               |		СчетВычетКт,
	               |		Счет30304,
	               |		ДокументОснование,
				   |
					|	ПроцентНДСкВычету,
					|	СчетДт,
					|	КЭКСчетаДебета,
					|	КПССчетаДебета,
					|	СубконтоДт1,
					|	СубконтоДт2,
					|	СубконтоДт3,
					|	СчетРасчетов
				   |
	               |	) КАК ОснованиеСоставНФА,
					|	СчетФактураПолученный.ПлатежноРасчетныеДокументы.(
				    |		ДатаДокумента	КАК ДатаДокумента,
				    |		НомерДокумента	КАК НомерДокумента
					|	) КАК ОснованиеПлатежноРасчетныеДокументы
	               |ИЗ
	               |	Документ.ИсправительныйСчетФактураПолученный КАК СчетФактураПолученный
	               |ГДЕ
	               |	СчетФактураПолученный.Ссылка = &Ссылка";
	
	Основание = Запрос.Выполнить().Выбрать();
	Основание.Следующий();
	Объект.СоставНФА.Очистить();
	Если ЗаполнятьШапкуПоОснованию тогда
		ЗаполнитьЗначенияСвойств(Объект, Основание);
	КонецЕсли;	
	
	НФА = Основание.ОснованиеСоставНФА.Выбрать();
	
	Пока НФА.Следующий() Цикл
		СтрокаНФА = Объект.СоставНФА.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНФА, НФА);
	КонецЦикла;	
	
	Объект.ПлатежноРасчетныеДокументы.Очистить();
	Выборка = Основание.ОснованиеПлатежноРасчетныеДокументы.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ПлатежноРасчетныеДокументы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПРоцедуры

Процедура ЗаполнитьНаОснованииКорректировочныйСчетФактураПолученный(Знач ДокументОснования, Объект)
	
	СтруктураШапкиОснования = ОбщегоНазначенияБГУ.СформироватьСтруктуруШапкиДокументаПоСсылке(ДокументОснования.Ссылка);
	
	ОбъектОснования = ДокументОснования.ПолучитьОбъект();
	
	Объект.СоставНФА.Очистить();
	Объект.ПлатежноРасчетныеДокументы.Очистить();
	
	ЗаполнитьЗначенияСвойств(Объект, СтруктураШапкиОснования,,"Номер,Проведен,ПометкаУдаления");
	
	Объект.НомерСчетаФактуры = ОбъектОснования.НомерПервичногоДокумента;
	Объект.ДатаСчетаФактуры = ОбъектОснования.ДатаПервичногоДокумента;
	
	Объект.ДокументОснование		= ОбъектОснования.Ссылка;
	Объект.ДокументКорректировки	= Неопределено;
	
	Для Каждого СтрокаТаблицы Из ОбъектОснования.СоставНФА Цикл
		СтрокаНФА = Объект.СоставНФА.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаНФА, СтрокаТаблицы);
	КонецЦикла;
	
	Объект.ПлатежноРасчетныеДокументы.Загрузить(ОбъектОснования.ПлатежноРасчетныеДокументы.Выгрузить());
	
КонецПРоцедуры

Процедура ЗаполнитьНаОснованииПоступлениеМЗ(Знач ДокументОснования, Объект, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры = "ТолькоДозаполнитьПоСчетуФактуре" Тогда
		ДозаполнитьПоСчетуФактуре(Объект, Объект.ДокументОснование);
		
		Возврат;
	КонецЕсли;
	
	РеквизитыОперацииОснования = БухгалтерскиеОперацииСервер.ПолучитьРеквизитыОперации(
		ДокументОснования,
		"СчетУчетаНДСКРаспределению,СчетУчетаНДС");
	
	Счет30304 = ПланыСчетов.ЕПСБУ.НайтиПоКоду("303.04");
	
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДокОснованиеСсылка",			ДокументОснования);
	ЗапросЗаполнение.УстановитьПараметр("СчетУчетаНДСКРаспределению",	РеквизитыОперацииОснования["СчетУчетаНДСКРаспределению"]);
	ЗапросЗаполнение.УстановитьПараметр("СчетУчетаНДС",					РеквизитыОперацииОснования["СчетУчетаНДС"]);
	ЗапросЗаполнение.УстановитьПараметр("Счет30304",					Счет30304);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные шапки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка											КАК ДокументКорректировки,
	|	Дата											КАК Дата,
	|	Организация										КАК Организация,
	|	ИФО												КАК ИФО,
	|	Подразделение									КАК Подразделение,
	|	Контрагент										КАК Контрагент,
	|	Договор											КАК Договор,
	|	ВалютаДокумента									КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА Договор.ТипДоговораНДС = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровДляНДС.АгентскийДоговор) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.ПокупкаНалоговыйАгент)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.Покупка)
	|	КОНЕЦ											КАК ПричинаНалогообложения,
	|	ВЫБОР
	|		КОГДА Договор.ТипДоговораНДС = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоровДляНДС.АгентскийДоговор) ТОГДА
	|			""06""
	|		ИНАЧЕ
	|			""01""
	|	КОНЕЦ											КАК КодВидаОперации
	|ИЗ
	|	Документ.ПоступлениеМЗ
	|ГДЕ
	|	Ссылка = &ДокОснованиеСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные табличной части СоставНФА
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка 											КАК ДокументОснование,
	|	Номенклатура									КАК НФА,
	|	ЕдиницаИзмерения								КАК ЕдиницаИзмерения,
	|	Ссылка.ПринятьНДСКВычету						КАК НДСКВычету,
	|	НДСКРаспределению								КАК НДСКРаспределению,
	|	КФО												КАК КФО,
	|	ВЫБОР
	|		КОГДА Ссылка.КПСРасчетов <> ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка) ТОГДА
	|			Ссылка.КПСРасчетов
	|		ИНАЧЕ
	|			КПС
	|	КОНЕЦ											КАК КПСВычетКт,
	|	ВЫБОР
	|		КОГДА НДСКРаспределению ТОГДА
	|			&СчетУчетаНДСКРаспределению
	|		ИНАЧЕ
	|			&СчетУчетаНДС
	|	КОНЕЦ											КАК СчетВычетКт,
	|	&Счет30304										КАК Счет30304,
	|	
	|	// До корректировки
	|	СтавкаНДС										КАК СтавкаНДСДоИзменения,
	|	КоличествоДоКорректировки						КАК КоличествоДоИзменения,
	|	ВЫБОР
	|		КОГДА КоличествоДоКорректировки <> 0 И Ссылка.СуммаВключаетНДС ТОГДА
	|			ВЫРАЗИТЬ((СуммаДоКорректировки - СуммаНДСДоКорректировки) / КоличествоДоКорректировки КАК Число(15,2))
	|			
	|		КОГДА КоличествоДоКорректировки <> 0 И НЕ Ссылка.СуммаВключаетНДС ТОГДА
	|			ВЫРАЗИТЬ(СуммаДоКорректировки / КоличествоДоКорректировки КАК Число(15,2))
	|			
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ											КАК ЦенаДоИзменения,
	|	ВЫБОР
	|		КОГДА Ссылка.СуммаВключаетНДС ТОГДА
	|			СуммаДоКорректировки - СуммаНДСДоКорректировки
	|		ИНАЧЕ
	|			СуммаДоКорректировки
	|	КОНЕЦ											КАК СуммаДоИзменения,
	|	СуммаНДСДоКорректировки							КАК СуммаНДСДоИзменения,
	|	ВсегоДоКорректировки							КАК ВсегоДоИзменения,
	|	
	|	// После корректировки
	|	СтавкаНДС										КАК СтавкаНДС,
	|	Количество										КАК Количество,
	|	ВЫБОР
	|		КОГДА Количество <> 0 И Ссылка.СуммаВключаетНДС ТОГДА
	|			ВЫРАЗИТЬ((Сумма - СуммаНДС) / Количество КАК Число(15,2))
	|			
	|		КОГДА Количество <> 0 И НЕ Ссылка.СуммаВключаетНДС ТОГДА
	|			ВЫРАЗИТЬ(Сумма / Количество КАК Число(15,2))
	|			
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ											КАК Цена,
	|	ВЫБОР
	|		КОГДА Ссылка.СуммаВключаетНДС ТОГДА
	|			Сумма - СуммаНДС
	|		ИНАЧЕ
	|			Сумма
	|	КОНЕЦ											КАК Сумма,
	|	СуммаНДС										КАК СуммаНДС,
	|	Всего											КАК Всего
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &ДокОснованиеСсылка
	|;";
	
	РезультатыЗапросов = ЗапросЗаполнение.ВыполнитьПакет();
	
	// [0]. Данные шапки
	Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатыЗапросов[0].Выгрузить()[0]);
	ЗаполнитьЗначенияСвойств(Объект, Шапка);
	
	// [1]. Данные табличной части СоставНФА
	Таблица = РезультатыЗапросов[1].Выгрузить();
	Объект.СоставНФА.Загрузить(Таблица);
	
	РезультатыПоиска = УчетНДС.НайтиПредыдущийСчетФактуруПоступления(ДокументОснования);
	
	Если РезультатыПоиска <> Неопределено Тогда
		ДозаполнитьПоСчетуФактуре(Объект, РезультатыПоиска.Ссылка);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.СоставНФА Цикл
		УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(СтрокаТаблицы, "Сумма");
		УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(СтрокаТаблицы, "СуммаНДС");
		УчетНДСКлиентСервер.ЗаполнитьУвеличениеУменьшение(СтрокаТаблицы, "Всего");
	КонецЦикла;
	
КонецПроцедуры

Процедура ДозаполнитьПоСчетуФактуре(ДокументОбъект, СчетФактура)
	
	Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
		Возврат;
	КонецЕсли;
	
	// Реквизиты шапки
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		// Частичное заполнение, аналогичное ЗаполнитьНаОснованииСчетФактураПолученный
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "
			|Дата,
			|НомерПервичногоДокумента,
			|ДатаПервичногоДокумента,
			|ПричинаНалогообложения,
			|ВалютаДокумента,
			|КодВидаОперации");
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов,,"Дата");
		
		ДокументОбъект.ДокументОснование = СчетФактура;
		ДокументОбъект.ИсправляемыйДокумент = СчетФактура;
		ДокументОбъект.НомерСчетаФактуры = ЗначенияРеквизитов.НомерПервичногоДокумента;
		ДокументОбъект.ДатаСчетаФактуры = ЗначенияРеквизитов.ДатаПервичногоДокумента;
		ДокументОбъект.КорректируемыйПериод = ЗначенияРеквизитов.Дата;
		
	ИначеЕсли ТипЗнч(СчетФактура) = Тип("ДокументСсылка.ИсправительныйСчетФактураПолученный") Тогда
		// Частичное заполнение, аналогичное ЗаполнитьНаОснованииИсправительныйСчетФактураПолученный
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "
			|НомерСчетаФактуры,
			|ДатаСчетаФактуры,
			|ПричинаНалогообложения,
			|ВалютаДокумента,
			|ИсправляемыйДокумент,
			|КодВидаОперации");
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		
		ДокументОбъект.ДокументОснование = СчетФактура;
		
	ИначеЕсли ТипЗнч(СчетФактура) = Тип("ДокументСсылка.КорректировочныйСчетФактураПолученный") Тогда
		// Частичное заполнение, аналогичное ЗаполнитьНаОснованииКорректировочныйСчетФактураПолученный
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "
			|ПричинаНалогообложения,
			|ИсправляемыйДокумент,
			|КодВидаОперации");
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов);
		
		ДокументОбъект.ДокументОснование = СчетФактура;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	// Табличные части
	
	УчетНДС.ЗаполнитьПлатежноРасчетныеДокументы(ДокументОбъект, СчетФактура);
	
КонецПроцедуры


Процедура ЗаполнитьРеквизитыСторонСделки(ДокументОбъект) Экспорт
	
	ШапкаДокумента = Новый Структура("
		|Дата,
		|Контрагент,
		|Организация,
		|Подразделение,
		|ПричинаНалогообложения");
	
	ЗаполнитьЗначенияСвойств(ШапкаДокумента, ДокументОбъект);
	
	Если НЕ УчетНДС.ЗаполненыОбязательныеРеквизитыДляОпределенияСторонСделки(ШапкаДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Данные = УчетНДС.РасширитьШапкуДокументаДляОпределенияПродавцаПокупателяГрузоотправителяГрузополучателя(ШапкаДокумента);
	
	ОбщаяКонтактнаяИнформация = УчетНДС.ПолучитьОбщуюКонтактнуюИнформациюПродавцаПокупателяГрузоотправителяГрузополучателя(
		Данные["СписокОбъектовДляОпределенияАдресов"]);
	
	СтороныСделки = УчетНДС.ОпределитьПродавцаПокупателяГрузоотправителяГрузополучателя(
		Данные["ШапкаДокументаРасширенная"],
		ОбщаяКонтактнаяИнформация);
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("НаименованиеПродавца",	СтороныСделки.Продавец.Наименование);
	Параметры.Вставить("ИННПродавца",			СтороныСделки.Продавец.ИНН);
	Параметры.Вставить("КПППродавца",			СтороныСделки.Продавец.КПП);
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, Параметры);
	
КонецПроцедуры


Функция СформироватьДвижения(СтруктураШапкиДокумента, ТаблицаДанных, Движения)
	//СчетРаспределения = ПланыСчетов.ЕПСБУ.НайтиПоКоду("210.Н1");
	// Если это счет-фактура налогового агента, то следует начислить НДС в бюджет и зарегистрироваться
	// в книге продаж или доп. листе книги продаж
	Если    СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.ПокупкаНалоговыйАгент 
		ИЛИ СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.ПокупкаУНерезидентаНалоговыйАгент Тогда
		Для каждого ТекСтрока из ТаблицаДанных Цикл
			
			Если СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок Тогда
				Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			Иначе	
				Если НЕ СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			КонецЕсли;	
			
			//Если СтрокаДокумента.УчитыватьНДС Тогда
			//	ТекСчетКредита = ТекСтрока.СчетКредита;
			//	Если ТекСчетКредита = ПолучитьЛокальнуюПеременную("Счет210Н1") Тогда
			//		ТекДвижения = ДвиженияКРаспределению;
			//	Иначе	
			//		ТекДвижения = ДвиженияВходящийНДС;
			//	КонецЕсли;	
			//	Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(ТекДвижения, СтруктураШапкиДокумента, ТекСтрока, СтрокаДокумента) Тогда
			//		Возврат Ложь;
			//	КонецЕсли;	
			//КонецЕсли;	
		КонецЦикла;
		
		Возврат Истина;
	ИначеЕсли СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.АвансВыданный
		ИЛИ СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.СчетФактураНаАвансОтКомиссионера Тогда
		// Аванс выданный новая счет фактура, а не корректировка (не целесообразно)
	КонецЕсли;	
	
//******************************************	
	
	// Вычеты по бюджетным счетам-фактурам не обслуживаем.
	//Если СтруктураШапкиДокумента.КВД = ОбщегоНазначения.ПолучитьЗначениеПеременной("глКВДБюджет") Тогда
	//	Возврат Истина;
	//КонецЕсли;	
	
	Для каждого ТекСтрока из ТаблицаДанных Цикл
		// Если ВидЦенности = ОС, то все ложим либо в РН: НДС_Входящий, либо РН: НДС_КРаспределению
		
		//Если ТекСтрока.ВидЦенности = Перечисления.ВидыЦенностейНДС.ОС Тогда
		//	Если ТекСтрока["НДСКРаспределению"] Тогда
		//		Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДСКРаспределению.Добавить(), СтруктураШапкиДокумента, ТекСтрока) Тогда
		//			Возврат Ложь;
		//		КонецЕсли;	
		//	Иначе	
		//		//ТекДвижения = ДвиженияВходящийНДС;
		//		Если СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок Тогда
		//			Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
		//				Возврат Ложь;
		//			КонецЕсли;	
		//		Иначе
		//			Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДС.Добавить(), СтруктураШапкиДокумента, ТекСтрока) Тогда
		//				Возврат Ложь;
		//			КонецЕсли;	
		//		КонецЕсли;	
		//	КонецЕсли;	
		//	
		//ИначеЕсли  СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.Покупка или
		Если  СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.Покупка или
			СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.СчетФактураНаПокупкуОтКомиссионера или
			СтруктураШапкиДокумента.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.ВозвратОтПокупателя Тогда
			
			Если ТекСтрока["НДСКРаспределению"] Тогда
				Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДСКРаспределению.Добавить(), СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			Иначе	
				Если СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок Тогда
					Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
						Возврат Ложь;
					КонецЕсли;	
				Иначе	
					Если НЕ СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
						Возврат Ложь;
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
			
		Иначе	
			Если ТекСтрока["НДСКРаспределению"] Тогда
				Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДСКРаспределению.Добавить(), СтруктураШапкиДокумента, ТекСтрока) Тогда
					Возврат Ложь;
				КонецЕсли;	
			Иначе	
				Если СтруктураШапкиДокумента.ВариантРегистрации = Перечисления.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок Тогда
					Если НЕ СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
						Возврат Ложь;
					КонецЕсли;	
				Иначе
					// Политика "По оплате", нет регистрации в доп. листе, НДС не к распределению.
					// Надо еще проверить если это поступление через подотчетное лицо, то будем считать, что
					// поставка оплачена
					Если БухгалтерскийУчет.СчетВИерархии(ТекСтрока.СчетРасчетов, "208.00") Тогда
						Если НЕ СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока) Тогда
							Возврат Ложь;
						КонецЕсли;	
					Иначе
						Если НЕ СформироватьДвижениеПоРН_ВходящийНДС(Движения.ВходящийНДС.Добавить(), СтруктураШапкиДокумента, ТекСтрока) Тогда
							Возврат Ложь;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	Возврат Истина;
КонецФункции	

Функция СформироватьДвижениеПоРН_ВходящийНДС(Движение, СтруктураШапкиДокумента, ТекСтрока)
	Результат = Истина;
	
	ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
	
	Движение.ВидДвижения            = ВидДвиженияНакопления.Приход;
	Движение.Период                 = СтруктураШапкиДокумента.Дата;
	Движение.Организация            = СтруктураШапкиДокумента.Организация;
	Движение.КФО                    = ТекСтрока.КФО;
	Движение.СчетФактура            = СтруктураШапкиДокумента.ДокументОснование;
	Движение.ОбъектНалогообложения  = ?(ТекСтрока.ОбъектНалогообложения = Неопределено,СтруктураШапкиДокумента.ДокументОснование, ТекСтрока.ОбъектНалогообложения);
	Движение.ПричинаНалогообложения = СтруктураШапкиДокумента.ПричинаНалогообложения;
	Движение.ВидЦенности 			= ТекСтрока.ВидЦенности;
	Движение.ДокументКорректировки  = СтруктураШапкиДокумента.Ссылка;
	
	Если ТекСтрока.МестоРегистрации = Перечисления.МестаРегистрацииСчетовФактур.КнигаПродаж Тогда
		Движение.СуммаНДС				= -Движение.СуммаНДС;
		Движение.СуммаБезНДС			= -Движение.СуммаБезНДС;
		Движение.СуммаНДСВалютная		= -Движение.СуммаНДСВалютная;
		Движение.СуммаБезНДСВалютная	= -Движение.СуммаБезНДСВалютная;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	

Функция СформироватьДвижениеПоРН_КнигаПродажПокупок(Движения, СтруктураШапкиДокумента, ТекСтрока)
	Результат = Истина;
	
	ТекСчетКредита = ТекСтрока.СчетКредита;
	Если НЕ ЗначениеЗаполнено(ТекСчетКредита) Тогда
		Возврат Результат;
	КонецЕсли;	
	Если не ЗначениеЗаполнено(ТекСтрока.МестоРегистрации) тогда
		Возврат Результат;
	КонецЕсли;	
	
	Если ТекСтрока.МестоРегистрации = Перечисления.МестаРегистрацииСчетовФактур.КнигаПокупок тогда
		Движение = Движения.КнигаПокупок.Добавить();
	Иначе
		Движение = Движения.КнигаПродаж.Добавить();
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
	
	
	ЗаполнитьЗначенияСвойств(Движение, СтруктураШапкиДокумента, "Организация, ПричинаНалогообложения");
	
	Движение.Период      = СтруктураШапкиДокумента.Дата;
	Движение.СчетФактура = СтруктураШапкиДокумента.Ссылка;
	Движение.КодВидаОперации= СтруктураШапкиДокумента.КодВидаОперации;
	
	Движение.СуммаНДС    = ТекСтрока.СуммаНДС;
	Движение.СуммаНДСВалютная    = ТекСтрока.СуммаНДСВалютная;
	
	Возврат Результат;
КонецФункции	

Функция СформироватьДвижениеПоРН_ДопЛист(Движения, СтруктураШапкиДокумента, ТекСтрока)
	Результат = Истина;
	
	ТекСчетКредита = ТекСтрока.СчетКредита;
	Если НЕ ЗначениеЗаполнено(ТекСчетКредита) Тогда
		Возврат Результат;
	КонецЕсли;	
	
	Если не ЗначениеЗаполнено(ТекСтрока.МестоРегистрации) тогда
		Возврат Результат;
	КонецЕсли;	
	
	Если ТекСтрока.МестоРегистрации = Перечисления.МестаРегистрацииСчетовФактур.КнигаПокупок тогда
		Движение = Движения.ДополнительныеЛистыКнигиПокупок.Добавить();
	Иначе
		Движение = Движения.ДополнительныеЛистыКнигиПродаж.Добавить();
	КонецЕсли;	
	ЗаполнитьЗначенияСвойств(Движение, ТекСтрока);
	
	ЗаполнитьЗначенияСвойств(Движение, СтруктураШапкиДокумента, "Организация, ПричинаНалогообложения, КорректируемыйПериод");
	
	
	Движение.Период      = СтруктураШапкиДокумента.Дата;
	Движение.СчетФактура = СтруктураШапкиДокумента.Ссылка;
	Движение.КодВидаОперации= СтруктураШапкиДокумента.КодВидаОперации;
	
	МножительПроцент = ТекСтрока.ПроцентНДСкВычету / 100;
	
	Движение.СуммаБезНДС			= Движение.СуммаБезНДС			* МножительПроцент;
	Движение.СуммаНДС				= Движение.СуммаНДС				* МножительПроцент;
	Движение.СуммаБезНДСВалютная	= Движение.СуммаБезНДСВалютная	* МножительПроцент;
	Движение.СуммаНДСВалютная		= Движение.СуммаНДСВалютная		* МножительПроцент;
	
	Возврат Результат;
	
КонецФункции	

Функция ПолучитьДанныеДляВходящегоНДСпоДокументу(СтруктураШапкиДокумента)
	
	ДокументСсылка	= СтруктураШапкиДокумента.Ссылка;
	Курс			= СтруктураШапкиДокумента.Курс;
	Кратность		= СтруктураШапкиДокумента.Кратность;
	
	СчетаНДСКРаспределению = Новый Массив();
	Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("210.Н1");
	Если ЗначениеЗаполнено(Счет) Тогда
		СчетаНДСКРаспределению.Добавить(Счет);
	КонецЕсли;
	Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("210.Н2");
	Если ЗначениеЗаполнено(Счет) Тогда
		СчетаНДСКРаспределению.Добавить(Счет);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументСсылка",			ДокументСсылка);
	Запрос.УстановитьПараметр("Курс",					?(ЗначениеЗаполнено(Курс), Курс, 1));
	Запрос.УстановитьПараметр("Кратность",				?(ЗначениеЗаполнено(Кратность), Кратность, 1));
	Запрос.УстановитьПараметр("ЗаполнитьВалютныеСуммы",	УчетНДС.СледуетЗаполнитьВалютныеСуммы());
	Запрос.УстановитьПараметр("СчетаНДСКРаспределению",	СчетаНДСКРаспределению);
	Запрос.УстановитьПараметр("ЭтоАванс",				СтруктураШапкиДокумента.ЭтоАванс);
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличная часть документа
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ВсегоУвеличение < ВсегоУменьшение ТОГДА
	|			// Данная полученная корректировка на уменьшение,
	|			// и поэтому должна быть зарегистрирована в книге продаж
	|			ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПродаж)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПокупок)
	|	КОНЕЦ										КАК МестоРегистрации,
	|	НФА											КАК НФА,
	|	СтавкаНДС									КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА &ЭтоАванс ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Аванс)
	|			
	|		КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) И НФА.ВидНФА = ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ПраваПользованияИмуществом) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	|			
	|		КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.ОсновныеСредства) ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.ОС)
	|			
	|		КОГДА ТИПЗНАЧЕНИЯ(НФА) = ТИП(Справочник.Номенклатура) ТОГДА
	|			ВЫБОР
	|				КОГДА НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ИЛИ НФА.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
	|					ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Услуги)
	|				ИНАЧЕ
	|					ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Материалы)
	|			КОНЕЦ
	|			
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ВидыЦенностейНДС.Прочее)
	|			
	|	КОНЕЦ										КАК ВидЦенности,
	|	СчетВычетКт									КАК СчетКредита,
	|	ДокументОснование							КАК ОбъектНалогообложения,
	|	ДокументОснование.Дата						КАК ДатаОснования,
	|	КФО											КАК КФО,
	|	НДСКВычету									КАК НДСКВычету,
	|	ВЫБОР
	|		КОГДА СчетВычетКт В(&СчетаНДСКРаспределению) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ										КАК НДСКРаспределению,
	|	СчетРасчетов								КАК СчетРасчетов,
	|	КПСВычетКт									КАК КПССчетРасчетов,
	|	ПроцентНДСкВычету							КАК ПроцентНДСкВычету,
	|
	|	ВЫБОР
	|		КОГДА ВсегоУвеличение - СуммаНДСУвеличение > ВсегоУменьшение - СуммаНДСУменьшение ТОГДА
	|			(ВсегоУвеличение - СуммаНДСУвеличение) - (ВсегоУменьшение - СуммаНДСУменьшение)
	|		ИНАЧЕ
	|			(ВсегоУменьшение - СуммаНДСУменьшение) - (ВсегоУвеличение - СуммаНДСУвеличение)
	|	КОНЕЦ * &Курс / &Кратность					КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА СуммаНДСУвеличение > СуммаНДСУменьшение ТОГДА
	|			СуммаНДСУвеличение - СуммаНДСУменьшение
	|		ИНАЧЕ
	|			СуммаНДСУменьшение - СуммаНДСУвеличение
	|	КОНЕЦ * &Курс / &Кратность					КАК СуммаНДС,
	|	
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			ВЫБОР
	|				КОГДА ВсегоУвеличение - СуммаНДСУвеличение > ВсегоУменьшение - СуммаНДСУменьшение ТОГДА
	|					(ВсегоУвеличение - СуммаНДСУвеличение) - (ВсегоУменьшение - СуммаНДСУменьшение)
	|				ИНАЧЕ
	|					(ВсегоУменьшение - СуммаНДСУменьшение) - (ВсегоУвеличение - СуммаНДСУвеличение)
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ										КАК СуммаБезНДСВалютная,
	|	ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			ВЫБОР
	|				КОГДА СуммаНДСУвеличение > СуммаНДСУменьшение ТОГДА
	|					СуммаНДСУвеличение - СуммаНДСУменьшение
	|				ИНАЧЕ
	|					СуммаНДСУменьшение - СуммаНДСУвеличение
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ										КАК СуммаНДСВалютная
	|ИЗ
	|	Документ.КорректировочныйСчетФактураПолученный.СоставНФА КАК СоставНФА
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|	И НДСКВычету";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// Инициализация новых колонок
	//	1) СтавкаНДСДоИзменения
	//	2) КоличествоДоИзменения
	//	3) Аналитика затрат
	//		ПроцентНДСкВычету
	//		СчетДт
	//		КЭКСчетаДебета
	//		КПССчетаДебета
	//		СубконтоДт1
	//		СубконтоДт2
	//		СубконтоДт3
	//	4) СчетРасчетов
	
	ПричиныШкурыЛом = Новый Массив();
	ПричиныШкурыЛом.Добавить(Перечисления.ПричиныНалогообложенияНДС.РеализацияЛом);
	ПричиныШкурыЛом.Добавить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученныйЛом);
	
	Параметры.Вставить("ПричиныШкурыЛом", ПричиныШкурыЛом);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ПричиныШкурыЛом", ПричиныШкурыЛом);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка
	|ИЗ
	|	Документ.КорректировочныйСчетФактураПолученный.СоставНФА
	|ГДЕ
	|	// Условие 1
	|	(КоличествоДоИзменения = 0 И КоличествоДоИзменения <> Количество)
	|	ИЛИ
	|	// Условие 2
	|	(СтавкаНДСДоИзменения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка) И НЕ Ссылка.ПричинаНалогообложения В(&ПричиныШкурыЛом))
	|	ИЛИ
	|	// Условие 3
	|	(Ссылка.ВариантРегистрации = ЗНАЧЕНИЕ(Перечисление.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок) И СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка))
	|	ИЛИ
	|	// Условие 4
	|	СчетРасчетов = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|;";
	
	Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные);	
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.КорректировочныйСчетФактураПолученный";
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметры.ИмяВременнойТаблицы = "ВТДляОбработки";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(Параметры.Очередь,
		ПолноеИмяОбъекта, МенеджерВременныхТаблиц, ДополнительныеПараметры);
	
	Если Не Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	ПричиныШкурыЛом = Новый Массив();
	ПричиныШкурыЛом.Добавить(Перечисления.ПричиныНалогообложенияНДС.РеализацияЛом);
	ПричиныШкурыЛом.Добавить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученныйЛом);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПричиныШкурыЛом", ПричиныШкурыЛом);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка																			КАК Ссылка,
	|
	|	// Флаг условия 1
	|	МАКСИМУМ(КоличествоДоИзменения = 0 И КоличествоДоИзменения <> Количество)		КАК ИнициализироватьКоличествоДоИзменения,
	|	
	|	// Флаг условия 2
	|	МАКСИМУМ((СтавкаНДСДоИзменения = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|		И НЕ Ссылка.ПричинаНалогообложения В(&ПричиныШкурыЛом)))					КАК ИнициализироватьСтавкаНДСДоИзменения,
	|		
	|	// Флаг условия 3
	|	МАКСИМУМ((Ссылка.ВариантРегистрации = ЗНАЧЕНИЕ(Перечисление.ВариантыРегистрацииДляКорректирующихСФ.ВДопЛистахКнигПродажПокупок)
	|		И СчетДт = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)))						КАК ИнициализироватьАналитикуЗатрат,
	|		
	|	// Флаг условия 4
	|	МАКСИМУМ(СчетРасчетов = ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка))				КАК ИнициализироватьСчетРасчетов
	|ИЗ
	|	Документ.КорректировочныйСчетФактураПолученный.СоставНФА
	|ГДЕ
	|	Ссылка В (ВЫБРАТЬ Ссылка ИЗ ВТДляОбработки)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|;";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			НачатьТранзакцию();
			
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			ЭтоШкурыЛом = УчетНДСПовтИсп.ШкурыЛом(ДокОбъект["ПричинаНалогообложения"]);
			
			Для Каждого СтрокаТаблицы Из ДокОбъект.СоставНФА Цикл
				
				Если Выборка["ИнициализироватьКоличествоДоИзменения"] Тогда
					
					СтрокаТаблицы["КоличествоДоИзменения"] = СтрокаТаблицы["Количество"];
					
				КонецЕсли;
				
				Если Выборка["ИнициализироватьСтавкаНДСДоИзменения"] Тогда
					
					СтрокаТаблицы["СтавкаНДСДоИзменения"] = СтрокаТаблицы["СтавкаНДС"];
					
				КонецЕсли;
				
			КонецЦикла;
			
			СоставНФА = Неопределено;
			
			//
			// Аналитика затрат
			//
			Если Выборка["ИнициализироватьАналитикуЗатрат"] Тогда
				
				Если СоставНФА = Неопределено Тогда
					СоставНФА = ДокОбъект.СоставНФА.Выгрузить();
				КонецЕсли;
				
				УчетНДС.ЗаполнитьВидЦенности(СоставНФА, ДокОбъект["ПричинаНалогообложения"]);
				
				Переименование = Новый Структура();
				Переименование.Вставить("ДокументОснование", "ОбъектНалогообложения");
				
				УчетНДС.ПереименоватьКолонки(СоставНФА, Переименование, "вперед");
				
				УчетНДС.ЗаполнитьАналитикуЗатрат(СоставНФА);
				
				УчетНДС.ПереименоватьКолонки(СоставНФА, Переименование, "назад");
				
			КонецЕсли;
			
			//
			// Счет расчетов
			//
			Если Выборка["ИнициализироватьСчетРасчетов"] Тогда
				
				Если СоставНФА = Неопределено Тогда
					СоставНФА = ДокОбъект.СоставНФА.Выгрузить();
				КонецЕсли;
				
				УчетНДС.ЗаполнитьСчетРасчетов(СоставНФА);
				
			КонецЕсли;
			
			Если СоставНФА <> Неопределено Тогда
				
				ДокОбъект.СоставНФА.Загрузить(СоставНФА);
				
			КонецЕсли;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокОбъект);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область СчетаФактурыВыданныеПокупателям

Функция НовыйПараметрыЗапросаСчетовФактурВыданныхПокупателям() Экспорт

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ДатаПервичногоДокумента" , Неопределено);
	ПараметрыЗапроса.Вставить("Организация"         	, Неопределено);
	ПараметрыЗапроса.Вставить("ДокументОснование"       , Неопределено);
	ПараметрыЗапроса.Вставить("Контрагент"        		, Неопределено);
	ПараметрыЗапроса.Вставить("Договор"           		, Неопределено);
	ПараметрыЗапроса.Вставить("ПричинаНалогообложения"  , Неопределено);
	ПараметрыЗапроса.Вставить("Корректировочный"  , Ложь);
	
	Возврат ПараметрыЗапроса;

КонецФункции

Функция СчетаФактурыВыданныеПокупателям(ПараметрыЗапроса) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаПервичногоДокумента"	, ПараметрыЗапроса.ДатаПервичногоДокумента);
	Запрос.УстановитьПараметр("ДокументОснование"     	, ПараметрыЗапроса.ДокументОснование);
	Запрос.УстановитьПараметр("Организация"          	, ПараметрыЗапроса.Организация);
	Запрос.УстановитьПараметр("Контрагент"            	, ПараметрыЗапроса.Контрагент);
	Запрос.УстановитьПараметр("Договор"      		  	, ПараметрыЗапроса.Договор);
	
	Если ПараметрыЗапроса.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.СчетФактураНаАвансОтКомитента Тогда
		
		Запрос.Текст = ТекстЗапросаВыданныеСчетаФактурыНаАванс();
		
	ИначеЕсли ПараметрыЗапроса.ПричинаНалогообложения = Перечисления.ПричиныНалогообложенияНДС.СчетФактураНаРеализациюОтКомитента Тогда
		
		Запрос.Текст = ТекстЗапросаКорректировка();
		
	КонецЕсли;
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции 

Функция ТекстЗапросаВыданныеСчетаФактурыНаАванс()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировочныйСчетФактураВыданный.Контрагент КАК Покупатель,
	|	КорректировочныйСчетФактураВыданный.Ссылка КАК СчетФактура,
	|	СУММА(КорректировочныйСчетФактураВыданныйСоставНФА.СуммаНДСУвеличение) КАК СуммаНДСУвеличение,
	|	СУММА(КорректировочныйСчетФактураВыданныйСоставНФА.СуммаНДСУменьшение) КАК СуммаНДСУменьшение,
	|	КорректировочныйСчетФактураВыданный.ВсегоУвеличение) КАК СуммаУвеличение,
	|	КорректировочныйСчетФактураВыданный.ВсегоУменьшение КАК СуммаУменьшение
	|ИЗ
	|	Документ.КорректировочныйСчетФактураВыданный.СоставНФА КАК КорректировочныйСчетФактураВыданныйСоставНФА
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировочныйСчетФактураВыданный КАК КорректировочныйСчетФактураВыданный
	|		ПО КорректировочныйСчетФактураВыданныйСоставНФА.Ссылка = КорректировочныйСчетФактураВыданный.Ссылка
	|ГДЕ
	|	КорректировочныйСчетФактураВыданный.Организация = &Организация
	|	И КорректировочныйСчетФактураВыданный.ПричинаНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.АвансПолученныйКомиссионером)
	|	И НАЧАЛОПЕРИОДА(КорректировочныйСчетФактураВыданный.Дата, ДЕНЬ) = &ДатаПервичногоДокумента
	|	И НЕ КорректировочныйСчетФактураВыданный.ПометкаУдаления
	|	И КорректировочныйСчетФактураВыданный.Проведен
	|	И КорректировочныйСчетФактураВыданный.Комитент = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировочныйСчетФактураВыданный.Контрагент,
	|	КорректировочныйСчетФактураВыданный.Ссылка";
	
КонецФункции 

Функция ТекстЗапросаКорректировка()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Покупатель КАК Покупатель
	|ПОМЕСТИТЬ ПокупателиПоОтчету
	|ИЗ
	|	Документ.СчетФактураПолученный.СчетаФактурыВыданныеПокупателям КАК СчетФактураПолученныйСчетаФактурыВыданныеПокупателям
	|ГДЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Покупатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировочныйСчетФактураВыданный.Контрагент КАК Покупатель,
	|	КорректировочныйСчетФактураВыданный.Ссылка КАК СчетФактура,
	|	КорректировочныйСчетФактураВыданный.ВсегоУвеличениеПоКомиссии КАК СуммаУвеличение,
	|	0 КАК СуммаУменьшение,
	|	КорректировочныйСчетФактураВыданный.СуммаНДСУвеличениеПоКомиссии КАК СуммаНДСУвеличение,
	|	0 КАК СуммаНДСУменьшение
	|ИЗ
	|	Документ.КорректировочныйСчетФактураВыданный КАК КорректировочныйСчетФактураВыданный
	|ГДЕ
	|	КорректировочныйСчетФактураВыданный.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(КорректировочныйСчетФактураВыданный.Дата, ДЕНЬ) = &ДатаПервичногоДокумента
	|	И КорректировочныйСчетФактураВыданный.Контрагент В
	|			(ВЫБРАТЬ
	|				ПокупателиПоОтчету.Покупатель
	|			ИЗ
	|				ПокупателиПоОтчету)
	|	И КорректировочныйСчетФактураВыданный.ПричинаНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.Реализация)
	|	И КорректировочныйСчетФактураВыданный.ВсегоУвеличениеПоКомиссии <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировочныйСчетФактураВыданный.Контрагент,
	|	КорректировочныйСчетФактураВыданный.Ссылка,
	|	0,
	|	КорректировочныйСчетФактураВыданный.ВсегоУменьшениеПоКомиссии,
	|	0,
	|	КорректировочныйСчетФактураВыданный.СуммаНДСУменьшениеПоКомиссии
	|ИЗ
	|	Документ.КорректировочныйСчетФактураВыданный КАК КорректировочныйСчетФактураВыданный
	|ГДЕ
	|	КорректировочныйСчетФактураВыданный.Организация = &Организация
	|	И НАЧАЛОПЕРИОДА(КорректировочныйСчетФактураВыданный.Дата, ДЕНЬ) = &ДатаПервичногоДокумента
	|	И КорректировочныйСчетФактураВыданный.Контрагент В
	|			(ВЫБРАТЬ
	|				ПокупателиПоОтчету.Покупатель
	|			ИЗ
	|				ПокупателиПоОтчету)
	|	И КорректировочныйСчетФактураВыданный.ПричинаНалогообложения = ЗНАЧЕНИЕ(Перечисление.ПричиныНалогообложенияНДС.Реализация)
	|	И КорректировочныйСчетФактураВыданный.ВсегоУменьшениеПоКомиссии <> 0";
	
	
КонецФункции

#КонецОбласти

#КонецЕсли
