#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем УИДЗамера;

// Псевдоконстанты
&НаКлиенте
Функция ДЛИТЕЛЬНОСТЬ_ОЖИДАНИЯ()	Возврат 1; КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартныеОтчеты.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ДобавитьГруппировкуЕПСБУ("Счет", "Счет", Истина);
	ДобавитьГруппировкуЕПСБУ("Организация");
    Если ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
        ДобавитьГруппировкуЕПСБУ("Валюта");
    КонецЕсли;
    Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") Тогда
	    ДобавитьГруппировкуЕПСБУ("Подразделение");
    КонецЕсли;
	ДобавитьГруппировкуЕПСБУ("КФО");
	ДобавитьГруппировкуЕПСБУ("КПС");
    Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
	    ДобавитьГруппировкуЕПСБУ("ИФО");
    КонецЕсли;
	ДобавитьГруппировкуЕПСБУ("КЭК");
	ДобавитьГруппировкуЕПСБУ("ХХКЭК", Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы.Найти("ХХКЭК").Заголовок);
    
    СтандартныеОтчеты.ЗаполнитьПодписиПоУмолчанию(Отчет.Подписи);
	
	Отчет.ВыводитьБухгалтерскиеСчета = Истина;
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);

	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		Если НЕ СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиента().ИнформационнаяБазаФайловая Тогда
			ОбновитьОбработчикОжидания();
		КонецЕсли;
	КонецЕсли;
	
	СтандартныеОтчетыКлиент.ПриОткрытии(ЭтаФорма);
	
	РассчитатьПоказатели();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = НЕ Отчет.РежимРасшифровки;
	
	ВариантМодифицирован                    = Ложь;
	ПользовательскиеНастройкиМодифицированы = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	СтандартныеОтчеты.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если Не КомпоновщикИнициализирован Тогда
		ПользовательскиеНастройки = ПоместитьВоВременноеХранилище(Настройки, УникальныйИдентификатор);
	КонецЕсли;
	
	СтандартныеОтчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
    Если НайтиГруппировкуЕПСБУ("ХХКЭК") = -1 Тогда
        Отчет.ГруппировкаЕПСБУ.Очистить();
    	ДобавитьГруппировкуЕПСБУ("Счет", "Счет", Истина);
    	ДобавитьГруппировкуЕПСБУ("Организация");
    	ДобавитьГруппировкуЕПСБУ("КФО");
    	ДобавитьГруппировкуЕПСБУ("КПС");
    	ДобавитьГруппировкуЕПСБУ("КЭК");
		ДобавитьГруппировкуЕПСБУ("ХХКЭК", Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы.Найти("ХХКЭК").Заголовок);
    КонецЕсли; 
    
    кВалюта = "Валюта";
    Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
		УдалитьГруппировкуЕПСБУ(кВалюта);
	Иначе
		Если НайтиГруппировкуЕПСБУ(кВалюта) = -1 Тогда
			ДобавитьГруппировкуЕПСБУ(кВалюта);
		КонецЕсли
	КонецЕсли;
	
    кИФО = "ИФО";
    Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		УдалитьГруппировкуЕПСБУ(кИФО);
	Иначе
		Если НайтиГруппировкуЕПСБУ(кИФО) = -1 Тогда
			ДобавитьГруппировкуЕПСБУ(кИФО);
		КонецЕсли
    КонецЕсли;
    
	
    кПодразделение = "Подразделение";
    ЭтаФорма.Элементы.Подразделение.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
    Если НЕ ЭтаФорма.Элементы.Подразделение.Видимость Тогда
		УдалитьГруппировкуЕПСБУ(кПодразделение);
    Иначе
		Если НайтиГруппировкуЕПСБУ(кПодразделение) = -1 Тогда
			ДобавитьГруппировкуЕПСБУ(кПодразделение);
        КонецЕсли
    КонецЕсли; 
	
	Если
		НЕ Отчет.ВыводитьБухгалтерскиеСчета И
		НЕ Отчет.ВыводитьВспомогательныеСчета И
		НЕ Отчет.ВыводитьЗабалансовыеСчета И
		НЕ Отчет.ВыводитьНалоговыеСчета И
		НЕ Отчет.ВыводитьУправленческиеСчета
	Тогда
		Отчет.ВыводитьБухгалтерскиеСчета = Истина
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ИзменениеПериода(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ИзменениеПериода(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ИзменениеПериода(Элемент)
	
	СтандартныеОтчетыКлиент.УстановитьВидМежотчетногоПериодаПоДате(Отчет);
	
	ПриИзмененииСостоянияЭУ(Элемент);
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПериодаПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиент.УстановитьДатыПоВидуПериода(Отчет);
	
	Модифицированность = Истина;
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
		
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);

	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоУказанныйПериодПриИзменении(Элемент)
	
	
	СтандартныеОтчетыКлиент.УстановитьДатыПоВидуПериода(Отчет);
	
	Модифицированность = Истина;
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
    
    СтандартныеОтчетыКлиент.ПриИзмененииОрганизации(Отчет.Организация, Отчет.Подписи);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСостоянияЭУ(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ОбработкаРасшифровкиСтандартногоОтчета(ЭтаФорма, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	ПодключитьОбработчикОжидания("РассчитатьПоказателиДинамически", 0.2, Истина);
	
КонецПроцедуры

// ----------------------------------------------------------------------------
&НаКлиенте
Процедура ПодписиВыводитьПриИзменении(Элемент)
//    
//    Строка = Элемент.Родитель.ТекущиеДанные;
//    Область = "";
//    Если Строка.НомерСтроки = 1 Тогда
//        Область = "Заголовок";
//    ИначеЕсли Строка.НомерСтроки = 2 Тогда
//        Область = "Подписи";
//    ИначеЕсли Строка.НомерСтроки = 3 Тогда
//        Область = "ПодписьГлБухгалтера";
//    ИначеЕсли Строка.НомерСтроки = 4 Тогда
//        Область = "ПодписьРуководителя";
//    КонецЕсли; 
//    
//    Если НЕ ПустаяСтрока(Область) Тогда
//        Обл = ЭтаФорма.Результат.Области.Найти(Область);
//        Если Обл <> Неопределено Тогда
//            Обл.Видимость = Строка.Выводить;
//        КонецЕсли;
//    КонецЕсли; 
//    

    СтандартныеОтчетыКлиент.ПодписиВыводитьПриИзменении(Элемент.Родитель.ТекущиеДанные, ЭтаФорма.Результат);

КонецПроцедуры

&НаКлиенте
Процедура ПодписиПередНачаломИзменения(Элемент, Отказ)

    Отказ = СтандартныеОтчетыКлиент.ПодписиПередНачаломИзменения(Элемент.ТекущийЭлемент, Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПодписиСотрудникПриИзменении(Элемент)
//    
//    Строка = Элемент.Родитель.ТекущиеДанные;
//    Область = "";
//    Если Строка.НомерСтроки = 2 Тогда
//        Обл = ЭтаФорма.Результат.Области.Найти("ДолжностьИсполнителя");
//        Если Обл <> Неопределено Тогда
//            Обл.Текст  = ПолучитьДолжность(Строка.Сотрудник);
//            ЭтаФорма.Результат.Области.ФИОИсполнителя.Текст  = КорреспондентыКлиентСервер.ФИО(Строка(Строка.Сотрудник));
//        КонецЕсли; 
//    ИначеЕсли Строка.НомерСтроки = 3 Тогда
//        Обл = ЭтаФорма.Результат.Области.Найти("ФИОГлавногоБухгалтера");
//        Если Обл <> Неопределено Тогда
//            Обл.Текст  = КорреспондентыКлиентСервер.ФИО(Строка(Строка.Сотрудник));
//        КонецЕсли; 
//    ИначеЕсли Строка.НомерСтроки = 4 Тогда
//        Обл = ЭтаФорма.Результат.Области.Найти("ФИОРуководителя");
//        Если Обл <> Неопределено Тогда
//            Обл.Текст  = КорреспондентыКлиентСервер.ФИО(Строка(Строка.Сотрудник));
//        КонецЕсли; 
//    КонецЕсли; 

    СтандартныеОтчетыКлиент.ПодписиСотрудникПриИзменении(Элемент.Родитель.ТекущиеДанные, ЭтаФорма.Результат);

КонецПроцедуры

// Оформление

&НаКлиенте
Процедура МакетОформленияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметрВывода(Отчет.КомпоновщикНастроек.Настройки, "МакетОформления", МакетОформления);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьЗаголовокПриИзменении(Элемент)

	ОбластьПоиска = Результат.Области.Найти("Заголовок");
	Если ОбластьПоиска = Неопределено Тогда
		СформироватьОтчет(Ложь);
	Иначе
		ОбластьПоиска.Видимость = ВыводитьЗаголовок;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПодвалПриИзменении(Элемент)
	
	ОбластьПоиска = Результат.Области.Найти("Подписи");
	Если ОбластьПоиска = Неопределено Тогда
		СформироватьОтчет(Ложь);
	Иначе
		ОбластьПоиска.Видимость = ВыводитьПодвал;
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ ГРУППИРОВКА

&НаКлиенте
Процедура ГруппировкаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамГруппировкаПередНачаломДобавления(ЭтаФорма, "Группировка", Элемент, Отказ, Копирование, Родитель, Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСчетПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамСчетПриИзменении(ЭтаФорма, "Группировка", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПоСубсчетамПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПоСубсчетамПриИзменении(ЭтаФорма, "Группировка", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПредставлениеНачалоВыбора(ЭтаФорма, "Группировка", Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПредставлениеОчистка(ЭтаФорма, "Группировка", Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПредставлениеОбработкаВыбора(ЭтаФорма, "Группировка", Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ ГРУППИРОВКА ЕПСБУ

&НаКлиенте
Процедура ГруппировкаЕПСБУПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Группировка = "Счет" Тогда
		Отказ = Истина;
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоСчетПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамСчетПриИзменении(ЭтаФорма, "РазвернутоеСальдо", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПоСубсчетамПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПоСубсчетамПриИзменении(ЭтаФорма, "РазвернутоеСальдо", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПредставлениеНачалоВыбора(ЭтаФорма, "РазвернутоеСальдо", Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПредставлениеОчистка(ЭтаФорма, "РазвернутоеСальдо", Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартныеОтчетыКлиент.ТабличноеПолеПоСчетамПредставлениеОбработкаВыбора(ЭтаФорма, "РазвернутоеСальдо", Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
    
    Если НоваяСтрока И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Счет) Тогда
        УдалитьСтрокуРазвернутоеСальдоНаСервере(Элемент.ТекущиеДанные.НомерСтроки - 1);
        ОтменаРедактирования = Истина;
    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПолучитьПараметрыВыбораСчета(Новый Структура), Элемент);
    СтандартнаяОбработка = Ложь;
    
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ ДОПОЛНИТЕЛЬНЫЕ ПОЛЯ

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	СтандартныеОтчетыКлиент.ДополнительныеПоляПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляПередНачаломИзменения(Элемент, Отказ)
	
	СтандартныеОтчетыКлиент.ДополнительныеПоляПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ ОТБОРЫ

&НаКлиенте
Процедура ОтборыПриИзменении(Элемент)
	
	ОбновитьТекстЗаголовка(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	СтандартныеОтчетыКлиент.ОтборыПередНачаломДобавления(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа);

КонецПроцедуры

&НаКлиенте
Процедура ОтборыПередНачаломИзменения(Элемент, Отказ)
	
	СтандартныеОтчетыКлиент.ОтборыПередНачаломИзменения(ЭтаФорма, Элемент, Отказ);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	УИДЗамера = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Ложь, "ФормированиеОборотноСальдоваяВедомость");
	
	РезультатВыполнения = СформироватьОтчетСервер();
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		ОбновитьОбработчикОжидания();
	Иначе
		ЗафиксироватьДлительностьКлючевойОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	Результат = РезультатВыполнения.Результат;
	ДанныеРасшифровки = РезультатВыполнения.ДанныеРасшифровки;

	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	СтандартныеОтчеты.УстановитьКолонтитулыПоУмолчанию(Результат, ОбъектОтчет.Метаданные().Синоним, Строка(ПользователиКлиентСервер.АвторизованныйПользователь()), Отчет.Организация);
	
	ИдентификаторЗадания = Неопределено;

	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОбработчикОжидания()

	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ДЛИТЕЛЬНОСТЬ_ОЖИДАНИЯ(), Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()

	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
			ЗагрузитьПодготовленныеДанные();
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
			ЗафиксироватьДлительностьКлючевойОперации();
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания",
				ПараметрыОбработчикаОжидания.ТекущийИнтервал,
				Истина);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьДлительностьКлючевойОперации()
	
	ОценкаПроизводительностиКлиент.ЗавершитьЗамерВремени(УИДЗамера);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;
	Элементы.ПанельНастроек.Пометка = Элементы.ГруппаПанельНастроек.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.Группировка Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаЕПСБУУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.ГруппировкаЕПСБУ Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаЕПСБУСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.ГруппировкаЕПСБУ Цикл
		Если СтрокаТаблицы.Группировка <> "Счет" Тогда
			СтрокаТаблицы.Использование = Ложь;
		КонецЕсли
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.ДополнительныеПоля Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПоляУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.ДополнительныеПоля Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период.ДатаНачала = Отчет.НачалоПериода;
    Диалог.Период.ДатаОкончания = Отчет.КонецПериода;
    Диалог.Показать(Новый ОписаниеОповещения("ЗакончилиУстановитьПериод", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакончилиУстановитьПериод(Период, ДополнительныеПараметры) Экспорт
    
    Если Период <> Неопределено Тогда
		
		Отчет.НачалоПериода = Период.ДатаНачала;
        Отчет.КонецПериода  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
		СтандартныеОтчетыКлиент.УстановитьВидМежотчетногоПериодаПоДате(Отчет);
		
		ОбновитьТекстЗаголовка(ЭтотОбъект);
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтотОбъект);

    КонецЕсли; 
    
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоСнятьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.РазвернутоеСальдо Цикл
		СтрокаТаблицы.Использование = Ложь;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутоеСальдоУстановитьФлажки(Команда)
	
	Для Каждого СтрокаТаблицы Из Отчет.РазвернутоеСальдо Цикл
		СтрокаТаблицы.Использование = Истина;
	КонецЦикла;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ГРУППЫ РЕГИСТРЫ УЧЕТА

&НаКлиенте
Процедура Подключаемый_Команда(Команда)
	
	РегистрыУчетаКлиент.ОбработчикКомандыРаботыСРегистромУчета(ЭтотОбъект, Команда, "Результат");

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики команд расчета показателей.

&НаКлиенте
Процедура РассчитатьСумму(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьКоличество(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСреднее(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМинимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьМаксимум(Команда)
	РассчитатьПоказатели(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВсеПоказатели(Команда)
	УстановитьВидимостьПоказателей(Не Элементы.РассчитатьВсеПоказатели.Пометка);
КонецПроцедуры

&НаКлиенте
Процедура СвернутьПоказатели(Команда)
	УстановитьВидимостьПоказателей(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСтек(СтекПоСубсчетам, счСчет)
    
    Й = СтекПоСубсчетам.Количество() - 1;
    Пока Й >= 0  Цикл
        Если счСчет.ПринадлежитЭлементу(СтекПоСубсчетам[Й]) Тогда
            Возврат;
        Иначе
            СтекПоСубсчетам.Удалить(Й);
        КонецЕсли; 
        Й = Й - 1;
    КонецЦикла; 
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазвернутоеСальдоПоУмолчаниюНаСервере()
    
    НаборЗаписей = РегистрыСведений.РазвернутоеСальдо.СоздатьНаборЗаписей();
    НаборЗаписей.Прочитать();
    Выборка = НаборЗаписей.Выгрузить();
    Выборка.Сортировать("Счет");
    
    Отчет.РазвернутоеСальдо.Очистить();
    
    СтекПоСубсчетам = Новый Массив();
    
    Для каждого Строка Из Выборка Цикл
        Если НЕ Строка.Счет.ЭлементГруппа Тогда
            ПроверитьСтек(СтекПоСубсчетам, Строка.Счет);
            Если Строка.Использование = Перечисления.ВидыРазвернутогоСальдо.РазворачиватьПоСубсчетам Тогда
                Если Строка.Счет.ЭлементГруппа И СтекПоСубсчетам.Количество() = 0 Тогда
                    СтекПоСубсчетам.Добавить(Строка.Счет);
                    НоваяСтрока = Отчет.РазвернутоеСальдо.Добавить();
                    НоваяСтрока.Использование = Истина;
                    НоваяСтрока.ПоСубсчетам = Истина;
                    НоваяСтрока.Счет = Строка.Счет;
                    Если НоваяСтрока.Счет.ЭлементГруппа Тогда
                        НоваяСтрока.Представление = "По субсчетам";
                    КонецЕсли; 
                КонецЕсли; 
            ИначеЕсли
                Строка.Использование = Перечисления.ВидыРазвернутогоСальдо.Разворачивать ИЛИ
                Строка.Использование = Перечисления.ВидыРазвернутогоСальдо.Наследуется
            Тогда
                Если Строка.Счет.ЭлементГруппа Тогда
                    СтекПоСубсчетам.Добавить(Строка.Счет);
                КонецЕсли;
                
                НоваяСтрока = Отчет.РазвернутоеСальдо.Добавить();
                НоваяСтрока.Счет = Строка.Счет;
                НоваяСтрока.Использование = Истина;
                НоваяСтрока.ПоСубсчетам = (Строка.Счет.ЭлементГруппа = Истина);
                СтрокаПоСубконто    = "";
                
                Для Сбк = 1 По Строка.Счет.ВидыСубконто.Количество() Цикл
                    Если ЗначениеЗаполнено(Строка["Субконто" + Сбк]) Тогда
                        СтрокаПоСубконто = СтрокаПоСубконто + "+" + Сбк;
                        Если НЕ ПустаяСтрока(НоваяСтрока.Представление) Тогда
                             НоваяСтрока.Представление = НоваяСтрока.Представление + ", "
                        КонецЕсли; 
                        НоваяСтрока.Представление = НоваяСтрока.Представление + Строка(Строка["Субконто" + Сбк]);
                    Иначе
                        СтрокаПоСубконто = СтрокаПоСубконто + "-" + Сбк;
                    КонецЕсли;
                КонецЦикла;
                
                НоваяСтрока.ПоСубконто = СтрокаПоСубконто;
                
                Если ПустаяСтрока(НоваяСтрока.Представление) Тогда
                    Если НоваяСтрока.Счет.ЭлементГруппа Тогда
                        НоваяСтрока.Представление = "По субсчетам";
                    Иначе
                        НоваяСтрока.Представление = РегистрыСведений.РазвернутоеСальдо.стрНеРазворачивать();
                    КонецЕсли;
                КонецЕсли;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла; 
    
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРазвернутоеСальдоПоУмолчанию(Команда)
    ЗаполнитьРазвернутоеСальдоПоУмолчаниюНаСервере();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ЗаголовокОтчета = "Оборотно-сальдовая ведомость" + СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(Отчет.НачалоПериода, Отчет.КонецПериода,, Отчет.ТипПериода, Отчет.ТолькоУказанныйПериод);
	
	Если ЗначениеЗаполнено(Отчет.Организация) Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + ", " + СтандартныеОтчетыПовтИсп.ПолучитьТекстОрганизация(Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	КонецЕсли;
	
	Форма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрещенныеПоля(Режим = "") Экспорт
	
	СписокПолей = Новый Массив;
	
	СписокПолей.Добавить("UserFields");
	СписокПолей.Добавить("DataParameters");
	СписокПолей.Добавить("SystemFields");
	СписокПолей.Добавить("Показатели");
	СписокПолей.Добавить("Период");
	
	Если Режим = "Выбор" Тогда
		Для Каждого ДоступноеПоле Из Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляВыбора.Элементы Цикл
			Если ДоступноеПоле.Ресурс Тогда
				СписокПолей.Добавить(Строка(ДоступноеПоле.Поле));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ФОУчетПоПодразделениям Тогда
		СписокПолей.Добавить("Подразделение");
	КонецЕсли;
	
	Если Не ФОУчетПоИФО Тогда
		СписокПолей.Добавить("ИФО");
	КонецЕсли;
	
	Если НЕ ФОВалютныйУчет Тогда
		СписокПолей.Добавить("Валюта");
	КонецЕсли;

	Если Режим = "Выбор" Тогда
		СписокПолей.Добавить("СальдоНаНачалоПериода");
		СписокПолей.Добавить("ОборотыЗаПериод");
		СписокПолей.Добавить("СальдоНаКонецПериода");
	ИначеЕсли Режим = "Отбор" Тогда
		СтандартныеОтчетыКлиент.ДобавитьПоляРесурсовВЗапрещенныеПоля(ЭтаФорма, СписокПолей);
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокПолей);
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОтчета()

	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация"                      , Отчет.Организация);
	ПараметрыОтчета.Вставить("НачалоПериода"                    , Отчет.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                     , Отчет.КонецПериода);
	ПараметрыОтчета.Вставить("Подразделение"					, Отчет.Подразделение);
	ПараметрыОтчета.Вставить("ВключатьОбособленныеПодразделения", Отчет.ВключатьОбособленныеПодразделения);
	ПараметрыОтчета.Вставить("ПоСубсчетам"              		, Отчет.ПоСубсчетам);
	ПараметрыОтчета.Вставить("ВыводитьБухгалтерскиеСчета"		, Отчет.ВыводитьБухгалтерскиеСчета);
	ПараметрыОтчета.Вставить("ВыводитьУправленческиеСчета"		, Отчет.ВыводитьУправленческиеСчета);
	ПараметрыОтчета.Вставить("ВыводитьВспомогательныеСчета"		, Отчет.ВыводитьВспомогательныеСчета);
	ПараметрыОтчета.Вставить("ВыводитьНалоговыеСчета"			, Отчет.ВыводитьНалоговыеСчета);
	ПараметрыОтчета.Вставить("ВыводитьЗабалансовыеСчета"		, Отчет.ВыводитьЗабалансовыеСчета);
	ПараметрыОтчета.Вставить("РазмещениеДополнительныхПолей"	, Отчет.РазмещениеДополнительныхПолей);
	ПараметрыОтчета.Вставить("ПоказательБУ"                     , Отчет.ПоказательБУ);
	ПараметрыОтчета.Вставить("ПоказательКоличество"             , Отчет.ПоказательКоличество);
	ПараметрыОтчета.Вставить("ПоказательВалютнаяСумма"          , Отчет.ПоказательВалютнаяСумма);
	ПараметрыОтчета.Вставить("ПоказательНеУчитываетсяНУ"        , Отчет.ПоказательНеУчитываетсяНУ);
	ПараметрыОтчета.Вставить("ПоказательЕНВД"                   , Отчет.ПоказательЕНВД);
	ПараметрыОтчета.Вставить("ПоказательНДС"                    , Отчет.ПоказательНДС);
	ПараметрыОтчета.Вставить("РежимРасшифровки"                 , Отчет.РежимРасшифровки);
	ПараметрыОтчета.Вставить("ТипПериода"                 		, Отчет.ТипПериода);
	ПараметрыОтчета.Вставить("ТолькоУказанныйПериод"            , Отчет.ТолькоУказанныйПериод);
	ПараметрыОтчета.Вставить("Группировка"						, Отчет.Группировка.Выгрузить());
	ПараметрыОтчета.Вставить("ГруппировкаЕПСБУ"					, Отчет.ГруппировкаЕПСБУ.Выгрузить());
	ПараметрыОтчета.Вставить("РазвернутоеСальдо"				, Отчет.РазвернутоеСальдо.Выгрузить());
	ПараметрыОтчета.Вставить("ДополнительныеПоля"				, Отчет.ДополнительныеПоля.Выгрузить());
	ПараметрыОтчета.Вставить("Подписи"							, Отчет.Подписи.Выгрузить());
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок"                , ВыводитьЗаголовок);
	ПараметрыОтчета.Вставить("ВыводитьПодвал"                   , ВыводитьПодвал);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"            , ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , СтандартныеОтчеты.ИмяОтчетаПоИмениФормы(ЭтаФорма));
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , Отчет.КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыОтчета.Вставить("НаборПоказателей"                 , Отчеты[ПараметрыОтчета.ИдентификаторОтчета].ПолучитьНаборПоказателей());
	ПараметрыОтчета.Вставить("ВыводитьПолностью"				, Истина);
	ПараметрыОтчета.Вставить("ВысотаШапки"						, 0);

	//ПараметрыОтчета.Вставить("ГлавБух"               			, Отчет.ГлавБух);
	//ПараметрыОтчета.Вставить("Исполнитель"               		, Отчет.Исполнитель);
	
	Возврат ПараметрыОтчета;

КонецФункции

&НаСервере
Процедура ИнициализацияКомпоновщикаНастроек()
	
	СтандартныеОтчеты.ИнициализацияКомпоновщикаНастроекФ(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетСервер() Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("УникальныйИдентификатор" , ЭтаФорма.УникальныйИдентификатор);
	
	ИнициализацияКомпоновщикаНастроек();
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчета();
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	ИБФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	ИдентификаторЗадания = Неопределено;
	Если ИБФайловая Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		СтандартныеОтчеты.ВывестиОтчетФ(ПараметрыОтчета, АдресХранилища);
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
	Иначе
		РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"СтандартныеОтчеты.ВывестиОтчетФ",
			ПараметрыОтчета,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выполнение отчета: %1'"), ПараметрыОтчета.ИдентификаторОтчета));
		
		АдресХранилища       = РезультатВыполнения.АдресХранилища;
		ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	КонецЕсли;
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма, Истина);
	
	Если РезультатВыполнения.ЗаданиеВыполнено Тогда
		ЗагрузитьПодготовленныеДанные();
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки) Экспорт
	
	Если ЗаполняемыеНастройки.Свойство("Показатели") Тогда
		Если ЗаполняемыеНастройки.Показатели Тогда
			// Управление показателями
			Отчет.ПоказательБУ              = Истина;
			Отчет.ПоказательВалютнаяСумма   = Ложь;
			Отчет.ПоказательНеУчитываетсяНУ = Ложь;
			Отчет.ПоказательЕНВД            = Ложь;
			Отчет.ПоказательНДС             = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Форма.Элементы.ПоказательВалютнаяСумма.Доступность = Форма.ФОВалютныйУчет;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьГруппировкуЕПСБУ(ИмяГруппировки, Представление = "", Использование = Ложь)
	
	Строка = Отчет.ГруппировкаЕПСБУ.Добавить();
	Строка.Группировка = ИмяГруппировки;
	Строка.Использование = Использование;
	Если Представление = "" Тогда
		Строка.Представление = ИмяГруппировки;
	Иначе
		Строка.Представление = Представление;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает индекс строки или -1
&НаСервере
Функция НайтиГруппировкуЕПСБУ(Группировка)
	Для каждого Строка из Отчет.ГруппировкаЕПСБУ Цикл
		Если Строка.Группировка = Группировка Тогда
			Возврат Строка.НомерСтроки - 1;
		КонецЕсли
	КонецЦикла;
	Возврат -1;
КонецФункции

&НаСервере
Функция УдалитьГруппировкуЕПСБУ(Группировка)
	Индекс = НайтиГруппировкуЕПСБУ(Группировка);
	Если Индекс <> -1 Тогда
		Отчет.ГруппировкаЕПСБУ.Удалить(Индекс);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

// ----------------------------------------------------------------------------
&НаКлиенте
Функция ПолучитьПараметрыВыбораСчета(Парам, ЧастьКода = "")
    
    Парам.Вставить("ТипСчета", ВидСчета.АктивноПассивный);
    Если НЕ ПустаяСтрока(ЧастьКода) Тогда
        Парам.Вставить("СтрокаПоиска", ЧастьКода);
    КонецЕсли; 
    НеиспользованныеСчета = ПолучитьМассивНеиспользованныхСчетов(Новый Массив, ЧастьКода);
    Парам.Вставить("ОграниченияСписокСчетов", НеиспользованныеСчета);
    
    Возврат Парам;
    
КонецФункции
 
// ----------------------------------------------------------------------------
&НаСервере
Функция ПолучитьМассивНеиспользованныхСчетов(Счета, ЧастьКода)
    
    Запрос = Новый Запрос;
    
    Запрос.Текст =
       "ВЫБРАТЬ
       |    ЕПСБУ.Ссылка
       |ИЗ
       |    ПланСчетов.ЕПСБУ КАК ЕПСБУ
       |ГДЕ
       |    ЕПСБУ.Вид = ЗНАЧЕНИЕ(ВидСчета.АктивноПассивный)
       |    И НЕ ЕПСБУ.Ссылка В (&СписокСчетов)
       |    И ЕПСБУ.ЭлементГруппа = ЛОЖЬ
       |
       |УПОРЯДОЧИТЬ ПО
       |    ЕПСБУ.Код";
       
    Массив = Отчет.РазвернутоеСальдо.Выгрузить(, "Счет").ВыгрузитьКолонку("Счет");
    Если ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока < Массив.Количество() Тогда
        Массив.Удалить(ЭтаФорма.ТекущийЭлемент.ТекущаяСтрока);
    КонецЕсли; 
    Запрос.УстановитьПараметр("СписокСчетов", Массив);
    Счета = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
    
    Возврат Счета;
    
КонецФункции

// ----------------------------------------------------------------------------
&НаСервере
Процедура УдалитьСтрокуРазвернутоеСальдоНаСервере(Строка);
    
    Отчет.РазвернутоеСальдо.Удалить(Строка);
    
КонецПроцедуры

#Область РасчетПоказателейВыделенныхЯчеек

// Выполняет расчет и вывод показателей выделенной области ячеек.
// См. обработчик события ОтчетТабличныйДокументПриАктивизацииОбласти.
//
&НаКлиенте
Процедура РассчитатьПоказателиДинамически()
	Перем ТекущаяКоманда;
	
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Если Элементы[Команда.Ключ].Пометка Тогда 
			ТекущаяКоманда = Команда.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	РассчитатьПоказатели(ТекущаяКоманда);
КонецПроцедуры

// Выполняет расчет и вывод показателей выделенных областей ячеек табличного документа.
//
// Параметры:
//  ТекущаяКоманда - Строка - имя команды расчета показателя, например, "РассчитатьСумму".
//                      Определяет, какой показатель является основным.
//
&НаКлиенте
Процедура РассчитатьПоказатели(ТекущаяКоманда = "РассчитатьСумму")
	// Расчет показателей.
	ПараметрыРасчета = ОбщегоНазначенияБГУКлиент.ПараметрыРасчетаПоказателейЯчеек(Элементы.Результат);
	Если ПараметрыРасчета.РассчитатьНаСервере Тогда 
		РасчетныеПоказатели = РасчетныеПоказателиСервер(ПараметрыРасчета);
	Иначе
		РасчетныеПоказатели = ОбщегоНазначенияБГУКлиентСервер.РасчетныеПоказателиЯчеек(
			Результат, ПараметрыРасчета.ВыделенныеОбласти);
	КонецЕсли;
	
	// Установка значений показателей.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РасчетныеПоказатели);
	
	// Переключение и форматирование показателей.
	КомандыПоказателей = КомандыПоказателей();
	Для Каждого Команда Из КомандыПоказателей Цикл 
		Элементы[Команда.Ключ].Пометка = Ложь;
		
		ЗначениеПоказателя = РасчетныеПоказатели[Команда.Значение];
		РазрядностьПоказателя = Мин(СтрДлина(Макс(ЗначениеПоказателя, -ЗначениеПоказателя) % 1) - 2, 4);
		
		Элементы[Команда.Значение].ФорматРедактирования = "ЧДЦ=" + РазрядностьПоказателя + "; ЧРГ=' '; ЧН=0";
	КонецЦикла;
	Элементы[ТекущаяКоманда].Пометка = Истина;
	
	// Вывод основного показателя.
	ТекущийПоказатель = КомандыПоказателей[ТекущаяКоманда];
	Показатель = ЭтотОбъект[ТекущийПоказатель];
	Элементы.Показатель.ФорматРедактирования = Элементы[ТекущийПоказатель].ФорматРедактирования;
	Элементы.ГруппаВидыПоказателей.Картинка = БиблиотекаКартинок[ТекущийПоказатель];
КонецПроцедуры

// Рассчитывает показатели числовых ячеек в табличном документе.
//  см. ОтчетыКлиентСервер.РасчетныеПоказателиЯчеек.
//
&НаСервере
Функция РасчетныеПоказателиСервер(ПараметрыРасчета)
	Возврат ОбщегоНазначенияБГУКлиентСервер.РасчетныеПоказателиЯчеек(Результат, ПараметрыРасчета.ВыделенныеОбласти);
КонецФункции

// Определяет соответствие между командами расчета показателей и показателями.
//
// Возвращаемое значение:
//   Соответствие - Ключ - имя команды, Значение - имя показателя.
//
&НаКлиенте
Функция КомандыПоказателей()
	КомандыПоказателей = Новый Соответствие();
	КомандыПоказателей.Вставить("РассчитатьСумму", "Сумма");
	КомандыПоказателей.Вставить("РассчитатьКоличество", "Количество");
	КомандыПоказателей.Вставить("РассчитатьСреднее", "Среднее");
	КомандыПоказателей.Вставить("РассчитатьМинимум", "Минимум");
	КомандыПоказателей.Вставить("РассчитатьМаксимум", "Максимум");
	
	Возврат КомандыПоказателей;
КонецФункции

// Управляет признаком видимости панели расчетных показателей.
//
// Параметры:
//  Видимость - Булево - Признак включения / выключения видимости панели показателей.
//              См. также Синтакс-помощник: ГруппаФормы.Видимость.
//
&НаКлиенте
Процедура УстановитьВидимостьПоказателей(Видимость)
	Элементы.ОбластьПоказателей.Видимость = Видимость;
	Элементы.РассчитатьВсеПоказатели.Пометка = Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочте(Команда)
	
	ОтправкаПочтовыхСообщенийКлиент.ОтправитьОтчет(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
