
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетаКт = БухгалтерскийУчетПовтИсп.ПолучитьМассивСчетов("208.00");
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(Список.ТекстЗапроса);
		
		ТекстВыражения = Строка(СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[2].Выражение);
		ТекстВыражения = ТекстВыражения + "
		|И ИФО = &ИФО";
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Источники[0].Источник.Параметры[2].Выражение = Новый ВыражениеСхемыЗапроса(ТекстВыражения); 
		
		Список.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
		
		Список.Параметры.УстановитьЗначениеПараметра("ИФО", Параметры.ИФО);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НачалоПериода", Параметры.НачалоПериода);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "КонецПериода", 	Параметры.КонецПериода);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация", 	Параметры.Организация);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Контрагент", 	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Сотрудник, "Контрагент"));
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВалютаРуб", 	БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Валюта", 		Параметры.Валюта);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "СчетаКт", 		СчетаКт);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Выбранные", 	Параметры.МассивВыбранных);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "АвансовыйОтчет",Параметры.АвансовыйОтчет);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Валюта", "Видимость", ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаВВалюте", "Видимость", ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	
	Заголовок = Параметры.ЗаголовокФормы + " (" + Параметры.Сотрудник + ")";
	
	ПериодС 	= Параметры.НачалоПериода;
	ПериодПо 	= Параметры.КонецПериода;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьВладельцаОВыборе(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьВладельцаОВыборе(Элементы.Список.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСПриИзменении(Элемент)
	Если ПериодС > ПериодПо И ЗначениеЗаполнено(ПериодПо) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дата начала периода больше даты окончания'"), ,"ПериодС");
		Возврат;
	КонецЕсли;
	ИзменитьПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПоПриИзменении(Элемент)
	Если ПериодС > ПериодПо И ЗначениеЗаполнено(ПериодПо) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Дата начала периода больше даты окончания'"), ,"ПериодПо");
		Возврат;
	КонецЕсли;
	ИзменитьПериодНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьПериодНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("НачалоПериода", 	НачалоДня(ПериодС));
	Список.Параметры.УстановитьЗначениеПараметра("КонецПериода", 	КонецДня(ПериодПо));
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьВладельцаОВыборе(ТекущиеДанные)
	
	Результат = Новый Структура;
	Результат.Вставить("ПриходныйДокумент", ТекущиеДанные.Регистратор);
	Результат.Вставить("Валюта", ТекущиеДанные.Валюта);
	Результат.Вставить("Сумма", ?(ЗначениеЗаполнено(ТекущиеДанные.СуммаВВалюте), 0, ТекущиеДанные.Сумма));
	Результат.Вставить("СуммаВВалюте", ТекущиеДанные.СуммаВВалюте);
	Результат.Вставить("СуммаПоОтчету", ?(ЗначениеЗаполнено(ТекущиеДанные.СуммаВВалюте), 0, ТекущиеДанные.Сумма));
	Результат.Вставить("СуммаВВалютеПоОтчету", ТекущиеДанные.СуммаВВалюте);
	Результат.Вставить("ДокументДата", ТекущиеДанные.ДатаПервичногоДокумента);
	Результат.Вставить("ДокументНомер", ТекущиеДанные.НомерПервичногоДокумента);
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Грузоотправитель) И ЗначениеЗаполнено(ТекущиеДанные.ВидПервичногоДокумента) Тогда
		Результат.Вставить("КомуЗаЧто", ТекущиеДанные.Грузоотправитель + ", " + ТекущиеДанные.ВидПервичногоДокумента);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Грузоотправитель) Тогда
		Результат.Вставить("КомуЗаЧто", ТекущиеДанные.Грузоотправитель);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ВидПервичногоДокумента) Тогда
		Результат.Вставить("КомуЗаЧто", ТекущиеДанные.ВидПервичногоДокумента);
	КонецЕсли;
	
	ОповеститьОВыборе(Результат);
	
КонецПроцедуры

#КонецОбласти
