
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;
		
		Если НЕ Объект.Дата = КонецГода(Объект.Дата) И ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода) Тогда
			Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка");
		КонецЕсли;
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	УчетРасчетов.УстановитьУсловноеОформлениеСчетаИДопСубконтоРасчетов(
		УсловноеОформление, "Начисления");
		
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.ВидМежотчетногоПериода = ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса");
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	НачисленияЗаполнитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ОтразитьВМежотчетномПериоде", ОтразитьВМежотчетномПериоде);
	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ ЭтотОбъект.КэшПараметров.Локальные.ОтразитьВМежотчетномПериоде <> ОтразитьВМежотчетномПериоде Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
		УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	
	Если ОтразитьВМежотчетномПериоде Тогда
		Объект.Дата = КонецГода(Объект.Дата);
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	Иначе
		БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
			ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ПустаяСсылка"));
	КонецЕсли;
	
	ОтразитьВМежотчетномПериодеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьВМежотчетномПериодеПриИзмененииНаСервере()
	
	// Может измениться дата определения параметров учетной политики.
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьВидимостьФлагаАннулироватьПлановыеПоступленияОплаты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугПриИзменении(Элемент)
	
	Если ВидУслуг = 0 Тогда
		Объект.НачислениеЗаПрочиеУслуги = Ложь;
		Объект.НачислениеЗаУслугу = Неопределено;
	Иначе
		Объект.НачислениеЗаПрочиеУслуги = Истина;
	КонецЕсли;
	
	УстановитьДоступностьНачисленияЗаПрочиеУслуги(ЭтотОбъект);
	
	Если Объект.Начисления.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВидУслугПриИзмененииЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Документ уже заполнен. Очистить список начислений?'"); 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУслугПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Объект.Начисления.Очистить();
		Объект.ПорядокОплаты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеЗаУслугуПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.НачислениеЗаУслугу) Тогда
		НачислениеЗаУслугуПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачислениеЗаУслугуПриИзмененииНаСервере()
	
	ПараметрыНачисленияЗаУслугу = РаботаСоСтудентами.ПараметрыНачисленийЗаПрочиеУслуги(Объект.НачислениеЗаУслугу);
	Объект.Номенклатура = ПараметрыНачисленияЗаУслугу.Номенклатура;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(Объект.Номенклатура,
		Объект.Организация, Объект.Дата);
	
	Для Каждого СтрокаНачисления Из Объект.Начисления Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаНачисления.Количество) Тогда
			СтрокаНачисления.Количество = 1;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдиницаИзмерения) Тогда
			СтрокаНачисления.ЕдиницаИзмерения = ДанныеНоменклатуры.ЕдиницаИзмерения;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеНоменклатуры.СтавкаНДС) Тогда
			СтрокаНачисления.СтавкаНДС = ДанныеНоменклатуры.СтавкаНДС;
		КонецЕсли;
		РасчитатьСтроку(СтрокаНачисления, Объект.СуммаВключаетНДС, "СтавкаНДС");
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КПСПриИзменении(Элемент)
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(Объект.КПС, Объект.КЭК); 
КонецПроцедуры

&НаКлиенте
Процедура КЭКПриИзменении(Элемент)
	
	ОтборПустойСчетРасчетов = Новый Структура("СчетРасчетов",
		ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка"));
	СтрокиПустойСчетРасчетов = Объект.Начисления.НайтиСтроки(ОтборПустойСчетРасчетов);
	
	ЕстьСтрокиСЗаполненнымиСчетамиРасчетов = (Объект.Начисления.Количество() <> СтрокиПустойСчетРасчетов.Количество());
	Если ЕстьСтрокиСЗаполненнымиСчетамиРасчетов Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросПерезаполнитьСчетаРасчетовЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Перезаполнить счета расчетов?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьСчетаРасчетовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПерезаполнитьСчетаРасчетовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьСчетаРасчетовНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаРасчетовНаСервере()
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	Для Каждого СтрокаНачисления Из Объект.Начисления Цикл
		СтрокаНачисления.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
			Объект.КЭК, "205.00",, НаДату, Объект.Организация, Объект.ИФО);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьВалютаНДСНажатие(Элемент, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт

	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.СуммаВключаетНДС <> Объект.СуммаВключаетНДС Тогда
		ПересчитатьСуммаВключаетНДС();
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПризнанияДоходовПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтотОбъект, Объект, "СчетДоходов");
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоходовНУПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Начисления

&НаКлиенте
Процедура НачисленияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	Если НЕ Отказ И ТекущиеДанные.ОсобыйПорядокОплаты Тогда
		// Удаляем строки особого графика из табличной части.
		ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
		ОсобыйГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
		Для Каждого СтрокаГрафика Из ОсобыйГрафикОплаты Цикл
			Объект.ПорядокОплаты.Удалить(Объект.ПорядокОплаты.Индекс(СтрокаГрафика));
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСтудентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НаДату", Объект.Дата);
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Отбор.Вставить("Факультет", Объект.Подразделение);
	КонецЕсли;
	
	ПараметрыАвтоподстановки = ПараметрыАвтоподстановкиДанныхПоСтуденту(ТекущиеДанные.Студент, ВидУслуг, Отбор);
	
	Если ПараметрыАвтоподстановки.Договоры.Количество() = 1 Тогда
		ТекущиеДанные.Договор = ПараметрыАвтоподстановки.Договоры[0]; // Единственный доступный вариант.
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Договор) И ПараметрыАвтоподстановки.Договоры.Найти(ТекущиеДанные.Договор) = Неопределено Тогда
		ТекущиеДанные.Договор = Неопределено; // Выбранный договор отсутствует среди доступных.
	КонецЕсли;
	Если ПараметрыАвтоподстановки.Плательщики.Количество() = 1 Тогда
		ТекущиеДанные.Контрагент = ПараметрыАвтоподстановки.Плательщики[0]; // Единственный доступный вариант.
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Контрагент) И ПараметрыАвтоподстановки.Плательщики.Найти(ТекущиеДанные.Контрагент) = Неопределено Тогда
		ТекущиеДанные.Контрагент = Неопределено; // Выбранный контрагент отсутствует среди доступных.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Количество");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Цена");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСуммаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВсегоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, Объект.СуммаВключаетНДС, "Всего");
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСчетРасчетовПриИзменении(Элемент)
	
	НачисленияСчетРасчетовПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НачисленияСчетРасчетовПриИзмененииНаСервере()
	
	ДанныеСтроки = Объект.Начисления.НайтиПоИдентификатору(Элементы.Начисления.ТекущаяСтрока);
	
	ДанныеСтроки.ДопСубконтоРасчетов = Неопределено;
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(ДанныеСтроки,
		Объект.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДопСубконтоРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ДопСубконтоРасчетовВид) Тогда
		ПараметрыВыбораДопСубконто = Новый Структура;
		ПараметрыВыбораДопСубконто.Вставить("Организация",   Объект.Организация);
		ПараметрыВыбораДопСубконто.Вставить("Счет",          ТекущиеДанные.СчетРасчетов);
		ПараметрыВыбораДопСубконто.Вставить("НомерСубконто", ТекущиеДанные.ДопСубконтоРасчетовНомер);
		ПараметрыВыбораДопСубконто.Вставить("Субконто" + ТекущиеДанные.ДопСубконтоРасчетовНомер, ТекущиеДанные.ДопСубконтоРасчетов);
		БухгалтерскийУчетКлиент.ПриНачалеВыбораСубконто(Элемент, ДанныеВыбора, СтандартнаяОбработка, ПараметрыВыбораДопСубконто);
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачисленияЗаполнитьДобавленныеКолонки()
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	
	Для Каждого СтрокаТаблицы Из Объект.Начисления Цикл
		
		УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(СтрокаТаблицы,
			Объект.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ПорядокОплаты

&НаКлиенте
Процедура РежимВводаГрафикаОплатыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ПорядокОплаты.ТекущиеДанные;
	
	Если ТекущиеДанные.НачалоПериода > ТекущиеДанные.КонецПериода Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Дата начала периода превышает дату окончания!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.ПорядокОплаты.Сортировать("ИдентификаторСтроки,ОплатитьДо");
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОплатыПослеУдаления(Элемент)
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОсобыйПорядокОплаты

&НаКлиенте
Процедура НачисленияОсобыйПорядокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачислениеИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
	НачислениеОсобыйПорядокОплаты = ТекущиеДанные.ОсобыйПорядокОплаты;
	
	Если НачислениеОсобыйПорядокОплаты Тогда
		НачислениеРежимВводаГрафикаОплаты = ТекущиеДанные.РежимВводаОсобогоГрафикаОплаты;
	Иначе
		НачислениеРежимВводаГрафикаОплаты = Объект.РежимВводаГрафикаОплаты;
	КонецЕсли;
	
	Элементы.НачислениеПредставление.Заголовок =
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1, %2 %3'"),
			ТекущиеДанные.Студент,
			ТекущиеДанные.Всего,
			Объект.ВалютаДокумента);
	
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект, ТекущиеДанные.ИдентификаторСтроки);
	
	УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("НачисленияОсобыйПорядокУстановитьОтборВТаблице", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеОсобыйПорядокОплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	ТекущиеДанные.ОсобыйПорядокОплаты = НачислениеОсобыйПорядокОплаты;
	
	Если НачислениеОсобыйПорядокОплаты Тогда // Установили особый порядок оплаты.
		
		// Начисления с особым порядком оплаты маркируем уникальным идентификатором.
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		
		// Добавляем строки особого графика в табличную часть.
		ОтборПоПустомуИдентификатору = Новый Структура("ИдентификаторСтроки",
			Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		ОбщийГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоПустомуИдентификатору);
		Для Каждого СтрокаГрафика Из ОбщийГрафикОплаты Цикл
			НоваяСтрока = Объект.ПорядокОплаты.Добавить();
			НоваяСтрока.ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГрафика,
				"ОплатитьДо,СуммаПроцент,НачалоПериода,КонецПериода,Примечание");
		КонецЦикла;
		
	Иначе // Отменили особый порядок оплаты.
		
		// Удаляем строки особого графика из табличной части.
		ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
		ОсобыйГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
		Для Каждого СтрокаГрафика Из ОсобыйГрафикОплаты Цикл
			Объект.ПорядокОплаты.Удалить(Объект.ПорядокОплаты.Индекс(СтрокаГрафика));
		КонецЦикла;
		
		// Очистили уникальный идентификатор в строке начисления.
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
		
	КонецЕсли;
	
	// Восстановили общий режим ввода графика оплаты.
	НачислениеРежимВводаГрафикаОплаты = Объект.РежимВводаГрафикаОплаты;
	
	УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
	НачисленияОсобыйПорядокУстановитьОтборВТаблице();
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеРежимВводаГрафикаОплатыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	ТекущиеДанные.РежимВводаОсобогоГрафикаОплаты = НачислениеРежимВводаГрафикаОплаты;
	
	УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
		ТекущиеНачисление = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
		Если ТекущиеНачисление = Неопределено Тогда
			Отказ = Истина;
		Иначе
			ТекущиеДанные.ИдентификаторСтроки = ТекущиеНачисление.ИдентификаторСтроки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	
	Если ТекущиеДанные.НачалоПериода > ТекущиеДанные.КонецПериода Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Дата начала периода превышает дату окончания!'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.ПорядокОплаты.Сортировать("ИдентификаторСтроки,ОплатитьДо");
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект, ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйПорядокОплатыПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект, ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьУчащимися(Команда)
	
	Отказ = Ложь;
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Организация",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Факультет'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Подразделение",, Отказ);
	КонецЕсли;
	
	Если Объект.НачислениеЗаПрочиеУслуги И Не ЗначениеЗаполнено(Объект.НачислениеЗаУслугу) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Вид начисления за прочие услуги'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.НачислениеЗаУслугу",, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ИмяМакета = ?(Объект.НачислениеЗаПрочиеУслуги, "ПодборПоНачислениюЗаПрочиеУслуги", "ПодборСПлательщиком");
		
		Если Объект.Начисления.Количество() > 0 Тогда
			ДопПараметры = Новый Структура("ИмяМакета", ИмяМакета);
			
			ТекстВопроса = НСтр("ru='Документ уже заполнен, выберите необходимое действие:'"); 
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить("Перезаполнить", "Перезаполнить документ");
			СписокКнопок.Добавить("Добавить", "Добавить по отбору");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
			
			Оповещение = Новый ОписаниеОповещения("ОбработкаВопросаПередЗаполнением", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, , КодВозвратаДиалога.Отмена);
		Иначе
			ВызватьОкноОтбора(ИмяМакета);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуНачисления(Команда)
	
	Подсказка = НСтр("ru='Введите сумму начисления:'");
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьСуммуНачисленияЗавершение", ЭтотОбъект);
	ПоказатьВводЧисла(Оповещение, 0, Подсказка, 15, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуНачисленияЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.Начисления.ВыделенныеСтроки Цикл
			СтрокаНачисления = Объект.Начисления.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаНачисления.Всего = Результат;
			РасчитатьСтроку(СтрокаНачисления, Объект.СуммаВключаетНДС, "Всего");
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьПоГрафикамОплаты(Команда)
	
	СтатусВозможноЗаполнить = РассчитатьПоГрафикамОплатыВозможно();
	Если СтатусВозможноЗаполнить.Отказ Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(СтатусВозможноЗаполнить.ЗадатьВопрос) Тогда
		Оповещение = Новый ОписаниеОповещения("РассчитатьПоГрафикамОплатыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, СтатусВозможноЗаполнить.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		РассчитатьПоГрафикамОплатыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьПоГрафикуОплатыПрочиеУслуги(Команда)
	
	Отказ = РассчитатьПоГрафикуОплатыПрочихУслуг();
	
	Если Отказ Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не указан график оплаты для вида начислений за прочие услуги ""%1""'"),
				Объект.НачислениеЗаУслугу);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.НачислениеЗаУслугу");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьПоГрафикуОплаты(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РассчитатьСтоимостьПоГрафикуОплатыЗавершение", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Выберите график оплаты", Тип("СправочникСсылка.ГрафикиОплатыОбразование"));
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьПоСтавкамОплаты(Команда)
	
	СтатусВозможноЗаполнить = РассчитатьПоСтавкамОплатыВозможно();
	Если СтатусВозможноЗаполнить.Отказ Тогда
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(СтатусВозможноЗаполнить.ЗадатьВопрос) Тогда
		Оповещение = Новый ОписаниеОповещения("РассчитатьПоСтавкамОплатыЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, СтатусВозможноЗаполнить.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		РассчитатьПоСтавкамОплатыНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтоимостьПоСтавкеОплаты(Команда)
	
	Оповещение = Новый ОписаниеОповещения("РассчитатьСтоимостьПоСтавкеОплатыЗавершение", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Выберите ставку оплаты", Тип("СправочникСсылка.СтавкиОплатыОбразование"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбщийПорядокОплатыИзШаблона(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Выберите график оплаты", Тип("СправочникСсылка.ГрафикиОплатыОбразование"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОсобыйПорядокОплатыИзШаблона(Команда)
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Выберите график оплаты", Тип("СправочникСсылка.ГрафикиОплатыОбразование"));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОбщийПорядокОплатыВШаблон(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Оповещение = Новый ОписаниеОповещения("СохранитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Введите наименование графика оплаты", Тип("Строка"));
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьОсобыйПорядокОплатыВШаблон(Команда)
	
	ТекущиеДанные = Элементы.ОсобыйПорядокОплаты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	
	Оповещение = Новый ОписаниеОповещения("СохранитьШаблонГрафикаОплатыЗавершение", ЭтотОбъект, ДопПараметры);
	ПоказатьВводЗначения(Оповещение, Неопределено, "Введите наименование графика оплаты", Тип("Строка"));
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ИспользоватьКонтрольИсполненияДоговоров = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	
	ВидУслуг = ?(Объект.НачислениеЗаПрочиеУслуги, 1, 0);
	
	// Отбор строк на странице "Общий порядок оплаты".
	Элементы.ПорядокОплаты.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки",
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
	Элементы.СпособПризнанияДоходов.ПараметрыВыбора =
		Перечисления.СпособыПризнанияРасходов.ПараметрыВыбораСпособаПризнанияДоходов(Перечисления.ВидыОперацийНачисленияДБП.ДолгосрочныйДоговорОбразование);
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	НачисленияЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
	УстановитьВидимостьЭлементовНалоговогоУчета(ЭтотОбъект);
	
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	
	УстановитьВидимостьФлагаАннулироватьПлановыеПоступленияОплаты(ЭтотОбъект);
	УстановитьДоступностьНачисленияЗаПрочиеУслуги(ЭтотОбъект);
	УстановитьДоступностьПодразделения(ЭтотОбъект);
	УстановитьЗаголовкиИДоступностьСубконто(ЭтотОбъект, Объект, "СчетДоходов");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОсобыйПорядокПризнанияДоходовТекущегоПериода =
		(Объект.СпособПризнанияДоходов = ПредопределенноеЗначение("Перечисление.СпособыПризнанияРасходов.ВОсобомПорядке"));
	ПризнаниеДоходовТекущегоПериодаПоГрафику =
		(Объект.СпособПризнанияДоходов = ПредопределенноеЗначение("Перечисление.СпособыПризнанияРасходов.ПоГрафику"));
	
	СрокСписания = Новый Массив;
	СрокСписания.Добавить("ДатаНачалаСписания");
	СрокСписания.Добавить("ДатаОкончанияСписания");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		СрокСписания, "Видимость", НЕ ПризнаниеДоходовТекущегоПериодаПоГрафику);
	
	Если ОсобыйПорядокПризнанияДоходовТекущегоПериода Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "ОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "АвтоОтметкаНезаполненного", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "ОтметкаНезаполненного", Ложь);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаНачалаСписания", "ОтметкаНезаполненного", Не ЗначениеЗаполнено(Объект.ДатаНачалаСписания));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "АвтоОтметкаНезаполненного", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ДатаОкончанияСписания", "ОтметкаНезаполненного", Не ЗначениеЗаполнено(Объект.ДатаОкончанияСписания));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаГрафикПризнанияДоходовПредупреждение",
		"Видимость", ПризнаниеДоходовТекущегоПериодаПоГрафику И НЕ Форма.ИспользоватьКонтрольИсполненияДоговоров);
	
	Если ПризнаниеДоходовТекущегоПериодаПоГрафику Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'Доходы будущих периодов относятся на финансовый результат текущего периода согласно графику, установленному на закладке ""Общий (особый) порядок оплаты"".'"));
	ИначеЕсли ОсобыйПорядокПризнанияДоходовТекущегоПериода Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'Суммы списания доходов будущих периодов указываются вручную в документе начисления доходов текущего периода.'"));
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПараметрыСписания", "Подсказка",
			НСтр("ru = 'В течение указанного срока доходы будущих периодов относятся на финансовый результат текущего периода.'"));
	КонецЕсли;
	
	Если Объект.РежимВводаГрафикаОплаты = 0 Тогда // В абсолютных величинах.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГрафикОплатыСуммаПроцент", "Заголовок", НСтр("ru = 'Сумма'"));
	Иначе // В относительных величинах.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ГрафикОплатыСуммаПроцент", "Заголовок", НСтр("ru = '%, доля'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовОсобыйПорядокОплаты(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Форма.НачислениеРежимВводаГрафикаОплаты = 0 Тогда // В абсолютных величинах.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ОсобыйПорядокОплатыСуммаПроцент", "Заголовок", НСтр("ru = 'Сумма'"));
	Иначе // В относительных величинах.
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ОсобыйПорядокОплатыСуммаПроцент", "Заголовок", НСтр("ru = '%, доля'"));
	КонецЕсли;
	
	ЭлементыОсобыйПорядокОплаты = Новый Массив;
	ЭлементыОсобыйПорядокОплаты.Добавить("НачислениеРежимВводаГрафикаОплаты");
	ЭлементыОсобыйПорядокОплаты.Добавить("ОсобыйПорядокОплаты");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыОсобыйПорядокОплаты, "Доступность", Форма.НачислениеОсобыйПорядокОплаты);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовНалоговогоУчета(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ОтражатьВНалоговомУчете = НалоговыйУчетКлиентСервер.ВедетсяНалоговыйУчетПоКФО(Объект.КФО)
		И Форма.КэшПараметров.УчетнаяПолитика.ПлательщикНалогаНаПрибыль;
	ОтражатьВНалоговомУчетеУСН = УчетУСНКлиентСервер.ВедетсяУчетУСНпоКФО(Объект.КФО)
		И (Форма.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходы
		ИЛИ Форма.КэшПараметров.УчетнаяПолитика.ПрименяетсяУСНДоходыМинусРасходы);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаНалоговыйУчет", "Видимость", ОтражатьВНалоговомУчете ИЛИ ОтражатьВНалоговомУчетеУСН);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаБухгалтерскийУчет", "ОтображатьЗаголовок", ОтражатьВНалоговомУчете ИЛИ ОтражатьВНалоговомУчетеУСН);
	
	ЭтоПрочиеДоходы = БухгалтерскийУчетКлиентСервер.СчетВИерархии(Объект.СчетДоходовНУ, "Н91.01");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"СтатьяПрочихДоходовНУ", "Видимость", ЗначениеЗаполнено(Объект.СчетДоходовНУ) И ЭтоПрочиеДоходы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьФлагаАннулироватьПлановыеПоступленияОплаты(Форма)
	
	// При переходе на СГС "Долгосрочные договоры" может потребоваться аннулировать
	// действующие плановые поступления оплаты по студентам, которые зачислены до 2020 г.
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"АннулироватьПлановыеПоступленияОплаты", "Видимость", Форма.ОтразитьВМежотчетномПериоде);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьНачисленияЗаПрочиеУслуги(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НачислениеЗаУслугу", "Доступность", Форма.ВидУслуг <> 0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НачисленияРассчитатьСтоимостьПоГрафикамОплаты", "Видимость", Форма.ВидУслуг = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НачисленияРассчитатьСтоимостьПоГрафикуОплатыПрочиеУслуги", "Видимость", Форма.ВидУслуг <> 0);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияОсобыйПорядокУстановитьОтборВТаблице()
	
	ТекущиеДанные = Элементы.НачисленияОсобыйПорядок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки",
			Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Иначе
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки",
			ТекущиеДанные.ИдентификаторСтроки);
	КонецЕсли;
	
	ТекущийОтборСтрок = Элементы.ОсобыйПорядокОплаты.ОтборСтрок;
	Если ТекущийОтборСтрок = Неопределено
	 ИЛИ ТекущийОтборСтрок.ИдентификаторСтроки <> НовыйОтборСтрок.ИдентификаторСтроки Тогда
		Элементы.ОсобыйПорядокОплаты.ОтборСтрок = НовыйОтборСтрок;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РассчитатьИтоговуюСуммуОплатыПоГрафику(Форма, ИдентификаторСтроки)
	
	Объект = Форма.Объект;
	
	ОтборСтрок = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	ОбщийГрафикОплаты = Объект.ПорядокОплаты.НайтиСтроки(ОтборСтрок);
	
	ИтогСуммаОплатыПоГрафику = 0;
	Для Каждого СтрокаГрафика Из ОбщийГрафикОплаты Цикл
		ИтогСуммаОплатыПоГрафику = ИтогСуммаОплатыПоГрафику + СтрокаГрафика.СуммаПроцент;
	КонецЦикла;
	
	Возврат ИтогСуммаОплатыПоГрафику;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВопросаПередЗаполнением(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = "Перезаполнить" Тогда
		Объект.Начисления.Очистить();
	КонецЕсли;
	
	ИмяМакета = ДопПараметры.ИмяМакета;
	
	ВызватьОкноОтбора(ИмяМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтбору(Результат, ДопПараметры) Экспорт
	
	Адреса = ДопПараметры.Адреса;
	ИмяМакета = ДопПараметры.ИмяМакета;
	
	Если Результат <> Неопределено Тогда
		
		Адреса.НастройкиКомпоновкиДанных = Результат;
		ЗаполнитьУчащимисяСервер(Адреса);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьОкноОтбора(ИмяМакета)
	
	Адреса = РаботаСоСтудентамиВызовСервера.ПолучитьАдресаСКДПодбора(ИмяМакета, УникальныйИдентификатор);
	
	ПараметрыФормы = РаботаСоСтудентамиКлиент.ПараметрыФормыУпрощеннойНастройкиСхемыКомпоновкиДанных(Адреса, УникальныйИдентификатор);
	ПараметрыФормы.Заголовок = СтрШаблон(НСтр("ru = 'Настройка параметров отбора учащихся (значения на %1)'"), Формат(Объект.Дата, "ДЛФ=DD"));
	
	ДопПараметры = Новый Структура("Адреса, ИмяМакета", Адреса, ИмяМакета);
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоОтбору", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных", ПараметрыФормы, ЭтаФорма, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчащимисяСервер(Адреса)
	
	ДанныеУчащихся = РаботаСоСтудентами.ПолучитьДанныеПодбораУчащихся(Адреса, Объект.Организация, Объект.Подразделение, Объект.Дата,
		?(Объект.НачислениеЗаПрочиеУслуги, Объект.НачислениеЗаУслугу, Неопределено) );
	
	ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(Объект.Номенклатура,
		Объект.Организация, Объект.Дата);
	
	НаДату = ?(ЗначениеЗаполнено(Объект.ВидМежотчетногоПериода), КонецГода(Объект.Дата) + 1, Объект.Дата);
	
	Для каждого СтрокаТаблицы Из ДанныеУчащихся Цикл
		
		НоваяСтрока = Объект.Начисления.Добавить();
		НоваяСтрока.Студент    = СтрокаТаблицы.Студент;
		НоваяСтрока.Контрагент = СтрокаТаблицы.Контрагент;
		НоваяСтрока.Договор    = СтрокаТаблицы.ДоговорКонтрагента;
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Количество) Тогда
			НоваяСтрока.Количество = 1;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеНоменклатуры.ЕдиницаИзмерения) Тогда
			НоваяСтрока.ЕдиницаИзмерения = ДанныеНоменклатуры.ЕдиницаИзмерения;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеНоменклатуры.СтавкаНДС) Тогда
			НоваяСтрока.СтавкаНДС = ДанныеНоменклатуры.СтавкаНДС;
		КонецЕсли;
		РасчитатьСтроку(НоваяСтрока, Объект.СуммаВключаетНДС, "СтавкаНДС");
		
		УчетРасчетов.ЗаполнитьПараметрыСчетаИДопСубконтоРасчетов(НоваяСтрока,
			Объект.КЭК, "205.00", НаДату, Объект.Организация, Объект.ИФО);
		
	КонецЦикла;
	
	Если Объект.НачислениеЗаПрочиеУслуги Тогда
		РассчитатьПоГрафикуОплатыПрочихУслуг();
	Иначе
		РассчитатьПоГрафикамОплатыНаСервере();
	КонецЕсли;
	
	УстановитьПредупреждение();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредупреждение()
	
	Если Объект.Начисления.Количество() > 0 Тогда
		
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.Подразделение.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		
	Иначе
		
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		Элементы.Подразделение.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		
	КонецЕсли; 
	
КонецПроцедуры

// Расчет по графикам оплаты.

&НаКлиенте
Функция РассчитатьПоГрафикамОплатыВозможно()
	
	СтатусВозможноЗаполнить = Новый Структура;
	СтатусВозможноЗаполнить.Вставить("Отказ", Ложь);
	СтатусВозможноЗаполнить.Вставить("ЗадатьВопрос", Ложь); // Запросить подтверждение перед перезаполнением.
	СтатусВозможноЗаполнить.Вставить("ТекстВопроса",
		НСтр("ru = 'Рассчитать суммы начислений по графикам оплаты?'") );
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.Организация",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО И Не ЗначениеЗаполнено(Объект.ИФО) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'ИФО'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.ИФО",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Факультет'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.Подразделение",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Валюта'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.ВалютаДокумента",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если Объект.Начисления.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Список студентов на закладке ""Начисления"" пуст. Сначала заполните список студентов.'"),,,,
			СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если СтатусВозможноЗаполнить.Отказ Тогда
		Возврат СтатусВозможноЗаполнить;
	КонецЕсли;
	
	ЕстьДанныеВДокументе = (Объект.ПорядокОплаты.Количество() > 0);
	Если ЕстьДанныеВДокументе Тогда
		СтатусВозможноЗаполнить.ТекстВопроса = СтатусВозможноЗаполнить.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Данные на закладках ""Общий порядок оплаты"" и ""Особый порядок оплаты"" будут очищены.'");
		СтатусВозможноЗаполнить.ЗадатьВопрос = Истина;
	КонецЕсли;
	
	Возврат СтатусВозможноЗаполнить;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСтоимостьПоГрафикуОплатыЗавершение(ВыбранныйГрафикОплаты, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйГрафикОплаты) Тогда
		РассчитатьПоГрафикамОплатыНаСервере(ВыбранныйГрафикОплаты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоГрафикамОплатыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПоГрафикамОплатыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоГрафикамОплатыНаСервере(ГрафикОплаты = Неопределено);
	
	Документы.НачислениеДоходовБудущихПериодовОбразование.РассчитатьПоГрафикамОплаты(Объект, ГрафикОплаты);
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
КонецПроцедуры

&НаСервере
Функция РассчитатьПоГрафикуОплатыПрочихУслуг();
	
	Отказ = Ложь;
	
	ПараметрыНачисленияЗаУслугу = РаботаСоСтудентами.ПараметрыНачисленийЗаПрочиеУслуги(Объект.НачислениеЗаУслугу, КонецДня(Объект.Дата));
	Если ЗначениеЗаполнено(ПараметрыНачисленияЗаУслугу.ГрафикОплаты) Тогда
		РассчитатьПоГрафикамОплатыНаСервере(ПараметрыНачисленияЗаУслугу.ГрафикОплаты);
	Иначе // График оплаты не задан для указанного начисления.
		Отказ = Истина;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьШаблонГрафикаОплатыЗавершение(ВыбранныйГрафикОплат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйГрафикОплат) Тогда
		
		ИтоговаяСуммаПоГрафику = ЗагрузитьШаблонГрафикаОплатыНаСервере(ВыбранныйГрафикОплат, ДопПараметры.ИдентификаторСтроки);
		
		Если НЕ ЗначениеЗаполнено(ДопПараметры.ИдентификаторСтроки) Тогда // Общий порядок оплаты.
			УстановитьВидимостьЭлементов(ЭтотОбъект);
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Установить сумму корректировки доходов будущих периодов %1 для учащихся с общим порядком оплаты?'"),
				Формат(ИтоговаяСуммаПоГрафику, "ЧЦ=15;ЧДЦ=2"));
		Иначе // Особый порядок оплаты.
			УстановитьВидимостьЭлементовОсобыйПорядокОплаты(ЭтотОбъект);
			ТекстВопроса = СтрШаблон(НСтр("ru = 'Установить сумму корректировки доходов будущих периодов %1 для выбранного учащегося?'"),
				Формат(ИтоговаяСуммаПоГрафику, "ЧЦ=15;ЧДЦ=2"));
		КонецЕсли;
		
		ДопПараметры.Вставить("ИтоговаяСуммаПоГрафику", ИтоговаяСуммаПоГрафику);
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьСуммуПоГрафикуОплатЗавершение", ЭтотОбъект, ДопПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьШаблонГрафикаОплатыНаСервере(ВыбранныйГрафикОплат, ИдентификаторСтроки)
	
	ОсобыйПорядокОплаты = ЗначениеЗаполнено(ИдентификаторСтроки);
	
	// Удаляем строки по выбранному идентификатору из табличной части.
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	СтрокиПоИдентификатору = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаГрафика Из СтрокиПоИдентификатору Цикл
		Объект.ПорядокОплаты.Удалить(Объект.ПорядокОплаты.Индекс(СтрокаГрафика));
	КонецЦикла;
	
	// Заполняем график оплат по выбранному графику оплат.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГрафикиОплатыОбразование.Ссылка КАК Ссылка,
	|	ГрафикиОплатыОбразование.Валюта КАК Валюта,
	|	ГрафикиОплатыОбразование.РежимВводаГрафикаОплаты КАК РежимВводаГрафикаОплаты,
	|	ГрафикиОплатыОбразование.ПорядокОплаты.(
	|		НомерСтроки КАК НомерСтроки,
	|		ОплатитьДо КАК ОплатитьДо,
	|		СуммаПроцент КАК СуммаПроцент,
	|		НачалоПериода КАК НачалоПериода,
	|		КонецПериода КАК КонецПериода,
	|		Примечание КАК Примечание
	|	) КАК ПорядокОплаты
	|ИЗ
	|	Справочник.ГрафикиОплатыОбразование КАК ГрафикиОплатыОбразование
	|ГДЕ
	|	ГрафикиОплатыОбразование.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОплатитьДо,
	|	НачалоПериода,
	|	КонецПериода";
	Запрос.УстановитьПараметр("Ссылка", ВыбранныйГрафикОплат);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ОсобыйПорядокОплаты Тогда // Общий порядок оплаты.
			Объект.РежимВводаГрафикаОплаты = Выборка.РежимВводаГрафикаОплаты;
		Иначе // Особый порядок оплаты.
			ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
			СтрокиНачислений = Объект.Начисления.НайтиСтроки(ОтборПоИдентификатору);
			Если СтрокиНачислений.Количество() > 0 Тогда // Должна быть только одна строка с указанным мдентификатором.
				СтрокиНачислений[0].РежимВводаОсобогоГрафикаОплаты = Выборка.РежимВводаГрафикаОплаты;
				НачислениеРежимВводаГрафикаОплаты = Выборка.РежимВводаГрафикаОплаты;
			КонецЕсли;
		КонецЕсли;
		
		ВыборкаПорядокОплаты = Выборка.ПорядокОплаты.Выбрать();
		Пока ВыборкаПорядокОплаты.Следующий() Цикл
			НоваяСтрока = Объект.ПорядокОплаты.Добавить();
			НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПорядокОплаты,
				"ОплатитьДо,СуммаПроцент,НачалоПериода,КонецПериода,Примечание");
		КонецЦикла;
		
	КонецЦикла;
	
	Если ОсобыйПорядокОплаты Тогда
		ИтогСуммаОплатыПоОсобомуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
			ИдентификаторСтроки);
		Возврат ИтогСуммаОплатыПоОсобомуГрафику;
	Иначе
		ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
			Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
		Возврат ИтогСуммаОплатыПоОбщемуГрафику;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СохранитьШаблонГрафикаОплатыЗавершение(НаименованиеГрафикаОплаты, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(НаименованиеГрафикаОплаты) Тогда
		
		СохранитьШаблонГрафикаОплатыНаСервере(НаименованиеГрафикаОплаты, ДопПараметры.ИдентификаторСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьШаблонГрафикаОплатыНаСервере(НаименованиеГрафикаОплаты, ИдентификаторСтроки)
	
	ОсобыйПорядокОплаты = ЗначениеЗаполнено(ИдентификаторСтроки);
	
	ГрафикОплатОбъект = Справочники.ГрафикиОплатыОбразование.СоздатьЭлемент();
	ГрафикОплатОбъект.Наименование = НаименованиеГрафикаОплаты;
	
	Если НЕ ОсобыйПорядокОплаты Тогда // Общий порядок оплаты.
		ГрафикОплатОбъект.РежимВводаГрафикаОплаты = Объект.РежимВводаГрафикаОплаты;
	Иначе // Особый порядок оплаты.
		ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
		СтрокиНачислений = Объект.Начисления.НайтиСтроки(ОтборПоИдентификатору);
		Если СтрокиНачислений.Количество() > 0 Тогда // Должна быть только одна строка с указанным мдентификатором.
			СтрокиНачислений[0].РежимВводаОсобогоГрафикаОплаты = Объект.РежимВводаГрафикаОплаты;
			НачислениеРежимВводаГрафикаОплаты = Объект.РежимВводаГрафикаОплаты;
		КонецЕсли;
	КонецЕсли;
	
	Если ГрафикОплатОбъект.РежимВводаГрафикаОплаты = 0 Тогда
		ГрафикОплатОбъект.Валюта = Объект.ВалютаДокумента;
	КонецЕсли;
	
	// Сохраняем строки по выбранному идентификатору из табличной части.
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	СтрокиПоИдентификатору = Объект.ПорядокОплаты.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаГрафика Из СтрокиПоИдентификатору Цикл
		НоваяСтрока = ГрафикОплатОбъект.ПорядокОплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаГрафика,
			"ОплатитьДо,СуммаПроцент,НачалоПериода,КонецПериода,Примечание");
	КонецЦикла;
	
	Попытка
		ГрафикОплатОбъект.Записать();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Записан новый элемент ""%1"" справочника ""Графики оплат"" в разделе ""Платное обучение - Долгосрочные договоры"".'"), НаименованиеГрафикаОплаты);
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось записать новый элемент справочника ""Графики оплат (образование)"".'")
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

// Расчет по ставкам оплаты.

&НаКлиенте
Функция РассчитатьПоСтавкамОплатыВозможно()
	
	СтатусВозможноЗаполнить = Новый Структура;
	СтатусВозможноЗаполнить.Вставить("Отказ", Ложь);
	СтатусВозможноЗаполнить.Вставить("ЗадатьВопрос", Ложь); // Запросить подтверждение перед перезаполнением.
	СтатусВозможноЗаполнить.Вставить("ТекстВопроса",
		НСтр("ru = 'Рассчитать суммы начислений по ставкам оплаты?'") );
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.Организация",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО И Не ЗначениеЗаполнено(Объект.ИФО) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'ИФО'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.ИФО",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Факультет'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.Подразделение",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Валюта'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,
			"Объект.ВалютаДокумента",, СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если Объект.Начисления.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Список студентов на закладке ""Начисления"" пуст. Сначала заполните список студентов.'"),,,,
			СтатусВозможноЗаполнить.Отказ);
	КонецЕсли;
	Если СтатусВозможноЗаполнить.Отказ Тогда
		Возврат СтатусВозможноЗаполнить;
	КонецЕсли;
	
	ЕстьДанныеВДокументе = (Объект.ПорядокОплаты.Количество() > 0);
	Если ЕстьДанныеВДокументе Тогда
		СтатусВозможноЗаполнить.ТекстВопроса = СтатусВозможноЗаполнить.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Данные на закладках ""Общий порядок оплаты"" и ""Особый порядок оплаты"" будут очищены.'");
		СтатусВозможноЗаполнить.ЗадатьВопрос = Истина;
	КонецЕсли;
	
	Возврат СтатусВозможноЗаполнить;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСтоимостьПоСтавкеОплатыЗавершение(ВыбраннаяСтавка, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбраннаяСтавка) Тогда
		РассчитатьПоСтавкамОплатыНаСервере(ВыбраннаяСтавка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоСтавкамОплатыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПоСтавкамОплатыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоСтавкамОплатыНаСервере(СтавкаОплаты = Неопределено);
	
	Документы.НачислениеДоходовБудущихПериодовОбразование.РассчитатьПоСтавкамОплаты(Объект, СтавкаОплаты);
	
	ИтогСуммаОплатыПоОбщемуГрафику = РассчитатьИтоговуюСуммуОплатыПоГрафику(ЭтотОбъект,
		Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	
КонецПроцедуры

// Прочее.

&НаКлиенте
Процедура ЗаполнитьСуммуПоГрафикуОплатЗавершение(РезультатВопроса, ДопПараметры) Экспорт
	
	Если НЕ РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОтборПоИдентификатору = Новый Структура("ИдентификаторСтроки", ДопПараметры.ИдентификаторСтроки);
	НайденныеСтроки = Объект.Начисления.НайтиСтроки(ОтборПоИдентификатору);
	Для Каждого СтрокаДокумента Из НайденныеСтроки Цикл
		СтрокаДокумента.Всего = ДопПараметры.ИтоговаяСуммаПоГрафику;
		РасчитатьСтроку(СтрокаДокумента, Объект.СуммаВключаетНДС, "Всего");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммаВключаетНДС()
	
	Для каждого ТекУслуга Из Объект.Начисления Цикл
		РасчитатьСтроку(ТекУслуга, Объект.СуммаВключаетНДС, "Сумма");
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатуры(Номенклатура, Организация, Дата)
	
	СтруктураДанных = Новый Структура("ЕдиницаИзмерения,СтавкаНДС");
	ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, СтруктураДанных);
	Возврат ДанныеНоменклатуры;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	ПараметрыРасчета.Вставить("РассчитыватьЦену", Истина);
	
	// Расчет реквизитов "Цена", "Сумма", "СуммаНДС", "Всего".
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьПодразделения(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Объект, ИмяРеквизитаСчет)
	Перем МассивПолей;
	
	Если ИмяРеквизитаСчет = "СчетДоходов" Тогда
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто1", "СубконтоДоходов1", "СубконтоДоходов1", Истина, "СубконтоДоходов1", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто2", "СубконтоДоходов2", "СубконтоДоходов2", Истина, "СубконтоДоходов2", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто3", "СубконтоДоходов3", "СубконтоДоходов3", Истина, "СубконтоДоходов3", Истина, Истина, Истина);
		БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(Объект.СчетДоходов, Форма, Объект, МассивПолей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	
	ПараметрыПредставления = Новый Структура("ВалютаДокумента, СуммаВключаетНДС");
	ЗаполнитьЗначенияСвойств(ПараметрыПредставления, Объект);
	ПараметрыПредставления.Вставить("ПоказыватьТипЦены", Ложь);
	ПараметрыПредставления.Вставить("ПоказыватьНДС", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьВалюту", Форма.КэшПараметров.ИспользоватьВалютныйУчет);
	
	Форма.НадписьВалютаНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыАвтоподстановкиДанныхПоСтуденту(Студент, ВидУслуг, Отбор)
	
	Если ВидУслуг = 0 Тогда
		Возврат РаботаСоСтудентами.ПараметрыАвтоподстановкиДанныхПоСтуденту(Студент, "ОбразовательныеУслуги", Отбор);
	Иначе
		Возврат РаботаСоСтудентами.ПараметрыАвтоподстановкиДанныхПоСтуденту(Студент, "ПрочиеУслуги", Отбор);
	КонецЕсли;
	
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
