
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокКолонок.Отбор,
													"Владелец",
													Объект.Ссылка,
													ВидСравненияКомпоновкиДанных.Равно,
													,
													Истина,
													РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
													
	Если ЗначениеЗаполнено(Объект.ИдентификаторДокумента)
		И Объект.ПредопределеннаяТабличнаяЧасть Тогда
		ЗаполнитьСписокТабличныхЧастейОбъекта();	
	КонецЕсли;
	ПереключательПредопределеннаяТабличнаяЧасть = ?(Объект.ПредопределеннаяТабличнаяЧасть, 1, 0);
	ЭтоНовый = Объект.Ссылка.Пустая();
	ИдентификаторТипаДокументы = ОбщегоНазначенияБГУПовтИсп.СсылкаИдентификатораОбъектаМетаданных("Документы");
	Элементы.ИдентификаторДокумента.ПараметрыВыбора = Новый ФиксированныйМассив(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Новый ПараметрВыбора("Отбор.Ссылка", БухгалтерскийУчетПовтИсп.ВидыДокументовРегистраторовРБ())));
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Элементы.ИдентификаторДокумента.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Элементы.ИдентификаторДокумента.ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьНаименованиеТабличнойЧасти();
	УстановитьВариантТабличнойЧасти();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец ЗапретРедактированияРеквизитовОбъектов
	
	Если ЭтоНовый Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокКолонок.Отбор,
													"Владелец",
													Объект.Ссылка,
													ВидСравненияКомпоновкиДанных.Равно,
													,
													Истина,
													РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		ЭтоНовый = Ложь;
	КонецЕсли;	
	
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК Поле1
	               |ИЗ
	               |	Справочник.ДополнительныеТабличныеЧастиДокументов КАК ДополнительныеТабличныеЧастиДокументов
	               |ГДЕ
	               |	ДополнительныеТабличныеЧастиДокументов.ИдентификаторДокумента = &ИдентификаторДокумента
	               |	И ДополнительныеТабличныеЧастиДокументов.Ссылка <> &Ссылка
	               |	И НЕ ДополнительныеТабличныеЧастиДокументов.ПометкаУдаления
	               |	И ДополнительныеТабличныеЧастиДокументов.ИмяТабличнойЧасти Подобно &ИмяТабличнойЧасти";
	Запрос.УстановитьПараметр("ИдентификаторДокумента",	Объект.ИдентификаторДокумента);				   
	Запрос.УстановитьПараметр("Ссылка", 				Объект.Ссылка);				   
	Запрос.УстановитьПараметр("ИмяТабличнойЧасти", 		Объект.ИмяТабличнойЧасти);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'У документа уже задана дополнительная табличная часть с этим именем'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ИмяТабличнойЧасти");
	ИначеЕсли Не Объект.ПредопределеннаяТабличнаяЧасть Тогда
		МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторДокумента);
		Если МетаданныеДокумента.ТабличныеЧасти.Найти(Объект.ИмяТабличнойЧасти) <> Неопределено Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'У документа задана предопределенная табличная часть с этим именем'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ИмяТабличнойЧасти");
		КонецЕсли;
	ИначеЕсли Объект.ПредопределеннаяТабличнаяЧасть Тогда
		МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторДокумента);
		Если МетаданныеДокумента.ТабличныеЧасти.Найти(Объект.ИмяТабличнойЧасти) = Неопределено Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'У документа нет предопределенной табличной части с этим именем'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ИмяТабличнойЧасти");
		КонецЕсли;
	КонецЕсли;
	Если Не Отказ Тогда
		
		Если НЕ БухгалтерскиеОперацииКлиентСервер.ЭтоКорректныйИдентификаторОбъекта(Объект.ИмяТабличнойЧасти) Тогда
			Отказ = Истина;
			ТекстСообщения = НСтр("ru = 'Задано некорректное имя табличной части'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.ИмяТабличнойЧасти");
		КонецЕсли;
					
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторДокументаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторДокумента) Тогда
		ЗаполнитьСписокТабличныхЧастейОбъекта();
	
		Если Не ПустаяСтрока(Объект.ИмяТабличнойЧасти) 
			И Элементы.Наименование.СписокВыбора.НайтиПоЗначению(Объект.ИмяТабличнойЧасти) = Неопределено Тогда
			Объект.ИмяТабличнойЧасти = "";
			Объект.Наименование = "";
		КонецЕсли;
	Иначе
		Элементы.ИмяТабличнойЧасти.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.ОткрытьФормуВыбораИдентификатораОбъектаМетаданных(
		Элемент, ДанныеВыбора, СтандартнаяОбработка,
		Новый Структура("ТекущаяСтрока", Объект.ИдентификаторДокумента), 
		ИдентификаторТипаДокументы, Истина);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.ИмяТабличнойЧасти) Тогда
		Объект.ИмяТабличнойЧасти = ИмяРеквизитаПоУмолчанию(Объект.Наименование, Объект.Ссылка);	
	КонецЕсли;
КонецПроцедуры
 
&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ПредопределеннаяТабличнаяЧасть Тогда
		ДанныеВыбора = ТабличныеЧастиОбъекта;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Объект.ПредопределеннаяТабличнаяЧасть Тогда
		ЭлементСписка = ТабличныеЧастиОбъекта.НайтиПоЗначению(ВыбранноеЗначение);
		Если ЭлементСписка <> Неопределено Тогда
			ВыбранноеЗначение 			= ЭлементСписка.Представление;
			Объект.ИмяТабличнойЧасти	= ЭлементСписка.Значение;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПредопределеннаяТабличнаяЧастьПриИзменении(Элемент)
	Объект.ПредопределеннаяТабличнаяЧасть = ПереключательПредопределеннаяТабличнаяЧасть = 1;
	УстановитьВариантТабличнойЧасти();
	Если Не ПустаяСтрока(Объект.ИмяТабличнойЧасти) 
		И Элементы.Наименование.СписокВыбора.НайтиПоЗначению(Объект.ИмяТабличнойЧасти) = Неопределено Тогда
		Объект.ИмяТабличнойЧасти = "";
		Объект.Наименование = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКолонок

&НаКлиенте
Процедура СписокКолонокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Перед добавлением колонок необходимо записать элемент'"));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокКолонокПриИзменении(Элемент)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПереместитьВверх(Команда)
	ПереместитьКолонки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПереместитьВниз(Команда)
	ПереместитьКолонки(Ложь);
КонецПроцедуры

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	//ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ОписаниеТипаКолонки"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПереместитьКолонки(Вверх)
	ТекущиеДанные = Элементы.СписокКолонок.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийКод = ТекущиеДанные.Код;
	
	Результат = ВыполнитьПеремещениеКолонок(Объект.Ссылка, ТекущийКод, Вверх);
	
	Если Результат Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка.КолонкиДополнительныхТабличныхЧастей"));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru='Невозможно изменить порядок колонок!'"));
	КонецЕслИ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьПеремещениеКолонок(Знач Владелец, Знач Код, Знач Вверх)

	Результат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КолонкиДополнительныхТабличныхЧастей.Ссылка,
	               |	КолонкиДополнительныхТабличныхЧастей1.Ссылка КАК Ссылка1
	               |ИЗ
	               |	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей1
	               |		ПО КолонкиДополнительныхТабличныхЧастей.Владелец = КолонкиДополнительныхТабличныхЧастей1.Владелец
	               |			И КолонкиДополнительныхТабличныхЧастей.Родитель = КолонкиДополнительныхТабличныхЧастей1.Родитель
	               |			И КолонкиДополнительныхТабличныхЧастей.Код " 
				   + ?(Вверх, ">", "<") + " КолонкиДополнительныхТабличныхЧастей1.Код
	               |ГДЕ
	               |	КолонкиДополнительныхТабличныхЧастей.Владелец = &Владелец
	               |	И КолонкиДополнительныхТабличныхЧастей.Код = &Код
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КолонкиДополнительныхТабличныхЧастей1.Код "+ ?(Вверх, "Убыв", "Возр");
				   
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Выборка = Запрос.Выполнить().Выбрать();				   
	Если Выборка.Следующий() Тогда
		Ссылка = Выборка.Ссылка;
		Ссылка1 = Выборка.Ссылка1;
		
		Если ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(Ссылка1) Тогда
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.КолонкиДополнительныхТабличныхЧастей");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.КолонкиДополнительныхТабличныхЧастей");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Ссылка1);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Попытка
				НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
				
				Блокировка.Заблокировать();
			
				Объект = Ссылка.ПолучитьОбъект();
				Объект1 = Ссылка1.ПолучитьОбъект();
				Объект.Код = Объект1.Код;
				Объект1.Код = 999;
				Объект1.Записать();
				Объект.Записать();
				Объект1.Код = Код;
				Объект1.Записать();
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				Возврат Ложь;
				
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ВыполнитьПеремещениеКолонок()

&НаСервере
Функция ЗаполнитьСписокТабличныхЧастейОбъекта()

	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторДокумента);
	
	Список = ТабличныеЧастиОбъекта;
	Список.Очистить();
	Для каждого ТабличнаяЧастьОбъекта Из ОбъектМетаданных.ТабличныеЧасти Цикл
	
		Список.Добавить(ТабличнаяЧастьОбъекта.Имя, ТабличнаяЧастьОбъекта.Синоним);
	
	КонецЦикла; 

КонецФункции // НаименованиеИдентификатора()

&НаКлиенте
Процедура ДоступностьНаименованиеТабличнойЧасти()

	ЭлементСписка = Элементы.Наименование.СписокВыбора.НайтиПоЗначению(Объект.ИмяТабличнойЧасти);
	Элементы.ИмяТабличнойЧасти.ТолькоПросмотр = ЭлементСписка <> Неопределено;

КонецПроцедуры // ДоступностьНаименованиеТабличнойЧасти()

&НаКлиенте
Процедура УстановитьВариантТабличнойЧасти()

	Если Объект.ПредопределеннаяТабличнаяЧасть Тогда
//		Элементы.Наименование.РежимВыбораИзСписка	= Истина;
		Элементы.Наименование.РедактированиеТекста 	= Ложь;
		Элементы.ИмяТабличнойЧасти.ТолькоПросмотр 	= Истина;
		Элементы.Наименование.КнопкаВыбора			= Истина;
	Иначе
//		Элементы.Наименование.РежимВыбораИзСписка 	= Ложь;
		Элементы.Наименование.РедактированиеТекста 	= Истина;
		Элементы.ИмяТабличнойЧасти.ТолькоПросмотр 	= Ложь;
		Элементы.Наименование.КнопкаВыбора			= Ложь;
	КонецЕсли;

КонецПроцедуры // УстановитьВариантТабличнойЧасти()

&НаСервереБезКонтекста
Функция ИмяРеквизитаПоУмолчанию(Знач Заголовок, Знач Ссылка)

	НовоеИмя = СтрЗаменить(ТРег(Заголовок), " ", "");
	БухгалтерскиеОперацииКлиентСервер.УдалитьЗапрещенныеСимволыИзИмени(НовоеИмя);
	
//	ИспользуемыеРеквизиты = Новый Массив;
	Возврат НовоеИмя;

КонецФункции // ИмяРеквизитаПоУмолчанию()

#КонецОбласти
