#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции
//  Возвращает сведения о записи в регистре сведенеий "СостояниеПлатежноРасчетныхДокументов"
//    Входящие параметры: Ссылка - тип ссылка на документ "Уведомление об уточнении операции клиента"
//    Исходящие параметры: 
Функция ПолучитьСостояниеДокумента(Ссылка) экспорт
	СтруктураРеквизитов = Новый Структура;
	ПоляВыборки = "";
	//  Струкутра реквизитов динамическая, т.к. со временем может понадобится новый ресурс в регистр
	//  что-бы его не забыть будем каждый раз перебирать ресурсы регистра
	Для каждого Ресурс из Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Ресурсы цикл
		СтруктураРеквизитов.Вставить(Ресурс.Имя);
		ПоляВыборки = ПоляВыборки + "
		|	Состояние." + Ресурс.Имя + " КАК " + Ресурс.Имя + ", "
	КонецЦикла;	
	//  Добавка ввиде реквизита "ПервичныйОбразИРеквизиты"
	СтруктураРеквизитов.Вставить("ПервичныйОбразИРеквизиты");		
	ПоляВыборки = ПоляВыборки + "
	|	Состояние.ПервичныйОбразИРеквизиты КАК ПервичныйОбразИРеквизиты ";
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;	
		
	ТекстЗапроса = "ВЫБРАТЬ " + ПоляВыборки + "
					|ИЗ	
					|	РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК Состояние
					|ГДЕ 
					|	Состояние.ПлатежноРасчетныйДокумент = &Ссылка";
						
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Для каждого КлючЗначение из СтруктураРеквизитов Цикл
		ТекРеквизит = КлючЗначение.Ключ;
		СтруктураРеквизитов[ТекРеквизит] = Выборка[ТекРеквизит];
	КонецЦикла;	
		
	Возврат СтруктураРеквизитов;
КонецФункции	
#КонецОбласти  

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции 

// Возвращает массив структур, содержащих значения реквизитов документа для выгрузки
//
// Параметры:
// МассивОбъектов               - Массив объектов данного вида
// ИспользоватьДопКл            - Признак применения доп. классификации и указании ее значений в структурах реквизитов документов
// ИспользоватьКодМероприятия   - Признак применения кодов мероприятий
// ИспользоватьКЭК              - Признак использования КЭК
// ИспользоватьАналитическийКод - Признак использования аналитического кода
// ИспользоватьКФО              - Признак применения КФО и указания значений КФО в структурах реквизитов документа
// ИспользоватьКОСГУПолучателя  - Признак использования КОСГУПолучателя
Функция ЗначенияРеквизитовДокумента(МассивОбъектов, ИспользоватьДопКл = Ложь, ИспользоватьКодМероприятия = Ложь, ИспользоватьКЭК = Ложь, ИспользоватьАналитическийКод = Ложь, ИспользоватьКФО = Ложь, ИспользоватьКОСГУПолучателя = Ложь) Экспорт  
	
	Возврат ПлатежноРасчетныеДокументы.ЗначенияРеквизитовРаспоряжениеОПеречисленииНаКартыМир(МассивОбъектов, ИспользоватьДопКл, ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьАналитическийКод, ИспользоватьКФО, ИспользоватьКОСГУПолучателя);
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_2_0_109");
	Методы.Вставить("ОбработатьДанныеДляПереходаНаНовуюВерсию_2_0_109");
КонецПроцедуры    

#Область ОбновлениеИнформационнойБазы  

#Область Обновление20109

// Регистрирует данные к обновлению в плане обмена ОбновлениеИнформационнойБазы.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_2_0_109(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспоряжениеОПеречисленииНаКартыМирСостав.Ссылка КАК Ссылка,
	|	РаспоряжениеОПеречисленииНаКартыМирСостав.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.РаспоряжениеОПеречисленииНаКартыМир.Состав КАК РаспоряжениеОПеречисленииНаКартыМирСостав
	|ГДЕ
	|	НЕ РаспоряжениеОПеречисленииНаКартыМирСостав.ПлатежнаяКарта = ЗНАЧЕНИЕ(Справочник.БанковскиеКартыКонтрагентов.ПустаяСсылка)
	|	И РаспоряжениеОПеречисленииНаКартыМирСостав.НомерПлатежнойКарты = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
		
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

// Обрабатывает данные, зарегистрированные в плане обмена ОбновлениеИнформационнойБазы.
//
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию_2_0_109(Параметры) Экспорт

	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Документ.РаспоряжениеОПеречисленииНаКартыМир";
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);

	Пока Выборка.Следующий() Цикл 
		Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
			// Вероятно был удален раньше, чем обработчик дошел до него
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
       	ПредставлениеСсылки = Строка(Выборка.Ссылка); 
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить(ПолноеИмяОбъекта);
		Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		
		НачатьТранзакцию();
		Попытка
       		Блокировка.Заблокировать(); 
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Для Каждого Стр Из Объект.Состав Цикл
				НомерПлатежнойКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ПлатежнаяКарта, "ОсновнойНомерДержателяКарты");
				Если ЗначениеЗаполнено(НомерПлатежнойКарты) Тогда
					Стр.НомерПлатежнойКарты = НомерПлатежнойКарты.Получить();
				КонецЕсли;
			КонецЦикла;	 
			Если Объект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;
            ЗафиксироватьТранзакцию();
        Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(
				Выборка.Ссылка,
				ПредставлениеСсылки,
				ИнформацияОбОшибке());
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;

	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);

КонецПроцедуры

#КонецОбласти  

#КонецОбласти

#КонецОбласти

#КонецОбласти


#КонецЕсли
