
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда  
		ПодготовитьФормуНаСервере();
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда               
			Подписанты = Новый Структура;
			Подписанты.Вставить("Руководитель", ЗаполнениеРеквизитовОбъектов.СтруктураПодписанта("Руководитель", Объект.Подразделение));
			ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписантов(Объект, Подписанты);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображениеСрокаКонсервации();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ПодготовитьФормуНаСервере();
		
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);

	// ГолосованиеКомиссии
	Если РешениеСотрудникаМодифицированность Тогда
		СохранитьРезультатыГолосованияНаСервере(Сотрудник, РешениеСотрудникаПоРезолюции);
	КонецЕсли;
	// Конец ГолосованиеКомиссии
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписанта(Объект, "Руководитель", "Руководитель", Объект.Подразделение);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОсновноеСредство) Тогда
		ЗаполнитьПоОС(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	
	ЗаполнитьПоОС(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентарныйНомерПриИзменении(Элемент)
	
	ЗаполнитьПоОС(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ОтображениеСрокаКонсервации();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ОтображениеСрокаКонсервации();
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если РешениеСотрудникаМодифицированность
		И ЗначениеЗаполнено(ВыбранныйСотрудник)
		И ВыбранныйСотрудник <> Сотрудник Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Сотрудник", ВыбранныйСотрудник);
		ДопПараметры.Вставить("РезультатыГолосования", Неопределено);
		Если ЗначениеЗаполнено(РешениеСотрудникаПоРезолюции) Тогда
			ДопПараметры.РезультатыГолосования = РешениеСотрудникаПоРезолюции;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), ВыбранныйСотрудник);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	СотрудникПриИзмененииНаСервере();
	
	ВыбранныйСотрудник = Сотрудник;
	
	РешениеСотрудникаМодифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	РаботаСФайламиБГУ.ПолучитьФайлСотрудника(Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборПрисутствующих = Новый Структура("Отсутствует", Ложь);
	ПрисутствующиеЧленыКомиссии = Объект.СоставКомиссии.НайтиСтроки(ОтборПрисутствующих);
	
	// Выбирается из присутствующих членов комиссии.
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЧленКомиссии Из ПрисутствующиеЧленыКомиссии Цикл
		Элемент.СписокВыбора.Добавить(ЧленКомиссии.Сотрудник);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РешениеСотрудникаПоРезолюцииПриИзменении(Элемент)
	
	РешениеСотрудникаМодифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Комиссия

&НаКлиенте
Процедура СоставКомиссииПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСохранитьРезультатыГолосования(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Сотрудник", Сотрудник);
	ДопПараметры.Вставить("РезультатыГолосования", Неопределено);
	Если ЗначениеЗаполнено(РешениеСотрудникаПоРезолюции) Тогда
		ДопПараметры.РезультатыГолосования = РешениеСотрудникаПоРезолюции;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), Сотрудник);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

// Файлы сотрудников
&НаКлиенте
Процедура НадписьФайлНеВыбранНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		СтандартнаяОбработка = Ложь;
		ОповещениеФайла = Новый ОписаниеОповещения("ОбработатьВыборФайлаСотрудника", ЭтотОбъект);
		РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элементы.ФайлСотрудника, ,ОповещениеФайла);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУдалитьФайлНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Или Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрепитьФайлСотрудникаНаСервере();
	
КонецПроцедуры
// Конец Файлы сотрудников

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.СоставКомиссииПричинаОтсутствия.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.СоставКомиссии.Председатель", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "-");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображениеСрокаКонсервации()
	
	Элементы.СрокКонсервации.Видимость = (ДобавитьМесяц(Объект.ДатаНачала, 3) > Объект.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтаФорма);
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОС(ЗаполнитьИнвентарныйНомер = Ложь)
	
	Период = ?(Объект.Ссылка.Пустая(), КонецДня(Объект.Дата), Объект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"				, Период);
	Запрос.УстановитьПараметр("Организация"			, Объект.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство"	, Объект.ОсновноеСредство);
	Запрос.УстановитьПараметр("ИнвентарныйНомер"	, Объект.ИнвентарныйНомер);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОстатки.СтоимостьОстаток КАК БалансоваяСтоимость
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ИнвентарныйНомер = &ИнвентарныйНомер
	|				И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток КАК СуммаАмортизацииКонсервация,
	|	АмортизацияОбъектовОСОстатки.СуммаОбесцененияОстаток КАК СуммаОбесцененияКонсервация
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ИнвентарныйНомер = &ИнвентарныйНомер) КАК АмортизацияОбъектовОСОстатки";
	
	Если ЗаполнитьИнвентарныйНомер Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер
		|ПОМЕСТИТЬ ВТ_Инв
		|ИЗ
		|	РегистрСведений.СобытияОС.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ОсновноеСредство = &ОсновноеСредство) КАК СобытияОССрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	СобытияОССрезПоследних.ИнвНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Инв.ИнвентарныйНомер КАК ИнвентарныйНомер
		|ИЗ
		|	ВТ_Инв КАК ВТ_Инв"
		+ ";" + Символы.ПС + СтрЗаменить(Запрос.Текст, "= &ИнвентарныйНомер", "В (ВЫБРАТЬ ВТ.ИнвентарныйНомер ИЗ ВТ_Инв КАК ВТ)")
		+ ";" + Символы.ПС +
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеРеквизиты.Свойство.Заголовок КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ДополнительныеРеквизиты.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
		|			ТОГДА ВЫБОР
		|					КОГДА (ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
		|						ТОГДА ДополнительныеРеквизиты.Значение.Наименование
		|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1000))
		|				КОНЕЦ
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеРеквизиты.Значение)
		|	КОНЕЦ КАК ЗначениеХарактеристики,
		|	ДополнительныеРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока,
		|	1 КАК НомерТаблицы,
		|	ЕСТЬNULL(СписокДопРеквизиты.НомерСтроки, 0) КАК Порядок
		|ИЗ
		|	Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Список.Свойство КАК Свойство,
		|			МИНИМУМ(Список.НомерСтроки) КАК НомерСтроки
		|		ИЗ
		|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК Список
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Список.Свойство) КАК СписокДопРеквизиты
		|		ПО ДополнительныеРеквизиты.Свойство = СписокДопРеквизиты.Свойство
		|ГДЕ
		|	ДополнительныеРеквизиты.Ссылка = &ОсновноеСредство
		|	И ДополнительныеРеквизиты.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка)
		|	И ДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДополнительныеСведения.Свойство.Заголовок,
		|	ВЫБОР
		|		КОГДА ДополнительныеСведения.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
		|			ТОГДА ВЫБОР
		|					КОГДА (ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
		|						ТОГДА ДополнительныеСведения.Значение.Наименование
		|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1000))
		|				КОНЕЦ
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Значение)
		|	КОНЕЦ,
		|	"""",
		|	2,
		|	ЕСТЬNULL(СписокДопСведения.НомерСтроки, 0)
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Список.Свойство КАК Свойство,
		|			МИНИМУМ(Список.НомерСтроки) КАК НомерСтроки
		|		ИЗ
		|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК Список
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Список.Свойство) КАК СписокДопСведения
		|		ПО ДополнительныеСведения.Свойство = СписокДопСведения.Свойство
		|ГДЕ
		|	(ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.ОсновныеСредства)) = &ОсновноеСредство
		|	И ДополнительныеСведения.Свойство <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка)
		|	И ДополнительныеСведения.Значение <> НЕОПРЕДЕЛЕНО
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерТаблицы,
		|	Порядок";
		
		ТаблицаОт = 1;
		ТаблицаПо = 3;
		ТаблицаДХ = 4;
		
	Иначе
		
		ТаблицаОт = 0;
		ТаблицаПо = 1;
		ТаблицаДХ = 0;
		
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Объект.ЦМО								= Справочники.ЦМО.ПустаяСсылка();
	Объект.БалансоваяСтоимость				= 0;
	Объект.СуммаАмортизацииКонсервация		= 0;
	Объект.СуммаОбесцененияКонсервация		= 0;
	Объект.СуммаАмортизацииРасконсервация	= 0;
	Объект.СуммаОбесцененияРасконсервация	= 0;
	
	Для Сч = ТаблицаОт По ТаблицаПо Цикл
		Выборка = Результат[Сч].Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Объект, Выборка);
		КонецЕсли;
	КонецЦикла;
	
	Если ТаблицаДХ <> 0 Тогда
		Выборка = Результат[ТаблицаДХ].Выбрать();
		СписокДХ = Новый Массив;
		Пока Выборка.Следующий() Цикл
			Значение = ?(ЗначениеЗаполнено(Выборка.ТекстоваяСтрока), Выборка.ТекстоваяСтрока, Выборка.ЗначениеХарактеристики);
			СписокДХ.Добавить(Выборка.Характеристика + " - " + Значение);
		КонецЦикла;
		Объект.Характеристика = СтрСоединить(СписокДХ, "; ");
	КонецЕсли;
	
	Если Объект.ВидОперации = 1 Тогда
		
		Запрос.УстановитьПараметр("ИнвентарныйНомер", Объект.ИнвентарныйНомер);
		
		Объект.СуммаАмортизацииРасконсервация = Объект.СуммаАмортизацииКонсервация;
		Объект.СуммаОбесцененияРасконсервация = Объект.СуммаОбесцененияКонсервация;
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АктКонсервацииРасконсервации.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Документ
		|ИЗ
		|	Документ.АктКонсервацииРасконсервации КАК АктКонсервацииРасконсервации
		|ГДЕ
		|	АктКонсервацииРасконсервации.Организация = &Организация
		|	И АктКонсервацииРасконсервации.ОсновноеСредство = &ОсновноеСредство
		|	И АктКонсервацииРасконсервации.ИнвентарныйНомер = &ИнвентарныйНомер
		|	И АктКонсервацииРасконсервации.Дата < &Период
		|	И АктКонсервацииРасконсервации.ВидОперации = 0
		|	И АктКонсервацииРасконсервации.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	АктКонсервацииРасконсервации.Дата УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АктКонсервацииРасконсервации.СуммаАмортизацииКонсервация КАК СуммаАмортизацииКонсервация,
		|	АктКонсервацииРасконсервации.СуммаОбесцененияКонсервация КАК СуммаОбесцененияКонсервация
		|ИЗ
		|	Документ.АктКонсервацииРасконсервации КАК АктКонсервацииРасконсервации
		|ГДЕ
		|	АктКонсервацииРасконсервации.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_Документ.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_Документ КАК ВТ_Документ)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Объект.СуммаАмортизацииКонсервация = Выборка.СуммаАмортизацииКонсервация;
			Объект.СуммаОбесцененияКонсервация = Выборка.СуммаОбесцененияКонсервация;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ГолосованиеКомиссии

&НаКлиенте
Процедура ВопросСохранитьРезультатыГолосованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатыГолосованияНаСервере(ДополнительныеПараметры.Сотрудник, ДополнительныеПараметры.РезультатыГолосования);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыГолосованияНаСервере(ЧленКомиссии, РезультатГолосования)
	
	ОбщегоНазначенияБГУ.СохранитьРезультатыГолосованияНаСервере(Объект, ЧленКомиссии, РезультатГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

// Файлы сотрудников
&НаКлиенте
Процедура ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора)
	
	РаботаСФайламиБГУ.ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОткрепитьФайлСотрудникаНаСервере()
	
	РаботаСФайламиБГУ.ОткрепитьФайлСотрудника(ФайлСотрудника, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

// Конец Файлы сотрудников

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
