
#Область ОписаниеПеременных

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Перем ПроверкаКонтрагентовПараметрыОбработчикаОжидания Экспорт;
&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
	Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ЗначениеЗаполнено(Объект.УдалитьКорСчет) Тогда
			Объект.УдалитьКорСчет = БухгалтерскийУчет.СчетПоКоду("205.00", Неопределено, Неопределено);
		КонецЕсли;
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	Элементы.УдалитьКорСчет.СписокВыбора.Очистить();
	Элементы.УдалитьКорСчет.СписокВыбора.Добавить(БухгалтерскийУчет.СчетПоКоду("205.00", Неопределено, Неопределено),
	НСтр("ru = 'Расчеты по администрируемым доходам (205.00)'"));
	Элементы.УдалитьКорСчет.СписокВыбора.Добавить(БухгалтерскийУчет.СчетПоКоду("209.00", Неопределено, Неопределено),
	НСтр("ru = 'Расчеты по ущербу и иным доходам (209.00)'"));
	
	Элементы.НачисленияВидДохода.СписокВыбора.Очистить();
	Элементы.НачисленияВидДохода.СписокВыбора.Добавить(БухгалтерскийУчет.СчетПоКоду("205.00", Неопределено, Неопределено),
				НСтр("ru = 'Администрируемые доходы (205.00)'"));
	Элементы.НачисленияВидДохода.СписокВыбора.Добавить(БухгалтерскийУчет.СчетПоКоду("209.00", Неопределено, Неопределено),
				НСтр("ru = 'Иные доходы (209.00)'"));
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
	Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПодготовитьФормуНаСервере();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПриОткрытииДокумент(ЭтотОбъект);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
		
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)
	
	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект); 
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)
	
	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
		ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
		Ложь);
		
		ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Ложь;
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	РассчитатьСуммыСтрокНаСервере();
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.Начисления.Очистить();
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГрупповаяПриИзменении(Элемент)
	
	Если Объект.Групповая Тогда 
		Если Объект.Начисления.Количество() > 0 Тогда	
			Объект.ГруппыУчета.Очистить();
			НоваяГруппа = Объект.ГруппыУчета.Добавить();
			НоваяГруппа.КлючСтроки = Новый УникальныйИдентификатор;
			Для Каждого Стр Из Объект.Начисления Цикл
				Стр.КлючСтроки = НоваяГруппа.КлючСтроки;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли  Объект.ГруппыУчета.Количество() > 0 Тогда
		Объект.ГруппыУчета.Очистить();
		Для Каждого Стр Из Объект.Начисления Цикл
			Стр.КлючСтроки = "";
		КонецЦикла;
	КонецЕсли;	
	
	УстановитьОтборСтрокВТаблицеНачисления();
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентирующийДокументПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.РегламентирующийДокумент) Тогда
		ЗаполнитьСкидкиНаСервере();
		ОбновитьРеквизитыРегламентирующегоДокумента();
	Иначе
		ЭтотОбъект.КЭШПараметров.Локальные.Вставить("ПроцентСкидки", 0);
		ЭтотОбъект.КЭШПараметров.Локальные.Вставить("СуммаСкидки", 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидРегламентирующегоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыГруппыУчета

&НаКлиенте
Процедура ГруппыУчетаПриАктивизацииСтроки(Элемент)
	Если Объект.Групповая Тогда
		ПодключитьОбработчикОжидания("УстановитьОтборСтрокВТаблицеНачисления", 0.2, Истина); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ГруппыУчета.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
		ПодключитьОбработчикОжидания("УстановитьОтборСтрокВТаблицеНачисления", 0.2, Истина); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУчетаПередУдалением(Элемент, Отказ)
	
	Если НЕ Отказ Тогда
		
		ТекущиеДанные = Элементы.ГруппыУчета.ТекущиеДанные;
		
		ОтборПоГруппе = Новый Структура("КлючСтроки", ТекущиеДанные.КлючСтроки);
		СтрокиПоГруппе = Объект.Начисления.НайтиСтроки(ОтборПоГруппе);
		Для Каждого СтрокаНачисления Из СтрокиПоГруппе Цикл
			Объект.Начисления.Удалить(Объект.Начисления.Индекс(СтрокаНачисления));
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыУчетаГруппаУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Отбор = Новый Структура("ГруппаУчета", ВыбранноеЗначение);
		НайденныеСтроки = Объект.ГруппыУчета.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ПоказатьПредупреждение(, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Группа учета ""%1"" уже присутствует в списке.
			|Выберите другое значение.'"), ВыбранноеЗначение));
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисления

&НаКлиенте
Процедура НачисленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ТаблицаФормыВыбор(ЭтотОбъект, Элемент, Поле);
	// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	Если НЕ Копирование Тогда
		ТекущаяГруппаУчета = Элементы.ГруппыУчета.ТекущиеДанные;
		Если ТекущаяГруппаУчета = Неопределено И Объект.Групповая Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
		
		Если НЕ Копирование Тогда
			
			ТекущаяГруппаУчета = Элементы.ГруппыУчета.ТекущиеДанные;
			
			Если ТекущаяГруппаУчета = Неопределено И Объект.Групповая Тогда
				Отказ = Истина;
			ИначеЕсли НЕ Объект.Групповая Тогда
				ТекущиеДанные.КлючСтроки = "";
			Иначе
				ТекущиеДанные.КлючСтроки = ТекущаяГруппаУчета.КлючСтроки; 
			КонецЕсли;
			
			Если ТекущиеДанные <> Неопределено Тогда
				ТекущиеДанные.ВидДохода = БухгалтерскийУчетВызовСервераПовтИсп.СчетПоКоду("205.00");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	ТекущиеДанные.ИдентификаторПлательщика = ИдентификаторКонтрагента(ТекущиеДанные.Контрагент, Объект.ВидДокументаФизЛиц);
	
	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ЗапуститьПроверкуКонтрагентовВДокументе(ЭтотОбъект, Элементы.Начисления);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВалютаПриИзменении(Элемент)
	РассчитатьСуммуСтрокиНаКлиенте(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСуммаВВалютеПриИзменении(Элемент)
	РассчитатьСуммуСтрокиНаКлиенте(Элементы.Начисления.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВидПодтверждающегоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НачисленияДоговорКонтрагентаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Элементы.Начисления.ТекущиеДанные.ДоговорКонтрагента) Тогда
		НачисленияДоговорКонтрагентаПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура НачисленияДоговорКонтрагентаПриИзмененииНаСервере()
	ДанныеСтроки = Объект.Начисления.НайтиПоИдентификатору(Элементы.Начисления.ТекущаяСтрока);
	РеквизитыКонтракта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСтроки.ДоговорКонтрагента, "ВидОбязательства,ДатаДоговора,НомерДоговора"); 
	ДанныеСтроки.ВидПервичногоДокумента = РеквизитыКонтракта.ВидОбязательства;
	ДанныеСтроки.ДатаПервичногоДокумента = РеквизитыКонтракта.ДатаДоговора;
	ДанныеСтроки.НомерПервичногоДокумента = РеквизитыКонтракта.НомерДоговора;
КонецПроцедуры
	
&НаКлиенте
Процедура НачисленияКПСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	БухгалтерскийУчетКлиент.ПроверитьОчиститьКЭК(ТекущиеДанные.КПС, ТекущиеДанные.КОСГУ);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияКОСГУПриИзменении(Элемент)
	
	ТекДанные = Элементы.Начисления.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.ВидДохода) Тогда
		КОСГУПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КОСГУПриИзмененииНаСервере()
	
	ДанныеСтроки = Объект.Начисления.НайтиПоИдентификатору(Элементы.Начисления.ТекущаяСтрока);
	ДанныеСтроки.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(ДанныеСтроки.КОСГУ,
							ДанныеСтроки.ВидДохода, ,
							Объект.Дата,
							Объект.Организация,
							Объект.ИФО);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияОплатитьДоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Начисления.ТекущиеДанные;
	
	Отбор = Новый Структура("ВидРасчетов,КФО,КПС");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеДанные);
	Отбор.Вставить("ЭтоПоступление", Истина);
	Отбор.Вставить("ИФО", Объект.ИФО);
	Отбор.Вставить("КЭК", ТекущиеДанные.КОСГУ);
	Отбор.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	Отбор.Вставить("Договор", ТекущиеДанные.ДоговорКонтрагента);
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет
		ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.Валюта) Тогда
		Отбор.Вставить("Валюта", ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета);
	Иначе
		Отбор.Вставить("Валюта", ТекущиеДанные.Валюта);
	КонецЕсли;
	
	СписокОчередныхПлатежей = СписокОчередныхПлатежейПоГрафику(Объект.Организация, ТекущиеДанные.ДоговорКонтрагента, Отбор);
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого Платеж Из СписокОчередныхПлатежей Цикл
		Элемент.СписокВыбора.Добавить(Платеж.Значение, Платеж.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияСуммаДоходаПриИзменении(Элемент)
	ДанныеСтроки = Элементы.Начисления.ТекущиеДанные;
	Если ЗначениеЗаполнено(ЭтотОбъект.КЭШПараметров.Локальные.ПроцентСкидки) Тогда
		ДанныеСтроки.Сумма = ДанныеСтроки.СуммаДохода * ЭтотОбъект.КЭШПараметров.Локальные.ПроцентСкидки / 100;
	Иначе
		ДанныеСтроки.Сумма = Макс(0, ДанныеСтроки.СуммаДохода - ЭтотОбъект.КЭШПараметров.Локальные.СуммаСкидки);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НачисленияВидДоходаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Начисления.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено
		И ЗначениеЗаполнено(ТекДанные.ВидДохода)
		И ЗначениеЗаполнено(ТекДанные.КОСГУ) Тогда
		ВидДоходаПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСтроку(Команда)
	
	ДанныеСтроки = Элементы.Начисления.ТекущиеДанные;
	
	Если Данныестроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = "";
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Ошибки = Ошибки + "
		|" + НСтр("ru = 'Не заполнено поле Организация'")
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Контрагент) Тогда
		Ошибки = Ошибки + "
		|" + НСтр("ru = 'Не заполнено поле Контрагент'")
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ДоговорКонтрагента) Тогда
		Ошибки = Ошибки + "
		|" + НСтр("ru = 'Не заполнено поле Договор'")
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.КПС) Тогда
		Ошибки = Ошибки + "
		|" + НСтр("ru = 'Не заполнено поле КПС'")
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.КФО) Тогда
		Ошибки = Ошибки + "
		|" + НСтр("ru = 'Не заполнено поле КФО'")
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибки);
		Возврат
	КонецЕсли;
	
	РссчитатьСтрокуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура РссчитатьСтрокуНаСервере()
	
	ДанныеСтроки = Объект.Начисления.НайтиПоИдентификатору(Элементы.Начисления.ТекущаяСтрока);
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.СчетРасчетов) ИЛИ НЕ ЗначениеЗаполнено(ДанныеСтроки.КОСГУ) Тогда
		ЗаполнитьСчетКЭКПоДоговоруНаСервере();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ВидДохода) Тогда
		Ошибки = НСтр("ru = 'Не заполнено поле ""Вид дохода"" (не найдено начисленных доходов)'");
		ОбщегоНазначения.СообщитьПользователю(Ошибки);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.КОСГУ) Тогда
		Ошибки = НСтр("ru = 'Не заполнено поле ""КОСГУ"" (не найдено начисленных доходов или отсутствует настройка в регистре сведений ""Соответствия аналитических счетов КЭК"")'");
		ОбщегоНазначения.СообщитьПользователю(Ошибки);
		Возврат;
	КонецЕсли;
	
	СуммыНачисленныхДоходов = Документы.ВедомостьВыпадающихДоходов.СуммыДоходаДляСтроки(Объект.Организация, Объект.ИФО, Объект.Дата, ДанныеСтроки);
	
	Если НЕ СуммыНачисленныхДоходов.Доход > 0 Тогда
		Ошибки = НСтр("ru = 'Не найдено начисленных доходов'");
		ОбщегоНазначения.СообщитьПользователю(Ошибки);
		Возврат;
	КонецЕсли;
	
	Если СуммыНачисленныхДоходов.Зачтено > 0 Тогда
		Ошибки = НСтр("ru = 'По указанным реквизитам уже начислены выпадающие доходы'");
		ОбщегоНазначения.СообщитьПользователю(Ошибки);
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки.СуммаДохода = СуммыНачисленныхДоходов.Доход;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.КЭШПараметров.Локальные.ПроцентСкидки) Тогда
		ДанныеСтроки.Сумма = ДанныеСтроки.СуммаДохода * ЭтотОбъект.КЭШПараметров.Локальные.ПроцентСкидки / 100;
	Иначе
		ДанныеСтроки.Сумма = Макс(0, ДанныеСтроки.СуммаДохода - ЭтотОбъект.КЭШПараметров.Локальные.СуммаСкидки);
	КонецЕсли;
	
	Если ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров Тогда
		
		ДанныеСтроки.АвтоматическиОтразитьВГрафикахИсполненияДоговоров = Ложь;
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСтроки.ДоговорКонтрагента, "ВестиГрафикПлатежей");
		Если РеквизитыДоговора.ВестиГрафикПлатежей Тогда
			
			Отбор = Новый Структура;
			Если ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоИФО Тогда
				Отбор.Вставить("ИФО", Объект.ИФО);
			КонецЕсли;
			Отбор.Вставить("Контрагент", ДанныеСтроки.Контрагент);
			Отбор.Вставить("Договор", ДанныеСтроки.ДоговорКонтрагента);
			Отбор.Вставить("КФО", ДанныеСтроки.КФО);
			Отбор.Вставить("КПС", ДанныеСтроки.КПС);
			Если ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьДетализациюПоКОСГУВГрафикахСПокупателями Тогда
				Отбор.Вставить("КЭК", ДанныеСтроки.КОСГУ);
			КонецЕсли;
			Отбор.Вставить("СчетРасчетов", ДанныеСтроки.СчетРасчетов);
			
			Если НЕ ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет
				ИЛИ НЕ ЗначениеЗаполнено(ДанныеСтроки.Валюта) Тогда
				Отбор.Вставить("Валюта", ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета);
			Иначе
				Отбор.Вставить("Валюта", ДанныеСтроки.Валюта);
			КонецЕсли;
			
			Отбор.Вставить("Сумма", ДанныеСтроки.Сумма);
			
			НеисполненныеПлатежи = КонтрольИсполненияДоговоров.НеисполненныеПлатежиОтПокупателейДебиторов(Отбор, Объект.Организация);
			Если НеисполненныеПлатежи.Количество() = 1 Тогда
				ДанныеСтроки.АвтоматическиОтразитьВГрафикахИсполненияДоговоров = Истина;
				НеисполненныйПлатеж = НеисполненныеПлатежи[0];
				ЗаполнитьЗначенияСвойств(ДанныеСтроки, НеисполненныйПлатеж, "ВидРасчетов,ОплатитьДо");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура ПоказатьСкрытьСчетаРасчетов(Команда)
	
	Элементы.НачисленияСчет.Видимость = НЕ Элементы.НачисленияСчет.Видимость;
	Элементы.НачисленияПоказатьСкрытьСчетаРасчетов.Пометка = Элементы.НачисленияСчет.Видимость;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ИспользоватьКонтрольИсполненияДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров"));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ИспользоватьДетализациюПоКОСГУВГрафикахСПокупателями", ПолучитьФункциональнуюОпцию("ИспользоватьДетализациюПоКОСГУВГрафикахСПокупателями"));
	
	ЗаполнитьСкидкиНаСервере();
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСкидкиНаСервере()
	Если ЗначениеЗаполнено(Объект.РегламентирующийДокумент) Тогда
		ЭтотОбъект.КЭШПараметров.Локальные.Вставить("ПроцентСкидки", Объект.РегламентирующийДокумент.ПроцентСкидки);
		ЭтотОбъект.КЭШПараметров.Локальные.Вставить("СуммаСкидки", Объект.РегламентирующийДокумент.СуммаСкидки);
	Иначе
		ЭтотОбъект.КЭШПараметров.Локальные.Вставить("ПроцентСкидки", 0);
		ЭтотОбъект.КЭШПараметров.Локальные.Вставить("СуммаСкидки", 0);
	КонецЕсли;
КонецПроцедуры	 

&НаСервере
Процедура ОбновитьРеквизитыРегламентирующегоДокумента()
	Объект.ВидРегламентирующегоДокумента = Объект.РегламентирующийДокумент.НаименованиеНПА;
	Объект.ДатаРегламентирующегоДокумента = Объект.РегламентирующийДокумент.ДатаНПА;
	Объект.НомерРегламентирующегоДокумента = Объект.РегламентирующийДокумент.НомерНПА;
	Объект.СтатьяРегламентирующегоДокумента = Объект.РегламентирующийДокумент.СтатьяНПА;
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияВидРасчетов");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияОплатитьДо");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Начисления.АвтоматическиОтразитьВГрафикахИсполненияДоговоров", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияВидДохода");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Начисления.ВидДохода", ВидСравненияКомпоновкиДанных.Равно, БухгалтерскийУчет.СчетПоКоду("205.00", Неопределено, Неопределено));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Администрируемые доходы (205.00)'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НачисленияВидДохода");
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Начисления.ВидДохода", ВидСравненияКомпоновкиДанных.Равно, БухгалтерскийУчет.СчетПоКоду("209.00", Неопределено, Неопределено));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Иные доходы (209.00)'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокВТаблицеНачисления()
	
	ТекущиеДанные = Элементы.ГруппыУчета.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.Начисления.ОтборСтрок = Неопределено;
	Иначе
		НовыйОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки", ТекущиеДанные.КлючСтроки);
		ТекущийОтборСтрок = Элементы.Начисления.ОтборСтрок;
		Если ТекущийОтборСтрок = Неопределено
			ИЛИ ТекущийОтборСтрок.КлючСтроки <> НовыйОтборСтрок.КлючСтроки Тогда
			Элементы.Начисления.ОтборСтрок = НовыйОтборСтрок;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппыУчета");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, МассивЭлементов, "Видимость", Форма.Объект.Групповая);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ИдентификаторКонтрагента(Контрагент, ВидДокументаФизЛиц)
	
	Возврат БухгалтерскийУчет.ИдентификаторКонтрагента(Контрагент, ВидДокументаФизЛиц);
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСуммуСтрокиНаКлиенте(ДанныеСтроки)
	
	Если ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет Тогда 
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Валюта)
			ИЛИ ДанныеСтроки.Валюта = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета Тогда
			ДанныеСтроки.СуммаВВалюте = 0;
		ИначеЕсли ДанныеСтроки.СуммаВВалюте = 0 Тогда
			ДанныеСтроки.Сумма = 0;
		Иначе
			КурсКратность = ПолучитьКурс(ДанныеСтроки.Валюта, Объект.Дата);
			ДанныеСтроки.Сумма 	= ДанныеСтроки.СуммаВВалюте*КурсКратность.Курс/?(КурсКратность.Кратность=0, 1, КурсКратность.Кратность);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыСтрокНаСервере()
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИспользоватьВалютныйУчет Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из Объект.Начисления Цикл
		
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Валюта)
			ИЛИ ДанныеСтроки.Валюта = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета Тогда
			Если НЕ ДанныеСтроки.СуммаВВалюте = 0 Тогда
				ДанныеСтроки.СуммаВВалюте = 0;
				ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Истина;
			КонецЕсли;	
		ИначеЕсли ДанныеСтроки.СуммаВВалюте = 0 И НЕ ДанныеСтроки.Сумма = 0 Тогда
			ДанныеСтроки.Сумма = 0;
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Истина;
		Иначе
			КурсКратность = ПолучитьКурс(ДанныеСтроки.Валюта, Объект.Дата);
			НоваяСумма = ДанныеСтроки.СуммаВВалюте*КурсКратность.Курс/?(КурсКратность.Кратность=0, 1, КурсКратность.Кратность);
			Если НЕ ДанныеСтроки.Сумма = НоваяСумма Тогда
				ДанныеСтроки.Сумма = НоваяСумма;
				ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса = Истина;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурс(Знач ВалютаДокумента, Дата)
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
	//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

#Область КонтрольИсполненияДоговоров

&НаСервереБезКонтекста
Функция СписокОчередныхПлатежейПоГрафику(Организация, Договор, Отбор)
	
	ДоступенРежимАвто = Ложь;
	
	Возврат КонтрольИсполненияДоговоров.СписокОчередныхПлатежейПоГрафику(Организация, Договор, Отбор, ДоступенРежимАвто);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемыРаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ПоказатьПредложениеИспользоватьПроверкуКонтрагентов()
	ПроверкаКонтрагентовКлиент.ПредложитьВключитьПроверкуКонтрагентов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаКлиенте
Процедура Подключаемый_ОбработатьРезультатПроверкиКонтрагентов()
	ПроверкаКонтрагентовКлиент.ОбработатьРезультатПроверкиКонтрагентовВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ОтобразитьРезультатПроверкиКонтрагента() Экспорт
	ПроверкаКонтрагентов.ОтобразитьРезультатПроверкиКонтрагентаВДокументе(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

// СтандартныеПодсистемы.РаботаСКонтрагентами
&НаСервере
Процедура ПроверитьКонтрагентовФоновоеЗадание(ПараметрыФоновогоЗадания) Экспорт	
	ПроверкаКонтрагентов.ПроверитьКонтрагентовВДокументеФоновоеЗадание(ЭтотОбъект, ПараметрыФоновогоЗадания);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры

// Конец ИнтеграцияС1САрхивом

&НаСервере
Процедура ЗаполнитьСчетКЭКПоДоговоруНаСервере()
	
	ДанныеСтроки = Объект.Начисления.НайтиПоИдентификатору(Элементы.Начисления.ТекущаяСтрока);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Договоры",	ДанныеСтроки.ДоговорКонтрагента);
	ПараметрыЗапроса.Вставить("Контрагенты",	ДанныеСтроки.Контрагент);
	ПараметрыЗапроса.Вставить("КПС",			ДанныеСтроки.КПС);
	ПараметрыЗапроса.Вставить("КФО",			ДанныеСтроки.КФО);
	
	СчетКЭК = Документы.ВедомостьВыпадающихДоходов.СчетКЭКПоДоговору(Объект.Организация, Объект.ИФО, Объект.Дата, ПараметрыЗапроса);
	
	Если СчетКЭК.Количество() = 1 Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, СчетКЭК[0], "КОСГУ, СчетРасчетов, ВидДохода");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидДоходаПриИзмененииНаСервере()
	
	ДанныеСтроки = Объект.Начисления.НайтиПоИдентификатору(Элементы.Начисления.ТекущаяСтрока);
	ДанныеСтроки.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				ДанныеСтроки.КОСГУ,
				ДанныеСтроки.ВидДохода, ,
				Объект.Дата,
				Объект.Организация,
				Объект.ИФО);
	
КонецПроцедуры

#КонецОбласти

