
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ПрочитатьРежимыЗаполненияДанных();
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.СрокДействия = КонецДня(ТекущаяДатаСеанса());
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.НомерСмены = УчетГСМ.НомерСменыДляПутевогоЛиста(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата) + 1;
		КонецЕсли;	
		
		//заполнение показаний спидометра при выезде
		Если ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ Тогда
			Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
				ЗаполнитьДанныеОПоказанияхСпидометра();
			КонецЕсли;	
		КонецЕсли;
		
		//заполнение остатков горючего
		Если ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ Тогда
			Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
				ЗаполнитьДанныеОбОстаткахГорючего();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьДанныеМедосмотраДокумена();
		ПодготовитьФормуНаСервере();        
		
	КонецЕсли;	
	ЗаполнитьСписокВыбораВодителя();
	СоздатьКнопкуДляВидаПеревозки(ЭтаФорма,"ВидПеревозки",Элементы.ГруппаВидПеревозки);
	УстановитьСвойстваЭлементовНовыхРеквизитовФормы(ЭтотОбъект);	
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования.ВидПеревозки) Тогда
			Объект.ВидПеревозки = УчетГСМ.ДанныеСведенийОПеревозкеПоУмолчанию();
		КонецЕсли;
	КонецЕсли;	
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ПоказатьКоличествоВремени();
	
	ЗаполнитьТекстПроТаксировку(); 
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	УстановитьВидимостьЭлементовМедосмотра();
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения	
	
	ПоказатьКоличествоВремени();
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	ПоказатьКоличествоВремени();
	ОбновитьТекстЗаголовковВсехСтрокТаблицыЗаданиеВодителю(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОтветственныеЗаГруз(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыРезультатыРаботыТС(ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОчиститьСообщения(); 
	
	Если ПроверитьДатуМедЛицензий() Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("ru='Выбранная медицинская лицензия не действует на дату путевого листа.
								|Следует выбрать действующую лицензию или очистить значение реквизита.'"));
		Отказ = Истина;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.РезультатыРаботыТС Цикл
		Строка.КоличествоВремениРаботыТСВсего = УчетВремениКлиентСервер.ЧислоИзСтроки(Строка.КоличествоВремениРаботыТСВсегоСтр);
		Строка.КоличествоВремениПростоя = УчетВремениКлиентСервер.ЧислоИзСтроки(Строка.КоличествоВремениПростояСтр);
		Строка.ПоказателиЗПНочныеЧасы = УчетВремениКлиентСервер.ЧислоИзСтроки(Строка.ПоказателиЗПНочныеЧасыСтр);
		Строка.ПоказателиЗПКоличествоВремени = УчетВремениКлиентСервер.ЧислоИзСтроки(Строка.ПоказателиЗПКоличествоВремениСтр);
		Строка.ПоказателиЗПСтоянкаНаЛинии = УчетВремениКлиентСервер.ЧислоИзСтроки(Строка.СтоянкаНаЛинииСтр);
	КонецЦикла;
	
	УстановитьСрокДействияПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_Таксировка"
			И Параметр.ДокументыОснования.Найти(Объект.Ссылка) <> Неопределено Тогда
		ЗаполнитьТекстПроТаксировку();
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		Объект.ТранспортноеСредство = ВыбранноеЗначение;
		ТранспортноеСредствоПриИзмененииНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПроверитьДанныеПутевогоЛиста();
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТранспортноеСредствоПриИзменении(Элемент)
	
	ТранспортноеСредствоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортноеСредствоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура("Организация", Объект.Организация);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, РежимВыбора, ЗакрыватьПриВыборе, МножественныйВыбор, ТолькоАгрегаты, ТекущаяСтрока",
		Отбор, Истина, Истина, Истина, Ложь, Ложь, Объект.ТранспортноеСредство);
	ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ФормаВыбораТранспортногоСредства", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	ПроверитьКорректностьПериодаРабот();
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПриИзменении(Элемент)
	ПроверитьКорректностьПериодаРабот();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьСрокДействияПоУмолчанию();	
	УстановитьСвойстваЭлементовНовыхРеквизитовФормы(ЭтотОбъект);	
	ПриИзмененииДатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НадписьТаксировкаНажатие(Элемент, СтандартнаяОбработка)
	УчетГСМКлиент.ТаксировкаНажатие(ДокументТаксировка,ЭтаФорма,СтандартнаяОбработка);	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ДокументПолученПриИзменении(Элемент)
	Если Объект.ДокументПолучен Тогда
		Объект.ДатаПолученияБухгалтером = ОбщегоНазначенияКлиент.ДатаСеанса();
		Объект.ДокументПринялБухгалтер = ПользователиКлиентСервер.ТекущийПользователь();
	Иначе
		Объект.ДатаПолученияБухгалтером = "";
		Объект.ДокументПринялБухгалтер = "";
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПринимающийТСДиспетчерНарядчикПриИзменении(Элемент)
	Объект.ДатаПолученияДиспетчером = ОбщегоНазначенияКлиент.ДатаСеанса();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОВидахСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВидыСообщенияПриПеревозке = Новый СписокЗначений;
	ВидыСообщенияПриПеревозке.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщения.Городское"));
	ВидыСообщенияПриПеревозке.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщения.Пригородное"));
	ВидыСообщенияПриПеревозке.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСообщения.Междугородное"));
	
	ОповещениеПослеВыбораВидаСообщения = Новый ОписаниеОповещения("ЗаполнитьРезультатВыбораВидовСообщения", ЭтотОбъект);

	ВидыСообщенияПриПеревозке.ПоказатьОтметкуЭлементов(ОповещениеПослеВыбораВидаСообщения, "Выберите виды сообщения");
КонецПроцедуры

&НаКлиенте
Процедура СторонняяОрганизацияПроводитПредрейсовыйМедосмотрПриИзменении(Элемент)
	
	ИзменитьРеквизитыПредрейсовогоМедосмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура СторонняяОрганизацияПроводитПослерейсовыйМедосмотрПриИзменении(Элемент)
	
	ИзменитьРеквизитыПослерейсовогоМедосмотра();
	
КонецПроцедуры    

&НаКлиенте
Процедура ОрганизацияПроводящаяПредрейсовыйМедосмотрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр)Тогда  
				
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр,Объект.Дата);  
		Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = ЛицензияОрганизации; 
		
	КонецЕсли;
                                                                                    
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПроводящаяПослерейсовыйМедосмотрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр) Тогда 
				
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр,Объект.СрокДействия);
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
             
КонецПроцедуры

&НаКлиенте
Процедура ЛицоДопускающееВодителяПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.Организация,Объект.Дата);
		Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр = ЛицензияОрганизации;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
		
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.Организация,Объект.СрокДействия);
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр,Объект.Дата);
		Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровьяПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр) Тогда
		
		ЛицензияОрганизации = ЛицензияМедОрганизации(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр,Объект.СрокДействия);
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = ЛицензияОрганизации;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр, "Контрагент", "Предрейсовый");
	
КонецПроцедуры     

&НаКлиенте
Процедура ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.Организация, "Организация", "Предрейсовый");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.Организация, "Организация", "Послерейсовый");
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотрНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыборМедЛицензииОрганизации(Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр, "Контрагент", "Послерейсовый");
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыРаботыТС

&НаКлиенте
Процедура РезультатыРаботыТСКоличествоВремениРаботыТСВсегоСтрПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;

	Если Не УчетВремениКлиентСервер.ПроверитьФормат(ТекущиеДанные.КоличествоВремениРаботыТСВсегоСтр) Тогда
		ТекущиеДанные.КоличествоВремениРаботыТСВсегоСтр = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Значение поля ""Отработано часов"" не соответствует формату ЧЧ:мм для строки %1.'"), ТекущиеДанные.НомерСтроки);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.КоличествоВремениРаботыТСВсего = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекущиеДанные.КоличествоВремениРаботыТСВсегоСтр);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСКоличествоВремениПростояСтрПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;

	Если Не УчетВремениКлиентСервер.ПроверитьФормат(ТекущиеДанные.КоличествоВремениПростояСтр) Тогда
		ТекущиеДанные.КоличествоВремениПростояСтр = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Значение поля ""Количество часов простоя"" не соответствует формату ЧЧ:мм для строки %1.'"), ТекущиеДанные.НомерСтроки);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.КоличествоВремениПростоя = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекущиеДанные.КоличествоВремениПростояСтр);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСПоказателиЗПНочныеЧасыСтрПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;

	Если Не УчетВремениКлиентСервер.ПроверитьФормат(ТекущиеДанные.ПоказателиЗПНочныеЧасыСтр) Тогда
		ТекущиеДанные.ПоказателиЗПНочныеЧасыСтр = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Значение поля ""Количество ночных часов"" не соответствует формату ЧЧ:мм для строки %1.'"), ТекущиеДанные.НомерСтроки);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.ПоказателиЗПНочныеЧасы = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекущиеДанные.ПоказателиЗПНочныеЧасыСтр);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСПоказателиЗПКоличествоВремениСтрПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;

	Если Не УчетВремениКлиентСервер.ПроверитьФормат(ТекущиеДанные.ПоказателиЗПКоличествоВремениСтр) Тогда
		ТекущиеДанные.ПоказателиЗПКоличествоВремениСтр = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Значение поля ""Количество часов на пробег"" не соответствует формату ЧЧ:мм для строки %1.'"), ТекущиеДанные.НомерСтроки);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.ПоказателиЗПКоличествоВремени = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекущиеДанные.ПоказателиЗПКоличествоВремениСтр);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСПрочееСверхурочноеВремяСтрПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;

	Если Не УчетВремениКлиентСервер.ПроверитьФормат(ТекущиеДанные.ПрочееСверхурочноеВремяСтр) Тогда
		ТекущиеДанные.ПрочееСверхурочноеВремяСтр = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Количество часов на прочие сверхурочные работы не соответствует формату ЧЧ:мм для строки %1.'"), ТекущиеДанные.НомерСтроки);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.ПрочееСверхурочноеВремя = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекущиеДанные.ПрочееСверхурочноеВремяСтр);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТССтоянкаНаЛинииСтрПриИзменении(Элемент)
	ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;

	Если Не УчетВремениКлиентСервер.ПроверитьФормат(ТекущиеДанные.СтоянкаНаЛинииСтр) Тогда
		ТекущиеДанные.СтоянкаНаЛинииСтр = "";
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Значение поля ""Стоянка на линии в часах"" не соответствует формату ЧЧ:мм для строки %1.'"), ТекущиеДанные.НомерСтроки);
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные.ПоказателиЗПСтоянкаНаЛинии = УчетВремениКлиентСервер.ЧислоИзСтроки(ТекущиеДанные.СтоянкаНаЛинииСтр);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСАдресОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокАдресов = СписокЧастоПосещаемыхАдресовТС(Объект.Организация, Объект.ТранспортноеСредство);
	
	ТекущаяСтрока = Элементы.РезультатыРаботыТС.ТекущиеДанные;
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораАдресОбъекта", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокАдресов, Элементы.РезультатыРаботыТС);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСНаименованиеОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСНаименованиеОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		СтруктураДанных = ПолучитьНаименованиеКонтрагента(ВыбранноеЗначение, Объект.Дата);
		ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;

		ТекущиеДанные.АдресОбъекта = СтруктураДанных.Адрес;
		ТекущиеДанные.КодОбъекта = СтруктураДанных.Код;
		ВыбранноеЗначение = ?(ЗначениеЗаполнено(СтруктураДанных.НаименованиеСокращенное),СтруктураДанных.НаименованиеСокращенное,СтруктураДанных.НаименованиеПолное);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РезультатыРаботыТСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.РезультатыРаботыТС.ТекущиеДанные;
	ОбновитьТекстЗаголовковВСтрокеТаблицыРезультатыРаботыТС(ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаданиеВодителю

&НаКлиенте
Процедура ЗаданиеВодителюПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ  Тогда
		Если НоваяСтрока И Объект.ЗаданиеВодителю.Количество()=1 Тогда
			ТекущаяСтрока = Элементы.ЗаданиеВодителю.ТекущиеДанные;
			ТекущаяСтрока.ПоказанияСпидометраПриВыезде = ПоказанияСпидометраПриВыезде;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ Тогда
		Если НоваяСтрока И Объект.ЗаданиеВодителю.Количество()=1 Тогда
			ТекущаяСтрока = Элементы.ЗаданиеВодителю.ТекущиеДанные;
			ТекущаяСтрока.НаличиеГорючегоПриВыезде = ОстатокГорючегоПриВыезде
		КонецЕсли;
	КонецЕсли;
	
	Если НоваяСтрока И Объект.ЗаданиеВодителю.Количество()>11 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В печатной форме путевого листа отразится только 11 строк. Данная строка %1 в списке.'"), Объект.ЗаданиеВодителю.Количество());
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ЗаданиеВодителю.ТекущиеДанные;
	ОбновитьТекстЗаголовковВСтрокеТаблицыЗаданиеВодителю(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюНаличиеГорючегоПриВыездеПриИзменении(Элемент)
	ПерерасчетРасходаГорючего();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюВыданоБензинаПриИзменении(Элемент)
	ПерерасчетРасходаГорючего();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюВыданоДТПриИзменении(Элемент)
	ПерерасчетРасходаГорючего();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюВыданоИногоГорючегоПриИзменении(Элемент)
	ПерерасчетРасходаГорючего();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюОстатокГорючегоПриВозвращенииПриИзменении(Элемент)
	ПерерасчетРасходаГорючего();
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюАдресОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СписокАдресов = СписокЧастоПосещаемыхАдресовТС(Объект.Организация, Объект.ТранспортноеСредство);
	
	ТекущаяСтрока = Элементы.ЗаданиеВодителю.ТекущиеДанные;
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораАдресаЗаказчика", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокАдресов, Элементы.ЗаданиеВодителю);
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюНаименованиеОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюНаименованиеОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		СтруктураДанных = ПолучитьНаименованиеКонтрагента(ВыбранноеЗначение, Объект.Дата);
		ТекущиеДанные = Элементы.ЗаданиеВодителю.ТекущиеДанные;

		ТекущиеДанные.АдресОбъекта = СтруктураДанных.Адрес;
		ВыбранноеЗначение = ?(ЗначениеЗаполнено(СтруктураДанных.НаименованиеСокращенное),СтруктураДанных.НаименованиеСокращенное,СтруктураДанных.НаименованиеПолное);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтветственныеЗаГруз

&НаКлиенте
Процедура ОтветственныеЗаГрузПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Объект.ОтветственныеЗаГруз.Количество()>2 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В печатной форме путевого листа отразится только 2 строки. Данная строка %1 в списке.'"), Объект.ОтветственныеЗаГруз.Количество());
		Сообщение.Сообщить();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ОтветственныеЗаГруз.ТекущиеДанные;
	ОбновитьТекстЗаголовковВСтрокеТаблицыОтветственныеЗаГруз(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаГрузФИООтветственногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец",Объект.Организация);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаГрузФИООтветственногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		ТекущаяСтрока = Элементы.ОтветственныеЗаГруз.ТекущиеДанные;

		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", ВыбранноеЗначение, Объект.Дата);
		СотрудникСтруктура = ПолучитьДанныеСотрудника(ДанныеСотрудника);
		 
		ТекущаяСтрока.ДолжностьОтветственного = СотрудникСтруктура.Должность;
		ФамилияИнициалы = КорреспондентыКлиентСервер.ФИО(СотрудникСтруктура, Ложь);
		ВыбранноеЗначение = ФамилияИнициалы;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаГрузДолжностьОтветственногоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаГрузДолжностьОтветственногоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена И ВыбранноеЗначение <> Неопределено Тогда
		ТекущиеДанные = Элементы.ОтветственныеЗаГруз.ТекущиеДанные;   
		ТекущиеДанные.ДолжностьОтветственного = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаГрузДолжностьОтветственногоОтЗаказчикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Должности.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЗаГрузДолжностьОтветственногоОтЗаказчикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена И ВыбранноеЗначение <> Неопределено Тогда
		ТекущиеДанные = Элементы.ОтветственныеЗаГруз.ТекущиеДанные;   
		ТекущиеДанные.ДолжностьОтветственногоОтЗаказчика = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТакелажники

&НаКлиенте
Процедура ТакелажникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Объект.Такелажники.Количество()>2 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В печатной форме путевого листа отразится только 2 строки. Данная строка %1 в списке.'"), Объект.Такелажники.Количество());
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТакелажникиФамилияИнициалыТакелажникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Владелец",Объект.Организация);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);

	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТакелажникиФамилияИнициалыТакелажникаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> КодВозвратаДиалога.Отмена Тогда
		ТекущаяСтрока = Элементы.Такелажники.ТекущиеДанные;

		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", ВыбранноеЗначение, Объект.Дата);
		СотрудникСтруктура = ПолучитьДанныеСотрудника(ДанныеСотрудника);
		
		ВыбранноеЗначение = КорреспондентыКлиентСервер.ФИО(СотрудникСтруктура, Ложь);
		 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура УстановитьПериодРабот(Команда)
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",	Объект["НачалоПериода"]);
	СтруктураПараметров.Вставить("КонецПериода",	Объект["КонецПериода"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПослерейсовыйМедосмотр(Команда)
	
	Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр 	= Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр;
	Объект.ЗаполнятьОтметкуОПослерейсовомМедосмотре				= Объект.ЗаполнятьОтметкуОПредрейсовомМедосмотре;
 
	Если Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда 
		
		Объект.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 	= Объект.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр 						= Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр;
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр			 	= Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр;

	Иначе 
		
		Объект.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья = Объект.ЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр  = Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр;
				
	КонецЕсли;
	
	ИзменитьРеквизитыПослерейсовогоМедосмотра();
		
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура УстановитьНомераТС()
	Объект.РегистрационныйНомернойЗнак = УчетГСМ.ПолучитьГосударственныйНомернойЗнакТС(Объект.ТранспортноеСредство); 
	Объект.ГаражныйНомер = УчетГСМ.ПолучитьГаражныйНомерТС(Объект.ТранспортноеСредство);
КонецПроцедуры	

&НаСервере
Процедура ПоказатьКоличествоВремени()
	Для Каждого Строка Из Объект.РезультатыРаботыТС Цикл
		Строка.КоличествоВремениРаботыТСВсегоСтр = УчетВремениКлиентСервер.ЧислоВСтроку(Строка.КоличествоВремениРаботыТСВсего);
		Строка.КоличествоВремениПростояСтр = УчетВремениКлиентСервер.ЧислоВСтроку(Строка.КоличествоВремениПростоя);
		Строка.ПоказателиЗПНочныеЧасыСтр = УчетВремениКлиентСервер.ЧислоВСтроку(Строка.ПоказателиЗПНочныеЧасы);
		Строка.ПоказателиЗПКоличествоВремениСтр = УчетВремениКлиентСервер.ЧислоВСтроку(Строка.ПоказателиЗПКоличествоВремени);
		Строка.ПрочееСверхурочноеВремяСтр = УчетВремениКлиентСервер.ЧислоВСтроку(Строка.ПрочееСверхурочноеВремя);
		Строка.СтоянкаНаЛинииСтр = УчетВремениКлиентСервер.ЧислоВСтроку(Строка.ПоказателиЗПСтоянкаНаЛинии);
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Функция ПолучитьДанныеСотрудника(ДанныеСотрудника)
	Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);

	Возврат ДанныеСотрудника;
КонецФункции

&НаКлиенте
Процедура ПроверитьКорректностьПериодаРабот()
	Если НЕ(Объект.НачалоПериода = Дата(1,1,1) ИЛИ Объект.КонецПериода = Дата(1,1,1)) Тогда
		Если Объект.НачалоПериода>Объект.КонецПериода Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Дата начала периода работ %1 больше даты окончания периода работ %2.'"), Формат(Объект.НачалоПериода,"ДФ=""дд.ММ.гггг"""), Формат(Объект.КонецПериода,"ДФ=""дд.ММ.гггг"""));
			Сообщение.Сообщить();
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьСрокДействияПоУмолчанию()
	Если (КонецДня(Объект.Дата) > КонецДня(Объект.СрокДействия))ИЛИ(Объект.СрокДействия = Дата(1,1,1)) Тогда
		Объект.СрокДействия = КонецДня(Объект.Дата);
	КонецЕсли;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТекстПроТаксировку()
	УчетГСМ.ЗаполнитьТекстПроТаксировку(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПерерасчетРасходаГорючего()
	Стр = Элементы.ЗаданиеВодителю.ТекущиеДанные;

	КоличествоЗаполненыхГраф = 0;
	Если Стр.ВыданоБензина <> 0 Тогда
		КоличествоЗаполненыхГраф  = КоличествоЗаполненыхГраф + 1;
	КонецЕсли;	
	Если Стр.ВыданоДТ <> 0 Тогда
		КоличествоЗаполненыхГраф  = КоличествоЗаполненыхГраф + 1;
	КонецЕсли;	
	Если Стр.ВыданоИногоГорючего <> 0 Тогда
		КоличествоЗаполненыхГраф  = КоличествоЗаполненыхГраф + 1;
	КонецЕсли;	
	
	ФактическийРасходБензина = 0;
	ФактическийРасходДТ = 0;
	ФактическийРасходИногоГорючего = 0;
	
	Если КоличествоЗаполненыхГраф > 1 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='В табличной части ""Задание водителю"" для одной строки указано количество для различных видов топлив,
		|что не позволяет произвести расчет остатка. Внесите исправление для некорректной строки.'");
		Сообщение.Сообщить();
	Иначе	
		
		Для каждого ТекущаяСтрока Из Объект.ЗаданиеВодителю Цикл
			Если ТекущаяСтрока.ВыданоБензина <> 0 Тогда
				РасходГорючегоПоФакту = ТекущаяСтрока.НаличиеГорючегоПриВыезде - ТекущаяСтрока.ОстатокГорючегоПриВозвращении + ТекущаяСтрока.ВыданоБензина;
				ФактическийРасходБензина = ФактическийРасходБензина + РасходГорючегоПоФакту;
			КонецЕсли;	
			Если ТекущаяСтрока.ВыданоДТ <> 0 Тогда
				РасходГорючегоПоФакту = ТекущаяСтрока.НаличиеГорючегоПриВыезде - ТекущаяСтрока.ОстатокГорючегоПриВозвращении + ТекущаяСтрока.ВыданоДТ;
				ФактическийРасходДТ = ФактическийРасходДТ+РасходГорючегоПоФакту;
			КонецЕсли;	
			Если Стр.ВыданоИногоГорючего <> 0 Тогда
				РасходГорючегоПоФакту = ТекущаяСтрока.НаличиеГорючегоПриВыезде - ТекущаяСтрока.ОстатокГорючегоПриВозвращении + ТекущаяСтрока.ВыданоИногоГорючего;
				ФактическийРасходИногоГорючего = ФактическийРасходИногоГорючего + РасходГорючегоПоФакту;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	
	Объект.ФактическийРасходБензина = ФактическийРасходБензина;
	Объект.ФактическийРасходДТ = ФактическийРасходДТ;
	Объект.ФактическийРасходИногоГорючего = ФактическийРасходИногоГорючего;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьПослеВыбораАдресаЗаказчика(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ЗаданиеВодителю.ТекущиеДанные.АдресОбъекта = УчетГСМКлиент.ПодготовитьСтрокуАдреса(ВыбранныйЭлемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораАдресОбъекта(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.РезультатыРаботыТС.ТекущиеДанные.АдресОбъекта = УчетГСМКлиент.ПодготовитьСтрокуАдреса(ВыбранныйЭлемент);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРежимыЗаполненияДанных()
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Ссылка));
	СтруктураРежимовЗаполнения = УчетГСМ.РежимыНастроекЗаполненияДокумента(Объект.Организация, Перечисления.ВидыОбъектовРасходаГСМ.ТранспортныеСредства, ИдентификаторДокумента, Объект.ТранспортноеСредство);
	ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ;
	ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ;
	ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ;
	ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ = СтруктураРежимовЗаполнения.ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЗаполненияДокумента(ОсновноеСредство)
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Объект.Ссылка));
	ТаблицаНастроек = УчетГСМ.ДанныеНастроекЗаполненияДокумента(Объект.Организация, Перечисления.ВидыОбъектовРасходаГСМ.ТранспортныеСредства, ИдентификаторДокумента, ОсновноеСредство);
	
	Для Каждого ТекСтрока Из ТаблицаНастроек Цикл
		ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ = ТекСтрока.ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ;
		ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ = ТекСтрока.ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ;
		ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ = ТекСтрока.ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ;
		ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ = ТекСтрока.ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ;
		
		Объект.Водитель = ТекСтрока.Водитель;
		Объект.Заказчик = ТекСтрока.Заказчик;
		
		Объект.НачалоПериода = ТекСтрока.НачалоПериода;
		Объект.КонецПериода = ТекСтрока.КонецПериода;
		Объект.СтоимостьОдногоМашиноЧаса = ТекСтрока.СтоимостьОдногоМашиноЧаса;
		Объект.Участок = ТекСтрока.Участок;
		Объект.КодВидаОперации = ТекСтрока.КодВидаОперации;
		Объект.Прораб = ТекСтрока.Прораб;
		Объект.РуководительПодразделения = ТекСтрока.РуководительПодразделения;
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
			Объект.ВидПеревозки = ТекСтрока.ВидПеревозки;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.СведенияОВидахСообщения) Тогда
			Объект.СведенияОВидахСообщения = ТекСтрока.СведенияОВидахСообщения;
			Если НЕ ЗначениеЗаполнено(ТекСтрока.СведенияОВидахСообщения) Тогда
				Объект.СведенияОВидахСообщения = СокрЛП(ТекСтрока.ВидСообщения);
			КонецЕсли;	
		КонецЕсли;
		
		Прервать;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеОПоказанияхСпидометра()
	ПредыдущийПутевойЛист = УчетГСМ.НайтиПредыдущийПутевойЛист(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата);
	
	ДанныеСпидометра = УчетГСМ.ПоказанияСпидометраПоПутевомуЛисту(ПредыдущийПутевойЛист);
	
	Если ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ Тогда
		ДанныеСпидометра = УчетГСМ.ПоказанияСпидометраРасчетные(ПредыдущийПутевойЛист);
		ПоказанияСпидометраПриВыезде = ДанныеСпидометра;
	ИначеЕсли ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ Тогда
		ПоказанияСпидометраПриВыезде = ДанныеСпидометра;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеОбОстаткахГорючего()
	Если НЕ ЗначениеЗаполнено(ПредыдущийПутевойЛист) Тогда
		ПредыдущийПутевойЛист = УчетГСМ.НайтиПредыдущийПутевойЛист(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата);
	КонецЕсли;
	
	ДанныеГорючего = УчетГСМ.ОстаткиГорючегоПоПутевомуЛисту(ПредыдущийПутевойЛист);
	
	Если ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ Тогда
		ЗаполнитьДанныеТаксировкиОГорючемПриВозвращении(ПредыдущийПутевойЛист);
	ИначеЕсли ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ Тогда
		Для Каждого ТекСтрока Из ДанныеГорючего Цикл
			
			ВариантГСМ = ТекСтрока.ВариантГСМ;
			
			НоваяСтрока = Объект.ЗаданиеВодителю.Добавить();
			Если ВариантГСМ = 1 Тогда
				НоваяСтрока.ВыданоБензинВидГСМ = ТекСтрока.ВидГСМ;
			ИначеЕсли ВариантГСМ = 2 Тогда
				НоваяСтрока.ВыданоДТВидГСМ = ТекСтрока.ВидГСМ;
			ИначеЕсли ВариантГСМ = 3 Тогда
				НоваяСтрока.ВыданоИногоГорючегоВидГСМ = ТекСтрока.ВидГСМ;
			КонецЕсли;
			НоваяСтрока.НаличиеГорючегоПриВыезде = ТекСтрока.ОстатокГСМ;
		КонецЦикла;
		ОбновитьТекстЗаголовковВсехСтрокТаблицыЗаданиеВодителю(ЭтаФорма);
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДанныеТаксировкиОГорючемПриВозвращении(ПутевойЛистТС)
	
	ОстатокГСМ = 0;
	
	ДанныеГорючего = УчетГСМ.ДвиженияГорючегоРасчетные(ПутевойЛистТС);
	
	Для каждого ТекСтрока Из ДанныеГорючего Цикл
		Если ТекСтрока.ВидГСМ.ТипГСМ = Перечисления.ТипыГСМ.Горючее Тогда
			ОстатокГСМ = ОстатокГСМ + ТекСтрока.ОстатокГорючегоПриВозвращении;
		КонецЕсли;	
	КонецЦикла;	
	
	ОстатокГорючегоПриВыезде = ОстатокГСМ;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыЗаданиеВодителю(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.ЗаданиеВодителю Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыЗаданиеВодителю(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыЗаданиеВодителю(ТекущаяСтрока)

	ТекущаяСтрока.НаименованиеОбъектаЗаголовок = НСтр("ru = 'наименование:'");
	ТекущаяСтрока.АдресОбъектаЗаголовок = НСтр("ru = 'адрес:'");
	ТекущаяСтрока.ВыездЗаголовок = НСтр("ru = 'выезд:'");
	ТекущаяСтрока.ВозвращениеЗаголовок = НСтр("ru = 'возвращение:'");
	ТекущаяСтрока.ВидБензинаЗаголовок = НСтр("ru = 'вид ГСМ:'");
	ТекущаяСтрока.БензинВыданоЗаголовок = НСтр("ru = 'выдано:'");
	
	ТекущаяСтрока.ВидДизельногоТопливаЗаголовок = НСтр("ru = 'вид ГСМ:'");
	ТекущаяСтрока.ДизельноеТопливоВыданоЗаголовок = НСтр("ru = 'выдано:'");
	
	ТекущаяСтрока.ВидИногоГорючегоЗаголовок = НСтр("ru = 'вид ГСМ:'");
	ТекущаяСтрока.ИноеГорючееВыданоЗаголовок = НСтр("ru = 'выдано:'");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыОтветственныеЗаГруз(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.ОтветственныеЗаГруз Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыОтветственныеЗаГруз(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыОтветственныеЗаГруз(ТекущаяСтрока)

	ТекущаяСтрока.ОтветственныйОтВладельцаФИОЗаголовок = НСтр("ru = 'ФИО:'");
	ТекущаяСтрока.ОтветственныйОтВладельцаДолжностьЗаголовок = НСтр("ru = 'должность:'");
	ТекущаяСтрока.ОтветственныйОтЗаказчикаФИОЗаголовок = НСтр("ru = 'ФИО:'");
	ТекущаяСтрока.ОтветственныйОтЗаказчикаДолжностьЗаголовок = НСтр("ru = 'должность:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыРезультатыРаботыТС(Форма)

	Объект = Форма.Объект;
	
	Для Каждого ТекущаяСтрока Из Объект.РезультатыРаботыТС Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыРезультатыРаботыТС(ТекущаяСтрока);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыРезультатыРаботыТС(ТекущаяСтрока)

	ТекущаяСтрока.НачалоРаботыЗаголовок = НСтр("ru = 'начало:'");
	ТекущаяСтрока.ОкончаниеРаботыЗаголовок = НСтр("ru = 'окончание:'");
	
	ТекущаяСтрока.НаименованиеОбъектаЗаголовок = НСтр("ru = 'наименование:'");
	ТекущаяСтрока.АдресОбъектаЗаголовок = НСтр("ru = 'адрес:'");
	ТекущаяСтрока.КодОбъектаЗаголовок = НСтр("ru = 'код:'");
	
	ТекущаяСтрока.КодЭтапаРаботыЗаголовок = НСтр("ru = 'код этапа:'");
	ТекущаяСтрока.КодВидаРаботыЗаголовок = НСтр("ru = 'код вида:'");
	
	ТекущаяСтрока.ВремяРаботыЗаголовок = НСтр("ru = 'время:'");
	ТекущаяСтрока.СтоимостьРаботыЗаголовок = НСтр("ru = 'стоимость:'");
	
	ТекущаяСтрока.ПричинаЗаголовок = НСтр("ru = 'причина:'");
	ТекущаяСтрока.КодПричиныЗаголовок = НСтр("ru = 'код причины:'");
	
	ТекущаяСтрока.КодВиновникаЗаголовок = НСтр("ru = 'код виновника:'");
	ТекущаяСтрока.ВремяПростояЗаголовок = НСтр("ru = 'время простоя:'");
	
	ТекущаяСтрока.НочныеЧасыЗаголовок = НСтр("ru = 'ночные часы:'");
	ТекущаяСтрока.СтоянкаЗаголовок = НСтр("ru = 'стоянка на линии:'");
	
	ТекущаяСтрока.ПробегЧасыЗаголовок = НСтр("ru = 'пробег, ч. мин.:'");
	ТекущаяСтрока.ПробегКмЗаголовок = НСтр("ru = 'пробег, км:'");
	
	ТекущаяСтрока.КодВидаОплатыЗаголовок = НСтр("ru = 'код вида оплаты:'");
	ТекущаяСтрока.ЧасыОплатыЗаголовок = НСтр("ru = 'часы оплаты:'");
	ТекущаяСтрока.ПрочиеЗаголовок = НСтр("ru = 'прочие (сверхурочные выходные и т.п.):'");
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	ОбновитьТекстЗаголовковВсехСтрокТаблицыЗаданиеВодителю(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОтветственныеЗаГруз(ЭтаФорма);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыРезультатыРаботыТС(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["НачалоПериода"]	= РезультатВыбора["НачалоПериода"];
		Объект["КонецПериода"]	= РезультатВыбора["КонецПериода"];
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТранспортноеСредствоПриИзмененииНаСервере()
	
	УстановитьНомераТС();
	ЗаполнитьНастройкиЗаполненияДокумента(Объект.ТранспортноеСредство);
	Объект.НомерСмены = УчетГСМ.НомерСменыДляПутевогоЛиста(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата) + 1;
	
	//заполнение показаний спидометра при выезде
	Если ЗаполнятьПоказанияСпидометраПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьПоказанияСпидометраПоДаннымТаксировкиПоследнегоПЛ Тогда
		Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
			ЗаполнитьДанныеОПоказанияхСпидометра();
		КонецЕсли;	
	КонецЕсли;
	
	//заполнение остатков горючего
	Если ЗаполнятьОстатокГорючегоПоДаннымПоследнегоПЛ ИЛИ ЗаполнятьОстатокГорючегоПоДаннымТаксировкиПоследнегоПЛ Тогда
		Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда 
			ЗаполнитьДанныеОбОстаткахГорючего();
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		Объект.ВидПеревозки = УчетГСМ.ДанныеСведенийОПеревозкеПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВодителя();
	
КонецПроцедуры	

&НаСервере
Функция СписокЧастоПосещаемыхАдресовТС(Организация, ТС)
	Возврат УчетГСМ.СписокЧастоПосещаемыхАдресовТС(Организация, ТС);
КонецФункции
	
&НаСервере
Функция ПолучитьНаименованиеКонтрагента(Заказчик, НаДату)
	Возврат УчетГСМ.ПолучитьНаименованиеКонтрагента(Заказчик, НаДату);
КонецФункции

&НаСервере
Процедура ПриИзмененииДатыНаСервере()
	
	Объект.НомерСмены = УчетГСМ.НомерСменыДляПутевогоЛиста(Объект.Ссылка, Объект.ТранспортноеСредство, Объект.Дата) + 1;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВодителя()
	Если НЕ ЗначениеЗаполнено(Объект.ТранспортноеСредство)
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли;	
	ТаблицаВодителей = УчетГСМ.ДанныеНастроекВодителиТС(Объект.Организация, Объект.ТранспортноеСредство);
	Элементы.Водитель.СписокВыбора.Очистить();
	Для каждого ТекСтрока Из ТаблицаВодителей Цикл
		Элементы.Водитель.СписокВыбора.Добавить(ТекСтрока.Водитель);
	КонецЦикла;
КонецПроцедуры		

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПроверитьДанныеПутевогоЛиста()
	Если НачалоДня(Объект.Дата) >= Дата(2021,1,1) Тогда
		Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
			МодельТС = МодельТС();
			Если НЕ ЗначениеЗаполнено(МодельТС) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru='Не заполнена модель транспортного средства в сведениях паспорта. 
					|Чтобы заполненить эти сведения для соответствующего элемента справочника ""Основные средства"" (реквизит ""Транспортное средство"")
					|следует перейти по ссылке для реквизита ""Паспорт транспортного средства"" на закладке ""Инвентарный объект"".'");
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция МодельТС()
	Возврат УчетГСМ.ПолучитьМодельТС(Объект.ТранспортноеСредство);
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовНовыхРеквизитовФормы(Форма)
	Объект = Форма.Объект;

	Если Объект.Дата < Дата('2023.03.01') Тогда
		ВидимостьРеквизитов2023 = Ложь;
	Иначе
		ВидимостьРеквизитов2023 = Истина;
	КонецЕсли;	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СведенияОПеревозке", "Видимость", НЕ ВидимостьРеквизитов2023);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаВидПеревозки", "Видимость", ВидимостьРеквизитов2023);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ВидСообщения", "Видимость", ВидимостьРеквизитов2023);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СведенияОВидахСообщения", "Видимость", ВидимостьРеквизитов2023);
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуДляВидаПеревозки(Форма, ИмяРеквизита, ГруппаРеквизита)
	
	ИмяКоманды = "Заполнить" + ИмяРеквизита;  
	Команда = Форма.Команды.Добавить(ИмяКоманды);
	Команда.Отображение = ОтображениеКнопки.Картинка;
	Команда.Действие = "ОбработкаНажатияКнопкиЗаполненияВидаПеревозки";
	
	Элемент = Форма.Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"), ГруппаРеквизита);
	Элемент.ИмяКоманды = ИмяКоманды;
	
	Элемент.Заголовок = НСтр("ru = 'Заполнить'");
	Команда.Подсказка = НСтр("ru = 'Заполнить вид перевозки'");
	Команда.Картинка = БиблиотекаКартинок.ПереместитьВлево;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНажатияКнопкиЗаполненияВидаПеревозки(КомандаФормы)
	
	Элемент = ЭтаФорма.Элементы.Найти(КомандаФормы.Имя);
	СписокВидыПеревоок = УчетГСМКлиент.СписокВидыПеревозок();
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораВидаПеревозки", ЭтотОбъект, Новый Структура);
	Оповещение.ДополнительныеПараметры.Вставить("Элемент", Элемент);
	ЭтаФорма.ПоказатьВыборИзМеню(Оповещение, СписокВидыПеревоок, Элемент);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыполнитьПослеВыбораВидаПеревозки(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = Сред(ДополнительныеПараметры.Элемент.Имя,10);
	Объект[ИмяРеквизита] = ВыбранныйЭлемент; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатВыбораВидовСообщения(Элементы, Параметры) Экспорт
	Результат = "";
	ПероеЗначение = Истина;
	Если НЕ Элементы = Неопределено Тогда
		Для Каждого ВыбранныйВидСообщения Из Элементы Цикл
			Если ВыбранныйВидСообщения.Пометка Тогда
				Если ПероеЗначение Тогда
					НовыйРезультат = СтрШаблон("%1", СокрЛП(ВыбранныйВидСообщения.Значение));
					
					ПероеЗначение = Ложь;
				Иначе	
					НовыйРезультат = СтрШаблон("%1, %2", Результат, СокрЛП(ВыбранныйВидСообщения.Значение));
				КонецЕсли;
				Результат = НовыйРезультат;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	Если ЗначениеЗаполнено(Результат) Тогда
		Объект.СведенияОВидахСообщения = Результат;
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура УстановитьВидимостьЭлементовМедосмотра()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОрганизацияПроводящаяПредрейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья", "Видимость", Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоДопускающееВодителяПоСостояниюЗдоровья", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр);	
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ОрганизацияПроводящаяПослерейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр", "Видимость", Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр", "Видимость", НЕ Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр);	
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыПредрейсовогоМедосмотра()
	
	Если Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр Тогда
		
		Объект.ЛицоДопускающееВодителяПоСостояниюЗдоровья 			= Неопределено;
		Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр 	= Неопределено;
		
	Иначе

		Объект.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья 	= Неопределено;
		Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр 			= Неопределено;
		Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр 	= Неопределено;
		
	КонецЕсли; 
	
	УстановитьВидимостьЭлементовМедосмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыПослерейсовогоМедосмотра()
	
	Если Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда
		
		Объект.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья = Неопределено; 
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр 	= Неопределено;
		
	Иначе

		Объект.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 	= Неопределено; 
		Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр 						= Неопределено; 
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр				= Неопределено;
						
	КонецЕсли;  
	
	УстановитьВидимостьЭлементовМедосмотра();
	
КонецПроцедуры
 
&НаСервереБезКонтекста
Функция ЛицензияМедОрганизации(Организация, ДатаДокумента)
	
	МетаданныеОрганизации = Метаданные.НайтиПоТипу(ТипЗнч(Организация));
	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЛицензииНаПроведениеМедосмотров.Ссылка КАК Ссылка
	               |ИЗ
	               |	&Справочник КАК ЛицензииНаПроведениеМедосмотров
	               |ГДЕ
	               |	ЛицензииНаПроведениеМедосмотров.Владелец = &Владелец
				   |	И ЛицензииНаПроведениеМедосмотров.ДатаНачала <= &ДатаДокумента
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛицензииНаПроведениеМедосмотров.ДатаНачала УБЫВ"; 
	
	Если МетаданныеОрганизации.Имя = "Организации" Тогда
		
		СправочникЛицензий = "Справочник.ЛицензииНаПроведениеМедосмотровОрганизаций";
		
	ИначеЕсли МетаданныеОрганизации.Имя = "Контрагенты" Тогда
		
		СправочникЛицензий = "Справочник.ЛицензииНаПроведениеМедосмотровКонтрагентов";	

	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(Текст,"&Справочник", СправочникЛицензий);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса; 
	Запрос.УстановитьПараметр("Владелец", Организация);
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из Результат Цикл 
		Возврат ТекСтрока.Ссылка;
	КонецЦикла;

КонецФункции  

&НаСервере
Функция ПроверитьДатуМедЛицензий()
	
	Если Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр Тогда
		ОбъектПредрейсовойЛицензии = Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр;
	Иначе
		ОбъектПредрейсовойЛицензии 	= Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр;
	КонецЕсли;
	
	Если Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр Тогда
		ОбъектПослерейсовойЛицензии = Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр;
	Иначе
		ОбъектПослерейсовойЛицензии = Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр;
	КонецЕсли;
	
	ЛицензияНедействительна = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектПредрейсовойЛицензии) Тогда
		
		Если НачалоДня(ОбъектПредрейсовойЛицензии.ДатаНачала) > Объект.Дата Тогда
		 	ЛицензияНедействительна = Истина;
		ИначеЕсли КонецДня(ОбъектПредрейсовойЛицензии.ДатаОкончания) < Объект.Дата И НЕ ОбъектПредрейсовойЛицензии.ДатаОкончания = Дата(1,1,1) Тогда 
			ЛицензияНедействительна = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектПослерейсовойЛицензии) Тогда
		
		Если НачалоДня(ОбъектПослерейсовойЛицензии.ДатаНачала) > Объект.СрокДействия Тогда
		 	ЛицензияНедействительна = Истина;
		ИначеЕсли КонецДня(ОбъектПослерейсовойЛицензии.ДатаОкончания) < Объект.СрокДействия И НЕ ОбъектПослерейсовойЛицензии.ДатаОкончания = Дата(1,1,1) Тогда 
			ЛицензияНедействительна = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЛицензияНедействительна;

КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеМедосмотраДокумена()
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;
	КонецЕсли; 
	
	ТаблицаНастроекМедосмотра = УчетГСМ.ДанныеНастроекЗаполненияМедосмотраДокумента(Объект.Организация);
	
	Для Каждого ТекСтрока Из ТаблицаНастроекМедосмотра Цикл
		
		Объект.ЛицоДопускающееВодителяПоСостояниюЗдоровья 						= ТекСтрока.ЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 			= ТекСтрока.ЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья;
		Объект.ЗаполнятьОтметкуОПослерейсовомМедосмотре 						= ТекСтрока.ЗаполнятьОтметкуОПослерейсовомМедосмотре;
		Объект.ЗаполнятьОтметкуОПредрейсовомМедосмотре 							= ТекСтрока.ЗаполнятьОтметкуОПредрейсовомМедосмотре;
		Объект.ОрганизацияПроводящаяПослерейсовыйМедосмотр 						= ТекСтрока.ОрганизацияПроводящаяПослерейсовыйМедосмотр;
		Объект.ОрганизацияПроводящаяПредрейсовыйМедосмотр 						= ТекСтрока.ОрганизацияПроводящаяПредрейсовыйМедосмотр;
		Объект.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья 				= ТекСтрока.СтороннееЛицоДопускающееВодителяПоСостояниюЗдоровья;
		Объект.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья 	= ТекСтрока.СтороннееЛицоПринимающееВодителяПослеРейсаПоСостояниюЗдоровья;
		Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр 				= ТекСтрока.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр;
		Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр 				= ТекСтрока.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр;  
		Объект.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр 				= ТекСтрока.СторонняяОрганизацияПроводитПослерейсовыйМедосмотр;
		Объект.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр 				= ТекСтрока.СторонняяОрганизацияПроводитПредрейсовыйМедосмотр;
	    Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр				= ТекСтрока.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр;
		Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр				= ТекСтрока.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборМедЛицензииОрганизации(ПроводящаяОрганизация, ТипОрганизации, ТипМедосмотра)
 
	ДополнительныеПараметры = Новый Структура("ТипОрганизации, ТипМедосмотра", ТипОрганизации, ТипМедосмотра);
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьМедицинскуюЛицензиюПослеВыбора",ЭтотОбъект, ДополнительныеПараметры);
	
	СтруктураОтбора = Новый Структура; 
	СтруктураОтбора.Вставить("Владелец", ПроводящаяОрганизация);
	
	Если ТипМедосмотра = "Предрейсовый" Тогда
		ДатаДокумента = Объект.Дата;	
	ИначеЕсли  ТипМедосмотра = "Послерейсовый" Тогда
		ДатаДокумента = Объект.СрокДействия; 
	Иначе
		Возврат;
	КонецЕсли;  
		
	ДополнительныеПараметры.Вставить("ДатаДокумента", ДатаДокумента);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	
	Если ТипОрганизации = "Контрагент" Тогда
		НаименованиеСправочникаЛицензий = "ЛицензииНаПроведениеМедосмотровКонтрагентов";	
	ИначеЕсли ТипОрганизации = "Организация" Тогда
		НаименованиеСправочникаЛицензий = "ЛицензииНаПроведениеМедосмотровОрганизаций";
	Иначе
		Возврат;
	КонецЕсли;

	ОткрытьФорму(
	"Справочник." + НаименованиеСправочникаЛицензий + ".ФормаВыбора", ПараметрыФормы,
	,,,,Оповещение,
	);
 
 КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьМедицинскуюЛицензиюПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если ДополнительныеПараметры.ТипОрганизации = "Контрагент" И ДополнительныеПараметры.ТипМедосмотра = "Предрейсовый" Тогда
		
		  Объект.ЛицензияКонтрагентаПроводящегоПредрейсовыйМедосмотр = Результат;
		
	ИначеЕсли ДополнительныеПараметры.ТипОрганизации = "Контрагент" И ДополнительныеПараметры.ТипМедосмотра = "Послерейсовый" Тогда
		
		  Объект.ЛицензияКонтрагентаПроводящегоПослерейсовыйМедосмотр = Результат;
		
	ИначеЕсли ДополнительныеПараметры.ТипОрганизации = "Организация" И ДополнительныеПараметры.ТипМедосмотра = "Предрейсовый" Тогда

		  Объект.ЛицензияОрганизацииПроводящейПредрейсовыйМедосмотр = Результат;
		
	ИначеЕсли ДополнительныеПараметры.ТипОрганизации = "Организация" И ДополнительныеПараметры.ТипМедосмотра = "Послерейсовый" Тогда

		  Объект.ЛицензияОрганизацииПроводящейПослерейсовыйМедосмотр = Результат;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры 

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
