#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормы();
	
	УстановитьНовоеЗначениеКЭК = Ложь; 
	КЭК0 = БухгалтерскийУчетПовтИсп.КЭК0();
    СчетаРасчетовКИСЕ.ЗагрузитьЗначения(БухгалтерскийУчет.СписокСчетов(ПланыСчетов.ЕПСБУ.КодыСчетовРасчетовКИСЕ()));
	
	// Заполняем по возможности пустые поля формы:
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
		КонецЕсли;
		УстановитьНовоеЗначениеКЭК = Истина;
	КонецЕсли;

	ПроконтролироватьЗначениеКЭКСервер_ВоВсейТаблице(УстановитьНовоеЗначениеКЭК);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоЗаписьИзФормыДокумента", Истина);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьЗаголовокФормы();
	
	// Обновляем таблицу движений (актуально только при отмене проведения):
	ЭтаФорма.Прочитать();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Оповещаем форму Помощника ввода начальных остатков:
	ИмяСобытия = "ЗаписанДокументВводНачальныхОстатков";
	Параметр = Объект["Организация"];
	Оповестить(ИмяСобытия, Параметр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВводНачальныхОстатковКлиент.ПриОткрытии(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДвиженияЖурналПроводок

&НаКлиенте
Процедура ДвиженияЖурналПроводокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекДанные = Элементы["ДвиженияЖурналПроводок"].ТекущиеДанные;
		ТекДанные.Активность = Объект.Проведен;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКФОПриИзменении(Элемент)
	
	ТекущиеДанные	= Элементы["ДвиженияЖурналПроводок"].ТекущиеДанные;
	ТекСтрока		= Элементы["ДвиженияЖурналПроводок"].ТекущаяСтрока;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(Объект.Организация,
											   Объект.ИФО,
											   ТекущиеДанные.КФО,
											   ПолучитьДату(),
											   ТекущиеДанные.КПСДт,
											   ТекущиеДанные.КПСКт);
	//---
	// КЭК0
	//---
	КФОПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ,Элемент);
КонецПроцедуры

// ДЕБЕТ

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтПриИзменении(Элемент)
	
	ТекСтрока = Элементы["ДвиженияЖурналПроводок"].ТекущаяСтрока; 
	ТекДанные = Элементы["ДвиженияЖурналПроводок"].ТекущиеДанные;
	Если НЕ СчетаРасчетовКИСЕ.НайтиПоЗначению(ТекДанные.СчетДт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элементы.ДвиженияЖурналПроводокСубконтоДт1,,, Истина, Истина);  
	КонецЕсли;
	
	СчетДтПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.СчетДт, 
																			ТекущиеДанные.КПСДт, 
																			ТекущиеДанные.КФО), 
															Объект.Организация,
															Объект.ИФО,
															,
															ТекущиеДанные.КФО,
															,
															ПолучитьДату());
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетДтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПСДт,
															ТекущиеДанные.КФО,
															ТекущиеДанные.КЭКДт,);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКПСДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПСДт, 
													Объект.Организация,
													Объект.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.СчетДт,
													ПолучитьДату());
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКФОДтПриИзменении(Элемент)
	
	ТекСтрока = Элементы["ДвиженияЖурналПроводок"].ТекущаяСтрока;
	
	КФОДтПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭКДтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	Если ТекущиеДанные["ИспользоватьКЭК0Дт"] Тогда
		ОграниченияКЭК = Новый Массив();
		ОграниченияКЭК.Добавить(КЭК0);
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент,
								СтандартнаяОбработка,
								,// КЭК,
								,// Организация,
								,// ИФО,
								,// КФО,
								,// Счет,
								,// Дата,
								,// "Дт",
								ОграниченияКЭК);
	Иначе
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
									СтандартнаяОбработка,
									ТекущиеДанные.КЭКДт,
									Объект.Организация, 
									Объект.ИФО,
									ТекущиеДанные.КФО, 
	                                ТекущиеДанные.СчетДт,
									ПолучитьДату(),
									"Дт");
	КонецЕсли;
	
КонецПроцедуры
							
&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт1);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт2);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоДт3);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютаДтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаДт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаДт, ТекущиеДанные.ВалютаДт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютнаяСуммаДтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаДт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаДт, ТекущиеДанные.ВалютаДт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт1ПриИзменении(Элемент)
	Если СчетаРасчетовКИСЕ.НайтиПоЗначению(Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СчетДт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
	Иначе
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина, Истина);  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт2ПриИзменении(Элемент)
	Если СчетаРасчетовКИСЕ.НайтиПоЗначению(Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СчетДт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
	Иначе
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина, Истина);  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоДт3ПриИзменении(Элемент)
	Если СчетаРасчетовКИСЕ.НайтиПоЗначению(Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СчетДт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
	Иначе
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина, Истина);  
	КонецЕсли;
КонецПроцедуры

// КРЕДИТ

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтПриИзменении(Элемент)
	
	ТекСтрока = Элементы["ДвиженияЖурналПроводок"].ТекущаяСтрока; 
	ТекДанные = Элементы["ДвиженияЖурналПроводок"].ТекущиеДанные;
	Если НЕ СчетаРасчетовКИСЕ.НайтиПоЗначению(ТекДанные.СчетКт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элементы.ДвиженияЖурналПроводокСубконтоКт1,,, Истина, Истина);  
	КонецЕсли;
	
	СчетКтПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.СчетКт, 
																			ТекущиеДанные.КПСКт, 
																			ТекущиеДанные.КФО), 
															Объект.Организация,
															Объект.ИФО,
															,
															ТекущиеДанные.КФО,
															,
															ПолучитьДату());
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСчетКтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПСКт,
															ТекущиеДанные.КФО,
															,
															ТекущиеДанные.КЭККт);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКПСКтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													ТекущиеДанные.КПСКт, 
													Объект.Организация,
													Объект.ИФО,
													ТекущиеДанные.КФО,
													ТекущиеДанные.СчетКт,
													ПолучитьДату());
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКФОКтПриИзменении(Элемент)
	
	ТекСтрока = Элементы["ДвиженияЖурналПроводок"].ТекущаяСтрока;
	
	КФОКтПриИзмененииСервер(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокКЭККтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
    	
	Если ТекущиеДанные["ИспользоватьКЭК0Кт"] Тогда
		ОграниченияКЭК = Новый Массив();
		ОграниченияКЭК.Добавить(КЭК0);
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент,
								СтандартнаяОбработка,
								,// КЭК,
								,// Организация,
								,// ИФО,
								,// КФО,
								,// Счет,
								,// Дата,
								,// "Дт",
								ОграниченияКЭК);
	Иначе 
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
									СтандартнаяОбработка,
									ТекущиеДанные.КЭККт,
									Объект.Организация, 
									Объект.ИФО,
									ТекущиеДанные.КФО, 
	                                ТекущиеДанные.СчетКт,
									ПолучитьДату(),
									"Кт");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация, 
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт1);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт2);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СубконтоКт3);
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютаКтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаКт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаКт, ТекущиеДанные.ВалютаКт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокВалютнаяСуммаКтПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ДвиженияЖурналПроводок.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ВалютнаяСуммаКт) Тогда
		ТекущиеДанные.Сумма = ПересчитатьСуммуВРублях(ТекущиеДанные.ВалютнаяСуммаКт, ТекущиеДанные.ВалютаКт, Объект.Дата);
	Иначе
		ТекущиеДанные.Сумма = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт1ПриИзменении(Элемент)
	Если СчетаРасчетовКИСЕ.НайтиПоЗначению(Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СчетКт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
	Иначе
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина, Истина);  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт2ПриИзменении(Элемент)
	Если СчетаРасчетовКИСЕ.НайтиПоЗначению(Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СчетКт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
	Иначе
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина, Истина);  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияЖурналПроводокСубконтоКт3ПриИзменении(Элемент)
	Если СчетаРасчетовКИСЕ.НайтиПоЗначению(Элементы.ДвиженияЖурналПроводок.ТекущиеДанные.СчетКт) = Неопределено Тогда
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент);
	Иначе
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент,,, Истина, Истина);  
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьПризнакАгрегатора(Команда)
	
	ВводНачальныхОстатковКлиент.СнятьПризнакАгрегатора(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПересчитатьСуммуВРублях(ВалютнаяСумма, Валюта, Дата)
	
	КурсВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, Дата);
	
	Возврат РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
		ВалютнаяСумма, 
		Новый Структура("Валюта, Курс, Кратность", Валюта, КурсВалюты.Курс, КурсВалюты.Кратность),
		Новый Структура("Валюта, Курс, Кратность", Константы.ВалютаРегламентированногоУчета.Получить(), 1, 1));
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЗаголовокФормы = "Ввод начальных остатков по прочим счетам бух.учета ";
	Если Объект.Ссылка.Пустая() Тогда
		ЗаголовокФормы = ЗаголовокФормы + "(создание)";
	Иначе
		ЗаголовокФормы = ЗаголовокФормы + Объект.Номер + " от " + Объект.Дата;
	КонецЕсли;
	ЭтаФорма.Заголовок = ЗаголовокФормы;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДату()
	
	Возврат КонецГода(Объект.Дата) + 1;
	
КонецФункции

&НаСервере
Процедура УстановитьДатуДокумента()
	
	// Устанавливаем новую дату документа:
	Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Обработчики событий элементов формы

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	УстановитьДатуДокумента();
	
	ПроконтролироватьЗначениеКЭКСервер_ВоВсейТаблице(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииСервер()
	
	ПроконтролироватьЗначениеКЭКСервер_ВоВсейТаблице(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура КФОПриИзмененииСервер(ТекущаяСтрока)
	
	ПроконтролироватьЗначениеКЭКСервер_ВТекущейСтроке(ТекущаяСтрока, Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура КФОДтПриИзмененииСервер(ТекущаяСтрока)
	
	ПроконтролироватьЗначениеКЭКСервер_ВТекущейСтроке(ТекущаяСтрока, Истина, "Дт"); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура КФОКтПриИзмененииСервер(ТекущаяСтрока)
	
	ПроконтролироватьЗначениеКЭКСервер_ВТекущейСтроке(ТекущаяСтрока, Истина, "Кт"); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	ПроконтролироватьЗначениеКЭКСервер_ВоВсейТаблице(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура СчетДтПриИзмененииСервер(ТекущаяСтрока)
	
	ТекущиеДанные = Объект.Движения.ЖурналПроводокЕПСБУ.НайтиПоИдентификатору(ТекущаяСтрока);
	ТекущиеДанные.ЖурналОпераций = БухгалтерскиеОперации.НомерЖурнала(ТекущиеДанные.СчетДт, ТекущиеДанные.СчетКт);	
	
	ПроконтролироватьЗначениеКЭКСервер_ВТекущейСтроке(ТекущаяСтрока, Истина, "Дт"); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура СчетКтПриИзмененииСервер(ТекущаяСтрока)
	
	ТекущиеДанные = Объект.Движения.ЖурналПроводокЕПСБУ.НайтиПоИдентификатору(ТекущаяСтрока);
	ТекущиеДанные.ЖурналОпераций = БухгалтерскиеОперации.НомерЖурнала(ТекущиеДанные.СчетДт, ТекущиеДанные.СчетКт);
	
	ПроконтролироватьЗначениеКЭКСервер_ВТекущейСтроке(ТекущаяСтрока, Истина, "Кт"); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура ПроконтролироватьЗначениеКЭКСервер_ВТекущейСтроке(Знач СтрокаТаблицы, УстановитьНовоеЗначение, СторонаДтКт = "")
	
	Перем НовоеЗначениеКЭК;
	
	Если ТипЗнч(СтрокаТаблицы) = Тип("Число") Тогда
		СтрокаТаблицы = Объект.Движения.ЖурналПроводокЕПСБУ.НайтиПоИдентификатору(СтрокаТаблицы);
	КонецЕсли;
	
	ОбработатьСторонуДт = (ВРег(СторонаДтКт) = "ДТ" ИЛИ НЕ ЗначениеЗаполнено(СторонаДтКт));
	ОбработатьСторонуКт = (ВРег(СторонаДтКт) = "КТ" ИЛИ НЕ ЗначениеЗаполнено(СторонаДтКт));
	
	Если ОбработатьСторонуДт И СчетаРасчетовКИСЕ.НайтиПоЗначению(СтрокаТаблицы.СчетДт) = Неопределено Тогда
		Если Документы.ВводНачальныхОстатков.НеобходимоИзменитьЗначениеКЭК(
			Объект["Организация"],
			Объект["ИФО"],
			СтрокаТаблицы["КФО"],
			Объект["Дата"],
			СтрокаТаблицы["СчетДт"],
			СтрокаТаблицы["КЭКДт"],
			"Дт",
			СтрокаТаблицы["ИспользоватьКЭК0Дт"],
			НовоеЗначениеКЭК) Тогда
			Если УстановитьНовоеЗначение = Истина Тогда
				СтрокаТаблицы["КЭКДт"] = НовоеЗначениеКЭК;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбработатьСторонуКт И СчетаРасчетовКИСЕ.НайтиПоЗначению(СтрокаТаблицы.СчетКт) = Неопределено Тогда
		Если Документы.ВводНачальныхОстатков.НеобходимоИзменитьЗначениеКЭК(
			Объект["Организация"],
			Объект["ИФО"],
			СтрокаТаблицы["КФО"],
			Объект["Дата"],
			СтрокаТаблицы["СчетКт"],
			СтрокаТаблицы["КЭККт"],
			"Кт",
			СтрокаТаблицы["ИспользоватьКЭК0Кт"],
			НовоеЗначениеКЭК) Тогда
			Если УстановитьНовоеЗначение = Истина Тогда
				СтрокаТаблицы["КЭККт"] = НовоеЗначениеКЭК;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроконтролироватьЗначениеКЭКСервер_ВоВсейТаблице(УстановитьНовоеЗначение, СторонаДтКт = "")
	
	Перем НовоеЗначениеКЭК;
	
	Для Каждого СтрокаТаблицы Из Объект.Движения.ЖурналПроводокЕПСБУ Цикл
		ПроконтролироватьЗначениеКЭКСервер_ВТекущейСтроке(СтрокаТаблицы, УстановитьНовоеЗначение, СторонаДтКт);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

#КонецОбласти

