&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьДанные();
	
	НастроитьФормуСервер_ПоРежимуРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовкаСообщений = НСтр("ru='Аналитика затрат по КФО'");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СчетаДебета
&НаКлиенте
Процедура СчетаДебетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СчетаДебетаПередУдалением(Элемент, Отказ)
	
	Если НЕ Параметры.РежимЗаполненияПоКФОиКПС Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаДебетаСчетДтПриИзменении(Элемент)
	
	ТекДанные = Элементы["СчетаДебета"].ТекущиеДанные;
	
	СвойстваСчета = ПолучитьСвойстваСчета(ТекДанные["СчетДт"]);
	
	НомерСубконто	= СвойстваСчета["НомерСубконтоВидыЗатрат"];
	КЭКДт			= СвойстваСчета["КЭКДт"];
	
	Если ЗначениеЗаполнено(НомерСубконто) Тогда
		ТекДанные["СубконтоДт" + НомерСубконто] = ВидЗатрат;
	КонецЕсли;
	
	ТекДанные["КЭКСчетаДебета"] = КЭКДт;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаДебетаКЭКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы["СчетаДебета"].ТекущиеДанные;
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент,
		СтандартнаяОбработка,
		ТекДанные["КЭКСчетаДебета"],
		Организация,
		ИФО,
		ТекДанные["КФО"],
        ТекДанные["СчетДт"],
		Дата,
		"Дт");
	
КонецПроцедуры
							
&НаКлиенте
Процедура СчетаДебетаСубконтоДт1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы["СчетаДебета"].ТекущиеДанные;
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,
		ДанныеВыбора,
		СтандартнаяОбработка,
		Организация,
		ТекДанные["СубконтоДт1"],
		,
		"СубконтоДт");
КонецПроцедуры
&НаКлиенте
Процедура СчетаДебетаСубконтоДт2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы["СчетаДебета"].ТекущиеДанные;
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,
		ДанныеВыбора,
		СтандартнаяОбработка,
		Организация,
		ТекДанные["СубконтоДт2"],
		,
		"СубконтоДт");
КонецПроцедуры
&НаКлиенте
Процедура СчетаДебетаСубконтоДт3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекДанные = Элементы["СчетаДебета"].ТекущиеДанные;
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,
		ДанныеВыбора,
		СтандартнаяОбработка,
		Организация,
		ТекДанные["СубконтоДт3"],
		,
		"СубконтоДт");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ВозвращаемоеЗначение = СформироватьВозвращаемоеЗначение();
	
	Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидЗатрат(Команда)
	
	ПроверитьИЗаполнитьВидЗатратКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьДанные()
	
	Если Параметры.РежимЗаполненияПоКФОиКПС Тогда
		
		ВходящиеДанные = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВходящиеДанные, "Дата, Организация, ИФО, ВидЗатрат");
		
		СчетаДебета.Загрузить(ВходящиеДанные["СчетаДебета"]);
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.СтруктураДанных, "Дата, Организация, ИФО");
		
		НоваяСтрока = СчетаДебета.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры.СтруктураДанных["ТекущиеДанные"]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_ПоРежимуРаботы()
	
	Если Параметры.РежимЗаполненияПоКФОиКПС Тогда
		
		Заголовок = НСтр("ru='Аналитика затрат по КФО и КПС'");
		
		Элемент = Элементы["СчетаДебетаКФО"];
		Элемент.ЦветФонаЗаголовка = ЦветаСтиля.НедоступныеДанныеЦвет;
		Элемент.ТолькоПросмотр = Истина;
		
		Элемент = Элементы["СчетаДебетаКПС"];
		Элемент.ЦветФонаЗаголовка = ЦветаСтиля.НедоступныеДанныеЦвет;
		Элемент.ТолькоПросмотр = Истина;
		
	Иначе
		
		Заголовок = НСтр("ru='Групповое заполнение строк'");
		
		// Категории для русского языка:
		//	Ноль	(-);
		//	Один	(1 шт);
		//	Два		(-);
		//	Немного	(2 шт);
		//	Много	(5 шт);
		//	Другое	(-)
		НадписьКоличествоСтрок = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 строку;;%1 строки;%1 строк;'"),
			Параметры.КоличествоСтрок);
		
		Элементы["ПеренестиВДокумент"].Заголовок = СтрШаблон(
			НСтр("ru='Заполнить %1'"),
			НадписьКоличествоСтрок);
		
	КонецЕсли;
	
	Элементы["ДекорацияПояснение"].Видимость = Параметры.РежимЗаполненияПоКФОиКПС;
	
	Элементы["ГруппаВидЗатрат"].Видимость = Параметры.РежимЗаполненияПоКФОиКПС;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьВидЗатратКлиент()
	
	МассивИдСтрок = Элементы["СчетаДебета"].ВыделенныеСтроки;
	
	КоличествоВыделенныхСтрок = МассивИдСтрок.Количество();
	
	Если КоличествоВыделенныхСтрок = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранаВсяТаблица = (КоличествоВыделенныхСтрок = СчетаДебета.Количество());
	
	Если ВыбранаВсяТаблица Тогда
		ТекстСообщения = НСтр("ru='Установить выбранное значение вида затрат во всех строках таблицы?'");
	Иначе
		ТекстСообщения = НСтр("ru='Установить выбранное значение вида затрат в выделенных строках таблицы?'");
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("МассивИдСтрок",		МассивИдСтрок);
	ДополнительныеПараметры.Вставить("ВыбранаВсяТаблица",	ВыбранаВсяТаблица);
	
	ОписаниеОповещенияОВыборе = Новый ОписаниеОповещения("ПроверитьИЗаполнитьВидЗатратКлиент_Выбор", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещенияОВыборе, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИЗаполнитьВидЗатратКлиент_Выбор(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьВидЗатратСервер(ПараметрыОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидЗатратСервер(ПараметрыОповещения)
	
	МассивИдСтрок		= ПараметрыОповещения["МассивИдСтрок"];
	ВыбранаВсяТаблица	= ПараметрыОповещения["ВыбранаВсяТаблица"];
	
	Если ВыбранаВсяТаблица Тогда
		
		МассивСтрок = Неопределено;
		
	Иначе
		
		МассивСтрок = Новый Массив();
		
		Для Каждого ИдСтроки Из МассивИДСтрок Цикл
			МассивСтрок.Добавить(СчетаДебета.НайтиПоИдентификатору(ИдСтроки));
		КонецЦикла;
		
	КонецЕсли;
	
	ТаблицаСчетДт = СчетаДебета.Выгрузить(МассивСтрок, "СчетДт");
	
	ЗапросНомераСубконто = Новый Запрос();
	ЗапросНомераСубконто.УстановитьПараметр("ТаблицаСчетДт",			ТаблицаСчетДт);
	ЗапросНомераСубконто.УстановитьПараметр("ВидСубконтоВидыЗатрат",	ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат);
	ЗапросНомераСубконто.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Список счетов
	|//
	|ВЫБРАТЬ
	|	СчетДт	КАК Счет
	|ПОМЕСТИТЬ
	|	СписокСчетов
	|ИЗ
	|	&ТаблицаСчетДт	КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Номера субконто для счетов из списка
	|//		(Финальная таблица для дальнейшей обработки)
	|//
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокСчетов.Счет			КАК Счет,
	|	ВидыСубконто.НомерСтроки	КАК НомерСубконто
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто	КАК ВидыСубконто
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ	СписокСчетов
	|		ПО	ВидыСубконто.Ссылка = СписокСчетов.Счет
	|		И	ВидыСубконто.ВидСубконто = &ВидСубконтоВидыЗатрат
	|;";
	
	ТаблицаНомераСубконто = ЗапросНомераСубконто.Выполнить().Выгрузить();
	
	Если ВыбранаВсяТаблица Тогда
		
		МассивСтрок = СчетаДебета;
		
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		
		СтрокаНомерСубконто = ТаблицаНомераСубконто.Найти(СтрокаТаблицы["СчетДт"], "Счет");
		
		Если СтрокаНомерСубконто = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКолонки = "СубконтоДт" + СтрокаНомерСубконто["НомерСубконто"];
		
		СтрокаТаблицы[ИмяКолонки] = ВидЗатрат;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСвойстваСчета(СчетСсылка)
	
	Возврат Документы.РаспределениеВходящегоНДС.ПолучитьСвойстваСчета(СчетСсылка);
	
КонецФункции

&НаКлиенте
Функция СформироватьВозвращаемоеЗначение()
	
	Если Параметры.РежимЗаполненияПоКФОиКПС Тогда
		
		ВозвращаемоеЗначение = Новый Структура();
		ВозвращаемоеЗначение.Вставить("СчетаДебета",	СчетаДебета);
		ВозвращаемоеЗначение.Вставить("ВидЗатрат",		ВидЗатрат);
		
	Иначе
		
		ВозвращаемоеЗначение = Новый Структура("
			|КФО,
			|КПССчетаДебета,
			|СчетДт,
			|КЭКСчетаДебета,
			|СубконтоДт1,
			|СубконтоДт2,
			|СубконтоДт3");
		
		Если СчетаДебета.Количество() > 0 Тогда
			
			ЗаполнитьЗначенияСвойств(ВозвращаемоеЗначение, СчетаДебета[0]);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти

#Область ТиповыеОперации
//Код процедур и функций
#КонецОбласти

#Область ИнформационныйЦентр
//Код процедур и функций
#КонецОбласти
