
#Область СлужебныеПроцедурыИФункции

// Процедура добавляет реквизиты для получения значений из КПС.
//
// Параметры :
//	Реквизиты - Структура - реквизиты для чтения по ссылке на КПС.
//	Путь - Строка - путь к ссылке, из которой нужно получить дополнительные поля.
//  Период - Булево - добавить реквизиты периода.
//  Бюджет - Булево - добавить реквизиты бюджета.
//
Процедура ДобавитьРеквизитыКПС(Знач Реквизиты, Знач Путь, Знач Период, Знач Бюджет)
	Перем Имя;
	
	Имя = СтрЗаменить(Путь, ".", "_");
	Реквизиты.Вставить(Имя, Путь);
	Реквизиты.Вставить(Имя + "_Код", Путь + ".Код");
	Если Период Тогда
		Реквизиты.Вставить(Имя + "_НачалоДействия", Путь + ".ДатаНачалаДействия");
		Реквизиты.Вставить(Имя + "_ОкончаниеДействия", Путь + ".ОкончаниеДействия");
	КонецЕсли;
	Если Бюджет Тогда
		ДобавитьРеквизитыКПС(Реквизиты, Путь + ".Бюджет", Ложь, Ложь);
	КонецЕсли;	
	
КонецПроцедуры	

// Функция копирует значения реквизитов из КПС в структуру с результатом.
//
// Параметры :
//	КПС - Структура - текущие реквизиты.
//	Путь - Строка - путь к ссылке, из которой нужно копировать дополнительные поля.
//  Период - Булево - добавить реквизиты периода.
//  Бюджет - Булево - добавить реквизиты бюджета.
//	Значения - Структура - значения, к которым надо добавить реквизиты.
//
// Возвращаемое значение :
//  Структура, Неопределено.
//
Функция КопироватьРеквизитыКПС(Знач КПС, Знач Путь, Знач Период, Знач Бюджет)
	Перем Имя, Ссылка, Рез;
	
	Имя = СтрЗаменить(Путь, ".", "_");
	Ссылка = КПС[Имя];
	Если (Не ЗначениеЗаполнено(Ссылка)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Рез = Новый Структура;
	Рез.Вставить("Ссылка", Ссылка);
	Рез.Вставить("Код", КПС[Имя + "_Код"]);
	Если Период Тогда
		Рез.Вставить("НачалоДействия", КПС[Имя + "_НачалоДействия"]);
		Рез.Вставить("ОкончаниеДействия", КПС[Имя + "_ОкончаниеДействия"]);
	КонецЕсли;
	Если Бюджет Тогда
		Ссылка = КопироватьРеквизитыКПС(КПС, Путь + ".Бюджет", Ложь, Ложь);
		Если (Ссылка <> Неопределено) Тогда
			Рез.Вставить("Бюджет", Новый ФиксированнаяСтруктура(Ссылка));
		КонецЕсли;
	КонецЕсли;
	Возврат Рез;
	
КонецФункции	

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция выполняет поиск бюджета по коду.
//
// Параметры :
//  Код - Строка - код бюджета.
//
// Возвращаемое значение :
//  СправочникСсылка.Бюджеты.
//
Функция НайтиБюджет(Знач Код) Экспорт
	Перем Текст, Таб, Отбор;
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Бюджеты.ФедеральныйБюджет");
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Бюджеты.ФедеральныйБюджет");
	КонецЕсли;
	// Поиск по коду.
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ	Справочник.Бюджеты КАК Спр
	        |ГДЕ (Спр.Код = &Код)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Код);
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() = 0) Тогда
		Возврат ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.Бюджеты.ФедеральныйБюджет");
	Иначе
		Возврат Таб[0].Ссылка;
	КонецЕсли;

КонецФункции

// Функция выполняет поиск типа контрагента по коду.
//
// Параметры :
//  Код - Строка - код типа контрагента.
//
// Возвращаемое значение :
//  СправочникСсылка.ТипыКонтрагентов.
//
Функция НайтиТипКонтрагента(Знач Код) Экспорт
	Перем Текст, Таб, Отбор;
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.ТипыКонтрагентов.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.ТипыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	// Поиск по коду.
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ	Справочник.ТипыКонтрагентов КАК Спр
	        |ГДЕ (Спр.Код = &Код)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Код);
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() = 0) Тогда
		Возврат Справочники.ТипыКонтрагентов.ПустаяСсылка();
	Иначе
		Возврат Таб[0].Ссылка;
	КонецЕсли;

КонецФункции

// Функция возвращает владельца элемента справочника.
//
// Параметры:
//  Ссылка - СправочникСсылка.
//
// Возвращаемое значение :
//	СправочникСсылка.
//
Функция ПолучитьВладельца(Знач Ссылка) Экспорт
	Перем Тип, Знч;
	
	Тип = ТипЗнч(Ссылка);
	Если (Не ОбщегоНазначения.ЭтоСсылка(Тип)) Тогда
		Возврат Неопределено;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат Неопределено;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Владелец");
	КонецЕсли;

КонецФункции

// Функция возвращает код элемента справочника.
//
// Параметры:
//  Ссылка - СправочникСсылка.
//
// Возвращаемое значение :
//	Строка.
//
Функция ПолучитьКод(Знач Ссылка) Экспорт
	Перем Тип, Знч;
	
	Тип = ТипЗнч(Ссылка);
	Если (Тип = Тип("СправочникСсылка.Организации")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат "";
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			Возврат СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КодПоРПБС"));
		КонецЕсли;	
	ИначеЕсли (Тип = Тип("СправочникСсылка.РазделыЛицевыхСчетов")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат "";
		Иначе
			УстановитьПривилегированныйРежим(Истина);
			Возврат СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Владелец.Код"));
		КонецЕсли;
	ИначеЕсли (Не ОбщегоНазначения.ЭтоСсылка(Тип)) Тогда
		Возврат "";
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат "";
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		Возврат СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Код"));
	КонецЕсли;

КонецФункции

// Функция возвращает код ППП организации.
//
// Параметры:
//  Ссылка - СправочникСсылка.Организации.
//
// Возвращаемое значение :
//	Строка.
//
Функция ПолучитьППП(Знач Ссылка) Экспорт
	Перем Рез, Знч;
	
	Если (ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации")) Тогда
		Рез = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "КодПоППП");
		Рез = ФИББГУМенеджерОбменаПовтИсп.ПолучитьКод(Рез);
	ИначеЕсли (ТипЗнч(Ссылка) = Тип("СправочникСсылка.ИсточникиФинансовогоОбеспечения")) Тогда
		Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "КодГлавыБК,ИспользоватьРеквизитыИФО");
		Если (Рез.Свойство("ИспользоватьРеквизитыИФО", Знч) И (Знч = Истина)) Тогда
			Если Рез.Свойство("КодГлавыБК", Знч) Тогда
				Рез = ФИББГУМенеджерОбменаПовтИсп.ПолучитьКод(Знч);
			Иначе
				Рез = "";
			КонецЕсли;
		Иначе
			Рез = "";
		КонецЕсли;
	Иначе
		Рез = "";
	КонецЕсли;
	Возврат Лев(Рез + "000", 3);

КонецФункции

// Функция возвращает реквизиты договора по ссылке.
//
// Параметры :
//	Ссылка - СправочникСсылка.Договоры - договор.
//
// Возвращаемое значение :
//	Неопределено, ФиксированнаяСтруктура.
//
Функция ПолучитьРеквизитыДоговора(Знач Ссылка) Экспорт
	Перем Тип, Рез, Текст, Отбор, Таб;

	УстановитьПривилегированныйРежим(Истина);
	Тип = ТипЗнч(Ссылка);
	Если (Тип = Тип("СправочникСсылка.Договоры")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Рез = Новый Структура;
		Рез.Вставить("Организация", "Организация");
		Рез.Вставить("ВидДоговора", "ВидОбязательства");
		Рез.Вставить("ДатаДоговора", "ДатаДоговора");
		Рез.Вставить("НомерДоговора", "НомерДоговора");
		Рез.Вставить("ВД", "ВидДоговора");
		Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Рез);
		Если (Рез.ВД = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
			Возврат Неопределено;
		ИначеЕсли (Рез.ВД = Перечисления.ВидыДоговоровКонтрагентов.ПолученныйКредит) Тогда
			Возврат Неопределено;
		ИначеЕсли (Рез.ВД = Перечисления.ВидыДоговоровКонтрагентов.ВыпускЦенныхБумаг) Тогда
			Возврат Неопределено;
		КонецЕсли;
		Рез.ВидДоговора = СокрЛП(Рез.ВидДоговора);
		Рез.НомерДоговора = СокрЛП(Рез.НомерДоговора);
		Рез.Удалить("ВД");
		Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		        |	Рег.УчетныйНомерОбязательства КАК Номер
		        |ИЗ РегистрСведений.УчетныеНомераОбязательств КАК Рег
		        |ГДЕ (Рег.Обязательство = &Ссылка)";
		Отбор = Новый Структура;
		Отбор.Вставить("Ссылка", Ссылка);
		Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
		Если (Таб.Количество() = 1) Тогда
			Текст = СокрЛП(Таб[0].Номер);
			Если (Не ПустаяСтрока(Текст)) Тогда
				Рез.Вставить("НомерОбязательства", Текст);
			КонецЕсли;	
		КонецЕсли;	
		Возврат Новый ФиксированнаяСтруктура(Рез);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

// Функция возвращает реквизиты контрагента по ссылке.
//
// Параметры :
//	Ссылка - СправочникСсылка.
//
// Возвращаемое значение :
//	Неопределено, ФиксированнаяСтруктура.
//
Функция ПолучитьРеквизитыКонтрагента(Знач Ссылка) Экспорт
	Перем Тип, Рез;

	УстановитьПривилегированныйРежим(Истина);
	Тип = ТипЗнч(Ссылка);
	Если (Тип = Тип("СправочникСсылка.Контрагенты")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Рез = Новый Структура;
		Рез.Вставить("Контрагент", "Ссылка");
		Рез.Вставить("ИНН", "ИНН");
		Рез.Вставить("КПП", "КПП");
		Рез.Вставить("Код", "ЮридическоеФизическоеЛицо.КодПоРПБС");
		Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Рез);
		Рез.ИНН = СокрЛП(Рез.ИНН);
		Рез.КПП = СокрЛП(Рез.КПП);
		Рез.Код = СокрЛП(Лев(СокрЛП(Рез.Код), 8));
		Возврат Новый ФиксированнаяСтруктура(Рез);
	ИначеЕсли (Тип = Тип("СправочникСсылка.Договоры")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;	
		Рез = Новый Структура;
		Рез.Вставить("Контрагент", "Контрагент");
		Рез.Вставить("ИНН", "Контрагент.ИНН");
		Рез.Вставить("КПП", "Контрагент.КПП");
		Рез.Вставить("Код", "Контрагент.ЮридическоеФизическоеЛицо.КодПоРПБС");
		Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Рез);
		Рез.ИНН = СокрЛП(Рез.ИНН);
		Рез.КПП = СокрЛП(Рез.КПП);
		Рез.Код = СокрЛП(Лев(СокрЛП(Рез.Код), 8));
		Если ПустаяСтрока(Рез.ИНН) Тогда
			Возврат Неопределено;
		Иначе	
			Возврат Новый ФиксированнаяСтруктура(Рез);
		КонецЕсли;	
	ИначеЕсли (Тип = Тип("СправочникСсылка.Казначейства")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;
		Рез = Новый Структура;
		Рез.Вставить("ИНН", "ИНН");
		Рез.Вставить("КПП", "КПП");
		Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Рез);
		Рез.ИНН = СокрЛП(Рез.ИНН);
		Рез.КПП = СокрЛП(Рез.КПП);
		Рез.Код = "";
		Рез.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		Возврат Новый ФиксированнаяСтруктура(Рез);
	ИначеЕсли (Тип = Тип("СправочникСсылка.Организации")) Тогда
		Если Ссылка.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;
		Рез = Новый Структура;
		Рез.Вставить("ИНН", "ИНН");
		Рез.Вставить("КПП", "КПП");
		Рез.Вставить("Код", "КодПоРПБС");
		Рез.Вставить("Бюджет", "Бюджет");
		Рез.Вставить("КодБюджета", "Бюджет.Код");
		Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Рез);
		Рез.ИНН = СокрЛП(Рез.ИНН);
		Рез.КПП = СокрЛП(Рез.КПП);
		Рез.Код = СокрЛП(Лев(СокрЛП(Рез.Код), 8));
		Рез.КодБюджета = СокрЛП(Рез.КодБюджета);
		Рез.Вставить("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
		Возврат Новый ФиксированнаяСтруктура(Рез);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Функция возвращает реквизиты КПС.
//
// Параметры:
//  Ссылка - СправочникСсылка.КлассификационныеПризнакиСчетов - классификационный признак счета.
//	БК - Булево - выгружать отдельные реквизиты БК.
//
// Возвращаемое значение :
//	ФиксированняСтруктура, Неопределено.
//
Функция ПолучитьРеквизитыКПС(Знач Ссылка, Знач БК) Экспорт
	Перем Рез, Знч, Элем, Владелец, Группа;

	Если (ТипЗнч(Ссылка) <> Тип("СправочникСсылка.КлассификационныеПризнакиСчетов")) Тогда
		Возврат Неопределено;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Получение реквизитов. 
	УстановитьПривилегированныйРежим(Истина);
	Рез = Новый Структура;
	Рез.Вставить("Тип", "");
	Рез.Вставить("Код", "");
	Знч = Новый Структура;
	Знч.Вставить("Код", "Код");
	Знч.Вставить("ВидПоказателя", "ВидПоказателя");
	Знч.Вставить("УточнениеПоказателя", "УточнениеПоказателя");
	Если БК Тогда
		ДобавитьРеквизитыКПС(Знч, "РазделПодразделКРБ", Ложь, Ложь);
		ДобавитьРеквизитыКПС(Знч, "ЦелеваяСтатьяКРБ", Истина, Истина);
		ДобавитьРеквизитыКПС(Знч, "ПрограммаЦелевойСтатьиКРБ", Истина, Истина);
		ДобавитьРеквизитыКПС(Знч, "ПрограммаЦелевойСтатьиКРБ.ЦелеваяСтатья", Истина, Истина);
		ДобавитьРеквизитыКПС(Знч, "ВидРасходаКРБ", Истина, Истина);
		ДобавитьРеквизитыКПС(Знч, "ВидДоходаКДБ", Истина, Ложь);
		ДобавитьРеквизитыКПС(Знч, "ГруппаПодвидаКДБ", Ложь, Истина);
		ДобавитьРеквизитыКПС(Знч, "ГруппаПодвидаКДБ.ВидДохода", Истина, Ложь);
		ДобавитьРеквизитыКПС(Знч, "АналитическаяГруппаКДБ", Ложь, Ложь);
		ДобавитьРеквизитыКПС(Знч, "ГруппаПодгруппаКИФ", Ложь, Ложь);
		ДобавитьРеквизитыКПС(Знч, "СтатьяКИФ", Истина, Истина);
		ДобавитьРеквизитыКПС(Знч, "СтатьяКИФ.Владелец", Ложь, Ложь);
		ДобавитьРеквизитыКПС(Знч, "ВидКИФ", Ложь, Истина);
		ДобавитьРеквизитыКПС(Знч, "ВидКИФ.Владелец", Истина, Истина);
		ДобавитьРеквизитыКПС(Знч, "ВидКИФ.Владелец.Владелец", Ложь, Ложь);
		ДобавитьРеквизитыКПС(Знч, "АналитическаяГруппаКИФ", Ложь, Ложь);
	КонецЕсли;	
	Знч = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Знч);
	Знч.Код = СтрЗаменить(Знч.Код, " ", "0");
	Рез.Код = Лев(Знч.Код + "00000000000000000", 17);
	Если (Знч.ВидПоказателя = Перечисления.ВидыКБК.КРБ) Тогда
		Рез.Тип = "10";
	ИначеЕсли (Знч.ВидПоказателя = Перечисления.ВидыКБК.КДБ) Тогда
		Рез.Тип = "20";
	ИначеЕсли (Знч.ВидПоказателя = Перечисления.ВидыКБК.КИФ) Тогда
		Если (Лев(Рез.Код, 2) = "02") Тогда
			Рез.Тип = "32";
		Иначе
			Рез.Тип = "31";
		КонецЕсли;
	ИначеЕсли (Знч.ВидПоказателя = Перечисления.ВидыКБК.АУИБУ) Тогда
		Если (Знч.УточнениеПоказателя = Перечисления.ВидыКБК.КРБ) Тогда
			Рез.Тип = "10";
		ИначеЕсли (Знч.УточнениеПоказателя = Перечисления.ВидыКБК.КДБ) Тогда
			Рез.Тип = "20";
		ИначеЕсли (Знч.УточнениеПоказателя = Перечисления.ВидыКБК.КИФ) Тогда
			Если (Лев(Рез.Тип, 2) = "02") Тогда
				Рез.Тип = "32";
			Иначе
				Рез.Тип = "31";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если БК Тогда                                                                        
		// Раздел, подраздел.
		Элем = КопироватьРеквизитыКПС(Знч, "РазделПодразделКРБ", Ложь, Ложь);
		Если (Элем <> Неопределено) Тогда
			Рез.Вставить("РазделПодразделКРБ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Программное (непрограммное) направление расходов.
		Элем = КопироватьРеквизитыКПС(Знч, "ЦелеваяСтатьяКРБ", Истина, Истина);
		Если (Элем <> Неопределено) Тогда
			Рез.Вставить("ЦелеваяСтатьяКРБ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Направление расходов.
		Элем = КопироватьРеквизитыКПС(Знч, "ПрограммаЦелевойСтатьиКРБ", Истина, Истина);
		Если (Элем <> Неопределено) Тогда
			// Программное (непрограммное) направление расходов.
			Владелец = КопироватьРеквизитыКПС(Знч, "ПрограммаЦелевойСтатьиКРБ.ЦелеваяСтатья", Истина, Истина);
			Если (Владелец <> Неопределено) Тогда
				Элем.Вставить("ЦелеваяСтатья", Новый ФиксированнаяСтруктура(Владелец));
			КонецЕсли;	
			Рез.Вставить("ПрограммаЦелевойСтатьиКРБ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Вид расходов КРБ.
		Элем = КопироватьРеквизитыКПС(Знч, "ВидРасходаКРБ", Истина, Истина);
		Если (Элем <> Неопределено) Тогда
			Рез.Вставить("ВидРасходаКРБ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Вид доходов КДБ.
		Элем = КопироватьРеквизитыКПС(Знч, "ВидДоходаКДБ", Истина, Ложь);
		Если (Элем <> Неопределено) Тогда
			Рез.Вставить("ВидДоходаКДБ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Группа подвидов доходов КДБ.
		Элем = КопироватьРеквизитыКПС(Знч, "ГруппаПодвидаКДБ", Ложь, Истина);
		Если (Элем <> Неопределено) Тогда
			// Вид доходов КДБ.
			Владелец = КопироватьРеквизитыКПС(Знч, "ГруппаПодвидаКДБ.ВидДохода", Истина, Ложь);
			Если (Владелец <> Неопределено) Тогда
				Элем.Вставить("ВидДохода", Новый ФиксированнаяСтруктура(Владелец));
			КонецЕсли;	
			Рез.Вставить("ГруппаПодвидаКДБ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Аналитическая группа КДБ.
		Элем = КопироватьРеквизитыКПС(Знч, "АналитическаяГруппаКДБ", Ложь, Ложь);
		Если (Элем <> Неопределено) Тогда
			Рез.Вставить("АналитическаяГруппаКДБ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Группа (подгруппа) КИФ.
		Элем = КопироватьРеквизитыКПС(Знч, "ГруппаПодгруппаКИФ", Ложь, Ложь);
		Если (Элем <> Неопределено) Тогда
			Рез.Вставить("ГруппаПодгруппаКИФ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Статья КИФ.
		Элем = КопироватьРеквизитыКПС(Знч, "СтатьяКИФ", Истина, Истина);
		Если (Элем <> Неопределено) Тогда
			// Группа (подгруппа) КИФ.
			Владелец = КопироватьРеквизитыКПС(Знч, "СтатьяКИФ.Владелец", Ложь, Ложь);
			Если (Владелец <> Неопределено) Тогда
				Элем.Вставить("Владелец", Новый ФиксированнаяСтруктура(Владелец));
			КонецЕсли;	
			Рез.Вставить("СтатьяКИФ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Вид КИФ.
		Элем = КопироватьРеквизитыКПС(Знч, "ВидКИФ", Ложь, Истина);
		Если (Элем <> Неопределено) Тогда
			// Статья КИФ.
			Владелец = КопироватьРеквизитыКПС(Знч, "ВидКИФ.Владелец", Истина, Истина);
			Если (Владелец <> Неопределено) Тогда
				// Группа (подгруппа) КИФ.
				Группа = КопироватьРеквизитыКПС(Знч, "ВидКИФ.Владелец.Владелец", Ложь, Ложь);
				Если (Группа <> Неопределено) Тогда
					Владелец.Вставить("Владелец", Новый ФиксированнаяСтруктура(Группа));
				КонецЕсли;	
				Элем.Вставить("Владелец", Новый ФиксированнаяСтруктура(Владелец));
			КонецЕсли;	
			Рез.Вставить("ВидКИФ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
		// Аналитическая группа КИФ.
		Элем = КопироватьРеквизитыКПС(Знч, "АналитическаяГруппаКИФ", Ложь, Ложь);
		Если (Элем <> Неопределено) Тогда
			Рез.Вставить("АналитическаяГруппаКИФ", Новый ФиксированнаяСтруктура(Элем));
		КонецЕсли;	
	КонецЕсли;	
	Возврат Новый ФиксированнаяСтруктура(Рез);

КонецФункции

// Функция возвращает реквизиты валюты.
//
// Параметры:
//  Ссылка - СправочникСсылка.Валюты - валюта.
//
// Возвращаемое значение :
//	ФиксированняСтруктура, Неопределено.
//
Функция ПолучитьРеквизитыВалюты(Знач Ссылка) Экспорт
	Перем Рез, Знч;

	Если (ТипЗнч(Ссылка) <> Тип("СправочникСсылка.Валюты")) Тогда
		Возврат Неопределено;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Получение реквизитов. 
	УстановитьПривилегированныйРежим(Истина);
	Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Код,Наименование");
	Если ПустаяСтрока(Рез.Код) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Рез.Код = СокрЛП(Рез.Код);
	Рез.Наименование = СокрЛП(Рез.Наименование);
	Возврат Новый ФиксированнаяСтруктура(Рез);

КонецФункции

// Функция возвращает реквизиты номенклатуры.
//
// Параметры:
//  Ссылка - СправочникСсылка.Номенклатура - номенклатура.
//
// Возвращаемое значение :
//	ФиксированняСтруктура, Неопределено.
//
Функция ПолучитьРеквизитыНоменклатуры(Знач Ссылка) Экспорт
	Перем Рез, Знч;

	Если (ТипЗнч(Ссылка) <> Тип("СправочникСсылка.Номенклатура")) Тогда
		Возврат Неопределено;
	ИначеЕсли Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	// Получение реквизитов. 
	УстановитьПривилегированныйРежим(Истина);
	Рез = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Наименование");
	Если ПустаяСтрока(Рез.Наименование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Рез.Наименование = СокрЛП(Рез.Наименование);
	Возврат Новый ФиксированнаяСтруктура(Рез);

КонецФункции

// Функция возвращает код КФО.
//
// Параметры:
//  Ссылка - ПеречислениеСсылка.КВД.
//
// Возвращаемое значение :
//	Строка.
//
Функция ПолучитьКодКФО(Знач Ссылка) Экспорт
	Перем КВД;

	КВД = Перечисления.КВД;
	Если (Ссылка = КВД.Бюджет) Тогда
		Возврат "1";
	ИначеЕсли (Ссылка = КВД.Внебюджет) Тогда
		Возврат "2";
	ИначеЕсли (Ссылка = КВД.ВременноеРаспоряжение) Тогда
		Возврат "3";
	ИначеЕсли (Ссылка = КВД.СубсидииНаГосзадание) Тогда
		Возврат "4";
	ИначеЕсли (Ссылка = КВД.СубсидииНаИныеЦели) Тогда
		Возврат "5";
	ИначеЕсли (Ссылка = КВД.БюджетныеИнвестиции) Тогда
		Возврат "6";
	ИначеЕсли (Ссылка = КВД.СредстваОМС) Тогда
		Возврат "7";
	Иначе
		Возврат "";
	КонецЕсли;

КонецФункции

// Функция находит раздел,подраздел по коду.
//
// Параметры :
//	Код - Строка - код раздела,подраздела.
//
// Возвращаемое значение :
//	СправочникСсылка.РазделыПодразделыКРБ.
//
Функция РазделПодраздел(Знач Код) Экспорт
	Перем Текст, Таб, Отбор;
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.РазделыПодразделыКРБ.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.РазделыПодразделыКРБ.ПустаяСсылка();
	КонецЕсли;
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ	Справочник.РазделыПодразделыКРБ КАК Спр
	        |ГДЕ (Спр.Код = &Код)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Код);
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Объект = Справочники.РазделыПодразделыКРБ.СоздатьЭлемент();
	Объект.Код = Код;
	Объект.ЭлементГруппа = (Прав(Код, 2) = "00");
	Объект.НаименованиеПолное = СтрШаблон(НСтр("ru = 'Раздел,подраздел ""%1"" создан при синхронизации данных с БМО'"), Код);
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

// Функция находит группу КИФ по коду.
//
// Параметры :
//	Код - Строка - код КИФ.
//
// Возвращаемое значение :
//	СправочникСсылка.ГруппыПодгруппыКИФ.
//
Функция ГруппаКИФ(Знач Код) Экспорт
	Перем Текст, Таб, Отбор, Объект, Родитель, ЭлементГруппа;

	УстановитьПривилегированныйРежим(Истина);
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
	КонецЕсли;
	Код = СокрЛП(Код);
	Если (СтрДлина(Код) <> 4) Тогда
		Возврат Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
	КонецЕсли;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Код);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка
			|ИЗ Справочник.ГруппыПодгруппыКИФ КАК Спр
			|ГДЕ (Спр.Код = &Код)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	КонецЕсли;                                                                                                                                   
	Если (Код = "0100") Тогда                  
		ЭлементГруппа = Истина;
		Родитель = Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
		Текст = НСтр("ru = 'ИСТОЧНИКИ ВНУТРЕННЕГО ФИНАНСИРОВАНИЯ ДЕФИЦИТОВ БЮДЖЕТОВ'");
	ИначеЕсли (Код = "0101") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		Текст = НСтр("ru = 'Государственные (муниципальные) ценные бумаги, номинальная стоимость которых указана в валюте Российской Федерации'");
	ИначеЕсли (Код = "0102") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		Текст = НСтр("ru = 'Кредиты кредитных организаций в валюте Российской Федерации'");
	ИначеЕсли (Код = "0103") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		Текст = НСтр("ru = 'Бюджетные кредиты от других бюджетов бюджетной системы Российской Федерации'");
	ИначеЕсли (Код = "0104") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		Текст = НСтр("ru = 'Кредиты международных финансовых организаций в валюте Российской Федерации'");
	ИначеЕсли (Код = "0105") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		Текст = НСтр("ru = 'Изменение остатков средств на счетах по учету средств бюджетов'");
	ИначеЕсли (Код = "0106") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		Текст = НСтр("ru = 'Иные источники внутреннего финансирования дефицитов бюджетов'");
	ИначеЕсли (Код = "0107") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		Текст = НСтр("ru = 'Кредиты иностранных банков в валюте Российской Федерации'");
	ИначеЕсли (Код = "0200") Тогда	
		ЭлементГруппа = Истина;
		Родитель = Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
		Текст = НСтр("ru = 'ИСТОЧНИКИ ВНЕШНЕГО ФИНАНСИРОВАНИЯ ДЕФИЦИТОВ БЮДЖЕТОВ'");
	ИначеЕсли (Код = "0201") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0200");
		Текст = НСтр("ru = 'Государственные ценные бумаги, номинальная стоимость которых указана в иностранной валюте'");
	ИначеЕсли (Код = "0202") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0200");
		Текст = НСтр("ru = 'Кредиты иностранных государств, включая целевые иностранные кредиты, международных финансовых организаций, иных субъектов международного права, иностранных юридических лиц в иностранной валюте'");
	ИначеЕсли (Код = "0203") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0200");
		Текст = НСтр("ru = 'Кредиты кредитных организаций в иностранной валюте'");
	ИначеЕсли (Код = "0204") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0200");
		Текст = НСтр("ru = 'Иные источники внешнего финансирования дефицитов бюджетов'");
	ИначеЕсли (Код = "0205") Тогда	
		ЭлементГруппа = Ложь;
		Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0200");
		Текст = НСтр("ru = 'Бюджетные кредиты в иностранной валюте, предоставленные Российской Федерацией в рамках использования целевых иностранных кредитов'");
	Иначе
		ЭлементГруппа = Ложь;
		Если СтрНачинаетсяС(Код, "01") Тогда
			Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0100");
		ИначеЕсли СтрНачинаетсяС(Код, "02") Тогда	
			Родитель = ФИББГУМенеджерОбменаПовтИсп.ГруппаКИФ("0200");
		Иначе
			Родитель = Справочники.ГруппыПодгруппыКИФ.ПустаяСсылка();
		КонецЕсли;	
		Текст = СтрШаблон(НСтр("ru = 'Группа, подгруппа КИФ ""%1"" создана при синхронизации данных с БМО'"), Код);
	КонецЕсли;	
	Объект = Справочники.ГруппыПодгруппыКИФ.СоздатьЭлемент(); 
	Объект.Родитель = Родитель;
	Объект.Код = Код;
	Объект.Наименование = Код + "0000000000";
	Объект.НаименованиеПолное = Текст;
	Объект.ЭлементГруппа = ЭлементГруппа;
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

// Функция находит аналитический код КПС по коду.
//
// Параметры :
//	Код - Строка - аналитический код КПС.
//
// Возвращаемое значение :
//	СправочникСсылка.АналитическиеКодыКПС.
//
Функция АналитическийКодКПС(Знач Код) Экспорт
	Перем Текст, Таб, Отбор;
	
	Если (ТипЗнч(Код) <> Тип("Строка")) Тогда
		Возврат Справочники.АналитическиеКодыКПС.ПустаяСсылка();
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Возврат Справочники.АналитическиеКодыКПС.ПустаяСсылка();
	ИначеЕсли (Код = "0000000000") Тогда
		Возврат Справочники.АналитическиеКодыКПС.ПустаяСсылка();
	КонецЕсли;
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ	Справочник.АналитическиеКодыКПС КАК Спр
	        |ГДЕ (Спр.Код = &Код)
			|УПОРЯДОЧИТЬ ПО Спр.ПометкаУдаления";
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Код);
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Объект = Справочники.АналитическиеКодыКПС.СоздатьЭлемент();
	Объект.Код = Код;
	Отбор = Новый Структура;
	Отбор.Вставить("Код", Лев(Код, 5));
	Текст = Прав(Код, 5);
	Если (Текст = "00000") Тогда
		Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	Спр.НаименованиеПолное КАК Наименование
				|ИЗ	Справочник.ЦелевыеСтатьиКРБ КАК Спр
				|ГДЕ (Спр.Код = &Код)
				|УПОРЯДОЧИТЬ ПО Спр.ДатаОкончанияДействия УБЫВ, Спр.ПометкаУдаления";
	Иначе
		Отбор.Вставить("Код1", Текст);
		Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	Спр.НаименованиеПолное КАК Наименование
				|ИЗ	Справочник.ПрограммыЦелевыхСтатейКРБ КАК Спр
				|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦелевыеСтатьиКРБ КАК СпрЦС
				|ПО (СпрЦС.Ссылка = Спр.ЦелеваяСтатья)
				|ГДЕ (Спр.Код = &Код1) И (СпрЦС.Код = &Код)
				|УПОРЯДОЧИТЬ ПО Спр.ДатаОкончанияДействия УБЫВ, Спр.ПометкаУдаления";
	КонецЕсли;
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() = 0) Тогда
		Объект.НаименованиеПолное = СтрШаблон(НСтр("ru = 'Аналитический код ""%1"" создан синхронизации данных с БМО'"), Код);
	Иначе	
		Объект.НаименованиеПолное = Таб[0].Наименование;
	КонецЕсли;
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	Возврат Объект.Ссылка;

КонецФункции

// Функция возвращает период по реквизитам из файла.
//
// Параметры :
//	ДатаНачала - Дата - начало периода.
//	ДатаОкончания - Дата - конец периода.
//
// Возвращаемое значение :
//	СправочникСсылка.Периоды.
//
Функция ПериодПлана(Знач ДатаНачала, Знач ДатаОкончания) Экспорт
	Перем Текст, Отбор, Таб, Объект, НМ, КМ, Знч;
	
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	Спр.Ссылка КАК Ссылка
	        |ИЗ Справочник.Периоды КАК Спр
			|ГДЕ (Спр.ДатаНачала = &ДатаНачала)
			|  И (Спр.ДатаОкончания = &ДатаОкончания)
	        |УПОРЯДОЧИТЬ ПО	Спр.ПометкаУдаления";
	Отбор = Новый Структура;
	Отбор.Вставить("ДатаНачала", НачалоДня(ДатаНачала));
	Отбор.Вставить("ДатаОкончания", НачалоДня(ДатаОкончания));
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Если (Таб.Количество() > 0) Тогда
		Возврат Таб[0].Ссылка;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	Объект = Справочники.Периоды.СоздатьЭлемент();
	Объект.Наименование = ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания));
	Объект.ДатаНачала = ДатаНачала;
	Объект.ДатаОкончания = ДатаОкончания;
	Объект.Произвольный = Ложь;
	Если (Год(ДатаНачала) = Год(ДатаОкончания)) Тогда
		НМ = Месяц(ДатаНачала);
		КМ = Месяц(ДатаОкончания);
		Если (НМ = КМ) Тогда
			Объект.Родитель = ФИББГУМенеджерОбменаПовтИсп.ПериодПлана(НачалоКвартала(ДатаНачала), КонецКвартала(ДатаОкончания));
			Объект.Периодичность = Перечисления.Периодичность.Месяц;
		ИначеЕсли (((КМ - НМ) = 2)
				И  (НачалоКвартала(ДатаНачала) = НачалоДня(ДатаНачала))
				И  (КонецКвартала(ДатаОкончания) = КонецДня(ДатаОкончания))) Тогда
			Если (НМ < 7) Тогда	
				Знч = НачалоГода(ДатаНачала);	
				Объект.Родитель = ФИББГУМенеджерОбменаПовтИсп.ПериодПлана(Знч, НачалоДня(ДобавитьМесяц(Знч, 6) - 1));
			Иначе
				Знч = НачалоДня(КонецГода(ДатаОкончания));	
				Объект.Родитель = ФИББГУМенеджерОбменаПовтИсп.ПериодПлана(ДобавитьМесяц(НачалоМесяца(Знч), -5), Знч);
			КонецЕсли;	
			Объект.Периодичность = Перечисления.Периодичность.Квартал;
		ИначеЕсли (((КМ - НМ) = 5)
				И  ((НачалоГода(ДатаНачала) = НачалоДня(ДатаНачала))
			  Или   (КонецГода(ДатаОкончания) = КонецДня(ДатаОкончания)))) Тогда
			Объект.Родитель = ФИББГУМенеджерОбменаПовтИсп.ПериодПлана(НачалоГода(ДатаНачала), НачалоДня(КонецГода(ДатаОкончания)));
			Объект.Периодичность = Перечисления.Периодичность.Полугодие;
			Объект.Наименование = ?(НМ = 1, "1", "2") + " " + НСтр("ru = 'полугодие'");
			Объект.Наименование = Объект.Наименование + " " + ПредставлениеПериода(НачалоГода(ДатаНачала), КонецГода(ДатаОкончания));
		ИначеЕсли ((НачалоГода(ДатаНачала) = НачалоДня(ДатаНачала))
				И  (КонецГода(ДатаОкончания) = КонецДня(ДатаОкончания))) Тогда
			Объект.Родитель = Справочники.Периоды.ПустаяСсылка();
			Объект.Периодичность = Перечисления.Периодичность.Год;
		Иначе
			Объект.Родитель = Справочники.Периоды.ПустаяСсылка();
			Объект.Периодичность = Перечисления.Периодичность.ПустаяСсылка();
			Объект.Произвольный = Истина;
		КонецЕсли;	
	Иначе
		Объект.Родитель = Справочники.Периоды.ПустаяСсылка();
		Объект.Периодичность = Перечисления.Периодичность.ПустаяСсылка();
		Объект.Произвольный = Истина;
	КонецЕсли;
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	Возврат Объект.Ссылка;
	
КонецФункции

// Функция определяет была ли начата регистрация данных бухгалтерского регистра для узла плана обмена.
//
// Параметры :
//	Узел - ПланОбменаСсылка.ФИБОбменБГУ - узел плана обмена.
//
// Возвращаемое значение :
//	Булево.
//
Функция РегистрацияНачата(Знач Узел) Экспорт
	Перем Текст, Отбор, Таб;

	Отбор = Новый Структура;
	Отбор.Вставить("Узел", Узел);
	Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	Таб.Узел КАК Узел
			|ИЗ РегистрСведений.ФИБОбменБГУРегистрацияЖурналПроводокЕПСБУ КАК Таб
			|ГДЕ (Таб.Узел = &Узел)";
	Таб = ФИББГУМенеджерОбмена.ПолучитьДанные(Текст, Отбор);
	Возврат (Таб.Количество() > 0);

КонецФункции	
	
#КонецОбласти