
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПолучитьНаТекущуюДату") Тогда
		// Форма открыта командой
		Если НЕ Параметры.Свойство("Организация", Запись.Организация) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("НаДату", НаДату) Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ПолучитьПараметрыУчетнойПолитики(Запись.Организация, НаДату, Истина);
	
	Элементы.ОкончаниеДействия.Видимость 	= Истина;
	Элементы.Организация.ТолькоПросмотр 	= Истина;
	Элементы.Организация.КнопкаОткрытия 	= Ложь;
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписать.КнопкаПоУмолчанию 	= Истина;
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписать.Отображение 			= ОтображениеКнопки.КартинкаИТекст;
	ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаЗаписатьИЗакрыть.Видимость 	= Ложь;
	
	Элементы.Список.Видимость = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", Запись.Организация, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Элементы.Список.ТекущаяСтрока = Запись.ИсходныйКлючЗаписи;
	
	Если Константы.ИспользоватьУчетПоИФО.Получить() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиИспользованияРПС.Отбор, "Организация", Запись.Организация, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		Элементы.СтраницаНастройкиРПСПоИФО.Видимость = Ложь;
	КонецЕсли;	
	
	Элементы.СтраницаУчетИмуществаКазны.Видимость = ПолучитьФункциональнуюОпцию("ВестиУчетИмуществаКазны");
	
	ТекущийТипРПС = Запись.СтруктураРПС.ТипПланаСчетов;
	ТекущаяСтавкаНалогаУСН = Запись.СтавкаНалогаУСН;
	ПорядокИсключенияНДСизДоходовУСНприПогашенииЗадолженности = ?(Запись.ИсключатьНДСИзДоходовУСНПоДаннымКнигиПродаж = Истина, 1, 0);
	
	Если Параметры.Ключ.Организация.Пустая() Тогда
		НалогНаИмуществоЗаполнитьКодЛьготы(ЭтотОбъект);
		УправлениеФормойСервер();
	КонецЕсли;
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НалогНаИмуществоЗаполнитьКодЛьготы(ЭтотОбъект);
	УправлениеФормойСервер();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьНачисленияАмортизацииИК();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если (ПорядокНумерацииИнвНомеров = 1) И Не ЗначениеЗаполнено(Запись.ШаблонИнвентарныхНомеров) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен шаблон инвентарных номеров'"), ,
			"Запись.ШаблонИнвентарныхНомеров", , Отказ);
	КонецЕсли;
	Если ПорядокНумерацииИнвНомеров = 0 Тогда
		Запись.ШаблонИнвентарныхНомеров = ПредопределенноеЗначение("Справочник.ШаблоныНомеровНФА.ПустаяСсылка");
	КонецЕсли;
	Если (ПорядокНумерацииИнвентарныхКарточек = 2) И Не ЗначениеЗаполнено(Запись.ШаблонНомеровИнвентарныхКарточек) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен шаблон номеров инвентарных карточек'"), ,
			"Запись.ШаблонНомеровИнвентарныхКарточек", , Отказ);
	КонецЕсли;
	
	Если НалогНаИмуществоНеПодлежитНалогообложению Тогда

		Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению");

	ИначеЕсли Не ЗначениеЗаполнено(Запись.НалогНаИмуществоПорядокНалогообложения)
		Или Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению") Тогда

		ТекстСообщения = НСтр("ru='Не заполнена налоговая льгота'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Запись.НалогНаИмуществоПорядокНалогообложения",
			, Отказ);

	КонецЕсли;

	Если Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
		"Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения") Тогда

		Запись.НалогНаИмуществоКодЛьготы = НалогНаИмуществоКодЛьготы;
		Если Не ЗначениеЗаполнено(Запись.НалогНаИмуществоКодЛьготы) Тогда
			ТекстСообщения = НСтр("ru='Не заполнен код льготы'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "НалогНаИмуществоКодЛьготы", , Отказ);
		КонецЕсли;

	Иначе
		Запись.НалогНаИмуществоКодЛьготы = "";
	КонецЕсли;

	Если Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
		"Перечисление.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент")
		И Запись.НалогНаИмуществоПроцентУменьшенияСуммыНалога = 0 Тогда

		ТекстСообщения = НСтр("ru='Не заполнен процент уменьшения суммы налога'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,
			"Запись.НалогНаИмуществоПроцентУменьшенияСуммыНалога", , Отказ);

	КонецЕсли;
	
	ПроверитьЗаполнениеНачислятьНДСприУСН(Отказ);
	
	Запись.ИсключатьНДСИзДоходовУСНПоДаннымКнигиПродаж = (ПорядокИсключенияНДСизДоходовУСНприПогашенииЗадолженности = 1);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если АвтонумерацияИнвентарныхКарточек Тогда
		Запись.ПорядокНумерацииИнвентарныхКарточек = ПорядокНумерацииИнвентарныхКарточек + 1;
	Иначе
		Запись.ПорядокНумерацииИнвентарныхКарточек = 0;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВвестиДатуИзмененияУчетнойПолитикиПослеЗакрытияВопроса",
			ЭтотОбъект);
		ПоказатьВводДаты(ОписаниеОповещения, Запись.Период, "Изменения учетной политики вступают в силу с:",
			ЧастиДаты.Дата);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем НоваяДата;
	
	Если ПараметрыЗаписи.Свойство("НоваяДата",НоваяДата) Тогда
		
		НоваяЗапись = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = НачалоМесяца(НоваяДата);
		НоваяЗапись.Организация = Запись.Организация;
		НоваяЗапись.Прочитать();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,Запись);
		НоваяЗапись.Период = НачалоМесяца(НоваяДата);
		НоваяЗапись.Записать();
		ПолучитьПараметрыУчетнойПолитики(Запись.Организация, НоваяЗапись.Период+1);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", Запись.Организация, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		Модифицированность = Ложь;
		
		Отказ = Истина;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если ТекущийОбъект.РассчитыватьСебестоимостьВКонцеГода
			И ЕстьОшибкаНастройкиРассчитыватьСебестоимостьВКонцеГода(ЭтотОбъект) Тогда
			
			ТекстОшибки = Нстр("ru = 'В этом периоде действия учетной политики есть проведенные регламентные документы не в конце года.
				|Перед записью необходимо отменить проведение этих документов.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "Запись.РассчитыватьСебестоимостьВКонцеГода", , Отказ);
				
		КонецЕсли;
	КонецЕсли;
	
	УправлениеФормойСервер();
	
	ЗначенияКлюча = Новый Структура("Период,Организация", Запись.Период, Запись.Организация);
	Элементы.Список.ТекущаяСтрока = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ИмяСобытия = "ИзменениеУчетнойПолитики";
	Параметр = Запись["Организация"];
	Оповестить(ИмяСобытия, Параметр);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Запись.Период = НачалоМесяца(Запись.Период);
	
	УстановитьВидимостьЭлементовПрогрессивнойШкалыУСН(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(НастройкиИспользованияРПС.Отбор, "Организация", Запись.Организация, ВидСравненияКомпоновкиДанных.Равно,, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтруктураРПСПриИзменении(Элемент)
	
	ТекущийТипРПС = ПолучитьТекущийРПС(Запись.СтруктураРПС);
	
	ПроверитьСоответствиеРПССистемеНалогообложения();
	
	УправлениеФормойСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияПриИзменении(Элемент)
	
	ПроверитьСоответствиеРПССистемеНалогообложения();
	
	Запись.РозничнаяТорговляОблагаетсяЕНВД = Запись.ПлательщикЕНВД;
	
	Если НЕ ЗначениеЗаполнено(Запись.ОбъектНалогообложенияУСН) Тогда
		Запись.ОбъектНалогообложенияУСН = ПредопределенноеЗначение("Перечисление.ОбъектыНалогообложенияПоУСН.Доходы");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.МетодРаспределенияРасходовУСНПоВидамДеятельности) Тогда
		Запись.МетодРаспределенияРасходовУСНПоВидамДеятельности = ПредопределенноеЗначение("Перечисление.МетодыРаспределенияРасходовУСНПоВидамДеятельности.ЗаКвартал");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.БазаРаспределенияРасходовУСНПоВидамДеятельности) Тогда
		Запись.БазаРаспределенияРасходовУСНПоВидамДеятельности = ПредопределенноеЗначение("Перечисление.БазаРаспределенияРасходовУСНПоВидамДеятельности.ДоходыОтРеализацииБУ");
	КонецЕсли;
	
	УстановитьСтавкуНалогаУСН();
	
	УстановитьПараметрыНДСПоУмолчанию();
	
	УправлениеФормойСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УчетНаСчете21ВУсловнойОценкеПриИзменении(Элемент)

	Запись.УчетНаСчете21ВУсловнойОценке = (УчетНаСчете21ВУсловнойОценке = 0);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВедениеАналитическогоУчетаИмуществаКазныПриИзменении(Элемент)
	Если НЕ Запись.ВедениеАналитическогоУчетаИмуществаКазны
		И Запись.НачислятьАмортизациюИмуществаКазны Тогда
		ТекстСообщения = НСтр("ru='Флаг ""Начислять амортизацию имущества казны"" очищен автоматически'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Запись.НачислятьАмортизациюИмуществаКазны = Ложь;
	КонецЕсли;
	ДоступностьНачисленияАмортизацииИК();
КонецПроцедуры

&НаКлиенте
Процедура НалогНаИмуществоНеПодлежитНалогообложениюПриИзменении(Элемент)
	
	Если Не НалогНаИмуществоНеПодлежитНалогообложению
		И Не ЗначениеЗаполнено(Запись.НалогНаИмуществоПорядокНалогообложения) Тогда
		Запись.НалогНаИмуществоПорядокНалогообложения =
			ПредопределенноеЗначение("Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены");
	КонецЕсли;
	
	Элементы.ГруппаНалогНаИмущество.Видимость = Не НалогНаИмуществоНеПодлежитНалогообложению;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогНаИмуществоПорядокНалогообложенияПриИзменении(Элемент)

	НалогНаИмуществоЗаполнитьКодЛьготы(ЭтотОбъект);
	УправлениеВидимостьюНалогНаИмуществоКодЛьготы(ЭтотОбъект);
	УправлениеВидимостьюНалогНаИмуществоКодОснованияЛьготы(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОткрытьПомощникНажатие(Элемент)
	
	ОбщаяСтавка = Новый Структура("НалогНаИмуществоПорядокНалогообложения,НалогНаИмуществоСтавка,НалогНаИмуществоКодЛьготы");
	ЗаполнитьЗначенияСвойств(ОбщаяСтавка, Запись);
	ПараметрыФормы = Новый Структура("Организация,Период,ОбщаяСтавка", Запись.Организация, Запись.Период, ОбщаяСтавка);
	ОткрытьФорму("Документ.РегистрацияСтавкиНалогаНаИмущество.Форма.ПомощникПерехода", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогНаИмуществоКодЛьготыПриИзменении(Элемент)
	
	УправлениеВидимостьюНалогНаИмуществоКодОснованияЛьготы(ЭтотОбъект);
	
	Если Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
		"Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения") Тогда
			
		Запись.НалогНаИмуществоКодЛьготы = НалогНаИмуществоКодЛьготы;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогНаИмуществоКодЛьготыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", "Код льготы");
	ПараметрыФормы.Вставить("ИмяМакета", "Документ.РегистрацияСтавкиНалогаНаИмущество.СпискиВыбора");
	ПараметрыФормы.Вставить("ТекущийПериод", Запись.Период);
	ПараметрыФормы.Вставить("ТекущийКод", НалогНаИмуществоКодЛьготы);

	Если Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
		"Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения") Тогда

		ПараметрыФормы.Вставить("Префикс", "КодЛьготы");

	ИначеЕсли Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
		"Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке") Тогда

		ПараметрыФормы.Вставить("Префикс", "КодЛьготыСнижениеСтавки");
	
	ИначеЕсли Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
		"Перечисление.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент") Тогда

		ПараметрыФормы.Вставить("Префикс", "КодЛьготыСнижениеСуммы");

	Иначе
		
		Возврат;
				
	КонецЕсли;

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НалогНаИмуществоКодОснованияЛьготыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОснованиеЛьготы", Элемент.ТекстРедактирования);
	ОткрытьФорму("ОбщаяФорма.ФормаВводаОснованияЛьготы", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НДСИндексПодразделенияПриИзменении(Элемент)
	
	Элементы["НДС_ИндексПодразделения"].Подсказка = НДС_ИндексПодразделенияПолучитьТекстКомментария(
		Запись["НДСИндексПодразделения"],
		НДС_ЭтоОбособленноеПодразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлательщикЕНВДПриИзменении(Элемент)
	
	Запись.РозничнаяТорговляОблагаетсяЕНВД = Запись.ПлательщикЕНВД;
	
	УправлениеФормойСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчитыватьСебестоимостьВКонцеГодаПриИзменении(Элемент)
	УстановитьВидимостьПредупрежденияРассчитыватьСебестоимостьВКонцеГода(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НачислятьАмортизациюПервымЧисломПриИзменении(Элемент)
	
	Запись.НачислятьАмортизациюПервымЧислом = (НачислятьАмортизациюПервымЧислом = 1);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НДСПрименяетсяОсвобождениеОтУплатыПриИзменении(Элемент)
	
	ЭтоУСН = (Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная"));
	
	Если Не ЭтоУСН Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьИндикаторНачислятьНДСприУСН(ЭтотОбъект);
	
	УстановитьРесурсСтавкаНалогообложенияПриУСН(ЭтотОбъект);
	
	НастроитьДоступностьИндикатораНачислятьНДСприУСН(ЭтотОбъект);
	
КонецПроцедуры

// УСН

&НаКлиенте
Процедура ДатаПереходаНаУСНПриИзменении(Элемент)

	Если (ЗначениеЗаполнено(Запись.ДатаПереходаНаУСН)) Тогда
		Запись.ДатаПереходаНаУСН = НачалоГода(Запись.ДатаПереходаНаУСН);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектНалогообложенияУСНПриИзменении(Элемент)

	УстановитьСтавкуНалогаУСН();
	
	УправлениеФормойСервер();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтавкуНалогаУСН()

	Запись.ПрименяетсяУСНДоходы = (Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная")
		И Запись.ОбъектНалогообложенияУСН = ПредопределенноеЗначение("Перечисление.ОбъектыНалогообложенияПоУСН.Доходы"));
	Запись.ПрименяетсяУСНДоходыМинусРасходы = (Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная")
		И Запись.ОбъектНалогообложенияУСН = ПредопределенноеЗначение("Перечисление.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы"));
	
	Если Запись.ПрименяетсяУСНДоходы Тогда
		Запись.СтавкаНалогаУСН = 6;
	ИначеЕсли Запись.ПрименяетсяУСНДоходыМинусРасходы Тогда
		Запись.СтавкаНалогаУСН = 15;
	Иначе
		Запись.СтавкаНалогаУСН = 0;
	КонецЕсли;

	ТекущаяСтавкаНалогаУСН = Запись.СтавкаНалогаУСН;

КонецПроцедуры

&НаКлиенте
Процедура СтавкаНалогаУСНПриИзменении(Элемент)
	
	// проверим введенное число
	// неотрицательное значение задать нельзя в силу ограничения типа
	// положительное - проверяем на превышение максимально допустимой ставки для выбранного объекта налогообложения
	ПределСтавки = 15;
	Если Запись.ПрименяетсяУСНДоходы Тогда
		ПределСтавки = 6;
	КонецЕсли;
	
	Если Запись.СтавкаНалогаУСН > ПределСтавки Тогда
		ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Выбранная ставка не может применяться.
			|Максимально допустимая ставка налога для выбранного объекта налогообложения равна %1 %.'"),
			ПределСтавки);
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Запись.СтавкаНалогаУСН = ТекущаяСтавкаНалогаУСН;
		Возврат;
	Иначе
		ТекущаяСтавкаНалогаУСН = Запись.СтавкаНалогаУСН;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокПередВыборомПослеЗакрытияВопроса", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Текущая запись изменена. Изменения будут потеряны. Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		УстановитьУчетнуюПолитикуНаДату();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)

	УстановитьУчетнуюПолитикуНаДату();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура МетодыРаспределенияКосвенныхЗатрат(Команда)
	                                                            
	ПараметрыФормы = Новый Структура("Организация", Запись.Организация);
	ОткрытьФорму("РегистрСведений.МетодыРаспределенияКосвенныхЗатратОрганизаций.Форма.ФормаСпискаНастройка", ПараметрыФормы);

КонецПроцедуры

&НаСервереБезКонтекста
Функция НаличиеСписковПрямыхРасходов(Организация)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МетодыОпределенияПрямыхРасходовПроизводстваВНУ.ПериодДействия,
	|	МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Организация
	|ИЗ
	|	РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ КАК МетодыОпределенияПрямыхРасходовПроизводстваВНУ
	|ГДЕ
	|	МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Организация = &Организация";

	РезультатЗапроса = Запрос.Выполнить();

	НаличиеСписков = Новый Структура();
	НаличиеСписков.Вставить("ЕстьСписокПрямыхРасходов", НЕ РезультатЗапроса.Пустой());

	Возврат НаличиеСписков;

КонецФункции

&НаКлиенте
Процедура МетодыОпределенияПрямыхРасходовПроизводстваНУ(Команда)

	НаличиеСписков = НаличиеСписковПрямыхРасходов(Запись.Организация);

	Если НаличиеСписков.ЕстьСписокПрямыхРасходов Тогда
		ОткрытьФормуОпределенияПрямыхРасходовНУ();
	Иначе
		
		ТекстВопроса = НСтр("ru = 'Список пуст.
		|
		|Создать записи, соответствующие рекомендациям ст.318 НК РФ?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьЗаписиПоРекомендациямПослеЗакрытияВопроса", ЭтотОбъект);
		ЗаголовокДиалогаВопроса = НСтр("ru = 'Методы определения прямых расходов НУ'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, ЗаголовокДиалогаВопроса);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаписиПоРекомендациямПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СтруктураЗаписи = Новый Структура("Организация, Период, РаспределятьОПЗ, РаспределятьОХЗ");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Запись);
		ЗаполнитьСписокПрямыхРасходов(СтруктураЗаписи);
	КонецЕсли;

	ОткрытьФормуОпределенияПрямыхРасходовНУ();

КонецПроцедуры

&НаКлиенте
Процедура ПорядокПризнанияРасходовУСН(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	ПараметрыФормы.Вставить("ПорядокПризнанияМатериальныхРасходов", Запись.ПорядокПризнанияМатериальныхРасходов);
	ПараметрыФормы.Вставить("ПорядокПризнанияРасходовПоТоварам", Запись.ПорядокПризнанияРасходовПоТоварам);
	ПараметрыФормы.Вставить("ПорядокПризнанияРасходовПоНДС", Запись.ПорядокПризнанияРасходовПоНДС);
	ПараметрыФормы.Вставить("ПорядокПризнанияДопРасходов", Запись.ПорядокПризнанияДопРасходов);
	ПараметрыФормы.Вставить("ПорядокПризнанияТаможенныхПлатежей", Запись.ПорядокПризнанияТаможенныхПлатежей);
	
	Оповещение = Новый ОписаниеОповещения(
		"ЗакрытиеФормыПорядокПризнанияРасходовУСН",
		ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.УчетнаяПолитикаОрганизаций.Форма.ПорядокПризнанияРасходовУСН",
		ПараметрыФормы, ЭтаФорма,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СредняяЧисленностьРаботниковОрганизации(Команда)
	
	ПараметрыОтбора = Новый Структура("Организация", Запись.Организация);
	ОткрытьФорму("РегистрСведений.СредняяЧисленностьРаботниковОрганизаций.ФормаСписка",
		Новый Структура("Отбор", ПараметрыОтбора));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыПорядокПризнанияРасходовУСН(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Модифицированность = Истина;
		
		ЗаполнитьЗначенияСвойств(Запись, Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокРегламентныхДокументов(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбновитьВидимостьПредупрежденияРассчитыватьСебестоимостьВКонцеГода", ЭтотОбъект);
	
	ОтборФормыСписка = Новый Структура("Организация", Запись.Организация);
	ПараметрыОткрытияФормы = Новый Структура("Отбор", ОтборФормыСписка);
	ОткрытьФорму("ЖурналДокументов.РегламентныеДокументыПоУчетуЗатратНаПроизводство.ФормаСписка", ПараметрыОткрытияФормы, ЭтотОбъект, Запись.Организация, , , ОповещениеОЗакрытии);
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьПредупрежденияРассчитыватьСебестоимостьВКонцеГода(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	УстановитьВидимостьПредупрежденияРассчитыватьСебестоимостьВКонцеГода(ЭтотОбъект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПредупрежденияРассчитыватьСебестоимостьВКонцеГода(Форма)
	ПоказатьПредупреждающуюНадпись = ЕстьОшибкаНастройкиРассчитыватьСебестоимостьВКонцеГода(Форма);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаПредупреждениеРассчитыватьСебестоимостьВКонцеГода",
		"Видимость",
		ПоказатьПредупреждающуюНадпись);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЕстьОшибкаНастройкиРассчитыватьСебестоимостьВКонцеГода(Форма)
	Возврат Форма.Запись.РассчитыватьСебестоимостьВКонцеГода
		И ЕстьПроведенныеЕжемесячныеЗакрытия(Форма.Запись.Организация, Форма.Запись.Период, Форма.ОкончаниеДействия);
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьПроведенныеЕжемесячныеЗакрытия(Знач Организация, Знач ДатаНачала, Знач ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПроверяемыйДокумент.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСчетовПроизводственныхЗатрат КАК ПроверяемыйДокумент
	|ГДЕ
	|	ПроверяемыйДокумент.Организация = &Организация
	|	И ПроверяемыйДокумент.Проведен
	|	И МЕСЯЦ(ПроверяемыйДокумент.Дата) <> 12
	|	И &УсловиеПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПроверяемыйДокумент.Ссылка
	|ИЗ
	|	Документ.СписаниеЗатратПоУслугам КАК ПроверяемыйДокумент
	|ГДЕ
	|	ПроверяемыйДокумент.Организация = &Организация
	|	И ПроверяемыйДокумент.Проведен
	|	И МЕСЯЦ(ПроверяемыйДокумент.Дата) <> 12
	|	И &УсловиеПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПроверяемыйДокумент.Ссылка
	|ИЗ
	|	Документ.РегистрацияБазыРаспределенияОбщихЗатрат КАК ПроверяемыйДокумент
	|ГДЕ
	|	ПроверяемыйДокумент.Организация = &Организация
	|	И ПроверяемыйДокумент.Проведен
	|	И МЕСЯЦ(ПроверяемыйДокумент.Дата) <> 12
	|	И &УсловиеПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПроверяемыйДокумент.Ссылка
	|ИЗ
	|	Документ.НезавершенноеПроизводство КАК ПроверяемыйДокумент
	|ГДЕ
	|	ПроверяемыйДокумент.Организация = &Организация
	|	И ПроверяемыйДокумент.Проведен
	|	И МЕСЯЦ(ПроверяемыйДокумент.Дата) <> 12
	|	И &УсловиеПериод";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УсловиеПериод = Новый Массив;
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		УсловиеПериод.Добавить("ПроверяемыйДокумент.Дата >= &ДатаНачала");
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		УсловиеПериод.Добавить("ПроверяемыйДокумент.Дата <= &ДатаОкончания");
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	КонецЕсли;
	Если УсловиеПериод.Количество() = 0 Тогда
		УсловиеПериодСтрокой = "ИСТИНА";
	Иначе
		УсловиеПериодСтрокой = СтрСоединить(УсловиеПериод, " И ");
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПериод", УсловиеПериодСтрокой);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ВвестиДатуИзмененияУчетнойПолитикиПослеЗакрытияВопроса(Дата, Параметры) Экспорт
	
	Если Дата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПроверитьСуществованиеЗаписиНаВыбраннуюДату(Дата, Запись.Организация) Тогда
		ЗаписатьДанныеНаДату(Дата);
	Иначе
		ДопПараметры = Новый Структура("Дата", Дата);
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаменитьЗаписьПослеЗакрытияВопроса", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'На %1 уже есть запись. Заменить?'"), Формат(Дата, "ДЛФ=D"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьЗаписьПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаписатьДанныеНаДату(Параметры.Дата);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеНаДату(Дата)
	
	Модифицированность = Ложь;
	ПараметрыЗаписи = Новый Структура("НоваяДата",Дата);
	Записать(ПараметрыЗаписи);	
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыУчетнойПолитики(Знач Организация, Знач НаДату, УстанавливатьЗначенияПоУмолчанию=Ложь)
	
	УчетнаяПолитикаМенеджерЗаписи = РеквизитФормыВЗначение("Запись");
	ПараметрыУчетнойПолитики = Справочники.Организации.ПолучитьУчетнуюПолитику(Организация, НаДату);
	ЗаполнитьЗначенияСвойств(УчетнаяПолитикаМенеджерЗаписи, ПараметрыУчетнойПолитики);
	УчетнаяПолитикаМенеджерЗаписи.Прочитать();
	
	Если УстанавливатьЗначенияПоУмолчанию
	   И НЕ ЗначениеЗаполнено(УчетнаяПолитикаМенеджерЗаписи.Организация)
	   И НЕ ЗначениеЗаполнено(УчетнаяПолитикаМенеджерЗаписи.Период) Тогда // еще нет учетной политики для этой организации
		
		РегистрыСведений.УчетнаяПолитикаОрганизаций.УстановитьПараметрыУчетнойПолитикиПоУмолчанию(
			УчетнаяПолитикаМенеджерЗаписи, Новый Структура("Организация, Период", Организация, НачалоГода(НаДату)));
		
		РегистрыСведений.УчетнаяПолитикаОрганизаций.УстановитьПараметрыУчетнойПолитикиПоУмолчаниюНаПериод(
			УчетнаяПолитикаМенеджерЗаписи);
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(УчетнаяПолитикаМенеджерЗаписи, "Запись");
	ПараметрыУчетнойПолитики.Свойство("ОкончаниеДействия", ОкончаниеДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередВыборомПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		УстановитьУчетнуюПолитикуНаДату();
	Иначе
		Элементы.Список.ТекущаяСтрока = Запись.ИсходныйКлючЗаписи;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУчетнуюПолитикуНаДату()
	
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	
	ПолучитьПараметрыУчетнойПолитики(ТекущиеДанные.Организация, ТекущиеДанные.Период + 1);	
	УправлениеФормойСервер();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеЗаписиНаВыбраннуюДату(Дата,Организация)
	НоваяЗапись = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьМенеджерЗаписи();	
	НоваяЗапись.Период = НачалоМесяца(Дата);
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.Прочитать();
	
	Возврат НоваяЗапись.Выбран();
	
КонецФункции

&НаКлиенте
Процедура ДоступностьНачисленияАмортизацииИК()

	Элементы.НачислятьАмортизациюИмуществаКазны.Доступность = Запись.ВедениеАналитическогоУчетаИмуществаКазны;

КонецПроцедуры // ДоступностьНачисленияАмортизацииИК()

&НаСервереБезКонтекста
Функция ПолучитьТекущийРПС(СтруктураРПС)
	
	Возврат СтруктураРПС.ТипПланаСчетов;

КонецФункции	

&НаСервере
Процедура УправлениеФормойСервер()
	
	ЭтоОСН 				= Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая");
	ЭтоУСН 				= Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная");
	ЭтоОсобыйПорядок 	= Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок");
	
	Элементы.СтраницаНалогНаПрибыль.Видимость 	= ЭтоОСН;
	Элементы.СтраницаУСН.Видимость				= ЭтоУСН;
	Элементы.СтраницаЕНВД.Видимость				= ЭтоОСН ИЛИ ЭтоУСН;
	
	Элементы.ПорядокПризнанияРасходовУСН.Видимость = Запись.ПрименяетсяУСНДоходыМинусРасходы;
	
	Элементы.РозничнаяТорговляОблагаетсяЕНВД.Доступность                       = Запись.ПлательщикЕНВД;
	Элементы.БазаРаспределенияКосвенныхРасходовПоВидамДеятельности.Доступность = Запись.ПлательщикЕНВД;
	Элементы.МетодРаспределенияУСН.Доступность                                 = Запись.ПлательщикЕНВД;
	Элементы.БазаРаспределенияУСН.Доступность                                  = Запись.ПлательщикЕНВД;
	
	Если ЭтоОСН Тогда
		Элементы.ГруппаСтраницыРаспределениеРасходовЕНВД.ТекущаяСтраница = Элементы.ГруппаРаспределениеРасходовНалогНаПрибыль;
	ИначеЕсли ЭтоУСН Тогда
		Элементы.ГруппаСтраницыРаспределениеРасходовЕНВД.ТекущаяСтраница = Элементы.ГруппаРаспределениеРасходовУСН;
	Иначе
		Элементы.ГруппаСтраницыРаспределениеРасходовЕНВД.ТекущаяСтраница = Элементы.ГруппаРаспределениеРасходовНеРаспределяются;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовПрогрессивнойШкалыУСН(ЭтотОбъект);
	
	НДС_НастроитьФормуСервер();
	
	УчетНаСчете21ВУсловнойОценке		= ?(Запись.УчетНаСчете21ВУсловнойОценке, 0, 1);
	НачислятьАмортизациюПервымЧислом    = ?(Запись.НачислятьАмортизациюПервымЧислом, 1, 0);
	ПорядокНумерацииИнвНомеров			= ?(ЗначениеЗаполнено(Запись.ШаблонИнвентарныхНомеров), 1, 0);
	АвтонумерацияИнвентарныхКарточек	= (Запись.ПорядокНумерацииИнвентарныхКарточек > 0);
	ПорядокНумерацииИнвентарныхКарточек	= Макс(Запись.ПорядокНумерацииИнвентарныхКарточек - 1, 0);
	
	НалогНаИмуществоНеПодлежитНалогообложению = (Запись.НалогНаИмуществоПорядокНалогообложения
		= Перечисления.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению);
	Элементы.ГруппаНалогНаИмущество.Видимость = Не НалогНаИмуществоНеПодлежитНалогообложению;
	УправлениеВидимостьюНалогНаИмуществоКодЛьготы(ЭтотОбъект);
	УправлениеВидимостьюНалогНаИмуществоКодОснованияЛьготы(ЭтотОбъект);
		
	Элементы.ШаблонИнвентарныхНомеров.ТолькоПросмотр					= (ПорядокНумерацииИнвНомеров <> 1);
	Элементы.ГруппаПорядокНумерацииИнвентарныхКарточек.ТолькоПросмотр	= Не АвтонумерацияИнвентарныхКарточек;
	Элементы.ШаблонНомеровИнвентарныхКарточек.ТолькоПросмотр			= (ПорядокНумерацииИнвентарныхКарточек <> 2);
	
	УстановитьВидимостьПредупрежденияРассчитыватьСебестоимостьВКонцеГода(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовПрогрессивнойШкалыУСН(Форма)
	
	ПрименяетсяУСН =
		Форма.Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная");
	ПрименяетсяУСНДоходы =
		Форма.Запись.ОбъектНалогообложенияУСН = ПредопределенноеЗначение("Перечисление.ОбъектыНалогообложенияПоУСН.Доходы");
	ПрименяетсяУСНДоходыМинусРасходы =
		Форма.Запись.ОбъектНалогообложенияУСН = ПредопределенноеЗначение("Перечисление.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы");
	
	Если ЗначениеЗаполнено(Форма.ОкончаниеДействия) Тогда
		ПрименяетсяПрогрессивнаяШкалаУСН = ПрименяетсяУСН
			И Форма.ОкончаниеДействия >= УчетУСНКлиентСервер.ДатаНачалаПрогрессивнойШкалы()
			И Форма.ОкончаниеДействия < УчетУСНКлиентСервер.ДатаОтменыПрогрессивнойШкалы();
	Иначе // Дата окончания действия учетной политики не указана.
		ПрименяетсяПрогрессивнаяШкалаУСН = ПрименяетсяУСН
			И Форма.Запись.Период < УчетУСНКлиентСервер.ДатаОтменыПрогрессивнойШкалы();
	КонецЕсли;
	
	ЭлементыПрогрессивнойШкалыУСН = Новый Массив;
	ЭлементыПрогрессивнойШкалыУСН.Добавить("СтавкаНалогаУСНПовышенная");
	ЭлементыПрогрессивнойШкалыУСН.Добавить("ДекорацияСтавкаУСНПовышеннаяПроцент");
	ЭлементыПрогрессивнойШкалыУСН.Добавить("СредняяЧисленностьРаботниковОрганизации");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		ЭлементыПрогрессивнойШкалыУСН, "Видимость", ПрименяетсяПрогрессивнаяШкалаУСН);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияОтменаПрогрессивнойШкалыУСН", "Видимость", ПрименяетсяПрогрессивнаяШкалаУСН И НЕ ЗначениеЗаполнено(Форма.ОкончаниеДействия));
	
	Если ПрименяетсяПрогрессивнаяШкалаУСН Тогда
		
		СтавкиПоУмолчанию = УчетУСНКлиентСервер.НалоговыеСтавкиПоУмолчанию(Макс(Форма.Запись.Период, УчетУСНКлиентСервер.ДатаНачалаПрогрессивнойШкалы()));
		Если ПрименяетсяУСНДоходы Тогда
			Форма.СтавкаНалогаУСНПовышенная = СтавкиПоУмолчанию.СтавкаУСНДоходыПовышенная;
		ИначеЕсли ПрименяетсяУСНДоходыМинусРасходы Тогда
			Форма.СтавкаНалогаУСНПовышенная = СтавкиПоУмолчанию.СтавкаУСНДоходыМинусРасходыПовышенная;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СтавкаНалогаУСН", "Заголовок", НСтр("ru = 'Основная ставка'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДекорацияПроцентНалогаУСН", "ОтображениеПодсказки", ОтображениеПодсказки.ОтображатьСправа);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДекорацияСтавкаУСНПовышеннаяПроцент", "ОтображениеПодсказки", ОтображениеПодсказки.ОтображатьСправа);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СтавкаНалогаУСН", "Заголовок", НСтр("ru = 'Ставка налога'"));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДекорацияПроцентНалогаУСН", "ОтображениеПодсказки", ОтображениеПодсказки.Нет);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДекорацияСтавкаУСНПовышеннаяПроцент", "ОтображениеПодсказки", ОтображениеПодсказки.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеРПССистемеНалогообложения()
	
	Если Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная")
		И ( ТекущийТипРПС = ПредопределенноеЗначение("Перечисление.ТипыПлановСчетов.ДляБюджетных") 
		ИЛИ ТекущийТипРПС = ПредопределенноеЗначение("Перечисление.ТипыПлановСчетов.ДляКазенных") ) Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Согласно п.3 статьи 346.12 НК РФ казенные и бюджетные учреждения не вправе применять УСН.'"));
		Если ТекущийТипРПС = ПредопределенноеЗначение("Перечисление.ТипыПлановСчетов.ДляКазенных") Тогда
			Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок");
		Иначе
			Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Общая");
		КонецЕсли;
		
	ИначеЕсли Запись.СистемаНалогообложения <> ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок")
		И ТекущийТипРПС = ПредопределенноеЗначение("Перечисление.ТипыПлановСчетов.ДляКазенных") Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'Для казенных учреждений применяется особый порядок отражения операций в налоговом учете:
			|1. Доходы казенного учреждения, подлежащие включению в налоговую базу по налогу на прибыль,
			|отражаются документом «Операция (бухгалтерская)» проводками Дт НПВ Кт Н90.01, Н90.02, Н91.01.
			|2. Для расчета налоговой базы и начисления налога на прибыль используются регламентные документы
			|«Расчет базы по налогу на прибыль» и «Расчет налога на прибыль» (в разделе «Налог на прибыль - Регламентные документы»).
			|3. Декларация по налогу на прибыль и регистры налогового учета заполняются автоматически по данным,
			|отраженным на счетах налогового учета Н01-Н99.'"));
		Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОпределенияПрямыхРасходовНУ()
	
	ПараметрыОтбора = Новый Структура("Организация", Запись.Организация);
	ОткрытьФорму("РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.ФормаСписка",
		Новый Структура("Отбор", ПараметрыОтбора));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокПрямыхРасходов(Запись)

	ТекущийПериод = НачалоГода(Запись.Период);

	Набор = РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.СоздатьНаборЗаписей();

	Набор.Отбор.ПериодДействия.Установить(ТекущийПериод);
	Набор.Отбор.Организация.Установить(Запись.Организация);
	
	СчетаСебестоимость           = БухгалтерскийУчет.СписокСчетов("109.60,106.2И,106.3И,106.4И");
	СчетНакладныеРасходы         = БухгалтерскийУчет.СчетПоКоду("109.70", ТекущийПериод);
	СчетОбщехозяйственныеРасходы = БухгалтерскийУчет.СчетПоКоду("109.80", ТекущийПериод);

	Если Запись.РаспределятьОХЗ И Запись.РаспределятьОПЗ Тогда
		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
													Перечисления.ВидыРасходовНУ.МатериальныеРасходы);
		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
													Перечисления.ВидыРасходовНУ.Амортизация);
		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
													Перечисления.ВидыРасходовНУ.ОплатаТруда);
	Иначе
		Для Каждого СчетСебестоимость Из СчетаСебестоимость Цикл
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.МатериальныеРасходы, СчетСебестоимость);
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.Амортизация, СчетСебестоимость);
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.ОплатаТруда, СчетСебестоимость);
		КонецЦикла;
		Если Запись.РаспределятьОПЗ Тогда
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.МатериальныеРасходы, СчетНакладныеРасходы);
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.Амортизация, СчетНакладныеРасходы);
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.ОплатаТруда, СчетНакладныеРасходы);
		КонецЕсли;
		Если Запись.РаспределятьОХЗ Тогда
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.МатериальныеРасходы, СчетОбщехозяйственныеРасходы);
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.Амортизация, СчетОбщехозяйственныеРасходы);
			ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор,ТекущийПериод, Запись.Организация,
														Перечисления.ВидыРасходовНУ.ОплатаТруда, СчетОбщехозяйственныеРасходы);
		КонецЕсли;
	КонецЕсли;


	ВидРасходовНУ    = Перечисления.ВидыРасходовНУ.СтраховыеВзносы;
	ВидРасходовНУПФР = Перечисления.ВидыРасходовНУ.СтраховыеВзносы;
	ВидРасходовНУПНС = Перечисления.ВидыРасходовНУ.ПрочиеРасходы;

	Для Каждого СчетСебестоимость Из СчетаСебестоимость Цикл
		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор, ТекущийПериод, Запись.Организация,
													ВидРасходовНУ,СчетСебестоимость,БухгалтерскийУчет.СчетПоКоду("303.02", ТекущийПериод));

		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор, ТекущийПериод, Запись.Организация,
													ВидРасходовНУПФР,СчетСебестоимость,БухгалтерскийУчет.СчетПоКоду("303.10", ТекущийПериод));
		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор, ТекущийПериод, Запись.Организация,
													ВидРасходовНУПФР,СчетСебестоимость,БухгалтерскийУчет.СчетПоКоду("303.11", ТекущийПериод));
		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор, ТекущийПериод, Запись.Организация,
													ВидРасходовНУПФР,СчетСебестоимость,БухгалтерскийУчет.СчетПоКоду("303.09", ТекущийПериод));


		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор, ТекущийПериод, Запись.Организация,
													ВидРасходовНУ,СчетСебестоимость,БухгалтерскийУчет.СчетПоКоду("303.07", ТекущийПериод));
		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор, ТекущийПериод, Запись.Организация,
													ВидРасходовНУ,СчетСебестоимость,БухгалтерскийУчет.СчетПоКоду("303.08", ТекущийПериод));


		ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Набор, ТекущийПериод, Запись.Организация,
													ВидРасходовНУПНС,СчетСебестоимость,БухгалтерскийУчет.СчетПоКоду("303.06", ТекущийПериод));
	КонецЦикла;

	Набор.Записать();

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЗаписьСпискаПрямыхРасходовПоУмолчанию(Объект, ТекущийПериод, ТекущаяОрганизация, ВидРасходовНУ, СчетДебета = Неопределено,СчетКредита = Неопределено)

	НоваяЗапись = Объект.Добавить();
	НоваяЗапись.ПериодДействия = ТекущийПериод;
	НоваяЗапись.Организация    = ТекущаяОрганизация;
	НоваяЗапись.ВидРасходовНУ  = ВидРасходовНУ;
	НоваяЗапись.Счет           = СчетДебета;
	НоваяЗапись.КорСчет        = СчетКредита;

КонецПроцедуры

// НДС

&НаСервере
Процедура НДС_НастроитьФормуСервер()
	
	// Оформление Индекса подразделения
	ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись["Организация"], "ГоловнаяОрганизация");
	НДС_ЭтоОбособленноеПодразделение = ЗначениеЗаполнено(ГоловнаяОрганизация);
	Элементы["НДС_ИндексПодразделения"].Подсказка = НДС_ИндексПодразделенияПолучитьТекстКомментария(
		Запись["НДСИндексПодразделения"],
		НДС_ЭтоОбособленноеПодразделение);
	
	ПорядокРегистрацииПоУмолчанию = УчетНДСКлиентСервер.ПолучитьПорядокРегистрацииСчетовФактурНаАвансПоУмолчанию();
	
	Элементы["НДСПорядокРегистрацииСчетовФактурНаАванс"].ПодсказкаВвода = ПорядокРегистрацииПоУмолчанию;
	
	НДС_НастроитьФорму_ПоНачислятьПоКОСГУ189ПоВнебюджету(ЭтаФорма);
	
	УстановитьИндикаторНачислятьНДСприУСН(ЭтотОбъект);
	НастроитьВидимостьИндикатораНачислятьНДСприУСН();
	НастроитьДоступностьИндикатораНачислятьНДСприУСН(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НДС_ИндексПодразделенияПолучитьТекстКомментария(ИндексПодразделения, ЭтоОбособленноеПодразделение)
	
	Если ЭтоОбособленноеПодразделение Тогда
		Возврат НСтр("ru='применяется при печати выданных счетов-фактур'");
		
	Иначе
		Возврат НСтр("ru='не применяется, т.к. организация не является обособленным подразделением'");
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПорядокНумерацииИнвНомеровПриИзменении(Элемент)
	
	Элементы.ШаблонИнвентарныхНомеров.ТолькоПросмотр = (ПорядокНумерацииИнвНомеров <> 1);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтонумерацияИнвентарныхКарточекПриИзменении(Элемент)
	
	Элементы.ГруппаПорядокНумерацииИнвентарныхКарточек.ТолькоПросмотр = Не АвтонумерацияИнвентарныхКарточек;
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокНумерацииИнвентарныхКарточекПриИзменении(Элемент)
	
	Элементы.ШаблонНомеровИнвентарныхКарточек.ТолькоПросмотр = (ПорядокНумерацииИнвентарныхКарточек <> 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияУправлениеНомерамиНажатие(Элемент)
	
	ОткрытьФорму("Обработка.УправлениеНомерамиИнвентарныхКарточек.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура НДСНачислятьПоКОСГУ189ПоВнебюджетуПриИзменении(Элемент)
	
	НДС_НастроитьФорму_ПоНачислятьПоКОСГУ189ПоВнебюджету(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НДС_НастроитьФорму_ПоНачислятьПоКОСГУ189ПоВнебюджету(Форма)
	
	Форма.Элементы["НДСКБКдляКОСГУ189"].ТолькоПросмотр = НЕ Форма.Запись["НДСНачислятьПоКОСГУ189ПоВнебюджету"];
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьИндикаторНачислятьНДСприУСН(Форма)
	
	Форма.НачислятьНДСприУСН = 0;
	
	Если Форма.Запись.НДСПрименяетсяОсвобождениеОтУплаты Тогда
		Возврат;
	КонецЕсли;
	
	СтавкаНалогообложенияПриУСН = Форма.Запись.СтавкаНалогообложенияПриУСН;
	
	Если СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ПониженнаяУСН") Тогда
		Форма.НачислятьНДСприУСН = 1;
		
	ИначеЕсли СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ОбщаяУСН") Тогда
		Форма.НачислятьНДСприУСН = 2;
		
	ИначеЕсли СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Общая") Тогда
		Форма.НачислятьНДСприУСН = 3;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРесурсСтавкаНалогообложенияПриУСН(Форма)
	
	Форма.Запись.СтавкаНалогообложенияПриУСН = Неопределено;
	
	Если Форма.Запись.НДСПрименяетсяОсвобождениеОтУплаты Тогда
		Возврат;
	КонецЕсли;
	
	НачислятьНДСприУСН = Форма.НачислятьНДСприУСН;
	
	Если НачислятьНДСприУСН = 1 Тогда
		Форма.Запись.СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ПониженнаяУСН");
		
	ИначеЕсли НачислятьНДСприУСН = 2 Тогда
		Форма.Запись.СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.ОбщаяУСН");
		
	ИначеЕсли НачислятьНДСприУСН = 3 Тогда
		Форма.Запись.СтавкаНалогообложенияПриУСН = ПредопределенноеЗначение("Перечисление.ВидыСтавокНДС.Общая");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьИндикатораНачислятьНДСприУСН()
	
	ЭтоУСН = (Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная"));
	
	Элементы.НачислятьНДСприУСН.Видимость = ЭтоУСН;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьИндикатораНачислятьНДСприУСН(Форма)
	
	Форма.Элементы.НачислятьНДСприУСН.Доступность = Не Форма.Запись.НДСПрименяетсяОсвобождениеОтУплаты;
	
КонецПроцедуры

&НаКлиенте
Процедура НачислятьНДСприУСНПриИзменении(Элемент)
	
	УстановитьРесурсСтавкаНалогообложенияПриУСН(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеНачислятьНДСприУСН(Отказ)
	
	ЭтоУСН = (Запись.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная"));
	
	Если Не ЭтоУСН Или Запись.НДСПрименяетсяОсвобождениеОтУплаты Или ЗначениеЗаполнено(НачислятьНДСприУСН) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", , НСтр("ru = 'Начислять НДС по ставке'"));
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "НачислятьНДСприУСН",, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыНДСПоУмолчанию()
	
	Запись.НДСПрименяетсяОсвобождениеОтУплаты = (Запись.ПрименяетсяУСНДоходы Или Запись.ПрименяетсяУСНДоходыМинусРасходы);
	
	Запись.НДСНалоговыйПериод = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал");
	
	Запись.НДСНачислятьПоКОСГУ189ПоВнебюджету = Ложь;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НалогНаИмуществоЗаполнитьКодЛьготы(Форма)

	Запись = Форма.Запись;

	Если Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения") Тогда
				
		Форма.НалогНаИмуществоКодЛьготы = Запись.НалогНаИмуществоКодЛьготы;
		
	ИначеЕсли Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке") Тогда
				
		Форма.НалогНаИмуществоКодЛьготы = "2012400";
		
	ИначеЕсли Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент") Тогда
				
		Форма.НалогНаИмуществоКодЛьготы = "2012500";
				
	Иначе
			
		Форма.НалогНаИмуществоКодЛьготы = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюНалогНаИмуществоКодЛьготы(Форма)

	Элементы = Форма.Элементы;
	Запись = Форма.Запись;

	ВидимостьКодЛьготы = (Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.ОсвобождаетсяОтНалогообложения"))
		Или (Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке"))
		Или (Запись.НалогНаИмуществоПорядокНалогообложения = ПредопределенноеЗначение(
			"Перечисление.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент"));
	
	Элементы.НалогНаИмуществоКодЛьготы.Видимость = ВидимостьКодЛьготы;

	Элементы.НалогНаИмуществоПроцентУменьшенияСуммыНалога.Видимость = Запись.НалогНаИмуществоПорядокНалогообложения =
		ПредопределенноеЗначение("Перечисление.ПорядокНалогообложенияИмущества.СнижениеСуммыНаПроцент");

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеВидимостьюНалогНаИмуществоКодОснованияЛьготы(Форма)

	Элементы = Форма.Элементы;

	РегиональныеЛьготы = Новый Соответствие;
	РегиональныеЛьготы.Вставить("2012000", Истина);
	РегиональныеЛьготы.Вставить("2012400", Истина);
	РегиональныеЛьготы.Вставить("2012500", Истина);
	
	ВидимостьКодОснованияЛьготы = Элементы.НалогНаИмуществоКодЛьготы.Видимость
		И РегиональныеЛьготы[Форма.НалогНаИмуществоКодЛьготы] <> Неопределено;
		
	Элементы.ДекорацияКодЛьготы.Видимость = ВидимостьКодОснованияЛьготы;
	Элементы.НалогНаИмуществоКодОснованияЛьготы.Видимость = ВидимостьКодОснованияЛьготы;
	
КонецПроцедуры

#КонецОбласти
