&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

&НаКлиенте
Перем ФормаДлительнойОперации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПоОбщемуРасписанию = ?(Объект.ПоОтдельномуРасписанию, 1, 0);
	
	ОписаниеДопПараметров = Объект.Ссылка.ПолучитьОбъект().ОписаниеДополнительныхПараметров.Получить();
	
	ДопПараметрыАвтопроверки = Объект.Ссылка.ПолучитьОбъект().ДополнительныеПараметрыАвтопроверки.Получить();
	
	Если НЕ ТипЗнч(ДопПараметрыАвтопроверки) = Тип("Структура") Тогда
		ДопПараметрыАвтопроверки = Новый Структура;
	КонецЕсли;
	
	Если ТипЗнч(ОписаниеДопПараметров) = Тип("ТаблицаЗначений") Тогда
		
		ДобавляемыеРеквизиты = Новый Массив;
		
		Для Каждого ДопПараметр Из ОписаниеДопПараметров Цикл
			
			НовыйРеквизит = Новый РеквизитФормы(ДопПараметр.ИмяПараметра, Новый ОписаниеТипов(ДопПараметр.ТипПараметра),, ДопПараметр.Заголовок);
			
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
			
			Если ДопПараметрыПроверки.НайтиПоЗначению(ДопПараметр.ИмяПараметра) = Неопределено Тогда
				ДопПараметрыПроверки.Добавить(ДопПараметр.ИмяПараметра);
			КонецЕсли;
			
			Если ДопПараметр.ИспользуетсяДляАвтопроверки Тогда
				
				НовыйРеквизит = Новый РеквизитФормы("Автопроверка" + ДопПараметр.ИмяПараметра, Новый ОписаниеТипов(ДопПараметр.ТипПараметра),, ДопПараметр.Заголовок);
				
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		Для Каждого ДопПараметр Из ОписаниеДопПараметров Цикл
			
			НовыйЭлемент = Элементы.Добавить(ДопПараметр.ИмяПараметра, Тип("ПолеФормы"), Элементы.ГруппаДополнительныеПараметры);
			
			НовыйЭлемент.ПутьКДанным = ДопПараметр.ИмяПараметра;
			
			Если ДопПараметр.ТипПараметра = "Булево" Тогда
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
				НовыйЭлемент.АвтоОтметкаНезаполненного = ДопПараметр.Обязательный;
			КонецЕсли;
			
			ЭтотОбъект[ДопПараметр.ИмяПараметра] = ДопПараметр.ЗначениеПоУмолчанию;
			
			Если ДопПараметр.ИспользуетсяДляАвтопроверки Тогда
				
				НовыйЭлемент = Элементы.Добавить("Автопроверка" + ДопПараметр.ИмяПараметра, Тип("ПолеФормы"), Элементы.ГруппаДополнительныеПараметрыАвтопроверки);
			
				НовыйЭлемент.ПутьКДанным = "Автопроверка" + ДопПараметр.ИмяПараметра;
			
				Если ДопПараметр.ТипПараметра = "Булево" Тогда
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
				Иначе
					НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
					НовыйЭлемент.АвтоОтметкаНезаполненного = ДопПараметр.Обязательный;
				КонецЕсли;
				
				Если ДопПараметрыАвтопроверки.Свойство(ДопПараметр.ИмяПараметра) И ЗначениеЗаполнено(ДопПараметрыАвтопроверки[ДопПараметр.ИмяПараметра]) Тогда
					ЭтотОбъект["Автопроверка" + ДопПараметр.ИмяПараметра] = ДопПараметрыАвтопроверки[ДопПараметр.ИмяПараметра];
				Иначе
					ЭтотОбъект["Автопроверка" + ДопПараметр.ИмяПараметра] = ДопПараметр.ЗначениеПоУмолчанию;
					ДопПараметрыАвтопроверки.Вставить(ДопПараметр.ИмяПараметра);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
		Для Каждого КлючЗначение Из ДопПараметрыАвтопроверки Цикл
			СтрокаДопПоиск = Новый Структура("ИмяПараметра, ИспользуетсяДляАвтопроверки", КлючЗначение.Ключ, Истина);
			Если ОписаниеДопПараметров.НайтиСтроки(СтрокаДопПоиск).Количество() = 0 Тогда
				ДопПараметрыАвтопроверки.Удалить(КлючЗначение.Ключ);
			КонецЕсли;
		КонецЦикла
	
	КонецЕсли;
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//Общее задание
	ПараметрыПоиска = Новый Структура;
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		ПараметрыПоиска.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ПроверкаСостоянияСистемы);
		ПараметрыПоиска.Вставить("Предопределенное", Истина);
	Иначе
		ПараметрыПоиска.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ПроверкаСостоянияСистемы);
	КонецЕсли;
	
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоиска);
	
	Если СписокЗаданий.Количество() = 1 Тогда
		Если ТипЗнч(СписокЗаданий[0]) = Тип("РегламентноеЗадание") Тогда
			РасписаниеРегламентногоЗаданияОбщее = СписокЗаданий[0].Расписание;
		ИначеЕсли СписокЗаданий[0].Шаблон = ПредопределенноеЗначение("Справочник.ШаблоныЗаданийОчереди.ПустаяСсылка") Тогда
			РасписаниеРегламентногоЗаданияОбщее = СписокЗаданий[0].Расписание;
		Иначе
			РасписаниеРегламентногоЗаданияОбщее = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СписокЗаданий[0].Шаблон,"Расписание").Получить();
		КонецЕсли;
	КонецЕсли;
	
	//Индивидуальное задание
	ПараметрыПоиска = Новый Структура;
	Если НЕ ОбщегоНазначения.РазделениеВключено() Тогда
		ПараметрыПоиска.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ПроверкаСостоянияСистемы);
		ПараметрыПоиска.Вставить("УникальныйИдентификатор", ТекущийОбъект.РегламентноеЗаданиеGUID);
	Иначе
		ПараметрыПоиска.Вставить("Идентификатор", ТекущийОбъект.РегламентноеЗаданиеGUID);
	КонецЕсли;
	
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыПоиска);
	
	Если СписокЗаданий.Количество() = 1 Тогда
		РасписаниеРегламентногоЗадания = СписокЗаданий[0].Расписание;
	КонецЕсли;
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Код) Тогда
		ТекущийОбъект.УстановитьНовыйКод();
	КонецЕсли;
	
	Если РасписаниеРегламентногоЗадания <> Неопределено Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("РасписаниеВыполнения", РасписаниеРегламентногоЗадания);
	КонецЕсли;
	
	Если ТипЗнч(ДопПараметрыАвтопроверки) = Тип("Структура") И ДопПараметрыАвтопроверки.Количество() > 0 Тогда
		Для Каждого КлючЗначение Из ДопПараметрыАвтопроверки Цикл
			ДопПараметрыАвтопроверки.Вставить(КлючЗначение.Ключ, ЭтотОбъект["Автопроверка" + КлючЗначение.Ключ]);
		КонецЦикла;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ДопПараметрыАвтопроверки", ДопПараметрыАвтопроверки);
	КонецЕсли;
	
	ТаблицаДополнительныхПараметровПроверки = ТекущийОбъект.ОписаниеДополнительныхПараметров.Получить();
	Для Каждого ЭлементСписка Из ДопПараметрыПроверки Цикл
		НайденнаяСтрока = ТаблицаДополнительныхПараметровПроверки.Найти(ЭлементСписка.Значение,"ИмяПараметра");
		Если НайденнаяСтрока <> Неопределено Тогда
			НайденнаяСтрока.ЗначениеПоУмолчанию = ЭтотОбъект[ЭлементСписка.Значение];
		КонецЕсли;
	КонецЦикла;
	ТекущийОбъект.ОписаниеДополнительныхПараметров =  Новый ХранилищеЗначения(ТаблицаДополнительныхПараметровПроверки);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РегламентноеЗаданиеПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если РасписаниеРегламентногоЗадания = Неопределено Тогда
		РасписаниеРегламентногоЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеРегламентногоЗадания);
	Оповещение = Новый ОписаниеОповещения("РегламентноеЗаданиеПредставлениеНажатиеЗавершение", ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПриИзменении(Элемент)
	
	УстановитьДоступностьНастройкиРасписания(ЭтотОбъект, Объект.Используется);
	
	ОбновитьПредставлениеРасписания(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоОбщемуРасписаниюПриИзменении(Элемент)
	
	Объект.ПоОтдельномуРасписанию = ПоОбщемуРасписанию = 1;
	УстановитьВидимостьРасписания();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Объект.Ссылка);
	
	ЗначенияДопПараметров = Новый Структура;
	Для Каждого ЭлементСписка Из ДопПараметрыПроверки Цикл
		ЗначенияДопПараметров.Вставить(ЭлементСписка.Значение, ЭтотОбъект[ЭлементСписка.Значение]);
	КонецЦикла;
	
	Результат = РезультатПроверкиВДлительнойОперации(МассивЭлементов, ЗначенияДопПараметров);
	
	АудитСостоянияСистемыКлиент.ПодключитьДлительнуюОперацию(ЭтаФорма, Результат, ПараметрыОбработчикаОжидания, ФормаДлительнойОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ОбновитьФорму(ЭтотОбъект, Объект.Используется, Объект.ПоОтдельномуРасписанию, Объект.РегламентноеЗаданиеGUID);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФорму(Форма, Используется, ПоОтдельномуРасписанию, УникальныйИдентификаторЗадания)
	
	УстановитьДоступностьНастройкиРасписания(Форма, Используется);
	
	УстановитьВидимостьРасписания();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеРасписания(Форма)
	
	Если НЕ Форма.Объект.Используется Тогда
		ПредставлениеРасписания = НСтр("ru = ''");
	ИначеЕсли НЕ Форма.Объект.ПоОтдельномуРасписанию Тогда
		ПредставлениеРасписания = НСтр("ru = 'Выполняется по общему расписанию'");
	ИначеЕсли Форма.РасписаниеРегламентногоЗадания = Неопределено 
		Или Строка(Форма.РасписаниеРегламентногоЗадания) = Строка(Новый РасписаниеРегламентногоЗадания) Тогда
		ПредставлениеРасписания = НСтр("ru = 'Расписание не задано'");
	Иначе
		ПредставлениеРасписания = Строка(Форма.РасписаниеРегламентногоЗадания);
	КонецЕсли;
	
	Форма.Объект.РегламентноеЗаданиеПредставление = ПредставлениеРасписания;
	
КонецПроцедуры

&НаКлиенте
Процедура РегламентноеЗаданиеПредставлениеНажатиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт 
	
	Если Расписание = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	РасписаниеРегламентногоЗадания = Расписание;
	
	ОбновитьПредставлениеРасписания(ЭтаФорма);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Функция РезультатПроверкиВДлительнойОперации(Знач МассивПроверок, Знач ЗначенияДопПараметров)
	
	Возврат АудитСостоянияСистемы.РезультатПроверкиВДлительнойОперации(ЭтаФорма, МассивПроверок, ЗначенияДопПараметров);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания) Экспорт
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	АудитСостоянияСистемыКлиент.ПроверитьВыполнениеЗадания(ЭтаФорма, ПараметрыОбработчикаОжидания, ФормаДлительнойОперации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьНастройкиРасписания(Форма, Используется)
	
	//Форма.Элементы.ПоОбщемуРасписанию.Доступность = Используется;
	Форма.Элементы.ГруппаПараметрыАвтоматическойПроверки.Доступность = Используется;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРасписания()
	
	Элементы.Расписание.Видимость		= Объект.ПоОтдельномуРасписанию;
	Элементы.РасписаниеОбщее.Видимость	= НЕ Объект.ПоОтдельномуРасписанию;
	
	ОбновитьПредставлениеРасписания(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
