#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий";
	КомандаПечати.Идентификатор = "АктОПриемеПередачеОбъектовНФАЭлектронный";
	КомандаПечати.Представление = НСтр("ru = 'Акт о приеме-передаче объектов НФА (ф.0510448)'");
	КомандаПечати.Порядок		= 1;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"АктОПриемеПередачеОбъектовНФАЭлектронный") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"АктОПриемеПередачеОбъектовНФАЭлектронный",
			"Акт о приеме-передаче объектов НФА (ф.0510448)",
			ПечатьЭлектронногоАкта0510448(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

Функция ПечатьЭлектронногоАкта0510448(МассивОбъектов, ОбъектыПечати) Экспорт

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПарметрыПечатиАкта0510448";
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_Акт0510448");

	ОбластьРуководитель	= Макет.ПолучитьОбласть("Руководитель");
	ОбластьШапка1		= Макет.ПолучитьОбласть("Шапка1");
	ОбластьОтправитель	= Макет.ПолучитьОбласть("Отправитель");
	ОбластьПолучатель	= Макет.ПолучитьОбласть("Получатель");
	ОбластьШапка2		= Макет.ПолучитьОбласть("Шапка2");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьР1Подвал		= Макет.ПолучитьОбласть("Раздел1_Подвал");
	ОбластьР2Шапка		= Макет.ПолучитьОбласть("Раздел2_Шапка");
	ОбластьР2Строка		= Макет.ПолучитьОбласть("Раздел2_Строка");
	ОбластьР3Шапка		= Макет.ПолучитьОбласть("Раздел3_Шапка");
	ОбластьР3Строка		= Макет.ПолучитьОбласть("Раздел3_Строка");
	ОбластьР4Шапка		= Макет.ПолучитьОбласть("Раздел4_Шапка");
	ОбластьР4Строка		= Макет.ПолучитьОбласть("Раздел4_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьЦМО			= Макет.ПолучитьОбласть("ЦМО");
	ОбластьКомиссияП	= Макет.ПолучитьОбласть("Комиссия_Председатель");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель1	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьИсполнитель2	= Макет.ПолучитьОбласть("Исполнитель");
	
	ПервыйДокумент = Истина;
	Для Каждого ТекДок Из МассивОбъектов Цикл
		Если ТекДок.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаОтветногоПринимающейСтороны() Тогда
			ОтправленныйАкт = ТекДок.ВходящийАктОПриемеПередачеОбъектовНФА;
			ОтветныйАкт = ТекДок.Ссылка;
		Иначе
			ОтправленныйАкт = ТекДок.Ссылка;
			ОтветныйАкт = ЭлектронныеДокументыБГУ.ОтветныйАктПоИсходящемуАкту(ТекДок.Ссылка);
		КонецЕсли;
		
		ДанныеЭДОтправленногоАкта = ЭлектронныеДокументыБГУ.СведенияЭДАктаПередачиНФАПоДокументу(ОтправленныйАкт);
		ДанныеЭДОтветногоАкта = ЭлектронныеДокументыБГУ.СведенияЭДАктаПередачиНФАПоДокументу(ОтветныйАкт);
		
		Если ДанныеЭДОтправленногоАкта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеЭДОтветногоАкта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипАкта = ДанныеЭДОтправленногоАкта.ОбщиеРеквизитыДокумента.ТипАкта;
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		//Руководители
		ФИООтправителя = ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ДанныеЭДОтправленногоАкта.РуководительОтправителя);
		ФИОПолучателя = ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ДанныеЭДОтветногоАкта.РуководительПолучателя);
		
		ДанныеРуководителей = Новый Структура;
		ДанныеРуководителей.Вставить("ФИООтправителя", ФИООтправителя);
		ДанныеРуководителей.Вставить("ФИОПолучателя", ФИОПолучателя);
		
		ОбластьРуководитель.Параметры.Заполнить(ДанныеРуководителей);
		ТабличныйДокумент.Вывести(ОбластьРуководитель);
		
		//Шапка
		ДатаАкта = ДанныеЭДОтправленногоАкта.ОбщиеРеквизитыДокумента.Дата;
		НомерАкта = ДанныеЭДОтветногоАкта.ОбщиеРеквизитыДокумента.Номер;
		
		ДанныеШапки = Новый Структура;
		ДанныеШапки.Вставить("ДатаАкта", ДатаАкта);
		ДанныеШапки.Вставить("НомерАкта", НомерАкта);
		
		ОбластьШапка1.Параметры.Заполнить(ДанныеШапки);
		ТабличныйДокумент.Вывести(ОбластьШапка1);
		
		//Отправитель
		НаименованиеКонтрагента = ДанныеЭДОтправленногоАкта.ДанныеОтправителя.Наим;
		НаименованиеОбособленногоПодразделения = ДанныеЭДОтправленногоАкта.ОбособленноеПодразделениеОтправителя.Наим;
		НаименованиеСтруктурногоПодразделения = ДанныеЭДОтправленногоАкта.СтруктурноеПодразделениеОтправителя.Наим;
		Учредитель = ДанныеЭДОтправленногоАкта.УчредительОтправителя.Наим;
		БюджетНаименование = ДанныеЭДОтправленногоАкта.БюджетОтправителя.Наим;
		КодРПБС = ДанныеЭДОтправленногоАкта.ДанныеОтправителя.ЮЛ.КодПоРПБС;
		КодРПБСПодр = ДанныеЭДОтправленногоАкта.ОбособленноеПодразделениеОтправителя.КодПоРПБС;
		ГлаваБК = ДанныеЭДОтправленногоАкта.УчредительОтправителя.КодГлаваПоБК;
		ОКТМО = ДанныеЭДОтправленногоАкта.БюджетОтправителя.КодОКТМО;
		
		ДанныеОтправителя = Новый Структура;
		ДанныеОтправителя.Вставить("НаименованиеКонтрагента", НаименованиеКонтрагента);
		ДанныеОтправителя.Вставить("НаименованиеОбособленногоПодразделения", НаименованиеОбособленногоПодразделения);
		ДанныеОтправителя.Вставить("НаименованиеСтруктурногоПодразделения", НаименованиеСтруктурногоПодразделения);
		ДанныеОтправителя.Вставить("Учредитель", Учредитель);
		ДанныеОтправителя.Вставить("БюджетНаименование", БюджетНаименование);
		ДанныеОтправителя.Вставить("КодРПБС", КодРПБС);
		ДанныеОтправителя.Вставить("КодРПБСПодр", КодРПБСПодр);
		ДанныеОтправителя.Вставить("ГлаваБК", ГлаваБК);
		ДанныеОтправителя.Вставить("ОКТМО", ОКТМО);
		
		ОбластьОтправитель.Параметры.Заполнить(ДанныеОтправителя);
		ТабличныйДокумент.Вывести(ОбластьОтправитель);
		
		//Получатель

		НаименованиеКонтрагента = ДанныеЭДОтветногоАкта.ДанныеПолучателя.Наим;
		НаименованиеОбособленногоПодразделения = ДанныеЭДОтветногоАкта.ОбособленноеПодразделениеПолучателя.Наим;
		НаименованиеСтруктурногоПодразделения = ДанныеЭДОтветногоАкта.СтруктурноеПодразделениеПолучателя.Наим;
		Учредитель = ДанныеЭДОтветногоАкта.УчредительПолучателя.Наим;
		БюджетНаименование = ДанныеЭДОтветногоАкта.БюджетПолучателя.Наим;
		КодРПБС = ДанныеЭДОтветногоАкта.ДанныеПолучателя.ЮЛ.КодПоРПБС;
		КодРПБСПодр = ДанныеЭДОтветногоАкта.ОбособленноеПодразделениеПолучателя.КодПоРПБС;
		ГлаваБК = ДанныеЭДОтветногоАкта.УчредительПолучателя.КодГлаваПоБК;
		ОКТМО = ДанныеЭДОтветногоАкта.БюджетПолучателя.КодОКТМО;
		
		ДанныеПолучателя = Новый Структура;
		ДанныеПолучателя.Вставить("НаименованиеКонтрагента", НаименованиеКонтрагента);
		ДанныеПолучателя.Вставить("НаименованиеОбособленногоПодразделения", НаименованиеОбособленногоПодразделения);
		ДанныеПолучателя.Вставить("НаименованиеСтруктурногоПодразделения", НаименованиеСтруктурногоПодразделения);
		ДанныеПолучателя.Вставить("Учредитель", Учредитель);
		ДанныеПолучателя.Вставить("БюджетНаименование", БюджетНаименование);
		ДанныеПолучателя.Вставить("КодРПБС", КодРПБС);
		ДанныеПолучателя.Вставить("КодРПБСПодр", КодРПБСПодр);
		ДанныеПолучателя.Вставить("ГлаваБК", ГлаваБК);
		ДанныеПолучателя.Вставить("ОКТМО", ОКТМО);
		
		ОбластьПолучатель.Параметры.Заполнить(ДанныеПолучателя);
		ТабличныйДокумент.Вывести(ОбластьПолучатель);
		
		//Шапка2
		ВидИмущества = ДанныеЭДОтправленногоАкта.ОбщиеРеквизитыДокумента.ВидИмущества;
		АналитическаяГруппа = ДанныеЭДОтправленногоАкта.ОбщиеРеквизитыДокумента.АналитическаяГруппа;

		НаименованиеОснования = ДанныеЭДОтправленногоАкта.ДокументОснование.Наим;
		НомерОснования = ДанныеЭДОтправленногоАкта.ДокументОснование.Номер;
		ДатаОснования = ДанныеЭДОтправленногоАкта.ДокументОснование.Дата;
		
		НаименованиеПриказа = ДанныеЭДОтветногоАкта.ДокументОснованиеОСозданииКомиссии.Наим;
		НомерПриказа = ДанныеЭДОтветногоАкта.ДокументОснованиеОСозданииКомиссии.Номер;
		ДатаПриказа = ДанныеЭДОтветногоАкта.ДокументОснованиеОСозданииКомиссии.Дата;
		
		ДанныеШапки2 = Новый Структура;
		ДанныеШапки2.Вставить("ВидИмущества", ВидИмущества);
		ДанныеШапки2.Вставить("АналитическаяГруппа", АналитическаяГруппа);

		ДанныеШапки2.Вставить("НаименованиеОснования", НаименованиеОснования);
		ДанныеШапки2.Вставить("НомерОснования", НомерОснования);
		ДанныеШапки2.Вставить("ДатаОснования", ДатаОснования);

		ДанныеШапки2.Вставить("НаименованиеПриказа", НаименованиеПриказа);
		ДанныеШапки2.Вставить("НомерПриказа", НомерПриказа);
		ДанныеШапки2.Вставить("ДатаПриказа", ДатаПриказа);

		ОбластьШапка2.Параметры.Заполнить(ДанныеШапки2);
		ТабличныйДокумент.Вывести(ОбластьШапка2);
		
		//Раздел1_Шапка
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент.Вывести(ОбластьР1Шапка);

		Количество			= 0;
		Сумма				= 0;
		СуммаВложений		= 0;
		СуммаАмортизации	= 0;
		СуммаОбесценения	= 0;
		
		МетодыНачисления = УправлениеОсновнымиСредствамиПовтИсп.СпособыНачисленияАмортизации_Соответствие();
		
		Для Каждого ТекСтрока Из ДанныеЭДОтправленногоАкта.СведенияОПередаваемыхОбъектахНФА Цикл
			ОбластьР1Строка.Параметры.Заполнить(ТекСтрока);
			
			ДанныеСтрокиРаздела1 = Новый Структура;
			ДанныеСтрокиРаздела1.Вставить("НомерСтроки", ТекСтрока.КодСтроки);
			ДанныеСтрокиРаздела1.Вставить("КодОбъекта", ТекСтрока.ИдентификационныйНомерОбъекта);
			ДанныеСтрокиРаздела1.Вставить("КодГруппы", ТекСтрока.ИдентификационныйНомерГруппы);
			ДанныеСтрокиРаздела1.Вставить("НаименованиеНФА", ТекСтрока.ПолноеНаимНоменклатуры);
			ДанныеСтрокиРаздела1.Вставить("СуммаВложений", ТекСтрока.СуммаФактКапВложений);
			ДанныеСтрокиРаздела1.Вставить("Цена", ТекСтрока.ЦенаЗаЕдиницу);
			ДанныеСтрокиРаздела1.Вставить("Сумма", ТекСтрока.БалансоваяСтоимость);
			ДанныеСтрокиРаздела1.Вставить("СрокЭксплуатации", ТекСтрока.ФактическийСрокЭксплуатации);
			ДанныеСтрокиРаздела1.Вставить("АмортизационнаяГруппа", ТекСтрока.КодАмортизационнойГруппы);
			
			МетодАмортизации = "";
			Если ЗначениеЗаполнено(ТекСтрока.МетодНачисленияАмортизации) Тогда
				МетодАмортизации = МетодыНачисления[ТекСтрока.МетодНачисленияАмортизации];
			КонецЕсли;
			
			ДанныеСтрокиРаздела1.Вставить("МетодАмортизации", МетодАмортизации);
			ДанныеСтрокиРаздела1.Вставить("ДатаОкончанияАмортизации", ТекСтрока.ДатаОкончанияНачисленияАмортизации);
			ДанныеСтрокиРаздела1.Вставить("СуммаАмортизации", ТекСтрока.СуммаНачисленнойАмортизации);
			ДанныеСтрокиРаздела1.Вставить("СуммаОбесценения", ТекСтрока.СуммаНачисленногоОбесценения);

			ОбластьР1Строка.Параметры.Заполнить(ДанныеСтрокиРаздела1);
			
			ТабличныйДокумент.Вывести(ОбластьР1Строка);
			
			Количество			= Количество		+ ТекСтрока.Количество;
			Сумма				= Сумма				+ ТекСтрока.БалансоваяСтоимость;
			СуммаВложений		= СуммаВложений		+ ТекСтрока.СуммаФактКапВложений;
			СуммаАмортизации	= СуммаАмортизации	+ ТекСтрока.СуммаНачисленнойАмортизации;
			СуммаОбесценения	= СуммаОбесценения	+ ТекСтрока.СуммаНачисленногоОбесценения;
		КонецЦикла;
		
		ОбластьР1Подвал.Параметры.Заполнить(Новый Структура("Количество,Сумма,СуммаВложений,СуммаАмортизации,СуммаОбесценения",
			Количество, Сумма, СуммаВложений, СуммаАмортизации, СуммаОбесценения));
		ТабличныйДокумент.Вывести(ОбластьР1Подвал);
		
		//Раздел2_Шапка
		ТабличныйДокумент.Вывести(ОбластьР2Шапка);
		
 		Для Каждого ТекСтрока Из ДанныеЭДОтправленногоАкта.ИндивидуальныеХарактеристикиОбъектовНФА Цикл
			ДанныеСтрокиРаздела2 = Новый Структура;
			ДанныеСтрокиРаздела2.Вставить("НомерСтроки", ТекСтрока.КодСтроки);
			ДанныеСтрокиРаздела2.Вставить("НаименованиеНФА", ТекСтрока.ПолноеНаимНоменклатуры);
			ДанныеСтрокиРаздела2.Вставить("Адрес", ТекСтрока.АдресМестоположениеОбъекта);
			ДанныеСтрокиРаздела2.Вставить("Назначение", ТекСтрока.НазначениеОбъекта);
			ДанныеСтрокиРаздела2.Вставить("Характеристика", ТекСтрока.ПризнакХарактеристикаНаименование);
			ДанныеСтрокиРаздела2.Вставить("ЗначениеХарактеристики", ТекСтрока.ПризнакХарактеристикаЗначение);
			ДанныеСтрокиРаздела2.Вставить("Деталь", ТекСтрока.Деталь);
			ДанныеСтрокиРаздела2.Вставить("Драгметалл", ТекСтрока.ДрагоценныйМатериал);
			ДанныеСтрокиРаздела2.Вставить("НаименованиеЕИ", ТекСтрока.ЕдИзмНаим);
			ДанныеСтрокиРаздела2.Вставить("КодЕИ", ТекСтрока.ЕдИзмКод);
			ДанныеСтрокиРаздела2.Вставить("Количество", ТекСтрока.Количество);
			
			Если НЕ ЗначениеЗаполнено(ДанныеСтрокиРаздела2.НаименованиеНФА) Тогда
				ДанныеСтрокиРаздела2.НомерСтроки = "";
			КонецЕсли;	

			ОбластьР2Строка.Параметры.Заполнить(ДанныеСтрокиРаздела2);
			
			ТабличныйДокумент.Вывести(ОбластьР2Строка);
			
		КонецЦикла;

		//Раздел3_Шапка
		ТабличныйДокумент.Вывести(ОбластьР3Шапка);
		
		СвязанныеКонтрагенты = ДанныеЭДОтправленногоАкта.СвязанныеКонтрагенты;
		
		Для Каждого ТекСтрока Из ДанныеЭДОтправленногоАкта.СведенияОбОграниченияхОбременениях Цикл
			ДанныеСтрокиРаздела3 = Новый Структура;
			ДанныеСтрокиРаздела3.Вставить("НомерСтроки", ТекСтрока.КодСтроки);
			ДанныеСтрокиРаздела3.Вставить("НаименованиеНФА", ТекСтрока.ПолноеНаимНоменклатуры);
			ДанныеСтрокиРаздела3.Вставить("ЕдИзмОграничения", ТекСтрока.ЕдИзмОграничения);
			ДанныеСтрокиРаздела3.Вставить("ЗначениеОграничения", ТекСтрока.ЗначениеОграничения);
			ДанныеСтрокиРаздела3.Вставить("РегистрацияНомер", ТекСтрока.НомерДокументаОснованияРегистрации);
			ДанныеСтрокиРаздела3.Вставить("РегистрацияДата", ТекСтрока.ДатаДокументаОснованияРегистрации);
			ДанныеСтрокиРаздела3.Вставить("ВидОграничения", ТекСтрока.ВидОграничения);
			ДанныеСтрокиРаздела3.Вставить("НачалоОграничения", ТекСтрока.ДатаНачалаОграничения);
			ДанныеСтрокиРаздела3.Вставить("ОкончаниеОграничения", ТекСтрока.ДатаОкончанияОграничения);
			ДанныеСтрокиРаздела3.Вставить("СрокОграничения", ТекСтрока.СрокОграничения);
			ДанныеСтрокиРаздела3.Вставить("ПлатаЗаЕдОграничения", ТекСтрока.ЦенаПлатыЗаЕдиницу);
			ДанныеСтрокиРаздела3.Вставить("СуммаПлатыЗаОграничение", ТекСтрока.СуммаПлатыЗаВесьСрок);
			ДанныеСтрокиРаздела3.Вставить("СуммаПлатыЗаОграничениеЗаМесяц", ТекСтрока.СуммаПлатыЗаМесяц);
			ДанныеСтрокиРаздела3.Вставить("ВидДокументаОграничения", ТекСтрока.ВидДокументаОснования);
			ДанныеСтрокиРаздела3.Вставить("НомерДокументаОграничения", ТекСтрока.НомерДокументаОснования);
			ДанныеСтрокиРаздела3.Вставить("ДатаДокументаОграничения", ТекСтрока.ДатаДокументаОснования);
			
			GUIDКонтрагента = ТекСтрока.GUIDКонтрагента;
			
			СведенияСвязанногоКонтрагента = СведенияСвязанногоКонтрагентаОтправленногоАктаПередачиНФА(СвязанныеКонтрагенты, GUIDКонтрагента);
			ДанныеСтрокиРаздела3.Вставить("НаименованиеКонтрагентаОграничения", СведенияСвязанногоКонтрагента.НаименованиеКонтрагента);
			Если ЗначениеЗаполнено(СведенияСвязанногоКонтрагента.ОГРН) Тогда
				ДанныеСтрокиРаздела3.Вставить("ОГРНКонтрагентаОграничения", СведенияСвязанногоКонтрагента.ОГРН);
			Иначе
				ДанныеСтрокиРаздела3.Вставить("ОГРНКонтрагентаОграничения", СведенияСвязанногоКонтрагента.ОГРНИП);
			КонецЕсли;
			ДанныеСтрокиРаздела3.Вставить("ИННКонтрагентаОграничения", СведенияСвязанногоКонтрагента.ИНН);
			ДанныеСтрокиРаздела3.Вставить("КППКонтрагентаОграничения", СведенияСвязанногоКонтрагента.КПП);
			ДанныеСтрокиРаздела3.Вставить("ОКОПФКонтрагентаОграничения", СведенияСвязанногоКонтрагента.КодПоОКОПФ);
			ДанныеСтрокиРаздела3.Вставить("КИСЭКонтрагентаОграничения", СведенияСвязанногоКонтрагента.КодПоКИСЭ);
			
			ДанныеСтрокиРаздела3.Вставить("НомерКартыОграничения", ТекСтрока.НомерКарты);
			
			ОбластьР3Строка.Параметры.Заполнить(ДанныеСтрокиРаздела3);
			
			ТабличныйДокумент.Вывести(ОбластьР3Строка);
		КонецЦикла;
		
		//СведенияИсполнителя
		СведенияИсполнителя = Новый Структура;
		СведенияИсполнителя.Вставить("ДолжностьНаименование", ДанныеЭДОтправленногоАкта.ИсполнительОтправителя.Должность);
		СведенияИсполнителя.Вставить("ФИО", ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ДанныеЭДОтправленногоАкта.ИсполнительОтправителя));
		СведенияИсполнителя.Вставить("НомерТелефона", ДанныеЭДОтправленногоАкта.ИсполнительОтправителя.Телефон);
		СведенияИсполнителя.Вставить("ЭлектроннаяПочта", ДанныеЭДОтправленногоАкта.ИсполнительОтправителя.ЭлектронныйАдрес);
		ОбластьИсполнитель1.Параметры.Заполнить(СведенияИсполнителя);
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель1);
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		
		//Раздел4_Шапка
		ТабличныйДокумент.Вывести(ОбластьР4Шапка);
		
		//ОбластьР4Строка
		Для Каждого ТекСтрока Из ДанныеЭДОтветногоАкта.СведенияОПринятыхОбъектахНФА Цикл
			ДанныеСтрокиРаздела4 = Новый Структура;
			ДанныеСтрокиРаздела4.Вставить("НомерСтроки", ТекСтрока.КодСтроки);
			ДанныеСтрокиРаздела4.Вставить("НаименованиеНФА", ТекСтрока.ПолноеНаимНоменклатуры);
			ДанныеСтрокиРаздела4.Вставить("ВидИмущества", ТекСтрока.ВидИмущества);
			ДанныеСтрокиРаздела4.Вставить("СуммаВложений", ТекСтрока.СуммаФактКапВложений);
			ДанныеСтрокиРаздела4.Вставить("Сумма", ТекСтрока.БалансоваяСтоимость);
			Если Нрег(СокрЛП(ТекСтрока.ВидИмущества)) = Нрег("вложения в нефинансовые активы") Тогда
				Если (ТекСтрока.СуммаФактКапВложений = 0) И (ТекСтрока.БалансоваяСтоимость > 0) Тогда
					ДанныеСтрокиРаздела4.СуммаВложений = ТекСтрока.БалансоваяСтоимость;
					ДанныеСтрокиРаздела4.Сумма = ТекСтрока.СуммаФактКапВложений;
				КонецЕсли;	
			КонецЕсли;	
			ДанныеСтрокиРаздела4.Вставить("АмортизационнаяГруппа", ТекСтрока.АмортизационнаяГруппа);
			
			МетодАмортизации = "";
			Если ЗначениеЗаполнено(ТекСтрока.МетодНачисленияАмортизации) Тогда
				МетодАмортизации = МетодыНачисления[ТекСтрока.МетодНачисленияАмортизации];
			КонецЕсли;
			
			ДанныеСтрокиРаздела4.Вставить("МетодАмортизации", МетодАмортизации);
			ДанныеСтрокиРаздела4.Вставить("ДатаОкончанияАмортизации", ТекСтрока.ДатаОкончанияНачисленияАмортизации);
			ДанныеСтрокиРаздела4.Вставить("СрокПолезногоИспользования", ТекСтрока.СрокПолезногоИспользования);
			ДанныеСтрокиРаздела4.Вставить("Количество", ТекСтрока.Количество);
			ДанныеСтрокиРаздела4.Вставить("АналитическаяГруппа", ТекСтрока.АналитическаяГруппа);
			ДанныеСтрокиРаздела4.Вставить("НормаАмортизации", ТекСтрока.СуммаНормыАмортизации);
			
			ОбластьР4Строка.Параметры.Заполнить(ДанныеСтрокиРаздела4);
			
			ТабличныйДокумент.Вывести(ОбластьР4Строка);
		КонецЦикла;
		
		// Приложения
		Сч = 0;
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		Если ДанныеЭДОтправленногоАкта.ФайлыПриложений.Количество() > 0 Тогда
			Для Каждого ТекФайл Из ДанныеЭДОтправленногоАкта.ФайлыПриложений Цикл
				Если Сч = 0 Тогда
					ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
				КонецЕсли;
				Сч = Сч + 1;
				
				ДанныеОПриложенномФайле = Новый Структура;
				ДанныеОПриложенномФайле.Вставить("Номер", Сч);
				ДанныеОПриложенномФайле.Вставить("Описание", ?(ЗначениеЗаполнено(ТекФайл.НаименованиеДокументаФайла),
					ТекФайл.НаименованиеДокументаФайла, СокрЛП(ТекФайл.ВидСведений)));
				ДанныеОПриложенномФайле.Вставить("ИмяФайла", ТекФайл.ИмяФайла);
				
				ОбластьПриложение.Параметры.Заполнить(ДанныеОПриложенномФайле);
				ТабличныйДокумент.Вывести(ОбластьПриложение);
			КонецЦикла;
		КонецЕсли;
		
		// Приложения Отправителя
		Если ДанныеЭДОтветногоАкта.ФайлыПриложений.Количество() > 0 Тогда
			Для Каждого ТекФайл Из ДанныеЭДОтветногоАкта.ФайлыПриложений Цикл
				Если Сч = 0 Тогда
					ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекФайл.ИмяФайла) Тогда
					Сч = Сч + 1;
					
					ДанныеОПриложенномФайле = Новый Структура;
					ДанныеОПриложенномФайле.Вставить("Номер", Сч);
					ДанныеОПриложенномФайле.Вставить("Описание", ?(ЗначениеЗаполнено(ТекФайл.НаименованиеДокументаФайла),
						ТекФайл.НаименованиеДокументаФайла, СокрЛП(ТекФайл.ВидСведений)));
					ДанныеОПриложенномФайле.Вставить("ИмяФайла", ТекФайл.ИмяФайла);
					
					ОбластьПриложение.Параметры.Заполнить(ДанныеОПриложенномФайле);
					ТабличныйДокумент.Вывести(ОбластьПриложение);
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
		
		// ЦМО
		ПараметрыЦМО			= Новый Структура;
		
		ПараметрыЦМО.Вставить("НаименованиеДолжностиСдал"	, ДанныеЭДОтправленногоАкта.СдалОбъектыСоСтороныОтправителя.Должность);
		ПараметрыЦМО.Вставить("ДолжностьСдал"				, "");
		ПараметрыЦМО.Вставить("ФИОСдал"						, ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ДанныеЭДОтправленногоАкта.СдалОбъектыСоСтороныОтправителя));
		ПараметрыЦМО.Вставить("Сдал"						, "");
		ПараметрыЦМО.Вставить("НаименованиеДолжностиПринял"	, ДанныеЭДОтветногоАкта.ПринялСоСтороныПолучателя.Должность);
		ПараметрыЦМО.Вставить("ДолжностьПринял"				, "");
		ПараметрыЦМО.Вставить("ФИОПринял"					, ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ДанныеЭДОтветногоАкта.ПринялСоСтороныПолучателя));
		ПараметрыЦМО.Вставить("Принял"						, "");
		
		ОбластьЦМО.Параметры.Заполнить(ПараметрыЦМО);
		ТабличныйДокумент.Вывести(ОбластьЦМО);
		
		// Комиссия
		
		// Председатель
		ДанныеПредседателя = Новый Структура("НаименованиеДолжности, ФИО");
		ДанныеПредседателя.НаименованиеДолжности = ДанныеЭДОтветногоАкта.ПредседательКомиссииПолучателя.Должность;
		ДанныеПредседателя.ФИО = ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ДанныеЭДОтветногоАкта.ПредседательКомиссииПолучателя);
		
		ОбластьКомиссияП.Параметры.Заполнить(ДанныеПредседателя);
		ТабличныйДокумент.Вывести(ОбластьКомиссияП);
		
		// Члены комиссии
		ПерваяСтрока = Истина;
		Для Каждого ЧленКомиссии Из ДанныеЭДОтветногоАкта.ЧленыКомиссииПолучателя Цикл
			ДанныеЧК = Новый Структура("НаименованиеДолжности, ФИО, Заголовок");
			ДанныеЧК.НаименованиеДолжности = ЧленКомиссии.Должность;
			ДанныеЧК.ФИО = ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ЧленКомиссии);;
			ДанныеЧК.Заголовок = ?(ПерваяСтрока, НСтр("ru = 'Члены комиссии:'"), "");
			ОбластьКомиссияС.Параметры.Заполнить(ДанныеЧК);
			ТабличныйДокумент.Вывести(ОбластьКомиссияС);
			ПерваяСтрока = Ложь;
		КонецЦикла;
		
		// Исполнитель получателя
		СведенияИсполнителяПолучателя = Новый Структура;
		СведенияИсполнителяПолучателя.Вставить("ДолжностьНаименование", ДанныеЭДОтветногоАкта.ИсполнительПолучателя.Должность);
		СведенияИсполнителяПолучателя.Вставить("ФИО", ЭлектронныеДокументыБГУ.ИнициалыФамилияПоСтруктуреФИО(ДанныеЭДОтветногоАкта.ИсполнительПолучателя));
		СведенияИсполнителяПолучателя.Вставить("НомерТелефона", ДанныеЭДОтветногоАкта.ИсполнительПолучателя.Телефон);
		СведенияИсполнителяПолучателя.Вставить("ЭлектроннаяПочта", ДанныеЭДОтветногоАкта.ИсполнительПолучателя.ЭлектронныйАдрес);
		
		ОбластьИсполнитель2.Параметры.Заполнить(СведенияИсполнителяПолучателя);
		ТабличныйДокумент.Вывести(ОбластьИсполнитель2);
		
		//Штампы ЭП
		ПараметрыПечатиЭД = Новый Структура;
		ПараметрыПечатиЭД.Вставить("Организация", ТекДок.Организация);
		
		Если ДанныеЭДОтправленногоАкта.СведенияОПодписантах.Количество() = 0 Тогда
			Если ОтправленныйАкт = ТекДок.Ссылка Тогда
				ДокУчета = ОтправленныйАкт.ДокументОснование;
				ИдентификаторПечати = "АктПриемаПередачи0510448";
				Если ТипЗнч(ДокУчета) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")
					ИЛИ ТипЗнч(ДокУчета) = Тип("ДокументСсылка.НакладнаяНаОтпускИК") Тогда
					ИдентификаторПечати = "АктПриемаПередачи0510448ПоСебестоимости";
				КонецЕсли;	
				
				СведенияОбЭлектронныхПодписях = ЭлектронныеДокументыБГУ.СведенияОбЭлектронныхПодписях(ДокУчета, ИдентификаторПечати);
				Для Каждого ТекСтрокаЭП Из СведенияОбЭлектронныхПодписях Цикл
					НовыеДанныеЭП = ДанныеЭДОтправленногоАкта.СведенияОПодписантах.Добавить();
					ЗаполнитьЗначенияСвойств(НовыеДанныеЭП, ТекСтрокаЭП);
					НовыеДанныеЭП.НаименованиеПользователяПодписанта = ТекСтрокаЭП.Пользователь;
				КонецЦикла;
			КонецЕсли;	
		КонецЕсли;	
		
		ДобавитьШтампыЭлектронныхПодписейДляПредставленияАктаПриемаПередачиНФА(ТабличныйДокумент,
			ДанныеЭДОтправленногоАкта.СведенияОПодписантах,
			ДанныеЭДОтветногоАкта.СведенияОПодписантах,
			ПараметрыПечатиЭД);

		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ТекДок.Ссылка);
	КонецЦикла;
		
	Возврат ТабличныйДокумент;

КонецФункции

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область ПодготовкаДанныхЭДО

Функция ПодготовитьДанныеДляЭД(ДокументСсылка) Экспорт
	Результат = Новый Структура;
	ЕдиницаИзмеренияШт = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(796);
	Реквизиты = "ТипЭлектронногоАкта, Организация, Контрагент, Договор, Номер, Дата, ДокументОснование, ВходящийАктОПриемеПередачеОбъектовНФА, СуммаДокумента, Пояснение";
	ЗначенияРеквизитовДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, Реквизиты);
	
	Если ЗначенияРеквизитовДокумента.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаПередающейСтороны() Тогда

		ДокументОснование = ЗначенияРеквизитовДокумента.ДокументОснование;
		ИнвентарныеНомера = Новый Массив;
		ОбъектыНФА = Новый Массив;
		ОбъектыМЦ = Новый Массив;

		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПередачаОбъектовОС") 
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПередачаОбъектовИК") Тогда
			ИнвентарныеНомера = ДокументОснование.ОсновныеСредства.Выгрузить(, "ИнвентарныйНомер");
			ОбъектыНФА = ДокументОснование.ОсновныеСредства.Выгрузить(, "ОсновноеСредство");
			ОбъектыНФА.Свернуть("ОсновноеСредство");
			ОбъектыМЦ = ДокументОснование.ДрагоценныеМатериалы.Выгрузить(, "ОбъектМЦ");
			ОбъектыМЦ.Свернуть("ОбъектМЦ"); 
		КонецЕсли;
		
		ДатаСведений = ЗначенияРеквизитовДокумента.Дата;
		ПередаватьДополнительныеРеквизитыОбъектовНФА = ЭлектронныеДокументыБГУ.ПередаватьДополнительныеРеквизитыОбъектовНФА(ЗначенияРеквизитовДокумента.Организация); 
		ПередаватьДополнительныеСведенияОбъектовНФА  = ЭлектронныеДокументыБГУ.ПередаватьДополнительныеСведенияОбъектовНФА(ЗначенияРеквизитовДокумента.Организация);
		ПередаватьДополнительныеСведенияИРеквизитыНФА = ПередаватьДополнительныеРеквизитыОбъектовНФА ИЛИ ПередаватьДополнительныеСведенияОбъектовНФА;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = ЗапросДанныхДляЭД(); 
		Запрос.УстановитьПараметр("Организация", ЗначенияРеквизитовДокумента.Организация);
		Запрос.УстановитьПараметр("ДокументЭД", ДокументСсылка);
		Запрос.УстановитьПараметр("ДокументОснованиеЭД", ДокументОснование);
		Запрос.УстановитьПараметр("ИнвентарныеНомера", ИнвентарныеНомера);
		Запрос.УстановитьПараметр("ОбъектыНФА", ОбъектыНФА); 
		Запрос.УстановитьПараметр("ОбъектыМЦ", ОбъектыМЦ);
		Запрос.УстановитьПараметр("Штуки", ЕдиницаИзмеренияШт);
		Запрос.УстановитьПараметр("ВалютаДокумента", Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("ДатаСведений", ДатаСведений);
		Запрос.УстановитьПараметр("ТипАдрес", Перечисления.ТипыКонтактнойИнформации.Адрес);
		Запрос.УстановитьПараметр("ВидАдрес", Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Адрес",,Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("Контактная информация справочника ""Основные средства""")));
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ТаблицаШапкаАкта = РезультатЗапроса[0].Выгрузить();
		ТаблицаНФА = РезультатЗапроса[2].Выгрузить();
		ТаблицаПаспортныеДанные = РезультатЗапроса[3].Выгрузить();
		ТаблицаПаспортныеДанныеДрагМатериалы = РезультатЗапроса[4].Выгрузить();
		АдресаОбъектовНФА = РезультатЗапроса[5].Выгрузить();
		ТаблицаДанныеДрагМатериалы = РезультатЗапроса[6].Выгрузить();
		СведенияОПрослеживаемости = РезультатЗапроса[7].Выгрузить();
		СведенияКадастровогоУчета = РезультатЗапроса[8].Выгрузить();
		ОграниченияПоИнвентарнымОбъектам = РезультатЗапроса[9].Выгрузить();
        МЦОбъектовНФАСДрагМатериалами = РезультатЗапроса[10].Выгрузить();
		
		Если ПередаватьДополнительныеСведенияИРеквизитыНФА Тогда 
			
			Если ОбъектыНФА.Количество() = 0  
									И ТаблицаНФА.Количество() > 0 Тогда
				ОбъектыНФА = ТаблицаНФА.Скопировать(,"Номенклатура");
				ОбъектыНФА.Свернуть("Номенклатура");
			КонецЕсли;

			Запрос = Новый Запрос;
			Запрос.Текст = ЗапросДопСведенийНФАДляЭД();
			Запрос.УстановитьПараметр("ОбъектыНФА", ОбъектыНФА);
			ДополнительныеСведенияИРеквизитыОбъектовНФА = Запрос.Выполнить().Выгрузить();
		КонецЕсли;
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаОтпускИК") Тогда
			ИдентификаторКомандыПечати = "АктПриемаПередачи0510448ПоСебестоимости";
		Иначе	
			ИдентификаторКомандыПечати = "АктПриемаПередачи0510448";
		КонецЕсли;	
		ВнутрениийЭД = ВнутреннийЭДО.АктуальныйЭлектронныйДокумент(ДокументОснование, ИдентификаторКомандыПечати);
		
		СведенияВнутреннегоЭДО = ВнутрениийЭД;
		
		Если ТаблицаШапкаАкта.Количество() > 0 Тогда
			ШапкаАкта = ТаблицаШапкаАкта[0];
		КонецЕсли;	
		ФайлыАкта = РезультатЗапроса[1].Выгрузить();
	
		//Первоначальный акт
		Реквизиты = "Организация, Дата, Подразделение, ОтветственныйИсполнитель";
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШапкаАкта.ДокументОснование, Реквизиты);
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ШапкаАкта.ДокументОснование);
		
		Если ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")
			ИЛИ ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаОтпускИК") Тогда
			ТаблицаДанныеАкта = УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
			МЗПоСебестоимости = Истина;
			Для Каждого Документ Из ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов) Цикл
				МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ.Значение[0]);
				МенеджерДокумента.ДобавитьДанныеДляПечати0510448(ТаблицаДанныеАкта, Документ.Значение, МЗПоСебестоимости);
			КонецЦикла;
		ИначеЕсли ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.ПередачаОбъектовОС") 
			ИЛИ ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.ПередачаОбъектовИК") Тогда 
			ТаблицаДанныеАкта = Документы.ПринятиеКУчетуОбъектовОС.ДанныеДляПечати0510448(МассивОбъектов);
		КонецЕсли;
		Если ТаблицаДанныеАкта.Количество() > 0 Тогда
			ДанныеАкта = ТаблицаДанныеАкта[0];
		КонецЕсли;	

		Руководитель = ДанныеАкта.Руководитель;
		ОтветственныйИсполнитель = ЗначенияРеквизитов.ОтветственныйИсполнитель;
		СдалОбъектыСоСтороныОтправителя = Справочники.Сотрудники.ПустаяСсылка();
		
		//Должностные лица
		Если ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15") Тогда
			Реквизиты = "Организация, Дата, Подразделение, Руководитель, ОтветственныйПередалТРУ, ЦМО";
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШапкаАкта.ДокументОснование, Реквизиты);
			
			Руководитель = ЗначенияРеквизитов.Руководитель;
			Если ЗначениеЗаполнено(ЗначенияРеквизитов.ЦМО) Тогда
				Реквизиты = "Сотрудник";
				ЗначенияРеквизитовЦМО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.ЦМО, Реквизиты);
				СдалОбъектыСоСтороныОтправителя = ЗначенияРеквизитовЦМО.Сотрудник;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаОтпускИК") Тогда
			Реквизиты = "Организация, Дата, Подразделение, Руководитель, ЦМО";
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШапкаАкта.ДокументОснование, Реквизиты);
			Руководитель = ЗначенияРеквизитов.Руководитель;
			Если ЗначениеЗаполнено(ЗначенияРеквизитов.ЦМО) Тогда
				Реквизиты = "Сотрудник";
				ЗначенияРеквизитовЦМО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.ЦМО, Реквизиты);
				СдалОбъектыСоСтороныОтправителя = ЗначенияРеквизитовЦМО.Сотрудник;
			КонецЕсли;	
		ИначеЕсли ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.ПередачаОбъектовОС") Тогда
			Реквизиты = "ОтветственныйПередалТРУ, ЦМО";
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШапкаАкта.ДокументОснование, Реквизиты);
			Если ЗначениеЗаполнено(ЗначенияРеквизитов.ЦМО) Тогда
				Реквизиты = "Сотрудник";
				ЗначенияРеквизитовЦМО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.ЦМО, Реквизиты);
				СдалОбъектыСоСтороныОтправителя = ЗначенияРеквизитовЦМО.Сотрудник;
			КонецЕсли;	
		ИначеЕсли ТипЗнч(ШапкаАкта.ДокументОснование) = Тип("ДокументСсылка.ПередачаОбъектовИК") Тогда
			Реквизиты = "ОтветственныйПередалТРУ, ЦМО";
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ШапкаАкта.ДокументОснование, Реквизиты);
			Если ЗначениеЗаполнено(ЗначенияРеквизитов.ЦМО) Тогда
				Реквизиты = "Сотрудник";
				ЗначенияРеквизитовЦМО = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитов.ЦМО, Реквизиты);
				СдалОбъектыСоСтороныОтправителя = ЗначенияРеквизитовЦМО.Сотрудник;
			КонецЕсли;	
		КонецЕсли;
		
		ДолжностныеЛица = Новый Структура;
		ДолжностныеЛица.Вставить("Руководитель", Руководитель);
		ДолжностныеЛица.Вставить("ОтветственныйИсполнитель", ОтветственныйИсполнитель);
		ДолжностныеЛица.Вставить("СдалОбъектыСоСтороныОтправителя", СдалОбъектыСоСтороныОтправителя);
		
		ДвиженияДокументовМЗ = УправлениеМатериальнымиЗапасами.ДвиженияДокументов(МассивОбъектов);
		
		Для Каждого ТекСтрока Из ТаблицаНФА Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				ОтборСтрокиДокумента = Новый Структура("Номенклатура, СчетКт, КПСКт, Количество",
					ТекСтрока.Номенклатура, ТекСтрока.СчетУчета, ТекСтрока.КПС, ТекСтрока.Количество);
				СтрокиДвижений = ДвиженияДокументовМЗ.НайтиСтроки(ОтборСтрокиДокумента);
				Если СтрокиДвижений.Количество() > 0 Тогда
					СтрокаСебестоимости = СтрокиДвижений[0];
					ТекСтрока.СтоимостьЕдиницы = Окр(СтрокаСебестоимости.Цена, 2);
					ТекСтрока.Сумма = СтрокаСебестоимости.Сумма;
					ТекСтрока.Всего = СтрокаСебестоимости.Сумма;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
		
		Результат.Вставить("ТипАкта", ЗначенияРеквизитовДокумента.ТипЭлектронногоАкта);
		Результат.Вставить("ДанныеАкта", ДанныеАкта);
		Результат.Вставить("ШапкаАкта", ШапкаАкта);
		Результат.Вставить("ТаблицаНФА", ТаблицаНФА);
		Результат.Вставить("ТаблицаПаспортныеДанные", ТаблицаПаспортныеДанные);
		Результат.Вставить("ТаблицаПаспортныеДанныеДрагМатериалы", ТаблицаПаспортныеДанныеДрагМатериалы);
		Результат.Вставить("АдресаОбъектовНФА", АдресаОбъектовНФА);
		Результат.Вставить("ТаблицаДанныеДрагМатериалы", ТаблицаДанныеДрагМатериалы);
		Результат.Вставить("СведенияОПрослеживаемости", СведенияОПрослеживаемости);
		Результат.Вставить("СведенияКадастровогоУчета", СведенияКадастровогоУчета);
		Результат.Вставить("ОграниченияПоИнвентарнымОбъектам", ОграниченияПоИнвентарнымОбъектам);
		Результат.Вставить("МЦОбъектовНФАСДрагМатериалами", МЦОбъектовНФАСДрагМатериалами);
		
		Если ПередаватьДополнительныеСведенияИРеквизитыНФА Тогда
			Результат.Вставить("ДополнительныеСведенияИРеквизитыОбъектовНФА", ДополнительныеСведенияИРеквизитыОбъектовНФА);
		КонецЕсли;

		Результат.Вставить("ДолжностныеЛица", ДолжностныеЛица);
		Результат.Вставить("ФайлыАкта", ФайлыАкта);
		
		Результат.Вставить("СведенияВнутреннегоЭДО", СведенияВнутреннегоЭДО);
	Иначе
		//Ответный акт
		ДокументПринятияКУчету = ЗначенияРеквизитовДокумента.ДокументОснование;
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(ДокументПринятияКУчету);
		
		ДанныеДляПечати = ДанныеДляПечати0510448(ДокументПринятияКУчету);
		
		Если НЕ ЗначениеЗаполнено(ДанныеДляПечати) Тогда
			Возврат Результат;
		КонецЕсли;	
		
		ДанныеПечатиОбщие = УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов);
		
		СведенияАктаПередачиНФА = Неопределено;
		
		ДанныеПечатиОбщиеДокумента = ДанныеПечатиОбщие.Получить(ДокументПринятияКУчету);
			
		Для Каждого ВыборкаДокументов Из ДанныеДляПечати Цикл
			СведенияАктаПередачиНФА = ЭлектронныеДокументыБГУ.СведенияЭДАктаПередачиНФАПоДокументу(ЗначенияРеквизитовДокумента.ВходящийАктОПриемеПередачеОбъектовНФА);
			ЭлектронныеДокументыБГУ.ДополнитьСведенияАктаПередачиНФАСведенияПолучателя(СведенияАктаПередачиНФА, ДанныеПечатиОбщиеДокумента, ДокументПринятияКУчету, ВыборкаДокументов);
		КонецЦикла;
		
		ФайлыАкта = ЭлектронныеДокументыБГУ.ДанныеФайловПрисоединенныхКДокументуАктаПередачиНФА(ДокументПринятияКУчету);
		
		ИдентификаторКомандыПечати = "ОтветныйАктПриемаПередачи0510448";
		ВнутрениийЭД = ВнутреннийЭДО.АктуальныйЭлектронныйДокумент(ДокументПринятияКУчету, ИдентификаторКомандыПечати);
		
		СведенияВнутреннегоЭДО = ВнутрениийЭД;
		
		Результат.Вставить("ТипАкта", ЗначенияРеквизитовДокумента.ТипЭлектронногоАкта);
		Результат.Вставить("Номер", ЗначенияРеквизитовДокумента.Номер);
		Результат.Вставить("Дата", ЗначенияРеквизитовДокумента.Дата);
		Результат.Вставить("Пояснение", ЗначенияРеквизитовДокумента.Пояснение);
		Результат.Вставить("Организация", ЗначенияРеквизитовДокумента.Организация);
		Результат.Вставить("Контрагент", ЗначенияРеквизитовДокумента.Контрагент);
		Результат.Вставить("Договор", ЗначенияРеквизитовДокумента.Договор);
		Результат.Вставить("СуммаДокумента", ЗначенияРеквизитовДокумента.СуммаДокумента);
		Результат.Вставить("СведенияАктаПередачиНФА", СведенияАктаПередачиНФА);
		Результат.Вставить("ДокументПринятияКУчету", ДокументПринятияКУчету);
		Результат.Вставить("ВходящийАкт", ЗначенияРеквизитовДокумента.ВходящийАктОПриемеПередачеОбъектовНФА);
		Результат.Вставить("СведенияВнутреннегоЭДО", СведенияВнутреннегоЭДО);
		Результат.Вставить("ФайлыАкта", ФайлыАкта);
		
		Если НЕ ЗначениеЗаполнено(СведенияАктаПередачиНФА) Тогда
			Результат.ТипАкта = 0;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеДляПечати0510448(ДокументПринятияКУчету)
	Результат = Неопределено;

	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(ДокументПринятияКУчету);
	Если ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовОС") Тогда
		Результат = Документы.ПринятиеКУчетуОбъектовОС.ДанныеДляПечати0510448(МассивДокументов);
	ИначеЕсли ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовИК") Тогда
		Результат = Документы.ПринятиеКУчетуОбъектовОС.ДанныеДляПечати0510448(МассивДокументов);
	ИначеЕсли ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПоступлениеОС") 
		ИЛИ ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПоступлениеОСИК") Тогда
		Результат = Документы.ПоступлениеОС.ДанныеДляПечатиОтветного0510448(МассивДокументов);
	ИначеЕсли ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПрочееОтражениеЭлектронногоДокументаВУчете") Тогда
		ДанныеДляПечати = УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		МЗПоСебестоимости = Ложь;                                         	
		Документы.ПрочееОтражениеЭлектронногоДокументаВУчете.ДобавитьДанныеДляПечати0510448(ДанныеДляПечати, МассивДокументов, МЗПоСебестоимости);
		
		Результат = ДанныеДляПечати;
	ИначеЕсли ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПоступлениеМЗ") 
		ИЛИ ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПоступлениеИК") Тогда
		ДанныеДляПечати = УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448();
		ДокументЗначение = Новый Массив;
		ДокументЗначение.Добавить(ДокументПринятияКУчету);
		МЗПоСебестоимости = Ложь;                                         	
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументПринятияКУчету);
		МенеджерДокумента.ДобавитьДанныеДляПечати0510448(ДанныеДляПечати, ДокументЗначение, МЗПоСебестоимости);
		
		Для Каждого СведенияАктаПередачиНФА Из ДанныеДляПечати Цикл
			ЭтоУчетМЗКазны = Ложь;
			ВидИмуществаИК = НСтр("ru = 'казна'");
			ВидИмуществаДляВложений = "";
			
			Если ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПоступлениеИК") Тогда
				Реквизиты = "СчетУчета";
				ЗначенияРеквизитовУчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПринятияКУчету, Реквизиты);
				Если ЗначениеЗаполнено(ЗначенияРеквизитовУчета.СчетУчета) Тогда
					РеквизитыКода = "Код";
					ЗначенияРеквизитовСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитовУчета.СчетУчета, РеквизитыКода);
					Если ЗначенияРеквизитовСчета.Код = "106.50" Тогда
						ВидИмуществаИК = НСтр("ru = 'вложения в нефинансовые активы казны'");;
					КонецЕсли;	
				КонецЕсли;
				СведенияАктаПередачиНФА.ВидИмущества = ВидИмуществаИК;
				ЭтоУчетМЗКазны = Истина;
			ИначеЕсли ТипЗнч(ДокументПринятияКУчету) = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
				Реквизиты = "СчетУчета";
				ЗначенияРеквизитовУчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПринятияКУчету, Реквизиты);
				Если ЗначениеЗаполнено(ЗначенияРеквизитовУчета.СчетУчета) Тогда
					РеквизитыКода = "Код";
					ЗначенияРеквизитовСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитовУчета.СчетУчета, РеквизитыКода);
					Если ЗначенияРеквизитовСчета.Код = "106.00" Тогда
						ВидИмуществаДляВложений = НСтр("ru = 'вложения в нефинансовые активы'");
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого СтрокаПринимаемыйОбъект Из СведенияАктаПередачиНФА.ПринятыеОбъектыНФА Цикл
				Если ЭтоУчетМЗКазны Тогда
					СтрокаПринимаемыйОбъект.АналитическаяГруппа = "50";
					СтрокаПринимаемыйОбъект.ВидИмущества = ВидИмуществаИК;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВидИмуществаДляВложений) Тогда
					СтрокаПринимаемыйОбъект.ВидИмущества = ВидИмуществаДляВложений;
					Если (СтрокаПринимаемыйОбъект.СуммаВложений = 0) И (СтрокаПринимаемыйОбъект.Сумма > 0) Тогда
						СтрокаПринимаемыйОбъект.СуммаВложений = СтрокаПринимаемыйОбъект.Сумма;
						СтрокаПринимаемыйОбъект.Сумма = 0;
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЦикла;	
		КонецЦикла;	
		
		Результат = ДанныеДляПечати;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

Функция ПредварительныйКонтрольДанныхДляЭД(ДокументСсылка) Экспорт
	
	Результат = Истина;

	Если НЕ ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен реквизит ""Документ-основание"".'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		
		Результат = Ложь;
	КонецЕсли;	

	ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;
	АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ДокументСсылка.Организация, ВидКИАдрес);
		
	Если НЕ ЗначениеЗаполнено(АдресОрганизации) Тогда
		ОписаниеОшибки = НСтр("ru='Не заполнен юридический адрес организации.'");
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка.Контрагент) Тогда
		Если ДокументСсылка.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаПередающейСтороны() Тогда
			ОписаниеОшибки = НСтр("ru='Не заполнен получатель.'"); 
		Иначе
			ОписаниеОшибки = НСтр("ru='Не заполнен отправитель.'"); 
		КонецЕсли;	
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
		Результат = Ложь;
	Иначе
		Контрагент = ДокументСсылка.Контрагент;
		
		Если ЗначениеЗаполнено(Контрагент.ЮридическоеФизическоеЛицо) Тогда
			Если ТипЗнч(Контрагент.ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
				ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты;
			Иначе
				ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
			КонецЕсли;
			АдресКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				Контрагент.ЮридическоеФизическоеЛицо, ВидКИАдрес);
			
			Если НЕ ЗначениеЗаполнено(АдресКонтрагента) Тогда
				ОписаниеОшибки = НСтр("ru='Не заполнен юридический адрес получателя.'");
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
				Результат = Ложь;
			КонецЕсли;	
		Иначе
			ОписаниеОшибки = НСтр("ru='Не заполнено юридическое/физическое лицо получателя.'");
			ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			Результат = Ложь;
		КонецЕсли;
		
		Участник = Контрагент;
		СведенияОбУчастнике = Неопределено; 
		ЭлектронныеДокументыБГУ.ПолучитьДанныеЮрФизЛица(Участник, СведенияОбУчастнике);
		
		Если Участник.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			КодОКПО = СведенияОбУчастнике.КодОКПО;
			Если ЗначениеЗаполнено(КодОКПО) Тогда
				Если СтрДлина(КодОКПО)<>8 Тогда
					ОписаниеОшибки = НСтр("ru='Код ОКПО для контрагента-получателя должен иметь длину 8 знаков.'");
					ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
					Результат = Ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросДанныхДляЭД()
	
	Результат = "ВЫБРАТЬ
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Организация КАК Организация,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Контрагент КАК Контрагент,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Договор КАК Договор,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ЭтоВозвратНФА КАК ЭтоВозвратНФА,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ПередачаСведенийОбАдресахНФА КАК ПередачаСведенийОбАдресахНФА,
	            |	ПРЕДСТАВЛЕНИЕ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Договор) КАК ДоговорНаименование,
	            |	ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Договор КАК Справочник.Договоры).НомерДоговора КАК ДоговорНомер,
	            |	ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Договор КАК Справочник.Договоры).ДатаДоговора КАК ДоговорДата,
	            |	ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Договор КАК Справочник.Договоры).ВидОбязательства КАК ВидДоговораНаименование,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).ВидИмущества
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).ВидИмущества
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыИмущества.ПустаяСсылка)
	            |	КОНЕЦ КАК ВидИмущества,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА """"
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА """"
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ПРЕДСТАВЛЕНИЕ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование.СчетУчета)
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА """"
	            |	КОНЕЦ КАК КодСчетаУчета,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).ВалютаДокумента
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).ВалютаДокумента
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).ВалютаДокумента
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА &ВалютаДокумента
	            |	КОНЕЦ КАК ВалютаДокумента,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).Перевозчик
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).Перевозчик
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).Перевозчик
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).Перевозчик
	            |	КОНЕЦ КАК Перевозчик,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).ОтветственныйИсполнитель
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).ОтветственныйИсполнитель
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).ОтветственныйИсполнитель
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).ОтветственныйИсполнитель
	            |	КОНЕЦ КАК ОтветственныйИсполнитель,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).ОснованиеДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).ОснованиеДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).ОснованиеДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).ОснованиеДляАкта
	            |	КОНЕЦ КАК НаименованиеОснования,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).НомерОснованияДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).НомерОснованияДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).НомерОснованияДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).НомерОснованияДляАкта
	            |	КОНЕЦ КАК НомерОснования,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).ДатаОснованияДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).ДатаОснованияДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).ДатаОснованияДляАкта
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).ДатаОснованияДляАкта
	            |	КОНЕЦ КАК ДатаОснования,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).КФО
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).КФО
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).КФО
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).КФО
	            |	КОНЕЦ КАК КФО,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).Номер
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).Номер
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).Номер
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).Номер
	            |	КОНЕЦ КАК НомерАкта,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).Дата
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).Дата
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).Дата
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).Дата
	            |	КОНЕЦ КАК ДатаАкта,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовОС)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовОС).ВидОперации
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.ПередачаОбъектовИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.ПередачаОбъектовИК).ВидОперации
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускМ15)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).ВидПередачиМЗ
	            |		КОГДА ТИПЗНАЧЕНИЯ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование) = ТИП(Документ.НакладнаяНаОтпускИК)
	            |			ТОГДА ВЫРАЗИТЬ(ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК Документ.НакладнаяНаОтпускИК).ВидПередачи
	            |	КОНЕЦ КАК ВидПередачи,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.СуммаДокумента КАК СуммаДокумента,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ДокументОснование КАК ДокументОснование,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ТипЭлектронногоАкта КАК ТипЭлектронногоАкта,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.ВходящийАктОПриемеПередачеОбъектовНФА КАК ВходящийАктОПриемеПередачеОбъектовНФА,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Номер КАК Номер,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Дата КАК Дата,
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Пояснение КАК Пояснение
	            |ИЗ
	            |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий
	            |ГДЕ
	            |	ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Ссылка = &ДокументЭД
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ПриложенныеФайлыДляЭДОБГУ.Организация КАК Организация,
	            |	ПриложенныеФайлыДляЭДОБГУ.ПрисоединенныйФайл КАК ПрисоединенныйФайл,
	            |	ПриложенныеФайлыДляЭДОБГУ.ДокументЭД КАК ДокументЭД,
	            |	ПриложенныеФайлыДляЭДОБГУ.НаименованиеДокументаФайла КАК НаименованиеДокументаФайла,
	            |	ПриложенныеФайлыДляЭДОБГУ.ВидСведений КАК ВидСведений
	            |ИЗ
	            |	РегистрСведений.ПриложенныеФайлыДляЭДОБГУ КАК ПриложенныеФайлыДляЭДОБГУ
	            |ГДЕ
	            |	ПриложенныеФайлыДляЭДОБГУ.ДокументЭД = &ДокументОснованиеЭД
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	            |	ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	            |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное КАК НаименованиеНФА,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Наименование КАК Наименование,
	            |	ПередачаОбъектовОСОсновныеСредства.КПС КАК КПС,
	            |	ПередачаОбъектовОСОсновныеСредства.Количество КАК Количество,
	            |	ПередачаОбъектовОСОсновныеСредства.СтоимостьЕдиницы КАК СтоимостьЕдиницы,
	            |	ПередачаОбъектовОСОсновныеСредства.Сумма КАК Сумма,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	            |	ПередачаОбъектовОСОсновныеСредства.ЦенаПродажи КАК ЦенаПродажи,
	            |	ПередачаОбъектовОСОсновныеСредства.СтавкаНДС КАК СтавкаНДС,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаНДС КАК СуммаНДС,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаПродажи КАК СуммаПродажи,
	            |	ПередачаОбъектовОСОсновныеСредства.Всего КАК Всего,
	            |	ПередачаОбъектовОСОсновныеСредства.СчетУчета КАК СчетУчета,
	            |	ПередачаОбъектовОСОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	            |	ПередачаОбъектовОСОсновныеСредства.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	            |	ПередачаОбъектовОСОсновныеСредства.СтранаПроисхождения КАК СтранаПроисхождения,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.СтранаПроисхождения КАК Справочник.СтраныМира).Код КАК КодСтраныПроисхождения,
	            |	&Штуки КАК ЕдиницаИзмерения,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НоменклатурныйНомер КАК НоменклатурныйНомер,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодФАИП КАК КодФАИП,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Сведения КАК Сведения,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодТНВЭД КАК КодТНВЭД,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ОКП КАК КодОКПД,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодЕКПС КАК КодЕКПС,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).МожетСодержатьДрагМатериалы КАК МожетСодержатьДрагМатериалы,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Местонахождение КАК Местонахождение,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодОКОФ КАК КодОКОФ,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ТипНФА КАК ТипНФА,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ВидНФА КАК ВидНФА,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).АмортизационнаяГруппа КАК АмортизационнаяГруппа,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ИмуществоКазны КАК ИмуществоКазны,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ГрупповойУчет КАК ГрупповойУчет,
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка) КАК ТипНоменклатуры,
	            |	ПередачаОбъектовОСОсновныеСредства.КарточкаКапвложений КАК КарточкаКапвложений,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодКонтураИдентификацииСведенийОбОбъекте КАК КодКонтураИдентификацииСведенийОбОбъекте,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодКаталога КАК КодКаталога,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодПоКТРУ КАК КодПоКТРУ,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ДокументацияЛистов КАК ДокументацияЛистов,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ДокументацияЭкземпляров КАК ДокументацияЭкземпляров,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Назначение КАК Назначение,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ВидМаркируемойПродукции КАК ВидМаркируемойПродукции,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ИзготовительОС КАК Изготовитель
	            |ИЗ
	            |	Документ.ПередачаОбъектовОС.ОсновныеСредства КАК ПередачаОбъектовОСОсновныеСредства
	            |ГДЕ
	            |	ПередачаОбъектовОСОсновныеСредства.Ссылка = &ДокументОснованиеЭД
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство,
	            |	ПередачаОбъектовОСОсновныеСредства.ИнвентарныйНомер,
	            |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Наименование,
	            |	ПередачаОбъектовОСОсновныеСредства.КПС,
	            |	ПередачаОбъектовОСОсновныеСредства.Количество,
	            |	ПередачаОбъектовОСОсновныеСредства.СтоимостьЕдиницы,
	            |	ПередачаОбъектовОСОсновныеСредства.Сумма,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаАмортизации,
	            |	ПередачаОбъектовОСОсновныеСредства.ЦенаПродажи,
	            |	ПередачаОбъектовОСОсновныеСредства.СтавкаНДС,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаНДС,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаПродажи,
	            |	ПередачаОбъектовОСОсновныеСредства.Всего,
	            |	ПередачаОбъектовОСОсновныеСредства.СчетУчета,
	            |	ПередачаОбъектовОСОсновныеСредства.ИдентификаторСтроки,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаОбесценения,
	            |	ПередачаОбъектовОСОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц,
	            |	ЛОЖЬ,
	            |	ПередачаОбъектовОСОсновныеСредства.СтранаПроисхождения,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.СтранаПроисхождения КАК Справочник.СтраныМира).Код,
	            |	&Штуки,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НоменклатурныйНомер,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодФАИП,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Сведения,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодТНВЭД,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ОКП,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодЕКПС,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).МожетСодержатьДрагМатериалы,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Местонахождение,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодОКОФ,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ТипНФА,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ВидНФА,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).АмортизационнаяГруппа,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ИмуществоКазны,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ГрупповойУчет,
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка),
	            |	ПередачаОбъектовОСОсновныеСредства.КарточкаКапвложений,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодКонтураИдентификацииСведенийОбОбъекте,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодКаталога,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).КодПоКТРУ,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ДокументацияЛистов,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ДокументацияЭкземпляров,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).Назначение,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ВидМаркируемойПродукции,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).ИзготовительОС
	            |ИЗ
	            |	Документ.ПередачаОбъектовИК.ОсновныеСредства КАК ПередачаОбъектовОСОсновныеСредства
	            |ГДЕ
	            |	ПередачаОбъектовОСОсновныеСредства.Ссылка = &ДокументОснованиеЭД
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка),
	            |	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	            |	НакладнаяНаОтпускМ15Материалы.Номенклатура,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).НаименованиеПолное,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).Наименование,
	            |	НакладнаяНаОтпускМ15Материалы.КПС,
	            |	НакладнаяНаОтпускМ15Материалы.Количество,
	            |	НакладнаяНаОтпускМ15Материалы.Цена,
	            |	НакладнаяНаОтпускМ15Материалы.Сумма,
	            |	0,
	            |	НакладнаяНаОтпускМ15Материалы.Всего / НакладнаяНаОтпускМ15Материалы.Количество,
	            |	НакладнаяНаОтпускМ15Материалы.СтавкаНДС,
	            |	НакладнаяНаОтпускМ15Материалы.СуммаНДС,
	            |	НакладнаяНаОтпускМ15Материалы.Сумма,
	            |	НакладнаяНаОтпускМ15Материалы.Всего,
	            |	НакладнаяНаОтпускМ15Материалы.СчетУчета,
	            |	НакладнаяНаОтпускМ15Материалы.ИдентификаторСтроки,
	            |	0,
	            |	0,
	            |	НакладнаяНаОтпускМ15Материалы.ПрослеживаемыйТовар,
	            |	НакладнаяНаОтпускМ15Материалы.СтранаПроисхождения,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.СтранаПроисхождения КАК Справочник.СтраныМира).Код,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).НоменклатурныйНомер,
	            |	"""",
	            |	"""",
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).КодТНВЭД,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).ОКП,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).КодЕКПС,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).МожетСодержатьДрагМатериалы,
	            |	"""",
	            |	ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка),
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыНФА.ПустаяСсылка),
	            |	"""",
	            |	"""",
	            |	ЛОЖЬ,
	            |	ЛОЖЬ,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры,
	            |	"""",
	            |	0,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).КодКаталога,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).КодПоКТРУ,
	            |	0,
	            |	0,
	            |	"""",
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).ВидМаркируемойПродукции,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15Материалы.Номенклатура КАК Справочник.Номенклатура).ИзготовительОС
	            |ИЗ
	            |	Документ.НакладнаяНаОтпускМ15.Материалы КАК НакладнаяНаОтпускМ15Материалы
	            |ГДЕ
	            |	НакладнаяНаОтпускМ15Материалы.Ссылка = &ДокументОснованиеЭД
	            |	И НакладнаяНаОтпускМ15Материалы.Количество > 0
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка),
	            |	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка),
	            |	НакладнаяНаОтпускИКМатериалы.Номенклатура,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).НаименованиеПолное,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).Наименование,
	            |	НакладнаяНаОтпускИКМатериалы.КПС,
	            |	НакладнаяНаОтпускИКМатериалы.Количество,
	            |	НакладнаяНаОтпускИКМатериалы.Сумма / НакладнаяНаОтпускИКМатериалы.Количество,
	            |	НакладнаяНаОтпускИКМатериалы.Сумма,
	            |	0,
	            |	НакладнаяНаОтпускИКМатериалы.Сумма / НакладнаяНаОтпускИКМатериалы.Количество,
	            |	НакладнаяНаОтпускИКМатериалы.СтавкаНДС,
	            |	НакладнаяНаОтпускИКМатериалы.СуммаНДС,
	            |	НакладнаяНаОтпускИКМатериалы.Сумма,
	            |	НакладнаяНаОтпускИКМатериалы.Сумма,
	            |	НакладнаяНаОтпускИКМатериалы.СчетУчета,
	            |	НакладнаяНаОтпускИКМатериалы.ИдентификаторСтроки,
	            |	0,
	            |	0,
	            |	ЛОЖЬ,
	            |	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	            |	"""",
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).ЕдиницаИзмерения,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).НоменклатурныйНомер,
	            |	"""",
	            |	"""",
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).КодТНВЭД,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).ОКП,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).КодЕКПС,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).МожетСодержатьДрагМатериалы,
	            |	"""",
	            |	ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка),
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыНФА.ПустаяСсылка),
	            |	"""",
	            |	"""",
	            |	ЛОЖЬ,
	            |	ЛОЖЬ,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).ТипНоменклатуры,
	            |	"""",
	            |	0,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).КодКаталога,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).КодПоКТРУ,
	            |	0,
	            |	0,
	            |	"""",
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).ВидМаркируемойПродукции,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКМатериалы.Номенклатура КАК Справочник.Номенклатура).ИзготовительОС
	            |ИЗ
	            |	Документ.НакладнаяНаОтпускИК.Материалы КАК НакладнаяНаОтпускИКМатериалы
	            |ГДЕ
	            |	НакладнаяНаОтпускИКМатериалы.Ссылка = &ДокументОснованиеЭД
	            |	И НакладнаяНаОтпускИКМатериалы.Количество > 0
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ПаспортаТранспортныхСредствСрезПоследних.Организация КАК Организация,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	            |	ПаспортаТранспортныхСредствСрезПоследних.СерияНомер КАК СерияНомер,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ИдентификационныйНомер КАК ИдентификационныйНомер,
	            |	ПаспортаТранспортныхСредствСрезПоследних.Марка КАК Марка,
	            |	ПаспортаТранспортныхСредствСрезПоследних.Модель КАК Модель,
	            |	ПаспортаТранспортныхСредствСрезПоследних.Тип КАК Тип,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ДвигательМодель КАК ДвигательМодель,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ДвигательНомер КАК ДвигательНомер,
	            |	ПаспортаТранспортныхСредствСрезПоследних.НомерШасси КАК НомерШасси,
	            |	ПаспортаТранспортныхСредствСрезПоследних.НомерКузова КАК НомерКузова,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ЭкологическийКласс КАК ЭкологическийКласс,
	            |	ПаспортаТранспортныхСредствСрезПоследних.Масса КАК Масса,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер КАК ГаражныйНомер,
	            |	ПаспортаТранспортныхСредствСрезПоследних.Грузоподъемность КАК Грузоподъемность,
	            |	ПаспортаТранспортныхСредствСрезПоследних.Колонна КАК Колонна,
	            |	ПаспортаТранспортныхСредствСрезПоследних.РегистрационныйЗнак КАК РегистрационныйЗнак,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	            |	ПаспортаТранспортныхСредствСрезПоследних.ДатаСнятияСУчета КАК ДатаСнятияСУчета
	            |ИЗ
	            |	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(&ДатаСведений, ИнвентарныйНомер В (&ИнвентарныеНомера)) КАК ПаспортаТранспортныхСредствСрезПоследних
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ДрагМатериалыВОбъектахНФАПоТехДокументации.Ссылка КАК Ссылка,
	            |	ДрагМатериалыВОбъектахНФАПоТехДокументации.ОбъектНФА КАК ОбъектНФА,
	            |	ДрагМатериалыВОбъектахНФАПоТехДокументации.Основание КАК Основание,
	            |	ДрагМатериалыВОбъектахНФАПоТехДокументации.НомерОснования КАК НомерОснования,
	            |	ДрагМатериалыВОбъектахНФАПоТехДокументации.ДатаОснования КАК ДатаОснования,
	            |	ДрагМатериалыВОбъектахНФАПоТехДокументации.ПодетальнаяИнформация КАК ПодетальнаяИнформация,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ДрагМатериалыВОбъектахНФАПоТехДокументации.ОбъектНФА) = ТИП(Справочник.ОсновныеСредства)
	            |			ТОГДА ВЫРАЗИТЬ(ДрагМатериалыВОбъектахНФАПоТехДокументации.ОбъектНФА КАК Справочник.ОсновныеСредства).НаименованиеПолное
	            |		КОГДА ТИПЗНАЧЕНИЯ(ДрагМатериалыВОбъектахНФАПоТехДокументации.ОбъектНФА) = ТИП(Справочник.Номенклатура)
	            |			ТОГДА ВЫРАЗИТЬ(ДрагМатериалыВОбъектахНФАПоТехДокументации.ОбъектНФА КАК Справочник.Номенклатура).НаименованиеПолное
	            |	КОНЕЦ КАК ПолноеНаименованиеНФА
	            |ИЗ
	            |	Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации КАК ДрагМатериалыВОбъектахНФАПоТехДокументации
	            |ГДЕ
	            |	ДрагМатериалыВОбъектахНФАПоТехДокументации.ОбъектНФА В(&ОбъектыНФА)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ОсновныеСредстваКонтактнаяИнформация.Ссылка КАК ОбъектНФА,
	            |	ОсновныеСредстваКонтактнаяИнформация.Представление КАК Адрес,
	            |	ОсновныеСредстваКонтактнаяИнформация.НомерСтроки КАК НомерСтроки,
	            |	ОсновныеСредстваКонтактнаяИнформация.Тип КАК Тип,
	            |	ОсновныеСредстваКонтактнаяИнформация.Вид КАК Вид,
	            |	ОсновныеСредстваКонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей,
	            |	ОсновныеСредстваКонтактнаяИнформация.Страна КАК Страна,
	            |	ОсновныеСредстваКонтактнаяИнформация.Регион КАК Регион,
	            |	ОсновныеСредстваКонтактнаяИнформация.Город КАК Город,
	            |	ОсновныеСредстваКонтактнаяИнформация.АдресЭП КАК АдресЭП,
	            |	ОсновныеСредстваКонтактнаяИнформация.ДоменноеИмяСервера КАК ДоменноеИмяСервера,
	            |	ОсновныеСредстваКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	            |	ОсновныеСредстваКонтактнаяИнформация.НомерТелефонаБезКодов КАК НомерТелефонаБезКодов,
	            |	ОсновныеСредстваКонтактнаяИнформация.Значение КАК Значение
	            |ИЗ
	            |	Справочник.ОсновныеСредства.КонтактнаяИнформация КАК ОсновныеСредстваКонтактнаяИнформация
	            |ГДЕ
	            |	ОсновныеСредстваКонтактнаяИнформация.Тип = &ТипАдрес
	            |	И ОсновныеСредстваКонтактнаяИнформация.Вид = &ВидАдрес
	            |	И (ОсновныеСредстваКонтактнаяИнформация.Ссылка В(&ОбъектыНФА)
				|		ИЛИ ОсновныеСредстваКонтактнаяИнформация.Ссылка В (&ОбъектыМЦ))
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектНФА КАК ОбъектНФА,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектНФА КАК Справочник.ОсновныеСредства).НаименованиеПолное КАК ПолноеНаименованиеНФА,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ИнвНомер КАК ИнвНомер,
				|   ВЫБОР
				|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ЕСТЬ NULL
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				|		ИНАЧЕ ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ
				|	КОНЕЦ КАК ОбъектМЦ, 
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).НаименованиеПолное
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).НаименованиеПолное
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК ПолноеНаименованиеМЦ,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).НаименованиеПолное
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).НаименованиеПолное
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК НаименованиеМЦ,
				|	ВЫБОР
              	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ""Основное средство""
               	|		ИНАЧЕ ""Номенклатура""
               	|	КОНЕЦ КАК ТипСправочникаМЦКапВложения,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ЕдиницаИзмерения
				|		ИНАЧЕ NULL
				|	КОНЕЦ КАК ЕдИзмОбъектовМЦ,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала КАК ВидДрагМатериала,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код КАК ВидДрагМатериалаКод,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование КАК ВидДрагМатериалаНаименование,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.МассаДМ КАК МассаДМ,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ЕдИзм КАК ЕдИзм,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.КоличествоДМ КАК КоличествоДМ,
				|	ПередачаОбъектовОСДрагоценныеМатериалы.КоличествоМЦ КАК КоличествоМЦ
	            |ИЗ
	            |	Документ.ПередачаОбъектовОС.ДрагоценныеМатериалы КАК ПередачаОбъектовОСДрагоценныеМатериалы
	            |ГДЕ
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка = &ДокументОснованиеЭД
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектНФА,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектНФА КАК Справочник.ОсновныеСредства).НаименованиеПолное,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ИнвНомер,
				|   ВЫБОР
				|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ЕСТЬ NULL
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				|		ИНАЧЕ ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ
				|	КОНЕЦ, 
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).НаименованиеПолное
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).НаименованиеПолное
				|		ИНАЧЕ """"
				|	КОНЕЦ,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).Наименование
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Наименование
				|		ИНАЧЕ """"
				|	КОНЕЦ,
				|	ВЫБОР
              	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ""Основное средство""
               	|		ИНАЧЕ ""Номенклатура""
               	|	КОНЕЦ,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ЕдиницаИзмерения
				|		ИНАЧЕ NULL
				|	КОНЕЦ,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.МассаДМ,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.ЕдИзм,
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.КоличествоДМ,
				|	ПередачаОбъектовОСДрагоценныеМатериалы.КоличествоМЦ
	            |ИЗ
	            |	Документ.ПередачаОбъектовИК.ДрагоценныеМатериалы КАК ПередачаОбъектовОСДрагоценныеМатериалы
	            |ГДЕ
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка = &ДокументОснованиеЭД
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	НакладнаяНаОтпускМ15ДрагоценныеМатериалы.ОбъектНФА,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15ДрагоценныеМатериалы.ОбъектНФА КАК Справочник.Номенклатура).НаименованиеПолное,
	            |	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка), 
				|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
				|	"""",
				|	"""",
				|	"""",
				|	NULL,
	            |	НакладнаяНаОтпускМ15ДрагоценныеМатериалы.ВидДрагМатериала,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15ДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15ДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование,
	            |	НакладнаяНаОтпускМ15ДрагоценныеМатериалы.МассаДМ,
	            |	НакладнаяНаОтпускМ15ДрагоценныеМатериалы.ЕдИзм,
	            |	НакладнаяНаОтпускМ15ДрагоценныеМатериалы.КоличествоДМ,
				|	0
	            |ИЗ
	            |	Документ.НакладнаяНаОтпускМ15.ДрагоценныеМатериалы КАК НакладнаяНаОтпускМ15ДрагоценныеМатериалы
	            |ГДЕ
	            |	НакладнаяНаОтпускМ15ДрагоценныеМатериалы.Ссылка = &ДокументОснованиеЭД
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	НакладнаяНаОтпускИКДрагоценныеМатериалы.ОбъектНФА,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКДрагоценныеМатериалы.ОбъектНФА КАК Справочник.Номенклатура).НаименованиеПолное,
	            |	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка), 
				|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
				|	"""",
				|	"""", 
				|	"""",
				|	NULL,
	            |	НакладнаяНаОтпускИКДрагоценныеМатериалы.ВидДрагМатериала,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускИКДрагоценныеМатериалы.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование,
	            |	НакладнаяНаОтпускИКДрагоценныеМатериалы.МассаДМ,
	            |	НакладнаяНаОтпускИКДрагоценныеМатериалы.ЕдИзм,
	            |	НакладнаяНаОтпускИКДрагоценныеМатериалы.КоличествоДМ, 
				|	0
	            |ИЗ
	            |	Документ.НакладнаяНаОтпускИК.ДрагоценныеМатериалы КАК НакладнаяНаОтпускИКДрагоценныеМатериалы
	            |ГДЕ
	            |	НакладнаяНаОтпускИКДрагоценныеМатериалы.Ссылка = &ДокументОснованиеЭД
	            |;
	            | 
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Комплектующее,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.РНПТ КАК РНПТ,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.РНПТ КАК Справочник.НомераГТД).Код КАК РНПТКод,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.Количество КАК Количество,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.ОсновныеСредства)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.ОсновныеСредства).НаименованиеПолное
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.Номенклатура)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.Номенклатура).НаименованиеПолное
	            |	КОНЕЦ КАК ПолноеНаименованиеНФАКомплектующее,
				|	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.ОсновныеСредства)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.ОсновныеСредства).Наименование
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.Номенклатура)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.Номенклатура).Наименование
	            |	КОНЕЦ КАК НаименованиеНФАКомплектующее
				|ИЗ
	            |	Документ.ПередачаОбъектовОС.СведенияПрослеживаемости КАК ПередачаОбъектовОССведенияПрослеживаемости
	            |ГДЕ
	            |	ПередачаОбъектовОССведенияПрослеживаемости.Ссылка = &ДокументОснованиеЭД
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.РНПТ,
	            |	ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.РНПТ КАК Справочник.НомераГТД).Код,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.Количество,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.КоличествоПрослеживаемости,
	            |	ПередачаОбъектовОССведенияПрослеживаемости.ИдентификаторСтроки,
	            |	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.ОсновныеСредства)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.ОсновныеСредства).НаименованиеПолное
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.Номенклатура)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.Номенклатура).НаименованиеПолное
	            |	КОНЕЦ,
				|	ВЫБОР
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.ОсновныеСредства)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.ОсновныеСредства).Наименование
	            |		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее) = ТИП(Справочник.Номенклатура)
	            |			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОССведенияПрослеживаемости.Комплектующее КАК Справочник.Номенклатура).Наименование
	            |	КОНЕЦ 
	            |ИЗ
	            |	Документ.ПередачаОбъектовИК.СведенияПрослеживаемости КАК ПередачаОбъектовОССведенияПрослеживаемости
	            |ГДЕ
	            |	ПередачаОбъектовОССведенияПрослеживаемости.Ссылка = &ДокументОснованиеЭД
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	            |	НакладнаяНаОтпускМ15СведенияПрослеживаемости.РНПТ,
	            |	ВЫРАЗИТЬ(НакладнаяНаОтпускМ15СведенияПрослеживаемости.РНПТ КАК Справочник.НомераГТД).Код,
	            |	НакладнаяНаОтпускМ15СведенияПрослеживаемости.Количество,
	            |	НакладнаяНаОтпускМ15СведенияПрослеживаемости.КоличествоПрослеживаемости,
	            |	НакладнаяНаОтпускМ15СведенияПрослеживаемости.ИдентификаторСтроки,
	            |	"""",
				|	""""
	            |ИЗ
	            |	Документ.НакладнаяНаОтпускМ15.СведенияПрослеживаемости КАК НакладнаяНаОтпускМ15СведенияПрослеживаемости
	            |ГДЕ
	            |	НакладнаяНаОтпускМ15СведенияПрослеживаемости.Ссылка = &ДокументОснованиеЭД
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	            |	СведенияКадастровогоУчетаСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	            |	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость,
	            |	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	            |	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗемлиНедвижимости КАК КадастровыйНомерЗемлиНедвижимости,
	            |	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
	            |	СведенияКадастровогоУчетаСрезПоследних.УсловныйНомер КАК УсловныйНомер,
	            |	СведенияКадастровогоУчетаСрезПоследних.КоличествоЭтажей КАК КоличествоЭтажей,
	            |	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	            |	СведенияКадастровогоУчетаСрезПоследних.ОбщийОбъем КАК ОбщийОбъем,
	            |	СведенияКадастровогоУчетаСрезПоследних.ПодземныйОбъем КАК ПодземныйОбъем,
	            |	СведенияКадастровогоУчетаСрезПоследних.ЭтоПомещение КАК ЭтоПомещение,
	            |	СведенияКадастровогоУчетаСрезПоследних.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости
	            |ИЗ
	            |	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	            |			&ДатаСведений,
	            |			ОсновноеСредство В (&ОбъектыНФА)
	            |				И ИнвентарныйНомер В (&ИнвентарныеНомера)
	            |				И Организация = &Организация) КАК СведенияКадастровогоУчетаСрезПоследних
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ИнвентарныеНомераОСОбременения.Ссылка КАК ИнвентарныйНомер,
	            |	ИнвентарныеНомераОСОбременения.НомерСтроки КАК НомерСтроки,
	            |	ИнвентарныеНомераОСОбременения.НаименованиеЧасти КАК НаименованиеЧасти,
	            |	ИнвентарныеНомераОСОбременения.РазмерЧасти КАК РазмерЧасти,
	            |	ИнвентарныеНомераОСОбременения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	            |	ВЫРАЗИТЬ(ИнвентарныеНомераОСОбременения.ЕдиницаИзмерения КАК Справочник.КлассификаторЕдиницИзмерения).Код КАК ЕдИзмКод,
	            |	ВЫРАЗИТЬ(ИнвентарныеНомераОСОбременения.ЕдиницаИзмерения КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК ЕдИзмНаим,
	            |	ИнвентарныеНомераОСОбременения.ВидОбременения КАК ВидОбременения,
	            |	ИнвентарныеНомераОСОбременения.ДатаНачала КАК ДатаНачала,
	            |	ИнвентарныеНомераОСОбременения.ДатаОкончания КАК ДатаОкончания,
	            |	ИнвентарныеНомераОСОбременения.ДокументРегистрацииДата КАК ДокументРегистрацииДата,
	            |	ИнвентарныеНомераОСОбременения.ДокументРегистрацииНомер КАК ДокументРегистрацииНомер,
	            |	ИнвентарныеНомераОСОбременения.ДокументОбремененияВид КАК ДокументОбремененияВид,
	            |	ИнвентарныеНомераОСОбременения.ДокументОбремененияДата КАК ДокументОбремененияДата,
	            |	ИнвентарныеНомераОСОбременения.ДокументОбремененияНомер КАК ДокументОбремененияНомер,
	            |	ИнвентарныеНомераОСОбременения.Контрагент КАК Контрагент,
	            |	ИнвентарныеНомераОСОбременения.Примечание КАК Примечание,
	            |	ИнвентарныеНомераОСОбременения.Ссылка.Код КАК ИнвентарныйНомерКод
	            |ИЗ
	            |	Справочник.ИнвентарныеНомераОС.Обременения КАК ИнвентарныеНомераОСОбременения
	            |ГДЕ
	            |	ИнвентарныеНомераОСОбременения.Ссылка В(&ИнвентарныеНомера)
				|;
				|///////////////////////////////////////////////////////////////////////////////
				|
				|ВЫБРАТЬ
				|   ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК ОбъектМЦ, 
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).Наименование
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Наименование
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК Наименование,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).НаименованиеПолное
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).НаименованиеПолное
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК ПолноеНаименование,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).Сведения
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Сведения
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК Сведения,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ВидНФА
               	|		ИНАЧЕ NULL
               	|	КОНЕЦ КАК ВидНФА,
               	|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ТипНФА
               	|		ИНАЧЕ NULL
               	|	КОНЕЦ КАК ТипНФА,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ИмуществоКазны
               	|		ИНАЧЕ ЛОЖЬ
               	|	КОНЕЦ КАК ИмуществоКазны,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ВключитьВСоставВнеоборотныхАктивов
               	|		ИНАЧЕ ЛОЖЬ
               	|	КОНЕЦ КАК ВключитьВСоставВнеоборотныхАктивов,
               	|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Местонахождение
               	|		ИНАЧЕ """"
               	|	КОНЕЦ КАК Местонахождение,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ИзготовительОС
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ИзготовительОС
				|		ИНАЧЕ NULL
               	|	КОНЕЦ КАК Изготовитель, 
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).СтранаПроисхождения
				|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).СтранаПроисхождения
               	|		ИНАЧЕ """"
               	|	КОНЕЦ КАК СтранаПроисхождения,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Назначение
               	|		ИНАЧЕ """"
               	|	КОНЕЦ КАК Назначение, 
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ВидМаркируемойПродукции
               	|		ИНАЧЕ ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ВидМаркируемойПродукции
               	|	КОНЕЦ КАК ВидМаркируемойПродукции,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ПрослеживаемыйТовар
               	|		ИНАЧЕ ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ПрослеживаемыйТовар
               	|	КОНЕЦ КАК ПрослеживаемыйТовар,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).КодКонтураИдентификацииСведенийОбОбъекте
               	|		ИНАЧЕ 0
               	|	КОНЕЦ КАК КодКонтураИдентификации,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ТипНоменклатуры
               	|		ИНАЧЕ """"
               	|	КОНЕЦ КАК ТипНоменклатуры, 
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).НаименованиеДополнительное
               	|		ИНАЧЕ """"
               	|	КОНЕЦ КАК НаименованиеДополнительное,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ЕдиницаИзмерения
				|		ИНАЧЕ """"
				|	КОНЕЦ КАК ЕдиницаИзмерения,
			 	|	ВЫБОР
              	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ""Основное средство""
               	|		ИНАЧЕ ""Номенклатура""
               	|	КОНЕЦ КАК ТипСправочника
	            |ИЗ
	            |	Документ.ПередачаОбъектовОС.ДрагоценныеМатериалы КАК ПередачаОбъектовОСДрагоценныеМатериалы
	            |ГДЕ
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка = &ДокументОснованиеЭД 
				|	И НЕ ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ЕСТЬ NULL
				|	И НЕ ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ = НЕОПРЕДЕЛЕНО
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
				|   ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ, 
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).Наименование
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Наименование
				|		ИНАЧЕ """"
				|	КОНЕЦ,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).НаименованиеПолное
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).НаименованиеПолное
				|		ИНАЧЕ """"
				|	КОНЕЦ,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).Сведения
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.ОсновныеСредства) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Сведения
				|		ИНАЧЕ """"
				|	КОНЕЦ,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ВидНФА
               	|		ИНАЧЕ NULL
               	|	КОНЕЦ,
               	|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ТипНФА
               	|		ИНАЧЕ NULL
               	|	КОНЕЦ, 
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ИмуществоКазны
               	|		ИНАЧЕ ЛОЖЬ
               	|	КОНЕЦ,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ВключитьВСоставВнеоборотныхАктивов
               	|		ИНАЧЕ ЛОЖЬ
               	|	КОНЕЦ,
               	|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Местонахождение
               	|		ИНАЧЕ """"
               	|	КОНЕЦ,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ИзготовительОС
				|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ИзготовительОС
               	|		ИНАЧЕ NULL
               	|	КОНЕЦ,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).СтранаПроисхождения
				|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).СтранаПроисхождения
               	|		ИНАЧЕ """"
               	|	КОНЕЦ,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).Назначение
               	|		ИНАЧЕ """"
               	|	КОНЕЦ, 
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ВидМаркируемойПродукции
               	|		ИНАЧЕ ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ВидМаркируемойПродукции
               	|	КОНЕЦ, 
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).ПрослеживаемыйТовар
               	|		ИНАЧЕ ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ПрослеживаемыйТовар
               	|	КОНЕЦ,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.ОсновныеСредства).КодКонтураИдентификацииСведенийОбОбъекте
               	|		ИНАЧЕ 0
               	|	КОНЕЦ,
               	|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ТипНоменклатуры
               	|		ИНАЧЕ """"
               	|	КОНЕЦ,
				|	ВЫБОР
               	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.Номенклатура
               	|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).НаименованиеДополнительное
               	|		ИНАЧЕ """"
               	|	КОНЕЦ,
				|	ВЫБОР 
				|		КОГДА ТИПЗНАЧЕНИЯ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ) = ТИП(Справочник.Номенклатура) 
				|			ТОГДА ВЫРАЗИТЬ(ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ КАК Справочник.Номенклатура).ЕдиницаИзмерения
				|		ИНАЧЕ """"
				|	КОНЕЦ,
			 	|	ВЫБОР
              	|		КОГДА ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ССЫЛКА Справочник.ОсновныеСредства
               	|			ТОГДА ""Основное средство""
               	|		ИНАЧЕ ""Номенклатура""
               	|	КОНЕЦ
	            |ИЗ
	            |	Документ.ПередачаОбъектовИК.ДрагоценныеМатериалы КАК ПередачаОбъектовОСДрагоценныеМатериалы
	            |ГДЕ
	            |	ПередачаОбъектовОСДрагоценныеМатериалы.Ссылка = &ДокументОснованиеЭД
				|	И НЕ ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ ЕСТЬ NULL
				|	И НЕ ПередачаОбъектовОСДрагоценныеМатериалы.ОбъектМЦ = НЕОПРЕДЕЛЕНО";

	Возврат Результат;
	
КонецФункции	

Функция ЗапросДопСведенийНФАДляЭД()
	
	Результат = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	            |	НаборыДополнительныхСведений.Свойство КАК Свойство
	            |ПОМЕСТИТЬ НаборыДопСведенийРеквизитов
	            |ИЗ
	            |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхСведений
	            |ГДЕ
	            |	НЕ НаборыДополнительныхСведений.Свойство.ПометкаУдаления
	            |
	            |ОБЪЕДИНИТЬ
	            |
	            |ВЫБРАТЬ
	            |	НаборыДополнительныхРеквизитов.Свойство
	            |ИЗ
	            |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитов
	            |ГДЕ
	            |	НЕ НаборыДополнительныхРеквизитов.Свойство.ПометкаУдаления
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОСДополнительныеРеквизиты.Ссылка) КАК GUIDНоменклатурыОтправителя,
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОСДополнительныеРеквизиты.Свойство) КАК GUIDДополнительныхСведений,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Ссылка КАК Справочник.ОсновныеСредства).НаименованиеПолное КАК НаименованиеПолное,
	            |	ТИПЗНАЧЕНИЯ(ОСДополнительныеРеквизиты.Ссылка) КАК ТипСправочникаНФА,
	            |	ОСДополнительныеРеквизиты.Свойство.Заголовок КАК СвойствоЗаголовок,
	            |	ОСДополнительныеРеквизиты.Свойство.Наименование КАК СвойствоНаим,
	            |	ОСДополнительныеРеквизиты.Свойство.Имя КАК СвойствоИмя,
	            |	ОСДополнительныеРеквизиты.Свойство.ТипЗначения КАК СвойствоТипЗнч,
	            |	ОСДополнительныеРеквизиты.Свойство.Виден КАК СвойствоВиден,
	            |	ОСДополнительныеРеквизиты.Свойство.ВыводитьВВидеГиперссылки КАК СвойствоВВидеГиперссылки,
	            |	ОСДополнительныеРеквизиты.Свойство.ДополнительныеЗначенияИспользуются КАК СвойствоДопЗначИспользуются,
	            |	ОСДополнительныеРеквизиты.Свойство.ДополнительныеЗначенияСВесом КАК СвойствоДопЗначСВесом,
	            |	ОСДополнительныеРеквизиты.Свойство.Доступен КАК СвойствоДоступен,
	            |	ОСДополнительныеРеквизиты.Свойство.ЗаполнятьОбязательно КАК СвойствоЗаполнятьОбязательно,
	            |	ОСДополнительныеРеквизиты.Свойство.ИдентификаторДляФормул КАК СвойствоИдентификаторДляФормул,
	            |	ОСДополнительныеРеквизиты.Свойство.МногострочноеПолеВвода КАК СвойствоМногострочноеПолеВвода,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).Наименование КАК СвойствоНаборСвойств,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).ИмяПредопределенногоНабора КАК НаборСвойствИмяПредопределенногоНабора,
	            |	ОСДополнительныеРеквизиты.Свойство.ЭтоДополнительноеСведение КАК СвойствоЭтоДопСведение,
	            |	ПРЕДСТАВЛЕНИЕ(ОСДополнительныеРеквизиты.Значение) КАК ЗначениеПредставление,
	            |	ТИПЗНАЧЕНИЯ(ОСДополнительныеРеквизиты.Значение) КАК ТипЗначения,
	            |	ОСДополнительныеРеквизиты.Значение.Наименование КАК ЗначениеНаим,
	            |	ВЫБОР
	            |		КОГДА ОСДополнительныеРеквизиты.Значение.ПолноеНаименование ЕСТЬ NULL
	            |			ТОГДА ОСДополнительныеРеквизиты.Значение.НаименованиеПолное
	            |		ИНАЧЕ ОСДополнительныеРеквизиты.Значение.ПолноеНаименование
	            |	КОНЕЦ КАК ЗначениеПолноеНаименование,
	            |	ОСДополнительныеРеквизиты.Значение.Вес КАК ЗначениеВес,
	            |	ОСДополнительныеРеквизиты.Значение.Родитель.Наименование КАК ЗначениеРодительНаим,
	            |	ВЫБОР
	            |		КОГДА ОСДополнительныеРеквизиты.Значение.Владелец ССЫЛКА Справочник.Организации
	            |			ТОГДА ОСДополнительныеРеквизиты.Значение.Владелец
	            |		ИНАЧЕ ВЫБОР
	            |				КОГДА ОСДополнительныеРеквизиты.Значение.Контрагент ЕСТЬ NULL
	            |					ТОГДА ОСДополнительныеРеквизиты.Значение.Организация
	            |				ИНАЧЕ ОСДополнительныеРеквизиты.Значение.Контрагент
	            |			КОНЕЦ
	            |	КОНЕЦ КАК Контрагент,
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОСДополнительныеРеквизиты.Значение.Ссылка) КАК ЗначениеGUIDОтправителя,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.ОсновныеСредства).ВидНФА КАК ЗначениеВидНФА,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.ОсновныеСредства).ТипНФА КАК ЗначениеТипНФА,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.Договоры).ВидДоговора КАК ЗначениеВидДоговора,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.НаправленияДеятельности).ВидВзаиморасчетов КАК ЗначениеВидВзаиморасчета,
	            |	ОСДополнительныеРеквизиты.Значение.Код КАК ЗначениеКод,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.Номенклатура).ТипНоменклатуры КАК ЗначениеТипНоменклатуры,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.Периоды).ДатаНачала КАК ЗначениеДатаНачала,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.Периоды).ДатаОкончания КАК ЗначениеДатаОкончания,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.Периоды).Периодичность КАК ЗначениеПериодичность,
	            |	ВЫРАЗИТЬ(ОСДополнительныеРеквизиты.Значение КАК Справочник.Периоды).Произвольный КАК ЗначениеПроизвольный
	            |ИЗ
	            |	Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК ОСДополнительныеРеквизиты
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборыДопСведенийРеквизитов КАК НаборыДопСведенийРеквизитов
	            |		ПО (НаборыДопСведенийРеквизитов.Свойство = ОСДополнительныеРеквизиты.Свойство)
	            |ГДЕ
	            |	ОСДополнительныеРеквизиты.Ссылка В(&ОбъектыНФА)
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ОсновныеСредства.Ссылка),
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДополнительныеСведения.Свойство),
	            |	ОсновныеСредства.НаименованиеПолное,
	            |	ТИПЗНАЧЕНИЯ(ОсновныеСредства.Ссылка),
	            |	ДополнительныеСведения.Свойство.Заголовок,
	            |	ДополнительныеСведения.Свойство.Наименование,
	            |	ДополнительныеСведения.Свойство.Имя,
	            |	ДополнительныеСведения.Свойство.ТипЗначения,
	            |	ДополнительныеСведения.Свойство.Виден,
	            |	ДополнительныеСведения.Свойство.ВыводитьВВидеГиперссылки,
	            |	ДополнительныеСведения.Свойство.ДополнительныеЗначенияИспользуются,
	            |	ДополнительныеСведения.Свойство.ДополнительныеЗначенияСВесом,
	            |	ДополнительныеСведения.Свойство.Доступен,
	            |	ДополнительныеСведения.Свойство.ЗаполнятьОбязательно,
	            |	ДополнительныеСведения.Свойство.ИдентификаторДляФормул,
	            |	ДополнительныеСведения.Свойство.МногострочноеПолеВвода,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).Наименование,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).ИмяПредопределенногоНабора,
	            |	ДополнительныеСведения.Свойство.ЭтоДополнительноеСведение,
	            |	ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Значение),
	            |	ТИПЗНАЧЕНИЯ(ДополнительныеСведения.Значение),
	            |	ДополнительныеСведения.Значение.Наименование,
	            |	ВЫБОР
	            |		КОГДА ДополнительныеСведения.Значение.ПолноеНаименование ЕСТЬ NULL
	            |			ТОГДА ДополнительныеСведения.Значение.НаименованиеПолное
	            |		ИНАЧЕ ДополнительныеСведения.Значение.ПолноеНаименование
	            |	КОНЕЦ,
	            |	ДополнительныеСведения.Значение.Вес,
	            |	ДополнительныеСведения.Значение.Родитель.Наименование,
	            |	ВЫБОР
	            |		КОГДА ДополнительныеСведения.Значение.Владелец ССЫЛКА Справочник.Организации
	            |			ТОГДА ДополнительныеСведения.Значение.Владелец
	            |		ИНАЧЕ ВЫБОР
	            |				КОГДА ДополнительныеСведения.Значение.Контрагент ЕСТЬ NULL
	            |					ТОГДА ДополнительныеСведения.Значение.Организация
	            |				ИНАЧЕ ДополнительныеСведения.Значение.Контрагент
	            |			КОНЕЦ
	            |	КОНЕЦ,
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДополнительныеСведения.Значение.Ссылка),
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.ОсновныеСредства).ВидНФА,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.ОсновныеСредства).ТипНФА,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Договоры).ВидДоговора,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.НаправленияДеятельности).ВидВзаиморасчетов,
	            |	ДополнительныеСведения.Значение.Код,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Номенклатура).ТипНоменклатуры,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).ДатаНачала,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).ДатаОкончания,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).Периодичность,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).Произвольный
	            |ИЗ
	            |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
	            |		ПО (ВЫБОР
	            |				КОГДА ДополнительныеСведения.Объект ССЫЛКА Справочник.ОсновныеСредства
	            |					ТОГДА ДополнительныеСведения.Объект = ОсновныеСредства.Ссылка
	            |				ИНАЧЕ ЛОЖЬ
	            |			КОНЕЦ)
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборыДопСведенийРеквизитов КАК НаборыДопСведенийРеквизитов
	            |		ПО (НаборыДопСведенийРеквизитов.Свойство = ДополнительныеСведения.Свойство)
	            |ГДЕ
	            |	ОсновныеСредства.Ссылка В(&ОбъектыНФА)
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НоменклатураНФА.Ссылка),
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НоменклатураНФА.Свойство),
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Ссылка КАК Справочник.Номенклатура).НаименованиеПолное,
	            |	ТИПЗНАЧЕНИЯ(НоменклатураНФА.Ссылка),
	            |	НоменклатураНФА.Свойство.Заголовок,
	            |	НоменклатураНФА.Свойство.Наименование,
	            |	НоменклатураНФА.Свойство.Имя,
	            |	НоменклатураНФА.Свойство.ТипЗначения,
	            |	НоменклатураНФА.Свойство.Виден,
	            |	НоменклатураНФА.Свойство.ВыводитьВВидеГиперссылки,
	            |	НоменклатураНФА.Свойство.ДополнительныеЗначенияИспользуются,
	            |	НоменклатураНФА.Свойство.ДополнительныеЗначенияСВесом,
	            |	НоменклатураНФА.Свойство.Доступен,
	            |	НоменклатураНФА.Свойство.ЗаполнятьОбязательно,
	            |	НоменклатураНФА.Свойство.ИдентификаторДляФормул,
	            |	НоменклатураНФА.Свойство.МногострочноеПолеВвода,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).Наименование,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).ИмяПредопределенногоНабора,
	            |	НоменклатураНФА.Свойство.ЭтоДополнительноеСведение,
	            |	ПРЕДСТАВЛЕНИЕ(НоменклатураНФА.Значение),
	            |	ТИПЗНАЧЕНИЯ(НоменклатураНФА.Значение),
	            |	НоменклатураНФА.Значение.Наименование,
	            |	ВЫБОР
	            |		КОГДА НоменклатураНФА.Значение.ПолноеНаименование ЕСТЬ NULL
	            |			ТОГДА НоменклатураНФА.Значение.НаименованиеПолное
	            |		ИНАЧЕ НоменклатураНФА.Значение.ПолноеНаименование
	            |	КОНЕЦ,
	            |	НоменклатураНФА.Значение.Вес,
	            |	НоменклатураНФА.Значение.Родитель.Наименование,
	            |	ВЫБОР
	            |		КОГДА НоменклатураНФА.Значение.Владелец ССЫЛКА Справочник.Организации
	            |			ТОГДА НоменклатураНФА.Значение.Владелец
	            |		ИНАЧЕ ВЫБОР
	            |				КОГДА НоменклатураНФА.Значение.Контрагент ЕСТЬ NULL
	            |					ТОГДА НоменклатураНФА.Значение.Организация
	            |				ИНАЧЕ НоменклатураНФА.Значение.Контрагент
	            |			КОНЕЦ
	            |	КОНЕЦ,
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НоменклатураНФА.Значение.Ссылка),
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.ОсновныеСредства).ВидНФА,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.ОсновныеСредства).ТипНФА,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.Договоры).ВидДоговора,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.НаправленияДеятельности).ВидВзаиморасчетов,
	            |	НоменклатураНФА.Значение.Код,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.Номенклатура).ТипНоменклатуры,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.Периоды).ДатаНачала,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.Периоды).ДатаОкончания,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.Периоды).Периодичность,
	            |	ВЫРАЗИТЬ(НоменклатураНФА.Значение КАК Справочник.Периоды).Произвольный
	            |ИЗ
	            |	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураНФА
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборыДопСведенийРеквизитов КАК НаборыДопСведенийРеквизитов
	            |		ПО (НаборыДопСведенийРеквизитов.Свойство = НоменклатураНФА.Свойство)
	            |ГДЕ
	            |	НоменклатураНФА.Ссылка В(&ОбъектыНФА)
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(НоменклатураНФА.Ссылка),
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДополнительныеСведения.Свойство),
	            |	НоменклатураНФА.НаименованиеПолное,
	            |	ТИПЗНАЧЕНИЯ(НоменклатураНФА.Ссылка),
	            |	ДополнительныеСведения.Свойство.Заголовок,
	            |	ДополнительныеСведения.Свойство.Наименование,
	            |	ДополнительныеСведения.Свойство.Имя,
	            |	ДополнительныеСведения.Свойство.ТипЗначения,
	            |	ДополнительныеСведения.Свойство.Виден,
	            |	ДополнительныеСведения.Свойство.ВыводитьВВидеГиперссылки,
	            |	ДополнительныеСведения.Свойство.ДополнительныеЗначенияИспользуются,
	            |	ДополнительныеСведения.Свойство.ДополнительныеЗначенияСВесом,
	            |	ДополнительныеСведения.Свойство.Доступен,
	            |	ДополнительныеСведения.Свойство.ЗаполнятьОбязательно,
	            |	ДополнительныеСведения.Свойство.ИдентификаторДляФормул,
	            |	ДополнительныеСведения.Свойство.МногострочноеПолеВвода,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).Наименование,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Свойство.НаборСвойств КАК Справочник.НаборыДополнительныхРеквизитовИСведений).ИмяПредопределенногоНабора,
	            |	ДополнительныеСведения.Свойство.ЭтоДополнительноеСведение,
	            |	ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Значение),
	            |	ТИПЗНАЧЕНИЯ(ДополнительныеСведения.Значение),
	            |	ДополнительныеСведения.Значение.Наименование,
	            |	ВЫБОР
	            |		КОГДА ДополнительныеСведения.Значение.ПолноеНаименование ЕСТЬ NULL
	            |			ТОГДА ДополнительныеСведения.Значение.НаименованиеПолное
	            |		ИНАЧЕ ДополнительныеСведения.Значение.ПолноеНаименование
	            |	КОНЕЦ,
	            |	ДополнительныеСведения.Значение.Вес,
	            |	ДополнительныеСведения.Значение.Родитель.Наименование,
	            |	ВЫБОР
	            |		КОГДА ДополнительныеСведения.Значение.Владелец ССЫЛКА Справочник.Организации
	            |			ТОГДА ДополнительныеСведения.Значение.Владелец
	            |		ИНАЧЕ ВЫБОР
	            |				КОГДА ДополнительныеСведения.Значение.Контрагент ЕСТЬ NULL
	            |					ТОГДА ДополнительныеСведения.Значение.Организация
	            |				ИНАЧЕ ДополнительныеСведения.Значение.Контрагент
	            |			КОНЕЦ
	            |	КОНЕЦ,
	            |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ДополнительныеСведения.Значение.Ссылка),
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.ОсновныеСредства).ВидНФА,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.ОсновныеСредства).ТипНФА,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Договоры).ВидДоговора,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.НаправленияДеятельности).ВидВзаиморасчетов,
	            |	ДополнительныеСведения.Значение.Код,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Номенклатура).ТипНоменклатуры,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).ДатаНачала,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).ДатаОкончания,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).Периодичность,
	            |	ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК Справочник.Периоды).Произвольный
	            |ИЗ
	            |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураНФА
	            |		ПО (ВЫБОР
	            |				КОГДА ДополнительныеСведения.Объект ССЫЛКА Справочник.Номенклатура
	            |					ТОГДА ДополнительныеСведения.Объект = НоменклатураНФА.Ссылка
	            |				ИНАЧЕ ЛОЖЬ
	            |			КОНЕЦ)
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборыДопСведенийРеквизитов КАК НаборыДопСведенийРеквизитов
	            |		ПО (НаборыДопСведенийРеквизитов.Свойство = ДополнительныеСведения.Свойство)
	            |ГДЕ
	            |	НоменклатураНФА.Ссылка В(&ОбъектыНФА)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	GUIDНоменклатурыОтправителя";

	Возврат Результат;
	
КонецФункции	

#КонецОбласти

Функция СведенияСвязанногоКонтрагентаОтправленногоАктаПередачиНФА(СвязанныеКонтрагенты, GUIDКонтрагента) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ИНН", "");
	Результат.Вставить("КПП", "");
	Результат.Вставить("ОГРН", "");
	Результат.Вставить("ОГРНИП", "");
	Результат.Вставить("КодПоКИСЭ", "");
	Результат.Вставить("КодПоОКОПФ", "");
	Результат.Вставить("НаименованиеКонтрагента", "");
	
	ПараметрыОтбораКонтрагента = Новый Структура;
	ПараметрыОтбораКонтрагента.Вставить("GUIDКонтрагента", GUIDКонтрагента);
	НайденныеСтрокиКонтрагента = СвязанныеКонтрагенты.НайтиСтроки(ПараметрыОтбораКонтрагента);
	Если НайденныеСтрокиКонтрагента.Количество()>0 Тогда
		ЗаполнитьЗначенияСвойств(Результат, НайденныеСтрокиКонтрагента[0]); 
	КонецЕсли;
	
	Возврат Результат; 
КонецФункции	

Процедура ДобавитьШтампыЭлектронныхПодписейДляПредставленияАктаПриемаПередачиНФА(ТабличныйДокумент, ПодписиОтправителя, ПодписиПолучателя, ПараметрыПечати) Экспорт
	
	ОтображатьДатуПодписанияВШтампеВизуализацииПЭП = Константы.ОтображатьДатуПодписанияВШтампеВизуализацииПЭП.Получить();
	Если ОтображатьДатуПодписанияВШтампеВизуализацииПЭП И ПараметрыПечати.Свойство("Организация") Тогда
		ОтображатьДатуПодписанияВШтампеВизуализацииПЭП = ЭлектронныеДокументыБГУ.ОтображатьДатуПодписанияПоОрганизации(ПараметрыПечати.Организация);
	КонецЕсли;
	
	КоличествоПодписантов = 0;
	Если ЗначениеЗаполнено(ПодписиОтправителя) Тогда
		КоличествоПодписантов = ПодписиОтправителя.Количество();
	КонецЕсли;
	
	КоличествоПодписантовОтветногоАкта = 0;
	Если ЗначениеЗаполнено(ПодписиПолучателя) Тогда
		КоличествоПодписантовОтветногоАкта = ПодписиПолучателя.Количество();
	КонецЕсли;
	
	ВсегоПодписей = КоличествоПодписантов;
	
	Если КоличествоПодписантовОтветногоАкта > ВсегоПодписей Тогда
		ВсегоПодписей = КоличествоПодписантовОтветногоАкта;
	КонецЕсли;
	
	МакетЭПБГУ = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ШтампыПредставленияЭДБГУ");
	
	Штамп = Новый ТабличныйДокумент;
	
	Подписи = Новый ТаблицаЗначений;
	
	Подписи.Колонки.Добавить("ПростаяПодпись", Новый ОписаниеТипов("Булево"));
	Подписи.Колонки.Добавить("ДатаПодписи", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Подписи.Колонки.Добавить("ВремяПодписи", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Время)));
	Подписи.Колонки.Добавить("КомуВыданСертификат", Новый ОписаниеТипов("Строка"));
	Подписи.Колонки.Добавить("НаименованиеОрганизации", Новый ОписаниеТипов("Строка"));
	Подписи.Колонки.Добавить("Должность", Новый ОписаниеТипов("Строка"));
	Подписи.Колонки.Добавить("ПодписьВерна", Новый ОписаниеТипов("Булево"));
	Подписи.Колонки.Добавить("Владелец", Новый ОписаниеТипов("Строка"));
	Подписи.Колонки.Добавить("СерийныйНомерСертификата", Новый ОписаниеТипов("Строка"));
	Подписи.Колонки.Добавить("ДатаНачалаСертификата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Подписи.Колонки.Добавить("ДатаОкончанияСертификата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Подписи.Колонки.Добавить("НаименованиеПользователяПодписанта", Новый ОписаниеТипов("Строка"));
	
	Подписи.Колонки.Добавить("НомерМЧД", Новый ОписаниеТипов("Строка"));
	Подписи.Колонки.Добавить("ПредставлениеМЧД", Новый ОписаниеТипов("Строка"));
	Подписи.Колонки.Добавить("ДатаВыдачиМЧД", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Подписи.Колонки.Добавить("ДатаОкончанияМЧД", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	
	Для н = 0 По ВсегоПодписей-1 Цикл
		Счетчик = 0;
		Подписи.Очистить();
		
		Если н < ПодписиОтправителя.Количество() Тогда
			НовПодпись = Подписи.Добавить();
			ЗаполнитьЗначенияСвойств(НовПодпись, ПодписиОтправителя[н]);
		Иначе
			НовПодпись = Подписи.Добавить();
		КонецЕсли;	
		
		Если н < ПодписиПолучателя.Количество() Тогда
			НовПодпись = Подписи.Добавить();
			ЗаполнитьЗначенияСвойств(НовПодпись, ПодписиПолучателя[н]);
		Иначе
			НовПодпись = Подписи.Добавить();
		КонецЕсли;	
		
		Для Каждого Подпись Из Подписи Цикл
			Счетчик = Счетчик + 1;
			
			Если Подпись.ПростаяПодпись Тогда
				Если ОтображатьДатуПодписанияВШтампеВизуализацииПЭП Тогда
					ОбластьШтамп = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПСДатойОдинарныйСтрока|ШтампОдинарный");
					ОбластьШтампПустой = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПСДатойОдинарныйСтрока|ШтампОдинарныйРазделитель");
				Иначе	
					ОбластьШтамп = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПОдинарныйСтрока|ШтампОдинарный");
					ОбластьШтампПустой = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПОдинарныйСтрока|ШтампОдинарныйРазделитель");
				КонецЕсли;
			Иначе
				Если ОтображатьДатуПодписанияВШтампеВизуализацииПЭП Тогда
					ОбластьШтамп = МакетЭПБГУ.ПолучитьОбласть("ШтампЭПСДатойОдинарныйСтрока|ШтампОдинарный");
					ОбластьШтампПустой = МакетЭПБГУ.ПолучитьОбласть("ШтампЭПСДатойОдинарныйСтрока|ШтампОдинарныйРазделитель");
				Иначе	
					ОбластьШтамп = МакетЭПБГУ.ПолучитьОбласть("ШтампЭПОдинарныйСтрока|ШтампОдинарный");
					ОбластьШтампПустой = МакетЭПБГУ.ПолучитьОбласть("ШтампЭПОдинарныйСтрока|ШтампОдинарныйРазделитель");
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Подпись.Владелец) И Подпись.ПростаяПодпись Тогда
				Если ЗначениеЗаполнено(Подпись.НаименованиеПользователяПодписанта) Тогда
					Подпись.Владелец = Подпись.НаименованиеПользователяПодписанта;
				КонецЕсли;	
			КонецЕсли;	

			Если ЗначениеЗаполнено(Подпись.Владелец) Тогда
				ЗаполнитьОбластьШтампа(ОбластьШтамп, Подпись);
				
				Если Счетчик = 1 Тогда
					ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(Штамп, ОбластьШтамп, "ШтампЭП" + Счетчик);
				Иначе
					
					Если ОтображатьДатуПодписанияВШтампеВизуализацииПЭП Тогда
						Разделитель = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПСДатойОдинарныйСтрока|ШтампОдинарныйРазделитель");
					Иначе	
						Разделитель = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПОдинарныйСтрока|ШтампОдинарныйРазделитель");
					КонецЕсли;
					ОбщегоНазначенияБЭД.ПрисоединитьОбластьКТабличномуДокументу(Штамп, Разделитель, "Разделитель");
				
					ОбщегоНазначенияБЭД.ПрисоединитьОбластьКТабличномуДокументу(Штамп, ОбластьШтамп, "ШтампЭП" + Счетчик);
					
				КонецЕсли;
				
			Иначе
				Если ОтображатьДатуПодписанияВШтампеВизуализацииПЭП Тогда
					ОбластьШтампПустойБГУ = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПСДатойОдинарныйПустойСтрока|ШтампОдинарный");
				Иначе
					ОбластьШтампПустойБГУ = МакетЭПБГУ.ПолучитьОбласть("ШтампПЭПОдинарныйПустойСтрока|ШтампОдинарный");
				КонецЕсли;
				ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(Штамп, ОбластьШтампПустойБГУ, "ШтампЭП" + Счетчик);
			КонецЕсли;	
		
		КонецЦикла;
	
		Штамп.Область().СоздатьФорматСтрок();
		ОбщегоНазначенияБЭД.ВывестиОбластьВТабличныйДокумент(ТабличныйДокумент, Штамп, "ШтампЭП");
		Штамп.Очистить();
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьОбластьШтампа(ОбластьЭП, Подпись) Экспорт
	Если ЗначениеЗаполнено(Подпись.Владелец) Тогда
		ОтметкаВерна   = НСтр("ru='Подпись верна'");
		ОтметкаНеВерна = НСтр("ru='Подпись не верна'");
		ТекстОтметки = ?(Подпись.ПодписьВерна, ОтметкаВерна, ОтметкаНеВерна);
		
		ЗначенияПараметров = Новый Структура;
		ДатаПодписи = "";
		Если ЗначениеЗаполнено(Подпись.ДатаПодписи) Тогда
			Если НачалоДня(Подпись.ДатаПодписи) = Подпись.ДатаПодписи Тогда
				ДатаПодписи = Формат(Подпись.ДатаПодписи, "ДФ=dd.MM.yyyy");
			Иначе
				ДатаПодписи = Формат(Подпись.ДатаПодписи, "ДФ='dd.MM.yyyy HH:mm:ss'");
			КонецЕсли;	
			Если ЗначениеЗаполнено(Подпись.ВремяПодписи) Тогда
				ДатаПодписи = СтрШаблон("%1 %2", Формат(Подпись.ДатаПодписи, "ДФ=dd.MM.yyyy"), Формат(Подпись.ВремяПодписи, "ДФ=HH:mm:ss"));
			КонецЕсли;	
		КонецЕсли;	
		Если Подпись.ПростаяПодпись Тогда
			ЗначенияПараметров.Вставить("Организация",			Подпись.НаименованиеОрганизации);
			ЗначенияПараметров.Вставить("Должность", 			Подпись.Должность);
			ЗначенияПараметров.Вставить("ВладелецПодписи",		Подпись.Владелец);
			ЗначенияПараметров.Вставить("УстановившийПодпись",	Подпись.НаименованиеПользователяПодписанта);
			ЗначенияПараметров.Вставить("ДатаПодписи",          ДатаПодписи);
			ЗначенияПараметров.Вставить("ТекстОтметки",        ТекстОтметки);
		Иначе	
			Шаблон = НСтр("ru='с %1 по %2'");
			СрокДействия = СтрШаблон(Шаблон, Подпись.ДатаНачалаСертификата, Подпись.ДатаОкончанияСертификата);
			
			ВладелецСертификата = Подпись.КомуВыданСертификат;
			Если ЗначениеЗаполнено(Подпись.НомерМЧД) Тогда
				ОтметкаМЧД = СтрШаблон(НСтр("ru='по доверенности %1, %2, действует: с %3 по %4'"), Подпись.НомерМЧД, Подпись.ПредставлениеМЧД,
					Формат(Подпись.ДатаВыдачиМЧД, "ДФ=dd.MM.yyyy"), Формат(Подпись.ДатаОкончанияМЧД, "ДФ=dd.MM.yyyy"));
				ВладелецИСведенияМЧД = СтрШаблон(НСтр("ru='%1, %2'"), ВладелецСертификата, ОтметкаМЧД);
				ВладелецСертификата = ВладелецИСведенияМЧД;
			КонецЕсли;
				
			ЗначенияПараметров.Вставить("Организация",			Подпись.НаименованиеОрганизации);
			ЗначенияПараметров.Вставить("НомерСертификата",		Подпись.СерийныйНомерСертификата);
			ЗначенияПараметров.Вставить("ВладелецСертификата",	ВладелецСертификата);
			ЗначенияПараметров.Вставить("СрокДействия",			СрокДействия);
			ЗначенияПараметров.Вставить("ДатаПодписи",          ДатаПодписи);
			ЗначенияПараметров.Вставить("ТекстОтметки",         ТекстОтметки);
		КонецЕсли;
		ОбластьЭП.Параметры.Заполнить(ЗначенияПараметров);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
