#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ТекстСообщения = НСтр("ru='Документ ""Исходящий электронный акт о приеме-передаче объектов НФА"" вводится на основании документа учета передачи НФА, для которого подписан внутренний электронный документ акта ф.0510448
		|или документа учета поступления НФА, для которого подписан внутренний электронный документ ответного акта ф.0510448.'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;	
	
	ИсходящийАктСсылка = ЭлектронныеДокументыБГУ.НайтиИсходящийЭлектронныйАктОПриемеПередачеНФАПоДокументу(ДанныеЗаполнения);
	Если ЗначениеЗаполнено(ИсходящийАктСсылка) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для документа уже введен %1.'"),ИсходящийАктСсылка);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
		Если ДанныеЗаполнения.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаОтветногоПринимающейСтороны() Тогда
			ОписаниеОшибки = НСтр("ru='Для ответного акта нельзя ввести документ данного типа.'");

			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;	
		
		ДокументПринятияКУчету = ДокументПринятияКУчету(ДанныеЗаполнения);
		КодВидаПередачиНФА = ДанныеЗаполнения.КодВидаПередачиНФА;
		
		СведенияЭДАктаПередачиНФАПоДокументу = ЭлектронныеДокументыБГУ.СведенияЭДАктаПередачиНФАПоДокументу(ДанныеЗаполнения);
		Если НЕ ЗначениеЗаполнено(СведенияЭДАктаПередачиНФАПоДокументу) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ ""Входящий электронный акт о приеме-передаче объектов НФА"" указан также как документ учета для электронного документа в другом формате. Следует открыть форму представления этого документа (ЭДО - Просмотреть электронный документ) и отменить документ входящего акта в качестве документа учета иного электронного документа, а затем повторить операцию.'"),ДокументОснование);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	
		
		Если НЕ ЭлектронныеДокументыБГУ.ВнутреннийЭДПодписан(ДокументПринятияКУчету) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внутренний электронный документ ответного акта не подписан всеми назначенными подписантами. Следует подписать внутренний электронный документ ответного акта и повторить операцию.'"),ДокументОснование);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	
		
		ЗаполнитьПоВходящемуАкту(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовОС")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПринятиеКУчетуОбъектовИК")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеИК")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеОС")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеОСИК")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПрочееОтражениеЭлектронногоДокументаВУчете") 
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеМЗ") Тогда
		ЗаполнитьПоДокументуПринятиеКУчету(ДанныеЗаполнения);		
	Иначе	
		ПредставлениеНужногоВнутреннегоДокумента = НСтр("ru = 'Акт о приеме-передаче НФА (ф.0510448) (61н, ред. 100н)'");
		ЕстьВнутреннийЭД = ЭлектронныеДокументыБГУ.ЕстьВнутреннийЭДАктПриемаПередачи0510448(ДанныеЗаполнения);
		Если ЕстьВнутреннийЭД Тогда
			
			РеквизитыЗаполняемыеДанные = "Руководитель, Организация";
			ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, РеквизитыЗаполняемыеДанные);
			Если ЭлектронныеДокументыБГУ.ПроверятьНаличиеЭЦПРуководителяДляАктовОПриемеПередачеОбъектовНФА(
				ДанныеДокументаОснования.Организация) Тогда

				НаименованиеПечатнойФормы = "АктПриемаПередачи0510448";
				Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")
					ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НакладнаяНаОтпускИК") Тогда
					НаименованиеПечатнойФормы = "АктПриемаПередачи0510448ПоСебестоимости";
				КонецЕсли;	
				
				НаименованиеПервичногоДокумента = "Акт о приеме-передаче НФА (ф.0510448)";
				СотрудникРуководителя = ДанныеДокументаОснования.Руководитель;
				
				//ПОД
				ИспользуетсяПОД = ЭлектронныеДокументыБГУ.ИспользуетсяПОД();	
				Если ИспользуетсяПОД Тогда
					МодульПроцессыОбработкиДокументовПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовПереопределяемый");
					Если ЗначениеЗаполнено(СотрудникРуководителя) Тогда
						ЕстьПодписьРуководителя = МодульПроцессыОбработкиДокументовПереопределяемый.НаличиеПодписиСотрудникаДляМакетаПечатнойФормыДокумента(ДанныеЗаполнения, НаименованиеПечатнойФормы, СотрудникРуководителя);
						Если НЕ ЕстьПодписьРуководителя Тогда
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внутренний электронный документ ""%1"" не подписан ЭЦП руководителя ""%2"" или для пользователя руководителя не указано физическое лицо. 
							|После подписания документа руководителем следует повторить операцию.'"), НаименованиеПервичногоДокумента, СотрудникРуководителя);
							ВызватьИсключение ТекстСообщения;
						КонецЕсли;	
					Иначе
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В документе %1 не заполнен реквизит ""Руководитель"", следует заполнить этот реквизит и повторить операцию.'"), ДокументПринятияКУчету);
						ВызватьИсключение ТекстСообщения;
					КонецЕсли;
				Иначе
					//ПРОФ
					Если ЗначениеЗаполнено(СотрудникРуководителя) Тогда
						ЕстьПодписьРуководителя = ЭлектронныеДокументыБГУ.НаличиеПодписиСотрудникаДляВнутреннегоДокументаАктаПриемаПередачи0510448(ДанныеЗаполнения, СотрудникРуководителя);
						Если НЕ ЕстьПодписьРуководителя Тогда
							ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внутренний электронный документ ""%1"" не подписан ЭЦП руководителя ""%2"" или для пользователя руководителя не указано физическое лицо. 
							|После подписания документа руководителем следует повторить операцию.'"), НаименованиеПервичногоДокумента, СотрудникРуководителя);
							ВызватьИсключение ТекстСообщения;
						КонецЕсли;	
					Иначе
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В документе %1 не заполнен реквизит ""Руководитель"", следует заполнить этот реквизит и повторить операцию.'"), ДокументПринятияКУчету);
						ВызватьИсключение ТекстСообщения;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
				
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПередачаОбъектовОС")
				ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПередачаОбъектовИК") Тогда
				ЗаполнитьПоПередачеОбъектовОС(ДанныеЗаполнения);	
			ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")
				ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НакладнаяНаОтпускИК") Тогда
				ЗаполнитьПоНакладнойНаОтпускМЗ(ДанныеЗаполнения);	
			КонецЕсли;
			Если СуммаДокумента = 0 Тогда
				СуммаДокумента = ЭлектронныеДокументыБГУ.СуммаДокументаПоДаннымБУ(ДанныеЗаполнения);
			КонецЕсли;
		Иначе
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Для документа %1 отсутствует внутренний электронный документ ""%2"".'"),
				Строка(ДанныеЗаполнения), ПредставлениеНужногоВнутреннегоДокумента);

			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Процедура ПриЗаписи(Отказ)

	Если НЕ ПометкаУдаления Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если ТипЭлектронногоАкта = 1 Тогда
			ДокументПередачиНФА = ДокументОснование;
			СостояниеЭДОАкта = Перечисления.СостоянияДокументовАктовЭДОБГУ.ПодготовленИсходящийАкт;

			НаборЗаписей = РегистрыСведений.СостоянияПоДокументамАктовЭДОБГУ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(ДокументПередачиНФА);
			Запись = НаборЗаписей.Добавить();
			Запись.СсылкаНаОбъект = ДокументПередачиНФА;
			Запись.СостояниеЭДО = СостояниеЭДОАкта;
			НаборЗаписей.Записать(Истина);
		ИначеЕсли ТипЭлектронногоАкта = 2 Тогда
			ДокументПоступленияНФА = ДокументОснование;
			РезультатЭДО = ЭлектронныеДокументыБГУВызовСервера.РезультатОбменаАктамиОПриемеПередачеНФА(ДокументПоступленияНФА);
			СостояниеЭДОПолученныйАкт = РезультатЭДО.СостояниеЭДОВходящийДокументЭлектронногоАкта;
			СостояниеЭДООтветныйАкт = РезультатЭДО.СостояниеЭДОИсходящийДокументЭлектронногоАкта;
			
			Если СостояниеЭДООтветныйАкт = Перечисления.СостоянияДокументовЭДО.ОбменЗавершен Тогда
				СостояниеЭДОАкта = Перечисления.СостоянияДокументовАктовЭДОБГУ.ОбменЗавершен;
			Иначе
				СостояниеЭДОАкта = Перечисления.СостоянияДокументовАктовЭДОБГУ.ПодготовленОтветныйАкт;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.СостоянияПоДокументамАктовЭДОБГУ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(ДокументПоступленияНФА);
			Запись = НаборЗаписей.Добавить();
			Запись.СсылкаНаОбъект = ДокументПоступленияНФА;
			Запись.СостояниеЭДО = СостояниеЭДОАкта;
			НаборЗаписей.Записать(Истина);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВходящийАктОПриемеПередачеОбъектовНФА) Тогда
		ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаОтветногоПринимающейСтороны();
		
		КодВидаПередачиНФА = ВходящийАктОПриемеПередачеОбъектовНФА.КодВидаПередачиНФА;
	Иначе
		ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаПередающейСтороны();
		
		КодВидаПередачи = "";
		ТекстОшибкиЗаполненияКодаВидаПередачиНФА = "";
		КодВидаПередачиНФАДляАкта0510448(Дата, Организация, Контрагент, КодВидаПередачи, ТекстОшибкиЗаполненияКодаВидаПередачиНФА);
		
		Если ЗначениеЗаполнено(ТекстОшибкиЗаполненияКодаВидаПередачиНФА) Тогда
			Сообщить(ТекстОшибкиЗаполненияКодаВидаПередачиНФА);
			Отказ = Истина;
		КонецЕсли;	

		КодВидаПередачиНФА = КодВидаПередачи;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоПередачеОбъектовОС(ДокументОснование)
	
	ЗаполняемыеДанные = "Организация, Контрагент, Договор, СуммаДокумента";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПередачаОбъектовОС") Тогда
		ЗаполняемыеДанные = "ВидОперации";
		ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
		Если ДанныеДокументаОснования.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ВозвратПоставщикуСоСчета106 Тогда
			ЭтотОбъект.ЭтоВозвратНФА = Истина;
		ИначеЕсли ДанныеДокументаОснования.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаОСПолученныхВПользование
			ИЛИ ДанныеДокументаОснования.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаОСнаХранении Тогда
				ЭтотОбъект.ЭтоВозвратНФА = Истина;
		КонецЕсли;	
	КонецЕсли;	
		
	ЭтотОбъект.ДокументОснование = ДокументОснование;
	ЭтотОбъект.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаПередающейСтороны();
	
КонецПроцедуры

Процедура ЗаполнитьПоНакладнойНаОтпускМЗ(ДокументОснование)
	
	ЗаполняемыеДанные = "Организация, Контрагент, Договор, СуммаДокумента";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);
		
	ЭтотОбъект.ДокументОснование = ДокументОснование;
	ЭтотОбъект.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаПередающейСтороны();
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДокументОснование);
	ДанныеОСтоимостиМЗ = УправлениеМатериальнымиЗапасами.ДвиженияДокументов(МассивОбъектов);
	СуммаДокумента = ДанныеОСтоимостиМЗ.Итог("Сумма");
	
	ЭтотОбъект.СуммаДокумента = СуммаДокумента;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15") Тогда
		ЗаполняемыеДанные = "ВидПередачиМЗ";
		ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
		Если ДанныеДокументаОснования.ВидПередачиМЗ = Перечисления.ВидыПередачиМЗ.ВозвратСХраненияИзПереработки Тогда
			ЭтотОбъект.ЭтоВозвратНФА = Истина;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаполнитьПоВходящемуАкту(ДокументОснование)
	ЗаполняемыеДанные = "Организация, Контрагент, Договор, СуммаДокумента, ТипЭлектронногоАкта";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);

	ЭтотОбъект.ВходящийАктОПриемеПередачеОбъектовНФА = ДокументОснование;
	ЭтотОбъект.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаОтветногоПринимающейСтороны();
	
	ДокументПринятияКУчету = ДокументПринятияКУчету(ДокументОснование);
	ЭтотОбъект.ДокументОснование = ДокументПринятияКУчету; 
	
	Если ДанныеДокументаОснования.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаПередающейСтороны() Тогда
		Если НЕ ЗначениеЗаполнено(ДокументПринятияКУчету) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='На основании документа %1 не введен документ принятия к учету. Следует ввести документ отражения в учете и повторить операцию.'"),ДокументОснование);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуПринятиеКУчету(ДокументПринятияКУчету)
	ЗаполняемыеДанные = "ДокументОснование, НФАПереданыЭлектроннымАктом, Руководитель, Организация";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументПринятияКУчету, ЗаполняемыеДанные);
	ВходящийАкт = ДанныеДокументаОснования.ДокументОснование;
	НаименованиеПечатнойФормы = "ОтветныйАктПриемаПередачи0510448";
	НаименованиеПервичногоДокумента = "Ответный Акт о приеме-передаче НФА (ф.0510448)";
	СотрудникРуководителя = ДанныеДокументаОснования.Руководитель;

	Если НЕ ДанныеДокументаОснования.НФАПереданыЭлектроннымАктом Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ %1 не введен на основании входящего электронного документа (документ-основание указан для него вручную и не содержит сведений ЭДО). 
		|Следует ввести новый документ принятия к учету объектов НФА на основании документа входящего акта, пометить на удаление ошибочно введенный документ принятия объектов НФА к учету и повторить операцию для него.'"), ДокументПринятияКУчету, ВходящийАкт);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ПредставлениеНужногоВнутреннегоДокумента = НСтр("ru = 'Ответный Акт о приеме-передаче НФА (ф.0510448) (61н, ред. 100н)'");
		
		ЕстьВнутреннийЭД = ЭлектронныеДокументыБГУ.ЕстьВнутреннийЭДАктПриемаПередачи0510448(ДокументПринятияКУчету);
		Если НЕ ЕстьВнутреннийЭД Тогда
			ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Для документа %1 отсутствует внутренний электронный документ ""%2"".'"),
				Строка(ДокументПринятияКУчету), ПредставлениеНужногоВнутреннегоДокумента);

			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		
		Если ЭлектронныеДокументыБГУ.ПроверятьНаличиеЭЦПРуководителяДляОтветныхАктовОПриемеПередачеОбъектовНФА(
			ДанныеДокументаОснования.Организация) Тогда
			//ПОД
			ИспользуетсяПОД = ЭлектронныеДокументыБГУ.ИспользуетсяПОД();	
			Если ИспользуетсяПОД Тогда
				МодульПроцессыОбработкиДокументовПереопределяемый = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовПереопределяемый");
				Если ЗначениеЗаполнено(СотрудникРуководителя) Тогда
					ЕстьПодписьРуководителя = МодульПроцессыОбработкиДокументовПереопределяемый.НаличиеПодписиСотрудникаДляМакетаПечатнойФормыДокумента(ДокументПринятияКУчету, НаименованиеПечатнойФормы, СотрудникРуководителя);
					Если НЕ ЕстьПодписьРуководителя Тогда
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внутренний электронный документ ""%1"" не подписан ЭЦП руководителя ""%2"" или для пользователя руководителя не указано физическое лицо. 
						|После подписания документа руководителем следует повторить операцию.'"), НаименованиеПервичногоДокумента, СотрудникРуководителя);
						ВызватьИсключение ТекстСообщения;
					КонецЕсли;	
				Иначе
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В документе %1 не заполнен реквизит ""Руководитель"", следует заполнить этот реквизит и повторить операцию.'"), ДокументПринятияКУчету);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			Иначе
				//ПРОФ
				Если ЗначениеЗаполнено(СотрудникРуководителя) Тогда
					ЕстьПодписьРуководителя = ЭлектронныеДокументыБГУ.НаличиеПодписиСотрудникаДляВнутреннегоДокументаАктаПриемаПередачи0510448(ДокументПринятияКУчету, СотрудникРуководителя);
					Если НЕ ЕстьПодписьРуководителя Тогда
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внутренний электронный документ ""%1"" не подписан ЭЦП руководителя ""%2"" или для пользователя руководителя не указано физическое лицо. 
						|После подписания документа руководителем следует повторить операцию.'"), НаименованиеПервичногоДокумента, СотрудникРуководителя);
						ВызватьИсключение ТекстСообщения;
					КонецЕсли;	
				Иначе
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В документе %1 не заполнен реквизит ""Руководитель"", следует заполнить этот реквизит и повторить операцию.'"), ДокументПринятияКУчету);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
	ЭтотОбъект.ДокументОснование = ДокументПринятияКУчету; 
	
	Если ТипЗнч(ВходящийАкт) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
		Если ЗначениеЗаполнено(ВходящийАкт) Тогда
			
			Если НЕ ЭлектронныеДокументыБГУ.ВнутреннийЭДПодписан(ЭтотОбъект.ДокументОснование) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Внутренний электронный документ ответного акта не подписан всеми назначенными подписантами. Следует подписать внутренний электронный документ ответного акта и повторить операцию.'"),ДокументОснование);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;	
			
			ЗаполнитьПоВходящемуАкту(ВходящийАкт);
			
		КонецЕсли;	
	Иначе
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Документ ""%1"" может быть введен только на основании документа с документом-основанием ""%2"".'"),
			Метаданные.Документы.ЭлектронныйАктОПриемеПередачеОбъектовНФАИсходящий.Представление(),
			Метаданные.Документы.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.Представление());
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
КонецПроцедуры

Функция ДокументПринятияКУчету(ВходящийАкт)
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПринятиеКУчетуОбъектовОС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПринятиеКУчетуОбъектовОС КАК ПринятиеКУчетуОбъектовОС
	               |ГДЕ
	               |	ПринятиеКУчетуОбъектовОС.ДокументОснование = &ДокументОснование
	               |	И ПринятиеКУчетуОбъектовОС.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПринятиеКУчетуОбъектовИК.Ссылка
	               |ИЗ
	               |	Документ.ПринятиеКУчетуОбъектовИК КАК ПринятиеКУчетуОбъектовИК
	               |ГДЕ
	               |	ПринятиеКУчетуОбъектовИК.ДокументОснование = &ДокументОснование
	               |	И ПринятиеКУчетуОбъектовИК.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеОС.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеОС КАК ПоступлениеОС
	               |ГДЕ
	               |	ПоступлениеОС.ДокументОснование = &ДокументОснование
	               |	И ПоступлениеОС.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеОСИК.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеОСИК КАК ПоступлениеОСИК
	               |ГДЕ
	               |	ПоступлениеОСИК.ДокументОснование = &ДокументОснование
	               |	И ПоступлениеОСИК.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеМЗ.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	               |ГДЕ
	               |	ПоступлениеМЗ.ДокументОснование = &ДокументОснование
	               |	И ПоступлениеМЗ.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеИК.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеИК КАК ПоступлениеИК
	               |ГДЕ
	               |	ПоступлениеИК.ДокументОснование = &ДокументОснование
	               |	И ПоступлениеИК.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПрочееОтражениеЭлектронногоДокументаВУчете.Ссылка
	               |ИЗ
	               |	Документ.ПрочееОтражениеЭлектронногоДокументаВУчете КАК ПрочееОтражениеЭлектронногоДокументаВУчете
	               |ГДЕ
	               |	ПрочееОтражениеЭлектронногоДокументаВУчете.ДокументОснование = &ДокументОснование";

	Запрос.УстановитьПараметр("ДокументОснование", ВходящийАкт);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	

Процедура КодВидаПередачиНФАДляАкта0510448(ДатаСведений, Отправитель, Получатель, Результат, ТекстОшибки)

	//Параметры учреждения
	
	Реквизиты = "ИНН, Бюджет, КодПоППП";
	ЗначенияРеквизитовОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Отправитель, Реквизиты);
	
	РеквизитыБюджет = "Наименование";
	ЗначенияРеквизитовБюджетОтправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитовОрганизации.Бюджет, РеквизитыБюджет);

	РеквизитыГлава = "Код";
	ЗначенияРеквизитовГлаваОтправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитовОрганизации.КодПоППП, РеквизитыГлава);

	ОтправительИНН =СокрЛП(ЗначенияРеквизитовОрганизации.ИНН);
	ОтправительГлава = СокрЛП(ЗначенияРеквизитовГлаваОтправителя.Код); 
	ОтправительБюджет = СокрЛП(ЗначенияРеквизитовБюджетОтправителя.Наименование);
	
    //Параметры контрагента
	
	Реквизиты = "ИНН, ЮридическоеФизическоеЛицо";
	ЗначенияРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Получатель, Реквизиты);

	РеквизитыЮЛ = "ИНН, Бюджет, КодПоППП";
	ЗначенияРеквизитовЮЛ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитовКонтрагента.ЮридическоеФизическоеЛицо, РеквизитыЮЛ);

	ЗначенияРеквизитовБюджет = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитовЮЛ.Бюджет, РеквизитыБюджет);
 	ЗначенияРеквизитовГлава = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЗначенияРеквизитовЮЛ.КодПоППП, РеквизитыГлава);
	
	ПолучательИНН = СокрЛП(ЗначенияРеквизитовЮЛ.ИНН);
	ПолучательГлава = СокрЛП(ЗначенияРеквизитовГлава.Код);
	ПолучательБюджет = СокрЛП(ЗначенияРеквизитовБюджет.Наименование);
	
	ПараметрыУчастников = Новый Структура;
	ПараметрыУчастников.Вставить("ОтправительИНН", ОтправительИНН);
	ПараметрыУчастников.Вставить("ПолучательИНН", ПолучательИНН);
	ПараметрыУчастников.Вставить("ОтправительГлава", ОтправительГлава);
	ПараметрыУчастников.Вставить("ПолучательГлава", ПолучательГлава);
	ПараметрыУчастников.Вставить("ОтправительБюджет", ОтправительБюджет);
	ПараметрыУчастников.Вставить("ПолучательБюджет", ПолучательБюджет);
	
	ЭлектронныеДокументыБГУ.КодВидаПередачиНФАДляАкта0510448(ДатаСведений, Отправитель, Получатель, 
		ПараметрыУчастников, Результат, ТекстОшибки);	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли