
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Параметры.ВидОтчета;
	ПравилоЗаполнения = Параметры.ПравилоЗаполнения;
	Событие = Параметры.Событие;
	
	Если Параметры.Свойство("РеквизитыДокумента") И ЗначениеЗаполнено(Параметры.РеквизитыДокумента) Тогда
		
		РеквизитыДокумента = Параметры.РеквизитыДокумента;
		
		Если ТипЗнч(РеквизитыДокумента) = Тип("Структура") Тогда
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ВидОтчета", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
				
				ВидОтчета = Значение;
				
			КонецЕсли;
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ПравилоЗаполнения", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
				
				ПравилоЗаполнения = Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	ТаблицаФормы = РеквизитФормыВЗначение("ТаблицаСоответствияАналитик");
	
	// Заполнение таблицы аналитики по группам раскрытия вида отчета
	ТаблицаАналитики = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
	ТаблицаАналитики.Сортировать("КодГруппыРаскрытия,КодВидаАналитики");
	
	Для каждого СтрокаТаблицы Из ТаблицаАналитики Цикл
		
		СтрокаГруппыРаскрытия = ТаблицаФормы.Найти(СтрокаТаблицы.ГруппаРаскрытия, "ГруппаРаскрытия");
		
		Если СтрокаГруппыРаскрытия = Неопределено Тогда
			
			СтрокаГруппыРаскрытия = ТаблицаФормы.Добавить();
			СтрокаГруппыРаскрытия.ГруппаРаскрытия = СтрокаТаблицы.Группараскрытия;
			
		КонецЕсли;
		
		// В значение записывается код вида аналитики в ПВХ, а в представление код аналитики в таблице раскрытия
		РеквизитыАналитики = Новый Структура("ТипЗначения,ВидКлассификатораБК",СтрокаТаблицы.ТипЗначения,СтрокаТаблицы.ВидКлассификатораБК);
		ТипАналитики = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаТаблицы.ВидАналитики, РеквизитыАналитики);
		Если ТипАналитики.СодержитТип(Тип("СправочникСсылка.ГруппыПодвидовКДБ")) Тогда
			
			ИмяСписка = "СписокЗначенийГруппаПодвидаКДБ";
			ПолеКодаАналитики = "АналитикаГруппаПодвидаКДБ";
			ПолеИмениОбъекта = "АналитикаТаблицыРаскрытияГруппаПодвидаКДБ";
			
		ИначеЕсли ТипАналитики.СодержитТип(Тип("СправочникСсылка.ВидыДоходовКДБ")) Тогда
			
			ИмяСписка = "СписокЗначенийВидДоходаКДБ";
			ПолеКодаАналитики = "АналитикаВидДоходаКДБ";
			ПолеИмениОбъекта = "АналитикаТаблицыРаскрытияВидДоходаКДБ";
			
		ИначеЕсли ТипАналитики.СодержитТип(Тип("СправочникСсылка.КОСГУ")) Тогда
			
			ИмяСписка = "СписокЗначенийКОСГУ";
			ПолеКодаАналитики = "АналитикаКОСГУ";
			ПолеИмениОбъекта = "АналитикаТаблицыРаскрытияКОСГУ";
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		СтрокаГруппыРаскрытия[ИмяСписка].Добавить(СтрокаТаблицы.КодВидаАналитики, СтрокаТаблицы.ИмяОбъектаАналитики);
		
		Если ПустаяСтрока(СтрокаГруппыРаскрытия[ПолеКодаАналитики]) ИЛИ ПустаяСтрока(СтрокаГруппыРаскрытия[ПолеИмениОбъекта]) Тогда
			
			СтрокаГруппыРаскрытия[ПолеКодаАналитики] = СтрокаТаблицы.КодВидаАналитики;
			СтрокаГруппыРаскрытия[ПолеИмениОбъекта] = СтрокаТаблицы.ИмяОбъектаАналитики;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Заполнение значений параметров
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыМетода) Тогда
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("ГрафаОтчета",ЗначениеПараметра) Тогда
			ГрафаОтчета = ЗначениеПараметра;
		КонецЕсли;
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("ТаблицаСоответствияАналитик",ЗначениеПараметра) Тогда
			
			Если ТипЗнч(ЗначениеПараметра) = Тип("ТаблицаЗначений") Тогда
				
				Для каждого СтрокаТаблицы Из ЗначениеПараметра Цикл
					
					ПараметрыПоиска = Новый Структура("ГруппаРаскрытия", СтрокаТаблицы.ГруппаРаскрытия);
					
					НайденныеСтроки = ТаблицаФормы.НайтиСтроки(ПараметрыПоиска);
					Для каждого СтрокаТаблицыФормы Из НайденныеСтроки Цикл
						
						// Список значений выбора не заполняем так как он уже заполнен доступными значениями
						ЗаполнитьЗначенияСвойств(СтрокаТаблицыФормы, СтрокаТаблицы);
						СтрокаТаблицыФормы.Заполнять = Истина;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Заполнение списка выбора реквизита ГрафаОтчета
	ТипСтрока = Перечисления.ТипыЗначенийПоказателейОтчетов.Строка;
	КолонкиОтчета = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьКолонкиВидаОтчета(ВидОтчета, ТипСтрока);
	Для каждого СтрокаТаблицы Из КолонкиОтчета Цикл
		
		Элементы.ГрафаОтчета.СписокВыбора.Добавить(СтрокаТаблицы.Код, СтрокаТаблицы.Представление);
		
	КонецЦикла;
	
	Если ПустаяСтрока(ГрафаОтчета) И КолонкиОтчета.Количество() = 1 Тогда
		
		ГрафаОтчета = Элементы.ГрафаОтчета.СписокВыбора[0].Значение;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТаблицаФормы, "ТаблицаСоответствияАналитик");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОЙ ЧАСТИ ТаблицаСоответствияАналитик

&НаКлиенте
Процедура ТаблицаСоответствияАналитикАналитикаГруппаПодвидаКДБОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные;
	СписокАналитик = ТекущиеДанные.СписокЗначенийГруппаПодвидаКДБ;
	
	ЭлементСпискаАналитик = СписокАналитик.НайтиПоЗначению(ВыбранноеЗначение);
	
	Если ЭлементСпискаАналитик <> Неопределено Тогда
		
		Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.АналитикаГруппаПодвидаКДБ = ВыбранноеЗначение;
		Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.АналитикаТаблицыРаскрытияГруппаПодвидаКДБ = ЭлементСпискаАналитик.Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствияАналитикАналитикаВидДоходаКДБОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные;
	СписокАналитик = ТекущиеДанные.СписокЗначенийВидДоходаКДБ;
	
	ЭлементСпискаАналитик = СписокАналитик.НайтиПоЗначению(ВыбранноеЗначение);
	
	Если ЭлементСпискаАналитик <> Неопределено Тогда
		
		Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.АналитикаВидДоходаКДБ = ВыбранноеЗначение;
		Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.АналитикаТаблицыРаскрытияВидДоходаКДБ = ЭлементСпискаАналитик.Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствияАналитикАналитикаКОСГУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные;
	СписокАналитик = ТекущиеДанные.СписокЗначенийКОСГУ;
	
	ЭлементСпискаАналитик = СписокАналитик.НайтиПоЗначению(ВыбранноеЗначение);
	
	Если ЭлементСпискаАналитик <> Неопределено Тогда
		
		Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.АналитикаКОСГУ = ВыбранноеЗначение;
		Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.АналитикаТаблицыРаскрытияКОСГУ = ЭлементСпискаАналитик.Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСоответствияАналитикПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элементы.ТаблицаСоответствияАналитикАналитикаГруппаПодвидаКДБ.СписокВыбора.Очистить();
	Для каждого ЭлементСписка Из Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.СписокЗначенийГруппаПодвидаКДБ Цикл
		Элементы.ТаблицаСоответствияАналитикАналитикаГруппаПодвидаКДБ.СписокВыбора.Добавить(ЭлементСписка.Значение,ЭлементСписка.Значение);
	КонецЦикла;
	
	Элементы.ТаблицаСоответствияАналитикАналитикаВидДоходаКДБ.СписокВыбора.Очистить();
	Для каждого ЭлементСписка Из Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.СписокЗначенийВидДоходаКДБ Цикл
		Элементы.ТаблицаСоответствияАналитикАналитикаВидДоходаКДБ.СписокВыбора.Добавить(ЭлементСписка.Значение,ЭлементСписка.Значение);
	КонецЦикла;
	
	Элементы.ТаблицаСоответствияАналитикАналитикаКОСГУ.СписокВыбора.Очистить();
	Для каждого ЭлементСписка Из Элементы.ТаблицаСоответствияАналитик.ТекущиеДанные.СписокЗначенийКОСГУ Цикл
		Элементы.ТаблицаСоответствияАналитикАналитикаКОСГУ.СписокВыбора.Добавить(ЭлементСписка.Значение,ЭлементСписка.Значение);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = СохранитьПараметры();
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить параметры'"));
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт
	
	Возврат СохранитьПараметры(); 
	
КонецФункции	

&НаКлиенте
Функция СохранитьПараметры()
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		// Список выбора не нужен в качестве параметра
		ТаблицаФормы = РеквизитФормыВЗначение("ТаблицаСоответствияАналитик");
		ТаблицаФормы.Колонки.Удалить("СписокЗначенийВидДоходаКДБ");
		ТаблицаФормы.Колонки.Удалить("СписокЗначенийГруппаПодвидаКДБ");
		ТаблицаФормы.Колонки.Удалить("СписокЗначенийКОСГУ");
		
		ПараметрыПоиска = Новый Структура("Заполнять", Истина);
		НайленныеСтроки = ТаблицаФормы.НайтиСтроки(ПараметрыПоиска);
		
		ТаблицаСоответствия = ТаблицаФормы.Скопировать(НайленныеСтроки);
		
		Если ТаблицаСоответствия.Количество() = 0 Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Отметьте строки для заполнения наименования'"),,"Элементы.ТаблицаСоответствияАналитик");
			
			Возврат Ложь;
			
		КонецЕсли;
		
		ТаблицаСоответствия.Колонки.Удалить("Заполнять");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ГрафаОтчета", ГрафаОтчета);
		СтруктураПараметров.Вставить("ТаблицаСоответствияАналитик", ТаблицаСоответствия);
		
		ПредставлениеПараметров(ТаблицаСоответствия);
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров(Знач ТаблицаСоответствия)
	
	ПредставлениеПараметров = "" + ГрафаОтчета + " (";
	
	СтрокаРазделитель = "";
	Для каждого СтрокаТаблицы Из ТаблицаСоответствия Цикл
		
		КодГруппы =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.ГруппаРаскрытия,"Код");
		ПредставлениеПараметров = ПредставлениеПараметров + СтрокаРазделитель + КодГруппы;
		
		СтрокаРазделитель = ",";
		
	КонецЦикла;
	
	ПредставлениеПараметров = ПредставлениеПараметров + ")";
	
КонецПроцедуры




