
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ИдентификаторДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Параметры.ИдентификаторДокумента);
	
	ТипПС = ПланыСчетов.ТипВсеСсылки();
	Для каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = ТекРеквизит.Тип.Типы();
		Если ТипыРеквизита.Количество()>0 Тогда
			Если ТипПС.СодержитТип(ТипыРеквизита[0]) Тогда
				РеквизитыДокумента.Добавить("Объект." + ТекРеквизит.Имя, ТекРеквизит.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекДопРеквизит Из Параметры.ДополнительныеРеквизиты Цикл
		ТекДопРеквизитЗначение = ТекДопРеквизит.Значение;		
		Если ТипЗнч(ТекДопРеквизитЗначение) = Тип("Строка") Тогда
			РеквизитыДокумента.Добавить(ТекДопРеквизитЗначение);
		ИначеЕсли ТипЗнч(ТекДопРеквизитЗначение) = Тип("Структура") Тогда
			Если ТипЗнч(ТекДопРеквизитЗначение.ТипЗначения) = Тип("ОписаниеТипов") Тогда
				Если ТипПС.СодержитТип(ТекДопРеквизитЗначение.ТипЗначения.Типы()[0]) Тогда
					РеквизитыДокумента.Добавить(ТекДопРеквизитЗначение.ИмяРеквизита);
				КонецЕсли;
			ИначеЕсли ТипЗнч(ТекДопРеквизитЗначение.ТипЗначения) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыОпераций") Тогда
				Если ТипПС.СодержитТип(ТекДопРеквизитЗначение.ТипЗначения.ТипЗначения.Типы()[0]) Тогда
					РеквизитыДокумента.Добавить(ТекДопРеквизитЗначение.ИмяРеквизита);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
			
		
		//Если ТекДопРеквизит.РеквизитПроводки.ТипЗначения = ТипПС Тогда
//			РеквизитыДокумента.Добавить(ТекДопРеквизит.Значение);
		//КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.ТабличнаяЧасть) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КолонкиДополнительныхТабличныхЧастей.Наименование КАК ЗаголовокРеквизита,
		               |	КолонкиДополнительныхТабличныхЧастей.ИмяКолонки КАК ИмяРеквизита,
		               |	КолонкиДополнительныхТабличныхЧастей.ОписаниеТипаКолонки.ТипЗначения КАК ТипЗначения,
		               |	КолонкиДополнительныхТабличныхЧастей.Владелец.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
		               |	ВЫБОР
		               |		КОГДА КолонкиДополнительныхТабличныхЧастей.Владелец.ПредопределеннаяТабличнаяЧасть
		               |			ТОГДА ""Объект.""
		               |		ИНАЧЕ """"
		               |	КОНЕЦ КАК Префикс
		               |ИЗ
		               |	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
		               |ГДЕ
		               |	КолонкиДополнительныхТабличныхЧастей.Владелец = &ТабличнаяЧасть
		               |	И НЕ КолонкиДополнительныхТабличныхЧастей.ЭтоГруппа
		               |	И НЕ КолонкиДополнительныхТабличныхЧастей.ПометкаУдаления
		               |	И КолонкиДополнительныхТабличныхЧастей.Ссылка <> &ТекущаяКолонка
		               |	И КолонкиДополнительныхТабличныхЧастей.ОписаниеТипаКолонки <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ДополнительныеРеквизитыОпераций.ПустаяСсылка)";
		Запрос.УстановитьПараметр("ТабличнаяЧасть", Параметры.ТабличнаяЧасть);					   
		Запрос.УстановитьПараметр("ТекущаяКолонка", Параметры.ТекущаяКолонка);					   
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ТипЗначения.Типы().Количество()=1 И
				ТипПС.СодержитТип(Выборка.ТипЗначения.Типы()[0]) Тогда
				РеквизитыДокумента.Добавить(Выборка.Префикс + Выборка.ИмяТабличнойЧасти + "." + Выборка.ИмяРеквизита);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Параметры.ТекущаяСвязь) Тогда
		ИмяСвязи = Лев(Параметры.ТекущаяСвязь, Найти(Параметры.ТекущаяСвязь,"(")-1);
		ТекЭлементСписка = РеквизитыДокумента.НайтиПоЗначению(ИмяСвязи);
		Если ТекЭлементСписка<>Неопределено Тогда
			Элементы.РеквизитыДокумента.ТекущаяСтрока = ТекЭлементСписка.ПолучитьИдентификатор();
			ЭлементСвязи = Число(Сред(Параметры.ТекущаяСвязь, Найти(Параметры.ТекущаяСвязь,"(")+1,1));
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ,  ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);	

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ВыбратьИЗакрыть();

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Модифицированность = Ложь;
	
	Если Элементы.РеквизитыДокумента.ТекущиеДанные <> Неопределено Тогда
		Результат = Элементы.РеквизитыДокумента.ТекущиеДанные.Значение+"("+ЭлементСвязи+")";
		ОповеститьОВыборе(Результат);
	Иначе
		Закрыть();	
	КонецЕсли;
	
КонецПроцедуры
