#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Параметры.Свойство("ОбъектНФА") Тогда
			Объект.ОбъектНФА = Параметры.ОбъектНФА;
		КонецЕсли;		
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			Объект.Наименование = "";
		КонецЕсли;	
	КонецЕсли;
	
	ВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = НаименованиеДанныхОДрагМатериалахПоПаспортуДляОбъектаНФА();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьДрагМатериалы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ЗаполнитьПоВыбранномуОбъектуНФА(ВыбранноеЗначение);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПодетальнаяИнформацияПриИзменении(Элемент)

	ВидимостьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДрагМатериалы

&НаКлиенте
Процедура ДрагМатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
    Если НоваяСтрока И Не Копирование Тогда
        ТекСтрока = Элементы.ДрагМатериалы.ТекущиеДанные;
        ТекСтрока.ЕдИзм = ЕдиницыИзмеренияДрагМатериалов(ТекСтрока.ВидДрагМатериала);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДрагМатериалыВидДрагМатериалаПриИзменении(Элемент)
	ТекСтрока = Элементы.ДрагМатериалы.ТекущиеДанные;
	ТекСтрока.ЕдИзм = ЕдиницыИзмеренияДрагМатериалов(ТекСтрока.ВидДрагМатериала);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДрагМатериалыКоличествоДеталейПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ДрагМатериалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДрагМатериалыМассаДМВДеталиПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ДрагМатериалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДрагМатериалыКоличествоДМВДеталиПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ДрагМатериалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ДрагМатериалыЛигатурнаяМассаДеталиПриИзменении(Элемент)
	РассчитатьСтроку(Элементы.ДрагМатериалы.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИтоговуюИнформацию(Команда)
	Объект.Наименование = НаименованиеДанныхОДрагМатериалахПоПаспортуДляОбъектаНФА();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымДругогоОбъектаНФА(Команда)
	ПараметрыОтбора = Новый Структура("ОбъектНФА", Объект.ОбъектНФА);

	ОткрытьФорму("Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаВыбора", ПараметрыОтбора, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымУчетаДрагМатериалов(Команда)
	ЗаполнитьПоДаннымУчетаДрагМатериаловНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕдиницыИзмеренияДрагМатериалов(ДрагМатериал)
	Если УчетДрагМатериалов.ЭтоДрагКамень(ДрагМатериал) Тогда
		Возврат УчетДрагМатериалов.Караты();
	Иначе
		Возврат УчетДрагМатериалов.Граммы();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РассчитатьСтроку(ТекСтрока)
	ТекСтрока.МассаДМ = ТекСтрока.КоличествоДеталей * ТекСтрока.МассаДМВДетали;
	ТекСтрока.ЛигатурнаяМасса = ТекСтрока.КоличествоДеталей * ТекСтрока.ЛигатурнаяМассаДетали;
	ТекСтрока.КоличествоДМ = ТекСтрока.КоличествоДеталей * ТекСтрока.КоличествоДМВДетали;
КонецПроцедуры

&НаСервере
Функция НаименованиеДанныхОДрагМатериалахПоПаспортуДляОбъектаНФА() Экспорт
	Результат = "";
		
	ШаблонСтрокиОбщий = НСтр("ru = '%1 %2'");
	ШаблонСтроки = НСтр("ru = '%1: %2 %3'");
	ШаблонСтрокиСКоличеством = НСтр("ru = '%1: %2 %3: %4 шт. '");
	ИтогиДрагМатериалов = Объект.ДрагМатериалы.Выгрузить();
	ИтогиДрагМатериалов.Свернуть("ВидДрагМатериала, ЕдИзм", "МассаДМ, КоличествоДМ");
	Для Каждого ТекСтрока Из ИтогиДрагМатериалов Цикл
		ЕдИзм = "<без ед.>";
		Если ЗначениеЗаполнено(ТекСтрока.ЕдИзм) Тогда
			ЕдИзм = ТекСтрока.ЕдИзм;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекСтрока.КоличествоДМ) Тогда
			НаименованиеСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиСКоличеством,
				Нрег(ТекСтрока.ВидДрагМатериала), ТекСтрока.МассаДМ, ЕдИзм, ТекСтрока.КоличествоДМ);
		Иначе	
			НаименованиеСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки,
				Нрег(ТекСтрока.ВидДрагМатериала), ТекСтрока.МассаДМ, ЕдИзм);
		КонецЕсли;	
		Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиОбщий, 
			Результат, НаименованиеСтрока);
	КонецЦикла;
	
	Возврат СокрЛП(Результат);	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоВыбранномуОбъектуНФА(ВыбранноеЗначение)
	
	Реквизиты = "Основание, НомерОснования, ДатаОснования, ПодетальнаяИнформация, Комментарий";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбранноеЗначение, Реквизиты);
	
	КопияДрагМатериалы = ВыбранноеЗначение.ДрагМатериалы.Выгрузить();
	Объект.ДрагМатериалы.Загрузить(КопияДрагМатериалы);
	
	Объект.Основание = ЗначенияРеквизитов.Основание;
	Объект.НомерОснования = ЗначенияРеквизитов.НомерОснования;
	Объект.ДатаОснования = ЗначенияРеквизитов.ДатаОснования;
	Объект.Комментарий = ЗначенияРеквизитов.Комментарий;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьЭлементовФормы(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьПоДетальногоУчета = Объект.ПодетальнаяИнформация;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДрагМатериалыДеталь", "Видимость", ВидимостьПоДетальногоУчета);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДрагМатериалыКоличествоДеталей", "Видимость", ВидимостьПоДетальногоУчета);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДрагМатериалыМассаДМВДетали", "Видимость", ВидимостьПоДетальногоУчета);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДрагМатериалыЛигатурнаяМассаДетали", "Видимость", ВидимостьПоДетальногоУчета);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДрагМатериалыКоличествоДМВДетали", "Видимость", ВидимостьПоДетальногоУчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымУчетаДрагМатериаловНаСервере()
	Если ЗначениеЗаполнено(Объект.ОбъектНФА) Тогда
		ОбъектНФАЭтоОС = Ложь;
		Объект.ПодетальнаяИнформация = Ложь;
		ТекОрганизация = ОбщегоНазначенияБГУ.ТекущаяОрганизация();
		ПериодОстатковДМ = ТекущаяДата();
		ТаблицаОбъектовНФА = Новый ТаблицаЗначений;
		Если ТипЗнч(Объект.ОбъектНФА) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
			ТаблицаОбъектовНФА.Колонки.Добавить("ОбъектНФА", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
			ОбъектНФАЭтоОС = Истина;
		Иначе
			ТаблицаОбъектовНФА.Колонки.Добавить("ОбъектНФА", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		КонецЕсли;
		ТаблицаОбъектовНФА.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ТаблицаОбъектовНФА.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
		НоваяСтрока = ТаблицаОбъектовНФА.Добавить();
		НоваяСтрока.ОбъектНФА = Объект.ОбъектНФА;
		НоваяСтрока.Количество = 1;
		
		Если ОбъектНФАЭтоОС Тогда
			НоваяСтрока.ИнвНомер = ПервыйИнвентарныйНомерОС(Объект.ОбъектНФА);
			СтруктураДанныхОС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ОбъектНФА, "ИмуществоКазны");
			
			ОстаткиДМ = УчетДрагМатериалов.ЗаполнитьДМДляСписанияОС(ТекОрганизация, ТаблицаОбъектовНФА, ПериодОстатковДМ, СтруктураДанныхОС.ИмуществоКазны);
		Иначе	
			НоваяСтрока.ИнвНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
			ОстаткиДМ = УчетДрагМатериалов.ЗаполнитьДМДляСписанияМЗ(ТекОрганизация, ТаблицаОбъектовНФА, ПериодОстатковДМ);
		КонецЕсли;
		Объект.ДрагМатериалы.Очистить();
		Для Каждого ТекСтрока Из ОстаткиДМ Цикл
			НоваяСтрока = Объект.ДрагМатериалы.Добавить();
			НоваяСтрока.ВидДрагМатериала = ТекСтрока.ВидДрагМатериала;
			НоваяСтрока.ЕдИзм = ТекСтрока.ЕдИзм;
			НоваяСтрока.МассаДМ = ТекСтрока.МассаДМ;
			НоваяСтрока.КоличествоДМ = ТекСтрока.КоличествоДМ;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПервыйИнвентарныйНомерОС(ОсновноеСредство)
	Результат = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИнвентарныеНомераОС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	               |ГДЕ
	               |	ИнвентарныеНомераОС.Владелец = &ОсновноеСредство
	               |	И ИнвентарныеНомераОС.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли;	

	Возврат Результат;
КонецФункции

#КонецОбласти

