#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Перем УчетПоПодразделениям; // Признак учета по подразделениям на выбранном счете
	Перем ПредставлениеПериода; // Строковое представление периода отчета
	
	// Программное выполнение отчета
	СтандартнаяОбработка = Ложь;
	ИсполняемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрыОтчета = ИсполняемыеНастройки.ПараметрыДанных;
	
	УстановитьПараметры(ИсполняемыеНастройки, ПараметрыОтчета, УчетПоПодразделениям, ПредставлениеПериода);
	УстановитьОтборы(ИсполняемыеНастройки, ПараметрыОтчета, УчетПоПодразделениям);
	
	ДоработатьТекстЗапроса(СхемаКомпоновкиДанных, УчетПоПодразделениям);

	Если ЗначениеПараметра(ПараметрыОтчета, "ВыводитьТитульныйЛист") = Истина Тогда
		
		ВывестиТитульныйЛист(ДокументРезультат, ИсполняемыеНастройки, ПараметрыОтчета, ПредставлениеПериода);
	
	КонецЕсли;
	
	УдаляемыеПараметры = Новый Массив;
	Для Каждого ТекПараметр Из СхемаКомпоновкиДанных.Параметры Цикл
		
		// Удалить только не установленные параметры, кроме параметров "Период" и "Счет"
		
		Если ТекПараметр.Имя = "Период"
			ИЛИ ТекПараметр.Имя = "Счет" Тогда
			Продолжить;
		КонецЕсли;
		
		УдаляемыеПараметры.Добавить(ТекПараметр.Заголовок);
		
	КонецЦикла;
	
	// Вывести отчет
	
	КомпоновщикМакетаКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКомпоновкиДанных, ИсполняемыеНастройки, ДанныеРасшифровки);
	
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД, Неопределено, ДанныеРасшифровки, Истина);
		
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.НачатьВывод();

	ОтчетПустой = Истина;
	ПроверятьВыводПараметров = Истина;
	Пока Истина Цикл
		
		ЭлементРезультата = ПроцессорКД.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		Иначе
			
			// Удалить лишние параметры отчета, если выводится область СКД "Параметры"
			Если ПроверятьВыводПараметров
				И ЭлементРезультата.ТипЭлемента = ТипЭлементаРезультатаКомпоновкиДанных.Начало
				И ЭлементРезультата.Макеты.Количество() > 0 Тогда
				
				Если УдалитьПараметрыИзМакетов(ЭлементРезультата, УдаляемыеПараметры) Тогда
					ПроверятьВыводПараметров = Ложь;
				КонецЕсли;
				
			КонецЕсли;
			
			// Проверить, что отчет содержит данные
			Если ОтчетПустой Тогда
				Для Каждого ЗначениеПараметраМакета Из ЭлементРезультата.ЗначенияПараметров Цикл
					Попытка
						Если ЗначениеЗаполнено(ЗначениеПараметраМакета.Значение) Тогда
							ОтчетПустой = Ложь;
							Прервать;
						КонецЕсли;
					Исключение
						// Исключение обрабатывать не требуется
					КонецПопытки;
				КонецЦикла;
			КонецЕсли;
			
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		КонецЕсли;
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();
	
	// Сохранить признак ОтчетПустой для подсистемы Рассылка отчетов
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетПустой", ОтчетПустой);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПараметры(ИсполняемыеНастройки, ПараметрыОтчета, УчетПоПодразделениям, ПредставлениеПериода)
	
	ВыбранныйПериодОтчета = ЗначениеПараметра(ПараметрыОтчета, "Период");
	
	ПредставлениеПериода = СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		ВыбранныйПериодОтчета.ДатаНачала,ВыбранныйПериодОтчета.ДатаОкончания);
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(ИсполняемыеНастройки, "ТекстОборота",
		СтрШаблон(НСтр("ru = 'Оборот %1'"), СокрЛ(ПредставлениеПериода)));
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(ИсполняемыеНастройки, "КонецПериодаПлюсОдин",
		ВыбранныйПериодОтчета.ДатаОкончания + 86400);
		
	ПараметрСчет = ЗначениеПараметра(ПараметрыОтчета, "Счет");
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(ИсполняемыеНастройки, "СчетАктивный",
		ПараметрСчет.Вид <> ВидСчета.Пассивный);
	
	УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета(ПараметрСчет.Код).УчетПоПодразделениям;
	
КонецПроцедуры

Процедура УстановитьОтборы(ИсполняемыеНастройки, ПараметрыОтчета, УчетПоПодразделениям)
	
	Если НЕ УстановленОтборПоПолю(ИсполняемыеНастройки, "Организация") Тогда
		ВыбраннаяОрганизация = ЗначениеПараметра(ПараметрыОтчета, "Организация");
		Если ЗначениеЗаполнено(ВыбраннаяОрганизация) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ИсполняемыеНастройки.Отбор, "Организация",
				ВыбраннаяОрганизация, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		КонецЕсли;
	КонецЕсли;
	Если НЕ УстановленОтборПоПолю(ИсполняемыеНастройки, "Подразделение") Тогда
		ВыбранноеПодразделение = ПараметрыОтчета.НайтиЗначениеПараметра(
			Новый ПараметрКомпоновкиДанных("Подразделение")).Значение;
		Если УчетПоПодразделениям И ЗначениеЗаполнено(ВыбранноеПодразделение) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ИсполняемыеНастройки.Отбор, "Подразделение",
				ВыбранноеПодразделение, ВидСравненияКомпоновкиДанных.ВИерархии,, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДоработатьТекстЗапроса(СхемаКомпоновкиДанных, УчетПоПодразделениям)
	
	ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстаткиИОбороты.ИФО",
			"ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");
	КонецЕсли;
	
	Если УчетПоПодразделениям Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстаткиИОбороты.Подразделение",
			"ЕСТЬNULL(ЕПСБУОстаткиИОбороты.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЕПСБУОстаткиИОбороты.Подразделение",
			"ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)");
	КонецЕсли;
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = ТекстЗапроса;
	
КонецПроцедуры

Процедура ВывестиТитульныйЛист(ДокументРезультат, ИсполняемыеНастройки, ПараметрыОтчета, ПредставлениеПериода)
	
	Организация = ЗначениеПараметра(ПараметрыОтчета, "Организация");
	
	Форма103н = ЗначениеПараметра(ПараметрыОтчета, "Форма103н") = Истина;
	Если Форма103н Тогда
		ИмяМакетаШапки = "ПФ_MXL_МакетШапки_103н";
	Иначе
		ИмяМакетаШапки = "ПФ_MXL_МакетШапки";
	КонецЕсли;

	МакетШапки = УправлениеПечатью.МакетПечатнойФормы("Отчет.ОборотнаяВедомостьПоНФА0504035." + ИмяМакетаШапки);
	ОбластьШапка = МакетШапки.ПолучитьОбласть("Заголовок");
	
	ПараметрыШапки = Новый Структура("Организация,ОКПО,ДатаЗаполнения,Подразделение,ЦМО,Счет,Период,ЗаголовокМОЛ");
	
	Форма194н = ЗначениеПараметра(ПараметрыОтчета, "Форма194н") = Истина;
	Если Форма194н ИЛИ Форма103н Тогда
		ПараметрыШапки.ЗаголовокМОЛ = "Ответственное(-ые) лицо(-а)";
	Иначе
		ПараметрыШапки.ЗаголовокМОЛ = "Материально ответственное лицо";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
			"НаименованиеПолное, КодОКПО");
		ПараметрыШапки.Организация = РеквизитыОрганизации.НаименованиеПолное;
		ПараметрыШапки.ОКПО = РеквизитыОрганизации.КодОКПО;
	КонецЕсли;
	
	ДатаЗаполнения = ЗначениеПараметра(ПараметрыОтчета, "ДатаЗаполнения");
	Если ТипЗнч(ДатаЗаполнения) <> Тип("Дата") Тогда
		ДатаЗаполнения = Дата(ДатаЗаполнения);
	КонецЕсли;
	ПараметрыШапки.ДатаЗаполнения   = ДатаЗаполнения;
	
	Подразделение = ЗначениеПараметра(ПараметрыОтчета, "Подразделение");
	Если ЗначениеЗаполнено(Подразделение) Тогда
		РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение,
			"Наименование, НаименованиеПолное, ОбособленноеПодразделение");
		ПараметрыШапки.Подразделение = ?(РеквизитыПодразделения.ОбособленноеПодразделение,
			РеквизитыПодразделения.НаименованиеПолное, РеквизитыПодразделения.Наименование);
	КонецЕсли;
	
	Счет = ЗначениеПараметра(ПараметрыОтчета, "Счет");
	ПараметрыШапки.Счет   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "Код");
	ПараметрыШапки.Период = ПредставлениеПериода;
	ПараметрыШапки.ЦМО    = ЗначениеЦМООтбор(ИсполняемыеНастройки.Отбор);
	
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ДокументРезультат.Вывести(ОбластьШапка);
	
	ОбластьПодвал = МакетШапки.ПолучитьОбласть("Подвал");
	ПараметрыПодвала = Новый Структура("ДатаЗаполнения,Исполнитель,Должность,ТелефонИсполнителя,ЭлАдресИсполнителя");
	
	ПараметрыПодвала.ДатаЗаполнения = ДатаЗаполнения;
	
	ИсполнительПечать = ЗначениеПараметра(ПараметрыОтчета, "ИсполнительПечать");
	Если ЗначениеЗаполнено(ИсполнительПечать) Тогда
		ПараметрыПодвала.Исполнитель = Справочники.Сотрудники.ФамилияИО(ИсполнительПечать);
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект,Период,Должность", ИсполнительПечать, ДатаЗаполнения);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, , Форма103н);
		ПараметрыПодвала.Должность = ДанныеСотрудника.Должность;
		Если Форма103н Тогда
			ПараметрыПодвала.ТелефонИсполнителя = ДанныеСотрудника.ТелефонРабочийФизическиеЛица;
			ПараметрыПодвала.ЭлАдресИсполнителя = ДанныеСотрудника.EmailФизическиеЛица;
		КонецЕсли;
	КонецЕсли;
	
	ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
	ДокументРезультат.Вывести(ОбластьПодвал);
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

Функция ЗначениеПараметра(ПараметрыОтчета, ИмяПараметра)
	Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если Параметр = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Параметр.Значение;
	КонецЕсли;
КонецФункции

Функция УдалитьПараметрыИзМакетов(ЭлементРезультата, УдаляемыеПараметры)
	
	ПроверятьВыводПараметров = Истина;
	
	Для Каждого ТекМакет Из ЭлементРезультата.Макеты Цикл
		
		Если ЭтоМакетПараметров(ТекМакет, ПроверятьВыводПараметров) Тогда
			УдалитьНеВыводимыеПараметрыИзМакета(ТекМакет, УдаляемыеПараметры);
			Возврат Истина;
		КонецЕсли;
		
		Если Не ПроверятьВыводПараметров Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ЭтоМакетПараметров(ТекМакет, ПроверятьВыводПараметров)
	
	Если ТипЗнч(ТекМакет.Макет) <> Тип("МакетОбластиКомпоновкиДанных") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТекМакет.Макет Цикл
		
		Для Каждого Ячейка Из СтрокаТаблицы.Ячейки Цикл
			
			Для Каждого Элемент Из Ячейка.Элементы Цикл
				
				Значение = Элемент.Значение;
				
				Если ТипЗнч(Значение) = Тип("ПараметрКомпоновкиДанных") Тогда
					ПроверятьВыводПараметров = Ложь;
					Возврат Ложь;
				КонецЕсли;
				
				Если ТипЗнч(Значение) = Тип("Строка") И СокрЛП(Значение) = "Параметры:" Тогда
					Возврат Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура УдалитьНеВыводимыеПараметрыИзМакета(ТекМакет, УдаляемыеПараметры)
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТекМакет.Макет Цикл
		
		СтрокаКУдалению = Ложь;
		Для Каждого Ячейка Из СтрокаТаблицы.Ячейки Цикл
			
			Для Каждого Элемент Из Ячейка.Элементы Цикл
				
				Значение = СокрЛП(Элемент.Значение);
				
				Для Каждого УдаляемыйПараметр Из УдаляемыеПараметры Цикл
					
					Если СтрНачинаетсяС(Значение, УдаляемыйПараметр) Тогда
						СтрокиКУдалению.Добавить(СтрокаТаблицы);
						УдаляемыеПараметры.Удалить(УдаляемыеПараметры.Найти(УдаляемыйПараметр));
						Продолжить;
					КонецЕсли;
					
				КонецЦикла;
				//
				//Если Значение = "Подразделение:" Тогда
				//	СтрокиКУдалению.Добавить(СтрокаТаблицы);
				//ИначеЕсли СтрНачинаетсяС(Значение, "Исполнитель:") Тогда
				//	СтрокиКУдалению.Добавить(СтрокаТаблицы);
				//ИначеЕсли СтрНачинаетсяС(Значение, "Дата заполнения:") Тогда
				//	СтрокиКУдалению.Добавить(СтрокаТаблицы);
				//ИначеЕсли СтрНачинаетсяС(Значение, "Форма по приказу 194н:") Тогда
				//	СтрокиКУдалению.Добавить(СтрокаТаблицы);
				//ИначеЕсли СтрНачинаетсяС(Значение, "Выводить титульный лист:") Тогда
				//	СтрокиКУдалению.Добавить(СтрокаТаблицы);
				//КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
		
	Для Каждого ТекСтрокаКУдалению Из СтрокиКУдалению Цикл
		ТекМакет.Макет.Удалить(ТекСтрокаКУдалению);
	КонецЦикла;
	
КонецПроцедуры

Функция УстановленОтборПоПолю(ИсполняемыеНастройки, ИмяПоля)
	
	Результат = Ложь;
	ЭлементыОтбора = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(ИсполняемыеНастройки.Отбор, ИмяПоля);
	Для Каждого ТекЭлемент Из ЭлементыОтбора Цикл
		Если ТекЭлемент.Использование Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеЦМООтбор(Отбор)
	Элементы = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(Отбор, "Субконто2");
	
	Для каждого Элемент из Элементы цикл
		Если Элемент.Использование тогда
			Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("СправочникСсылка.ЦМО") Тогда
				Возврат Элемент.ПравоеЗначение.Сотрудник;
			ИначеЕсли ТипЗнч(Элемент.ПравоеЗначение) = Тип("СписокЗначений") Тогда
				
				ДанныеЦМО = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
					Элемент.ПравоеЗначение.ВыгрузитьЗначения(), "Сотрудник", Истина);
				
				МассивЦМО = Новый Массив;
				Для Каждого ЦМО из Элемент.ПравоеЗначение цикл
					ТекСотрудник = ДанныеЦМО.Получить(ЦМО.Значение);
					Если ТекСотрудник <> Неопределено Тогда
						МассивЦМО.Добавить(Справочники.Сотрудники.ФамилияИО(ТекСотрудник));
					КонецЕсли;
				КонецЦикла;
				Возврат СтрСоединить(МассивЦМО, ", ");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат "";
КонецФункции

#КонецОбласти

#КонецЕсли