
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Элементы.ОтборВладелец.ТолькоПросмотр = Истина;
		Элементы.ОтборВладелец.КнопкаОткрытия = Ложь;
		ОтборВладелец = Параметры.Отбор.Владелец;
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборВладелецПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ОтборВладелец,,, ЗначениеЗаполнено(ОтборВладелец));
	Элементы.Владелец.Видимость = НЕ ЗначениеЗаполнено(ОтборВладелец);
КонецПроцедуры
