////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Ребенок", ОтборРебенок) Тогда
		
		Параметры.Свойство("Ребенок", ОтборРебенок);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборРебенок) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ребенок", ОтборРебенок,,, ЗначениеЗаполнено(ОтборРебенок));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "Ребенок", ОтборРебенок,,, ЗначениеЗаполнено(ОтборРебенок));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокРебенок", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияРебенок", "Видимость", Ложь);
		
		ОтборОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтборРебенок, "Организация");
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокОрганизация", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияОрганизация", "Видимость", Ложь);
		
		Элементы.ОтборРебенок.ТолькоПросмотр 		= Истина;
		Элементы.ОтборОрганизация.ТолькоПросмотр  	= Истина;

	КонецЕсли;	
	
	Если НЕ Параметры.Отбор.Свойство("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения) Тогда
		
		Параметры.Свойство("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения)
		
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокГруппаДетскогоУчреждения", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияГруппаДетскогоУчреждения", "Видимость", Ложь);
		
		ОтборОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтборГруппаДетскогоУчреждения, "Владелец");
        ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокОрганизация", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияОрганизация", "Видимость", Ложь);
		
		Элементы.ОтборГруппаДетскогоУчреждения.ТолькоПросмотр 	= Истина;
		Элементы.ОтборОрганизация.ТолькоПросмотр  				= Истина;

	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ОтборОрганизация) Тогда
		
		Если НЕ Параметры.Отбор.Свойство("Организация", ОтборОрганизация) Тогда
		
			Параметры.Свойство("Организация", ОтборОрганизация);
		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОтборОрганизация) Тогда
			
			ЗаполнениеРеквизитовОбъектов.УстановитьОтборОсновнойОрганизации(Список, ОтборОрганизация, "СписокОрганизация");
			ЗаполнениеРеквизитовОбъектов.УстановитьОтборОсновнойОрганизации(СписокИстория, ОтборОрганизация, "СписокИсторияОрганизация");

		Иначе
			
			Элементы.ОтборОрганизация.ТолькоПросмотр  = Истина;

			
		КонецЕсли;	
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокОрганизация", "Видимость", НЕ ЗначениеЗаполнено(ОтборОрганизация));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияОрганизация", "Видимость", НЕ ЗначениеЗаполнено(ОтборОрганизация));

	ОтборАктуальность = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Актуальность", ОтборАктуальность,,, ОтборАктуальность);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "Актуальность", ОтборАктуальность,,, ОтборАктуальность);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокАктуальность", "Видимость", НЕ ОтборАктуальность);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияАктуальность", "Видимость", НЕ ОтборАктуальность);

	Элементы.Страницы.ТекущаяСтраница = Элементы.ТекущиеЗначения;
	
	Элементы.СписокЗаполнитьПодборомДетей.Видимость = ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения);
	Элементы.ГруппаОтборыПериод.Видимость = ЗначениеЗаполнено(НачалоНачисления);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеСоставаГруппДДУДополнительныеУслуги" Тогда
		Элементы.Список.Обновить();
		Элементы.СписокИстория.Обновить();
	ИначеЕсли ИмяСобытия = "ВыбранРебенок_СоставГруппДДУДоп" Тогда
		ОбработатьПодборНаСервере(Параметр);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИнтервалДатДляПросмотра(Команда)
	
	ПараметрыФормы = Новый Структура("НачалоПериода, КонецПериода", НачалоНачисления, ОкончаниеНачисления);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВыбратьПериод_Выбор", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.НастройкаПериодаОтчета", ПараметрыФормы,,,,,ОписаниеОповещенияОЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ


&НаКлиенте
Процедура ОтборАктуальностьПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Актуальность", ОтборАктуальность,,, ОтборАктуальность);	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "Актуальность", ОтборАктуальность,,, ОтборАктуальность);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокАктуальность", "Видимость", НЕ ОтборАктуальность);
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияАктуальность", "Видимость", НЕ ОтборАктуальность);

КонецПроцедуры

&НаКлиенте
Процедура ОтборРебенокПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ребенок", ОтборРебенок,,, ЗначениеЗаполнено(ОтборРебенок));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "Ребенок", ОтборРебенок,,, ЗначениеЗаполнено(ОтборРебенок));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокРебенок", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияРебенок", "Видимость", Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокОрганизация", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияОрганизация", "Видимость", Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтборОтборГруппаДетскогоУчрежденияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокГруппаДетскогоУчреждения", "Видимость", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияГруппаДетскогоУчреждения", "Видимость", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ребенок.Организация", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "Ребенок.Организация", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокОрганизация", "Видимость", НЕ ЗначениеЗаполнено(ОтборОрганизация));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияОрганизация", "Видимость", НЕ ЗначениеЗаполнено(ОтборОрганизация));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокГруппаДетскогоУчреждения", "Видимость", НЕ ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияГруппаДетскогоУчреждения", "Видимость", НЕ ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Ребенок", ОтборРебенок,,, ЗначениеЗаполнено(ОтборРебенок));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "Ребенок", ОтборРебенок,,, ЗначениеЗаполнено(ОтборРебенок));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокРебенок", "Видимость", НЕ ЗначениеЗаполнено(ОтборРебенок));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СписокИсторияРебенок", "Видимость", НЕ ЗначениеЗаполнено(ОтборРебенок));
	 	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодборомДетей(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", ОтборОрганизация));	
	
	ОткрытьФорму("Справочник.Дети.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПерйтиКПросмотруВсейИстории(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.ВсяИстория;
КонецПроцедуры

&НаКлиенте
Процедура ПерйтиКПросмотруТекущихЗначений(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.ТекущиеЗначения;
КонецПроцедуры


#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВыбратьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Период", РезультатВыбора.НачалоПериода, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , ЗначениеЗаполнено(РезультатВыбора.НачалоПериода));
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокИстория.Отбор, "Период", РезультатВыбора.НачалоПериода, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, , ЗначениеЗаполнено(РезультатВыбора.НачалоПериода));
		
		НачалоНачисления = РезультатВыбора.НачалоПериода;
		
	КонецЕсли;
	
	Элементы.ГруппаОтборыПериод.Видимость = ЗначениеЗаполнено(НачалоНачисления);
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ОбработатьПодборНаСервере(Ребенок)
	
	ТекущееСостояние = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(ТекущаяДатаСеанса(), Новый Структура("Ребенок", Ребенок));
	
	НаборЗаписей = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ребенок.Установить(Ребенок);
	НаборЗаписей.Прочитать();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Актуальность = ИСТИНА;
	НоваяЗапись.ГруппаДетскогоУчреждения = ОтборГруппаДетскогоУчреждения;
	НоваяЗапись.Ребенок = Ребенок;
	НоваяЗапись.Договор = ?(ТекущееСостояние.Количество() > 0, ТекущееСостояние[0].Договор, Справочники.Договоры.ПустаяСсылка());
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.СтавкаОплаты = ?(ТекущееСостояние.Количество() > 0, ТекущееСостояние[0].СтавкаОплаты, Справочники.СтавкиОплатыОбразование.ПустаяСсылка());
	НоваяЗапись.Льгота = ?(ТекущееСостояние.Количество() > 0, ТекущееСостояние[0].Льгота, Справочники.ЛьготыСтудентов.ПустаяСсылка());
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры