#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ПолучитьВышестоящие(Знач Ссылка) Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Бюджеты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Бюджеты КАК Бюджеты
		|ГДЕ
		|	Бюджеты.Ссылка = &Ссылка
		|ИТОГИ ПО
		|	Ссылка ТОЛЬКО ИЕРАРХИЯ");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Бюджеты = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	Возврат Бюджеты;
	
КонецФункции

Функция ПолучитьРеквизитыПредопределенногоЭлемента(Знач Ссылка) Экспорт
	
	Результат = Новый Структура;
	
	Если Ссылка = ФедеральныйБюджет Тогда
		Результат.Вставить("Родитель",                      ПустаяСсылка());
		Результат.Вставить("Код",                           "00000001");
		Результат.Вставить("Наименование",                  НСтр("ru = 'Федеральный бюджет'"));
		Результат.Вставить("НаименованиеПолное",            НСтр("ru = 'Федеральный бюджет'"));
		Результат.Вставить("НаименованиеПубличноПравовогоОбразования",  НСтр("ru = 'Российская Федерация'"));
		Результат.Вставить("НаименованиеФинансовогоОргана", НСтр("ru = 'Министерство финансов Российской Федерации'"));
		Результат.Вставить("Элемент",                       Справочники.ЭлементыБюджета.НайтиПоКоду("01"));
		Результат.Вставить("КодОрФК",                       "9500");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено Тогда
		
		Объект = ФедеральныйБюджет.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(Объект.Ссылка);
		ЗаполнитьЗначенияСвойств(Объект, ПолучитьРеквизитыПредопределенногоЭлемента(ФедеральныйБюджет));
		Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Объект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Справочники.Бюджеты.СтандартныеРеквизиты.Код.Имя);
	Результат.Добавить(Метаданные.Справочники.Бюджеты.Реквизиты.Элемент.Имя);
	
	БюджетнаяКлассификацияПереопределяемый.ПолучитьБлокируемыеРеквизитыОбъекта(Результат);
	
	Возврат Результат;
	
КонецФункции

// Находит бюджет по тексту, введенному человеком (возможны ошибки ввода).
//
// Параметры:
//  Текст         - Строка - наименование бюджета.
//  ИспользоватьПолнотекстовыйПоиск - Булево, Неопределено - Истина - воспользоваться
//                  нечетким полнотекстовым поиском. Ложь - искать четким
//                  совпадением (запросом). Неопределено - искать полнотекстовым
//                  поиском, если он доступен.
//  ПорогНечеткости - Число - допустимая доля ошибочных букв в словах (в процентах).
//
// Возвращаемое значение:
//  СправочникСсылка.Бюджеты. Найденный бюджет; пустая ссылка, если бюджет
//  не найден. Функция может вернуть помеченный на удаление элемент, если
//  не нашла подходящих не помеченных.
//
Функция НайтиПоТексту(Знач Текст, Знач ИспользоватьПолнотекстовыйПоиск = Неопределено, Знач ПорогНечеткости = 20) Экспорт
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	Если ИспользоватьПолнотекстовыйПоиск = Неопределено Тогда
		ИспользоватьПолнотекстовыйПоиск = ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить И ПолнотекстовыйПоиск.ИндексАктуален();
	КонецЕсли;
	
	Если ИспользоватьПолнотекстовыйПоиск Тогда
		
		СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(Текст, 3);
		
		ОбластьПоиска = Новый Массив();
		ОбластьПоиска.Добавить(Метаданные.Справочники.Бюджеты);
		
		СписокПоиска.ОбластьПоиска = ОбластьПоиска;
		СписокПоиска.ПолучатьОписание = Ложь;
		СписокПоиска.ПорогНечеткости = ПорогНечеткости;
		
		СписокПоиска.ПерваяЧасть();
		
		// Если количество совпадений - не более двух, то возьмем наиболее подходящий,
		// если количество совпадений 3 (заказанный размер порции) и, возможно, более,
		// то считаем ситуацию слишком сомнительной и не пытаемся гадать.
		Если НЕ СписокПоиска.СлишкомМногоРезультатов() И СписокПоиска.Количество() > 0 И СписокПоиска.Количество() < 3 Тогда
			
			ЭлементСпискаПоиска = СписокПоиска.Получить(0);
			Кандидат = ЭлементСпискаПоиска.Значение;
			
			Если СписокПоиска.Количество() > 1 И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Кандидат, "ПометкаУдаления") = Истина Тогда
				ЭлементСпискаПоиска = СписокПоиска.Получить(1);
				ВторойКандидат = ЭлементСпискаПоиска.Значение;
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВторойКандидат, "ПометкаУдаления") = Ложь Тогда
					Кандидат = ВторойКандидат;
				КонецЕсли;
			КонецЕсли;
			
			Возврат Кандидат;
			
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Бюджеты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Бюджеты КАК Бюджеты
			|ГДЕ
			|	(Бюджеты.НаименованиеПолное ПОДОБНО &НаименованиеБюджета СПЕЦСИМВОЛ ""\""
			|			ИЛИ Бюджеты.Наименование ПОДОБНО &НаименованиеБюджета СПЕЦСИМВОЛ ""\"")
			|
			|УПОРЯДОЧИТЬ ПО
			|	Бюджеты.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("НаименованиеБюджета", СтрЗаменить(Текст, "%", "\%") + "%");
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Возврат Выборка.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПустаяСсылка();
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗаполнитьПредопределенныеЭлементы");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Перем ГруппирующийКодКлассификации;
	
	Если Параметры.Свойство("ГруппирующийКодКлассификации", ГруппирующийКодКлассификации) Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 52
			|	Бюджеты.Ссылка КАК Значение,
			|	Бюджеты.ПометкаУдаления КАК ПометкаУдаления,
			|	Бюджеты.Наименование КАК Наименование,
			|	Бюджеты.Код КАК Код,
			|	Бюджеты.Элемент.Код КАК КодЭлементаБюджета
			|ИЗ
			|	Справочник.Бюджеты КАК Бюджеты
			|ГДЕ
			|	Бюджеты.Ссылка В ИЕРАРХИИ(&КорневойБюджет)
			|	И (Бюджеты.Код ПОДОБНО &СтрокаПоиска
			|			ИЛИ Бюджеты.Наименование ПОДОБНО &СтрокаПоиска)");
		
		Запрос.УстановитьПараметр("КорневойБюджет", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппирующийКодКлассификации, "Бюджет"));
		Запрос.УстановитьПараметр("СтрокаПоиска", Строка(Параметры.СтрокаПоиска) + "%");
		
		ДанныеВыбора = Новый СписокЗначений;
		ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
		
		Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл
			ДанныеВыбора.Добавить(
				Новый Структура("Значение, ПометкаУдаления, Предупреждение", СтрокаРезультата.Значение, СтрокаРезультата.ПометкаУдаления, ""),
				СтрокаРезультата.Наименование + " " + "(" + СокрП(СтрокаРезультата.Код) + "; " + НСтр("ru = 'элемент бюджета: '") + СтрокаРезультата.КодЭлементаБюджета + ")");
		КонецЦикла;
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли