#Область СлужебныйПрограммныйИнтерфейс

Процедура ДекорацияНажатие(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	Если Элемент.Имя = ВнутреннийЭДОКлиентСервер.ИмяДекорацииСостояниеЭДО() Тогда
		СтандартнаяОбработка = Ложь;
		СостояниеЭДОНажатие(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПодключаемуюКоманду(Команда, Форма, Источник) Экспорт
	
	Если Лев(Команда.Имя, 44) = "ВнутреннийЭДО_ПросмотретьЭлектронныйДокумент" Тогда
		ВыполнитьКомандуПросмотретьЭлектронныйДокумент(Форма, Источник);
	ИначеЕсли Лев(Команда.Имя, 41) = "ВнутреннийЭДО_СоздатьЭлектронныеДокументы" Тогда
		ВыполнитьКомандуСоздатьЭлектронныеДокументы(Форма, Источник);
	ИначеЕсли Лев(Команда.Имя, 46) = "ВнутреннийЭДО_АннулироватьЭлектронныеДокументы" Тогда
		ВыполнитьКомандуАннулироватьЭлектронныеДокументы(Форма, Источник);
	ИначеЕсли Лев(Команда.Имя, 50) = "ВнутреннийЭДО_ОткрытьЭлектронныеДокументыНаПодпись" Тогда
		ВыполнитьКомандуОткрытьЭлектронныеДокументыНаПодпись();
	ИначеЕсли Лев(Команда.Имя, 44) = "ВнутреннийЭДО_ОткрытьНастройкиВнутреннегоЭДО" Тогда
		ВыполнитьКомандуОткрытьНастройкиВнутреннегоЭДО(Форма, Источник);
	КонецЕсли;
	
КонецПроцедуры

Процедура СписокВыбор(Форма, Поле, ВыбраннаяСтрока, СтандартнаяОбработка) Экспорт
	
	Если Прав(Поле.Имя, 15) = "СостояниеЭДОБГУ" Тогда
		СтандартнаяОбработка = Ложь;
		ВыполнитьКомандуПросмотретьЭлектронныйДокумент(Форма, ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = ИмяСобытияОбновленияСостоянияВнутреннегоЭД() Тогда
		
		ПриОбновленииСостоянияВнутреннегоЭД(Форма)
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуЭлектронногоДокумента(Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Параметры.ЭлектронныйДокумент) Тогда 
		ОткрытьЭлектронныйДокумент(Параметры.ЭлектронныйДокумент);
	ИначеЕсли ЗначениеЗаполнено(Параметры.УчетныйДокумент) Тогда
		ОткрытьЭлектронныйДокументПоОписанию(Параметры);
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяСобытияОбновленияСостоянияВнутреннегоЭД() Экспорт
	Возврат "ОбновитьСостояниеВнутреннегоЭД";
КонецФункции

Процедура ОткрытьЭлектронныйДокумент(ЭлектронныйДокумент) Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Ключ", ЭлектронныйДокумент);
	
	ОткрытьФорму("Документ.ВнутреннийЭлектронныйДокумент.Форма.ФормаДокумента", Описание);
	
КонецПроцедуры

Процедура ОткрытьФормуСостоянияЭлектронныхДокументов(Ссылка, Параметры) Экспорт
	
	Если ТипЗнч(Параметры) = Тип("ФормаКлиентскогоПриложения") Тогда
		Владелец = Параметры;
	Иначе
		Владелец = Параметры.Форма;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетныйДокумент", Ссылка);
	
	ОткрытьФорму("РегистрСведений.СостоянияЭлектронныхДокументов.Форма.ЭлектронныеДокументы", ПараметрыФормы, Владелец);
	
КонецПроцедуры

Процедура ВыполнитьКомандуПросмотретьЭлектронныйДокументПослеЗаписи(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Форма = ДополнительныеПараметры.Форма;
	
	Форма.Записать();
	
	Ссылка = Форма.Объект.Ссылка;
	
	Если Ссылка.Пустая() Или Форма.Модифицированность Тогда
		Возврат; // Запись не удалась, сообщения о причинах выводит платформа.
	КонецЕсли;
	
	ПросмотретьЭлектронныйДокумент(Форма, Ссылка);
	
КонецПроцедуры

Процедура ВыполнитьКомандуОткрытьЭлектронныеДокументыНаПодпись() Экспорт
	
	ОткрытьФорму("Обработка.ВнутренниеЭлектронныеДокументыБЭДБГУ.Форма.ДокументыНаПодпись");
	
КонецПроцедуры

Процедура ПечатьДокументовОбработкаНавигационнойСсылки(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	Если НавигационнаяСсылкаФорматированнойСтроки <> "ВнутреннийЭДОБГУПрогрессПодписания" Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектыУчета = Форма.Параметры.ПараметрКоманды;
	
	Если Не ЗначениеЗаполнено(ОбъектыУчета) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектыУчета) <> Тип("Массив") Тогда
		ОбъектыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыУчета);
	КонецЕсли;
	
	ОбъектУчета = ОбъектыУчета[0];
	
	Если ЗначениеЗаполнено(Форма.Параметры.ПараметрыИсточника) Тогда
		ИдентификаторКомандыПечати = Форма.Параметры.ПараметрыИсточника.ИдентификаторКоманды;
	Иначе
		ИдентификаторКомандыПечати = Форма.Параметры.ПараметрыПечати.Идентификатор;
	КонецЕсли;
	
	ПараметрыДокумента = ВнутреннийЭДОВызовСервера.ПараметрыЭлектронногоДокумента(ОбъектУчета, ИдентификаторКомандыПечати);
	
	Если ЗначениеЗаполнено(ПараметрыДокумента.АктуальныйЭлектронныйДокумент) Тогда
		ОткрытьЭлектронныйДокумент(ПараметрыДокумента.АктуальныйЭлектронныйДокумент);
	Иначе
		ОткрытьФормуЭлектронногоДокумента(ПараметрыДокумента.ПараметрыНовогоЭлектронногоДокумента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьДокументовОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если ИмяСобытия = ИмяСобытияОбновленияСостоянияВнутреннегоЭД() Тогда
		
		ОбъектыУчета = Форма.Параметры.ПараметрКоманды;
		
		Если Не ЗначениеЗаполнено(ОбъектыУчета) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ОбъектыУчета) <> Тип("Массив") Тогда
			ОбъектыУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыУчета);
		КонецЕсли;
		
		ОбъектУчета = ОбъектыУчета[0];
		
		Если Не ЗначениеЗаполнено(ОбъектУчета) Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Форма.Параметры.ПараметрыИсточника) Тогда
			ИдентификаторКомандыПечати = Форма.Параметры.ПараметрыИсточника.ИдентификаторКоманды;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Параметры.ПараметрыПечати, "Идентификатор") Тогда
			ИдентификаторКомандыПечати = Форма.Параметры.ПараметрыПечати.Идентификатор;
		Иначе
			Возврат;
		КонецЕсли;
		
		Состояние = ВнутреннийЭДОВызовСервера.СостояниеАктуальногоЭлектронногоДокумента(
			ОбъектУчета, ИдентификаторКомандыПечати);
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Форма.Элементы, "ПредставлениеПрогрессаПодписанияДекорацияБГУ", "Заголовок",
				Новый ФорматированнаяСтрока(Состояние.ПредставлениеСостояния,,,, "ВнутреннийЭДОБГУПрогрессПодписания"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьПростуюПодпись(ТекущиеДанные) Экспорт
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваПодписи = Новый Структура(
		"ВладелецПодписи, Организация, Должность, ДатаПодписи, УстановившийПодпись");
	
	ЗаполнитьЗначенияСвойств(СвойстваПодписи, ТекущиеДанные);
	
	ПараметрыФормы = Новый Структура("СвойстваПодписи", СвойстваПодписи);
	ОткрытьФорму("РегистрСведений.ПростыеЭлектронныеПодписиБГУ.Форма.ПростаяЭлектроннаяПодпись", ПараметрыФормы);
	
КонецПроцедуры

Процедура ПоказатьТабличныйДокумент(Результат, Параметры) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДокумента", Параметры.АдресТабличногоДокумента);
	ПараметрыФормы.Вставить("Заголовок", Параметры.Заголовок);
	
	ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТабличногоДокумента", ПараметрыФормы);
	
КонецПроцедуры

Процедура ПоказатьPDFДокумент(Результат, Параметры) Экспорт
	Если ЗначениеЗаполнено(Параметры.СсылкаНаФайл) Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайлаДляОткрытия(
			Параметры.СсылкаНаФайл, Неопределено, УникальныйИдентификатор);
		
		РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
	КонецЕсли;
КонецПроцедуры

Процедура ПодписатьЭлектроннойПодписью(ЭлектронныеДокументы, УникальныйИдентификатор, ВидПодписи, Сертификат) Экспорт
	
	ДанныеДокументов = ВнутреннийЭДОВызовСервера.ДанныеДокументовДляПодписиБГУ(
		ЭлектронныеДокументы, УникальныйИдентификатор, ВидПодписи, Сертификат);
	
	НаборДанных = ДанныеДокументов.НаборДанных;
		
	Для Каждого Данные Из НаборДанных Цикл
		
		ПараметрыОбработчика = Новый Структура;
		ПараметрыОбработчика.Вставить("Заголовок", Данные.Заголовок);
		ПараметрыОбработчика.Вставить("АдресТабличногоДокумента", Данные.АдресТабличногоДокумента);
		
		Если Данные.ЭтоДанныеPDF Тогда
			ПараметрыОбработчика.Вставить("Данные", Данные.Данные);
			ПараметрыОбработчика.Вставить("СсылкаНаФайл", Данные.ФайлДляПодписи);
			ОбработчикОткрытияТабличногоДокумента = Новый ОписаниеОповещения(
				"ПоказатьPDFДокумент", ВнутреннийЭДОКлиент, ПараметрыОбработчика);
		Иначе	
			ОбработчикОткрытияТабличногоДокумента = Новый ОписаниеОповещения(
				"ПоказатьТабличныйДокумент", ВнутреннийЭДОКлиент, ПараметрыОбработчика);
		КонецЕсли;
		
		Данные.Вставить("Представление", Новый Структура("Значение, Представление",
			ОбработчикОткрытияТабличногоДокумента, Данные.Заголовок));
		
	КонецЦикла;
	
	Если НаборДанных.Количество() > 2 Тогда
		Операция = НСтр("ru = 'Подпись документов'");
		ЗаголовокДанных = НСтр("ru = 'Документы'");
		ПредставлениеНабора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Документы (%1)'"), НаборДанных.Количество());
	Иначе
		Операция = НСтр("ru = 'Подпись документа'");
		ЗаголовокДанных = НСтр("ru = 'Документ'");
		ПредставлениеНабора = НаборДанных[0].Заголовок;
	КонецЕсли;
	
	ОписаниеДанных = Новый Структура;
	ОписаниеДанных.Вставить("Операция", Операция);
	ОписаниеДанных.Вставить("ЗаголовокДанных", ЗаголовокДанных);
	ОписаниеДанных.Вставить("СообщитьОЗавершении", Ложь);
	ОписаниеДанных.Вставить("ПоказатьКомментарий", Ложь);
	
	ОписаниеДанных.Вставить("НаборДанных", НаборДанных);
	ОписаниеДанных.Вставить("ПредставлениеНабора", ПредставлениеНабора);
	
	Обработчик = Новый ОписаниеОповещения("ПродолжитьПослеЭлектроннойПодписи", ЭтотОбъект);
	
	Если ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыЭлектронныхПодписейБГУ.Усиленная") Тогда
		ОписаниеДанных.Вставить("ОтборСертификатов", ДанныеДокументов.ДоступныеСертификаты);
		ПараметрыПодписания = ЭлектроннаяПодписьКлиент.НовыйТипПодписи();
		ПараметрыПодписания.ВыборДоверенности = Истина;
		ЭлектроннаяПодписьКлиент.Подписать(ОписаниеДанных, , Обработчик, ПараметрыПодписания)
	ИначеЕсли ВидПодписи = ПредопределенноеЗначение("Перечисление.ВидыЭлектронныхПодписейБГУ.Простая") Тогда
		
		ОписаниеДанных.Вставить("СведенияДляПростойПодписи", ДанныеДокументов.СведенияДляПростойПодписи);
		
		Отказ = Ложь;
		ОписаниеОшибки = "";
		ПроверитьСведенияОДолжностиПодписантаПЭП(ОписаниеДанных, Отказ, ОписаниеОшибки);
					
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			Возврат;
		КонецЕсли;

		ПодписатьПростойПодписью(ОписаниеДанных, Обработчик);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодписатьПростойПодписью(ОписаниеДанных, ОбработкаРезультата = Неопределено) Экспорт
	
	КлиентскиеПараметры = Новый Структура;
	КлиентскиеПараметры.Вставить("ОписаниеДанных", ОписаниеДанных);
	КлиентскиеПараметры.Вставить("ОбработкаРезультата", ОбработкаРезультата);
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("СтандартноеЗавершение", ЭтотОбъект, КлиентскиеПараметры);
	
	СерверныеПараметры = Новый Структура;
	СерверныеПараметры.Вставить("Операция", НСтр("ru = 'Подписание данных'"));
	СерверныеПараметры.Вставить("ЗаголовокДанных", НСтр("ru = 'Данные'"));
	ЗаполнитьЗначенияСвойств(СерверныеПараметры, ОписаниеДанных);
	
	НастроитьПредставлениеДанных(КлиентскиеПараметры, СерверныеПараметры);
	
	Контекст = Новый Структура;
	
	Форма = ОткрытьФорму("ОбщаяФорма.ПодписаниеДанныхПростойПодписьюБГУ", СерверныеПараметры, , , , ,
		Новый ОписаниеОповещения("ОткрытьНовуюФормуОповещениеОЗакрытии", ЭтотОбъект, Контекст));
	
	Контекст.Вставить("Форма", Форма);
	Контекст.Вставить("ОбработкаЗавершения", ОбработкаЗавершения);
	Контекст.Вставить("КлиентскиеПараметры", КлиентскиеПараметры);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьНовуюФормуПродолжение", ЭтотОбъект, Контекст);
	
	Если КлиентскиеПараметры = Неопределено Тогда
		Форма.ПродолжитьОткрытие(Оповещение);
	Иначе
		Форма.ПродолжитьОткрытие(Оповещение, КлиентскиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Продолжение процедуры ОткрытьНовуюФорму.

Процедура ОткрытьНовуюФормуПродолжение(Результат, Контекст) Экспорт
	
	Если Контекст.Форма.Открыта() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Контекст.ОбработкаЗавершения) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОбработкаЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Продолжение процедуры ОткрытьНовуюФорму.

Процедура ОткрытьНовуюФормуОповещениеОЗакрытии(Результат, Контекст) Экспорт
	
	Если ТипЗнч(Контекст.ОбработкаЗавершения) = Тип("ОписаниеОповещения") Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОбработкаЗавершения, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Только для внутреннего использования.

Процедура СтандартноеЗавершение(Успех, КлиентскиеПараметры) Экспорт
	
	КлиентскиеПараметры.ОписаниеДанных.Вставить("Успех", Успех = Истина);
	КлиентскиеПараметры.ОписаниеДанных.Вставить("Отказ", Успех = Неопределено);
	
	Если КлиентскиеПараметры.ОбработкаРезультата <> Неопределено Тогда
		
		ОбработкаРезультата = КлиентскиеПараметры.ОбработкаРезультата;
		КлиентскиеПараметры.ОбработкаРезультата = Неопределено;
		ВыполнитьОбработкуОповещения(ОбработкаРезультата, КлиентскиеПараметры.ОписаниеДанных);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжитьПослеЭлектроннойПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успех Тогда
		
		Для Каждого ТекДанные Из Результат.НаборДанных Цикл
			ТекДанные.Удалить("АдресТабличногоДокумента");
			ТекДанные.Удалить("Данные");
			ТекДанные.Удалить("Заголовок");
			ТекДанные.Удалить("Представление");

			Если Результат.Свойство("РезультатПроверкиМЧДДляПодписания") Тогда
				Если Результат.РезультатПроверкиМЧДДляПодписания <> Неопределено Тогда
					РезультатПроверкиПодписиПоМЧД = Новый Структура;
					РезультатПроверкиПодписиПоМЧД.Вставить("ТребуетсяПроверка", Истина);
					
					ТекДанные.СвойстваПодписи.Вставить("РезультатПроверкиПодписиПоМЧД", РезультатПроверкиПодписиПоМЧД);
					Если Результат.Свойство("ВыбраннаяДоверенность") Тогда
						ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("МашиночитаемаяДоверенность", Результат.ВыбраннаяДоверенность);
					КонецЕсли;
					ПротоколПроверки = Новый Соответствие;
					ПроверкаДоверенности = Новый Структура;
					ПроверкаПодписанта = Новый Структура;
					ПроверкаПолномочий = Новый Структура;
					ПроверкаДокумента = Новый Структура;
					
					Проверка = Новый Структура;
					Проверка.Вставить("Верна", Неопределено);
					Проверка.Вставить("ЗаголовокПроверки", "");
					Проверка.Вставить("ТекстПроверки", "");
					Проверка.Вставить("ДатаПроверки", Неопределено);
					Проверка.Вставить("РучнаяПроверка", Ложь);
					Проверка.Вставить("ДополнительныеДанные", Неопределено);
					
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаДоверенности") Тогда
						ПроверкаДоверенности = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаДоверенности;
					КонецЕсли;	
					Если Результат.РезультатПроверкиМЧДДляПодписания.Свойство("ПроверкаПодписанта") Тогда
						ПроверкаПодписанта = Результат.РезультатПроверкиМЧДДляПодписания.ПроверкаПодписанта;
					КонецЕсли;
						
					ПроверкаПолномочий = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаПолномочий.ЗаголовокПроверки = "Проверка полномочий";
					ПроверкаДокумента = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Проверка);
					ПроверкаДокумента.ЗаголовокПроверки = "Проверка документа";
					
					ПротоколПроверки.Вставить("ПроверкаДоверенности", ПроверкаДоверенности);
					ПротоколПроверки.Вставить("ПроверкаПодписанта", ПроверкаПодписанта);
					ПротоколПроверки.Вставить("ПроверкаПолномочий", ПроверкаПолномочий);
					ПротоколПроверки.Вставить("ПроверкаДокумента", ПроверкаДокумента);
					
					ТекДанные.СвойстваПодписи.РезультатПроверкиПодписиПоМЧД.Вставить("ПротоколПроверки", ПротоколПроверки);
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;
		
		ВнутреннийЭДОВызовСервера.ПодписатьЭлектроннойПодписью(Результат.НаборДанных);
		
		Оповестить(ИмяСобытияОбновленияСостоянияВнутреннегоЭД());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередОткрытиемЭлектронногоДокументаБЭД(УчетныйДокумент, Форма, СтандартнаяОбработка) Экспорт
	
	Если ВнутреннийЭДОВызовСервера.ТребуетсяОткрытьЭлектронныйДокументБГУпоКомандеЭДО(УчетныйДокумент) Тогда
		СтандартнаяОбработка = Ложь;
		ПросмотретьЭлектронныйДокумент(Форма, УчетныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуФормированияУведомленияОбИспользованииПЭП(Организация, СписокПользователей,
	ВладелецФормы = Неопределено) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", Организация);
	ПараметрыОткрытияФормы.Вставить("СписокПользователей", СписокПользователей);
	
	ОткрытьФорму("Обработка.НастройкиВнутреннегоЭДОБГУ.Форма.ФормированиеУведомленияОбИспользованииПЭП",
		ПараметрыОткрытияФормы, ВладелецФормы, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуФормированияПоложенияОбИспользованииПЭП(Организация, ВладелецФормы = Неопределено) Экспорт
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Организация", Организация);
	
	ОткрытьФорму("Обработка.НастройкиВнутреннегоЭДОБГУ.Форма.ФормированиеПоложенияОбИспользованииПЭП",
		ПараметрыОткрытияФормы, ВладелецФормы, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#Область ИнтеграцияСБЭД

Процедура ОткрытьФормуВнешнегоЭлектронногоДокумента(ПараметрыФормы) Экспорт

	ВнутреннийЭДОКлиентПереопределяемый.ОткрытьФормуВнешнегоЭлектронногоДокумента(ПараметрыФормы);
	
КонецПроцедуры	

Процедура ОткрытьТекущиеДелаЭДО() Экспорт

	ВнутреннийЭДОКлиентПереопределяемый.ОткрытьТекущиеДелаЭДО();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Только для внутреннего использования.

Процедура НастроитьПредставлениеДанных(КлиентскиеПараметры, СерверныеПараметры)
	
	ОписаниеДанных = КлиентскиеПараметры.ОписаниеДанных;
	
	Если ОписаниеДанных.Свойство("СписокПредставлений") Тогда
		СписокПредставлений = ОписаниеДанных.СписокПредставлений;
	Иначе
		СписокПредставлений = Новый Массив;
		
		Если ОписаниеДанных.Свойство("Данные")
		 Или ОписаниеДанных.Свойство("Объект") Тогда
			
			ЗаполнитьСписокПредставлений(СписокПредставлений, ОписаниеДанных);
		Иначе
			Для каждого ЭлементДанных Из ОписаниеДанных.НаборДанных Цикл
				ЗаполнитьСписокПредставлений(СписокПредставлений, ЭлементДанных);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ТекущийСписокПредставлений = Новый СписокЗначений;
	
	Для каждого ЭлементСписка Из СписокПредставлений Цикл
		Если ТипЗнч(ЭлементСписка) = Тип("Строка") Тогда
			Представление = ЭлементСписка.Представление;
			Значение = Неопределено;
		ИначеЕсли ТипЗнч(ЭлементСписка) = Тип("Структура") Тогда
			Представление = ЭлементСписка.Представление;
			Значение = ЭлементСписка.Значение;
		Иначе // Ссылка
			Представление = "";
			Значение = ЭлементСписка.Значение;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементСписка.Представление) Тогда
			Представление = ЭлементСписка.Представление;
		Иначе
			Представление = Строка(ЭлементСписка.Значение);
		КонецЕсли;
		ТекущийСписокПредставлений.Добавить(Значение, Представление);
	КонецЦикла;
	
	Если ТекущийСписокПредставлений.Количество() > 1 Тогда
		СерверныеПараметры.Вставить("ПредставлениеДанныхОткрывается", Истина);
		СерверныеПараметры.Вставить("ПредставлениеДанных", СтрЗаменить(
			ОписаниеДанных.ПредставлениеНабора, "%1", ОписаниеДанных.НаборДанных.Количество()));
	Иначе
		СерверныеПараметры.Вставить("ПредставлениеДанныхОткрывается",
			ТипЗнч(ТекущийСписокПредставлений[0].Значение) = Тип("ОписаниеОповещения")
			Или ЗначениеЗаполнено(ТекущийСписокПредставлений[0].Значение));
		
		СерверныеПараметры.Вставить("ПредставлениеДанных",
			ТекущийСписокПредставлений[0].Представление);
	КонецЕсли;
	
	КлиентскиеПараметры.Вставить("ТекущийСписокПредставлений", ТекущийСписокПредставлений);
	
КонецПроцедуры

Процедура ПроверитьСведенияОДолжностиПодписантаПЭП(Знач ОписаниеДанных, Отказ, ОписаниеОшибки) 

	Если НЕ ВнутреннийЭДОВызовСервера.ПолучитьКонстантуПроверятьСведенияОДолжностиПодписантаПЭП() Тогда
		Возврат;
	КонецЕсли;	
	
	НаборДанных = ОписаниеДанных.НаборДанных;
	СведенияПодписи = ОписаниеДанных.СведенияДляПростойПодписи;
	
	МассивДолжностей = СведенияПодписи.ОрганизацииИДолжности[НаборДанных[0].ЭлектронныйДокумент]; 			
	Если НЕ ЗначениеЗаполнено(СведенияПодписи.ПолноеИмя) Тогда
		
		ОписаниеОшибки = СтрШаблон(НСтр("ru='Электронный документ не может быть подписан: для пользователя подписанта ""%1"" не определено физическое лицо.
		|Необходимо указать физическое лицо в справочнике ""Пользователи"" и повторить операцию.'"), ПользователиКлиентСервер.ТекущийПользователь());
		
		Отказ = Истина;
		
	ИначеЕсли МассивДолжностей.Количество() = 0 Тогда
		
		ОписаниеОшибки = СтрШаблон(НСтр("ru='Электронный документ не может быть подписан: для сотрудника подписанта ""%1"" не определена должность.
		|Необходимо указать должность в справочнике ""Сотрудники"" и повторить операцию.'"), СведенияПодписи.ПолноеИмя);
		
		Отказ = Истина;   
		
	КонецЕсли; 
			
КонецПроцедуры

// Для процедуры НастроитьПредставлениеДанных.
Процедура ЗаполнитьСписокПредставлений(СписокПредставлений, ЭлементДанных)
	
	ЭлементСписка = Новый Структура("Значение, Представление", Неопределено, "");
	СписокПредставлений.Добавить(ЭлементСписка);
	
	Если ЭлементДанных.Свойство("Представление")
	   И ТипЗнч(ЭлементДанных.Представление) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭлементСписка, ЭлементДанных.Представление);
		Возврат;
	КонецЕсли;
	
	Если ЭлементДанных.Свойство("Представление")
	   И ТипЗнч(ЭлементДанных.Представление) <> Тип("Строка") Тогда
	
		ЭлементСписка.Значение = ЭлементДанных.Представление;
		
	ИначеЕсли ЭлементДанных.Свойство("Объект")
	        И ТипЗнч(ЭлементДанных.Объект) <> Тип("ОписаниеОповещения") Тогда
		
		ЭлементСписка.Значение = ЭлементДанных.Объект;
	КонецЕсли;
	
	Если ЭлементДанных.Свойство("Представление") Тогда
		ЭлементСписка.Представление = ЭлементДанных.Представление;
	КонецЕсли;
	
КонецПроцедуры

Процедура СостояниеЭДОНажатие(Форма)
	
	СсылкаНаУчетныйДокумент = Форма.Объект.Ссылка;
	
	ПросмотретьЭлектронныйДокумент(Форма, СсылкаНаУчетныйДокумент);
	
КонецПроцедуры

Процедура ВыполнитьКомандуПросмотретьЭлектронныйДокумент(Форма, Источник)
	
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура") Тогда
		Ссылка = Источник.Ссылка;
	ИначеЕсли ТипЗнч(Источник) = Тип("ТаблицаФормы") Тогда
		ТипыДокументовВнутреннегоЭДО = ВнутреннийЭДОКлиентПовтИсп.ТипыУчетныхДокументовВнутреннегоЭДО();
		Если ТипыДокументовВнутреннегоЭДО.СодержитТип(ТипЗнч(Источник.ТекущаяСтрока)) Тогда
			Ссылка = Источник.ТекущаяСтрока;
		ИначеЕсли Источник.ТекущиеДанные <> Неопределено Тогда
			Ссылка = Источник.ТекущиеДанные.Ссылка;
		КонецЕсли;
	Иначе
		Ссылка = Источник;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура")
		И (Ссылка.Пустая() Или Форма.Модифицированность) Тогда
		
		ТекстВопроса = 
			НСтр("ru = 'Данные еще не записаны.
				|Выполнение действия возможно только после записи данных.
				|Данные будут записаны.'");
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Форма", Форма);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьКомандуПросмотретьЭлектронныйДокументПослеЗаписи",
			ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	ПросмотретьЭлектронныйДокумент(Форма, Ссылка);
	
КонецПроцедуры

Процедура ВыполнитьКомандуСоздатьЭлектронныеДокументы(Форма, Источник)
	
	УчетныеДокументы = Новый Массив;
	
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура") Тогда
		УчетныеДокументы.Добавить(Источник.Ссылка);
	ИначеЕсли ТипЗнч(Источник) = Тип("ТаблицаФормы") Тогда
		Если Источник.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Для Каждого Ссылка Из Источник.ВыделенныеСтроки Цикл
			Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			УчетныеДокументы.Добавить(Ссылка);
		КонецЦикла;
	Иначе
		УчетныеДокументы.Добавить(Источник.Ссылка);
	КонецЕсли;
	
	СоздатьЭлектронныеДокументы(Форма, УчетныеДокументы);
	
КонецПроцедуры

Процедура ВыполнитьКомандуАннулироватьЭлектронныеДокументы(Форма, Источник)
	
	УчетныеДокументы = Новый Массив;
	
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура") Тогда
		УчетныеДокументы.Добавить(Источник.Ссылка);
	ИначеЕсли ТипЗнч(Источник) = Тип("ТаблицаФормы") Тогда
		Если Источник.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Для Каждого Ссылка Из Источник.ВыделенныеСтроки Цикл
			Если ТипЗнч(Ссылка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				Продолжить;
			КонецЕсли;
			УчетныеДокументы.Добавить(Ссылка);
		КонецЦикла;
	Иначе
		УчетныеДокументы.Добавить(Источник.Ссылка);
	КонецЕсли;
	
	АннулироватьЭлектронныеДокументы(Форма, УчетныеДокументы);
	
КонецПроцедуры

Процедура ПросмотретьЭлектронныйДокумент(Форма, Ссылка)
	
	ПараметрыПросмотра = ВнутреннийЭДОВызовСервера.ПараметрыПросмотраЭлектронногоДокумента(Ссылка);
	
	Если ПараметрыПросмотра.ДокументОбрабатываетсяВнутреннимЭДОБЭД Тогда
		ВнутреннийЭДОКлиентПереопределяемый.ОткрытьЭлектронныйДокументОбъектаУчетаБЭД(Ссылка);
	ИначеЕсли НЕ ПараметрыПросмотра.ЕстьПравоЧтенияВнутреннихЭлектронныхДокументов Тогда
		ТекстСообщения = НСтр("ru = 'Недостаточно прав для просмотра внутренних электронных документов'");
		ПоказатьПредупреждение(, ТекстСообщения, 60);
	ИначеЕсли НЕ ПараметрыПросмотра.ДокументПодходитДляВнутреннегоЭДОБГУ Тогда
		ТекстСообщения = НСтр("ru = 'Тип документа не обрабатывается внутренним ЭДО'");
		ПоказатьПредупреждение(, ТекстСообщения, 60);
	ИначеЕсли ЗначениеЗаполнено(ПараметрыПросмотра.ПараметрыЕдинственногоДокумента) Тогда
		Если ЗначениеЗаполнено(ПараметрыПросмотра.ПараметрыЕдинственногоДокумента.ОписаниеОшибки) Тогда
			ПоказатьПредупреждение(, ПараметрыПросмотра.ПараметрыЕдинственногоДокумента.ОписаниеОшибки, 60);
		Иначе
			ОткрытьФормуЭлектронногоДокумента(ПараметрыПросмотра.ПараметрыЕдинственногоДокумента);
		КонецЕсли;
	Иначе
		ОткрытьФормуСостоянияЭлектронныхДокументов(Ссылка, Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЭлектронныеДокументы(Форма, УчетныеДокументы)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетныеДокументы", УчетныеДокументы);
	
	ОткрытьФорму("ОбщаяФорма.СозданиеЭлектронныхДокументов", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура АннулироватьЭлектронныеДокументы(Форма, УчетныеДокументы)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УчетныеДокументы", УчетныеДокументы);
	
	ОткрытьФорму("ОбщаяФорма.АннулированиеЭлектронныхДокументов", ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура ОткрытьЭлектронныйДокументПоОписанию(Описание)
	
	ОткрытьФорму("Документ.ВнутреннийЭлектронныйДокумент.Форма.ФормаДокумента", Описание);
	
КонецПроцедуры

Процедура ПриОбновленииСостоянияВнутреннегоЭД(Форма)
	
	Параметры = ПараметрыРасчетаСостоянияЭДОФормы(Форма);
	
	ДанныеВнутреннегоЭДО = ВнутреннийЭДОВызовСервера.ДанныеВнутреннегоЭДО(Параметры);
	
	Гиперссылка = Форма.Элементы.Найти(ВнутреннийЭДОКлиентСервер.ИмяДекорацииСостояниеЭДО());
	Если Гиперссылка <> Неопределено Тогда
		Гиперссылка.Заголовок = ДанныеВнутреннегоЭДО.Состояние;
	КонецЕсли;
	
	Если ДанныеВнутреннегоЭДО.ТолькоПросмотр Тогда
		Форма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыРасчетаСостоянияЭДОФормы(Форма)
	
	СтандартнаяОбработка = Истина;
	Организация = Неопределено;
	ВнутреннийЭДОКлиентПереопределяемый.ПриПолученииОрганизацииПоОбъекту(Форма, Форма.Объект, Организация, СтандартнаяОбработка);
	
	Если СтандартнаяОбработка Тогда
		Организация = Форма.Объект.Организация;
	КонецЕсли;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Организация", Организация);
	Параметры.Вставить("Ссылка", Форма.Объект.Ссылка);
	
	Возврат Параметры;
	
КонецФункции

Процедура ВыполнитьКомандуОткрытьНастройкиВнутреннегоЭДО(Форма, Источник)
	
	Если ТипЗнч(Источник) = Тип("ДанныеФормыСтруктура") Тогда
		Ссылка = Источник.Ссылка;
	ИначеЕсли ТипЗнч(Источник) = Тип("ТаблицаФормы") Тогда
		Ссылка = Источник.ТекущиеДанные.Ссылка;
	Иначе
		Ссылка = Источник;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Ссылка);
	
	ОткрытьФорму("РегистрСведений.НастройкиВнутреннегоЭДОБГУ.Форма.НастройкаВнутреннегоЭДО",
		ПараметрыФормы, Форма, Ссылка);
	
КонецПроцедуры

#КонецОбласти