#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем КэшЗначений;					//Соответствие - содержит значения участвующих в проверке КС
Перем мОтчетОбъект Экспорт;			//ДокументОбъект.УниверсальныйРегламентированныйОтчет - документ по которому будет проводится проверка

Перем ПустойКодВД;
Перем ПустойКодКЭК;
Перем ПустойПодвид;
Перем ПустаяЦС;
Перем ПустаяПрограмма;
Перем ПустаяГруппа;
Перем ПустаяСтатья;
Перем ПустойВид;

//отдельные справочники
Перем ПустойАнКодКПС;
Перем ПустойКВР;
Перем ПустаяГлава;
Перем ПустойРаздел;

Перем ТаблицаДоходовСледущийГод;
Перем ТаблицаДоходовПрошлыйГод;
Перем ДатаДействия;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает результат проверки для отчета
// и заполняет в документе результат проверки в мКонтрольныеСоотношенияФЛК
// Параметры:
//	ОтчетОбъект - ДокументОбъект.УниверсальныйРегламентированныйОтчет - документ для проверки
// Возвращаемое значение:
//	Структура - содержит результат проверки для документы
//		* БезОшибок			- Булево - истина, если нет в документе ошибок
//		* БезПредупреждений	- Булево - истина, если нет в документу предупреждений
//		* ВФКонтроль		- Булево - истина, если внутриформенная проверка выполнялась
//		* ВФОшибки			- Число - количество найденных внутриформенных ошибок
//		* ВФПредупреждения	- Число - количество найденных внутриформенных предупреждений
//		* МФКонтроль		- Булево - истина, если межформенная проверка выполнялась
//		* МФОшибки			- Число - количество найденных межформенных ошибок
//		* МФПредупреждения	- Число - количество найденных межформенных предупреждений
//
Функция ПроверитьПоОтчету(ОтчетОбъект,СписокКонтрольныхСоотношений) Экспорт
	КэшЗначений = Новый Соответствие;
	
	Если НЕ ТипЗнч(ОтчетОбъект) = Тип("ДокументОбъект.УниверсальныйРегламентированныйОтчет") Тогда 
		мОтчетОбъект = ОтчетОбъект.ПолучитьОбъект();
	Иначе 
		мОтчетОбъект = ОтчетОбъект;
	КонецЕсли;
	
	РезультатПроверки = ПроверкаОтчетаКонтрольБК(СписокКонтрольныхСоотношений);
	
	Возврат РезультатПроверки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает результат проверки для мОтчетОбъект
// Возвращаемое значение:
//	Структура - содержит результат проверки для документы
//		* БезОшибок			- Булево - истина, если нет в документе ошибок
//		* БезПредупреждений	- Булево - истина, если нет в документу предупреждений
//		* ВФКонтроль		- Булево - истина, если внутриформенная проверка выполнялась
//		* ВФОшибки			- Число - количество найденных внутриформенных ошибок
//		* ВФПредупреждения	- Число - количество найденных внутриформенных предупреждений
//		* МФКонтроль		- Булево - истина, если межформенная проверка выполнялась
//		* МФОшибки			- Число - количество найденных межформенных ошибок
//		* МФПредупреждения	- Число - количество найденных межформенных предупреждений
//
Функция ПроверкаОтчетаКонтрольБК(СписокКонтрольныхСоотношений)
	
	ПроверкаПройденаБезОшибок = Истина;
	ПроверкаПройденаБезПредупреждений = Истина;
	ПроверкаПройденаБезОшибокРасчета = Истина;
	
	ВФОшибки = 0;
	ВФПредупреждения = 0;

	СписокКСКонтрольБК = ПолучитьСписокКСКонтрольБК(СписокКонтрольныхСоотношений);
	
	Если СписокКСКонтрольБК.Количество() = 0 Тогда
		РезультатПроверки = Новый Структура;
	    РезультатПроверки.Вставить("БезОшибок",			Истина);
		РезультатПроверки.Вставить("БезПредупреждений",	Истина);
		РезультатПроверки.Вставить("БезОшибокРасчета", 	Истина);
		
		РезультатПроверки.Вставить("ВФКонтроль",		Истина);
		РезультатПроверки.Вставить("ВФОшибки",			0);
		РезультатПроверки.Вставить("ВФПредупреждения",	0);
		
		РезультатПроверки.Вставить("МФКонтроль",		Ложь);
		РезультатПроверки.Вставить("МФОшибки",			0);
		РезультатПроверки.Вставить("МФПредупреждения",	0);
		Возврат РезультатПроверки;
	КонецЕсли;
	
	мОтчетОбъект.ПроверитьКонтекстИнициализирован();
	
	ИнициализацияТаблицыПроверки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокКонтрольныхСоотношений",СписокКСКонтрольБК);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрольныеСоотношения.Ссылка КАК КонтрольноеСоотношение,
	               |	КонтрольныеСоотношения.Код КАК КодКС,
	               |	КонтрольныеСоотношения.Дополнительное КАК Дополнительное,
	               |	КонтрольныеСоотношения.ТекстПояснения КАК ТекстПояснения,
	               |	КонтрольныеСоотношения.Описание КАК Описание,
	               |	КонтрольныеСоотношения.НомерСоотношения КАК НомерСоотношения
	               |ПОМЕСТИТЬ КонтрольныеСоотношения
	               |ИЗ
	               |	Справочник.КонтрольныеСоотношения КАК КонтрольныеСоотношения
	               |ГДЕ
	               |	КонтрольныеСоотношения.Ссылка В(&СписокКонтрольныхСоотношений)
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	КонтрольноеСоотношение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрольныеСоотношения.КодКС КАК КодКС,
	               |	КонтрольныеСоотношения.КонтрольноеСоотношение КАК КонтрольноеСоотношение,
	               |	ПараметрыКонтроляБК.ГруппаРаскрытия КАК ГруппаРаскрытия,
	               |	ПараметрыКонтроляБК.ВариантКонтроляБК КАК ВариантКонтроляБК,
	               |	ПараметрыКонтроляБК.ГруппировочныеКодыНедопустимы КАК ГруппировочныеКодыНедопустимы,
	               |	ПараметрыКонтроляБК.НезаполненныеКодыНедопустимы КАК НезаполненныеКодыНедопустимы,
	               |	СоответствиеАналитикиКонтроляБК.ВидКлассификатора КАК ВидКлассификатора,
	               |	СоответствиеАналитикиКонтроляБК.ВидАналитики КАК ВидАналитики,
	               |	КонтрольныеСоотношения.Дополнительное КАК Дополнительное,
	               |	КонтрольныеСоотношения.ТекстПояснения КАК ТекстПояснения,
	               |	КонтрольныеСоотношения.Описание КАК Описание,
	               |	ПараметрыКонтроляБК.СтрокаОтчета.Код КАК СтрокаОтчетаКод,
	               |	ПараметрыКонтроляБК.СтрокаОтчета.Наименование КАК СтрокаОтчетаНаименование,
	               |	КонтрольныеСоотношения.НомерСоотношения КАК НомерСоотношения,
	               |	ПараметрыКонтроляБК.СтрокаОтчета КАК СтрокаОтчета
	               |ПОМЕСТИТЬ ВТ_ОбщаяКлассификация
	               |ИЗ
	               |	КонтрольныеСоотношения КАК КонтрольныеСоотношения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыКонтроляБК КАК ПараметрыКонтроляБК
	               |		ПО (ПараметрыКонтроляБК.КонтрольноеСоотношение = КонтрольныеСоотношения.КонтрольноеСоотношение)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеАналитикиКонтроляБК КАК СоответствиеАналитикиКонтроляБК
	               |		ПО (СоответствиеАналитикиКонтроляБК.КонтрольноеСоотношение = КонтрольныеСоотношения.КонтрольноеСоотношение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОбщаяКлассификация.КодКС КАК КодКС,
	               |	ВТ_ОбщаяКлассификация.КонтрольноеСоотношение КАК КонтрольноеСоотношение,
	               |	ВТ_ОбщаяКлассификация.ГруппаРаскрытия КАК ГруппаРаскрытия,
	               |	ВТ_ОбщаяКлассификация.ГруппировочныеКодыНедопустимы КАК ГруппировочныеКодыНедопустимы,
	               |	ВТ_ОбщаяКлассификация.НезаполненныеКодыНедопустимы КАК НезаполненныеКодыНедопустимы,
	               |	ВТ_ОбщаяКлассификация.ВидКлассификатора КАК ВидКлассификатора,
	               |	ВТ_ОбщаяКлассификация.ВидАналитики КАК ВидАналитики,
	               |	ГруппыРаскрытияАналитика.НомерСтроки КАК НомерАналитики,
	               |	ВТ_ОбщаяКлассификация.Дополнительное КАК Дополнительное,
	               |	ВТ_ОбщаяКлассификация.ТекстПояснения КАК ТекстПояснения,
	               |	ВТ_ОбщаяКлассификация.Описание КАК Описание,
	               |	ВТ_ОбщаяКлассификация.СтрокаОтчетаКод КАК СтрокаОтчетаКод,
	               |	ВТ_ОбщаяКлассификация.СтрокаОтчетаНаименование КАК СтрокаОтчетаНаименование,
	               |	ВТ_ОбщаяКлассификация.НомерСоотношения КАК НомерСоотношения,
	               |	ВТ_ОбщаяКлассификация.ВариантКонтроляБК КАК ВариантКонтроляБК
	               |ИЗ
	               |	ВТ_ОбщаяКлассификация КАК ВТ_ОбщаяКлассификация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	               |		ПО ВТ_ОбщаяКлассификация.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
	               |			И ВТ_ОбщаяКлассификация.ВидАналитики = ГруппыРаскрытияАналитика.ВидАналитики
	               |ИТОГИ ПО
	               |	ГруппаРаскрытия,
	               |	КонтрольноеСоотношение,
	               |	ВариантКонтроляБК";

	ПакетВыполнения = Запрос.ВыполнитьПакет();
	
	ДатаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мОтчетОбъект.ПериодОтчета,"ДатаОкончания");
	
	ТаблицаДоходовЭтотГод = Неопределено;	
	ТаблицаДоходовСледущийГод = Неопределено;
	ТаблицаДоходовПрошлыйГод = Неопределено;
	
	ТаблицаПодвидов = Неопределено;//нет даты действия, тут все подвиды
	
	ТаблицаИсточников = Неопределено;
	
	ТаблицаРасходов = Неопределено;
	ТаблицаУниверсальныхПрограммЦС = Неопределено;
	
	ТаблицаАнКодыКПС = Неопределено;
	ТаблицаКВР = Неопределено;
	
	ТаблицаГлав = Неопределено;
	ТаблицаКОСГУ = Неопределено;
	ТаблицаРазделов = Неопределено;
		
	//Таблица проверками БК по классификации доходов
	ВыборкаГруппаРаскрытия = ПакетВыполнения[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппаРаскрытия.Следующий() Цикл
		
		ТекГруппаРаскрытия = ВыборкаГруппаРаскрытия.ГруппаРаскрытия;
		ТекТаблицаРаскрытия = ПолучитьТаблицуРаскрытияАналитики(ТекГруппаРаскрытия);
		
		ТребуетсяПроверка = ТекТаблицаРаскрытия.Количество() > 0;
		
		ВыборкаКС = ВыборкаГруппаРаскрытия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаКС.Следующий() Цикл
			КонтрольноеСоотношение = ВыборкаКС.КонтрольноеСоотношение;
			
			ПоказателиТекущийСтроки = Новый ТаблицаЗначений;
			ПоказателиТекущийСтроки.Колонки.Добавить("Ошибка",БюджетнаяОтчетность.ПолучитьОписаниеТиповБулево());
			ПоказателиТекущийСтроки.Колонки.Добавить("СообщениеПоКС");
	
			ВыборкаВидКонтроля = ВыборкаКС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаВидКонтроля.Следующий() Цикл
				
				СтрокаСоотношений = мОтчетОбъект.мКонтрольныеСоотношенияБК.Добавить();
				СтрокаСоотношений.КонтрольноеСоотношение = КонтрольноеСоотношение; 
				СтрокаСоотношений.РезультатРасчета = Истина;
				СтрокаСоотношений.РасчетВыполнен = Истина;
				
				ВыборкаДетальныеНастройки = ВыборкаВидКонтроля.Выбрать();
					
				ГруппировочныеКодыНедопустимы = Ложь;
				НезаполненныеКодыНедопустимы = Ложь;
				
				СтруктураНастройки = Новый Структура;
				НужноЗаполнитьДанныеКС = Истина;
				
				НаименованиеСтроки = "";
				КодСтроки = "";				
				
				ВидКлассификатора = Неопределено;
				
				Пока ВыборкаДетальныеНастройки.Следующий() Цикл
					
					Если ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КДБ Тогда
						
						Если ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ВидыДоходовКДБ Тогда
							СтруктураНастройки.Вставить("КодВД","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						ИначеЕсли ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ГруппыПодвидовКДБ Тогда
							СтруктураНастройки.Вставить("Подвид","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						ИначеЕсли ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.КОСГУ Тогда
							СтруктураНастройки.Вставить("КодКЭК","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						КонецЕсли;
						
					ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КРБ Тогда
						
						Если ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ЦелевыеСтатьиКРБ Тогда
							СтруктураНастройки.Вставить("КодЦС","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						ИначеЕсли ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ПрограммыЦелевыхСтатейКРБ Тогда
							СтруктураНастройки.Вставить("КодПрограммыЦС","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						КонецЕсли;
						
					ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КИФ Тогда	
						
						Если ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ГруппыПодгруппыКИФ Тогда
							СтруктураНастройки.Вставить("КодГруппы","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						ИначеЕсли ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.СтатьиКИФ Тогда
							СтруктураНастройки.Вставить("КодСтатьи","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						ИначеЕсли ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ВидыКИФ Тогда
							СтруктураНастройки.Вставить("КодВида","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						ИначеЕсли ВыборкаДетальныеНастройки.ВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.КОСГУ Тогда
							СтруктураНастройки.Вставить("КодКЭК","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);
						КонецЕсли;
						
					ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.СоответствияЦелевыхСтатейВидовДоходов Тогда
						
						Продолжить; //В БГУ не выполняется	
					
					ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.ОтдельныеСправочники Тогда
						
						СтруктураНастройки.Вставить("Код","Аналитика"+ВыборкаДетальныеНастройки.НомерАналитики);						
						ТекВидКлассификатора = ВыборкаДетальныеНастройки.ВидКлассификатора;
						
					Иначе
						
						//не заполнен - ошибка
						
					КонецЕсли;
					
					ГруппировочныеКодыНедопустимы = ВыборкаДетальныеНастройки.ГруппировочныеКодыНедопустимы;
					НезаполненныеКодыНедопустимы = ВыборкаДетальныеНастройки.НезаполненныеКодыНедопустимы;
					
					Если НужноЗаполнитьДанныеКС Тогда
						ЗаполнитьЗначенияСвойств(СтрокаСоотношений,ВыборкаДетальныеНастройки,"Описание,НомерСоотношения,Дополнительное,ТекстПояснения");
					    СтрокаСоотношений.Код = ВыборкаДетальныеНастройки.КодКС;
						НаименованиеСтроки = ВыборкаДетальныеНастройки.СтрокаОтчетаНаименование;
						КодСтроки = ВыборкаДетальныеНастройки.СтрокаОтчетаКод;
						
						НужноЗаполнитьДанныеКС = Ложь;
					КонецЕсли;
				КонецЦикла;
				
				Если ТребуетсяПроверка = Ложь Тогда
					Продолжить; //нет данных в таблице раскрытия
				КонецЕсли;
				
				ЕстьПодвид = Ложь;
				
				Если ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КДБ Тогда
					
					ЕстьПодвид = СтруктураНастройки.Свойство("Подвид");
					
					Если НЕ СтруктураНастройки.Свойство("КодВД")
						ИЛИ НЕ СтруктураНастройки.Свойство("КодКЭК") Тогда
						
						ТекстОшибкиДляПротокола = Нстр("ru='Ошибка расчета контрольного соотношения. 
						|Не удалось выполнить проверку по причине: Настройка аналитики проверки БК задана не корректно.'");
					
						СтрокаСоотношений.РасчетВыполнен = Ложь;//ошибка
						СтрокаСоотношений.ТекстОшибкиРасчета = ТекстОшибкиДляПротокола;
						
						Продолжить; //не корректное КС
					КонецЕсли;
					
				ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КРБ Тогда
					
					Если НЕ СтруктураНастройки.Свойство("КодЦС")
						ИЛИ НЕ СтруктураНастройки.Свойство("КодПрограммыЦС") Тогда
						
						ТекстОшибкиДляПротокола = Нстр("ru='Ошибка расчета контрольного соотношения. 
						|Не удалось выполнить проверку по причине: Настройка аналитики для проверки БК задана не корректно.'");
					
						СтрокаСоотношений.РасчетВыполнен = Ложь;//ошибка
						СтрокаСоотношений.ТекстОшибкиРасчета = ТекстОшибкиДляПротокола;
						
						Продолжить; //не корректное КС
					КонецЕсли;
										
				ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КИФ Тогда	
					
					Если НЕ СтруктураНастройки.Свойство("КодГруппы")
						ИЛИ НЕ СтруктураНастройки.Свойство("КодСтатьи")
						ИЛИ НЕ СтруктураНастройки.Свойство("КодВида")
						ИЛИ НЕ СтруктураНастройки.Свойство("КодКЭК") Тогда
						
						ТекстОшибкиДляПротокола = Нстр("ru='Ошибка расчета контрольного соотношения. 
						|Не удалось выполнить проверку по причине: Настройка аналитики для проверки БК задана не корректно.'");
					
						СтрокаСоотношений.РасчетВыполнен = Ложь;//ошибка
						СтрокаСоотношений.ТекстОшибкиРасчета = ТекстОшибкиДляПротокола;
						
						Продолжить; //не корректное КС
					КонецЕсли;
					
				ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.СоответствияЦелевыхСтатейВидовДоходов Тогда
					
	            	Продолжить; //В БГУ не выполняется
					
				ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.ОтдельныеСправочники Тогда
					
					Если НЕ СтруктураНастройки.Свойство("Код") Тогда
						ТекстОшибкиДляПротокола = Нстр("ru='Ошибка расчета контрольного соотношения. 
						|Не удалось выполнить проверку по причине: Настройка аналитики для проверки БК задана не корректно.'");
					
						СтрокаСоотношений.РасчетВыполнен = Ложь;//ошибка
						СтрокаСоотношений.ТекстОшибкиРасчета = ТекстОшибкиДляПротокола;
					КонецЕсли;
					
				Иначе
					ТекстОшибкиДляПротокола = Нстр("ru='Ошибка расчета контрольного соотношения. 
					|Не удалось выполнить проверку по причине: Настройка аналитики для проверки БК задана не корректно.'");
				
					СтрокаСоотношений.РасчетВыполнен = Ложь;//ошибка
					СтрокаСоотношений.ТекстОшибкиРасчета = ТекстОшибкиДляПротокола;
					
					Продолжить; //не корректное КС
				КонецЕсли;			
								
				Попытка
					
					Для Каждого СтрТЧ Из ТекТаблицаРаскрытия Цикл
						
						ЕстьОшибки = Ложь;
						СообщениеПоКС = "";
						
						//незаполненные коды допустимы, если это груп. итоги
						ТекНезаполненныеКодыНедопустимы = НезаполненныеКодыНедопустимы И СтрТЧ.ПромежуточныйИтог = Ложь;
						
						Если ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КДБ Тогда
							
							Если ТаблицаДоходовЭтотГод = Неопределено Тогда
								ТаблицаДоходовЭтотГод = ПолучитьКлассификациюДоходов(ДатаДействия);
							КонецЕсли;
					
							ПроверитьПоКДБ(ГруппировочныеКодыНедопустимы, ЕстьПодвид, ТекНезаполненныеКодыНедопустимы,  СтрТЧ, СтруктураНастройки, ТаблицаДоходовЭтотГод, ТаблицаПодвидов, ЕстьОшибки, СообщениеПоКС);
						
						ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КРБ Тогда
							
							Если ТаблицаРасходов = Неопределено Тогда
								ТаблицаРасходов = ПолучитьТаблицуЦСРасходов(ДатаДействия);
							КонецЕсли;
							Если ТаблицаУниверсальныхПрограммЦС = Неопределено Тогда
								ТаблицаУниверсальныхПрограммЦС = ПолучитьТаблицуУниверсальныхПрограммЦСРасходов(ДатаДействия);
							КонецЕсли;
					
							ПроверитьПоКРБ(ТекНезаполненныеКодыНедопустимы, СтрТЧ, СтруктураНастройки, ТаблицаРасходов, ТаблицаУниверсальныхПрограммЦС, ЕстьОшибки, СообщениеПоКС);
							
						ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.КИФ Тогда	
							
							Если ТаблицаИсточников = Неопределено Тогда
								ТаблицаИсточников = ПолучитьКлассификациюИсточников(ДатаДействия);
							КонецЕсли;
					
							ПроверитьПоКИФ(ГруппировочныеКодыНедопустимы, ТекНезаполненныеКодыНедопустимы,  СтрТЧ, СтруктураНастройки, ТаблицаИсточников, ЕстьОшибки, СообщениеПоКС);
							
						ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.СоответствияЦелевыхСтатейВидовДоходов Тогда	
							
							Продолжить; //В БГУ не выполняется
							
						ИначеЕсли ВыборкаВидКонтроля.ВариантКонтроляБК = Перечисления.ВариантКонтроляБК.ОтдельныеСправочники Тогда
							
							Если ТекВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.АналитическиеКодыКПС Тогда
								
								Если ТаблицаАнКодыКПС = Неопределено Тогда
									ТаблицаАнКодыКПС = ПолучитьТаблицуАнКодовКПС(ДатаДействия);
								КонецЕсли;
								
								ТекПустойКод = ПустойАнКодКПС;
								ТаблицаПоиска = ТаблицаАнКодыКПС;
								
								ТекКод = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.Код]),СтрТЧ[СтруктураНастройки.Код],ТекПустойКод);
														
								Если ТекКод = ТекПустойКод Тогда
									
									Если ТекНезаполненныеКодыНедопустимы Тогда
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='Не заполнен аналитический код КПС %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
									КонецЕсли;
									
								Иначе
									СтруктураПоиска = Новый Структура("Код");
									СтруктураПоиска.Код = ТекКод;
																		
									СообщениеПоКС = "";
																	
									НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
									Если НайденныеСтроки.Количество() = 0 Тогда
										//такого кода нет - ошибка
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='В классификаторе аналитических кодов КПС отсутствует код %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
										
									КонецЕсли;
									
								КонецЕсли;
								
							ИначеЕсли ТекВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ВидыРасходовКРБ Тогда
								
								Если ТаблицаКВР = Неопределено Тогда
									ТаблицаКВР = ПолучитьТаблицуКВР(ДатаДействия);
								КонецЕсли;
								
								ТекПустойКод = ПустойКВР;
								ТаблицаПоиска= ТаблицаКВР;
								
								ТекКод = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.Код]),СтрТЧ[СтруктураНастройки.Код],ТекПустойКод);
								
								Если ТекКод = ТекПустойКод Тогда
									
									Если ТекНезаполненныеКодыНедопустимы Тогда
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='Не заполнен вид расхода %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
									КонецЕсли;
									
								Иначе
									СтруктураПоиска = Новый Структура("Код");
									СтруктураПоиска.Код = ТекКод;
																		
									СообщениеПоКС = "";
																		
									НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
									Если НайденныеСтроки.Количество() = 0 Тогда
										//такого кода нет - ошибка
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='В классификаторе Видов расходов отсутствует код %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
										
									КонецЕсли;
									
								КонецЕсли;
								
							ИначеЕсли ТекВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.ГлавыПоБюджетнойКлассификации Тогда
								
								Если ТаблицаГлав = Неопределено Тогда
									ТаблицаГлав = ПолучитьТаблицуГлавыПоБК(ДатаДействия);
								КонецЕсли;
								
								ТекПустойКод = ПустаяГлава;							
								ТаблицаПоиска= ТаблицаГлав;
								
								ТекКод = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.Код]),СтрТЧ[СтруктураНастройки.Код],ТекПустойКод);
								
								Если ТекКод = ТекПустойКод Тогда
									
									Если ТекНезаполненныеКодыНедопустимы Тогда
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='Не заполнена Глава по БК %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
									КонецЕсли;
									
								Иначе
									СтруктураПоиска = Новый Структура("Код");
									СтруктураПоиска.Код = ТекКод;
																		
									СообщениеПоКС = "";									
									
									НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
									Если НайденныеСтроки.Количество() = 0 Тогда
										//такого кода нет - ошибка
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='В классификаторе Глав по БК отсутствует код %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
										
									КонецЕсли;
									
								КонецЕсли;
								
							ИначеЕсли ТекВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.КОСГУ Тогда
								
								Если ТаблицаКОСГУ = Неопределено Тогда
									ТаблицаКОСГУ = ПолучитьТаблицуКОСГУ(ДатаДействия);
								КонецЕсли;
								
								ТекПустойКод = ПустойКодКЭК;
								ТаблицаПоиска= ТаблицаКОСГУ;
								
								ТекКод = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.Код]),СтрТЧ[СтруктураНастройки.Код],ТекПустойКод);
								
								Если ТекКод = ТекПустойКод Тогда
									
									Если ТекНезаполненныеКодыНедопустимы Тогда
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='Не заполнен КОСГУ %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
									КонецЕсли;
									
								Иначе
									СтруктураПоиска = Новый Структура("Код");
									СтруктураПоиска.Код = ТекКод;
																		
									СообщениеПоКС = "";									
									
									НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
									Если НайденныеСтроки.Количество() = 0 Тогда
										//такого кода нет - ошибка
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='В классификаторе КОСГУ отсутствует код %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
										
									КонецЕсли;
									
								КонецЕсли;
								
							ИначеЕсли ТекВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.КОСГУ_ВидыРасходовКРБ Тогда
								
								Если ТаблицаКОСГУ = Неопределено Тогда
									ТаблицаКОСГУ = ПолучитьТаблицуКОСГУ(ДатаДействия);
								КонецЕсли;
								
								ТекПустойКод = ПустойКодКЭК;
								ТаблицаПоиска= ТаблицаКОСГУ;
								
								ТекКод = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.Код]),СтрТЧ[СтруктураНастройки.Код],ТекПустойКод);
								
								Если ТекКод = ТекПустойКод Тогда
									
									Если ТекНезаполненныеКодыНедопустимы Тогда
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='Не заполнена аналитика КОСГУ/КВР %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
									КонецЕсли;
									
								Иначе
									СтруктураПоиска = Новый Структура("Код");
									СтруктураПоиска.Код = ТекКод;
																		
									СообщениеПоКС = "";									
									
									НайденныеСтроки = ТаблицаКОСГУ.НайтиСтроки(СтруктураПоиска);
									КодНайден = (НайденныеСтроки.Количество() > 0);
									
									Если КодНайден = Ложь Тогда
										Если ТаблицаКВР = Неопределено Тогда
											ТаблицаКВР = ПолучитьТаблицуКВР(ДатаДействия);
										КонецЕсли;
										НайденныеСтроки = ТаблицаКВР.НайтиСтроки(СтруктураПоиска);
										КодНайден = (НайденныеСтроки.Количество() > 0);
									КонецЕсли;	
										
									Если КодНайден = Ложь Тогда
										//такого кода нет - ошибка
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='В классификаторе КОСГУ и Видов расходов отсутствует код %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
										
									КонецЕсли;
									
								КонецЕсли;
							ИначеЕсли ТекВидКлассификатора = Перечисления.ВидыКлассификаторовОтчетов.РазделыПодразделыКРБ Тогда
								
								Если ТаблицаРазделов = Неопределено Тогда
									ТаблицаРазделов = ПолучитьТаблицуРазделов(ДатаДействия);
								КонецЕсли;
								
								ТекПустойКод = ПустойРаздел;
								ТаблицаПоиска= ТаблицаРазделов;
								
								ТекКод = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.Код]),СтрТЧ[СтруктураНастройки.Код],ТекПустойКод);
								
								Если ТекКод = ТекПустойКод Тогда
									
									Если ТекНезаполненныеКодыНедопустимы Тогда
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='Не заполнен раздел, подраздел расходов %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
									КонецЕсли;
									
								Иначе
									СтруктураПоиска = Новый Структура("Код");
									СтруктураПоиска.Код = ТекКод;
																		
									СообщениеПоКС = "";									
									
									НайденныеСтроки = ТаблицаПоиска.НайтиСтроки(СтруктураПоиска);
									Если НайденныеСтроки.Количество() = 0 Тогда
										//такого кода нет - ошибка
										ЕстьОшибки = Истина;
										СообщениеПоКС = НСтр("ru='В классификаторе Разделов, подразделов расходов отсутствует код %1.'");
										СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКод);
										
									КонецЕсли;
									
								КонецЕсли;	
							Иначе
								ВызватьИсключение "Выбрана не корректная аналитика.";
							КонецЕсли;
							
						КонецЕсли;	
						
						НоваяСтрока = ПоказателиТекущийСтроки.Добавить();
						НоваяСтрока.Ошибка = ЕстьОшибки;										
						НоваяСтрока.СообщениеПоКС = СообщениеПоКС;
						
					КонецЦикла;
					
					
				Исключение
					ТекстОшибкиДляЖурнала = Нстр("ru='Не удалось выполнить проверку отчета ""%1"" по КС ""%2"" по причине: %3'");
					
					ТекстОписания = ОписаниеОшибки();
					//обрежем лишнее
					ПозицияНачалаПодробнойИнформации = СтрНайти(ТекстОписания,"}:");
					Если ПозицияНачалаПодробнойИнформации > 0 Тогда
						ТекстОписания = Сред(ТекстОписания,ПозицияНачалаПодробнойИнформации+2);
					КонецЕсли;
					
					ПроверкаПройденаБезОшибокРасчета = Ложь;
					
					ТекстОшибкиДляЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибкиДляЖурнала,мОтчетОбъект.Ссылка,КонтрольноеСоотношение,ТекстОписания);
					
					ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Универсальный регламентированный отчет.Проверка отчета",УровеньЖурналаРегистрации.Ошибка,Метаданные.Справочники.КонтрольныеСоотношения,КонтрольноеСоотношение,ТекстОшибкиДляЖурнала);
					
					ТекстОшибкиДляПротокола = Нстр("ru='Ошибка расчета контрольного соотношения. Не удалось выполнить проверку по причине: %1'");
					ТекстОшибкиДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибкиДляПротокола,ТекстОписания);
					
					СтрокаСоотношений.РасчетВыполнен = Ложь;//ошибка
					СтрокаСоотношений.ТекстОшибкиРасчета = ТекстОшибкиДляПротокола;
					
				КонецПопытки;
				
			КонецЦикла;
			
			Если СтрокаСоотношений.РезультатРасчета И ПоказателиТекущийСтроки.Итог("Ошибка") Тогда
				СтрокаСоотношений.РезультатРасчета = Ложь;
				
				Если СтрокаСоотношений.Дополнительное Тогда
					ВФПредупреждения = ВФПредупреждения + 1; 
				Иначе
					ВФОшибки = ВФОшибки + 1;
				КонецЕсли;
			КонецЕсли;
		
			Если НЕ ЗначениеЗаполнено(КодСтроки) Тогда
				КодСтроки = "Ошибка";
			КонецЕсли;
		
			СтрокиОтчета = Новый Структура;
			СтруктураСтроки = Новый Структура("БК_НаименованиеСтроки,ИтогПоСтроке,ТаблицаСтрок",НаименованиеСтроки,Истина,ПоказателиТекущийСтроки);			
			СтрокиОтчета.Вставить(КодСтроки,СтруктураСтроки);
				
			Если СтрокаСоотношений.Дополнительное Тогда
				ПроверкаПройденаБезПредупреждений = ПроверкаПройденаБезПредупреждений И СтрокаСоотношений.РезультатРасчета;
			Иначе
				ПроверкаПройденаБезОшибок = ПроверкаПройденаБезОшибок И СтрокаСоотношений.РезультатРасчета;
			КонецЕсли;
				
			СтрокаСоотношений.ГруппаРаскрытия	= ТекГруппаРаскрытия;
			СтрокаСоотношений.СтрокиОтчета		= СтрокиОтчета;
			
		КонецЦикла;
						
	КонецЦикла;
		
	РезультатПроверки = Новый Структура();
	РезультатПроверки.Вставить("БезОшибок", ПроверкаПройденаБезОшибок);
	РезультатПроверки.Вставить("БезПредупреждений",ПроверкаПройденаБезПредупреждений);
	РезультатПроверки.Вставить("БезОшибокРасчета",ПроверкаПройденаБезОшибокРасчета);
	
	РезультатПроверки.Вставить("ВФКонтроль",		Истина);
	РезультатПроверки.Вставить("ВФОшибки",			ВФОшибки);
	РезультатПроверки.Вставить("ВФПредупреждения",	ВФПредупреждения);
	
	РезультатПроверки.Вставить("МФКонтроль",		Ложь);
	РезультатПроверки.Вставить("МФОшибки",			0);
	РезультатПроверки.Вставить("МФПредупреждения",	0);

	Возврат РезультатПроверки;
КонецФункции

Процедура ПроверитьПоКИФ(Знач ГруппировочныеКодыНедопустимы, Знач НезаполненныеКодыНедопустимы, Знач СтрТЧ, Знач СтруктураНастройки, Знач ТаблицаИсточников, ЕстьОшибки, СообщениеПоКС)
	
	Перем НайденнаяСтрока, НайденныеСтроки, ПровСтрока, ТекКодВида, ТекКодГруппы, ТекКодКЭК, ТекКодСтатьи;
	
	//КодГруппы,КодСтатьи,КодВида,КодКЭК
	
	ТекКодГруппы = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодГруппы]),СтрТЧ[СтруктураНастройки.КодГруппы],ПустаяГруппа);
	ТекКодСтатьи = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодСтатьи]),СтрТЧ[СтруктураНастройки.КодСтатьи],ПустаяСтатья);
	ТекКодВида = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодВида]),СтрТЧ[СтруктураНастройки.КодВида],ПустойВид);
	ТекКодКЭК = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодКЭК]),СтрТЧ[СтруктураНастройки.КодКЭК],ПустойКодКЭК);
	
	Если ТекКодГруппы = ПустаяГруппа
		И ТекКодСтатьи = ПустаяСтатья
		И ТекКодВида = ПустойВид
		И ТекКодКЭК = ПустойКодКЭК Тогда
		
		Если НезаполненныеКодыНедопустимы Тогда
			ЕстьОшибки = Истина;
			СообщениеПоКС = НСтр("ru='Не заполнен код классификации источников %1 %2 %3 %4.'");
			СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодГруппы,ТекКодСтатьи,ТекКодВида,ТекКодКЭК);
		КонецЕсли;
		
	Иначе					
		
		СтруктураПоиска = Новый Структура("КодГруппы,КодСтатьи,КодВида,КодКЭК");
		СтруктураПоиска.КодГруппы = ТекКодГруппы;
		СтруктураПоиска.КодСтатьи = ТекКодСтатьи;
		СтруктураПоиска.КодВида = ТекКодВида;
		СтруктураПоиска.КодКЭК = ТекКодКЭК;
		
		СообщениеПоКС = "";
		
		//т.к. в КИФ подвида в строке отчета может не быть, а в классификаторе есть строки с подвидом, то:
		//если подвид в строке заполнен, все стандартно - ищем по полному коду, проверка для опции ГруппировочныеКодыНедопустимы - обычная
		//если подвида в строке нет, то возможны 2 варианта:
		//1 - в классификаторе у данного кода подвид есть, тогда для опции ГруппировочныеКодыНедопустимы надо смотреть, 
		//	что у подчиненных строк не заполнен подвид - только в этом случае будет ошибка, что строка не детальная
		//2 - в классификаторе у данного кода подвида нет, тогда все просто, значит у текущего кода не должно быть детальных строк
		//Итог.
		//Если в строке не заполнен подвид, и стоит флаг ГруппировочныеКодыНедопустимы, то смотрим - есть ли детальные строки у которых не заполнен подвид,
		//если такие есть, значит это ошибка.
		
		НайденныеСтроки = ТаблицаИсточников.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			//такого кода нет - ошибка
			ЕстьОшибки = Истина;
			СообщениеПоКС = НСтр("ru='В классификаторе источников финансирования отсутствует код %1 %2 %3 %4.'");
			СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодГруппы,ТекКодСтатьи,ТекКодВида,ТекКодКЭК);	
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];//дублей быть не должно, поэтому смотрим первый код
			
			ЕстьОшибки = Ложь;
			
			Если ГруппировочныеКодыНедопустимы 
				И СтрТЧ.ПромежуточныйИтог = Ложь Тогда
				
				//Проверяем, что выбран детальный код только в том случае, если по строке нет показателей с промежуточными итогами
				Если НайденнаяСтрока.СтрокаДерева.Строки.Количество() Тогда
					Если ТекКодВида <> ПустойВид Тогда 
						//подвид заполнен, значит любая детальная строка это ошибка
						ЕстьОшибки = Истина;
						СообщениеПоКС = НСтр("ru='Указан группировочный код %1 %2 %3 %4.'");
						СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодГруппы,ТекКодСтатьи,ТекКодВида,ТекКодКЭК);
					Иначе
						//подвид не заполнен, проверим, что в детальных строках заполнен подвид
						Для Каждого ПровСтрока Из НайденнаяСтрока.СтрокаДерева.Строки Цикл
							Если ПровСтрока.КодВида = "0000" Тогда
								ЕстьОшибки = Истина;
								СообщениеПоКС = НСтр("ru='Указан группировочный код %1 %2 %3 %4.'");
								СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодГруппы,ТекКодСтатьи,ТекКодВида,ТекКодКЭК);
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли;							
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПоКРБ(Знач НезаполненныеКодыНедопустимы, Знач СтрТЧ, Знач СтруктураНастройки,  Знач ТаблицаРасходов, Знач ТаблицаУниверсальныхПрограммЦС, ЕстьОшибки, СообщениеПоКС)
	
	Перем НайденныеСтрокиЦС, ПрограммаНайдена, СтруктураПоискаПрограммыЦС, СтруктураПоискаЦС, ТекКодПрограммыЦС, ТекКодЦС, ЦСНайдена;
	
	//КодЦС,КодПрограммыЦС
	
	ТекКодЦС = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодЦС]),СтрТЧ[СтруктураНастройки.КодЦС],ПустаяЦС);
	ТекКодПрограммыЦС = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодПрограммыЦС]),СтрТЧ[СтруктураНастройки.КодПрограммыЦС],ПустаяПрограмма);
		
	Если ТекКодЦС = ПустаяЦС
		И ТекКодПрограммыЦС = ПустаяПрограмма Тогда
		
		Если НезаполненныеКодыНедопустимы Тогда
			ЕстьОшибки = Истина;
			СообщениеПоКС = НСтр("ru='Не заполнен код классификации целевых статей расходов %1 %2.'");
			СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодЦС,ТекКодПрограммыЦС);
		КонецЕсли;
		
	Иначе
		
		СтруктураПоиска = Новый Структура("КодЦС,КодПрограммыЦС");
		СтруктураПоиска.КодЦС = ТекКодЦС;
		СтруктураПоиска.КодПрограммыЦС = ТекКодПрограммыЦС;
	
		//ищем полный код
		Если ТаблицаРасходов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			
			Если ТекКодПрограммыЦС<>ПустаяПрограмма Тогда
				//если программ цс не пустая,
				//то проверим отдельно ЦС, а программу - в универсальных
				//если пустая, и не нашлось, значит ошибка, т.к. в таблице расходов есть коды ЦС с пустыми программами
				
				СтруктураПоискаЦС = Новый Структура("КодЦС", ТекКодЦС);
				НайденныеСтрокиЦС = ТаблицаРасходов.НайтиСтроки(СтруктураПоискаЦС);
				
				ЦСНайдена = (НайденныеСтрокиЦС.Количество()>0);
				ПрограммаНайдена = Ложь;
				
				Если ЦСНайдена Тогда
					СтруктураПоискаПрограммыЦС = Новый Структура("КодПрограммыЦС", ТекКодПрограммыЦС);
					ПрограммаНайдена = ТаблицаУниверсальныхПрограммЦС.НайтиСтроки(СтруктураПоискаПрограммыЦС).Количество()>0;
				КонецЕсли;
				
				Если ЦСНайдена = Ложь
					ИЛИ ПрограммаНайдена = Ложь Тогда
					
					ЕстьОшибки = Истина;
					СообщениеПоКС = НСтр("ru='В классификаторе целевых статей расходов отсутствует код %1 %2.'");
					СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодЦС,ТекКодПрограммыЦС);
				КонецЕсли;
			Иначе
				//код не найден
				ЕстьОшибки = Истина;
				СообщениеПоКС = НСтр("ru='В классификаторе целевых статей расходов отсутствует код %1 %2.'");
				СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодЦС,ТекКодПрограммыЦС);
			КонецЕсли;
			
		Иначе
			//ошибки нет
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПоКДБ(Знач ГруппировочныеКодыНедопустимы, Знач ЕстьПодвид, Знач НезаполненныеКодыНедопустимы, Знач СтрТЧ, Знач СтруктураНастройки, Знач ТаблицаДоходовЭтотГод, ТаблицаПодвидов, ЕстьОшибки, СообщениеПоКС)
	
	Перем НайденКодПодвида, НайденнаяСтрока, НайденныеСтроки, ТекКодВД, ТекКодКЭК, ТекПодвид;
	
	ТекКодВД = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодВД]),СтрТЧ[СтруктураНастройки.КодВД],ПустойКодВД);
	ТекКодКЭК = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.КодКЭК]),СтрТЧ[СтруктураНастройки.КодКЭК],ПустойКодКЭК);
	
	Если ЕстьПодвид Тогда
		ТекПодвид = ?(ЗначениеЗаполнено(СтрТЧ[СтруктураНастройки.Подвид]),СтрТЧ[СтруктураНастройки.Подвид],ПустойПодвид);
	Иначе
		ТекПодвид = "0000";
	КонецЕсли;
	
	Если ТекКодВД = ПустойКодВД
		И ТекПодвид = ПустойПодвид
		И ТекКодКЭК = ПустойКодКЭК Тогда
		
		Если НезаполненныеКодыНедопустимы Тогда
			ЕстьОшибки = Истина;
			СообщениеПоКС = НСтр("ru='Не заполнен код классификации доходов %1 %2 %3.'");
			СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
		КонецЕсли;
		
	Иначе
		
		СтруктураПоиска = Новый Структура("КодВД,КодКЭК");
		
		СтруктураПоиска.КодВД = ТекКодВД;
		СтруктураПоиска.КодКЭК = ТекКодКЭК;
		
		СообщениеПоКС = "";
		
		НайденныеСтроки = ТаблицаДоходовЭтотГод.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() = 0 Тогда
			//такого кода нет в таблице доходов этого года, поищем в таблице следующего года
			Если ТаблицаДоходовСледущийГод = Неопределено Тогда
				ДатаСледующегоГода = НачалоДня(ДобавитьМесяц(КонецГода(ДатаДействия),12));
				ТаблицаДоходовСледущийГод = ПолучитьКлассификациюДоходовИсключаяТекущийГод(ДатаСледующегоГода,ТаблицаДоходовЭтотГод);		
			КонецЕсли;
			
			НайденныеСтроки = ТаблицаДоходовСледущийГод.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				ОшибкаГруппировочныйКод = Ложь;
				ОшибкаОтсутствуетПодвид = Ложь;
				НайденнаяСтрока = НайденныеСтроки[0];//дублей быть не должно, поэтому смотрим первый код
				//код есть
				//если стоит флаг Только детальные, проверить, что у строки дерева нет подчиненных строк
				//если подчиненные строки есть, значит это ошибка
								
				Если ГруппировочныеКодыНедопустимы 
					И СтрТЧ.ПромежуточныйИтог = Ложь Тогда
					//Проверяем, что выбран детальный код только в том случае, если по строке нет показателей с промежуточными итогами
					Если НайденнаяСтрока.ЕстьДетальные Тогда
						ОшибкаГруппировочныйКод = Истина;
					КонецЕсли;							
				КонецЕсли;
				
				Если ЕстьОшибки = Ложь 
					И ОшибкаГруппировочныйКод = Ложь Тогда
					//проверка ГруппыПодвидовКДБ
					
					Если ТекПодвид <> ПустойПодвид Тогда
						
						НайденКодПодвида = НайтиПодвидДоходов(ТекПодвид, ТекКодВД, ТаблицаПодвидов);
						
						Если НайденКодПодвида = Ложь Тогда
							ОшибкаОтсутствуетПодвид = Истина;							
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;								
								
				ЕстьОшибки = Истина;
				Если ОшибкаГруппировочныйКод Тогда
					
					СообщениеПоКС = НСтр("ru='В отчете выбран ГРУППИРОВОЧНЫЙ код доходов %1 %2 %3, действующий только со СЛЕДУЮЩЕГО года.'");
					СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
					
				ИначеЕсли ОшибкаОтсутствуетПодвид Тогда
					
					СообщениеПоКС = НСтр("ru='В отчете выбран код доходов %1 %2 %3, действующий только со СЛЕДУЮЩЕГО года.
					|Для данного кода вида дохода %1 в классификаторе отсутствует код подвида %2.'");
					СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
					
				Иначе
				
					СообщениеПоКС = НСтр("ru='В отчете выбран код доходов %1 %2 %3, действующий только со СЛЕДУЮЩЕГО года.'");
					СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
				КонецЕсли;
				
			Иначе
				//такого кода нет в таблице доходов следующего года, поищем в таблице прошлого года
				Если ТаблицаДоходовПрошлыйГод = Неопределено Тогда
					ДатаПрошлогоГода = НачалоДня(ДобавитьМесяц(КонецГода(ДатаДействия),-12));
					ТаблицаДоходовПрошлыйГод = ПолучитьКлассификациюДоходовИсключаяТекущийГод(ДатаПрошлогоГода,ТаблицаДоходовЭтотГод);		
				КонецЕсли;
				
				НайденныеСтроки = ТаблицаДоходовПрошлыйГод.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтроки.Количество() > 0 Тогда
					
					ОшибкаГруппировочныйКод = Ложь;
					ОшибкаОтсутствуетПодвид = Ложь;
					НайденнаяСтрока = НайденныеСтроки[0];//дублей быть не должно, поэтому смотрим первый код
					//код есть
					//если стоит флаг Только детальные, проверить, что у строки дерева нет подчиненных строк
					//если подчиненные строки есть, значит это ошибка
									
					Если ГруппировочныеКодыНедопустимы 
						И СтрТЧ.ПромежуточныйИтог = Ложь Тогда
						//Проверяем, что выбран детальный код только в том случае, если по строке нет показателей с промежуточными итогами
						Если НайденнаяСтрока.ЕстьДетальные Тогда
							ОшибкаГруппировочныйКод = Истина;
						КонецЕсли;							
					КонецЕсли;
					
					Если ЕстьОшибки = Ложь 
						И ОшибкаГруппировочныйКод = Ложь Тогда
						//проверка ГруппыПодвидовКДБ
						
						Если ТекПодвид <> ПустойПодвид Тогда
							
							НайденКодПодвида = НайтиПодвидДоходов(ТекПодвид, ТекКодВД, ТаблицаПодвидов);
							
							Если НайденКодПодвида = Ложь Тогда
								ОшибкаОтсутствуетПодвид = Истина;							
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;								
									
					ЕстьОшибки = Истина;
					Если ОшибкаГруппировочныйКод Тогда
						
						СообщениеПоКС = НСтр("ru='В отчете выбран ГРУППИРОВОЧНЫЙ код доходов %1 %2 %3, действующий только в ПРОШЛОМ году.'");
						СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
						
					ИначеЕсли ОшибкаОтсутствуетПодвид Тогда
						
						СообщениеПоКС = НСтр("ru='В отчете выбран код доходов %1 %2 %3, действующий только в ПРОШЛОМ году.
						|Для данного кода вида дохода %1 в классификаторе отсутствует код подвида %2.'");
						СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
						
					Иначе
					
						СообщениеПоКС = НСтр("ru='В отчете выбран код доходов %1 %2 %3, действующий только в ПРОШЛОМ году.'");
						СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
					КонецЕсли;
										
				Иначе
				    //такого кода нет нигде, запишем как ошибку
					ЕстьОшибки = Истина;
					СообщениеПоКС = НСтр("ru='В классификаторе доходов отсутствует код %1 %2 %3.'");
					СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
				КонецЕсли;
				
			КонецЕсли;
		Иначе
			НайденнаяСтрока = НайденныеСтроки[0];//дублей быть не должно, поэтому смотрим первый код
			//код есть
			//если стоит флаг Только детальные, проверить, что у строки дерева нет подчиненных строк
			//если подчиненные строки есть, значит это ошибка
			
			ЕстьОшибки = Ложь;
			
			Если ГруппировочныеКодыНедопустимы 
				И СтрТЧ.ПромежуточныйИтог = Ложь Тогда
				//Проверяем, что выбран детальный код только в том случае, если по строке нет показателей с промежуточными итогами
				Если НайденнаяСтрока.ЕстьДетальные Тогда
					ЕстьОшибки = Истина;
					СообщениеПоКС = НСтр("ru='Указан группировочный код %1 %2 %3.'");
					СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид,ТекКодКЭК);
				КонецЕсли;							
			КонецЕсли;
			
			Если ЕстьОшибки = Ложь Тогда
				//проверка ГруппыПодвидовКДБ
				
				Если ТекПодвид <> ПустойПодвид Тогда
					
					НайденКодПодвида = НайтиПодвидДоходов(ТекПодвид, ТекКодВД, ТаблицаПодвидов);
					
					Если НайденКодПодвида = Ложь Тогда
						ЕстьОшибки = Истина;
						СообщениеПоКС = НСтр("ru='В классификаторе доходов для кода вида дохода %1 отсутствует код подвида %2.'");
						СообщениеПоКС = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СообщениеПоКС,ТекКодВД,ТекПодвид);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТаблицуРаскрытияАналитики(ГруппаРаскрытия)
	
	Запрос = Новый Запрос;
	
	НовИндекс = мОтчетОбъект.мПоказателиРаскрытия.Индексы.Добавить("ГруппаРаскрытия");
		
	РабТаблица = мОтчетОбъект.мПоказателиРаскрытия.Скопировать(Новый Структура("ГруппаРаскрытия",ГруппаРаскрытия));
	
	мОтчетОбъект.мПоказателиРаскрытия.Индексы.Удалить(НовИндекс);
		
	
	Запрос.УстановитьПараметр("мПоказателиРаскрытия",РабТаблица);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мПоказателиРаскрытия.ГруппаРаскрытия КАК ГруппаРаскрытия,";
	Для Сч = 1 По мОтчетОбъект.мЧислоДопАналитик Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	мПоказателиРаскрытия.Аналитика"+Сч+",";
		
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + "
	|	мПоказателиРаскрытия.ПромежуточныйИтог КАК ПромежуточныйИтог,
	|	мПоказателиРаскрытия.Индекс КАК Индекс
	|ПОМЕСТИТЬ ПоказателиРаскрытия
	|ИЗ
	|	&мПоказателиРаскрытия КАК мПоказателиРаскрытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиРаскрытия.ГруппаРаскрытия КАК ГруппаРаскрытия,";
	Для Сч = 1 По мОтчетОбъект.мЧислоДопАналитик Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	ПоказателиРаскрытия.Аналитика"+Сч+",";
		
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + "
	|	МАКСИМУМ(ПоказателиРаскрытия.ПромежуточныйИтог) КАК ПромежуточныйИтог,
	|	ПоказателиРаскрытия.Индекс КАК Индекс
	|ИЗ
	|	ПоказателиРаскрытия КАК ПоказателиРаскрытия
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиРаскрытия.ГруппаРаскрытия,";
	Для Сч = 1 По мОтчетОбъект.мЧислоДопАналитик Цикл
		
		Запрос.Текст = Запрос.Текст + "
		|	ПоказателиРаскрытия.Аналитика"+Сч+",";
		
	КонецЦикла;
	Запрос.Текст = Запрос.Текст + "
	|	ПоказателиРаскрытия.Индекс
	|УПОРЯДОЧИТЬ ПО 
	|	ПоказателиРаскрытия.Индекс";
	
	ТекТаблицаРаскрытия = Запрос.Выполнить().Выгрузить();
	
	Возврат ТекТаблицаРаскрытия;	

КонецФункции

Функция НайтиПодвидДоходов(Знач ТекКодПодвида, Знач ТекКодВД, ТаблицаПодвидов)
	
	НайденКодПодвидаВКДБ = Ложь;
	
	Если ТаблицаПодвидов = Неопределено Тогда
		ТаблицаПодвидов = ПолучитьТаблицуПодвидовДоходов();
	КонецЕсли;
	
	СтруктураПоискаПодвида = Новый Структура("ВидДоходаКод,КодПодвида");
	
	СтруктураПоискаПодвида.ВидДоходаКод = ТекКодВД;
	СтруктураПоискаПодвида.КодПодвида = ТекКодПодвида;
	
	НайденКодПодвидаВКДБ = (ТаблицаПодвидов.НайтиСтроки(СтруктураПоискаПодвида).Количество() > 0);
	Если НайденКодПодвидаВКДБ = Ложь Тогда
		//попробуем найти универсальный подвид
		Если ТекКодВД <> ПустойКодВД Тогда
			СтруктураПоискаПодвида.ВидДоходаКод = ПустойКодВД;
			НайденКодПодвидаВКДБ = (ТаблицаПодвидов.НайтиСтроки(СтруктураПоискаПодвида).Количество() > 0);
		КонецЕсли;
	Иначе
		//нашли, ошибки нет
		НайденКодПодвидаВКДБ = Истина;
	КонецЕсли;
	
	Возврат НайденКодПодвидаВКДБ;
КонецФункции

Функция ПолучитьКлассификациюДоходов(Знач ДатаДействия)
	
	Возврат БюджетнаяОтчетностьСерверПовтИсп.ПолучитьКлассификациюДоходов(ДатаДействия);
	
КонецФункции

Функция ПолучитьКлассификациюДоходовИсключаяТекущийГод(Знач ДатаДействия, ТаблицаДоходовЭтогоГода)
	//Получим таблицу кодов доходов, которые действуют только в прошлом/следующем году.
	//Для этого из таблицы всех действующих кодов на нужную дату исключим коды, которые действуют в этом году,
	//чтобы уменьшить размер таблицы и ускорить поиск по ней.
	
	ТекТаблица = БюджетнаяОтчетностьСерверПовтИсп.ПолучитьКлассификациюДоходов(ДатаДействия);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотГод",ТаблицаДоходовЭтогоГода);
	Запрос.УстановитьПараметр("ДругойГод",ТекТаблица);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтотГод.КодВД КАК КодВД,
		|	ЭтотГод.КодКЭК КАК КодКЭК,
		|	ЭтотГод.ЕстьДетальные КАК ЕстьДетальные
		|ПОМЕСТИТЬ ЭтотГод
		|ИЗ
		|	&ЭтотГод КАК ЭтотГод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КодВД,
		|	КодКЭК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДругойГод.КодВД КАК КодВД,
		|	ДругойГод.КодКЭК КАК КодКЭК,
		|	ДругойГод.ЕстьДетальные КАК ЕстьДетальные
		|ПОМЕСТИТЬ ДругойГод
		|ИЗ
		|	&ДругойГод КАК ДругойГод
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	КодВД,
		|	КодКЭК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДругойГод.КодВД КАК КодВД,
		|	ДругойГод.КодКЭК КАК КодКЭК,
		|	ДругойГод.ЕстьДетальные КАК ЕстьДетальные
		|ИЗ
		|	ДругойГод КАК ДругойГод
		|ГДЕ
		|	НЕ ИСТИНА В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					ИСТИНА
		|				ИЗ
		|					ЭтотГод КАК ЭтотГод
		|				ГДЕ
		|					ЭтотГод.КодВД = ДругойГод.КодВД
		|					И ЭтотГод.КодКЭК = ДругойГод.КодКЭК)";
	
	ТаблицаДоходовБезКодовЭтогоГода = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДоходовБезКодовЭтогоГода.Индексы.Добавить("КодВД,КодКЭК");
	
	Возврат ТаблицаДоходовБезКодовЭтогоГода;
		
КонецФункции

Функция ПолучитьКлассификациюИсточников(Знач ДатаДействия)
	ДеревоКИФ = Новый ДеревоЗначений;
	
	ДеревоКИФ.Колонки.Добавить("Ссылка");
	ДеревоКИФ.Колонки.Добавить("ПометкаУдаления");
	ДеревоКИФ.Колонки.Добавить("ЕстьПодчиненныеСтроки");
	ДеревоКИФ.Колонки.Добавить("Код");
	ДеревоКИФ.Колонки.Добавить("КОСГУ");
	ДеревоКИФ.Колонки.Добавить("Наименование");
	ДеревоКИФ.Колонки.Добавить("ДатаНачалаДействия");
	ДеревоКИФ.Колонки.Добавить("ОкончаниеДействия");
	ДеревоКИФ.Колонки.Добавить("ДатаОкончанияДействия");
	ДеревоКИФ.Колонки.Добавить("ИндексКартинки");
	ДеревоКИФ.Колонки.Добавить("Бюджет");
	ДеревоКИФ.Колонки.Добавить("СсылкаКОСГУ");
	ДеревоКИФ.Колонки.Добавить("Уровень");
	ДеревоКИФ.Колонки.Добавить("КодГруппы");
	ДеревоКИФ.Колонки.Добавить("КодСтатьи");
	ДеревоКИФ.Колонки.Добавить("КодВида");
	ДеревоКИФ.Колонки.Добавить("КодКЭК");
	ДеревоКИФ.Колонки.Добавить("ГруппаПодгруппаКИФ");
	ДеревоКИФ.Колонки.Добавить("СтатьяКИФ");
	ДеревоКИФ.Колонки.Добавить("ПодвидВидаКИФ");
		
	Справочники.ГруппыПодгруппыКИФ.ЗаполнитьДеревоКлассификатораИсточников(ДеревоКИФ,ДатаДействия);
	
	ТаблицаИсточники = Новый ТаблицаЗначений;
	ТаблицаИсточники.Колонки.Добавить("КодГруппы");
	ТаблицаИсточники.Колонки.Добавить("КодСтатьи");
	ТаблицаИсточники.Колонки.Добавить("КодВида");
	ТаблицаИсточники.Колонки.Добавить("КодКЭК");
	ТаблицаИсточники.Колонки.Добавить("СтрокаДерева");
	
	ПеренестиДеревоВТаблицу(ДеревоКИФ, ТаблицаИсточники,"СтрокаДерева");
	
	ТаблицаИсточники.Индексы.Добавить("КодГруппы,КодСтатьи,КодВида,КодКЭК");
	
	Возврат ТаблицаИсточники;
	
КонецФункции

Процедура ПеренестиДеревоВТаблицу(Дерево, Таблица, ЗаполняемаяГрафа)
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		НовСтр = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,СтрокаДерева);
		Если ЗаполняемаяГрафа = "СтрокаДерева" Тогда
			НовСтр.СтрокаДерева = СтрокаДерева;
		ИначеЕсли ЗаполняемаяГрафа = "ЕстьДетальные" Тогда
			НовСтр.ЕстьДетальные = СтрокаДерева.Строки.Количество()>0;	
		КонецЕсли;	
		
		ПеренестиДеревоВТаблицу(СтрокаДерева, Таблица, ЗаполняемаяГрафа);
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьТаблицуПодвидовДоходов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыПодвидовКДБ.Код КАК КодПодвида,
		|	ВЫБОР
		|		КОГДА ГруппыПодвидовКДБ.ВидДохода = ЗНАЧЕНИЕ(Справочник.ВидыДоходовКДБ.ПустаяСсылка)
		|			ТОГДА ""0000000000""
		|		ИНАЧЕ ГруппыПодвидовКДБ.ВидДохода.Код
		|	КОНЕЦ КАК ВидДоходаКод
		|ИЗ
		|	Справочник.ГруппыПодвидовКДБ КАК ГруппыПодвидовКДБ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаПодвидов = РезультатЗапроса.Выгрузить();
	ТаблицаПодвидов.Индексы.Добавить("ВидДоходаКод,КодПодвида");
	
	Возврат ТаблицаПодвидов;
	
КонецФункции

Функция ПолучитьТаблицуЦСРасходов(Знач ДатаДействия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЦелевыеСтатьиКРБ.Код КАК КодЦС,
		|	""00000"" КАК КодПрограммыЦС
		|ИЗ
		|	Справочник.ЦелевыеСтатьиКРБ КАК ЦелевыеСтатьиКРБ
		|ГДЕ
		|	ЦелевыеСтатьиКРБ.ДатаНачалаДействия <= &ДатаДействия
		|	И ЦелевыеСтатьиКРБ.ДатаОкончанияДействия >= &ДатаДействия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПрограммыЦелевыхСтатейКРБ.ЦелеваяСтатья.Код,
		|	ПрограммыЦелевыхСтатейКРБ.Код
		|ИЗ
		|	Справочник.ПрограммыЦелевыхСтатейКРБ КАК ПрограммыЦелевыхСтатейКРБ
		|ГДЕ
		|	ПрограммыЦелевыхСтатейКРБ.ДатаНачалаДействия <= &ДатаДействия
		|	И ПрограммыЦелевыхСтатейКРБ.ДатаОкончанияДействия >= &ДатаДействия
		|	И ПрограммыЦелевыхСтатейКРБ.ЦелеваяСтатья <> &ЦелеваяСтатья";
	
	Запрос.УстановитьПараметр("ДатаДействия", ДатаДействия);
	Запрос.УстановитьПараметр("ЦелеваяСтатья", Справочники.ЦелевыеСтатьиКРБ.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЦСРасходов = РезультатЗапроса.Выгрузить();
	ТаблицаЦСРасходов.Индексы.Добавить("КодЦС");
	ТаблицаЦСРасходов.Индексы.Добавить("КодЦС,КодПрограммыЦС");
	
	Возврат ТаблицаЦСРасходов;
	
КонецФункции

Функция ПолучитьТаблицуУниверсальныхПрограммЦСРасходов(Знач ДатаДействия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрограммыЦелевыхСтатейКРБ.Код КАК КодПрограммыЦС
		|ИЗ
		|	Справочник.ПрограммыЦелевыхСтатейКРБ КАК ПрограммыЦелевыхСтатейКРБ
		|ГДЕ
		|	ПрограммыЦелевыхСтатейКРБ.ДатаНачалаДействия <= &ДатаДействия
		|	И ПрограммыЦелевыхСтатейКРБ.ДатаОкончанияДействия >= &ДатаДействия
		|	И ПрограммыЦелевыхСтатейКРБ.ЦелеваяСтатья = &ЦелеваяСтатья";
	
	Запрос.УстановитьПараметр("ДатаДействия", ДатаДействия);
	Запрос.УстановитьПараметр("ЦелеваяСтатья", Справочники.ЦелевыеСтатьиКРБ.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаУниверсальныхПрограмм = РезультатЗапроса.Выгрузить();
	ТаблицаУниверсальныхПрограмм.Индексы.Добавить("КодПрограммыЦС");
	
	Возврат ТаблицаУниверсальныхПрограмм;
	
КонецФункции

Функция ПолучитьТаблицуГлавыПоБК(Знач ДатаДействия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спр.Код КАК Код
		|ИЗ
		|	Справочник.ГлавыПоБюджетнойКлассификации КАК Спр
		|ГДЕ
		|	Спр.ДатаНачалаДействия <= &ДатаДействия
		|	И Спр.ДатаОкончанияДействия >= &ДатаДействия";
	
	Запрос.УстановитьПараметр("ДатаДействия", ДатаДействия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКодов = РезультатЗапроса.Выгрузить();
	
	ТаблицаКодов.Индексы.Добавить("Код");
	
	Возврат ТаблицаКодов;
	
КонецФункции

Функция ПолучитьТаблицуКОСГУ(Знач ДатаДействия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спр.Код КАК Код
		|ИЗ
		|	Справочник.КОСГУ КАК Спр";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКодов = РезультатЗапроса.Выгрузить();
	
	ТаблицаКодов.Индексы.Добавить("Код");
	
	Возврат ТаблицаКодов;
	
КонецФункции

Функция ПолучитьТаблицуАнКодовКПС(Знач ДатаДействия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спр.Код КАК Код
		|ИЗ
		|	Справочник.АналитическиеКодыКПС КАК Спр";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКодов = РезультатЗапроса.Выгрузить();
	
	ТаблицаКодов.Индексы.Добавить("Код");
	
	Возврат ТаблицаКодов;
	
КонецФункции

Функция ПолучитьТаблицуКВР(Знач ДатаДействия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спр.Код КАК Код
		|ИЗ
		|	Справочник.ВидыРасходовКРБ КАК Спр
		|ГДЕ
		|	Спр.ДатаНачалаДействия <= &ДатаДействия
		|	И Спр.ДатаОкончанияДействия >= &ДатаДействия";
	
	Запрос.УстановитьПараметр("ДатаДействия", ДатаДействия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКодов = РезультатЗапроса.Выгрузить();
	
	ТаблицаКодов.Индексы.Добавить("Код");
	
	Возврат ТаблицаКодов;
	
КонецФункции

Функция ПолучитьТаблицуРазделов(Знач ДатаДействия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Спр.Код КАК Код
		|ИЗ
		|	Справочник.РазделыПодразделыКРБ КАК Спр";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКодов = РезультатЗапроса.Выгрузить();
	
	ТаблицаКодов.Индексы.Добавить("Код");
	
	Возврат ТаблицаКодов;
	
КонецФункции

// Процедура подготавливает переменную отчета "мКонтрольныеСоотношенияБК" 
// для заполнения проверки по контрольным соотношениям
Процедура ИнициализацияТаблицыПроверки()
	
	ТипБулево = БюджетнаяОтчетность.ПолучитьОписаниеТиповБулево();
	мОтчетОбъект.мКонтрольныеСоотношенияБК = Новый ТаблицаЗначений;
	
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("КонтрольноеСоотношение");
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("Описание");
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("Код");
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("НомерСоотношения");
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("Дополнительное",ТипБулево);
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("РезультатРасчета",ТипБулево);
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("ТекстПояснения");
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("СтрокиОтчета");
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("ГруппаРаскрытия");
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("ТекстОшибкиРасчета",Новый ОписаниеТипов("Строка"));
	мОтчетОбъект.мКонтрольныеСоотношенияБК.Колонки.Добавить("РасчетВыполнен",ТипБулево);
	
КонецПроцедуры

Функция ПолучитьСписокКСКонтрольБК(СписокКонтрольныхСоотношенийОтчета)
	
	Запрос = Новый Запрос;
	
	МассивПравилДляПроверки = БюджетнаяОтчетность.ПолучитьМассивНаследуемыхПравил(мОтчетОбъект.ВидОтчета,мОтчетОбъект.ПравилоПроверки);
	МассивПравилДляПроверки.Добавить(мОтчетОбъект.ПравилоПроверки);
	
	Запрос.УстановитьПараметр("ПравилаПроверки",МассивПравилДляПроверки);
	Запрос.УстановитьПараметр("КСПустаяСсылка",Справочники.КонтрольныеСоотношения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидОтчета",мОтчетОбъект.ВидОтчета);
	
	Если СписокКонтрольныхСоотношенийОтчета = Неопределено Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ПравилаПроверкиКонтрольныеСоотношения.КонтрольноеСоотношение, &КСПустаяСсылка) КАК КонтрольноеСоотношение
	               |ПОМЕСТИТЬ КСПравила
	               |ИЗ
	               |	Справочник.ПравилаПроверки.КонтрольныеСоотношения КАК ПравилаПроверкиКонтрольныеСоотношения
	               |ГДЕ
	               |	ПравилаПроверкиКонтрольныеСоотношения.Ссылка В (&ПравилаПроверки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КСПравила.КонтрольноеСоотношение КАК Ссылка
	               |ИЗ
	               |	КСПравила КАК КСПравила
	               |ГДЕ
	               |	КСПравила.КонтрольноеСоотношение.ВидКонтрольногоСоотношения = ЗНАЧЕНИЕ(Перечисление.ВидКонтрольногоСоотношения.КонтрольБК)
	               |	И КСПравила.КонтрольноеСоотношение.ПометкаУдаления = ЛОЖЬ
	               |	И КСПравила.КонтрольноеСоотношение.НеИспользуется = ЛОЖЬ
	               |	И НЕ КСПравила.КонтрольноеСоотношение = &КСПустаяСсылка
	               |	И КСПравила.КонтрольноеСоотношение.ВидОтчета = &ВидОтчета";
				   
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	КонтрольныеСоотношения.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.КонтрольныеСоотношения КАК КонтрольныеСоотношения
				|ГДЕ
				|	КонтрольныеСоотношения.Ссылка В(&СписокКонтрольныхСоотношений)
				|	И КонтрольныеСоотношения.ВидКонтрольногоСоотношения = ЗНАЧЕНИЕ(Перечисление.ВидКонтрольногоСоотношения.КонтрольБК)
				|	И КонтрольныеСоотношения.ВидОтчета = &ВидОтчета";
		
		Запрос.УстановитьПараметр("СписокКонтрольныхСоотношений",СписокКонтрольныхСоотношенийОтчета);	
		
	КонецЕсли;
				   
	СписокКонтрольныхСоотношений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
	СписокКонтрольныхСоотношений = мОтчетОбъект.ОтобратьКонтрольныеСоотношенияПоУсловию(СписокКонтрольныхСоотношений);
		
	Возврат СписокКонтрольныхСоотношений;
	
КонецФункции


#КонецОбласти

КэшЗначений				= Новый Соответствие;

//доходы
ПустойКодВД = "0000000000";
ПустойКодКЭК = "000";//ан.группа
ПустойПодвид = "0000";
//расходы
ПустаяЦС = "00000";
ПустаяПрограмма = "00000";
//источники
ПустаяГруппа = "0000";
ПустаяСтатья = "000000";
ПустойВид = "0000";
//ПустойКодКЭК - есть в доходах

//отдельные справочники
ПустойАнКодКПС = "0000000000";
ПустойКВР = "000";
ПустаяГлава = "000";
ПустойРаздел = "0000";
//мДополнительныеДанные	= Новый Структура;
//мПараметрыПроверки		= Новый Структура;

//ПредставлениеАналитикиКолонок = Новый ТаблицаЗначений;
//ПредставлениеАналитикиКолонок.Колонки.Добавить("КонтрольноеСоотношение");
//ПредставлениеАналитикиКолонок.Колонки.Добавить("ИмяКолонки");
//ПредставлениеАналитикиКолонок.Колонки.Добавить("Заголовок");
//ПредставлениеАналитикиКолонок.Индексы.Добавить("ИмяКолонки,КонтрольноеСоотношение");

//ПоказателиСтрокиТаблицы = Новый Соответствие;
//СтроковыеБК = ПолучитьСтроковыеБК();
#КонецЕсли
