
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьНаборЗаписей(СтруктураОтбора) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	НастройкаСтатейФинансированияЗарплата.ВидОперации КАК ВидОперации,
	               |	НастройкаСтатейФинансированияЗарплата.Период КАК Период,
	               |	НастройкаСтатейФинансированияЗарплата.Организация КАК Организация,
	               |	НастройкаСтатейФинансированияЗарплата.СтатьяФинансированияЗарплата,
				   |	НастройкаСтатейФинансированияЗарплата.КЭК КАК КЭК
	               |ИЗ
	               |	РегистрСведений.НастройкаСтатейФинансированияЗарплата КАК НастройкаСтатейФинансированияЗарплата
	               |ГДЕ
	               |	НастройкаСтатейФинансированияЗарплата.Период = &Период
	               |	И НастройкаСтатейФинансированияЗарплата.Организация = &Организация
	               |	И НастройкаСтатейФинансированияЗарплата.СтатьяФинансированияЗарплата = &СтатьяФинансированияЗарплата
				   |	И НастройкаСтатейФинансированияЗарплата.ВидОперации = &ВидОперации
	               |	И НастройкаСтатейФинансированияЗарплата.КЭК = &КЭК
	               |	И НастройкаСтатейФинансированияЗарплата.ИФО = &ИФО
	               |	И НастройкаСтатейФинансированияЗарплата.КФО = &КФО
	               |	И НастройкаСтатейФинансированияЗарплата.КПС = &КПС";
				   
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период",							СтруктураОтбора.Период);
	Запрос.УстановитьПараметр("Организация",					СтруктураОтбора.Организация);
	Запрос.УстановитьПараметр("СтатьяФинансированияЗарплата",	СтруктураОтбора.СтатьяФинансированияЗарплата);
	Запрос.УстановитьПараметр("ВидОперации",					СтруктураОтбора.ВидОперации);
	Запрос.УстановитьПараметр("КЭК",							СтруктураОтбора.КЭК);
	Запрос.УстановитьПараметр("ИФО",							СтруктураОтбора.ИФО);
	Запрос.УстановитьПараметр("КФО",							СтруктураОтбора.КФО);
	Запрос.УстановитьПараметр("КПС",							СтруктураОтбора.КПС);
	
	Если ТипЗнч(СтруктураОтбора.ВидОперации) = Тип("Строка") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И НастройкаСтатейФинансированияЗарплата.ВидОперации = &ВидОперации","");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТВидыОпераций = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТВидыОпераций Цикл
		НаборЗаписейЭталон = РегистрыСведений.НастройкаСтатейФинансированияЗарплата.СоздатьНаборЗаписей();
		НаборЗаписейЭталон.Отбор.Период.Установить(СтрокаТаблицы.Период);
		НаборЗаписейЭталон.Отбор.СтатьяФинансированияЗарплата.Установить(СтрокаТаблицы.СтатьяФинансированияЗарплата);
		НаборЗаписейЭталон.Отбор.Организация.Установить(СтрокаТаблицы.Организация);
		НаборЗаписейЭталон.Отбор.ВидОперации.Установить(СтрокаТаблицы.ВидОперации);
		НаборЗаписейЭталон.Отбор.КЭК.Установить(СтрокаТаблицы.КЭК);
		НаборЗаписейЭталон.Очистить();
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписейЭталон);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
