
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = "";
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	ДоговорКонтрагента = Справочники.Договоры.ПустаяСсылка();
	Имена = Новый Массив;
	
	Если Не Параметры.Свойство("АдресХранилища", Адрес) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект = ПолучитьИзВременногоХранилища(Адрес);
	ЗначениеВРеквизитФормы(Объект, "ТаблицаРасшифровки");
	
	Параметры.Свойство("РежимОткрытияОкна", РежимОткрытияОкна);
	Параметры.Свойство("Контрагент", Контрагент);
	Параметры.Свойство("ДоговорКонтрагента", ДоговорКонтрагента);
	Параметры.Свойство("УчитыватьНДС", УчитыватьНДС);
	Параметры.Свойство("МассивИмен", Имена);
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("НастройкаРасчета", НастройкаРасчета);
	
	МассивИмен = СтрСоединить(Имена, ",");
	
	УстановитьОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Имена = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("СтавкаНДС,СуммаНДС,Всего");
	
	Для Каждого ИмяЭлемента Из  Имена цикл
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОбъектРасшифровкаНачисления"+ИмяЭлемента, "Видимость", УчитыватьНДС);
		
	КонецЦикла;
	
	УстановитьОформление();
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ФормулаРасчета(Команда)
	
	ТекущаяСтрока = Элементы.ОбъектРасшифровкаНачисления.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		
		Если ТекущаяСтрока.СтавкаОплаты.Пустая() Тогда
			
			ПоказатьПредупреждение(Неопределено, "Не указана ставка оплаты!", 20);
			
		Иначе
			
			ПараметрыРасчета = Новый Структура("СтавкаОплаты, НачалоПериода, КонецПериода, Льгота, ДнейПосещенияКОплате, ДнейПосещенияПоГрафику,Ребенок,ГруппаДетскогоУчреждения,
												|РодительскаяПлатаДопУслуги,Организация,ДоговорКонтрагента,Ребенок,Сумма");
			ЗаполнитьЗначенияСвойств(ПараметрыРасчета, ТекущаяСтрока);
			ПараметрыРасчета.Вставить("НастройкаРасчета", НастройкаРасчета);
			ПараметрыРасчета.Вставить("Организация", Организация);
			ПараметрыРасчета.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ПараметрыРасчета.Вставить("Расчет", 1);
			
			ОткрытьФорму("Справочник.НастройкиРасчетовПоРодительскойПлате.Форма.ФормулаРасчета", ПараметрыРасчета);
			
		КонецЕсли; 
	
	КонецЕсли; 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОформление()
	Имена = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(МассивИмен);
	
	Для Каждого Имя Из Имена Цикл
		Элемент = Элементы.Найти("ОбъектРасшифровкаНачисления"+Имя);
		
		Если Элемент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Элемент.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветОтличающейсяСтрокиДокумента;
		Элемент.ШрифтЗаголовка = Новый Шрифт(,,Истина);
		Элемент.ЦветТекста = ЦветаСтиля.ЦветОтличающейсяСтрокиДокумента;
		Элемент.Шрифт = Новый Шрифт(,,Истина);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти