#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если (ВидНормы = Перечисления.ВидыНормРасходаГСМАгрегатов.НормаРасходаСмазочныхМатериалов) Тогда
		ПроверяемыеРеквизиты.Добавить("ВидСМ");
	КонецЕсли;
	Если (ВидНормы = Перечисления.ВидыНормРасходаГСМАгрегатов.НормаРасходаСмазочныхМатериалов) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ОсновнойПараметрРасчета");
		МассивНепроверяемыхРеквизитов.Добавить("ЗначениеОсновногоПараметраРасчета");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
