#Область ПрограммныйИнтерфейс

Функция СобытиеВыборПодбораРНПТ(ИсточникВыбора) Экспорт
	Возврат ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТ"
		Или ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТДляОС";
КонецФункции

Процедура СоздатьПоказатьУведомления(Форма, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	Объект = Форма.Объект;
	
	Если ЭтоФормаПоступлениеМЗ(Форма) ИЛИ ЭтоФормаПоступлениеОС(Форма) Тогда
		
		Если Форма.СписокУведомлений.Количество() = 0 Тогда
			ДополнительныеПараметры = Новый Структура("ДокументОбъект, Форма", Объект, Форма);
			Если Не Объект.Проведен Или Форма.Модифицированность Тогда 
				ТекстВопроса = НСтр("ru = 'Для создания уведомления необходимо предварительно провести документ.'");
				Оповещение = Новый ОписаниеОповещения("ОткрытьПомощникПолученияРНПТ", ЭтотОбъект, ДополнительныеПараметры);
				Кнопки = Новый СписокЗначений;
				Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Провести и продолжить'"));
				Кнопки.Добавить(КодВозвратаДиалога.Отмена);
				ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
			Иначе
				ОткрытьПомощникПолученияРНПТ(КодВозвратаДиалога.Да, ДополнительныеПараметры);
			КонецЕсли;
			
		ИначеЕсли Форма.СписокУведомлений.Количество() = 1 Тогда
			ПоказатьЗначение(, Форма.СписокУведомлений[0].Значение)
		Иначе
			Оповещение = Новый ОписаниеОповещения("СоздатьПоказатьУведомленияОповещение", ЭтотОбъект, Форма);
			Форма.ПоказатьВыборИзМеню(Оповещение, Форма.СписокУведомлений, Элемент);
		КонецЕсли;
		
	// Это форма РеализацияТоваровУслуг
	Иначе
		
		ПараметрыДокумента = Новый Структура("Ключ", Форма.УведомлениеОПеремещении);
		
		Если ЗначениеЗаполнено(Форма.УведомлениеОПеремещении) Тогда
			
			
			ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.ФормаОбъекта",
				ПараметрыДокумента, Форма.ЭтотОбъект);
			
		Иначе
			
			ЗначенияЗаполнения = Новый Структура();
			ЗначенияЗаполнения.Вставить("Основание", Форма.Объект.Ссылка);
			
			ПараметрыДокумента.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			
			ОткрытьФорму("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.ФормаОбъекта",
				ПараметрыДокумента, Форма.ЭтотОбъект);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьПоказатьУведомленияОповещение(ВыбранныйЭлемент, Форма) Экспорт
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ПоказатьЗначение(, ВыбранныйЭлемент.Значение)
	КонецЕсли	
КонецПроцедуры

Процедура ОткрытьПомощникПолученияРНПТ(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект = ДополнительныеПараметры.ДокументОбъект;
	Форма = ДополнительныеПараметры.Форма;
	Если Не Объект.Проведен Или Форма.Модифицированность Тогда
		Если Не Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ПериодСобытия", Объект.Дата);
	ПараметрыФормы.Вставить("КонтекстныйВызов", Истина);
	
	ОткрытьФорму("Обработка.ПомощникПолученияРНПТ.Форма.Форма", ПараметрыФормы, Форма);
	
КонецПроцедуры

Функция ПараметрыОткрытияФормыПодбораРНПТ(ИмяТаблицы) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИмяКолонкиНоменклатура", "Номенклатура");
	Результат.Вставить("ПредставлениеКолонкиНоменклатура", НСтр("ru = 'Номенклатура'"));
	Результат.Вставить("ЭтоПоступление", Истина);
	Результат.Вставить("ИмяТаблицы", ИмяТаблицы);
	Результат.Вставить("ИмяФормыПодбора", "ФормаПодбораРНПТ");
	Результат.Вставить("ТекущийДокумент");
	Результат.Вставить("Период", '00010101');
	Результат.Вставить("ВнеоборотныйАктив");
	Результат.Вставить("Организация");
	Результат.Вставить("ПроверятьПризнакПрослеживаемыйТовар", Истина);
	Результат.Вставить("КомплектующееТолькоОС", Ложь);
	Результат.Вставить("ПрослеживаемыйТовар", Ложь);
	Результат.Вставить("ЭтоКорректировка", Ложь);
	Результат.Вставить("ДокументОснование");
	Возврат Результат;

КонецФункции

Процедура ОткрытьФормуПодбораРНПТ(Форма, ИмяТаблицы, ЭтоПоступление = Ложь) Экспорт
	
	Если ТипЗнч(ИмяТаблицы) = Тип("Строка") Тогда
		ПараметрыПодбора = ПараметрыОткрытияФормыПодбораРНПТ(ИмяТаблицы);
		ПараметрыПодбора.ЭтоПоступление = ЭтоПоступление;
	Иначе
		ПараметрыПодбора = ИмяТаблицы;
	КонецЕсли;
	
	Объект         = Форма.Объект;
	ДокументСсылка = Объект.Ссылка;
	Элементы       = Форма.Элементы;
	ТекущиеДанные  = Элементы[ПараметрыПодбора.ИмяТаблицы].ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПодбора.ПроверятьПризнакПрослеживаемыйТовар
		И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "ПрослеживаемыйТовар", Истина) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьОшибкиЗаполненияСтрокиДляПодобораРНПТ(Форма, ТекущиеДанные, ПараметрыПодбора) Тогда
		Возврат;
	КонецЕсли;
	ЭтоВозвратПоставщику  = Ложь;
	ДатаТекущегоДокумента = '00010101';
	ДокументРеализации = Неопределено;
	
	// Установим параметры по возвратам
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.НакладнаяНаОтпускМ15")
		И Объект.ВидПередачиМЗ = ПредопределенноеЗначение("Перечисление.ВидыПередачиМЗ.ВозвратПоставщику") Тогда
		
			ЭтоВозвратПоставщику  = Истина;
			ДокументРеализации    = Объект.ДокументОснование;
			ДатаТекущегоДокумента = КонецДня(Объект.Дата);
		
	КонецЕсли;
	
	СтруктураПараметров = ПараметрыОткрытияФормыПодбораРНПТОС();
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ТекущиеДанные);
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ПараметрыПодбора);
	СтруктураПараметров.Организация = Объект.Организация;
	СтруктураПараметров.Номенклатура = ТекущиеДанные[ПараметрыПодбора.ИмяКолонкиНоменклатура]; 
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "ВариантКомплектаПТ") Тогда
		СтруктураПараметров.ВариантКомплекта = ТекущиеДанные.ВариантКомплектаПТ;
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "КомплектСПрослеживаемымиТоварами") Тогда
		СтруктураПараметров.КомплектСПрослеживаемымиТоварами = ТекущиеДанные.КомплектСПрослеживаемымиТоварами;
	КонецЕсли;
	СтруктураПараметров.Период = Объект.Дата;
	СтруктураПараметров.ВыборПоОстаткам = НЕ ПараметрыПодбора.ЭтоПоступление;
	СтруктураПараметров.ЭтоВозвратПоставщику = ЭтоВозвратПоставщику;
	СтруктураПараметров.ДатаТекущегоДокумента = ДатаТекущегоДокумента;
	СтруктураПараметров.ДокументРеализации = ДокументРеализации;
	СтруктураПараметров.ТекущийДокумент = ДокументСсылка;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ЭтоКорректировка")
			И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ДокументОснование") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект, "ЭтоКорректировка,ДокументОснование");
	КонецЕсли;
	
	АдресТаблицыРНПТВХранилище = ПоместитьВоВременноеХранилище(Неопределено, Форма.УникальныйИдентификатор);
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	ЗаполнениеТаблицыРНПТ = Новый ОписаниеОповещения("ПоместитьРНПТВХранилище", Форма, ДополнительныеПараметры);
	ВыполнитьОбработкуОповещения(ЗаполнениеТаблицыРНПТ, АдресТаблицыРНПТВХранилище);
	
	СтруктураПараметров.Вставить("АдресТаблицыРНПТВХранилище", АдресТаблицыРНПТВХранилище);
	СтруктураПараметров.Вставить("ЭтоПоступление", ПараметрыПодбора.ЭтоПоступление);
	
	ОткрытьФорму("Справочник.НомераГТД.Форма." + ПараметрыПодбора.ИмяФормыПодбора, СтруктураПараметров, Форма);
	
КонецПроцедуры

Функция ПараметрыОткрытияФормыПодбораРНПТОС() Экспорт
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВнеоборотныйАктив");
	СтруктураПараметров.Вставить("ВыборПоОстаткам");
	СтруктураПараметров.Вставить("ДатаТекущегоДокумента");
	СтруктураПараметров.Вставить("ДокументРеализации");
	СтруктураПараметров.Вставить("ИмяТаблицы");
	СтруктураПараметров.Вставить("Количество");
	СтруктураПараметров.Вставить("Номенклатура");
	СтруктураПараметров.Вставить("Организация");
	СтруктураПараметров.Вставить("Период");
	СтруктураПараметров.Вставить("СтранаПроисхождения");
	СтруктураПараметров.Вставить("ТекущийДокумент");
	СтруктураПараметров.Вставить("ЭтоВозвратПоставщику", Ложь);
	СтруктураПараметров.Вставить("КомплектующееТолькоОС", Ложь);
	СтруктураПараметров.Вставить("ПрослеживаемыйТовар", Ложь);
	СтруктураПараметров.Вставить("КомплектСПрослеживаемымиТоварами", Ложь);
	СтруктураПараметров.Вставить("ВариантКомплекта");
	СтруктураПараметров.Вставить("ЭтоКорректировка");
	СтруктураПараметров.Вставить("ДокументОснование");

	Возврат СтруктураПараметров;
	
КонецФункции

Функция ЕстьОшибкиЗаполненияСтрокиДляПодобораРНПТ(Форма, ТекущиеДанные, ПараметрыПодбора)
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные[ПараметрыПодбора.ИмяКолонкиНоменклатура]) Тогда 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
		"Поле", "Заполнение", ПараметрыПодбора.ПредставлениеКолонкиНоменклатура);
		Поле = ПараметрыПодбора.ИмяТаблицы + "["+ Формат(ТекущиеДанные.НомерСтроки-1,"ЧГ=") + "].Номенклатура";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Форма.Объект.Ссылка, Поле, "Объект", ЕстьОшибкиЗаполнения);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "Количество")
		И Не ЗначениеЗаполнено(ТекущиеДанные.Количество) Тогда 
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
		"Поле", "Заполнение", НСтр("ru = 'Количество'"));
		Поле = ПараметрыПодбора.ИмяТаблицы + "["+ Формат(ТекущиеДанные.НомерСтроки-1,"ЧГ=") + "].Количество";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Форма.Объект.Ссылка, Поле, "Объект", ЕстьОшибкиЗаполнения);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущиеДанные, "СтранаПроисхождения")
		И НЕ ЗначениеЗаполнено(ТекущиеДанные.СтранаПроисхождения) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
		"Поле", "Заполнение", НСтр("ru = 'Страна происхождения'"));
		Поле = ПараметрыПодбора.ИмяТаблицы + "["+ Формат(ТекущиеДанные.НомерСтроки-1,"ЧГ=") + "].СтранаПроисхождения";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Форма.Объект.Ссылка, Поле, "Объект", ЕстьОшибкиЗаполнения);
	КонецЕсли;
	
	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

Процедура ПоказатьПредупреждениеПрослеживаемыйТовар() Экспорт
	
	Подстроки = Новый Массив;
	Подстроки.Добавить(
		НСтр("ru = 'Товар из перечня, утвержденного постановлением правительства РФ от 25.06.2019 № 807'"));
	//Подстроки.Добавить(Символы.ПС);
	//Подстроки.Добавить(Новый ФорматированнаяСтрока(
	//	НСтр("ru = 'Подробнее об учете прослеживаемых товаров'"),,,,"https://its.1c.ru/db/accnds#content:1080:hdoc"));
	ПодсказкаВДокументе = Новый ФорматированнаяСтрока(Подстроки);
	ПоказатьПредупреждение(,ПодсказкаВДокументе, , НСтр("ru = 'Прослеживаемый товар'"));
	
КонецПроцедуры

Процедура МатериалыВыбор(Форма, Поле, СтандартнаяОбработка, ЭтоПоступление = Истина, ИмяТЧ = "Материалы") Экспорт
	ТекущиеДанные = Форма.Элементы[ИмяТЧ].ТекущиеДанные;
	Если Поле.Имя = ИмяТЧ + "РНПТ" Тогда
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ПараметрыПодбора = ПараметрыОткрытияФормыПодбораРНПТ(ИмяТЧ);
			ПараметрыПодбора.ЭтоПоступление = ЭтоПоступление;
			ОткрытьФормуПодбораРНПТ(Форма, ПараметрыПодбора);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Поле.Имя = ИмяТЧ + "ПрослеживаемыйТовар" Тогда
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ПоказатьПредупреждениеПрослеживаемыйТовар();
		Конецесли;
	КонецЕсли;
КонецПроцедуры

Процедура КапВложенияВыбор(Форма, Поле, СтандартнаяОбработка, ПроверятьПризнакПрослеживаемыйТовар = Истина, КомплектующееТолькоОС = Ложь) Экспорт
	ТекущиеДанные = Форма.Элементы["КапВложения"].ТекущиеДанные;
	Если Поле.Имя = "КапВложенияРНПТ" Тогда
		Если ТекущиеДанные.ПрослеживаемыйТовар Или Не ПроверятьПризнакПрослеживаемыйТовар Тогда
			ПараметрыПодбора = ПараметрыОткрытияФормыПодбораРНПТ("КапВложения");
			ПараметрыПодбора.ЭтоПоступление = Истина;
			ПараметрыПодбора.ИмяКолонкиНоменклатура = "ВнеоборотныйАктив";
			ПараметрыПодбора.ПредставлениеКолонкиНоменклатура = НСтр("ru = 'Внеоборотный актив'");
			ПараметрыПодбора.ИмяФормыПодбора = "ФормаПодбораРНПТДляОС";
			ПараметрыПодбора.ПроверятьПризнакПрослеживаемыйТовар = ПроверятьПризнакПрослеживаемыйТовар;
			ПараметрыПодбора.КомплектующееТолькоОС = КомплектующееТолькоОС;
			ПараметрыПодбора.ПрослеживаемыйТовар = ТекущиеДанные.ПрослеживаемыйТовар;
			
			ОткрытьФормуПодбораРНПТ(Форма, ПараметрыПодбора);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Поле.Имя = "КапВложенияПрослеживаемыйТовар" Тогда
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ПоказатьПредупреждениеПрослеживаемыйТовар();
		Конецесли;
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеСредстваВыбор(Форма, Поле, СтандартнаяОбработка) Экспорт
	ТекущиеДанные = Форма.Элементы["ОсновныеСредства"].ТекущиеДанные;
	Если Поле.Имя = "ОсновныеСредстваРНПТ" Тогда
		ПрослеживаемыйТовар = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "ПрослеживаемыйТовар", Истина);
		Если ПрослеживаемыйТовар Тогда
			ОсновноеСредство = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "ОсновноеСредство");
			ПараметрыПодбора = ПараметрыОткрытияФормыПодбораРНПТ("ОсновныеСредства");
			ПараметрыПодбора.ЭтоПоступление = Ложь;
			ПараметрыПодбора.ТекущийДокумент = Форма.Объект.Ссылка;
			ПараметрыПодбора.Период = Форма.Объект.Дата;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ВнеоборотныйАктив") Тогда
				ПараметрыПодбора.ВнеоборотныйАктив = Форма.Объект.ВнеоборотныйАктив;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "КапитальноеВложение") Тогда
				ПараметрыПодбора.ВнеоборотныйАктив = Форма.Объект.КапитальноеВложение;
			Иначе
				ПараметрыПодбора.ВнеоборотныйАктив = ОсновноеСредство;
			КонецЕсли;
			ПараметрыПодбора.Организация = Форма.Объект.Организация;
			ПараметрыПодбора.ИмяКолонкиНоменклатура = "ОсновноеСредство";
			ПараметрыПодбора.ПредставлениеКолонкиНоменклатура = НСтр("ru = 'Основное средство'");
			ПараметрыПодбора.ИмяФормыПодбора = "ФормаПодбораРНПТДляОС";
			ПараметрыПодбора.ПрослеживаемыйТовар = ПрослеживаемыйТовар;
			
			ОткрытьФормуПодбораРНПТ(Форма, ПараметрыПодбора);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Поле.Имя = "ОсновныеСредстваПрослеживаемыйТовар" Тогда
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ПоказатьПредупреждениеПрослеживаемыйТовар();
		Конецесли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриНачалеРедактированияСтроки(ТекущаяСтрока, СведенияПрослеживаемости, НоваяСтрока, Копирование) Экспорт

	Если Не НоваяСтрока Или Не Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки);
	ВведенныеРНПТ = СведенияПрослеживаемости.НайтиСтроки(Отбор);
	
	Если ВведенныеРНПТ.Количество() = 0 Тогда
		ТекущаяСтрока.ИдентификаторСтроки = "";
	Иначе
		ТекущаяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		Для каждого ВведенныйРНПТ Из ВведенныеРНПТ Цикл
			НоваяСтрокаРНПТ = СведенияПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРНПТ, ВведенныйРНПТ);
			НоваяСтрокаРНПТ.ИдентификаторСтроки = ТекущаяСтрока.ИдентификаторСтроки;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоФормаПоступлениеМЗ(Форма)
	
	Возврат СтрНайти(Форма.ИмяФормы, "ПоступлениеМЗ") > 0;
	
КонецФункции

Функция ЭтоФормаПоступлениеОС(Форма)
	
	Возврат СтрНайти(Форма.ИмяФормы, "ПоступлениеОС") > 0;
	
КонецФункции

#КонецОбласти
