
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.ТаблицаВариантов.Количество()>0 Тогда
		ПроверитьСхему();	
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ТаблицаВариантов.Количество() >0 Тогда
		ПроверитьСхему();
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Для настройки не заданы варианты действий. Для корректного использования настройки следует задать в табличной части хотя бы один вариант действий.'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаВариантов

&НаКлиенте
Процедура ТаблицаВариантовУсловиеПримененияВариантаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработкаСтроки("УсловиеПримененияВарианта", Элемент, СтандартнаяОбработка, НСтр("ru='Введите строковое выражение на языке СКД'"));
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВариантовПримечаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбработкаСтроки("Примечание", Элемент, СтандартнаяОбработка, НСтр("ru='Введите пояснение для данного варианта'"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаСтроки(Поле, Элемент, СтандартнаяОбработка, ТекстЗаголовка)
	
	СтандартнаяОбработка = Ложь;
	
	Значение = Элемент.ТекстРедактирования;
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ОбработкаСтрокиЗавершение", ЭтотОбъект, Новый Структура("Значение, Поле", Значение, Поле)), Значение, ТекстЗаголовка,, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСтрокиЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если НЕ Строка = Неопределено Тогда
		Элементы.ТаблицаВариантов.ТекущиеДанные[ДополнительныеПараметры.Поле] = Строка;
		Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьСхему()
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	Схема = ТекОбъект.СхемаФормирования.Получить();
	Если ТипЗнч(Схема) = Тип("СхемаКомпоновкиДанных") Тогда
		СхемаЕсть = Истина;
	Иначе
		СхемаЕсть = Ложь;
	КонецЕсли;
	
	Если НЕ СхемаЕсть Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='В условии применения вариантов есть ошибка! При использовании данной настройки автоматическе назначение вариантов по условиям выполнено не будет!'"));
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти



