#Область ОписаниеПеременных

&НаКлиенте
Перем РезультатЗакрытия;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	АдресВременногоХранилища = Параметры.АдресВременногоХранилища;
	Организация 			 = Параметры.Организация;
	ДатаДокумента 			 = Параметры.ДатаДокумента;
	ДатаОстаткиРасчетов 	 = Параметры.ДатаОстаткиРасчетов;
	ДатаОстаткиЕНП 			 = Параметры.ДатаОстаткиЕНП;
	ВидНалогаИлиПлатежа 	 = Параметры.ВидНалогаИлиПлатежа;
	Счет 					 = Параметры.Счет;
	КБК 					 = Параметры.КБК;
	Ссылка 					 = Параметры.Ссылка;
	ОстатокЕНП 				 = Параметры.ОстатокЕНП;
	СчетЕНП 				 = Параметры.СчетЕНП;
	ПодобраноВДокументе 	 = Параметры.ПодобраноВсего;

	Если Не ЗначениеЗаполнено(СчетЕНП) Тогда
		СчетЕНП = БухгалтерскийУчет.СчетПоКоду("303.14");
	КонецЕсли;
	
	ГоловнаяОрганизация = Параметры.ГоловнаяОрганизация;
	ЕстьУчетОбособленныхПодразделений = Параметры.ЕстьУчетОбособленныхПодразделений;
	УстановитьВидимостьГоловнаяОрганизация();
	
	ЭтоНДФЛ = Счет = БухгалтерскийУчет.СчетПоКоду("303.01", ДатаДокумента, Организация);
	
	УчетПоИФО 			 = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	УчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	ОбновитьЗаголовокИФОПодразделение();
	
	НачалоПериода = НачалоМесяца(ДобавитьМесяц(ДатаДокумента, -1));
	КонецПериода  = КонецМесяца(НачалоПериода);
	
	ШаблонЗаголовка = НСтр("ru = 'Редактирование строки распределения %1'");
	Заголовок = СтрШаблон(ШаблонЗаголовка, Ссылка);
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РаспределениеЕНП_ФормаПодбораДанныеСтроки", "");
	Если Настройки <> Неопределено Тогда
		ВосстановитьНастройкиПоНалогу(Настройки[ВидНалогаИлиПлатежа]);
	КонецЕсли;
	
	ОбновитьПредставлениеПериода(ЭтотОбъект);
	
	ВосстановитьТаблицуОстаткиРасчетов();
	Если ПоказатьОбороты Тогда
		ЗаполнитьОстаткиРасчетов();	
	КонецЕсли;	
	
	ПодобраноВДокументе = ПодобраноВДокументе - ОстаткиРасчетов.Итог("Подобрано");
	ОбновитьЗначениеПодобраноВсего(ЭтотОбъект);
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	УстановитьВидимостьЭлементовПоказатьОбороты(ЭтотОбъект);
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = ОбщегоНазначенияБГУКлиент.СтандартныйТекстПредупрежденияПриЗавершенииРаботы();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность И РезультатЗакрытия = Неопределено Тогда
		Отказ = Истина;
		ВопросПередЗакрытиемПеренестиДанныеАсинх();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиПоНалогу(ПоказатьОбороты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаОстаткиРасчетовНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьДатуОстатковРасчетовАсинх();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОборотыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоказатьОбороты(ЭтотОбъект);
	ПоказатьОборотыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаОборотыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ЭтоНДФЛ и ВариантНДФЛ = 1 Тогда
		ВыбратьПериодОборотовНДФЛАсинх();
	Иначе
		ВыбратьПериодОборотовАсинх();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантНДФЛПриИзменении(Элемент)
	ЗаполнитьОстаткиРасчетов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстаткиРасчетов

&НаКлиенте
Процедура ОстаткиРасчетовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Поле.Имя = "ОстаткиРасчетовОтражениеВУчете" Тогда
		ОткрытьФормуНастройкиОтраженияВУчете(Элемент.ТекущиеДанные);
	ИначеЕсли Поле.Имя = "ОстаткиРасчетовКартинкаПереместитьВПраво"
			Или Поле.Имя = "ОстаткиРасчетовОстатокРасчетов" Тогда
		ПеренестиВПодобрано(Элемент.ТекущиеДанные);
		ОбновитьЗначениеПодобраноВсего(ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ОстаткиРасчетовКартинкаПереместитьВПравоОбороты"
			Или Поле.Имя = "ОстаткиРасчетовОборот" Тогда
		ПеренестиВПодобраноОборот(Элемент.ТекущиеДанные);
		ОбновитьЗначениеПодобраноВсего(ЭтотОбъект);
	ИначеЕсли Поле.Имя = "ОстаткиРасчетовКартинкаОчистить" Тогда
		ОчиститьПодобрано(Элемент.ТекущиеДанные);
		ОбновитьЗначениеПодобраноВсего(ЭтотОбъект);
	Иначе
		СтандартнаяОбработка = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиРасчетовПодобраноПриИзменении(Элемент)
	ОбновитьЗначениеПодобраноВсего(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПодготовитьИПередатьДанные();
	РезультатЗакрытия = "ОК";
	Закрыть(РезультатЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	РезультатЗакрытия = "Отмена";
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	Для каждого Строка Из ОстаткиРасчетов Цикл
		Строка.Подобрано = ?(ПоказатьОбороты, Строка.Оборот, Строка.ОстатокРасчетов);	
	КонецЦикла;
	ОбновитьЗначениеПодобраноВсего(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	
	Для каждого Строка Из ОстаткиРасчетов Цикл
		Строка.Подобрано = 0;	
	КонецЦикла;
	ОбновитьЗначениеПодобраноВсего(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВосстановитьТаблицуОстаткиРасчетов()

	ОстаткиРасчетов.Загрузить(ПолучитьИзВременногоХранилища(АдресВременногоХранилища));
	ОстаткиРасчетов.Сортировать("Счет,ВидНалогаИлиПлатежа,НалогСборПлатеж,ИФО,Подразделение,КФО,КПС");
	ОстатокРасчетовВсего = ОстаткиРасчетов.Итог("ОстатокРасчетов");

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьДатуОстатковРасчетовАсинх()
	
	НоваяДата = Ждать ВвестиДатуАсинх(ДатаОстаткиРасчетов, НСтр("ru = 'Остатки расчетов'"), ЧастиДаты.Дата);
	
	Если НоваяДата <> Неопределено Тогда
		ДатаОстаткиРасчетов = НоваяДата;
		ЗаполнитьОстаткиРасчетов();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВопросПередЗакрытиемПеренестиДанныеАсинх()

	ТекстВопроса = НСтр("ru = 'Результат распределения не перенесен в подбор.
		|
		|Перенести?'");
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, ,КодВозвратаДиалога.Отмена);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПодготовитьИПередатьДанные();
		РезультатЗакрытия = "ОК";
		Закрыть(РезультатЗакрытия);
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		РезультатЗакрытия = "Отмена";
		Закрыть(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьПериодОборотовНДФЛАсинх()
	
	СписокУточненияПериода = Новый СписокЗначений;
	
	ПроизвольныйПериод = НСтр("ru = 'Произвольный период'");
	
	НачалоПервойПоловины = НачалоМесяца(НачалоПериода);
	КонецПервойПоловины  = Дата(Год(НачалоПериода), Месяц(НачалоПериода), 22);
	
	НачалоВторойПоловины = Дата(Год(НачалоПериода), Месяц(НачалоПериода), 23);
	КонецВторойПоловины  = КонецМесяца(НачалоПериода);
	
	КонецТретьегоПериода = Дата(Год(ДобавитьМесяц(НачалоПериода, 1)),
								Месяц(ДобавитьМесяц(НачалоПериода, 1)),
								22);
	
	ПерваяПоловина = СтрШаблон("%1 - %2",
		Формат(НачалоПервойПоловины, "ДФ=dd.MM.yyyy"),
		Формат(КонецПервойПоловины,  "ДФ=dd.MM.yyyy"));
		
	ВтораяПоловина = СтрШаблон("%1 - %2",
		Формат(НачалоВторойПоловины, "ДФ=dd.MM.yyyy"),
		Формат(КонецВторойПоловины,  "ДФ=dd.MM.yyyy"));

	ТретийПериод   = СтрШаблон("%1 - %2",
		Формат(НачалоВторойПоловины, "ДФ=dd.MM.yyyy"),
		Формат(КонецТретьегоПериода, "ДФ=dd.MM.yyyy"));
	
	СписокУточненияПериода.Добавить(1, ПроизвольныйПериод);
	СписокУточненияПериода.Добавить(2, ПерваяПоловина);
	СписокУточненияПериода.Добавить(3, ВтораяПоловина);
	СписокУточненияПериода.Добавить(4, ТретийПериод);
	
	ВыбранноеЗначение = Ждать ВыбратьИзСпискаАсинх(СписокУточненияПериода);
	Если ВыбранноеЗначение <> Неопределено Тогда
		Если ВыбранноеЗначение.Значение = 1 Тогда
			
			ВыбратьПериодОборотовАсинх();
			
		ИначеЕсли ВыбранноеЗначение.Значение = 2 Тогда
			
			НачалоПериода = НачалоПервойПоловины;
			КонецПериода  = КонецПервойПоловины;
			
			ЗаполнитьОстаткиРасчетов();
			ОбновитьПредставлениеПериода(ЭтотОбъект);
			
		ИначеЕсли ВыбранноеЗначение.Значение = 3 Тогда
			
			НачалоПериода = НачалоВторойПоловины;
			КонецПериода  = КонецВторойПоловины;
			
			ЗаполнитьОстаткиРасчетов();
			ОбновитьПредставлениеПериода(ЭтотОбъект);
		
		ИначеЕсли ВыбранноеЗначение.Значение = 4 Тогда
			
			НачалоПериода = НачалоВторойПоловины;
			КонецПериода  = КонецТретьегоПериода;
			
			ЗаполнитьОстаткиРасчетов();
			ОбновитьПредставлениеПериода(ЭтотОбъект);
		
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьПериодОборотовАсинх()

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
    Диалог.Период.ДатаНачала 	= НачалоПериода;
    Диалог.Период.ДатаОкончания = КонецПериода;
	
	ВыбранныйПериод = Ждать Диалог.РедактироватьАсинх();
	Если ВыбранныйПериод <> Неопределено Тогда
		НачалоПериода = ВыбранныйПериод.ДатаНачала;
		КонецПериода  = ВыбранныйПериод.ДатаОкончания;
		ЗаполнитьОстаткиРасчетов();
		ОбновитьПредставлениеПериода(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьОборотыПриИзмененииНаСервере()
	
	Если ПоказатьОбороты Тогда
		Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РаспределениеЕНП_ФормаПодбораДанныеСтроки", "");
		Если Настройки <> Неопределено Тогда
			ВосстановитьНастройкуПоказатьОбороты(Настройки[ВидНалогаИлиПлатежа]);
		КонецЕсли;
		ОбновитьПредставлениеПериода(ЭтотОбъект);
	Иначе
		СохранитьНастройкиПоНалогу(Истина);
	КонецЕсли;

	ЗаполнитьОстаткиРасчетов();

КонецПроцедуры

&НаСервере
Процедура ПодготовитьИПередатьДанные()
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ВидНалогаИлиПлатежа", 	  	  ВидНалогаИлиПлатежа);
	ДанныеВозврата.Вставить("Счет", 				  	  Счет);
	ДанныеВозврата.Вставить("ТаблицаПодбораПоВидуНалога", ОстаткиРасчетов.Выгрузить());
	ПоместитьВоВременноеХранилище(ДанныеВозврата, АдресВременногоХранилища);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиРасчетов()
	Перем РеквизитыСтроки;
	
	ТекущаяСтрока = Элементы.ОстаткиРасчетов.ТекущаяСтрока;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ИменаРеквизитовСтроки = "ВидНалогаИлиПлатежа,НалогСборПлатеж,Счет,Субконто1,Субконто2,Субконто3,ИФО,Подразделение,КФО,КПС";
		РеквизитыСтроки = Новый Структура(ИменаРеквизитовСтроки);
		ЗаполнитьЗначенияСвойств(РеквизитыСтроки, ОстаткиРасчетов.НайтиПоИдентификатору(ТекущаяСтрока));
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый Массив;
	
	ТекстыЗапроса.Добавить(ТекстЗапросаВременнаяТаблицаПодобранныеРасчеты(НомераТаблиц));
	ТекстыЗапроса.Добавить(ТекстЗапросаВременнаяТаблицаОстаткиРасчетов(НомераТаблиц));
	ТекстыЗапроса.Добавить(ТекстЗапросаОстаткиРасчетов(НомераТаблиц));
	
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос.УстановитьПараметр("НаДату", 			  КонецДня(ДатаОстаткиРасчетов) + 1);
	Запрос.УстановитьПараметр("Организация", 		  Организация);
	Запрос.УстановитьПараметр("Счет", 				  Счет);
	Запрос.УстановитьПараметр("ВидНалогаИлиПлатежа",  ВидНалогаИлиПлатежа);
	Запрос.УстановитьПараметр("ПодобранныеРасчеты",   ОстаткиРасчетов.Выгрузить());
	Запрос.УстановитьПараметр("Регистратор",   		  Ссылка);
	Запрос.УстановитьПараметр("УчетПоИФО", 			  УчетПоИФО);
	Запрос.УстановитьПараметр("УчетПоПодразделениям", УчетПоПодразделениям);
	Запрос.УстановитьПараметр("СчетЕНП",			  СчетЕНП);
	Запрос.УстановитьПараметр("НачалоПериода", 		  НачалоПериода);
	
	КонецПериодаСведенияОбУдержанномНДФЛ = ?(КонецПериода = Дата(1,1,1), Дата(2999,1,1), КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериодаСведенияОбУдержанномНДФЛ", КонецПериодаСведенияОбУдержанномНДФЛ);
 
	КонецПериодаОбороты = ?(КонецПериода = Дата(1,1,1), Дата(1,1,1), КонецДня(КонецПериода));
	Если КонецПериодаОбороты = КонецГода(КонецПериодаОбороты)
		И БухгалтерскийУчет.ЕстьОперацииМежотчетногоПериода(КонецПериодаОбороты, Организация) Тогда
	
		КонецПериодаОбороты = Новый МоментВремениСУточнениемПериода(КонецПериодаОбороты, 0);
	
	КонецЕсли;

	Запрос.УстановитьПараметр("КонецПериодаОбороты", КонецПериодаОбороты);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ОстаткиРасчетов.Очистить();
	ВыборкаОстаткиРасчетов = РезультатЗапроса[НомераТаблиц.ОстаткиРасчетов].Выбрать();
	Пока ВыборкаОстаткиРасчетов.Следующий() Цикл
		СтрокаОстатка = ОстаткиРасчетов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОстатка, ВыборкаОстаткиРасчетов);
		ОбновитьТекстОтражениеВУчете(СтрокаОстатка);
		СтрокаОстатка.ЗаголовокОстаток = НСтр("ru = 'Остаток:'");
		СтрокаОстатка.ЗаголовокОборот  = НСтр("ru = 'Оборот:'");
	КонецЦикла;
	
	Если РеквизитыСтроки <> Неопределено Тогда
		ПодходящиеСтрокиОстатка = ОстаткиРасчетов.НайтиСтроки(РеквизитыСтроки);
		Если ПодходящиеСтрокиОстатка.Количество() > 0 Тогда
			Элементы.ОстаткиРасчетов.ТекущаяСтрока = ПодходящиеСтрокиОстатка[0].ПолучитьИдентификатор();		
		КонецЕсли;
	КонецЕсли;

	ОстатокРасчетовВсего = ОстаткиРасчетов.Итог("ОстатокРасчетов");
	ОборотыВсего 		 = ОстаткиРасчетов.Итог("Оборот");
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаВременнаяТаблицаПодобранныеРасчеты(НомераТаблиц)

	НомераТаблиц.Вставить("ВТПодобранныеРасчеты", НомераТаблиц.Количество());
	
	Возврат
		"ВЫБРАТЬ
		|	ПодобранныеРасчеты.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	ПодобранныеРасчеты.НалогСборПлатеж КАК НалогСборПлатеж,
		|	ПодобранныеРасчеты.Счет КАК Счет,
		|	ПодобранныеРасчеты.Субконто1 КАК Субконто1,
		|	ПодобранныеРасчеты.Субконто2 КАК Субконто2,
		|	ПодобранныеРасчеты.Субконто3 КАК Субконто3,
		|	ПодобранныеРасчеты.ИФО КАК ИФО,
		|	ПодобранныеРасчеты.Подразделение КАК Подразделение,
		|	ПодобранныеРасчеты.КФО КАК КФО,
		|	ПодобранныеРасчеты.КПС КАК КПС,
		|	ПодобранныеРасчеты.Подобрано КАК Подобрано
		|ПОМЕСТИТЬ ВТПодобранныеРасчеты
		|ИЗ
		|	&ПодобранныеРасчеты КАК ПодобранныеРасчеты
		|ГДЕ
		|	ПодобранныеРасчеты.Подобрано <> 0";	

КонецФункции

&НаСервере
Функция ТекстЗапросаВременнаяТаблицаОстаткиРасчетов(НомераТаблиц)

	НомераТаблиц.Вставить("ВТОстаткиРасчетов", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(ВидыНалоговИПлатежей.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)) КАК ВидНалогаИлиПлатежа,
		|	ЕСТЬNULL(НалогиИПлатежиОрганизации.Ссылка, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)) КАК НалогСборПлатеж,
		|	ВЫБОР
		|		КОГДА &УчетПоИФО
		|			ТОГДА ЖурналПроводокЕПСБУОстатки.ИФО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
		|	КОНЕЦ КАК ИФО,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
		|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
		|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто1, НЕОПРЕДЕЛЕНО) КАК Субконто1,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто2, НЕОПРЕДЕЛЕНО) КАК Субконто2,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, НЕОПРЕДЕЛЕНО) КАК Субконто3,
		|	-ЖурналПроводокЕПСБУОстатки.СуммаОстаток КАК ОстатокРасчетов,
		|	0 КАК Оборот,
		|	0 КАК Подобрано
		|ПОМЕСТИТЬ ВТОстаткиРасчетов
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&НаДату,
		|			Счет = &Счет,
		|			,
		|			Организация = &Организация
		|				И Субконто1 = &ВидНалогаИлиПлатежа) КАК ЖурналПроводокЕПСБУОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежей КАК ВидыНалоговИПлатежей
		|		ПО ЖурналПроводокЕПСБУОстатки.Субконто1 = ВидыНалоговИПлатежей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
		|		ПО ЖурналПроводокЕПСБУОстатки.Субконто2 = НалогиИПлатежиОрганизации.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВидыНалоговИПлатежей.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)),
		|	ЕСТЬNULL(НалогиИПлатежиОрганизации.Ссылка, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА &УчетПоИФО
		|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ИФО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ПодразделениеДт, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, НЕОПРЕДЕЛЕНО),
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма,
		|	0,
		|	0
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
		|			,
		|			,
		|			Регистратор = &Регистратор
		|				И Организация = &Организация
		|				И Активность
		|				И СчетДт = &Счет
		|				И Период < &НаДату
		|				И СубконтоДт1 = &ВидНалогаИлиПлатежа,
		|			,
		|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежей КАК ВидыНалоговИПлатежей
		|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 = ВидыНалоговИПлатежей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
		|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 = НалогиИПлатежиОрганизации.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВидыНалоговИПлатежей.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)),
		|	ЕСТЬNULL(НалогиИПлатежиОрганизации.Ссылка, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА &УчетПоИФО
		|			ТОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ИФО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.ПодразделениеКт, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3, НЕОПРЕДЕЛЕНО),
		|	-ЖурналПроводокЕПСБУДвиженияССубконто.Сумма,
		|	0,
		|	0
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
		|			,
		|			,
		|			Регистратор = &Регистратор
		|				И Организация = &Организация
		|				И Активность
		|				И СчетКт = &Счет
		|				И Период < &НаДату
		|				И СубконтоКт1 = &ВидНалогаИлиПлатежа,
		|			,
		|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежей КАК ВидыНалоговИПлатежей
		|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 = ВидыНалоговИПлатежей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
		|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 = НалогиИПлатежиОрганизации.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТПодобранныеРасчеты.ВидНалогаИлиПлатежа,
		|	ВТПодобранныеРасчеты.НалогСборПлатеж,
		|	ВЫБОР
		|		КОГДА &УчетПоИФО
		|			ТОГДА ВТПодобранныеРасчеты.ИФО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|			ТОГДА ВТПодобранныеРасчеты.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВТПодобранныеРасчеты.КФО,
		|	ВТПодобранныеРасчеты.КПС,
		|	ВТПодобранныеРасчеты.Счет,
		|	ВТПодобранныеРасчеты.Субконто1,
		|	ВТПодобранныеРасчеты.Субконто2,
		|	ВТПодобранныеРасчеты.Субконто3,
		|	0,
		|	0,
		|	ВТПодобранныеРасчеты.Подобрано
		|ИЗ
		|	ВТПодобранныеРасчеты КАК ВТПодобранныеРасчеты";
	
	Если ПоказатьОбороты Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.ТекстОбъединитьВсе() + ТекстЗапросаОбороты();
	КонецЕсли;

	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Функция ТекстЗапросаОбороты()
	
	Возврат	?(ЭтоНДФЛ И ВариантНДФЛ = 1,
				ТекстЗапросаОборотыУдержанныйНДФЛ(),
				ТекстЗапросаОборотыЕПСБУ());

КонецФункции

&НаСервере
Функция ТекстЗапросаОборотыУдержанныйНДФЛ()
	
	Возврат
		"ВЫБРАТЬ
		|	СведенияОбУдержанномНДФЛ.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	СведенияОбУдержанномНДФЛ.НалогСборПлатеж КАК НалогСборПлатеж,
		|	ВЫБОР
		|		КОГДА &УчетПоИФО
		|			ТОГДА СведенияОбУдержанномНДФЛ.ИФО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
		|	КОНЕЦ КАК ИФО,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|				И ЕСТЬNULL(СведенияОбУдержанномНДФЛ.Счет.УчетПоПодразделениям, ЛОЖЬ)
		|			ТОГДА СведенияОбУдержанномНДФЛ.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	СведенияОбУдержанномНДФЛ.КФО КАК КФО,
		|	СведенияОбУдержанномНДФЛ.КПС КАК КПС,
		|	СведенияОбУдержанномНДФЛ.Счет КАК Счет,
		|	СведенияОбУдержанномНДФЛ.Субконто1 КАК Субконто1,
		|	СведенияОбУдержанномНДФЛ.Субконто2 КАК Субконто2,
		|	СведенияОбУдержанномНДФЛ.Субконто3 КАК Субконто3,
		|	0 КАК ОстатокРасчетов,
		|	СведенияОбУдержанномНДФЛ.Сумма КАК Оборот,
		|	0 КАК Подобрано
		|ИЗ
		|	РегистрНакопления.СведенияОбУдержанномНДФЛ КАК СведенияОбУдержанномНДФЛ
		|ГДЕ
		|	СведенияОбУдержанномНДФЛ.Период МЕЖДУ &НачалоПериода И &КонецПериодаСведенияОбУдержанномНДФЛ
		|	И СведенияОбУдержанномНДФЛ.Организация = &Организация
		|	И СведенияОбУдержанномНДФЛ.ВидНалогаИлиПлатежа = &ВидНалогаИлиПлатежа
		|	И СведенияОбУдержанномНДФЛ.Активность";

КонецФункции

&НаСервере
Функция ТекстЗапросаОборотыЕПСБУ()

	Возврат
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВидыНалоговИПлатежей.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)) КАК ВидНалогаИлиПлатежа,
		|	ЕСТЬNULL(НалогиИПлатежиОрганизации.Ссылка, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)) КАК НалогСборПлатеж,
		|	ВЫБОР
		|		КОГДА &УчетПоИФО
		|			ТОГДА ЖурналПроводокЕПСБУОбороты.ИФО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
		|	КОНЕЦ КАК ИФО,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ЖурналПроводокЕПСБУОбороты.КФО КАК КФО,
		|	ЖурналПроводокЕПСБУОбороты.КПС КАК КПС,
		|	ЖурналПроводокЕПСБУОбороты.Счет КАК Счет,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто1, НЕОПРЕДЕЛЕНО) КАК Субконто1,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто2, НЕОПРЕДЕЛЕНО) КАК Субконто2,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто3, НЕОПРЕДЕЛЕНО) КАК Субконто3,
		|	0 КАК ОстатокРасчетов,
		|	-ЖурналПроводокЕПСБУОбороты.СуммаОборот КАК Оборот,
		|	0 КАК Подобрано
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаОбороты,
		|			,
		|			Счет = &Счет,
		|			,
		|			Организация = &Организация
		|				И Субконто1 = &ВидНалогаИлиПлатежа,
		|			,
		|			) КАК ЖурналПроводокЕПСБУОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежей КАК ВидыНалоговИПлатежей
		|		ПО ЖурналПроводокЕПСБУОбороты.Субконто1 = ВидыНалоговИПлатежей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
		|		ПО ЖурналПроводокЕПСБУОбороты.Субконто2 = НалогиИПлатежиОрганизации.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВидыНалоговИПлатежей.Ссылка, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)),
		|	ЕСТЬNULL(НалогиИПлатежиОрганизации.Ссылка, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА &УчетПоИФО
		|			ТОГДА ЖурналПроводокЕПСБУОбороты.ИФО
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Подразделение, ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ,
		|	ЖурналПроводокЕПСБУОбороты.КФО,
		|	ЖурналПроводокЕПСБУОбороты.КПС,
		|	ЖурналПроводокЕПСБУОбороты.Счет,
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто1, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто2, НЕОПРЕДЕЛЕНО),
		|	ЕСТЬNULL(ЖурналПроводокЕПСБУОбороты.Субконто3, НЕОПРЕДЕЛЕНО),
		|	0,
		|	ЖурналПроводокЕПСБУОбороты.СуммаОборот,
		|	0
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаОбороты,
		|			,
		|			Счет = &Счет,
		|			,
		|			Организация = &Организация
		|				И Субконто1 = &ВидНалогаИлиПлатежа,
		|			КорСчет = &СчетЕНП,
		|			) КАК ЖурналПроводокЕПСБУОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНалоговИПлатежей КАК ВидыНалоговИПлатежей
		|		ПО ЖурналПроводокЕПСБУОбороты.Субконто1 = ВидыНалоговИПлатежей.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НалогиИПлатежиОрганизации КАК НалогиИПлатежиОрганизации
		|		ПО ЖурналПроводокЕПСБУОбороты.Субконто2 = НалогиИПлатежиОрганизации.Ссылка";

КонецФункции

&НаСервере
Функция ТекстЗапросаОстаткиРасчетов(НомераТаблиц)

	НомераТаблиц.Вставить("ОстаткиРасчетов", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТОстаткиРасчетов.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	ВТОстаткиРасчетов.НалогСборПлатеж КАК НалогСборПлатеж,
		|	ВТОстаткиРасчетов.ИФО КАК ИФО,
		|	ВТОстаткиРасчетов.Подразделение КАК Подразделение,
		|	ВТОстаткиРасчетов.КФО КАК КФО,
		|	ВТОстаткиРасчетов.КПС КАК КПС,
		|	ВТОстаткиРасчетов.Счет КАК Счет,
		|	ВТОстаткиРасчетов.Субконто1 КАК Субконто1,
		|	ВТОстаткиРасчетов.Субконто2 КАК Субконто2,
		|	ВТОстаткиРасчетов.Субконто3 КАК Субконто3,
		|	СУММА(ВТОстаткиРасчетов.ОстатокРасчетов) КАК ОстатокРасчетов,
		|	СУММА(ВТОстаткиРасчетов.Оборот) КАК Оборот,
		|	СУММА(ВТОстаткиРасчетов.Подобрано) КАК Подобрано
		|ИЗ
		|	ВТОстаткиРасчетов КАК ВТОстаткиРасчетов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстаткиРасчетов.ВидНалогаИлиПлатежа,
		|	ВТОстаткиРасчетов.НалогСборПлатеж,
		|	ВТОстаткиРасчетов.ИФО,
		|	ВТОстаткиРасчетов.Подразделение,
		|	ВТОстаткиРасчетов.КФО,
		|	ВТОстаткиРасчетов.КПС,
		|	ВТОстаткиРасчетов.Счет,
		|	ВТОстаткиРасчетов.Субконто1,
		|	ВТОстаткиРасчетов.Субконто2,
		|	ВТОстаткиРасчетов.Субконто3";
	
	ТекстЗапроса = ТекстЗапроса +
		"
		|УПОРЯДОЧИТЬ ПО
		|	ВТОстаткиРасчетов.Счет.Код,
		|	ВТОстаткиРасчетов.ВидНалогаИлиПлатежа.Наименование,
		|	ВТОстаткиРасчетов.НалогСборПлатеж.Наименование,
		|	ВТОстаткиРасчетов.ИФО.Наименование,
		|	ВТОстаткиРасчетов.Подразделение.Наименование,
		|	ВТОстаткиРасчетов.КФО.Порядок,
		|	ВТОстаткиРасчетов.КПС.Код";	
	
	Возврат ТекстЗапроса;

КонецФункции

&НаКлиенте
Процедура ПеренестиВПодобрано(ТекущиеДанные)

	ТекущиеДанные.Подобрано = ТекущиеДанные.ОстатокРасчетов;
 	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВПодобраноОборот(ТекущиеДанные)

	ТекущиеДанные.Подобрано = ТекущиеДанные.Оборот;
 	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодобрано(ТекущиеДанные)

	ТекущиеДанные.Подобрано = 0;
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначениеПодобраноВсего(Форма)
	Форма.ПодобраноВсего = Форма.ОстаткиРасчетов.Итог("Подобрано");
	ОбновитьЗначениеОстатокЕНППослеРаспределения(Форма);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначениеОстатокЕНППослеРаспределения(Форма)
	Форма.ОстатокЕНППослеРаспределения = Форма.ОстатокЕНП - Форма.ПодобраноВсего - Форма.ПодобраноВДокументе;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для Каждого СтрокаТаблицы Из ОстаткиРасчетов Цикл
		ОбновитьТекстОтражениеВУчете(СтрокаТаблицы);
		СтрокаТаблицы.ЗаголовокОстаток = НСтр("ru = 'Остаток:'");
		СтрокаТаблицы.ЗаголовокОборот  = НСтр("ru = 'Оборот:'");
	КонецЦикла;

КонецПроцедуры
		
&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстОтражениеВУчете(ДанныеСтроки)
	
	ЕдиныйНалоговыйСчетКлиентСервер.ОбновитьТекстОтражениеВУчетеРаспределениеЕНП(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройкиОтраженияВУчете(ДанныеСтроки)

	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("ТолькоПросмотр", Истина);
	
	ПараметрыФормы.Вставить("ВидимостьКФО", 			Ложь);
	ПараметрыФормы.Вставить("ВидимостьКПС", 			Ложь);
	ПараметрыФормы.Вставить("ОбязательностьКПС", 		Ложь);
	ПараметрыФормы.Вставить("ВидимостьКЭК", 			Ложь);
	ПараметрыФормы.Вставить("ВидимостьПодразделение", 	Истина);
	ПараметрыФормы.Вставить("ВидимостьКоличество", 		Ложь);

	ПараметрыФормы.Вставить("Подразделение", ДанныеСтроки.Подразделение);
	ПараметрыФормы.Вставить("РежимОбязательноУказатьПодразделение", Истина);
	
	ПараметрыФормы.Вставить("Счет",      ДанныеСтроки.Счет);
	ПараметрыФормы.Вставить("Субконто1", ДанныеСтроки.Субконто1);
	ПараметрыФормы.Вставить("Субконто2", ДанныеСтроки.Субконто2);
	ПараметрыФормы.Вставить("Субконто3", ДанныеСтроки.Субконто3);
	
	ПараметрыФормы.Вставить("ЗаголовокФормы", 			НСтр("ru = 'Аналитика распределения единого налогового платежа'"));
	ПараметрыФормы.Вставить("ЗаголовокСчет", 			НСтр("ru = 'Счет дебета'"));
	ПараметрыФормы.Вставить("ЗаголовокПодразделение", 	НСтр("ru = 'Подразделение'"));
	
	ПараметрыФормы.Вставить("ЕстьНДС", 			 Ложь);
	ПараметрыФормы.Вставить("НДСКРаспределению", Ложь);
	ПараметрыФормы.Вставить("СчетУчетаНДС", 	 Неопределено);
	ПараметрыФормы.Вставить("ЕстьНалоговыйУчет", Ложь);
	
	ОткрытьФорму("ОбщаяФорма.НастройкаОтраженияВУчете", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокИФОПодразделение()
	
	Если УчетПоИФО И Не УчетПоПодразделениям Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОстаткиРасчетовИФОПодразделение",
			"Заголовок", НСтр("ru = 'ИФО'"));
		
	ИначеЕсли Не УчетПоИФО И УчетПоПодразделениям Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОстаткиРасчетовИФОПодразделение",
			"Заголовок", НСтр("ru = 'Подразделение'"));	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПредставлениеПериода(Форма)

	НачалоПериода = Форма.НачалоПериода;
	КонецПериода  = Форма.КонецПериода;
	КонецПериода  = ?(ЗначениеЗаполнено(КонецПериода), КонецДня(КонецПериода), КонецПериода);
	
	ЭтоМесяцИлиКвартал = ЗначениеЗаполнено(НачалоПериода) И ЗначениеЗаполнено(КонецПериода)
		И ((НачалоПериода = НачалоМесяца(НачалоПериода) И КонецПериода = КонецМесяца(НачалоПериода))
		Или (НачалоПериода = НачалоКвартала(НачалоПериода) И КонецПериода = КонецКвартала(НачалоПериода)));
	
	Если ЭтоМесяцИлиКвартал Тогда
		ПредставлениеПериодаОбороты = ПредставлениеПериода(НачалоПериода, КонецПериода);	
	Иначе
		ПредставлениеПериодаОбороты	= СтрШаблон("%1 - %2", Формат(НачалоПериода,"ДФ=dd.MM.yyyy; ДП=..."),
			Формат(КонецПериода,"ДФ=dd.MM.yyyy; ДП=..."));
	КонецЕсли;	
	
	Форма.ПредставлениеПериодаОбороты = ПредставлениеПериодаОбороты;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьГоловнаяОрганизация()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГоловнаяОрганизация",
		"Видимость", ЕстьУчетОбособленныхПодразделений);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовПоказатьОбороты(Форма)
	
	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПредставлениеПериодаОбороты",
		"Видимость", Форма.ПоказатьОбороты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОборотыВсего",
		"Видимость", Форма.ПоказатьОбороты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВариантНДФЛ",
		"Видимость", Форма.ЭтоНДФЛ и Форма.ПоказатьОбороты);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОстаткиРасчетовПодразделение");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"ОстаткиРасчетов.УчетПоПодразделениям", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст",      НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОстаткиРасчетовЗаголовокОборот");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"ПоказатьОбороты", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОстаткиРасчетовОборот");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"ПоказатьОбороты", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОстаткиРасчетовКартинкаПереместитьВПравоОбороты");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"ПоказатьОбороты", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОстаткиРасчетовОстатокРасчетов");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"ПоказатьОбороты", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
 
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОстаткиРасчетовКартинкаПереместитьВПраво");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"ПоказатьОбороты", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиПоНалогу(НастройкиНалога)
	
	Если НастройкиНалога = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НастройкиНалога.Свойство("ПоказатьОбороты") Тогда
		ПоказатьОбороты = НастройкиНалога.ПоказатьОбороты;
	КонецЕсли;
	
	Если ПоказатьОбороты Тогда
		ВосстановитьНастройкуПоказатьОбороты(НастройкиНалога);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкуПоказатьОбороты(НастройкиНалога)

	Если НастройкиНалога = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если НастройкиНалога.Свойство("НачалоПериода") И НастройкиНалога.Свойство("КонецПериода")
		И НастройкиНалога.Свойство("ДатаДокумента") Тогда
		
		ЭтоКонецМесяца = КонецДня(НастройкиНалога.КонецПериода) = КонецМесяца(НастройкиНалога.КонецПериода);
		ЭтоКвартал  = НастройкиНалога.НачалоПериода = НачалоКвартала(НастройкиНалога.НачалоПериода)
			И КонецДня(НастройкиНалога.КонецПериода) = КонецКвартала(НастройкиНалога.КонецПериода);
			
		Если ЭтоКвартал Тогда
			Смещение = ОбщегоНазначенияБГУКлиентСервер.КоличествоМесяцевМеждуДатами(НачалоКвартала(НастройкиНалога.ДатаДокумента),
				НачалоКвартала(ДатаДокумента), Ложь);
		Иначе
			Смещение = ОбщегоНазначенияБГУКлиентСервер.КоличествоМесяцевМеждуДатами(НастройкиНалога.ДатаДокумента, ДатаДокумента, Ложь);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(НастройкиНалога.НачалоПериода) Тогда
			НачалоПериода = ДобавитьМесяц(НастройкиНалога.НачалоПериода, Смещение);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НастройкиНалога.КонецПериода) Тогда
			КонецПериода = ДобавитьМесяц(НастройкиНалога.КонецПериода, Смещение);
			КонецПериода = ?(ЭтоКонецМесяца, КонецМесяца(КонецПериода), КонецПериода);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоНДФЛ И НастройкиНалога.Свойство("ВариантНДФЛ") Тогда
		ВариантНДФЛ = НастройкиНалога.ВариантНДФЛ;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиПоНалогу(Знач СохранитьНастройкуПоказатьОбороты)
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("РаспределениеЕНП_ФормаПодбораДанныеСтроки", "");
	Если Настройки = Неопределено Тогда
		Настройки = Новый Соответствие;
	КонецЕсли;
	
	Если Настройки[ВидНалогаИлиПлатежа] = Неопределено Тогда
		Настройки.Вставить(ВидНалогаИлиПлатежа, Новый Структура());
	КонецЕсли;

	НастройкиНалога = Настройки[ВидНалогаИлиПлатежа];
	НастройкиНалога.Вставить("ПоказатьОбороты", ПоказатьОбороты);
	
	Если СохранитьНастройкуПоказатьОбороты Тогда
		НастройкиНалога.Вставить("ДатаДокумента",   ДатаДокумента);	
		НастройкиНалога.Вставить("НачалоПериода",   НачалоПериода);
		НастройкиНалога.Вставить("КонецПериода",    КонецПериода);
		Если ЭтоНДФЛ Тогда
			НастройкиНалога.Вставить("ВариантНДФЛ", ВариантНДФЛ);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("РаспределениеЕНП_ФормаПодбораДанныеСтроки", "", Настройки);

КонецПроцедуры

#КонецОбласти
