#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	ИзменитьНастройкиФормыПоВладельцу(); 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ИзменитьНастройкиФормыПоВладельцу();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьНастройкиФормыПоВладельцу()
	
	Перем ТипВладельца;
	
	ТипВладельца = ТипЗнч(Объект.Владелец);
	НельзяРедактировать = Ложь;
	Если ТипВладельца = Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов")
		ИЛИ ТипВладельца = Тип("СправочникСсылка.СпискиЗначенийАналитик") Тогда
				
		Если Объект.Владелец.ВозможностьРедактированияВПодчиненныхКонфигурациях = Ложь Тогда
			НельзяРедактировать = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтотОбъект.ТолькоПросмотр = НельзяРедактировать;
	
	Если НельзяРедактировать
		И Модифицированность Тогда
		//снимем признак модифицированности, чтобы при закрытии платформа не предлагала сохранить
		Модифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

