#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ПорядокИзменился;
Перем ИсходнаяГруппа;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	//Проверку периода действия делаем всегда, в том числе и при обмене
	Если Предопределенный Тогда
		Если ЗначениеЗаполнено(ДатаНачалаДействия) Тогда
			ДатаНачалаДействия = '00010101000000';
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
			ДатаОкончанияДействия = '00010101000000';
		КонецЕсли;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Или ДополнительныеСвойства.Свойство("ОтключитьБизнесЛогику") Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка периода действия счета.
	Если ДатаНачалаДействия > ДатаОкончанияДействия И ДатаОкончанияДействия <> '00010101' Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата начала действия счета превышает дату окончания.'"),,,, Отказ);
	ИначеЕсли Не ПометкаУдаления Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Код"						, Код);
		Запрос.УстановитьПараметр("Ссылка"					, Ссылка);
		Запрос.УстановитьПараметр("ДатаНачалаДействия"		, ДатаНачалаДействия);
		Запрос.УстановитьПараметр("ДатаОкончанияДействия"	, ДатаОкончанияДействия);
		Запрос.УстановитьПараметр("ПустаяДата"				, '00010101');
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка,
		|	ЕПСБУ.Код КАК Код,
		|	ЕПСБУ.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ЕПСБУ.ДатаОкончанияДействия КАК ДатаОкончанияДействия
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Код = &Код
		|	И ЕПСБУ.Ссылка <> &Ссылка
		|	И (ЕПСБУ.ДатаНачалаДействия <= &ДатаОкончанияДействия
		|			ИЛИ &ДатаОкончанияДействия = &ПустаяДата)
		|	И (ЕПСБУ.ДатаОкончанияДействия >= &ДатаНачалаДействия
		|			ИЛИ ЕПСБУ.ДатаОкончанияДействия = &ПустаяДата)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Шаблон = НСтр("ru = 'Период действия счета %1 (%2 - %3) пересекается с периодом действия счета %4 (%5 - %6)'");
		Фт = "ДЛФ=D; ДП='<не задана>'";
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = СтрШаблон(Шаблон, Код, Формат(ДатаНачалаДействия, Фт), Формат(ДатаОкончанияДействия, Фт),
				Выборка.Код, Формат(Выборка.ДатаНачалаДействия, Фт), Формат(Выборка.ДатаОкончанияДействия, Фт));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Выборка.Ссылка,,, Отказ);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		ИзменяемыеПризнакиУчета = Новый Массив;
		Если Не Валютный И Ссылка.Валютный Тогда
			ИзменяемыеПризнакиУчета.Добавить("Валютный");
		КонецЕсли;
		Если Не УчетПоПодразделениям И Ссылка.УчетПоПодразделениям Тогда
			ИзменяемыеПризнакиУчета.Добавить("УчетПоПодразделениям");
		КонецЕсли;
		Если ИзменяемыеПризнакиУчета.Количество() > 0 Тогда
			УстановитьПривилегированныйРежим(Истина);
			РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.ОчиститьИзмерениеПоПризнакуУчета(Ссылка, ИзменяемыеПризнакиУчета, Null);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
	//Если счет не новый, то проверяем группу учета по подразделениям для данного счета, если новый, то для родителя
	Если НЕ Ссылка.Пустая() Тогда
		Счет = Ссылка;
	ИначеЕсли НЕ Ссылка.Родитель.Пустая() Тогда
		Счет = Ссылка.Родитель;
	Иначе
		Счет = Неопределено;
	КонецЕсли;
	
	ИсходнаяГруппа = ?(ЗначениеЗаполнено(Счет), ПланыСчетов.ЕПСБУ.ГруппаУчетаПоПодразделениям(Счет), "");
	
	Если УчетПоКЭК <> УчетПоКПС Тогда
		Если ТипСчета = Перечисления.ТипыСчетов.Налоговый Тогда
			УчетПоКЭК = Ложь; // На счетах налогового учета учет по КЭК не ведется.
		ИначеЕсли НЕ Забалансовый Тогда
			УчетПоКЭК = УчетПоКПС;
		КонецЕсли;
	КонецЕсли;
	
	Если Не УчетПоКЭК Тогда
		КОСГУДт = Справочники.КОСГУ.ПустаяСсылка();
		КОСГУКт = Справочники.КОСГУ.ПустаяСсылка();
	КонецЕсли;
	
	Если Забалансовый Тогда
		НомерЖурнала = Справочники.Журналы.ПустаяСсылка();
	КонецЕсли;
	
	АктуализироватьПорядок();
	
	// Установим признак ЭлементГруппа у Родителя
	
	Если Не Родитель = Ссылка.Родитель Тогда
		
		Если Не Ссылка.Родитель.Пустая() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПланСчетов.Ссылка КАК Ссылка
			|ИЗ
			|	ПланСчетов.ЕПСБУ КАК ПланСчетов
			|ГДЕ
			|	ПланСчетов.Ссылка <> &Ссылка
			|	И ПланСчетов.Родитель = &Родитель";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("Родитель", Ссылка.Родитель);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				РодительОбъект = Ссылка.Родитель.ПолучитьОбъект();
				РодительОбъект.ДополнительныеСвойства.Вставить("ЗаписываемыйСчет",Ссылка);//чтобы не помешать записи счета, когда запись родителя вызывается ПередЗаписью счета
				РодительОбъект.ЭлементГруппа = Ложь;
				РодительОбъект.Записать();
				
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Родитель.Пустая() Тогда
			РодительОбъект = Родитель.ПолучитьОбъект();
			Если НЕ РодительОбъект.ЭлементГруппа Тогда
				РодительОбъект.ЭлементГруппа = Истина;
				РодительОбъект.ДополнительныеСвойства.Вставить("ЗаписываемыйСчет",Ссылка);//чтобы не помешать записи счета, когда запись родителя вызывается ПередЗаписью счета
				РодительОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// проверить, не добавлены ли субконто составного типа
	СубконтоСоставныхТипов = Новый Массив;
	Для Каждого ЭлементВидаСубконто Из ВидыСубконто Цикл
		
		Если ЭлементВидаСубконто.ВидСубконто.ТипЗначения.Типы().Количество() > 1 Тогда
			СубконтоСоставныхТипов.Добавить(ЭлементВидаСубконто.ВидСубконто);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СубконтоСоставныхТипов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕПСБУВидыСубконто.ВидСубконто КАК ВидСубконто
		|ИЗ
		|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
		|ГДЕ
		|	ЕПСБУВидыСубконто.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ИндексСубконто = СубконтоСоставныхТипов.Найти(Выборка.ВидСубконто);
			Если ИндексСубконто <> Неопределено Тогда
				СубконтоСоставныхТипов.Удалить(ИндексСубконто);
			КонецЕсли;
			
		КонецЦикла;
		
		Если СубконтоСоставныхТипов.Количество() > 0 Тогда
			ДополнительныеСвойства.Вставить("ДобавленныеСубконтоСоставныхТипов", СубконтоСоставныхТипов);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Или ДополнительныеСвойства.Свойство("ОтключитьБизнесЛогику") Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим группу учета по подразделениям
	Группа = ПланыСчетов.ЕПСБУ.ГруппаУчетаПоПодразделениям(Ссылка);
	ГруппаИзменилась = Группа <> ИсходнаяГруппа;
	
	// Установим порядок подчиненных элементов
	Если ПорядокИзменился Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Родитель = &Родитель
		|	И ЕПСБУ.Ссылка <> &ЗаписываемыйСчет";
		
		ЗаписываемыйСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		ДополнительныеСвойства.Свойство("ЗаписываемыйСчет",ЗаписываемыйСчет);
		
		Запрос.УстановитьПараметр("Родитель", Ссылка);
		Запрос.УстановитьПараметр("ЗаписываемыйСчет", ЗаписываемыйСчет);//чтобы не помешать записи счета, когда запись родителя вызывается ПередЗаписью счета
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Выборка.Ссылка.ПолучитьОбъект().Записать();
		КонецЦикла;
		
	КонецЕсли;
	
	// Установим учет по подразделениям для подчиненных счетов
	Если ГруппаИзменилась И ЗначениеЗаполнено(Группа) Тогда
		
		Учет = ПланыСчетов.ЕПСБУ.УчетПоПодразделениямГруппы(Группа);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕПСБУ.Ссылка КАК Ссылка
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
		|ГДЕ
		|	ЕПСБУ.Ссылка В ИЕРАРХИИ(&Родитель)
		|	И ЕПСБУ.Ссылка <> &Родитель";
		
		Запрос.УстановитьПараметр("Родитель", Ссылка);
			
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СчетОбъект = Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ СчетОбъект.Предопределенный
				И СчетОбъект.УчетПоПодразделениям <> Учет Тогда
				СчетОбъект.УчетПоПодразделениям = Учет;
				СчетОбъект.ОбменДанными.Загрузка = Истина;
				СчетОбъект.Записать();
			КонецЕсли;			
		КонецЦикла;
		
	КонецЕсли;
	
	// проверить, не добавлены ли субконто составного типа
	СубконтоСоставныхТипов = Неопределено;
	Если ДополнительныеСвойства.Свойство("ДобавленныеСубконтоСоставныхТипов", СубконтоСоставныхТипов) Тогда
		
		Для Каждого ТекущийВидСубконто Из СубконтоСоставныхТипов Цикл
		
			ДокументыДвижений = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.ПолучитьДокументыДвиженийССубконтоСоставногоТипа(ТекущийВидСубконто);
			РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.УстановитьПустоеЗначениеВДвиженияхССубконтоСоставногоТипа(ДокументыДвижений, Отказ,,);
			
			Если Отказ Тогда
				ТекстОшибки = НСтр("ru = 'Не удалось установить пустое значение субконто ""%1"" в проводках.
					|Подробности в журнале регистрации.'");
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ТекстОшибки, ТекущийВидСубконто));
				Возврат;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка.Родитель) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетРодитель.Родитель КАК Родитель,
		|	СчетРодитель.Родитель.ЭлементГруппа КАК ЭлементГруппа,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.Ссылка ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ДолженБытьГруппой
		|ИЗ
		|	ПланСчетов.ЕПСБУ КАК СчетРодитель
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		|			Счет.Ссылка КАК Ссылка,
		|			Счет.Родитель КАК Родитель
		|		ИЗ
		|			ПланСчетов.ЕПСБУ КАК Счет
		|		ГДЕ
		|			Счет.Родитель = &СсылкаРодитель
		|			И Счет.Ссылка <> &Ссылка) КАК ВложенныйЗапрос
		|		ПО СчетРодитель.Родитель = ВложенныйЗапрос.Родитель
		|ГДЕ
		|	СчетРодитель.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("СсылкаРодитель", Ссылка.Родитель);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Если Не ЗначениеЗаполнено(Выборка.Родитель) Тогда
				Возврат;
			КонецЕсли;
			
			Если Выборка.ЭлементГруппа <> Выборка.ДолженБытьГруппой Тогда
				
				ОбъектРодитель = Выборка.Родитель.ПолучитьОбъект();
				
				Если ОбъектРодитель = Неопределено Тогда
					Возврат;
				КонецЕсли;
				ОбъектРодитель.ДополнительныеСвойства.Вставить("ЗаписываемыйСчет",Ссылка);//чтобы не помешать записи счета, когда запись родителя вызывается ПередЗаписью счета	
				ОбъектРодитель.ЭлементГруппа = Выборка.ДолженБытьГруппой;
				
				Попытка
					ОбъектРодитель.Записать();
				Исключение
					Отказ = Истина;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЗначениеЗаполнено(ОбъектКопирования.ДатаОкончанияДействия) Тогда
		ДатаНачалаДействия		= КонецДня(ОбъектКопирования.ДатаОкончанияДействия) + 1;
		ДатаОкончанияДействия	= '00010101';
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура АктуализироватьПорядок() Экспорт
	
	АктуальныйПорядок = ПланыСчетов.ЕПСБУ.ПолучитьПорядокСчета(ЭтотОбъект);
	ПорядокИзменился = (Порядок <> АктуальныйПорядок);
	
	Если ПорядокИзменился Тогда
		Порядок = АктуальныйПорядок;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
