#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ВидРаспоряженияПоСчету(Счет) Экспорт
	
	Если БухгалтерскийУчет.СчетВИерархии(Счет, "01") Тогда
		ВидРаспоряжения = Перечисления.ВидыРаспоряженияОС.ПолученоВПользование;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Счет, "02") Тогда
		ВидРаспоряжения = Перечисления.ВидыРаспоряженияОС.НаХранении;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Счет, "25") Тогда
		ВидРаспоряжения = Перечисления.ВидыРаспоряженияОС.ПереданоВАренду;
	ИначеЕсли БухгалтерскийУчет.СчетВИерархии(Счет, "26") Тогда
		ВидРаспоряжения = Перечисления.ВидыРаспоряженияОС.ПереданоВПользование;
	Иначе
		ВидРаспоряжения = Перечисления.ВидыРаспоряженияОС.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ВидРаспоряжения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
