#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияБГУ.УстановитьОтборСпискаПоОрганизации(ЭтотОбъект, "Список", "Организация", ОтборОрганизация);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	Если Параметры.Свойство("РежимОткрытияОкна") Тогда
		//@skip-check unknown-form-parameter-access
		РежимОткрытияОкна = Параметры.РежимОткрытияОкна;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация,,,
		ЗначениеЗаполнено(ОтборОрганизация));
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьПоУмолчанию(Команда)
	Если Не ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать организацию'"),,"ОтборОрганизация");
		Возврат;
	КонецЕсли;
	ЗагрузитьПоУмолчаниюНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.ОперацииУчетаВещевогоДовольствия"));
	ПоказатьПредупреждение(,НСтр("ru = 'Загружены элементы по умолчанию'"));
КонецПроцедуры

&НаКлиенте
Асинх Процедура СохранитьСписокОпераций(Команда)
	Если Не ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать организацию'"),,"ОтборОрганизация");
		Возврат;
	КонецЕсли;
	АдресФайла = СформироватьФайлОпераций(ОтборОрганизация, УникальныйИдентификатор);
	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов("Сохранение файла операций");
	Ждать ПолучитьФайлССервераАсинх(АдресФайла, "Операции учета вещевого довольствия.xml", ПараметрыДиалога);
КонецПроцедуры


&НаКлиенте
Асинх Процедура ЗаполнитьПоШаблону(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные) <> Тип("ДанныеФормыСтруктура")
			Или Не ТекущиеДанные.Свойство("Ссылка") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Существующая настройка операции будет заменена настройкой из шаблона.
		|Продолжить?'");
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ОперацииУчетаВещевогоДовольствия.Форма.ВыборШаблонаОперации",
		Новый Структура("ВыбраннаяОперация", ТекущиеДанные.Ссылка), ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Организация",
		"Видимость", Не ЗначениеЗаполнено(Форма.ОтборОрганизация));
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПоУмолчаниюНаСервере()

	Справочники.ОперацииУчетаВещевогоДовольствия.ЗагрузитьНастройкиПоУмолчанию(ОтборОрганизация);

КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьФайлОпераций(Знач Организация, Знач УникальныйИдентификатор)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(Справочники.ОперацииУчетаВещевогоДовольствия.ВыгрузитьДанныеСправочника(Организация));
	ТекстовыйДокумент.Записать(ИмяВременногоФайла, "UTF-8");
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	Адрес = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	//@skip-check empty-except-statement
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// обработка исключения не требуется
	КонецПопытки;
	
	Возврат Адрес;

КонецФункции

#КонецОбласти
