
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСвойстваЭлементовУчитываемыхКЭКОплатаТруда(Форма) Экспорт
	УстановитьЗаголовкиУчитываемыхКЭКОплатаТруда(Форма);
	УстановитьЗначенияУчитываемыхКЭКОплатаТруда211(Форма);
	УстановитьТолькоПросмотрУчитываемыхКЭКОплатаТруда211(Форма);
КонецПроцедуры

Процедура УстановитьЗаголовкиУчитываемыхКЭКОплатаТруда(Форма)

	КодыКОСГУ = Новый Массив;
	КодыКОСГУ.Добавить("211");
	КодыКОСГУ.Добавить("212");
	КодыКОСГУ.Добавить("213");
	КодыКОСГУ.Добавить("214");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОСГУ.Код,
	|	КОСГУ.НаименованиеПолное
	|ИЗ
	|	Справочник.КОСГУ КАК КОСГУ
	|ГДЕ
	|	КОСГУ.Код В (&Коды)
	|	И НЕ КОСГУ.ПометкаУдаления";
	Запрос.УстановитьПараметр("Коды", КодыКОСГУ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Заголовок = СтрШаблон(НСтр("ru = '%1 - %2'"), Выборка.Код, Выборка.НаименованиеПолное);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ВключатьВБазуОплатаТрудаКЭК" + Выборка.Код, "Заголовок", Заголовок);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьЗначенияУчитываемыхКЭКОплатаТруда211(Форма)
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВключатьВБазуОплатаТрудаКЭК211") Тогда
		Форма["ВключатьВБазуОплатаТрудаКЭК211"] = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьТолькоПросмотрУчитываемыхКЭКОплатаТруда211(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ВключатьВБазуОплатаТрудаКЭК211", "ТолькоПросмотр", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
