
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// настройка видимости элементов
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВалютаДокумента",
		"Видимость", Параметры.ПоказыватьВалюту);
		
	ЭлементыНДС = Новый Массив;
	ЭлементыНДС.Добавить("УчитыватьНДС");
	ЭлементыНДС.Добавить("СуммаВключаетНДС");
	ЭлементыНДС.Добавить("ПринятьНДСКВычету");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыНДС,
		"Видимость", Параметры.ПоказыватьНДС);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УчитыватьНДС",
		"Видимость", Параметры.ПоказыватьУчитыватьНДС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПринятьНДСКВычету",
		"Видимость", Параметры.ПоказыватьПринятьНДСКВычету);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТипЦены",
		"Видимость", Параметры.ПоказыватьТипЦены);
	
	ЭлементыКурсаВалют = Новый Массив;
	ЭлементыКурсаВалют.Добавить("Курс");
	ЭлементыКурсаВалют.Добавить("Кратность");
	ЭлементыКурсаВалют.Добавить("ОбновитьКурс");
	ЭлементыКурсаВалют.Добавить("Группа3");
	ЭлементыКурсаВалют.Добавить("ДатаУстановкиКурсаИКратности");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыКурсаВалют,
		"Видимость", Параметры.ПоказыватьКурсВалюты);
	
	Если Параметры.ПоказыватьКурсВалюты Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВалюта",
			"Отображение", ОтображениеОбычнойГруппы.СлабоеВыделение);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаВалюта",
			"ОтображатьЗаголовок", Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ПредупреждениеПриРедактированииВалюты") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВалютаДокумента",
			"ПредупреждениеПриРедактировании", Параметры.ПредупреждениеПриРедактированииВалюты);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВалютаДокумента",
			"ОтображениеПредупрежденияПриРедактировании", ОтображениеПредупрежденияПриРедактировании.Отображать);
	КонецЕсли;
	
	// начальное заполнение формы
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,
		"ВалютаДокумента, УчитыватьНДС, ПринятьНДСКВычету, СуммаВключаетНДС, ТипЦены, Курс, Кратность, ДатаУстановкиКурсаИКратности");
	
	Если НЕ Параметры.ПоказыватьУчитыватьНДС Тогда
		ЭтотОбъект.УчитыватьНДС = Параметры.ПоказыватьНДС; // Нет флага "Учитывать НДС", но сам НДС есть.
	КонецЕсли;
	
	УстановитьДоступностьЭлементовНДС(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если Параметры.ПоказыватьКурсВалюты Тогда
		СтруктураКурса = ПолучитьКурсВалюты(ВалютаДокумента, ДатаУстановкиКурсаИКратности);
		Курс = СтруктураКурса.Курс;
		Кратность = СтруктураКурса.Кратность;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПересчитатьИЗакрыть(Команда)
	
	Результат = Новый Структура;
	Отказ = Ложь;
	
	Если Параметры.ПоказыватьВалюту Тогда
		Результат.Вставить("ВалютаДокумента");
		Если Не ЗначениеЗаполнено(ВалютаДокумента) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Валюта документа"),,
					"ВалютаДокумента",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ПоказыватьНДС Тогда
		Результат.Вставить("УчитыватьНДС");
		Результат.Вставить("ПринятьНДСКВычету");
		Результат.Вставить("СуммаВключаетНДС");
	КонецЕсли;
	
	Если Параметры.ПоказыватьТипЦены Тогда
		Результат.Вставить("ТипЦены");
	КонецЕсли;
	
	Если Параметры.ПоказыватьКурсВалюты Тогда
		Результат.Вставить("Курс");
		Результат.Вставить("Кратность");
		Если Курс = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Курс"),,
					"Курс",,Отказ);
		КонецЕсли;
		Если Кратность = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Кратность"),,
					"Кратность",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовНДС(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКурс(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьКурсЗавершение", ЭтотОбъект);
	
	ПоказатьВводДаты(ОписаниеОповещения, ДатаУстановкиКурсаИКратности, 
		НСтр("ru = 'Установить курс на дату'"), ЧастиДаты.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКурсЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) = Тип("Дата") Тогда
		
		ДатаУстановкиКурсаИКратности = Результат;
		// Если дата введена, заполним значение курса и кратности
		СтруктураВалюты = ПолучитьКурсВалюты(ВалютаДокумента, ДатаУстановкиКурсаИКратности);
		Курс = СтруктураВалюты.Курс;
		Кратность = СтруктураВалюты.Кратность;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьКурсВалюты(Валюта, ДатаУстановкиКурсаИКратности)
	
	Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта, ДатаУстановкиКурсаИКратности);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовНДС(Форма)

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("СуммаВключаетНДС");
	ИменаЭлементов.Добавить("ПринятьНДСКВычету");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Доступность", Форма.УчитыватьНДС);

КонецПроцедуры

#КонецОбласти
