#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктСписанияМягкогоИХозИнвентаря";
	КомандаПечати.Идентификатор		= "АктСписанияМЗ0504143_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о списании мягкого и хоз. инвентаря'"), "0504143", "52н", "103н");
	КомандаПечати.Порядок			= 1;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктСписанияМягкогоИХозИнвентаря";
	КомандаПечати.Идентификатор		= "Акт0510434";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт приема-передачи в личное пользование'"), "0510434", "61н");
	КомандаПечати.Порядок			= 1;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВыдатьВЛичноеПользование",
		Истина);
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктСписанияМягкогоИХозИнвентаря";
	КомандаПечати.Идентификатор		= "АктСписанияМЗ0504143_52н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о списании мягкого и хоз. инвентаря'"), "0504143", "52н");
	КомандаПечати.Порядок			= 2;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.АктСписанияМягкогоИХозИнвентаря";
	КомандаПечати.Идентификатор		= "АктСписанияМЗ0504143";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Акт о списании мягкого и хоз. инвентаря (ф. 0504143)'");
	КомандаПечати.Порядок			= 100;
	ПервичныеДокументыБГУ.ДобавитьУсловиеКомандыПечати(КомандаПечати);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияМЗ0504143_103н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АктСписанияМЗ0504143_103н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о списании мягкого и хоз. инвентаря'"), "0504143", "52н", "103н"),
			ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияМягкогоИнвентаря0504143_103н"));
	КонецЕсли;
			
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияМЗ0504143_52н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АктСписанияМЗ0504143_52н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о списании мягкого и хоз. инвентаря'"), "0504143", "52н"),
			ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияМягкогоИнвентаря504143_52н"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСписанияМЗ0504143") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"АктСписанияМЗ0504143",
			"Списание материалов",
			ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктСписанияМягкогоИнвентаря0504143"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт0510434") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Акт0510434",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт приема-передачи в личное пользование'"), "0510434", "61н"),
			Напечатать0510434(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	НеРедактируемыеРеквизиты = Новый Массив;
	
	// Реквизит "НеПересчитыватьСумму" устанавливается только при загрузке данных
	НеРедактируемыеРеквизиты.Добавить("НеПересчитыватьСумму");
	
	Возврат НеРедактируемыеРеквизиты;
	
КонецФункции

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы.
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("Номенклатура");
	ИменаРеквизитов.Добавить("СчетУчета");
	ИменаРеквизитов.Добавить("ДополнительнаяАналитикаСчета");
	ИменаРеквизитов.Добавить("КПС");
	ИменаРеквизитов.Добавить("Количество");
	Результат.Вставить("Материалы", ИменаРеквизитов);
	ИменаСкрываемыхКнопок = Новый Массив;
	ИменаСкрываемыхКнопок.Добавить("МатериалыЗаполнитьКПСНоменклатура");
	Результат.Вставить("ИменаСкрываемыхКнопок", ИменаСкрываемыхКнопок);
	Возврат Результат;
КонецФункции

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу двдижений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - Таблица значений. Таблица проводок, которые будут сформированы
//  ДокументОбъект - Документ объект. Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура. Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - Таблица значений. Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка. Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт
	
	ОтразитьВКарточкеКапвложений = Ложь;
	Если НЕ ДополнительныеРеквизиты.Свойство("ОтразитьВКарточкеКапвложений", ОтразитьВКарточкеКапвложений) 
		ИЛИ НЕ ОтразитьВКарточкеКапвложений Тогда
		// Если движения в карточке капвложений отражать не нужно, то ничего не делаем	
		Возврат Истина;	
	ИначеЕсли НЕ ОбслуживаниеКарточекКапвложений.ЭтоСчетКапвложений(ДополнительныеРеквизиты.СчетДт) Тогда
		Возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(ДополнительныеРеквизиты.КарточкаКапвложений) Тогда
		ТекстОшибки = НСтр("ru = 'На закладке документа ""Бухгалтерская операция"" включен флажок 
		|""Отражать в карточке капвложений"", но не заполнена Карточка капвложений'");
		Возврат Ложь;
	КонецЕсли;		
	
	НоваяСтрока = ТабДвижений.Добавить();
	НоваяСтрока.Организация         = ДокументОбъект.Организация;
	НоваяСтрока.КарточкаКапвложений = ДополнительныеРеквизиты.КарточкаКапвложений;
	НоваяСтрока.Период              = ДокументОбъект.Дата;
	
	Возврат Истина;
КонецФункции	

Функция ТекстЗапросаТаблицыДляРасчетаДвижений() Экспорт

	Возврат УправлениеМатериальнымиЗапасами.ТекстЗапросаТаблицыДляРасчетаДвиженийАктыСписанияМЗ(
	"Документ.АктСписанияМягкогоИХозИнвентаря.Материалы");

КонецФункции

// Подготовить таблицу списание материальных запасов по документу.
// 
// Параметры:
//  Документ - ДокументОбъект.АктСписанияМЗ
//  Параметры - Структура
// 
// Возвращаемое значение:
//  см. УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасовПоДокументу
Функция ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(Документ, Параметры) Экспорт
	Возврат УправлениеМатериальнымиЗапасами.ТаблицаСписанияМатериальныхЗапасовПоДокументуАктыСписанияМЗ(Документ, Параметры);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

Функция ПечатьАктСписанияМягкогоИнвентаря(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "АктСписанияМягкогоИнвентаря_0504143";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет." + ИмяМакета);
	
	ОбластьМакетаЗаголовок  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакетаШапка      = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока     = Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаИтого      = Макет.ПолучитьОбласть("Итого");
	ОбластьМакетаСтр2Начало = Макет.ПолучитьОбласть("Стр2Начало");
	ОбластьМакетаКомиссия   = Макет.ПолучитьОбласть("Комиссия");
	ОбластьМакетаСтр2       = Макет.ПолучитьОбласть("Стр2");
	ОбластьМакетаСтр2Шапка  			= Макет.ПолучитьОбласть("Стр2Шапка");
	ОбластьМакетаСтр2Строка				= Макет.ПолучитьОбласть("Стр2Строка");
	ОбластьМакетаСтр2Подвал 			= Макет.ПолучитьОбласть("Стр2Подвал");
	ОбластьМакетаПодвал     = Макет.ПолучитьОбласть("Подвал");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счет27)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Контрагенты)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счет27)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Контрагенты)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Контрагенты
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счет27)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Контрагенты)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДержательИмущества,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭККт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт) КАК Количество
	|ПОМЕСТИТЬ Движения
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И СубконтоКт1 ССЫЛКА Справочник.Номенклатура,
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|ГДЕ
	|	(ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счет27))
	|	И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Контрагенты
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счет27)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Контрагенты)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Контрагенты
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счет27)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Контрагенты)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Контрагенты
	|				И ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт В (&Счет27)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Контрагенты)
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Номенклатура,
	|	СчетКт,
	|	КПСКт,
	|	ДержательИмущества
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка КАК Ссылка,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.НомерСтроки КАК НомерСтроки,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Номенклатура КАК Номенклатура,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.КоличествоНорма КАК КоличествоНорма,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Количество КАК Количество,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.ПричинаСписания КАК ПричинаСписания,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.СрокВЭксплуатации КАК СрокВЭксплуатации,
	|	ВЫБОР
	|		КОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета ССЫЛКА Справочник.Контрагенты
	|				И АктСписанияМягкогоИХозИнвентаряМатериалы.СчетУчета В (&Счет27)
	|			ТОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДополнительнаяАналитикаСчета,
	|	Движения.СчетДт КАК СчетДт,
	|	Движения.КПСДт КАК КПСДт,
	|	Движения.КЭКДт КАК КЭКДт,
	|	Движения.КФО КАК КФО,
	|	Движения.СчетКт КАК СчетКт,
	|	Движения.КПСКт КАК КПСКт,
	|	Движения.КЭККт КАК КЭККт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Движения.Количество, 0) = 0
	|			ТОГДА Движения.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(АктСписанияМягкогоИХозИнвентаряМатериалы.Количество * Движения.Сумма / Движения.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Сумма
	|ПОМЕСТИТЬ Материалы
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаря.Материалы КАК АктСписанияМягкогоИХозИнвентаряМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Движения КАК Движения
	|		ПО АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка = Движения.Регистратор
	|			И АктСписанияМягкогоИХозИнвентаряМатериалы.Номенклатура = Движения.Номенклатура
	|			И АктСписанияМягкогоИХозИнвентаряМатериалы.СчетУчета = Движения.СчетКт
	|			И АктСписанияМягкогоИХозИнвентаряМатериалы.КПС = Движения.КПСКт
	|			И АктСписанияМягкогоИХозИнвентаряМатериалы.КФО = Движения.КФО
	|			И (ВЫБОР
	|				КОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета ССЫЛКА Справочник.Контрагенты
	|						И АктСписанияМягкогоИХозИнвентаряМатериалы.СчетУчета В (&Счет27)
	|					ТОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета = Движения.ДержательИмущества
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка В(&МассивОбъектов)
	|	И АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка.КФОВТабличнойЧасти
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка КАК Ссылка,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.НомерСтроки КАК НомерСтроки,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Номенклатура КАК Номенклатура,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.КоличествоНорма КАК КоличествоНорма,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Количество КАК Количество,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.ПричинаСписания КАК ПричинаСписания,
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.СрокВЭксплуатации КАК СрокВЭксплуатации,
	|	ВЫБОР
	|		КОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета ССЫЛКА Справочник.Контрагенты
	|				И АктСписанияМягкогоИХозИнвентаряМатериалы.СчетУчета В (&Счет27)
	|			ТОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДополнительнаяАналитикаСчета,
	|	Движения.СчетДт КАК СчетДт,
	|	Движения.КПСДт КАК КПСДт,
	|	Движения.КЭКДт КАК КЭКДт,
	|	Движения.КФО КАК КФО,
	|	Движения.СчетКт КАК СчетКт,
	|	Движения.КПСКт КАК КПСКт,
	|	Движения.КЭККт КАК КЭККт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Движения.Количество, 0) = 0
	|			ТОГДА Движения.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(АктСписанияМягкогоИХозИнвентаряМатериалы.Количество * Движения.Сумма / Движения.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаря.Материалы КАК АктСписанияМягкогоИХозИнвентаряМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Движения КАК Движения
	|		ПО АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка = Движения.Регистратор
	|			И АктСписанияМягкогоИХозИнвентаряМатериалы.Номенклатура = Движения.Номенклатура
	|			И АктСписанияМягкогоИХозИнвентаряМатериалы.СчетУчета = Движения.СчетКт
	|			И АктСписанияМягкогоИХозИнвентаряМатериалы.КПС = Движения.КПСКт
	|			И (ВЫБОР
	|				КОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета ССЫЛКА Справочник.Контрагенты
	|						И АктСписанияМягкогоИХозИнвентаряМатериалы.СчетУчета В (&Счет27)
	|					ТОГДА АктСписанияМягкогоИХозИнвентаряМатериалы.ДополнительнаяАналитикаСчета = Движения.ДержательИмущества
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка В(&МассивОбъектов)
	|	И НЕ АктСписанияМягкогоИХозИнвентаряМатериалы.Ссылка.КФОВТабличнойЧасти
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Движения.Регистратор КАК Регистратор,
	|	Движения.Номенклатура КАК Номенклатура,
	|	Движения.ДержательИмущества КАК ДержательИмущества,
	|	Движения.СчетКт КАК СчетКт,
	|	Движения.КФО КАК КФО,
	|	Движения.КПСКт КАК КПСКт,
	|	СУММА(Движения.Сумма) КАК Сумма
	|ПОМЕСТИТЬ СуммаПоДвижениям
	|ИЗ
	|	Движения КАК Движения
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Регистратор,
	|	Движения.Номенклатура,
	|	Движения.СчетКт,
	|	Движения.КПСКт,
	|	Движения.КФО,
	|	Движения.ДержательИмущества
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка,
	|	Материалы.Номенклатура КАК Номенклатура,
	|	Материалы.ДополнительнаяАналитикаСчета КАК ДополнительнаяАналитикаСчета,
	|	Материалы.СчетКт КАК СчетКт,
	|	Материалы.КПСКт КАК КПСКт,
	|	Материалы.КФО КАК КФО,
	|	СУММА(Материалы.Сумма) КАК Сумма,
	|	МАКСИМУМ(Материалы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ СуммаПоДокументам
	|ИЗ
	|	Материалы КАК Материалы
	|
	|СГРУППИРОВАТЬ ПО
	|	Материалы.Ссылка,
	|	Материалы.Номенклатура,
	|	Материалы.СчетКт,
	|	Материалы.КПСКт,
	|	Материалы.КФО,
	|	Материалы.ДополнительнаяАналитикаСчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	СчетКт,
	|	КПСКт,
	|	КФО,
	|	НомерСтроки,
	|	ДополнительнаяАналитикаСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаМатериалы.Ссылка КАК Ссылка,
	|	ТаблицаМатериалы.НомерСтроки КАК пНомерСтроки,
	|	ВЫБОР
	|		КОГДА ТаблицаМатериалы.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА ТаблицаМатериалы.Номенклатура.Наименование
	|		ИНАЧЕ ТаблицаМатериалы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК пНоменклатура,
	|	ТаблицаМатериалы.КоличествоНорма КАК КоличествоНорма,
	|	ТаблицаМатериалы.Количество КАК пКоличество,
	|	ТаблицаМатериалы.ПричинаСписания КАК пПричинаСписания,
	|	ТаблицаМатериалы.СрокВЭксплуатации КАК пСрокЭксплуатации,
	|	ТаблицаМатериалы.СчетДт КАК СчетДт,
	|	ТаблицаМатериалы.КПСДт КАК КПСДт,
	|	ТаблицаМатериалы.КЭКДт КАК КЭКДт,
	|	ТаблицаМатериалы.КФО КАК КФО,
	|	ТаблицаМатериалы.СчетКт КАК СчетКт,
	|	ТаблицаМатериалы.КПСКт КАК КПСКт,
	|	ТаблицаМатериалы.КЭККт КАК КЭККт,
	|	ЕСТЬNULL(ТаблицаМатериалы.Сумма, 0) + ЕСТЬNULL(СуммаПоДвижениям.Сумма, 0) - ЕСТЬNULL(СуммаПоДокументам.Сумма, 0) КАК пСумма,
	|	ТаблицаМатериалы.Ссылка.Номер КАК пНомер,
	|	ТаблицаМатериалы.Ссылка.Дата КАК пДата,
	|	ТаблицаМатериалы.Ссылка.Организация КАК СсылкаОрганизация,
	|	ТаблицаМатериалы.Ссылка.ПодразделениеОтправитель КАК СсылкаПодразделениеОтправитель,
	|	ТаблицаМатериалы.Ссылка.ЦМООтправитель КАК СсылкаЦМООтправитель,
	|	ТаблицаМатериалы.Ссылка.ДолжностьПредседательКомиссии КАК ДолжностьПредседателяКомиссии,
	|	ТаблицаМатериалы.Ссылка.ФамилияПредседательКомиссии КАК ФамилияПредседателяКомиссии,
	|	ТаблицаМатериалы.Ссылка.ИмяПредседательКомиссии КАК ИмяПредседателяКомиссии,
	|	ТаблицаМатериалы.Ссылка.ОтчествоПредседательКомиссии КАК ОтчествоПредседателяКомиссии,
	|	ТаблицаМатериалы.Ссылка.НомерПриказа КАК пНомерПриказа,
	|	ТаблицаМатериалы.Ссылка.ДатаПриказа КАК пДатаПриказа,
	|	ТаблицаМатериалы.Ссылка.Руководитель КАК Руководитель,
	|	ТаблицаМатериалы.Ссылка.ДатаУтверждения КАК ДатаУтверждения,
	|	ТаблицаМатериалы.Ссылка.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	ВЫБОР
	|		КОГДА ТаблицаМатериалы.Ссылка.Организация.НаименованиеПолное = """"
	|			ТОГДА ТаблицаМатериалы.Ссылка.Организация.Наименование
	|		ИНАЧЕ ТаблицаМатериалы.Ссылка.Организация.НаименованиеПолное
	|	КОНЕЦ КАК пНаименованиеОрганизации,
	|	ТаблицаМатериалы.Ссылка.Организация.КодОКПО КАК пКодОКПО,
	|	ВЫБОР
	|		КОГДА ТаблицаМатериалы.Ссылка.ПодразделениеОтправитель.НаименованиеПолное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ТаблицаМатериалы.Ссылка.ПодразделениеОтправитель)
	|		ИНАЧЕ ТаблицаМатериалы.Ссылка.ПодразделениеОтправитель.НаименованиеПолное
	|	КОНЕЦ КАК пПодразделение,
	|	ТаблицаМатериалы.Ссылка.Организация.ИНН КАК ИНН,
	|	ВЫБОР
	|		КОГДА ТаблицаМатериалы.Ссылка.ПодразделениеОтправитель.ОбособленноеПодразделение
	|			ТОГДА ТаблицаМатериалы.Ссылка.ПодразделениеОтправитель.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ ТаблицаМатериалы.Ссылка.Организация.КПП
	|	КОНЕЦ КАК КПП,
	|	ТаблицаМатериалы.Ссылка.ЦМООтправитель.Сотрудник КАК пМОЛ,
	|	ТаблицаМатериалы.Ссылка.ЦМООтправитель.Код КАК пТабНомМОЛ,
	|	ВЫБОР
	|		КОГДА ТаблицаМатериалы.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ (ЕСТЬNULL(ТаблицаМатериалы.Сумма, 0) + ЕСТЬNULL(СуммаПоДвижениям.Сумма, 0) - ЕСТЬNULL(СуммаПоДокументам.Сумма, 0)) / ТаблицаМатериалы.Количество
	|	КОНЕЦ КАК пЦена
	|ИЗ
	|	Материалы КАК ТаблицаМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуммаПоДокументам КАК СуммаПоДокументам
	|			ЛЕВОЕ СОЕДИНЕНИЕ СуммаПоДвижениям КАК СуммаПоДвижениям
	|			ПО СуммаПоДокументам.Ссылка = СуммаПоДвижениям.Регистратор
	|				И СуммаПоДокументам.Номенклатура = СуммаПоДвижениям.Номенклатура
	|				И СуммаПоДокументам.СчетКт = СуммаПоДвижениям.СчетКт
	|				И СуммаПоДокументам.КПСКт = СуммаПоДвижениям.КПСКт
	|				И СуммаПоДокументам.КФО = СуммаПоДвижениям.КФО
	|				И СуммаПоДокументам.ДополнительнаяАналитикаСчета = СуммаПоДвижениям.ДержательИмущества
	|		ПО ТаблицаМатериалы.Ссылка = СуммаПоДокументам.Ссылка
	|			И ТаблицаМатериалы.НомерСтроки = СуммаПоДокументам.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	пДата,
	|	пНомер,
	|	пНомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктСписанияМягкогоИХозИнвентаряСоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряСоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряСоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряСоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии,
	|	АктСписанияМягкогоИХозИнвентаряСоставКомиссии.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаря.СоставКомиссии КАК АктСписанияМягкогоИХозИнвентаряСоставКомиссии
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаряСоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктСписанияМягкогоИХозИнвентаряСоставКомиссии.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("Счет27", БухгалтерскийУчет.СписокСчетов("27"));
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия = РезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьМакетаЗаголовок.Параметры.Заполнить(Выборка);
		СтруктураОбластьМакетаЗаголовок = Новый Структура;
		СтруктураОбластьМакетаЗаголовок.Вставить("пДиректор",Справочники.Сотрудники.ФамилияИО(Выборка.Руководитель, Истина, Выборка.пДата));
		Если ЗначениеЗаполнено(Выборка.ДатаУтверждения) Тогда
			СтруктураОбластьМакетаЗаголовок.Вставить("пДатаУтверждения", Формат(Выборка.ДатаУтверждения, "ДФ='''""''dd''""'' MMMM yyyy ''г.'''"));
		Иначе
			СтруктураОбластьМакетаЗаголовок.Вставить("пДатаУтверждения", """____"" ________________ 20____г.");
		КонецЕсли;
		
		пДатаПриказа = "";
		Если ЗначениеЗаполнено(Выборка.пДатаПриказа) Тогда
			пДатаПриказа = Формат(Выборка.пДатаПриказа,"ДЛФ=ДД");
		КонецЕсли;
		СтруктураОбластьМакетаЗаголовок.Вставить("пДатаПриказа",пДатаПриказа);
		СтруктураОбластьМакетаЗаголовок.Вставить("пДатаЗаголовка",Формат(Выборка.пДата,"ДЛФ=ДД"));
		
		ВыборкаКомиссия.Сбросить();																				
		СтруктураПоиска = Новый Структура("Ссылка", Выборка.Ссылка);
		Если ВыборкаКомиссия.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаКомиссияТекДок = ВыборкаКомиссия.Выбрать();
		Иначе
			ВыборкаКомиссияТекДок = Неопределено;
		КонецЕсли;
		пЧленыКомиссии = "";
		ОбластьКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(Выборка, ВыборкаКомиссияТекДок, ОбластьМакетаКомиссия, 3, пЧленыКомиссии, Истина);
		СтруктураОбластьМакетаЗаголовок.Вставить("пЧленыКомиссии", пЧленыКомиссии);

		ОбластьМакетаЗаголовок.Параметры.Заполнить(СтруктураОбластьМакетаЗаголовок);
		
		//НастройкаПечатиНомера
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьМакетаЗаголовок,"пНомер",Выборка.пНомер,Выборка.Ссылка,Неопределено, Истина);
		//

		ТабличныйДокумент.Вывести(ОбластьМакетаЗаголовок);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		пКоличествоИтого = 0;
		пСуммаИтого		 = 0;
		ВыборкаСтрок = Выборка.Выбрать();
		Пока ВыборкаСтрок.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(ВыборкаСтрок.пНомерСтроки) Тогда
				Продолжить;
			КонецЕсли;
			ОбластьМакетаСтрока.Параметры.Заполнить(ВыборкаСтрок);
			
			ПредставлениеСчетДт = УправлениеПечатьюБГУ.ПредставлениеРабочегоСчета(
				ВыборкаСтрок.КПСДт, ВыборкаСтрок.КФО, ВыборкаСтрок.СчетДт, ВыборкаСтрок.КЭКДт);
			ПредставлениеСчетКт = УправлениеПечатьюБГУ.ПредставлениеРабочегоСчета(
				ВыборкаСтрок.КПСКт, ВыборкаСтрок.КФО, ВыборкаСтрок.СчетКт, ВыборкаСтрок.КЭККт);
			
			СтруктураОбластьМакетаСтрока = Новый Структура("пСчетДебета,пСчетКредита",ПредставлениеСчетДт,ПредставлениеСчетКт);
			ОбластьМакетаСтрока.Параметры.Заполнить(СтруктураОбластьМакетаСтрока);
			
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			
			пКоличествоИтого = пКоличествоИтого + ВыборкаСтрок.пКоличество;
			пСуммаИтого		 = пСуммаИтого		+ ВыборкаСтрок.пСумма;
		КонецЦикла;
		СтруктураОбластьМакетаИтого = Новый Структура("пКоличествоИтого,пСуммаИтого",пКоличествоИтого,пСуммаИтого);
		ОбластьМакетаИтого.Параметры.Заполнить(СтруктураОбластьМакетаИтого);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаИтого);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		СтруктураОбластьМакетаСтр2Начало = Новый Структура;
		Если пКоличествоИтого = Цел(пКоличествоИтого) Тогда
			СтруктураОбластьМакетаСтр2Начало.Вставить("пКоличествоИтогоПрописью",ЧислоПрописью(пКоличествоИтого,,"штука,штуки,штук,ж,,,,,0"));
		Иначе
			СтруктураОбластьМакетаСтр2Начало.Вставить("пКоличествоИтогоПрописью","");
		КонецЕсли;
		Если пСуммаИтого <> 0 Тогда
			СтруктураОбластьМакетаСтр2Начало.Вставить("пСуммаИтогоПрописью",ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(пСуммаИтого, 
																		Константы.ВалютаРегламентированногоУчета.Получить()));
		Иначе																		
			СтруктураОбластьМакетаСтр2Начало.Вставить("пСуммаИтогоПрописью", "");
		КонецЕсли;
		СтруктураОбластьМакетаСтр2Начало.Вставить("ЗаключениеКомиссии", Выборка.ЗаключениеКомиссии);
		ОбластьМакетаСтр2Начало.Параметры.Заполнить(СтруктураОбластьМакетаСтр2Начало);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Начало);
		
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Шапка);
		
		ПодвалСтраницы2 = Новый Массив;
		ПодвалСтраницы2.Добавить(ОбластьМакетаСтр2Строка);
		ПодвалСтраницы2.Добавить(ОбластьМакетаСтр2Строка);
		ПодвалСтраницы2.Добавить(ОбластьМакетаСтр2Подвал);
		ПодвалСтраницы2.Добавить(ОбластьКомиссия);
		ПодвалСтраницы2.Добавить(ОбластьМакетаПодвал);
		
		Пока ТабличныйДокумент.ПроверитьВывод(ПодвалСтраницы2) Цикл
			ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Строка);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Строка);
		ТабличныйДокумент.Вывести(ОбластьМакетаСтр2Подвал);
		
		// комиссия
		ТабличныйДокумент.Вывести(ОбластьКомиссия);
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		//ТабличныйДокумент.Вывести(ОбластьМакетаСтр2);
		//
		//ТабличныйДокумент.Вывести(ОбластьКомиссия);
		//ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ДанныеДляПечати0510434(МассивОбъектов)
	
	ПодразделенияСписанияМЗ = УправлениеПечатьюБГУ.ПодразделенияСотрудниковМЗ0510434(МассивОбъектов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПодразделенияСписанияМЗ", ПодразделенияСписанияМЗ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодразделенияСписанияМЗ.Документ КАК Документ,
	|	ПодразделенияСписанияМЗ.Подразделение КАК Подразделение,
	|	ПодразделенияСписанияМЗ.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ПодразделенияСписанияМЗ
	|ИЗ
	|	&ПодразделенияСписанияМЗ КАК ПодразделенияСписанияМЗ
	|;
	|ВЫБРАТЬ
	|	МатериальныеЗапасы.Ссылка КАК Ссылка,
	|	МатериальныеЗапасы.НомерСтроки КАК НомерСтроки,
	|	МатериальныеЗапасы.Номенклатура КАК Номенклатура,
	|	МатериальныеЗапасы.Количество КАК Количество,
	|	МатериальныеЗапасы.ВидимыеДефекты КАК Дефекты,
	|	МатериальныеЗапасы.ОсобыеОтметки КАК ОсобыеОтметки,
	|	АктСписанияМягкогоИХозИнвентаря.ПолучательИмущества КАК СотрудникОбеспечения
	|ПОМЕСТИТЬ ВТ_Материалы
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаря.Материалы КАК МатериальныеЗапасы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктСписанияМягкогоИХозИнвентаря КАК АктСписанияМягкогоИХозИнвентаря
	|	ПО МатериальныеЗапасы.Ссылка = АктСписанияМягкогоИХозИнвентаря.Ссылка
	|ГДЕ
	|	МатериальныеЗапасы.Ссылка В (&МассивОбъектов)
	|	И АктСписанияМягкогоИХозИнвентаря.Ссылка В (&МассивОбъектов)
	|;
	|ВЫБРАТЬ
	|	ОбеспечениеСотрудниковИмуществом.Владелец КАК Сотрудник,
	|	ТЧОбеспечениеИмуществом.Имущество,
	|	ТЧОбеспечениеИмуществом.Приспособления КАК Приспособления,
	|	ТЧОбеспечениеИмуществом.РазмерОдежды КАК РазмерОдежды,
	|	ТЧОбеспечениеИмуществом.РазмерГоловногоУбора КАК РазмерГоловногоУбора,
	|	ТЧОбеспечениеИмуществом.РазмерОбуви КАК РазмерОбуви,
	|	ТЧОбеспечениеИмуществом.РазмерИное КАК РазмерИное,
	|	ТЧОбеспечениеИмуществом.НормаВыдачи КАК НормаВыдачи,
	|	ТЧОбеспечениеИмуществом.СрокИспользованияПоНормативу КАК СрокИспользованияПоНормативу,
	|	ТЧОбеспечениеИмуществом.ЕдиницаИзмеренияСрока КАК ЕдиницаИзмеренияСрока,
	|	ТЧОбеспечениеИмуществом.КодУсловияВозвратаИмущества КАК КодУсловияВозвратаИмущества
	|ПОМЕСТИТЬ Вт_ОбеспечениеИмуществом
	|ИЗ
	|	Справочник.ОбеспечениеСотрудниковИмуществом КАК ОбеспечениеСотрудниковИмуществом
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбеспечениеСотрудниковИмуществом.ОбеспечениеИмуществом КАК ТЧОбеспечениеИмуществом
	|	ПО ОбеспечениеСотрудниковИмуществом.Ссылка = ТЧОбеспечениеИмуществом.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктСписанияМягкогоИХозИнвентаря КАК АктСписанияМягкогоИХозИнвентаря
	|	ПО ОбеспечениеСотрудниковИмуществом.Владелец = АктСписанияМягкогоИХозИнвентаря.ПолучательИмущества
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаря.Ссылка В (&МассивОбъектов)
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктСписанияМягкогоИХозИнвентаря.Ссылка КАК Ссылка,
	|	АктСписанияМягкогоИХозИнвентаря.Номер КАК Номер,
	|	АктСписанияМягкогоИХозИнвентаря.Дата КАК ДатаАкта,
	|	АктСписанияМягкогоИХозИнвентаря.Организация КАК Организация,
	|	1 КАК Операция,
	|	АктСписанияМягкогоИХозИнвентаря.ЦМООтправитель.Сотрудник КАК СотрудникОтправитель,
	|	ЕСТЬNULL(АктСписанияМягкогоИХозИнвентаря.ЦМООтправитель.Сотрудник.Код, """") КАК ТабельныйНомерОтправитель,
	|	АктСписанияМягкогоИХозИнвентаря.ЦМООтправитель.МестоХранения КАК МестонахождениеОтправитель,
	|	АктСписанияМягкогоИХозИнвентаря.ПолучательИмущества КАК СотрудникПолучатель,
	|	ЕСТЬNULL(АктСписанияМягкогоИХозИнвентаря.ПолучательИмущества.Код, """") КАК ТабельныйНомерПолучатель,
	|	АктСписанияМягкогоИХозИнвентаря.ПодразделениеОтправитель КАК СтруктурноеПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА АктСписанияМягкогоИХозИнвентаря.ПодразделениеОтправитель.НаименованиеПолное = """"
	|			ТОГДА АктСписанияМягкогоИХозИнвентаря.ПодразделениеОтправитель.Наименование
	|		ИНАЧЕ АктСписанияМягкогоИХозИнвентаря.ПодразделениеОтправитель.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделенияОтправитель,
	|	ПодразделенияСписанияМЗ.Подразделение КАК СтруктурноеПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА ПодразделенияСписанияМЗ.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПодразделенияСписанияМЗ.Подразделение.Наименование
	|		ИНАЧЕ ПодразделенияСписанияМЗ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделенияПолучатель,
	|	АктСписанияМягкогоИХозИнвентаря.ПолучательИмущества КАК СотрудникОбеспечения,
	|	АктСписанияМягкогоИХозИнвентаря.ВидОснованияСписания КАК НаименованиеПриказа,
	|	АктСписанияМягкогоИХозИнвентаря.НомерОснованияСписания КАК НомерПриказа,
	|	АктСписанияМягкогоИХозИнвентаря.ДатаОснованияСписания КАК ДатаПриказа
	|ИЗ
	|	Документ.АктСписанияМягкогоИХозИнвентаря КАК АктСписанияМягкогоИХозИнвентаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияСписанияМЗ КАК ПодразделенияСписанияМЗ
	|		ПО АктСписанияМягкогоИХозИнвентаря.Ссылка = ПодразделенияСписанияМЗ.Документ
	|ГДЕ
	|	АктСписанияМягкогоИХозИнвентаря.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериальныеЗапасы.Ссылка КАК Ссылка,
	|	МатериальныеЗапасы.НомерСтроки КАК НомерСтроки,
	|	МатериальныеЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА МатериальныеЗапасы.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА МатериальныеЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ МатериальныеЗапасы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеМЗ,
	|	ВЫБОР
	|		КОГДА МатериальныеЗапасы.Номенклатура.НоменклатурныйНомер = """"
	|			ТОГДА МатериальныеЗапасы.Номенклатура.Код
	|		ИНАЧЕ МатериальныеЗапасы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	МатериальныеЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК НаименованиеЕИ,
	|	МатериальныеЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕИ,
	|	МатериальныеЗапасы.Количество КАК Количество,
	|	МатериальныеЗапасы.Дефекты КАК Дефекты,
	|	МатериальныеЗапасы.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.Приспособления, """") КАК Приспособления,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерОдежды, 0) КАК РазмерОдежды,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерГоловногоУбора, 0) КАК РазмерГоловногоУбора,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерОбуви, 0) КАК РазмерОбуви,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерИное, 0) КАК РазмерИное,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.НормаВыдачи, 0) КАК НормаВыдачи,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.СрокИспользованияПоНормативу, 0) КАК СрокПолезногоИспользования,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.ЕдиницаИзмеренияСрока, 0) КАК ЕдиницаИзмеренияСрока,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.КодУсловияВозвратаИмущества, """") КАК КодВозврата
	|ИЗ
	|	ВТ_Материалы КАК МатериальныеЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОбеспечениеИмуществом КАК ОбеспечениеИмуществом
	|		ПО (МатериальныеЗапасы.СотрудникОбеспечения = ОбеспечениеИмуществом.Сотрудник)
	|		И МатериальныеЗапасы.Номенклатура = ОбеспечениеИмуществом.Имущество
	|ГДЕ
	|	МатериальныеЗапасы.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("ВыборкаДокументов"	, РезультатЗапроса[3]);
	ДанныеДляПечати.Вставить("ВыборкаМЗДок"			, РезультатЗапроса[4]);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция Напечатать0510434(МассивОбъектов, ОбъектыПечати)
	
	ДанныеДляПечати		= ДанныеДляПечати0510434(МассивОбъектов);
	ВыборкаДокументов	= ДанныеДляПечати.ВыборкаДокументов.Выбрать();
	ВыборкаМЗДок		= ДанныеДляПечати.ВыборкаМЗДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	ДвиженияДокументов = УправлениеМатериальнымиЗапасами.ДвиженияДокументов(МассивОбъектов);
	ДвиженияДокументов.Индексы.Добавить("Ссылка, НомерСтроки");
	
	ДанныеДокументов = УправлениеПечатьюБГУ.ТаблицаШапкиДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434();
	Пока ВыборкаДокументов.Следующий() Цикл
		
		// Шапка
		СтрокаДокумента = ДанныеДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);
		СтрокаДокумента.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		
		СотрудникиДокумента = Новый Массив;
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникОтправитель);
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникПолучатель);
		ДанныеСотрудников = Справочники.Сотрудники.ДанныеСотрудников(СотрудникиДокумента,
			"Фамилия,Имя,Отчество,Должность,ДолжностьНаименование,НаименованиеПолное",
			ВыборкаДокументов.ДатаАкта);
		ДанныеСотрудникаОтправителя = ДанныеСотрудников.Получить(ВыборкаДокументов.СотрудникОтправитель);	
		СтрокаДокумента.ФИООтправитель = ДанныеСотрудникаОтправителя.НаименованиеПолное;
		
		ДанныеСотрудникаПолучателя = ДанныеСотрудников.Получить(ВыборкаДокументов.СотрудникПолучатель);	
		СтрокаДокумента.ФИОПолучатель = ДанныеСотрудникаПолучателя.НаименованиеПолное;
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СтрокаДокумента.МатериальныеЗапасы = УправлениеПечатьюБГУ.ТаблицаСведенияОбОбъектахМЗДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434();
		
		// Материальные запасы
		
		ВыборкаМЗДок.Сбросить();
		Если ВыборкаМЗДок.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаМЗ = ВыборкаМЗДок.Выбрать();
			Пока ВыборкаМЗ.НайтиСледующий(СтруктураПоиска) Цикл
				СтрокаМЗ = СтрокаДокумента.МатериальныеЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаМЗ, ВыборкаМЗ);
				ОтборСтрокиДокумента = Новый Структура("Ссылка, НомерСтроки", ВыборкаДокументов.Ссылка, ВыборкаМЗ.НомерСтроки);
				СтрокиДвижений = ДвиженияДокументов.НайтиСтроки(ОтборСтрокиДокумента);
				Если СтрокиДвижений.Количество() > 0 Тогда
					СтрокаСебестоимости = СтрокиДвижений[0];
					СтрокаМЗ.Сумма = СтрокаСебестоимости.Сумма;
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДокумента.ОбъектыСдалНаименованиеДолжности = ДанныеСотрудникаОтправителя.ДолжностьНаименование;
		СтрокаДокумента.ОбъектыСдалДолжность = ДанныеСотрудникаОтправителя.Должность;
		СтрокаДокумента.ОбъектыСдалДолжность = ДанныеСотрудникаОтправителя.Должность;
		СтрокаДокумента.ОбъектыСдалСотрудник = ВыборкаДокументов.СотрудникОтправитель;
		СтрокаДокумента.ОбъектыСдалФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудникаОтправителя, Истина);
		
		СтрокаДокумента.ОбъектыПринялНаименованиеДолжности = ДанныеСотрудникаПолучателя.ДолжностьНаименование;
		СтрокаДокумента.ОбъектыПринялДолжность = ДанныеСотрудникаПолучателя.Должность;
		СтрокаДокумента.ОбъектыПринялДолжность = ДанныеСотрудникаПолучателя.Должность;
		СтрокаДокумента.ОбъектыПринялСотрудник = ВыборкаДокументов.СотрудникПолучатель;
		СтрокаДокумента.ОбъектыПринялФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудникаПолучателя, Истина);
		
	КонецЦикла;
	
	Возврат УправлениеПечатьюБГУ.Напечатать0510434(МассивОбъектов, ОбъектыПечати, ДанныеДокументов);
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Многопоточный обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПервичныеДокументыБГУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры,
		Тип("ДокументСсылка.АктСписанияМягкогоИХозИнвентаря"));	
	
КонецПроцедуры

// Парный обработчик к процедуре ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
// 
// Параметры:
//  Параметры - Структура:
//   * ОбработкаЗавершена - Булево
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПервичныеДокументыБГУ.ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры, 
		Тип("ДокументСсылка.АктСписанияМягкогоИХозИнвентаря"));
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНа_2_106(Параметры) Экспорт

	ПрослеживаемостьБГУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНа_2_106(Параметры, "Документ.АктСписанияМягкогоИХозИнвентаря.СведенияПрослеживаемости");

КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаВерсию_2_106(Параметры) Экспорт

	ПрослеживаемостьБГУ.ОбработатьДанныеДляПереходаНаВерсию_2_106(Параметры, "Документ.АктСписанияМягкогоИХозИнвентаря", "Материалы");

КонецПроцедуры

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗарегистрироватьДанныеКОбработкеДляПереходаНа_2_106");
	Методы.Вставить("ОбработатьДанныеДляПереходаНаВерсию_2_106");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
