////////////////////////////////////////////////////////////////////////////////
// Работа с комиссиями.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСтатусЧленаКомиссии(ФормаДокумента, ИмяТаблицыСоставКомиссии = "СоставКомиссии") Экспорт
	
	ЭлементТаблицыФормыСоставаКомиссии = ФормаДокумента.Элементы[ИмяТаблицыСоставКомиссии];
	
	ТекущиеДанные = ЭлементТаблицыФормыСоставаКомиссии.ТекущиеДанные;
	
	СтатусЧленаКомиссии = ФормаДокумента.КэшНастроекКомиссии.СтатусыЧленовКомиссии.Получить(ТекущиеДанные.Сотрудник);
	
	ТекущиеДанные.СтатусЧленаКомиссии = СтатусЧленаКомиссии;
	
	ОчищающаяСтруктура = Новый Структура("
		|ПричинаОтсутствия,
		|Отсутствует,
		|ЗамещающийСотрудник,
		|ДолжностьЗамещающегоСотрудника,
		|СтатусЗамещающегоСотрудника");
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ОчищающаяСтруктура);
	
КонецПроцедуры

#Область ЗамещениеЧленаКомиссии

Процедура ЗаполнитьСписокВыбораЗамещающийСотрудник(ФормаДокумента, ЭлементТаблицыФормыСоставаКомиссии) Экспорт
	
	ИмяТаблицыСоставКомиссии = ЭлементТаблицыФормыСоставаКомиссии.Имя;
	
	СтрокаСоставаКомиссии = ЭлементТаблицыФормыСоставаКомиссии.ТекущиеДанные;
	
	КэшНастроекКомиссии = ФормаДокумента.КэшНастроекКомиссии;
	
	ЭлементЗамещающийСотрудник = ФормаДокумента.Элементы[ИмяТаблицыСоставКомиссии + "ЗамещающийСотрудник"];
	
	ЭлементЗамещающийСотрудник.СписокВыбора.Очистить();
	
	Если СтрокаСоставаКомиссии.КоличествоЗамещающихСотрудников = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Индекс Из СтрокаСоставаКомиссии.ИндексыЗамещающихСотрудников Цикл
		СвойстваЗамещающегоСотрудника = КэшНастроекКомиссии.ЗамещающиеЧленыКомиссии[Индекс];
		
		ЭлементЗамещающийСотрудник.СписокВыбора.Добавить(СвойстваЗамещающегоСотрудника.Сотрудник, СвойстваЗамещающегоСотрудника.ПредставлениеДляСпискаВыбора);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСведенияЗамещающегоСотрудникаВСтрокеТаблицы(ФормаДокумента, ЭлементЗамещающегоСотрудника) Экспорт
	
	СтрокаСоставаКомиссии = ЭлементЗамещающегоСотрудника.Родитель.ТекущиеДанные;
	
	НастройкиМеханизма = ФормаДокумента.НастройкиМеханизмаЗамещенияЧленаКомиссии;
	
	КэшНастроекКомиссии = ФормаДокумента.КэшНастроекКомиссии;
	
	Если СтрокаСоставаКомиссии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗамещающийСотрудник = СтрокаСоставаКомиссии.ЗамещающийСотрудник;
	
	СтатусЗамещающегоСотрудника = Неопределено;
	
	Если ЗначениеЗаполнено(ЗамещающийСотрудник) Тогда
		СтатусЗамещающегоСотрудника = КэшНастроекКомиссии.СтатусыЧленовКомиссии.Получить(ЗамещающийСотрудник);
	КонецЕсли;
	
	СтрокаСоставаКомиссии.СтатусЗамещающегоСотрудника = СтатусЗамещающегоСотрудника;
	
	Если НастройкиМеханизма.ЗаполнитьДолжности Тогда
		ДолжностьЗамещающегоСотрудника = Неопределено;
		
		СписокДолжностей = КэшНастроекКомиссии.ДолжностиЧленовКомиссии.Получить(ЗамещающийСотрудник);
		
		Если СписокДолжностей <> Неопределено Тогда
			ДолжностьЗамещающегоСотрудника = СписокДолжностей[0];
		КонецЕсли;
		
		СтрокаСоставаКомиссии.ДолжностьЗамещающегоСотрудника = ДолжностьЗамещающегоСотрудника;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
