
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ЗагрузкаОКОФ" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
		
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("ОКОФ");
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипыКлассификаторов",СписокЗначений);
	ОткрытьФорму("Обработка.ЗагрузкаКлассификаторовИзФайла.Форма.Форма",ПараметрыФормы);

КонецПроцедуры

#КонецОбласти