
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МесяцНачалаПериода = КонецМесяца(Параметры.ДатаНачалаПериода);
	КоличествоПериодов = 6;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "МесяцНачалаПериода", "МесяцНачалаПериодаСтрокой", Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцНачалаПериодаСтрокойПриИзменении(Элемент)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "МесяцНачалаПериода", "МесяцНачисленияСтрокой", Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалаПериодаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "МесяцНачалаПериода", "МесяцНачалаПериодаСтрокой", Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалаПериодаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "МесяцНачалаПериода", "МесяцНачалаПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалаПериодаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "МесяцНачалаПериода", "МесяцНачалаПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачалаПериодаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "МесяцНачалаПериода", "МесяцНачалаПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ФормаОК(Команда)
	Результат = Новый Структура;
	Результат.Вставить("МесяцНачалаПериода", МесяцНачалаПериода);
	Результат.Вставить("КоличествоПериодов", КоличествоПериодов);
	
	Закрыть(Результат);
КонецПроцедуры

#КонецОбласти