#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.НачислениеКомпенсацииОбразование";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьНачисленияКомпенсацииОбразование";
	КомандаПечати.Представление = Нстр("ru='Ведомость начисленной компенсации'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьНачисленияКомпенсацииОбразование") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьНачисленияКомпенсацииОбразование",
			НСтр("ru='Ведомость начисления компенсации учащимся'"),
			ПечатьВедомостиНачисленияКомпенсации(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

	
КонецПроцедуры


// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует табличный документ с печатной формой ведомости по начислению компенсации родительской платы
// за содержание детей в детских учреждениях (форма 327)
//
// Возвращаемое значение:
//  Табличный документ - печатная форма ведомости по расчетам с родителями
//
Функция ПечатьВедомостиНачисленияКомпенсации(МассивОбъектов, ОбъектыПечати) 
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеКомпенсацииОбразование.ПФ_MXL_ВедомостьНачисленияКомпенсацииОбразование");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаПоОрганизации");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаПоОрганизации");
	ОбластьИтого  = Макет.ПолучитьОбласть("ИтогоПоОрганизации");
	ОбластьПодвал = Макет.ПолучитьОбласть("ПодвалПоОрганизации");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_НачислениеКомпенсацииОбразование";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеКомпенсацииОбразование.Ссылка КАК Ссылка,
	|	НачислениеКомпенсацииОбразование.Номер КАК Номер,
	|	НачислениеКомпенсацииОбразование.Дата КАК Дата,
	|	НачислениеКомпенсацииОбразование.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НачислениеКомпенсацииОбразование.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, ЛОЖЬ)
	|			ТОГДА НачислениеКомпенсацииОбразование.Организация.НаименованиеСокращенное
	|		ИНАЧЕ ЕСТЬNULL(НачислениеКомпенсацииОбразование.Организация.НаименованиеПолное, """")
	|	КОНЕЦ КАК ОрганизацияНаименование,
	|	НачислениеКомпенсацииОбразование.ПериодНачисления КАК ПериодНачисления,
	|	ЕСТЬNULL(НачислениеКомпенсацииОбразование.Факультет, НЕОПРЕДЕЛЕНО) КАК Факультет,
	|	ЕСТЬNULL(НачислениеКомпенсацииОбразование.Организация.КодОКПО, """") КАК КодОКПО,
	|	НачислениеКомпенсацииОбразование.СуммаДокумента КАК СуммаДокумента,
	|	ЕСТЬNULL(НачислениеКомпенсацииОбразование.Основание.Наименование, """") КАК Основание
	|ИЗ
	|	Документ.НачислениеКомпенсацииОбразование КАК НачислениеКомпенсацииОбразование
	|ГДЕ
	|	НачислениеКомпенсацииОбразование.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка КАК Ссылка,
	|	НачислениеКомпенсацииОбразованиеКомпенсация.НомерСтроки КАК Нпп,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(НачислениеКомпенсацииОбразованиеКомпенсация.Студент.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование, """") КАК Студент,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(НачислениеКомпенсацииОбразованиеКомпенсация.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица).Наименование, """") КАК Контрагент,
	|	НачислениеКомпенсацииОбразованиеКомпенсация.Сумма КАК Сумма,
	|	ЕСТЬNULL(НачислениеКомпенсацииОбразованиеКомпенсация.ДоговорКонтрагента.Наименование, """") КАК ДоговорКонтрагента
	|ИЗ
	|	Документ.НачислениеКомпенсацииОбразование.Компенсация КАК НачислениеКомпенсацииОбразованиеКомпенсация
	|ГДЕ
	|	НачислениеКомпенсацииОбразованиеКомпенсация.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Нпп
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокумент = РезультатЗапроса[0].Выбрать();
	ВыборкаСостав = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаДокумент);
		
		ПараметрыШапки = Новый Структура("ДокНомер, Период",
			РегистрыСведений.НастройкиПечатиПрефиксаНомера.ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(ВыборкаДокумент.Ссылка, ВыборкаДокумент.Номер),
			РаботаСоСтудентамиКлиентСервер.ПолучитьПредставлениеМесяца(ВыборкаДокумент.ПериодНачисления));
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		
		ТабДокумент.Вывести(ОбластьШапка);
		
		ВыборкаСостав.Сбросить();
		ВыборкаСостав.НайтиСледующий(Новый Структура("Ссылка", ВыборкаДокумент.Ссылка));
		
		СтрокиСостава = ВыборкаСостав.Выбрать();
		Пока СтрокиСостава.Следующий() Цикл
			
			ОбластьСтрока.Параметры.Заполнить(СтрокиСостава);
			ТабДокумент.Вывести(ОбластьСтрока);
			
		КонецЦикла;
		
		ОбластьИтого.Параметры.Заполнить(ВыборкаДокумент);
		ТабДокумент.Вывести(ОбластьИтого);
		
		ГлБухгалтер	 = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер,
			ВыборкаДокумент.Организация,
			ВыборкаДокумент.Дата,
			ВыборкаДокумент.Факультет);
		
		ПараметрыПодвала = Новый Структура("Дата, ГлБухгалтер",
			ВыборкаДокумент.Дата,
			КорреспондентыКлиентСервер.ФИО(ГлБухгалтер.ОтветственноеЛицоФИО, Истина));
		
		ОбластьПодвал.Параметры.Заполнить(ПараметрыПодвала);
		ТабДокумент.Вывести(ОбластьПодвал);
	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ВыборкаДокумент.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
