
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Список.РежимВыбора = Ложь;
	Параметры.Свойство("РежимВыбора", 	Элементы.Список.РежимВыбора);
	
	АвтоЗаголовок = Истина;

	УстановитьОрганизацию();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ИФО", ОтборИФО, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборИФО));

	Если Элементы.Список.РежимВыбора Тогда
		РежимОткрытияОкна 	= РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		АвтоЗаголовок 		= Ложь;
		Заголовок = "Выберите характеристики плана ФХД: План поступлений (выбытий), КФО, Субсидию";
	КонецЕсли;
	
	Элементы.Организация.Видимость = Не ЗначениеЗаполнено(ОтборОрганизация);
	
	Если ТипЗнч(Параметры.КлючЗаписи) = Тип("Структура") Тогда
		
		Параметры.ТекущаяСтрока = РегистрыСведений.ПланыПоПоступлениямВыбытиямОрганизаций.СоздатьКлючЗаписи(Параметры.КлючЗаписи);
		
	КонецЕсли;
	
	БюджетнаяКлассификация.УстановитьУсловноеОформлениеПоляВидКПСБУАУВСписке(Список);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборУчреждениеПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));
	Элементы.Организация.Видимость = Не ЗначениеЗаполнено(ОтборОрганизация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.Список.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;		
		ОсуществитьВыбор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Если Элементы.Список.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;		
		ОсуществитьВыбор();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает Учреждение в форме по данным переданного отбора.
//
&НаСервере
Процедура УстановитьОрганизацию()
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Организация") Тогда
		
		ОтборОрганизация = Параметры.Отбор.Организация;
		Элементы.ОтборОрганизация.ТолькоПросмотр = Истина;
		Элементы.ОтборОрганизация.КнопкаОткрытия = Ложь;

	КонецЕсли;
	
КонецПроцедуры // УстановитьОрганизацию()

&НаКлиенте
Процедура ОсуществитьВыбор()
	
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура("Организация, КФО, ВидПоказателя, Субсидия, ПланПоступленийВыбытий, ИФО, УточнениеПоказателя");
	
	ЗаполнитьЗначенияСвойств(Результат, ТекДанные);
	
	Результат.Организация = ОтборОрганизация;

    ОповеститьОВыборе(Результат);
	
	Оповестить("ВыборПланаПоступленийВыбытий", Результат, ЭтотОбъект); 

КонецПроцедуры

#КонецОбласти
