
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();

	Если ЭлектронныеДокументыБГУ.ИспользуетсяПОД() Тогда 
		ДобавочныйТекст = ДопЧастьЗапросаДляЭДПОД();			
	Иначе	 
		ДобавочныйТекст = ДопЧастьЗапросаДляЭД();		
	КонецЕсли;

	СвойстваСписка.ТекстЗапроса    				= Список.ТекстЗапроса + ДобавочныйТекст;
	СвойстваСписка.ОсновнаяТаблица 				= Список.ОсновнаяТаблица;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина; 
	
    ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка); 
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.Отбор);
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		
		Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
		Если Параметры.Отбор.Свойство("Организация") Тогда
			Параметры.Отбор.Удалить("Организация");
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", Организация,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Организация)); 
		
	Элементы.ВидРегистра.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ВидыРегистровУчета"); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидРегистра", ВидРегистра,
		ВидСравненияКомпоновкиДанных.ВСписке, , ЗначениеЗаполнено(ВидРегистра));
		
	Период.ДатаНачала = НачалоДня(ТекущаяДата());
	Период.ДатаОкончания = КонецДня(ТекущаяДата());
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", Период);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокОрганизация", "Видимость", НЕ ЗначениеЗаполнено(Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокВидРегистра", "Видимость", НЕ ЗначениеЗаполнено(ВидРегистра));
			
КонецПроцедуры 
	
#КонецОбласти  

#Область ОбработчикиСобытийШапкиЭлементовФормы

&НаКлиенте
Процедура ВидРегистраПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидРегистра", ВидРегистра,
		ВидСравненияКомпоновкиДанных.ВСписке, , ЗначениеЗаполнено(ВидРегистра));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокВидРегистра", "Видимость", НЕ ЗначениеЗаполнено(ВидРегистра));
		
	ОчиститьУстановленныеФлажки();

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", Организация,
		ВидСравненияКомпоновкиДанных.Равно, , ЗначениеЗаполнено(Организация));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СписокОрганизация", "Видимость", НЕ ЗначениеЗаполнено(Организация));
	
	ОчиститьУстановленныеФлажки();

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("Период", Период);
	ОчиститьУстановленныеФлажки();
	Элементы.Список.Обновить();
    
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикСобытийТабличнойЧасти 

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.Флаг Тогда
				
		Для Каждого ДокументСсылка Из Элементы.Список.ВыделенныеСтроки Цикл
			ИзменитьПометкуДокумента(ДокументСсылка, НЕ ТекущиеДанные.Флаг);
		КонецЦикла;
		
		ОбновитьОтображениеВыбранныхДокументов(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранныеДокументы.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Необходимо выбрать хотя бы 1 документ!'"));
		Возврат;
	КонецЕсли; 	 
	Значение = ВыбранныеДокументы;
	
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент) 
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяЯчейки = Элемент.ТекущийЭлемент.Имя;                           
	Если ИмяЯчейки <> "Флаг"  Тогда  
		ЗаполнитьТабличныйДокумент(Элемент.ТекущаяСтрока);	
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьФлажкиВыделенным(Команда)
	
	Для Каждого ДокументСсылка Из Элементы.Список.ВыделенныеСтроки Цикл
		ИзменитьПометкуДокумента(ДокументСсылка, Истина);
	КонецЦикла;
	
	ОбновитьОтображениеВыбранныхДокументов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	
	ЭлектронныеДокументы = ЭлектронныеДокументыСписка();
	ВыбранныеДокументы.ЗагрузитьЗначения(ЭлектронныеДокументы);
	ОбновитьОтображениеВыбранныхДокументов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	
	ОчиститьУстановленныеФлажки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОчиститьУстановленныеФлажки()
	
	ВыбранныеДокументы.Очистить();
	ОбновитьОтображениеВыбранныхДокументов(ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПометкуДокумента(Документ, НоваяПометка)
	
	НайденныйИндекс = ВыбранныеДокументы.НайтиПоЗначению(Документ);
	Если НайденныйИндекс = Неопределено И НоваяПометка = Истина Тогда
		ВыбранныеДокументы.Добавить(Документ);
	ИначеЕсли НайденныйИндекс <> Неопределено И НоваяПометка = Ложь Тогда
		ВыбранныеДокументы.Удалить(НайденныйИндекс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеВыбранныхДокументов(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Форма.Список, "ВыбранныеДокументы", Форма.ВыбранныеДокументы);

	ШаблонЗаголовка = НСтр("ru = 'Выбрано: %1'");
	Форма.Элементы.ДекорацияВыбранныеДокументы.Заголовок = СтрШаблон(ШаблонЗаголовка, ВыбранныеДокументы.Количество());
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТабличныйДокумент(ТекущийДокументОснования)
	
	Если ЭлектронныеДокументыБГУ.ИспользуетсяПОД() Тогда 
		ПредставлениеВнутреннегоЭлектронногоДокумента = Документы.РегистрУчета.ПолучитьПечатнуюФормуТекущегоДокумента(ТекущийДокументОснования);	
	Иначе 
		ВнутреннийЭлектронныйДокумент = СсылкаВнутреннийЭлектронныйДокумент(ТекущийДокументОснования); 
		
		ДвоичныеДанные = ДвоичныеДанныеЭлектронногоДокумента(ВнутреннийЭлектронныйДокумент);
		
		Если ДвоичныеДанные = Неопределено Тогда
			
			ПредставлениеВнутреннегоЭлектронногоДокумента.Очистить();
			
			ТекстСообщения = НСтр("ru = 'Не удалось получить данные документа, так как он помечен на удаление.
			|Для продолжения работы с документом необходимо снять пометку удаления.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Возврат;
			
		КонецЕсли;
		
		ЗаполнитьСписокПодписей(ВнутреннийЭлектронныйДокумент);

		ПредставлениеВнутреннегоЭлектронногоДокумента = ВнутреннийЭДО.ТабличныйДокументИзДвоичныхДанныхАрхива(ДвоичныеДанные);
		ВнутреннийЭДО.ДобавитьШтампыЭлектронныхПодписей(ПредставлениеВнутреннегоЭлектронногоДокумента, ЭлектронныеПодписи, Организация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДвоичныеДанныеЭлектронногоДокумента(ВнутреннийЭлектронныйДокумент)
	
	Если ВнутреннийЭлектронныйДокумент.Пустая() Тогда
		Возврат Неопределено;
	Иначе
		ОбъектДокументОснования = ВнутреннийЭлектронныйДокумент.ПолучитьОбъект();
		Возврат РаботаСФайлами.ДвоичныеДанныеФайла(ОбъектДокументОснования.ОсновнойФайл, Ложь);
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПодписей(ВнутреннийЭлектронныйДокумент)
		
	ЭлектронныеПодписи.Очистить(); 
	
	ОбъектДокументОснования = ВнутреннийЭлектронныйДокумент.ПолучитьОбъект();
	
	МассивЭП = СписокЭлектронныхПодписей(ОбъектДокументОснования.ОсновнойФайл, УникальныйИдентификатор);
	
	НомерСтроки = 0;
	
	Для Каждого ЭП Из МассивЭП Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = ЭлектронныеПодписи.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭП);
		НоваяСтрока.НомерСтроки = НомерСтроки;
		НоваяСтрока.Организация = ?(ЗначениеЗаполнено(ЭП.Организация), ЭП.Организация, Организация);
		
		Если НоваяСтрока.ПростаяПодпись Тогда
			НоваяСтрока.КартинкаЭП = 1;
			НоваяСтрока.КомуВыданСертификат = СтрШаблон(НСтр("ru = '%1, %2, %3'"),
				ЭП.ВладелецПодписи, Организация, ЭП.Должность);
		Иначе
			НоваяСтрока.КартинкаЭП = 0;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокЭлектронныхПодписей(Объект, УникальныйИдентификатор)
	
	ЭлектронныеПодписи = ВнутреннийЭДО.УстановленныеПодписи(Объект);
	
	Для Каждого ЭлектроннаяПодписьФайла Из ЭлектронныеПодписи Цикл
		
		ЭлектроннаяПодписьФайла.Вставить("Объект", Объект);
		
		АдресПодписи = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.Подпись, УникальныйИдентификатор);
		ЭлектроннаяПодписьФайла.Вставить("АдресПодписи", АдресПодписи);
		
		АдресСертификата = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.Сертификат, УникальныйИдентификатор);
		ЭлектроннаяПодписьФайла.Вставить("АдресСертификата", АдресСертификата);

		РезультатПроверкиПодписиПоМЧД = ПоместитьВоВременноеХранилище(ЭлектроннаяПодписьФайла.РезультатПроверкиПодписиПоМЧД, УникальныйИдентификатор);
		ЭлектроннаяПодписьФайла.РезультатПроверкиПодписиПоМЧД = РезультатПроверкиПодписиПоМЧД;
		
	КонецЦикла;
	
	Возврат ЭлектронныеПодписи;
	
КонецФункции

&НаСервере
Функция ЭлектронныеДокументыСписка(Знач Отборы = Неопределено)
	
	СписокДанных = Элементы["Список"];
	
	Настройки = СписокДанных.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	ВыбранныеПоля = Настройки.Структура[0].Выбор.Элементы;
	ВыбранныеПоля.Очистить();
	
	ВыбранноеПоле = ВыбранныеПоля.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("Ссылка");
	
	Если Отборы <> Неопределено Тогда
		Для Каждого ОписаниеОтбора Из Отборы Цикл
			НовыйОтбор = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйОтбор, ОписаниеОтбора);
		КонецЦикла;
	КонецЕсли;
	
	Схема = СписокДанных.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	ТипГенератораМакета = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,, ТипГенератораМакета);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Результат.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция СсылкаВнутреннийЭлектронныйДокумент(ТекущийДокументОснования)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ВнутреннийЭлектронныйДокумент.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РегистрУчета КАК ДокументРегистрУчета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннийЭлектронныйДокумент КАК ВнутреннийЭлектронныйДокумент
	               |		ПО (ВЫБОР
	               |				КОГДА ВнутреннийЭлектронныйДокумент.УчетныйДокумент ССЫЛКА Документ.РегистрУчета
	               |					ТОГДА ДокументРегистрУчета.Ссылка = ВнутреннийЭлектронныйДокумент.УчетныйДокумент
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |ГДЕ
	               |	ДокументРегистрУчета.Ссылка = &Ссылка";
	
    Запрос.УстановитьПараметр("Ссылка", ТекущийДокументОснования);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат[0].Ссылка;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ДопЧастьЗапросаДляЭДПОД() 
	
	МодульПроцессыОбработкиДокументов = ОбщегоНазначения.ОбщийМодуль("ПроцессыОбработкиДокументовБГУ");
	Возврат МодульПроцессыОбработкиДокументов.ДополнитьЗапросРегистраУчетаФормаВыбораВнутреннегоЭДО();
	
КонецФункции

&НаСервереБезКонтекста
Функция ДопЧастьЗапросаДляЭД()

	  Текст = "
	  			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннийЭлектронныйДокумент КАК ВнутреннийЭлектронныйДокумент
	            |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЭлектронныхДокументов КАК СостоянияЭлектронныхДокументов
	            |			ПО (ВЫБОР
	            |					КОГДА СостоянияЭлектронныхДокументов.ЭлектронныйДокумент ССЫЛКА Документ.ВнутреннийЭлектронныйДокумент
	            |						ТОГДА СостоянияЭлектронныхДокументов.ЭлектронныйДокумент = ВнутреннийЭлектронныйДокумент.Ссылка
	            |					ИНАЧЕ ЛОЖЬ
	            |				КОНЕЦ)
	            |		ПО (ВЫБОР
	            |				КОГДА ВнутреннийЭлектронныйДокумент.УчетныйДокумент ССЫЛКА Документ.РегистрУчета
	            |					ТОГДА ДокументРегистрУчета.Ссылка = ВнутреннийЭлектронныйДокумент.УчетныйДокумент
	            |				ИНАЧЕ ЛОЖЬ
	            |			КОНЕЦ)
	            |ГДЕ
	            |	СостоянияЭлектронныхДокументов.Актуальный
				|	И ДокументРегистрУчета.ПометкаУдаления = Ложь
	            |	И СостоянияЭлектронныхДокументов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументовВнутреннегоЭДО.Завершен)
	            |	И ДокументРегистрУчета.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодНачало, ДЕНЬ) И КОНЕЦПЕРИОДА(&ПериодКонец, ДЕНЬ)";	
	   
	Возврат Текст;
	
КонецФункции

#КонецОбласти

