#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы:
// * Материалы - Массив из Строка - имена элементов
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ОсновноеСредство");
	ИменаРеквизитов.Добавить("ИнвентарныйНомер");
	ИменаРеквизитов.Добавить("СчетУчета");
	ИменаРеквизитов.Добавить("Цена");
	ИменаРеквизитов.Добавить("Сумма");
	ИменаРеквизитов.Добавить("КПС");
	ИменаРеквизитов.Добавить("КФО");
	ИменаРеквизитов.Добавить("Количество");
	Результат.Вставить("ОсновныеСредства", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Дата, Организация, Резервировать");
	
	Если ЗначенияРеквизитов.Резервировать Тогда
		Возврат;
	КонецЕсли;	
	
	УчетНаСчете21ВУсловнойОценке = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
		ЗначенияРеквизитов.Организация, ЗначенияРеквизитов.Дата).УчетНаСчете21ВУсловнойОценке;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",					ДокументСсылка);
	Запрос.УстановитьПараметр("Период",					ЗначенияРеквизитов.Дата);
	Запрос.УстановитьПараметр("Организация",			ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("НазваниеДокумента",		ДокументСсылка.Метаданные().Синоним);
	Запрос.УстановитьПараметр("УчетПоПодразделениям",	УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям());
	Запрос.УстановитьПараметр("Учет21Условно",			УчетНаСчете21ВУсловнойОценке);
	
	ТаблицыЗапроса = Новый Массив;
	
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("ТаблицаОсновныеСредства");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.ВидОперации КАК ВидОперации,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ТаблицаОсновныеСредства.ПодразделениеПолучатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ТаблицаОсновныеСредства.ПодразделениеПолучатель КАК ПодразделениеМестонахождение,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства1
	|ИЗ
	|	Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаОсновныеСредства.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_ПараметрыАмортизации
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ.ОсновноеСредство
	|					ИЗ
	|						ТаблицаОсновныеСредства1 КАК ВТ)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства1.Период КАК Период,
	|	ТаблицаОсновныеСредства1.Организация КАК Организация,
	|	ТаблицаОсновныеСредства1.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства1.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства1.ВидОперации КАК ВидОперации,
	|	ТаблицаОсновныеСредства1.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОсновныеСредства1.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства1.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства1.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства1.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ТаблицаОсновныеСредства1.ПодразделениеМестонахождение КАК ПодразделениеМестонахождение,
	|	ТаблицаОсновныеСредства1.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства1.Количество КАК Количество,
	|	ТаблицаОсновныеСредства1.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства1.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства1.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства1.ПообъектныйУчет КАК ПообъектныйУчет,
	|	ЕСТЬNULL(ВТ_ПараметрыАмортизации.ПорядокПогашенияСтоимости, ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию) КАК СписатьПриВводе
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	ТаблицаОсновныеСредства1 КАК ТаблицаОсновныеСредства1
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыАмортизации КАК ВТ_ПараметрыАмортизации
	|		ПО ТаблицаОсновныеСредства1.ОсновноеСредство = ВТ_ПараметрыАмортизации.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТаблицаОсновныеСредства1.ОсновноеСредство";
	
	
	ТаблицыЗапроса.Добавить("СобытияОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Период КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ТаблицаОсновныеСредства.Период КАК ДатаСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию) КАК Событие,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаОСНаНуждыУчреждения.ВводВЭксплуатацию)
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Период,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Период,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание),
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаОСНаНуждыУчреждения.ВводВЭксплуатацию)
	|	И ТаблицаОсновныеСредства.СписатьПриВводе
	|	И ТаблицаОсновныеСредства.ПообъектныйУчет";
	
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Период КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.ВидОперации КАК ВидОперации,
	|	ТаблицаОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.СписатьПриВводе КАК СписатьПриВводе
	|ПОМЕСТИТЬ ВТ_ОС
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	(ТаблицаОсновныеСредства.ЦМО <> ТаблицаОсновныеСредства.ЦМОПолучатель
	|			ИЛИ ТаблицаОсновныеСредства.Подразделение <> ТаблицаОсновныеСредства.ПодразделениеПолучатель
	|			ИЛИ ТаблицаОсновныеСредства.СписатьПриВводе)
	|	И (ТаблицаОсновныеСредства.Сумма <> 0
	|			ИЛИ ТаблицаОсновныеСредства.Количество <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОС.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ВТ_ОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаОСНаНуждыУчреждения.ВводВЭксплуатацию)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	ВТ_ОС.Организация КАК Организация,
	|	ВТ_ОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_ОС.ЦМО КАК ЦМО,
	|	ВТ_ОС.Подразделение КАК Подразделение,
	|	ВТ_ОС.Сумма КАК Стоимость,
	|	ВТ_ОС.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ВТ_ОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаОСНаНуждыУчреждения.ВводВЭксплуатацию)
	|				И ВТ_ОС.СписатьПриВводе
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|	КОНЕЦ КАК Событие,
	|	ВТ_ОС.НазваниеДокумента КАК НазваниеДокумента,
	|	ВТ_ОС.НомерДокумента КАК НомерДокумента,
	|	ВТ_ОС.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ВТ_ОС КАК ВТ_ОС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОС.Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ВЫБОР
	|		КОГДА ВТ_ОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаОСНаНуждыУчреждения.ВводВЭксплуатацию)
	|				И НЕ ВТ_ОС.СписатьПриВводе
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|	КОНЕЦ,
	|	ВТ_ОС.Организация,
	|	ВТ_ОС.ОсновноеСредство,
	|	ВТ_ОС.ИнвентарныйНомер,
	|	ВТ_ОС.ЦМОПолучатель,
	|	ВТ_ОС.ПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА ВТ_ОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаОСНаНуждыУчреждения.ВводВЭксплуатацию)
	|				И &Учет21Условно
	|			ТОГДА ВТ_ОС.Количество
	|		ИНАЧЕ ВТ_ОС.Сумма
	|	КОНЕЦ,
	|	ВТ_ОС.Количество,
	|	ВЫБОР
	|		КОГДА ВТ_ОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачаОСНаНуждыУчреждения.ВводВЭксплуатацию)
	|				И ВТ_ОС.СписатьПриВводе
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|	КОНЕЦ,
	|	ВТ_ОС.НазваниеДокумента,
	|	ВТ_ОС.НомерДокумента,
	|	ВТ_ОС.ДатаДокумента
	|ИЗ
	|	ВТ_ОС КАК ВТ_ОС";
	
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ВТ_ПараметрыАмортизации.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ОСНачислениеАмортизацииПриВводеВЭксплуатацию
	|ИЗ
	|	ВТ_ПараметрыАмортизации КАК ВТ_ПараметрыАмортизации
	|ГДЕ
	|	ВТ_ПараметрыАмортизации.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|	И ВТ_ПараметрыАмортизации.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Сумма КАК СуммаАмортизации
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОСНачислениеАмортизацииПриВводеВЭксплуатацию КАК ВТ
	|		ПО ТаблицаОсновныеСредства.ОсновноеСредство = ВТ.ОсновноеСредство";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения";
	КомандаПечати.Идентификатор		= "ВедомостьНаВыдачуОС_103н";
	КомандаПечати.Представление		= НСтр("ru = 'Ведомость выдачи ОС (ф. 0504210) (52н, ред. 103н)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения";
	КомандаПечати.Идентификатор		= "ВедомостьНаВыдачуОС_52н";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Ведомость выдачи ОС (ф. 0504210) (52н)'");
	КомандаПечати.Порядок			= 101;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения";
	КомандаПечати.Идентификатор		= "ВедомостьНаВыдачуОС";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Ведомость выдачи ОС (ф. 0504210) (173н)'");
	КомандаПечати.Порядок			= 102;

	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериаловДляВнутреннегоПеремещения", 5);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ВедомостьНаВыдачуОС_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															 "ВедомостьНаВыдачуОС_103н",
															 "Ведомость на выдачу ОС, ред. 103н",
															 ПечатьВедомостиНаВыдачу(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ВедомостьВыдачиНФА_0504210_103н"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ВедомостьНаВыдачуОС_52н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															 "ВедомостьНаВыдачуОС_52н",
															 "Ведомость на выдачу ОС, ред. 52н",
															 ПечатьВедомостиНаВыдачу(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ВедомостьВыдачиНФА_0504210_52н"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ВедомостьНаВыдачуОС") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															 "ВедомостьНаВыдачуОС",
															 "Ведомость на выдачу ОС",
															 ПечатьВедомостиНаВыдачу(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ВедомостьВыдачиНФА_0504210"));
		
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СправкаОСодержанииДрагМатериаловДляВнутреннегоПеремещения") Тогда
		
		ТабличныйДокумент = УчетДрагМатериалов.ПечатьСправкиОСодержанииДрагМатериаловДляВнутреннегоПеремещения(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"СправкаОСодержанииДрагМатериаловДляВнутреннегоПеремещения","Справка о содержании драг. материалов", ТабличныйДокумент);

	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьВедомостиНаВыдачу(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов"	, МассивОбъектов);
	Запрос.УстановитьПараметр("ЕдИзмШт"			, Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУ.Регистратор КАК Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения) КАК Регистратор,
	|	ЖурналПроводокЕПСБУ.Сумма КАК Сумма,
	|	ЖурналПроводокЕПСБУ.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУ.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУ.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУ.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУ.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУ.КЭККт КАК КЭККт,
	|	ЖурналПроводокЕПСБУ.КФО КАК КФО
	|ПОМЕСТИТЬ Движения
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
	|ГДЕ
	|	ЖурналПроводокЕПСБУ.Регистратор В(&МассивОбъектов)
	|	И (ЖурналПроводокЕПСБУ.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ИЛИ ЖурналПроводокЕПСБУ.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский))";
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШапкаДокумента.Ссылка КАК Ссылка,
	|	ШапкаДокумента.Дата КАК Дата,
	|	ШапкаДокумента.Номер КАК Номер,
	|	ШапкаДокумента.Организация КАК Организация,
	|	ШапкаДокумента.Организация.НаименованиеПолное КАК ОрганизацияНаименование,
	|	ШапкаДокумента.Организация.КодОКПО КАК ОрганизацияКодОКПО,
	|	ШапкаДокумента.Подразделение.Наименование КАК ПодразделениеНаименование,
	|	ШапкаДокумента.ЦМО.Сотрудник КАК МОЛ,
	|	ШапкаДокумента.Подразделение КАК Подразделение,
	|	ШапкаДокумента.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель
	|ИЗ
	|	Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения КАК ШапкаДокумента
	|ГДЕ
	|	ШапкаДокумента.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Регистратор КАК Ссылка,
	|	ПРЕДСТАВЛЕНИЕ(Движения.СчетДт) КАК СчетДтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КПСДт) КАК КПСДтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КЭКДт) КАК КЭКДтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.СчетКт) КАК СчетКтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КПСКт) КАК КПСКтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КЭККт) КАК КЭККтПредставление,
	|	ПРЕДСТАВЛЕНИЕ(Движения.КФО) КАК КФОПредставление,
	|	ЕСТЬNULL(Движения.СчетДт.Порядок, 0) КАК СчетДтПорядок,
	|	ЕСТЬNULL(Движения.СчетКт.Порядок, 0) КАК СчетКтПорядок
	|ИЗ
	|	Движения КАК Движения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	СчетДтПорядок,
	|	СчетКтПорядок
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧДокумента.Ссылка КАК Ссылка,
	|	МИНИМУМ(ТЧДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТЧДокумента.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТЧДокумента.ЦМОПолучатель.Сотрудник КАК Сотрудник
	|ИЗ
	|	Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения.ОсновныеСредства КАК ТЧДокумента
	|ГДЕ
	|	ТЧДокумента.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧДокумента.Ссылка,
	|	ТЧДокумента.ЦМОПолучатель,
	|	ТЧДокумента.ЦМОПолучатель.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка,
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА СправочникОсновныеСредства.НаименованиеПолное = """"
	|			ТОГДА СправочникОсновныеСредства.Наименование
	|		ИНАЧЕ СправочникОсновныеСредства.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеМатериал,
	|	СправочникОсновныеСредства.Код КАК КодМатериал,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК НаименованиеЕдИзм,
	|	ВЫРАЗИТЬ(&ЕдИзмШт КАК Справочник.КлассификаторЕдиницИзмерения).Код КАК КодЕдИзм
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТЧДокумента.Ссылка КАК Ссылка,
	|		ТЧДокумента.ОсновноеСредство КАК Номенклатура,
	|		МИНИМУМ(ТЧДокумента.НомерСтроки) КАК НомерСтроки
	|	ИЗ
	|		Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения.ОсновныеСредства КАК ТЧДокумента
	|	ГДЕ
	|		ТЧДокумента.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТЧДокумента.Ссылка,
	|		ТЧДокумента.ОсновноеСредство) КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК СправочникОсновныеСредства
	|		ПО Т.Номенклатура = СправочникОсновныеСредства.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Ссылка,
	|	Т.НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧДокумента.Ссылка КАК Ссылка,
	|	ТЧДокумента.НомерСтроки КАК НомерСтроки,
	|	ТЧДокумента.ОсновноеСредство КАК Номенклатура,
	|	ТЧДокумента.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТЧДокумента.Количество КАК Количество
	|ИЗ
	|	Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения.ОсновныеСредства КАК ТЧДокумента
	|ГДЕ
	|	ТЧДокумента.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧДокумента.Ссылка КАК Ссылка,
	|	ТЧДокумента.ОсновноеСредство КАК Номенклатура,
	|	СУММА(ТЧДокумента.Количество) КАК Количество,
	|	СУММА(ТЧДокумента.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА СУММА(ТЧДокумента.Количество) <> 0
	|			ТОГДА ВЫРАЗИТЬ(СУММА(ТЧДокумента.Сумма) / СУММА(ТЧДокумента.Количество) КАК ЧИСЛО(15, 2))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	Документ.ВедомостьНаВыдачуОСНаНуждыУчреждения.ОсновныеСредства КАК ТЧДокумента
	|ГДЕ
	|	ТЧДокумента.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧДокумента.Ссылка,
	|	ТЧДокумента.ОсновноеСредство";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат УправлениеПечатьюБГУ.ПечатьВедомостиВыдачиНФА_0504210(РезультатЗапроса, ОбъектыПечати, ИмяМакета);

КонецФункции

#КонецОбласти

#КонецЕсли
