#Область ИнтеграцияСЮКасса

#Область ПрограммныйИнтерфейс

// Начинает фоновое выполнение загрузки операций по Яндекс.Кассе.
//
// Параметры:
//  ПараметрыЗагрузки - Структура - параметры загрузки операций.
//   * Период - СтандартныйПериод, Структура - Период за который будут выбираться операции по Яндекс.Кассе.
//    ** ДатаНачала - Дата - начало периода запроса. 
//                           Если не указан, дата начала будет определена автоматически.
//    ** ДатаОкончания - Дата - окончание периода запроса. 
//                              Если не указан, дата окончания будет равна текущей дате.
//   * Организация - ОпределяемыйТип.Организация - организация, по которой нужно отобрать операции. 
//                                                 Если не указана то, будут обработаны все действительные настройки;
//   * СДоговором - Булево, Неопределено - позволяет указать для каких настроек следует загружать операции:
//    ** Неопределено - будут загружены и операции по схемам "С договором" и "Без договора"
//    ** Истина - будут загружены операции по схеме "С договором"
//    ** Ложь - будут загружены операции по схеме "Без договора"
//    Если указан параметр Организация, этот параметр не учитывается.
//
// Возвращаемое значение:
//  Структура - описание длительной операции. См. ДлительныеОперации.ВыполнитьВФоне.
//
Функция НачатьЗагрузкуОперацийПоЮКассе(ПараметрыЗагрузки) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка операций по Яндекс.Кассе'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне("ИнтеграцияССервисомПриемаПлатежейБГУ.ЗагрузитьОперацииПоЯндексКассеВФоне",
		ПараметрыЗагрузки, ПараметрыВыполнения);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

// Возвращает ссылочный идентификатор, который затем используется при формировании
// идентификатора платежа в Яндекс.Кассе.
//
// Возвращаемое значение:
// Строка - Ссылочный идентификатор.
//
Функция СсылочныйИдентификатор() Экспорт
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(1000000000) * ГСЧ.СлучайноеЧисло(1000000000);
	
	Буфер = Новый БуферДвоичныхДанных(64);
	Буфер.ЗаписатьЦелое64(0, СлучайноеЧисло);
	HexСтрока = Лев(ПолучитьHexСтрокуИзБуфераДвоичныхДанных(Буфер), 16);
	
	Возврат HexСтрока;
	
КонецФункции

#КонецОбласти

#Область РаботаССообщениями

// Заполняет параметры сообщения электронной почты, отправляемого без шаблона.
// См. ИнтеграцияСЯндексКассойКлиентПереопределяемый.ЗаполнитьПараметрыСообщенияБезШаблона
//
Процедура ЗаполнитьПараметрыСообщенияБезШаблона(ПараметрыСообщения) Экспорт
	
	СведенияОСчете = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыСообщения.Предмет,
		"Организация, Контрагент, СуммаДокумента, ВалютаДокумента");
	СведенияОбОрганизации = Новый Структура;
	ЭлектронныеДокументыБГУ.ПолучитьДанныеЮрФизЛица(СведенияОСчете.Организация, СведенияОбОрганизации, ТекущаяДата());
	Подпись = НоваяПодпись();
	
	ФорматнаяСтрока = ?(СведенияОСчете.СуммаДокумента - Цел(СведенияОСчете.СуммаДокумента) > 0,
		"ЧЦ=15; ЧДЦ=2",
		"ЧЦ=15");
	
	НаименованиеВалюты = НСтр("ru='руб.'");
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	Если СведенияОСчете.ВалютаДокумента = ВалютаРегУчета Тогда
		НаименованиеВалюты = НСтр("ru='руб.'");
	Иначе
		НаименованиеВалюты = СокрЛП(СведенияОСчете.ВалютаДокумента);
	КонецЕсли;	
	
	ПредставлениеСуммы = СтрШаблон("%1 %2",
		Формат(СведенияОСчете.СуммаДокумента, ФорматнаяСтрока),
		НаименованиеВалюты);
	
	ПараметрыСообщения.Тема = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Подтверждение заказа на сумму %1 (%2)'"),
		ПредставлениеСуммы,
		СведенияОбОрганизации.НаименованиеПолное);
		
	ПараметрыСообщения.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='<html><body>
	|<p>Добрый день!</p>
	|<p>Вы сделали заказ на сумму %1 у %2.</p>
	|<p>Для проверки и оплаты заказа онлайн перейдите по ссылке: <a href=""%3"">%3</a></p>
	|<br>
	|<p>%4</p>
	|</body></html>'"),
	НормализоватьСтрокуДляHTML(ПредставлениеСуммы),
	НормализоватьСтрокуДляHTML(СведенияОбОрганизации.НаименованиеПолное),
	НормализоватьСтрокуДляHTML(ПараметрыСообщения.ПлатежнаяСсылка),
	Подпись);
	
КонецПроцедуры

Функция НоваяПодпись()
	
	Подпись = НСтр("ru='С уважением%1'");
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	ДанныеПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АвторизованныйПользователь, "Наименование, Служебный");
	Если ДанныеПользователя.Служебный Тогда
		ПредставлениеПользователя = ".";
		
	Иначе
		ПредставлениеПользователя = ", " + ДанныеПользователя.Наименование + ".";
		
	КонецЕсли;
	
	Подпись = СтрШаблон(Подпись, ПредставлениеПользователя);
	
	Возврат Подпись;
	
КонецФункции

// Заменяет спецсимволы HTML на их ссылки-мнемоники.
// 
// Параметры:
// Текст - Строка - Текст, который необходимо преобразовать для вставки в HTML
// 
// Возвращаемое значение:
// Строка - текст, в котором спецсимволы HTML заменены на свои ссылки-мненмоники.
//
Функция НормализоватьСтрокуДляHTML(Значение)
	
	Значение = СтрЗаменить(Значение, "&", "&amp;");
	Значение = СтрЗаменить(Значение, "<", "&lt;");
	Значение = СтрЗаменить(Значение, ">", "&gt;");
	Значение = СтрЗаменить(Значение, """", "&quot;");
	Значение = СтрЗаменить(Значение, "'", "&apos;");
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Только для служебного использования.
// Вызывается с помощью ДлительныеОперации.ВыполнитьВФоне.
//
Процедура ЗагрузитьОперацииПоЯндексКассеВФоне(Параметры, АдресРезультата) Экспорт
	
	РезультатЗагрузкиОпераций = ОнлайнОплаты.ЗагрузитьОперацииОнлайнОплат(Параметры.Период, Параметры.Организация, Параметры.СДоговором);
	
	Результат = Новый Структура;
	Результат.Вставить("РезультатЗагрузкиОпераций", РезультатЗагрузкиОпераций);
	Результат.Вставить("ПоказыватьОповещениеПользователя", Параметры.ПоказыватьОповещениеПользователя);
	
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

#Область РаботаСПодсистемой

Процедура ПриОпределенииДополнительныхНастроекЯндексКассы(ДополнительныеНастройки) Экспорт
	
	СтрокаНастройки = ДополнительныеНастройки.Добавить();
	СтрокаНастройки.Настройка = "ПараметрыДоговораЭквайринга";
	СтрокаНастройки.Представление = НСтр("ru='Параметры договора и операций эквайринга'");
	СтрокаНастройки.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ПараметрыДоговораЭквайринга");
	
КонецПроцедуры

Процедура ПриСозданииФормыНастроекЯндексКассы(Форма, Группа, Префикс, ДополнительныеНастройки) Экспорт
	
	// Реквизиты
	ДобавляемыеРеквизиты = Новый Массив;
	
	Реквизит = Новый РеквизитФормы(
		Префикс + "ПараметрыДоговораЭквайринга",
		Новый ОписаниеТипов("СправочникСсылка.ПараметрыДоговораЭквайринга"),
		,
		НСтр("ru='Параметры договора и операций эквайринга'"),
		Истина
	);
	ДобавляемыеРеквизиты.Добавить(Реквизит);
	ДополнительныеНастройки.Вставить("ПараметрыДоговораЭквайринга", Реквизит.Имя);
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Элементы
	ТипПолеФормы = Тип("ПолеФормы");
	Элементы = Форма.Элементы;
	
	ГруппаНастройкиУчета = Элементы.Добавить(Префикс + "ГруппаНастройкиУчета", Тип("ГруппаФормы"), Группа);
	ГруппаНастройкиУчета.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаНастройкиУчета.Заголовок = НСтр("ru='Настройка документа ""Эквайринговая операция""'");
	ГруппаНастройкиУчета.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаНастройкиУчета.ОтображатьЗаголовок = Истина;
	ГруппаНастройкиУчета.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	
	ИмяРеквизита = Префикс + "ПараметрыДоговораЭквайринга";
	Поле = Элементы.Добавить(ИмяРеквизита, ТипПолеФормы, ГруппаНастройкиУчета);
	Поле.ПутьКДанным = ИмяРеквизита;
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Поле.Подсказка = НСтр("ru = 'Параметры договора и операций эквайринга для отражения операций по ЮKassa'");
	Поле.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	
	Форма.СДоговором = 1;
	Элементы.ГруппаСДоговором.Видимость = Истина;
	Элементы.ГруппаБезДоговора.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Форма.Организация) Тогда
		Форма.Организация = ОбщегоНазначенияБГУ.ОсновнаяОрганизация();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередНачаломРедактированияДополнительныхНастроекЯндексКассы(Контекст, Отказ = Ложь) Экспорт
	
	НайтиИлиСоздатьЭквайераИДоговор(Контекст.Организация);
	
КонецПроцедуры

Процедура НайтиИлиСоздатьЭквайераИДоговор(Организация)
	
	ДанныеКонтрагента = ОнлайнОплатыСлужебный.ДанныеЭквайераПоУмолчанию(Новый Структура("ДатаНачала", ТекущаяДатаСеанса()));
	КонтрагентЭквайера = Справочники.Контрагенты.ПустаяСсылка();
	ЭлектронныеДокументыБГУ.СсылкаНаОбъектПоИННКПП("Контрагенты",
		ДанныеКонтрагента.ИНН, ДанныеКонтрагента.КПП, КонтрагентЭквайера, ТекущаяДатаСеанса());
	Если НЕ ЗначениеЗаполнено(КонтрагентЭквайера) Тогда
		РеквизитыКонтрагента = Новый Структура;
		РеквизитыКонтрагента.Вставить("ИНН", ДанныеКонтрагента.ИНН);
		РеквизитыКонтрагента.Вставить("КПП", ДанныеКонтрагента.КПП);
		РеквизитыКонтрагента.Вставить("Наименование", ДанныеКонтрагента.Наименование);
		РеквизитыКонтрагента.Вставить("НаименованиеСокращенное", ДанныеКонтрагента.Наименование);
		РеквизитыКонтрагента.Вставить("КодОКПО", ДанныеКонтрагента.ОКПО);
		РеквизитыКонтрагента.Вставить("ТипКонтрагента", Справочники.ТипыКонтрагентов.НайтиПоКоду("4"));
		
		ЭлектронныеДокументыБГУ.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, КонтрагентЭквайера);
		Если НЕ ЗначениеЗаполнено(КонтрагентЭквайера) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыДоговора = Новый Структура;
	Если ЗначениеЗаполнено(Организация) Тогда
		РеквизитыДоговора.Вставить("Организация", Организация);
	КонецЕсли;
	РеквизитыДоговора.Вставить("Владелец", КонтрагентЭквайера);
	
	ДоговорКонтрагента = ИнтеграцияССервисомПриемаПлатежейБГУ.ДоговорКонтрагентаПоставщика(РеквизитыДоговора);
	Если НЕ ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		РеквизитыДоговора = Новый Структура;
		РеквизитыДоговора.Вставить("Наименование",НСтр("ru='Основной договор'"));
		РеквизитыДоговора.Вставить("Организация", Организация);
		РеквизитыДоговора.Вставить("Контрагент", КонтрагентЭквайера);
		РеквизитыДоговора.Вставить("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		
		ИнтеграцияССервисомПриемаПлатежейБГУ.СоздатьОсновнойДоговорПоРеквизитам(РеквизитыДоговора, ДоговорКонтрагента);	
	КонецЕсли;	
	
КонецПроцедуры

Функция ДоговорКонтрагентаПоставщика(РеквизитыДоговора) Экспорт
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Договоры.Ссылка КАК Договор
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Контрагент = &Контрагент
	|	И Договоры.ВидДоговора = &ВидДоговора";
	
	Если РеквизитыДоговора.Свойство("Организация") Тогда
		ТекстЗапроса = ТекстЗапроса + " И Договоры.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", РеквизитыДоговора.Организация);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Запрос.УстановитьПараметр("Контрагент", РеквизитыДоговора.Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Договор;
	
КонецФункции

Процедура СоздатьОсновнойДоговорПоРеквизитам(Знач РеквизитыДоговора, Договор, Отказ = Ложь) Экспорт
	
	Результат = Справочники.Договоры.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Результат, РеквизитыДоговора);
	
	Попытка
		Результат.Записать();
	Исключение
		Отказ = Истина;
		ТекстДействия = НСтр("ru = 'Запись нового элемента справочника ""Договоры"" для интеграции с платежным сервисом ЮKassa'");
		
		ЗаписьЖурналаРегистрации(
			ТекстДействия,
			УровеньЖурналаРегистрации.Ошибка,
			Результат.Метаданные(),
			Результат,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ТекстОшибки = НСтр("ru = 'Ошибка при записи нового элемента справочника ""Договоры"" для интеграции с платежным сервисом ЮKassa'") +
			НСтр("ru = '|Подробности см. в Журнале регистрации.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	Договор = Результат;
	
КонецПроцедуры

Процедура ПередОкончаниемРедактированияДополнительныхНастроекЯндексКассы(Контекст, Отказ = Ложь) Экспорт
	
	ИмяРеквизита = Контекст.Префикс + "ПараметрыДоговораЭквайринга";
	Если Не ЗначениеЗаполнено(Контекст.Форма[ИмяРеквизита]) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле",
			"Заполнение",
			НСтр("ru='Параметры договора и операций эквайринга'")
		);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ИмяРеквизита,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииОснованийПлатежа(ОснованияПлатежа) Экспорт
	
	ОснованияПлатежа.Добавить("Документ.СчетНаОплату");
	
КонецПроцедуры

Процедура ПриПроверкеЗаполненияОснованияПлатежа(ОснованиеПлатежа, Отказ) Экспорт
	
	Если ТипЗнч(ОснованиеПлатежа) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеПлатежа,
			"Организация,ЛицевойСчет,РеквизитыЛицевогоСчета,СуммаДокумента,ВалютаДокумента,Контрагент,СсылочныйИдентификаторСервисаПриемаПлатежей, Дата");
		
		Если НЕ ЗначениеЗаполнено(Реквизиты.СсылочныйИдентификаторСервисаПриемаПлатежей) Тогда
			ТекстСообщения = НСтр("ru='Перед формированием платежной ссылки необходимо записать документ.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Реквизиты.Организация) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Заполнение",
				НСтр("ru='Организация'")
			);
			Поле = "Организация";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОснованиеПлатежа, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Реквизиты.ЛицевойСчет) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Заполнение",
				НСтр("ru='Лицевой счет'")
			);
			Поле = "ЛицевойСчет";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОснованиеПлатежа, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Реквизиты.Контрагент) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Заполнение",
				НСтр("ru='Контрагент'")
			);
			Поле = "Контрагент";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОснованиеПлатежа, Поле, "Объект", Отказ);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Реквизиты.СуммаДокумента) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Список",
				"Заполнение",,,
				НСтр("ru='Товары и услуги'"),
				НСтр("ru='Не заполнены услуги и товары или их стоимость'")
			);
			Поле = "Услуги";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОснованиеПлатежа, Поле, "Объект", Отказ);
		КонецЕсли;
		
		ВалютаРуб = Справочники.Валюты.НайтиПоКоду("643");
		Если Реквизиты.ВалютаДокумента <> ВалютаРуб Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Поле",
				"Корректность",
				НСтр("ru = 'Валюта'"),,,
				НСтр("ru = 'С помощью ЮКассы можно оплачивать только счета в рублях'")
			);
			Поле = "ТоварыЦеныИВалюта";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОснованиеПлатежа, Поле, "Объект", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыОрганизации(Организация, Реквизиты) Экспорт
	
	СведенияОбОрганизации = Новый Структура;
	ЭлектронныеДокументыБГУ.ПолучитьДанныеЮрФизЛица(Организация, СведенияОбОрганизации);
	Реквизиты.ИНН       = СведенияОбОрганизации.ИНН;
	Реквизиты.КПП       = СведенияОбОрганизации.КПП;
	Реквизиты.Резидент  = Истина;
	Реквизиты.ЭтоЮрЛицо = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеОснованияПлатежа(ОснованиеПлатежа, ДанныеОснованияПлатежа) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Счет.СсылочныйИдентификаторСервисаПриемаПлатежей КАК СсылочныйИдентификатор,
	|	Счет.Номер КАК Номер,
	|	Счет.Дата КАК Дата,
	|	Счет.ВалютаДокумента.Код КАК ВалютаДокументаКод,
	|	ПРЕДСТАВЛЕНИЕ(Счет.ВалютаДокумента) КАК ВалютаДокументаНаименование,
	|	Счет.СуммаДокумента КАК СуммаДокумента,
	|	Счет.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	Счет.ЛицевойСчет КАК ЛицевойСчетПродавца,
	|	Счет.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчетаПродавца,
	|	Счет.Организация КАК Организация,
	|	Счет.Контрагент КАК Контрагент,
	|	Счет.Договор КАК Договор,
	|	Счет.НазначениеПлатежа КАК НазначениеПлатежа,
	|	Счет.СчетПлательщика КАК СчетПокупателя
	|ИЗ
	|	Документ.СчетНаОплату КАК Счет
	|ГДЕ
	|	Счет.Ссылка = &Счет";
	
	Запрос.УстановитьПараметр("Счет", ОснованиеПлатежа);
	РеквизитыСчета = Запрос.Выполнить().Выбрать();
	
	Если РеквизитыСчета.Следующий() Тогда
		
		СведенияОбОрганизации = Новый Структура;
		СведенияОКонтрагенте = Новый Структура;
		
		ЗаполнитьДанныеУчастникаСчетаНаОплату(РеквизитыСчета.Организация, "Продавец", РеквизитыСчета.Дата, СведенияОбОрганизации, 
								РеквизитыСчета.ЛицевойСчетПродавца, РеквизитыСчета.РеквизитыЛицевогоСчетаПродавца);
								
		Если ЗначениеЗаполнено(РеквизитыСчета.СчетПокупателя) Тогда
			ЗаполнитьДанныеУчастникаСчетаНаОплату(РеквизитыСчета.Контрагент, "Покупатель", РеквизитыСчета.Дата, СведенияОКонтрагенте, 
									РеквизитыСчета.СчетПокупателя);
		Иначе
			ЗаполнитьДанныеУчастникаСчетаНаОплату(РеквизитыСчета.Контрагент, "Покупатель", РеквизитыСчета.Дата, СведенияОКонтрагенте);
		КонецЕсли;
								
		НомерДляПечати = НомерДляПечати(ОснованиеПлатежа, РеквизитыСчета.Номер);
		
		ДанныеОснованияПлатежа.Идентификатор = ИдентификаторПлатежа(НомерДляПечати, РеквизитыСчета.СсылочныйИдентификатор);
		ДанныеОснованияПлатежа.Номер = НомерДляПечати;
		ДанныеОснованияПлатежа.Сумма = РеквизитыСчета.СуммаДокумента;
		ДанныеОснованияПлатежа.Валюта = РеквизитыСчета.ВалютаДокументаКод;
		ДанныеОснованияПлатежа.НазначениеПлатежа = РеквизитыСчета.НазначениеПлатежа;
			
		РеквизитыПродавца = Новый Структура("ИННПолучателя, КПППолучателя, ТекстПолучателя, НомерСчетаПолучателя, 
											|НаименованиеБанкаПолучателя, БикБанкаПолучателя, СчетБанкаПолучателя", 
											"ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
	    ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(РеквизитыСчета.ЛицевойСчетПродавца, 
											РеквизитыСчета.РеквизитыЛицевогоСчетаПродавца, РеквизитыПродавца, Истина);
			
		ДанныеОснованияПлатежа.БанковскийСчет.БанкБИК = РеквизитыПродавца.БикБанкаПолучателя;
		ДанныеОснованияПлатежа.БанковскийСчет.БанкНаименование = СведенияОбОрганизации.НаименованиеБанка;
		ДанныеОснованияПлатежа.БанковскийСчет.БанкКоррСчет = РеквизитыПродавца.СчетБанкаПолучателя;
		ДанныеОснованияПлатежа.БанковскийСчет.НомерСчета = РеквизитыПродавца.НомерСчетаПолучателя;
		ДанныеОснованияПлатежа.Продавец.УчетнаяПолитика = КодСистемыНалогообложения(РеквизитыСчета.Организация, РеквизитыСчета.Дата);
		
		ДанныеОснованияПлатежа.Продавец.ИНН = СведенияОбОрганизации.ИНН;
		ДанныеОснованияПлатежа.Продавец.КПП = СведенияОбОрганизации.КПП;
		ДанныеОснованияПлатежа.Продавец.Наименование = СведенияОбОрганизации.Наименование;
		ДанныеОснованияПлатежа.Продавец.Телефон = ТелефонВФорматеСервиса(СведенияОбОрганизации.Телефон);
		ДанныеОснованияПлатежа.Продавец.ЭлектроннаяПочта = СведенияОбОрганизации.ЭлектроннаяПочта;
		ДанныеОснованияПлатежа.Продавец.ФактическийАдрес = СведенияОбОрганизации.АдресФактический;
		ДанныеОснованияПлатежа.Продавец.ЮридическийАдрес = СведенияОбОрганизации.АдресЮридический;
		ДанныеОснованияПлатежа.Покупатель.Идентификатор = ИдентификаторПокупателя(РеквизитыСчета.Контрагент);
		ДанныеОснованияПлатежа.Покупатель.Наименование = СведенияОКонтрагенте.Наименование;
		ДанныеОснованияПлатежа.Покупатель.ИНН = СведенияОКонтрагенте.ИНН;
		КонтактныеДанныеЧека = "";
		Если ЗначениеЗаполнено(СведенияОКонтрагенте.ЭлектроннаяПочта) Тогда
			КонтактныеДанныеЧека = СведенияОКонтрагенте.ЭлектроннаяПочта;
		Иначе
			Если ЗначениеЗаполнено(СведенияОКонтрагенте.Телефон) Тогда
				КонтактныеДанныеЧека = ТелефонВФорматеСервиса(СведенияОКонтрагенте.Телефон);
			КонецЕсли;	
		КонецЕсли;	
		ДанныеОснованияПлатежа.Покупатель.КонтактныеДанныеЧека = КонтактныеДанныеЧека;
		
		Валюта = НСтр("ru='руб.'");
		
		СведенияОДоговоре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыСчета.Договор,
			"ПризнакСпособаРасчета");
		
		ПризнакСпособаРасчетаДляЧека = ?(ЗначениеЗаполнено(СведенияОДоговоре.ПризнакСпособаРасчета),
			СведенияОДоговоре.ПризнакСпособаРасчета,
			Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная);
		
		ДокументыОснованияПлатежа = Новый ТаблицаЗначений;
		ДокументыОснованияПлатежа.Колонки.Добавить("ДокументОснованиеЧекаККМ", Новый ОписаниеТипов("ДокументСсылка.СчетНаОплату"));
		ДокументыОснованияПлатежа.Колонки.Добавить("ПризнакСпособаРасчета", Новый ОписаниеТипов("ПеречислениеСсылка.ПризнакиСпособаРасчета"));
		НоваяСтрока = ДокументыОснованияПлатежа.Добавить();
		НоваяСтрока.ДокументОснованиеЧекаККМ = ОснованиеПлатежа;
		НоваяСтрока.ПризнакСпособаРасчета = ПризнакСпособаРасчетаДляЧека;
		
		НоменклатураТоваровИУслуг = ПодключаемоеОборудованиеБГУ.ТаблицаНоменклатурыЧекаККМДляДокументовОснований(ДокументыОснованияПлатежа);
		
		Для каждого ТекТовар Из НоменклатураТоваровИУслуг Цикл
			СтрокаНоменклатуры = ДанныеОснованияПлатежа.Номенклатура.Добавить();
			СтрокаНоменклатуры.НомерСтроки = ТекТовар.НомерСтроки;
			
			Если НЕ ЗначениеЗаполнено(ТекТовар.Наименование) Тогда
				Если ЗначениеЗаполнено(ТекТовар.Номенклатура) Тогда
					Если ЗначениеЗаполнено(ТекТовар.Номенклатура.НаименованиеПолное) Тогда
						ТекТовар.Наименование = ТекТовар.Номенклатура.НаименованиеПолное;
					Иначе
						ТекТовар.Наименование = ТекТовар.Номенклатура.Наименование;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;	
			Если ЗначениеЗаполнено(ТекТовар.Номенклатура) Тогда
				Если ТипЗнч(ТекТовар.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда 
					Если ЗначениеЗаполнено(ТекТовар.Номенклатура.НаименованиеДляЧекаККМ) Тогда
						Если ТекТовар.ЕстьДополнениеНоменклатуры Тогда
							ТекТовар.Наименование = СокрЛП(ТекТовар.Наименование + " " + ТекТовар.ДополнениеНоменклатуры);
						КонецЕсли;
					Иначе
						Если ТекТовар.ЕстьСодержаниеУслуги Тогда
							Если ЗначениеЗаполнено(ТекТовар.СодержаниеУслуги) Тогда
								Если ТекТовар.ЕстьДополнениеНоменклатуры Тогда
									ТекТовар.Наименование = СокрЛП(ТекТовар.СодержаниеУслуги + " " + ТекТовар.ДополнениеНоменклатуры);
								Иначе
									ТекТовар.Наименование = ТекТовар.СодержаниеУслуги;
								КонецЕсли;
							Иначе
								Если ТекТовар.ЕстьДополнениеНоменклатуры Тогда
									ТекТовар.Наименование = СокрЛП(ТекТовар.Наименование + " " + ТекТовар.ДополнениеНоменклатуры);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;
			
			СтрокаНоменклатуры.Наименование = ТекТовар.Наименование;
			СтрокаНоменклатуры.НаименованиеПолное = ТекТовар.Наименование;
			СтрокаНоменклатуры.Характеристика = "";
			СтрокаНоменклатуры.Количество = ТекТовар.Количество;
			СтрокаНоменклатуры.Цена = ТекТовар.Цена;
			СтрокаНоменклатуры.СтавкаНДС = СтавкаНДСНаименование(ТекТовар.СтавкаНДС);
			
			СтрокаНоменклатуры.СтавкаНДСКод = СтавкаНДСКод(ТекТовар.СтавкаНДС);
			СтрокаНоменклатуры.Валюта = Валюта;
			СтрокаНоменклатуры.Артикул = "";
			СтрокаНоменклатуры.ЕдиницаИзмерения = СокрЛП(ТекТовар.ЕдиницаИзмеренияПредметаРасчета);
			СтрокаНоменклатуры.ВидНоменклатуры = "";
			СтрокаНоменклатуры.Родитель = "";
			СтрокаНоменклатуры.Сумма = ТекТовар.Всего;
			Если ТекТовар.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Работа
				ИЛИ ТекТовар.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга Тогда
				СтрокаНоменклатуры.ПредметРасчета = 4;
			Иначе
				СтрокаНоменклатуры.ПредметРасчета = 1;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТелефонВФорматеСервиса(НомерТелефона)
	Результат = НомерТелефона;
	
	Результат = СтрЗаменить(Результат, "+", "");
	Результат = СтрЗаменить(Результат, " ", "");
	Результат = СтрЗаменить(Результат, "(", "");
	Результат = СтрЗаменить(Результат, ")", "");
	
	Возврат Результат;
КонецФункции	

Функция СтавкаНДСКод(СтавкаНДС)
	Результат = 1;
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Результат = 1;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Результат = 2;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Результат = 3;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Результат = 4;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Результат = 4;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Результат = 5;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Результат = 6;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Результат = 6;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

Функция СтавкаНДСНаименование(СтавкаНДС)
	Результат = "Без НДС";
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Результат = "Без НДС";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Результат = "0%";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Результат = "10%";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Результат = "20%";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Результат = "20%";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Результат = "10/110";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Результат = "20/120";
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Результат = "20/120";
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

// Возвращает идентификатор покупателя для Яндекс.Кассы
//
// Параметры:
// Контрагент - СправочникСсылка.Контрагент - Контрагент, идентификатор которого нужно получить.
// 
// Возвращаемое значение:
// Строка - Идентификатор покупателя.
//
Функция ИдентификаторПокупателя(Контрагент)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	
КонецФункции

// Возвращает код учетной политики организации для Яндекс.Кассы:
// 1 - ОСН
// 2 - УСН (доходы)
// 3 - УСН (доходы минус расходы)
// 4 - продажа облагается ЕНВД
//
// Параметры:
// Организация - СправочникСсылка.Организация - Организация, по которой получается код учетной политики.
//
// Возвращаемое значение:
// Число - Код учетной политики.
//
Функция КодСистемыНалогообложения(Организация, Период)
	
	ВидСНО = ПодключаемоеОборудованиеБГУ.ВидСистемыНалогообложенияОрганизации(Организация, Период);
	
	Если ВидСНО = Перечисления.ВидыСистемыНалогообложенияЧекаККМ.УСНДоходы Тогда	
		Возврат 2;
	ИначеЕсли ВидСНО = Перечисления.ВидыСистемыНалогообложенияЧекаККМ.УСНДоходыМинусРасходы Тогда	
		Возврат 3;
	КонецЕсли;
	
	Возврат 1; 
КонецФункции

Процедура ЗаполнитьДанныеУчастникаСчетаНаОплату(Участник, 
								ВидУчастника, 
								ДатаДанных, 
								СтруктураДанных, 
								ЛицевойСчет = Неопределено, 
								РеквизитыЛицевогоСчета = Неопределено,
								ГоловнаяОрганизация = Неопределено,
								ГоловнаяОрганизацияНаименование = "",
								ГоловнаяОрганизацияИНН = "") Экспорт
								
	Если НЕ ЗначениеЗаполнено(Участник) Тогда
		Возврат;
	КонецЕсли;
	
	Контрагент = Участник;
	
	СтруктураДанных.Вставить("ИНН", "");
	СтруктураДанных.Вставить("КПП", "");
	СтруктураДанных.Вставить("Наименование", "");
	СтруктураДанных.Вставить("АдресЮридический", "");
	СтруктураДанных.Вставить("АдресФактический", "");
	СтруктураДанных.Вставить("Телефон", "");
	СтруктураДанных.Вставить("ЭлектроннаяПочта", "");
	СтруктураДанных.Вставить("НомерСчета", "");
	СтруктураДанных.Вставить("НаименованиеБанка", "");
	СтруктураДанных.Вставить("БИК", "");
	
	СведенияОбУчастнике = Новый Структура;
	ЭлектронныеДокументыБГУ.ПолучитьДанныеЮрФизЛица(Участник, СведенияОбУчастнике, ДатаДанных, Ложь);
	
	Если СведенияОбУчастнике.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ИННУчастника = СведенияОбУчастнике.ИНН;
		КППУчастника = СведенияОбУчастнике.КПП;
		НаименованиеУчастника = СведенияОбУчастнике.ОфициальноеНаименование;
		Если ВидУчастника = "Продавец" Тогда
			Если ЗначениеЗаполнено(ЛицевойСчет) Тогда
				РеквизитыПолучателя = Новый Структура("ИННПолучателя, КПППолучателя, ТекстПолучателя, НомерСчетаПолучателя, НаименованиеБанкаПолучателя, БикБанкаПолучателя, СчетБанкаПолучателя", "ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
				ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ЛицевойСчет, РеквизитыЛицевогоСчета, РеквизитыПолучателя, Истина);
				НаименованиеУчастника = РеквизитыПолучателя.ТекстПолучателя;
				ИННУчастника = РеквизитыПолучателя.ИННПолучателя;
				КППУчастника = РеквизитыПолучателя.КПППолучателя;
				
			КонецЕсли;
		ИначеЕсли ВидУчастника = "Покупатель" Тогда
			Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
				НаименованиеУчастника = ГоловнаяОрганизацияНаименование;
				ИННУчастника = ГоловнаяОрганизацияИНН;
				Контрагент = ГоловнаяОрганизация;
			КонецЕсли;
		КонецЕсли;
		СтруктураДанных.АдресЮридический = СведенияОбУчастнике.ЮридическийАдрес;
		СтруктураДанных.АдресФактический = СведенияОбУчастнике.ФактическийАдрес;
		СтруктураДанных.Телефон = СведенияОбУчастнике.Телефоны;
		СтруктураДанных.ЭлектроннаяПочта = СведенияОбУчастнике.ЭлектроннаяПочта;
	Иначе
		Если ЗначениеЗаполнено(Участник.ЮридическоеФизическоеЛицо.ОГРНИП) ИЛИ ЗначениеЗаполнено(Участник.ЮридическоеФизическоеЛицо.СвидетельствоСерияНомер) Тогда
			ИННУчастника = СведенияОбУчастнике.ИНН;
			КППУчастника = "";
			Если ЗначениеЗаполнено(Участник.НаименованиеСокращенное) Тогда
				НаименованиеУчастника = Участник.НаименованиеСокращенное;
			Иначе	
				НаименованиеУчастника = СтрШаблон("ИП %1 %2 %3", СведенияОбУчастнике.Фамилия, СведенияОбУчастнике.Имя, СведенияОбУчастнике.Отчество);
			КонецЕсли;
		Иначе
			ИННУчастника = СведенияОбУчастнике.ИНН;
			КППУчастника = "";
			Если ЗначениеЗаполнено(Участник.Наименование) Тогда
				НаименованиеУчастника = Участник.Наименование;
			Иначе	
				НаименованиеУчастника = СтрШаблон("%1 %2 %3", СведенияОбУчастнике.Фамилия, СведенияОбУчастнике.Имя, СведенияОбУчастнике.Отчество);
			КонецЕсли;
		КонецЕсли;
		СтруктураДанных.Телефон = СведенияОбУчастнике.Телефоны;
		СтруктураДанных.ЭлектроннаяПочта = СведенияОбУчастнике.ЭлектроннаяПочта;
	КонецЕсли;	

	СтруктураДанных.ИНН = ИННУчастника;
	СтруктураДанных.КПП = КППУчастника;
	СтруктураДанных.Наименование = НаименованиеУчастника;
		
	Если ЛицевойСчет <> Неопределено Тогда
		
		ЗаполнитьРеквизитыЛицевогоСчета(ЛицевойСчет, РеквизитыЛицевогоСчета);
		
		РасчетныеРеквизиты = Новый Структура("ИННПолучателя, КПППолучателя, ТекстПолучателя, НомерСчетаПолучателя, НаименованиеБанкаПолучателя, БикБанкаПолучателя, СчетБанкаПолучателя", "ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
	    ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ЛицевойСчет, РеквизитыЛицевогоСчета, РасчетныеРеквизиты);
		
		ТекстБанка = "";
		НомерСчета = "";
		ТекстБанка = РасчетныеРеквизиты.НаименованиеБанкаПолучателя;
		Если НЕ ЗначениеЗаполнено(РеквизитыЛицевогоСчета) Тогда
			РасчетныеРеквизиты.НомерСчетаПолучателя = СокрЛП(ЛицевойСчет.Код);
			Если ТипЗнч(ЛицевойСчет) = Тип("СправочникСсылка.БанковскиеИКазначейскиеСчета") Тогда
				Если ТипЗнч(ЛицевойСчет.КассовыйОрган) = Тип("СправочникСсылка.Банки") Тогда
					ТекстБанка = ЛицевойСчет.КассовыйОрган.Наименование;
					РасчетныеРеквизиты.БикБанкаПолучателя = СокрЛП(ЛицевойСчет.КассовыйОрган.Код);
					НомерСчета = СокрЛП(РасчетныеРеквизиты.НомерСчетаПолучателя);
				ИначеЕсли ТипЗнч(ЛицевойСчет.КассовыйОрган) = Тип("СправочникСсылка.Казначейства") Тогда	
					ТекстБанка = ЛицевойСчет.СчетКазначейства.КассовыйОрган.Наименование + " " + ЛицевойСчет.СчетКазначейства.КассовыйОрган.Город + ", Казначейство: " +
					ЛицевойСчет.КассовыйОрган.Наименование + " ("+ЛицевойСчет.Владелец.НаименованиеСокращенное+", л/с "+ СокрЛП(ЛицевойСчет.Код)+")";
					РасчетныеРеквизиты.БикБанкаПолучателя = ЛицевойСчет.СчетКазначейства.КассовыйОрган.Код;
					НомерСчета = СокрЛП(ЛицевойСчет.СчетКазначейства.Код);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ТекстБанка = РасчетныеРеквизиты.НаименованиеБанкаПолучателя;
			РасчетныеРеквизиты.БикБанкаПолучателя = РасчетныеРеквизиты.БикБанкаПолучателя;
			НомерСчета = РасчетныеРеквизиты.НомерСчетаПолучателя;
		КонецЕсли;
		
		СтруктураДанных.НомерСчета = НомерСчета; 
		СтруктураДанных.НаименованиеБанка = ТекстБанка; 
		СтруктураДанных.БИК = РасчетныеРеквизиты.БикБанкаПолучателя; 
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыЛицевогоСчета(ЛицевойСчет, РеквизитыЛицевогоСчета)
	Если Не ЗначениеЗаполнено(РеквизитыЛицевогоСчета) И ЗначениеЗаполнено(ЛицевойСчет) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	РеквизитыЛицевыхСчетов.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
		               |ГДЕ
		               |	РеквизитыЛицевыхСчетов.Владелец = &ЛицевойСчет
		               |	И РеквизитыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			РеквизитыЛицевогоСчета = Выборка.Ссылка;	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

// Формирует идентификатор платежа для Яндекс.Кассы.
//
// Параметры:
// НомерДокумента - Строка - Номер документа (не более 6 символов)
// Ссылочный идентификатор - Строка - Ссылочный идентификатор документа (16 символов)
//
// Возвращаемое значение:
// Строка - Идентификатор платежа
//
Функция ИдентификаторПлатежа(Знач НомерДокумента, СсылочныйИдентификатор)
	
	НомерДокумента = Прав("000000" + НомерДокумента, 6);
	
	Возврат СтрШаблон("СЧ%1-%2", НомерДокумента, СсылочныйИдентификатор);
	
КонецФункции

Функция НомерДляПечати(ДокументСсылка, ДокументНомер)
	
	Возврат РегистрыСведений.НастройкиПечатиПрефиксаНомера.ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(
		ДокументСсылка, ДокументНомер);
	
КонецФункции

Процедура ЗаполнитьКонтактнуюИнформациюОснованияПлатежа(ОснованиеПлатежа, КонтактнаяИнформация) Экспорт
	
	РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеПлатежа, "Контрагент, Дата");
	
	СведенияОКонтрагенте = Новый Структура;
	ЗаполнитьДанныеУчастникаСчетаНаОплату(РеквизитыСчета.Контрагент, "Покупатель", РеквизитыСчета.Дата, СведенияОКонтрагенте);
	
	КонтактнаяИнформация.ЭлектроннаяПочта.Добавить(СведенияОКонтрагенте.ЭлектроннаяПочта);
	КонтактнаяИнформация.Телефоны.Добавить(СведенияОКонтрагенте.Телефон);
	
КонецПроцедуры

Процедура ПриФормированииСпискаПолучателейСообщения(ОснованиеПлатежа, ВариантОтправки, Получатели) Экспорт
	
	Если ВариантОтправки = "ЭлектроннаяПочта" Тогда
		РеквизитыСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеПлатежа, "Контрагент, Дата");
		
		СведенияОКонтрагенте = Новый Структура;
		ЗаполнитьДанныеУчастникаСчетаНаОплату(РеквизитыСчета.Контрагент, "Покупатель", РеквизитыСчета.Дата, СведенияОКонтрагенте);
		
		Получатели.Добавить(СведенияОКонтрагенте.ЭлектроннаяПочта);
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправкаЧековЧерезСервисОплаты(Организация) Экспорт
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НастройкиОнлайнОплат.ОтправкаЧековЧерезСервис КАК ОтправкаЧековЧерезЯндекс
	               |ИЗ
	               |	Справочник.НастройкиОнлайнОплат КАК НастройкиОнлайнОплат
	               |ГДЕ
	               |	НастройкиОнлайнОплат.Организация = &Организация
	               |	И НастройкиОнлайнОплат.СДоговором = ИСТИНА
	               |	И НастройкиОнлайнОплат.Недействительна = ЛОЖЬ
	               |	И НастройкиОнлайнОплат.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ОтправкаЧековЧерезЯндекс;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#Область РаботаССервисом

Процедура ПриЗагрузкеОперацийПоЮКассе(Операции, Результат, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура;
	Результат.Вставить("КоличествоЗагруженыхОпераций", 0);
	Результат.Вставить("КоличествоНезагруженыхОпераций", 0);
	
	ОперацииКЗагрузке = НеучтенныеОперации(Операции.ОперацииМассивСтруктур);
	
	Для каждого Операция Из ОперацииКЗагрузке Цикл
		
		Если Операция.ВидОперации = "Оплата" Тогда
			СуммаПереплаты = 0;
			
			ДанныеЗаполнения = Новый Структура;
			ДанныеЗаполнения.Вставить("Дата", Операция.ДатаОплаты);
			ДанныеЗаполнения.Вставить("ВидОперации", Перечисления.ВидыОперацииЭквайринга.ОплатаЧерезСервисПриемаПлатежей);
			ДанныеЗаполнения.Вставить("ПараметрыДоговораЭквайринга", Операция.ПараметрыДоговораЭквайринга);
			ДанныеЗаполнения.Вставить("СуммаДокумента", Операция.СуммаДокумента);
			ДанныеЗаполнения.Вставить("СуммаКомиссииБанка", ?(Операции.СДоговором, Операция.СуммаДокумента - Операция.СуммаКЗачислениюНаСчетОрганизации, 0));
			ДанныеЗаполнения.Вставить("СсылочныйНомер", Операция.ИдентификаторПлатежа);
			
			Счет = СчетНаОплатуПокупателюПоИдентификаторуПлатежа(Операция.ИдентификаторПлатежа);
			
			Если НЕ ЗначениеЗаполнено(Счет) Тогда
				Продолжить; // Загружаются платежи только по имеющимся в базе счетам.
			КонецЕсли;
			
			ДокументОплаты = Документы.ЭквайринговаяОперация.СоздатьДокумент();
			
			ДокументОплаты.Заполнить(Счет);
			ЗаполнитьЗначенияСвойств(ДокументОплаты, ДанныеЗаполнения);
			ДокументОплаты.ДокументОснование = Счет;
			ДокументОплаты.ДокументыЧекаККМ.Очистить();
			
			ПараметрыДоговораЭквайрингаРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОплаты.ПараметрыДоговораЭквайринга,
				"Организация, Эквайер, ДоговорЭквайринга, Подразделение, ИФО, КФО, КБКНазначениеПлатежа, КОСГУНазначениеПлатежа, ЛицевойСчет,
				|ИсточникСредств, СпособОплатыУслугЭквайера, СпособУчетаОбязательств, СчетУчетаЗатрат, КПСУчетаЗатрат, СубконтоЗатрат1,
				|СубконтоЗатрат2, СубконтоЗатрат3, СчетУчетаЗатратНУ, СубконтоЗатратНУ1, СубконтоЗатратНУ2, СубконтоЗатратНУ3, СтавкаНДС");
			ЗаполнитьЗначенияСвойств(ДокументОплаты, ПараметрыДоговораЭквайрингаРеквизиты);
			ДокументОплаты.СтавкаНДС = "";
			
			ДокументОплаты.ВидПервичногоДокумента = НСтр("ru='Отчет платежного сервиса'");
			ДокументОплаты.НомерПервичногоДокумента = "1";
			ДокументОплаты.ДатаПервичногоДокумента = Операция.ДатаОплаты;
			
			ДокументОплаты.ОплатаВыполнена = Истина;
			
			ДокументОплаты.ПробитЧек = ОтправкаЧековЧерезСервисОплаты(ПараметрыДоговораЭквайрингаРеквизиты.Организация);
			ДокументОплаты.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
			
			Счет20531 = БухгалтерскийУчет.СчетПоКоду("205.31", Операция.ДатаОплаты, ПараметрыДоговораЭквайрингаРеквизиты.Организация);
			РеквизитыТиповойОперацииЭО = Новый Структура();
			РеквизитыТиповойОперацииЭО.Вставить("СчетПоступления",			БухгалтерскийУчет.СчетПоКоду("201.23", Операция.ДатаОплаты, ПараметрыДоговораЭквайрингаРеквизиты.Организация));
			РеквизитыТиповойОперацииЭО.Вставить("СчетРасчетовСЭквайером",	БухгалтерскийУчет.СчетПоКоду("302.26", Операция.ДатаОплаты, ПараметрыДоговораЭквайрингаРеквизиты.Организация));
			РеквизитыТиповойОперацииЭО.Вставить("ПроводкиИсполненияПлана",	Истина);
			
			ДокументОплаты.СчетРасчетов = Счет20531;
			
			НовыйДокЧекаККМ = ДокументОплаты.ДокументыЧекаККМ.Добавить();
			НовыйДокЧекаККМ.ДокументОснованиеЧекаККМ = Счет;
			СуммаСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "СуммаДокумента");
			Если (СуммаСчета = Операция.СуммаДокумента) Тогда
				НовыйДокЧекаККМ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
			ИначеЕсли (СуммаСчета < Операция.СуммаДокумента) Тогда
				НовыйДокЧекаККМ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
				СуммаПереплаты = Операция.СуммаДокумента - СуммаСчета;
				ДокументОплаты.СуммаДокумента = СуммаСчета;
			Иначе	
				НовыйДокЧекаККМ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;
			КонецЕсли;
		
			РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
			НастройкиОборудования = ЭквайрингВызовСервера.ПолучитьНастройкиОборудованияЭквайринга(РабочееМесто, ДокументОплаты.Организация);
			ДокументОплаты.ФискальныйРегистратор = НастройкиОборудования.ФР;
			
			Попытка
				ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДокументОплаты));
				ТиповаяОперация = БухгалтерскиеОперацииСервер.ТиповаяОперацияПоУмолчанию(ИдентификаторДокумента);
				
				БухгалтерскиеОперацииСервер.ДобавитьДанныеДляПроведения(
					ДокументОплаты,
					ТиповаяОперация,
					РеквизитыТиповойОперацииЭО);
				
				ДокументОплаты.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru='ИнтеграцияССервисомПриемаПлатежейБГУ.ПриЗагрузкеОперацийПоЮКассе'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.ОбщиеМодули.ИнтеграцияССервисомПриемаПлатежейБГУ,
					,
					НСтр("ru='Ошибка проведения документа ""Эквайринговая операция"" при загрузке операций из ЮКассы'",
						ОбщегоНазначения.КодОсновногоЯзыка()));
						
				ДокументОплаты.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
				ДокументОплаты.Записать();
			КонецПопытки;
			
			Попытка
				СчетДок = Счет.ПолучитьОбъект();
				СчетДок.СчетОплачен = Истина;
				СчетДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru='ИнтеграцияССервисомПриемаПлатежейБГУ.ПриЗагрузкеОперацийПоЮКассе'",
						ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.ОбщиеМодули.ИнтеграцияССервисомПриемаПлатежейБГУ,
					,
					НСтр("ru='Ошибка записи признака ""Счет оплачен"" документа ""Счет на оплату"" при загрузке операций из ЮКассы'",
						ОбщегоНазначения.КодОсновногоЯзыка()));
						
				СчетДок.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
				СчетДок.Записать();
			КонецПопытки;
			
			Результат.КоличествоЗагруженыхОпераций = Результат.КоличествоЗагруженыхОпераций + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция НеучтенныеОперации(Операции)
	
	НеучтеныеОперации = Новый Массив;
	
	ИдентификаторыПлатежей = Новый Массив;
	Для каждого Операция Из Операции Цикл
		ИдентификаторыПлатежей.Добавить(Операция.ИдентификаторПлатежа);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчтенныеОперации.СсылочныйНомер КАК ИдентификаторПлатежа
	|ИЗ
	|	Документ.ЭквайринговаяОперация КАК УчтенныеОперации
	|ГДЕ
	|	УчтенныеОперации.СсылочныйНомер В(&ИдентификаторыПлатежей)";
	Запрос.УстановитьПараметр("ИдентификаторыПлатежей", ИдентификаторыПлатежей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УчтенныеПлатежи = Новый Массив;
	УчтенныеПлатежи = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ИдентификаторПлатежа");
	
	Для каждого Операция Из Операции Цикл
		
		Если УчтенныеПлатежи.Найти(Операция.ИдентификаторПлатежа) = Неопределено Тогда
			НеучтеныеОперации.Добавить(Операция);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НеучтеныеОперации;
	
КонецФункции

// Возвращает ссылку на документ "Счет на оплату покупателю" по идентификатору
// платежа. Если документ по указанному идентификатору не найден, возвращается
// Неопределено.
//
// Параметры:
// ИдентификаторПлатежа - Строка - Идентификатор платежа.
//
// Возвращаемое значение:
// ДокументСсылка.СчетНаОплатуПокупателю - ссылка на найденный документ.
// Неопределено - если документ не найден.
//
Функция СчетНаОплатуПокупателюПоИдентификаторуПлатежа(ИдентификаторПлатежа) 
	
	Счет = Неопределено;
	
	ПрефиксДокумента = Лев(ИдентификаторПлатежа, 2);
	СсылочныйИдентификатор = СсылочныйИдентификаторПлатежа(ИдентификаторПлатежа);
	
	Если ПрефиксДокумента = "СЧ" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплату КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.СсылочныйИдентификаторСервисаПриемаПлатежей = &СсылочныйИдентификатор";
		Запрос.УстановитьПараметр("СсылочныйИдентификатор", СсылочныйИдентификатор);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Счет = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Счет;
	
КонецФункции

// Выделяет ссылочный номер из идентификатора платежа.
//
// Параметры:
// ИдентификаторПлатежа - Строка - Идентификатор платежа
//
// Возвращаемое значение:
// Строка - Ссылочный номер
//
Функция СсылочныйИдентификаторПлатежа(ИдентификаторПлатежа)
	
	Возврат Прав(ИдентификаторПлатежа, 16);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ИнтеграцияССБП

#Область ПрограммныйИнтерфейс

#Область НастройкиИнтеграции

Процедура ПриОпределенииНастроекПодключения(Настройки) Экспорт
	
	Настройки.c2b.ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемами;
	
КонецПроцедуры

Процедура ПриЗаписиНастроекПодключения(ПараметрыОплаты, Отказ, СообщениеОбОшибке) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемами");
		ЭлементБлокировки.УстановитьЗначение("Организация"					, ПараметрыОплаты.c2b.Получить("Организация")); 
		ЭлементБлокировки.УстановитьЗначение("ПараметрыДоговораЭквайринга"	, ПараметрыОплаты.c2b.Получить("ПараметрыДоговораЭквайринга"));
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Если ЗначениеЗаполнено(ПараметрыОплаты.c2b.Получить("ТорговаяТочка")) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	НастройкиИнтеграцииСПлатежнымиСистемами.Организация КАК Организация,
			|	НастройкиИнтеграцииСПлатежнымиСистемами.ПараметрыДоговораЭквайринга КАК ПараметрыДоговораЭквайринга
			|ИЗ
			|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемами КАК НастройкиИнтеграцииСПлатежнымиСистемами
			|ГДЕ
			|	НастройкиИнтеграцииСПлатежнымиСистемами.ТорговаяТочка = &ТорговаяТочка";
			
			Запрос.УстановитьПараметр("ТорговаяТочка", ПараметрыОплаты.c2b.Получить("ТорговаяТочка"));
			
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Набор = РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемами.СоздатьНаборЗаписей();
				Набор.Отбор.Организация.Установить(ВыборкаДетальныеЗаписи.Организация);
				Набор.Отбор.ПараметрыДоговораЭквайринга.Установить(ВыборкаДетальныеЗаписи.ПараметрыДоговораЭквайринга);
				Набор.Записать();
			КонецЦикла;
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле
		|ИЗ
		|	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемами КАК НастройкиИнтеграцииСПлатежнымиСистемами
		|ГДЕ
		|	НастройкиИнтеграцииСПлатежнымиСистемами.Организация = &Организация
		|	И НастройкиИнтеграцииСПлатежнымиСистемами.ТорговаяТочка <> &ТорговаяТочка
		|	И НастройкиИнтеграцииСПлатежнымиСистемами.ПараметрыДоговораЭквайринга = &ПараметрыДоговораЭквайринга";
		
		Запрос.УстановитьПараметр("Организация"					, ПараметрыОплаты.c2b.Получить("Организация")); 
		Запрос.УстановитьПараметр("ПараметрыДоговораЭквайринга"	, ПараметрыОплаты.c2b.Получить("ПараметрыДоговораЭквайринга"));
		Запрос.УстановитьПараметр("ТорговаяТочка"				, ПараметрыОплаты.c2b.Получить("ТорговаяТочка"));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ             = Истина;
			СообщениеОбОшибке = НСтр("ru = 'Для организации уже задана настройка интеграции.'");
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
		Запись = РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемами.СоздатьМенеджерЗаписи();
		Запись.ТорговаяТочка 				= ПараметрыОплаты.c2b.Получить("ТорговаяТочка");
		Запись.ПараметрыДоговораЭквайринга 	= ПараметрыОплаты.c2b.Получить("ПараметрыДоговораЭквайринга");
		Запись.Организация   				= ПараметрыОплаты.c2b.Получить("Организация");
		
		Запись.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Настройка интеграции с платежными системами'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.НастройкиИнтеграцииСПлатежнымиСистемами,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = Истина;
		СообщениеОбОшибке = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПрикладныеОперации

Процедура ПриФормированииЗаказаНаОплатуСБП(ДокументОплаты, ЗаказНаОплату, НастройкаПодключения, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОплаты) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.СчетНаОплату") И ТипЗнч(ДокументОплаты) <> Тип("ДокументСсылка.ЧекККМ") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОплаты, "СуммаДокумента, Дата");
	ЗаказНаОплату.СуммаОплаты 					= ДанныеДокумента.СуммаДокумента;
	ЗаказНаОплату.ДатаОплаты  					= ДанныеДокумента.Дата;
	ЗаказНаОплату.НазначениеПлатежа 			= "";
	ЗаказНаОплату.ОтложенноеПолучениеСтатуса 	= Ложь;
	
КонецПроцедуры

Процедура ПриФормированииЗаказаНаВозвратСБП(ДокументВозврата, ЗаказНаВозврат, НастройкаПодключения, ДополнительныеПараметры) Экспорт 

	Если Не ЗначениеЗаполнено(ДокументВозврата) Тогда
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ДокументВозврата) <> Тип("ДокументСсылка.ЧекККМНаВозврат") Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументВозврата,"СуммаДокумента, Дата");
    ЗаказНаВозврат.ДатаВозврата  = РеквизитыДокумента.Дата;
    ЗаказНаВозврат.СуммаВозврата = РеквизитыДокумента.СуммаДокумента;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НастройкиИнтеграцииСБП(Организация, ПараметрыДоговораЭквайринга) Экспорт
	
	Настройки = Новый Структура("ИнтеграцияДоступна, Настройка");
	Настройки.ИнтеграцияДоступна = Ложь;
	
	Если (Не ЗначениеЗаполнено(Организация)) Или (Не ЗначениеЗаполнено(ПараметрыДоговораЭквайринга)) Тогда
		Возврат Настройки;
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	НастройкиИнтеграцииСПлатежнымиСистемами.ТорговаяТочка КАК ТорговаяТочка
	               |ИЗ
	               |	РегистрСведений.НастройкиИнтеграцииСПлатежнымиСистемами КАК НастройкиИнтеграцииСПлатежнымиСистемами
	               |ГДЕ
	               |	НастройкиИнтеграцииСПлатежнымиСистемами.Организация = &Организация
	               |	И НастройкиИнтеграцииСПлатежнымиСистемами.ПараметрыДоговораЭквайринга = &ПараметрыДоговораЭквайринга"; 
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("ПараметрыДоговораЭквайринга"	, ПараметрыДоговораЭквайринга);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Настройки.ИнтеграцияДоступна 	= Истина;
		Настройки.Настройка 			= РезультатЗапроса.ТорговаяТочка;
	КонецЕсли;	
	
	Возврат Настройки;
	
КонецФункции

#Область ПрикладныеОперации

Функция ИдентификаторОплатыВПлатежнойСистемеСБП(ПараметрыПроцедуры) Экспорт
	
	ЗаказНаОплату = Новый Структура("СуммаОплаты, ДатаОплаты, СрокЖизниQRКода, ОтложенноеПолучениеСтатуса, НазначениеПлатежа");
	ПереводыСБПc2bПереопределяемый.ПриФормированииЗаказаНаОплатуСБП(ПараметрыПроцедуры.ДокументОплаты, ЗаказНаОплату, ПараметрыПроцедуры.НастройкаИнтеграции, Неопределено);
	РезультатОперации = ПереводыСБПc2b.ДинамическаяСсылка(ПараметрыПроцедуры.ДокументОплаты, ПараметрыПроцедуры.НастройкаИнтеграции);
	Возврат РезультатОперации;
	
КонецФункции

Функция СоздатьЭквайринговуюОперациюПриЗагрузкеИзСБП(Операция) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);    
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"						, Операция.ДатаОплаты);
	ДанныеЗаполнения.Вставить("ВидОперации"					, Операция.ВидОперации);
	ДанныеЗаполнения.Вставить("ПараметрыДоговораЭквайринга"	, Операция.ПараметрыДоговораЭквайринга);
	ДанныеЗаполнения.Вставить("СуммаДокумента"				, Операция.СуммаДокумента);
		
	Счет = Операция.Счет;
	ДокументОплаты = Документы.ЭквайринговаяОперация.СоздатьДокумент();
	
	ДокументОплаты.Заполнить(Счет);
	ЗаполнитьЗначенияСвойств(ДокументОплаты, ДанныеЗаполнения);
	ДокументОплаты.ДокументОснование = Счет;
	ДокументОплаты.ДокументыЧекаККМ.Очистить();
	
	ПараметрыДоговораЭквайрингаРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОплаты.ПараметрыДоговораЭквайринга,
	"Организация, Эквайер, ДоговорЭквайринга, Подразделение, ИФО, КФО, КБКНазначениеПлатежа, КОСГУНазначениеПлатежа, ЛицевойСчет,
	|ИсточникСредств, СпособОплатыУслугЭквайера, СпособУчетаОбязательств, СчетУчетаЗатрат, КПСУчетаЗатрат, СубконтоЗатрат1,
	|СубконтоЗатрат2, СубконтоЗатрат3, СчетУчетаЗатратНУ, СубконтоЗатратНУ1, СубконтоЗатратНУ2, СубконтоЗатратНУ3, СтавкаНДС");
	ЗаполнитьЗначенияСвойств(ДокументОплаты, ПараметрыДоговораЭквайрингаРеквизиты);
	
	ДокументОплаты.ВидПервичногоДокумента = НСтр("ru='Отчет сервиса СБП'");
	ДокументОплаты.НомерПервичногоДокумента = "1";
	ДокументОплаты.ДатаПервичногоДокумента = Операция.ДатаОплаты;
	
	ДокументОплаты.ОплатаВыполнена = Истина;
	
	ДокументОплаты.ПробитЧек = Ложь;
	ДокументОплаты.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств;
	
	Счет20531 = БухгалтерскийУчет.СчетПоКоду("205.31", Операция.ДатаОплаты, ПараметрыДоговораЭквайрингаРеквизиты.Организация);
	РеквизитыТиповойОперацииЭО = Новый Структура();
	РеквизитыТиповойОперацииЭО.Вставить("СчетПоступления",			БухгалтерскийУчет.СчетПоКоду("201.23", Операция.ДатаОплаты, ПараметрыДоговораЭквайрингаРеквизиты.Организация));
	РеквизитыТиповойОперацииЭО.Вставить("СчетРасчетовСЭквайером",	БухгалтерскийУчет.СчетПоКоду("302.26", Операция.ДатаОплаты, ПараметрыДоговораЭквайрингаРеквизиты.Организация));
	РеквизитыТиповойОперацииЭО.Вставить("ПроводкиИсполненияПлана",	Истина);
	
	ДокументОплаты.СчетРасчетов = Счет20531;
	
	НовыйДокЧекаККМ = ДокументОплаты.ДокументыЧекаККМ.Добавить();
	НовыйДокЧекаККМ.ДокументОснованиеЧекаККМ = Счет;
	СуммаСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Счет, "СуммаДокумента");
	НовыйДокЧекаККМ.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
	
	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	НастройкиОборудования = ЭквайрингВызовСервера.ПолучитьНастройкиОборудованияЭквайринга(РабочееМесто, ДокументОплаты.Организация);
	ДокументОплаты.ФискальныйРегистратор = НастройкиОборудования.ФР;
	ДокументОплаты.Комментарий = НСтр("ru='Оплата через СБП'");
	
	Если ПараметрыДоговораЭквайрингаРеквизиты.СпособОплатыУслугЭквайера = Перечисления.СпособыОплатыУслугЭквайринга.КомиссияУдерживаетсяПриПроведенииПлатежа Тогда 
		ДанныеВидаКартыДоговораЭквайринга = ЭквайрингВызовСервера.ПолучитьДанныеВидаКартыДоговораЭквайринга(ДокументОплаты.ПараметрыДоговораЭквайринга);
		Если ДанныеВидаКартыДоговораЭквайринга <> Неопределено Тогда 
			ПроцентТорговойУступки 	= ДанныеВидаКартыДоговораЭквайринга.ПроцентТорговойУступки;
			СуммаКомиссииБанка 		= ДокументОплаты.СуммаДокумента / 100 * ПроцентТорговойУступки;
			ДокументОплаты.ПроцентКомиссииБанка = ПроцентТорговойУступки;
			ДокументОплаты.СуммаКомиссииБанка 	= СуммаКомиссииБанка;
		КонецЕсли;	
	КонецЕсли;	
	
	Попытка
		ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДокументОплаты));
		ТиповаяОперация = БухгалтерскиеОперацииСервер.ТиповаяОперацияПоУмолчанию(ИдентификаторДокумента);
		
		БухгалтерскиеОперацииСервер.ДобавитьДанныеДляПроведения(
		ДокументОплаты,
		ТиповаяОперация,
		РеквизитыТиповойОперацииЭО);
		
		ДокументОплаты.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='ИнтеграцияССервисомПриемаПлатежейБГУ.СоздатьЭквайринговуюОперациюПриЗагрузкеИзСБП'",
		ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.ОбщиеМодули.ИнтеграцияССервисомПриемаПлатежейБГУ,
		,
		НСтр("ru='Ошибка проведения документа ""Эквайринговая операция"" при загрузке операций из СБП'",
		ОбщегоНазначения.КодОсновногоЯзыка()));
		
		ДокументОплаты.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		ДокументОплаты.Записать();
	КонецПопытки;
	
	Попытка
		СчетДок = Счет.ПолучитьОбъект();
		СчетДок.СчетОплачен = Истина;
		СчетДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='ИнтеграцияССервисомПриемаПлатежейБГУ.СоздатьЭквайринговуюОперациюПриЗагрузкеИзСБП'",
		ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.ОбщиеМодули.ИнтеграцияССервисомПриемаПлатежейБГУ,
		,
		НСтр("ru='Ошибка записи признака ""Счет оплачен"" документа ""Счет на оплату"" при загрузке операций из СБП'",
		ОбщегоНазначения.КодОсновногоЯзыка()));
		
		СчетДок.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		СчетДок.Записать();
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ДокументОплаты.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗагрузитьОперацииПоЯндексКассеВФоне", Истина);
КонецПроцедуры

#КонецОбласти