
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Параметры.ВидОтчета;
	ПравилоЗаполнения = Параметры.ПравилоЗаполнения;
	Событие = Параметры.Событие;
	
	Если Параметры.Свойство("РеквизитыДокумента") И ЗначениеЗаполнено(Параметры.РеквизитыДокумента) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данный метод нельзя выполнять из формы документа.'"));
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	// Заполнение списков выбора
	СоответствиеКолонок = Новый Соответствие;
	
	ТипКЭК = Новый ОписаниеТипов("СправочникСсылка.КОСГУ");
	
	ТаблицаКарт = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(ПравилоЗаполнения);
	Для каждого СтрокаТаблицы Из ТаблицаКарт Цикл
		
		Представление = СтрокаТаблицы.Ключ;
		
		ТаблицаДанных = СтрокаТаблицы.Значение;
		
		СписокКолонок = Новый СписокЗначений;
		
		Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
			
			Для каждого КолонкаТаблицы Из ТаблицаДанных.Колонки Цикл
				
				Если КолонкаТаблицы.ТипЗначения = ТипКЭК Тогда
					
					СписокКолонок.Добавить(КолонкаТаблицы.Имя);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если СписокКолонок.Количество() <> 0 Тогда
			
			СоответствиеКолонок.Вставить(Представление, СписокКолонок);
			Элементы.ТаблицаКартДанныхКартаДанных.СписокВыбора.Добавить(Представление);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураКартДанных = Новый ФиксированноеСоответствие(СоответствиеКолонок);
	
	// Заполнение значений параметров
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыМетода) Тогда
		
		ЗначениеПараметра = Неопределено;
		Если ПараметрыМетода.Свойство("ТаблицаКартДанных",ЗначениеПараметра) Тогда
			Для каждого СтрокаТаблицы Из ЗначениеПараметра Цикл
				НоваяСтрока = ТаблицаКартДанных.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого СтрокаТаблицы Из ТаблицаКартДанных Цикл
		
		ИндексСтроки = ТаблицаКартДанных.Индекс(СтрокаТаблицы);
		Если ПустаяСтрока(СтрокаТаблицы.КартаДанных) Тогда
			
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение не задано'"), , "ТаблицаКартДанных["+ИндексСтроки+"].КартаДанных");
			
		КонецЕсли;
		
		Если ПустаяСтрока(СтрокаТаблицы.КолонкаКЭК) Тогда
			
			Отказ = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение не задано'"), , "ТаблицаКартДанных["+ИндексСтроки+"].КолонкаКЭК");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");

	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ТаблицаКартДанных

&НаКлиенте
Процедура ТаблицаКартДанныхКартаДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных = ВыбранноеЗначение;
	
	ТипКЭК = Новый ОписаниеТипов("СправочникСсылка.КОСГУ");
	
	СписокКолонок = СтруктураКартДанных.Получить(Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных);
	
	ДоступнаяКолонка = СписокКолонок.НайтиПоЗначению(Элементы.ТаблицаКартДанных.ТекущиеДанные.КолонкаКЭК);
	Если ДоступнаяКолонка = Неопределено Тогда
		
		Колонка = Неопределено;
		Если СписокКолонок.Количество() = 1 Тогда
			
			Колонка = СписокКолонок[0].Значение;
			
		КонецЕсли;
		
		Элементы.ТаблицаКартДанных.ТекущиеДанные.КолонкаКЭК = Колонка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКартДанныхКолонкаКЭКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	СписокКолонок = СтруктураКартДанных.Получить(Элементы.ТаблицаКартДанных.ТекущиеДанные.КартаДанных);
	Если СписокКолонок <> Неопределено Тогда
		Для каждого ЭлементСписка Из СписокКолонок Цикл
			ДанныеВыбора.Добавить(ЭлементСписка.Значение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКартДанныхОтборКЭКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.ТаблицаКартДанных.ТекущиеДанные.ОтборКЭК.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.КОСГУ");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = СохранитьПараметры();
	
	Если СтруктураВозврата <> Неопределено Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт
	
	Возврат СохранитьПараметры(); 
	
КонецФункции


&НаКлиенте
Функция СохранитьПараметры()
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		ТЗ = РеквизитФормыВЗначение("ТаблицаКартДанных");
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТаблицаКартДанных", ТЗ);
		
		ПредставлениеПараметров();
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров()
	
	ПредставлениеПараметров = "Карты данных: (";
	
	ДобавлятьЗапятую = Ложь;
	Для каждого СтрокаТаблицы Из ТаблицаКартДанных Цикл
		
		ПредставлениеПараметров = ПредставлениеПараметров + ?(ДобавлятьЗапятую, ",", "") + СтрокаТаблицы.КартаДанных;
		ДобавлятьЗапятую = Истина;
		
	КонецЦикла;
	
	ПредставлениеПараметров = ПредставлениеПараметров + ")";
	
КонецПроцедуры
