#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеОтчетыИОбработкиКлиент.ОткрытьФормуКомандДополнительныхОтчетовИОбработок(
		ПараметрКоманды,
		ПараметрыВыполненияКоманды,
		ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка(),
		ИмяРаздела());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИмяРаздела()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ПоддержкаИнтерфейсаВерсия82") Тогда
		Возврат "ПланированиеИСанкционирование";
	Иначе
		Возврат "ТаксиПланированиеИСанкционирование";
	КонецЕсли;
	
КонецФункции

#КонецОбласти