#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
// для вызова из других подсистем

Функция ДенежноеОбязательствоПоДокументуТМЦ(ДокументТМЦ) Экспорт 
	
	ДокДО = ПредопределенноеЗначение("Документ.СведенияОДенежномОбязательстве.ПустаяСсылка");
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СведенияОДенежномОбязательстве.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.СведенияОДенежномОбязательстве КАК СведенияОДенежномОбязательстве
	|ГДЕ
	|	СведенияОДенежномОбязательстве.ПодтверждающийДокумент = &ПодтверждающийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	СведенияОДенежномОбязательстве.МоментВремени УБЫВ");
	
	Запрос.УстановитьПараметр("ПодтверждающийДокумент", ДокументТМЦ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокДО = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ДокДО;
	
КонецФункции	

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции       

// Возвращает массив структур, содержащих значения реквизитов документа для выгрузки
//
// Параметры:
// МассивОбъектов               - Массив объектов данного вида
// ИспользоватьДопКл            - Признак применения доп. классификации и указании ее значений в структурах реквизитов документов
// ИспользоватьКодМероприятия   - Признак применения кодов мероприятий
// ИспользоватьКЭК              - Признак использования КЭК
// ИспользоватьАналитическийКод - Признак использования аналитического кода
// ИспользоватьКФО              - Признак применения КФО и указания значений КФО в структурах реквизитов документа
// ИспользоватьКОСГУПолучателя  - Признак использования КОСГУПолучателя
Функция ЗначенияРеквизитовДокумента(МассивОбъектов, ИспользоватьДопКл = Ложь, ИспользоватьКодМероприятия = Ложь, ИспользоватьКЭК = Ложь, ИспользоватьАналитическийКод = Ложь, ИспользоватьКФО = Ложь, ИспользоватьКОСГУПолучателя = Ложь) Экспорт  
	
	Возврат ПлатежноРасчетныеДокументы.ЗначенияРеквизитовСведенияОДенежномОбязательстве(МассивОбъектов);
	
КонецФункции

#КонецОбласти   

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоПодтверждающемуДокументу(ДанныеЗаполнения, Объект) Экспорт
	
	// Ищем предыдущий документ "Сведения о денежном обязательстве"
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	СведенияОДенежномОбязательстве.Ссылка,
	|	СведенияОДенежномОбязательстве.ЛицевойСчет,
	|	СведенияОДенежномОбязательстве.РеквизитыЛицевогоСчета,
	|	СведенияОДенежномОбязательстве.ИсточникСредств,
	|	СведенияОДенежномОбязательстве.ОрганКазначейства,
	|	СведенияОДенежномОбязательстве.УчетныйНомер,
	|	СведенияОДенежномОбязательстве.ОбъектФАИП,
	|	СведенияОДенежномОбязательстве.Организация
	|ИЗ
	|	Документ.СведенияОДенежномОбязательстве КАК СведенияОДенежномОбязательстве
	|ГДЕ
	|	СведенияОДенежномОбязательстве.ПометкаУдаления = ЛОЖЬ
	|	И СведенияОДенежномОбязательстве.ПодтверждающийДокумент В(&ПодтверждающийДокумент)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СведенияОДенежномОбязательстве.Дата УБЫВ");
	
	
	ПодтверждающийДокумент = Новый Массив;
	ПодтверждающийДокумент.Добавить(ДанныеЗаполнения);
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		ПодтверждающийДокумент.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ЗаявлениеНаВыдачуАванса"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПодтверждающийДокумент", ПодтверждающийДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Объект.ПодтверждающийДокумент = ДанныеЗаполнения; 

	Если Выборка.Следующий() Тогда
		// По подтверждающему документу уже формировались сведения
		ЗаполнитьЗначенияСвойств(Объект, Выборка);
	Иначе 
		СтрокаЗаполнения = "Организация";
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("РеквизитыЛицевогоСчета", ДанныеЗаполнения.Метаданные()) Тогда
			СтрокаЗаполнения = СтрокаЗаполнения + ",РеквизитыЛицевогоСчета";
		КонецЕсли;
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ЛицевойСчет", ДанныеЗаполнения.Метаданные()) Тогда
			СтрокаЗаполнения = СтрокаЗаполнения + ",ЛицевойСчет";
		КонецЕсли;  
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ОрганКазначейства", ДанныеЗаполнения.Метаданные()) Тогда
			СтрокаЗаполнения = СтрокаЗаполнения + ",ОрганКазначейства";
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект, ДанныеЗаполнения, СтрокаЗаполнения);  
		
		Если ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) И НЕ ЗначениеЗаполнено(Объект.ОрганКазначейства) Тогда
			Объект.ОрганКазначейства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти  

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СведенияОДенежномОбязательстве";
	КомандаПечати.Идентификатор		= "ПФ_MXL_СведенияДО_02_11_09_2469";
	КомандаПечати.Представление		= НСтр("ru = 'Сведения о денежном обязательстве (письмо от 19.01.2026 № 02-11-09/2469)'");
	КомандаПечати.Порядок			= 1; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СведенияОДенежномОбязательстве";
	КомандаПечати.Идентификатор		= "ПФ_MXL_СведенияДО";
	КомандаПечати.Представление		= НСтр("ru = 'Сведения о денежном обязательстве (письмо от 12.01.2021 N 09-01-09/563)'");
	КомандаПечати.Порядок			= 2;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.СведенияОДенежномОбязательстве";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0506102";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Сведения о денежном обязательстве (ф. 0506102)'");
	КомандаПечати.Порядок			= 100;
    	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СведенияДО_02_11_09_2469") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ПФ_MXL_СведенияДО_02_11_09_2469",
		"Сведения о денежном обязательстве", ПечатьСведенийДО(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_СведенияДО_02_11_09_2469"));

	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СведенияДО") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ПФ_MXL_СведенияДО",
		"Сведения о денежном обязательстве", ПечатьСведенийДО(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_СведенияДО"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0506102") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ПФ_MXL_Форма0506102",
		"Сведения о денежном обязательстве", ПечатьСведенийДО(МассивОбъектов, ОбъектыПечати));
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

Функция ПечатьСведенийДО(МассивОбъектов, ОбъектыПечати, ИмяМакета = "ПФ_MXL_Форма0506102")
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы 					= ?(ИмяМакета = "ПФ_MXL_СведенияДО_02_11_09_2469", ОриентацияСтраницы.Ландшафт, ОриентацияСтраницы.Портрет);
	ТабДокумент.АвтоМасштаб 						= Истина; 
	ТабДокумент.НижнийКолонтитул.Выводить 			= Истина;
	ТабДокумент.НижнийКолонтитул.НачальнаяСтраница  = 1;
	ТабДокумент.ПолеСнизу 							= 12;
	ТабДокумент.РазмерКолонтитулаСнизу 				= 12;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СведенияОДенежномОбязательстве_СведенияОДенежномОбязательстве" + ИмяМакета;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СведенияОДенежномОбязательстве." + ИмяМакета);
	
	ДанныеДляПечатиМассив = ПлатежноРасчетныеДокументы.ЗначенияРеквизитовСведенияОДенежномОбязательстве(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеДляПечати Из ДанныеДляПечатиМассив Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// вывод в табличный документ
		ОбластьВывода = Макет.ПолучитьОбласть("Шапка");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		
		ТабДокумент.Вывести(ОбластьВывода);
		
		ОбластьВывода = Макет.ПолучитьОбласть("ШапкаРасшифровка");
		
		ТабДокумент.Вывести(ОбластьВывода);
		
		Для Каждого СтрДанных Из ДанныеДляПечати.РасшифровкаДокумента Цикл
			
			ОбластьВывода = Макет.ПолучитьОбласть("СтрРасшифровка");
			ОбластьВывода.Параметры.Заполнить(СтрДанных);
			
			ТабДокумент.Вывести(ОбластьВывода);
			
		КонецЦикла;
		
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		
		ТабДокумент.Вывести(ОбластьВывода);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли
