
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Адрес = Неопределено;
	
	Если Параметры.Свойство("Адрес", Адрес) Тогда
		РезультатыПроверки = ПолучитьИзВременногоХранилища(Адрес);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	ПредставлениеДокумента = "";
	
	Параметры.Свойство("ПредставлениеДокумента", ПредставлениеДокумента);
	
	НастроитьФорму(РезультатыПроверки, ПредставлениеДокумента);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЭлементУсловногоОформления(ИмяКолонки)
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
			
	ОтборУФ = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборУФ.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборУФ.Использование = Истина;
	ОтборУФ.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РезультатПроверки."+ИмяКолонки);
	ОтборУФ.ПравоеЗначение = 0;
			
	ЭлементУФ.Оформление.Элементы.Найти("ЦветТекста").Значение = Новый Цвет(255,0,0);
	ЭлементУФ.Оформление.Элементы.Найти("ЦветТекста").Использование = Истина;
	ЭлементУФ.Оформление.Элементы.Найти("Шрифт").Значение = Новый Шрифт(,,Истина);
	ЭлементУФ.Оформление.Элементы.Найти("Шрифт").Использование = Истина;
			
	ПолеУФ = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеУФ.Использование = Истина;
	ПолеУФ.Поле = Новый ПолеКомпоновкиДанных(ИмяКолонки);
			
	ЭлементУФ.Использование = Истина;	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму(РезультатыПроверки, ПредставлениеДокумента)
	КолонкиАналитик = Новый Массив;
	КолонкиСумм = Новый Массив;
	ДобавляемыеРеквизиты = Новый Массив;
	
	Для Каждого Колонка Из РезультатыПроверки.Колонки Цикл
		Если Найти(Колонка.Имя, "остаток") > 0 Тогда
			КолонкиСумм.Добавить(Колонка.Имя);
		Иначе
			КолонкиАналитик.Добавить(Колонка.Имя);
		КонецЕсли;
		
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "РезультатПроверки"));
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЗначениеВРеквизитФормы(РезультатыПроверки, "РезультатПроверки");
	
	Индекс = 0;
	
	Для Каждого Колонка Из РезультатыПроверки.Колонки Цикл
		Если Найти(Колонка.Имя, "Конечный_остаток") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(Колонка.Имя, "Текущий_остаток") > 0 Тогда
			ГруппаКолонок = Элементы.Добавить("ГруппаКолонок"+Индекс, Тип("ГруппаФормы"), Элементы.РезультатПроверки);
			
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), ГруппаКолонок);
			
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = СтрЗаменить(Колонка.Имя, "_", " ");
			НовыйЭлемент.Видимость = Истина;
			НовыйЭлемент.Доступность = Истина;
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ПутьКДанным = "РезультатПроверки."+Колонка.Имя;
			
			УстановитьЭлементУсловногоОформления(Колонка.Имя);
			
			НовыйЭлемент = Элементы.Добавить(СтрЗаменить(Колонка.Имя, "Текущий", "Конечный"), Тип("ПолеФормы"), ГруппаКолонок);
			
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = СтрЗаменить(СтрЗаменить(Колонка.Имя, "Текущий", "Конечный"), "_", " ");
			НовыйЭлемент.Видимость = Истина;
			НовыйЭлемент.Доступность = Истина;
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ПутьКДанным = "РезультатПроверки."+СтрЗаменить(Колонка.Имя, "Текущий", "Конечный");
			
			УстановитьЭлементУсловногоОформления(СтрЗаменить(Колонка.Имя, "Текущий", "Конечный"));
			
			Индекс = Индекс + 1;
		Иначе
			НовыйЭлемент = Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), Элементы.РезультатПроверки);
			
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = СтрЗаменить(Колонка.Имя, "_", " ");
			НовыйЭлемент.Видимость = Истина;
			НовыйЭлемент.Доступность = Истина;
			НовыйЭлемент.ТолькоПросмотр = Истина;
			НовыйЭлемент.ПутьКДанным = "РезультатПроверки."+Колонка.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Результат контроля документа <%1>'"), ПредставлениеДокумента);
КонецПроцедуры

#КонецОбласти