#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПолучитьДанныеБухУчета(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ШапкаДокумента				= ПараметрыПроцедуры["ШапкаДокумента"];
	ЗаполняемыеТабличныеЧасти	= ПараметрыПроцедуры["ЗаполняемыеТабличныеЧасти"];
	
	ДатаОкончанияИгнорированияДокументовРасчетов = УчетНДС.ПолучитьДатуОкончанияИгнорированияДокументовРасчетов(ШапкаДокумента["Организация"]);
	
	СтруктураСчетовАвансов = УчетНДС.ПолучитьТаблицуСчетовАвансовПолученных();
	
	Счета205хА = СтруктураСчетовАвансов["МассивСчетов"];
	
	ЗаполнитьЗакладку = Новый Структура();
	ЗаполнитьЗакладку.Вставить("Покупка",				ЗаполняемыеТабличныеЧасти.Свойство("Покупка"));
	ЗаполнитьЗакладку.Вставить("АвансыПолученные",		ЗаполняемыеТабличныеЧасти.Свойство("АвансыПолученные"));
	ЗаполнитьЗакладку.Вставить("НДСНалоговогоАгента",	ЗаполняемыеТабличныеЧасти.Свойство("НДСНалоговогоАгента"));
	ЗаполнитьЗакладку.Вставить("СМРХозспособом",		ЗаполняемыеТабличныеЧасти.Свойство("СМРХозспособом"));
	ЗаполнитьЗакладку.Вставить("ТаможенныйНДС",			ЗаполняемыеТабличныеЧасти.Свойство("ТаможенныйНДС"));
	ЗаполнитьЗакладку.Вставить("АвансыПолученныеПредъявленныеКомиссионером",	ЗаполняемыеТабличныеЧасти.Свойство("АвансыПолученныеПредъявленныеКомиссионером"));
	
	НастройкиЧтенияОстатков = ПолучитьНастройкиЧтенияОстатков(ШапкаДокумента, ЗаполнитьЗакладку);
	
	// Настраиваем запрос
	ЗапросОстатки = ИнициализироватьЗапрос_Остатки_ВходящийНДС(ШапкаДокумента, НастройкиЧтенияОстатков);
	
	ЗапросОстатки.УстановитьПараметр("Счета205хА", Счета205хА);
	ЗапросОстатки.УстановитьПараметр("ДатаОкончанияИгнорированияДокументовРасчетов", ДатаОкончанияИгнорированияДокументовРасчетов);
	
	ЗапросОстатки.Текст = ЗапросОстатки.Текст + "
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для закладки ""Покупка""
	|//
	|ВЫБРАТЬ
	|	СчетФактура					КАК СчетФактура,
	|	ДатаСчетаФактуры			КАК ДатаСчетаФактуры,
	|	Контрагент					КАК Контрагент,
	|	Договор						КАК Договор,
	|	Договор.ТипДоговораНДС		КАК ТипДоговораНДС,
	|	ОбъектНалогообложения		КАК ОбъектНалогообложения,
	|	ДатаДокументаОснования		КАК ДатаДокументаОснования,
	|	КФО							КАК КФО,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	ВидЦенности					КАК ВидЦенности,
	|	КПССчетРасчетов				КАК КПССчетРасчетов,
	|	СчетРасчетов				КАК СчетРасчетов,
	|	СчетКредита					КАК СчетКредита,
	|	СтавкаНДС					КАК СтавкаНДС,
	|	СУММА(СуммаБезНДС)			КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)				КАК СуммаНДС,
	|	СУММА(СуммаБезНДСВалютная)	КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)		КАК СуммаНДСВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаПокупка
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	ДатаСчетаФактуры,
	|	Контрагент,
	|	Договор,
	|	Договор.ТипДоговораНДС,
	|	ОбъектНалогообложения,
	|	ДатаДокументаОснования,
	|	КФО,
	|	ПричинаНалогообложения,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	СчетРасчетов,
	|	СчетКредита,
	|	СтавкаНДС
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Данные для закладки ""Авансы полученные""
	|//
	|ВЫБРАТЬ
	|	СчетФактура										КАК СчетФактура,
	|	ДатаСчетаФактуры								КАК ДатаСчетаФактуры,
	|	Контрагент										КАК Контрагент,
	|	Договор											КАК Договор,
	|	Договор.ТипДоговораНДС							КАК ТипДоговораНДС,
	|	ОбъектНалогообложения							КАК ОбъектНалогообложения,
	|	ДатаДокументаОснования							КАК ДатаДокументаОснования,
	|	КФО												КАК КФО,
	|	ПричинаНалогообложения							КАК ПричинаНалогообложения,
	|	ВидЦенности										КАК ВидЦенности,
	|	КПССчетРасчетов									КАК КПССчетРасчетов,
	|	СчетРасчетов									КАК СчетРасчетов,
	|	СчетКредита										КАК СчетКредита,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА СчетРасчетов В(&Счета205хА) ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			ОбъектНалогообложения
	|	КОНЕЦ											КАК ДокументРасчетов,
	|	(ЕСТЬNULL(ОбъектНалогообложения.Дата, &ПустаяДата) <
	|		&ДатаОкончанияИгнорированияДокументовРасчетов)	КАК ВозможноПотребуетсяОчисткаДокументаРасчетов,
	|	СУММА(СуммаБезНДС)								КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаАвансыПолученные
	|	И СуммаБезНДС >= 0
	|	И СуммаНДС >= 0
	|	И СуммаБезНДСВалютная >= 0
	|	И СуммаНДСВалютная >= 0
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	ДатаСчетаФактуры,
	|	Контрагент,
	|	Договор,
	|	Договор.ТипДоговораНДС,
	|	ОбъектНалогообложения,
	|	ДатаДокументаОснования,
	|	КФО,
	|	ПричинаНалогообложения,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	СчетРасчетов,
	|	СчетКредита,
	|	СтавкаНДС,
	|	ВЫБОР
	|		КОГДА СчетРасчетов В(&Счета205хА) ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			ОбъектНалогообложения
	|	КОНЕЦ,
	|	(ЕСТЬNULL(ОбъектНалогообложения.Дата, &ПустаяДата) <
	|		&ДатаОкончанияИгнорированияДокументовРасчетов)
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокументаОснования,
	|	ОбъектНалогообложения,
	|	ДатаСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Данные для закладки ""НДС налогового агента""
	|//
	|ВЫБРАТЬ
	|	СчетФактура										КАК СчетФактура,
	|	ДатаСчетаФактуры								КАК ДатаСчетаФактуры,
	|	Контрагент										КАК Контрагент,
	|	Договор											КАК Договор,
	|	Договор.ТипДоговораНДС							КАК ТипДоговораНДС,
	|	СчетКредита										КАК СчетКредита,
	|	СчетРасчетов									КАК СчетРасчетов,
	|	КПССчетРасчетов									КАК КПССчетРасчетов,
	|	ОбъектНалогообложения							КАК ОбъектНалогообложения,
	|	ВидЦенности										КАК ВидЦенности,
	|	КФО												КАК КФО,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	ИСТИНА											КАК ПоУчету,
	|	СУММА(СуммаБезНДС)								КАК Сумма,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаНДСНалоговогоАгента
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	ДатаСчетаФактуры,
	|	Контрагент,
	|	Договор,
	|	Договор.ТипДоговораНДС,
	|	СчетКредита,
	|	СчетРасчетов,
	|	КПССчетРасчетов,
	|	ОбъектНалогообложения,
	|	ВидЦенности,
	|	КФО,
	|	СтавкаНДС,
	|	ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактура,
	|	ОбъектНалогообложения,
	|	КПССчетРасчетов,
	|	КФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Данные для закладки ""СМР хоз. способом""
	|//
	|ВЫБРАТЬ
	|	СчетФактура										КАК СчетФактура,
	|	ДатаСчетаФактуры								КАК ДатаСчетаФактуры,
	|	СчетКредита										КАК СчетКредита,
	|	ОбъектНалогообложения							КАК ОбъектНалогообложения,
	|	КПССчетРасчетов									КАК КПССчетРасчетов,
	|	ВидЦенности										КАК ВидЦенности,
	|	КФО												КАК КФО,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	ИСТИНА											КАК ПоУчету,
	|	СУММА(СуммаБезНДС)								КАК Сумма,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаСМРХозСпособом
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	ДатаСчетаФактуры,
	|	СчетКредита,
	|	ОбъектНалогообложения,
	|	КПССчетРасчетов,
	|	ВидЦенности,
	|	КФО,
	|	СтавкаНДС,
	|	ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСчетаФактуры,
	|	СчетФактура,
	|	ОбъектНалогообложения,
	|	КПССчетРасчетов,
	|	КФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [5]. Данные для закладки Таможня
	|//
	|ВЫБРАТЬ
	|	СчетФактура					КАК СчетФактура,
	|	ДатаСчетаФактуры			КАК ДатаСчетаФактуры,
	|	Контрагент					КАК Контрагент,
	|	Договор						КАК Договор,
	|	Договор.ТипДоговораНДС		КАК ТипДоговораНДС,
	|	ОбъектНалогообложения		КАК ОбъектНалогообложения,
	|	ДатаДокументаОснования		КАК ДатаДокументаОснования,
	|	КФО							КАК КФО,
	|	ПричинаНалогообложения		КАК ПричинаНалогообложения,
	|	ВидЦенности					КАК ВидЦенности,
	|	КПССчетРасчетов				КАК КПССчетРасчетов,
	|	СчетРасчетов				КАК СчетРасчетов,
	|	СчетКредита					КАК СчетКредита,
	|	СтавкаНДС					КАК СтавкаНДС,
	|	СУММА(СуммаБезНДС)			КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)				КАК СуммаНДС,
	|	СУММА(СуммаБезНДСВалютная)	КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)		КАК СуммаНДСВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаТаможенныйНДС
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	ДатаСчетаФактуры,
	|	Контрагент,
	|	Договор,
	|	Договор.ТипДоговораНДС,
	|	ОбъектНалогообложения,
	|	ДатаДокументаОснования,
	|	КФО,
	|	ПричинаНалогообложения,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	СчетРасчетов,
	|	СчетКредита,
	|	СтавкаНДС
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСчетаФактуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [6]. Документы поступления ОС
	|//		(Для дальнейшего заполнения страницы Покупка)
	|//
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектНалогообложения	КАК Ссылка,
	|	ДатаДокументаОснования	КАК ДатаДокументаОснования
	|ПОМЕСТИТЬ
	|	ДокументыПоступленияОС
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаПокупка
	|	И (ОбъектНалогообложения ССЫЛКА Документ.ПоступлениеОС
	|		ИЛИ ОбъектНалогообложения ССЫЛКА Документ.ПоступлениеОСВПути
	|		ИЛИ ОбъектНалогообложения ССЫЛКА Документ.АвансовыйОтчет)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [7]. Объекты вложений
	|//		(Для дальнейшего заполнения страницы Покупка)
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КапВложения.ВнеоборотныйАктив 	КАК ОбъектВложений
	|ИЗ
	|	Документ.ПоступлениеОС.КапВложения КАК КапВложения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ	ДокументыПоступленияОС
	|		ПО	КапВложения.Ссылка = ДокументыПоступленияОС.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	КапВложения.ВнеоборотныйАктив 	КАК ОбъектВложений
	|ИЗ
	|	Документ.ПоступлениеОСВПути.КапВложения КАК КапВложения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ	ДокументыПоступленияОС
	|		ПО	КапВложения.Ссылка = ДокументыПоступленияОС.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Израсходовано.СубконтоДебета1 ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ВЫРАЗИТЬ(Израсходовано.СубконтоДебета1 КАК Справочник.ОсновныеСредства)
	|		КОГДА Израсходовано.СубконтоДебета2 ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ВЫРАЗИТЬ(Израсходовано.СубконтоДебета2 КАК Справочник.ОсновныеСредства)
	|		КОГДА Израсходовано.СубконтоДебета3 ССЫЛКА Справочник.ОсновныеСредства ТОГДА
	|			ВЫРАЗИТЬ(Израсходовано.СубконтоДебета3 КАК Справочник.ОсновныеСредства)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|	КОНЕЦ							КАК ОбъектВложений
	|ИЗ
	|	Документ.АвансовыйОтчет.Израсходовано КАК Израсходовано
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ	ДокументыПоступленияОС
	|		ПО	Израсходовано.Ссылка = ДокументыПоступленияОС.Ссылка
	|		И НЕ ПоДокументу
	|		И Израсходовано.ПредъявленСФ
	|		И (Израсходовано.СубконтоДебета1 ССЫЛКА Справочник.ОсновныеСредства
	|			ИЛИ Израсходовано.СубконтоДебета2 ССЫЛКА Справочник.ОсновныеСредства
	|			ИЛИ Израсходовано.СубконтоДебета3 ССЫЛКА Справочник.ОсновныеСредства)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [8]. Дата самого раннего документа поступления ОС
	|//		(Для дальнейшего заполнения страницы Покупка)
	|//
	|ВЫБРАТЬ
	|	МИНИМУМ(ДатаДокументаОснования)	КАК ДатаДокумента
	|ИЗ
	|	ДокументыПоступленияОС
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|// [9]. Данные для закладки ""Авансы полученные, предъявленные комиссионером (агентом)""
	|//
	|ВЫБРАТЬ
	|	СчетФактура										КАК СчетФактура,
	|	ДатаСчетаФактуры								КАК ДатаСчетаФактуры,
	|	Контрагент										КАК Контрагент,
	|	Договор											КАК Договор,
	|	Договор.ТипДоговораНДС							КАК ТипДоговораНДС,
	|	ОбъектНалогообложения							КАК ОбъектНалогообложения,
	|	ДатаДокументаОснования							КАК ДатаДокументаОснования,
	|	КФО												КАК КФО,
	|	ПричинаНалогообложения							КАК ПричинаНалогообложения,
	|	ВидЦенности										КАК ВидЦенности,
	|	КПССчетРасчетов									КАК КПССчетРасчетов,
	|	СчетРасчетов									КАК СчетРасчетов,
	|	СчетКредита										КАК СчетКредита,
	|	СтавкаНДС										КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА СчетРасчетов В(&Счета205хА) ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			ОбъектНалогообложения
	|	КОНЕЦ											КАК ДокументРасчетов,
	|	(ЕСТЬNULL(ОбъектНалогообложения.Дата, &ПустаяДата) <
	|		&ДатаОкончанияИгнорированияДокументовРасчетов)	КАК ВозможноПотребуетсяОчисткаДокументаРасчетов,
	|	СУММА(СуммаБезНДС)								КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаАвансыПолученныеПредъявленныеКомиссионером
	|	И СуммаБезНДС >= 0
	|	И СуммаНДС >= 0
	|	И СуммаБезНДСВалютная >= 0
	|	И СуммаНДСВалютная >= 0
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	ДатаСчетаФактуры,
	|	Контрагент,
	|	Договор,
	|	Договор.ТипДоговораНДС,
	|	ОбъектНалогообложения,
	|	ДатаДокументаОснования,
	|	КФО,
	|	ПричинаНалогообложения,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	СчетРасчетов,
	|	СчетКредита,
	|	СтавкаНДС,
	|	ВЫБОР
	|		КОГДА СчетРасчетов В(&Счета205хА) ТОГДА
	|			НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ
	|			ОбъектНалогообложения
	|	КОНЕЦ,
	|	(ЕСТЬNULL(ОбъектНалогообложения.Дата, &ПустаяДата) <
	|		&ДатаОкончанияИгнорированияДокументовРасчетов)
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокументаОснования,
	|	ОбъектНалогообложения,
	|	ДатаСчетаФактуры
	|;";
	
	РезультатыЗапроса = ЗапросОстатки.ВыполнитьПакет();
	
	ТаблицаПокупка				= РезультатыЗапроса[1].Выгрузить();
	ТаблицаАвансыПолученные		= РезультатыЗапроса[2].Выгрузить();
	ТаблицаНДСНалоговогоАгента	= РезультатыЗапроса[3].Выгрузить();
	ТаблицаСМРХозСпособом		= РезультатыЗапроса[4].Выгрузить();
	ТаблицаТаможня				= РезультатыЗапроса[5].Выгрузить();
	
	РезультатыЗаполнения = Новый Структура();
	
	Если ЗаполнитьЗакладку.Покупка Тогда
		
		// [7]. Объекты вложений
		ОбъектыВложений = РезультатыЗапроса[7].Выгрузить().ВыгрузитьКолонку("ОбъектВложений");
		
		// [8]. Дата самого раннего документа поступления ОС
		Выборка = РезультатыЗапроса[8].Выбрать();
		
		ДатаНачалаОборотов = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			ДатаНачалаОборотов = Выборка["ДатаДокумента"];
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ДатаНачалаОборотов) Тогда
			ДатаНачалаОборотов = Неопределено;
		КонецЕсли;
		
		ТаблицаПокупка = ПолучитьТаблицуПокупка(
			ТаблицаПокупка,
			ШапкаДокумента["Организация"],
			ОбъектыВложений, 
			ДатаНачалаОборотов,
			НастройкиЧтенияОстатков.ДатаОстатков);
			
		ТаблицаПокупка = УчетНДС.ТрансформироватьТаблицуСКолонкамиНДС_ИзОбщих_ВИндивидуальные(ТаблицаПокупка);
		
		ЗаполнитьКодыВидовОпераций(ТаблицаПокупка, "Покупка");
		
		МассивСчетовФактур = ТаблицаПокупка.ВыгрузитьКолонку("СчетФактура");
		
		УчетНДС.ЗаполнитьКолонкиДопЛиста(ТаблицаПокупка, МассивСчетовФактур);
		
		РезультатыЗаполнения.Вставить("Покупка", ТаблицаПокупка);
		
	КонецЕсли;
	
	ТаблицаАвансыПолученныеПредъявленныеКомиссионером = РезультатыЗапроса[9].Выгрузить();
	
	Если ЗаполнитьЗакладку.АвансыПолученные Тогда
		СчетаФактурыНаОтгрузку = УчетНДС.НовыйТаблицаДокументовСчетаФактурыНаОтгрузку();
		
		ТаблицаЗачтенныеАвансы = УчетНДС.РазбитьПоДатамЗачетаАвансаПолученного(ТаблицаАвансыПолученные, ШапкаДокумента,,, СчетаФактурыНаОтгрузку);
		
		Если ТаблицаЗачтенныеАвансы.Количество() > 0 Тогда
			ЗаполнитьКодыВидовОпераций(ТаблицаЗачтенныеАвансы, "АвансыПолученные");
			
			МассивСчетовФактур = ТаблицаЗачтенныеАвансы.ВыгрузитьКолонку("СчетФактура");
			
			УчетНДС.ЗаполнитьКолонкиДопЛиста(ТаблицаЗачтенныеАвансы, МассивСчетовФактур);
		КонецЕсли;
		
		ТаблицаЗачтенныеАвансы.Колонки.Добавить("ПоУчету", Новый ОписаниеТипов("Булево"));
		ТаблицаЗачтенныеАвансы.ЗаполнитьЗначения("Истина", "ПоУчету");
		
		РезультатыЗаполнения.Вставить("АвансыПолученные", ТаблицаЗачтенныеАвансы);
		
		РезультатыЗаполнения.Вставить("СчетаФактурыНаОтгрузку", СчетаФактурыНаОтгрузку);
	КонецЕсли;
	
	Если ЗаполнитьЗакладку.АвансыПолученныеПредъявленныеКомиссионером И ПолучитьФункциональнуюОпцию("ВестиУчетПоРеализацииТоваровУслугЧерезКомиссионеров") Тогда
		
		АвансыКомиссионера = Истина;
		
		ТаблицаЗачтенныеАвансы = УчетНДС.РазбитьПоДатамЗачетаАвансаПолученного(ТаблицаАвансыПолученныеПредъявленныеКомиссионером, ШапкаДокумента, АвансыКомиссионера);
		
		Если ТаблицаЗачтенныеАвансы.Количество() > 0 Тогда
			ЗаполнитьКодыВидовОпераций(ТаблицаЗачтенныеАвансы, "АвансыПолученныеПредъявленныеКомиссионером");
			
			МассивСчетовФактур = ТаблицаЗачтенныеАвансы.ВыгрузитьКолонку("СчетФактура");
			
			УчетНДС.ЗаполнитьКолонкиДопЛиста(ТаблицаЗачтенныеАвансы, МассивСчетовФактур);
		КонецЕсли;
		
		ТаблицаЗачтенныеАвансы.Колонки.Добавить("ПоУчету", Новый ОписаниеТипов("Булево"));
		ТаблицаЗачтенныеАвансы.ЗаполнитьЗначения("Истина", "ПоУчету");
		
		РезультатыЗаполнения.Вставить("АвансыПолученныеПредъявленныеКомиссионером", ТаблицаЗачтенныеАвансы);
		
	КонецЕсли;
	
	Если ЗаполнитьЗакладку.НДСНалоговогоАгента Тогда
		
		ЗаполнитьКодыВидовОпераций(ТаблицаНДСНалоговогоАгента, "НДСНалоговогоАгента");
		
		МассивСчетовФактур = ТаблицаНДСНалоговогоАгента.ВыгрузитьКолонку("СчетФактура");
		
		УчетНДС.ЗаполнитьКолонкиДопЛиста(ТаблицаНДСНалоговогоАгента, МассивСчетовФактур);
		
		РезультатыЗаполнения.Вставить("НДСНалоговогоАгента", ТаблицаНДСНалоговогоАгента);
		
	КонецЕсли;
	
	Если ЗаполнитьЗакладку.СМРХозспособом Тогда
		
		ЗаполнитьКодыВидовОпераций(ТаблицаСМРХозСпособом, "СМРХозспособом");
		
		МассивСчетовФактур = ТаблицаСМРХозСпособом.ВыгрузитьКолонку("СчетФактура");
		
		УчетНДС.ЗаполнитьКолонкиДопЛиста(ТаблицаСМРХозСпособом, МассивСчетовФактур);
		
		РезультатыЗаполнения.Вставить("СМРХозспособом", ТаблицаСМРХозСпособом);
		
	КонецЕсли;
	
	Если ЗаполнитьЗакладку.ТаможенныйНДС Тогда
		
		// [7]. Объекты вложений
		ОбъектыВложений = РезультатыЗапроса[7].Выгрузить().ВыгрузитьКолонку("ОбъектВложений");
		
		// [8]. Дата самого раннего документа поступления ОС
		Выборка = РезультатыЗапроса[8].Выбрать();
		
		ДатаНачалаОборотов = Неопределено;
		
		Пока Выборка.Следующий() Цикл
			ДатаНачалаОборотов = Выборка["ДатаДокумента"];
		КонецЦикла;
		
		Если НЕ ЗначениеЗаполнено(ДатаНачалаОборотов) Тогда
			ДатаНачалаОборотов = Неопределено;
		КонецЕсли;
		
		ТаблицаПокупка = ПолучитьТаблицуПокупка(
			ТаблицаТаможня,
			ШапкаДокумента["Организация"],
			ОбъектыВложений, 
			ДатаНачалаОборотов,
			НастройкиЧтенияОстатков.ДатаОстатков);
			
		ЗаполнитьКолонкиВсегоТаможенныйНДС(ТаблицаПокупка);
		
		ЗаполнитьКодыВидовОпераций(ТаблицаПокупка, "ТаможенныйНДС");
		
		МассивСчетовФактур = ТаблицаПокупка.ВыгрузитьКолонку("СчетФактура");
		
		УчетНДС.ЗаполнитьКолонкиДопЛиста(ТаблицаПокупка, МассивСчетовФактур);
		
		РезультатыЗаполнения.Вставить("ТаможенныйНДС", ТаблицаПокупка);
		
	КонецЕсли;
	
	ИменаИсключений = Новый Массив();
	ИменаИсключений.Добавить("СчетаФактурыНаОтгрузку");
	
	ЗаполнитьКолонкуКПС30304(РезультатыЗаполнения, ШапкаДокумента, ИменаИсключений);
	
	ПоместитьВоВременноеХранилище(РезультатыЗаполнения, АдресРезультата);
	
КонецПроцедуры

Функция ЕстьОшибкиЗаполнения(ДокументОбъект) Экспорт
	
	ЕстьОшибкиЗаполнения = Ложь;
	
	НастройкиЧтенияОстатков = ПолучитьНастройкиЧтенияОстатков(ДокументОбъект);
	
	ЗапросОстатки = ИнициализироватьЗапрос_Остатки_ВходящийНДС(ДокументОбъект, НастройкиЧтенияОстатков);
	
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборСчетФактура",			НастройкиЧтенияОстатков.ИспользоватьОтбор.СчетФактура);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборОбъектНалогообложения",	НастройкиЧтенияОстатков.ИспользоватьОтбор.ОбъектНалогообложения);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборКФО",					НастройкиЧтенияОстатков.ИспользоватьОтбор.КФО);
	ЗапросОстатки.УстановитьПараметр("ОтборСчетФактура",						НастройкиЧтенияОстатков.Отбор.СчетФактура);
	ЗапросОстатки.УстановитьПараметр("ОтборОбъектНалогообложения",				НастройкиЧтенияОстатков.Отбор.ОбъектНалогообложения);
	ЗапросОстатки.УстановитьПараметр("ОтборКФО",								НастройкиЧтенияОстатков.Отбор.КФО);
	ЗапросОстатки.Текст = ЗапросОстатки.Текст + "
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Остатки для закладки Покупка
	|//
	|ВЫБРАТЬ
	|	СчетФактура,
	|	Контрагент,
	|	ОбъектНалогообложения,
	|	СчетРасчетов,
	|	КПССчетРасчетов,
	|	ВидЦенности,
	|	КФО,
	|	СчетКредита,
	|	СтавкаНДС,
	|	СУММА(СуммаБезНДС)								КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаПокупка
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	Контрагент,
	|	ОбъектНалогообложения,
	|	СчетРасчетов,
	|	КПССчетРасчетов,
	|	ВидЦенности,
	|	КФО,
	|	СчетКредита,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Остатки для закладки Авансы полученные
	|//
	|ВЫБРАТЬ
	|	СчетФактура,
	|	Контрагент,
	|	Договор,
	|	КПССчетРасчетов,
	|	КФО,
	|	ОбъектНалогообложения,
	|	СчетКредита,
	|	СчетРасчетов,
	|	СтавкаНДС,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаАвансыПолученные
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	Контрагент,
	|	Договор,
	|	КПССчетРасчетов,
	|	КФО,
	|	ОбъектНалогообложения,
	|	СчетКредита,
	|	СчетРасчетов,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Остатки для закладки НДС налогового агента
	|//
	|ВЫБРАТЬ
	|	СчетФактура,
	|	Контрагент,
	|	Договор,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	КФО,
	|	ОбъектНалогообложения,
	|	СчетКредита,
	|	СчетРасчетов,
	|	СтавкаНДС,
	|	СУММА(СуммаБезНДС)								КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаНДСНалоговогоАгента
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	Контрагент,
	|	Договор,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	КФО,
	|	ОбъектНалогообложения,
	|	СчетКредита,
	|	СчетРасчетов,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Остатки для закладки СМР хоз. способом
	|//
	|ВЫБРАТЬ
	|	СчетФактура,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	КФО,
	|	ОбъектНалогообложения,
	|	СчетКредита,
	|	СтавкаНДС,
	|	СУММА(СуммаБезНДС)								КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаСМРХозСпособом
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	ВидЦенности,
	|	КПССчетРасчетов,
	|	КФО,
	|	ОбъектНалогообложения,
	|	СчетКредита,
	|	СтавкаНДС,
	|	КФО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [5]. Остатки для закладки Таможенный НДС
	|//
	|ВЫБРАТЬ
	|	СчетФактура,
	|	Контрагент,
	|	ОбъектНалогообложения,
	|	СчетРасчетов,
	|	КПССчетРасчетов,
	|	ВидЦенности,
	|	КФО,
	|	СчетКредита,
	|	СтавкаНДС,
	|	СУММА(СуммаБезНДС)								КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)									КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)					КАК Всего,
	|	СУММА(СуммаБезНДСВалютная)						КАК СуммаБезНДСВалютная,
	|	СУММА(СуммаНДСВалютная)							КАК СуммаНДСВалютная,
	|	СУММА(СуммаБезНДСВалютная + СуммаНДСВалютная)	КАК ВсегоВалютная
	|ИЗ
	|	ВсеОстатки
	|ГДЕ
	|	ЭтоЗакладкаТаможенныйНДС
	|СГРУППИРОВАТЬ ПО
	|	СчетФактура,
	|	Контрагент,
	|	ОбъектНалогообложения,
	|	СчетРасчетов,
	|	КПССчетРасчетов,
	|	ВидЦенности,
	|	КФО,
	|	СчетКредита,
	|	СтавкаНДС
	|;";
	
	РезультатОстатки = ЗапросОстатки.ВыполнитьПакет();
	
	ТаблицаОстаткиПокупка				= РезультатОстатки[1].Выгрузить();
	ТаблицаОстаткиАвансыПолученные		= РезультатОстатки[2].Выгрузить();
	ТаблицаОстаткиНДСНалоговогоАгента	= РезультатОстатки[3].Выгрузить();
	ТаблицаОстаткиСМРХозспособом		= РезультатОстатки[4].Выгрузить();
	ТаблицаОстаткиТаможня				= РезультатОстатки[5].Выгрузить();
	
	//---
	// Закладка "Покупка", проверка заполнения
	//---
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.Покупка Тогда
		
		ТаблицаПокупка = ДокументОбъект["Покупка"].Выгрузить();
		
		//---
		// Заполненность ставок в индивидуальных колонках
		//---
		УчетНДС.ПроверитьЗаполненностьСтавокВИндивидуальныхКолонках(ТаблицаПокупка, "Покупка", НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы, ЕстьОшибкиЗаполнения);
		
		Если ЕстьОшибкиЗаполнения Тогда
			Возврат ЕстьОшибкиЗаполнения;
		КонецЕсли;
		
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|ВидЦенности");
			
		ПараметрыВывода = Новый Структура();
		ПараметрыВывода.Вставить("ТаблицаИмя",				"Покупка");
		ПараметрыВывода.Вставить("ТаблицаПредставление",	НСтр("ru='Покупка'"));
		ПараметрыВывода.Вставить("ОбъектСсылка",			ДокументОбъект["Ссылка"]);
		
		//---
		// Дубли строк
		//---
		КолонкиДублей = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(КоллекцияИменКолонокСвязи);
		КолонкиДублей.Вставить("ДатаПринятияКУчету");
		ТаблицаДублиСтрок = УчетНДС.НайтиДублиСтрок(ТаблицаПокупка, КолонкиДублей);
		Если ТаблицаДублиСтрок.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
		КонецЕсли;
		
		//---
		// Превышение остатков
		//---
		ТаблицаПокупкаОбщиеКолонкиНДС = УчетНДС.ТрансформироватьТаблицуСКолонкамиНДС_ИзИндивидуальных_ВОбщие(ТаблицаПокупка);
		
		КоллекцияИменКолонокСвязи.Вставить("СтавкаНДС"); // добавляем связь по еще одной колонке
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		Если НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаБезНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
		КонецЕсли;
		ТаблицаПревышения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаПокупкаОбщиеКолонкиНДС,
			ТаблицаОстаткиПокупка,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"ПревышенияТаблицы1НадТаблицей2")["ПревышенияТаблицы1НадТаблицей2"];
			
		Если ТаблицаПревышения.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОПревышенииОстатков_ТаблицаСИндивидуальнымиКолонкамиНДС(
				ТаблицаПревышения,
				ТаблицаПокупкаОбщиеКолонкиНДС,
				ТаблицаПокупка,
				КоллекцияИменКолонокСвязи,
				ПараметрыВывода);
		КонецЕсли;
	КонецЕсли;
	
	//---
	// Закладка "Авансы полученные", проверка заполнения
	//---
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.АвансыПолученные Тогда
		
		ТаблицаАвансыПолученные = ДокументОбъект["АвансыПолученные"].Выгрузить();
		
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС");
		
		ПараметрыВывода = Новый Структура();
		ПараметрыВывода.Вставить("ТаблицаИмя",				"АвансыПолученные");
		ПараметрыВывода.Вставить("ТаблицаПредставление",	НСтр("ru='Авансы полученные'"));
		ПараметрыВывода.Вставить("ОбъектСсылка",			ДокументОбъект["Ссылка"]);
		
		//---
		// Превышение остатков
		//---
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		МассивИменКолонокПоказателей.Добавить("Всего");
		Если НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("ВсегоВалютная");
		КонецЕсли;
		ТаблицаПревышения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаАвансыПолученные,
			ТаблицаОстаткиАвансыПолученные,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"ПревышенияТаблицы1НадТаблицей2")["ПревышенияТаблицы1НадТаблицей2"];
		Если ТаблицаПревышения.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОПревышенииОстатков(ТаблицаПревышения, ПараметрыВывода)			
		КонецЕсли;
		
	КонецЕсли;
	
	//---
	// Закладка "НДС налогового агента", проверка заполнения
	//---
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.НДСНалоговогоАгента Тогда
		
		ТаблицаНДСНалоговогоАгента = ДокументОбъект["НДСНалоговогоАгента"].Выгрузить();
		// Переименовываем колонки для дальнейшего сравнения с остатками
		ТаблицаНДСНалоговогоАгента.Колонки["Сумма"].Имя = "СуммаБезНДС";
		ТаблицаНДСНалоговогоАгента.Колонки["СуммаВалютная"].Имя = "СуммаБезНДСВалютная";
		
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС,
			|ВидЦенности");
		
		ПараметрыВывода = Новый Структура();
		ПараметрыВывода.Вставить("ТаблицаИмя",				"НДСНалоговогоАгента");
		ПараметрыВывода.Вставить("ТаблицаПредставление",	НСтр("ru='НДС налогового агента'"));
		ПараметрыВывода.Вставить("ОбъектСсылка",			ДокументОбъект["Ссылка"]);
		ЗаменаКолонок = Новый Структура();
		ЗаменаКолонок.Вставить("СуммаБезНДС", "Сумма");
		ЗаменаКолонок.Вставить("СуммаБезНДСВалютная", "СуммаВалютная");
		ПараметрыВывода.Вставить("ЗаменаКолонок",			ЗаменаКолонок);
		
		//---
		// Дубли строк
		//---
		ТаблицаДублиСтрок = УчетНДС.НайтиДублиСтрок(ТаблицаНДСНалоговогоАгента, КоллекцияИменКолонокСвязи);
		Если ТаблицаДублиСтрок.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
		КонецЕсли;
		
		//---
		// Превышение остатков
		//---
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		Если НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаБезНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
		КонецЕсли;
		ТаблицаПревышения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаНДСНалоговогоАгента,
			ТаблицаОстаткиНДСНалоговогоАгента,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"ПревышенияТаблицы1НадТаблицей2")["ПревышенияТаблицы1НадТаблицей2"];
		Если ТаблицаПревышения.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОПревышенииОстатков(ТаблицаПревышения, ПараметрыВывода)			
		КонецЕсли;
		
	КонецЕсли;
	
	//---
	// Закладка "СМР хозспособом", проверка заполнения
	//---
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.СМРХозспособом Тогда
		
		ТаблицаСМРХозспособом = ДокументОбъект["СМРХозспособом"].Выгрузить();
		ТаблицаСМРХозспособом.Колонки["Сумма"].Имя = "СуммаБезНДС"; // для совпадения с именем колонки в ТаблицаОстаткиСМРХозспособом
		
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС,
			|ВидЦенности");
		
		ПараметрыВывода = Новый Структура();
		ПараметрыВывода.Вставить("ТаблицаИмя",				"СМРХозспособом");
		ПараметрыВывода.Вставить("ТаблицаПредставление",	НСтр("ru='СМР хозспособом'"));
		ПараметрыВывода.Вставить("ОбъектСсылка",			ДокументОбъект["Ссылка"]);
		ПараметрыВывода.Вставить("ЗаменаКолонок",			Новый Структура("СуммаБезНДС", "Сумма"));
		
		//---
		// Дубли строк
		//---
		ТаблицаДублиСтрок = УчетНДС.НайтиДублиСтрок(ТаблицаСМРХозспособом, КоллекцияИменКолонокСвязи);
		Если ТаблицаДублиСтрок.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
		КонецЕсли;
		
		//---
		// Превышение остатков
		//---
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		ТаблицаПревышения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаСМРХозспособом,
			ТаблицаОстаткиСМРХозспособом,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"ПревышенияТаблицы1НадТаблицей2")["ПревышенияТаблицы1НадТаблицей2"];
		Если ТаблицаПревышения.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОПревышенииОстатков(ТаблицаПревышения, ПараметрыВывода)			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.ТаможенныйНДС Тогда
		
		ТаблицаТаможня = ДокументОбъект["ТаможенныйНДС"].Выгрузить();

		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|ВидЦенности,
			|СтавкаНДС");
		
		ПараметрыВывода = Новый Структура();
		ПараметрыВывода.Вставить("ТаблицаИмя",				"ТаможенныйНДС");
		ПараметрыВывода.Вставить("ТаблицаПредставление",	НСтр("ru='НДС на таможне'"));
		ПараметрыВывода.Вставить("ОбъектСсылка",			ДокументОбъект["Ссылка"]);
		
		//---
		// Дубли строк
		//---
		ТаблицаДублиСтрок = УчетНДС.НайтиДублиСтрок(ТаблицаТаможня, КоллекцияИменКолонокСвязи);
		Если ТаблицаДублиСтрок.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
		КонецЕсли;
		
		//---
		// Превышение остатков
		//---
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		Если НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаБезНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
		КонецЕсли;
		ТаблицаПревышения = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаТаможня,
			ТаблицаОстаткиТаможня,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"ПревышенияТаблицы1НадТаблицей2")["ПревышенияТаблицы1НадТаблицей2"];
			
		Если ТаблицаПревышения.Количество() > 0 Тогда
			ЕстьОшибкиЗаполнения = Истина;
			УчетНДС.ВывестиСообщенияОПревышенииОстатков(ТаблицаПревышения, ПараметрыВывода);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументОбъект, СтруктураДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ВходящийНДС",						ДокументОбъект.Движения["ВходящийНДС"].Выгрузить());
	ТаблицыДляДвижений.Вставить("КнигаПокупок",						ДокументОбъект.Движения["КнигаПокупок"].Выгрузить());
	ТаблицыДляДвижений.Вставить("ДополнительныеЛистыКнигиПокупок",	ДокументОбъект.Движения["ДополнительныеЛистыКнигиПокупок"].Выгрузить());
	ТаблицыДляДвижений.Вставить("КнигаПродаж",						ДокументОбъект.Движения["КнигаПродаж"].Выгрузить());
	ТаблицыДляДвижений.Вставить("ДополнительныеЛистыКнигиПродаж",	ДокументОбъект.Движения["ДополнительныеЛистыКнигиПродаж"].Выгрузить());
	
	НастройкиЧтенияОстатков = ПолучитьНастройкиЧтенияОстатков(ДокументОбъект);
	
	ЗапросОстатки = ИнициализироватьЗапрос_Остатки_ВходящийНДС(ДокументОбъект, НастройкиЧтенияОстатков);
		
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборСчетФактура",			НастройкиЧтенияОстатков.ИспользоватьОтбор.СчетФактура);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборОбъектНалогообложения",	НастройкиЧтенияОстатков.ИспользоватьОтбор.ОбъектНалогообложения);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборКФО",					НастройкиЧтенияОстатков.ИспользоватьОтбор.КФО);
	ЗапросОстатки.УстановитьПараметр("ОтборСчетФактура",						НастройкиЧтенияОстатков.Отбор.СчетФактура);
	ЗапросОстатки.УстановитьПараметр("ОтборОбъектНалогообложения",				НастройкиЧтенияОстатков.Отбор.ОбъектНалогообложения);
	ЗапросОстатки.УстановитьПараметр("ОтборКФО",								НастройкиЧтенияОстатков.Отбор.КФО);
	ЗапросОстатки.Текст = ЗапросОстатки.Текст + "
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Все остатки
	|//
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ВсеОстатки
	|;";
	ОбщаяТаблицаОстатки = ЗапросОстатки.Выполнить().Выгрузить();
	
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.Покупка Тогда
		
		ТаблицаТЧ = УчетНДС.ТрансформироватьТаблицуСКолонкамиНДС_ИзИндивидуальных_ВОбщие(ДокументОбъект["Покупка"].Выгрузить());
		
		ДобавитьДвиженияПоТабличнойЧасти("Покупка", ТаблицаТЧ, ОбщаяТаблицаОстатки, ТаблицыДляДвижений, НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы);
		
	КонецЕсли;
	
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.АвансыПолученные Тогда
		
		ТаблицаТЧ = ДокументОбъект["АвансыПолученные"].Выгрузить();
		
		ТаблицаТЧ.Колонки.Добавить("Событие", Новый ОписаниеТипов("ПеречислениеСсылка.СобытияНДС"));
		СобытиеВозвратАвансаПолученного = Перечисления.СобытияНДС.ВозвратАвансаПолученного;
		Для Каждого СтрокаТаблицы Из ТаблицаТЧ Цикл
			Если СтрокаТаблицы["ВозвратАвансаПолученного"] Тогда
				СтрокаТаблицы["Событие"] = СобытиеВозвратАвансаПолученного;
			КонецЕсли;
		КонецЦикла;
		
		ДобавитьДвиженияПоТабличнойЧасти("АвансыПолученные", ТаблицаТЧ, ОбщаяТаблицаОстатки, ТаблицыДляДвижений, НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы);
	КонецЕсли;
	
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.АвансыПолученныеПредъявленныеКомиссионером Тогда
		
		ТаблицаТЧ = ДокументОбъект["АвансыПолученныеПредъявленныеКомиссионером"].Выгрузить();
		
		ТаблицаТЧ.Колонки.Добавить("Событие", Новый ОписаниеТипов("ПеречислениеСсылка.СобытияНДС"));
		СобытиеВозвратАвансаПолученного = Перечисления.СобытияНДС.ВозвратАвансаПолученного;
		Для Каждого СтрокаТаблицы Из ТаблицаТЧ Цикл
			Если СтрокаТаблицы["ВозвратАвансаПолученного"] Тогда
				СтрокаТаблицы["Событие"] = СобытиеВозвратАвансаПолученного;
			КонецЕсли;
		КонецЦикла;
		
		ДобавитьДвиженияПоТабличнойЧасти("АвансыПолученныеПредъявленныеКомиссионером", ТаблицаТЧ, ОбщаяТаблицаОстатки, ТаблицыДляДвижений, НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы);
		
	КонецЕсли;
	
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.НДСНалоговогоАгента Тогда
		
		ТаблицаТЧ = ДокументОбъект["НДСНалоговогоАгента"].Выгрузить();
		
		// Переименовываем для совпадения с именем колонки в ОбщаяТаблицаОстатки
		ТаблицаТЧ.Колонки["Сумма"].Имя = "СуммаБезНДС";
		Если НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы Тогда
			ТаблицаТЧ.Колонки["СуммаВалютная"].Имя = "СуммаБезНДСВалютная";
		КонецЕсли;
		
		ДобавитьДвиженияПоТабличнойЧасти("НДСНалоговогоАгента", ТаблицаТЧ, ОбщаяТаблицаОстатки, ТаблицыДляДвижений, НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы);
		
	КонецЕсли;
	
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.СМРХозспособом Тогда
		
		ТаблицаТЧ = ДокументОбъект["СМРХозспособом"].Выгрузить();
		
		// Переименовываем для совпадения с именем колонки в ОбщаяТаблицаОстатки
		ТаблицаТЧ.Колонки["Сумма"].Имя = "СуммаБезНДС";
		Если НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы Тогда
			ТаблицаТЧ.Колонки["СуммаВалютная"].Имя = "СуммаБезНДСВалютная";
		КонецЕсли;
		
		ДобавитьДвиженияПоТабличнойЧасти("СМРХозспособом", ТаблицаТЧ, ОбщаяТаблицаОстатки, ТаблицыДляДвижений, НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы);
		
	КонецЕсли;
	
	Если НастройкиЧтенияОстатков.ИспользоватьЗакладку.ТаможенныйНДС Тогда
		
		ТаблицаТЧ = ДокументОбъект["ТаможенныйНДС"].Выгрузить();
		
		ДобавитьДвиженияПоТабличнойЧасти("ТаможенныйНДС", ТаблицаТЧ, ОбщаяТаблицаОстатки, ТаблицыДляДвижений, НастройкиЧтенияОстатков.ЗаполнитьВалютныеСуммы);
		
	КонецЕсли;
	
	// Дозаполняем таблицы движений
	ТаблицыДляДвижений["ВходящийНДС"].ЗаполнитьЗначения(ВидДвиженияНакопления.Расход,				"ВидДвижения");
	ТаблицыДляДвижений["ВходящийНДС"].ЗаполнитьЗначения(ДокументОбъект["Дата"],						"Период");
	ТаблицыДляДвижений["ВходящийНДС"].ЗаполнитьЗначения(Истина,										"Активность");
	
	ТаблицыДляДвижений["КнигаПокупок"].ЗаполнитьЗначения(ДокументОбъект["Дата"],					"Период");
	ТаблицыДляДвижений["КнигаПокупок"].ЗаполнитьЗначения(Истина,									"Активность");
	
	ТаблицыДляДвижений["ДополнительныеЛистыКнигиПокупок"].ЗаполнитьЗначения(ДокументОбъект["Дата"],	"Период");
	ТаблицыДляДвижений["ДополнительныеЛистыКнигиПокупок"].ЗаполнитьЗначения(Истина,					"Активность");
	
	ТаблицыДляДвижений["КнигаПродаж"].ЗаполнитьЗначения(ДокументОбъект["Дата"],						"Период");
	ТаблицыДляДвижений["КнигаПродаж"].ЗаполнитьЗначения(Истина,										"Активность");
	
	ТаблицыДляДвижений["ДополнительныеЛистыКнигиПродаж"].ЗаполнитьЗначения(ДокументОбъект["Дата"],	"Период");
	ТаблицыДляДвижений["ДополнительныеЛистыКнигиПродаж"].ЗаполнитьЗначения(Истина,					"Активность");
	
	ДобавитьДвиженияСчетаФактурыНаОтгрузкуДляКнигиПокупок(ТаблицыДляДвижений, ДокументОбъект);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолучитьДанныеБухУчета", Истина);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//	Создает временную таблицу "ВсеОстатки".
Функция ИнициализироватьЗапрос_Остатки_ВходящийНДС(Объект, НастройкиЧтенияОстатков)
	
	ИспользоватьОтборПодразделение	= (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") И ЗначениеЗаполнено(Объект["Подразделение"]));
	ИспользоватьОтборИФО			= (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(Объект["ИФО"]));
	
	// Настраиваем запрос
	ЗапросОстатки = Новый Запрос();
	ЗапросОстатки.УстановитьПараметр("ДатаОстатков",									НастройкиЧтенияОстатков.ДатаОстатков);
	ЗапросОстатки.УстановитьПараметр("ДатаОстатковДата",								НастройкиЧтенияОстатков.ДатаОстатков.Значение);
	ЗапросОстатки.УстановитьПараметр("ПустаяДата",										'00010101');
	ЗапросОстатки.УстановитьПараметр("Организация",										Объект["Организация"]);
	ЗапросОстатки.УстановитьПараметр("ПричиныНалогообложенияЗакладкиАванс",				НастройкиЧтенияОстатков.ПричиныНалогообложения.АвансыПолученные);
	ЗапросОстатки.УстановитьПараметр("ПричиныНалогообложенияЗакладкиАвансПолученныйПредъявленныйКомиссионером",	НастройкиЧтенияОстатков.ПричиныНалогообложения.АвансыПолученныеПредъявленныеКомиссионером);
	ЗапросОстатки.УстановитьПараметр("ПричиныНалогообложенияЗакладкиНалоговыйАгент",	НастройкиЧтенияОстатков.ПричиныНалогообложения.НДСНалоговогоАгента);
	ЗапросОстатки.УстановитьПараметр("ПричиныНалогообложенияЗакладкиХозСпособ",			НастройкиЧтенияОстатков.ПричиныНалогообложения.СМРХозспособом);
	ЗапросОстатки.УстановитьПараметр("ПричиныНалогообложенияЗакладкиПокупка",			НастройкиЧтенияОстатков.ПричиныНалогообложения.Покупка);
	ЗапросОстатки.УстановитьПараметр("ПричиныНалогообложенияЗакладкиТаможня",			НастройкиЧтенияОстатков.ПричиныНалогообложения.ТаможенныйНДС);
	ЗапросОстатки.УстановитьПараметр("ПричиныНалогообложения",							НастройкиЧтенияОстатков.ПричиныНалогообложения.ВсеПричины);
	ЗапросОстатки.УстановитьПараметр("ДокументСсылка",									Объект["Ссылка"]);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборОбъектНалогообложения",			Ложь);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборСчетФактура",					Ложь);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборКФО",							Ложь);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборПодразделение",					ИспользоватьОтборПодразделение);
	ЗапросОстатки.УстановитьПараметр("ИспользоватьОтборИФО",							ИспользоватьОтборИФО);
	ЗапросОстатки.УстановитьПараметр("ОтборОбъектНалогообложения",						Неопределено);
	ЗапросОстатки.УстановитьПараметр("ОтборСчетФактура",								Неопределено);
	ЗапросОстатки.УстановитьПараметр("ОтборКФО",										Неопределено);
	ЗапросОстатки.УстановитьПараметр("ОтборПодразделение",								Объект["Подразделение"]);
	ЗапросОстатки.УстановитьПараметр("ОтборИФО",										Объект["ИФО"]);
	ЗапросОстатки.УстановитьПараметр("ЗаполнитьВалютныеСуммы",							УчетНДС.СледуетЗаполнитьВалютныеСуммы());
	ЗапросОстатки.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. (Подготовка) Все остатки
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	// Все измерения:
	|	Организация						КАК Организация,
	|	СчетФактура						КАК СчетФактура,
	|	ПричинаНалогообложения			КАК ПричинаНалогообложения,
	|	ВидЦенности						КАК ВидЦенности,
	|	КФО								КАК КФО,
	|	СчетРасчетов					КАК СчетРасчетов,
	|	КПССчетРасчетов					КАК КПССчетРасчетов,
	|	СчетКредита						КАК СчетКредита,
	|	ОбъектНалогообложения			КАК ОбъектНалогообложения,
	|	СтавкаНДС						КАК СтавкаНДС,
	|	ДокументКорректировки			КАК ДокументКорректировки,
	|	МестоРегистрации				КАК МестоРегистрации,
	|	Сторно							КАК Сторно,
	|	
	|	// Дополнительные поля:
	|	СчетФактура.Дата				КАК ДатаСчетаФактуры,
	|	СчетФактура.Контрагент			КАК Контрагент,
	|	СчетФактура.Договор				КАК Договор,
	|	ЕСТЬNULL(
	|		ОбъектНалогообложения.Дата,
	|		СчетФактура.Дата)			КАК ДатаДокументаОснования,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиПокупка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ЭтоЗакладкаПокупка,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиАванс) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ЭтоЗакладкаАвансыПолученные,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиАвансПолученныйПредъявленныйКомиссионером) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ЭтоЗакладкаАвансыПолученныеПредъявленныеКомиссионером,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиНалоговыйАгент) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ЭтоЗакладкаНДСНалоговогоАгента,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиХозСпособ) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ЭтоЗакладкаСМРХозспособом,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиТаможня) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ЭтоЗакладкаТаможенныйНДС,
	|	ВЫБОР
	|		КОГДА МестоРегистрации = ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПокупок)
	|			ИЛИ МестоРегистрации = ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.ПустаяСсылка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ОтразитьВКнигеПокупок,
	|	
	|	// Ресурсы:
	|	СУММА(СуммаБезНДС)				КАК СуммаБезНДС,
	|	СУММА(СуммаНДС)					КАК СуммаНДС,
	|	СУММА(СуммаБезНДС + СуммаНДС)	КАК Всего,
	|	СУММА(ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаБезНДСВалютная
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)							КАК СуммаБезНДСВалютная,
	|	СУММА(ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаНДСВалютная
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)							КАК СуммаНДСВалютная,
	|	СУММА(ВЫБОР
	|		КОГДА &ЗаполнитьВалютныеСуммы ТОГДА
	|			СуммаБезНДСВалютная + СуммаНДСВалютная
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)							КАК ВсегоВалютная
	|ПОМЕСТИТЬ
	|	ВсеОстатки
	|ИЗ
	|	(
	|	// Текущие остатки, включая возможные движения самого документа:
	|	ВЫБРАТЬ
	|		// Все измерения:
	|		Организация,
	|		СчетФактура,
	|		ПричинаНалогообложения,
	|		ВидЦенности,
	|		КФО,
	|		СчетРасчетов,
	|		КПССчетРасчетов,
	|		СчетКредита,
	|		ОбъектНалогообложения,
	|		СтавкаНДС,
	|		ДокументКорректировки,
	|		МестоРегистрации,
	|		Сторно,
	|		// Ресурсы:
	|		СуммаБезНДСОстаток			КАК СуммаБезНДС,
	|		СуммаНДСОстаток				КАК СуммаНДС,
	|		СуммаБезНДСВалютнаяОстаток	КАК СуммаБезНДСВалютная,
	|		СуммаНДСВалютнаяОстаток		КАК СуммаНДСВалютная
	|	ИЗ
	|		РегистрНакопления.ВходящийНДС.Остатки(
	|			&ДатаОстатков,
	|			Организация = &Организация
	|			И	ПричинаНалогообложения В(&ПричиныНалогообложения)
	|			И ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(СчетФактура) = ТИП(Документ.СчетФактураВыданный)
	|					ТОГДА НЕ(ПричинаНалогообложения В (&ПричиныНалогообложенияЗакладкиНалоговыйАгент)
	|								И СчетФактура.Дата > &ДатаОстатковДата
	|								И СчетФактура.РегистрацияВПредыдущемПериоде)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)	КАК ВходящийНДСОстатки
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	// ""Вычитаем"" движения самого документа:
	|	ВЫБРАТЬ
	|		// Все измерения:
	|		Организация,
	|		СчетФактура,
	|		ПричинаНалогообложения,
	|		ВидЦенности,
	|		КФО,
	|		СчетРасчетов,
	|		КПССчетРасчетов,
	|		СчетКредита,
	|		ОбъектНалогообложения,
	|		СтавкаНДС,
	|		ДокументКорректировки,
	|		МестоРегистрации,
	|		Сторно,
	|		// Ресурсы:
	|		ВЫБОР
	|			КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				-(ВходящийНДС.СуммаБезНДС)
	|			ИНАЧЕ
	|				(ВходящийНДС.СуммаБезНДС)
	|		КОНЕЦ									КАК СуммаБезНДС,
	|		ВЫБОР
	|			КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				-(ВходящийНДС.СуммаНДС)
	|			ИНАЧЕ
	|				(ВходящийНДС.СуммаНДС)
	|		КОНЕЦ									КАК СуммаНДС,
	|		ВЫБОР
	|			КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				-(ВходящийНДС.СуммаБезНДСВалютная)
	|			ИНАЧЕ
	|				(ВходящийНДС.СуммаБезНДСВалютная)
	|		КОНЕЦ									КАК СуммаБезНДСВалютная,
	|		ВЫБОР
	|			КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ТОГДА
	|				-(ВходящийНДС.СуммаНДСВалютная)
	|			ИНАЧЕ
	|				(ВходящийНДС.СуммаНДСВалютная)
	|		КОНЕЦ									КАК СуммаНДСВалютная
	|	ИЗ
	|		РегистрНакопления.ВходящийНДС	КАК ВходящийНДС
	|	ГДЕ
	|		Регистратор = &ДокументСсылка
	|	)	КАК Остатки
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ИспользоватьОтборСчетФактура ТОГДА
	|			СчетФактура В (&ОтборСчетФактура)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользоватьОтборОбъектНалогообложения ТОГДА
	|			ОбъектНалогообложения В (&ОтборОбъектНалогообложения)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользоватьОтборКФО ТОГДА
	|			КФО В (&ОтборКФО)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользоватьОтборПодразделение ТОГДА
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(СчетФактура) = ТИП(Документ.ВводНачальныхОстатков) ТОГДА
	|					СчетФактура.ПодразделениеОрганизации
	|				ИНАЧЕ
	|					СчетФактура.Подразделение
	|			КОНЕЦ В (&ОтборПодразделение)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ИспользоватьОтборИФО ТОГДА
	|			СчетФактура.ИФО В (&ОтборИФО)
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	Организация,
	|	СчетФактура,
	|	ПричинаНалогообложения,
	|	ВидЦенности,
	|	КФО,
	|	СчетРасчетов,
	|	КПССчетРасчетов,
	|	СчетКредита,
	|	ОбъектНалогообложения,
	|	СтавкаНДС,
	|	ДокументКорректировки,
	|	МестоРегистрации,
	|	Сторно,
	|	СчетФактура.Дата,
	|	СчетФактура.Контрагент,
	|	СчетФактура.Договор,
	|	ЕСТЬNULL(
	|		ОбъектНалогообложения.Дата,
	|		СчетФактура.Дата),
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиПокупка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиАванс) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиАвансПолученныйПредъявленныйКомиссионером) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиНалоговыйАгент) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПричинаНалогообложения В(&ПричиныНалогообложенияЗакладкиХозСпособ) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА МестоРегистрации = ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.КнигаПокупок)
	|			ИЛИ МестоРегистрации = ЗНАЧЕНИЕ(Перечисление.МестаРегистрацииСчетовФактур.ПустаяСсылка) ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ
	|ИМЕЮЩИЕ
	|	СУММА(СуммаБезНДС) <> 0 ИЛИ СУММА(СуммаНДС) <> 0
	|;";
	
	Возврат ЗапросОстатки;
	
КонецФункции

Функция ПолучитьНастройкиЧтенияОстатков(ДокументОбъект, ИспользоватьЗакладку = Неопределено)
	
	// Предполается два режима вызова:
	//
	//  - заполнение по данным учета
	//    (возвращаются сокращенные настройки)
	//
	//  - проверка заполнения, проведение
	//    (возвращаются полные настройки)
	
	РежимЗаполнениеПоДаннымУчета = (ИспользоватьЗакладку <> Неопределено);
	
	ПричиныНалогообложенияЗакладкиПокупка = Новый Массив();
	ПричиныНалогообложенияЗакладкиПокупка.Добавить(Перечисления.ПричиныНалогообложенияНДС.Покупка);
	ПричиныНалогообложенияЗакладкиПокупка.Добавить(Перечисления.ПричиныНалогообложенияНДС.СчетФактураНаПокупкуОтКомиссионера);
	ПричиныНалогообложенияЗакладкиПокупка.Добавить(Перечисления.ПричиныНалогообложенияНДС.СМРПодряднымСпособом);
	
	ПричиныНалогообложенияЗакладкиАванс = Новый Массив();
	ПричиныНалогообложенияЗакладкиАванс.Добавить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученный);
	
	ПричиныНалогообложенияЗакладкиАвансПолученныйПредъявленныйКомиссионером = Новый Массив();
	ПричиныНалогообложенияЗакладкиАвансПолученныйПредъявленныйКомиссионером.Добавить(Перечисления.ПричиныНалогообложенияНДС.СчетФактураКомитентаНаАванс);
	
	ПричиныНалогообложенияЗакладкиНалоговыйАгент = Новый Массив();
	ПричиныНалогообложенияЗакладкиНалоговыйАгент.Добавить(Перечисления.ПричиныНалогообложенияНДС.ПокупкаУНерезидентаНалоговыйАгент);
	ПричиныНалогообложенияЗакладкиНалоговыйАгент.Добавить(Перечисления.ПричиныНалогообложенияНДС.ПокупкаНалоговыйАгент);
	
	ПричиныНалогообложенияЗакладкиХозСпособ = Новый Массив();
	ПричиныНалогообложенияЗакладкиХозСпособ.Добавить(Перечисления.ПричиныНалогообложенияНДС.СМРХозяйственнымСпособом);
	ПричиныНалогообложенияЗакладкиХозСпособ.Добавить(Перечисления.ПричиныНалогообложенияНДС.ВнутреннееПотребление);
	
	ПричиныНалогообложенияЗакладкиТаможня = Новый Массив();
	ПричиныНалогообложенияЗакладкиТаможня.Добавить(Перечисления.ПричиныНалогообложенияНДС.ТаможенныеПлатежи);
	
	ПричиныНалогообложения = Новый Структура();
	ПричиныНалогообложения.Вставить("Покупка",				ПричиныНалогообложенияЗакладкиПокупка);
	ПричиныНалогообложения.Вставить("АвансыПолученные",		ПричиныНалогообложенияЗакладкиАванс);
	ПричиныНалогообложения.Вставить("АвансыПолученныеПредъявленныеКомиссионером",		ПричиныНалогообложенияЗакладкиАвансПолученныйПредъявленныйКомиссионером);
	ПричиныНалогообложения.Вставить("НДСНалоговогоАгента",	ПричиныНалогообложенияЗакладкиНалоговыйАгент);
	ПричиныНалогообложения.Вставить("СМРХозспособом", 		ПричиныНалогообложенияЗакладкиХозСпособ);
	ПричиныНалогообложения.Вставить("ТаможенныйНДС",		ПричиныНалогообложенияЗакладкиТаможня);
	
	Если ИспользоватьЗакладку = Неопределено Тогда
		// Определяем используемые закладки по заполненности соответствующих табличных частей
		// (проверка заполнения, проведение)
		
		ИспользоватьЗакладку = Новый Структура();
		ИспользоватьЗакладку.Вставить("Покупка",				(ДокументОбъект["Покупка"].Количество() > 0));
		ИспользоватьЗакладку.Вставить("АвансыПолученные",		(ДокументОбъект["АвансыПолученные"].Количество() > 0));
		ИспользоватьЗакладку.Вставить("НДСНалоговогоАгента",	(ДокументОбъект["НДСНалоговогоАгента"].Количество() > 0));
		ИспользоватьЗакладку.Вставить("СМРХозспособом", 		(ДокументОбъект["СМРХозспособом"].Количество() > 0));
		ИспользоватьЗакладку.Вставить("ТаможенныйНДС",			(ДокументОбъект["ТаможенныйНДС"].Количество() > 0));
		ИспользоватьЗакладку.Вставить("АвансыПолученныеПредъявленныеКомиссионером",	(ДокументОбъект["АвансыПолученныеПредъявленныеКомиссионером"].Количество() > 0));
		
	КонецЕсли;
	
	ДобавитьПричиныНалогообложенияДляВсехИспользуемыхЗакладок(ПричиныНалогообложения, ИспользоватьЗакладку);
	
	НастройкиЧтенияОстатков = Новый Структура();
	
	НастройкиЧтенияОстатков.Вставить("ДатаОстатков",			Новый Граница(КонецДня(ДокументОбъект["Дата"]), ВидГраницы.Включая));
	НастройкиЧтенияОстатков.Вставить("ЗаполнитьВалютныеСуммы",	УчетНДС.СледуетЗаполнитьВалютныеСуммы());
	НастройкиЧтенияОстатков.Вставить("ПричиныНалогообложения",	ПричиныНалогообложения);
	
	Если РежимЗаполнениеПоДаннымУчета Тогда
		// В этом режаме возвращаются сокращенные настройки
		
		Возврат НастройкиЧтенияОстатков;
		
	КонецЕсли;
	
	НастройкиЧтенияОстатков.Вставить("ИспользоватьЗакладку", ИспользоватьЗакладку);
	
	ОтборСчетФактура = Новый Массив();
	УчетНДС.ДобавитьВМассив(ОтборСчетФактура, ДокументОбъект["Покупка"].ВыгрузитьКолонку("СчетФактура"));
	УчетНДС.ДобавитьВМассив(ОтборСчетФактура, ДокументОбъект["АвансыПолученные"].ВыгрузитьКолонку("СчетФактура"));
	УчетНДС.ДобавитьВМассив(ОтборСчетФактура, ДокументОбъект["НДСНалоговогоАгента"].ВыгрузитьКолонку("СчетФактура"));
	УчетНДС.ДобавитьВМассив(ОтборСчетФактура, ДокументОбъект["АвансыПолученныеПредъявленныеКомиссионером"].ВыгрузитьКолонку("СчетФактура"));
	УчетНДС.ДобавитьВМассив(ОтборСчетФактура, ДокументОбъект["СМРХозспособом"].ВыгрузитьКолонку("СчетФактура"));
	УчетНДС.ДобавитьВМассив(ОтборСчетФактура, ДокументОбъект["ТаможенныйНДС"].ВыгрузитьКолонку("СчетФактура"));
	
	ОтборОбъектНалогообложения = Новый Массив();
	ОтборОбъектНалогообложения.Добавить(Неопределено);
	УчетНДС.ДобавитьВМассив(ОтборОбъектНалогообложения, ДокументОбъект["Покупка"].ВыгрузитьКолонку("ОбъектНалогообложения"));
	УчетНДС.ДобавитьВМассив(ОтборОбъектНалогообложения, ДокументОбъект["АвансыПолученные"].ВыгрузитьКолонку("ОбъектНалогообложения"));
	УчетНДС.ДобавитьВМассив(ОтборОбъектНалогообложения, ДокументОбъект["АвансыПолученныеПредъявленныеКомиссионером"].ВыгрузитьКолонку("ОбъектНалогообложения"));
	УчетНДС.ДобавитьВМассив(ОтборОбъектНалогообложения, ДокументОбъект["НДСНалоговогоАгента"].ВыгрузитьКолонку("ОбъектНалогообложения"));
	УчетНДС.ДобавитьВМассив(ОтборОбъектНалогообложения, ДокументОбъект["СМРХозспособом"].ВыгрузитьКолонку("ОбъектНалогообложения"));
	УчетНДС.ДобавитьВМассив(ОтборОбъектНалогообложения, ДокументОбъект["ТаможенныйНДС"].ВыгрузитьКолонку("ОбъектНалогообложения"));
	
	ОтборКФО = Новый Массив();
	УчетНДС.ДобавитьВМассив(ОтборКФО, ДокументОбъект["Покупка"].ВыгрузитьКолонку("КФО"));
	УчетНДС.ДобавитьВМассив(ОтборКФО, ДокументОбъект["АвансыПолученные"].ВыгрузитьКолонку("КФО"));
	УчетНДС.ДобавитьВМассив(ОтборКФО, ДокументОбъект["АвансыПолученныеПредъявленныеКомиссионером"].ВыгрузитьКолонку("КФО"));
	УчетНДС.ДобавитьВМассив(ОтборКФО, ДокументОбъект["НДСНалоговогоАгента"].ВыгрузитьКолонку("КФО"));
	УчетНДС.ДобавитьВМассив(ОтборКФО, ДокументОбъект["СМРХозспособом"].ВыгрузитьКолонку("КФО"));
	УчетНДС.ДобавитьВМассив(ОтборКФО, ДокументОбъект["ТаможенныйНДС"].ВыгрузитьКолонку("КФО"));
	
	Отбор = Новый Структура();
	Отбор.Вставить("СчетФактура",			ОтборСчетФактура);
	Отбор.Вставить("ОбъектНалогообложения",	ОтборОбъектНалогообложения);
	Отбор.Вставить("КФО",					ОтборКФО);
	
	ИспользоватьОтбор = Новый Структура();
	ИспользоватьОтбор.Вставить("СчетФактура",			(ОтборСчетФактура.Количество() > 0));
	ИспользоватьОтбор.Вставить("ОбъектНалогообложения",	(ОтборОбъектНалогообложения.Количество() > 0));
	ИспользоватьОтбор.Вставить("КФО",					(ОтборКФО.Количество() > 0));
	
	НастройкиЧтенияОстатков.Вставить("Отбор", Отбор);
	НастройкиЧтенияОстатков.Вставить("ИспользоватьОтбор", ИспользоватьОтбор);
	
	Возврат НастройкиЧтенияОстатков;
	
КонецФункции

Процедура ДобавитьПричиныНалогообложенияДляВсехИспользуемыхЗакладок(ПричиныНалогообложения, ИспользуемыеЗакладки)
	
	ВсеПричины = Новый Массив();
	
	Если ИспользуемыеЗакладки.Покупка Тогда
		УчетНДС.ДобавитьВМассив(ВсеПричины, ПричиныНалогообложения.Покупка);
	КонецЕсли;
	
	Если ИспользуемыеЗакладки.АвансыПолученные Тогда
		УчетНДС.ДобавитьВМассив(ВсеПричины, ПричиныНалогообложения.АвансыПолученные);
	КонецЕсли;
	
	Если ИспользуемыеЗакладки.АвансыПолученныеПредъявленныеКомиссионером Тогда
		УчетНДС.ДобавитьВМассив(ВсеПричины, ПричиныНалогообложения.АвансыПолученныеПредъявленныеКомиссионером);
	КонецЕсли;
	
	Если ИспользуемыеЗакладки.НДСНалоговогоАгента Тогда
		УчетНДС.ДобавитьВМассив(ВсеПричины, ПричиныНалогообложения.НДСНалоговогоАгента);
	КонецЕсли;
	
	Если ИспользуемыеЗакладки.СМРХозспособом Тогда
		УчетНДС.ДобавитьВМассив(ВсеПричины, ПричиныНалогообложения.СМРХозспособом);
	КонецЕсли;
	
	Если ИспользуемыеЗакладки.ТаможенныйНДС Тогда
		УчетНДС.ДобавитьВМассив(ВсеПричины, ПричиныНалогообложения.ТаможенныйНДС);
	КонецЕсли;
	
	ПричиныНалогообложения.Вставить("ВсеПричины", ВсеПричины);
	
КонецПроцедуры

Процедура ДобавитьДвиженияПоТабличнойЧасти(ИмяТЧ, ТаблицаТЧ, ОбщаяТаблицаОстатки, ТаблицыДляДвижений, ЗаполнитьВалютныеСуммы)
	
	ПоискОсновнойРазделКниги			= Новый Структура("ЗаписьДопЛиста", Ложь);
	ПоискДополнительныеЛистыКниги		= Новый Структура("ЗаписьДопЛиста", Истина);
	
	ТаблицаТЧ_ОсновнойРазделКниги		= ТаблицаТЧ.Скопировать(ПоискОсновнойРазделКниги);
	ТаблицаТЧ_ДополнительныеЛистыКниги	= ТаблицаТЧ.Скопировать(ПоискДополнительныеЛистыКниги);
	
	ТаблицаОстатки						= ОбщаяТаблицаОстатки.Скопировать(Новый Структура("ЭтоЗакладка" + ИмяТЧ, Истина));
	ТаблицаОстатки_ДляКнигиПокупок		= ТаблицаОстатки.Скопировать(Новый Структура("ОтразитьВКнигеПокупок", Истина));
	ТаблицаОстатки_ДляКнигиПродаж		= ТаблицаОстатки.Скопировать(Новый Структура("ОтразитьВКнигеПокупок", Ложь));
	
	Переименование = Новый Структура();
	
	Если ИмяТЧ = "Покупка" Тогда
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС,
			|ВидЦенности");
			
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		Если ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаБезНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
		КонецЕсли;
		
		Переименование.Вставить("ДатаПринятияКУчету", "ДатаСобытия");
		
	ИначеЕсли ИмяТЧ = "АвансыПолученные" Тогда
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС");
			
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		МассивИменКолонокПоказателей.Добавить("Всего");
		Если ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("ВсегоВалютная");
		КонецЕсли;
		
		Переименование.Вставить("ДатаЗачета", "ДатаСобытия");
		
	ИначеЕсли ИмяТЧ = "АвансыПолученныеПредъявленныеКомиссионером" Тогда
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС");
			
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		МассивИменКолонокПоказателей.Добавить("Всего");
		Если ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("ВсегоВалютная");
		КонецЕсли;
		
		Переименование.Вставить("ДатаЗачета", "ДатаСобытия");
		
	ИначеЕсли ИмяТЧ = "НДСНалоговогоАгента" Тогда
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС,
			|ВидЦенности");
			
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		Если ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаБезНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
		КонецЕсли;
		
		Переименование.Вставить("ДатаДокументаОснования", "ДатаСобытия");
		
	ИначеЕсли ИмяТЧ = "СМРХозспособом" Тогда
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС,
			|ВидЦенности");
			
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		Если ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаБезНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
		КонецЕсли;
		
		Переименование.Вставить("ДатаСчетаФактуры", "ДатаСобытия");
		
	ИначеЕсли ИмяТЧ = "ТаможенныйНДС" Тогда
		
		КоллекцияИменКолонокСвязи = Новый Структура("
			|СчетФактура,
			|ОбъектНалогообложения,
			|СчетРасчетов,
			|КПССчетРасчетов,
			|КФО,
			|СчетКредита,
			|СтавкаНДС,
			|ВидЦенности");
			
		МассивИменКолонокПоказателей = Новый Массив();
		МассивИменКолонокПоказателей.Добавить("СуммаБезНДС");
		МассивИменКолонокПоказателей.Добавить("СуммаНДС");
		Если ЗаполнитьВалютныеСуммы Тогда
			МассивИменКолонокПоказателей.Добавить("СуммаБезНДСВалютная");
			МассивИменКолонокПоказателей.Добавить("СуммаНДСВалютная");
		КонецЕсли;
		
		Переименование.Вставить("ДатаПринятияКУчету", "ДатаСобытия");
		
	КонецЕсли;
	
	//---
	// ВходящийНДС
	//---
	ТаблицаДвижений = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
		ТаблицаТЧ,
		ТаблицаОстатки,
		КоллекцияИменКолонокСвязи,
		МассивИменКолонокПоказателей,
		"СписанияВТаблице2ВРазмереТаблицы1")["СписанияВТаблице2ВРазмереТаблицы1"];
	Если ИмяТЧ = "АвансыПолученные" ИЛИ ИмяТЧ = "АвансыПолученныеПредъявленныеКомиссионером" Тогда
		УчетНДС.РассчитатьКолонкуСуммаБезНДС(ТаблицаДвижений);
	КонецЕсли;
	УчетНДС.ДобавитьВТаблицу(ТаблицыДляДвижений["ВходящийНДС"], ТаблицаДвижений);
	
	//---
	// КнигаПокупок
	//---
	Если ТаблицаТЧ_ОсновнойРазделКниги.Количество() > 0 Тогда
		ТаблицаДвижений = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаТЧ_ОсновнойРазделКниги,
			ТаблицаОстатки_ДляКнигиПокупок,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"СписанияВОбеихТаблицахВРазмереСоответствия")["СписанияВОбеихТаблицахВРазмереСоответствия"];
		Если ИмяТЧ = "АвансыПолученные" ИЛИ ИмяТЧ = "АвансыПолученныеПредъявленныеКомиссионером" Тогда
			УчетНДС.РассчитатьКолонкуСуммаБезНДС(ТаблицаДвижений);
		КонецЕсли;
		
		УчетНДС.ПереименоватьКолонки(ТаблицаДвижений, Переименование, "вперед");
		
		УчетНДС.ДобавитьВТаблицу(ТаблицыДляДвижений["КнигаПокупок"], ТаблицаДвижений, Истина);
	КонецЕсли;
	
	//---
	// ДополнительныеЛистыКнигиПокупок
	//---
	Если ТаблицаТЧ_ДополнительныеЛистыКниги.Количество() > 0 Тогда
		ТаблицаДвижений = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаТЧ_ДополнительныеЛистыКниги,
			ТаблицаОстатки_ДляКнигиПокупок,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"СписанияВОбеихТаблицахВРазмереСоответствия")["СписанияВОбеихТаблицахВРазмереСоответствия"];
		Если ИмяТЧ = "АвансыПолученные" ИЛИ ИмяТЧ = "АвансыПолученныеПредъявленныеКомиссионером" Тогда
			УчетНДС.РассчитатьКолонкуСуммаБезНДС(ТаблицаДвижений);
		КонецЕсли;
		
		УчетНДС.ПереименоватьКолонки(ТаблицаДвижений, Переименование, "вперед");
		
		УчетНДС.ДобавитьВТаблицу(ТаблицыДляДвижений["ДополнительныеЛистыКнигиПокупок"], ТаблицаДвижений, Истина);
	КонецЕсли;
	
	//---
	// КнигаПродаж
	//---
	Если ТаблицаТЧ_ОсновнойРазделКниги.Количество() > 0 Тогда
		ТаблицаДвижений = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаТЧ_ОсновнойРазделКниги,
			ТаблицаОстатки_ДляКнигиПродаж,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"СписанияВОбеихТаблицахВРазмереСоответствия")["СписанияВОбеихТаблицахВРазмереСоответствия"];
		Если ИмяТЧ = "АвансыПолученные" ИЛИ ИмяТЧ = "АвансыПолученныеПредъявленныеКомиссионером" Тогда
			УчетНДС.РассчитатьКолонкуСуммаБезНДС(ТаблицаДвижений);
		КонецЕсли;
		УчетНДС.ДобавитьВТаблицу(ТаблицыДляДвижений["КнигаПродаж"], ТаблицаДвижений, Истина);
	КонецЕсли;
	
	//---
	// ДополнительныеЛистыКнигиПродаж
	//---
	Если ТаблицаТЧ_ДополнительныеЛистыКниги.Количество() > 0 Тогда
		ТаблицаДвижений = ОбщегоНазначенияБГУ.СравнитьПоказателиТаблиц(
			ТаблицаТЧ_ДополнительныеЛистыКниги,
			ТаблицаОстатки_ДляКнигиПродаж,
			КоллекцияИменКолонокСвязи,
			МассивИменКолонокПоказателей,
			"СписанияВОбеихТаблицахВРазмереСоответствия")["СписанияВОбеихТаблицахВРазмереСоответствия"];
		Если ИмяТЧ = "АвансыПолученные" ИЛИ ИмяТЧ = "АвансыПолученныеПредъявленныеКомиссионером" Тогда
			УчетНДС.РассчитатьКолонкуСуммаБезНДС(ТаблицаДвижений);
		КонецЕсли;
		УчетНДС.ДобавитьВТаблицу(ТаблицыДляДвижений["ДополнительныеЛистыКнигиПродаж"], ТаблицаДвижений, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьДвиженияСчетаФактурыНаОтгрузкуДляКнигиПокупок(ТаблицыДляДвижений, ДокументОбъект)
	
	ТаблицаДвижений = РегистрыНакопления.СчетаФактурыНаОтгрузкуДляКнигиПокупок.СоздатьНаборЗаписей().Выгрузить();
	
	ПоискАвансов = Новый Структура("ИдентификаторСтроки");
	
	Для Каждого СтрокаСФНаОтгрузку Из ДокументОбъект.СчетаФактурыНаОтгрузку Цикл
		ЗаполнитьЗначенияСвойств(ПоискАвансов, СтрокаСФНаОтгрузку);
		
		МассивСтрок = ДокументОбъект.АвансыПолученные.НайтиСтроки(ПоискАвансов);
		
		// Все найденные строки таблицы авансов имеют совпадающие поля СчетФактура, ДатаЗачета.
		СтрокаАванса = МассивСтрок[0];
		
		Если Не ЗначениеЗаполнено(СтрокаАванса.СчетФактура) Тогда
			Продолжить;
		КонецЕсли;
		
		// Значение поля КорректируемыйПериод может различаться.
		СписокКорректируемыхПериодов = ПолучитьСписокРазличныхКорректируемыхПериодов(МассивСтрок);
		
		Для Каждого КорректируемыйПериод Из СписокКорректируемыхПериодов Цикл
			ДобавитьДвижениеСчетаФактурыНаОтгрузкуДляКнигиПокупок(ТаблицаДвижений, ДокументОбъект,
				СтрокаАванса, СтрокаСФНаОтгрузку, КорректируемыйПериод);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаДвижений.Свернуть("Период,Активность,"
		+ "Организация,СчетФактураНаАванс,ДатаЗачета,КорректируемыйПериод,"
		+ "СчетФактураНаОтгрузку,НомерСчетаФактуры,ДатаСчетаФактуры");
	
	ТаблицыДляДвижений.Вставить("СчетаФактурыНаОтгрузкуДляКнигиПокупок", ТаблицаДвижений);
	
КонецПроцедуры

Функция ПолучитьСписокРазличныхКорректируемыхПериодов(МассивСтрокАвансыПолученные)
	
	ПустаяДата = '00010101';
	
	СписокЗначений = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из МассивСтрокАвансыПолученные Цикл
		Если СтрокаТаблицы.ЗаписьДопЛиста Тогда
			КорректируемыйПериод = СтрокаТаблицы.КорректируемыйПериод;
		Иначе
			КорректируемыйПериод = ПустаяДата;
		КонецЕсли;
		
		Если СписокЗначений.Найти(КорректируемыйПериод) = Неопределено Тогда
			СписокЗначений.Добавить(КорректируемыйПериод);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокЗначений;
	
КонецФункции

Процедура ДобавитьДвижениеСчетаФактурыНаОтгрузкуДляКнигиПокупок(ТаблицаДвижений, ДокументОбъект,
		СтрокаАванса, СтрокаСФНаОтгрузку, КорректируемыйПериод)
	
	НоваяСтрока = ТаблицаДвижений.Добавить();
	
	НоваяСтрока.Период					= ДокументОбъект.Дата;
	НоваяСтрока.Активность				= Истина;
	НоваяСтрока.Организация				= ДокументОбъект.Организация;
	НоваяСтрока.СчетФактураНаАванс		= СтрокаАванса.СчетФактура;
	НоваяСтрока.ДатаЗачета				= СтрокаАванса.ДатаЗачета;
	НоваяСтрока.КорректируемыйПериод	= КорректируемыйПериод;
	
	НоваяСтрока.СчетФактураНаОтгрузку	= СтрокаСФНаОтгрузку.СчетФактура;
	НоваяСтрока.НомерСчетаФактуры		= СтрокаСФНаОтгрузку.Номер;
	НоваяСтрока.ДатаСчетаФактуры		= СтрокаСФНаОтгрузку.Дата;
	
КонецПроцедуры

Процедура ЗаполнитьКодыВидовОпераций(ЗаполняемаяТаблица, ИмяТабличнойЧасти)
	
	// Для различных строк табличной части могут установиться различные коды видов операций
	
	ЗаполняемаяТаблица.Колонки.Добавить("КодВидаОперации", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(2)));
	
	ОсновныеПараметры = Новый Структура();
	ОсновныеПараметры.Вставить("ВидЗаполняемогоДокумента",	"ФормированиеЗаписейКнигиПокупок");
	ОсновныеПараметры.Вставить("ИмяТабличнойЧасти",			ИмяТабличнойЧасти);
	
	ОсновныеПараметры.Вставить("Контрагент",				Неопределено);
	ОсновныеПараметры.Вставить("Договор",					Неопределено);
	ОсновныеПараметры.Вставить("ТипДоговораНДС",			Неопределено);
	
	Для Каждого СтрокаТаблицы Из ЗаполняемаяТаблица Цикл
		ЗаполнитьЗначенияСвойств(ОсновныеПараметры, СтрокаТаблицы);
		ОсновныеПараметры.Вставить("ДокументОснование", СтрокаТаблицы["СчетФактура"]);
		
		КодВидаОперации = УчетНДС.ПолучитьКодВидаОперации(ОсновныеПараметры);
		
		СтрокаТаблицы["КодВидаОперации"] = КодВидаОперации;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКолонкуКПС30304(РезультатыЗаполнения, ШапкаДокумента, ИменаИсключений = Неопределено)
	
	СчетаФактуры = Новый Массив();
	
	Для Каждого Элемент Из РезультатыЗаполнения Цикл
		ИмяТЧ = Элемент.Ключ;
		
		Если ТипЗнч(ИменаИсключений) = Тип("Массив") И ИменаИсключений.Найти(ИмяТЧ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТЧ = Элемент.Значение;
		
		Если ТЧ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТЧ.Колонки.Найти("КПС30304") = Неопределено Тогда
			ТЧ.Колонки.Добавить("КПС30304", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СчетаФактуры, ТЧ.ВыгрузитьКолонку("СчетФактура"));
	КонецЦикла;
	
	Если СчетаФактуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКПС = ПолучитьТаблицуКПС30304(СчетаФактуры);
	
	ПоляПоиска = "СчетФактура";
	
	Поиск = Новый Структура(ПоляПоиска);
	
	ТаблицаКПС.Индексы.Добавить(ПоляПоиска);
	
	Для Каждого Элемент Из РезультатыЗаполнения Цикл
		ИмяТЧ = Элемент.Ключ;
		
		Если ТипЗнч(ИменаИсключений) = Тип("Массив") И ИменаИсключений.Найти(ИмяТЧ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТЧ = Элемент.Значение;
		
		Для Каждого СтрокаТЧ Из ТЧ Цикл
			ЗаполнитьЗначенияСвойств(Поиск, СтрокаТЧ);
			
			МассивСтрок = ТаблицаКПС.НайтиСтроки(Поиск);
			
			Если МассивСтрок.Количество() > 0 Тогда
				СтрокаТЧ["КПС30304"] = МассивСтрок[0]["КПС30304"];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗаполнитьПустыеКПС30304ПоРабочемуПлануСчетов(РезультатыЗаполнения, ШапкаДокумента, ИменаИсключений);
	
КонецПроцедуры

Функция ПолучитьТаблицуКПС30304(СчетаФактуры)
	
	ИменаРеквизитов = Новый Массив();
	ИменаРеквизитов.Добавить("КПС_30304");
	ИменаРеквизитов.Добавить("КПС30304");
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("МассивСсылок",		СчетаФактуры);
	ЗапросПоиск.УстановитьПараметр("ИменаРеквизитов",	ИменаРеквизитов);
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Актуальные типовые операции
	|//
	|ВЫБРАТЬ
	|	ТиповыеОперации.Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	ТиповыеОперацииСчетФактураПолученный
	|ИЗ
	|	Справочник.ТиповыеОперации КАК ТиповыеОперации
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО	ТиповыеОперации.ИдентификаторДокумента = ИдентификаторыОбъектовМетаданных.Ссылка
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.ПолноеИмя = ""Документ.СчетФактураПолученный""
	|	И НЕ ТиповыеОперации.ПометкаУдаления
	|	И НЕ ТиповыеОперации.НеИспользуется
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Реквизиты актуальных типовых операций
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	РеквизитыТиповыхОперацийСчетФактураПолученный
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций
	|ГДЕ
	|	Владелец В(
	|		ВЫБРАТЬ
	|			Ссылка
	|		ИЗ
	|			ТиповыеОперацииСчетФактураПолученный)
	|	И ИмяДляФормулы В(&ИменаРеквизитов)
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Одно значение КПС для каждого счета-фактуры
	|//
	|// Из документов СчетФактураПолученный
	|ВЫБРАТЬ
	|	ЗначенияДополнительныхРеквизитовОпераций.Объект		КАК СчетФактура,
	|	ЗначенияДополнительныхРеквизитовОпераций.Значение	КАК КПС30304
	|ИЗ
	|	РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеквизитыТиповыхОперацийСчетФактураПолученный
	|		ПО	ЗначенияДополнительныхРеквизитовОпераций.Объект В(&МассивСсылок)
	|		И	ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации = РеквизитыТиповыхОперацийСчетФактураПолученный.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Из документов СчетФактураВыданный
	|ВЫБРАТЬ
	|	Ссылка				КАК СчетФактура,
	|	МАКСИМУМ(КПС30304)	КАК КПС30304
	|ИЗ
	|	Документ.СчетФактураВыданный.СоставНФА
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|	И КПС30304 <> ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|;";
	
	Возврат ЗапросПоиск.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьПустыеКПС30304ПоРабочемуПлануСчетов(РезультатыЗаполнения, ШапкаДокумента, ИменаИсключений)
	
	// Если для какого-то счета-фактуры КПС 303.04 оказался незаполненным,
	// то определим КПС по рабочему плану счетов.
	// Дату и КФО для такого определения возьмем из уже заполненных табличных частей.
	
	Организация = ШапкаДокумента["Организация"];
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		ИФО = ШапкаДокумента["ИФО"];
	Иначе
		ИФО = Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка();
	КонецЕсли;
	
	ОписаниеТаблицы = Новый Структура();
	ОписаниеТаблицы.Вставить("ИмяКолонкиДата",	"ДатаСчетаФактуры");
	ОписаниеТаблицы.Вставить("ИмяКолонкиКФО",	"КФО");
	ОписаниеТаблицы.Вставить("ИмяКолонкиКПС",	"КПС30304");
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("СторонаПроводки",				"Дт");
	ПараметрыЗаполнения.Вставить("Организация",					Организация);
	ПараметрыЗаполнения.Вставить("Счет",						БухгалтерскийУчет.СчетПоКоду("303.04"));
	ПараметрыЗаполнения.Вставить("ИФО",							ИФО);
	ПараметрыЗаполнения.Вставить("ЗаполнитьКолонкуКПС",			Истина);
	ПараметрыЗаполнения.Вставить("ЗаполнитьТолькоПустыеПоля",	Истина);
	
	Для Каждого Элемент Из РезультатыЗаполнения Цикл
		ИмяТЧ = Элемент.Ключ;
		
		Если ТипЗнч(ИменаИсключений) = Тип("Массив") И ИменаИсключений.Найти(ИмяТЧ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТЧ = Элемент.Значение;
		
		Если ТЧ.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Поиск = Новый Структура("КПС30304", Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка());
		
		МассивСтрок = ТЧ.НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() > 0 Тогда
			УчетНДС.ЗаполнитьТаблицуПоРабочемуПлануСчетов(ТЧ, ОписаниеТаблицы, ПараметрыЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуПокупка(ОстаткиДляТаблицыПокупка, Организация, ОбъектыВложений, ДатаНачалаОборотов, ДатаОстатков)
	
	ТаблицаПокупка = ОстаткиДляТаблицыПокупка;
	
	ТаблицаПокупка.Колонки.Добавить("ДатаПринятияКУчету", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	
	ДатыДокументов = ТаблицаПокупка.ВыгрузитьКолонку("ДатаСчетаФактуры");
	
	ТаблицаПокупка.ЗагрузитьКолонку(ДатыДокументов, "ДатаПринятияКУчету");
	
	КолонкиГруппировок = "
		|КФО,
		|ДатаСчетаФактуры,
		|СчетФактура,
		|ВидЦенности,
		|Контрагент,
		|ДатаПринятияКУчету,
		|ОбъектНалогообложения,
		|СчетРасчетов,
		|КПССчетРасчетов,
		|СтавкаНДС,
		|СчетКредита";
	
	КолонкиСуммирования = "
		|СуммаБезНДС,
		|СуммаНДС,
		|СуммаБезНДСВалютная,
		|СуммаНДСВалютная";
	
	ТаблицаПокупка.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	ТаблицаПокупка.Сортировать("ДатаПринятияКУчету,ДатаСчетаФактуры,СчетФактура,ОбъектНалогообложения,СчетРасчетов,КПССчетРасчетов,КФО");
	
	ТаблицаПокупка.Колонки.Добавить("ПоУчету", Новый ОписаниеТипов("Булево"));
	ТаблицаПокупка.ЗаполнитьЗначения(Истина, "ПоУчету");
	
	Возврат ТаблицаПокупка;
	
КонецФункции

Процедура ЗаполнитьКолонкиВсегоТаможенныйНДС(Таблица)
	
	ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	Таблица.Колонки.Добавить("Всего",			ТипЧисло);
	Таблица.Колонки.Добавить("ВсегоВалютная",	ТипЧисло);
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы["Всего"]			= СтрокаТаблицы["СуммаБезНДС"]			+ СтрокаТаблицы["СуммаНДС"];
		СтрокаТаблицы["ВсегоВалютная"]	= СтрокаТаблицы["СуммаБезНДСВалютная"]	+ СтрокаТаблицы["СуммаНДСВалютная"];
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
