
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		НаборЗаписей.Отбор.Номенклатура.Значение = Номенклатура;
		НаборЗаписей.Отбор.Номенклатура.Использование = Истина;
	КонецЕсли;
	
	ТекПериод = Параметры.Период;
	
	Если НЕ ЗначениеЗаполнено(ТекПериод) Тогда
		ТекПериод = РегистрыСведений.НастройкаИспользованияИдентификаторовПлательщика.ПолучитьПериодАктуальныхНастроек(Номенклатура);
	КонецЕсли;
	
	ПериодИсходный = ТекПериод;
	
	Если НЕ ЗначениеЗаполнено(ТекПериод) Тогда
		ТекПериод = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекПериод) Тогда	
		НаборЗаписей.Отбор.Период.Значение = ТекПериод;
		НаборЗаписей.Отбор.Период.Использование = Истина;
	КонецЕсли;
		
	НоменклатураИсходная = Номенклатура;
	
    ТекНабор = РеквизитФормыВЗначение("НаборЗаписей");
	ТекНабор.Прочитать();
	ЗначениеВРеквизитФормы(ТекНабор,"НаборЗаписей");
	
	НаборЗаписей.Сортировать("Порядок");
	
	Элементы.ВидАльтИдентификатора.СписокВыбора.Добавить(Справочники.ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.ПустаяСсылка(),"Единый идентификатор");
	
	Элементы.Номенклатура.ТолькоПросмотр = ЗначениеЗаполнено(Номенклатура);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ПериодИсходный) 
		И НЕ ТекПериод = ПериодИсходный 
		И ЗначениеЗаполнено(НоменклатураИсходная)
		И НоменклатураИсходная = Номенклатура 
		И НЕ ПараметрыЗаписи.Свойство("Записать") Тогда
		
		ТекстВопроса = Нстр("ru='Изменился период (исправлена ошибка) или это новая запись?'");
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Исправление","Изменился период");
		СписокКнопок.Добавить("Новая","Новая запись");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, Новый Структура("ПараметрыЗаписи", ПараметрыЗаписи)), ТекстВопроса,СписокКнопок);
		
		Отказ = Истина;
		
		Возврат;
		
	КонецЕсли;
	
	Инд = 0;
	Для Каждого Запись Из НаборЗаписей Цикл
		Запись.Номенклатура = Номенклатура;
		Запись.Период = ТекПериод;
		Запись.Порядок = Инд;
		Инд = Инд+1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрыЗаписи = ДополнительныеПараметры.ПараметрыЗаписи;
	
	
	Если РезультатВопроса = "Исправление" Тогда
		ПараметрыЗаписи.Вставить("Номенклатура", Номенклатура);
		ПараметрыЗаписи.Вставить("Период", ПериодИсходный);
		
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("Записать", Истина);
	
	Записать(ПараметрыЗаписи);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("Номенклатура") Тогда
		НаборЗ = РегистрыСведений.НастройкаИспользованияИдентификаторовПлательщика.СоздатьНаборЗаписей();
		НаборЗ.Отбор.Период.Значение = ПараметрыЗаписи.Период;
		НаборЗ.Отбор.Период.Использование = Истина;
		
		НаборЗ.Отбор.Номенклатура.Значение = ПараметрыЗаписи.Номенклатура;
		НаборЗ.Отбор.Номенклатура.Использование = Истина;
		НаборЗ.Записывать = Истина;
		НаборЗ.Записать();
	КонецЕсли;
	
    ПериодИсходный = ТекПериод;
	Номенклатура = НоменклатураИсходная;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеХарактеристикГосуслуги", Номенклатура);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	НаборЗаписей.Отбор.Период.Значение = ТекПериод;
	НаборЗаписей.Отбор.Период.Использование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НаборЗаписей.Отбор.Номенклатура.Значение = Номенклатура;
	НаборЗаписей.Отбор.Номенклатура.Использование = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТЧНаСервере()
	
	МассивИспИд = НаборЗаписей.Выгрузить().ВыгрузитьКолонку("ВидАльтИдентификатора");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.Ссылка
		|ИЗ
		|	Справочник.ВидыАльтернативныхИдентификаторовПолучателейГосуслуг КАК ВидыАльтернативныхИдентификаторовПолучателейГосуслуг
		|ГДЕ
		|	НЕ ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.Ссылка В (&Ссылки)
		|	И ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.Префикс,
		|	ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.Наименование";

	Запрос.УстановитьПараметр("Ссылки", МассивИспИд);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если МассивИспИд.Найти(Справочники.ВидыАльтернативныхИдентификаторовПолучателейГосуслуг.ПустаяСсылка())=Неопределено Тогда
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Использовать = Истина;
	КонецЕсли;
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЗапись = НаборЗаписей.Добавить();
		НовЗапись.Использовать = Истина;
		НовЗапись.ВидАльтИдентификатора = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
