#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

// Таблица источника данных "Поступление услуг, работ".
// 
// Параметры:
//  Параметры - Структура
// 
// Возвращаемое значение:
//  см. УчетРасчетов.ПустаяТаблицаПоступлениеУслугРаботПоДокументу
Функция ТаблицаПоступлениеУслугРаботПоДокументу(Параметры) Экспорт
	ТаблицаДокумента = УчетРасчетов.ПустаяТаблицаПоступлениеУслугРаботПоДокументу();

	СчетРасчетов = УчетРасчетов.ОпределитьСчетРасчетовПоПараметрам(Параметры, "Поступление",
		Дата, Организация, ИФО);
	// При поступлении нужно анализировать переданный групповой счет, чтобы понимать
	// это от поставщика или подотчетника
	СчетРасчетовИзПараметров = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры,
		"СчетРасчетов",
		ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	ЭтоСчет208 = ЗначениеЗаполнено(СчетРасчетовИзПараметров)
		И БухгалтерскийУчет.СчетВИерархии(СчетРасчетовИзПараметров, "208.00");
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Для Каждого Строка Из УслугиИРаботы Цикл
		
		НоваяСтрока = ТаблицаДокумента.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Не ИспользоватьВалютныйУчет И Не ЗначениеЗаполнено(НоваяСтрока.Валюта) Тогда
			НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
		КонецЕсли;
		
		Если Не ЭтоСчет208 И ЗначениеЗаполнено(СчетРасчетов) Тогда
			НоваяСтрока.СчетРасчетов = СчетРасчетов;
		Иначе
			НоваяСтрока.СчетРасчетов = БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(
				Строка.КЭК,
				?(ЭтоСчет208, "208.00", "302.00"), ,
				Дата, Организация, ИФО);
		КонецЕсли;
		
	КонецЦикла;
	ТаблицаДокумента.ЗаполнитьЗначения("УслугиИРаботы", "ИмяСписка");
	ТаблицаДокумента.ЗаполнитьЗначения(НСтр("ru ='Услуги и работы'"), "СинонимСписка");
	
	Возврат ТаблицаДокумента;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем Основание;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Неопределено") Тогда
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ВалютаДокумента = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ВалютаДокумента",
			Константы.ВалютаРегламентированногоУчета.Получить());
		
		ДанныеЗаполнения.Свойство("Основание", Основание);
		
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			
			Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(Основание.Организация) Тогда
				РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(Основание);
				Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
					ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(Основание, РазличающаясяНоменклатураКонтрагентаИОрганизации);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			КонецЕсли;	
			
			Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ЗаполнитьПоЭлектронномуДокументуПоставщика(
				ЭтотОбъект, ДанныеЗаполнения.Основание, ДанныеЗаполнения.НоменклатураДляОтраженияВУчете.Выгрузить());
		КонецЕсли;
		
	Иначе
		
		Если Не ЗначениеЗаполнено(Дата) Тогда
			Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Договоры") Тогда
			
			ЗаполнитьПоДоговору(ДанныеЗаполнения);
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам") Тогда
			
			ЗаполнитьПоРегистрацииОбязательства(ДанныеЗаполнения);
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда

			Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(ДанныеЗаполнения.Организация) Тогда
				РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(ДанныеЗаполнения);
				Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
					ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(ДанныеЗаполнения, РазличающаясяНоменклатураКонтрагентаИОрганизации);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			КонецЕсли;	
			
			Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ЗаполнитьПоЭлектронномуДокументуПоставщика(
				ЭтотОбъект, ДанныеЗаполнения);
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеКонтрагентамГИСГМП") Тогда
			
			Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ЗаполнитьПоНачислениеКонтрагентамГИСГМП(
				ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеУслугРаботПоСчетамУчетаЗатрат") Тогда
			
			Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ЗаполнитьПоПоступлениюУслугРаботПоСчетамУчетаЗатратРезерв(
				ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеУслугРабот") Тогда
			
			Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ЗаполнитьПоПоступлениюУслугРабот(
				ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктПриемкиТоваровРаботУслуг") Тогда
			
			ЗаполнитьПоАктуПриемкиТоваровРаботУслуг(ДанныеЗаполнения,СтандартнаяОбработка);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	УправлениеНФА.ПроверитьЗаполнениеДокументаЕслиПервичныйДокументАктПриемкиТРУ(ЭтотОбъект, РежимЗаписи);
	
	ОчиститьНеиспользуемыеРеквизитыТЧ();
	СуммаДокумента = УслугиИРаботы.Итог("Всего");
	
	КонтрольИсполненияДоговоров.ОчиститьДвиженияРегистровПодсистемы(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удаление записей в регистре при установке пометки удаления
	УправлениеНФА.УдалитьНезарегистрированноеПоступлениеНФАПоАктуПриемки(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	УчетРасчетов.ЗачетАвансовВыданныхОбработкаПроверкиЗаполнения(ЭтотОбъект, НепроверяемыеРеквизиты, Отказ);
	ПроверитьЗаполнениеСчетовИСубконто(Отказ, НепроверяемыеРеквизиты);

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеСчетовИСубконто(Отказ, НепроверяемыеРеквизиты)
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СчетЗатрат");
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СубконтоЗатрат1");
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СубконтоЗатрат2");
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СубконтоЗатрат3");
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СчетЗатратНУ");
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СубконтоЗатратНУ1");
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СубконтоЗатратНУ2");
	НепроверяемыеРеквизиты.Добавить("УслугиИРаботы.СубконтоЗатратНУ3");
	
	МетаданныеТЧ = Метаданные().ТабличныеЧасти.УслугиИРаботы;
	НаименованиеТаблицы = МетаданныеТЧ.Синоним;
	НаименованиеКолонкиСчетЗатрат = МетаданныеТЧ.Реквизиты.СчетЗатрат.Синоним;
	НаименованияКолонокСубконто = Новый Массив(3);
	НаименованияКолонокСубконто[0] = МетаданныеТЧ.Реквизиты.СубконтоЗатрат1.Синоним;
	НаименованияКолонокСубконто[1] = МетаданныеТЧ.Реквизиты.СубконтоЗатрат2.Синоним;
	НаименованияКолонокСубконто[2] = МетаданныеТЧ.Реквизиты.СубконтоЗатрат3.Синоним;
	НаименованиеКолонкиСчетЗатратНУ = МетаданныеТЧ.Реквизиты.СчетЗатратНУ.Синоним;
	НаименованияКолонокСубконтоНУ = Новый Массив(3);
	НаименованияКолонокСубконтоНУ[0] = МетаданныеТЧ.Реквизиты.СубконтоЗатратНУ1.Синоним;
	НаименованияКолонокСубконтоНУ[1] = МетаданныеТЧ.Реквизиты.СубконтоЗатратНУ2.Синоним;
	НаименованияКолонокСубконтоНУ[2] = МетаданныеТЧ.Реквизиты.СубконтоЗатратНУ3.Синоним;
	НаименованияКолонкиКарточкаКапвложений = МетаданныеТЧ.Реквизиты.КарточкаКапвложений.Синоним;

	ДанныеСчетов = ДанныеСчетовДокумента();
	ВсеСчета106 = ВсеСчета106ОС();
	КФОНУ = НалоговыйУчетКлиентСервер.ПолучитьМассивКФОдляНалоговогоУчета();
	ПлательщикНалогаНаПрибыль = НалоговыйУчетВызовСервера.ПлательщикНалогаНаПрибыль(Организация, Дата);
	
	Для Каждого Строка Из УслугиИРаботы Цикл
		Если Не ПроверитьЗаполнениеРеквизита(Строка, "СчетЗатрат",
				НаименованиеТаблицы, НаименованиеКолонкиСчетЗатрат, Отказ) Тогда
			Продолжить;
		КонецЕсли;
		ДанныеСчета = ДанныеСчетов.Получить(Строка.СчетЗатрат);
		Если ДанныеСчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для НомерСубконто = 1 По ДанныеСчета.КоличествоСубконто Цикл
			Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСчета,
					"СубконтоОбязательный" + НомерСубконто, Ложь) Тогда
				ПроверитьЗаполнениеРеквизита(Строка, "СубконтоЗатрат" + НомерСубконто,
					НаименованиеТаблицы, НаименованияКолонокСубконто[НомерСубконто - 1], Отказ);
			КонецЕсли;
		КонецЦикла;
		Если ПлательщикНалогаНаПрибыль И КФОНУ.Найти(Строка.КФО) <> Неопределено Тогда
			ПроверитьЗаполнениеРеквизита(Строка, "СчетЗатратНУ",
					НаименованиеТаблицы, НаименованиеКолонкиСчетЗатратНУ, Отказ);
			ДанныеСчетаНУ = ДанныеСчетов.Получить(Строка.СчетЗатратНУ);
			Если ДанныеСчетаНУ = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Для НомерСубконто = 1 По ДанныеСчетаНУ.КоличествоСубконто Цикл
				Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСчетаНУ,
						"СубконтоОбязательный" + НомерСубконто, Ложь) Тогда
					ПроверитьЗаполнениеРеквизита(Строка, "СубконтоЗатратНУ" + НомерСубконто,
						НаименованиеТаблицы, НаименованияКолонокСубконтоНУ[НомерСубконто - 1], Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ВсеСчета106.Получить(Строка.СчетЗатрат) <> Неопределено
				И Строка.ОтразитьВКарточкеКапвложений Тогда
			ПроверитьЗаполнениеРеквизита(Строка, "КарточкаКапвложений",
					НаименованиеТаблицы, НаименованияКолонкиКарточкаКапвложений, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьЗаполнениеРеквизита(Строка, Реквизит, НаименованиеТаблицы, НаименованиеРеквизита, Отказ)
	Если Не ЗначениеЗаполнено(Строка[Реквизит]) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",
				"Заполнение",
				НаименованиеРеквизита,
				Строка.НомерСтроки,
				НаименованиеТаблицы),
			,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("УслугиИРаботы", Строка.НомерСтроки, Реквизит),
			"Объект",
			Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ДанныеСчетовДокумента()
	ТаблицаСчетов = УслугиИРаботы.Выгрузить(, "СчетЗатрат, СчетЗатратНУ");
	ВсеСчетаДокумента = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСчетаДокумента, ТаблицаСчетов.ВыгрузитьКолонку("СчетЗатрат"));
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеСчетаДокумента, ТаблицаСчетов.ВыгрузитьКолонку("СчетЗатратНУ"));
	Возврат Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ДанныеСчетов(ВсеСчетаДокумента);

КонецФункции

Функция ВсеСчета106ОС()
	ВсеСчета106ОС = Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ВсеСчета106ОС();
	СоответствиеСчетов = Новый Соответствие;

	Для Каждого Счет Из ВсеСчета106ОС Цикл
        СоответствиеСчетов.Вставить(Счет, Счет);
	КонецЦикла;
	Возврат СоответствиеСчетов;
КонецФункции

Процедура ОчиститьНеиспользуемыеРеквизитыТЧ()
	ДанныеСчетов = ДанныеСчетовДокумента();
	ВсеСчета106 = ВсеСчета106ОС();
	КФОНУ = НалоговыйУчетКлиентСервер.ПолучитьМассивКФОдляНалоговогоУчета();
	ПлательщикНалогаНаПрибыль = НалоговыйУчетВызовСервера.ПлательщикНалогаНаПрибыль(Организация, Дата);
	ВидСубконтоВидЗатрат = ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат;
	
	Для Каждого Строка Из УслугиИРаботы Цикл
		Если ЗначениеЗаполнено(Строка.СчетЗатрат) Тогда
			ДанныеСчета = ДанныеСчетов.Получить(Строка.СчетЗатрат);
			КоличествоСубконто = ДанныеСчета.КоличествоСубконто;
			Для Индекс = 1 По 3 Цикл
				Если Индекс > КоличествоСубконто Тогда
					Строка["СубконтоЗатрат" + Индекс] = Неопределено;
				Иначе
					ВидСубконто = ДанныеСчета["ВидСубконто" + Индекс];
					Если ВидСубконто = ВидСубконтоВидЗатрат Тогда
						Строка["СубконтоЗатрат" + Индекс] = Строка.ВидЗатрат;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ПлательщикНалогаНаПрибыль
				И КФОНУ.Найти(Строка.КФО) <> Неопределено
				И ЗначениеЗаполнено(Строка.СчетЗатратНУ) Тогда
					
			ДанныеСчета = ДанныеСчетов.Получить(Строка.СчетЗатратНУ);
			КоличествоСубконто = ДанныеСчета.КоличествоСубконто;
			Для Индекс = 1 По 3 Цикл
				Если Индекс > КоличествоСубконто Тогда
					Строка["СубконтоЗатратНУ" + Индекс] = Неопределено;
				Иначе
					ВидСубконто = ДанныеСчета["ВидСубконто" + Индекс];
					Если ВидСубконто = ВидСубконтоВидЗатрат Тогда
						Строка["СубконтоЗатратНУ" + Индекс] = Строка.ВидЗатрат;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Строка.СчетЗатратНУ = Неопределено;
			Строка.СубконтоЗатратНУ1 = Неопределено;
			Строка.СубконтоЗатратНУ2 = Неопределено;
			Строка.СубконтоЗатратНУ3 = Неопределено;
		КонецЕсли;
		
		Если ВсеСчета106.Получить(Строка.СчетЗатрат) = Неопределено Тогда
			Строка.ОтразитьВКарточкеКапвложений = Ложь;
			Строка.КарточкаКапвложений = Справочники.КарточкиКапвложений.ПустаяСсылка();
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

#Область ЗаполнениеДокумента

// Заполняет документ по договору, в котором указан предмет договора.
// 
// Параметры:
// 	ДанныеЗаполнения - СправочникСсылка.Договоры - Договор
Процедура ЗаполнитьПоДоговору(ДанныеЗаполнения)
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
		
	Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ЗаполнитьПоДоговору(ЭтотОбъект, ДанныеЗаполнения, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПоРегистрацииОбязательства(ДанныеЗаполнения)
	
	 ЗаполнитьПоДоговору(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Договор"));
	
КонецПроцедуры

Процедура ЗаполнитьПоАктуПриемкиТоваровРаботУслуг(ДанныеЗаполнения, СтандартнаяОбработка)
	ЗаполнениеРеквизитовОбъектов.ЗаполнитьРеквизитыДокументовПоУмолчаниюОбработкаЗаполнения(ЭтотОбъект, Неопределено,
		СтандартнаяОбработка);
	ПервичныйДокумент = ПервичныеДокументыБГУ.ПервичныйДокументАктПриемкиТРУ();
	Документы.ПоступлениеУслугРаботПоСчетамУчетаЗатрат.ЗаполнитьПоАктуПриемкиТоваровРаботУслуг(ЭтотОбъект, ДанныеЗаполнения);
	Если УслугиИРаботы.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Все услуги и работы уже приняты'");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли