#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Процедура выполняет первоначальное заполнение регистра сведений настройками по умолчанию.
//Процедура должна вызываться при изменении метаданных (изменения состава документов, изменении имени документа).
//
Процедура ОбновитьПереченьДокументовНастройки(ПараметрОбработчика = Неопределено) Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда // В подчиненных узлах РИБ не выполняется
		Возврат;
	КонецЕсли;
	
	// в режиме запуска, как обработчика обновления (*) выполяем только в монопольном режиме
	Если ТипЗнч(ПараметрОбработчика) = Тип("Структура") И ПараметрОбработчика.Свойство("МонопольныйРежим") Тогда
		Если ПараметрОбработчика.МонопольныйРежим = Ложь Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// при первоначальном заполнении ПараметрОбработчика = ИСТИНА
	Если ТипЗнч(ПараметрОбработчика) = Тип("Булево") Тогда
		ЭтоПервоначальноеЗаполнение = ПараметрОбработчика;
	Иначе
		ЭтоПервоначальноеЗаполнение = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Ссылка КАК ВидДокумента,
		|	ИдентификаторыОбъектовМетаданных.Предопределенный,
		|	ИдентификаторыОбъектовМетаданных.Наименование,
		|	ВЫБОР
		|		КОГДА &ЭтоПервоначальноеЗаполнение
		|			ТОГДА ВЫБОР
		|					КОГДА ИдентификаторыОбъектовМетаданных.Имя В (&МассивИменДокументовБезПрефикса)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(НастройкиПечатиПрефиксаНомера.ОбрезатьПрефикс, &ОбщаяНастройка)
		|	КОНЕЦ КАК ОбрезатьПрефикс,
		|	ВЫБОР
		|		КОГДА &ЭтоПервоначальноеЗаполнение
		|			ТОГДА ВЫБОР
		|					КОГДА ИдентификаторыОбъектовМетаданных.Имя В (&МассивИменДокументовБезПрефикса)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ
		|		ИНАЧЕ ЕСТЬNULL(НастройкиПечатиПрефиксаНомера.РучнаяНастройка, ЛОЖЬ)
		|	КОНЕЦ КАК РучнаяНастройка
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПечатиПрефиксаНомера КАК НастройкиПечатиПрефиксаНомера
		|		ПО (НастройкиПечатиПрефиксаНомера.ВидДокумента = ИдентификаторыОбъектовМетаданных.Ссылка)
		|ГДЕ
		|	(ИдентификаторыОбъектовМетаданных.Ссылка = &Ссылка
		|			ИЛИ ИдентификаторыОбъектовМетаданных.Родитель = &Ссылка)
		|	И ИдентификаторыОбъектовМетаданных.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИдентификаторыОбъектовМетаданных.Предопределенный УБЫВ,
		|	ИдентификаторыОбъектовМетаданных.Наименование";

	МассивИменДокументовБезПрефикса = Новый Массив;
	МассивИменДокументовБезПрефикса.Добавить("ПриходныйКассовыйОрдер");
	МассивИменДокументовБезПрефикса.Добавить("РасходныйКассовыйОрдер");
	МассивИменДокументовБезПрефикса.Добавить("ПриходныйОрдерФондовый");
	МассивИменДокументовБезПрефикса.Добавить("РасходныйОрдерФондовый");
	МассивИменДокументовБезПрефикса.Добавить("ВедомостьНаВыдачуДенегИзКассы");
	МассивИменДокументовБезПрефикса.Добавить("ПлатежноеПоручение");
	
	Запрос.УстановитьПараметр("МассивИменДокументовБезПрефикса", 	МассивИменДокументовБезПрефикса);
	Запрос.УстановитьПараметр("Ссылка", 							ОбщегоНазначенияБГУПовтИсп.СсылкаИдентификатораОбъектаМетаданных("Документы"));
	Запрос.УстановитьПараметр("ОбщаяНастройка",						БиблиотекаФункцийОбменаПовтИсп.ПолучитьЗначениеОбщейНастройкиПечатиПрефиксаНомераДокумента());
	Запрос.УстановитьПараметр("ЭтоПервоначальноеЗаполнение",		ЭтоПервоначальноеЗаполнение);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = РегистрыСведений.НастройкиПечатиПрефиксаНомера.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Результат);
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Записать();
	
КонецПроцедуры

//Возвращает номер для печати, по установленной настройке, где ИмяДокумента - имя документа в конфигураторе, Номер - преобразуемый номер документа.
//
Функция ПолучитьНомерДляПечатиПоИмениДокумента(ИмяДокумента,Знач Номер) Экспорт
	
	ЗначениеНастройки = БиблиотекаФункцийОбменаПовтИсп.ПолучитьЗначениеНастройкиПечатиПрефиксаНомераВидаДокумента(ИмяДокумента);
	
	Возврат ПолучитьНомерДляПечатиПоЗначениюНастройки(ЗначениеНастройки, Номер);
	
КонецФункции

//Возвращает номер для печати, по установленной настройке, где ОбрезатьПрефикс - значение настройки (Истина - номер будет без префиксов и нулей, Ложь - как есть),
//Номер - преобразуемый номер документа.
//
Функция ПолучитьНомерДляПечатиПоЗначениюНастройки(ОбрезатьПрефикс, Знач Номер) Экспорт
	
	Если ОбрезатьПрефикс Тогда	
		//Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина); //, Истина);
		Возврат ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер, Истина, Истина);
	Иначе
		Возврат Номер;
	КонецЕсли;
	
КонецФункции

//Устанавливает номер для печати, по установленной настройке в переданную область указанному параметру.
// ОбластьПечати - область, в которую будет установлен номер для печати;
// ИмяПараметраВОбласти - имя параметра, которому будет присвоен номер для печати;
// Номер - номер документа, который будет преобразован в номер для печати;
// ИмяСсылкаДокумента - Имя документа или ссылка на документ;
// ЗначениеНастройки - Значение настройки "Обрезать номер", Истина - номер будет без префиксов и нулей, Ложь - номер как есть;
// ПолучатьЗначениеНастройки - если Истина - настройка будет получена по параметру "ИмяСсылкаДокумента", иначе номер будет обрезан по настройке "ЗначениеНастройки".
//
Процедура УстановитьНомерДляПечатиВОбластьПечати(ОбластьПечати, ИмяПараметраВОбласти, Знач Номер, ИмяСсылкаДокумента, ЗначениеНастройки = Ложь, ПолучатьЗначениеНастройки = Ложь) Экспорт
	
	Если ПолучатьЗначениеНастройки Тогда
		НомерДляПечати = ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(ИмяСсылкаДокумента, Номер);
	Иначе
		Если ЗначениеНастройки = Неопределено Тогда
			ЗначениеНастройки = Ложь;
		КонецЕсли;
		НомерДляПечати = ПолучитьНомерДляПечатиПоЗначениюНастройки(ЗначениеНастройки, Номер);
	КонецЕсли;
	
	ОбластьПечати.Параметры.Заполнить(Новый Структура(ИмяПараметраВОбласти,НомерДляПечати));	
	
КонецПроцедуры

//Возвращает номер для печати, по установленной настройке, где СсылкаИдентификаторОбъекта - ссылка на документ или ссылка на справочник ИдентификаторыОбъектовМетаданных,
// или Имя документа, например "АктСписанияМЗ".
//
Функция ПолучитьНомерДляПечатиПоСсылкеИдентификаторуДокумента(СсылкаИдентификаторОбъекта,Знач Номер) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаИдентификаторОбъекта) Тогда
		Возврат Номер;
	КонецЕсли;
	
	Если ТипЗнч(СсылкаИдентификаторОбъекта) = Тип("Строка") Тогда
		ЗначениеНастройки = БиблиотекаФункцийОбменаПовтИсп.ПолучитьЗначениеНастройкиПечатиПрефиксаНомераВидаДокумента(СсылкаИдентификаторОбъекта);
	Иначе		
		Если ТипЗнч(СсылкаИдентификаторОбъекта) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
			ИдентификаторОбъекта = СсылкаИдентификаторОбъекта;
		Иначе
			ИдентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(СсылкаИдентификаторОбъекта));
		КонецЕсли;
		ЗначениеНастройки = БиблиотекаФункцийОбменаПовтИсп.ПолучитьЗначениеНастройкиПечатиПрефиксаНомераИдентификатораОбъектаМетаданных(ИдентификаторОбъекта);
	КонецЕсли;
	
	Возврат ПолучитьНомерДляПечатиПоЗначениюНастройки(ЗначениеНастройки, Номер);
	
КонецФункции

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбновитьПереченьДокументовНастройки");
КонецПроцедуры

#КонецЕсли

