#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Основание = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Основание");
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			
			Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(Основание.Организация) Тогда
				РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(Основание);
				Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
					ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(Основание, РазличающаясяНоменклатураКонтрагентаИОрганизации);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			КонецЕсли;	
			
			ЗаполнитьПоЭлектронномуДокументуПоставщика(Основание,
				ДанныеЗаполнения.НоменклатураДляОтраженияВУчете.Выгрузить());
		КонецЕсли;
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ДанныеЗаполнения)) Тогда
		
		ЗаполнитьПоОснованию(ДанныеЗаполнения, СтандартнаяОбработка);
		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	ОбщегоНазначенияБГУ.ЗаполнитьИдентификаторыСтрок(Материалы, Ложь);
	
	СуммаДокумента = Материалы.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроверкиЗаполненияСодержанияДрагМатериалов(Отказ)
	
	ДрагМатериалы = ДрагоценныеМатериалы.Выгрузить(,"НомерСтроки, ОбъектНФА");
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить(,"ОбъектНФА");
	ОбъектыДМ.Свернуть("ОбъектНФА");
	
	ТаблицаВсехОбъектов = Материалы.Выгрузить(,"СчетУчета, Номенклатура");
	
	ТаблицаОбъектовНФА = Новый ТаблицаЗначений;
	ТаблицаОбъектовНФА.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	МассивСчетовМЗ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗ();
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если МассивСчетовМЗ.Найти(ТекСтрока.СчетУчета)<>Неопределено Тогда
			НоваяСтрока = ТаблицаОбъектовНФА.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого ТекСтрока Из ОбъектыДМ Цикл
		ОбъектНФА = ТекСтрока.ОбъектНФА;
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", ОбъектНФА);
		НайденныеСтроки = ТаблицаОбъектовНФА.НайтиСтроки(ПараметрыОтбора);   

		Если НайденныеСтроки.Количество() = 0 Тогда
			ПараметрыОтбораОбъекта = Новый Структура;
			ПараметрыОтбораОбъекта.Вставить("ОбъектНФА", ОбъектНФА);
			СтрокиСпискаДМ = ДрагМатериалы.НайтиСтроки(ПараметрыОтбораОбъекта);
			Если СтрокиСпискаДМ.Количество()=1 Тогда
				ТекстСтрокиДМ = "В строке ";
			Иначе
				ТекстСтрокиДМ = "В строках ";
			КонецЕсли;
			Для каждого ТекСтрокаДМ Из СтрокиСпискаДМ Цикл
				ТекстСтрокиДМ = ТекстСтрокиДМ + Формат(ТекСтрокаДМ.НомерСтроки, "ЧЦ=10") + ", ";
			КонецЦикла;	
			
			ТекстОшибки = НСтр("ru='"+Сред(ТекстСтрокиДМ, 1, СтрДлина(ТекстСтрокиДМ)-2)+" списка ""Содержание драг. материалов"" указана информация по номенклатуре, которой нет в списке ""Материальные запасы"": %1'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ОбъектНФА);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
			
		КонецЕсли;	
	КонецЦикла;	
	
	ОбъектыДМ = ДрагоценныеМатериалы.Выгрузить();
	Для каждого ТекСтрока Из ОбъектыДМ Цикл
		//контроль лом/не лом
		Если (ТекСтрока.МассаДМ > 0)И(ТекСтрока.ЛигатурнаяМасса > 0 ИЛИ ТекСтрока.ЧистаяМасса>0) Тогда
			ТекстОшибки = НСтр("ru='В строке %2 списка ""Содержание драг. материалов"" следует указать массу в реквизите ""Масса драг. материалов"" или в реквизитах ""Лигатурная масса лома"" и ""Чистая масса в ломе"": ""%1""'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ТекСтрока.ОбъектНФА, ТекСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
		КонецЕсли;	
		
		//заполнение количества драг. камней
		Если НЕ (ТекСтрока.ВидДрагМатериала.ТипДрагМатериала = Перечисления.ТипыДрагМатериалов.ДрагоценныеКамни)И(ТекСтрока.КоличествоДМ > 0) Тогда
			ТекстОшибки = НСтр("ru='В строке %2 списка ""Содержание драг. материалов"" значение реквизита ""Количество (шт)"" указывается только для драгоценных камней: ""%1""'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ТекСтрока.ОбъектНФА, ТекСтрока.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект", Отказ);
		КонецЕсли;	
	КонецЦикла;
	
	//контроль содержания учетных драг. материалов в списываемых НФА
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&Организация КАК Организация,
	               |	ДрагМатериалыДокумента.ОбъектНФА,
	               |	ДрагМатериалыДокумента.МассаДМ,
	               |	ДрагМатериалыДокумента.ЛигатурнаяМасса,
	               |	ДрагМатериалыДокумента.ЧистаяМасса,
	               |	ДрагМатериалыДокумента.КоличествоДМ
	               |ПОМЕСТИТЬ ДрагМатериалыДокумента
	               |ИЗ
	               |	&ДрагМатериалыДокумента КАК ДрагМатериалыДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&Организация КАК Организация,
	               |	ОбъектыДокумента.Номенклатура
	               |ПОМЕСТИТЬ ОбъектыДокумента
	               |ИЗ
	               |	&ОбъектыДокумента КАК ОбъектыДокумента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОбъектыНФАДокумента.Организация,
	               |	ОбъектыНФАДокумента.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДрагМатериалыДокумента.МассаДМ, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.ЛигатурнаяМасса, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.ЧистаяМасса, 0) = 0
	               |				И ЕСТЬNULL(ДрагМатериалыДокумента.КоличествоДМ, 0) = 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьДрагМатериалы
	               |ПОМЕСТИТЬ ОбъектыНФАДокумента
	               |ИЗ
	               |	ОбъектыДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДрагМатериалыДокумента КАК ДрагМатериалыДокумента
	               |		ПО ОбъектыНФАДокумента.Организация = ДрагМатериалыДокумента.Организация
	               |			И ОбъектыНФАДокумента.Номенклатура = ДрагМатериалыДокумента.ОбъектНФА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК ОбъектНФА,
	               |	0 КАК ЧистаяМассаОстаток,
	               |	0 КАК ЛигатурнаяМассаОстаток,
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток КАК МассаДМОстаток,
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.КоличествоДМОстаток КАК КоличествоДМОстаток,
	               |	ОбъектыНФАДокумента.ЕстьДрагМатериалы КАК ЕстьДрагМатериалы
	               |ИЗ
	               |	ОбъектыНФАДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки(&ДатаСведений, Организация = &Организация) КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	               |		ПО (НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА = ОбъектыНФАДокумента.Номенклатура)
	               |			И (НаличиеДрагМатериаловВОбъектахНФАОстатки.Организация = ОбъектыНФАДокумента.Организация)
	               |ГДЕ
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА, 0) <> 0
	               |	И ОбъектыНФАДокумента.ЕстьДрагМатериалы = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА,
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ЧистаяМассаОстаток,
	               |	НаличиеДрагМатериаловВЛомеИОтходахОстатки.ЛигатурнаяМассаОстаток,
	               |	0,
	               |	0,
	               |	ОбъектыНФАДокумента.ЕстьДрагМатериалы
	               |ИЗ
	               |	ОбъектыНФАДокумента КАК ОбъектыНФАДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВЛомеИОтходах.Остатки(&ДатаСведений, Организация = &Организация) КАК НаличиеДрагМатериаловВЛомеИОтходахОстатки
	               |		ПО (НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА = ОбъектыНФАДокумента.Номенклатура)
	               |			И (НаличиеДрагМатериаловВЛомеИОтходахОстатки.Организация = ОбъектыНФАДокумента.Организация)
	               |ГДЕ
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВЛомеИОтходахОстатки.ОбъектНФА, 0) <> 0
	               |	И ОбъектыНФАДокумента.ЕстьДрагМатериалы = ЛОЖЬ";
				   
	ТаблицаОбъектовНФА = Материалы.Выгрузить(,"Номенклатура");
	
	Запрос.УстановитьПараметр("ДрагМатериалыДокумента", ОбъектыДМ);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОбъектыДокумента", ТаблицаОбъектовНФА);
	Запрос.УстановитьПараметр("ДатаСведений", Новый Граница(Ссылка.Дата, ВидГраницы.Включая));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = НСтр("ru='Для объекта ""%1"" из списка ""Материальные запасы"" в учете присутствуют остатки драгоценных материалов. Следует заполнить данные списка ""Содержание драг. материалов"" на закладке ""Драгоценные материалы"" и провести документ.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.ОбъектНФА);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДрагоценныеМатериалы", "Объект");
	КонецЦикла;	
	
КонецПроцедуры	

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоОснованию(ДанныеЗаполнения, СтандартнаяОбработка = Истина) Экспорт

	ТипОснования = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипОснования = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда	

		Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(ДанныеЗаполнения.Организация) Тогда
			РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(ДанныеЗаполнения);
			Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
				ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(ДанныеЗаполнения, РазличающаясяНоменклатураКонтрагентаИОрганизации);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
		КонецЕсли;	
		
		ЗаполнитьПоЭлектронномуДокументуПоставщика(ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоЭлектронномуДокументуПоставщика(ДанныеЗаполнения, СписокНоменклатуры = Неопределено) Экспорт
	ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеМЗ;
	
	ДатаПодписания = Дата(1,1,1);
	Если ДанныеЗаполнения.ЗагруженИзЕИС Тогда
		ДатаПодписания = ЭлектронныеДокументыБГУ.ДатаПоследнейЭлектроннойПодписиЭД(ДанныеЗаполнения);
		Если ЗначениеЗаполнено(ДатаПодписания) Тогда
			Дата = ДатаПодписания;
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаПодписания) Тогда
		Дата = ЭлектронныеДокументыБГУ.ДатаВходящегоИзвещенияЭДП(ДанныеЗаполнения);
	КонецЕсли;
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	Договор = ДанныеЗаполнения.Договор;
	ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
	ДокументОснование = ДанныеЗаполнения;
	СчетУчета = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("105.00");
	
	Если НЕ ТипЗнч(СписокНоменклатуры) = Тип("ТаблицаЗначений") Тогда
		СписокНоменклатуры = ЭлектронныеДокументыБГУВызовСервера.СписокДоступнойНоменклатурыЭДПоставщика(ТипДокументаУчета, ДокументОснование);
	КонецЕсли;
	
	ПараметрыОбработкиСтроки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(ЭтотОбъект);
	ПараметрыОбработкиСтроки.Вставить("ДтКт", "Дт");
	ИспользуемыеИдентификаторы = Новый Массив;
	
	Для Каждого СтрокаТЧ из СписокНоменклатуры Цикл
		Если СтрокаТЧ.КодВидаНоменклатуры = 1 Тогда 
			НоваяСтрока = Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			ПараметрыОбработкиСтроки.Номенклатура = НоваяСтрока.Номенклатура;
			НоваяСтрока.Сумма = СтрокаТЧ.Всего;
		КонецЕсли;
	КонецЦикла;
	
	СуммаДокумента = Материалы.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
