#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция УжеЕстьШаблон(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст= 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Шаблоны.Ссылка,
	|	Шаблоны.Владелец
	|ИЗ
	|	Справочник.ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг КАК Шаблоны
	|ГДЕ
	|	Шаблоны.Владелец = &Организация
	|	И Шаблоны.ПометкаУдаления = Ложь
	|	И Шаблоны.Ссылка <> &Ссылка";
	
	РезультатЗапросаНеПустой = НЕ Запрос.Выполнить().Пустой();
		
	Возврат РезультатЗапросаНеПустой;
	
КонецФункции

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Отказ = УжеЕстьШаблон(Владелец);
	Если Отказ Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Для организации "+Владелец+" уже введен шаблон для идентификатора начисления документа ""Квитанция на оплату""'"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли


