
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Значение");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьМесяц1(Команда)
	
	ВыбратьМесяц(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц2(Команда)
	
	ВыбратьМесяц(2);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц3(Команда)
	
	ВыбратьМесяц(3);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц4(Команда)
	
	ВыбратьМесяц(4);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц5(Команда)
	
	ВыбратьМесяц(5);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц6(Команда)
	
	ВыбратьМесяц(6);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц7(Команда)
	
	ВыбратьМесяц(7);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц8(Команда)
	
	ВыбратьМесяц(8);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц9(Команда)
	
	ВыбратьМесяц(9);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц10(Команда)
	
	ВыбратьМесяц(10);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц11(Команда)
	
	ВыбратьМесяц(11);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьМесяц12(Команда)
	
	ВыбратьМесяц(12);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДату(Команда)
	
	ВыбратьОтчетнуюДату(ДатаНачалаСтолетия(ПроизвольнаяДата));
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ВыбратьМесяц(НомерМесяца)
	
	ВыбраннаяДата = Дата(0004, НомерМесяца, 1);
	ВыбратьОтчетнуюДату(ВыбраннаяДата);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ДатаНачалаСтолетия(ПроизвольнаяДата)
	
	МесяцПериода = Месяц(ПроизвольнаяДата);
	ДеньПериода	 = День(ПроизвольнаяДата);
	
	Возврат Дата(4,МесяцПериода,ДеньПериода);
	
КонецФункции

&НаСервере
Процедура ВыбратьОтчетнуюДату(ВыбраннаяДата)
	
	ЭлементСписка = Значение.НайтиПоЗначению(ВыбраннаяДата);
	
	Если ЭлементСписка = Неопределено Тогда 
		ЭлементСписка = Значение.Добавить(ВыбраннаяДата,Формат(ВыбраннаяДата,"ДФ='dd MMMM'"));
	КонецЕсли;
	Элементы.Значение.ТекущаяСтрока = ЭлементСписка.ПолучитьИдентификатор();
КонецПроцедуры

#КонецОбласти
