#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.Печать.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ВнешниеНаборыДанных = Новый Структура;
	
	Отбор = Новый Структура;
	
	ПараметрОрганизация = Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	ПараметрПериод = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	ПараметрВидНалогаИлиПлатежа = Настройки.ПараметрыДанных.Элементы.Найти("ВидНалогаИлиПлатежа");
	
	Если ПараметрВидНалогаИлиПлатежа.Использование И ЗначениеЗаполнено(ПараметрВидНалогаИлиПлатежа.Значение) Тогда
		Отбор.Вставить("ВидНалогаИлиПлатежа", ПараметрВидНалогаИлиПлатежа.Значение);
	КонецЕсли;
	
	ВнешниеНаборыДанных.Вставить("РасчетыПоПлатежамВБюджеты",
		Отчеты.АнализЗадолженностиПоПлатежамВБюджеты.АнализЗадолженностиПоПлатежамВБюджеты(
			ПараметрОрганизация.Значение, ПараметрПериод.Значение.ДатаНачала, ПараметрПериод.Значение.ДатаОкончания, Отбор));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДокументРезультат.ФиксацияСлева = 1;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли