
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрКоманды",ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды",ПараметрыВыполненияКоманды);
	ОбработкаЗавершения = Новый ОписаниеОповещения("ОбработкаКомандыЗавершение",ЭтотОбъект,ДополнительныеПараметры);
	
	ЗаполнениеОтчетностиКлиент.ВвестиПараметры(ПараметрКоманды, ПараметрыВыполненияКоманды, ОбработкаЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат.Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("АдресПараметровЗаполнения",Результат.АдресПараметров);
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ДополнительныеПараметры.ПараметрКоманды);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ПравилаЗаполнения",
		"ПроверкаПравил",
		МассивОбъектов,
		ДополнительныеПараметры.ПараметрыВыполненияКоманды.Источник,
		ПараметрыПечати);
	
КонецПроцедуры	

