#Область РеестрДокументовПодтверждающихЛьготы

Процедура ПолучитьСведенияОПоказателяхОтчетаРеестрДокументовПодтверждающихЛьготыФорма2020_1_2021_1(ПоказателиОтчета) Экспорт
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ВидОпер",  Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ДатаДок",  Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ИННФЛ",    Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ИННЮЛ",    Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Имя",      Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ИмяФайлДог", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КПП",      Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "КодОпер",  Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НаимОрг",  Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "НомДок",   Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Отчество", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "СумНеоблОпер", Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "СумОпер",  Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "ТипДок",   Истина, Ложь);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "Фамилия",  Истина, Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьОтчетРеестрДокументовПодтверждающихЛьготыФорма2020_1_2021_1(ПараметрыОтчета, Контейнер) Экспорт
	
	Организация   = ВсяОрганизация(ПараметрыОтчета.Организация);
	НачалоПериода =  НачалоКвартала(ПараметрыОтчета.ПериодОтчета);
	КонецПериода  =  КонецКвартала(ПараметрыОтчета.ПериодОтчета);
	
	Результат = ПолучитьСведенияРеестраЛьготныхДокументов(Организация, НачалоПериода, КонецПериода);
	
	Реестр = Контейнер.Реестр;
	
	ВыборкаПоКодам = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоКодам.Следующий() Цикл
		
		ВыборкаПоВидам = ВыборкаПоКодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВидам.Следующий() Цикл
			СуммаОпераций = 0;
			СтрокаРеестраКодВидОперации = Реестр.Строки.Добавить();
			СтрокаРеестраКодВидОперации.КодОпер = ВыборкаПоВидам.Код;
			Если Не ЗначениеЗаполнено(ВыборкаПоВидам.ВидНеоблагаемойОперации) Тогда
				СтрокаРеестраКодВидОперации.ВидОпер = "--";
			Иначе
				СтрокаРеестраКодВидОперации.ВидОпер = ВыборкаПоВидам.ВидНеоблагаемойОперации;
			КонецЕсли;
			// Имя файла типового договора заполняется вручную в реестре документов,
			// подтверждающих обоснованность применения налоговых льгот.
			СтрокаТиповойДоговор = СтрокаРеестраКодВидОперации.Строки.Добавить();
			
			ВыборкаПоДокументам = ВыборкаПоВидам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоДокументам.Следующий() Цикл
				ВыборкаПоОперациям = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоОперациям.Следующий() Цикл
					СтрокаОперация = СтрокаТиповойДоговор.Строки.Добавить();
					
					ВыборкаЗаписи = ВыборкаПоОперациям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					ПерваяСтрока = Истина;
					Пока ВыборкаЗаписи.Следующий() Цикл
						Если ПерваяСтрока Тогда
							ПерваяСтрока = Ложь;
							Если ВыборкаЗаписи.НаименованиеКонтрагента = "Розничная продажа" Тогда
								СтрокаОперация.Фамилия = "Розничная";
								СтрокаОперация.Имя = "продажа";
							ИначеЕсли ТипЗнч(ВыборкаЗаписи.КонтрагентЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
								СтрокаОперация.НаимОрг = ВыборкаЗаписи.НаименованиеКонтрагента;
								СтрокаОперация.ИННЮЛ = ВыборкаЗаписи.ИННКонтрагента;
								СтрокаОперация.КПП = ВыборкаЗаписи.КППКонтрагента;
							Иначе
								ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВыборкаЗаписи.НаименованиеКонтрагента);
								СтрокаОперация.Фамилия = ФИО.Фамилия;
								СтрокаОперация.Имя = ФИО.Имя;
								СтрокаОперация.Отчество = ФИО.Отчество;
								СтрокаОперация.ИННФЛ = ВыборкаЗаписи.ИННКонтрагента;
							КонецЕсли;
							СтрокаОперация.СумОпер = ВыборкаЗаписи.СуммаОперации;
							СуммаОпераций = СуммаОпераций + ВыборкаЗаписи.СуммаОперации;
						КонецЕсли;
						СтрокаДокумент = СтрокаОперация.Строки.Добавить();
						СтрокаДокумент.ТипДок   = ВыборкаЗаписи.ТипДокумента;
						СтрокаДокумент.НомДок = ВыборкаЗаписи.НомерДокумента;
						СтрокаДокумент.ДатаДок  = ВыборкаЗаписи.ДатаДокумента;
					КонецЦикла;
					СтрокаРеестраКодВидОперации.СумНеоблОпер = СуммаОпераций;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	УпорядочитьСтрокиОперацийПоДате(Реестр);
	
КонецПроцедуры

Функция ПолучитьСведенияРеестраЛьготныхДокументов(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",   Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода);
	Запрос.УстановитьПараметр("ТекстРозничнаяПродажа", НСтр("ru = 'Розничная продажа'"));
	
	// Реквизиты контрагентов получим на большую дату подтверждающего документа
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Ссылки на контрагентов и даты определения сведений о контрагентах
	|//
	|ВЫБРАТЬ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент КАК Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.ДатаДокумента, ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата)) КАК ДатаСведений,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КлючСтроки КАК КлючСтроки,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка КАК ДокументСсылка
	|ПОМЕСТИТЬ СсылкиНаДаты
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.ПодтверждающиеДокументы КАК ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы
	|		ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка = ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.Ссылка
	|			И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КлючСтроки = ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.КлючСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
	|		ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации = КодыОперацийРаздела7ДекларацииПоНДС.Ссылка
	|ГДЕ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация В(&Организация)
	|	И КодыОперацийРаздела7ДекларацииПоНДС.ВключаетсяВРеестрПодтверждающихДокументов
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации <> 0
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Проведен
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|СГРУППИРОВАТЬ ПО
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КлючСтроки,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. История КПП
	|//
	|ВЫБРАТЬ
	|	СсылкиНаДаты.Ссылка			КАК Ссылка,
	|	СсылкиНаДаты.ДатаСведений				КАК Дата,
	|	МИНИМУМ(КППИстория.ДатаОкончанияДействия)	КАК ДатаОкончанияДействия
	|ПОМЕСТИТЬ
	|	ДатыОкончанияДействияКПП
	|ИЗ
	|	СсылкиНаДаты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КППИстория КАК КППИстория
	|		ПО	СсылкиНаДаты.Ссылка = КППИстория.Ссылка
	|		И	СсылкиНаДаты.ДатаСведений < ДОБАВИТЬКДАТЕ(КППИстория.ДатаОкончанияДействия, ДЕНЬ, 1)
	|СГРУППИРОВАТЬ ПО
	|	СсылкиНаДаты.Ссылка,
	|	СсылкиНаДаты.ДатаСведений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Сведения о контрагентах
	|//
	|ВЫБРАТЬ
	|	СсылкиНаДаты.Ссылка													КАК Ссылка,
	|	СсылкиНаДаты.ДатаСведений											КАК ДатаСведений,
	|	ЕСТЬNULL(Контрагенты.Ссылка.ЮридическоеФизическоеЛицо.ИНН, """")		КАК ИНН,
	|	ВЫБОР
	|		КОГДА ТЧКППИстория.КПП ЕСТЬ NULL ИЛИ СсылкиНаДаты.ДатаСведений = ДАТАВРЕМЯ(1,1,1) ТОГДА
	|			ВЫБОР
	|				КОГДА ТИПЗНАЧЕНИЯ(Контрагенты.Ссылка.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица) ТОГДА
	|					ЕСТЬNULL(Контрагенты.Ссылка.ЮридическоеФизическоеЛицо.КПП, """")
	|				ИНАЧЕ
	|					""""
	|			КОНЕЦ
	|		ИНАЧЕ
	|			ТЧКППИстория.КПП
	|	КОНЕЦ																КАК КПП,
	|	ВЫБОР
	|		КОГДА Контрагенты.Ссылка.ОбособленноеПодразделение И Контрагенты.Ссылка.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			// Берем головного контрагента
	|			Контрагенты.Ссылка.ГоловнаяОрганизация
	|		ИНАЧЕ
	|			// Берем текущего контрагента
	|			Контрагенты.Ссылка
	|	КОНЕЦ																КАК КонтрагентДляПолученияНаименования,
	|	ВЫБОР
	|		КОГДА Контрагенты.Ссылка.ОбособленноеПодразделение И Контрагенты.Ссылка.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			// Берем головного контрагента
	|			ВЫБОР
	|				// Если задано наименование для печати - используем его
	|				КОГДА Контрагенты.Ссылка.ГоловнаяОрганизация.НаименованиеСокращенное <> """" ТОГДА
	|					Контрагенты.Ссылка.ГоловнаяОрганизация.НаименованиеСокращенное
	|					
	|				// Для юридических лиц есть реквизит НаименованиеПолное
	|				КОГДА Контрагенты.Ссылка.ГоловнаяОрганизация.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|					И Контрагенты.Ссылка.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.НаименованиеПолное <> """" ТОГДА
	|					ВЫРАЗИТЬ(Контрагенты.Ссылка.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|		
	|				ИНАЧЕ
	|					Контрагенты.Ссылка.ГоловнаяОрганизация.Наименование
	|			КОНЕЦ
	|		ИНАЧЕ
	|			// Берем текущего контрагента
	|			ВЫБОР
	|				// Если задано наименование для печати - используем его
	|				КОГДА Контрагенты.Ссылка.НаименованиеСокращенное <> """" ТОГДА
	|					Контрагенты.Ссылка.НаименованиеСокращенное
	|					
	|				// Для юридических лиц есть реквизит НаименованиеПолное
	|				КОГДА Контрагенты.Ссылка.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|					И Контрагенты.Ссылка.ЮридическоеФизическоеЛицо.НаименованиеПолное <> """" ТОГДА
	|					ВЫРАЗИТЬ(Контрагенты.Ссылка.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|		
	|				ИНАЧЕ
	|					Контрагенты.Ссылка.Наименование
	|			КОНЕЦ
	|	КОНЕЦ																КАК Наименование
	|ПОМЕСТИТЬ
	|	СведенияОСсылкахНаДаты
	|ИЗ
	|	СсылкиНаДаты КАК СсылкиНаДаты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО СсылкиНаДаты.Ссылка = Контрагенты.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ	ДатыОкончанияДействияКПП
	|		ПО	СсылкиНаДаты.Ссылка = ДатыОкончанияДействияКПП.Ссылка
	|		И	СсылкиНаДаты.ДатаСведений = ДатыОкончанияДействияКПП.Дата
	|	ЛЕВОЕ СОЕДИНЕНИЕ	Справочник.Контрагенты.КППИстория КАК ТЧКППИстория
	|		ПО	ДатыОкончанияДействияКПП.Ссылка = ТЧКППИстория.Ссылка
	|		И	ДатыОкончанияДействияКПП.ДатаОкончанияДействия = ТЧКППИстория.ДатаОкончанияДействия
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ДатаСведений
	|;";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КодыОперацийРаздела7ДекларацииПоНДС.Код КАК Код,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации) КАК СуммаРеализации
	|ПОМЕСТИТЬ СуммыПоКоду
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
	|		ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации = КодыОперацийРаздела7ДекларацииПоНДС.Ссылка
	|ГДЕ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация В(&Организация)
	|	И КодыОперацийРаздела7ДекларацииПоНДС.ВключаетсяВРеестрПодтверждающихДокументов
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации <> 0
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Проведен
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	КодыОперацийРаздела7ДекларацииПоНДС.Код
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации КАК КодОперацииСсылка,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации) КАК СуммаРеализации
	|ПОМЕСТИТЬ СуммыПоВиду
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
	|		ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации = КодыОперацийРаздела7ДекларацииПоНДС.Ссылка
	|ГДЕ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация В(&Организация)
	|	И КодыОперацийРаздела7ДекларацииПоНДС.ВключаетсяВРеестрПодтверждающихДокументов
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации <> 0
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Проведен
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КодОперацииСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиНаДаты.Ссылка КАК Ссылка,
	|	СсылкиНаДаты.КлючСтроки КАК КлючСтроки,
	|	СведенияОСсылкахНаДаты.Наименование КАК Наименование,
	|	СведенияОСсылкахНаДаты.ИНН КАК ИНН,
	|	СведенияОСсылкахНаДаты.КПП КАК КПП,
	|	СсылкиНаДаты.ДокументСсылка КАК ДокументСсылка
	|ПОМЕСТИТЬ СведенияОКонтрагентах
	|ИЗ
	|	СсылкиНаДаты КАК СсылкиНаДаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СведенияОСсылкахНаДаты КАК СведенияОСсылкахНаДаты
	|		ПО СсылкиНаДаты.Ссылка = СведенияОСсылкахНаДаты.Ссылка
	|			И СсылкиНаДаты.ДатаСведений = СведенияОСсылкахНаДаты.ДатаСведений
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	КлючСтроки,
	|	СсылкиНаДаты.ДокументСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент КАК Контрагент,
	|	СУММА(ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации) КАК СуммаОперации,
	|	МАКСИМУМ(СуммыПоКоду.СуммаРеализации) КАК ИтогПоКоду,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КлючСтроки КАК Операция,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка КАК Ссылка,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации КАК КодОперации,
	|	МАКСИМУМ(СуммыПоВиду.СуммаРеализации) КАК ИтогПоВиду,
	|	ВЫБОР
	|		КОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.ДокументРеализации ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|			ТОГДА &ТекстРозничнаяПродажа
	|		ИНАЧЕ ЕСТЬNULL(СведенияОКонтрагентах.Наименование, """")
	|	КОНЕЦ КАК НаименованиеКонтрагента,
	|	ЕСТЬNULL(СведенияОКонтрагентах.ИНН, """") КАК ИННКонтрагента,
	|	ЕСТЬNULL(СведенияОКонтрагентах.КПП, """") КАК КППКонтрагента,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент.ЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо
	|ПОМЕСТИТЬ ЗаписиРеестраПредварительная
	|ИЗ
	|	Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.НеоблагаемыеНДСОперации КАК ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммыПоКоду КАК СуммыПоКоду
	|			ПО КодыОперацийРаздела7ДекларацииПоНДС.Код = СуммыПоКоду.Код
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммыПоВиду КАК СуммыПоВиду
	|			ПО КодыОперацийРаздела7ДекларацииПоНДС.Ссылка = СуммыПоВиду.КодОперацииСсылка
	|		ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации = КодыОперацийРаздела7ДекларацииПоНДС.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКонтрагентах КАК СведенияОКонтрагентах
	|		ПО ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент = СведенияОКонтрагентах.Ссылка
	|			И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КлючСтроки = СведенияОКонтрагентах.КлючСтроки
	|			И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка = СведенияОКонтрагентах.ДокументСсылка
	|ГДЕ
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Организация В(&Организация)
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Проведен
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КодыОперацийРаздела7ДекларацииПоНДС.ВключаетсяВРеестрПодтверждающихДокументов
	|	И ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.СуммаРеализации <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КлючСтроки,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Ссылка,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.КодОперации,
	|	ЕСТЬNULL(СведенияОКонтрагентах.ИНН, """"),
	|	ЕСТЬNULL(СведенияОКонтрагентах.КПП, """"),
	|	ВЫБОР
	|		КОГДА ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.ДокументРеализации ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|			ТОГДА &ТекстРозничнаяПродажа
	|		ИНАЧЕ ЕСТЬNULL(СведенияОКонтрагентах.Наименование, """")
	|	КОНЕЦ,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСНеоблагаемыеНДСОперации.Контрагент.ЮридическоеФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Операция,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыОперацийРаздела7ДекларацииПоНДС.Код КАК Код,
	|	КодыОперацийРаздела7ДекларацииПоНДС.Наименование КАК Наименование,
	|	КодыОперацийРаздела7ДекларацииПоНДС.ВидНеоблагаемойОперации КАК ВидНеоблагаемойОперации,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.ТипДокумента.ПолноеНаименование КАК ТипДокумента,
	|	ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.НомерДокумента КАК НомерДокумента,
	|	ЕСТЬNULL(ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.ДатаДокумента, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаДокумента,
	|	ЗаписиРеестраПредварительная.СуммаОперации КАК СуммаОперации,
	|	ЗаписиРеестраПредварительная.ИтогПоКоду КАК ИтогПоКоду,
	|	ЗаписиРеестраПредварительная.Операция КАК Операция,
	|	ЗаписиРеестраПредварительная.ИтогПоВиду КАК ИтогПоВиду,
	|	ЗаписиРеестраПредварительная.НаименованиеКонтрагента КАК НаименованиеКонтрагента,
	|	ЗаписиРеестраПредварительная.ИННКонтрагента КАК ИННКонтрагента,
	|	ЗаписиРеестраПредварительная.КППКонтрагента КАК КППКонтрагента,
	|	ЗаписиРеестраПредварительная.Контрагент КАК КонтрагентРасшифровка,
	|	ЗаписиРеестраПредварительная.Ссылка КАК Ссылка,
	|	ЗаписиРеестраПредварительная.КонтрагентЮридическоеФизическоеЛицо КАК КонтрагентЮридическоеФизическоеЛицо
	|ИЗ
	|	ЗаписиРеестраПредварительная КАК ЗаписиРеестраПредварительная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.ПодтверждающиеДокументы КАК ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы
	|		ПО ЗаписиРеестраПредварительная.Ссылка = ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.Ссылка
	|			И ЗаписиРеестраПредварительная.Операция = ФормированиеЗаписейРаздела7ДекларацииНДСПодтверждающиеДокументы.КлючСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыОперацийРаздела7ДекларацииПоНДС КАК КодыОперацийРаздела7ДекларацииПоНДС
	|		ПО ЗаписиРеестраПредварительная.КодОперации = КодыОперацийРаздела7ДекларацииПоНДС.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(ЗаписиРеестраПредварительная.КодОперации, ЗНАЧЕНИЕ(Справочник.КодыОперацийРаздела7ДекларацииПоНДС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.КодыОперацийРаздела7ДекларацииПоНДС.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код,
	|	ВидНеоблагаемойОперации,
	|	ДатаДокумента
	|ИТОГИ
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(СуммаОперации),
	|	МАКСИМУМ(ИтогПоКоду),
	|	МАКСИМУМ(ИтогПоВиду)
	|ПО
	|	Код,
	|	ВидНеоблагаемойОперации,
	|	Ссылка,
	|	Операция";
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция ВсяОрганизация(Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &Организация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	&Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");

КонецФункции

Процедура УпорядочитьСтрокиОперацийПоДате(Реестр)
	
	Реестр.Колонки.Добавить("МинимальнаяДатаДокумента", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Реестр.Колонки.Добавить("МаксимальнаяДатаДокумента", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Для Каждого СтрокаРеестраКодВидОперации Из Реестр.Строки Цикл
		Для Каждого СтрокаТиповойДоговор Из СтрокаРеестраКодВидОперации.Строки Цикл
			Для Каждого СтрокаОперация Из СтрокаТиповойДоговор.Строки Цикл
				МинимальнаяДатаДокумента = '39991231';
				МаксимальнаяДатаДокумента = '00010101';
				
				Для Каждого СтрокаДокумент Из СтрокаОперация.Строки Цикл
					Если ЗначениеЗаполнено(СтрокаДокумент.ДатаДок) Тогда
						МинимальнаяДатаДокумента = Мин(МинимальнаяДатаДокумента, СтрокаДокумент.ДатаДок);
						МаксимальнаяДатаДокумента = Макс(МаксимальнаяДатаДокумента, СтрокаДокумент.ДатаДок);
					КонецЕсли;
				КонецЦикла;
				
				СтрокаОперация.МинимальнаяДатаДокумента = МинимальнаяДатаДокумента;
				СтрокаОперация.МаксимальнаяДатаДокумента = МаксимальнаяДатаДокумента;
			КонецЦикла;
			
			СтрокаТиповойДоговор.Строки.Сортировать("МинимальнаяДатаДокумента, МаксимальнаяДатаДокумента");
		КонецЦикла;
	КонецЦикла;
	
	Реестр.Колонки.Удалить("МинимальнаяДатаДокумента");
	Реестр.Колонки.Удалить("МаксимальнаяДатаДокумента");
	
КонецПроцедуры

#КонецОбласти

#Область Декларация

#Область Форма2023Кв1

Процедура ПолучитьСведенияОПоказателяхОтчетаНДСФормаОтчета2023Кв1(ПоказателиОтчета) Экспорт
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200001003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200002003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200003003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200006003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200007003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200008003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200009003", Истина, Истина);

	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300001003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004203", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300006003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007005", Истина, Истина);

	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300008005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300009005", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300012003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300013003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300014003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300015003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300016003", Истина, Истина);
	
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000102", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000104", Истина, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьОтчетНДСФормаОтчета2023Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	Перем ТаблицаРасшифровки;
	
	ПараметрыОтчета.Вставить("ПравилаЗаполнения", "2023Кв1");

	// Отбор по организации
	СписокОрганизаций = Новый СписокЗначений();
	СписокОрганизаций.Добавить(ПараметрыОтчета["Организация"]);
	ЭтоОбособленноеПодразделение = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПараметрыОтчета["Организация"], "ГоловнаяОрганизация"));
	Если НЕ ЭтоОбособленноеПодразделение Тогда
		Для Каждого ЭлементСписка Из ПараметрыОтчета["ГруппаОрганизаций"] Цикл
			ВсяОрганизация = Справочники.Организации.ВсяОрганизация(ЭлементСписка.Значение);
			Для Каждого Организация Из ВсяОрганизация Цикл
				СписокОрганизаций.Добавить(Организация);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	ПараметрыОтчета.Вставить("СписокОрганизаций", СписокОрганизаций);
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(
		ПараметрыОтчета["Организация"],
		ПараметрыОтчета["мДатаКонцаПериодаОтчета"]);
		
	СледуетЗаполнитьРаздел3 = УчетнаяПолитика["СистемаНалогообложения"] <> Перечисления.СистемыНалогообложения.Упрощенная;
	
	ЗаполнитьРаздел1_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРаздел2_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	Если СледуетЗаполнитьРаздел3 Тогда
		ЗаполнитьРаздел3_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	КонецЕсли;
	
	ЗаполнитьРаздел7_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	// СегментацияДанныхДекларации
	РегламентированнаяОтчетность.УдалитьДополнительныеФайлыДекларацииНДС(ПараметрыОтчета["Декларация"]);
	
	ЗаполнитьРаздел8_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРазделы9и12_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	ПоместитьВоВременноеХранилище(Контейнер,			ПараметрыОтчета.АдресВоВременномХранилище);
    ПоместитьВоВременноеХранилище(ТаблицаРасшифровки,	ПараметрыОтчета.АдресВременногоХранилищаРасшифровки);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел1_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРаздел1(Контейнер.Раздел1, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел2_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные
	РезультатДерево = Новый ДеревоЗначений();
	ВывестиРезультатВыполненияСКД_2023Кв1(РезультатДерево, "Раздел 2", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела2(Контейнер.Раздел2, РезультатДерево, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел3_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные:
	ТаблицаЧасть1 = Новый ТаблицаЗначений();
	ТаблицаЧасть2 = Новый ТаблицаЗначений();
	ВывестиРезультатВыполненияСКД_2023Кв1(ТаблицаЧасть1, "Раздел 3, ч1 (строки 010-110)", ПараметрыОтчета);
	ВывестиРезультатВыполненияСКД_2023Кв1(ТаблицаЧасть2, "Раздел 3, ч2 (строки 120-210)", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела3(Контейнер.Раздел3, ТаблицаЧасть1, ТаблицаЧасть2);
	
	ДобавитьРасшифровкуРаздела3_2023Кв1(ТаблицаРасшифровки, Контейнер.Раздел3, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ДобавитьРасшифровкуРаздела3_2023Кв1(ТаблицаРасшифровки, Раздел3, ПараметрыОтчета)
	
	// Строка 010
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300001003",
		"Строка 010 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20%), налоговая база""",
		"", "Строка 010 (налоговая база)", Раздел3.П000300001003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300001003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300001005",
		"Строка 010 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20%), сумма НДС""",
		"", "Строка 010 (сумма налога)", Раздел3.П000300001005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300001005)",
		ПараметрыОтчета);
		
	// Строка 020
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002003",
		"Строка 020 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10%), налоговая база""",
		"", "Строка 020 (налоговая база)", Раздел3.П000300002003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002005",
		"Строка 020 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10%), сумма НДС""",
		"", "Строка 020 (сумма налога)", Раздел3.П000300002005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002005)",
		ПараметрыОтчета);

	// Строка 030
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003003",
		"Строка 030 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20/120), налоговая база""",
		"", "Строка 030 (налоговая база)", Раздел3.П000300003003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003005",
		"Строка 030 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20/120), сумма НДС""",
		"", "Строка 030 (сумма налога)", Раздел3.П000300003005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003005)",
		ПараметрыОтчета);
		
	// Строка 040
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004003",
		"Строка 040 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10/110), налоговая база""",
		"", "Строка 040 (налоговая база)", Раздел3.П000300004003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004005",
		"Строка 040 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10/110), сумма НДС""",
		"", "Строка 040 (сумма налога)", Раздел3.П000300004005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004005)",
		ПараметрыОтчета);
		
	// Строка 041
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004103",
		"Строка 041 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18%), налоговая база""",
		"", "Строка 041 (налоговая база)", Раздел3.П000300004103,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004103)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004105",
		"Строка 041 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18%), сумма НДС""",
		"", "Строка 041 (сумма налога)", Раздел3.П000300004005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004105)",
		ПараметрыОтчета);
		
	// Строка 042
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004203",
		"Строка 042 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18/118), налоговая база""",
		"", "Строка 042 (налоговая база)", Раздел3.П000300004203,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004203)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004205",
		"Строка 042 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18/118), сумма НДС""",
		"", "Строка 042 (сумма налога)", Раздел3.П000300004205,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004205)",
		ПараметрыОтчета);
		
	// Строка 060
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300006003",
		"Строка 060 (раздел 3) ""Выполнение строительно-монтажных работ для собственного потребления, налоговая база""",
		"", "Строка 060 (налоговая база)", Раздел3.П000300006003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300006003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300006005",
		"Строка 060 (раздел 3) ""Выполнение строительно-монтажных работ для собственного потребления, сумма НДС""",
		"", "Строка 060 (сумма налога)", Раздел3.П000300006005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300006005)",
		ПараметрыОтчета);
		
	// Строка 070
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300007003",
		"Строка 070 (раздел 3) ""Суммы полученной оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, налоговая база""",
		"", "Строка 070 (налоговая база)", Раздел3.П000300007003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300007003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300007005",
		"Строка 070 (раздел 3) ""Суммы полученной оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, сумма НДС""",
		"", "Строка 070 (сумма налога)", Раздел3.П000300007005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300007005)",
		ПараметрыОтчета);

	// Строка 080
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300008005",
		"Строка 080 (раздел 3) ""Суммы налога, подлежащие восстановлению, всего""",
		"", "Строка 080 (сумма налога)", Раздел3.П000300008005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300008005)",
		ПараметрыОтчета);

	// Строка 090
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300009005",
		"Строка 090 (раздел 3) ""Суммы налога, подлежащие восстановлению в соответствии с пп.3 п.3 ст.170 НК""",
		"", "Строка 090 (сумма налога)", Раздел3.П000300009005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300009005)",
		ПараметрыОтчета);
		
	// Строка 105
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300010503",
		"Строка 105 (раздел 3) ""Корректировка реализации, передачи имущественных прав на основании п.6 ст.105.3 НК, налоговая база""",
		"", "Строка 105 (налоговая база)", Раздел3.П000300010503,
		"Раздел3",
		"Раздел 3 (расшифровка П000300010503)",
		ПараметрыОтчета);
		
		
	// Строка 120
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300012003",
		"Строка 120 (раздел 3) ""Сумма налога, подлежащая вычету в соответствии с пп.2,4,5,17 ст.171 НК""",
		"", "Строка 120 (сумма налога)", Раздел3.П000300012003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300012003)",
		ПараметрыОтчета);
	
	// Строка 130
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300013003",
		"Строка 130 (раздел 3) ""Сумма налога, предъявленная налогоплательщику - покупателю при перечислении суммы оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, подлежащая вычету у покупателя""",
		"", "Строка 130 (сумма налога)", Раздел3.П000300013003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300013003)",
		ПараметрыОтчета);
	
	// Строка 140
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300014003",
		"Строка 140 (раздел 3) ""Сумма налога, исчисленная при выполнении строительно-монтажных работ для собственного потребления, подлежащая вычету""",
		"", "Строка 140 (сумма налога)", Раздел3.П000300014003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300014003)",
		ПараметрыОтчета);
	
	// Строка 150
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300015003",
		"Строка 150 (раздел 3) ""Сумма налога, уплаченная налогоплательщиком таможенным органам при ввозе товаров на территорию Российской Федерации и иные территории, находящиеся под её юрисдикцией, в таможенных процедурах выпуска для внутреннего потребления, переработки для внутреннего потребления, временного ввоза и переработки вне таможенной территории""",
		"", "Строка 150 (сумма налога)", Раздел3.П000300015003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300015003)",
		ПараметрыОтчета);
		
	// Строка 160
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300016003",
		"Строка 160 (раздел 3) ""Сумма налога, уплаченная налогоплательщиком налоговым органам при ввозе товаров на территорию Российской Федерации и иные территории, находящиеся под её юрисдикцией, с территории государств-членов Евразийского экономического союза""",
		"", "Строка 160 (сумма налога)", Раздел3.П000300016003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300016003)",
		ПараметрыОтчета);
		
	// Строка 170
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300017003",
		"Строка 170 (раздел 3) ""Сумма налога, исчисленная продавцом с сумм оплаты, частичной оплаты, подлежащая вычету у продавца с даты отгрузки соответствующих товаров (выполнения работ, оказания услуг)""",
		"", "Строка 170 (сумма налога)", Раздел3.П000300017003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300017003)",
		ПараметрыОтчета);
	
	// Строка 180
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300018003",
		"Строка 180 (раздел 3) ""Сумма налога, уплаченная в бюджет налогоплательщиком в качестве покупателя - налогового агента, подлежащая вычету""",
		"", "Строка 180 (сумма налога)", Раздел3.П000300018003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300018003)",
		ПараметрыОтчета);
		
КонецПроцедуры

Процедура ЗаполнитьРаздел7_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные
	Результат = Новый ДеревоЗначений();
	ВывестиРезультатВыполненияСКД_2023Кв1(Результат, "Раздел 7", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела7(Контейнер, Результат, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел8_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРаздел8(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРазделы9и12_2023Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРазделы9и12(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ВывестиРезультатВыполненияСКД_2023Кв1(ВозвратРезультат, ИмяВариантаНастроек, ПараметрыОтчета)
	
	ВывестиРезультатВыполненияСКД(ВозвратРезультат, ИмяВариантаНастроек, ПараметрыОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область Форма2025Кв1

Процедура ПолучитьСведенияОПоказателяхОтчетаНДСФормаОтчета2025Кв1(ПоказателиОтчета) Экспорт
	
	// Раздел 2
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200001003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200002003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200003003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200006003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200007003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200008003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200009003", Истина, Истина);

	// Раздел 3, ч1 (строки 010-118)
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300001003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300001005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002105", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002203", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002205", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003303", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003305", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003403", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003405", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004203", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300006003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300008005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300009005", Истина, Истина);
	
	// Раздел 3, ч2 (строки 120-210)
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300012003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300013003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300014003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300015003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300016003", Истина, Истина);
	
	// Раздел 7
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000102", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000104", Истина, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьОтчетНДСФормаОтчета2025Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	Перем ТаблицаРасшифровки;
	
	ПараметрыОтчета.Вставить("ПравилаЗаполнения", "2025Кв1");
	
	// Отбор по организации
	СписокОрганизаций = Новый СписокЗначений();
	СписокОрганизаций.Добавить(ПараметрыОтчета["Организация"]);
	ЭтоОбособленноеПодразделение = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПараметрыОтчета["Организация"], "ГоловнаяОрганизация"));
	Если НЕ ЭтоОбособленноеПодразделение Тогда
		Для Каждого ЭлементСписка Из ПараметрыОтчета["ГруппаОрганизаций"] Цикл
			ВсяОрганизация = Справочники.Организации.ВсяОрганизация(ЭлементСписка.Значение);
			Для Каждого Организация Из ВсяОрганизация Цикл
				СписокОрганизаций.Добавить(Организация);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	ПараметрыОтчета.Вставить("СписокОрганизаций", СписокОрганизаций);
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(
		ПараметрыОтчета["Организация"],
		ПараметрыОтчета["мДатаКонцаПериодаОтчета"]);
		
	СледуетЗаполнитьРаздел3 = Не УчетнаяПолитика.НДСПрименяетсяОсвобождениеОтУплаты;
	
	ЗаполнитьРаздел1_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРаздел2_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	Если СледуетЗаполнитьРаздел3 Тогда
		ЗаполнитьРаздел3_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	КонецЕсли;
	
	ЗаполнитьРаздел7_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	// СегментацияДанныхДекларации
	РегламентированнаяОтчетность.УдалитьДополнительныеФайлыДекларацииНДС(ПараметрыОтчета["Декларация"]);
	
	ЗаполнитьРаздел8_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРазделы10и11_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРазделы9и12_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	ПоместитьВоВременноеХранилище(Контейнер,			ПараметрыОтчета.АдресВоВременномХранилище);
    ПоместитьВоВременноеХранилище(ТаблицаРасшифровки,	ПараметрыОтчета.АдресВременногоХранилищаРасшифровки);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел1_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРаздел1(Контейнер.Раздел1, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел2_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные
	РезультатДерево = Новый ДеревоЗначений();
	ВывестиРезультатВыполненияСКД_2025Кв1(РезультатДерево, "Раздел 2", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела2(Контейнер.Раздел2, РезультатДерево, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел3_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные:
	ТаблицаЧасть1 = Новый ТаблицаЗначений();
	ТаблицаЧасть2 = Новый ТаблицаЗначений();
	ВывестиРезультатВыполненияСКД_2025Кв1(ТаблицаЧасть1, "Раздел 3, ч1 (строки 010-118)", ПараметрыОтчета);
	ВывестиРезультатВыполненияСКД_2025Кв1(ТаблицаЧасть2, "Раздел 3, ч2 (строки 120-210)", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела3(Контейнер.Раздел3, ТаблицаЧасть1, ТаблицаЧасть2);
	
	ДобавитьРасшифровкуРаздела3_2025Кв1(ТаблицаРасшифровки, Контейнер.Раздел3, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ДобавитьРасшифровкуРаздела3_2025Кв1(ТаблицаРасшифровки, Раздел3, ПараметрыОтчета)
	
	// Строка 010
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300001003",
		"Строка 010 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20%), налоговая база""",
		"", "Строка 010 (налоговая база)", Раздел3.П000300001003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300001003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300001005",
		"Строка 010 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20%), сумма НДС""",
		"", "Строка 010 (сумма налога)", Раздел3.П000300001005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300001005)",
		ПараметрыОтчета);
		
	// Строка 020
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002003",
		"Строка 020 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10%), налоговая база""",
		"", "Строка 020 (налоговая база)", Раздел3.П000300002003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002005",
		"Строка 020 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10%), сумма НДС""",
		"", "Строка 020 (сумма налога)", Раздел3.П000300002005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002005)",
		ПараметрыОтчета);
		
	// Строка 021
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002103",
		"Строка 021 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7%), налоговая база""",
		"", "Строка 021 (налоговая база)", Раздел3.П000300002103,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002103)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002105",
		"Строка 021 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7%), сумма НДС""",
		"", "Строка 021 (сумма налога)", Раздел3.П000300002105,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002105)",
		ПараметрыОтчета);
	
	// Строка 022
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002203",
		"Строка 022 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5%), налоговая база""",
		"", "Строка 022 (налоговая база)", Раздел3.П000300002203,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002203)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002205",
		"Строка 022 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5%), сумма НДС""",
		"", "Строка 022 (сумма налога)", Раздел3.П000300002205,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002205)",
		ПараметрыОтчета);
		
	// Строка 030
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003003",
		"Строка 030 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20/120), налоговая база""",
		"", "Строка 030 (налоговая база)", Раздел3.П000300003003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003005",
		"Строка 030 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20/120), сумма НДС""",
		"", "Строка 030 (сумма налога)", Раздел3.П000300003005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003005)",
		ПараметрыОтчета);
		
	// Строка 033
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003303",
		"Строка 033 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7/107), налоговая база""",
		"", "Строка 033 (налоговая база)", Раздел3.П000300003303,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003303)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003305",
		"Строка 033 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7/107), сумма НДС""",
		"", "Строка 033 (сумма налога)", Раздел3.П000300003305,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003305)",
		ПараметрыОтчета);
		
	// Строка 034
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003403",
		"Строка 034 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5/105), налоговая база""",
		"", "Строка 034 (налоговая база)", Раздел3.П000300003403,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003403)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003405",
		"Строка 034 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5/105), сумма НДС""",
		"", "Строка 034 (сумма налога)", Раздел3.П000300003405,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003405)",
		ПараметрыОтчета);
		
	// Строка 040
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004003",
		"Строка 040 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10/110), налоговая база""",
		"", "Строка 040 (налоговая база)", Раздел3.П000300004003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004005",
		"Строка 040 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10/110), сумма НДС""",
		"", "Строка 040 (сумма налога)", Раздел3.П000300004005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004005)",
		ПараметрыОтчета);
		
	// Строка 041
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004103",
		"Строка 041 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18%), налоговая база""",
		"", "Строка 041 (налоговая база)", Раздел3.П000300004103,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004103)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004105",
		"Строка 041 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18%), сумма НДС""",
		"", "Строка 041 (сумма налога)", Раздел3.П000300004005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004105)",
		ПараметрыОтчета);
		
	// Строка 042
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004203",
		"Строка 042 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18/118), налоговая база""",
		"", "Строка 042 (налоговая база)", Раздел3.П000300004203,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004203)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004205",
		"Строка 042 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18/118), сумма НДС""",
		"", "Строка 042 (сумма налога)", Раздел3.П000300004205,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004205)",
		ПараметрыОтчета);
		
	// Строка 060
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300006003",
		"Строка 060 (раздел 3) ""Выполнение строительно-монтажных работ для собственного потребления, налоговая база""",
		"", "Строка 060 (налоговая база)", Раздел3.П000300006003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300006003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300006005",
		"Строка 060 (раздел 3) ""Выполнение строительно-монтажных работ для собственного потребления, сумма НДС""",
		"", "Строка 060 (сумма налога)", Раздел3.П000300006005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300006005)",
		ПараметрыОтчета);
		
	// Строка 070
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300007003",
		"Строка 070 (раздел 3) ""Суммы полученной оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, налоговая база""",
		"", "Строка 070 (налоговая база)", Раздел3.П000300007003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300007003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300007005",
		"Строка 070 (раздел 3) ""Суммы полученной оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, сумма НДС""",
		"", "Строка 070 (сумма налога)", Раздел3.П000300007005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300007005)",
		ПараметрыОтчета);

	// Строка 080
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300008005",
		"Строка 080 (раздел 3) ""Суммы налога, подлежащие восстановлению, всего""",
		"", "Строка 080 (сумма налога)", Раздел3.П000300008005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300008005)",
		ПараметрыОтчета);

	// Строка 090
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300009005",
		"Строка 090 (раздел 3) ""Суммы налога, подлежащие восстановлению в соответствии с пп.3 п.3 ст.170 НК""",
		"", "Строка 090 (сумма налога)", Раздел3.П000300009005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300009005)",
		ПараметрыОтчета);
		
	// Строка 105
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300010503",
		"Строка 105 (раздел 3) ""Корректировка реализации, передачи имущественных прав на основании п.6 ст.105.3 НК, налоговая база""",
		"", "Строка 105 (налоговая база)", Раздел3.П000300010503,
		"Раздел3",
		"Раздел 3 (расшифровка П000300010503)",
		ПараметрыОтчета);
		
		
	// Строка 120
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300012003",
		"Строка 120 (раздел 3) ""Сумма налога, подлежащая вычету в соответствии с пп.2,4,5,17 ст.171 НК""",
		"", "Строка 120 (сумма налога)", Раздел3.П000300012003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300012003)",
		ПараметрыОтчета);
	
	// Строка 130
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300013003",
		"Строка 130 (раздел 3) ""Сумма налога, предъявленная налогоплательщику - покупателю при перечислении суммы оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, подлежащая вычету у покупателя""",
		"", "Строка 130 (сумма налога)", Раздел3.П000300013003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300013003)",
		ПараметрыОтчета);
	
	// Строка 140
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300014003",
		"Строка 140 (раздел 3) ""Сумма налога, исчисленная при выполнении строительно-монтажных работ для собственного потребления, подлежащая вычету""",
		"", "Строка 140 (сумма налога)", Раздел3.П000300014003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300014003)",
		ПараметрыОтчета);
	
	// Строка 150
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300015003",
		"Строка 150 (раздел 3) ""Сумма налога, уплаченная налогоплательщиком таможенным органам при ввозе товаров на территорию Российской Федерации и иные территории, находящиеся под её юрисдикцией, в таможенных процедурах выпуска для внутреннего потребления, переработки для внутреннего потребления, временного ввоза и переработки вне таможенной территории""",
		"", "Строка 150 (сумма налога)", Раздел3.П000300015003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300015003)",
		ПараметрыОтчета);
		
	// Строка 160
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300016003",
		"Строка 160 (раздел 3) ""Сумма налога, уплаченная налогоплательщиком налоговым органам при ввозе товаров на территорию Российской Федерации и иные территории, находящиеся под её юрисдикцией, с территории государств-членов Евразийского экономического союза""",
		"", "Строка 160 (сумма налога)", Раздел3.П000300016003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300016003)",
		ПараметрыОтчета);
		
	// Строка 170
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300017003",
		"Строка 170 (раздел 3) ""Сумма налога, исчисленная продавцом с сумм оплаты, частичной оплаты, подлежащая вычету у продавца с даты отгрузки соответствующих товаров (выполнения работ, оказания услуг)""",
		"", "Строка 170 (сумма налога)", Раздел3.П000300017003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300017003)",
		ПараметрыОтчета);
	
	// Строка 180
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300018003",
		"Строка 180 (раздел 3) ""Сумма налога, уплаченная в бюджет налогоплательщиком в качестве покупателя - налогового агента, подлежащая вычету""",
		"", "Строка 180 (сумма налога)", Раздел3.П000300018003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300018003)",
		ПараметрыОтчета);
		
КонецПроцедуры

Процедура ЗаполнитьРаздел7_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные
	Результат = Новый ДеревоЗначений();
	ВывестиРезультатВыполненияСКД_2025Кв1(Результат, "Раздел 7", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела7(Контейнер, Результат, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел8_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРаздел8(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРазделы10и11_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРазделы10и11(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРазделы9и12_2025Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРазделы9и12(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ВывестиРезультатВыполненияСКД_2025Кв1(ВозвратРезультат, ИмяВариантаНастроек, ПараметрыОтчета)
	
	ВывестиРезультатВыполненияСКД(ВозвратРезультат, ИмяВариантаНастроек, ПараметрыОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область Форма2026Кв1

Процедура ПолучитьСведенияОПоказателяхОтчетаНДСФормаОтчета2026Кв1(ПоказателиОтчета) Экспорт
	
	// Раздел 2
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200001003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200002003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200003003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200006003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200007003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200008003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000200009003", Истина, Истина);

	// Раздел 3, ч1 (строки 003-118)
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300000303", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300000305", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300000503", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300000505", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300000703", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300000705", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300001003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300001005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002105", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002203", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300002205", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003303", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003305", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003403", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300003405", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300004203", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300006003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300006005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300007005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300008005", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300009005", Истина, Истина);
	
	// Раздел 3, ч2 (строки 120-210)
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300012003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300013003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300014003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300015003", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000300016003", Истина, Истина);
	
	// Раздел 7
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000102", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000103", Истина, Истина);
	РегламентированнаяОтчетность.ВставитьПоказательВСтруктуру(ПоказателиОтчета, "П000700000104", Истина, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьОтчетНДСФормаОтчета2026Кв1(ПараметрыОтчета, Контейнер) Экспорт
	
	Перем ТаблицаРасшифровки;
	
	ПараметрыОтчета.Вставить("ПравилаЗаполнения", "2026Кв1");
	
	// Отбор по организации
	СписокОрганизаций = Новый СписокЗначений();
	СписокОрганизаций.Добавить(ПараметрыОтчета["Организация"]);
	ЭтоОбособленноеПодразделение = ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПараметрыОтчета["Организация"], "ГоловнаяОрганизация"));
	Если НЕ ЭтоОбособленноеПодразделение Тогда
		Для Каждого ЭлементСписка Из ПараметрыОтчета["ГруппаОрганизаций"] Цикл
			ВсяОрганизация = Справочники.Организации.ВсяОрганизация(ЭлементСписка.Значение);
			Для Каждого Организация Из ВсяОрганизация Цикл
				СписокОрганизаций.Добавить(Организация);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	ПараметрыОтчета.Вставить("СписокОрганизаций", СписокОрганизаций);
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(
		ПараметрыОтчета["Организация"],
		ПараметрыОтчета["мДатаКонцаПериодаОтчета"]);
		
	СледуетЗаполнитьРаздел3 = Не УчетнаяПолитика.НДСПрименяетсяОсвобождениеОтУплаты;
	
	ЗаполнитьРаздел1_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРаздел2_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	Если СледуетЗаполнитьРаздел3 Тогда
		ЗаполнитьРаздел3_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	КонецЕсли;
	
	ЗаполнитьРаздел7_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	// СегментацияДанныхДекларации
	РегламентированнаяОтчетность.УдалитьДополнительныеФайлыДекларацииНДС(ПараметрыОтчета["Декларация"]);
	
	ЗаполнитьРаздел8_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРазделы10и11_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	ЗаполнитьРазделы9и12_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
	ПоместитьВоВременноеХранилище(Контейнер,			ПараметрыОтчета.АдресВоВременномХранилище);
    ПоместитьВоВременноеХранилище(ТаблицаРасшифровки,	ПараметрыОтчета.АдресВременногоХранилищаРасшифровки);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел1_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРаздел1(Контейнер.Раздел1, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел2_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные
	РезультатДерево = Новый ДеревоЗначений();
	ВывестиРезультатВыполненияСКД_2026Кв1(РезультатДерево, "Раздел 2", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела2(Контейнер.Раздел2, РезультатДерево, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел3_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные:
	ТаблицаЧасть1 = Новый ТаблицаЗначений();
	ТаблицаЧасть2 = Новый ТаблицаЗначений();
	ВывестиРезультатВыполненияСКД_2026Кв1(ТаблицаЧасть1, "Раздел 3, ч1 (строки 003-118)", ПараметрыОтчета);
	ВывестиРезультатВыполненияСКД_2026Кв1(ТаблицаЧасть2, "Раздел 3, ч2 (строки 120-210)", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела3(Контейнер.Раздел3, ТаблицаЧасть1, ТаблицаЧасть2);
	
	ДобавитьРасшифровкуРаздела3_2026Кв1(ТаблицаРасшифровки, Контейнер.Раздел3, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ДобавитьРасшифровкуРаздела3_2026Кв1(ТаблицаРасшифровки, Раздел3, ПараметрыОтчета)
	
	// Строка 003
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300000303",
		"Строка 003 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (22%), налоговая база""",
		"", "Строка 003 (налоговая база)", Раздел3.П000300000303,
		"Раздел3",
		"Раздел 3 (расшифровка П000300000303)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300000305",
		"Строка 003 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (22%), сумма НДС""",
		"", "Строка 003 (сумма налога)", Раздел3.П000300000305,
		"Раздел3",
		"Раздел 3 (расшифровка П000300000305)",
		ПараметрыОтчета);
	
	// Строка 005
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300000503",
		"Строка 005 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (22/122), налоговая база""",
		"", "Строка 005 (налоговая база)", Раздел3.П000300000503,
		"Раздел3",
		"Раздел 3 (расшифровка П000300000503)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300000505",
		"Строка 005 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (22/122), сумма НДС""",
		"", "Строка 005 (сумма налога)", Раздел3.П000300000505,
		"Раздел3",
		"Раздел 3 (расшифровка П000300000505)",
		ПараметрыОтчета);
	
	// Строка 007
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300000503",
		"Строка 007 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18.03%), налоговая база""",
		"", "Строка 007 (налоговая база)", Раздел3.П000300000703,
		"Раздел3",
		"Раздел 3 (расшифровка П000300000703)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300000705",
		"Строка 007 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18.03%), сумма НДС""",
		"", "Строка 007 (сумма налога)", Раздел3.П000300000705,
		"Раздел3",
		"Раздел 3 (расшифровка П000300000705)",
		ПараметрыОтчета);
	
	// Строка 010
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300001003",
		"Строка 010 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20%), налоговая база""",
		"", "Строка 010 (налоговая база)", Раздел3.П000300001003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300001003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300001005",
		"Строка 010 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20%), сумма НДС""",
		"", "Строка 010 (сумма налога)", Раздел3.П000300001005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300001005)",
		ПараметрыОтчета);
		
	// Строка 020
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002003",
		"Строка 020 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10%), налоговая база""",
		"", "Строка 020 (налоговая база)", Раздел3.П000300002003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002005",
		"Строка 020 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10%), сумма НДС""",
		"", "Строка 020 (сумма налога)", Раздел3.П000300002005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002005)",
		ПараметрыОтчета);
		
	// Строка 021
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002103",
		"Строка 021 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7%), налоговая база""",
		"", "Строка 021 (налоговая база)", Раздел3.П000300002103,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002103)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002105",
		"Строка 021 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7%), сумма НДС""",
		"", "Строка 021 (сумма налога)", Раздел3.П000300002105,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002105)",
		ПараметрыОтчета);
	
	// Строка 022
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002203",
		"Строка 022 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5%), налоговая база""",
		"", "Строка 022 (налоговая база)", Раздел3.П000300002203,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002203)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300002205",
		"Строка 022 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5%), сумма НДС""",
		"", "Строка 022 (сумма налога)", Раздел3.П000300002205,
		"Раздел3",
		"Раздел 3 (расшифровка П000300002205)",
		ПараметрыОтчета);
		
	// Строка 030
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003003",
		"Строка 030 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20/120), налоговая база""",
		"", "Строка 030 (налоговая база)", Раздел3.П000300003003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003005",
		"Строка 030 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (20/120), сумма НДС""",
		"", "Строка 030 (сумма налога)", Раздел3.П000300003005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003005)",
		ПараметрыОтчета);
		
	// Строка 033
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003303",
		"Строка 033 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7/107), налоговая база""",
		"", "Строка 033 (налоговая база)", Раздел3.П000300003303,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003303)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003305",
		"Строка 033 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (7/107), сумма НДС""",
		"", "Строка 033 (сумма налога)", Раздел3.П000300003305,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003305)",
		ПараметрыОтчета);
		
	// Строка 034
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003403",
		"Строка 034 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5/105), налоговая база""",
		"", "Строка 034 (налоговая база)", Раздел3.П000300003403,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003403)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300003405",
		"Строка 034 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (5/105), сумма НДС""",
		"", "Строка 034 (сумма налога)", Раздел3.П000300003405,
		"Раздел3",
		"Раздел 3 (расшифровка П000300003405)",
		ПараметрыОтчета);
		
	// Строка 040
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004003",
		"Строка 040 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10/110), налоговая база""",
		"", "Строка 040 (налоговая база)", Раздел3.П000300004003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004005",
		"Строка 040 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (10/110), сумма НДС""",
		"", "Строка 040 (сумма налога)", Раздел3.П000300004005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004005)",
		ПараметрыОтчета);
		
	// Строка 041
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004103",
		"Строка 041 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18%), налоговая база""",
		"", "Строка 041 (налоговая база)", Раздел3.П000300004103,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004103)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004105",
		"Строка 041 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18%), сумма НДС""",
		"", "Строка 041 (сумма налога)", Раздел3.П000300004005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004105)",
		ПараметрыОтчета);
		
	// Строка 042
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004203",
		"Строка 042 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18/118), налоговая база""",
		"", "Строка 042 (налоговая база)", Раздел3.П000300004203,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004203)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300004205",
		"Строка 042 (раздел 3) ""Реализация (передача для собственных нужд) товаров (работ, услуг), передача имущественных, всего (18/118), сумма НДС""",
		"", "Строка 042 (сумма налога)", Раздел3.П000300004205,
		"Раздел3",
		"Раздел 3 (расшифровка П000300004205)",
		ПараметрыОтчета);
		
	// Строка 060
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300006003",
		"Строка 060 (раздел 3) ""Выполнение строительно-монтажных работ для собственного потребления, налоговая база""",
		"", "Строка 060 (налоговая база)", Раздел3.П000300006003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300006003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300006005",
		"Строка 060 (раздел 3) ""Выполнение строительно-монтажных работ для собственного потребления, сумма НДС""",
		"", "Строка 060 (сумма налога)", Раздел3.П000300006005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300006005)",
		ПараметрыОтчета);
		
	// Строка 070
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300007003",
		"Строка 070 (раздел 3) ""Суммы полученной оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, налоговая база""",
		"", "Строка 070 (налоговая база)", Раздел3.П000300007003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300007003)",
		ПараметрыОтчета);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300007005",
		"Строка 070 (раздел 3) ""Суммы полученной оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, сумма НДС""",
		"", "Строка 070 (сумма налога)", Раздел3.П000300007005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300007005)",
		ПараметрыОтчета);

	// Строка 080
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300008005",
		"Строка 080 (раздел 3) ""Суммы налога, подлежащие восстановлению, всего""",
		"", "Строка 080 (сумма налога)", Раздел3.П000300008005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300008005)",
		ПараметрыОтчета);

	// Строка 090
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300009005",
		"Строка 090 (раздел 3) ""Суммы налога, подлежащие восстановлению в соответствии с пп.3 п.3 ст.170 НК""",
		"", "Строка 090 (сумма налога)", Раздел3.П000300009005,
		"Раздел3",
		"Раздел 3 (расшифровка П000300009005)",
		ПараметрыОтчета);
		
		
	// Строка 120
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300012003",
		"Строка 120 (раздел 3) ""Сумма налога, подлежащая вычету в соответствии с пп.2,4,5,17 ст.171 НК""",
		"", "Строка 120 (сумма налога)", Раздел3.П000300012003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300012003)",
		ПараметрыОтчета);
	
	// Строка 130
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300013003",
		"Строка 130 (раздел 3) ""Сумма налога, предъявленная налогоплательщику - покупателю при перечислении суммы оплаты, частичной оплаты в счет предстоящих поставок товаров (выполнения работ, оказания услуг), передачи имущественных прав, подлежащая вычету у покупателя""",
		"", "Строка 130 (сумма налога)", Раздел3.П000300013003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300013003)",
		ПараметрыОтчета);
	
	// Строка 140
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300014003",
		"Строка 140 (раздел 3) ""Сумма налога, исчисленная при выполнении строительно-монтажных работ для собственного потребления, подлежащая вычету""",
		"", "Строка 140 (сумма налога)", Раздел3.П000300014003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300014003)",
		ПараметрыОтчета);
	
	// Строка 150
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300015003",
		"Строка 150 (раздел 3) ""Сумма налога, уплаченная налогоплательщиком таможенным органам при ввозе товаров на территорию Российской Федерации и иные территории, находящиеся под её юрисдикцией, в таможенных процедурах выпуска для внутреннего потребления, переработки для внутреннего потребления, временного ввоза и переработки вне таможенной территории""",
		"", "Строка 150 (сумма налога)", Раздел3.П000300015003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300015003)",
		ПараметрыОтчета);
		
	// Строка 160
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300016003",
		"Строка 160 (раздел 3) ""Сумма налога, уплаченная налогоплательщиком налоговым органам при ввозе товаров на территорию Российской Федерации и иные территории, находящиеся под её юрисдикцией, с территории государств-членов Евразийского экономического союза""",
		"", "Строка 160 (сумма налога)", Раздел3.П000300016003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300016003)",
		ПараметрыОтчета);
		
	// Строка 170
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300017003",
		"Строка 170 (раздел 3) ""Сумма налога, исчисленная продавцом с сумм оплаты, частичной оплаты, подлежащая вычету у продавца с даты отгрузки соответствующих товаров (выполнения работ, оказания услуг)""",
		"", "Строка 170 (сумма налога)", Раздел3.П000300017003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300017003)",
		ПараметрыОтчета);
	
	// Строка 180
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000300018003",
		"Строка 180 (раздел 3) ""Сумма налога, уплаченная в бюджет налогоплательщиком в качестве покупателя - налогового агента, подлежащая вычету""",
		"", "Строка 180 (сумма налога)", Раздел3.П000300018003,
		"Раздел3",
		"Раздел 3 (расшифровка П000300018003)",
		ПараметрыОтчета);
		
КонецПроцедуры

Процедура ЗаполнитьРаздел7_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Получаем данные
	Результат = Новый ДеревоЗначений();
	ВывестиРезультатВыполненияСКД_2026Кв1(Результат, "Раздел 7", ПараметрыОтчета);
	
	ЗаполнитьКонтейнерРаздела7(Контейнер, Результат, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел8_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРаздел8(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРазделы10и11_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРазделы10и11(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ЗаполнитьРазделы9и12_2026Кв1(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ЗаполнитьРазделы9и12(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета);
	
КонецПроцедуры

Процедура ВывестиРезультатВыполненияСКД_2026Кв1(ВозвратРезультат, ИмяВариантаНастроек, ПараметрыОтчета)
	
	ВывестиРезультатВыполненияСКД(ВозвратРезультат, ИмяВариантаНастроек, ПараметрыОтчета);
	
КонецПроцедуры

#КонецОбласти

#Область Общие

Процедура ЗаполнитьРаздел1(Раздел1, ПараметрыОтчета)
	
	КодОКТМО = УчетНДС.ПолучитьКодОКТМО(ПараметрыОтчета);
	Раздел1.П000100001003 = КодОКТМО;
	
КонецПроцедуры

Процедура ЗаполнитьКонтейнерРаздела2(Раздел2, РезультатДерево, ТаблицаРасшифровки, ПараметрыОтчета)
	
	КодОКТМО = УчетНДС.ПолучитьКодОКТМО(ПараметрыОтчета);
	
	ПерваяСтраницаРаздел2 = Раздел2[0].Данные;
	
	ПустаяСтраницаРаздел2 = Новый ФиксированнаяСтруктура(ПерваяСтраницаРаздел2);
	
	// Подготавливаем контейнер
	Пока Раздел2.Количество()>1 Цикл
		Раздел2.Удалить(1);
	КонецЦикла;
	
	НомерСтраницы = 0;
	
	Для Каждого СтрокаКонтрагент Из РезультатДерево.Строки Цикл
		Для Каждого СтрокаКодОперации Из СтрокаКонтрагент.Строки Цикл
			НомерСтраницы = НомерСтраницы + 1;
			
			Если НомерСтраницы = 1 Тогда
				СтраницаРаздел2 = ПерваяСтраницаРаздел2;
				
			Иначе
				// Добавляем новую страницу раздела
				СтраницаРаздел2 = Новый Структура(ПустаяСтраницаРаздел2);
				
				НоваяСтрока = Раздел2.Добавить();
				НоваяСтрока.Данные = СтраницаРаздел2;
			КонецЕсли;
			
			Для Каждого ДетальнаяСтрока Из СтрокаКодОперации.Строки Цикл
				ЗаполнитьЗначенияСвойств(СтраницаРаздел2, ДетальнаяСтрока);
				
				СтраницаРаздел2.П000200005003 = КодОКТМО;
				
				ДобавитьРасшифровкуРаздела2(ТаблицаРасшифровки, СтраницаРаздел2, ДетальнаяСтрока, НомерСтраницы, ПараметрыОтчета);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРасшифровкуРаздела2(ТаблицаРасшифровки, СтраницаРаздел2, ДетальнаяСтрока, НомерСтраницы, ПараметрыОтчета);
	
	// Строка 060
	ДополнительныйОтбор = Новый Структура();
	ДополнительныйОтбор.Вставить("Контрагент",	ДетальнаяСтрока["Контрагент"]);
	ДополнительныйОтбор.Вставить("КодОперации",	ДетальнаяСтрока["КодОперации"]);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000200006003" + "_" + НомерСтраницы,
		"Строка 060 (раздел 2, страница " + НомерСтраницы + ") ""Сумма налога, подлежащая уплате в бюджет""",
		"", "Строка 060 (сумма налога)", СтраницаРаздел2.П000200006003,
		"Раздел2",
		"Раздел 2 (расшифровка П000200006003)",	// КлючВарианта
		ПараметрыОтчета,
		ДополнительныйОтбор);
		
	// Строка 080
	ДополнительныйОтбор = Новый Структура();
	ДополнительныйОтбор.Вставить("Контрагент",	ДетальнаяСтрока["Контрагент"]);
	ДополнительныйОтбор.Вставить("КодОперации",	ДетальнаяСтрока["КодОперации"]);
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000200008003" + "_" + НомерСтраницы,
		"Строка 080 (раздел 2, страница " + НомерСтраницы + ") ""Сумма налога, исчисленная при отгрузке товаров""",
		"", "Строка 080 (сумма налога)", СтраницаРаздел2.П000200008003,
		"Раздел2",
		"Раздел 2 (расшифровка П000200008003)",	// КлючВарианта
		ПараметрыОтчета,
		ДополнительныйОтбор);
		
КонецПроцедуры

Процедура ЗаполнитьКонтейнерРаздела3(Раздел3, ТаблицаЧасть1, ТаблицаЧасть2)
	
	ДанныеЧасть1 = ТаблицаЧасть1[0];
	ДанныеЧасть2 = ТаблицаЧасть2[0];
	ЗаполнитьЗначенияСвойств(Раздел3, ДанныеЧасть1);
	ЗаполнитьЗначенияСвойств(Раздел3, ДанныеЧасть2);
	
	// Заменяем значения Null на ноль.
	Для Каждого Элемент Из Раздел3 Цикл
		Если Элемент.Значение = Null Тогда
			Раздел3[Элемент.Ключ] = 0;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКонтейнерРаздела7(Контейнер, ДеревоДанных, ТаблицаРасшифровки, ПараметрыОтчета)
	
	Если ДеревоДанных.Строки.Количество() = 0 Тогда
		ИнициализироватьРаздел7(Контейнер, ПараметрыОтчета);
		
		Возврат;
	КонецЕсли;
	
	ОчиститьРаздел7(Контейнер, ПараметрыОтчета);
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаКодОперации Из ДеревоДанных.Строки Цикл
		НомерСтроки = НомерСтроки + 1;
		
		ЗаполнитьСтрокуРаздел7(Контейнер, НомерСтроки, СтрокаКодОперации, ТаблицаРасшифровки, ПараметрыОтчета);
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьРаздел7(Контейнер, ПараметрыОтчета)
	
	КодОперацииПоУмолчанию = "       ";
	
	Контейнер.Раздел7.Вставить("П000700000101_1", КодОперацииПоУмолчанию); // КодОперации
	Контейнер.Раздел7.Вставить("П000700000102_1", 0); // СтоимостьРеализации
	Контейнер.Раздел7.Вставить("П000700000103_1", 0); // СтоимостьПриобретения
	Контейнер.Раздел7.Вставить("П000700000104_1", 0); // НДС
	
	Контейнер.Раздел7.Вставить("П000700001001", 0); // СуммаАванса
	
	Контейнер.Раздел7_ДанныеДопСтрок.Очистить();
	
	НоваяСтрока = Контейнер.Раздел7_ДанныеДопСтрок.Добавить();
	НоваяСтрока.П000700000101 = КодОперацииПоУмолчанию;
	
КонецПроцедуры

Процедура ОчиститьРаздел7(Контейнер, ПараметрыОтчета)
	
	УдаляемыеЭлементы = Новый Массив();
	
	Для Каждого Элемент Из Контейнер.Раздел7 Цикл
		Если Элемент.Ключ = "П000700001001" Тогда // СуммаАванса
			Продолжить;
		КонецЕсли;
		
		УдаляемыеЭлементы.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	Для Каждого ИмяЭлемента Из УдаляемыеЭлементы Цикл
		Контейнер.Раздел7.Удалить(ИмяЭлемента);
	КонецЦикла;
	
	Контейнер.Раздел7_ДанныеДопСтрок.Очистить();
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуРаздел7(Контейнер, НомерСтроки, ДанныеЗаполнения, ТаблицаРасшифровки, ПараметрыОтчета)
	
	ИмяПоляКодОперации           = "П000700000101";
	ИмяПоляСтоимостьРеализации   = "П000700000102";
	ИмяПоляСтоимостьПриобретения = "П000700000103";
	ИмяПоляНДС                   = "П000700000104";
	
	КодОперацииСтрокой		= ДанныеЗаполнения["Р7_" + ИмяПоляКодОперации + "_Код"];
	СтоимостьРеализации		= ДанныеЗаполнения["Р7_" + ИмяПоляСтоимостьРеализации];
	СтоимостьПриобретения	= ДанныеЗаполнения["Р7_" + ИмяПоляСтоимостьПриобретения];
	НДС						= ДанныеЗаполнения["Р7_" + ИмяПоляНДС];
	
	СтрокаРаздел7 = Контейнер.Раздел7_ДанныеДопСтрок.Добавить();
	СтрокаРаздел7[ИмяПоляКодОперации]			= КодОперацииСтрокой;
	СтрокаРаздел7[ИмяПоляСтоимостьРеализации]	= СтоимостьРеализации;
	СтрокаРаздел7[ИмяПоляСтоимостьПриобретения]	= СтоимостьПриобретения;
	СтрокаРаздел7[ИмяПоляНДС]					= НДС;
	
	ДопОтбор = Новый Структура();
	ДопОтбор.Вставить("Р7_П000700000101_Код", КодОперацииСтрокой);
	
	НомерСтрокиБезГруппировки = "_" + Формат(НомерСтроки, "ЧГ=0");
		
	// Графа 2
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000700000102" + НомерСтрокиБезГруппировки,
		"Графа 2 (раздел 7) ""Стоимость реализованных (переданных) товаров (работ, услуг), без налога в рублях""",
		"", "Графа 2 (сумма реализации)", СтоимостьРеализации,
		"Раздел7",
		"Раздел 7 (расшифровка П000700000102)",
		ПараметрыОтчета,
		ДопОтбор);
	
	// Графа 3
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000700000103" + НомерСтрокиБезГруппировки,
		"Графа 3 (раздел 7) ""Стоимость приобретенных товаров (работ, услуг), не облагаемых налогом, в рублях""",
		"", "Графа 3 (сумма приобретения)", СтоимостьПриобретения,
		"Раздел7",
		"Раздел 7 (расшифровка П000700000103)",
		ПараметрыОтчета,
		ДопОтбор);
	
	// Графа 4
	ДобавитьСтрокуРасшифровки(ТаблицаРасшифровки,
		"П000700000104" + НомерСтрокиБезГруппировки,
		"Графа 4 (раздел 7) ""Сумма налога по приобретенным товарам (работам, услугам), не подлежащая вычету, в рублях""",
		"", "Графа 4 (сумма налога)", НДС,
		"Раздел7",
		"Раздел 7 (расшифровка П000700000104)",
		ПараметрыОтчета,
		ДопОтбор);
	
	Контейнер.Раздел7.Вставить(ИмяПоляКодОперации			+ НомерСтрокиБезГруппировки, КодОперацииСтрокой);
	Контейнер.Раздел7.Вставить(ИмяПоляСтоимостьРеализации	+ НомерСтрокиБезГруппировки, СтоимостьРеализации);
	Контейнер.Раздел7.Вставить(ИмяПоляСтоимостьПриобретения	+ НомерСтрокиБезГруппировки, СтоимостьПриобретения);
	Контейнер.Раздел7.Вставить(ИмяПоляНДС					+ НомерСтрокиБезГруппировки, НДС);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел8(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Подготовка
	ФормироватьОсновнойРаздел		= Истина;
	ФормироватьДопЛисты				= НЕ (ПараметрыОтчета["ВидДокумента"] = 0);
	ВыводитьТолькоДопЛисты			= Ложь;
	
	// Отбор по организации
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйЭлемент.ПравоеЗначение = ПараметрыОтчета["СписокОрганизаций"];
	
	ПараметрыНовогоОтчета = Новый Структура();
	ПараметрыНовогоОтчета.Вставить("Организация",									ПараметрыОтчета["Организация"]);
	ПараметрыНовогоОтчета.Вставить("НачалоПериода",									ПараметрыОтчета["мДатаНачалаПериодаОтчета"]);
	ПараметрыНовогоОтчета.Вставить("КонецПериода",									ПараметрыОтчета["мДатаКонцаПериодаОтчета"]);
	ПараметрыНовогоОтчета.Вставить("ФормироватьДопЛисты",							ФормироватьДопЛисты);
	ПараметрыНовогоОтчета.Вставить("ДополнительныеЛистыЗаТекущийПериод",			Истина);
	ПараметрыНовогоОтчета.Вставить("ГруппироватьПоКонтрагентам",					Ложь);
	ПараметрыНовогоОтчета.Вставить("ВыводитьТолькоДопЛисты",						ВыводитьТолькоДопЛисты);
	ПараметрыНовогоОтчета.Вставить("КомпоновщикНастроек",							КомпоновщикНастроек);
	ПараметрыНовогоОтчета.Вставить("ПредставленияПричинНалогообложения",			Новый СписокЗначений());
	ПараметрыНовогоОтчета.Вставить("ВыводитьПредставленияПричинНалогообложения",	Ложь);
	ПараметрыНовогоОтчета.Вставить("УникальныйИдентификаторФормы",					ПараметрыОтчета["УникальныйИдентификаторФормы"]);
	ПараметрыНовогоОтчета.Вставить("ВыводитьОтбор",									Ложь);
	ПараметрыНовогоОтчета.Вставить("Колонтитулы_НаименованиеОтчета",				НСтр("ru='Книга покупок'"));
	ПараметрыНовогоОтчета.Вставить("Колонтитулы_ТекущийПользователь",				Строка(ПользователиКлиентСервер.АвторизованныйПользователь()));
	ПараметрыНовогоОтчета.Вставить("ЗаполнитьДанныеДляДекларации",					Истина);
	
	ПараметрыНовогоОтчета.Вставить("СсылкаНаДекларацию",							ПараметрыОтчета["Декларация"]);
	ПараметрыНовогоОтчета.Вставить("ДатаПодписиДекларации",							ПараметрыОтчета["ДатаПодписи"]);
	
	ПараметрыНовогоОтчета.Вставить("ПравилаЗаполнения",								ПараметрыОтчета.ПравилаЗаполнения);
	
	Адрес = Неопределено;
	Отчеты.КнигаПокупок735.СформироватьОтчет(ПараметрыНовогоОтчета, Адрес);
	
КонецПроцедуры

Процедура ЗаполнитьРазделы9и12(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Подготовка
	ФормироватьОсновнойРаздел		= Истина;
	ФормироватьДопЛисты				= НЕ (ПараметрыОтчета["ВидДокумента"] = 0);
	ВыводитьТолькоДопЛисты			= Ложь;
	
	// Отбор по организации
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйЭлемент.ПравоеЗначение = ПараметрыОтчета["СписокОрганизаций"];
	
	ПараметрыНовогоОтчета = Новый Структура();
	ПараметрыНовогоОтчета.Вставить("Организация",									ПараметрыОтчета["Организация"]);
	ПараметрыНовогоОтчета.Вставить("НачалоПериода",									ПараметрыОтчета["мДатаНачалаПериодаОтчета"]);
	ПараметрыНовогоОтчета.Вставить("КонецПериода",									ПараметрыОтчета["мДатаКонцаПериодаОтчета"]);
	ПараметрыНовогоОтчета.Вставить("ФормироватьДопЛисты",							ФормироватьДопЛисты);
	ПараметрыНовогоОтчета.Вставить("ДополнительныеЛистыЗаТекущийПериод",			Истина);
	ПараметрыНовогоОтчета.Вставить("ГруппироватьПоКонтрагентам",					Ложь);
	ПараметрыНовогоОтчета.Вставить("ВыводитьТолькоДопЛисты",						ВыводитьТолькоДопЛисты);
	ПараметрыНовогоОтчета.Вставить("КомпоновщикНастроек",							КомпоновщикНастроек);
	ПараметрыНовогоОтчета.Вставить("ПредставленияПричинНалогообложения",			Новый СписокЗначений());
	ПараметрыНовогоОтчета.Вставить("ВыводитьПредставленияПричинНалогообложения",	Ложь);
	ПараметрыНовогоОтчета.Вставить("УникальныйИдентификаторФормы",					ПараметрыОтчета["УникальныйИдентификаторФормы"]);
	ПараметрыНовогоОтчета.Вставить("ВыводитьОтбор",									Ложь);
	ПараметрыНовогоОтчета.Вставить("Колонтитулы_НаименованиеОтчета",				НСтр("ru='Книга продаж'"));
	ПараметрыНовогоОтчета.Вставить("Колонтитулы_ТекущийПользователь",				Строка(ПользователиКлиентСервер.АвторизованныйПользователь()));
	ПараметрыНовогоОтчета.Вставить("ЗаполнитьДанныеДляДекларации",					Истина);
	
	ПараметрыНовогоОтчета.Вставить("СсылкаНаДекларацию",							ПараметрыОтчета["Декларация"]);
	ПараметрыНовогоОтчета.Вставить("ДатаПодписиДекларации",							ПараметрыОтчета["ДатаПодписи"]);
	
	ПараметрыНовогоОтчета.Вставить("ПравилаЗаполнения",								ПараметрыОтчета.ПравилаЗаполнения);
	
	Адрес = Неопределено;
	Отчеты.КнигаПродаж735.СформироватьОтчет(ПараметрыНовогоОтчета, Адрес);
	
	// Раздел 12
	РезультатыОтчета = ПолучитьИзВременногоХранилища(Адрес);
	Контейнер.Раздел1.П000100003003 = РезультатыОтчета["ИтогиРаздел12"]["СумНалПокуп"];
	
КонецПроцедуры

Процедура ЗаполнитьРазделы10и11(Контейнер, ТаблицаРасшифровки, ПараметрыОтчета)
	
	// Отбор по организации
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
	НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
	НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	НовыйЭлемент.ПравоеЗначение = ПараметрыОтчета["СписокОрганизаций"];
	
	ПараметрыНовогоОтчета = Новый Структура();
	ПараметрыНовогоОтчета.Вставить("Организация", ПараметрыОтчета["Организация"]);
	ПараметрыНовогоОтчета.Вставить("ДатаНачала", ПараметрыОтчета["мДатаНачалаПериодаОтчета"]);
	ПараметрыНовогоОтчета.Вставить("ДатаКонца", ПараметрыОтчета["мДатаКонцаПериодаОтчета"]);
	ПараметрыНовогоОтчета.Вставить("УникальныйИдентификаторФормы", ПараметрыОтчета["УникальныйИдентификаторФормы"]);
	ПараметрыНовогоОтчета.Вставить("ВыводитьИтоги", Ложь);
	ПараметрыНовогоОтчета.Вставить("ГруппироватьПоКонтрагентам", Ложь);
	ПараметрыНовогоОтчета.Вставить("ВыводитьЧасть1", Истина);
	ПараметрыНовогоОтчета.Вставить("ВыводитьЧасть2", Истина);
	ПараметрыНовогоОтчета.Вставить("ВыводитьОтбор", Ложь);
	ПараметрыНовогоОтчета.Вставить("ВыводитьПодвал", Ложь);
	ПараметрыНовогоОтчета.Вставить("КомпоновщикНастроек", КомпоновщикНастроек);
	ПараметрыНовогоОтчета.Вставить("НумероватьВнутриКонтрагента", Ложь);
	ПараметрыНовогоОтчета.Вставить("Колонтитулы_НаименованиеОтчета", "Журнал учета полученных, выставленных счетов фактур (534)");
	ПараметрыНовогоОтчета.Вставить("Колонтитулы_ТекущийПользователь", Строка(ПользователиКлиентСервер.АвторизованныйПользователь()));
	ПараметрыНовогоОтчета.Вставить("ЗаполнитьДанныеДляДекларации", Истина);
	ПараметрыНовогоОтчета.Вставить("СсылкаНаДекларацию", ПараметрыОтчета["Декларация"]);
	ПараметрыНовогоОтчета.Вставить("ДатаПодписиДекларации", ПараметрыОтчета["ДатаПодписи"]);
	
	Адрес = Неопределено;
	Отчеты.ЖурналУчетаПолученныхВыставленныхСчетовФактур534.СформироватьОтчет(ПараметрыНовогоОтчета, Адрес);
	
КонецПроцедуры

Функция ПолучитьОписаниеПрименяемогоОтчетаРасшифровки(ПараметрыОтчета)
	
	ИмяОтчета = "РасшифровкаДекларацииНДС" + ПараметрыОтчета.ПравилаЗаполнения;
	ИмяМакета = "ОсновнаяСхемаКомпоновкиДанных";
	
	ОписаниеОтчета = Новый Структура();
	ОписаниеОтчета.Вставить("ИмяОтчета", ИмяОтчета);
	ОписаниеОтчета.Вставить("ИмяМакета", ИмяМакета);
	
	Возврат ОписаниеОтчета;
	
КонецФункции

Функция ПолучитьСтрокуРасшифровкиДляПоказателя(Знач ИДИменПоказателей, Знач ПараметрыОтчета) Экспорт
	
	Результат = Неопределено;
	
	ТаблицаРасшифровки = ПолучитьИзВременногоХранилища(ПараметрыОтчета["АдресВременногоХранилищаРасшифровки"]);
	
	Если ТипЗнч(ТаблицаРасшифровки) = Тип("ТаблицаЗначений") Тогда
		ИмяПоказателя = ИДИменПоказателей[0];
		
		НомерТекущейСтраницы = 0;
		ПараметрыОтчета.Свойство("НомерТекущейСтраницы", НомерТекущейСтраницы);
		Если ЗначениеЗаполнено(НомерТекущейСтраницы) Тогда
			ИмяПоказателя = ИмяПоказателя + "_" + НомерТекущейСтраницы;
		КонецЕсли;
		
		СтрокаРасшифровки = ТаблицаРасшифровки.Найти(ИмяПоказателя, "ИмяПоказателя");
		Если НЕ СтрокаРасшифровки = Неопределено Тогда
			Результат = Новый Структура("ИмяПоказателя,
				|НаименованиеПоказателя,
				|ЗнакОперации,
				|НаименованиеСлагаемого,
				|Сумма,
				|ИмяРаздела,
				|ДополнительныеПараметры");
			ЗаполнитьЗначенияСвойств(Результат, СтрокаРасшифровки);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуРасшифровки(ТаблицаРасшифровок, ИмяПоказателя, НаименованиеПоказателя, ЗнакОперации, НаименованиеСлагаемого, Сумма, ИмяРаздела, КлючВарианта, ПараметрыОтчета, СтруктураДополнительныйОтбор = Неопределено)
	
	Если СтруктураДополнительныйОтбор = Неопределено Тогда
		Отбор = Новый Структура();
	Иначе
		Отбор = СтруктураДополнительныйОтбор;
	КонецЕсли;
	
	УстановитьПараметрыСКД(Отбор, ПараметрыОтчета, Истина); // ЭтоРасшифровка
	
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных();
	ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("Заголовок", НаименованиеСлагаемого);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючВарианта",					КлючВарианта);
	ПараметрыФормы.Вставить("Отбор",						Отбор);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",		Истина);
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",	ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("ПравилаЗаполнения",			ПараметрыОтчета.ПравилаЗаполнения);
	
	ОписаниеОтчета = ПолучитьОписаниеПрименяемогоОтчетаРасшифровки(ПараметрыОтчета);
	
	Отчет = Новый Структура();
	Отчет.Вставить("ИмяОтчета",			"Отчет." + ОписаниеОтчета.ИмяОтчета + ".ФормаОбъекта");
	Отчет.Вставить("ПараметрыФормы",	ПараметрыФормы);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Отчет",	Отчет);
	
	Если ТаблицаРасшифровок = Неопределено Тогда
		ТаблицаРасшифровок = Новый ТаблицаЗначений;
		ТаблицаРасшифровок.Колонки.Добавить("ИмяПоказателя");
		ТаблицаРасшифровок.Колонки.Добавить("НаименованиеПоказателя");
		ТаблицаРасшифровок.Колонки.Добавить("ЗнакОперации");
		ТаблицаРасшифровок.Колонки.Добавить("НаименованиеСлагаемого");
		ТаблицаРасшифровок.Колонки.Добавить("Сумма");
		ТаблицаРасшифровок.Колонки.Добавить("ИмяРаздела");
		ТаблицаРасшифровок.Колонки.Добавить("ДополнительныеПараметры");
	КонецЕсли;
	
	НоваяСтрокаРасшифровки = ТаблицаРасшифровок.Добавить();
	НоваяСтрокаРасшифровки.ИмяПоказателя           = ИмяПоказателя;
	НоваяСтрокаРасшифровки.НаименованиеПоказателя  = НаименованиеПоказателя;
	НоваяСтрокаРасшифровки.ЗнакОперации            = ЗнакОперации;
	НоваяСтрокаРасшифровки.НаименованиеСлагаемого  = НаименованиеСлагаемого;
	НоваяСтрокаРасшифровки.Сумма                   = Сумма;
	НоваяСтрокаРасшифровки.ИмяРаздела              = ИмяРаздела;
	НоваяСтрокаРасшифровки.ДополнительныеПараметры = ДополнительныеПараметры;
	
КонецПроцедуры

Процедура ВывестиРезультатВыполненияСКД(ВозвратРезультат, ИмяВариантаНастроек, ПараметрыОтчета)
	
    // Настраиваем схему КД
	НастройкиСКД = ПолучитьНастройкиСКД(ПараметрыОтчета, ИмяВариантаНастроек);
	ИспользуемаяСхемаКомпоновкиДанных	= НастройкиСКД["ИспользуемаяСхемаКомпоновкиДанных"];
	НовыйКомпоновщикНастроек			= НастройкиСКД["НовыйКомпоновщикНастроек"];
	
	// Выполняем схему
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		ИспользуемаяСхемаКомпоновкиДанных,				// 1
		НовыйКомпоновщикНастроек.ПолучитьНастройки(),	// 2
		,												// 3
		,												// 4
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));// 5
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений();
	ПроцессорВывода.УстановитьОбъект(ВозвратРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	УдалитьСлужебныеПрефиксыВИменахКолонок(ВозвратРезультат);
	
КонецПроцедуры

Функция ПолучитьНастройкиСКД(ПараметрыОтчета, ИмяВариантаНастроек)
	
	ОписаниеОтчета = ПолучитьОписаниеПрименяемогоОтчетаРасшифровки(ПараметрыОтчета);
	
	// Возвращаемые объекты
	ИспользуемаяСхемаКомпоновкиДанных	= Отчеты[ОписаниеОтчета.ИмяОтчета].ПолучитьМакет(ОписаниеОтчета.ИмяМакета);
	НовыйКомпоновщикНастроек			= Новый КомпоновщикНастроекКомпоновкиДанных();
	НовыйКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ИспользуемаяСхемаКомпоновкиДанных));
	НовыйКомпоновщикНастроек.ЗагрузитьНастройки(ИспользуемаяСхемаКомпоновкиДанных.ВариантыНастроек[ИмяВариантаНастроек].Настройки);
	
	// Настраиваем схем
	УстановитьПараметрыСКД(НовыйКомпоновщикНастроек, ПараметрыОтчета, Ложь); // ЭтоРасшифровка
	
	Результат = Новый Структура();
	Результат.Вставить("ИспользуемаяСхемаКомпоновкиДанных", ИспользуемаяСхемаКомпоновкиДанных);
	Результат.Вставить("НовыйКомпоновщикНастроек", НовыйКомпоновщикНастроек);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрыСКД(КомпоновщикНастроекИлиОтбор, ПараметрыОтчета, ЭтоРасшифровка)
	
	СписокОрганизаций						= ПараметрыОтчета["СписокОрганизаций"];
	НачалоПериода							= ПараметрыОтчета["ДатаНачалаРасширенногоПериодаОтчета"];
	КонецПериода							= ПараметрыОтчета["мДатаКонцаПериодаОтчета"];
	СУчетомКорректировок					= НЕ (ПараметрыОтчета["ВидДокумента"] = 0);
	КонецПериодаУчитываемыхКорректировок	= ПараметрыОтчета["ДатаПодписи"];
	Если ЗначениеЗаполнено(КонецПериодаУчитываемыхКорректировок) Тогда
		КонецПериодаУчитываемыхКорректировок= КонецДня(КонецПериодаУчитываемыхКорректировок);
	КонецЕсли;
	
	// Устанавливаем либо параметры схемы, либо ключи структуры
	Если ЭтоРасшифровка Тогда
		КомпоновщикНастроекИлиОтбор.Вставить("СписокОрганизаций",						СписокОрганизаций);
		КомпоновщикНастроекИлиОтбор.Вставить("НачалоПериода",							НачалоПериода);
		КомпоновщикНастроекИлиОтбор.Вставить("КонецПериода",							КонецПериода);
		КомпоновщикНастроекИлиОтбор.Вставить("КонецПериодаУчитываемыхКорректировок",	КонецПериодаУчитываемыхКорректировок);
		КомпоновщикНастроекИлиОтбор.Вставить("СУчетомКорректировок",					СУчетомКорректировок);
	Иначе
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроекИлиОтбор, "СписокОрганизаций",						СписокОрганизаций);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроекИлиОтбор, "НачалоПериода",							НачалоПериода);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроекИлиОтбор, "КонецПериода",							КонецПериода);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроекИлиОтбор, "КонецПериодаУчитываемыхКорректировок",	КонецПериодаУчитываемыхКорректировок);
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроекИлиОтбор, "СУчетомКорректировок",					СУчетомКорректировок);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСлужебныеПрефиксыВИменахКолонок(Дерево)
	
	ВозможныеПрефиксы = Новый Массив();
	ВозможныеПрефиксы.Добавить("Р2_");
	ВозможныеПрефиксы.Добавить("Р3_");
	ВозможныеПрефиксы.Добавить("Р3ч2_");
	
	Для Каждого Колонка Из Дерево.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		
		Индекс_ = Найти(ИмяКолонки, "_");
		
		Если Индекс_ > 0 Тогда
			ПереименоватьКолонку = НЕ (ВозможныеПрефиксы.Найти(Лев(ИмяКолонки, Индекс_)) = Неопределено);
			Если ПереименоватьКолонку Тогда
				Колонка.Имя = Сред(ИмяКолонки, Индекс_ + 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
