#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.Взаимодействия

// Получить плательщика.
//
// Параметры:
//  Ссылка  - ДокументСсылка.КвитанцияНаОплатуГосуслуг - документ, контакты которого необходимо получить.
//
// Возвращаемое значение:
//   Массив   - массив, содержащий контакты документа.
// 
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоКонтактам();
	Запрос.УстановитьПараметр("Предмет", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контакт");
	
КонецФункции

// Конец СтандартныеПодсистемы.Взаимодействия

// СтандартныеПодсистемы.ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl"
//                                      и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	МассивИсключаемыхРеквизитов = Новый Массив;
	МассивИсключаемыхРеквизитов.Добавить("ИДСтрокиДокументаОснования");
	МассивИсключаемыхРеквизитов.Добавить("АннулированнаяСуммаДокумента");
	МассивИсключаемыхРеквизитов.Добавить("УникальныйИдентификаторЗаявки");
	
	Для Каждого ИсклРекв Из МассивИсключаемыхРеквизитов Цикл
		ИсключаемыйРеквизит = Реквизиты.Найти("КвитанцияНаОплатуГосуслуг."+ИсклРекв);
		Если ИсключаемыйРеквизит <> Неопределено Тогда
			Реквизиты.Удалить(ИсключаемыйРеквизит);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
	Если Сообщение.ЗначенияРеквизитов["ВидКвитанции"] <> Неопределено Тогда
		//Если есть реквизит ВидКвитанции, то в нем находится значение реквизита документа,
		//установим его корректное представление
		Если Сообщение.ЗначенияРеквизитов["ВидКвитанции"] <= 1 Тогда
			Сообщение.ЗначенияРеквизитов["ВидКвитанции"] = "Новая";
		ИначеЕсли Сообщение.ЗначенияРеквизитов["ВидКвитанции"] = 2 Тогда
			Сообщение.ЗначенияРеквизитов["ВидКвитанции"] = "Изменение";
		ИначеЕсли Сообщение.ЗначенияРеквизитов["ВидКвитанции"] = 3 Тогда
			Сообщение.ЗначенияРеквизитов["ВидКвитанции"] = "Аннулирование";
		ИначеЕсли Сообщение.ЗначенияРеквизитов["ВидКвитанции"] = 4 Тогда
			Сообщение.ЗначенияРеквизитов["ВидКвитанции"] = "Деаннулирование";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получателей SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS;
//     * Представление - Строка - представление получателя сообщения SMS;
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект, являющийся источником данных.
//                   - Структура  - структура описывающая параметры шаблона:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект, являющийся источником данных;
//    * ВидСообщения - Строка - вид формируемого сообщения: "ЭлектроннаяПочта" или "СообщениеSMS";
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров;
//    * ОтправитьСразу - Булево - признак мгновенной отправки;
//    * ПараметрыСообщения - Структура - Дополнительные параметры сообщения.
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	ШаблоныСообщений.ЗаполнитьПолучателей(ПолучателиSMS, ПредметСообщения, "Плательщик", Перечисления.ТипыКонтактнойИнформации.Телефон);
КонецПроцедуры

// Заполняет список получателей почты при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя;
//     * Представление   - Строка - представление получателя письма;
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электронной почты.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект, являющийся источником данных.
//                   - Структура  - структура описывающая параметры шаблона:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект, являющийся источником данных;
//    * ВидСообщения - Строка - вид формируемого сообщения: "ЭлектроннаяПочта" или "СообщениеSMS";
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров;
//    * ОтправитьСразу - Булево - признак мгновенной отправки письма;
//    * ПараметрыСообщения - Структура - Дополнительные параметры сообщения;
//    * ПреобразовыватьHTMLДляФорматированногоДокумента - Булево - признак преобразование HTML текста
//             сообщения содержащего картинки в тексте письма из-за особенностей вывода изображений
//             в форматированном документе;
//    * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектроннойПочты - учетная запись для отправки письма.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	//ШаблоныСообщений.ЗаполнитьПолучателей(ПолучателиПисьма, ПредметСообщения, "Плательщик");
	//нужно заполнять, если документ не является предметом взаимодействия
КонецПроцедуры

// Конец СтандартныеПодсистемы.ШаблоныСообщений

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти


////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьЗначениеИдентификатора(Знач ИмяРеквизита,Знач ЗначениеРеквизита,Знач Дата) Экспорт
	Попытка
		ИмяРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяРеквизита, ".");
		Элемент = ЗначениеРеквизита;
		
		ОбработкаДопРеквизита = Ложь;
		ОбработкаДопСведений = Ложь;
		ОбработкаХарактеристики = Ложь;
		Для каждого ТекИмяРеквизита Из ИмяРеквизита Цикл
			Если ТекИмяРеквизита = "ДополнительныеРеквизиты" Тогда
				ОбработкаДопРеквизита = Истина;
				Продолжить;
				
			ИначеЕсли ОбработкаДопРеквизита Тогда
				
				ИмяДопРеквизита = Сред(ТекИмяРеквизита,2,СтрДлина(ТекИмяРеквизита)-2);
				Элемент = БиблиотекаФункцийОбмена.ПолучитьЗначениеДополнительногоРеквизитаСправочника(Элемент,ИмяДопРеквизита);
				ОбработкаДопРеквизита = Ложь;
				
			ИначеЕсли ТекИмяРеквизита = "ДополнительныеСведения" Тогда
				ОбработкаДопСведений = Истина;
				Продолжить;
				
			ИначеЕсли ОбработкаДопСведений Тогда
				
				ИмяДопРеквизита = Сред(ТекИмяРеквизита,2,СтрДлина(ТекИмяРеквизита)-2);
				Элемент = БиблиотекаФункцийОбмена.ПолучитьЗначениеДополнительныхСведений(Элемент,ИмяДопРеквизита);
				ОбработкаДопСведений = Ложь;
				
			ИначеЕсли ТекИмяРеквизита =  "ХарактеристикиОбязательства" Тогда
				ОбработкаХарактеристики = Истина;
				Продолжить;
				
			ИначеЕсли ОбработкаХарактеристики Тогда
				
				ИмяДопРеквизита = Сред(ТекИмяРеквизита,2,СтрДлина(ТекИмяРеквизита)-2);
				Элемент = БиблиотекаФункцийОбмена.ПолучитьХарактеристикуОбязательста(Элемент,ИмяДопРеквизита,Дата);
				ОбработкаХарактеристики = Ложь;
				
			ИначеЕсли ТекИмяРеквизита = "[УчетныйНомерОбязательства]" Тогда
				Элемент = БиблиотекаФункцийОбмена.УчетныйНомерОбязательства(Элемент);
				
			Иначе
				Элемент =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Элемент, ТекИмяРеквизита);
			КонецЕсли;
			
		КонецЦикла;
		ПолеИдентификатор = Элемент;
	Исключение
		ПолеИдентификатор = "";
	КонецПопытки;	
	Возврат ПолеИдентификатор;
КонецФункции


// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПД_4_20140101";
	КомандаПечати.Представление = НСтр("ru = 'Извещение и квитанция (ПД-4)'");
	КомандаПечати.Порядок		= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПД_4_20140101_QR";
	КомандаПечати.Представление = НСтр("ru = 'Извещение и квитанция (ПД-4) с QR-кодом'");
	КомандаПечати.Порядок		= 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПД_4_сб_налог20140101";
	КомандаПечати.Представление = НСтр("ru = 'Извещение и квитанция (ПД-4 сб налог)'");
	КомандаПечати.Порядок		= 3;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПД_4_сб_налог20140101_QR";
	КомандаПечати.Представление = НСтр("ru = 'Извещение и квитанция (ПД-4 сб налог) с QR-кодом'");
	КомандаПечати.Порядок		= 4;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "Сбербанк20140101";
	КомандаПечати.Представление = НСтр("ru = 'Заявление Сбербанка'");
	КомандаПечати.Порядок		= 5;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПД_4";
	КомандаПечати.Представление = НСтр("ru = '(устарел) Извещение и квитанция (ПД-4) до 2014 г.'");
	КомандаПечати.Порядок		= 100;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "ПФ_MXL_ПД_4_сб_налог";
	КомандаПечати.Представление = НСтр("ru = '(устарел) Извещение и квитанция (ПД-4 сб налог) до 2014 г.'");
	КомандаПечати.Порядок		= 100;          
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.КвитанцияНаОплатуГосуслуг";
	КомандаПечати.Идентификатор = "Сбербанк";
	КомандаПечати.Представление = НСтр("ru = '(устарел) Заявление Сбербанка до 2014 г.'");
	КомандаПечати.Порядок		= 100;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	// Старые макеты
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПФ_MXL_ПД_4") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПД_4", "Форма № ПД-4 (старая)", ПечатьПД4(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПД_4"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПФ_MXL_ПД_4_сб_налог") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПД_4_сб_налог", "Форма № ПД-4 сб(налог)(старая)", ПечатьПД4(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПД_4_сб_налог"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Сбербанк") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Сбербанк", "Заявление Сбербанка (старое)", ПечатьСбербанка(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	// Новые макеты
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПФ_MXL_ПД_4_20140101") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПД_4_20140101", "Форма № ПД-4", ПечатьПД4_20140101(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПД_4_20140101"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПФ_MXL_ПД_4_20140101_QR") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПД_4_20140101_QR", "Форма № ПД-4 с QR-кодом", ПечатьПД4_20140101(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПД_4_20140101_QR"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПФ_MXL_ПД_4_сб_налог20140101") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПД_4_сб_налог20140101", "Форма № ПД-4 сб(налог)", ПечатьПД4_20140101(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПД_4_сб_налог20140101"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ПФ_MXL_ПД_4_сб_налог20140101_QR") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_ПД_4_сб_налог20140101_QR", "Форма № ПД-4 сб(налог) с QR-кодом", ПечатьПД4_20140101(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПД_4_сб_налог20140101_QR"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Сбербанк20140101") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Сбербанк20140101", "Заявление Сбербанка", ПечатьСбербанка20140101(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
КонецПроцедуры // Печать()

Функция СформироватьФайлыДляПодписи(Организация, МассивНачислений) Экспорт
	
	НастройкиОрганизации = БиблиотекаФункцийОбменаПовтИсп.ПолучитьНастройкиОрганизации(Организация);
	
	Если НастройкиОрганизации.ВидОбмена = Неопределено Тогда
		ТекстСообщения = НСтр("ru='Для организации """+Организация+""" не заданы настройки участника обмена с системой учета начислений и платежей.
		|Подпись не возможна.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;	
	КонецЕсли;
	
	ОбработкаФормирования = Обработки.ОбменВФорматахУФК_УФЭБС.Создать();
	Формат = Справочники.ФорматыОбменаБанкиКС.ПолучитьФорматПоВладельцуНаправлениюНаименованию(НастройкиОрганизации.ВидОбмена,Перечисления.НаправлениеОбменаБанкиКС.Экспорт,"Charge_GMP_ForSign");
	
	Если НЕ ЗначениеЗаполнено(Формат) Тогда
		ТекстСообщения = НСтр("ru='У вида обмена """+НастройкиОрганизации.ВидОбмена+""" не обнаружен формат ""Charge_GMP_ForSign"" для формирования xml файла начисления.
		|Подпись не возможна.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	Если НастройкиОрганизации.РежимПодписи <> "Самостоятельно" Тогда
		ТекстСообщения = НСтр("ru='Для организации """+Организация+""" в настройках указано формирование ЭП при выполнении обмена с системой учета начислений и платежей.
		|Подпись не выполнена.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;	
	КонецЕсли;
	
	СертификатНачислений = НастройкиОрганизации.СертификатЭПНачислений;
	
	Если НЕ ЗначениеЗаполнено(СертификатНачислений) Тогда
		ТекстСообщения = НСтр("ru='Для организации """+Организация+""" в настройке не задан сертификат для подписи начислений, необходимый для формирования ЭП.
		|Подпись не возможна.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	АдресTSA = НастройкиОрганизации.АдресTSA;
	
	Если НЕ ЗначениеЗаполнено(АдресTSA) Тогда
		ТекстСообщения = НСтр("ru='Для организации """+Организация+""" в настройке не задан адрес TSA сервера, необходимый для формирования ЭП.
		|Подпись не возможна.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	СтруктураДляФормирования = ОбработкаФормирования.ПолучитьСтруктуруДляФормированияФайла(НастройкиОрганизации.ВидОбмена,Организация,ТекущаяДатаСеанса(),МассивНачислений,Формат,Неопределено);
	СтруктураДляФормирования.ОбъектыОбмена.Колонки.Добавить("СертификатЭПНачислений");
	СтруктураДляФормирования.ОбъектыОбмена.Колонки.Добавить("НастройкаTSA");
	СтруктураДляФормирования.ОбъектыОбмена.Колонки.Добавить("АдресTSA");
	СтруктураДляФормирования.ОбъектыОбмена.Колонки.Добавить("ТекстОшибки");
	СтруктураДляФормирования.ОбъектыОбмена.Колонки.Добавить("ПарольЭПНачисления");
	
	ДанныеТекСертификата = СертификатНачислений.ДанныеСертификата.Получить();	
	
	Хост = "";
	АдресРесурса = "";
	
	ТекАдрес = СокрЛП(АдресTSA);
	Если НРег(Лев(ТекАдрес,7)) = "http://" Тогда
		ТекАдрес = Сред(ТекАдрес,8);
	ИначеЕсли  НРег(Лев(ТекАдрес,8)) = "https://" Тогда
		ТекАдрес = Сред(ТекАдрес,9);
	КонецЕсли;
	
	Порт = Неопределено;
	
	ПозицияПортаВАдресе = Найти(ТекАдрес,":");
	
	ПозицияНачалаАдресаРесурса = Найти(ТекАдрес,"/");
	
	Если ПозицияПортаВАдресе > 0 И ПозицияНачалаАдресаРесурса> ПозицияПортаВАдресе Тогда
		Хост = Сред(ТекАдрес,1,ПозицияПортаВАдресе-1);
		Порт = Число(Сред(ТекАдрес,ПозицияПортаВАдресе+1,ПозицияНачалаАдресаРесурса-1-ПозицияПортаВАдресе)); 
	Иначе
		Хост = Сред(ТекАдрес,1,ПозицияНачалаАдресаРесурса-1);
	КонецЕсли;
	АдресРесурса = Сред(ТекАдрес,ПозицияНачалаАдресаРесурса);
	
	СтруктураНастроекТSA = Новый Структура("Хост,АдресРесурса,Порт",Хост,АдресРесурса,Порт);
	
	УстановитьПривилегированныйРежим(Истина);
	ПарольЭПНачислений = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Организация,"ПарольЭПНачислений");
	УстановитьПривилегированныйРежим(Ложь);
	Если ПарольЭПНачислений = Неопределено Тогда
		ПарольЭПНачислений = "";
	КонецЕсли;
	
	Для Каждого СтрТЧ Из СтруктураДляФормирования.ОбъектыОбмена Цикл
		СтрТЧ.СертификатЭПНачислений = Base64Строка(ДанныеТекСертификата);
		СтрТЧ.СертификатЭПНачислений = СтрЗаменить(СтрТЧ.СертификатЭПНачислений,Символы.ВК,"");
		СтрТЧ.НастройкаTSA = СтруктураНастроекТSA;
		СтрТЧ.АдресTSA = АдресTSA;
		СтрТЧ.ПарольЭПНачисления = ПарольЭПНачислений;
	КонецЦикла;
	
	ОбработкаФормирования.СформироватьФайлы(СтруктураДляФормирования);
	
	МассивКУдалению = Новый Массив;
	
	Для Каждого СтрТЧ Из СтруктураДляФормирования.ОбъектыОбмена Цикл
		Если ЗначениеЗаполнено(СтрТЧ.РезультатФормирования) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстОшибки = "";
		ТЧОписаниеОшибки = ЗначениеИзСтрокиВнутр(СтрТЧ.ОписаниеОшибки);
		Для Каждого СтрОшибки Из ТЧОписаниеОшибки Цикл
			СтрокаОшибки = ?(ЗначениеЗаполнено(СтрОшибки.ПолеФайла),"ПолеФайла: "+СтрОшибки.ПолеФайла+Символы.ПС,"")
			+?(ЗначениеЗаполнено(СтрОшибки.Ошибка),"Ошибка: "+СтрОшибки.Ошибка,"");	
			ТекстОшибки = ?(ЗначениеЗаполнено(ТекстОшибки),ТекстОшибки + Символы.ПС,"")+СтрокаОшибки;
		КонецЦикла;
		СтрТЧ.ТекстОшибки = ТекстОшибки;
		
		ТекстСообщения = НСтр("ru='Не удалось подписать начисление """+СтрТЧ.Объект+""" по причине: не удалось сформировать файл по причине: "+Символы.ПС+СтрТЧ.ТекстОшибки+"'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		МассивКУдалению.Добавить(СтрТЧ);	
	КонецЦикла;
	
	//Удалим документы, по которым не сформированы файлы.
	Для Каждого ЭлМас Из МассивКУдалению Цикл
		СтруктураДляФормирования.ОбъектыОбмена.Удалить(ЭлМас);			
	КонецЦикла;
	
	Возврат СтруктураДляФормирования.ОбъектыОбмена;
	
КонецФункции

Процедура СохранитьПодписьВРегистре(Организация,ДанныеСПодписями) Экспорт
	
	Для Каждого СтрТЧ Из ДанныеСПодписями Цикл
		Если НЕ ЗначениеЗаполнено(СтрТЧ.РезультатФормирования) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = РегистрыСведений.ПодписанныеНачисления.СоздатьМенеджерЗаписи();
		Запись.Начисление = СтрТЧ.Объект;
		Запись.ПодписанноеНачисление = Новый ХранилищеЗначения(СтрТЧ.РезультатФормирования,Новый СжатиеДанных(9));
		Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьФайлыДляПодписиДляМассиваНачислений(МассивНачислений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивНачислений",МассивНачислений);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КвитанцияНаОплатуГосуслуг.Ссылка,
	|	КвитанцияНаОплатуГосуслуг.Организация КАК Организация
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|ГДЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка В(&МассивНачислений)
	|ИТОГИ ПО
	|	Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СоответствиеРезультатов = Новый Соответствие;
	Пока ВыборкаОрганизация.Следующий() Цикл
		// Вставить обработку выборки ВыборкаОрганизация
		ТекОрганизация = ВыборкаОрганизация.Организация;
		ВыборкаДетальныеЗаписи = ВыборкаОрганизация.Выбрать();
		МассивТекНачислений = Новый Массив;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивТекНачислений.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		СоответствиеРезультатов.Вставить(ТекОрганизация,СформироватьФайлыДляПодписи(ТекОрганизация,МассивТекНачислений));
	КонецЦикла;
	
	Возврат СоответствиеРезультатов;	
	
КонецФункции

Процедура УдалитьЭПНачислений(Начисления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодписанныеНачисления.Начисление
	|ИЗ
	|	РегистрСведений.ПодписанныеНачисления КАК ПодписанныеНачисления
	|ГДЕ
	|	ПодписанныеНачисления.Начисление В (&Начисления)";
	
	Запрос.УстановитьПараметр("Начисления", Начисления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Запись = РегистрыСведений.ПодписанныеНачисления.СоздатьМенеджерЗаписи();
		Запись.Начисление = ВыборкаДетальныеЗаписи.Начисление;
		Запись.Удалить();
	КонецЦикла;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает текст запроса по контактам взаимодействий, содержащимся в документе.
//
// Возвращаемое значение:
//   Строка - 
//
Функция ТекстЗапросаПоКонтактам(ЭтоФрагментЗапроса = Ложь) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КвитанцияНаОплатуГосуслуг.Плательщик КАК Контакт
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|ГДЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка = &Предмет
	|	И НЕ КвитанцияНаОплатуГосуслуг.Плательщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	Если ЭтоФрагментЗапроса Тогда
		ТекстЗапроса = "
		| ОБЪЕДИНИТЬ ВСЕ
		|" + ТекстЗапроса;
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура СоздатьШаблонСообщенияДляРассылкиКвитанций()Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		МетаданныеДокумента = Метаданные.Документы.КвитанцияНаОплатуГосуслуг;
		Назначение = МетаданныеДокумента.Представление();
		Наименование = "Для рассылки квитанций (ПД-4 с QR-кодом)";
		Тема = "Рассылка квитанций";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ШаблоныСообщений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШаблоныСообщений КАК ШаблоныСообщений
		|ГДЕ
		|	ШаблоныСообщений.Наименование = &Наименование
		|	И ШаблоныСообщений.ТемаПисьма = &ТемаПисьма
		|	И ШаблоныСообщений.Назначение = &Назначение";
		
		Запрос.УстановитьПараметр("Назначение", Назначение);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("ТемаПисьма", Тема);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() = Ложь Тогда
			Возврат; //шаблон уже есть
		КонецЕсли;
		
		Текст = "Добрый день!
		|
		|Квитанция на оплату №[КвитанцияНаОплатуГосуслуг.Номер] от [КвитанцияНаОплатуГосуслуг.Дата] 
		|за услугу ""[КвитанцияНаОплатуГосуслуг.Номенклатура.Наименование]"" 
		|на сумму [КвитанцияНаОплатуГосуслуг.СуммаДокумента] р.
		|из организации ""[КвитанцияНаОплатуГосуслуг.Организация.НаименованиеСокращенное]"" прикреплена к письму.";
		
		ПолноеИмяТипаНазначения = "Документ.КвитанцияНаОплатуГосуслуг";
		
		ПараметрыШаблона = ШаблоныСообщений.ОписаниеПараметровШаблона();
		
		ПараметрыШаблона.Вставить("Текст",Текст);
		
		ПараметрыШаблона.Вставить("Наименование", Наименование);
		ПараметрыШаблона.Вставить("Тема", Тема);
		
		ПараметрыШаблона.Вставить("Назначение", Назначение);
		ПараметрыШаблона.Вставить("ПолноеИмяТипаНазначения", ПолноеИмяТипаНазначения);
		ПараметрыШаблона.Вставить("Наименование", Наименование);
		
		ПараметрыШаблона.ФорматыВложений.Добавить("PDF","Документ Adobe PDF (.pdf)");
		
		Шаблон = Справочники.ШаблоныСообщений.СоздатьЭлемент();
		Шаблон.УстановитьНовыйКод();
		Шаблон.Заполнить(ПараметрыШаблона);
		
		ТаблицаКомандПечати = УправлениеПечатью.КомандыПечатиОбъектаДоступныеДляВложений(МетаданныеДокумента);
		
		Для Каждого СтрТЧ Из ТаблицаКомандПечати Цикл
			Если СтрТЧ.Идентификатор = "ПФ_MXL_ПД_4_20140101_QR" Тогда
				НовСтр = Шаблон.ПечатныеФормыИВложения.Добавить();
				НовСтр.Идентификатор = СтрТЧ.УникальныйИдентификатор;
				НовСтр.Имя = "";
			КонецЕсли;
		КонецЦикла;
		
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Шаблон, Истина);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//если вдруг не удалось создать пример шаблона, ничего страшного, пользователь может создать его интерактивно
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Создание шаблона сообщений для документа Квитанция на оплату",УровеньЖурналаРегистрации.Ошибка,Справочники.ШаблоныСообщений,ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры


Процедура СинхронизироватьДанныеИдентификаторов() Экспорт
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг.ТаблицаИдентификаторов КАК КвитанцияНаОплатуГосуслугТаблицаИдентификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|		ПО КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Ссылка = КвитанцияНаОплатуГосуслуг.Ссылка
	|			И (КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Значение <> КвитанцияНаОплатуГосуслуг.ЕдиныйИдентификаторПлательщика
	|					И КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ИмяВФайле = ""UnifiedPayerIdentifier""
	|				ИЛИ КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Значение <> КвитанцияНаОплатуГосуслуг.АльтернативныйИдентификаторПлательщика
	|					И КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ИмяВФайле = ""AltPayerIdentifier"")
	|ГДЕ
	|	КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ТипПоля В(&ТипыПолей)
	|	И КвитанцияНаОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ";
	
	МассивТиповПолей = Новый Массив;
	МассивТиповПолей.Добавить("ЕдиныйИдентификатор");
	МассивТиповПолей.Добавить("ЕдиныйИдентификаторУчащегося");
	МассивТиповПолей.Добавить("АльтернативныйИдентификаторУчащегося");
	МассивТиповПолей.Добавить("АльтернативныйИдентификатор");
	Запрос.УстановитьПараметр("ТипыПолей", МассивТиповПолей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения",Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьДействияПередЗаписью",Истина);
		
		Для Каждого СтрТЧ Из ДокОбъект.ТаблицаИдентификаторов Цикл
			Если СтрТЧ.ИмяВФайле = "UnifiedPayerIdentifier" 
				И (СтрТЧ.ТипПоля = "ЕдиныйИдентификатор" ИЛИ СтрТЧ.ТипПоля = "ЕдиныйИдентификаторУчащегося") Тогда
				СтрТЧ.Значение = ДокОбъект.ЕдиныйИдентификаторПлательщика;
				СтрТЧ.ПолеИдентификатор = ДокОбъект.ЕдиныйИдентификаторПлательщика;
			КонецЕсли;
			Если СтрТЧ.ИмяВФайле = "AltPayerIdentifier" 
				И (СтрТЧ.ТипПоля = "АльтернативныйИдентификаторУчащегося" ИЛИ СтрТЧ.ТипПоля = "АльтернативныйИдентификатор") Тогда
				СтрТЧ.Значение = ДокОбъект.АльтернативныйИдентификаторПлательщика;
				СтрТЧ.ПолеИдентификатор = ДокОбъект.АльтернативныйИдентификаторПлательщика;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='"+ОписаниеОшибки()+"'"));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СинхронизироватьДанныеИдентификаторов_Исправление() Экспорт
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг.ТаблицаИдентификаторов КАК КвитанцияНаОплатуГосуслугТаблицаИдентификаторов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|		ПО КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Ссылка = КвитанцияНаОплатуГосуслуг.Ссылка
	|			И (КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Значение <> КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ПолеИдентификатор
	|					И КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ИмяВФайле = ""UnifiedPayerIdentifier""
	|				ИЛИ КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Значение <> КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ПолеИдентификатор
	|					И КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ИмяВФайле = ""AltPayerIdentifier"")
	|ГДЕ
	|	КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ТипПоля В(&ТипыПолей)
	|	И КвитанцияНаОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ";
	
	МассивТиповПолей = Новый Массив;
	МассивТиповПолей.Добавить("ЕдиныйИдентификатор");
	МассивТиповПолей.Добавить("ЕдиныйИдентификаторУчащегося");
	МассивТиповПолей.Добавить("АльтернативныйИдентификаторУчащегося");
	МассивТиповПолей.Добавить("АльтернативныйИдентификатор");
	Запрос.УстановитьПараметр("ТипыПолей", МассивТиповПолей);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения",Истина);
		ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьДействияПередЗаписью",Истина);
		
		Для Каждого СтрТЧ Из ДокОбъект.ТаблицаИдентификаторов Цикл
			Если СтрТЧ.ИмяВФайле = "UnifiedPayerIdentifier" 
				И (СтрТЧ.ТипПоля = "ЕдиныйИдентификатор" ИЛИ СтрТЧ.ТипПоля = "ЕдиныйИдентификаторУчащегося") Тогда
				СтрТЧ.Значение = ДокОбъект.ЕдиныйИдентификаторПлательщика;
				СтрТЧ.ПолеИдентификатор = ДокОбъект.ЕдиныйИдентификаторПлательщика;
			КонецЕсли;
			Если СтрТЧ.ИмяВФайле = "AltPayerIdentifier" 
				И (СтрТЧ.ТипПоля = "АльтернативныйИдентификаторУчащегося" ИЛИ СтрТЧ.ТипПоля = "АльтернативныйИдентификатор") Тогда
				СтрТЧ.Значение = ДокОбъект.АльтернативныйИдентификаторПлательщика;
				СтрТЧ.ПолеИдентификатор = ДокОбъект.АльтернативныйИдентификаторПлательщика;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='"+ОписаниеОшибки()+"'"));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

//Новая ПД4
Функция ПечатьПД4_20140101(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КвитанцияНаОплатуГосуслуг_" + ИмяМакета;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет."+ИмяМакета);
	
	НужноПечататьQRКод = Прав(ИмяМакета,2)= "QR";
	
	ПечататьПоДвеКвитанцииНаЛист = Ложь;
	Попытка
		ОбластьНастроекПечати = Макет.ПолучитьОбласть("НастройкиПечати");
		ПечататьПоДвеКвитанцииНаЛист = Найти(ВРег(ОбластьНастроекПечати.Область(1,4).Текст),"ДА")>0; 
	Исключение
		ПечататьПоДвеКвитанцииНаЛист = Ложь;
	КонецПопытки;
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КвитанцияНаОплатуГосуслуг.*,
	|	ФизическиеЛица.СтраховойНомерПФР КАК СНИЛС,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.ВидКонтрагента КАК ВидКонтрагента,
	|	КвитанцияНаОплатуГосуслуг.Учащийся.Представление КАК ФИОРебенка,
	|	КвитанцияНаОплатуГосуслуг.Учащийся.Код КАК НомерЛицевогоСчетаПлательщика,
	|	КвитанцияНаОплатуГосуслуг.Договор.НомерДоговора КАК НомерДоговора,
	|	КвитанцияНаОплатуГосуслуг.КодОКАТО КАК КодОКТМО,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.Представление КАК ПлательщикФИО,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо.ИНН КАК ИННПлательщика,
	|	Выбор Когда КвитанцияНаОплатуГосуслуг.Плательщик.ВидКонтрагента = Значение(Перечисление.ЮрФизЛицо.ЮрЛицо) 
	|   Тогда ЮридическиеЛицаКонтактнаяИнформация.Представление
	|	Иначе ФизическиеЛицаКонтактнаяИнформация.Представление
	|	Конец КАК ПлательщикАдрес,
	|	ВЫБОР
	|   	КОГДА КвитанцияНаОплатуГосуслуг.СуммаДокумента = 0 
	|			ТОГДА 0
	|       ИНАЧЕ
	|			ВЫРАЗИТЬ(КвитанцияНаОплатуГосуслуг.СуммаДокумента - 0.5 КАК ЧИСЛО(15, 0)) 
	|	КОНЕЦ  КАК СуммаРуб,
	|	ВЫБОР
	|   	КОГДА КвитанцияНаОплатуГосуслуг.СуммаДокумента = 0 
	|			ТОГДА 0
	|       ИНАЧЕ
	|			(КвитанцияНаОплатуГосуслуг.СуммаДокумента - (ВЫРАЗИТЬ(КвитанцияНаОплатуГосуслуг.СуммаДокумента - 0.5 КАК ЧИСЛО(15, 0)))) * 100 
	|	КОНЕЦ КАК СуммаКоп,
	|	КвитанцияНаОплатуГосуслуг.ВидОбменаДляQRКода КАК ВидОбменаДляQRКода,
	|	КвитанцияНаОплатуГосуслуг.ФорматОбменаДляQRКода КАК ФорматОбменаДляQRКода
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|			ПО КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|			И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|			И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица.КонтактнаяИнформация КАК ЮридическиеЛицаКонтактнаяИнформация
	|			ПО КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо = ЮридическиеЛицаКонтактнаяИнформация.Ссылка
	|			И ЮридическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|			И ЮридическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|			ПО КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка В(&МассивОбъектов)
	|УПОРЯДОЧИТЬ ПО
	|	ПлательщикФИО,
	|	ФИОРебенка");
	
	
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВыводитьРазделитель = Ложь;
	
	ЕстьГИСГМП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП");
	ТонкаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	НомДок = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ПечататьПоДвеКвитанцииНаЛист Тогда
			Если ВыводитьРазделитель И НомДок%2=0 Тогда 
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		Иначе
			Если ВыводитьРазделитель Тогда 
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЕсли;
		
		ВыводитьРазделитель = Истина;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Квитанция = Макет.ПолучитьОбласть("Квитанция");
		
		ЗаполнитьЗначенияСвойств(Квитанция.Параметры, Выборка);
		
		Если ЗначениеЗаполнено(Выборка.УникальныйИдентификаторНачисления) Тогда
			Для Инд = 1 По 25 Цикл
				//Кв
				ТекСимвол = Сред(Выборка.УникальныйИдентификаторНачисления,Инд,1);
				Если ЗначениеЗаполнено(ТекСимвол) И СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(ТекСимвол) Тогда				
					ТекОбласть = Квитанция.Область("С"+Инд);
					ТекОбласть.ГраницаСнизу = ТонкаяЛиния;
				КонецЕсли;
				Квитанция.Параметры.Заполнить(Новый Структура("С"+Инд,ТекСимвол));
				//ТабличныйДокумент.Присоединить(ТекОбласть);
			КонецЦикла;
		КонецЕсли;
		
		Если НужноПечататьQRКод Тогда
			
			ОшибкаЗаполнения = Ложь;
			
			QRСтрока = "";
			
			Если ЗначениеЗаполнено(Выборка.ВидОбменаДляQRКода) И  ЗначениеЗаполнено(Выборка.ФорматОбменаДляQRКода) Тогда
				QRСтрока = ПолучитьСтрокуQRПоПравилуОбмена(ОшибкаЗаполнения, Выборка);
			Иначе
				QRСтрока = ПолучитьСтрокуQRПоВстроенномуАлгоритму(ОшибкаЗаполнения, Выборка);
			КонецЕсли;
			
			Если НЕ ОшибкаЗаполнения Тогда
				
				Если НЕ ПустаяСтрока(QRСтрока) Тогда
					
					
					ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 1, 300);
					
					Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
						
						Шаблон = Нстр("ru = 'Не удалось сформировать QR-код для документа %1.
						|Технические подробности см. в журнале регистрации.'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
						Выборка.Ссылка);
						
						ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
						
						Продолжить;
					КонецЕсли;
					
					КартинкаQRКода = Новый Картинка(ДанныеQRКода);
					
					Квитанция.Рисунки.QRКодСправа.Картинка = КартинкаQRКода;
					
				Иначе
					//уберем QR код из макета, т.к. в нем тестовые данные
					Квитанция.Рисунки.QRКодСправа.Картинка = Новый Картинка;
				КонецЕсли;
				
			Иначе
				//уберем QR код из макета, т.к. в нем тестовые данные
				Квитанция.Рисунки.QRКодСправа.Картинка = Новый Картинка;	
			КонецЕсли;
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Квитанция);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
		НомДок = НомДок + 1;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	

//Старая ПД4
Функция ПечатьПД4(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КвитанцияНаОплатуГосуслуг_" + ИмяМакета;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет."+ИмяМакета);
	
	ПечататьПоДвеКвитанцииНаЛист = Ложь;
	Попытка
		ОбластьНастроекПечати = Макет.ПолучитьОбласть("НастройкиПечати");
		ПечататьПоДвеКвитанцииНаЛист = Найти(ВРег(ОбластьНастроекПечати.Область(1,4).Текст),"ДА")>0; 
	Исключение
		ПечататьПоДвеКвитанцииНаЛист = Ложь;
	КонецПопытки;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КвитанцияНаОплатуГосуслуг.*,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.Представление КАК ПлательщикФИО,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо.ИНН КАК ИННПлательщика,
	|   ФизическиеЛицаКонтактнаяИнформация.Представление КАК ПлательщикАдрес,
	|	ВЫБОР
	|   	КОГДА КвитанцияНаОплатуГосуслуг.СуммаДокумента = 0 
	|			ТОГДА 0
	|       ИНАЧЕ
	|			ВЫРАЗИТЬ(КвитанцияНаОплатуГосуслуг.СуммаДокумента - 0.5 КАК ЧИСЛО(15, 0)) 
	|	КОНЕЦ  КАК СуммаРуб,
	|	ВЫБОР
	|   	КОГДА КвитанцияНаОплатуГосуслуг.СуммаДокумента = 0 
	|			ТОГДА 0
	|       ИНАЧЕ
	|			(КвитанцияНаОплатуГосуслуг.СуммаДокумента - (ВЫРАЗИТЬ(КвитанцияНаОплатуГосуслуг.СуммаДокумента - 0.5 КАК ЧИСЛО(15, 0)))) * 100 
	|	КОНЕЦ КАК СуммаКоп
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|	ПО КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|	И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
	|ГДЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка В(&МассивОбъектов)
	|");
	
	
	Запрос.УстановитьПараметр("МассивОбъектов",МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВыводитьРазделитель = Ложь;
	
	ЕстьГИСГМП = ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП");
	
	НомДок = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ПечататьПоДвеКвитанцииНаЛист Тогда
			Если ВыводитьРазделитель И НомДок%2=0 Тогда 
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		Иначе
			Если ВыводитьРазделитель Тогда 
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
		КонецЕсли;
		ВыводитьРазделитель = Истина;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Квитанция = Макет.ПолучитьОбласть("Квитанция");
		
		ЗаполнитьЗначенияСвойств(Квитанция.Параметры, Выборка);
		Если ЕстьГИСГМП Тогда
			ТекНазначениеПлатежа = Новый Структура("НазначениеПлатежа");
			ТекНазначениеПлатежа.НазначениеПлатежа = Выборка.НазначениеПлатежа+" ///УИН"+Выборка.УникальныйИдентификаторНачисления+?(ЗначениеЗаполнено(Выборка.ЕдиныйИдентификаторПлательщика),";ИП"+Выборка.ЕдиныйИдентификаторПлательщика,"");
			ЗаполнитьЗначенияСвойств(Квитанция.Параметры, ТекНазначениеПлатежа);	
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Квитанция);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
		НомДок = НомДок + 1;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции	

Функция СформироватьТаблицуНастроек(ИмяМакета)
	
	ТаблицаНастроек = Новый ТаблицаЗначений;
	ТаблицаНастроек.Колонки.Добавить("ИмяПоказателя");
	ТаблицаНастроек.Колонки.Добавить("НомерСтроки");
	ТаблицаНастроек.Колонки.Добавить("НомерГрафы");
	
	ОбластьНастройки = ПолучитьОбщийМакет(ИмяМакета).ПолучитьОбласть("Настройки");
	ВысотаОбласти    = ОбластьНастройки.ВысотаТаблицы;
	
	Для к = 1 по ВысотаОбласти Цикл
		НоваяСтрока = ТаблицаНастроек.Добавить();
		НоваяСтрока.НомерСтроки   = Число(ОбластьНастройки.ПолучитьОбласть(к,1).ТекущаяОбласть.Текст);
		НоваяСтрока.НомерГрафы    = Число(ОбластьНастройки.ПолучитьОбласть(к,2).ТекущаяОбласть.Текст);
		НоваяСтрока.ИмяПоказателя = ОбластьНастройки.ПолучитьОбласть(к,3).ТекущаяОбласть.Текст;
	КонецЦикла;
	
	Возврат ТаблицаНастроек;
	
КонецФункции

//Новое заявление
Процедура ЗаполнитьКвадратики20140101(Таблица,ТаблицаНастроек,НазвПоказателя, Значение, Длина, НомСтроки)
	ТонкаяЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,1);
	ДлинаЗначения    = СтрДлина(Значение);
	ПоправкаВысоты   = (НомСтроки-1)*89;
	СтруктураПоиска  = Новый Структура;
	СтруктураПоиска.Вставить("ИмяПоказателя", НазвПоказателя);
	МассивСтрокНастройки = ТаблицаНастроек.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрокНастройки.Количество()>0 Тогда
		СтрокаНастройки = МассивСтрокНастройки[0];
		С  = СтрокаНастройки.НомерГрафы;
		R  = СтрокаНастройки.НомерСтроки;
		ПоправкаКолонки = 0;   
		СтрокаПараметров = 0;
		Для инд = 0 По Длина-1 Цикл  
			Если инд > ДлинаЗначения Тогда
				Символ = " ";
			Иначе
				Символ = Сред(Значение,инд+1,1);
			КонецЕсли;      
			ТекКолонка =  С + ПоправкаКолонки;
			ТекСтрока  =  R + ПоправкаВысоты;
			Если С + ПоправкаКолонки > 43 Тогда
				Если СтрокаПараметров<=МассивСтрокНастройки.Количество() Тогда
					СтрокаПараметров = СтрокаПараметров+1;
					СтрокаНастройки = МассивСтрокНастройки[СтрокаПараметров];
					С  = СтрокаНастройки.НомерГрафы;
					R  = СтрокаНастройки.НомерСтроки;
					ПоправкаКолонки = 0;
					ТекКолонка =  С;
					ТекСтрока  =  R + ПоправкаВысоты;
				Иначе
					Возврат;
				КонецЕсли;
			КонецЕсли;
			Таблица.Область(ТекСтрока,ТекКолонка,ТекСтрока,ТекКолонка).Текст = Символ;
			Если НазвПоказателя = "УИН_" Тогда				
				Если ЗначениеЗаполнено(СокрЛП(Символ)) И СтроковыеФункцииКлиентСервер.ТолькоЛатиницаВСтроке(Символ) Тогда
					Таблица.Область(ТекСтрока,ТекКолонка,ТекСтрока,ТекКолонка).ГраницаСнизу = ТонкаяЛиния;	
				КонецЕсли;
			КонецЕсли;
			
			ПоправкаКолонки = ПоправкаКолонки+1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует табличный документ с печатными формами заявлений
// в СберБанк
// Возвращаемое значение:
//  Табличный документ - табличный документ с печатными формами квитанций
//
Функция ПечатьСбербанка20140101(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КвитанцияНаОплатуГосуслуг_СберБанк20140101";
	//ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.СберБанк20140101");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КвитанцияНаОплатуГосуслуг.Номер,
	|	КвитанцияНаОплатуГосуслуг.Дата,
	//
	|	ФизическиеЛица.СтраховойНомерПФР КАК СНИЛС,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.ВидКонтрагента КАК ВидКонтрагента,
	|	КвитанцияНаОплатуГосуслуг.Учащийся.Представление КАК ФИОРебенка,
	|	КвитанцияНаОплатуГосуслуг.Договор.НомерДоговора КАК НомерДоговора,
	|   ФизическиеЛицаКонтактнаяИнформация.Представление КАК ПлательщикАдрес,
	//
	|	КвитанцияНаОплатуГосуслуг.Организация КАК УчреждениеСсылка,
	|	КвитанцияНаОплатуГосуслуг.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	КвитанцияНаОплатуГосуслуг.ИННПолучателя КАК ИННПолучателя,
	|	КвитанцияНаОплатуГосуслуг.КПППолучателя КАК КПППолучателя,
	|	КвитанцияНаОплатуГосуслуг.ЛицевойСчет КАК ЛицевойСчетПолучателя,
	|	КвитанцияНаОплатуГосуслуг.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчетаПолучателя,
	|	КвитанцияНаОплатуГосуслуг.КодБКПлатежа КАК КБК,
	|	КвитанцияНаОплатуГосуслуг.КодОКАТО КАК КодОКАТО,
	|	КвитанцияНаОплатуГосуслуг.ЛицевойСчет.Код КАК ЛС,
	|	КвитанцияНаОплатуГосуслуг.ПолучательБанковскийСчет,
	|	КвитанцияНаОплатуГосуслуг.ПолучательБИКБанка,
	|	КвитанцияНаОплатуГосуслуг.ПолучательКазначейство,
	|	КвитанцияНаОплатуГосуслуг.ПолучательКорСчетБанка,
	|	КвитанцияНаОплатуГосуслуг.ПолучательНаименование,
	|	КвитанцияНаОплатуГосуслуг.ПолучательНаименованиеБанка,
	|	КвитанцияНаОплатуГосуслуг.НазначениеПлатежа,
	|	КвитанцияНаОплатуГосуслуг.СуммаДокумента,
	|	КвитанцияНаОплатуГосуслуг.Ссылка,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо.ИНН КАК ПлательщикИНН,
	|	КвитанцияНаОплатуГосуслуг.Плательщик,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.Представление КАК ПлательщикИмя,
	|	ВЫБОР
	|		КОГДА КвитанцияНаОплатуГосуслуг.Учащийся ССЫЛКА Справочник.Дети
	|			ТОГДА КвитанцияНаОплатуГосуслуг.Учащийся.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК УчащийсяКод,
	|	КвитанцияНаОплатуГосуслуг.СтатусСоставителя,
	|	КвитанцияНаОплатуГосуслуг.ПоказательДаты,
	|	КвитанцияНаОплатуГосуслуг.ПоказательНомера,
	|	КвитанцияНаОплатуГосуслуг.ПоказательОснования,
	|	КвитанцияНаОплатуГосуслуг.ПоказательПериода,
	|	КвитанцияНаОплатуГосуслуг.ПоказательТипа,
	|	КвитанцияНаОплатуГосуслуг.УникальныйИдентификаторНачисления
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
	|			ПО КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо = ФизическиеЛицаКонтактнаяИнформация.Ссылка
	|			И ФизическиеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|			И ФизическиеЛицаКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|			ПО КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка В(&МассивОбъектов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВыводитьРазделитель = Ложь;
	Ном = 1;
	ТаблицаНастроек  = СформироватьТаблицуНастроек("СберБанк20140101");
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СуммаДокумента = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОшибкаЗаполнения = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Выборка.ЛицевойСчетПолучателя) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит: ""Лицевой счет""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
			ОшибкаЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ПолучательНаименование) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""Получатель""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
			ОшибкаЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ПолучательБанковскийСчет) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""Счет""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
			ОшибкаЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ПолучательНаименованиеБанка) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""Банк""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
			ОшибкаЗаполнения = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.ПолучательБИКБанка) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""БИК""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
			ОшибкаЗаполнения = Истина;
		КонецЕсли;
		
		Если ОшибкаЗаполнения Тогда
			Продолжить;
		КонецЕсли;
		
		
		Если ВыводитьРазделитель Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ВыводитьРазделитель = Истина;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		РеквизитыПлатежа = Новый Структура("ТекстПолучателя,
		|НомерСчетаПолучателя,
		|НаименованиеБанкаПолучателя,
		|БИКБанкаПолучателя,
		|СчетБанкаПолучателя,
		|СуммаЧислом,
		|НазначениеПлатежа,
		|ИННПолучателя,
		|КПППолучателя,
		|ИННПлательщика,
		|КодБК,
		|КодОКТМО,
		|ФамилияПлательщика,
		|ИмяПлательщика,
		|ОтчествоПлательщика,
		|АдресПлательщика,
		|ФИОРебенка,
		|СНИЛС,
		|ИдентификаторНачисления,
		|НомерДоговора,
		|СтатусСоставителя,
		|ПоказательОснования,
		|ПоказательПериода,
		|ПоказательНомера,
		|ПоказательДаты,
		|ПоказательТипа,
		|ЛицевойСчетБюджетногоПолучателя,
		|НомерЛицевогоСчетаПлательщика,
		|Ссылка");
		
		РеквизитыПлатежа.Ссылка 						= Выборка.Ссылка;									
		РеквизитыПлатежа.ТекстПолучателя 				= Выборка.ПолучательНаименование;
		РеквизитыПлатежа.НомерСчетаПолучателя 			= Выборка.ПолучательБанковскийСчет;
		РеквизитыПлатежа.НаименованиеБанкаПолучателя 	= Выборка.ПолучательНаименованиеБанка;
		РеквизитыПлатежа.БИКБанкаПолучателя 			= Выборка.ПолучательБИКБанка;
		РеквизитыПлатежа.СчетБанкаПолучателя 			= Выборка.ПолучательКорСчетБанка; 
		
		РеквизитыПлатежа.СуммаЧислом 		= Выборка.СуммаДокумента;
		РеквизитыПлатежа.НазначениеПлатежа 	= Выборка.НазначениеПлатежа;
		
		РеквизитыПлатежа.ИННПолучателя  = Выборка.ИННПолучателя;
		РеквизитыПлатежа.КПППолучателя  = Выборка.КПППолучателя;
		РеквизитыПлатежа.КодБК 			= Выборка.КБК;
		РеквизитыПлатежа.КодОКТМО 		= Выборка.КодОКАТО;
		
		Если Выборка.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			СтруктураФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ПлательщикИмя);
			РеквизитыПлатежа.ФамилияПлательщика = ?(СтруктураФИО.Фамилия <> Неопределено, СтруктураФИО.Фамилия, "");
			РеквизитыПлатежа.ИмяПлательщика = ?(СтруктураФИО.Имя <> Неопределено, СтруктураФИО.Имя, "");
			РеквизитыПлатежа.ОтчествоПлательщика = ?(СтруктураФИО.Отчество <> Неопределено, СтруктураФИО.Отчество, "");
		КонецЕсли;
		РеквизитыПлатежа.АдресПлательщика = ?(ЗначениеЗаполнено(Выборка.ПлательщикАдрес),Выборка.ПлательщикАдрес,"");
		
		Если ЗначениеЗаполнено(Выборка.ФИОРебенка) Тогда
			РеквизитыПлатежа.ФИОРебенка = Выборка.ФИОРебенка;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.НомерДоговора) Тогда
			РеквизитыПлатежа.НомерДоговора = Выборка.НомерДоговора;	
		КонецЕсли;
		
		ТекСНИЛС = СокрЛП(Выборка.СНИЛС);
		Если СтрДлина(ТекСНИЛС)=14 Тогда
			РеквизитыПлатежа.СНИЛС = ТекСНИЛС;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.УникальныйИдентификаторНачисления) Тогда
			РеквизитыПлатежа.ИдентификаторНачисления = Выборка.УникальныйИдентификаторНачисления;	
		КонецЕсли;
		
		РеквизитыПлатежа.ИННПлательщика = Выборка.ПлательщикИНН;
		
		РеквизитыПлатежа.СтатусСоставителя   = Выборка.СтатусСоставителя;
		РеквизитыПлатежа.ПоказательОснования = Выборка.ПоказательОснования;
		РеквизитыПлатежа.ПоказательПериода   = Выборка.ПоказательПериода;
		РеквизитыПлатежа.ПоказательНомера    = Выборка.ПоказательНомера;
		РеквизитыПлатежа.ПоказательДаты   	 = Выборка.ПоказательДаты;//Посмотреть
		РеквизитыПлатежа.ПоказательТипа   	 = Выборка.ПоказательТипа;
		
		РеквизитыПлатежа.ЛицевойСчетБюджетногоПолучателя = Выборка.ЛС;
		
		РеквизитыПлатежа.НомерЛицевогоСчетаПлательщика = Выборка.УчащийсяКод;
		
		QRСтрока = УправлениеПечатью.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
		
		Если ПустаяСтрока(QRСтрока) Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 1, 300);
		
		Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
			
			Шаблон = Нстр("ru = 'Не удалось сформировать QR-код для документа %1.
			|Технические подробности см. в журнале регистрации.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,
			Выборка.Ссылка);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
			Продолжить;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("Секция_1");
		
		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
		
		ОбластьМакета.Рисунки.QRКод.Картинка = КартинкаQRКода;
		
		КодОКАТО                 = Выборка.КодОКАТО;    //Код ОКАТО и ОКТМО это одно и тоже поле в документе.
		ЛицевойСчетПолучателя    = Выборка.ЛицевойСчетПолучателя;
		РеквизитыЛицевогоСчетаПолучателя = Выборка.РеквизитыЛицевогоСчетаПолучателя;
		пКБК                     = Выборка.КБК;
		
		НаименованиеОрганизации  = Выборка.ПолучательНаименование;
		ИННПолучателя            = Выборка.ИННПолучателя;
		КПППолучателя            = Выборка.КПППолучателя;
		НомерРасчетногоСчета     = Выборка.ПолучательБанковскийСчет;
		НазваниеБанка            = Выборка.ПолучательНаименованиеБанка;
		БИК                      = Выборка.ПолучательБИКБанка;
		КоррСчет                 = СокрП(Выборка.ПолучательКорСчетБанка);
		СтрДлинаКоррСчет = СтрДлина(СокрЛП(КоррСчет));
		Для инд = СтрДлинаКоррСчет+1 По 20 Цикл
			КоррСчет = КоррСчет +"-";
		КонецЦикла;
		//ПредставлениеПериода = РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(КонецМесяца(Шапка.Дата))+" г.";
		//
		ЛС = Выборка.ЛС;
		СтрДлинаЛС = СтрДлина(СокрЛП(ЛС));
		Для инд = СтрДлинаЛС По 15 Цикл
			ЛС = ЛС +"-";
		КонецЦикла;
		//ДопСчет = "0000";
		
		ТипПлатежа = Выборка.ПоказательТипа;
		ОснованиеПлатежа = Выборка.ПоказательОснования;
		НалоговыйПериод = Выборка.ПоказательПериода;
		УИН = Выборка.УникальныйИдентификаторНачисления;
		Статус = Выборка.СтатусСоставителя;
		
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"БИК_", БИК, 9,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"КоррСчет_", КоррСчет, 20,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"УчрБанка_", НазваниеБанка, 54,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"РС_", НомерРасчетногоСчета, 20,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ОргНазв_",НаименованиеОрганизации,160,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ОргИНН_",ИННПолучателя,12,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"КПП_",КПППолучателя,9,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ЛС_", ЛС,16,Ном);
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ТипПл_", ТипПлатежа,2,Ном);
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"КБК_", пКБК,20,Ном);
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ОснПл_", ОснованиеПлатежа,2,Ном);
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ОКАТО_",КодОКАТО, 11,Ном);
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"НалПер_",НалоговыйПериод, 10,Ном);
		
		НазначениеПлатежа = СокрЛП(Выборка.НазначениеПлатежа);
		
		ПлательщикИмя   = "";
		ПлательщикАдрес = "";
		Плательщик         = Выборка.Плательщик;
		ПлательщикИНН      = Выборка.ПлательщикИНН;
		ДопИнф = Выборка.УчащийсяКод;
		Если ЗначениеЗаполнено(Плательщик) Тогда
			ПлательщикИмя   = Выборка.ПлательщикИмя;
			ПлательщикАдрес = Выборка.ПлательщикАдрес;
		КонецЕсли;	
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ПлатИмя_",ПлательщикИмя,72,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"УИН_",УИН, 36,Ном);   
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ПлатАдр_",ПлательщикАдрес,72,Ном);  
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ПлатИНН_",ПлательщикИНН,12,Ном);  
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"Статус_",Статус,2,Ном);
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"ДопИнф_",ДопИнф,15,Ном);
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"Назн_",НазначениеПлатежа,204,Ном);
		
		СуммаКОплате    = Выборка.СуммаДокумента;
		Рублей          = Цел(СуммаКОплате);
		Копеек          = (СуммаКОплате-Рублей)*100;
		Руб = Формат(Рублей,"ЧДЦ=0; ЧГ=0" );
		СтрДлинаРуб = СтрДлина(Руб);
		Для инд = СтрДлинаРуб+1 По 9 Цикл
			Руб = Руб+"-";
		КонецЦикла;
		Если Копеек <> 0 Тогда
			Коп = ?(Копеек<10,"0","")+Формат(Копеек,"ЧДЦ=0; ЧГ=0");
		Иначе
			Коп = "00";
		КонецЕсли;
		
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"Руб_",Руб,9,Ном);
		ЗаполнитьКвадратики20140101(ТабличныйДокумент,ТаблицаНастроек,"Коп_",Коп,2,Ном);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		Ном = Ном+1;
	КонецЦикла;
	
	ТабличныйДокумент.ПолеСправа          = 0;
	ТабличныйДокумент.ПолеСверху          = 0;
	ТабличныйДокумент.ПолеСнизу           = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	//ТабличныйДокумент.МасштабПечати       = 70;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КвитанцияНаОплатуГосуслуг_Сбербанк20140101";
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//Старое заявление
Процедура ЗаполнитьКвадратики(Таблица,ТаблицаНастроек,НазвПоказателя, Значение, Длина, НомСтроки) 
	ДлинаЗначения    = СтрДлина(Значение);
	ПоправкаВысоты   = (НомСтроки-1)*82;
	СтруктураПоиска  = Новый Структура;
	СтруктураПоиска.Вставить("ИмяПоказателя", НазвПоказателя);
	МассивСтрокНастройки = ТаблицаНастроек.НайтиСтроки(СтруктураПоиска);
	Если МассивСтрокНастройки.Количество()>0 Тогда
		СтрокаНастройки = МассивСтрокНастройки[0];
		С  = СтрокаНастройки.НомерГрафы;
		R  = СтрокаНастройки.НомерСтроки;
		ПоправкаКолонки = 0;   
		СтрокаПараметров = 0;
		Для инд = 0 По Длина-1 Цикл  
			Если инд > ДлинаЗначения Тогда
				Символ = " ";
			Иначе
				Символ = Сред(Значение,инд+1,1);
			КонецЕсли;      
			ТекКолонка =  С + ПоправкаКолонки;
			ТекСтрока  =  R + ПоправкаВысоты;
			Если С + ПоправкаКолонки > 40 Тогда
				Если СтрокаПараметров<=МассивСтрокНастройки.Количество() Тогда
					СтрокаПараметров = СтрокаПараметров+1;
					СтрокаНастройки = МассивСтрокНастройки[СтрокаПараметров];
					С  = СтрокаНастройки.НомерГрафы;
					R  = СтрокаНастройки.НомерСтроки;
					ПоправкаКолонки = 0;
					ТекКолонка =  С;
					ТекСтрока  =  R + ПоправкаВысоты;
				Иначе
					Возврат;
				КонецЕсли;
			КонецЕсли;
			Таблица.Область(ТекСтрока,ТекКолонка,ТекСтрока,ТекКолонка).Текст = Символ;
			ПоправкаКолонки = ПоправкаКолонки+1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует табличный документ с печатными формами заявлений
// в СберБанк
// Возвращаемое значение:
//  Табличный документ - табличный документ с печатными формами квитанций
//
Функция ПечатьСбербанка(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_КвитанцияНаОплатуГосуслуг_СберБанк";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.СберБанк");
	
	//ТабДокумент = Новый ТабличныйДокумент;
	//Если ОплатаВКассу Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Выбранная форма используется только при расчете через банк",,, СтатусСообщения.Внимание);
	//	Возврат ТабДокумент;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Для печати данной формы необходимо выбрать лицевой счет",,, СтатусСообщения.Внимание);
	//	Возврат ТабДокумент;
	//КонецЕсли;
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КвитанцияНаОплатуГосуслуг.Номер,
	|	КвитанцияНаОплатуГосуслуг.Дата,
	|	КвитанцияНаОплатуГосуслуг.Организация КАК УчреждениеСсылка,
	|	КвитанцияНаОплатуГосуслуг.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	|	КвитанцияНаОплатуГосуслуг.ИННПолучателя КАК ИННПолучателя,
	|	КвитанцияНаОплатуГосуслуг.КПППолучателя КАК КПППолучателя,
	|	КвитанцияНаОплатуГосуслуг.ЛицевойСчет КАК ЛицевойСчетПолучателя,
	|	КвитанцияНаОплатуГосуслуг.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчетаПолучателя,
	|	КвитанцияНаОплатуГосуслуг.КодБКПлатежа КАК КБК,
	|	КвитанцияНаОплатуГосуслуг.КодОКАТО КАК КодОКАТО,
	|	КвитанцияНаОплатуГосуслуг.ЛицевойСчет.Код КАК ЛС,
	|	КвитанцияНаОплатуГосуслуг.ПолучательБанковскийСчет,
	|	КвитанцияНаОплатуГосуслуг.ПолучательБИКБанка,
	|	КвитанцияНаОплатуГосуслуг.ПолучательКазначейство,
	|	КвитанцияНаОплатуГосуслуг.ПолучательКорСчетБанка,
	|	КвитанцияНаОплатуГосуслуг.ПолучательНаименование,
	|	КвитанцияНаОплатуГосуслуг.ПолучательНаименованиеБанка,
	|	КвитанцияНаОплатуГосуслуг.НазначениеПлатежа,
	|	КвитанцияНаОплатуГосуслуг.СуммаДокумента,
	|	КвитанцияНаОплатуГосуслуг.Ссылка,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.ЮридическоеФизическоеЛицо.ИНН КАК ПлательщикИНН,
	|	КвитанцияНаОплатуГосуслуг.Плательщик,
	|	КвитанцияНаОплатуГосуслуг.Плательщик.Представление КАК ПлательщикИмя,
	|	ВЫБОР
	|		КОГДА КвитанцияНаОплатуГосуслуг.Учащийся ССЫЛКА Справочник.Дети
	|			ТОГДА КвитанцияНаОплатуГосуслуг.Учащийся.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК УчащийсяКод
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг КАК КвитанцияНаОплатуГосуслуг
	|ГДЕ
	|	КвитанцияНаОплатуГосуслуг.Ссылка В(&МассивОбъектов)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВыводитьРазделитель = Ложь;
	Ном = 1;
	ТаблицаНастроек  = СформироватьТаблицуНастроек("СберБанк");
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СуммаДокумента = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Выборка.ЛицевойСчетПолучателя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыводитьРазделитель Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ВыводитьРазделитель = Истина;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		КодОКАТО                 = Выборка.КодОКАТО;
		ЛицевойСчетПолучателя    = Выборка.ЛицевойСчетПолучателя;
		РеквизитыЛицевогоСчетаПолучателя = Выборка.РеквизитыЛицевогоСчетаПолучателя;
		пКБК                     = Выборка.КБК;
		
		НаименованиеОрганизации  = Выборка.ПолучательНаименование;
		ИННПолучателя            = Выборка.ИННПолучателя;
		КПППолучателя            = Выборка.КПППолучателя;
		НомерРасчетногоСчета     = Выборка.ПолучательБанковскийСчет;
		НазваниеБанка            = Выборка.ПолучательНаименованиеБанка;
		БИК                      = Выборка.ПолучательБИКБанка;
		КоррСчет                 = СокрП(Выборка.ПолучательКорСчетБанка);
		СтрДлинаКоррСчет = СтрДлина(СокрЛП(КоррСчет));
		Для инд = СтрДлинаКоррСчет+1 По 20 Цикл
			КоррСчет = КоррСчет +"-";
		КонецЦикла;
		//ПредставлениеПериода = РаботаСДиалогами.ПолучитьПредставлениеПериодаРегистрации(КонецМесяца(Шапка.Дата))+" г.";
		//
		ЛС = Выборка.ЛС;
		СтрДлинаЛС = СтрДлина(СокрЛП(ЛС));
		Для инд = СтрДлинаЛС По 15 Цикл
			ЛС = ЛС +"-";
		КонецЦикла;
		ДопСчет = "0000";
		
		ОбластьМакета = Макет.ПолучитьОбласть("Секция_1");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"БИК_", БИК, 9,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"КоррСчет_", КоррСчет, 20,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"УчрБанка_", НазваниеБанка, 60,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"РС_", НомерРасчетногоСчета, 20,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ОргНазв_",НаименованиеОрганизации,175,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ОргИНН_",ИННПолучателя,12,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"КПП_",КПППолучателя,9,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ЛС_", ЛС,16,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"КБК_", пКБК,20,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ОКАТО_",КодОКАТО, 11,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ДопСчет_",ДопСчет,4,Ном);
		
		НазначениеПлатежа = СокрЛП(Выборка.НазначениеПлатежа);
		
		ПлательщикИмя   = "";
		ПлательщикАдрес = "";
		Плательщик         = Выборка.Плательщик;
		ПлательщикИНН      = Выборка.ПлательщикИНН;
		ДопИнф = Выборка.УчащийсяКод;
		Если ЗначениеЗаполнено(Плательщик) Тогда
			ПлательщикИмя   = Выборка.ПлательщикИмя;
			ПлательщикАдрес = БиблиотекаФункцийОбмена.КонтактнаяИнформацияКонтрагента(Плательщик, "Адрес");
		КонецЕсли;	
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ПлатИмя_",ПлательщикИмя,78,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ПлатАдр_",ПлательщикАдрес,78,Ном);  
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ПлатИНН_",ПлательщикИНН,12,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"ДопИнф_",ДопИнф,15,Ном);
		
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"Назн_",НазначениеПлатежа,222,Ном);
		
		СуммаКОплате    = Выборка.СуммаДокумента;//?(Шапка.КвитанцииВЦелыхРублях, Окр(Строка.Сумма), Строка.Сумма);
		Рублей          = Цел(СуммаКОплате);
		Копеек          = (СуммаКОплате-Рублей)*100;
		Руб = Формат(Рублей,"ЧДЦ=0; ЧГ=0" );
		СтрДлинаРуб = СтрДлина(Руб);
		Для инд = СтрДлинаРуб+1 По 9 Цикл
			Руб = Руб+"-";
		КонецЦикла;
		Если Копеек <> 0 Тогда
			Коп = ?(Копеек<10,"0","")+Формат(Копеек,"ЧДЦ=0; ЧГ=0");
		Иначе
			Коп = "00";
		КонецЕсли;
		
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"Руб_",Руб,9,Ном);
		ЗаполнитьКвадратики(ТабличныйДокумент,ТаблицаНастроек,"Коп_",Коп,2,Ном);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		Ном = Ном+1;
	КонецЦикла;
	
	ТабличныйДокумент.ПолеСправа          = 0;
	ТабличныйДокумент.ПолеСверху          = 0;
	ТабличныйДокумент.ПолеСнизу           = 0;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	//ТабличныйДокумент.МасштабПечати       = 70;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КвитанцияНаОплатуГосуслуг_Сбербанк";
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура СформироватьИдентификаторНачисления(Квитанция) Экспорт
	Дата = Квитанция.Дата;
	Если НЕ ЗначениеЗаполнено(Квитанция.Номер) Тогда
		Квитанция.УстановитьНовыйНомер();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.НомерСтроки КАК НомерСтроки,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.НаименованиеРеквизита КАК НаименованиеРеквизита,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.ДлинаРеквизита КАК ДлинаРеквизита,
	|	ИСТИНА КАК УдалятьПробелы,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.Символ КАК Символ,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.ФиксированноеПоле КАК ФиксированноеПоле,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.Значение КАК Значение,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.Ссылка КАК Ссылка,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.Ссылка.ДлинаИдентификатора КАК ДлинаИдентификатора,
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.Перевести16_10 КАК Перевести16_10
	|ИЗ
	|	Справочник.ШаблоныИдентификаторовКвитанцийНаОплатуГосуслуг.СоставШаблона КАК ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона
	|ГДЕ
	|	ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.Ссылка.Владелец = &Владелец
	|	И ШаблоныИдентификаторовКвитанцийНаОплатуГосуслугСоставШаблона.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Владелец",Квитанция.Организация);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не заполнен шаблон для формирования уникального идентификатора начисления для выбранной организации!'"));
		Возврат;		
	КонецЕсли;
	Выборка = Результат.Выбрать();
	СтрИД = "";
	Пока Выборка.Следующий() Цикл
		Если Выборка.ФиксированноеПоле Тогда
			Рез = Выборка.Значение;
			Если Выборка.УдалятьПробелы Тогда
				Рез = СтрЗаменить(Рез," ","");
			КонецЕсли;
			Если Выборка.Перевести16_10 Тогда
				Рез = XMLСтрока(БиблиотекаФункцийОбменаПовтИсп.ПеревестиИз16В10(ВРег(Рез)));				
			КонецЕсли;
			
			СтрИД = СтрИД+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Лев(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита);
			
		Иначе
			Если НРег(Выборка.Значение) = НРег("Алгоритм.Алгоритм12") Тогда
				Рез = "";
				Рез = Формат(Дата, "ДФ=""ддММггЧЧммсс""");
				СтрИД = СтрИД + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Лев(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита); 
			ИначеЕсли НРег(Выборка.Значение) = НРег("Алгоритм.Алгоритм13") Тогда
				Рез = "";
				Рез = Формат(Дата, "ДФ=""ддММ0ггЧЧммсс""");
				СтрИД = СтрИД + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Лев(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита); 
			ИначеЕсли НРег(Выборка.Значение) = НРег("ДатаДокумента.Год") Тогда
				Рез = "";
				Рез = Сред(Формат(Дата, "ДФ=""ддММггЧЧммсс"""),5,2);
				СтрИД = СтрИД + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Прав(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита);
			ИначеЕсли НРег(Выборка.Значение) = НРег("ДатаДокумента.Месяц") Тогда
				Рез = "";
				Рез = Сред(Формат(Дата, "ДФ=""ддММггЧЧммсс"""),3,2);
				СтрИД = СтрИД + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Прав(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита);
			ИначеЕсли НРег(Выборка.Значение) = НРег("ДатаДокумента.День") Тогда
				Рез = "";
				Рез = Сред(Формат(Дата, "ДФ=""ддММггЧЧммсс"""),1,2);
				СтрИД = СтрИД + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Прав(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита);
			ИначеЕсли Лев(НРег(Выборка.Значение),11) = "организация" Тогда
				Рез = "";
				Попытка
					Если СокрЛП(Сред(Выборка.Значение,12)) = "" Тогда
						Рез = Строка(Выборка.Ссылка);
					Иначе
						СтрокаЗапроса = Сред(Выборка.Значение,13);
						Рез = БухгалтерскиеОперацииСервер.ЗначениеРеквизита(Квитанция.Организация,СтрокаЗапроса);
					КонецЕсли;
					Если Выборка.УдалятьПробелы Тогда
						Рез = СтрЗаменить(Рез," ","");
					КонецЕсли;
				Исключение
					Рез = "";
				КонецПопытки;
				СтрИД = СтрИД+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Лев(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита);
			ИначеЕсли Лев(НРег(Выборка.Значение),8) = "документ" Тогда	
				Рез = "";
				Попытка
					Если СокрЛП(Сред(Выборка.Значение,9)) = "" Тогда
						Рез = Строка(Квитанция);
					Иначе
						СтрокаЗапроса = Сред(Выборка.Значение,10);
						Если ЗначениеЗаполнено(Квитанция.Ссылка) Тогда
							Рез = БухгалтерскиеОперацииСервер.ЗначениеРеквизита(Квитанция.Ссылка,СтрокаЗапроса);
						Иначе
							ИмяРеквизита = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаЗапроса, ".");
							ИспользуемыйОбъект = Квитанция;
							ЭтоПервый = Истина;
							Для Каждого ЭлементРеквизита Из ИмяРеквизита Цикл
								Если ЭтоПервый Тогда 
									ИспользуемыйОбъект = ИспользуемыйОбъект[ЭлементРеквизита];
									ЭтоПервый = Ложь;
								Иначе
									ИспользуемыйОбъект = БухгалтерскиеОперацииСервер.ЗначениеРеквизита(ИспользуемыйОбъект,ЭлементРеквизита);
								КонецЕсли;	
							КонецЦикла;
							Рез = ИспользуемыйОбъект;
						КонецЕсли;
					КонецЕсли;
					Если Выборка.УдалятьПробелы Тогда
						Рез = СтрЗаменить(Рез," ","");
					КонецЕсли;
				Исключение
					Рез = "";
				КонецПопытки;
				Если НРег(Выборка.Значение) = "документ.номер" Тогда
					СтрИД = СтрИД+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Прав(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита);
				Иначе		
					СтрИД = СтрИД+СтроковыеФункцииКлиентСервер.ДополнитьСтроку(Лев(Рез,Выборка.ДлинаРеквизита), Выборка.ДлинаРеквизита);
				КонецЕсли;
			ИначеЕсли НРег(Выборка.Значение)= НРег("КонтрольныйРазряд") Тогда
				СтрИД = ГосУслугиКлиентСервер.ПолучитьУникальныйИдентификаторНачисления(СтрИД);
			ИначеЕсли НРег(Выборка.Значение)= НРег("КонтрольныйРазряд_1_16") Тогда
				СтрИД = ГосУслугиКлиентСервер.ПолучитьУникальныйИдентификаторНачисления_1_16(СтрИД,Выборка.ДлинаИдентификатора);
			Иначе
				СтрИД = СтрИД+СтроковыеФункцииКлиентСервер.ДополнитьСтроку("",Выборка.ДлинаРеквизита);	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	Квитанция.УникальныйИдентификаторНачисления = СтрИД;
	
КонецПроцедуры

// Заполняет реквизиты налогового платежа переданной квитанции, по характеристикам госуслуги
// Параметры:
//	Квитанция - ДокументОбъект.КвитанцияНаОплатуГосуслуг
//  ХарактеристикиГосуслуги - Структура, содержащая значения налоговых реквизитов госуслуги, обяза
//	
//   
Процедура ЗаполнитьРеквизитыНалоговоПлатежаКвитанции(Квитанция, ХарактеристикиГосуслуги = Неопределено) Экспорт
	
	// Заполним реквизиты налогового платежа
	Если Квитанция.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Госуслуга Тогда
		Возврат;
	КонецЕсли;
	
	Если ХарактеристикиГосуслуги = Неопределено Тогда
		ХарактеристикиГосуслуги = Новый ФиксированнаяСтруктура(ГосУслугиПовтИсп.ВернутьХарактеристикиГосуслуги(Квитанция.Номенклатура, НачалоДня(Квитанция.Дата)));
	КонецЕсли;
	
	ПолеВводаПоказательОснования 	= ХарактеристикиГосуслуги.ПоказательОснования;
	ПолеВводаПоказательТипа 		= ХарактеристикиГосуслуги.ПоказательТипа;
	ПолеВводаСтатусСоставителя		= ХарактеристикиГосуслуги.СтатусСоставителя;
	ПолеВводаПоказательПериода		= ХарактеристикиГосуслуги.ПоказательПериода;
	ПолеВводаГодПериода  			= "";
	ПолеВводаДатаПериода 			= "";
	ПолеВводаКодТаможенногоОргана 	= "";
	ПолеВводаНомерПериода 			= 0;
	ПолеВводаПоказательДаты 		= "";
	ПолеВводаПоказательНомера		= "";
	
	ЗаполнитьЗначенияСвойств(Квитанция, БухгалтерскийУчетКлиентСервер.НалоговыеРеквизитыПлатежногоДокумента(Новый Структура("СтатусСоставителя,ПоказательОснования,ПоказательТипа,ПоказательНомера,ПоказательДаты", ПолеВводаСтатусСоставителя,ПолеВводаПоказательОснования,ПолеВводаПоказательТипа,ПолеВводаПоказательНомера,ПолеВводаПоказательДаты)));
	
	ЗначенияРеквизитов = Новый Структура("ПоказательПериода, ПолеВводаГодПериода, ПолеВводаНомерПериода, ПолеВводаДатаПериода, ПолеВводаКодТаможенногоОргана",
	Квитанция.ПоказательПериода,ПолеВводаГодПериода,ПолеВводаНомерПериода,ПолеВводаДатаПериода,ПолеВводаКодТаможенногоОргана);
	
	БухгалтерскийУчетКлиентСервер.ОпределитьРеквизитыНалоговогоПериода(ПолеВводаПоказательПериода, Ложь, Квитанция.Дата, ЗначенияРеквизитов);
	
	ЗаполнитьЗначенияСвойств(Квитанция, ЗначенияРеквизитов);
	
КонецПроцедуры

Функция ПолучитьСтрокуQRПоПравилуОбмена(ОшибкаЗаполнения, Шапка)
	
	Возврат УправлениеПечатьюБГУ.ПолучитьтекстВыгрузкиПоПравилуОбмена(
	ОшибкаЗаполнения, 
	Шапка.Ссылка, 
	Шапка.Дата, 
	Шапка.Организация, 
	Шапка.ВидОбменаДляQRКода, 
	Шапка.ФорматОбменаДляQRКода);
	
КонецФункции	

Функция ПолучитьСтрокуQRПоВстроенномуАлгоритму(ОшибкаЗаполнения, Выборка)
	
	ОшибкаЗаполнения = Ложь;
	
	Если Не ЗначениеЗаполнено(Выборка.ПолучательНаименование) Тогда
		ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""Получатель""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
		ОшибкаЗаполнения = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Выборка.ПолучательБанковскийСчет) Тогда
		ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""Счет""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
		ОшибкаЗаполнения = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Выборка.ПолучательНаименованиеБанка) Тогда
		ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""Банк""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
		ОшибкаЗаполнения = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Выборка.ПолучательБИКБанка) Тогда
		ТекстСообщения = Нстр("ru = 'Не заполнен обязательный реквизит получателя: ""БИК""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Выборка.Ссылка);
		ОшибкаЗаполнения = Истина;
	КонецЕсли;
	
	Если НЕ ОшибкаЗаполнения Тогда
		
		РеквизитыПлатежа = Новый Структура("ТекстПолучателя,
		|НомерСчетаПолучателя,
		|НаименованиеБанкаПолучателя,
		|БИКБанкаПолучателя,
		|СчетБанкаПолучателя,
		|СуммаЧислом,
		|НазначениеПлатежа,
		|ИННПлательщика,
		|ИННПолучателя,
		|КПППолучателя,
		|КодБК,
		|КодОКТМО,
		|ФамилияПлательщика,
		|ИмяПлательщика,
		|ОтчествоПлательщика,
		|АдресПлательщика,
		|ФИОРебенка,
		|СНИЛС,
		|ИдентификаторНачисления,
		|НомерДоговора,
		|СтатусСоставителя,
		|ПоказательОснования,
		|ПоказательПериода,
		|ПоказательНомера,
		|ПоказательДаты,
		|ПоказательТипа,
		|НомерЛицевогоСчетаПлательщика,
		|Ссылка");
		
		РеквизитыПлатежа.Ссылка = Выборка.Ссылка;		
		РеквизитыПлатежа.ТекстПолучателя = Выборка.ПолучательНаименование;
		РеквизитыПлатежа.НомерСчетаПолучателя = Выборка.ПолучательБанковскийСчет;
		РеквизитыПлатежа.НаименованиеБанкаПолучателя = Выборка.ПолучательНаименованиеБанка;
		РеквизитыПлатежа.БИКБанкаПолучателя = Выборка.ПолучательБИКБанка;
		РеквизитыПлатежа.СчетБанкаПолучателя = Выборка.ПолучательКорСчетБанка; 
		
		РеквизитыПлатежа.СуммаЧислом = Выборка.СуммаДокумента;
		РеквизитыПлатежа.НазначениеПлатежа = Выборка.НазначениеПлатежа;
		
		РеквизитыПлатежа.ИННПолучателя  = Выборка.ИННПолучателя;
		РеквизитыПлатежа.КПППолучателя  = Выборка.КПППолучателя;
		РеквизитыПлатежа.КодБК 			= Выборка.КодБКПлатежа;
		РеквизитыПлатежа.КодОКТМО 		= Выборка.КодОКТМО;
		РеквизитыПлатежа.ИННПлательщика = Выборка.ИННПлательщика;
		
		Если Выборка.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			
			ФиоФизЛица = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", Выборка.Плательщик, Выборка.Дата);
			
			Справочники.Контрагенты.ПолучитьДанныеКонтрагента(ФиоФизЛица);
			
			РеквизитыПлатежа.ФамилияПлательщика 			= ?(ЗначениеЗаполнено(ФиоФизЛица.Фамилия), 	ФиоФизЛица.Фамилия, "");
			РеквизитыПлатежа.ИмяПлательщика 				= ?(ЗначениеЗаполнено(ФиоФизЛица.Имя), 		ФиоФизЛица.Имя, "");
			РеквизитыПлатежа.ОтчествоПлательщика 			= ?(ЗначениеЗаполнено(ФиоФизЛица.Отчество), ФиоФизЛица.Отчество, "");
		КонецЕсли;
		РеквизитыПлатежа.АдресПлательщика = ?(ЗначениеЗаполнено(Выборка.ПлательщикАдрес),Выборка.ПлательщикАдрес,"");
		
		Если ЗначениеЗаполнено(Выборка.ФИОРебенка) Тогда
			РеквизитыПлатежа.ФИОРебенка = Выборка.ФИОРебенка;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.НомерДоговора) Тогда
			РеквизитыПлатежа.НомерДоговора = Выборка.НомерДоговора;	
		КонецЕсли;
		
		ТекСНИЛС = СокрЛП(Выборка.СНИЛС);
		Если СтрДлина(ТекСНИЛС)=14 Тогда
			РеквизитыПлатежа.СНИЛС = ТекСНИЛС;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.УникальныйИдентификаторНачисления) Тогда
			РеквизитыПлатежа.ИдентификаторНачисления = Выборка.УникальныйИдентификаторНачисления;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.НомерЛицевогоСчетаПлательщика) Тогда
			РеквизитыПлатежа.НомерЛицевогоСчетаПлательщика = Выборка.НомерЛицевогоСчетаПлательщика;
		КонецЕсли;
		
		РеквизитыПлатежа.СтатусСоставителя   = Выборка.СтатусСоставителя;
		РеквизитыПлатежа.ПоказательОснования = Выборка.ПоказательОснования;
		РеквизитыПлатежа.ПоказательПериода   = Выборка.ПоказательПериода;
		РеквизитыПлатежа.ПоказательНомера    = Выборка.ПоказательНомера;
		РеквизитыПлатежа.ПоказательДаты   	 = Выборка.ПоказательДаты;//Посмотреть
		РеквизитыПлатежа.ПоказательТипа   	 = Выборка.ПоказательТипа;
		
		QRСтрока = УправлениеПечатью.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
		
		Возврат QRСтрока;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции	

// Переносит значение договора и учащегося из табличной части ТаблицаИдентификаторов в реквизиты документа
//
Процедура ПеренестиДанныеИзТЧвРеквизиты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.ТипПоля,
	|	КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Значение,
	|	КвитанцияНаОплатуГосуслугТаблицаИдентификаторов.Ссылка КАК Квитанция
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг.ТаблицаИдентификаторов КАК КвитанцияНаОплатуГосуслугТаблицаИдентификаторов
	|ИТОГИ ПО
	|	Ссылка";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаКвитанций = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаКвитанций.Следующий() Цикл
		КвитанцияОбъект = ВыборкаКвитанций.Квитанция.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаКвитанций.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ТипПоля = "СправочникСсылка.Договоры" 
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) 
				И НЕ ЗначениеЗаполнено(КвитанцияОбъект.Договор) Тогда
				КвитанцияОбъект.Договор = ВыборкаДетальныеЗаписи.Значение;	
			КонецЕсли;
			
			Если ВыборкаДетальныеЗаписи.ТипПоля = "СправочникСсылка.Студенты" 
				И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Значение) 
				И НЕ ЗначениеЗаполнено(КвитанцияОбъект.Учащийся) Тогда
				КвитанцияОбъект.Учащийся = ВыборкаДетальныеЗаписи.Значение;	
			КонецЕсли;
			
		КонецЦикла;
		Попытка
			КвитанцияОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения",Истина);
			КвитанцияОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьДействияПередЗаписью",Истина);
			КвитанцияОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='"+ОписаниеОшибки()+"'"));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет и устанваливает статус всех квитанций на "Исполнен", если сумма платежей >= суммы квитанций
Процедура ПроверитьИсполнениеКвитанций() Экспорт
	//Добавить 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументКвитанцияНаОплатуГосуслуг.Ссылка,
	|	ЕСТЬNULL(СостояниеПлатежноРасчетныхДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.ВРаботе)) КАК Статус,
	|	ДокументКвитанцияНаОплатуГосуслуг.СуммаДокумента,
	|	СУММА(ЕСТЬNULL(ПлатежВОплатуГосуслуг.СуммаДокумента, 0)) КАК СуммаПлатежа
	|ПОМЕСТИТЬ ДанныеКвитанций
	|ИЗ
	|	Документ.КвитанцияНаОплатуГосуслуг КАК ДокументКвитанцияНаОплатуГосуслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК СостояниеПлатежноРасчетныхДокументов
	|		ПО (СостояниеПлатежноРасчетныхДокументов.ПлатежноРасчетныйДокумент = ДокументКвитанцияНаОплатуГосуслуг.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПлатежВОплатуГосуслуг КАК ПлатежВОплатуГосуслуг
	|		ПО (ПлатежВОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ)
	|			И ДокументКвитанцияНаОплатуГосуслуг.УникальныйИдентификаторНачисления = ПлатежВОплатуГосуслуг.УникальныйИдентификаторНачисления
	|			И (ПОДСТРОКА(ДокументКвитанцияНаОплатуГосуслуг.УникальныйИдентификаторНачисления, 1, 1) <> """")
	|			И (ПОДСТРОКА(ДокументКвитанцияНаОплатуГосуслуг.УникальныйИдентификаторНачисления, 1, 1) <> "" "")
	|ГДЕ
	|	ДокументКвитанцияНаОплатуГосуслуг.ПометкаУдаления = ЛОЖЬ
	|	И (ДокументКвитанцияНаОплатуГосуслуг.СуммаДокумента > 0
	|			ИЛИ ДокументКвитанцияНаОплатуГосуслуг.ВидКвитанции = 3)
	|	И ЕСТЬNULL(СостояниеПлатежноРасчетныхДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.ВРаботе)) = ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.НаИсполнении)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(СостояниеПлатежноРасчетныхДокументов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыИсполненияДокумента.ВРаботе)),
	|	ДокументКвитанцияНаОплатуГосуслуг.Ссылка,
	|	ДокументКвитанцияНаОплатуГосуслуг.СуммаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКвитанций.Ссылка,
	|	ДанныеКвитанций.СуммаДокумента,
	|	ДанныеКвитанций.СуммаПлатежа,
	|	ДанныеКвитанций.Ссылка.ВидКвитанции КАК ВидКвитанции
	|ИЗ
	|	ДанныеКвитанций КАК ДанныеКвитанций
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДанныеКвитанций.СуммаДокумента <= ДанныеКвитанций.СуммаПлатежа
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураРекв = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(ВыборкаДетальныеЗаписи.Ссылка);
		СтруктураРекв.Вставить("ПлатежноРасчетныйДокумент",ВыборкаДетальныеЗаписи.Ссылка);
		СтруктураРекв.Вставить("Статус",?(ВыборкаДетальныеЗаписи.ВидКвитанции = 3,Перечисления.СтатусыИсполненияДокумента.Аннулирован,Перечисления.СтатусыИсполненияДокумента.Исполнен));
		ПлатежноРасчетныеДокументы.ЗарегестрироватьИсполнениеЗаявки(СтруктураРекв);
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
