&НаКлиенте
Перем ТекстЗаголовкаСообщений;

// В документе всегда сохраняются и используются оба набора сумм - и валютные, и рублевые.
// На форме документа редактируется либо 1, либо 2 набора сумм.
// Поля валютных сумм видны всегда и доступны для редактирования.
// Поля рублевых сумм могут скрываться ради удобства,
// но значения этих полей по-прежнему доступны и используются в проводках.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияФормы();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовкаСообщений = НСтр("ru='Ввод начальных остатков наличных денежных средств'");
	
	НастроитьФормуКлиент_ПоКФО();
	
	СравнитьСуммыШапкиИТаблицы();
	
	ВводНачальныхОстатковКлиент.ПриОткрытии(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьЗаголовокФормы();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
	// Оповещаем форму Помощника ввода начальных остатков:
	ИмяСобытия = "ЗаписанДокументВводНачальныхОстатков";
	Параметр = Объект["Организация"];
	Оповестить(ИмяСобытия, Параметр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаВводаОстатковПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииСервер();
	
	НастроитьФормуКлиент_ПоКФО();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Организация = ВыбранноеЗначение Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	СчетПриИзмененииСервер();
	
	НастроитьФормуКлиент_ПоКФО();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			Объект.Счет, 
																			Объект.КПС, 
																			Объект.КФО), 
															Объект.Организация,
															Объект.ИФО,
															Объект.Счет,
															Объект.КФО,
															,
															ПолучитьДату());
КонецПроцедуры

&НаКлиенте
Процедура СчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															Объект.КПС,
															Объект.КФО,
															Объект.КЭК);
															
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(Объект.Организация,
											   Объект.ИФО,
											   Объект.КФО,
											   ПолучитьДату());
											   
	КФОПриИзмененииКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура КПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(	Элемент, 
													СтандартнаяОбработка, 
													Объект.КПС, 
													Объект.Организация,
													Объект.ИФО,
													Объект.КФО,
													Объект.Счет,
													ПолучитьДату());
													
КонецПроцедуры

&НаКлиенте
Процедура КЭКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Счет) Тогда
		ТекстСообщения = НСтр("ru='Не заполнен счет.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Объект.Счет");
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьКЭК0 Тогда
		//---
		// КЭК0
		//---
		ОграниченияКЭК = Новый Массив();
		ОграниченияКЭК.Добавить(КЭК0);
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент,
								СтандартнаяОбработка,
								,//КЭК,
								,//Организация,
								,//ИФО,
								,//КФО,
								,//Счет,
								,//Дата,
								,//"Дт",
								ОграниченияКЭК);
	Иначе
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент,
									СтандартнаяОбработка,
									Объект.КЭК,
									Объект.Организация,
									Объект.ИФО,
									Объект.КФО,
	                                Объект.Счет,
									ПолучитьДату(),
									"Дт");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ВалютаПриИзмененииСервер();
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютнаяСуммаДокументаПриИзменении(Элемент)
	
	Объект["СуммаДокумента"] = ПолучитьРублевуюСумму(
									Объект["ВалютнаяСуммаДокумента"],
									ИспользоватьВалютныйУчет,
									Объект["Курс"],
									Объект["Кратность"]);
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура КурсВзаиморасчетовПриИзменении(Элемент)
	
	РассчитатьРублевыеСуммыСервер();
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура КратностьВзаиморасчетовПриИзменении(Элемент)
	
	РассчитатьРублевыеСуммыСервер();
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДокументаПриИзменении(Элемент)
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДенежныеСредства

&НаКлиенте
Процедура ДенежныеСредстваПриИзменении(Элемент)
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ЗаполнитьСуммыВСтроке();
		
		СравнитьСуммыШапкиИТаблицы();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСредстваВалютнаяСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы["ДенежныеСредства"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные["Сумма"] = ПолучитьРублевуюСумму(
							ТекДанные["ВалютнаяСумма"],
							ИспользоватьВалютныйУчет,
							Объект["Курс"],
							Объект["Кратность"]);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкорректироватьВалютнуюСумму(Команда)
	
	СкорректироватьВалютнуюСуммуКлиент();
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьСумму(Команда)
	
	СкорректироватьСуммуКлиент();
	
	СравнитьСуммыШапкиИТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПризнакАгрегатора(Команда)
	
	ВводНачальныхОстатковКлиент.СнятьПризнакАгрегатора(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЗаголовокФормы = "Ввод начальных остатков наличных денежных средств ";
	Если Объект.Ссылка.Пустая() Тогда
		ЗаголовокФормы = ЗаголовокФормы + "(создание)";
	Иначе
		ЗаголовокФормы = ЗаголовокФормы + Объект.Номер + " от " + Объект.Дата;
	КонецЕсли;
	ЭтаФорма.Заголовок = ЗаголовокФормы;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормы()
	
	// Комментарии для значений КФО
	ВремСоответствие = Новый Соответствие();
	ВремСоответствие.Вставить(Перечисления.КВД.ПустаяСсылка(), "<КФО не указан>");
	Для Каждого КФО Из Метаданные.Перечисления.КВД.ЗначенияПеречисления Цикл
		ВремСоответствие.Вставить(Перечисления.КВД[КФО.Имя], КФО.Комментарий);
	КонецЦикла;
	СоответствиеКФОКомментарий = Новый ФиксированноеСоответствие(ВремСоответствие);
	
	//---
	// КЭК0
	//---
	УстановитьНовоеЗначениеКЭК = Ложь;
	
	// Заполняем по возможности пустые поля формы:
	Если Объект.Ссылка.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Счет) Тогда
			Объект.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("201.34");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			Объект.ВалютаДокумента = ВалютаРУ;
			ОбновитьКурс();
		КонецЕсли;
		
		Попытка
			ЭтаФорма.ТиповаяОперация = Справочники.ТиповыеОперации.ВводНачальныхОстатков_ДенежныеСредства;
		Исключение
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
		КонецЕсли;
		
		//---
		// КЭК0
		//---
		УстановитьНовоеЗначениеКЭК = Истина;
		
	КонецЕсли;
	
	//---
	// КЭК0
	//---
	КЭК0 = БухгалтерскийУчетПовтИсп.КЭК0();
	ПроконтролироватьЗначениеКЭКСервер(УстановитьНовоеЗначениеКЭК);
	
	ОбновитьКэшФормы();
	
	НастроитьФормуСервер_Подразделение();
	
	НастроитьФормуСервер_ПоВалюте();
	
	НастроитьФормуСервер_ПодсказкаСчета();
	
	УстановитьЗаголовокФормы();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФормуКлиент_ПоКФО()
	
	КФОКомментарий = СоответствиеКФОКомментарий.Получить(Объект["КФО"]);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_Подразделение()
	
	Элементы["ПодразделениеОрганизации"].Видимость = Документы.ВводНачальныхОстатков.ПодразделениеОбязательноКЗаполнению(Объект);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_ПоВалюте()
	
	ПолеВалютаВидимое	= ИспользоватьВалютныйУчет;
	ПолеСуммаВидимое	= Документы.ВводНачальныхОстатков.ПолеСуммаВидимое_ДенежныеСредства(Объект["ВалютаДокумента"], ИспользоватьВалютныйУчет, ВалютаРУ);
	
	ВалютнаяСуммаЗаголовок	= ?(ПолеСуммаВидимое, НСтр("ru='Валютная сумма'"), НСтр("ru='Сумма'"));
	
	// Элементы шапки
	Элементы["Валюта"].Видимость					= ПолеВалютаВидимое;
	Элементы["СуммаДокумента"].Видимость			= ПолеСуммаВидимое;
	Элементы["СкорректироватьСумму"].Видимость		= ПолеСуммаВидимое;
	Элементы["КурсВзаиморасчетов"].Видимость		= ПолеСуммаВидимое;
	Элементы["КратностьВзаиморасчетов"].Видимость	= ПолеСуммаВидимое;
	Элементы["ДекорацияРуб"].Видимость				= ПолеСуммаВидимое;
	Элементы["ВалютнаяСуммаДокумента"].Заголовок	= ВалютнаяСуммаЗаголовок;
	
	// Колонки таблицы
	Элементы["ДенежныеСредстваСумма"].Видимость			= ПолеСуммаВидимое;
	Элементы["ДенежныеСредстваВалютнаяСумма"].Заголовок	= ВалютнаяСуммаЗаголовок;
	
	// Итоги
	Элементы["ДенежныеСредстваИтогСумма"].Видимость			= ПолеСуммаВидимое;
	Элементы["ДенежныеСредстваИтогВалютнаяСумма"].Заголовок	= ВалютнаяСуммаЗаголовок;
	Элементы["ДенежныеСредстваИтогВалюта"].Видимость		= ПолеВалютаВидимое;
	Элементы["ДенежныеСредстваИтогРуб"].Видимость			= ПолеСуммаВидимое;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуСервер_ПодсказкаСчета()
	
	Перем ОписаниеОшибки;
	
	Если ВалютныеПараметрыКорректны(ОписаниеОшибки) Тогда
		ПодсказкаСчет				= "";
		ОтображениеПодсказкиСчет	= ОтображениеПодсказки.Нет;
	Иначе
		ПодсказкаСчет				= ОписаниеОшибки;
		ОтображениеПодсказкиСчет	= ОтображениеПодсказки.Кнопка;
	КонецЕсли;
	
	// Элементы шапки
	Элементы["Счет"].Подсказка				= ПодсказкаСчет;
	Элементы["Счет"].ОтображениеПодсказки	= ОтображениеПодсказкиСчет;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// 1.
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru='Снятие отметки незаполненного с поля КПС'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Счет_УчетПоКПС");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Ложь;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("КПС");
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДенежныеСредстваКПС");
	
	// 2.
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru='Снятие отметки незаполненного с поля КЭК'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Счет_УчетПоКЭК");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Ложь;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("КЭК");
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДенежныеСредстваКЭК");
	
	// 3.
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru='Отметка валютной суммы, если она отличается от итога по табличной части'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ОтметитьВалютнуюСумму");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ВалютнаяСуммаДокумента");
	
	// 4.
	НовыйЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	НовыйЭлементУО.Представление = НСтр("ru='Отметка суммы, если она отличается от итога по табличной части'");
	// Условие
	Условие = НовыйЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("ОтметитьСумму");
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформление
	НовыйЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	// Оформляемые поля
	ОформляемоеПоле = НовыйЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("СуммаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыВСтроке()
	
	ТекДанные = Элементы["ДенежныеСредства"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Сначала очищаем суммы
	ТекДанные["ВалютнаяСумма"]	= 0;
	ТекДанные["Сумма"]			= 0;
	
	// Теперь рассчитываем
	ТекДанные["ВалютнаяСумма"]	= 0 - РассчитатьВалютнуюДельту();
	ТекДанные["Сумма"]			= ПолучитьРублевуюСумму(
										ТекДанные["ВалютнаяСумма"],
										ИспользоватьВалютныйУчет,
										Объект["Курс"],
										Объект["Кратность"]);
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьВалютнуюСуммуКлиент()
	
	Итог = Объект["ДенежныеСредства"].Итог("ВалютнаяСумма");
	
	Объект["ВалютнаяСуммаДокумента"] = Итог;
	
	Объект["СуммаДокумента"] = ПолучитьРублевуюСумму(
									Объект["ВалютнаяСуммаДокумента"],
									ИспользоватьВалютныйУчет,
									Объект["Курс"],
									Объект["Кратность"]);
	
КонецПроцедуры

&НаКлиенте
Процедура СкорректироватьСуммуКлиент()
	
	Итог = Объект["ДенежныеСредства"].Итог("Сумма");
	
	Объект["СуммаДокумента"] = Итог;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьРублевыеСуммыСервер()
	
	Объект["СуммаДокумента"]= ПолучитьРублевуюСумму(
									Объект["ВалютнаяСуммаДокумента"],
									ИспользоватьВалютныйУчет,
									Объект["Курс"],
									Объект["Кратность"]);
	
	Для Каждого СтрокаТЧ Из Объект["ДенежныеСредства"] Цикл
		СтрокаТЧ["Сумма"] = ПолучитьРублевуюСумму(
								СтрокаТЧ["ВалютнаяСумма"],
								ИспользоватьВалютныйУчет,
								Объект["Курс"],
								Объект["Кратность"]);
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРублевуюСумму(ВалютнаяСумма, ИспользоватьВалютныйУчет, Курс, Кратность)
	
	Если ИспользоватьВалютныйУчет Тогда
		Возврат ?(Кратность = 0,
			0,
			ВалютнаяСумма * Курс / Кратность);
	Иначе
		Возврат ВалютнаяСумма;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ОбновитьКурс()
	
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект["ВалютаДокумента"], Объект["Дата"]);
	
	ЗаполнитьЗначенияСвойств(Объект, СтруктураКурса, "Курс, Кратность");
	
КонецПроцедуры

&НаКлиенте
Процедура СравнитьСуммыШапкиИТаблицы()
	
	Дельта				= РассчитатьДельту();
	ВалютнаяДельта		= РассчитатьВалютнуюДельту();
	
	ОтметитьСумму			= НЕ (Дельта = 0);
	ОтметитьВалютнуюСумму	= НЕ (ВалютнаяДельта = 0);
	
КонецПроцедуры

&НаКлиенте
Функция РассчитатьДельту()
	
	СуммаИтог = Объект["ДенежныеСредства"].Итог("Сумма");
	
	Дельта = СуммаИтог - Объект["СуммаДокумента"];
	
	Возврат Дельта;
	
КонецФункции

&НаКлиенте
Функция РассчитатьВалютнуюДельту()
	
	ВалютнаяСуммаИтог = Объект["ДенежныеСредства"].Итог("ВалютнаяСумма");
	
	ВалютнаяДельта = ВалютнаяСуммаИтог - Объект["ВалютнаяСуммаДокумента"];
	
	Возврат ВалютнаяДельта;
	
КонецФункции


&НаСервере
Функция ВалютныеПараметрыКорректны(ОписаниеОшибки)
	
	ОписаниеОшибки = "";
	
	Если НЕ ЗначениеЗаполнено(Объект["Счет"]) ИЛИ НЕ ЗначениеЗаполнено(Объект["ВалютаДокумента"]) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЭтоВалютаРУ = (Объект["ВалютаДокумента"] = ВалютаРУ);
	
	Если ИспользоватьВалютныйУчет И НЕ Счет_Валютный Тогда
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='На счете %1 не ведется валютный учет'"),
			Строка(Объект["Счет"]));
		Возврат Ложь;
		
	ИначеЕсли НЕ ИспользоватьВалютныйУчет И НЕ ЭтоВалютаРУ Тогда
		ОписаниеОшибки = НСтр("ru='Валютный учет в программе не ведется'");
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолучитьДату()
	
	Возврат КонецГода(Объект.Дата) + 1;
	
КонецФункции

&НаСервере
Процедура ОбновитьКэшФормы()
	
	СчетСсылка = Объект["Счет"];
	
	Если ЗначениеЗаполнено(СчетСсылка) Тогда
		СвойстваСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетСсылка,
			"Валютный, УчетПоКПС, УчетПоКЭК, УчетПоПодразделениям");
	Иначе
		СвойстваСчета = Новый Структура();
		СвойстваСчета.Вставить("Валютный",				Ложь);
		СвойстваСчета.Вставить("УчетПоКПС",				Ложь);
		СвойстваСчета.Вставить("УчетПоКЭК",				Ложь);
		СвойстваСчета.Вставить("УчетПоПодразделениям",	Ложь);
	КонецЕсли;
	
	Кэш = Новый Структура();
	Кэш.Вставить("ИспользоватьВалютныйУчет",			ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	Кэш.Вставить("ИспользоватьУчетПоПодразделениям",	ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Кэш.Вставить("ВалютаРУ",							Константы.ВалютаРегламентированногоУчета.Получить());
	Кэш.Вставить("Счет_Валютный",						СвойстваСчета["Валютный"]);
	Кэш.Вставить("Счет_УчетПоКПС",						СвойстваСчета["УчетПоКПС"]);
	Кэш.Вставить("Счет_УчетПоКЭК",						СвойстваСчета["УчетПоКЭК"]);
	Кэш.Вставить("Счет_УчетПоПодразделениям",			СвойстваСчета["УчетПоПодразделениям"]);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Кэш);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	ОчиститьРеквизитыТабличнойЧастиНесоответствующиеОрганизации();
	
	//---
	// КЭК0
	//---
	ПроконтролироватьЗначениеКЭКСервер(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРеквизитыТабличнойЧастиНесоответствующиеОрганизации()
	
	// Очищаем некоторые поля документа:
	ОчищающаяСтруктура = Новый Структура("
		|Счет,
		|КПС,
		|КЭК");
	ЗаполнитьЗначенияСвойств(Объект, ОчищающаяСтруктура);
	
	// Устанавливаем новую дату документа:
	Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииСервер()
	
	//---
	// КЭК0
	//---
	ПроконтролироватьЗначениеКЭКСервер(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзмененииКлиент()
	
	КФОПриИзмененииСервер();
	
	НастроитьФормуКлиент_ПоКФО();
	
КонецПроцедуры

&НаСервере
Процедура КФОПриИзмененииСервер()
	
	КФОКомментарий = СоответствиеКФОКомментарий.Получить(Объект.КФО);
	
	//---
	// КЭК0
	//---
	ПроконтролироватьЗначениеКЭКСервер(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	ОбновитьКурс();
	
	РассчитатьРублевыеСуммыСервер();
	
	//---
	// КЭК0
	//---
	ПроконтролироватьЗначениеКЭКСервер(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура СчетПриИзмененииСервер()
	
	ОбновитьКэшФормы();
	
	НастроитьФормуСервер_Подразделение();
	
	НастроитьФормуСервер_ПодсказкаСчета();
	
	//---
	// КЭК0
	//---
	ПроконтролироватьЗначениеКЭКСервер(Истина); // УстановитьНовоеЗначение
	
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииСервер()
	
	ОбновитьКэшФормы();
	
	ОбновитьКурс();
	
	НастроитьФормуСервер_ПоВалюте();
	
	НастроитьФормуСервер_ПодсказкаСчета();
	
	РассчитатьРублевыеСуммыСервер();
	
КонецПроцедуры

//---
// КЭК0
//---

&НаСервере
Процедура ПроконтролироватьЗначениеКЭКСервер(УстановитьНовоеЗначение = Ложь)
	
	Перем НовоеЗначениеКЭК;
	
	Если Документы.ВводНачальныхОстатков.НеобходимоИзменитьЗначениеКЭК(
			Объект["Организация"],
			Объект["ИФО"],
			Объект["КФО"],
			Объект["Дата"],
			Объект["Счет"],
			Объект["КЭК"],
			"Дт",
			ИспользоватьКЭК0,
			НовоеЗначениеКЭК) Тогда
		Если УстановитьНовоеЗначение = Истина Тогда
			Объект["КЭК"] = НовоеЗначениеКЭК;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)
	
	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)
	
	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр
#КонецОбласти
//Код процедур и функций
