////////////////////////////////////////////////////////////////////////////////
// ЕдиныйНалоговыйСчетЛичныйКабинетПереопределяемый
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОсновнаяОрганизация(ТекущаяОрганизация) Экспорт
	
КонецПроцедуры

Процедура ГоловнаяОрганизация(ТекущаяОрганизация) Экспорт  
	
	Если ЗначениеЗаполнено(ТекущаяОрганизация) Тогда
		ГоловнаяОрганизация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяОрганизация, "ГоловнаяОрганизация"); 
		Если ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
			ТекущаяОрганизация = ГоловнаяОрганизация;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДоступныеОрганизации(ТаблицаОрганизация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Значение,
	|	Организации.Представление КАК Представление
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	(Организации.Ссылка = Организации.ГоловнаяОрганизация
	|			ИЛИ Организации.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И НЕ Организации.УчетПереданныхПолномочий";
	
	ТаблицаОрганизация = Запрос.Выполнить().Выгрузить();

КонецПроцедуры

Процедура ОсновнаяРегистрацияВНалоговомОргане(Организация, ТекущаяРегистрация) Экспорт
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьФормуНаСервере(Форма) Экспорт
	
КонецПроцедуры

Процедура УправлениеФормой(Форма) Экспорт
	
КонецПроцедуры

Процедура УстановитьУсловноеОформление(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПлатежиРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандОтчетыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандНачисленияРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандУплатаРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандПениШтрафыРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверки(Признак) Экспорт
	
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиПлатежи(Признак);
	КонецЕсли;
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиОтчеты(Признак);
	КонецЕсли;
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиПениШтрафы(Признак);
	КонецЕсли;
	Если Не Признак Тогда
		ПоддерживаетсяРежимСверкиОперацииЕНП(Признак);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиГлавное(Признак) Экспорт
	Признак = Истина;
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиСальдоЕНС(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиСальдоЕНП(Признак) Экспорт
	Признак = Истина;
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПлатежи(Признак) Экспорт
	Признак = Истина;
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиОтчеты(Признак) Экспорт
	Признак = Истина;
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиНачисления(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиУплаты(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиПениШтрафы(Признак) Экспорт
	Признак = Истина;
КонецПроцедуры

Процедура ПоддерживаетсяАвтоматическаяРегистрацияУплат(Признак) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяАвтоматическаяРегистрацияОперацийЕНС(Признак) Экспорт
	
КонецПроцедуры

Процедура ПериодОбработкиДанныхДляРегистрацииУплат(Организация, НачалоПериода, КонецПериода) Экспорт
	
КонецПроцедуры

Процедура ПериодОбработкиДанныхДляРегистрацииОперацийЕНС(Организация, НачалоПериода, КонецПериода) Экспорт
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеНачислений(Признак) Экспорт
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеУплаты(Признак) Экспорт
	
КонецПроцедуры

Процедура ДоступноОтражениеВУчетеПениШтрафов(Признак) Экспорт
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаНачисления(ДанныеСтроки, Признак) Экспорт
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаУплаты(ДанныеСтроки, Признак) Экспорт
	
КонецПроцедуры

Процедура ОтражениеВУчетеДоступноСтрокаПениШтрафы(ДанныеСтроки, Признак) Экспорт
	
КонецПроцедуры

Процедура ПереключениеКомандОперацииЕНПРасхождение(Форма) Экспорт
	
КонецПроцедуры

Процедура ПоддерживаетсяРежимСверкиОперацииЕНП(Признак) Экспорт
	Признак = Истина;
КонецПроцедуры

#КонецОбласти
