
#Область ПодпискаНаСобытие

Процедура УведомленияОСпецрежимахНалогообложенияПриЗаписи(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Если Источник.ВидУведомления = Перечисления.ВидыУведомленийОСпецрежимахНалогообложения.ИсчисленныеСуммыНалогов Тогда
		ЕдиныйНалоговыйСчет.СинхронизироватьСостояниеУведомлений(Источник);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти