#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") 
		И ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		Параметры.Отбор.Свойство("Платеж",Платеж);
		Параметры.Отбор.Свойство("Начисление",Начисление);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "Платеж"
		ИЛИ Поле.Имя = "СуммаПлатежа" Тогда
		
		ТекДанные = Элементы.Список.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(,ТекДанные.Платеж);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РаспределитьПлатежи(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Участник",ПолучитьУчастника());
	Если ЗначениеЗаполнено(Начисление) Тогда
		ПараметрыФормы.Вставить("Начисление",Начисление);
	ИначеЕсли ЗначениеЗаполнено(Платеж) Тогда
		ПараметрыФормы.Вставить("Платеж",Платеж);
	КонецЕсли;
	ОткрытьФорму("Обработка.РаспределениеПлатежейГИСГМП.Форма.Форма",ПараметрыФормы,ЭтотОбъект);
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьУчастника()
	ИскомыйРеквизит = "Организация";
	ДокСсылка = Неопределено;
	Если ЗначениеЗаполнено(Начисление) Тогда
		
		ДокСсылка = Начисление;
		
		Если ТипЗнч(Начисление) = Тип("ДокументСсылка.НачислениеОтПодведомственного") Тогда
			ИскомыйРеквизит = "Получатель";
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Платеж) Тогда
		
		ДокСсылка = Платеж;
		
		Если ТипЗнч(Платеж) = Тип("ДокументСсылка.ПлатежПодведомственному") Тогда
			ИскомыйРеквизит = "Получатель";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка,ИскомыйРеквизит,Истина);
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции

#КонецОбласти




