#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвентаризацияРасходовБудущихПериодов") Тогда
		ЗаполнитьПоИнвентаризацииРБП(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыСчетаРБП = Новый Структура("Счет, КПС, КЭК, Подразделение, Субконто1, Субконто2, Субконто3",
		"СчетРБП", "КПС", "КЭК", "Подразделение", "Субконто1", "Субконто2", "Субконто3");
	БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРБП,
		ЭтотОбъект, "РасходыБудущихПериодов", Отказ);
	
	РеквизитыСчетаРасходов = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
		"СчетРасходов", "СубконтоРасходов1", "СубконтоРасходов2", "СубконтоРасходов3");
	БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРасходов,
		ЭтотОбъект, "РасходыБудущихПериодов", Отказ);
	
	Если НалоговыйУчетВызовСервера.ПлательщикНалогаНаПрибыль(Организация, Дата) Тогда
		
		РеквизитыСчетаРБП = Новый Структура("Счет, Подразделение, Субконто1, Субконто2, Субконто3",
			"СчетРБП", "Подразделение", "Субконто1", "Субконто2", "Субконто3");
		БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРБП,
			ЭтотОбъект, "РасходыБудущихПериодовНУ", Отказ);
		
		РеквизитыСчетаРасходов = Новый Структура("Счет, Субконто1, Субконто2, Субконто3",
			"СчетРасходовНУ", "СубконтоРасходовНУ1", "СубконтоРасходовНУ2", "СубконтоРасходовНУ3");
		БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаРасходов,
			ЭтотОбъект, "РасходыБудущихПериодовНУ", Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ЭтоОтражениеРезультатовИнвентаризацииРБП = ЗначениеЗаполнено(ДокументОснование);
	Если НЕ ЭтоОтражениеРезультатовИнвентаризацииРБП Тогда
		Дата = КонецМесяца(Дата);
	КонецЕсли;
	
	СуммаДокумента = РасходыБудущихПериодов.Итог("СписатьСумма");
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьДокумент(Ошибки = Неопределено) Экспорт
	
	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	РасходыБудущихПериодов.Очистить();
	РасходыБудущихПериодовНУ.Очистить();
	
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	ВидыРБП = Новый Массив;
	Если ЗначениеЗаполнено(ВидРБП) Тогда
		ВидыРБП.Добавить(ВидРБП);
	Иначе
		ВидыРБП.Добавить(Перечисления.ВидыРБП.НеисключительныеПраваПользованияНМА);
		ВидыРБП.Добавить(Перечисления.ВидыРБП.Прочие);
		ВидыРБП.Добавить(Перечисления.ВидыРБП.ОсвоениеПриродныхРесурсов);
		ВидыРБП.Добавить(Перечисления.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества);
		ВидыРБП.Добавить(Перечисления.ВидыРБП.ДолгосрочноеСтрахованиеЖизни);
		ВидыРБП.Добавить(Перечисления.ВидыРБП.СтрахованиеНаОплатуМедицинскихРасходов);
		ВидыРБП.Добавить(Перечисления.ВидыРБП.СтрахованиеНаСлучайСмертиИУтратыРаботоспособности);
		ВидыРБП.Добавить(Перечисления.ВидыРБП.ПрочиеВидыСтрахования);
	КонецЕсли;
	
	НомераТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("ВидыРБП",      ВидыРБП);
	
	ЭтоОтражениеРезультатовИнвентаризацииРБП = ЗначениеЗаполнено(ДокументОснование);
	Если ЭтоОтражениеРезультатовИнвентаризацииРБП Тогда
		Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Дата));
		Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Иначе
		Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
		Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
	КонецЕсли;
	
	// Бухгалтерский учет.
	Запрос.УстановитьПараметр("СчетаБУ", БухгалтерскийУчет.СписокСчетов("401.50"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ЕПСБУОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЕПСБУОстатки.КФО КАК КФО,
	|	ЕПСБУОстатки.КПС КАК КПС,
	|	ЕПСБУОстатки.КЭК КАК КЭК,
	|	ЕПСБУОстатки.Счет КАК СчетРБП,
	|	ЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЕПСБУОстатки.Субконто1 КАК Субконто1,
	|	ЕПСБУОстатки.Субконто2 КАК Субконто2,
	|	ЕПСБУОстатки.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.РасходыБудущихПериодов)
	|		КОГДА ЕПСБУОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.РасходыБудущихПериодов)
	|		КОГДА ЕПСБУОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто3 КАК Справочник.РасходыБудущихПериодов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРБП,
	|	ЕПСБУОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ОстаткиРБП_БУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&КонецПериода,
	|			Счет В (&СчетаБУ),
	|			,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И &УсловиеКФО) КАК ЕПСБУОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРБП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕПСБУОбороты.Организация КАК Организация,
	|	ЕСТЬNULL(ЕПСБУОбороты.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЕПСБУОбороты.КФО КАК КФО,
	|	ЕПСБУОбороты.КПС КАК КПС,
	|	ЕПСБУОбороты.КЭК КАК КЭК,
	|	ЕПСБУОбороты.Счет КАК СчетРБП,
	|	ЕПСБУОбороты.Подразделение КАК Подразделение,
	|	ЕПСБУОбороты.Субконто1 КАК Субконто1,
	|	ЕПСБУОбороты.Субконто2 КАК Субконто2,
	|	ЕПСБУОбороты.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА ЕПСБУОбороты.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто1 КАК Справочник.РасходыБудущихПериодов)
	|		КОГДА ЕПСБУОбороты.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто2 КАК Справочник.РасходыБудущихПериодов)
	|		КОГДА ЕПСБУОбороты.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто3 КАК Справочник.РасходыБудущихПериодов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРБП,
	|	ЕПСБУОбороты.СуммаОборотКт КАК СписаноВТекущемМесяце
	|ПОМЕСТИТЬ ОборотыРБП_БУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Счет В (&СчетаБУ),
	|			,
	|			Организация = &Организация
	|				И &УсловиеИФО
	|				И &УсловиеКФО,
	|			,
	|			) КАК ЕПСБУОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРБП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиРБП.ИФО КАК ИФО,
	|	ОстаткиРБП.КФО КАК КФО,
	|	ОстаткиРБП.КПС КАК КПС,
	|	ОстаткиРБП.КЭК КАК КЭК,
	|	ОстаткиРБП.СчетРБП КАК СчетРБП,
	|	ОстаткиРБП.Подразделение КАК Подразделение,
	|	ОстаткиРБП.Субконто1 КАК Субконто1,
	|	ОстаткиРБП.Субконто2 КАК Субконто2,
	|	ОстаткиРБП.Субконто3 КАК Субконто3,
	|	ОстаткиРБП.СтатьяРБП КАК СтатьяРБП,
	|	РасходыБудущихПериодов.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	РасходыБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	РасходыБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	РасходыБудущихПериодов.ОтражатьВБухгалтерскомУчете КАК ОтражатьВБухгалтерскомУчете,
	|	РасходыБудущихПериодов.СчетРасходов КАК СчетРасходов,
	|	РасходыБудущихПериодов.СубконтоРасходов1 КАК СубконтоРасходов1,
	|	РасходыБудущихПериодов.СубконтоРасходов2 КАК СубконтоРасходов2,
	|	РасходыБудущихПериодов.СубконтоРасходов3 КАК СубконтоРасходов3,
	|	РасходыБудущихПериодов.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	ЕСТЬNULL(ОборотыРБП_БУ.СписаноВТекущемМесяце, 0) КАК СписаноВТекущемМесяце,
	|	ОстаткиРБП.Сумма КАК ОстатокСумма
	|ИЗ
	|	ОстаткиРБП_БУ КАК ОстаткиРБП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РасходыБудущихПериодов КАК РасходыБудущихПериодов
	|		ПО ОстаткиРБП.СтатьяРБП = РасходыБудущихПериодов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыРБП_БУ КАК ОборотыРБП_БУ
	|		ПО ОстаткиРБП.СтатьяРБП = ОборотыРБП_БУ.СтатьяРБП
	|ГДЕ
	|	РасходыБудущихПериодов.ВидРБП В(&ВидыРБП)
	|	И ЕСТЬNULL(ОборотыРБП_БУ.СписаноВТекущемМесяце, 0) = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасходыБудущихПериодов.Наименование";
	НомераТаблиц.Вставить("ОстаткиРБП_БУ", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ОборотыРБП_БУ", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасходыБудущихПериодовБУ", НомераТаблиц.Количество());
	
	// Налоговый учет.
	ПлательщикНалогаНаПрибыль = НалоговыйУчетВызовСервера.ПлательщикНалогаНаПрибыль(Организация, Дата);
	ОтражатьВНалоговомУчете = ПлательщикНалогаНаПрибыль
		И НЕ (ЗначениеЗаполнено(КФО) И НЕ НалоговыйУчетКлиентСервер.ВедетсяНалоговыйУчетПоКФО(КФО))
		И НЕ ЭтоОтражениеРезультатовИнвентаризацииРБП;
	Если ОтражатьВНалоговомУчете Тогда
		
		Запрос.УстановитьПараметр("СчетаНУ", БухгалтерскийУчет.СписокСчетов("Н97"));
		
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЕПСБУОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
		|	ЕПСБУОстатки.КФО КАК КФО,
		|	ЕСТЬNULL(ЕПСБУОстатки.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
		|	ЕПСБУОстатки.Счет КАК СчетРБП,
		|	ЕПСБУОстатки.Подразделение КАК Подразделение,
		|	ЕПСБУОстатки.Субконто1 КАК Субконто1,
		|	ЕПСБУОстатки.Субконто2 КАК Субконто2,
		|	ЕПСБУОстатки.Субконто3 КАК Субконто3,
		|	ВЫБОР
		|		КОГДА ЕПСБУОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.РасходыБудущихПериодов)
		|		КОГДА ЕПСБУОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.РасходыБудущихПериодов)
		|		КОГДА ЕПСБУОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто3 КАК Справочник.РасходыБудущихПериодов)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
		|	КОНЕЦ КАК СтатьяРБП,
		|	ЕПСБУОстатки.СуммаОстаток КАК СуммаНУ,
		|	ЕПСБУОстатки.СуммаНеУчитываетсяНУОстаток КАК СуммаНеУчитываетсяНУ,
		|	ЕПСБУОстатки.СуммаЕНВДОстаток КАК СуммаЕНВД
		|ПОМЕСТИТЬ ОстаткиРБП_НУ
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
		|			&КонецПериода,
		|			Счет В (&СчетаНУ),
		|			,
		|			Организация = &Организация
		|				И &УсловиеИФО
		|				И &УсловиеКФО) КАК ЕПСБУОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтатьяРБП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЕПСБУОбороты.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
		|	ЕПСБУОбороты.КФО КАК КФО,
		|	ЕСТЬNULL(ЕПСБУОбороты.КПС, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПС,
		|	ЕПСБУОбороты.Счет КАК СчетРБП,
		|	ЕПСБУОбороты.Подразделение КАК Подразделение,
		|	ЕПСБУОбороты.Субконто1 КАК Субконто1,
		|	ЕПСБУОбороты.Субконто2 КАК Субконто2,
		|	ЕПСБУОбороты.Субконто3 КАК Субконто3,
		|	ВЫБОР
		|		КОГДА ЕПСБУОбороты.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто1 КАК Справочник.РасходыБудущихПериодов)
		|		КОГДА ЕПСБУОбороты.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто2 КАК Справочник.РасходыБудущихПериодов)
		|		КОГДА ЕПСБУОбороты.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
		|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОбороты.Субконто3 КАК Справочник.РасходыБудущихПериодов)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
		|	КОНЕЦ КАК СтатьяРБП,
		|	ЕПСБУОбороты.СуммаОборотКт + ЕПСБУОбороты.СуммаНеУчитываетсяНУОборотКт + ЕПСБУОбороты.СуммаЕНВДОборотКт КАК СписаноВТекущемМесяце
		|ПОМЕСТИТЬ ОборотыРБП_НУ
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			,
		|			Счет В (&СчетаНУ),
		|			,
		|			Организация = &Организация
		|				И &УсловиеИФО
		|				И &УсловиеКФО,
		|			,
		|			) КАК ЕПСБУОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтатьяРБП
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиРБП.ИФО КАК ИФО,
		|	ОстаткиРБП.КФО КАК КФО,
		|	ОстаткиРБП.КПС КАК КПС,
		|	ОстаткиРБП.СчетРБП КАК СчетРБП,
		|	ОстаткиРБП.Подразделение КАК Подразделение,
		|	ОстаткиРБП.Субконто1 КАК Субконто1,
		|	ОстаткиРБП.Субконто2 КАК Субконто2,
		|	ОстаткиРБП.Субконто3 КАК Субконто3,
		|	ОстаткиРБП.СтатьяРБП КАК СтатьяРБП,
		|	РасходыБудущихПериодов.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
		|	РасходыБудущихПериодов.ДатаНачалаСписания КАК ДатаНачалаСписания,
		|	РасходыБудущихПериодов.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
		|	РасходыБудущихПериодов.ОтражатьВНалоговомУчете КАК ОтражатьВНалоговомУчете,
		|	РасходыБудущихПериодов.СчетРасходов КАК СчетРасходов,
		|	РасходыБудущихПериодов.СубконтоРасходов1 КАК СубконтоРасходов1,
		|	РасходыБудущихПериодов.СубконтоРасходов2 КАК СубконтоРасходов2,
		|	РасходыБудущихПериодов.СубконтоРасходов3 КАК СубконтоРасходов3,
		|	РасходыБудущихПериодов.СчетРасходовНУ КАК СчетРасходовНУ,
		|	РасходыБудущихПериодов.СубконтоРасходовНУ1 КАК СубконтоРасходовНУ1,
		|	РасходыБудущихПериодов.СубконтоРасходовНУ2 КАК СубконтоРасходовНУ2,
		|	РасходыБудущихПериодов.СубконтоРасходовНУ3 КАК СубконтоРасходовНУ3,
		|	РасходыБудущихПериодов.ПодразделениеРасходовНУ КАК ПодразделениеРасходовНУ,
		|	ЕСТЬNULL(ОборотыРБП_НУ.СписаноВТекущемМесяце, 0) КАК СписаноВТекущемМесяце,
		|	ОстаткиРБП.СуммаНУ КАК ОстатокСуммаНУ,
		|	ОстаткиРБП.СуммаНеУчитываетсяНУ КАК ОстатокНеУчитываетсяНУ,
		|	ОстаткиРБП.СуммаЕНВД КАК ОстатокЕНВД
		|ИЗ
		|	ОстаткиРБП_НУ КАК ОстаткиРБП
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РасходыБудущихПериодов КАК РасходыБудущихПериодов
		|		ПО ОстаткиРБП.СтатьяРБП = РасходыБудущихПериодов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыРБП_НУ КАК ОборотыРБП_НУ
		|		ПО ОстаткиРБП.СтатьяРБП = ОборотыРБП_НУ.СтатьяРБП
		|ГДЕ
		|	РасходыБудущихПериодов.ВидРБП В(&ВидыРБП)
		|	И ЕСТЬNULL(ОборотыРБП_НУ.СписаноВТекущемМесяце, 0) = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	РасходыБудущихПериодов.Наименование";
		НомераТаблиц.Вставить("ОстаткиРБП_НУ", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ОборотыРБП_НУ", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("РасходыБудущихПериодовНУ", НомераТаблиц.Количество());
		
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") И ЗначениеЗаполнено(ИФО) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИФО = &ИФО");
		Запрос.УстановитьПараметр("ИФО", ИФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КФО) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКФО", "КФО = &КФО");
		Запрос.УстановитьПараметр("КФО", КФО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКФО", "ИСТИНА" );
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаОстатковБУ = Результат[НомераТаблиц.РасходыБудущихПериодовБУ].Выгрузить();
	
	Для Каждого ОстаткиБУ Из ТаблицаОстатковБУ Цикл
		
		Если ПлательщикНалогаНаПрибыль И НЕ ОстаткиБУ.ОтражатьВБухгалтерскомУчете Тогда
			// Остаток есть, но не указаны параметры отражения в бухгалтерском учете.
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Согласно настройкам, статья расходов будущих периодов ""%1"" не отражается в бухгалтерском учете.
					|Остаток по статье ""%1"" по счету %2 в размере %3 не включен в расчет списания расходов будущих периодов.'"),
					ОстаткиБУ.СтатьяРБП, ОстаткиБУ.СчетРБП, ОбщегоНазначенияБГУ.ФорматСумм(ОстаткиБУ.ОстатокСумма));
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстСообщения, );
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РасходыБудущихПериодов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиБУ);
		
		Если ИспользоватьУчетПоПодразделениям И ЗначениеЗаполнено(ОстаткиБУ.ПодразделениеРасходов) Тогда
			НоваяСтрока.ПодразделениеРасходов = ОстаткиБУ.ПодразделениеРасходов; // В справочнике подразделение расходов указано явно.
		Иначе
			НоваяСтрока.ПодразделениеРасходов = Справочники.Подразделения.ПустаяСсылка();
		КонецЕсли;
		
		Если ЭтоОтражениеРезультатовИнвентаризацииРБП Тогда // Весь остаток.
			НоваяСтрока.СписатьСумма = НоваяСтрока.ОстатокСумма;
			НоваяСтрока.Коэффициент            = 1;
			НоваяСтрока.КоэффициентЧислитель   = 0;
			НоваяСтрока.КоэффициентЗнаменатель = 0;
			Продолжить;
		КонецЕсли;
		
		Если ОстаткиБУ.СпособПризнанияРасходов = Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням
		 ИЛИ ОстаткиБУ.СпособПризнанияРасходов = Перечисления.СпособыПризнанияРасходов.ПоМесяцам Тогда
		
			Если НЕ ЗначениеЗаполнено(ОстаткиБУ.ДатаНачалаСписания) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнена дата начала списания для статьи расходов будущих периодов ""%1"". 
						|Укажите дату начала списания, либо введите сумму расходов к списанию вручную.'"),
						ОстаткиБУ.СтатьяРБП);
				ПолеОшибки = "Объект.РасходыБудущихПериодов[" + Формат(НоваяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДатаНачалаСписания";
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, ТекстСообщения, );
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ОстаткиБУ.ДатаОкончанияСписания) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не заполнена дата окончания списания для статьи расходов будущих периодов ""%1"". 
						|Укажите дату окончания списания, либо введите сумму расходов к списанию вручную.'"),
						ОстаткиБУ.СтатьяРБП);
				ПолеОшибки = "Объект.РасходыБудущихПериодов[" + Формат(НоваяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДатаОкончанияСписания";
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, ТекстСообщения, );
				Продолжить;
			КонецЕсли;
			
			// Рассчитаем сумму расходов будущих периодов к списанию в текущем месяце.
			ПротоколРасчета = Неопределено;
			Доля = БухгалтерскийУчет.ДоляОчередногоМесяцаПриРавномерномПризнанииДоходовРасходов(
				ОстаткиБУ.СпособПризнанияРасходов,
				ЭтотОбъект.Дата,
				ОстаткиБУ.ДатаНачалаСписания,
				ОстаткиБУ.ДатаОкончанияСписания,
				ПротоколРасчета);
			
			НоваяСтрока.Коэффициент            = Доля;
			НоваяСтрока.КоэффициентЧислитель   = ПротоколРасчета.Числитель;
			НоваяСтрока.КоэффициентЗнаменатель = ПротоколРасчета.Знаменатель;
			
			НоваяСтрока.СписатьСумма = Доля * НоваяСтрока.ОстатокСумма;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Налоговый учет.
	Если ОтражатьВНалоговомУчете Тогда
		
		ТаблицаОстатковНУ = Результат[НомераТаблиц.РасходыБудущихПериодовНУ].Выгрузить();
		Для Каждого ОстаткиНУ Из ТаблицаОстатковНУ Цикл
			
			Если НЕ ОстаткиНУ.ОтражатьВНалоговомУчете Тогда
				// Остаток есть, но не указаны параметры отражения в налоговом учете.
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Согласно настройкам, статья расходов будущих периодов ""%1"" не отражается в налоговом учете.
						|Остаток по статье ""%1"" по счету %2 в размере %3 не включен в расчет списания расходов будущих периодов.'"),
						ОстаткиНУ.СтатьяРБП, ОстаткиНУ.СчетРБП, ОбщегоНазначенияБГУ.ФорматСумм(ОстаткиНУ.ОстатокСуммаНУ));
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "", ТекстСообщения, );
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = РасходыБудущихПериодовНУ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиНУ);
			
			Если НЕ ЗначениеЗаполнено(ОстаткиНУ.СчетРасходовНУ) Тогда
				
				// Счет и аналитика расходов НУ явно не указаны, значит отражение в НУ аналогично БУ.
				// Определим СчетРасходовНУ и СубконтоРасходовНУ по счету и субконто расходов БУ.
				// Счет БУ может быть только из группы 109.ХХ, т.к. для счета БУ 401.20
				// соответствующий счет и аналитика НУ должна указываться явно.
				СвойстваСчетаРасходовБУ = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(ОстаткиНУ.СчетРасходов);
				
				НоваяСтрока.СчетРасходовНУ = НалоговыйУчетКлиентСервер.СчетРасходовНУ(
					ОстаткиНУ.СчетРасходов, 
					ОстаткиНУ.СубконтоРасходов1,
					ОстаткиНУ.СубконтоРасходов2,
					ОстаткиНУ.СубконтоРасходов3,
					БухгалтерскийУчет.СчетПоКоду("401.50", Дата, Организация),
					Организация, ОстаткиНУ.ИФО, ОстаткиНУ.Подразделение, КонецМесяца(Дата));
				
				НоваяСтрока.СубконтоРасходовНУ1 =
					БухгалтерскийУчет.ПолучитьЗначениеСубконто(НоваяСтрока.СчетРасходовНУ, 1,
						СвойстваСчетаРасходовБУ.ВидСубконто1, ОстаткиНУ.СубконтоРасходов1,
						СвойстваСчетаРасходовБУ.ВидСубконто2, ОстаткиНУ.СубконтоРасходов2,
						СвойстваСчетаРасходовБУ.ВидСубконто3, ОстаткиНУ.СубконтоРасходов3);
				НоваяСтрока.СубконтоРасходовНУ2 =
					БухгалтерскийУчет.ПолучитьЗначениеСубконто(НоваяСтрока.СчетРасходовНУ, 2,
						СвойстваСчетаРасходовБУ.ВидСубконто1, ОстаткиНУ.СубконтоРасходов1,
						СвойстваСчетаРасходовБУ.ВидСубконто2, ОстаткиНУ.СубконтоРасходов2,
						СвойстваСчетаРасходовБУ.ВидСубконто3, ОстаткиНУ.СубконтоРасходов3);
				НоваяСтрока.СубконтоРасходовНУ3 =
					БухгалтерскийУчет.ПолучитьЗначениеСубконто(НоваяСтрока.СчетРасходовНУ, 3,
						СвойстваСчетаРасходовБУ.ВидСубконто1, ОстаткиНУ.СубконтоРасходов1,
						СвойстваСчетаРасходовБУ.ВидСубконто2, ОстаткиНУ.СубконтоРасходов2,
						СвойстваСчетаРасходовБУ.ВидСубконто3, ОстаткиНУ.СубконтоРасходов3);
				
			КонецЕсли;
			
			Если ИспользоватьУчетПоПодразделениям И ЗначениеЗаполнено(ОстаткиНУ.ПодразделениеРасходовНУ) Тогда
				НоваяСтрока.ПодразделениеРасходовНУ = ОстаткиНУ.ПодразделениеРасходовНУ; // В справочнике подразделение расходов указано явно.
			Иначе
				НоваяСтрока.ПодразделениеРасходовНУ = Справочники.Подразделения.ПустаяСсылка();
			КонецЕсли;
			
			Если ОстаткиНУ.СпособПризнанияРасходов = Перечисления.СпособыПризнанияРасходов.ПоКалендарнымДням
			 ИЛИ ОстаткиНУ.СпособПризнанияРасходов = Перечисления.СпособыПризнанияРасходов.ПоМесяцам Тогда
			
				Если НЕ ЗначениеЗаполнено(ОстаткиНУ.ДатаНачалаСписания) Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не заполнена дата начала списания для статьи расходов будущих периодов ""%1"". 
							|Укажите дату начала списания, либо введите сумму расходов к списанию вручную.'"),
							ОстаткиНУ.СтатьяРБП);
					ПолеОшибки = "Объект.РасходыБудущихПериодовНУ[" + Формат(НоваяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДатаНачалаСписания";
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, ТекстСообщения, );
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(ОстаткиНУ.ДатаОкончанияСписания) Тогда
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Не заполнена дата окончания списания для статьи расходов будущих периодов ""%1"". 
							|Укажите дату окончания списания, либо введите сумму расходов к списанию вручную.'"),
							ОстаткиНУ.СтатьяРБП);
					ПолеОшибки = "Объект.РасходыБудущихПериодовНУ[" + Формат(НоваяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].ДатаОкончанияСписания";
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ПолеОшибки, ТекстСообщения, );
					Продолжить;
				КонецЕсли;
				
				// Рассчитаем сумму расходов будущих периодов к списанию в текущем месяце.
				ПротоколРасчета = Неопределено;
				Доля = БухгалтерскийУчет.ДоляОчередногоМесяцаПриРавномерномПризнанииДоходовРасходов(
					ОстаткиНУ.СпособПризнанияРасходов,
					ЭтотОбъект.Дата,
					ОстаткиНУ.ДатаНачалаСписания,
					ОстаткиНУ.ДатаОкончанияСписания,
					ПротоколРасчета);
				
				НоваяСтрока.Коэффициент            = Доля;
				НоваяСтрока.КоэффициентЧислитель   = ПротоколРасчета.Числитель;
				НоваяСтрока.КоэффициентЗнаменатель = ПротоколРасчета.Знаменатель;
				
				НоваяСтрока.СписатьСуммаНУ         = Доля * НоваяСтрока.ОстатокСуммаНУ;
				НоваяСтрока.СписатьНеУчитываетсяНУ = Доля * НоваяСтрока.ОстатокНеУчитываетсяНУ;
				НоваяСтрока.СписатьЕНВД            = Доля * НоваяСтрока.ОстатокЕНВД;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоИнвентаризацииРБП(ДокументОбъект, ДокументИнвентаризацииРБП) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументИнвентаризацииРБП,
		"Ссылка,Организация,Дата,ДатаИнвентаризации,Счет,ВидРБП");
	
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ЗначенияРеквизитов, "Организация,ВидРБП");
	ДокументОбъект.Дата = КонецДня(ЗначенияРеквизитов.ДатаИнвентаризации);
	ДокументОбъект.ДокументОснование = ЗначенияРеквизитов.Ссылка;
	
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	ТекстыЗапросов     = Новый Массив;
	ИндексыРезультатов = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументИнвентаризацияРБП", ЗначенияРеквизитов.Ссылка);
	Запрос.УстановитьПараметр("Организация", ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("ДатаЗапроса", ИнвентаризацияКлиентСервер.ПолучитьДатуОпределенияОстатков52н(ЗначенияРеквизитов.ДатаИнвентаризации));
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.Счет) Тогда
		Запрос.УстановитьПараметр("СчетаБУ", ЗначенияРеквизитов.Счет);
	Иначе
		Запрос.УстановитьПараметр("СчетаБУ", БухгалтерскийУчет.СписокСчетов("401.50"));
	КонецЕсли;
	
	ИндексыРезультатов.Вставить("ИнвентаризацияРБП", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ИнвентаризацияРБП.НомерСтроки КАК НомерСтроки,
	|	ИнвентаризацияРБП.СтатьяРБП КАК СтатьяРБП,
	|	ИнвентаризацияРБП.СтатьяРБП.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	ИнвентаризацияРБП.СтатьяРБП.ДатаНачалаСписания КАК ДатаНачалаСписания,
	|	ИнвентаризацияРБП.СтатьяРБП.ДатаОкончанияСписания КАК ДатаОкончанияСписания,
	|	ИнвентаризацияРБП.СтатьяРБП.ОтражатьВБухгалтерскомУчете КАК ОтражатьВБухгалтерскомУчете,
	|	ИнвентаризацияРБП.СтатьяРБП.СчетРасходов КАК СчетРасходов,
	|	ИнвентаризацияРБП.СтатьяРБП.СубконтоРасходов1 КАК СубконтоРасходов1,
	|	ИнвентаризацияРБП.СтатьяРБП.СубконтоРасходов2 КАК СубконтоРасходов2,
	|	ИнвентаризацияРБП.СтатьяРБП.СубконтоРасходов3 КАК СубконтоРасходов3,
	|	ИнвентаризацияРБП.СтатьяРБП.ПодразделениеРасходов КАК ПодразделениеРасходов,
	|	ИнвентаризацияРБП.ОстатокПоДаннымУчета КАК ОстатокПоДаннымУчета,
	|	ИнвентаризацияРБП.ПодлежитДосписанию КАК ПодлежитДосписанию,
	|	ИнвентаризацияРБП.ИзлишнеСписано КАК ИзлишнеСписано
	|ИЗ
	|	Документ.ИнвентаризацияРасходовБудущихПериодов.РасходыБудущихПериодов КАК ИнвентаризацияРБП
	|ГДЕ
	|	ИнвентаризацияРБП.Ссылка = &ДокументИнвентаризацияРБП
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
	
	ИндексыРезультатов.Вставить("ОстаткиРБП", ТекстыЗапросов.Количество());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ЕПСБУОстатки.Организация КАК Организация,
	|	ЕСТЬNULL(ЕПСБУОстатки.ИФО, ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЕПСБУОстатки.КФО КАК КФО,
	|	ЕПСБУОстатки.КПС КАК КПС,
	|	ЕПСБУОстатки.КЭК КАК КЭК,
	|	ЕПСБУОстатки.Счет КАК СчетРБП,
	|	ЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЕПСБУОстатки.Субконто1 КАК Субконто1,
	|	ЕПСБУОстатки.Субконто2 КАК Субконто2,
	|	ЕПСБУОстатки.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА ЕПСБУОстатки.Субконто1 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто1 КАК Справочник.РасходыБудущихПериодов)
	|		КОГДА ЕПСБУОстатки.Субконто2 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто2 КАК Справочник.РасходыБудущихПериодов)
	|		КОГДА ЕПСБУОстатки.Субконто3 ССЫЛКА Справочник.РасходыБудущихПериодов
	|			ТОГДА ВЫРАЗИТЬ(ЕПСБУОстатки.Субконто3 КАК Справочник.РасходыБудущихПериодов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РасходыБудущихПериодов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРБП,
	|	ЕПСБУОстатки.СуммаОстаток КАК ОстатокСумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ДатаЗапроса, Счет В (&СчетаБУ), , Организация = &Организация) КАК ЕПСБУОстатки");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ИнвентаризацияРБП = Результаты[ИндексыРезультатов.ИнвентаризацияРБП].Выгрузить();
	ОстаткиРБП = Результаты[ИндексыРезультатов.ОстаткиРБП].Выгрузить();
	ОстаткиРБП.Индексы.Добавить("СтатьяРБП");
	
	Для Каждого СтрокаИнвентаризации Из ИнвентаризацияРБП Цикл
		
		Отбор = Новый Структура("СтатьяРБП", СтрокаИнвентаризации.СтатьяРБП);
		БазаРаспределения = ОстаткиРБП.Скопировать(ОстаткиРБП.НайтиСтроки(Отбор));
		БазаРаспределения.Колонки.Добавить("СписатьСумма",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой)) );
		
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаИнвентаризации.ПодлежитДосписанию,
			БазаРаспределения, "СписатьСумма", "ОстатокСумма", Ложь);
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоСтрокамТаблицы(СтрокаИнвентаризации.ИзлишнеСписано,
			БазаРаспределения, "СписатьСумма", "ОстатокСумма", Ложь);
		
		Для Каждого СтрокаОстатков Из БазаРаспределения Цикл
			
			Если СтрокаОстатков.СписатьСумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДокументОбъект.РасходыБудущихПериодов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков,
				"ИФО,КФО,КПС,КЭК,СчетРБП,Субконто1,Субконто2,Субконто3");
			
			Если ИспользоватьУчетПоПодразделениям Тогда
				СвойстваСчетаРБП = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаОстатков.СчетРБП);
				Если СвойстваСчетаРБП.УчетПоПодразделениям Тогда
					НоваяСтрока.Подразделение = СтрокаОстатков.Подразделение;
				КонецЕсли;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИнвентаризации,
				"СпособПризнанияРасходов,ДатаНачалаСписания,ДатаОкончанияСписания,
				|СчетРасходов,СубконтоРасходов1,СубконтоРасходов2,СубконтоРасходов3");
			
			НоваяСтрока.ОстатокСумма = СтрокаОстатков.ОстатокСумма;
			НоваяСтрока.СписатьСумма = СтрокаОстатков.СписатьСумма;
			
			// Коэффициент списания определим по фактически указанной сумме списания.
			НоваяСтрока.Коэффициент = ?(НоваяСтрока.ОстатокСумма = 0, 0,
				НоваяСтрока.СписатьСумма / НоваяСтрока.ОстатокСумма);
			НоваяСтрока.КоэффициентЧислитель   = 0;
			НоваяСтрока.КоэффициентЗнаменатель = 0;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
