#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СтрокаПоиска", ?(Параметры.СтрокаПоиска = Неопределено, "", Параметры.СтрокаПоиска) + "%");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыДокументовФизическихЛиц.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
	|ГДЕ
	|	НЕ ВидыДокументовФизическихЛиц.ПометкаУдаления
	|	И ВидыДокументовФизическихЛиц.Наименование ПОДОБНО &СтрокаПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыДокументовФизическихЛиц.РеквизитДопУпорядочивания";
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузитьЭлементы() Экспорт
	
	Макет = ПолучитьМакет("ВидыДокументовФизическихЛиц");
	
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	
	н = 1;
	
	Пока (Истина) Цикл
		Записываем = Ложь;
		ТекНаименование = СокрЛП(ОбластьНаименование.Область(н, 1).Текст);
		НовНаименование = СокрЛП(ОбластьНаименование.Область(н, 2).Текст);
		ТекКодФНС 		= СокрЛП(ОбластьНаименование.Область(н, 3).Текст);
		ТекКодПФР 		= СокрЛП(ОбластьНаименование.Область(н, 4).Текст);
		ТекКодФК 		= СокрЛП(ОбластьНаименование.Область(н, 5).Текст);
		
		Если НЕ ЗначениеЗаполнено(ТекНаименование) Тогда
			Прервать;
		КонецЕсли;
		
		ТекСсылка = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(ТекНаименование);
		Если ТекСсылка.Пустая() Тогда
			ТекОбъект = Справочники.ВидыДокументовФизическихЛиц.СоздатьЭлемент();		
			ТекОбъект.Наименование 	= ТекНаименование;
			Записываем = Истина;
		Иначе
			ТекОбъект = ТекСсылка.ПолучитьОбъект();
			Если ЗначениеЗаполнено(НовНаименование) Тогда
				ТекОбъект.Наименование = НовНаименование;
				Записываем = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекОбъект.КодФНС) Тогда 
			ТекОбъект.КодФНС		= ТекКодФНС;
			Записываем = Истина;
		КонецЕсли;
		Если  НЕ ЗначениеЗаполнено(ТекОбъект.КодПФР) Тогда 
        	ТекОбъект.КодПФР 		= ТекКодПФР;
			Записываем = Истина;
		КонецЕсли;
		Если  НЕ ЗначениеЗаполнено(ТекОбъект.КодФК) Тогда 
        	ТекОбъект.КодФК 		= ТекКодФК;
			Записываем = Истина;
		КонецЕсли;
		Если Записываем Тогда
			ТекОбъект.Записать();
		КонецЕсли;		
		н = н + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКодФК() Экспорт
	
	Макет = ПолучитьМакет("ВидыДокументовФизическихЛиц");
	
	ОбластьНаименование = Макет.ПолучитьОбласть("Наименование");
	
	н = 1;
	
	Пока (Истина) Цикл
		Записываем = Ложь;
		ТекНаименование = СокрЛП(ОбластьНаименование.Область(н, 1).Текст);
		НовНаименование = СокрЛП(ОбластьНаименование.Область(н, 2).Текст);
		ТекКодФНС 		= СокрЛП(ОбластьНаименование.Область(н, 3).Текст);
		ТекКодПФР 		= СокрЛП(ОбластьНаименование.Область(н, 4).Текст);
		ТекКодФК 		= СокрЛП(ОбластьНаименование.Область(н, 5).Текст);
		
		Если НЕ ЗначениеЗаполнено(ТекНаименование) Тогда
			Прервать;
		КонецЕсли;
		Наименование = ?(ЗначениеЗаполнено(НовНаименование),НовНаименование,ТекНаименование);
		
		ТекСсылка = Справочники.ВидыДокументовФизическихЛиц.НайтиПоНаименованию(Наименование);
		Если НЕ ТекСсылка.Пустая() Тогда
			ТекОбъект = ТекСсылка.ПолучитьОбъект();			
			Если  НЕ ЗначениеЗаполнено(ТекОбъект.КодФК) Тогда 
	        	ТекОбъект.КодФК 		= ТекКодФК;
				Записываем = Истина;
			КонецЕсли;
			Если Записываем Тогда
				ТекОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
		н = н + 1;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

