#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗарегистрироватьВерсиюКомплектаОтчетности(ИнформацияОКомплекте, ВидыОтчетов) Экспорт
	
	Если ИнформацияОКомплекте = Неопределено или Не ЗначениеЗаполнено(ИнформацияОКомплекте.Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию(); // регистрация версий отчетов и комплекта
	
	Попытка
		// Регистрация текущей версии комплекта
		Запись = РегистрыСведений.УстановленныеКомплектыОтчетности.СоздатьМенеджерЗаписи();
		Запись.ИдентификаторКомплекта = ИнформацияОКомплекте.Идентификатор;
		Запись.Наименование           = ИнформацияОКомплекте.Наименование;
		Запись.Описание               = ИнформацияОКомплекте.Описание;
		Запись.Поставщик              = ИнформацияОКомплекте.Поставщик;
		Запись.Версия                 = ИнформацияОКомплекте.Версия;
		Запись.НеИспользуется		  = ПолучитьПризнакНеИспользуетсяКомплекта(Запись.ИдентификаторКомплекта);
		
		Если ИнформацияОКомплекте.Свойство("ДопИнформация") Тогда
			
			Если ТипЗнч(ИнформацияОКомплекте.ДопИнформация) = Тип("ДокументDOM") Тогда
				ЗаписьXML = Новый ЗаписьXML;
				ЗаписьDOM = Новый ЗаписьDOM;
				ЗаписьXML.УстановитьСтроку();
				ЗаписьDOM.Записать(ИнформацияОКомплекте.ДопИнформация, ЗаписьXML);
				СтрокаXML = ЗаписьXML.Закрыть();
			Иначе
				СтрокаXML = ИнформацияОКомплекте.ДопИнформация;
			КонецЕсли;
			
			Запись.ОписаниеИзмененийHTML = Новый ХранилищеЗначения(СтрокаXML, Новый СжатиеДанных(9));
			
		КонецЕсли;
		
		Запись.Записать();
		
		// Регистрация изменений по видам отчета
		Если ЗначениеЗаполнено(ВидыОтчетов) Тогда  	
			Если ОбщегоНазначения.ПодсистемаСуществует("УчетГосУчрежденийПодсистемы.РегламентированнаяБухОтчетность.РегистрацияВерсийУстановленныхОтчетов") Тогда 
							
				Модуль = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрСведений.ВерсииУстановленныхОтчетов");
				Модуль.ЗарегистрироватьВерсииОтчетов(ВидыОтчетов,ИнформацияОКомплекте.Идентификатор, ИнформацияОКомплекте.Версия);
				
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьПризнакНеИспользуетсяКомплекта(ИдентификаторКомплекта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановленныеКомплектыОтчетности.НеИспользуется КАК НеИспользуется
		|ИЗ
		|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
		|ГДЕ
		|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта = &ИдентификаторКомплекта";
	
	Запрос.УстановитьПараметр("ИдентификаторКомплекта", ИдентификаторКомплекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЗначениеНеИспользуется = Ложь;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗначениеНеИспользуется = ВыборкаДетальныеЗаписи.НеИспользуется;
	КонецЕсли;
	
	Возврат ЗначениеНеИспользуется;
	
КонецФункции

#КонецЕсли