
#Область ОписаниеПеременных

&НаКлиенте
Перем ВидПоступленияДоИзменения; // ПеречислениеСсылка.ВидыПоступленийМЗИК

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	УстановитьУсловноеОформление();
	УстановитьУсловноеОформлениеЧленовКомиссии();
	УправлениеНФА.ПроверитьУчетИмуществаКазны();
	
	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448();

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// если документ скопирован или введен на основании, то чтения на сервере не было
	Если Параметры.Ключ.Пустая() Тогда 
		Если Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ЗаполнитьОтветственныеЛица();
		КонецЕсли;
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	ВидимостьЭлементовЭДОДляЭДПоставщика = ВидимостьЭлементовЭДОДляДокумента();
	ВидимостьЭлементовЭДОАкта448 = ВидимостьЭлементовЭДОАкта448();
	УстановитьВидимостьЭлементовЭДО(ЭтотОбъект, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448);
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом 
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект, Истина);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами  
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
    ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);

	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
    Оповестить("ДокументыПоУчетуИКИзменение");

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ДанныеСчетовВФорме = Неопределено;
	ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме);
	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ДанныеСчетовВФорме);
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаПодписанияПервичногоДокумента = Объект.Дата;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ДобавлениеСпискаДМ.Форма.Форма" Тогда
		ОбработкаДобавленияДМДляОбъектаНаСервере(ВыбранноеЗначение);
		УстановитьВидимостьДанныхДрагМатериалов();
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.СведенияЭлектронногоАктаОПриемеПередачеНФА" Тогда
		ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ВыбранноеЗначение);
	КонецЕсли;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭДАктов" Тогда
		ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов   
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	УстановитьДоступностьДоговора(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	УстановитьОтветственного();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаДрагМатериалы" Тогда
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
	ИначеЕсли ТекущаяСтраница.Имя = "Дополнительно" Тогда
		ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	ВведенНаОснованииЭДП = Ложь;
	ЭлектронныеДокументыБГУКлиент.ОткрытьДокументОснованиеПоСсылкеСостояниеЭДО(ЭтотОбъект, Объект.Ссылка,
		СтандартнаяОбработка, ВведенНаОснованииЭДП, Объект.ДокументОснование);
		
	Если НЕ ВведенНаОснованииЭДП Тогда
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСостояниеЭДОАктыОПриемеПередачеНФАНажатие(Элемент)

	ЭлектронныеДокументыБГУКлиент.ОткрытьСостояниеЭДОАктамиОПриемеПередачеНФА(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьПоДокументуОснованию(Объект.ДокументОснование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПоступленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ВидПоступленияДоИзменения = Объект.ВидПоступления;
КонецПроцедуры

&НаКлиенте
Процедура ВидПоступленияПриИзменении(Элемент)
	
	Если ТребуетсяПерезаполнитьСписокСчетовУчетаВШапке() Тогда
		ОбновитьДанныеСчетовВФорме();
	КонецЕсли;
	УстановитьСчетУчетаВШапке();
	УстановитьДоступностьИзмененияСчетовУчета(ЭтотОбъект, Объект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УстановитьЗаголовокЗакладкиВозвратИзАренды(ЭтотОбъект);
	
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СчетУчета", Объект.СчетУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	Если ЭтотОбъект.КэшПараметров.Локальные.СчетУчета <> Объект.СчетУчета Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КэшПараметров.Локальные.СчетУчета)
				Или Объект.Материалы.Количество() = 0 Тогда
			// Если счет учета был пустой или в таблице нет материалов,
			// то дополнительный вопрос не требуется.
			СчетУчетаПриИзмененииНаКлиенте();
			Возврат;
		КонецЕсли;
		
		ТекстВопроса = НСтр("ru = 'При изменении счета учета документа будет изменен счет учета в таблице ""Материалы"".
			|Изменить счет учета?'");
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить счет учета'"));
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не изменять счет учета'"));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОбИзмененииСчетаУчета", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, 20, КодВозвратаДиалога.Да);
		Возврат;
		
	КонецЕсли;
	
	СчетУчетаПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансаПриИзменении(Элемент)
	
	УчетРасчетовКлиент.СпособЗачетаАвансаПриИзменении(Элемент, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДопСведенияЭлектронногоАктаПоФорме0510448Нажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Параметры.Ключ.Пустая() Тогда
		ТекстОшибки = НСтр("ru='Необходимо записать документ для заполнение сведений электронного акта о приеме-передаче НФА.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыДопСведений = НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
	
	ПараметрыДопСведений.Ссылка = Объект.Ссылка;
	ПараметрыДопСведений.ДатаСведений = Объект.Дата;
	ПараметрыДопСведений.Организация = Объект.Организация;
	
	ЭлектронныеДокументыБГУКлиент.ОткрытьФормуДопСведенийДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, Объект, ПараметрыДопСведений);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьВМежотчетномПериодеПриИзменении(Элемент)
	Объект.Дата = КонецГода(Объект.Дата);
	БухгалтерскийУчетКлиент.УстановитьЗначениеВидаМежотчетногоПериода(ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.ВидыМежотчетногоПериода.ИзменениеВалютыБаланса"));
	ПриИзмененииКлючевогоРеквизитаТиповойОперации();
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры
 
&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
		ТекущиеДанные.Коэффициент = 1;
		
		ПоступлениеНаСчет108_106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(ЭтотОбъект)
			Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);

		Если НЕ ПоступлениеНаСчет108_106 Тогда
			ТекущиеДанные.СчетУчета = Объект.СчетУчета;
		КонецЕсли;
		КоличествоСтрок = Объект.Материалы.Количество();
		Если КоличествоСтрок > 1 Тогда
			ПредыдущаяСтрока = Объект.Материалы[КоличествоСтрок-2];
			ТекущиеДанные.КПС = ПредыдущаяСтрока.КПС;
		КонецЕсли;
		
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТекущейСтрокиМатериалов(
			Объект, Элементы.Материалы.ТекущиеДанные, Истина);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.СчетУчета)
			И ПоступлениеНаСчет108_106 Тогда
			ТекущиеДанные.УчетПоКПС = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоМестПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.Количество = ТекущиеДанные.КоличествоМест * ТекущиеДанные.Коэффициент;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоэффициентПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.Количество = ТекущиеДанные.КоличествоМест * ТекущиеДанные.Коэффициент;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные.Количество <> 0 Тогда
		ТекущиеДанные.КоличествоМест = ТекущиеДанные.Количество / ТекущиеДанные.Коэффициент;
	Иначе
		ТекущиеДанные.КоличествоМест = 0;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ВыбранноеЗначение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ВыбранноеЗначение, "Ссылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ЗаполнитьДанныеНоменклатурыВСтроке("Материалы", ТекущиеДанные.ПолучитьИдентификатор(), Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораПолногоСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораСчетаМатериалаВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередУдалением(Элемент, Отказ)
	ОбъектНаУдаление = Элементы.Материалы.ТекущиеДанные.Номенклатура;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ОбъектНаУдаление);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()<>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПараметрыОповещения = Новый Структура("НайденныеСтроки", НайденныеСтроки);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОДрагМатериалах", ЭтотОбъект, ПараметрыОповещения);
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Удалить данные о содержании драгоценных материалов в удаленном объекте НФА (%1) на закладке ""Драгоценные материалы""?'"), ОбъектНаУдаление);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗачетАвансов

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ЭтотОбъект, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНФАДокументаОснования

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииСтроки(Элемент)
	Если (Элемент.ТекущиеДанные <> Неопределено) И (ИспользоватьОтборДрагМатериаловПоОбъектуНФА) Тогда
		ПодключитьОбработчикОжидания("ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", , Элемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи

&НаКлиенте
Процедура ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиИмяФайла" Тогда
		УправлениеНФАКлиент.ОткрытьЭлектронныйДокументПриложенияИзФайла(
			ВыбраннаяСтрока, 
			ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи, 
			УникальныйИдентификатор);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подобрать(Команда)
	
	УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект,,
		ДополнитьСтруктуруПодбора());

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ДобавитьЛомОтходыДМДляОбъекта(Команда)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
	Иначе	
		УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМ(ЭтотОбъект, Объект,
			Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Номенклатура,
			ПредопределенноеЗначение("Справочник.ИнвентарныеНомераОС.ПустаяСсылка"), 
		Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Количество, "Лом");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписокДМДляОбъекта(Команда)
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
	Иначе	
		Если Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Количество() = 1 Тогда
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМ(ЭтотОбъект, Объект,
				Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Номенклатура,
				ПредопределенноеЗначение("Справочник.ИнвентарныеНомераОС.ПустаяСсылка"), 
			Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Количество, "Изделия");
			
			ВариантВводаДанныхДМ = 1;
		Иначе
			МассивВыделенныеСтроки = Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки;
			
			АдресТаблицыОбъектовНФА = ПоместитьТаблицуОбъектовНФАДляДМВХранилище(МассивВыделенныеСтроки);
			
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМДляПеречняОбъектов(ЭтотОбъект, Объект,
				АдресТаблицыОбъектовНФА, "Изделия"); 
			
			ВариантВводаДанныхДМ = 2;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОтбораДМПоОбъекту(Команда)
	
	ИспользоватьОтборДрагМатериаловПоОбъектуНФА = НЕ ИспользоватьОтборДрагМатериаловПоОбъектуНФА;
	УстановитьВидимостьДанныхДрагМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	Если Не ОбязательныеПоляДляЗаполненияЗаполнены() Тогда
		Возврат;
	КонецЕсли;

	ТекстВопроса = "";
	ЧастиВопроса = Новый Массив;	
	Если Объект.ЗачетАвансов.Количество() > 0 Тогда
		ЧастиВопроса.Добавить(НСтр("ru = 'Табличная часть будет очищена.'"));
	КонецЕсли;
	Если Объект.Проведен Тогда
		ЧастиВопроса.Добавить(НСтр("ru = 'Проведение документа будет отменено.'"));
	КонецЕсли;
	
	Если ЧастиВопроса.Количество() > 0 Тогда
		ЧастиВопроса.Добавить(НСтр("ru = 'Продолжить?'"));
		ТекстВопроса = СтрСоединить(ЧастиВопроса, Символы.ПС);
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнениеТаблицыАвансыЗавершение", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;	 

	ЗаполнитьАвансыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДО(Команда)
	
	Если Не ОбязательныеПоляДляЗаполненияЗаполнены() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед заполнением денежных обязательств проведение документа будет отменено.
			|Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОтменитьПроведениеПередЗаполнениемДО", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
    УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВопросаОтменитьПроведениеПередЗаполнениемДО(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДОНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПериодОстатков = Новый Граница(КонецДня(ДокументОбъект.Дата), ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	ТаблицаОбязательств = УчетРасчетов.ДенежныеОбязательстваПоПоступлениюТРУ(ДокументОбъект, ПериодОстатков);
	
	Объект.ДенежныеОбязательства.Загрузить(ТаблицаОбязательств);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеТаблицыАвансыЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвансыНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры	
 
&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	Отказ = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПериодЗаполнения = Новый Граница(КонецДня(Объект.Дата), ВидГраницы.Включая);
	Иначе
		ПериодЗаполнения = Новый Граница(Объект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	Документы.ПоступлениеИК.ЗаполнитьПоОстаткамАвансов(Объект, ПериодЗаполнения, Отказ);
	
	Если НЕ Отказ Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеПоляДляЗаполненияЗаполнены()
	
	Результат = Истина;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Организация""'"),, "Объект.Организация");
		Результат = Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Контрагент""'"),, "Объект.Контрагент");
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьФлагОтразитьВМежотчетномПериодеПриИзмененииДаты()
	ВидМежотчетногоПериодаДоИзменения = Объект.ВидМежотчетногоПериода;
	БухгалтерскийУчетКлиент.ОчиститьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
	Если Объект.ВидМежотчетногоПериода <> ВидМежотчетногоПериодаДоИзменения Тогда
		ПриИзмененииКлючевогоРеквизитаТиповойОперации();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	ОчиститьФлагОтразитьВМежотчетномПериодеПриИзмененииДаты();

	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ТребуетсяВызовСервера = ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или ((УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(ЭтотОбъект)
				Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект)) 
			И УправлениеМатериальнымиЗапасамиКлиентСервер.ИзменилосьПрименениеДетальногоКЭК340и440(
				ЭтотОбъект.КэшПараметров.Дата,
				ЭтотОбъект.КэшПараметров.Организация,
				Объект.Дата,
				Объект.Организация));
		
	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	КонецЕсли;

	Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(ЭтотОбъект)
		Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект) Тогда
			
		УправлениеМатериальнымиЗапасами.ОбработатьИзменениеПримененияДетальногоКЭК340и440(ЭтотОбъект,
			ЭтотОбъект.КэшПараметров.Дата,
			ЭтотОбъект.КэшПараметров.Организация);
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		ЗаполнитьОтветственныеЛица();
		ЗаполнитьКЭШПараметровФормыЛокальныеСчета();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьОтветственного();
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Функция ТребуетсяПерезаполнитьСписокСчетовУчетаВШапке()
	ДоИзмененияТолько108 = ВидПоступленияТолькоСчета108(ВидПоступленияДоИзменения);
	ПослеИзмененияТолько108 = ВидПоступленияТолькоСчета108(Объект.ВидПоступления);
	Возврат ДоИзмененияТолько108 <> ПослеИзмененияТолько108;
КонецФункции

&НаСервере
Процедура ОбновитьДанныеСчетовВФорме()
	ЗаполнитьДанныеСчетовВФорме();
	Если Элементы.СчетУчета.СписокВыбора.НайтиПоЗначению(Объект.СчетУчета) = Неопределено Тогда
		Объект.СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме = Неопределено)
	
	Элементы.СчетУчета.СписокВыбора.Очистить();
	
	ПараметрыЗаполненияСчета = УправлениеМатериальнымиЗапасами.ПараметрыЗаполненияДанныхСчетовУчетаМЗВФорме();
	ПараметрыЗаполненияСчета.Организация = Объект.Организация;
	ПараметрыЗаполненияСчета.ДатаСчета = Объект.Дата;
	ПараметрыЗаполненияСчета.Включать105 = Ложь;
	ПараметрыЗаполненияСчета.Включать108 = Истина;
	ПараметрыЗаполненияСчета.ТолькоБалансовые = Истина;
	ПараметрыЗаполненияСчета.ТолькоБалансовыеИК = ВидПоступленияТолькоСчета108(Объект.ВидПоступления);
	ПараметрыЗаполненияСчета.Включать106ИК = Не ВидПоступленияТолькоСчета108(Объект.ВидПоступления);
	ПараметрыЗаполненияСчета.СписокВыбора = Элементы.СчетУчета.СписокВыбора;
	УправлениеМатериальнымиЗапасамиФормы.ЗаполнитьДанныеСчетовУчетаМЗВФорме(ЭтотОбъект, ПараметрыЗаполненияСчета,
		ДанныеСчетовВФорме);
	
	ДополнительныеСубконтоСчетов = Новый ФиксированноеСоответствие(ПараметрыЗаполненияСчета.ВидыСубконтоСчетов);
	ЗаполнитьКЭШПараметровФормыЛокальныеСчета();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКЭШПараметровФормыЛокальныеСчета()
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСчетов = Объект.Дата;
	Иначе
		ДатаСчетов = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	ИспользуемыеСчета = Новый Соответствие;
	ИспользуемыеСчета.Вставить("108.00", "Счет108");
	ИспользуемыеСчета.Вставить("108.56", "Счет10856");
	ИспользуемыеСчета.Вставить("106.50", "Счет106");
	ИспользуемыеСчета.Вставить("106.56", "Счет10656");
	ИспользуемыеСчета.Вставить("25", "Счет25");
	ИспользуемыеСчета.Вставить("26", "Счет26");
	
	КодыСчетов = Новый Массив;
	Для Каждого ИспользуемыйСчет Из ИспользуемыеСчета Цикл
		КодыСчетов.Добавить(ИспользуемыйСчет.Ключ);
	КонецЦикла;
	
	СписокСчетов = БухгалтерскийУчет.СписокСчетов(СтрСоединить(КодыСчетов, ","), ДатаСчетов, Истина,
		Объект.Организация);
		
	Для Каждого ПолученныйСчет Из СписокСчетов Цикл
		КлючСчета = ИспользуемыеСчета.Получить(Строка(ПолученныйСчет));
		Если КлючСчета <> Неопределено Тогда
			ЭтотОбъект.КэшПараметров.Локальные.Вставить(КлючСчета, ПолученныйСчет);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВидПоступленияТолькоСчета108(ВидПоступления)
	
	Возврат ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗИК.ВозвратИзАренды")
		Или ВидПоступления =ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗИК.ВозвратИзБезвПользования");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьОтветственныеЛица()
	ДатаДокумента = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ОбщегоНазначения.ТекущаяДатаПользователя());
	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
		ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"),
		Объект.Организация, ДатаДокумента, Объект.Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
		И Объект.Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Объект.Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОбИзмененииСчетаУчета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Объект.СчетУчета = ЭтотОбъект.КэшПараметров.Локальные.СчетУчета;
		Возврат;
	КонецЕсли;
	
	СчетУчетаПриИзмененииНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзмененииНаКлиенте()

	СчетУчетаПриИзмененииНаСервере();
	УстановитьВидимостьВидаПользования(ЭтотОбъект);
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СчетУчетаПриИзмененииНаСервере()
	
	УстановитьСчетУчетаВТаблицеМатериалы();
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетУчетаВШапке()
	
	УстановитьСчет108 = ВидПоступленияТолькоСчета108(Объект.ВидПоступления)
		И Не УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(ЭтотОбъект)
		И Не УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
	
	Если УстановитьСчет108 Тогда
		Объект.СчетУчета = ЭтотОбъект.КэшПараметров.Локальные.Счет108;
		УстановитьСчетУчетаВТаблицеМатериалы();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьСчетУчетаВТаблицеМатериалы()

	СчетУчета = СчетУчетаДляЗаполненияВСтроке();
	Если Не ЗначениеЗаполнено(СчетУчета) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из Объект.Материалы Цикл
		Строка.СчетУчета = СчетУчета;
	КонецЦикла;
	
	УстановитьДанныеДинамическихКолонокТаблицыМатериалы();
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);

КонецПроцедуры // УстановитьСчетУчетаВТаблицеМатериалы()

&НаСервере
Функция СчетУчетаДляЗаполненияВСтроке()
	Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект) Тогда
		Возврат ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет10656");
	ИначеЕсли УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(ЭтотОбъект) Тогда
		Возврат ОбщегоНазначенияБГУКлиентСервер.СвойствоЛокальногоКэшаФормы(ЭтотОбъект, "Счет10856");
	Иначе
		Возврат Объект.СчетУчета;
	КонецЕсли;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокЗакладкиВозвратИзАренды(Форма)
	Если ЭтоВозвратИзПользования(Форма.Объект.ВидПоступления) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаВозвратИзАренды",
			"Заголовок", Форма.Объект.ВидПоступления);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	
	УстановитьВидимостьЭлементовФормы_ОснованиеДляАкта(Форма);
	УстановитьВидимостьЭлементовФормы_Комиссия(Форма);
	УстановитьВидимостьВидаПользования(Форма);
	УстановитьВидимостьЭлементовФормы_ДокументПоставщика(Форма);
	УстановитьВидимостьЭлементовФормы_ЦМОПриВозврате(Форма);
	УстановитьВидимостьЭлементов_ПоступлениеОтПоставщика(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ОснованиеДляАкта(Форма)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ОснованиеДляАкта");
	ИменаЭлементов.Добавить("НомерОснованияДляАкта");
	ИменаЭлементов.Добавить("ДатаОснованияДляАкта");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", ЭтоАктОПриемеПередаче0510448(Форма));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_Комиссия(Форма)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Комиссия");
	ИменаЭлементов.Добавить("СоставКомиссии");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", ЭтоАктОПриемеПередаче0510448(Форма));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ДокументПоставщика(Форма)

	Видимость = Не ЭтоАктОПриемеПередаче0510448(Форма)
		Или Форма.Объект.НФАПереданыЭлектроннымАктом;

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ВидПервичногоДокумента");
	ИменаЭлементов.Добавить("НомерПервичногоДокумента");
	ИменаЭлементов.Добавить("ДатаПервичногоДокумента");
	ИменаЭлементов.Добавить("ДатаПодписанияПервичногоДокумента");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов, "Видимость", Видимость);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы_ЦМОПриВозврате(Форма)
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ЦМОПриВозврате");
	ИменаЭлементов.Добавить("ПодразделениеПриВозврате");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", ЭтоВозвратИзПользования(Форма.Объект.ВидПоступления));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов_ПоступлениеОтПоставщика(Форма)
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("СчетРасчетов");
	ИменаЭлементов.Добавить("КПСРасчетов");
	ИменаЭлементов.Добавить("СпособЗачетаАванса");
	ИменаЭлементов.Добавить("ЗачетАванса");
	ИменаЭлементов.Добавить("СтраницаДенежныеОбязательства");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов, "Видимость",
		Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗИК.ПоступлениеОтПоставщика"));
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьВидаПользования(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ВидБезвозмездногоПользования",
		"Видимость",
		Форма.Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗИК.ВозвратИзБезвПользования"));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоАктОПриемеПередаче0510448(Форма)
	Возврат ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(Форма.Объект.ПервичныйДокумент,
		"АктПриемаПередачи0510448");
КонецФункции

&НаСервере
Процедура УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ДанныеСчетовВФорме = Неопределено)
	ПараметрыЗаполненияКолонок = УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки_Параметры(
		ЭтотОбъект, Объект);
	ПараметрыЗаполненияКолонок.Включать106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
	ПараметрыЗаполненияКолонок.ДанныеСчетов = ДанныеСчетовВФорме;
	УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки(ПараметрыЗаполненияКолонок);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНоменклатурыВСтроке(ИмяТаблицы, ИдентификаторСтроки, Знач ЗаполнятьСчет)
	
	Если ЗабалансовыеСчетаМЗ.НайтиПоЗначению(Объект.СчетУчета) <> Неопределено Тогда
		ЗаполнятьСчет = Ложь;
	КонецЕсли;
	
	ТекущиеДанные = Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтруктураДанных = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Номенклатура,
		"ЕдиницаИзмерения");
	ТекущиеДанные.ЕдиницаИзмерения = СтруктураДанных.ЕдиницаИзмерения;
	
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, ТекущиеДанные, ЗаполнятьСчет);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСчетаВСтроке(Форма, Строка, ЗаполнятьСчет)
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Форма, Строка);
	ПараметрыОбработки.ЗаполнятьСчет = ЗаполнятьСчет;
	ПараметрыОбработки.ДтКт          = "Дт";
	ПараметрыОбработки.Включать105   = Ложь;
	ПараметрыОбработки.Включать108   = Истина;
	ПараметрыОбработки.Включать106ИК   = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(Форма);
	ПараметрыОбработки.ТолькоБалансовыеИК = Ложь;
	ПараметрыОбработки.ВШапке106 = ПараметрыОбработки.Включать106ИК;
	ПараметрыОбработки.ВШапке108 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(Форма);
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(Строка, ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИзмененияСчетовУчета(Форма, Объект)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СчетУчета",
		"Доступность", НЕ ВидПоступленияТолькоСчета108(Объект.ВидПоступления));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперации()
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры


&НаСервере
Процедура УстановитьУсловноеОформление()

	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериалов(ЭтотОбъект);
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Материалы.КПС", ,
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.Материалы.УчетПоКПС", Истина,
		ВидСравненияКомпоновкиДанных.Равно);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Задано в типовой операции'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Метаданные.ЭлементыСтиля.ТекстЗапрещеннойЯчейкиЦвет.Значение);
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("МатериалыКПС");
	Поле.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеЧленовКомиссии()
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Элемент.Отбор, "Объект.СоставКомиссии.Отсутствует", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Поле = Элемент.Поля.Элементы.Добавить();
	Поле.Поле = Новый ПолеКомпоновкиДанных("СоставКомиссииПричинаОтсутствия");
	Поле.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ВидимостьЭлементовЭДОДляДокумента()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	ДанныеСчетовВФорме = Неопределено;
	ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме);
	УстановитьДоступностьСвязанныхРеквизитовОрганизации(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	ЭтотОбъект.КЭШПараметров.Локальные.Вставить("КЭК346", БухгалтерскийУчетПовтИсп.КЭКПоКоду("346"));
	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ДанныеСчетовВФорме);
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	УчетРасчетовКлиентСервер.УправлениеЭлементамиЗачетаАвансов(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьФлагОтразитьВМежотчетномПериоде(ЭтотОбъект);
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьФлагаОтразитьВМежотчетномПериоде(ЭтотОбъект, "Видимость");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоВозвратИзПользования(ВидПоступления)

	Возврат ВидПоступления = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗИК.ВозвратИзАренды")
		ИЛИ ВидПоступления = ПредопределенноеЗначение(
		"Перечисление.ВидыПоступленийМЗИК.ВозвратИзБезвПользования");
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхРеквизитовОрганизации(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Подразделение",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры // УстановитьДоступностьСвязанныхРеквизитовОрганизации()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация) И ЗначениеЗаполнено(Форма.Объект.Контрагент));

КонецПроцедуры // УстановитьДоступностьДоговора()

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()

	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Тара"));
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",	Объект.СчетУчета);
	Если УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(ЭтотОбъект)
		Или УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект) Тогда
		ПараметрыПодбора.Вставить("ПоказыватьСчетУчета",	Истина);
	КонецЕсли;

	ПараметрыПодбора.Вставить("Подразделение",				Объект.Подразделение);
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",			ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ЕстьЦена",					Истина);
	ПараметрыПодбора.Вставить("ВыводитьНулевуюНоменклатуру",Истина);
	ПараметрыПодбора.Вставить("ИмяТаблицы",					"Материалы");
	ПараметрыПодбора.Вставить("ПоказыватьЦены",				Истина);

	Если ЭтоВозвратИзПользования(Объект.ВидПоступления) Тогда
		ПараметрыПодбора.Вставить("ПоказыватьОстатки",				Истина);
		ПараметрыПодбора.Вставить("ПроверятьОстаткиВПользовании",	Истина);
		ПараметрыПодбора.Вставить("КонтрагентОстатковВПользовании",	Объект.Контрагент);
		Если ЗначениеЗаполнено(Объект.ЦМОПриВозврате) Тогда
			ПараметрыПодбора.Вставить("ЦМО", Объект.ЦМОПриВозврате);
			ПараметрыПодбора.Вставить("Подразделение", Объект.ПодразделениеПриВозврате);
		Иначе
			ПараметрыПодбора.Вставить("ЦМО", Объект.ЦМО);
			ПараметрыПодбора.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		Если Объект.ВидПоступления = ПредопределенноеЗначение("Перечисление.ВидыПоступленийМЗИК.ВозвратИзАренды") Тогда
			ПараметрыПодбора.Вставить("СчетОстатковВПользовании", ЭтотОбъект.КэшПараметров.Локальные.Счет25);
		ИначеЕсли Объект.ВидПоступления = ПредопределенноеЗначение(
			"Перечисление.ВидыПоступленийМЗИК.ВозвратИзБезвПользования") Тогда
			ПараметрыПодбора.Вставить("СчетОстатковВПользовании", ЭтотОбъект.КэшПараметров.Локальные.Счет26);
			ПараметрыПодбора.Вставить("ВидБезвозмездногоПользования", Объект.ВидБезвозмездногоПользования);
			ПараметрыПодбора.Вставить("ИспользоватьВидБезвозмездногоПользования", Истина);
		КонецЕсли;
	КонецЕсли;
	Возврат ПараметрыПодбора;
	
КонецФункции

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение)
	ПоступлениеНаСчет106 = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(ЭтотОбъект);
	УстановитьСчетУчетаИзШапки = НЕ УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен108(ЭтотОбъект)
		И Не ПоступлениеНаСчет106;
	СписокПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	Для Каждого ЭлементПодбора Из СписокПодбора Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ЭлементПодбора);			
		Если УстановитьСчетУчетаИзШапки Тогда
			НоваяСтрока.СчетУчета = Объект.СчетУчета;
		ИначеЕсли ПоступлениеНаСчет106
			Или ВсеСчета108.НайтиПоЗначению(НоваяСтрока.СчетУчета) = Неопределено Тогда
			// Из подбора возвращаеся счет 108.хх. Его нужно заменить на 106.хх
			НоваяСтрока.СчетУчета = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		КонецЕсли;
		ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, НоваяСтрока, НЕ ЗначениеЗаполнено(НоваяСтрока.СчетУчета));
        НоваяСтрока.КоличествоМест = 1;
		НоваяСтрока.Коэффициент    = 1;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтветственного()
	Объект.ОтветственныйИсполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(
		Объект.Ответственный, Объект.Организация, "Документ.ПоступлениеИК");
	ЗаполнитьОтветственныеЛица();	

КонецПроцедуры

#Область УчетДрагМатериалов

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитовДМ() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыДобавленияДМ(ПараметрыПодбора) Экспорт
	Если (Объект.ДрагоценныеМатериалы.Количество() > 0) И(ПараметрыПодбора.ВариантВводаДанных < 2) Тогда
		ПараметрыПодбора.Вставить("АдресДМВХранилище", ПоместитьДМВХранилище(ПараметрыПодбора));
	Иначе	
		ПараметрыПодбора.Вставить("АдресДМВХранилище", "");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДМВХранилище(ПараметрыПодбора)
	
	МассивСтрок = ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора);

	ТаблицаНФА = Объект.ДрагоценныеМатериалы.Выгрузить(МассивСтрок, "ОбъектНФА, ВидДрагМатериала, МассаДМ, КоличествоДМ, ЧистаяМасса, ЛигатурнаяМасса, ЕдИзм");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНФА);

КонецФункции

&НаСервере
Функция ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ПараметрыПодбора.ОбъектНФА);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);   	
	
	Возврат НайденныеСтроки;
КонецФункции	

&НаСервере
Процедура ОбработкаДобавленияДМДляОбъектаНаСервере(Знач ВыбранноеЗначение)
	
	УчетДрагМатериалов.ОбработатьДобавлениеДМДляОбъекта(
		Объект.ДрагоценныеМатериалы, ВыбранноеЗначение, , "ОбъектНФА,ВидДрагМатериала");
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	Для каждого ТекСтрока Из Объект.ДрагоценныеМатериалы Цикл
		ТекСтрока.КлючСтроки = УчетДрагМатериаловКлиент.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА, "");
	КонецЦикла;
	
КонецПроцедуры	
	
&НаСервере
Процедура ЗаполнитьОбъектыСДрагМатериалами()
	ТаблицаВсехОбъектов = Объект.Материалы.Выгрузить(,"Номенклатура, Количество");
	
	ТаблицаОбъектовМЗ = Новый ТаблицаЗначений;
	ТаблицаОбъектовМЗ.Колонки.Добавить("КлючСтроки",Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовМЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОбъектовМЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	
	НеСодержатДрагМатериалы = УчетДрагМатериалов.ПолучитьМассивТиповНоменклатурыБезДрагМатериалов();
	
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Если НеСодержатДрагМатериалы.Найти(ТекСтрока.Номенклатура.ТипНоменклатуры) = Неопределено Тогда
				НоваяСтрока = ТаблицаОбъектовМЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.КлючСтроки = УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.Номенклатура, ""); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	ОбъектыНФАСДрагМатериалами.Загрузить(ТаблицаОбъектовМЗ);
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьВидимостьДанныхДрагМатериалов()
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Истина;
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
		
		Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные <> Неопределено Тогда
			ОтборДрагМатериаловДляОбъекта(Элементы.СписокНФАДокументаОснования.ТекущиеДанные.КлючСтроки);
		КонецЕсли;
	Иначе
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Ложь;
		Элементы.ДрагоценныеМатериалы.ОтборСтрок = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДрагМатериаловДляОбъекта(КлючСтроки)
	
	Элементы.ДрагоценныеМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки",КлючСтроки));
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКлючиСтрокДрагМатериалов()
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Функция ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = Новый ТаблицаЗначений;
	ТаблицаНФА.Колонки.Добавить("ОбъектНФА", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНФА.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаНФА.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого ИдСтроки Из ВыделенныеСтрокиТЧ Цикл
		СтрокаТЧ = ОбъектыНФАСДрагМатериалами.НайтиПоИдентификатору(ИдСтроки);
		НоваяСтрока = ТаблицаНФА.Добавить();
		НоваяСтрока.ОбъектНФА = СтрокаТЧ.Номенклатура;
		НоваяСтрока.Количество = СтрокаТЧ.Количество;
	КонецЦикла;
	
	Возврат ТаблицаНФА;
	
КонецФункции	

&НаСервере
Функция ПоместитьТаблицуОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ);
	ТаблицаДМ = ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтрокиТЧ); 
	
	Массив = Новый Массив;
	Массив.Добавить(ТаблицаНФА);
	Массив.Добавить(ТаблицаДМ);
	
	Возврат ПоместитьВоВременноеХранилище(Массив);

КонецФункции

&НаСервере
Функция ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтроки) 
	ВыбранныеНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтроки);
	
	ТаблицаДМ = Объект.ДрагоценныеМатериалы.Выгрузить();
	ТаблицаДМ.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	
	Результат = УчетДрагМатериалов.ЕдиныйСписокДрагМатериаловДляНесколькихОбъектовНФА(ТаблицаДМ, ВыбранныеНФА);
	
	Возврат Результат;
КонецФункции	

&НаКлиенте
Процедура ПослеЗакрытияВопросаОДрагМатериалах(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ДополнительныеПараметры.НайденныеСтроки Цикл
		Объект.ДрагоценныеМатериалы.Удалить(ТекСтрока);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА()
	Элемент = Элементы.СписокНФАДокументаОснования;
	ОтборДрагМатериаловДляОбъекта(Элемент.ТекущиеДанные.КлючСтроки);
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448)
	
	Если ВидимостьЭлементовЭДОДляЭДПоставщика Тогда
		ВидимостьЭлементовЭДО = Истина;
		Форма.Элементы.ДекорацияСостояниеЭДО.Заголовок = НСтр("ru='Отражение ЭД в учете'");
	Конецесли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО);

	Если ВидимостьЭлементовЭДОАкта448 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"СтраницаКомиссия", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"Комиссия", "Видимость", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"СоставКомиссии", "Видимость", Истина);
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НадписьДопСведенияЭлектронногоАктаПоФорме0510448", "Видимость", ВидимостьЭлементовЭДОАкта448);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи", "Видимость", ВидимостьЭлементовЭДОАкта448);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию(ДокументОснование)

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
		Если (Объект.Материалы.Количество() > 0) Тогда
			Возврат;
		КонецЕсли;	

		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗаполнитьПоЭлектронномуДокументуПоставщика(ДокументОснование);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоДокументуОснованию()

&НаСервере
Функция ВидимостьЭлементовЭДОАкта448()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений = "")
	ЭлектронныеДокументыБГУ.ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, ТекстСведений);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ДанныеДляАкта)
	КоличествоФайлов = ДанныеДляАкта.КоличествоФайлов;
	
	ТекстСведений = ЭлектронныеДокументыБГУКлиент.ТекстПриложеноФайлов(КоличествоФайлов);

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи()

	УправлениеНФА.ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи(Объект, ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи);
	
КонецПроцедуры

&НаСервере
Функция НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448()
	Возврат ЭлектронныеДокументыБГУ.НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
КонецФункции

&НаКлиенте
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте()
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере()
	ЭлектронныеДокументыБГУ.ЗаполнитьСостояниеЭДОАктаПоФорме0510448(Объект.Ссылка, Элементы.ДекорацияСостояниеЭДОАкты);
	Если Элементы.ДекорацияСостояниеЭДОАкты.Заголовок = "Не начат" Тогда
		ВидимостьЭДОАктами = Ложь;
	Иначе		
		ВидимостьЭДОАктами = Истина;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСостояниеЭДОБГУ", "Видимость", ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияЭДОУПД", "Видимость", НЕ ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", НЕ ВидимостьЭДОАктами);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства  

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
