
//////////////////////////////////////////////////////////////
//
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Период") Тогда
		ЗаполнитьЗначенияСвойств(Период, Параметры.Период);
		ОтобратьДокументы();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВариантОбработки) Тогда
		Объект.ВариантОбработки = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Период) Тогда
		Объект.ВариантОбработки = 1;
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
КонецПроцедуры


#Область ОбработчикиОповещений

&НаКлиенте
Процедура ВопросПередУдалениемСтрок(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Строки = Неопределено;
		ДопПараметры.Свойство("Строки", Строки);
		
		МассивСтрок = Новый Массив;
		
		Для Каждого Стр Из Строки Цикл
			МассивСтрок.Добавить(Элементы.СписокДокументов.ДанныеСтроки(Стр));
		КонецЦикла;
		
		Для Каждого Стр Из МассивСтрок Цикл
			СписокДокументов.Удалить(Стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


//////////////////////////////////////////////////////////////
//
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВариантОбработкиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов();
	СписокДокументов.Очистить();
	
	Если Объект.ВариантОбработки = 1 Тогда
		ОтобратьДокументы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		СтандартнаяОбработка = Ложь;
		
		Для Каждого Документ Из ВыбранноеЗначение Цикл
			ИДСтроки = Неопределено;
			
			Если ДокументВСписке(Документ, ИДСтроки) Тогда
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В списке уже есть документ ""%1""!'"), Документ);
				Поле = "СписокДокументов[" + СписокДокументов.Индекс(СписокДокументов.НайтиПоИдентификатору(ИДСтроки)) + "]";
				ПутьКДанным = "СписокДокументов";
		
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Поле, ПутьКДанным);
				
				Продолжить;
			КонецЕсли;
			
			Стр = СписокДокументов.Добавить();
			Стр.Ссылка = Документ;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовСсылкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ИДСтроки = Неопределено;
	
	Если ДокументВСписке(ВыбранноеЗначение, ИДСтроки) Тогда
		СтандартнаяОбработка = Ложь;
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В списке уже есть документ ""%1""!'"), ВыбранноеЗначение);
		Поле = "СписокДокументов[" + СписокДокументов.Индекс(СписокДокументов.НайтиПоИдентификатору(ИДСтроки)) + "]";
		ПутьКДанным = "СписокДокументов";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Поле, ПутьКДанным);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	
	КоличествоДокументов = Элемент.ВыделенныеСтроки.Количество();
	ТекущийДокумент = Элемент.ТекущиеДанные;
	
	Если КоличествоДокументов > 1 Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить из списка выделенные документы (%1 шт.)?'"), КоличествоДокументов);
	ИначеЕсли КоличествоДокументов = 1 Тогда
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Удалить из списка документ ""%1""?'"), ТекущийДокумент.Ссылка);
	Иначе
		ТекстСообщения = НСтр("ru='В списке не выбран ни один документ!'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Элементы.СписокДокументов);
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Строки", Элемент.ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ВопросПередУдалениемСтрок", ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОтобратьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	ОтобратьДокументы();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	ОтобратьДокументы();
КонецПроцедуры


//////////////////////////////////////////////////////////////
//
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	Если СписокДокументов.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Не выбраны документы для обработки!'");
		Поле = "СписокДокументов";
		//ПутьКДанным = "СписокДокументов";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Поле);
		
		Возврат;
	КонецЕсли;
	
	Адрес = Неопределено;
	
	Попытка
		ОбработатьДокументы(Адрес);
		
		Если ЗначениеЗаполнено(Адрес) Тогда
			Адрес = СформироватьИВывестиОтчет(Адрес);
			
			Если Адрес <> Неопределено Тогда
				Оповещение = Новый ОписаниеОповещения("ОбработкаЗаконченаОповещение", ЭтотОбъект, Адрес);
				ПоказатьВопрос(Оповещение, НСтр("ru='Перепроведение завершено. Вывести отчет об измененных документах?'"), РежимДиалогаВопрос.ДаНет);
			КонецЕсли;
		КонецЕсли;
	Исключение
		ТекстСообщения = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ПоказатьПредупреждение(Неопределено, 
								НСтр("ru='Перепроведение не выполнено по причине:
											|'") + ТекстСообщения);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаконченаОповещение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Изменения в документах ""Переоценка валютных остатков""'"));
		ПараметрыФормы.Вставить("АдресДокумента", ДопПараметры);

		ОткрытьФорму("ОбщаяФорма.ФормаПросмотраТабличногоДокумента", ПараметрыФормы);
	КонецЕсли;
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПодборДокументов(Команда)
	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Документ.ПереоценкаВалютныхОстатков.ФормаВыбора", ПараметрыФормы, Элементы.СписокДокументов);
КонецПроцедуры


//////////////////////////////////////////////////////////////
//
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	Элементы.ГруппаЗаПериод.Видимость = (Объект.ВариантОбработки = 1);
	Элементы.СписокДокументов.ТолькоПросмотр = (Объект.ВариантОбработки = 1);
	
	Элементы.СписокДокументов.ПоложениеКоманднойПанели = ?((Объект.ВариантОбработки = 1), ПоложениеКоманднойПанелиЭлементаФормы.Нет, ПоложениеКоманднойПанелиЭлементаФормы.Авто);
КонецПроцедуры

&НаСервере
Процедура ОтобратьДокументы()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	0 КАК Картинка,
	               |	ПереоценкаВалютныхОстатков.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПереоценкаВалютныхОстатков КАК ПереоценкаВалютныхОстатков
	               |ГДЕ
	               |	&УсловиеПериодОтбора
	               |	И ПереоценкаВалютныхОстатков.Проведен
	               |	И Не ПереоценкаВалютныхОстатков.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПереоценкаВалютныхОстатков.Дата,
	               |	ПереоценкаВалютныхОстатков.Номер";
				   
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПериодОтбора", "ПереоценкаВалютныхОстатков.Дата МЕЖДУ &Дата1 И &Дата2");
	ИначеЕсли ЗначениеЗаполнено(Период.ДатаНачала) И (Не ЗначениеЗаполнено(Период.ДатаОкончания)) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПериодОтбора", "ПереоценкаВалютныхОстатков.Дата >= &Дата1");
	ИначеЕсли (Не ЗначениеЗаполнено(Период.ДатаНачала)) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПериодОтбора", "ПереоценкаВалютныхОстатков.Дата <= &Дата2");
	КонецЕсли;
				   
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(Результат, "СписокДокументов");
	Иначе
		СписокДокументов.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ДокументВСписке(Документ, ИДСтроки = Неопределено)
	Результат = Ложь;
	
	Строки = СписокДокументов.НайтиСтроки(Новый Структура("Ссылка", Документ));
	
	Если Строки.Количество() > 0 Тогда
		ИДСтроки = Строки[0].ПолучитьИдентификатор();
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

&НаСервере
Функция ПолучитьСписок()
	ТекстЗапроса = "ВЫБРАТЬ
					|	ПереоценкаВалютныхОстатков.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.ПереоценкаВалютныхОстатков КАК ПереоценкаВалютныхОстатков
					|ГДЕ
					|	ПереоценкаВалютныхОстатков.Ссылка В(&СписокДокументов)";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов.Выгрузить(, "Ссылка").ВыгрузитьКолонку("Ссылка"));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбработатьДокументы(Адрес = Неопределено)
	
	ТабОтчет = СоздатьТаблицуЗначений();
	
	НачатьТранзакцию();
	
	Попытка
		
		Список = ПолучитьСписок();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Документ.ПереоценкаВалютныхОстатков");
		ЭлементБлокировки.ИсточникДанных = Список;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Ссылка", "Ссылка");
		Блокировка.Заблокировать();
		
		Для Каждого ДокСсылка Из Список Цикл
			ДокОбъект = ДокСсылка.Ссылка.ПолучитьОбъект();
			
			СкопироватьСтроки(ТабОтчет, ДокОбъект.ТаблицаПереоценки.Выгрузить(, "Валюта, КурсоваяРазница"), ДокОбъект.Ссылка, "До");
			
			Документы.ПереоценкаВалютныхОстатков.СформироватьДанныеДляПереоценки(ДокОбъект);
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			СкопироватьСтроки(ТабОтчет, ДокОбъект.ТаблицаПереоценки.Выгрузить(, "Валюта, КурсоваяРазница"), ДокОбъект.Ссылка, "После");
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Перепроведение документов переоценки валюты'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	ТабОтчет = ПодготовитьТаблицуОтчета(ТабОтчет);
	Адрес = ПоместитьВоВременноеХранилище(ТабОтчет, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция СоздатьТаблицуЗначений()
	Результат = Новый ТаблицаЗначений;
	
	Результат.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.ПереоценкаВалютныхОстатков"));
	Результат.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Результат.Колонки.Добавить("КурсоваяРазницаДо", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18,2));
	Результат.Колонки.Добавить("КурсоваяРазницаПосле", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18,2));
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура СкопироватьСтроки(ТабПриемник, ТабИсточник, Ссылка, МоментВремени)
	ТабИсточник.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.ПереоценкаВалютныхОстатков"));
	ТабИсточник.Колонки.КурсоваяРазница.Имя = "КурсоваяРазница" + МоментВремени;
	ТабИсточник.ЗаполнитьЗначения(Ссылка, "Документ");
	
	Для Каждого Строка Из ТабИсточник Цикл
		Стр = ТабПриемник.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Строка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПодготовитьТаблицуОтчета(ТабОтчет)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабОтчет.Документ КАК Документ,
	               |	ТабОтчет.Валюта КАК Валюта,
	               |	ТабОтчет.КурсоваяРазницаДо КАК КурсоваяРазницаДо,
	               |	ТабОтчет.КурсоваяРазницаПосле КАК КурсоваяРазницаПосле
	               |ПОМЕСТИТЬ втТабОтчет
	               |ИЗ
	               |	&ТабОтчет КАК ТабОтчет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТабОтчет.Документ КАК Документ,
	               |	втТабОтчет.Валюта КАК Валюта,
	               |	СУММА(втТабОтчет.КурсоваяРазницаДо) КАК КурсоваяРазницаДо,
	               |	СУММА(втТабОтчет.КурсоваяРазницаПосле) КАК КурсоваяРазницаПосле
	               |ИЗ
	               |	втТабОтчет КАК втТабОтчет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТабОтчет.Документ,
	               |	втТабОтчет.Валюта
	               |
	               |ИМЕЮЩИЕ
	               |	СУММА(втТабОтчет.КурсоваяРазницаДо) <> СУММА(втТабОтчет.КурсоваяРазницаПосле)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	втТабОтчет.Документ,
	               |	втТабОтчет.Валюта";
				   
	Запрос.УстановитьПараметр("ТабОтчет", ТабОтчет);			   
				   
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция СформироватьИВывестиОтчет(Адрес)
	ТабОтчет = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ТипЗнч(ТабОтчет) <> Тип("ТаблицаЗначений")
		Или ТабОтчет.Количество() = 0 Тогда
		
		Сообщение = НСтр("ru='Изменения в документах отсутствуют.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		
		Возврат Неопределено;
	КонецЕсли;
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Строка = Макет.ПолучитьОбласть("Строка");
	Документ = Макет.ПолучитьОбласть("Группировка");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.РазмерСтраницы = "A4";
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ГРУППОВОЕ_ПЕРЕПРОВЕДЕНИЕ_ПЕРЕОЦЕНКИ_ВАЛЮТЫ";
	
	ТабДокумент.Вывести(Шапка);
	
	ТекДок = Документы.ПереоценкаВалютныхОстатков.ПустаяСсылка();
	
	Для Каждого Стр Из ТабОтчет Цикл
		Если ТекДок <> Стр.Документ Тогда
			Документ.Параметры.Документ = Стр.Документ;
			ТабДокумент.Вывести(Документ);
			
			ТекДок = Стр.Документ;
			
			ЗаполнитьЗначенияСвойств(Строка.Параметры, Стр);
			ТабДокумент.Вывести(Строка);
			
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Строка.Параметры, Стр);
		ТабДокумент.Вывести(Строка);
	КонецЦикла;
	
	ТабДокумент.Вывести(Подвал);
	
	Возврат ПоместитьВоВременноеХранилище(ТабДокумент, ЭтаФорма.УникальныйИдентификатор);
КонецФункции