#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	НеАктуален = Ложь;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеДублей();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеДублей()
	
	Если ЭтотОбъект.ЭтоГруппа Или ЭтотОбъект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.НеАктуален Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	ЗапросПоиск.УстановитьПараметр("Сотрудник", ЭтотОбъект.Сотрудник);
	ЗапросПоиск.УстановитьПараметр("МестоХранения", ЭтотОбъект.МестоХранения);
	ЗапросПоиск.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЦМО.Ссылка КАК Ссылка,
	|	ЦМО.Код КАК Код
	|ИЗ
	|	Справочник.ЦМО КАК ЦМО
	|ГДЕ
	|	НЕ ПометкаУдаления
	|	И НЕ ЭтоГруппа
	|	И НЕ ЕСТЬNULL(НеАктуален, ЛОЖЬ) 
	|	И ЦМО.Ссылка <> &Ссылка
	|	И ЦМО.Сотрудник = &Сотрудник
	|	И ЦМО.МестоХранения = &МестоХранения";
	
	РезультатЗапроса = ЗапросПоиск.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	ТекстСообщения = СтрШаблон(
		НСтр("ru='Справочно: Найден дубль ЦМО по сотруднику и месту хранения (код %1).'"),
		Выборка.Код);
		
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
