
#Область СлужебныеПроцедурыИФункции

Процедура ПриДобавленииКлассификаторов(Классификаторы) Экспорт
	
	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описатель.Наименование           = НСтр("ru = 'Общероссийский классификатор основных фондов'");
	Описатель.Идентификатор          = "RussianClassificationOfFixedAssets";
	Описатель.ОбновлятьАвтоматически = Истина;
	Описатель.ОбщиеДанные            = Истина;
	Классификаторы.Добавить(Описатель);
	
	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описатель.Наименование           = НСтр("ru = 'Общероссийский классификатор продукции по видам экономической деятельности'");
	Описатель.Идентификатор          = "ProductsByEconomicActivities";
	Описатель.ОбновлятьАвтоматически = Истина;
	Описатель.ОбщиеДанные            = Истина;
	Классификаторы.Добавить(Описатель);
	
	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описатель.Наименование           = НСтр("ru = 'Бюджетная классификация'");
	Описатель.Идентификатор          = "BudgetaryClassification";
	Описатель.СохранятьФайлВКэш		 = Истина;
	Описатель.ОбновлятьАвтоматически = Ложь;
	Описатель.ОбщиеДанные            = Ложь;
	Классификаторы.Добавить(Описатель);
	
	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описатель.Наименование           = НСтр("ru = 'Единый кодификатор предметов снабжения для федеральных государственных нужд'");
	Описатель.Идентификатор          = "UnifiedCodifierOfSupplies";
	Описатель.ОбновлятьАвтоматически = Истина;
	Описатель.ОбщиеДанные            = Истина;
	Классификаторы.Добавить(Описатель); 
	
	Описатель = РаботаСКлассификаторами.ОписаниеКлассификатора();
	Описатель.Наименование           = НСтр("ru = 'Общероссийский классификатор организационно-правовых форм (ОКОПФ)'");
	Описатель.Идентификатор          = "OKOPF";
	Описатель.ОбновлятьАвтоматически = Истина;
	Описатель.ОбщиеДанные            = Истина;
	Классификаторы.Добавить(Описатель);

	
	КлассификаторКТРУ.ПриДобавленииКлассификаторов(Классификаторы);
	КлассификацияМИПоВидам.ПриДобавленииКлассификаторов(Классификаторы);
	
КонецПроцедуры

Процедура ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан) Экспорт
	
	Если Идентификатор = "RussianClassificationOfFixedAssets" Тогда
		
		ОбработкаОКОФ = Обработки.ЗагрузкаКлассификаторовИзФайла.Создать();
		ОбработкаОКОФ.ИдентификаторКлассификатора = "ОКОФ";
		ОбработкаОКОФ.ДобавитьНовыйКлассификатор(Неопределено, Адрес, Неопределено);
		ОбработкаОКОФ.ЗаписатьКлассификаторы(Обработан);
		
	ИначеЕсли Идентификатор = "ProductsByEconomicActivities" Тогда	
		
		ОбработкаОКПД = Обработки.ЗагрузкаКлассификаторовИзФайла.Создать();
		ОбработкаОКПД.ИдентификаторКлассификатора = "ОКПД";
		ОбработкаОКПД.ДобавитьНовыйКлассификатор(Неопределено, Адрес, Неопределено);
		ОбработкаОКПД.ЗаписатьКлассификаторы(Обработан);
		
	ИначеЕсли Идентификатор = "UnifiedCodifierOfSupplies" Тогда	
		
		ОбработкаОКПД = Обработки.ЗагрузкаКлассификаторовИзФайла.Создать();
		ОбработкаОКПД.ИдентификаторКлассификатора = "ЕКПС";
		ОбработкаОКПД.ДобавитьНовыйКлассификатор(Неопределено, Адрес, Неопределено);
		ОбработкаОКПД.ЗаписатьКлассификаторы(Обработан); 
		
	ИначеЕсли Идентификатор = "OKOPF" Тогда	  
		
		Справочники.ОбщероссийскийКлассификаторОрганизационноПравовыхФорм.ПриЗагрузкеКлассификатора( Идентификатор, Версия, Адрес, Обработан);
		
	КонецЕсли;
	
	КлассификаторКТРУ.ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, Неопределено);
	КлассификацияМИПоВидам.ПриЗагрузкеКлассификатора(Идентификатор, Версия, Адрес, Обработан, Неопределено);
	
КонецПроцедуры

Процедура ПриСозанииНаСервереФормыПомощникаЗагрузкиБК(Отказ, Форма) Экспорт
	
	Если Форма.НеВыбиратьФайлы Тогда
		Возврат;
	КонецЕсли;	

	Если ИнтернетПоддержкаПользователей.ДоступноПодключениеИнтернетПоддержки() Тогда
		УстановитьПривилегированныйРежим(Истина);
		БИПДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
		УстановитьПривилегированныйРежим(Ложь);
		Если БИПДанныеАутентификации = Неопределено Тогда
			Возврат; //ИПП не подключена
		КонецЕсли;
	КонецЕсли;
	
	Форма.ЗагружатьИзИнтернета = Истина;
	
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("BudgetaryClassification");
	
	ДоступныеОбновления = РаботаСКлассификаторами.ДоступныеОбновленияКлассификаторов(Идентификаторы);
	
	Если ЗначениеЗаполнено(ДоступныеОбновления.КодОшибки) Тогда
		Форма.СообщениеОбОшибке = Новый ФорматированнаяСтрока(ДоступныеОбновления.СообщениеОбОшибке);
		Форма.Элементы.ЗагрузкаИзИнтернета.ТекущаяСтраница = Форма.Элементы.ЗагрузкаНевозможна;
		Если НЕ ДоступныеОбновления.КодОшибки = "ОбновлениеНеТребуется" Тогда
			СобытияДляЖурналаРегистрации = Новый СписокЗначений;
			СобытияДляЖурналаРегистрации.Добавить(
			Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия",
			"Загрузка БК",
			"Ошибка",
			ДоступныеОбновления.ИнформацияОбОшибке,
			ТекущаяУниверсальнаяДата())
			);
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;	
		
	Форма.ДоступныеВерсииВИнтернете.Очистить();
	Для Каждого НоваяВерсия Из ДоступныеОбновления.ДоступныеВерсии Цикл 
		НовОписание 					= Форма.ДоступныеВерсииВИнтернете.Добавить();
		НовОписание.Пометка 			= Ложь;
		НовОписание.Версия 				= НоваяВерсия.Версия;
		НовОписание.ОписаниеВерсии 		= НоваяВерсия.ОписаниеВерсии;
		НовОписание.Размер 				= НоваяВерсия.Размер;
		НовОписание.ИдентификаторФайла 	= НоваяВерсия.ИдентификаторФайла.ИдентификаторФайла;
	КонецЦикла;
	
	СтрокаОписания = "";
	
	Если Форма.ДоступныеВерсииВИнтернете.Количество() = 0 Тогда
		СтрокаОписания = "Доступных обновлений не обнаружено";
		Форма.СообщениеОбОшибке = Новый ФорматированнаяСтрока(СтрокаОписания);
		Форма.Элементы.ЗагрузкаИзИнтернета.ТекущаяСтраница = Форма.Элементы.ЗагрузкаНевозможна;
		Возврат;
	Иначе	
		Форма.ДоступныеВерсииВИнтернете[0].Пометка = Истина;
		СтрокаОписания = "Версия: " + Формат(Форма.ДоступныеВерсииВИнтернете[0].Версия, "ЧДЦ=") + "
		|Размер: " + Формат(Форма.ДоступныеВерсииВИнтернете[0].Размер, "ЧДЦ=") + "
		|" + Форма.ДоступныеВерсииВИнтернете[0].ОписаниеВерсии;
	КонецЕсли;
	
	Форма.ОписаниеДоступнойВерсии = Новый ФорматированнаяСтрока(СтрокаОписания);
	Форма.ДоступныеВерсииВИнтернете.Сортировать("Версия Убыв");
	Форма.Элементы.ЗагрузкаИзИнтернета.ТекущаяСтраница = Форма.Элементы.ДанныеВИнтернете;
	
	НоваяВерсия = Форма.ДоступныеВерсииВИнтернете[0];

	НайденныеОбновления = РаботаСКлассификаторами.ПолучитьФайлыКлассификаторов(Идентификаторы);
	
	Если ЗначениеЗаполнено(НайденныеОбновления.КодОшибки) Тогда
		СобытияДляЖурналаРегистрации = Новый СписокЗначений;
		СобытияДляЖурналаРегистрации.Добавить(
		Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия",
		"Загрузка БК",
		"Ошибка",
		НайденныеОбновления.ИнформацияОбОшибке,
		ТекущаяУниверсальнаяДата())
		);
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
		Форма.СообщениеОбОшибке = Новый ФорматированнаяСтрока(НайденныеОбновления.СообщениеОбОшибке + НСтр("ru = ' (Подробности см. в журнале регистрации.)'"));
		Форма.Элементы.ЗагрузкаИзИнтернета.ТекущаяСтраница = Форма.Элементы.ЗагрузкаНевозможна;
		
		Возврат;
		
	КонецЕсли;	
	
	Адреса = НайденныеОбновления.ДанныеКлассификаторов.НайтиСтроки(Новый Структура("Версия", Число(НоваяВерсия.Версия)));
	
	Если Адреса.Количество() > 0 Тогда
		НоваяВерсия.Адрес = ПоместитьВоВременноеХранилище(ПолучитьИзВременногоХранилища(Адреса[0].АдресФайла), Форма.УникальныйИдентификатор);
	Иначе
		Форма.Элементы.ЗагрузкаИзИнтернета.ТекущаяСтраница = Форма.Элементы.ЗагрузкаНевозможна;
	КонецЕсли;	
			
КонецПроцедуры	

#КонецОбласти
