
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	ДополнительныеПараметры.Вставить("Объект", Объект);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Для Каждого СтрТЧ Из Объект.Учащиеся Цикл
			СтрТЧ.ИДСтроки = "";
		КонецЦикла;
	КонецЕсли;
	
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "НачалоПериода", "НачалоПериодаСтрокой");
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "КонецПериода", "КонецПериодаСтрокой");
	
	УстановитьВидимостьПоПериодуОплаты();
	УстановитьВидимостьПоПериодуРасчета();
	УстановитьПредупреждение();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьФакультета();
	
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Отказ);
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставление(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	Если ИмяСобытия = "РаботаСоСтудентамиКлиент_ПроизведенВыборПериода" И Источник = ЭтотОбъект Тогда
		ИмяРеквизита = СтрЗаменить(Параметр, "Объект.", "");
		ЗаполнитьРеквизитТЧ(ИмяРеквизита, Объект[ИмяРеквизита]);
		РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, ИмяРеквизита, ИмяРеквизита+"Строкой");
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ИспользоватьОдинПериод Тогда
			
		Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
			
			ТекстОшибки = НСтр("ru='Поле ""Начало периода"" не заполнено!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "НачалоПериодаСтрокой",, Отказ);		
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			
			ТекстОшибки = НСтр("ru='Поле ""Конец периода"" не заполнено!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "КонецПериодаСтрокой",, Отказ);		
			
		КонецЕсли;
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "НачалоПериода", "НачалоПериодаСтрокой");
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "КонецПериода", "КонецПериодаСтрокой");
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьДоступностьФакультета();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОдинПериодПриИзменении(Элемент)
	
	Если НЕ Объект.ИспользоватьОдинПериод Тогда
		
		Объект.НачалоПериода = Неопределено;
		Объект.КонецПериода = Неопределено;
		
		НачалоПериодаСтрокой = "";
		КонецПериодаСтрокой = "";
		
		РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "НачалоПериода", "НачалоПериодаСтрокой");
		РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "КонецПериода", "КонецПериодаСтрокой");
		
	КонецЕсли; 
	
	УстановитьВидимостьПоПериодуРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойПриИзменении(Элемент)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент);
	
	ЗаполнитьРеквизитТЧ("НачалоПериода", Объект.НачалоПериода);
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "НачалоПериода", "НачалоПериодаСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтароеЗначение = Объект.НачалоПериода;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, СтандартнаяОбработка);
	
	Если Объект.НачалоПериода <> СтароеЗначение Тогда
		
		ЗаполнитьРеквизитТЧ("НачалоПериода", Объект.НачалоПериода);	
		РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "НачалоПериода", "НачалоПериодаСтрокой");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка);
	
	ЗаполнитьРеквизитТЧ("НачалоПериода", Объект.НачалоПериода);
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "НачалоПериода", "НачалоПериодаСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "Объект.НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойПриИзменении(Элемент)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент);
	
	ЗаполнитьРеквизитТЧ("КонецПериода", Объект.НачалоПериода);
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "КонецПериода", "КонецПериодаСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтароеЗначение = Объект.КонецПериода;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, СтандартнаяОбработка);
	
	Если Объект.КонецПериода <> СтароеЗначение Тогда
		
		ЗаполнитьРеквизитТЧ("КонецПериода", Объект.КонецПериода);	
		РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "КонецПериода", "КонецПериодаСтрокой");
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка);
	
	ЗаполнитьРеквизитТЧ("КонецПериода", Объект.НачалоПериода);
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "КонецПериода", "КонецПериодаСтрокой");
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);	
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "Объект.КонецПериода", "КонецПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОднуДатуОплатыПриИзменении(Элемент)
	
	Если НЕ Объект.ИспользоватьОднуДатуОплаты Тогда
		
		Объект.ДатаОплаты = Неопределено;
		
	КонецЕсли;
	
	УстановитьВидимостьПоПериодуОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОплатыПриИзменении(Элемент)
	
	ЗаполнитьРеквизитТЧ("ДатаОплаты", Объект.ДатаОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧастиУчащиеся

&НаКлиенте
Процедура УчащиесяПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	
	Если НоваяСтрока Тогда
		
		Если НЕ Копирование Тогда
			
			ТекущаяСтрока.НачалоПериода = Объект.НачалоПериода;
			ТекущаяСтрока.НачалоПериодаСтрокой = РаботаСоСтудентамиКлиентСервер.ПолучитьПредставлениеМесяца(Объект.НачалоПериода);
			ТекущаяСтрока.КонецПериода = Объект.КонецПериода;
			ТекущаяСтрока.КонецПериодаСтрокой = РаботаСоСтудентамиКлиентСервер.ПолучитьПредставлениеМесяца(Объект.КонецПериода);
			
			ТекущаяСтрока.ДатаОплаты = Объект.ДатаОплаты;
			
		Иначе	
			ТекущаяСтрока.ИДСтроки = "";
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяУчащийсяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Учащиеся.ТекущиеДанные;
	
	Отбор = Новый Структура;
	Отбор.Вставить("НаДату", Объект.Дата);
	Если ЗначениеЗаполнено(Объект.Факультет) Тогда
		Отбор.Вставить("Факультет", Объект.Факультет);
	КонецЕсли;
	
	ПараметрыАвтоподстановки = ПараметрыАвтоподстановкиДанныхПоСтуденту(ТекущиеДанные.Учащийся, Отбор);
	
	Если ПараметрыАвтоподстановки.Договоры.Количество() = 1 Тогда
		ТекущиеДанные.ДоговорКонтрагента = ПараметрыАвтоподстановки.Договоры[0]; // Единственный доступный вариант.
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДоговорКонтрагента) И ПараметрыАвтоподстановки.Договоры.Найти(ТекущиеДанные.ДоговорКонтрагента) = Неопределено Тогда
		ТекущиеДанные.ДоговорКонтрагента = Неопределено; // Выбранный договор отсутствует среди доступных.
	КонецЕсли;
	Если ПараметрыАвтоподстановки.Плательщики.Количество() = 1 Тогда
		ТекущиеДанные.Контрагент = ПараметрыАвтоподстановки.Плательщики[0]; // Единственный доступный вариант.
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Контрагент) И ПараметрыАвтоподстановки.Плательщики.Найти(ТекущиеДанные.Контрагент) = Неопределено Тогда
		ТекущиеДанные.Контрагент = Неопределено; // Выбранный контрагент отсутствует среди доступных.
	КонецЕсли;
	
	ТекущиеДанные.АвтоРасчет = Ложь;
	ТекущиеДанные.Сумма = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяКонтрагентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	ТекущаяСтрока.АвтоРасчет = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяДоговорКонтрагентаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	ТекущаяСтрока.АвтоРасчет = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	ТекущаяСтрока.АвтоРасчет = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяНачалоПериодаСтрокойПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "НачалоПериода", "НачалоПериодаСтрокой", Элемент, ТекущаяСтрока);
	ТекущаяСтрока.АвтоРасчет = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяНачалоПериодаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	
	СтароеЗначение = ТекущаяСтрока.НачалоПериода;
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "НачалоПериода", "НачалоПериодаСтрокой", Элемент, СтандартнаяОбработка, ТекущаяСтрока);
	Если ТекущаяСтрока.НачалоПериода <> СтароеЗначение Тогда
		ТекущаяСтрока.АвтоРасчет = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяНачалоПериодаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "НачалоПериода", "НачалоПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка, ТекущаяСтрока);
	ТекущаяСтрока.АвтоРасчет = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяНачалоПериодаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяНачалоПериодаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "НачалоПериода", "НачалоПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяКонецПериодаСтрокойПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииПриИзменении(ЭтаФорма, "КонецПериода", "КонецПериодаСтрокой", Элемент, ТекущаяСтрока);
	ТекущаяСтрока.АвтоРасчет = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяКонецПериодаСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	
	СтароеЗначение = ТекущаяСтрока.КонецПериода;
	РаботаСоСтудентамиКлиент.ПериодРегистрацииНачалоВыбора(ЭтаФорма, "КонецПериода", "КонецПериодаСтрокой", Элемент, СтандартнаяОбработка, ТекущаяСтрока);
	Если ТекущаяСтрока.КонецПериода <> СтароеЗначение Тогда
		ТекущаяСтрока.АвтоРасчет = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяКонецПериодаСтрокойРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	
	РаботаСоСтудентамиКлиент.ПериодРегистрацииРегулирование(ЭтаФорма, "КонецПериода", "КонецПериодаСтрокой", Элемент, Направление, СтандартнаяОбработка, ТекущаяСтрока);
	ТекущаяСтрока.АвтоРасчет = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяКонецПериодаСтрокойАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	РаботаСоСтудентамиКлиент.ПериодРегистрацииАвтоПодборТекста(ЭтаФорма, "КонецПериода", "КонецПериодаСтрокой", Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура УчащиесяКонецПериодаСтрокойОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Учащиеся.ТекущиеДанные;
	РаботаСоСтудентамиКлиент.ПериодРегистрацииОкончаниеВводаТекста(ЭтаФорма, "КонецПериода", "КонецПериодаСтрокой", Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка, ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьУчащимися(Команда)
	
	Отказ = Ложь;
	ОчиститьСообщения();
	
	Если Объект.Организация.Пустая() Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Организация"" не заполнено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Организация", "Объект", Отказ);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Факультет) Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Факультет"" не заполнено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Факультет", "Объект", Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда 
		
		Если Объект.Учащиеся.Количество() > 0 Тогда
			ДопПараметры = Новый Структура("ИмяМакета", "ПодборСПлательщиком");
			
			ТекстВопроса = НСтр("ru='Документ уже заполнен, выберите необходимое действие:'"); 
			СписокКнопок = Новый СписокЗначений;
			СписокКнопок.Добавить("Перезаполнить", "Перезаполнить документ");
			СписокКнопок.Добавить("Добавить", "Добавить по отбору");
			СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
			
			Оповещение = Новый ОписаниеОповещения("ОбработкаВопросаПередЗаполнением", ЭтотОбъект, ДопПараметры);
			ПоказатьВопрос(Оповещение, ТекстВопроса, СписокКнопок, , КодВозвратаДиалога.Отмена);
		Иначе
			ВызватьОкноОтбора("ПодборСПлательщиком");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуОплаты(Команда)
	
	Отказ = Ложь; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Факультет) Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Факультет"" не заполнено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Факультет", "Объект", Отказ);		
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Валюта"" не заполнено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ВалютаДокумента", "Объект", Отказ);		
		
	КонецЕсли;
	
	Если Объект.ИспользоватьОдинПериод Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
			ТекстОшибки = НСтр("ru='Поле ""Начало периода"" не заполнено!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "НачалоПериодаСтрокой",, Отказ);		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			ТекстОшибки = НСтр("ru='Поле ""Конец периода"" не заполнено!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "КонецПериодаСтрокой",, Отказ);		
		КонецЕсли;
		
	Иначе
		
		Для каждого СтрокаТЧ Из Объект.Учащиеся Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НачалоПериода) Тогда
				
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Начало периода"" в строке " + СтрокаТЧ.НомерСтроки + " списка ""Учащиеся""'");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Учащиеся", СтрокаТЧ.НомерСтроки, "НачалоПериодаСтрокой");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.КонецПериода) Тогда
				
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Конец периода"" в строке " + СтрокаТЧ.НомерСтроки + " списка ""Учащиеся""'");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Учащиеся", СтрокаТЧ.НомерСтроки, "КонецПериодаСтрокой");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		РассчитатьСуммуОплатыСервер(Истина);
		
		ТекстОповещения = НСтр("ru = 'Расчет сумм оплат'");
		ТекстПояснение = НСтр("ru = 'Суммы оплат заполнены'");
		ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснение);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуОплатыВыделенныхСтрок(Команда)
	
	Отказ = Ложь; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Факультет) Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Факультет"" не заполнено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "Факультет", "Объект", Отказ);		
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Валюта"" не заполнено!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "ВалютаДокумента", "Объект", Отказ);		
		
	КонецЕсли;
	
	Если Объект.ИспользоватьОдинПериод Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
			ТекстОшибки = НСтр("ru='Поле ""Начало периода"" не заполнено!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "НачалоПериодаСтрокой",, Отказ);		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			ТекстОшибки = НСтр("ru='Поле ""Конец периода"" не заполнено!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, "КонецПериодаСтрокой",, Отказ);		
		КонецЕсли;
		
	Иначе
		
		Для каждого ИдентификаторВыделеннойСтроки Из Элементы.Учащиеся.ВыделенныеСтроки Цикл
			
			СтрокаТЧ = Объект.Учащиеся.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.НачалоПериода) Тогда
				
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Начало периода"" в строке " + СтрокаТЧ.НомерСтроки + " списка ""Учащиеся""'");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Учащиеся", СтрокаТЧ.НомерСтроки, "НачалоПериодаСтрокой");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.КонецПериода) Тогда
				
				ТекстОшибки = НСтр("ru='Не заполнена колонка ""Конец периода"" в строке " + СтрокаТЧ.НомерСтроки + " списка ""Учащиеся""'");
				Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Учащиеся", СтрокаТЧ.НомерСтроки, "КонецПериодаСтрокой");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,, Поле, "Объект", Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если НЕ Отказ Тогда
		
		РассчитатьСуммуОплатыСервер();
		
		ТекстОповещения = НСтр("ru = 'Расчет сумм оплат'");
		ТекстПояснение = НСтр("ru = 'Суммы оплат заполнены'");
		ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснение);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуОплаты(Команда)
	
	Перем ДатаОплатыЗаполнение;
	
	ДатаОплатыЗаполнение = КонецМесяца(Объект.Дата); 
	Подсказка = НСтр("ru='Укажите необходимую дату для заполнения:'");
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьДатуОплатыОповещение", ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, ДатаОплатыЗаполнение, Подсказка, ЧастиДаты.Дата);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ОбработкаВопросаПередЗаполнением(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = "Перезаполнить" Тогда
		Объект.Учащиеся.Очистить();
	КонецЕсли;
	
	ИмяМакета = ДопПараметры.ИмяМакета;
		
	ВызватьОкноОтбора(ИмяМакета);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтбору(Результат, ДопПараметры) Экспорт
	Адреса = ДопПараметры.Адреса;
	ИмяМакета = ДопПараметры.ИмяМакета;
	
	Если Результат <> Неопределено Тогда
		
		Адреса.НастройкиКомпоновкиДанных = Результат;
		ЗаполнитьУчащимисяСервер(Адреса);
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуОплатыОповещение(Результат, ДопПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		Для каждого ИдентификаторВыделеннойСтроки Из Элементы.Учащиеся.ВыделенныеСтроки Цикл
			СтрокаТЧ = Объект.Учащиеся.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаТЧ.ДатаОплаты = Результат;
		КонецЦикла; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ПроцедурыИФункцииПодсистемыСвойства

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
  УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма, РеквизитФормыВЗначение("Объект"));
  
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти


&НаКлиенте
Процедура ВызватьОкноОтбора(ИмяМакета)
	Адреса = РаботаСоСтудентамиВызовСервера.ПолучитьАдресаСКДПодбора(ИмяМакета, УникальныйИдентификатор);

	ПараметрыФормы = РаботаСоСтудентамиКлиент.ПараметрыФормыУпрощеннойНастройкиСхемыКомпоновкиДанных(Адреса, УникальныйИдентификатор);
	ПараметрыФормы.Заголовок = СтрШаблон(НСтр("ru = 'Настройка параметров отбора учащихся (значения на %1)'"), Формат(Объект.Дата, "ДЛФ=DD"));
	
	ДопПараметры = Новый Структура("Адреса, ИмяМакета", Адреса, ИмяМакета);
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоОтбору", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных", ПараметрыФормы, ЭтаФорма, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПараметрыАвтоподстановкиДанныхПоСтуденту(Студент, Отбор)
	
	Возврат РаботаСоСтудентами.ПараметрыАвтоподстановкиДанныхПоСтуденту(Студент, "", Отбор);
	
КонецФункции

&НаСервере
Процедура УстановитьПредупреждение()
	
	Если Объект.Учащиеся.Количество() > 0 Тогда
		
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;
		Элементы.Факультет.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.Отображать;	
		
	Иначе
		
		Элементы.Организация.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
		Элементы.Факультет.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;	
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчащимисяСервер(Адреса)
	
   ДанныеОтчета = РаботаСоСтудентами.ПолучитьДанныеПодбораУчащихся(Адреса, Объект.Организация, Объект.Факультет, Объект.Дата);
   ДополненныеДанные = РаботаСоСтудентами.ОтобратьКраткосрочныеДоговоры(ДанныеОтчета, Объект.Организация, Объект.Факультет, Объект.КонецПериода);
   
	Для каждого СтрокаДанных Из ДополненныеДанные Цикл
		
		НоваяСтрока = Объект.Учащиеся.Добавить();
		НоваяСтрока.Учащийся = СтрокаДанных.Студент;
		НоваяСтрока.Контрагент = СтрокаДанных.Контрагент;
		НоваяСтрока.ДоговорКонтрагента = СтрокаДанных.ДоговорКонтрагента;
		
		Если Объект.ИспользоватьОдинПериод Тогда
			
			НоваяСтрока.НачалоПериода = Объект.НачалоПериода;
			НоваяСтрока.КонецПериода = Объект.КонецПериода;
			
		КонецЕсли; 
		
		Если Объект.ИспользоватьОднуДатуОплаты Тогда
			
			НоваяСтрока.ДатаОплаты = Объект.ДатаОплаты;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	УстановитьПредупреждение();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоПериодуРасчета()
	
	Элементы.УчащиесяГруппаПериодОплаты.Видимость = НЕ Объект.ИспользоватьОдинПериод;
	Элементы.НачалоПериодаСтрокой.Доступность = Объект.ИспользоватьОдинПериод;
	Элементы.КонецПериодаСтрокой.Доступность = Объект.ИспользоватьОдинПериод;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПоПериодуОплаты()
	
	Элементы.УчащиесяДатаОплаты.Видимость = НЕ Объект.ИспользоватьОднуДатуОплаты;
	Элементы.УчащиесяЗаполнитьДатуОплаты.Видимость = НЕ Объект.ИспользоватьОднуДатуОплаты;
	Элементы.ДатаОплаты.Доступность = Объект.ИспользоватьОднуДатуОплаты

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитТЧ(ИмяРеквизита, Значение)
	
	Для каждого Строка Из Объект.Учащиеся Цикл
			
		Строка[ИмяРеквизита] = Значение;
		Строка.АвтоРасчет = Ложь;
			
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДляРасчета(ПоВсемСтрокам)
	
	ТаблицаДляРасчета = Новый ТаблицаЗначений;
	ТаблицаДляРасчета.Колонки.Добавить("Факультет", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Подразделения"));
	ТаблицаДляРасчета.Колонки.Добавить("Студент", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Студенты"));
	ТаблицаДляРасчета.Колонки.Добавить("Период", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаДляРасчета.Колонки.Добавить("ПериодОкончания", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	
	Если ПоВсемСтрокам Тогда
		
		Для каждого СтрокаТЧ Из Объект.Учащиеся Цикл
			
			НоваяСтрока = ТаблицаДляРасчета.Добавить();
			НоваяСтрока.Факультет = Объект.Факультет;
			НоваяСтрока.Студент = СтрокаТЧ.Учащийся;
			НоваяСтрока.Период = СтрокаТЧ.НачалоПериода;
			НоваяСтрока.ПериодОкончания = СтрокаТЧ.КонецПериода;
			
		КонецЦикла; 
		
	Иначе
		
		Для каждого ИдентификаторВыделеннойСтроки Из Элементы.Учащиеся.ВыделенныеСтроки Цикл
			
			СтрокаТЧ = Объект.Учащиеся.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			НоваяСтрока = ТаблицаДляРасчета.Добавить();
			НоваяСтрока.Факультет = Объект.Факультет;
			НоваяСтрока.Студент = СтрокаТЧ.Учащийся;
			НоваяСтрока.Период = СтрокаТЧ.НачалоПериода;
			НоваяСтрока.ПериодОкончания = СтрокаТЧ.КонецПериода;
			
		КонецЦикла; 
				
	КонецЕсли; 

	Возврат ТаблицаДляРасчета;

КонецФункции 

&НаСервере
Процедура РассчитатьСуммуОплатыСервер(ПоВсемСтрокам = Ложь)
	
	ПараметрыРасчета = РаботаСоСтудентами.ПолучитьСтруктуруПараметровРасчета();
	ТаблицаДляРасчета = ПолучитьТаблицуДляРасчета(ПоВсемСтрокам);
	ДеревоПериодов = РаботаСоСтудентами.СформироватьДеревоПериодов(ТаблицаДляРасчета);
	
	ТаблицаРасчетовПоПериодам = Новый ТаблицаЗначений;
	ТаблицаРасчетовПоПериодам.Колонки.Добавить("Период", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаРасчетовПоПериодам.Колонки.Добавить("Студент", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Студенты"));
	ТаблицаРасчетовПоПериодам.Колонки.Добавить("Контрагент", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Контрагенты"));
	ТаблицаРасчетовПоПериодам.Колонки.Добавить("ДоговорКонтрагента", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Договоры"));
	ТаблицаРасчетовПоПериодам.Колонки.Добавить("Сумма", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15, 2));
	
	Для каждого СтрокаПериода Из ДеревоПериодов.Строки Цикл
		
		Период = СтрокаПериода.Период;
		
		Для каждого СтрокаФакультета Из СтрокаПериода.Строки Цикл

			Факультет = СтрокаФакультета.Факультет;
			МассивУчащихся = Новый Массив;
			
			Для каждого СтрокаСтудента Из СтрокаФакультета.Строки Цикл			
				МассивУчащихся.Добавить(СтрокаСтудента.Студент);					
			КонецЦикла; 
			
			ПараметрыРасчета.Период = Период;
			ПараметрыРасчета.Факультет = Факультет;
			ПараметрыРасчета.Учащиеся = МассивУчащихся;
			ПараметрыРасчета.Валюта = Объект.ВалютаДокумента;
			ПараметрыРасчета.ВидНачисления = "НачислениеЗаУслугиОбразования";
			
			ПараметрыРасчета.Вставить("ИмяМакета", "СборДанныхНачислений");
			ПараметрыРасчета.Вставить("Организация", Объект.Организация);
			
			ДанныеРасчета = РаботаСоСтудентами.РассчитатьНачисления(ПараметрыРасчета);
			
			Для каждого СтрокаДанных Из ДанныеРасчета Цикл
				
				НоваяСтрока = ТаблицаРасчетовПоПериодам.Добавить();
				НоваяСтрока.Период = Период;
				НоваяСтрока.Студент = СтрокаДанных.Студент;
				НоваяСтрока.Контрагент = СтрокаДанных.Контрагент;
				НоваяСтрока.ДоговорКонтрагента = СтрокаДанных.ДоговорКонтрагента;
				НоваяСтрока.Сумма = СтрокаДанных.Сумма;
				
			КонецЦикла; 
			
		КонецЦикла; 
	КонецЦикла;
	
	Если ПоВсемСтрокам Тогда
		
		ЗаполнитьСуммыОплатыПоВсемСтрокам(ТаблицаРасчетовПоПериодам);
		
	Иначе
		
		ЗаполнитьСуммыОплатыПоВыделеннымСтрокам(ТаблицаРасчетовПоПериодам);
		
	КонецЕсли; 
	
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "НачалоПериода", "НачалоПериодаСтрокой");
	РаботаСоСтудентамиКлиентСервер.ПериодЗаполнитьПредставлениеВТабличнойЧасти(Объект.Учащиеся, "КонецПериода", "КонецПериодаСтрокой");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыОплатыПоВсемСтрокам(ТаблицаРасчетовПоПериодам)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаРасчета.Студент,
				   |	ТаблицаРасчета.Контрагент,
				   |	ТаблицаРасчета.ДоговорКонтрагента,
	               |	ТаблицаРасчета.Сумма,
	               |	ТаблицаРасчета.Период
	               |ПОМЕСТИТЬ ТаблицаСумм
	               |ИЗ
	               |	&ТаблицаРасчета КАК ТаблицаРасчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Учащиеся.НомерСтроки,
	               |	Учащиеся.Учащийся,
	               |	Учащиеся.Контрагент,
	               |	Учащиеся.ДоговорКонтрагента,
	               |	Учащиеся.НачалоПериода,
	               |	Учащиеся.КонецПериода,
	               |	Учащиеся.ДатаОплаты
	               |ПОМЕСТИТЬ ТаблицаУчащихся
	               |ИЗ
	               |	&Учащиеся КАК Учащиеся
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаУчащихся.НомерСтроки КАК НомерСтроки,
	               |	ТаблицаУчащихся.Учащийся,
	               |	ТаблицаУчащихся.Контрагент,
	               |	ТаблицаУчащихся.ДоговорКонтрагента,
	               |	ТаблицаУчащихся.НачалоПериода,
	               |	ТаблицаУчащихся.КонецПериода,
	               |	ТаблицаУчащихся.ДатаОплаты,
	               |	СУММА(ЕСТЬNULL(ТаблицаСумм.Сумма, 0)) КАК Сумма,
	               |	ИСТИНА КАК АвтоРасчет
	               |ИЗ
	               |	ТаблицаУчащихся КАК ТаблицаУчащихся
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСумм КАК ТаблицаСумм
				   |		ПО ТаблицаУчащихся.Учащийся = ТаблицаСумм.Студент
	               |			И ТаблицаУчащихся.Контрагент = ТаблицаСумм.Контрагент
				   |			И ТаблицаУчащихся.ДоговорКонтрагента = ТаблицаСумм.ДоговорКонтрагента
				   |			И ТаблицаУчащихся.НачалоПериода <= ТаблицаСумм.Период
	               |			И ТаблицаУчащихся.НачалоПериода <= ТаблицаСумм.Период
	               |			И ТаблицаУчащихся.КонецПериода >= ТаблицаСумм.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаУчащихся.ДатаОплаты,
	               |	ТаблицаУчащихся.НомерСтроки,
	               |	ТаблицаУчащихся.Учащийся,
	               |	ТаблицаУчащихся.Контрагент,
	               |	ТаблицаУчащихся.ДоговорКонтрагента,
	               |	ТаблицаУчащихся.КонецПериода,
	               |	ТаблицаУчащихся.НачалоПериода
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.Текст = ТекстЗапроса; 
	Запрос.УстановитьПараметр("ТаблицаРасчета", ТаблицаРасчетовПоПериодам);
	Запрос.УстановитьПараметр("Учащиеся", Объект.Учащиеся.Выгрузить());
	
	Объект.Учащиеся.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыОплатыПоВыделеннымСтрокам(ТаблицаРасчетовПоПериодам)
	
	ТаблицаВыделенныхСтрок = Новый ТаблицаЗначений;
	ТаблицаВыделенныхСтрок.Колонки.Добавить("НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	ТаблицаВыделенныхСтрок.Колонки.Добавить("Учащийся", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Студенты"));
	ТаблицаВыделенныхСтрок.Колонки.Добавить("Контрагент", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Контрагенты"));
	ТаблицаВыделенныхСтрок.Колонки.Добавить("ДоговорКонтрагента", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСсылка("СправочникСсылка.Договоры"));
	ТаблицаВыделенныхСтрок.Колонки.Добавить("НачалоПериода", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	ТаблицаВыделенныхСтрок.Колонки.Добавить("КонецПериода", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповДаты(ЧастиДаты.Дата));
	
	Для каждого ИдентификаторВыделеннойСтроки Из Элементы.Учащиеся.ВыделенныеСтроки Цикл
			
		СтрокаТЧ = Объект.Учащиеся.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		НоваяСтрока = ТаблицаВыделенныхСтрок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
	КонецЦикла;

	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТаблицаРасчета.Студент,
				   |	ТаблицаРасчета.Контрагент,
				   |	ТаблицаРасчета.ДоговорКонтрагента,
	               |	ТаблицаРасчета.Сумма,
	               |	ТаблицаРасчета.Период
	               |ПОМЕСТИТЬ ТаблицаСумм
	               |ИЗ
	               |	&ТаблицаРасчета КАК ТаблицаРасчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаВыделенныхСтрок.НомерСтроки,
	               |	ТаблицаВыделенныхСтрок.Учащийся,
				   |	ТаблицаВыделенныхСтрок.Контрагент,
	               |	ТаблицаВыделенныхСтрок.ДоговорКонтрагента,
	               |	ТаблицаВыделенныхСтрок.НачалоПериода,
	               |	ТаблицаВыделенныхСтрок.КонецПериода
	               |ПОМЕСТИТЬ ТаблицаУчащихся
	               |ИЗ
	               |	&ТаблицаВыделенныхСтрок КАК ТаблицаВыделенныхСтрок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаУчащихся.НомерСтроки,
	               |	СУММА(ЕСТЬNULL(ТаблицаСумм.Сумма, 0)) КАК Сумма
	               |ИЗ
	               |	ТаблицаУчащихся КАК ТаблицаУчащихся
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСумм КАК ТаблицаСумм
	               |		ПО ТаблицаУчащихся.Учащийся = ТаблицаСумм.Студент
				   |			И ТаблицаУчащихся.Контрагент = ТаблицаСумм.Контрагент
				   |			И ТаблицаУчащихся.ДоговорКонтрагента = ТаблицаСумм.ДоговорКонтрагента
	               |			И ТаблицаУчащихся.НачалоПериода <= ТаблицаСумм.Период
	               |			И ТаблицаУчащихся.КонецПериода >= ТаблицаСумм.Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаУчащихся.НомерСтроки";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаРасчета", ТаблицаРасчетовПоПериодам);
	Запрос.УстановитьПараметр("ТаблицаВыделенныхСтрок", ТаблицаВыделенныхСтрок);
	
   Выборка = Запрос.Выполнить().Выбрать();
   Пока Выборка.Следующий() Цикл
	   
	   Объект.Учащиеся[Выборка.НомерСтроки - 1].Сумма = Выборка.Сумма;
	   Объект.Учащиеся[Выборка.НомерСтроки - 1].АвтоРасчет = Истина;
	   
   КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьФакультета()

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Факультет", "Доступность", ЗначениеЗаполнено(Объект.Организация));

КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
