#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	СтандартныеОтчеты.СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета);
	
КонецПроцедуры	

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "НакопительнаяВедомостьПоПриходуПродуктовПитания");
	НастройкиВарианта.Описание = НСтр("ru = '(устарел) Накопительная ведомость по приходу продуктов питания (ф. 0504037)'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "НакопительнаяВедомостьПоПриходуПродуктовПитания_103н");
	НастройкиВарианта.Описание = НСтр("ru = 'Накопительная ведомость по приходу продуктов питания (ф. 0504037) в ред. приказа 103н'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "БезМакетов");
	НастройкиВарианта.Включен = Ложь;
КонецПроцедуры

#КонецОбласти

Процедура ПриВыводеЗаголовка(ПараметрыОтчета, Результат)
	
	Если не ПараметрыОтчета.ВыводитьЗаголовок тогда
		Возврат;
	КонецЕсли;	
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыОтчета, "Форма103н", Ложь) Тогда
		Макет = ПолучитьМакет("МакетШапка_103н");
	Иначе
		Макет = ПолучитьМакет("МакетШапка");
	КонецЕсли;
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	
	ПараметрыОбласти = Новый Структура;
	
	ПараметрыОбласти.Вставить("КонецПериода", ПараметрыОтчета.КонецПериода);
	ПараметрыОбласти.Вставить("ОписаниеПериода",
		"за " + ПредставлениеПериода(НачалоДня(ПараметрыОтчета.НачалоПериода), 
			КонецДня(ПараметрыОтчета.КонецПериода), "ФП = Истина"));
	
	ПараметрыОбласти.Вставить("МестоХранения", ПараметрыОтчета.ПодразделениеПечать);
	
	Сотрудник = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДанныеСотрудника(ПараметрыОтчета.МОЛ,  ПараметрыОтчета.КонецПериода);
	ПараметрыОбласти.Вставить("Сотрудник",
		КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",Сотрудник.Фамилия,Сотрудник.Имя,Сотрудник.Отчество), Истина));
	
	РеквизитыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПараметрыОтчета.ОрганизацияПечать, "НаименованиеПолное, КодОКПО");
	ПараметрыОбласти.Вставить("Организация", РеквизитыОрганизации.НаименованиеПолное);
	ПараметрыОбласти.Вставить("ОКПО", РеквизитыОрганизации.КодОКПО);
	
	ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбласти);
	Результат.Вывести(ОбластьЗаголовок);
	
	Результат.Область("R1:R" + Результат.ВысотаТаблицы).Имя = "Заголовок";
	
КонецПроцедуры

	
Процедура ПриВыводеПодвала(ПараметрыОтчета, Результат)
	Если не ПараметрыОтчета.ВыводитьПодвал тогда
		Возврат;
	КонецЕсли;	
	
	Макет = ПолучитьМакет("МакетШапка");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.КонецПериода = ПараметрыОтчета.КонецПериода;
	
	Сотрудник = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДанныеСотрудника(ПараметрыОтчета.Составил,  ПараметрыОтчета.КонецПериода);
	
	ОбластьПодвал.Параметры.Составил			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",Сотрудник.Фамилия,Сотрудник.Имя,Сотрудник.Отчество), Истина);
	ОбластьПодвал.Параметры.СоставилДолжность	= Сотрудник.Должность;
	
	Сотрудник = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьДанныеСотрудника(ПараметрыОтчета.Проверил,  ПараметрыОтчета.КонецПериода);
	
	ОбластьПодвал.Параметры.Проверил			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",Сотрудник.Фамилия,Сотрудник.Имя,Сотрудник.Отчество), Истина);
	ОбластьПодвал.Параметры.ПроверилДолжность	= Сотрудник.Должность;
	
	Результат.Вывести(ОбластьПодвал);
	
КонецПроцедуры	

Процедура ПолучитьЗаначенияОтбораОсновнаяСхема(Элементы, ЗначениеПолейОтбора)
	Для каждого Элемент из Элементы цикл
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") тогда
			ПолучитьЗаначенияОтбораОсновнаяСхема(Элемент.Элементы, ЗначениеПолейОтбора);
		КонецЕсли;	
		ЗначениеПолейОтбора.Вставить(Элемент.ЛевоеЗначение,Новый Структура("Использование, ВидСравнения, ПравоеЗначение", Элемент.Использование, Элемент.ВидСравнения, Элемент.ПравоеЗначение));
	КонецЦикла;
КонецПРоцедуры	

Процедура УстановкаОтборовПараметровВложеннойСхемы(КомпоновщикНастроек, ПараметрыОтчета)
	
	МакетОформления = КомпоновщикНастроек.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));
	
	ЗначениеПолейОтбора = Новый Структура;
	
	
	
	Для каждого Элемент из КомпоновщикНастроек.Настройки.Структура цикл
		Если ТипЗнч(Элемент) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") тогда
			
			ПолучитьЗаначенияОтбораОсновнаяСхема(КомпоновщикНастроек.Настройки.Отбор.Элементы, ЗначениеПолейОтбора);	
			
			ВложенныеНастройки = Элемент.Настройки;
			ВложенныйМакет = ВложенныеНастройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МакетОформления"));			
			Если ВложенныйМакет <> Неопределено и МакетОформления <> Неопределено Тогда
				ВложенныйМакет.Использование = МакетОформления.Использование;
				ВложенныйМакет.Значение      = МакетОформления.Значение;
			КонецЕсли;
			
			
			Для каждого Параметр из ВложенныеНастройки.ПараметрыДанных.Элементы цикл
				ЗначениеПараметра = Неопределено;
				Если ПараметрыОтчета.Свойство(""+Параметр.Параметр,ЗначениеПараметра) Тогда
					Параметр.Значение = ЗначениеПараметра;
				КонецЕсли;	
				//Если Параметр.Параметр = Новый ПараметрКомпоновкиДанных("НачалоПериода") тогда
				//	Параметр.Значение = ПараметрыОтчета.НачалоПериода;
				//КонецЕсли;	
				//Если Параметр.Параметр = Новый ПараметрКомпоновкиДанных("КонецПериода") тогда
				//	Параметр.Значение = ПараметрыОтчета.КонецПериода;
				//КонецЕсли;	
			КонецЦикла;	
			Для каждого ДопПоле из ЗначениеПолейОтбора цикл
				Если ДопПоле.Значение = Неопределено тогда
					ПРодолжить;
				КонецЕсли;
			
				БылЭлемент = Ложь;
				Для каждого ЭлементОтбора из ВложенныеНастройки.Отбор.Элементы цикл
					Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ДопПоле.Ключ) тогда
						БылЭлемент = Истина;
						ЭлементОтбора.Использование = ДопПоле.Значение.Использование;
						ЭлементОтбора.ВидСравнения  = ДопПоле.Значение.ВидСравнения;
						ЕСли ТипЗнч(ДопПоле.Значение.ПравоеЗначение) = Тип("СписокЗначений") и ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СписокЗначений") тогда
							ЭлементОтбора.ПравоеЗначение.ЗагрузитьЗначения(ДопПоле.Значение.ПравоеЗначение.ВыгрузитьЗначения())
						Иначе
							ЭлементОтбора.ПравоеЗначение  = ДопПоле.Значение.ПравоеЗначение;
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;	
				Если не БылЭлемент тогда
					НовыйЭлемент = ВложенныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
					НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ДопПоле.Ключ);
					НовыйЭлемент.Использование 	= ДопПоле.Значение.Использование;
					НовыйЭлемент.ВидСравнения  	= ДопПоле.Значение.ВидСравнения;
					НовыйЭлемент.ПравоеЗначение = ДопПоле.Значение.ПравоеЗначение;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	
	
	
	
КонецПРоцедуры	


Процедура СформироватьОтчет(ПараметрыОтчета, Результат, ДанныеРасшифровки, ПоказательСчет) Экспорт
	Результат.Очистить();
	
	ПоказательСчет = Новый Структура;
	СтандартныеОтчеты.УстановитьСоответствиеДляРасшифровкиПоказательСчет(ПоказательСчет,"СуммаКонтрагент","302.00");
	СтандартныеОтчеты.УстановитьСоответствиеДляРасшифровкиПоказательСчет(ПоказательСчет,"СуммаНоменклатура","105.22");
	СтандартныеОтчеты.УстановитьСоответствиеДляРасшифровкиПоказательСчет(ПоказательСчет,"СуммаНоменклатура","105.32");
	
	ПриВыводеЗаголовка(ПараметрыОтчета,Результат);
	
	ДанныеРасшифровкиОбъект = Неопределено;
	Если ТипЗнч(ПараметрыОтчета.СхемаКомпоновкиДанных) = Тип("Строка") Тогда
		Если ЭтоАдресВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных) Тогда
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(ПараметрыОтчета.СхемаКомпоновкиДанных);
		КонецЕсли;
	Иначе
		СхемаКомпоновкиДанных = ПараметрыОтчета.СхемаКомпоновкиДанных;
	КонецЕсли;
	
	Если ПараметрыОтчета.НеВыводитьНомера Тогда
		
		ИмяМакетаДляИзменения = Неопределено;
		Для Каждого МакетСхемы Из СхемаКомпоновкиДанных.МакетыПолейИтога Цикл
			Если МакетСхемы.ИмяГруппировки1 = "Поставщики"
				И МакетСхемы.ИмяГруппировки2 = "Периоды"
				И МакетСхемы.ТипМакета1 = ТипМакетаОбластиКомпоновкиДанных.Заголовок
				И МакетСхемы.ТипМакета2 = ТипМакетаОбластиКомпоновкиДанных.Заголовок Тогда
				ИмяМакетаДляИзменения = МакетСхемы.Макет;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ИмяМакетаДляИзменения <> Неопределено Тогда
			МакетДляИзменения = СхемаКомпоновкиДанных.Макеты.Найти(ИмяМакетаДляИзменения);
			Если МакетДляИзменения <> Неопределено Тогда
				Если МакетДляИзменения.Макет.Количество() > 1 Тогда
					МакетДляИзменения.Макет.Удалить(0);
				КонецЕсли;
			КонецЕсли
		КонецЕсли;
		
	КонецЕсли;
	
	КомпоновщикНастроек = ПараметрыОтчета.КомпоновщикНастроек;
	ПередКомпоновкойМакета(КомпоновщикНастроек, ПараметрыОтчета);
	
	НастройкиДляКомпоновкиМакета = КомпоновщикНастроек.ПолучитьНастройки();
	
	//Сгенерируем макет компоновки данных при помощи компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Попытка
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета, ДанныеРасшифровкиОбъект);
		//		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиДляКомпоновкиМакета);
		
		//Создадим и инициализируем процессор компоновки
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиОбъект, Истина);
		
		ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиОбъект, ПараметрыОтчета.УникальныйИдентификатор);
		
		//Создадим и инициализируем процессор вывода результата
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(Результат);
		
		//Обозначим начало вывода
		ПроцессорВывода.НачатьВывод();
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
		
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Пока ИнформацияОбОшибке.Причина <> Неопределено Цикл
			ИнформацияОбОшибке = ИнформацияОбОшибке.Причина;
		КонецЦикла;
		ТекстСообщения = НСтр("ru = 'Отчет не сформирован!'") + Символы.ПС + ИнформацияОбОшибке.Описание;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецПопытки;
	
	ПриВыводеПодвала(ПараметрыОтчета, Результат);
КонецПроцедуры

Процедура ПередКомпоновкойМакета(КомпоновщикНастроек ,ПараметрыОтчета)
	
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	КонецЕсли;
	
	// 105.02 - ПродуктыПитания_ОЦДИ, ПродуктыПитания_ИДИ
	Список105_02 = Новый СписокЗначений();
	Список105_02.ЗагрузитьЗначения(БухгалтерскийУчет.СписокСчетов("105.22, 105.32, 106.2П, 106.3П", ТекущаяДатаСеанса()));
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Сч10502", Список105_02);
	
	КорСчет = Новый СписокЗначений();
	КорСчет.Добавить(БухгалтерскийУчет.СчетПоКоду("302.00"));
	КорСчет.Добавить(БухгалтерскийУчет.СчетПоКоду("208.00",
		?(ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода), ПараметрыОтчета.КонецПериода, ТекущаяДатаСеанса())));
	КорСчет.Добавить(БухгалтерскийУчет.СчетПоКоду("401.60"));
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,"КорСчет", КорСчет);
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,"ТолькоОтПоставщиков", ПараметрыОтчета.ТолькоОтПоставщиков);
	
	СтандартныеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек,"УчитыватьВнутренниеОбороты", ПараметрыОтчета.УчитыватьВнутренниеОбороты);
	
КонецПроцедуры

#КонецЕсли