
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	УстановитьДанныеДляПечатиЧековККМ();
	РассчитатьИтогиОплаты();
	РассчитатьИтогиНДС();
	РассчитатьИтогиАктОбОказанииУслуг();
	УстановитьОтборСпискаАктов();
	РассчитатьИтогиПродажиТовары();
	РассчитатьИтогиПродажиРаботыУслуги();
	
	УстановитьВидимостьЭлементовФормы();
	УстановитьВидимостьЭлементовГрафикПлатежей();
	УстановитьУсловноеОформление();

	ВалютаРубли = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, ЭтаФорма.Элементы.ИнформационныеСсылки);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	РассчитатьИтогиОплаты();
	РассчитатьИтогиПродажиТовары();
	РассчитатьИтогиПродажиРаботыУслуги();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОтражениеУчтенныхДенежныхСредств();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	НадписьОтражениеВУчетеКассы = ТекстОтраженияВУчетеКассы();
	НадписьОтражениеВУчетеЭквайринга = ТекстОтраженияВУчетеЭквайринга();
	НадписьОтражениеВУчетеАктов = ТекстОтраженияВУчетеАктов();
	
	УстановитьОтборСпискаАктов();

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ПроверитьСуммуВыручки();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Документ.ОтчетПоКассовойСмене.Форма.ПомощникЗаполненияДокументовУчетаРозничныхПродаж" Тогда
		СоздатьНовыйДокументПКОНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если (ИмяСобытия = "ПКОДляОтчетаПоКассовойСменеИзменение")
		ИЛИ (ИмяСобытия = "ЭквайринговаяОперацияДляОтчетаПоКассовойСменеИзменение") Тогда
		ОтражениеУчтенныхДенежныхСредств();	
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	УстановитьВидимостьЭлементовФормы();

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КассаККМПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыОплатаНаличными

&НаКлиенте
Процедура ОплатаНаличнымиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РассчитатьИтогиОплатыНаличными();	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаНаличнымиПослеУдаления(Элемент)
	РассчитатьИтогиОплатыНаличными();	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаНаличнымиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьИтогиОплатыНаличными();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаНаличнымиСуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОплатаНаличными.ТекущиеДанные;
	Если ТекущиеДанные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") И ТекущиеДанные.Сумма > 0 Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Сумма * (-1);
	ИначеЕсли ТекущиеДанные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Продажа") И ТекущиеДанные.Сумма < 0 Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Сумма * (-1);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаНаличнымиЭтоРозничныйПокупательПриИзменении(Элемент)
	Объект.СуммаПродажНаличнымиРозничнымПокупателям = ВсегоРозницаНаличными();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаНаличнымиВидРасчетовПриИзменении(Элемент)
	
	Элементы.ОплатаНаличными.ТекущиеДанные.ОплатитьДо = Дата('00010101');
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаНаличнымиОплатитьДоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОплатаНаличными.ТекущиеДанные;
	
	Отбор = Новый Структура("ВидРасчетов,Контрагент,Договор");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеДанные);
	Отбор.Вставить("Валюта"			, ВалютаРубли);
	Отбор.Вставить("ЭтоПоступление"	, Истина);
	
	СписокОчередныхПлатежей = СписокОчередныхПлатежейПоГрафику(Объект.Организация, ТекущиеДанные.Договор, Отбор, ТекущиеДанные.СтатьяАналитикиОплаты);
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого Платеж Из СписокОчередныхПлатежей Цикл
		Элемент.СписокВыбора.Добавить(Платеж.Значение, Платеж.Представление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыОплатыПлатежнымиКартами

&НаКлиенте
Процедура ОплатаПлатежнымиКартамиПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РассчитатьИтогиОплатыПлатежнымиКартами();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПлатежнымиКартамиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьИтогиОплатыПлатежнымиКартами();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПлатежнымиКартамиПослеУдаления(Элемент)
	РассчитатьИтогиОплатыПлатежнымиКартами();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПлатежнымиКартамиВидРасчетовПриИзменении(Элемент)
	
	Элементы.ОплатаПлатежнымиКартами.ТекущиеДанные.ОплатитьДо = Дата('00010101');
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПлатежнымиКартамиОплатитьДоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОплатаПлатежнымиКартами.ТекущиеДанные;
	
	Отбор = Новый Структура("ВидРасчетов,Контрагент,Договор");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеДанные);
	Отбор.Вставить("Валюта"			, ВалютаРубли);
	Отбор.Вставить("ЭтоПоступление"	, Истина);
	
	СписокОчередныхПлатежей = СписокОчередныхПлатежейПоГрафику(Объект.Организация, ТекущиеДанные.Договор, Отбор, ТекущиеДанные.СтатьяАналитикиОплаты);
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого Платеж Из СписокОчередныхПлатежей Цикл
		Элемент.СписокВыбора.Добавить(Платеж.Значение, Платеж.Представление);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыПродажиПоСтавкамНДС

&НаКлиенте
Процедура ПродажиПоСтавкамНДССуммаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродажиПоСтавкамНДС.ТекущиеДанные;
	СтавкаНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ТекущиеДанные.СтавкаНДС);
	ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * СтавкаНДС / (100 + СтавкаНДС);
	
	РассчитатьИтогиНДС();
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПоСтавкамНДССтавкаНДСПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПродажиПоСтавкамНДС.ТекущиеДанные;
	СтавкаНДС = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ТекущиеДанные.СтавкаНДС);
	ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * СтавкаНДС / (100 + СтавкаНДС);
	
	РассчитатьИтогиНДС();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицТовары

&НаКлиенте
Процедура ПродажиТоварыПриИзменении(Элемент)
	РассчитатьИтогиПродажиТовары();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратТоварыПриИзменении(Элемент)
	РассчитатьИтогиПродажиТовары();
КонецПроцедуры

&НаКлиенте
Процедура ПродажиТоварыПослеУдаления(Элемент)
	РассчитатьИтогиПродажиТовары();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратТоварыПослеУдаления(Элемент)
	РассчитатьИтогиПродажиТовары();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицРаботыУслуги

&НаКлиенте
Процедура ПродажиРаботыУслугиПриИзменении(Элемент)
	РассчитатьИтогиПродажиРаботыУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаРаботыУслугиПриИзменении(Элемент)
	РассчитатьИтогиПродажиРаботыУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ПродажиРаботыУслугиПослеУдаления(Элемент)
	РассчитатьИтогиПродажиРаботыУслуги();
КонецПроцедуры

&НаКлиенте
Процедура ОтменаРаботыУслугиПослеУдаления(Элемент)
	РассчитатьИтогиПродажиРаботыУслуги();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьДокументЗаСмену(Команда)
	
	ЗаполнитьДокументЗаСменуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммуДокумента(Команда)
	ЗаполнитьСуммуДокументаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭквайринговуюОперацию(Команда)
	СоздатьЭквайринговуюОперациюНаКлиенте()
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПриходныйКассовыйОрдер(Команда)
	СоздатьПриходныйКассовыйОрдерНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДокументЗаСменуНаСервере()

	ТипОборудования = 0;
	
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		Если Объект.КассаККМ.ИспользоватьБезПодключенияОборудования Тогда
			ЗаполнитьПоДаннымЧековНаСервереЗаДень();
		Иначе
			ТипОборудования = Объект.КассаККМ.ТипОборудования;
			Если (ТипОборудования = 0 И ЗначениеЗаполнено(Объект.КассаККМ.ПодключаемоеОборудование)) 
				Или (ТипОборудования = 1 И ЗначениеЗаполнено(Объект.КассаККМ.ОффлайнОборудование)) Тогда
				ПараметрыОбмена = ПолучитьПараметрыОбмена(Объект.КассаККМ);
				Если ПараметрыОбмена.Следующий() Тогда 
					ЗагружатьКакЧекиККМ = ПараметрыОбмена.ЗагружатьКакЧекиККМ;
				КонецЕсли;	
				Если (ТипОборудования = 1) И НЕ ЗагружатьКакЧекиККМ Тогда
					ТекстОшибки = НСтр("ru='Для офлайн кассы ККМ заполнение осуществляется автоматически при загрузке сведений о продажах через обработку ""Обмен с офлайн оборудованием"" в разделе ""Денежные средства""!'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.КассоваяСмена");
					Возврат;
				Иначе
					Если НЕ ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
						ТекстОшибки = НСтр("ru='Не указана кассовая смена!'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.КассоваяСмена");
						Возврат;
					КонецЕсли;	
				
					ЗаполнитьПоДаннымЧековНаСервере(Объект.КассоваяСмена);
				КонецЕсли;	
			Иначе
				ТекстОшибки = НСтр("ru='Не указано оборудование у кассы ККМ!'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,"Объект.КассаККМ");
				Возврат;
			КонецЕсли;	
		КонецЕсли;
		РассчитатьИтогиОплаты();
		РассчитатьИтогиНДС();
		РассчитатьИтогиПродажиТовары();
		РассчитатьИтогиПродажиРаботыУслуги();
			
		Объект.СуммаДокумента = Объект.ОплатаНаличными.Итог("Сумма");
			
		Объект.СуммаПродажНаличнымиРозничнымПокупателям = ВсегоРозницаНаличными();
		
		ВычислитьСуммуУслугКОтражению();
		
		УстановитьВидимостьЭлементовФормы();
		
		НадписьОтражениеВУчетеКассы 		= ТекстОтраженияВУчетеКассы();
		НадписьОтражениеВУчетеЭквайринга 	= ТекстОтраженияВУчетеЭквайринга();
		НадписьОтражениеВУчетеАктов 		= ТекстОтраженияВУчетеАктов();
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ВсегоРозницаНаличными()
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таб.Сумма,
	               |	Таб.ЭтоРозничныйПокупатель
	               |ПОМЕСТИТЬ ДанныеРозницы
	               |ИЗ
	               |	&ДанныеРозницыНаличными КАК Таб
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ДанныеРозницы.Сумма) КАК Сумма
	               |ИЗ
	               |	ДанныеРозницы КАК ДанныеРозницы
	               |ГДЕ
	               |	ДанныеРозницы.ЭтоРозничныйПокупатель = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеРозницы.ЭтоРозничныйПокупатель";
	Запрос.УстановитьПараметр("ДанныеРозницыНаличными", Объект.ОплатаНаличными.Выгрузить(,"ЭтоРозничныйПокупатель, Сумма"));
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Сумма;
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции	

&НаСервере
Функция ЧекиДляЗаполнения(ЗаДень = Ложь, КассоваяСмена = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ЗаДень Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЧекККМ КАК ЧекККМ
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
		               |	И ЧекККМ.КассаККМ = &КассаККМ
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |	И ЧекККМ.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМ
		               |	И НАЧАЛОПЕРИОДА(ФискальныеОперации.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ФискальныеОперации.ДокументОснование.КассаККМ = &КассаККМ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
		               |	И ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)";
		
		Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
		Запрос.УстановитьПараметр("ДатаСведений", НачалоДня(Объект.Дата));
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМ.Ссылка КАК Ссылка,
		               |	ЧекККМ.Дата КАК Дата
		               |ИЗ
		               |	Документ.ЧекККМ КАК ЧекККМ
		               |ГДЕ
		               |	ЧекККМ.КассоваяСмена = &КассоваяСмена
		               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |	И ЧекККМ.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |	И ЧекККМ.ИдентификаторКорзины = """"
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование,
		               |	ФискальныеОперации.Дата
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
		               |	И ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |	И ФискальныеОперации.ДокументОснование.ИдентификаторКорзины = """"";
		
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	КонецЕсли;				   
	
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит", Перечисления.СтатусыЧековККМ.Пробитый);
	
	Результаты = Запрос.Выполнить().Выгрузить();
	
	Возврат Результаты.ВыгрузитьКолонку("Ссылка");

КонецФункции

&НаСервере
Функция ЧекиВозвратаДляЗаполнения(ЗаДень = Ложь, КассоваяСмена = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ЗаДень Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМНаВозврат.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(ЧекККМНаВозврат.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
		               |	И ЧекККМНаВозврат.КассаККМ = &КассаККМ
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ЧекККМНаВозврат.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |	И ЧекККМНаВозврат.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМНаВозврат
		               |	И НАЧАЛОПЕРИОДА(ФискальныеОперации.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ФискальныеОперации.ДокументОснование.КассаККМ = &КассаККМ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
		               |	И ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)";
		
		Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
		Запрос.УстановитьПараметр("ДатаСведений", НачалоДня(Объект.Дата));
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМНаВозврат.Ссылка КАК Ссылка,
		               |	ЧекККМНаВозврат.Дата КАК Дата
		               |ИЗ
		               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
		               |ГДЕ
		               |	ЧекККМНаВозврат.КассоваяСмена = &КассоваяСмена
		               |	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ЧекККМНаВозврат.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |	И ЧекККМНаВозврат.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |	И ЧекККМНаВозврат.ИдентификаторКорзины = """"
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование,
		               |	ФискальныеОперации.Дата
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМНаВозврат
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
		               |	И ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ЛОЖЬ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |	И ФискальныеОперации.ДокументОснование.ИдентификаторКорзины = """"";
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	КонецЕсли;				   
	
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит", Перечисления.СтатусыЧековККМ.Пробитый);
	
	Результаты = Запрос.Выполнить().Выгрузить();
	
	Возврат Результаты.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоДаннымЧековНаСервере(КассоваяСмена)
	
	ДокументыЧеки 						= ЧекиДляЗаполнения(Ложь, КассоваяСмена);
	ДокументыЧекиНаВозврат 				= ЧекиВозвратаДляЗаполнения(Ложь, КассоваяСмена);
	ДокументыЧекиНаПредоплату 			= ЧекиСПредоплатойДляЗаполнения(Ложь, КассоваяСмена);
	ДокументыЧекиНаВозвратПредоплаты 	= ЧекиВозвратаСПредоплатойДляЗаполнения(Ложь, КассоваяСмена);
	ЧекиПредоплаты						= ЧекиПредоплаты(Ложь, КассоваяСмена);
	ЧекиВозвратаПредоплаты				= ЧекиВозвратаПредоплаты(Ложь, КассоваяСмена);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа) КАК ВидОперации,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ЧекККМРасшифровкаОплаты.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	ЧекККМРасшифровкаОплаты.Сумма КАК Сумма,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМРасшифровкаОплаты.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ КАК Подразделение
	               |ПОМЕСТИТЬ ДанныеЧековОплатаНаличными
	               |ИЗ
	               |	Документ.ЧекККМ.РасшифровкаОплаты КАК ЧекККМРасшифровкаОплаты
	               |ГДЕ
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ФормаОплаты = 0
	               |	И ЧекККМРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаПредоплату)
	               |	И ЧекККМРасшифровкаОплаты.Сумма > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат),
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.СтатьяАналитикиОплаты,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.Сумма,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.РасшифровкаОплаты КАК ЧекККМНаВозвратРасшифровкаОплаты
	               |ГДЕ
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ФормаОплаты = 0
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаВозвратПредоплаты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаНаличными.ВидОперации КАК ВидОперации,
	               |	ДанныеЧековОплатаНаличными.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаНаличными.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаНаличными.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ДанныеЧековОплатаНаличными.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ДанныеЧековОплатаНаличными.Сумма) КАК Сумма,
	               |	ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаНаличными.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.Подразделение КАК Подразделение,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов
	               |ИЗ
	               |	ДанныеЧековОплатаНаличными КАК ДанныеЧековОплатаНаличными
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеЧековОплатаНаличными.СтатьяАналитикиОплаты,
	               |	ДанныеЧековОплатаНаличными.Контрагент,
	               |	ДанныеЧековОплатаНаличными.Договор,
	               |	ДанныеЧековОплатаНаличными.СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.ВидОперации,
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента,
	               |	ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаНаличными.ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидОперации,
	               |	Контрагент,
	               |	Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа) КАК ВидОперации,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ЧекККМРасшифровкаОплаты.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	ЧекККМРасшифровкаОплаты.Сумма КАК Сумма,
	               |	ЧекККМРасшифровкаОплаты.СуммаКомиссии КАК СуммаКомиссии,
	               |	ЧекККМОплата.ПараметрыДоговораЭквайринга КАК ПараметрыДоговораЭквайринга,
	               |	ЧекККМОплата.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМОплата.ПроцентКомиссии КАК ПроцентКомиссии,
	               |	ЧекККМОплата.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	               |	ЧекККМОплата.Ссылка.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМОплата.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ КАК Подразделение
	               |ПОМЕСТИТЬ ДанныеЧековОплатаПлатежнымиКартами
	               |ИЗ
	               |	Документ.ЧекККМ.РасшифровкаОплаты КАК ЧекККМРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Оплата КАК ЧекККМОплата
	               |		ПО ЧекККМРасшифровкаОплаты.Ссылка = ЧекККМОплата.Ссылка
	               |			И ЧекККМРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМОплата.КлючСвязиОплаты
	               |ГДЕ
	               |	(ЧекККМРасшифровкаОплаты.Ссылка.ФормаОплаты = 1
	               |			ИЛИ ЧекККМРасшифровкаОплаты.Ссылка.ФормаОплаты = 2)
	               |	И ЧекККМРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаПредоплату)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат),
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.СтатьяАналитикиОплаты,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.Сумма,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.СуммаКомиссии,
	               |	ЧекККМНаВозвратОплата.ПараметрыДоговораЭквайринга,
	               |	ЧекККМНаВозвратОплата.ЭквайринговыйТерминал,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратОплата.ПроцентКомиссии,
	               |	ЧекККМНаВозвратОплата.ВидПлатежнойКарты,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМНаВозвратОплата.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.РасшифровкаОплаты КАК ЧекККМНаВозвратРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМНаВозврат.Оплата КАК ЧекККМНаВозвратОплата
	               |		ПО ЧекККМНаВозвратРасшифровкаОплаты.Ссылка = ЧекККМНаВозвратОплата.Ссылка
	               |			И ЧекККМНаВозвратРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМНаВозвратОплата.КлючСвязиОплаты
	               |ГДЕ
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ФормаОплаты = 1
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаВозвратПредоплаты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидОперации КАК ВидОперации,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаПлатежнымиКартами.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаПлатежнымиКартами.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ДанныеЧековОплатаПлатежнымиКартами.Сумма) КАК Сумма,
	               |	СУММА(ДанныеЧековОплатаПлатежнымиКартами.СуммаКомиссии) КАК СуммаКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораЭквайринга КАК ПараметрыДоговораЭквайринга,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПроцентКомиссии КАК ПроцентКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Подразделение КАК Подразделение,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов
	               |ИЗ
	               |	ДанныеЧековОплатаПлатежнымиКартами КАК ДанныеЧековОплатаПлатежнымиКартами
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Договор,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Контрагент,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СтатьяАналитикиОплаты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораЭквайринга,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидОперации,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПроцентКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидПлатежнойКарты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидОперации,
	               |	Контрагент,
	               |	Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ЧекККМТоварыРаботыУслуги.Номенклатура КАК Справочник.Прейскурант).Номенклатура КАК СоответствующаяНоменклатура,
	               |	ВЫБОР
	               |		КОГДА ЧекККМТоварыРаботыУслуги.КоличествоПервичныхУпаковок = 0
	               |			ТОГДА ЧекККМТоварыРаботыУслуги.Количество
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВЫРАЗИТЬ(ЧекККМТоварыРаботыУслуги.Ссылка.КассаККМ КАК Справочник.ФискальныеРегистраторы).ВидЧастичногоСписания = 1
	               |					ТОГДА ЧекККМТоварыРаботыУслуги.КоличествоПервичныхУпаковок
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ЧекККМТоварыРаботыУслуги.СписатьВЧЗ
	               |							ТОГДА 1
	               |						ИНАЧЕ 0
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Количество,
	               |	ЧекККМТоварыРаботыУслуги.Цена КАК Цена,
	               |	ЧекККМТоварыРаботыУслуги.Сумма КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Всего КАК Всего,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ПОМЕСТИТЬ ПродажиТоварыУслуги
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.КассоваяСмена = &КассоваяСмена
	               |	И ЧекККМТоварыРаботыУслуги.Ссылка В(&ДокументыЧеки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура КАК СоответствующаяНоменклатура,
	               |	СУММА(ПродажиТоварыУслуги.Количество) КАК Количество,
	               |	ПродажиТоварыУслуги.Цена КАК Цена,
	               |	СУММА(ПродажиТоварыУслуги.Сумма) КАК Сумма,
	               |	ПродажиТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиТоварыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ПродажиТоварыУслуги.Всего) КАК Всего,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ПродажиТоварыУслуги КАК ПродажиТоварыУслуги
	               |ГДЕ
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура.ТипНоменклатуры В(&ПризнакиПредметаРасчетаТовары)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиТоварыУслуги.СтавкаНДС,
	               |	ПродажиТоварыУслуги.Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура,
	               |	ПродажиТоварыУслуги.Цена,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура КАК СоответствующаяНоменклатура,
	               |	СУММА(ПродажиТоварыУслуги.Количество) КАК Количество,
	               |	ПродажиТоварыУслуги.Цена КАК Цена,
	               |	СУММА(ПродажиТоварыУслуги.Сумма) КАК Сумма,
	               |	ПродажиТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиТоварыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ПродажиТоварыУслуги.Всего) КАК Всего,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ПродажиТоварыУслуги КАК ПродажиТоварыУслуги
	               |ГДЕ
	               |	НЕ ПродажиТоварыУслуги.СоответствующаяНоменклатура.ТипНоменклатуры В (&ПризнакиПредметаРасчетаТовары)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиТоварыУслуги.СтавкаНДС,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура,
	               |	ПродажиТоварыУслуги.Номенклатура,
	               |	ПродажиТоварыУслуги.Цена,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.Номенклатура КАК НоменклатураНоменклатура,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Количество КАК Количество,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Цена КАК Цена,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Сумма КАК Сумма,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Всего КАК Всего,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ПОМЕСТИТЬ ВозвратыТоварыУслуги
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.КассоваяСмена = &КассоваяСмена
	               |	И ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаВозврат)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыТоварыУслуги.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ВозвратыТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура КАК НоменклатураНоменклатура,
	               |	ВозвратыТоварыУслуги.Количество КАК Количество,
	               |	ВозвратыТоварыУслуги.Цена КАК Цена,
	               |	ВозвратыТоварыУслуги.Сумма КАК Сумма,
	               |	ВозвратыТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ВозвратыТоварыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ВозвратыТоварыУслуги.Всего КАК Всего,
	               |	ВозвратыТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ВозвратыТоварыУслуги КАК ВозвратыТоварыУслуги
	               |ГДЕ
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура.ТипНоменклатуры В(&ПризнакиПредметаРасчетаТовары)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыТоварыУслуги.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ВозвратыТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура КАК НоменклатураНоменклатура,
	               |	ВозвратыТоварыУслуги.Количество КАК Количество,
	               |	ВозвратыТоварыУслуги.Цена КАК Цена,
	               |	ВозвратыТоварыУслуги.Сумма КАК Сумма,
	               |	ВозвратыТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ВозвратыТоварыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ВозвратыТоварыУслуги.Всего КАК Всего,
	               |	ВозвратыТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ВозвратыТоварыУслуги КАК ВозвратыТоварыУслуги
	               |ГДЕ
	               |	НЕ ВозвратыТоварыУслуги.НоменклатураНоменклатура.ТипНоменклатуры В (&ПризнакиПредметаРасчетаТовары)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные) КАК ТипОплаты,
	               |	ДанныеЧековОплатаНаличными.Сумма КАК Сумма,
	               |	0 КАК СуммаКомиссии
	               |ПОМЕСТИТЬ ПродажиПлатежногоАгента
	               |ИЗ
	               |	ДанныеЧековОплатаНаличными КАК ДанныеЧековОплатаНаличными
	               |ГДЕ
	               |	НЕ ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента = &ПустыеПараметрыДоговораПлатежногоАгента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта),
	               |	ДанныеЧековОплатаПлатежнымиКартами.Сумма,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СуммаКомиссии
	               |ИЗ
	               |	ДанныеЧековОплатаПлатежнымиКартами КАК ДанныеЧековОплатаПлатежнымиКартами
	               |ГДЕ
	               |	НЕ ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента = &ПустыеПараметрыДоговораПлатежногоАгента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиПлатежногоАгента.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ПродажиПлатежногоАгента.ТипОплаты КАК ТипОплаты,
	               |	СУММА(ПродажиПлатежногоАгента.Сумма) КАК Сумма,
	               |	СУММА(ПродажиПлатежногоАгента.СуммаКомиссии) КАК СуммаКомиссии,
	               |	СУММА(ВЫРАЗИТЬ(ПродажиПлатежногоАгента.ПараметрыДоговораПлатежногоАгента.ПроцентКомиссионногоВознаграждения * ПродажиПлатежногоАгента.Сумма / 100 КАК ЧИСЛО(15, 2))) КАК СуммаВознаграждения
	               |ИЗ
	               |	ПродажиПлатежногоАгента КАК ПродажиПлатежногоАгента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиПлатежногоАгента.ПараметрыДоговораПлатежногоАгента,
	               |	ПродажиПлатежногоАгента.ТипОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧекККМ.Ссылка КАК Чек
	               |ИЗ
	               |	Документ.ЧекККМ КАК ЧекККМ
	               |ГДЕ
	               |	ЧекККМ.Ссылка В(&ДокументыЧеки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧекККМНаВозврат.Ссылка КАК Чек
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
	               |ГДЕ
	               |	ЧекККМНаВозврат.Ссылка В(&ДокументыЧекиНаВозврат)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты КАК ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Всего) КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ПОМЕСТИТЬ ПродажиПоСтавкамНДС
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&ДокументыЧеки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС),
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.Всего),
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаВозврат)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДС.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДС.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ КАК ТипОплаты,
	               |	ПродажиПоСтавкамНДС.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиПоСтавкамНДС.СуммаНДС) КАК СуммаНДС,
	               |	ПродажиПоСтавкамНДС.Сумма КАК Сумма,
	               |	ПродажиПоСтавкамНДС.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДС.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ИЗ
	               |	ПродажиПоСтавкамНДС КАК ПродажиПоСтавкамНДС
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиПоСтавкамНДС.СтавкаНДС,
	               |	ПродажиПоСтавкамНДС.Сумма,
	               |	ПродажиПоСтавкамНДС.ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДС.СтатьяАналитикиОплаты,
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДС.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДС.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	СтавкаНДС,
	               |	СтатьяАналитикиОплаты,
	               |	ТипОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты КАК ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Всего) КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ПОМЕСТИТЬ ПродажиПоСтавкамНДСПредоплата
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаПредоплатуДляНДС)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС),
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.Всего),
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаВозвратПредоплатыДляНДС)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ КАК ТипОплаты,
	               |	ПродажиПоСтавкамНДСПредоплата.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиПоСтавкамНДСПредоплата.СуммаНДС) КАК СуммаНДС,
	               |	ПродажиПоСтавкамНДСПредоплата.Сумма КАК Сумма,
	               |	ПродажиПоСтавкамНДСПредоплата.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДСПредоплата.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ИЗ
	               |	ПродажиПоСтавкамНДСПредоплата КАК ПродажиПоСтавкамНДСПредоплата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиПоСтавкамНДСПредоплата.СтавкаНДС,
	               |	ПродажиПоСтавкамНДСПредоплата.Сумма,
	               |	ПродажиПоСтавкамНДСПредоплата.ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДСПредоплата.СтатьяАналитикиОплаты,
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	СтавкаНДС,
	               |	СтатьяАналитикиОплаты,
	               |	ТипОплаты";
	               				   
	ПризнакиПредметаРасчетаТовары = РозничныеПродажиБГУ.ПризнакиПредметаРасчетаТовары();
	
	ЗначенияРеквизитовСмены = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассоваяСмена, "КассаККМ");
	КассаККМ = ЗначенияРеквизитовСмены.КассаККМ;
	
	ЗначенияРеквизитовКассы 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ, "КонтрагентДляРозничныхПродаж, ДоговорДляРозничныхПродаж, УчетПоПодразделениям");
	КонтрагентДляРозничныхПродаж 	= ЗначенияРеквизитовКассы.КонтрагентДляРозничныхПродаж;
	ДоговорДляРозничныхПродаж 		= ЗначенияРеквизитовКассы.ДоговорДляРозничныхПродаж;
	УчетПоПодразделениям            = ЗначенияРеквизитовКассы.УчетПоПодразделениям;
		
	Запрос.УстановитьПараметр("ДокументыЧеки"							, ДокументыЧеки);
	Запрос.УстановитьПараметр("ДокументыЧекиНаВозврат"					, ДокументыЧекиНаВозврат);
	Запрос.УстановитьПараметр("ДокументыЧекиНаПредоплату"				, ДокументыЧекиНаПредоплату);
	Запрос.УстановитьПараметр("ДокументыЧекиНаВозвратПредоплаты"		, ДокументыЧекиНаВозвратПредоплаты);
	Запрос.УстановитьПараметр("ДокументыЧекиНаПредоплатуДляНДС"			, ЧекиПредоплаты.ВыгрузитьКолонку("Чек"));
	Запрос.УстановитьПараметр("ДокументыЧекиНаВозвратПредоплатыДляНДС"	, ЧекиВозвратаПредоплаты.ВыгрузитьКолонку("Чек"));
	Запрос.УстановитьПараметр("КассоваяСмена"							, КассоваяСмена);
	Запрос.УстановитьПараметр("КонтрагентДляРозничныхПродаж"			, КонтрагентДляРозничныхПродаж);
	Запрос.УстановитьПараметр("ДоговорДляРозничныхПродаж"				, ДоговорДляРозничныхПродаж);
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит"						, Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("ПризнакиПредметаРасчетаТовары"			, ПризнакиПредметаРасчетаТовары);
	Запрос.УстановитьПараметр("ПустыеПараметрыДоговораПлатежногоАгента"	, Справочники.ПараметрыДоговораПлатежногоАгента.ПустаяСсылка());
	Запрос.УстановитьПараметр("УчетПоПодразделениям"					, УчетПоПодразделениям);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ТаблицаПоОплатеНаличными = Результаты[1].Выгрузить();
	
	ТаблицаПоОплатеПлатежнымиКартами = Результаты[3].Выгрузить();
	
	ТаблицаТовары = Результаты[5].Выгрузить();
	ТаблицаРаботыУслуги = Результаты[6].Выгрузить();
	
	ТаблицаВозвратыТовары = Результаты[8].Выгрузить();
	ТаблицаОтменыРаботыУслуги = Результаты[9].Выгрузить();
	
	ПродажиПоДоговорамПлатежныхАгентов = Результаты[11].Выгрузить();
	
	ЧекиККМ = Результаты[12].Выгрузить();
	ЧекиККМНаВозврат = Результаты[13].Выгрузить();
	
	ПродажиПоСтавкамНДС = Результаты[15].Выгрузить();
	
	Объект.ОплатаНаличными.Загрузить(ТаблицаПоОплатеНаличными);
	Объект.ОплатаПлатежнымиКартами.Загрузить(ТаблицаПоОплатеПлатежнымиКартами);
	
	Объект.ПродажиРаботыУслуги.Загрузить(ТаблицаРаботыУслуги);
	Объект.ПродажиТовары.Загрузить(ТаблицаТовары);
	
	Объект.ОтменаРаботыУслуги.Загрузить(ТаблицаОтменыРаботыУслуги);
	Объект.ВозвратТовары.Загрузить(ТаблицаВозвратыТовары);
	
	Объект.ПродажиПлатежногоАгента.Загрузить(ПродажиПоДоговорамПлатежныхАгентов);
	
	Объект.ЧекиККМ.Загрузить(ЧекиККМ);
	Объект.ЧекиККМНаВозврат.Загрузить(ЧекиККМНаВозврат);
	
	Объект.ПродажиПоСтавкамНДС.Загрузить(ПродажиПоСтавкамНДС);
	
	Объект.ЧекиККМПредоплата.Загрузить(ЧекиПредоплаты);
	Объект.ЧекиККМНаВозвратПредоплата.Загрузить(ЧекиВозвратаПредоплаты);
	
	Объект.ПродажиПоСтавкамНДСПредоплата.Загрузить(Результаты[17].Выгрузить());  
	
	Если КассаККМ.ИспользоватьОплатуЭС Тогда 
		ДополнитьДаннымиОплатыЭС(КассоваяСмена);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымЧековНаСервереЗаДень()
	
	ДокументыЧеки 						= ЧекиДляЗаполнения(Истина);
	ДокументыЧекиНаВозврат 				= ЧекиВозвратаДляЗаполнения(Истина);
	ДокументыЧекиНаПредоплату 			= ЧекиСПредоплатойДляЗаполнения(Истина);
	ДокументыЧекиНаВозвратПредоплаты 	= ЧекиВозвратаСПредоплатойДляЗаполнения(Истина);
	ЧекиПредоплаты						= ЧекиПредоплаты(Истина);
	ЧекиВозвратаПредоплаты				= ЧекиВозвратаПредоплаты(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа) КАК ВидОперации,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ЧекККМРасшифровкаОплаты.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	ЧекККМРасшифровкаОплаты.Сумма КАК Сумма,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМРасшифровкаОплаты.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ КАК Подразделение
	               |ПОМЕСТИТЬ ДанныеЧековОплатаНаличными
	               |ИЗ
	               |	Документ.ЧекККМ.РасшифровкаОплаты КАК ЧекККМРасшифровкаОплаты
	               |ГДЕ
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ФормаОплаты = 0
	               |	И ЧекККМРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаПредоплату)
	               |	И ЧекККМРасшифровкаОплаты.Сумма > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат),
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.СтатьяАналитикиОплаты,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.Сумма,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.РасшифровкаОплаты КАК ЧекККМНаВозвратРасшифровкаОплаты
	               |ГДЕ
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ФормаОплаты = 0
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаВозвратПредоплаты)
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Сумма > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаНаличными.ВидОперации КАК ВидОперации,
	               |	ДанныеЧековОплатаНаличными.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаНаличными.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаНаличными.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ДанныеЧековОплатаНаличными.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ДанныеЧековОплатаНаличными.Сумма) КАК Сумма,
	               |	ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаНаличными.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.Подразделение КАК Подразделение,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов
	               |ИЗ
	               |	ДанныеЧековОплатаНаличными КАК ДанныеЧековОплатаНаличными
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеЧековОплатаНаличными.СтатьяАналитикиОплаты,
	               |	ДанныеЧековОплатаНаличными.Контрагент,
	               |	ДанныеЧековОплатаНаличными.Договор,
	               |	ДанныеЧековОплатаНаличными.СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.ВидОперации,
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента,
	               |	ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаНаличными.ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидОперации,
	               |	Контрагент,
	               |	Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа) КАК ВидОперации,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ЧекККМРасшифровкаОплаты.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	ЧекККМРасшифровкаОплаты.Сумма КАК Сумма,
	               |	ЧекККМРасшифровкаОплаты.СуммаКомиссии КАК СуммаКомиссии,
	               |	ЧекККМОплата.ПараметрыДоговораЭквайринга КАК ПараметрыДоговораЭквайринга,
	               |	ЧекККМОплата.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМОплата.ПроцентКомиссии КАК ПроцентКомиссии,
	               |	ЧекККМОплата.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	               |	ЧекККМОплата.Ссылка.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМОплата.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ КАК Подразделение
	               |ПОМЕСТИТЬ ДанныеЧековОплатаПлатежнымиКартами
	               |ИЗ
	               |	Документ.ЧекККМ.РасшифровкаОплаты КАК ЧекККМРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Оплата КАК ЧекККМОплата
	               |		ПО ЧекККМРасшифровкаОплаты.Ссылка = ЧекККМОплата.Ссылка
	               |			И ЧекККМРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМОплата.КлючСвязиОплаты
	               |ГДЕ
	               |	(ЧекККМРасшифровкаОплаты.Ссылка.ФормаОплаты = 1
	               |			ИЛИ ЧекККМРасшифровкаОплаты.Ссылка.ФормаОплаты = 2)
	               |	И ЧекККМРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаПредоплату)
	               |	И ЧекККМРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМОплата.Ссылка В(&ДокументыЧекиНаПредоплату)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат),
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.СтатьяАналитикиОплаты,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.Сумма,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.СуммаКомиссии,
	               |	ЧекККМНаВозвратОплата.ПараметрыДоговораЭквайринга,
	               |	ЧекККМНаВозвратОплата.ЭквайринговыйТерминал,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратОплата.ПроцентКомиссии,
	               |	ЧекККМНаВозвратОплата.ВидПлатежнойКарты,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМНаВозвратОплата.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.РасшифровкаОплаты КАК ЧекККМНаВозвратРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМНаВозврат.Оплата КАК ЧекККМНаВозвратОплата
	               |		ПО ЧекККМНаВозвратРасшифровкаОплаты.Ссылка = ЧекККМНаВозвратОплата.Ссылка
	               |			И ЧекККМНаВозвратРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМНаВозвратОплата.КлючСвязиОплаты
	               |ГДЕ
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ФормаОплаты = 1
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Ссылка В(&ДокументыЧекиНаВозвратПредоплаты)
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМНаВозвратОплата.Ссылка В(&ДокументыЧекиНаВозвратПредоплаты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидОперации КАК ВидОперации,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаПлатежнымиКартами.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаПлатежнымиКартами.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ДанныеЧековОплатаПлатежнымиКартами.Сумма) КАК Сумма,
	               |	СУММА(ДанныеЧековОплатаПлатежнымиКартами.СуммаКомиссии) КАК СуммаКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораЭквайринга КАК ПараметрыДоговораЭквайринга,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПроцентКомиссии КАК ПроцентКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Подразделение КАК Подразделение,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов
	               |ИЗ
	               |	ДанныеЧековОплатаПлатежнымиКартами КАК ДанныеЧековОплатаПлатежнымиКартами
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Договор,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Контрагент,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СтатьяАналитикиОплаты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораЭквайринга,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидОперации,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПроцентКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидПлатежнойКарты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидОперации,
	               |	Контрагент,
	               |	Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ЧекККМТоварыРаботыУслуги.Номенклатура КАК Справочник.Прейскурант).Номенклатура КАК СоответствующаяНоменклатура,
	               |	ЧекККМТоварыРаботыУслуги.Количество КАК Количество,
	               |	ЧекККМТоварыРаботыУслуги.Цена КАК Цена,
	               |	ЧекККМТоварыРаботыУслуги.Сумма КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Всего КАК Всего,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ПОМЕСТИТЬ ПродажиТоварыУслуги
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&ДокументыЧеки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура КАК СоответствующаяНоменклатура,
	               |	СУММА(ПродажиТоварыУслуги.Количество) КАК Количество,
	               |	ПродажиТоварыУслуги.Цена КАК Цена,
	               |	СУММА(ПродажиТоварыУслуги.Сумма) КАК Сумма,
	               |	ПродажиТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиТоварыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ПродажиТоварыУслуги.Всего) КАК Всего,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ПродажиТоварыУслуги КАК ПродажиТоварыУслуги
	               |ГДЕ
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура.ТипНоменклатуры В(&ПризнакиПредметаРасчетаТовары)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиТоварыУслуги.СтавкаНДС,
	               |	ПродажиТоварыУслуги.Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура,
	               |	ПродажиТоварыУслуги.Цена,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура КАК СоответствующаяНоменклатура,
	               |	СУММА(ПродажиТоварыУслуги.Количество) КАК Количество,
	               |	ПродажиТоварыУслуги.Цена КАК Цена,
	               |	СУММА(ПродажиТоварыУслуги.Сумма) КАК Сумма,
	               |	ПродажиТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиТоварыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ПродажиТоварыУслуги.Всего) КАК Всего,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ПродажиТоварыУслуги КАК ПродажиТоварыУслуги
	               |ГДЕ
	               |	НЕ ПродажиТоварыУслуги.СоответствующаяНоменклатура.ТипНоменклатуры В (&ПризнакиПредметаРасчетаТовары)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиТоварыУслуги.СтавкаНДС,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура,
	               |	ПродажиТоварыУслуги.Номенклатура,
	               |	ПродажиТоварыУслуги.Цена,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.Номенклатура КАК НоменклатураНоменклатура,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Количество КАК Количество,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Цена КАК Цена,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Сумма КАК Сумма,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Всего КАК Всего,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ПОМЕСТИТЬ ВозвратыТоварыУслуги
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаВозврат)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыТоварыУслуги.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ВозвратыТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура КАК НоменклатураНоменклатура,
	               |	ВозвратыТоварыУслуги.Количество КАК Количество,
	               |	ВозвратыТоварыУслуги.Цена КАК Цена,
	               |	ВозвратыТоварыУслуги.Сумма КАК Сумма,
	               |	ВозвратыТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ВозвратыТоварыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ВозвратыТоварыУслуги.Всего КАК Всего,
	               |	ВозвратыТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ВозвратыТоварыУслуги КАК ВозвратыТоварыУслуги
	               |ГДЕ
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура.ТипНоменклатуры В(&ПризнакиПредметаРасчетаТовары)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыТоварыУслуги.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ВозвратыТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура КАК НоменклатураНоменклатура,
	               |	ВозвратыТоварыУслуги.Количество КАК Количество,
	               |	ВозвратыТоварыУслуги.Цена КАК Цена,
	               |	ВозвратыТоварыУслуги.Сумма КАК Сумма,
	               |	ВозвратыТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ВозвратыТоварыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ВозвратыТоварыУслуги.Всего КАК Всего,
	               |	ВозвратыТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ВозвратыТоварыУслуги КАК ВозвратыТоварыУслуги
	               |ГДЕ
	               |	НЕ ВозвратыТоварыУслуги.НоменклатураНоменклатура.ТипНоменклатуры В (&ПризнакиПредметаРасчетаТовары)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные) КАК ТипОплаты,
	               |	ДанныеЧековОплатаНаличными.Сумма КАК Сумма,
	               |	0 КАК СуммаКомиссии
	               |ПОМЕСТИТЬ ПродажиПлатежногоАгента
	               |ИЗ
	               |	ДанныеЧековОплатаНаличными КАК ДанныеЧековОплатаНаличными
	               |ГДЕ
	               |	НЕ ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента = &ПустыеПараметрыДоговораПлатежногоАгента
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента,
	               |	ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта),
	               |	ДанныеЧековОплатаПлатежнымиКартами.Сумма,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СуммаКомиссии
	               |ИЗ
	               |	ДанныеЧековОплатаПлатежнымиКартами КАК ДанныеЧековОплатаПлатежнымиКартами
	               |ГДЕ
	               |	НЕ ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента = &ПустыеПараметрыДоговораПлатежногоАгента
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиПлатежногоАгента.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ПродажиПлатежногоАгента.ТипОплаты КАК ТипОплаты,
	               |	СУММА(ПродажиПлатежногоАгента.Сумма) КАК Сумма,
	               |	СУММА(ПродажиПлатежногоАгента.СуммаКомиссии) КАК СуммаКомиссии,
	               |	СУММА(ВЫРАЗИТЬ(ПродажиПлатежногоАгента.ПараметрыДоговораПлатежногоАгента.ПроцентКомиссионногоВознаграждения * ПродажиПлатежногоАгента.Сумма / 100 КАК ЧИСЛО(15, 2))) КАК СуммаВознаграждения
	               |ИЗ
	               |	ПродажиПлатежногоАгента КАК ПродажиПлатежногоАгента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиПлатежногоАгента.ПараметрыДоговораПлатежногоАгента,
	               |	ПродажиПлатежногоАгента.ТипОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧекККМ.Ссылка КАК Чек
	               |ИЗ
	               |	Документ.ЧекККМ КАК ЧекККМ
	               |ГДЕ
	               |	ЧекККМ.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ЧекККМ.Ссылка В(&ДокументыЧеки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЧекККМНаВозврат.Ссылка КАК Чек
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
	               |ГДЕ
	               |	ЧекККМНаВозврат.Ссылка В(&ДокументыЧекиНаВозврат)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты КАК ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Всего) КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ПОМЕСТИТЬ ПродажиПоСтавкамНДС
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&ДокументыЧеки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС),
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.Всего),
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаВозврат)
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДС.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДС.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ КАК ТипОплаты,
	               |	ПродажиПоСтавкамНДС.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиПоСтавкамНДС.СуммаНДС) КАК СуммаНДС,
	               |	ПродажиПоСтавкамНДС.Сумма КАК Сумма,
	               |	ПродажиПоСтавкамНДС.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДС.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ИЗ
	               |	ПродажиПоСтавкамНДС КАК ПродажиПоСтавкамНДС
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиПоСтавкамНДС.СтавкаНДС,
	               |	ПродажиПоСтавкамНДС.Сумма,
	               |	ПродажиПоСтавкамНДС.ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДС.СтатьяАналитикиОплаты,
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДС.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДС.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	СтавкаНДС,
	               |	СтатьяАналитикиОплаты,
	               |	ТипОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты КАК ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Всего) КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ПОМЕСТИТЬ ПродажиПоСтавкамНДСПредоплата
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаПредоплатуДляНДС)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС),
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.Всего),
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ДокументыЧекиНаВозвратПредоплатыДляНДС)
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ КАК ТипОплаты,
	               |	ПродажиПоСтавкамНДСПредоплата.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиПоСтавкамНДСПредоплата.СуммаНДС) КАК СуммаНДС,
	               |	ПродажиПоСтавкамНДСПредоплата.Сумма КАК Сумма,
	               |	ПродажиПоСтавкамНДСПредоплата.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДСПредоплата.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты
	               |ИЗ
	               |	ПродажиПоСтавкамНДСПредоплата КАК ПродажиПоСтавкамНДСПредоплата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиПоСтавкамНДСПредоплата.СтавкаНДС,
	               |	ПродажиПоСтавкамНДСПредоплата.Сумма,
	               |	ПродажиПоСтавкамНДСПредоплата.ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДСПредоплата.СтатьяАналитикиОплаты,
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДСПредоплата.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	СтавкаНДС,
	               |	СтатьяАналитикиОплаты,
	               |	ТипОплаты";
	               				   
	ПризнакиПредметаРасчетаТовары = РозничныеПродажиБГУ.ПризнакиПредметаРасчетаТовары();
	
	ЗначенияРеквизитовКассы 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КассаККМ, "КонтрагентДляРозничныхПродаж, ДоговорДляРозничныхПродаж, УчетПоПодразделениям");
	КонтрагентДляРозничныхПродаж 	= ЗначенияРеквизитовКассы.КонтрагентДляРозничныхПродаж;
	ДоговорДляРозничныхПродаж 		= ЗначенияРеквизитовКассы.ДоговорДляРозничныхПродаж;
	УчетПоПодразделениям            = ЗначенияРеквизитовКассы.УчетПоПодразделениям;
		
	Запрос.УстановитьПараметр("ДокументыЧеки"							, ДокументыЧеки);
	Запрос.УстановитьПараметр("ДокументыЧекиНаВозврат"					, ДокументыЧекиНаВозврат);
	Запрос.УстановитьПараметр("ДокументыЧекиНаПредоплату"				, ДокументыЧекиНаПредоплату);
	Запрос.УстановитьПараметр("ДокументыЧекиНаВозвратПредоплаты"		, ДокументыЧекиНаВозвратПредоплаты);
	Запрос.УстановитьПараметр("ДокументыЧекиНаПредоплатуДляНДС"			, ЧекиПредоплаты.ВыгрузитьКолонку("Чек"));
	Запрос.УстановитьПараметр("ДокументыЧекиНаВозвратПредоплатыДляНДС"	, ЧекиВозвратаПредоплаты.ВыгрузитьКолонку("Чек"));
	Запрос.УстановитьПараметр("КассаККМ"								, Объект.КассаККМ);
	Запрос.УстановитьПараметр("КонтрагентДляРозничныхПродаж"			, КонтрагентДляРозничныхПродаж);
	Запрос.УстановитьПараметр("ДоговорДляРозничныхПродаж"				, ДоговорДляРозничныхПродаж);
	
	Запрос.УстановитьПараметр("ДатаСведений"							, НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит"						, Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("ПризнакиПредметаРасчетаТовары"			, ПризнакиПредметаРасчетаТовары);
	Запрос.УстановитьПараметр("ПустыеПараметрыДоговораПлатежногоАгента"	, Справочники.ПараметрыДоговораПлатежногоАгента.ПустаяСсылка());
	Запрос.УстановитьПараметр("УчетПоПодразделениям"					, УчетПоПодразделениям);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ТаблицаПоОплатеНаличными = Результаты[1].Выгрузить();
	
	ТаблицаПоОплатеПлатежнымиКартами = Результаты[3].Выгрузить();
	
	ТаблицаТовары = Результаты[5].Выгрузить();
	ТаблицаРаботыУслуги = Результаты[6].Выгрузить();
	
	ТаблицаВозвратыТовары = Результаты[8].Выгрузить();
	ТаблицаОтменыРаботыУслуги = Результаты[9].Выгрузить();
	
	ПродажиПоДоговорамПлатежныхАгентов = Результаты[11].Выгрузить();
	
	ЧекиККМ = Результаты[12].Выгрузить();
	ЧекиККМНаВозврат = Результаты[13].Выгрузить();
	
	ПродажиПоСтавкамНДС = Результаты[15].Выгрузить();
	
	Объект.ОплатаНаличными.Загрузить(ТаблицаПоОплатеНаличными);
	Объект.ОплатаПлатежнымиКартами.Загрузить(ТаблицаПоОплатеПлатежнымиКартами);
	
	Объект.ПродажиРаботыУслуги.Загрузить(ТаблицаРаботыУслуги);
	Объект.ПродажиТовары.Загрузить(ТаблицаТовары);
	
	Объект.ОтменаРаботыУслуги.Загрузить(ТаблицаОтменыРаботыУслуги);
	Объект.ВозвратТовары.Загрузить(ТаблицаВозвратыТовары);
	
	Объект.ПродажиПлатежногоАгента.Загрузить(ПродажиПоДоговорамПлатежныхАгентов);
	
	Объект.ЧекиККМ.Загрузить(ЧекиККМ);
	Объект.ЧекиККМНаВозврат.Загрузить(ЧекиККМНаВозврат);
	
	Объект.ПродажиПоСтавкамНДС.Загрузить(ПродажиПоСтавкамНДС);
	
	Объект.ЧекиККМПредоплата.Загрузить(ЧекиПредоплаты);
	Объект.ЧекиККМНаВозвратПредоплата.Загрузить(ЧекиВозвратаПредоплаты);
	
	Объект.ПродажиПоСтавкамНДСПредоплата.Загрузить(Результаты[17].Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеДляПечатиЧековККМ(ИзмененаОрганизация = Ложь)

	РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
	НастройкиОборудования = ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьНастройкиОборудования(РабочееМесто, Объект.Организация);
	Если НЕ ЗначениеЗаполнено(Объект.КассаККМ) ИЛИ ИзмененаОрганизация Тогда
		Объект.КассаККМ = НастройкиОборудования.ФискальныйРегистратор;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.КассоваяСмена) Тогда
		Объект.КассоваяСмена = РозничныеПродажиБГУ.ПоследняяКассоваяСмена(Объект.Организация, Объект.КассаККМ);	
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьИтогиОплаты()
	РассчитатьИтогиОплатыНаличными();	
	РассчитатьИтогиОплатыПлатежнымиКартами();
КонецПроцедуры	

&НаСервере
Процедура РассчитатьИтогиОплатыНаличными()
	
	ИтогОплатыНаличнымиВсего = Объект.ОплатаНаличными.Итог("Сумма");
	ИтогОплатыНаличнымиВозвраты = 0;
	ИтогОплатыНаличнымиПродажи = 0;
	
	ОплатаНаличными = Объект.ОплатаНаличными.Выгрузить();
	
	ОплатаНаличными.Свернуть("ВидОперации", "Сумма");
	
	Для каждого ТекСтрока Из ОплатаНаличными Цикл
		Если ТекСтрока.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
			ИтогОплатыНаличнымиВозвраты = ТекСтрока.Сумма;
		Иначе
			ИтогОплатыНаличнымиПродажи = ТекСтрока.Сумма;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьИтогиОплатыПлатежнымиКартами()
	
	ИтогОплатыПлатежныеКартыВсего 		= Объект.ОплатаПлатежнымиКартами.Итог("Сумма");
	ИтогОплатыПлатежныеКартыВозвраты 	= 0;
	ИтогОплатыПлатежныеКартыПродажи 	= 0;
	
	ОплатаПлатежнымиКартами = Объект.ОплатаПлатежнымиКартами.Выгрузить();
	
	ОплатаПлатежнымиКартами.Свернуть("ВидОперации", "Сумма");
	
	Для каждого ТекСтрока Из ОплатаПлатежнымиКартами Цикл
		Если ТекСтрока.ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат Тогда
			ИтогОплатыПлатежныеКартыВозвраты = ТекСтрока.Сумма;
		Иначе
			ИтогОплатыПлатежныеКартыПродажи = ТекСтрока.Сумма;
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиНДС()
	
	ИтогНДСВсего = Объект.ПродажиПоСтавкамНДС.Итог("СуммаНДС");
	ИтогНДСНаличными = 0;
	ИтогНДСПлатежнымиКартами = 0;
	
	ИтогНДССуммаВсего = Объект.ПродажиПоСтавкамНДС.Итог("Сумма");
	ИтогНДССуммаНаличными = 0;
	ИтогНДССуммаПлатежнымиКартами = 0;
	
	ТЗ_ПродажиПоСтавкамНДС = Объект.ПродажиПоСтавкамНДС.Выгрузить();
	
	ТЗ_ПродажиПоСтавкамНДС.Свернуть("ТипОплаты", "СуммаНДС, Сумма");
	
	Для каждого ТекСтрока Из ТЗ_ПродажиПоСтавкамНДС Цикл
		Если ТекСтрока.ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
			ИтогНДСПлатежнымиКартами = ТекСтрока.СуммаНДС;
			ИтогНДССуммаПлатежнымиКартами = ТекСтрока.Сумма;
		Иначе
			ИтогНДСНаличными = ТекСтрока.СуммаНДС;
			ИтогНДССуммаНаличными = ТекСтрока.Сумма;
		КонецЕсли;	
	КонецЦикла;
	
	ИтогНДСПредоплатаВсего 		= Объект.ПродажиПоСтавкамНДСПредоплата.Итог("СуммаНДС");
	ИтогНДССуммаПредоплатаВсего = Объект.ПродажиПоСтавкамНДСПредоплата.Итог("Сумма");
	
КонецПроцедуры	

&НаСервере
Процедура РассчитатьИтогиПродажиТовары()
	
	ИтогРеализацияТоваровВозвратыСумма 		= Объект.ВозвратТовары.Итог("Всего");
	ИтогРеализацияТоваровПродажиСумма 		= Объект.ПродажиТовары.Итог("Всего");
	ИтогРеализацияТоваровВсегоСумма 		= ИтогРеализацияТоваровПродажиСумма - ИтогРеализацияТоваровВозвратыСумма;
	
	ИтогРеализацияТоваровВозвратыКоличество = Объект.ВозвратТовары.Итог("Количество");
	ИтогРеализацияТоваровПродажиКоличество 	= Объект.ПродажиТовары.Итог("Количество");
	ИтогРеализацияТоваровВсегоКоличество 	= ИтогРеализацияТоваровПродажиКоличество - ИтогРеализацияТоваровВозвратыКоличество;
		
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиПродажиРаботыУслуги()
	
	ИтогРеализацияРаботУслугВозвратыСумма 		= Объект.ОтменаРаботыУслуги.Итог("Всего");
	ИтогРеализацияРаботУслугПродажиСумма 		= Объект.ПродажиРаботыУслуги.Итог("Всего");
	ИтогРеализацияРаботУслугВсегоСумма 			= ИтогРеализацияРаботУслугПродажиСумма - ИтогРеализацияРаботУслугВозвратыСумма;
	
	ИтогРеализацияРаботУслугВозвратыКоличество	= Объект.ОтменаРаботыУслуги.Итог("Количество");
	ИтогРеализацияРаботУслугПродажиКоличество 	= Объект.ПродажиРаботыУслуги.Итог("Количество");
	ИтогРеализацияРаботУслугВсегоКоличество 	= ИтогРеализацияРаботУслугПродажиКоличество - ИтогРеализацияРаботУслугВозвратыКоличество;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуДокументаНаСервере()
	
	Объект.СуммаДокумента = Объект.ОплатаНаличными.Итог("Сумма");
	Объект.СуммаПродажНаличнымиРозничнымПокупателям = ВсегоРозницаНаличными();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭквайринговуюОперациюНаКлиенте()
	
	ТекущиеДанные = Элементы.ОплатаПлатежнымиКартами.ТекущиеДанные;
	
	СуммаЭквайринговыхОперацийДляОтчета = СуммаЭквайринговыхОперацийДляОтчета();
	Если СуммаЭквайринговыхОперацийДляОтчета >= Объект.ОплатаПлатежнымиКартами.Итог("Сумма") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Введены эквайринговые операции на всю сумму оплаты платежными картами!'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбрана строка для создания эквайринговой операции!'");
		Сообщение.Сообщить();
		
		Возврат;
	ИначеЕсли ТекущиеДанные.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Операция возврата в пределах кассовой смены не требует отдельной операции учитывается 
		|как уменьшение суммы продаж и комиссии в эквайринговой операции по строке продаж!'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;	

	СуммаДокумента = ТекущиеДанные.Сумма;
	СуммаКомиссии = ТекущиеДанные.СуммаКомиссии;
	
	ДанныеВозврата = ПолучитьСвденияОВозвратеПоСтроке(ТекущиеДанные);
	
	Если ДанныеВозврата.Сумма<>0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Сумма эквайринговой операции скорректирована на сумму возврата!'");
		Сообщение.Сообщить();
	Конецесли;	
	
	СуммаДокумента = ТекущиеДанные.Сумма + ДанныеВозврата.Сумма;
	СуммаКомиссии = ТекущиеДанные.СуммаКомиссии + ДанныеВозврата.СуммаКомиссии;
	
	ПроцентКомиссии = ?(СуммаДокумента = 0, 0,СуммаКомиссии/(СуммаДокумента/100));
	
	ПараметрыДоговораЭквайринга = ТекущиеДанные.ПараметрыДоговораЭквайринга;
	
	ПараметрыНДСКомиссии = ПолучитьПараметрыНДСКомиссииБанка(ПараметрыДоговораЭквайринга, СуммаКомиссии);
		
	Если ТекущиеДанные.ПризнакСпособаРасчетаЧекаККМ = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная") ИЛИ
		 ТекущиеДанные.ПризнакСпособаРасчетаЧекаККМ = ПредопределенноеЗначение("Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная") Тогда 
		СпособПогашенияЗадолженности = ПредопределенноеЗначение("Перечисление.СпособыПогашенияЗадолженности.НеПогашать");
	Иначе	
		СпособПогашенияЗадолженности = ПредопределенноеЗначение("Перечисление.СпособыПогашенияЗадолженности.Автоматически");
	КонецЕсли;	
	
	СтруктураДанныхДокумента = Новый Структура;
	СтруктураДанныхДокумента.Вставить("ОтчетПоКассовойСмене"				, Объект.Ссылка);
	СтруктураДанныхДокумента.Вставить("Дата"								, Объект.Дата);
	СтруктураДанныхДокумента.Вставить("Организация"							, Объект.Организация);
	СтруктураДанныхДокумента.Вставить("ВидОперации"							, ТекущиеДанные.ВидОперации);
	СтруктураДанныхДокумента.Вставить("ПараметрыДоговораЭквайринга"			, ПараметрыДоговораЭквайринга);
	СтруктураДанныхДокумента.Вставить("СуммаДокумента"						, СуммаДокумента);
	СтруктураДанныхДокумента.Вставить("СуммаКомиссииБанка"					, СуммаКомиссии);
	СтруктураДанныхДокумента.Вставить("ПроцентКомиссииБанка"				, ПроцентКомиссии);
	СтруктураДанныхДокумента.Вставить("ЭквайринговыйТерминал"				, ТекущиеДанные.ЭквайринговыйТерминал);
	СтруктураДанныхДокумента.Вставить("Контрагент"							, ТекущиеДанные.Контрагент);
	СтруктураДанныхДокумента.Вставить("Договор"								, ТекущиеДанные.Договор);
	СтруктураДанныхДокумента.Вставить("Подразделение"						, ТекущиеДанные.Подразделение);
	СтруктураДанныхДокумента.Вставить("ЭтоРозничныйПокупатель"				, ТекущиеДанные.ЭтоРозничныйПокупатель);
	СтруктураДанныхДокумента.Вставить("ПроцентКомиссии"						, ТекущиеДанные.ПроцентКомиссии);
	СтруктураДанныхДокумента.Вставить("ВидПлатежнойКарты"					, ТекущиеДанные.ВидПлатежнойКарты);
	СтруктураДанныхДокумента.Вставить("СтатьяАналитикиОплаты"				, ТекущиеДанные.СтатьяАналитикиОплаты);
	СтруктураДанныхДокумента.Вставить("КоличествоОпераций"					, 1);
	СтруктураДанныхДокумента.Вставить("ВидПервичногоДокумента"				, "Отчет о закрытии смены");
	СтруктураДанныхДокумента.Вставить("КассоваяСмена"						, Объект.КассоваяСмена);
	СтруктураДанныхДокумента.Вставить("ПараметрыДоговораПлатежногоАгента"	, ТекущиеДанные.ПараметрыДоговораПлатежногоАгента);
	СтруктураДанныхДокумента.Вставить("ФискальныйРегистратор"				, Объект.КассаККМ);
	СтруктураДанныхДокумента.Вставить("ПризнакСпособаРасчетаЧекаККМ"		, ТекущиеДанные.ПризнакСпособаРасчетаЧекаККМ);
	СтруктураДанныхДокумента.Вставить("СпособПогашенияЗадолженности"		, СпособПогашенияЗадолженности);
	СтруктураДанныхДокумента.Вставить("ВидРасчетов"							, ТекущиеДанные.ВидРасчетов);
	СтруктураДанныхДокумента.Вставить("ОплатитьДо"							, ТекущиеДанные.ОплатитьДо);
	СтруктураДанныхДокумента.Вставить("СтавкаНДССКомиссииБанка"				, ПараметрыНДСКомиссии.СтавкаНДССКомисииБанка);
	СтруктураДанныхДокумента.Вставить("СуммаНДССКомиссииБанка"				, ПараметрыНДСКомиссии.СуммаНДССКомиссииБанка);
	СтруктураДанныхДокумента.Вставить("НДССКомиссииСверху"					, ПараметрыНДСКомиссии.НДССКомиссииСверху); 
	
	Если ПараметрыНДСКомиссии.НДССКомиссииСверху Тогда 
		СтруктураДанныхДокумента.ПроцентКомиссииБанка = ТекущиеДанные.ПроцентКомиссии;	
	КонецЕсли;	
		
	ОткрытьФорму("Документ.ЭквайринговаяОперация.Форма.ФормаДокумента", СтруктураДанныхДокумента);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСвденияОВозвратеПоСтроке(ТекСтрока)
	
	Сумма 			= 0;
	СуммаКомиссии 	= 0;
	ПроцентКомиссии = 0;
	
	ВидОперации 						= ПредопределенноеЗначение("Перечисление.ВидыОперацийЧекККМ.Возврат");
	СистемаНалогообложенияЧекаККМ 		= ТекСтрока.СистемаНалогообложенияЧекаККМ;
	ПараметрыДоговораПлатежногоАгента 	= ТекСтрока.ПараметрыДоговораПлатежногоАгента;
	СтатьяАналитикиОплаты 				= ТекСтрока.СтатьяАналитикиОплаты;
	ПараметрыДоговораЭквайринга 		= ТекСтрока.ПараметрыДоговораЭквайринга;
	Контрагент 							= ТекСтрока.Контрагент;
	Договор 							= ТекСтрока.Договор;
	ЭквайринговыйТерминал 				= ТекСтрока.ЭквайринговыйТерминал;
	ЭтоРозничныйПокупатель 				= ТекСтрока.ЭтоРозничныйПокупатель;
	ВидПлатежнойКарты 					= ТекСтрока.ВидПлатежнойКарты;
	ПризнакСпособаРасчетаЧекаККМ 		= ТекСтрока.ПризнакСпособаРасчетаЧекаККМ;
	
	ПараметрыОтбора = Новый Структура("ВидОперации, СистемаНалогообложенияЧекаККМ, ПараметрыДоговораПлатежногоАгента,
		|СтатьяАналитикиОплаты, ПараметрыДоговораЭквайринга, Контрагент, Договор,
		|ЭквайринговыйТерминал, ЭтоРозничныйПокупатель, ВидПлатежнойКарты, ПризнакСпособаРасчетаЧекаККМ", 
		ВидОперации, СистемаНалогообложенияЧекаККМ, ПараметрыДоговораПлатежногоАгента,
		СтатьяАналитикиОплаты, ПараметрыДоговораЭквайринга, Контрагент, Договор,
		ЭквайринговыйТерминал, ЭтоРозничныйПокупатель, ВидПлатежнойКарты, ПризнакСпособаРасчетаЧекаККМ); 	
	МассивВозвратов = Объект.ОплатаПлатежнымиКартами.НайтиСтроки(ПараметрыОтбора);
	
	Для каждого ТекОплата Из МассивВозвратов Цикл
		Сумма = Сумма + ТекОплата.Сумма;	
		СуммаКомиссии = СуммаКомиссии + ТекОплата.СуммаКомиссии;	
	КонецЦикла;
	ПроцентКомиссии = ?(Сумма = 0, 0,СуммаКомиссии/(Сумма/100));
	
	Результат = Новый Структура("Сумма, СуммаКомиссии, ПроцентКомиссии");
	Результат.Сумма = Сумма;
	Результат.СуммаКомиссии = СуммаКомиссии;
	Результат.ПроцентКомиссии = ПроцентКомиссии;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()

	УчетПоПодразделениям 			= Ложь;
	ВидимостьСведенийОЧеках 		= Ложь;
	ВидимостьКассовойСмены 			= Ложь;
	ВидимостьАктовОбОказанииУслуг 	= ПравоДоступа("Добавление", Метаданные.Документы.АктОбОказанииУслуг); 
	Если ЗначениеЗаполнено(Объект.КассаККМ) Тогда
		
		ТипОборудования = Объект.КассаККМ.ТипОборудования; 
		Если ТипОборудования = 0 Тогда 
			ВидимостьКассовойСмены = НЕ Объект.КассаККМ.ИспользоватьБезПодключенияОборудования;
		Иначе
			ПараметрыОбмена = ПолучитьПараметрыОбмена(Объект.КассаККМ);
			Если ПараметрыОбмена.Следующий() Тогда 
				ВидимостьКассовойСмены = ПараметрыОбмена.ЗагружатьКакЧекиККМ;
			КонецЕсли;	
		КонецЕсли;	
		ВидимостьСведенийОЧеках = ВидимостьКассовойСмены;
		
		УчетПоПодразделениям = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КассаККМ, "УчетПоПодразделениям");
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КассоваяСмена", "Видимость", ВидимостьКассовойСмены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"КассоваяСменаНомерСменыККТ", "Видимость", ВидимостьКассовойСмены);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НомерСмены", "Видимость", НЕ ВидимостьКассовойСмены);
	
	Если (Объект.ЧекиККМ.Количество()>0)ИЛИ(Объект.ЧекиККМНаВозврат.Количество()>0) Тогда
		ВидимостьСведенийОЧеках = Истина;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаЧекиККМ", "Видимость", ВидимостьСведенийОЧеках);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаЧекиККМНаПредоплату", "Видимость", ВидимостьСведенийОЧеках);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьОтражениеВУчетеКассы", "Видимость", Объект.ОплатаНаличными.Количество()>0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьОтражениеВУчетеЭквайринга", "Видимость", Объект.ОплатаПлатежнымиКартами.Количество()>0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"НадписьОтражениеВУчетеАктов", "Видимость",НЕ Объект.СуммаУслугКОтражению=0);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаАктыОбОказанииУслуг", "Видимость", ВидимостьАктовОбОказанииУслуг);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОплатаНаличнымиПодразделение", "Видимость", УчетПоПодразделениям);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ОплатаПлатежнымиКартамиПодразделение", "Видимость", УчетПоПодразделениям);
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	УстановитьДанныеДляПечатиЧековККМ(Истина);
	
КонецПроцедуры

&НаСервере
Функция ЕдинственныйСчетУчетаПродажЗаНаличные()
	
	Результат = Новый Структура("ИФО, КоличествоСчетовУчета, СчетУчета, Сумма, Подразделение", 
		Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка(), 0, Неопределено, 0, Справочники.Подразделения.ПустаяСсылка());
	
	ТаблицаОстатков = РозничныеПродажиБГУ.ТаблицаДанныхДляВводаПКО(Объект.Ссылка);
	
	Результат.КоличествоСчетовУчета = ТаблицаОстатков.Количество();	
	Если ТаблицаОстатков.Количество() = 1 Тогда
		Результат.КоличествоСчетовУчета = 1;	
		ЗаполнитьЗначенияСвойств(Результат, ТаблицаОстатков[0]);
	ИначеЕсли ТаблицаОстатков.Количество() > 1 Тогда
		Результат.Сумма = ТаблицаОстатков.Итог("Сумма");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция СуммаЭквайринговыхОперацийДляОтчета()
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭквайринговаяОперация.ДокументОснование КАК ДокументОснование,
	               |	СУММА(ЭквайринговаяОперация.СуммаДокумента) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ЭквайринговаяОперация КАК ЭквайринговаяОперация
	               |ГДЕ
	               |	ЭквайринговаяОперация.ПометкаУдаления = ЛОЖЬ
	               |	И ЭквайринговаяОперация.ДокументОснование = &ОтчетПоКассовойСмене
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЭквайринговаяОперация.ДокументОснование";
	
	Запрос.УстановитьПараметр("ОтчетПоКассовойСмене", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.СуммаДокумента;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СоздатьПриходныйКассовыйОрдерНаКлиенте()
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ не записан. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	СчетУчетаПродажЗаНаличные = ЕдинственныйСчетУчетаПродажЗаНаличные();
	Если (СчетУчетаПродажЗаНаличные.КоличествоСчетовУчета = 0) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Введены приходные кассовые ордеры на всю сумму наличных денежных средств!'");
		Сообщение.Сообщить();
		
		Возврат;
	ИначеЕсли СчетУчетаПродажЗаНаличные.КоличествоСчетовУчета = 1 Тогда	
		СоздатьНовыйДокументПКОНаКлиенте(СчетУчетаПродажЗаНаличные);
	Иначе
		Если (СчетУчетаПродажЗаНаличные.Сумма = 0) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru='Введены приходные кассовые ордеры на всю сумму наличных денежных средств!'");
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОтчетПоКассовойСмене", Объект.Ссылка);
		ОткрытьФорму("Документ.ОтчетПоКассовойСмене.Форма.ПомощникЗаполненияДокументовУчетаРозничныхПродаж", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьНовыйДокументПКОНаКлиенте(СчетУчетаПродажЗаНаличные)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтчетПоКассовойСмене", Объект.Ссылка);
	ПараметрыФормы.Вставить("СчетУчетаПродажЗаНаличные", СчетУчетаПродажЗаНаличные);
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражениеУчтенныхДенежныхСредств()
	НадписьОтражениеВУчетеКассы = ТекстОтраженияВУчетеКассы();
	НадписьОтражениеВУчетеЭквайринга = ТекстОтраженияВУчетеЭквайринга();
	НадписьОтражениеВУчетеАктов = ТекстОтраженияВУчетеАктов();
КонецПроцедуры

&НаСервере
Функция ТекстОтраженияВУчетеКассы()
	Результат = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриходныйКассовыйОрдер.ДокументОснование КАК ДокументОснование,
	|	ПриходныйКассовыйОрдер.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
	|	И ПриходныйКассовыйОрдер.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	ДокументыОтражения = Запрос.Выполнить().Выгрузить();
	СуммаОтраженияВучете = ДокументыОтражения.Итог("Сумма");
	
	Если Объект.ОплатаНаличными.Итог("Сумма") = СуммаОтраженияВучете Тогда
		Результат = НСтр("ru = 'Отражено в учете кассы на сумму: '") + Формат(СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(ВалютаРубли);
	Иначе
		Результат = НСтр("ru = 'Не отражено в учете кассы на сумму: '") + Формат(Объект.СуммаДокумента - СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(ВалютаРубли);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ТекстОтраженияВУчетеЭквайринга()
	Результат = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭквайринговаяОперация.ДокументОснование КАК ДокументОснование,
	|	ЭквайринговаяОперация.СуммаДокумента КАК Сумма
	|ИЗ
	|	Документ.ЭквайринговаяОперация КАК ЭквайринговаяОперация
	|ГДЕ
	|	ЭквайринговаяОперация.ПометкаУдаления = ЛОЖЬ
	|	И ЭквайринговаяОперация.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	ДокументыОтражения = Запрос.Выполнить().Выгрузить();
	СуммаОтраженияВучете = ДокументыОтражения.Итог("Сумма");
	
	Если Объект.ОплатаПлатежнымиКартами.Итог("Сумма") = СуммаОтраженияВучете Тогда
		Результат = НСтр("ru = 'Отражено в учете эквайринга на сумму: '") + Формат(СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(ВалютаРубли);
	Иначе
		Результат = НСтр("ru = 'Не отражено в учете эквайринга на сумму: '") + Формат(Объект.ОплатаПлатежнымиКартами.Итог("Сумма") - СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(ВалютаРубли);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ТекстОтраженияВУчетеАктов()
	
	Результат = "";
	
	УстановитьПривилегированныйРежим(Истина);
	
	СуммаОтраженияВучете = СуммаАктовОбОказанииУслуг(Объект.Ссылка);
	СуммаУслугКОтражению = Объект.СуммаУслугКОтражению;
	
	Если (СуммаУслугКОтражению = СуммаОтраженияВучете) Тогда
		Результат = НСтр("ru = 'Отражено в учете услуг на сумму: '") + Формат(СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(ВалютаРубли);
	Иначе
		Результат = НСтр("ru = 'Не отражено в учете услуг на сумму: '") + Формат(СуммаУслугКОтражению - СуммаОтраженияВучете, "ЧЦ=17; ЧДЦ=2") +" "+ Строка(ВалютаРубли);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьДокументыАктОбОказанииУслугНаСервере()
	
	Если  ЗначениеЗаполнено(Объект.Ссылка) Тогда 
				
		ДатаДокументов 		= Объект.Дата;
		Организация 		= Объект.Организация;
		ДокументСсылка 		= Объект.Ссылка;
		РеквизитыККМ 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.КассаККМ, "ТипЦены,СуммаВключаетНДС,ОперацияОтраженияУслуг,УчетПоПодразделениям, ПроводитьДокументыОтраженияУслуг");
		
		РезультатЗапроса 	= Документы.ОтчетПоКассовойСмене.ЗапросНоменклатураАктовОбОказанииУслуг(Объект);
		ДанныеДокументов 	= РезультатЗапроса[2].Выбрать();
		ДанныеПродаж 		= РезультатЗапроса[3].Выгрузить();
		
		Объект.СуммаУслугКОтражению = ДанныеПродаж.Итог("Всего");
		
		НовыйДокумент = Истина;
		
		Если ДанныеПродаж.Итог("Всего") = СуммаАктовОбОказанииУслуг(ДокументСсылка) Тогда 
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сумма оказанных услуг соответствует сумме документов ""Акт об оказании услуг"""
				+ ", созданных на основании отчета. Создание документов ""Акт об оказании услуг"" не требуется.'"))	
		Иначе 	
			Пока ДанныеДокументов.Следующий() Цикл 
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("Контрагент" 		, ДанныеДокументов.Контрагент);
				ПараметрыОтбора.Вставить("Договор" 			, ДанныеДокументов.Договор);
				ПараметрыОтбора.Вставить("СтатьяАналитики" 	, ДанныеДокументов.СтатьяАналитики);
				Если РеквизитыККМ.УчетПоПодразделениям Тогда 
					ПараметрыОтбора.Вставить("Подразделение" 	, ДанныеДокументов.Подразделение);	
				КонецЕсли;	
				ТаблицаПродаж = ДанныеПродаж.НайтиСтроки(ПараметрыОтбора);
				
				Если НовыйДокумент ИЛИ НЕ ДанныеДокументов.КомиссионнаяТорговля Тогда
					ДокументОбъект = Документы.АктОбОказанииУслуг.СоздатьДокумент();
					
					ЛицевойСчетОрганизиции = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация,
						"Документ.ЗаявкаНаВозврат", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский);
					Если ЗначениеЗаполнено(ЛицевойСчетОрганизиции.РеквизитыЛицевогоСчета) Тогда
						ДокументОбъект.РеквизитыЛицевогоСчета = ЛицевойСчетОрганизиции.РеквизитыЛицевогоСчета;
					КонецЕсли;   
					
					Если ЭлектронныеДокументыБГУ.УПДЗаполнятьДатуПередачиПоДатеДокументаРеализации(Объект.Организация) Тогда
						
						ДокументОбъект.ДатаПередачиТРУ = ДатаДокументов;
						ДокументОбъект.ТРУПереданы = Истина;
						
					КонецЕсли;  
					
					СведенияПоОтветственному = ЭлектронныеДокументыБГУ.ПолучитьСведенияОтветственныхЭлектронныУПД(Объект.Организация);
					
					Если ЗначениеЗаполнено(СведенияПоОтветственному) Тогда
						
						ДокументОбъект.ОтветственныйПередалТРУ 						= СведенияПоОтветственному.ОтветственныйПередалТРУ;	
						ДокументОбъект.ОтветственныйПередалТРУВид 					= СведенияПоОтветственному.ОтветственныйПередалТРУВид;
						ДокументОбъект.ОтветственныйПередалТРУДоверенность 			= СведенияПоОтветственному.ОтветственныйПередалТРУДоверенность;
						ДокументОбъект.ОтветственныйПередалТРУДолжность 			= СведенияПоОтветственному.ОтветственныйПередалТРУДолжность;
						ДокументОбъект.ОтветственныйПередалТРУИныеСведения 			= СведенияПоОтветственному.ОтветственныйПередалТРУИныеСведения;
						ДокументОбъект.ОтветственныйПередалТРУКонтрагент 			= СведенияПоОтветственному.ОтветственныйПередалТРУКонтрагент;
						ДокументОбъект.ОтветственныйПередалТРУДокументПолномочий 	= СведенияПоОтветственному.ОтветственныйПередалТРУДокументПолномочий;
						ДокументОбъект.ОтветственныйПередалТРУОснованиеПолномочий 	= "";
					КонецЕсли;

					НовыйДокумент = Ложь;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеДокументов);
				
				Для Каждого СтрокаДокумента Из ТаблицаПродаж Цикл 
					НоваяСтрока = ДокументОбъект.УслугиОказанные.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДокумента);
				КонецЦикла;	
				
				ДокументОбъект.Организация			= Организация;
				ДокументОбъект.Дата 				= ДатаДокументов;
				ДокументОбъект.СуммаДокумента 		= ДанныеДокументов.Всего;
				ДокументОбъект.ДокументОснование 	= ДокументСсылка;
				ДокументОбъект.ТипЦены 				= РеквизитыККМ.ТипЦены;
				ДокументОбъект.СуммаВключаетНДС 	= РеквизитыККМ.СуммаВключаетНДС;
				ДокументОбъект.Руководитель 		= ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
					Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, Организация, ДатаДокументов).ОтветственноеЛицоСсылка;
				
				ДанныеАналитики = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДокументов.СтатьяАналитики, "СчетУчета,КФО,КПС,КЭК");
				Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Документ создан на основании отчета по кассовой смене № %1 от %2. Счет учета: %3, КФО: %4, КПС: %5, КЭК: %6'"),
				СокрЛП(Объект.Номер),
				Формат(Объект.Дата, "ДЛФ=D"),
				ДанныеАналитики.СчетУчета,
				ДанныеАналитики.КФО,
				ДанныеАналитики.КПС,
				ДанныеАналитики.КЭК);
				ДокументОбъект.Комментарий 			= Комментарий;
				
				РеквизитыОперации = БухгалтерскиеОперацииСервер.РеквизитыТиповойОперацииПоУмолчанию(
					ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.АктОбОказанииУслуг"), РеквизитыККМ.ОперацияОтраженияУслуг, Организация);
				РеквизитыОперации.Вставить("СчетРасчетов"	, ДанныеАналитики.СчетУчета); 
				РеквизитыОперации.Вставить("КОСГУ"			, ДанныеАналитики.КЭК);
				РеквизитыОперации.Вставить("КПС"			, ДанныеАналитики.КПС);
				РеквизитыОперации.Вставить("КФО"			, ДанныеАналитики.КФО);
				БухгалтерскиеОперацииСервер.ДобавитьДанныеДляПроведения(ДокументОбъект, РеквизитыККМ.ОперацияОтраженияУслуг, РеквизитыОперации);
				
				Если РеквизитыККМ.ПроводитьДокументыОтраженияУслуг Тогда
					РежимЗаписи = РежимЗаписиДокумента.Проведение;
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Проведен документ ""%1"".'"),
					ДокументОбъект);
				Иначе
					РежимЗаписи = РежимЗаписиДокумента.Запись;
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Создан документ ""%1"". Для проведения необходимо заполнить реквизиты бухгалтерской операции!'"),
					ДокументОбъект);
				КонецЕсли;
				
				ДокументОбъект.Записать(РежимЗаписи);
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Если СтрокаДокумента.КомиссионнаяТорговля Тогда
					ПризнакКомиссионнойТорговли = Истина;
					Продолжить;
				КонецЕсли;
				
			КонецЦикла;	
		КонецЕсли;
		РассчитатьИтогиАктОбОказанииУслуг();
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Для выполнения операции необходимо записать документ!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуУслугКОтражению()
	
	РезультатЗапроса = Документы.ОтчетПоКассовойСмене.ЗапросНоменклатураАктовОбОказанииУслуг(Объект);
	Объект.СуммаУслугКОтражению = РезультатЗапроса[2].Выгрузить().Итог("Всего");
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры	
	
&НаКлиенте
Процедура СоздатьДокументыАктОбОказанииУслуг(Команда)
	
	СоздатьДокументыАктОбОказанииУслугНаСервере();
	Элементы.АктыОбОказанииУслуг.Обновить();
	ОтражениеУчтенныхДенежныхСредств();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборСпискаАктов()
	
	АктыОбОказанииУслуг.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Объект.Ссылка);
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СуммаАктовОбОказанииУслуг(ОбъектСсылка)
	
	Если ЗначениеЗаполнено(ОбъектСсылка) Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(СУММА(АктОбОказанииУслуг.СуммаДокумента), 0) КАК Сумма
		               |ИЗ
		               |	Документ.АктОбОказанииУслуг КАК АктОбОказанииУслуг
		               |ГДЕ
		               |	АктОбОказанииУслуг.ДокументОснование = &ДокументОснование
		               |	И АктОбОказанииУслуг.ПометкаУдаления = ЛОЖЬ";
		Запрос.УстановитьПараметр("ДокументОснование", ОбъектСсылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Следующий()  Тогда 
			Возврат РезультатЗапроса.Сумма;
		Иначе 
			Возврат 0;
		КонецЕсли;
	Иначе 
		Возврат 0;
	КонецЕсли;	
	
КонецФункции	

&НаСервере
Процедура РассчитатьИтогиАктОбОказанииУслуг()
	
	ИтогСуммыАктОбОказанииУслуг = СуммаАктовОбОказанииУслуг(Объект.Ссылка);
	
КонецПроцедуры	

&НаКлиенте
Процедура АктыОбОказанииУслугПриИзменении(Элемент)
	
	РассчитатьИтогиАктОбОказанииУслуг();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыОбмена(КассаККМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФискальныеРегистраторы.ПравилоОбменаСОборудованием.ЗагружатьКакЧекиККМ КАК ЗагружатьКакЧекиККМ
	               |ИЗ
	               |	Справочник.ФискальныеРегистраторы КАК ФискальныеРегистраторы
	               |ГДЕ
	               |	ФискальныеРегистраторы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", КассаККМ);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Возврат РезультатЗапроса;
	
КонецФункции	

&НаСервере
Процедура ПроверитьСуммуВыручки()
	
	СуммаВыручки 	= Объект.ПродажиПоСтавкамНДС.Итог("Сумма") + Объект.ПродажиПоСтавкамНДСПредоплата.Итог("Сумма");
	СуммаОплат 		= Объект.ОплатаНаличными.Итог("Сумма") + Объект.ОплатаПлатежнымиКартами.Итог("Сумма");
	Если СуммаВыручки <> СуммаОплат Тогда 
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Сумма выручки не равна сумме расчетов наличными и платежными картами.'"))
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
Функция ЧекиВозвратаПредоплаты(ЗаДень = Ложь, КассоваяСмена = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ЗаДень Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМНаВозврат.Ссылка КАК Чек
		               |ИЗ
		               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(ЧекККМНаВозврат.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
		               |	И ЧекККМНаВозврат.КассаККМ = &КассаККМ
		               |	И (ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ЧекККМНаВозврат.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ЧекККМНаВозврат.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМНаВозврат
		               |	И НАЧАЛОПЕРИОДА(ФискальныеОперации.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ФискальныеОперации.ДокументОснование.КассаККМ = &КассаККМ
		               |	И (ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
		Запрос.УстановитьПараметр("ДатаСведений", НачалоДня(Объект.Дата));
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМНаВозврат.Ссылка КАК Чек,
		               |	ЧекККМНаВозврат.Дата КАК Дата
		               |ИЗ
		               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
		               |ГДЕ
		               |	ЧекККМНаВозврат.КассоваяСмена = &КассоваяСмена
		               |	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
		               |	И (ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ЧекККМНаВозврат.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ЧекККМНаВозврат.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование,
		               |	ФискальныеОперации.Дата
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМНаВозврат
		               |	И (ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА";
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	КонецЕсли;				   
	
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит", Перечисления.СтатусыЧековККМ.Пробитый);
	
	Результаты = Запрос.Выполнить().Выгрузить();
	
	Возврат Результаты;
КонецФункции

&НаСервере
Функция ЧекиВозвратаСПредоплатойДляЗаполнения(ЗаДень = Ложь, КассоваяСмена = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ЗаДень Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМНаВозврат.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(ЧекККМНаВозврат.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
		               |	И ЧекККМНаВозврат.КассаККМ = &КассаККМ
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ЧекККМНаВозврат.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМНаВозврат
		               |	И НАЧАЛОПЕРИОДА(ФискальныеОперации.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ФискальныеОперации.ДокументОснование.КассаККМ = &КассаККМ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
		Запрос.УстановитьПараметр("ДатаСведений", НачалоДня(Объект.Дата));
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМНаВозврат.Ссылка КАК Ссылка,
		               |	ЧекККМНаВозврат.Дата КАК Дата
		               |ИЗ
		               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
		               |ГДЕ
		               |	ЧекККМНаВозврат.КассоваяСмена = &КассоваяСмена
		               |	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
		               |	И НЕ ЧекККМНаВозврат.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ЧекККМНаВозврат.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |	И ЧекККМНаВозврат.ИдентификаторКорзины = """"
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование,
		               |	ФискальныеОперации.Дата
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМНаВозврат
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
		               |	И ФискальныеОперации.ДокументОснование.ИдентификаторКорзины = """"";
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	КонецЕсли;				   
	
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит", Перечисления.СтатусыЧековККМ.Пробитый);
	
	Результаты = Запрос.Выполнить().Выгрузить();
	
	Возврат Результаты.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Функция ЧекиПредоплаты(ЗаДень = Ложь, КассоваяСмена = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ЗаДень Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМ.Ссылка КАК Чек
		               |ИЗ
		               |	Документ.ЧекККМ КАК ЧекККМ
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
		               |	И ЧекККМ.КассаККМ = &КассаККМ
		               |	И (ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ЧекККМ.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМ
		               |	И НАЧАЛОПЕРИОДА(ФискальныеОперации.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ФискальныеОперации.ДокументОснование.КассаККМ = &КассаККМ
		               |	И (ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
		Запрос.УстановитьПараметр("ДатаСведений", НачалоДня(Объект.Дата));
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМ.Ссылка КАК Чек,
		               |	ЧекККМ.Дата КАК Дата
		               |ИЗ
		               |	Документ.ЧекККМ КАК ЧекККМ
		               |ГДЕ
		               |	ЧекККМ.КассоваяСмена = &КассоваяСмена
		               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
		               |	И (ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ЧекККМ.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование,
		               |	ФискальныеОперации.Дата
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМ
		               |	И (ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаЧастичная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПредоплатаПолная)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ОплатаКредита)
		               |			ИЛИ ФискальныеОперации.ДокументОснование.УчитыватьТолькоОплату = ИСТИНА)
		               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	КонецЕсли;				   
	
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит", Перечисления.СтатусыЧековККМ.Пробитый);
	
	Результаты = Запрос.Выполнить().Выгрузить();
	
	Возврат Результаты;
КонецФункции

&НаСервере
Функция ЧекиСПредоплатойДляЗаполнения(ЗаДень = Ложь, КассоваяСмена = Неопределено)
	
	Запрос = Новый Запрос;
	
	Если ЗаДень Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМ.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.ЧекККМ КАК ЧекККМ
		               |ГДЕ
		               |	НАЧАЛОПЕРИОДА(ЧекККМ.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
		               |	И ЧекККМ.КассаККМ = &КассаККМ
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМ
		               |	И НАЧАЛОПЕРИОДА(ФискальныеОперации.Дата, ДЕНЬ) = &ДатаСведений
		               |	И ФискальныеОперации.ДокументОснование.КассаККМ = &КассаККМ
					   |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("КассаККМ", Объект.КассаККМ);
		Запрос.УстановитьПараметр("ДатаСведений", НачалоДня(Объект.Дата));
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ЧекККМ.Ссылка КАК Ссылка,
		               |	ЧекККМ.Дата КАК Дата
		               |ИЗ
		               |	Документ.ЧекККМ КАК ЧекККМ
		               |ГДЕ
		               |	ЧекККМ.КассоваяСмена = &КассоваяСмена
		               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
		               |	И НЕ ЧекККМ.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМПробит
		               |	И ЧекККМ.ИдентификаторКорзины = """"
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ФискальныеОперации.ДокументОснование,
		               |	ФискальныеОперации.Дата
		               |ИЗ
		               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
		               |ГДЕ
		               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМ
		               |	И НЕ ФискальныеОперации.ДокументОснование.ПризнакСпособаРасчетаЧекаККМ = ЗНАЧЕНИЕ(Перечисление.ПризнакиСпособаРасчета.ПередачаБезОплаты)
		               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
		               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
		               |	И ФискальныеОперации.ДокументОснование.ИдентификаторКорзины = """"";
		
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	КонецЕсли;				   
	
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит", Перечисления.СтатусыЧековККМ.Пробитый);
	
	Результаты = Запрос.Выполнить().Выгрузить();
	
	Возврат Результаты.ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокОчередныхПлатежейПоГрафику(Организация, Договор, Отбор, СтатьяАналитикиОплаты)
	
	Отбор.Вставить("КФО"				, СтатьяАналитикиОплаты.КФО);
	Отбор.Вставить("КодЦели"			, СтатьяАналитикиОплаты.КодЦели);
	Отбор.Вставить("КодМероприятия"		, СтатьяАналитикиОплаты.КодМероприятия);
	Отбор.Вставить("ДопКлассификация"	, СтатьяАналитикиОплаты.ДопКлассификация);
	Отбор.Вставить("ИФО"				, СтатьяАналитикиОплаты.ИФО);
	Отбор.Вставить("КПС"				, СтатьяАналитикиОплаты.КПС);
	Отбор.Вставить("КЭК"				, СтатьяАналитикиОплаты.КЭК);
	
	Возврат КонтрольИсполненияДоговоров.СписокОчередныхПлатежейПоГрафику(Организация, Договор, Отбор);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовГрафикПлатежей()
	
	ВидимостьЭлементовГрафикаПлатежей = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	
	ЭлементыГрафикПлатежей = Новый Массив;
	ЭлементыГрафикПлатежей.Добавить("ОплатаНаличнымиГрафикПлатежей");
	ЭлементыГрафикПлатежей.Добавить("ОплатаПлатежнымиКартамиГрафикПлатежей");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГрафикПлатежей, "Видимость", ВидимостьЭлементовГрафикаПлатежей);
			
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОплатаНаличнымиОплатитьДо");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОплатаНаличными.ОплатитьДо", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<авто>");
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОплатаПлатежнымиКартамиОплатитьДо");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ОплатаПлатежнымиКартами.ОплатитьДо", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<авто>");
	
КонецПроцедуры	

&НаСервере
Процедура ДополнитьДаннымиОплатыЭС(КассоваяСмена)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЧекККМ КАК ЧекККМ
	               |ГДЕ
	               |	ЧекККМ.КассоваяСмена = &КассоваяСмена
	               |	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
	               |	И ЧекККМ.СтатусЧекаККМ = &СтатусЧекаККМПробит
	               |	И ЧекККМ.ИдентификаторКорзины <> """"
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ФискальныеОперации.ДокументОснование
	               |ИЗ
	               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	               |ГДЕ
	               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМ
	               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
	               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
	               |	И ФискальныеОперации.ДокументОснование.ИдентификаторКорзины <> """"";
	
	Запрос.УстановитьПараметр("КассоваяСмена"		, КассоваяСмена);
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит"	, Перечисления.СтатусыЧековККМ.Пробитый);
	ЧекиОплатыЭС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМНаВозврат.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
	               |ГДЕ
	               |	ЧекККМНаВозврат.КассоваяСмена = &КассоваяСмена
	               |	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
	               |	И ЧекККМНаВозврат.СтатусЧекаККМ = &СтатусЧекаККМПробит
	               |	И ЧекККМНаВозврат.ИдентификаторКорзины <> """"
	               |	И ЧекККМНаВозврат.ВовзратВТекущуюСмену = ИСТИНА
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ФискальныеОперации.ДокументОснование
	               |ИЗ
	               |	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	               |ГДЕ
	               |	ФискальныеОперации.ДокументОснование ССЫЛКА Документ.ЧекККМНаВозврат
	               |	И ФискальныеОперации.ДокументОснование.КассоваяСмена = &КассоваяСмена
	               |	И ФискальныеОперации.ДокументОснование.Проведен = ИСТИНА
	               |	И ФискальныеОперации.ДокументОснование.ИдентификаторКорзины <> """"
	               |	И ФискальныеОперации.ДокументОснование.ВовзратВТекущуюСмену = ИСТИНА";
	Запрос.УстановитьПараметр("КассоваяСмена"		, КассоваяСмена);  
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит"	, Перечисления.СтатусыЧековККМ.Пробитый);
    ЧекиВовзратаОплатыЭС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа) КАК ВидОперации,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ЧекККМРасшифровкаОплаты.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	ЧекККМРасшифровкаОплаты.Сумма КАК Сумма,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМРасшифровкаОплаты.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ КАК Подразделение
	               |ПОМЕСТИТЬ ДанныеЧековОплатаНаличными
	               |ИЗ
	               |	Документ.ЧекККМ.РасшифровкаОплаты КАК ЧекККМРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Оплата КАК ЧекККМОплата
	               |		ПО ЧекККМРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМОплата.КлючСвязиОплаты
	               |			И ЧекККМРасшифровкаОплаты.Ссылка = ЧекККМОплата.Ссылка
	               |ГДЕ
	               |	ЧекККМРасшифровкаОплаты.Ссылка В(&ЧекиОплатыЭС)
	               |	И ЧекККМРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМОплата.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат),
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.СтатьяАналитикиОплаты,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.Сумма,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.РасшифровкаОплаты КАК ЧекККМНаВозвратРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМНаВозврат.Оплата КАК ЧекККМНаВозвратОплата
	               |		ПО ЧекККМНаВозвратРасшифровкаОплаты.Ссылка = ЧекККМНаВозвратОплата.Ссылка
	               |			И ЧекККМНаВозвратРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМНаВозвратОплата.КлючСвязиОплаты
	               |ГДЕ
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Ссылка В(&ЧекиВовзратаОплатыЭС)
	               |	И ЧекККМНаВозвратОплата.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаНаличными.ВидОперации КАК ВидОперации,
	               |	ДанныеЧековОплатаНаличными.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаНаличными.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаНаличными.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ДанныеЧековОплатаНаличными.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ДанныеЧековОплатаНаличными.Сумма) КАК Сумма,
	               |	ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаНаличными.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.Подразделение КАК Подразделение,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов
	               |ИЗ
	               |	ДанныеЧековОплатаНаличными КАК ДанныеЧековОплатаНаличными
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеЧековОплатаНаличными.СтатьяАналитикиОплаты,
	               |	ДанныеЧековОплатаНаличными.Контрагент,
	               |	ДанныеЧековОплатаНаличными.Договор,
	               |	ДанныеЧековОплатаНаличными.СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.ВидОперации,
	               |	ДанныеЧековОплатаНаличными.ПараметрыДоговораПлатежногоАгента,
	               |	ДанныеЧековОплатаНаличными.ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаНаличными.ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаНаличными.Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидОперации,
	               |	Контрагент,
	               |	Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Продажа) КАК ВидОперации,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ЧекККМРасшифровкаОплаты.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	ЧекККМРасшифровкаОплаты.Сумма КАК Сумма,
	               |	ЧекККМРасшифровкаОплаты.СуммаКомиссии КАК СуммаКомиссии,
	               |	ЧекККМОплата.ПараметрыДоговораЭквайринга КАК ПараметрыДоговораЭквайринга,
	               |	ЧекККМОплата.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	               |	ЧекККМРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМОплата.ПроцентКомиссии КАК ПроцентКомиссии,
	               |	ЧекККМОплата.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	               |	ЧекККМОплата.Ссылка.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМОплата.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ КАК Подразделение
	               |ПОМЕСТИТЬ ДанныеЧековОплатаПлатежнымиКартами
	               |ИЗ
	               |	Документ.ЧекККМ.РасшифровкаОплаты КАК ЧекККМРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Оплата КАК ЧекККМОплата
	               |		ПО ЧекККМРасшифровкаОплаты.Ссылка = ЧекККМОплата.Ссылка
	               |			И ЧекККМРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМОплата.КлючСвязиОплаты
	               |ГДЕ
	               |	ЧекККМРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМРасшифровкаОплаты.Ссылка В(&ЧекиОплатыЭС)
	               |	И ЧекККМОплата.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЧекККМ.Возврат),
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.СистемаНалогообложенияЧекаККМ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Контрагент
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.Договор
	               |	КОНЕЦ,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.СтатьяАналитикиОплаты,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.Сумма,
	               |	-1 * ЧекККМНаВозвратРасшифровкаОплаты.СуммаКомиссии,
	               |	ЧекККМНаВозвратОплата.ПараметрыДоговораЭквайринга,
	               |	ЧекККМНаВозвратОплата.ЭквайринговыйТерминал,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратОплата.ПроцентКомиссии,
	               |	ЧекККМНаВозвратОплата.ВидПлатежнойКарты,
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Ссылка.ПризнакСпособаРасчетаЧекаККМ,
	               |	ВЫБОР
	               |		КОГДА &УчетПоПодразделениям
	               |			ТОГДА ЧекККМНаВозвратОплата.Ссылка.Подразделение
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.РасшифровкаОплаты КАК ЧекККМНаВозвратРасшифровкаОплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМНаВозврат.Оплата КАК ЧекККМНаВозвратОплата
	               |		ПО ЧекККМНаВозвратРасшифровкаОплаты.Ссылка = ЧекККМНаВозвратОплата.Ссылка
	               |			И ЧекККМНаВозвратРасшифровкаОплаты.КлючСвязиОплаты = ЧекККМНаВозвратОплата.КлючСвязиОплаты
	               |ГДЕ
	               |	ЧекККМНаВозвратРасшифровкаОплаты.Сумма > 0
	               |	И ЧекККМНаВозвратРасшифровкаОплаты.Ссылка В(&ЧекиВовзратаОплатыЭС)
	               |	И ЧекККМНаВозвратОплата.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидОперации КАК ВидОперации,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СистемаНалогообложенияЧекаККМ КАК СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента КАК ПараметрыДоговораПлатежногоАгента,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель
	               |			ТОГДА &КонтрагентДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаПлатежнымиКартами.Контрагент
	               |	КОНЕЦ КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель
	               |			ТОГДА &ДоговорДляРозничныхПродаж
	               |		ИНАЧЕ ДанныеЧековОплатаПлатежнымиКартами.Договор
	               |	КОНЕЦ КАК Договор,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ДанныеЧековОплатаПлатежнымиКартами.Сумма) КАК Сумма,
	               |	СУММА(ДанныеЧековОплатаПлатежнымиКартами.СуммаКомиссии) КАК СуммаКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораЭквайринга КАК ПараметрыДоговораЭквайринга,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПроцентКомиссии КАК ПроцентКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПризнакСпособаРасчетаЧекаККМ КАК ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Подразделение КАК Подразделение,
	               |	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов
	               |ИЗ
	               |	ДанныеЧековОплатаПлатежнымиКартами КАК ДанныеЧековОплатаПлатежнымиКартами
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораПлатежногоАгента,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Договор,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СистемаНалогообложенияЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Контрагент,
	               |	ДанныеЧековОплатаПлатежнымиКартами.СтатьяАналитикиОплаты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПараметрыДоговораЭквайринга,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидОперации,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ЭтоРозничныйПокупатель,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПроцентКомиссии,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ВидПлатежнойКарты,
	               |	ДанныеЧековОплатаПлатежнымиКартами.ПризнакСпособаРасчетаЧекаККМ,
	               |	ДанныеЧековОплатаПлатежнымиКартами.Подразделение
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидОперации,
	               |	Контрагент,
	               |	Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	ВЫРАЗИТЬ(ЧекККМТоварыРаботыУслуги.Номенклатура КАК Справочник.Прейскурант).Номенклатура КАК СоответствующаяНоменклатура,
	               |	ЧекККМТоварыРаботыУслуги.Количество КАК Количество,
	               |	ЧекККМТоварыРаботыУслуги.Цена КАК Цена,
	               |	ЧекККМТоварыРаботыУслуги.Сумма КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Всего КАК Всего,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ПОМЕСТИТЬ ПродажиТоварыУслуги
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.КассоваяСмена = &КассоваяСмена
	               |	И ЧекККМТоварыРаботыУслуги.Ссылка В(&ЧекиОплатыЭС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура КАК СоответствующаяНоменклатура,
	               |	СУММА(ПродажиТоварыУслуги.Количество) КАК Количество,
	               |	ПродажиТоварыУслуги.Цена КАК Цена,
	               |	СУММА(ПродажиТоварыУслуги.Сумма) КАК Сумма,
	               |	ПродажиТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиТоварыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ПродажиТоварыУслуги.Всего) КАК Всего,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ПродажиТоварыУслуги КАК ПродажиТоварыУслуги
	               |ГДЕ
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура.ТипНоменклатуры В(&ПризнакиПредметаРасчетаТовары)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиТоварыУслуги.СтавкаНДС,
	               |	ПродажиТоварыУслуги.Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура,
	               |	ПродажиТоварыУслуги.Цена,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура КАК СоответствующаяНоменклатура,
	               |	СУММА(ПродажиТоварыУслуги.Количество) КАК Количество,
	               |	ПродажиТоварыУслуги.Цена КАК Цена,
	               |	СУММА(ПродажиТоварыУслуги.Сумма) КАК Сумма,
	               |	ПродажиТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиТоварыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ПродажиТоварыУслуги.Всего) КАК Всего,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ПродажиТоварыУслуги КАК ПродажиТоварыУслуги
	               |ГДЕ
	               |	НЕ ПродажиТоварыУслуги.СоответствующаяНоменклатура.ТипНоменклатуры В (&ПризнакиПредметаРасчетаТовары)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиТоварыУслуги.СтавкаНДС,
	               |	ПродажиТоварыУслуги.СоответствующаяНоменклатура,
	               |	ПродажиТоварыУслуги.Номенклатура,
	               |	ПродажиТоварыУслуги.Цена,
	               |	ПродажиТоварыУслуги.ЭтоРозничныйПокупатель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура КАК Номенклатура,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.Номенклатура КАК НоменклатураНоменклатура,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Количество КАК Количество,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Цена КАК Цена,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Сумма КАК Сумма,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Всего КАК Всего,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ПОМЕСТИТЬ ВозвратыТоварыУслуги
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.КассоваяСмена = &КассоваяСмена
	               |	И ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ЧекиВовзратаОплатыЭС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыТоварыУслуги.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ВозвратыТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура КАК НоменклатураНоменклатура,
	               |	ВозвратыТоварыУслуги.Количество КАК Количество,
	               |	ВозвратыТоварыУслуги.Цена КАК Цена,
	               |	ВозвратыТоварыУслуги.Сумма КАК Сумма,
	               |	ВозвратыТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ВозвратыТоварыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ВозвратыТоварыУслуги.Всего КАК Всего,
	               |	ВозвратыТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ВозвратыТоварыУслуги КАК ВозвратыТоварыУслуги
	               |ГДЕ
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура.ТипНоменклатуры В(&ПризнакиПредметаРасчетаТовары)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВозвратыТоварыУслуги.ЧекККМПродажа КАК ЧекККМПродажа,
	               |	ВозвратыТоварыУслуги.Номенклатура КАК Номенклатура,
	               |	ВозвратыТоварыУслуги.НоменклатураНоменклатура КАК НоменклатураНоменклатура,
	               |	ВозвратыТоварыУслуги.Количество КАК Количество,
	               |	ВозвратыТоварыУслуги.Цена КАК Цена,
	               |	ВозвратыТоварыУслуги.Сумма КАК Сумма,
	               |	ВозвратыТоварыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	ВозвратыТоварыУслуги.СуммаНДС КАК СуммаНДС,
	               |	ВозвратыТоварыУслуги.Всего КАК Всего,
	               |	ВозвратыТоварыУслуги.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель
	               |ИЗ
	               |	ВозвратыТоварыУслуги КАК ВозвратыТоварыУслуги
	               |ГДЕ
	               |	НЕ ВозвратыТоварыУслуги.НоменклатураНоменклатура.ТипНоменклатуры В (&ПризнакиПредметаРасчетаТовары)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты КАК ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.Всего) КАК Сумма,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ЧекККМТоварыРаботыУслуги.СуммаЭС) КАК СуммаЭС,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС
	               |ПОМЕСТИТЬ ПродажиПоСтавкамНДС
	               |ИЗ
	               |	Документ.ЧекККМ.ТоварыРаботыУслуги КАК ЧекККМТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМТоварыРаботыУслуги.Ссылка В(&ЧекиОплатыЭС)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты,
	               |	ЧекККМТоварыРаботыУслуги.Ссылка.СуммаВключаетНДС
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.СуммаНДС),
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.Всего),
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты,
	               |	СУММА(-1 * ЧекККМНаВозвратТоварыРаботыУслуги.СуммаЭС),
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.СуммаВключаетНДС
	               |ИЗ
	               |	Документ.ЧекККМНаВозврат.ТоварыРаботыУслуги КАК ЧекККМНаВозвратТоварыРаботыУслуги
	               |ГДЕ
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка В(&ЧекиВовзратаОплатыЭС)
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ФормаОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.СтавкаНДС,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.ЭтоРозничныйПокупатель,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Номенклатура.ОсновнаяСтатьяАналитикиОплаты,
	               |	ЧекККМНаВозвратТоварыРаботыУслуги.Ссылка.СуммаВключаетНДС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДС.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДС.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ КАК ТипОплаты,
	               |	ПродажиПоСтавкамНДС.СтавкаНДС КАК СтавкаНДС,
	               |	СУММА(ПродажиПоСтавкамНДС.СуммаНДС) КАК СуммаНДС,
	               |	СУММА(ПродажиПоСтавкамНДС.Сумма) КАК Сумма,
	               |	ПродажиПоСтавкамНДС.ЭтоРозничныйПокупатель КАК ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДС.СтатьяАналитикиОплаты КАК СтатьяАналитикиОплаты,
	               |	СУММА(ПродажиПоСтавкамНДС.СуммаЭС) КАК СуммаЭС,
	               |	ПродажиПоСтавкамНДС.СуммаВключаетНДС КАК СуммаВключаетНДС
	               |ИЗ
	               |	ПродажиПоСтавкамНДС КАК ПродажиПоСтавкамНДС
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиПоСтавкамНДС.СтавкаНДС,
	               |	ПродажиПоСтавкамНДС.ЭтоРозничныйПокупатель,
	               |	ПродажиПоСтавкамНДС.СтатьяАналитикиОплаты,
	               |	ВЫБОР
	               |		КОГДА ПродажиПоСтавкамНДС.ФормаОплаты = 1
	               |				ИЛИ ПродажиПоСтавкамНДС.ФормаОплаты = 2
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.ПлатежнаяКарта)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыОплатЧекаККМ.Наличные)
	               |	КОНЕЦ,
	               |	ПродажиПоСтавкамНДС.СуммаВключаетНДС
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоРозничныйПокупатель УБЫВ,
	               |	СтавкаНДС,
	               |	СтатьяАналитикиОплаты,
	               |	ТипОплаты";  
	ПризнакиПредметаРасчетаТовары = РозничныеПродажиБГУ.ПризнакиПредметаРасчетаТовары();
	
	ЗначенияРеквизитовСмены = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассоваяСмена, "КассаККМ");
	КассаККМ 				= ЗначенияРеквизитовСмены.КассаККМ;
	
	ЗначенияРеквизитовКассы 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассаККМ, "КонтрагентДляРозничныхПродаж, ДоговорДляРозничныхПродаж, УчетПоПодразделениям");
	КонтрагентДляРозничныхПродаж 	= ЗначенияРеквизитовКассы.КонтрагентДляРозничныхПродаж;
	ДоговорДляРозничныхПродаж 		= ЗначенияРеквизитовКассы.ДоговорДляРозничныхПродаж;
	УчетПоПодразделениям            = ЗначенияРеквизитовКассы.УчетПоПодразделениям;
	
	Запрос.УстановитьПараметр("ЧекиОплатыЭС"							, ЧекиОплатыЭС);
	Запрос.УстановитьПараметр("ЧекиВовзратаОплатыЭС"					, ЧекиВовзратаОплатыЭС);
	Запрос.УстановитьПараметр("КассоваяСмена"							, КассоваяСмена);
	Запрос.УстановитьПараметр("КонтрагентДляРозничныхПродаж"			, КонтрагентДляРозничныхПродаж);
	Запрос.УстановитьПараметр("ДоговорДляРозничныхПродаж"				, ДоговорДляРозничныхПродаж);
	Запрос.УстановитьПараметр("СтатусЧекаККМПробит"						, Перечисления.СтатусыЧековККМ.Пробитый);
	Запрос.УстановитьПараметр("ПризнакиПредметаРасчетаТовары"			, ПризнакиПредметаРасчетаТовары);
	Запрос.УстановитьПараметр("ПустыеПараметрыДоговораПлатежногоАгента"	, Справочники.ПараметрыДоговораПлатежногоАгента.ПустаяСсылка());
	Запрос.УстановитьПараметр("УчетПоПодразделениям"					, УчетПоПодразделениям);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ОплатаНаличными 		= Результаты[1].Выгрузить();
	ОплатаПлатежнымиКартами	= Результаты[3].Выгрузить();
	ПродажиТовары 			= Результаты[5].Выгрузить();
	ПродажиРаботыУслуги 	= Результаты[6].Выгрузить();  
	ВозвратТовары 			= Результаты[8].Выгрузить();
	ОтменаРаботыУслуги 		= Результаты[9].Выгрузить();
	ПродажиПоСтавкамНДС 	= Результаты[11].Выгрузить();
	
	ТаблицыДанных = Новый Структура; 
	КолонкиГруппировки 	= "ВидОперации, СистемаНалогообложенияЧекаККМ, ПараметрыДоговораПлатежногоАгента, СтатьяАналитикиОплаты,
						  |Контрагент, Договор, ЭтоРозничныйПокупатель, ПризнакСпособаРасчетаЧекаККМ, Подразделение, ВидРасчетов, ОплатитьДо";
	КолонкиСуммирования = "Сумма";
	ТаблицыДанных.Вставить("ОплатаНаличными", Новый Структура("Таблица, КолонкиГруппировки, КолонкиСуммирования", ОплатаНаличными, КолонкиГруппировки, КолонкиСуммирования));
	
	КолонкиГруппировки 	= "ВидОперации, СистемаНалогообложенияЧекаККМ, ПараметрыДоговораПлатежногоАгента, СтатьяАналитикиОплаты,
						  |ПараметрыДоговораЭквайринга, Контрагент, Договор, ЭквайринговыйТерминал, ЭтоРозничныйПокупатель, ПроцентКомиссии, 
						  |ВидПлатежнойКарты, ПризнакСпособаРасчетаЧекаККМ, Подразделение, ВидРасчетов, ОплатитьДо";
	КолонкиСуммирования = "Сумма, СуммаКомиссии";
	ТаблицыДанных.Вставить("ОплатаПлатежнымиКартами", Новый Структура("Таблица, КолонкиГруппировки, КолонкиСуммирования", ОплатаПлатежнымиКартами, КолонкиГруппировки, КолонкиСуммирования));
	
	КолонкиГруппировки 	= "Номенклатура, Цена,СтавкаНДС, ЭтоРозничныйПокупатель";
	КолонкиСуммирования = "Количество, Сумма, СуммаНДС, Всего";
	ТаблицыДанных.Вставить("ПродажиТовары", Новый Структура("Таблица, КолонкиГруппировки, КолонкиСуммирования", ПродажиТовары, КолонкиГруппировки, КолонкиСуммирования));
	
	КолонкиГруппировки 	= "Номенклатура, Цена,СтавкаНДС, ЭтоРозничныйПокупатель";
	КолонкиСуммирования = "Количество, Сумма, СуммаНДС, Всего";
	ТаблицыДанных.Вставить("ПродажиРаботыУслуги", Новый Структура("Таблица, КолонкиГруппировки, КолонкиСуммирования", ПродажиРаботыУслуги, КолонкиГруппировки, КолонкиСуммирования));
	
	КолонкиГруппировки 	= "Номенклатура, Цена,СтавкаНДС, ЧекККМПродажа, ЭтоРозничныйПокупатель";
	КолонкиСуммирования = "Количество, Сумма, СуммаНДС, Всего";
	ТаблицыДанных.Вставить("ВозвратТовары", Новый Структура("Таблица, КолонкиГруппировки, КолонкиСуммирования", ВозвратТовары, КолонкиГруппировки, КолонкиСуммирования));
	
	КолонкиГруппировки 	= "Номенклатура, Цена,СтавкаНДС, ЧекККМПродажа, ЭтоРозничныйПокупатель";
	КолонкиСуммирования = "Количество, Сумма, СуммаНДС, Всего";
	ТаблицыДанных.Вставить("ОтменаРаботыУслуги", Новый Структура("Таблица, КолонкиГруппировки, КолонкиСуммирования", ОтменаРаботыУслуги, КолонкиГруппировки, КолонкиСуммирования));
	
	Для Каждого СтрокаЗапроса Из ТаблицыДанных Цикл 
		Для Каждого СтрокаТаблицы Из СтрокаЗапроса.Значение.Таблица Цикл 
			НоваяСтрока = Объект[СтрокаЗапроса.Ключ].Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы); 
		КонецЦикла;
		ВТ = Объект[СтрокаЗапроса.Ключ].Выгрузить();
		ВТ.Свернуть(СтрокаЗапроса.Значение.КолонкиГруппировки, СтрокаЗапроса.Значение.КолонкиСуммирования);
		Объект[СтрокаЗапроса.Ключ].Загрузить(ВТ); 
	КонецЦикла;	                                             
	 
	Для Каждого СтрокаВыручка Из ПродажиПоСтавкамНДС Цикл 
		СтавкаНДС = УчетНДСКлиентСервер.ЗначениеСтавкиНДС(СтрокаВыручка.СтавкаНДС);
		Если (СтрокаВыручка.Сумма - СтрокаВыручка.СуммаЭС) <> 0 Тогда  
			НоваяСтрока = Объект.ПродажиПоСтавкамНДС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыручка);
			НоваяСтрока.Сумма 		= НоваяСтрока.Сумма - СтрокаВыручка.СуммаЭС;
			НоваяСтрока.СуммаНДС 	= УправлениеНФАКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма, СтрокаВыручка.СуммаВключаетНДС, СтавкаНДС); 
		КонецЕсли;
		
		Если СтрокаВыручка.СуммаЭС <> 0 Тогда 
			НоваяСтрока = Объект.ПродажиПоСтавкамНДС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыручка);
			НоваяСтрока.Сумма 		= СтрокаВыручка.СуммаЭС;
			НоваяСтрока.ТипОплаты 	= Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта;
			НоваяСтрока.СуммаНДС 	= УправлениеНФАКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма, СтрокаВыручка.СуммаВключаетНДС, СтавкаНДС);
		КонецЕсли;
	КонецЦикла;	
	ВТПродажиПоСтавкамНДС = Объект.ПродажиПоСтавкамНДС.Выгрузить();
	ВТПродажиПоСтавкамНДС.Свернуть("ТипОплаты, СтавкаНДС, ЭтоРозничныйПокупатель, СтатьяАналитикиОплаты", "СуммаНДС, Сумма");
	Объект.ПродажиПоСтавкамНДС.Загрузить(ВТПродажиПоСтавкамНДС); 
	
	Для Каждого СтрокаЧек Из ЧекиОплатыЭС Цикл 
		Если Объект.ЧекиККМ.НайтиСтроки(Новый Структура("Чек", СтрокаЧек.Ссылка)).Количество() = 0 Тогда  
			НоваяСтрока = Объект.ЧекиККМ.Добавить();
			НоваяСтрока.Чек = СтрокаЧек.Ссылка; 
		КонецЕсли;	
	КонецЦикла;	
	
	Для Каждого СтрокаЧек Из ЧекиВовзратаОплатыЭС Цикл 
		Если Объект.ЧекиККМНаВозврат.НайтиСтроки(Новый Структура("Чек", СтрокаЧек.Ссылка)).Количество() = 0 Тогда  
			НоваяСтрока = Объект.ЧекиККМНаВозврат.Добавить();
			НоваяСтрока.Чек = СтрокаЧек.Ссылка;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыНакладнаяНаРеализациюТорг12(Команда)
	
	СоздатьДокументыНакладнаяНаРеализациюТорг12НаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыНакладнаяНаРеализациюТорг12НаКлиенте()
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ не записан. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.НакладнаяНаРеализациюТорг12.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыНДСКомиссииБанка(ПараметрыДоговора, СуммаКомиссии)
	
	СтавкаНДССКомисииБанка 	= Перечисления.СтавкиНДС.НДС22;
	НДССКомиссииСверху 		= Ложь;
	Если ЗначениеЗаполнено(ПараметрыДоговора) Тогда 
		Если ПараметрыДоговора.ТарифыЗаРасчетноеОбслуживание.Количество() <> 0 Тогда 
			Для Каждого СтрокаТариф Из ПараметрыДоговора.ТарифыЗаРасчетноеОбслуживание Цикл 
				Если СтрокаТариф.ОсновнойВид Тогда 
					СтавкаНДССКомисииБанка 	= СтрокаТариф.СтавкаНДССКомисии; 
					НДССКомиссииСверху 		= СтрокаТариф.НДССКомиссииСверху;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЕсли;
	СтавкаНДСКомиссии 		= УчетНДСКлиентСервер.ПолучитьМножительСтавки(СтавкаНДССКомисииБанка, Истина);
	СуммаНДССКомиссииБанка 	= СуммаКомиссии * СтавкаНДСКомиссии;
	
	ПараметрыНДС = Новый Структура;
	ПараметрыНДС.Вставить("СтавкаНДССКомисииБанка"	, СтавкаНДССКомисииБанка);
	ПараметрыНДС.Вставить("СуммаНДССКомиссииБанка"	, СуммаНДССКомиссииБанка); 
	ПараметрыНДС.Вставить("НДССКомиссииСверху"		, НДССКомиссииСверху);
	
	Возврат ПараметрыНДС;
	
КонецФункции

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

