#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сформировать отчет по заданным параметрам
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт

	ТабличныйДокумент.Очистить();
	
	ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	ДатаОкончания = Дата;
	Если ДатаНачала > ДатаОкончания Тогда
		ДатаНачала = ДатаОкончания;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("105.22, 105.32").УчетПоПодразделениям Тогда
		Запрос.УстановитьПараметр("Подразделение",	Подразделение);
	Иначе
		Запрос.УстановитьПараметр("Подразделение", Справочники.Подразделения.ПустаяСсылка());
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КатегорииДовольствующихся.ВариантМеню КАК ВариантМеню
	               |ПОМЕСТИТЬ ВариантыМеню
	               |ИЗ
	               |	Справочник.КатегорииДовольствующихся КАК КатегорииДовольствующихся
	               |ГДЕ
	               |	КатегорииДовольствующихся.Владелец = &Организация
	               |	И (КатегорииДовольствующихся.Подразделение = &Подразделение
	               |			ИЛИ &Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТиповыеМеню.ВариантМеню КАК ВариантМеню,
	               |	ТиповыеМеню.ПриемПищи КАК ПриемПищи,
	               |	ТиповыеМеню.Блюдо КАК Блюдо,
	               |	ТиповыеМеню.Спецификация КАК Спецификация,
	               |	ТиповыеМеню.Порядок КАК Порядок
	               |ПОМЕСТИТЬ ТиповыеМеню
	               |ИЗ
	               |	РегистрСведений.ТиповыеМеню КАК ТиповыеМеню
	               |ГДЕ
	               |	ТиповыеМеню.ВариантМеню В
	               |			(ВЫБРАТЬ
	               |				ВариантыМеню.ВариантМеню
	               |			ИЗ
	               |				ВариантыМеню)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТиповыеМеню.ВариантМеню КАК ВариантМеню,
	               |	ТиповыеМеню.ПриемПищи КАК ПриемПищи,
	               |	ТиповыеМеню.Порядок КАК Порядок,
	               |	СпецификацииНоменклатурыСпецификация.Номенклатура КАК Номенклатура,
	               |	ВЫБОР
	               |		КОГДА СпецификацииНоменклатуры.Количество = 0
	               |			ТОГДА 0
	               |		ИНАЧЕ СпецификацииНоменклатурыСпецификация.Количество / СпецификацииНоменклатуры.Количество
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	ТиповыеМеню КАК ТиповыеМеню
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
	               |		ПО ТиповыеМеню.Спецификация = СпецификацииНоменклатуры.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.Спецификация КАК СпецификацииНоменклатурыСпецификация
	               |		ПО ТиповыеМеню.Спецификация = СпецификацииНоменклатурыСпецификация.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КатегорииДовольствующихся.Ссылка КАК КатегорияДовольствующихся,
	               |	КатегорииДовольствующихся.ВариантМеню КАК ВариантМеню,
	               |	КатегорииДовольствующихсяПриемыПищи.ПриемПищи КАК ПриемПищи,
	               |	ТиповыеМеню.Порядок КАК Порядок,
	               |	КатегорииДовольствующихся.Ссылка.Код КАК КатегорияДовольствующихсяПредставление
	               |ИЗ
	               |	Справочник.КатегорииДовольствующихся.ПриемыПищи КАК КатегорииДовольствующихсяПриемыПищи
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДовольствующихся КАК КатегорииДовольствующихся
	               |		ПО КатегорииДовольствующихсяПриемыПищи.Ссылка = КатегорииДовольствующихся.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТиповыеМеню КАК ТиповыеМеню
	               |		ПО КатегорииДовольствующихсяПриемыПищи.ПриемПищи = ТиповыеМеню.ПриемПищи
	               |			И КатегорииДовольствующихсяПриемыПищи.Ссылка.ВариантМеню = ТиповыеМеню.ВариантМеню
	               |ГДЕ
	               |	КатегорииДовольствующихсяПриемыПищи.Используется
	               |	И НЕ ТиповыеМеню.Спецификация ЕСТЬ NULL
	               |	И ТиповыеМеню.Спецификация <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КатегорияДовольствующихся,
	               |	Порядок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТиповыеМеню.ВариантМеню КАК ВариантМеню,
	               |	МАКСИМУМ(ТиповыеМеню.Порядок) КАК Порядок
	               |ИЗ
	               |	ТиповыеМеню КАК ТиповыеМеню
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТиповыеМеню.ВариантМеню";
	Результат = Запрос.ВыполнитьПакет();
	
	ТиповыеМеню 				= Результат[2].Выгрузить();
	КатегорииДовольствующихся	= Результат[3].Выгрузить();
	КатегорииСМеню = КатегорииДовольствующихся.Скопировать(, "КатегорияДовольствующихся, ВариантМеню, КатегорияДовольствующихсяПредставление");
	КатегорииСМеню.Свернуть("КатегорияДовольствующихся, ВариантМеню, КатегорияДовольствующихсяПредставление");
	МаксимальныйПорядокМеню = Новый Соответствие;
	ВыборкаВариантМеню = Результат[4].Выбрать();
	Пока ВыборкаВариантМеню.Следующий() Цикл
		МаксимальныйПорядокМеню.Вставить(ВыборкаВариантМеню.ВариантМеню, ВыборкаВариантМеню.Порядок);
	КонецЦикла;
	
	ПорядокМеню = ПолучитьПорядокМеню();
	ПорядокМеню.Индексы.Добавить("КатегорияДовольствующихся, ВариантМеню");
	ОтборПорядка = Новый Структура("КатегорияДовольствующихся, ВариантМеню");
	ТиповыеМеню.Индексы.Добавить("ВариантМеню, ПриемПищи, Порядок");
	ОтборПродукты = Новый Структура("ВариантМеню, ПриемПищи, Порядок");
	КатегорииДовольствующихся.Индексы.Добавить("КатегорияДовольствующихся, Порядок, ВариантМеню");
	ОтборПитание = Новый Структура("КатегорияДовольствующихся, Порядок, ВариантМеню");
	
	ТаблицаНоменклатуры = Новый ТаблицаЗначений;
	ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", 							Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатуры.Колонки.Добавить("КатегорияДовольствующихся",				Новый ОписаниеТипов("СправочникСсылка.КатегорииДовольствующихся"));
	ТаблицаНоменклатуры.Колонки.Добавить("Количество", 								Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,6)));
	ТаблицаНоменклатуры.Колонки.Добавить("КатегорияДовольствующихсяПредставление",	Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(6, ДопустимаяДлина.Фиксированная)));
	
	Для каждого ТекКатегория Из КатегорииСМеню Цикл
		
		ОтборКоличества = Новый Структура("КатегорияДовольствующихся", ТекКатегория.КатегорияДовольствующихся);
		ТекПорядок = 1;
		ДатаНачалаЦикла = ДатаНачала;
		МаксимальныйПорядок = МаксимальныйПорядокМеню.Получить(ТекКатегория.ВариантМеню);
		ЗаполнитьЗначенияСвойств(ОтборПорядка, ТекКатегория);
		СтрокаПорядка = ПорядокМеню.НайтиСтроки(ОтборПорядка);
		Если СтрокаПорядка.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(СтрокаПорядка[0].ПорядокМеню) Тогда
				ТекПорядок = СтрокаПорядка[0].ПорядокМеню;
				ДатаНачалаЦикла = НачалоДня(СтрокаПорядка[0].Дата);
			КонецЕсли;
		КонецЕсли;
		ДатаПроверки = ДатаНачалаЦикла;
		Пока ДатаПроверки<=Дата Цикл
			Если ДатаПроверки<ДатаНачала Тогда
				ДатаПроверки = ДатаПроверки + 60*60*24;
				ТекПорядок = ?(ТекПорядок = МаксимальныйПорядок, 1, ТекПорядок + 1);
				
				Продолжить;
			КонецЕсли;
			
			Численность = РегистрыСведений.ЧисленностьДовольствующихся.СрезПоследних(
				КонецДня(ДатаПроверки), ОтборКоличества);
			Если Численность.Количество()=0 Или Численность[0].Количество = 0 Тогда
				ДатаПроверки = ДатаПроверки + 60*60*24;
				ТекПорядок = ?(ТекПорядок = МаксимальныйПорядок, 1, ТекПорядок + 1);
				
				Продолжить;
			КонецЕсли;
			КоличествоДовольствующихся = Численность[0].Количество;
			
			ОтборПитание.КатегорияДовольствующихся = ТекКатегория.КатегорияДовольствующихся;
			ОтборПитание.Порядок = ТекПорядок;
			ОтборПитание.ВариантМеню = ТекКатегория.ВариантМеню;
			ПитаниеЗаДень = КатегорииДовольствующихся.НайтиСтроки(ОтборПитание);
			Для Каждого СтрокаПитания Из ПитаниеЗаДень Цикл
			
				ОтборПродукты.ВариантМеню = ТекКатегория.ВариантМеню;
				ОтборПродукты.ПриемПищи = СтрокаПитания.ПриемПищи;
				ОтборПродукты.Порядок = ТекПорядок;
				СтрокиПродуктов = ТиповыеМеню.НайтиСтроки(ОтборПродукты);
				
				Для каждого ТекНоменклатура Из СтрокиПродуктов Цикл
					СтрокаНоменклатуры = ТаблицаНоменклатуры.Добавить();
					СтрокаНоменклатуры.Номенклатура = ТекНоменклатура.Номенклатура;
					СтрокаНоменклатуры.КатегорияДовольствующихся = ТекКатегория.КатегорияДовольствующихся;
					СтрокаНоменклатуры.Количество = ТекНоменклатура.Количество * КоличествоДовольствующихся;
					СтрокаНоменклатуры.КатегорияДовольствующихсяПредставление
						= ТекКатегория.КатегорияДовольствующихсяПредставление;
				КонецЦикла; 
			
			КонецЦикла;
			ДатаПроверки = ДатаПроверки + 60*60*24;
			ТекПорядок = ?(ТекПорядок = МаксимальныйПорядок, 1, ТекПорядок + 1);
		КонецЦикла;
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаНоменклатуры.Номенклатура,
	               |	ТаблицаНоменклатуры.КатегорияДовольствующихся,
	               |	ТаблицаНоменклатуры.Количество,
	               |	ТаблицаНоменклатуры.КатегорияДовольствующихсяПредставление
	               |ПОМЕСТИТЬ ТаблицаНоменклатуры
	               |ИЗ
	               |	&ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНоменклатуры.Номенклатура,
	               |	ТаблицаНоменклатуры.КатегорияДовольствующихся,
	               |	СУММА(ВЫРАЗИТЬ(ТаблицаНоменклатуры.Количество КАК Число(15,6))) КАК Количество,
	               |	ТаблицаНоменклатуры.КатегорияДовольствующихсяПредставление
	               |ПОМЕСТИТЬ ТаблицаОсновная
	               |ИЗ
	               |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблицаНоменклатуры.Номенклатура,
	               |	ТаблицаНоменклатуры.КатегорияДовольствующихся,
	               |	ТаблицаНоменклатуры.КатегорияДовольствующихсяПредставление";
	Запрос.Выполнить();
	
	ПараметрыРаспределения = Новый Структура("Организация, ЦМО, Подразделение", Организация, ЦМО, Подразделение); 
	
	ТаблицаРезультат = УправлениеМатериальнымиЗапасами.РаспределитьПоСчетам(
		ПараметрыРаспределения, КонецДня(Дата), МенеджерВременныхТаблиц);
	ВывестиТаблицуНедостач(ТаблицаРезультат, ТабличныйДокумент);

КонецПроцедуры

// Формирует отчет по документу Меню-требование
// 
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент
Процедура СформироватьОтчетПоДокументу(ТабличныйДокумент) Экспорт

	ТаблицаРезультат = УправлениеМатериальнымиЗапасами.РаспределитьПоСчетам(МенюТребование);
	ВывестиТаблицуНедостач(ТаблицаРезультат, ТабличныйДокумент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Счет10532 = БухгалтерскийУчет.СчетПоКоду("105.32");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
			И НЕ БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет10532).УчетПоПодразделениям Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Подразделение"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПорядокМеню()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся КАК КатегорияДовольствующихся,
	|	МенюТребованиеКатегорииДовольствующихся.ВариантМеню КАК ВариантМеню,
	|	МАКСИМУМ(МенюТребованиеКатегорииДовольствующихся.Ссылка.Дата) КАК Дата
	|ПОМЕСТИТЬ МаксимальныеДаты
	|ИЗ
	|	Документ.МенюТребование.КатегорииДовольствующихся КАК МенюТребованиеКатегорииДовольствующихся
	|ГДЕ
	|	МенюТребованиеКатегорииДовольствующихся.Ссылка.Организация = &Организация
	|	И МенюТребованиеКатегорииДовольствующихся.Ссылка.Дата < &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся,
	|	МенюТребованиеКатегорииДовольствующихся.ВариантМеню
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся КАК КатегорияДовольствующихся,
	|	МенюТребованиеКатегорииДовольствующихся.ВариантМеню КАК ВариантМеню,
	|	МАКСИМУМ(МенюТребованиеКатегорииДовольствующихся.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ ПоследниеДокументы
	|ИЗ
	|	Документ.МенюТребование.КатегорииДовольствующихся КАК МенюТребованиеКатегорииДовольствующихся
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МенюТребование КАК МенюТребование
	|		ПО МенюТребованиеКатегорииДовольствующихся.Ссылка = МенюТребование.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МаксимальныеДаты КАК МаксимальныеДаты
	|		ПО МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся = МаксимальныеДаты.КатегорияДовольствующихся
	|			И МенюТребованиеКатегорииДовольствующихся.ВариантМеню = МаксимальныеДаты.ВариантМеню
	|			И (МенюТребование.Дата = МаксимальныеДаты.Дата)
	|
	|СГРУППИРОВАТЬ ПО
	|	МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся,
	|	МенюТребованиеКатегорииДовольствующихся.ВариантМеню
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся КАК КатегорияДовольствующихся,
	|	МенюТребованиеКатегорииДовольствующихся.ВариантМеню КАК ВариантМеню,
	|	МенюТребованиеКатегорииДовольствующихся.ПорядокМеню КАК ПорядокМеню,
	|	МенюТребованиеКатегорииДовольствующихся.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.МенюТребование.КатегорииДовольствующихся КАК МенюТребованиеКатегорииДовольствующихся
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеДокументы КАК ПоследниеДокументы
	|		ПО МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся = ПоследниеДокументы.КатегорияДовольствующихся
	|			И МенюТребованиеКатегорииДовольствующихся.ВариантМеню = ПоследниеДокументы.ВариантМеню
	|			И МенюТребованиеКатегорииДовольствующихся.Ссылка = ПоследниеДокументы.Ссылка";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата", Дата);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ВывестиТаблицуНедостач(ТаблицаРезультат, ТабличныйДокумент)
	ТаблицаНедостач  = УправлениеМатериальнымиЗапасами.ВернутьТаблицуНедостающихПродуктовПоИС(ТаблицаРезультат);
	
	ТабДокумент = ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_РасчетНедостающихПродуктов");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка     = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка1    = Макет.ПолучитьОбласть("Шапка1");
	ОбластьСтрока    = Макет.ПолучитьОбласть("Строка");
	ОбластьГруппа    = Макет.ПолучитьОбласть("Группа");
	ОбластьКонцевик  = Макет.ПолучитьОбласть("Концевик");
	
	ПараметрыШапкиОтчета = Новый Структура;
	Если ЗначениеЗаполнено(МенюТребование) Тогда
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(МенюТребование, "Номер, Дата");
		ПараметрыШапкиОтчета.Вставить("Подзаголовок", СтрШаблон(НСтр("ru = 'к документу: Меню-требование № %1 от %2'"),
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыДокумента.Номер, Истина, Истина),
			Формат(РеквизитыДокумента.Дата, "ДЛФ=D")));
	Иначе
		ПараметрыШапкиОтчета.Вставить("Подзаголовок", СтрШаблон(НСтр("ru = 'на дату: %1'"), Формат(Дата, "ДЛФ=D")));
	КонецЕсли;
	ПараметрыШапкиОтчета.Вставить("ЦМО", ?(НЕ ЗначениеЗаполнено(ЦМО), НСтр("ru = 'без учета ЦМО'"), ЦМО));
	ПараметрыШапкиОтчета.Вставить("Подразделение", Подразделение);
	ПараметрыШапкиОтчета.Вставить("НаименованиеОрганизации",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "НаименованиеПолное"));
	ПараметрыШапкиОтчета.Вставить("ДатаФормирования", Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy"));
	ОбластьЗаголовок.Параметры.Заполнить(ПараметрыШапкиОтчета);
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	Если ТаблицаНедостач.Количество() = 0 Тогда
		ТабДокумент.Вывести(ОбластьШапка1);
	Иначе 	
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(Таб.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		               |	Таб.ЕдиницаИзмеренияПредставление КАК ЕдиницаИзмеренияПредставление,
		               |	Таб.НоменклатураКод КАК НоменклатураКод,
		               |	Таб.Нехватает КАК Нехватает,
		               |	Таб.Ключ КАК Ключ
		               |ПОМЕСТИТЬ ТаблицаНедостач
		               |ИЗ
		               |	&ТабНедостач КАК Таб
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Таб.Номенклатура КАК Номенклатура,
		               |	Таб.ЕдиницаИзмеренияПредставление КАК ЕдиницаИзмеренияПредставление,
		               |	Таб.НоменклатураКод КАК НоменклатураКод,
		               |	Таб.Нехватает КАК Нехватает,
		               |	Таб.Ключ КАК Ключ,
		               |	1 КАК КоличествоСтрок
		               |ИЗ
		               |	ТаблицаНедостач КАК Таб
		               |ГДЕ
		               |	Таб.Нехватает <> 0
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Таб.Номенклатура.Наименование
		               |ИТОГИ
		               |	СУММА(КоличествоСтрок)
		               |ПО
		               |	Номенклатура";
						
		Запрос = Новый Запрос(ТекстЗапроса);				
		Запрос.УстановитьПараметр("ТабНедостач", ТаблицаНедостач);
		ДеревоНоменклатуры = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТабДокумент.ФиксацияСверху = 10;
		ТабДокумент.Вывести(ОбластьШапка);
		
		ТекВысота = ТабДокумент.ВысотаТаблицы;
		Для каждого СтрокаНоменклатуры из ДеревоНоменклатуры.Строки Цикл
			Если СтрокаНоменклатуры.КоличествоСтрок > 1 Тогда
				ОбластьГруппа.Параметры.Заполнить(СтрокаНоменклатуры);
				ТабДокумент.Вывести(ОбластьГруппа);
				ТекВысота = ТабДокумент.ВысотаТаблицы;
				ТабДокумент.НачатьГруппуСтрок(, Истина);
			КонецЕсли;	
			
			ВсегоПоНоменклатуре = 0;
			СтруктураПоиска = Новый Структура("Номенклатура", СтрокаНоменклатуры.Номенклатура);
			МассивСтрок = ТаблицаНедостач.НайтиСтроки(СтруктураПоиска);
			Для каждого ТекСтрока из МассивСтрок Цикл
				МаксИндексИС = ТекСтрока.МассивИС.Количество() - 1;
				Для к = 0 по МаксИндексИС Цикл
					ТекЭлемент = ТекСтрока.МассивИС[к];
					ТекстИС = "  " + ТекЭлемент.КВД + ", "
						+ ?(ЗначениеЗаполнено(ТекЭлемент.Баланс), ТекЭлемент.Баланс, "<...>");
					Если к = 0 Тогда
						ТекНехватает = Окр(ТекСтрока.Нехватает, 3);
						ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
						ОбластьСтрока.Параметры.ИС = ТекстИС;
						ОбластьСтрока.Параметры.Нехватает = ТекНехватает;
						ТабДокумент.Вывести(ОбластьСтрока);
						
						ВсегоПоНоменклатуре = ВсегоПоНоменклатуре + ТекНехватает;
						ВысотаДляИС = ТабДокумент.ВысотаТаблицы;
					Иначе 
						ОблИС = ТабДокумент.Область(ВысотаДляИС, 5, ВысотаДляИС, 5);
						ОблИС.Текст = ОблИС.Текст + Символы.ПС + ТекстИС;
					КонецЕсли;	
					
					ВысотаДляШрифта = ТабДокумент.ВысотаТаблицы;
					ТекОбласть = ТабДокумент.Область(ВысотаДляШрифта, 1, ВысотаДляШрифта, 5);
					Если СтрокаНоменклатуры.КоличествоСтрок > 1 Тогда
						ТекОбласть.Шрифт = Новый Шрифт(ТекОбласть.Шрифт.Имя,,, Истина);
					Иначе	
						ТекОбласть.Шрифт = Новый Шрифт(ТекОбласть.Шрифт.Имя, 10,, Ложь);
					КонецЕсли;	
				КонецЦикла;	
			КонецЦикла;	
			
			Если СтрокаНоменклатуры.КоличествоСтрок > 1 Тогда
				ТабДокумент.Область(ТекВысота, 4).Текст = ВсегоПоНоменклатуре;
				ТабДокумент.ЗакончитьГруппуСтрок();
			КонецЕсли;	
		КонецЦикла;	
		
		ТабДокумент.Вывести(ОбластьКонцевик);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли