
#Область ОписаниеПеременных

// Используется при изменении ЦМО, для проверки необходимости очистки таблицы
&НаКлиенте
Перем ЦМООтправительДоИзменения; // СправочникСсылка.ЦМО

// Используется при изменении КФО, для проверки необходимости очистки таблицы
&НаКлиенте
Перем КФОДоИзменения; // ПеречислениеСсылка.КВД

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	УправлениеМатериальнымиЗапасамиФормы.ДокументПриСозданииНаСервере(ЭтотОбъект);
	
	ОбщегоНазначенияБГУ.УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	УстановитьОграничениеТипаДокументаОснования();
	
	УправлениеМатериальнымиЗапасамиФормы.СохранитьПараметрыВыбораКЭК(ЭтотОбъект, Элементы.МатериалыКЭК);
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
		УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);
	Иначе
		// При первом открытии формы существующего документа параметры нужно установить здесь, а не в ПриЧтенииНаСервере
		ИзменитьОтборКЭК();
	КонецЕсли;
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияИС
	ИнтеграцияИС.ПриСозданииНаСервереВФормеДокументаОснования(ЭтотОбъект, Объект, ИнтеграцияИС.ПараметрыИнтеграцииВФорме("ВетИС",ИнтеграцияИС.ИмяЭлементаДляРазмещения()));
	// Конец ИнтеграцияИС
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект);
	
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	ПодключитьОбработчикОжидания("ОповеститьОбОшибкеПриЗаписи", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ГолосованиеКомиссии
	Если РешениеСотрудникаМодифицированность Тогда
		СохранитьРезультатыГолосованияНаСервере(Сотрудник, РезультатыГолосованияСотрудника(Объект.Материалы));
	КонецЕсли;
	// Конец ГолосованиеКомиссии
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если УправлениеМатериальнымиЗапасамиКлиент.ОбработкаВыбораИзПодбораМЗ(ИсточникВыбора) Тогда
		ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТ" Тогда
		ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДоступностьСвязанныхЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами"
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	Оповестить("ДокументыПоУчетуМатериальныхЗапасовИзменение");
	УстановитьВидимостьДанныхДрагМатериалов();
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ДокументОснование"	, Объект.ДокументОснование);
	ПараметрыОповещения.Вставить("Ссылка"				, Объект.Ссылка);
	ПараметрыОповещения.Вставить("Проведен"				, Объект.Проведен);
	
	Оповестить("СписаниеМЗПООснованию", ПараметрыОповещения);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом 
			И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись
			Или ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		Если Не Документы.АктСписанияМЗ.ПроверитьОстаткиМЗПоРешениюОПрекращенииПризнания(Объект) Тогда
			ТекстОшибкиПриЗаписи = НСтр("ru = 'Документ записан, но не может быть проведен.'");
		КонецЕсли;
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	// ИнтеграцияИС
	ИнтеграцияИСКлиент.ОбработкаОповещенияВФормеДокументаОснования(
		ЭтотОбъект,
		Объект,
		ИмяСобытия,
		Параметр,
		Источник);
	// Конец ИнтеграцияИС

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СобытияФормИСКлиентПереопределяемый.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);	

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере()
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ДоступностьСвязанныхЭлементов();
	УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОтправительПриИзменении(Элемент)
	
	УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);

КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДействиеПриИзменении = Новый ОписаниеОповещения("ПриИзмененииСчетаУчета", ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиКлиент.НачатьОбработкуВыбораСчетаУчета(ВыбранноеЗначение, СтандартнаяОбработка, ЭтотОбъект, ДействиеПриИзменении);
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаДрагМатериалы" Тогда
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
		
		ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтотОбъект);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВыбратьКомиссиюНажатие(Элемент)
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседательКомиссии", "ФамилияПредседательКомиссии", "ИмяПредседательКомиссии",
		"ОтчествоПредседательКомиссии");
	ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии(ЭтотОбъект, ИменаРеквизитов, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьВЛичноеПользованиеПриИзменении(Элемент)
	ВыдатьВЛичноеПользованиеПриИзмененииСервер();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЕстьРешениеОПрекращенииПризнанияАктивомПриИзменении(Элемент)
	ЕстьРешениеОПрекращенииПризнанияАктивомПриИзмененииАсинх();
КонецПроцедуры

&НаКлиенте
Процедура РешениеОПрекращенииПризнанияАктивомПриИзменении(Элемент)
	ЗаполнитьПоДокументуОснованию();
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	ПриИзмененииСчетаУчетаНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВПрослеживаемостиПриИзменении(Элемент)
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательРезервированиеПриИзменении(Элемент)
	УправлениеМатериальнымиЗапасамиФормыКлиент.ПриИзмененииПереключателяРезервирования(ЭтотОбъект);
	Если ЭтоАктСписания0510460или0510461 Тогда
		УправлениеЭлементамиГолосования();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АннулированПриИзменении(Элемент)
	РезервированиеНФАКлиент.ПриИзмененииФлажкаАннулирован(ЭтотОбъект,
		Новый ОписаниеОповещения("ПослеИзмененияФлажкаАннулирован", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	УстановитьЭтоАктСписания0510460или0510461(ЭтотОбъект);
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ПервичныйДокументПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если РешениеСотрудникаМодифицированность
		И ЗначениеЗаполнено(ВыбранныйСотрудник)
		И ВыбранныйСотрудник <> Сотрудник Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Сотрудник", ВыбранныйСотрудник);
		ДопПараметры.Вставить("РезультатыГолосования", РезультатыГолосованияСотрудника(Объект.Материалы));
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), ВыбранныйСотрудник);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	СотрудникПриИзмененииНаСервере();
	
	ВыбранныйСотрудник = Сотрудник;
	
	РешениеСотрудникаМодифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОтборПрисутствующих = Новый Структура("Отсутствует", Ложь);
	ПрисутствующиеЧленыКомиссии = Объект.СоставКомиссии.НайтиСтроки(ОтборПрисутствующих);
	
	// Выбирается из присутствующих членов комиссии.
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЧленКомиссии Из ПрисутствующиеЧленыКомиссии Цикл
		Элемент.СписокВыбора.Добавить(ЧленКомиссии.Сотрудник);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	КомиссияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НадписьФайлНеВыбранНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		ОповещениеФайла = Новый ОписаниеОповещения("ОбработатьВыборФайлаСотрудника", ЭтотОбъект);
		РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элементы.ФайлСотрудника, ,ОповещениеФайла);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУдалитьФайлНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Или Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрепитьФайлСотрудникаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КФОВТабличнойЧастиПриИзменении(Элемент)

	ПараметрыОбработкиИзменения = Новый Структура;
	ПараметрыОбработкиИзменения.Вставить("Форма", ЭтотОбъект);
	ПараметрыОбработкиИзменения.Вставить("ОбработчикЗаполненияКФО", Новый ОписаниеОповещения("ЗаполнитьКФОВТабличнойЧасти", ЭтотОбъект));
	ПараметрыОбработкиИзменения.Вставить("ОбработчикПроверкиКФО", Новый ОписаниеОповещения("ПолучитьЗначенияКФОВТабличнойЧасти", ЭтотОбъект));
	
	УправлениеМатериальнымиЗапасамиКлиент.ПриИзмененииНастройкиИспользованияКФО(ПараметрыОбработкиИзменения);
	
	УстановитьДоступностьКФО(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КФОПриИзменении(Элемент)
	
	ПараметрыИзмененияКФО = УправлениеНФАКлиент.ПараметрыИзмененияРеквизитаСОчисткойТЧ();
	ПараметрыИзмененияКФО.ЗначениеДоИзменения = КФОДоИзменения;
	ПараметрыИзмененияКФО.ИмяРеквизита = "КФО";
	ПараметрыИзмененияКФО.СинонимРеквизита = НСтр("ru = 'КФО'");
	ПараметрыИзмененияКФО.ИменаТабличныхЧастей = "Материалы, СведенияПрослеживаемости";
	
	УправлениеНФАКлиент.ПриИзмененииРеквизитаСОчисткойТЧ(Объект, ПараметрыИзмененияКФО); 
	
КонецПроцедуры

&НаКлиенте
Процедура КФООбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	КФОДоИзменения = Объект.КФО;
КонецПроцедуры

&НаКлиенте
Процедура ЦМООтправительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЦМООтправительДоИзменения = Объект.ЦМООтправитель;
КонецПроцедуры

&НаКлиенте
Процедура ЦМООтправительПриИзменении(Элемент)
	ПараметрыИзмененияЦМО = УправлениеНФАКлиент.ПараметрыИзмененияРеквизитаСОчисткойТЧ();
	ПараметрыИзмененияЦМО.ЗначениеДоИзменения = ЦМООтправительДоИзменения;
	ПараметрыИзмененияЦМО.ИмяРеквизита = "ЦМООтправитель";
	ПараметрыИзмененияЦМО.СинонимРеквизита = НСтр("ru = 'МОЛ/Место хранения'");
	ПараметрыИзмененияЦМО.ИменаТабличныхЧастей = "Материалы, ДрагоценныеМатериалы, СведенияПрослеживаемости";
	
	УправлениеНФАКлиент.ПриИзмененииРеквизитаСОчисткойТЧ(Объект, ПараметрыИзмененияЦМО);
	ОчисткаРеквизитовПолучателяИмуществаСчет27(ЭтотОбъект);
	УстановитьВидимостьЭлементовЦМО_ЛичногоПользованияСчет27(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОтвета = Новый ОписаниеОповещения("ПослеИзмененияДокументаОснования", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Заполнить документ по выбранному документу-основанию?'");
	ПоказатьВопрос(ОписаниеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ДержательИмуществаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	ТекущийДержательИмущества = Объект.ПолучательИмущества;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДержательИмуществаПриИзменении(Элемент)
	
	Если ТекущийДержательИмущества <> Объект.ПолучательИмущества Тогда
		Если Объект.Материалы.Количество() Тогда
			Если Ждать СогласиеПользователяНаОчисткуМатериалы() Тогда
				Объект.Материалы.Очистить();
			Иначе
				Объект.ПолучательИмущества = ТекущийДержательИмущества;
			КонецЕсли;
		КонецЕсли;
		ОчисткаРеквизитовПолучателяИмуществаСчет27(ЭтотОбъект);
		УстановитьВидимостьЭлементовЦМО_ЛичногоПользованияСчет27(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательИмуществаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПолучательИмущества) И УчетПоПодразделениямНаСчетахУчетаИмущества Тогда
		Объект.ПодразделениеПолучатель = ТекущееПодразделениеПолучателяИмущества(Объект.Дата, Объект.ПолучательИмущества);
	КонецЕсли;

КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		ТекущиеДанные.РезолюцияКомиссииОдобрена = Ложь;
		ТекущиеДанные.ИтогГолосования = 0;
		ТекущиеДанные.РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.ПустаяСсылка");
	КонецЕсли;

	Если НоваяСтрока И НЕ Копирование Тогда
		Если СчетУчетаВТаблицеБратьИзШапки(ЭтотОбъект) Тогда
			ТекущиеДанные.СчетУчета = Объект.СчетУчета;
			УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеДинамическихКолонокТекущейСтрокиМатериалов(Объект, ТекущиеДанные);
		КонецЕсли;
		ТекНомерСтроки = ТекущиеДанные.НомерСтроки;
		Если ТекНомерСтроки >1 Тогда
			ТекущиеДанные.ПричинаСписания = Объект.Материалы[ТекНомерСтроки-2].ПричинаСписания;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.НаправленияРасходаМПЗ") Тогда
		МассивСтрок = Элементы.Материалы.ВыделенныеСтроки;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			ТекСтр = Объект.Материалы.НайтиПоИдентификатору(ЭлМас);
			Если ТекСтр <> Неопределено Тогда
				ТекСтр.ПричинаСписания = ВыбранноеЗначение;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПричиныСписанияНФА") Тогда
		МассивСтрок = Элементы.Материалы.ВыделенныеСтроки;
		Для Каждого ЭлМас Из МассивСтрок Цикл
			ТекСтр = Объект.Материалы.НайтиПоИдентификатору(ЭлМас);
			Если ТекСтр <> Неопределено Тогда
				ТекСтр.ПричинаСписанияСсылка = ВыбранноеЗначение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередУдалением(Элемент, Отказ)
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбУдалении", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'После удаления строки ее нельзя будет добавить вручную.
			|Для повторного добавления строки потребуется полностью заполнить документ на основании ""Решения о прекращении признанания"".
			|Продолжить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ОбъектНаУдаление = Элементы.Материалы.ТекущиеДанные.Номенклатура;
	ПриУдаленииНоменклатуры(ОбъектНаУдаление);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Истина);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Материалы.ТекущиеДанные;
	ТекДанные.КоличествоНорма = ТекДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаПриИзменении(Элемент)
	ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, Элементы.Материалы.ТекущиеДанные, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.НачалоВыбораСчетаМатериалаВТаблицеДокумента(ЭтотОбъект,
		Объект.СчетУчета, Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.АвтоПодборСчетаМатериалаВТаблицеДокумента(ЭтотОбъект, Объект.СчетУчета, Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСчетУчетаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеМатериальнымиЗапасамиКлиент.ОкончаниеВводаТекстаСчетаМатериалаВТаблицеДокумента(ЭтотОбъект, Объект.СчетУчета, Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПричинаСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.НаправленияРасходаМПЗ.Форма.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПричинаСписанияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	Если СтрДлина(Текст) > 0 Тогда
		ПараметрыВыбораЗначения = Новый Структура("СтрокаПоиска", Текст);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.НаправленияРасходаМПЗ"), ПараметрыВыбораЗначения);
		Если ДанныеВыбора.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыДополнительнаяАналитикаСчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если СчетУчета27(ЭтотОбъект) Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ОрганизацияСотрудника", Объект.Организация));
		ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.ДополнительнаяАналитикаСчета);
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрослеживаемостьФормыБГУКлиент.МатериалыВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка, Ложь, "Материалы");
	ОбщегоНазначенияБГУКлиент.РешениеСотрудникаПоРезолюцииВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		ПодключитьОбработчикОжидания("Подключаемый_УправлениеПрослеживаемостью", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВидимыеДефектыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаголовокФормыВвода = НСтр("ru = 'Видимые особенности объекта - Дефекты'");
	НачатьВводДлинногоТекста("ВидимыеДефекты", ЗаголовокФормыВвода);	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыОсобыеОтметкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаголовокФормыВвода = НСтр("ru = 'Видимые особенности объекта - Особые отметки'");
	НачатьВводДлинногоТекста("ОсобыеОтметки", ЗаголовокФормыВвода);	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект)
		Или Объект.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРешениеСотрудникаПоРезолюцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	ТекущиеДанные.РешениеСотрудникаПоРезолюции = ВыбранноеЗначение;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, "Материалы");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРНПТОчистка(Элемент, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар Тогда
		УдалитьСтрокиРНПТ(СтрокаТабличнойЧасти.ИдентификаторСтроки);
	Иначе
		СтрокаТабличнойЧасти.НомерГТД = Неопределено;
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиентСервер.ОчиститьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокНФАДокументаОснования

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено И ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ПодключитьОбработчикОжидания("ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии1

&НаКлиенте
Процедура СоставКомиссии1ПриИзменении(Элемент)
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1ПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора",, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьНормуСотрудника(Команда)
	УправлениеНФАКлиент.ОткрытьОбеспечениеСотрудникаИмуществом(Объект.ПолучательИмущества);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		Возврат;
	КонецЕсли;
	ПараметрыПодбора = УправлениеМатериальнымиЗапасамиФормыКлиент.ПараметрыОткрытияПодбора();
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'Организация'"));
	Если Не СчетУчета27(ЭтотОбъект) Тогда
		ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'ЦМООтправитель, МОЛ/Место хранения'"));
	Иначе
		Если НЕ ЗначениеЗаполнено(Объект.ЦМООтправитель) Тогда
			ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'ПолучательИмущества, Получатель имущества(сотрудник)'")); 
		КонецЕсли;
	КонецЕсли;
	ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'СчетУчета, Счет учета'"));
	Если Не Объект.КФОВТабличнойЧасти Тогда
		ПроверяемыеРеквизиты.Добавить(НСтр("ru = 'КФО'"));
	КонецЕсли;
	ПараметрыПодбора.ПроверяемыеРеквизиты = СтрСоединить(ПроверяемыеРеквизиты, ";");
	ПараметрыПодбора.ПараметрыОтбора = ДополнитьСтруктуруПодбора();
	Если Объект.Материалы.Количество() Тогда
		ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора);
	КонецЕсли;
	УправлениеМатериальнымиЗапасамиФормыКлиент.ОткрытьПодборМатериалов(ЭтотОбъект, Объект, ПараметрыПодбора);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСписокСчетов(Команда)
	
	Если ЗначениеЗаполнено(Объект["Организация"]) Тогда
		ПараметрыФормы = Новый Структура("Организация, ИФО, Дата",
			Объект.Организация,
			Объект.ИФО,
			Объект.Дата);
		ОткрытьФорму("РегистрСведений.ДополнительныеГруппыСчетовИнвентаризацииМЗ.Форма.НастройкаСпискаСчетов", ПараметрыФормы);
		
	Иначе
		ТекстЗаголовка = НСтр("ru='Инвентаризация материалов'");
		ТекстСообщения = НСтр("ru='Поле ""Организация"" не заполнено. Список счетов редактируется только для конкретной организации, поэтому сначала выберите ее.'");
		ПоказатьПредупреждение(Неопределено, ТекстСообщения, 20, ТекстЗаголовка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаправлениеРасхода(Команда)
	ОткрытьФорму("Справочник.НаправленияРасходаМПЗ.Форма.ФормаВыбора",,Элементы.Материалы);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПричинуСписания(Команда)
	ОткрытьФорму("Справочник.ПричиныСписанияНФА.ФормаВыбора",,Элементы.Материалы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКПСНоменклатура(Команда)
	ЗаполнитьКПСнаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДМДляСписания(Команда)
	ЗаполнитьСписокДМДляСписанияНаСервере();
	
	ЗаполнитьОбъектыСДрагМатериалами();
	ЗаполнитьКлючиСтрокДрагМатериалов();
	
    ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОтбораДМПоОбъекту(Команда)
	
	ИспользоватьОтборДрагМатериаловПоОбъектуНФА = НЕ ИспользоватьОтборДрагМатериаловПоОбъектуНФА;
	УстановитьВидимостьДанныхДрагМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседательКомиссии", "ФамилияПредседательКомиссии", "ИмяПредседательКомиссии",
		"ОтчествоПредседательКомиссии");
		
	ОбщегоНазначенияБГУКлиент.НачатьВыборПредседателяКомиссии(ЭтотОбъект, ИменаРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ОбщегоНазначенияБГУКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект);
	
КонецПроцедуры

// ГолосованиеКомиссии
&НаКлиенте
Процедура КомандаСохранитьРезультатыГолосования(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Сотрудник", Сотрудник);
	ДопПараметры.Вставить("РезультатыГолосования", Новый Массив);
	Для Каждого Строка Из Объект.Материалы Цикл
		Если ЗначениеЗаполнено(Строка.РешениеСотрудникаПоРезолюции) Тогда
			РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
				Строка.ИдентификаторСтроки, Строка.РешениеСотрудникаПоРезолюции);
			ДопПараметры.РезультатыГолосования.Добавить(РезультатГолосования);
		КонецЕсли;
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), Сотрудник);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноЗаВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "За");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноПротивВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "Против");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры
// Конец ГолосованиеКомиссии

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ВыгрузитьВВЕТИС(Команда)
	
	ДополнительныеПараметры = Новый Структура("Основание", Объект.Ссылка);
	ОткрытьФорму("Документ.ИнвентаризацияПродукцииВЕТИС.ФормаОбъекта", ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчетаВТаблицеБратьИзШапки(Форма)
	Возврат Не СчетУчета105(Форма);
КонецФункции

&НаСервере
Процедура ИзменитьОтборКЭК()
	УправлениеМатериальнымиЗапасамиФормы.УстановитьПараметрыВыбораКЭК(ЭтотОбъект, Элементы.МатериалыКЭК,
		Объект.СчетУчета, Объект.Дата, Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбОшибкеПриЗаписи()
	Если Не ПустаяСтрока(ТекстОшибкиПриЗаписи) Тогда
		ПоказатьПредупреждение(Неопределено, ТекстОшибкиПриЗаписи);
		ТекстОшибкиПриЗаписи = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбУдалении(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да И Элементы.Материалы.ТекущиеДанные <> Неопределено Тогда
		ОбъектНаУдаление = Элементы.Материалы.ТекущиеДанные.Номенклатура;
		ПриУдаленииНоменклатуры(ОбъектНаУдаление);
		Объект.Материалы.Удалить(Элементы.Материалы.ТекущаяСтрока);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриУдаленииНоменклатуры(ОбъектНаУдаление)
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ОбъектНаУдаление);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество()<>0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПараметрыОповещения = Новый Структура("НайденныеСтроки", НайденныеСтроки);
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОДрагМатериалах", ЭтотОбъект, ПараметрыОповещения);
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Удалить данные о содержании драгоценных материалов в удаленном объекте НФА (%1) на закладке ""Драгоценные материалы""?'"),
			СокрЛП(ОбъектНаУдаление));
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипаДокументаОснования()
	ТипыОснований = Объект.Ссылка.Метаданные().Реквизиты.ДокументОснование.Тип.Типы();
	
	ТипыОграничений = Новый Массив;
	Для Каждого ТипОснования Из ТипыОснований Цикл
		Если ТипОснования <> Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗ") Тогда
			ТипыОграничений.Добавить(ТипОснования);				
		КонецЕсли;
	КонецЦикла;
	Элементы.ДокументОснование.ОграничениеТипа = Новый ОписаниеТипов(ТипыОграничений);
	Элементы.РешениеОПрекращенииПризнанияАктивом.ОграничениеТипа =
		Новый ОписаниеТипов("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗ");
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЕстьРешениеОПрекращенииПризнанияАктивомПриИзмененииАсинх()
	ФлагИзменился = Ждать ЕстьСогласиеПользователяНаИзменениеФлагаЕстьРешение(); 
	Если Не ФлагИзменился Тогда
		Возврат;
	КонецЕсли;
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		ОчиститьРеквизитыНедоступныеЕслиВыбраноРешение(Объект);
		УправлениеМатериальнымиЗапасамиКлиентСервер.ОчиститьВидДопСубконтоЛичногоПользования(ЭтотОбъект, "МатериалыДополнительноеСубконтоСчета");
	Иначе
		Объект.ДокументОснование = Неопределено;
		ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	КонецЕсли;
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Асинх Функция ЕстьСогласиеПользователяНаИзменениеФлагаЕстьРешение()
	
	ТекстВопроса = "";
	Если Объект.ЕстьРешениеОПрекращенииПризнанияАктивом Тогда
		Если Объект.ВыдатьВЛичноеПользование Тогда
			ТекстВопроса = НСтр("ru = 'Будет снят флаг ""Выдать в личное пользование"" и очищен получатель имущества'");
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Объект.ДокументОснование)
			И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомМЗ") Тогда
			ТекстВопроса = НСтр("ru = 'Будет очищен документ ""Решение""'");				
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстВопроса) Тогда
		Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Если Результат <> КодВозвратаДиалога.ОК Тогда
			Объект.ЕстьРешениеОПрекращенииПризнанияАктивом = Не Объект.ЕстьРешениеОПрекращенииПризнанияАктивом;
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПослеИзмененияДокументаОснования(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоДокументуОснованию();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(Объект.ДокументОснование);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	ПодготовитьФормуНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеИзмененияФлажкаАннулирован(Результат, ДополнительныеПараметры) Экспорт
	Если ЭтоАктСписания0510460или0510461 Тогда
		УправлениеЭлементамиГолосования();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПервичныйДокументПриИзмененииНаСервере()
	
	Если ЭтоАктСписания0510460или0510461 И Объект.Материалы.Количество() > 0 Тогда
		ПроверитьЗаполнениеИдентификатораСтроки();
	КонецЕсли;
	
	Если  Объект.СоставКомиссии.Количество() > 0
			И ЭтоАктСписания0510460или0510461
			И Не ЗначениеЗаполнено(Объект.Комиссия) Тогда
		Объект.СоставКомиссии.Очистить();
	КонецЕсли;
	
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЭтоАктСписания0510460или0510461(Форма)
	Форма.ЭтоАктСписания0510460или0510461 =
		ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
			Форма.Объект.ПервичныйДокумент, "АктОСписанииМЗ0510460_157н")
		Или ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
			Форма.Объект.ПервичныйДокумент, "АктОСписанииБСО0510461_157н")
		Или ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
			Форма.Объект.ПервичныйДокумент, "АктСписания0510454");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКФО(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КФО", "Доступность", Не Форма.Объект.КФОВТабличнойЧасти);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьРуководителя(Знач Организация, Знач Подразделение, Знач Дата, Руководитель)

	НовыйРуководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Руководитель", Организация, Дата, Подразделение);
	
	Если ЗначениеЗаполнено(НовыйРуководитель.ОтветственноеЛицоСсылка) 
		И Руководитель <> НовыйРуководитель.ОтветственноеЛицоСсылка Тогда
		Руководитель = НовыйРуководитель.ОтветственноеЛицоСсылка;
		#Если НаКлиенте Тогда
		ПоказатьОповещениеПользователя(,,НСтр("ru = 'Установлено новое значение поля ""Руководитель"" на закладке ""Заключение комиссии""'"));			
		#КонецЕсли
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ТребуетсяВызовСервера = ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
		Или ((СчетУчета105(ЭтотОбъект) Или СчетУчета106(ЭтотОбъект)) 
			И УправлениеМатериальнымиЗапасамиКлиентСервер.ИзменилосьПрименениеДетальногоКЭК340и440(
				ЭтотОбъект.КэшПараметров.Дата,
				ЭтотОбъект.КэшПараметров.Организация,
				Объект.Дата,
				Объект.Организация));

	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		УстановитьРуководителя(Объект.Организация, Объект.ПодразделениеОтправитель, Объект.Дата, Объект.Руководитель);
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		ЗаполнитьДанныеСчетовВФорме();
		Если СчетУчета0133(ЭтотОбъект) Тогда
			ИзменитьОтборКЭК();
		КонецЕсли;
		
	КонецЕсли;
	
	Если СчетУчета105(ЭтотОбъект) Или СчетУчета106(ЭтотОбъект) Или СчетУчета0133(ЭтотОбъект) Тогда
		УправлениеМатериальнымиЗапасами.ОбработатьИзменениеПримененияДетальногоКЭК340и440(ЭтотОбъект,
			ЭтотОбъект.КэшПараметров.Дата,
			ЭтотОбъект.КэшПараметров.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	ЗаполнитьДанныеСчетовВФорме();
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущееПодразделениеПолучателяИмущества(Знач Дата, Знач ПолучательИмущества)
	
	Возврат Справочники.Сотрудники.ПолучитьСвойствоСотрудника(
	ПолучательИмущества,
	"Подразделение",
	Дата);
	
КонецФункции

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСчетаУчета(Результат, Параметры) Экспорт
	
	ПриИзмененииСчетаУчетаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСчетаУчетаНаКлиенте()
	ПриИзмененииСчетаУчетаНаСервере();
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ОчисткаРеквизитовПолучателяИмуществаСчет27(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДинамическиеКолонкиВоВсехСтроках()
	НоменклатураДокумента = Объект.Материалы.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"); // Массив из СправочникСсылка.Номенклатура
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(НоменклатураДокумента, "ТипНоменклатуры");
	Для Каждого Строка Из Объект.Материалы Цикл
		ТипНоменклатурыМЗ = РеквизитыНоменклатуры.Получить(Строка.Номенклатура);
		Строка.ЭтоБСО = ТипНоменклатурыМЗ = Перечисления.ТипыНоменклатуры.БСО;
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьТипНоменклатурыВСтрокеДляБиологическихАктивов(Строка,
			ТипНоменклатурыМЗ);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	РаботаСФайламиБГУ.ПолучитьФайлСотрудника(Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

// Обработчик выбора строки постоянно действующией комиссии. 
// См. ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
// 
// Параметры:
//  Результат - см. ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент.Результат
//  ДопПараметры - см. ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент.ДопПараметры
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

&НаКлиенте
Процедура НачатьВводДлинногоТекста(ИмяПоля, ЗаголовокФормыВвода)

	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ИмяПоля", ИмяПоля);
	ОбработчикИзменения = Новый ОписаниеОповещения("ЗавершитьВводДлинногоТекста", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(ОбработчикИзменения, ТекущиеДанные[ИмяПоля], ЗаголовокФормыВвода); 

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводДлинногоТекста(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = ДополнительныеПараметры.ИмяПоля; 
	ТекущиеДанные[ИмяПоля] = Результат;
	Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеИдентификатораСтроки()

	Для каждого Строка Из Объект.Материалы Цикл
		Если Не ЗначениеЗаполнено(Строка.ИдентификаторСтроки) Тогда
			Строка.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)

	РедактированиеЗапрещено = Форма.Объект.ЕстьРешениеОПрекращенииПризнанияАктивом
		И ЗначениеЗаполнено(Форма.Объект.ДокументОснование);
	
	БлокируемыеЭлементы = Новый Массив;
	БлокируемыеЭлементы.Добавить("ЦМООтправитель");
	БлокируемыеЭлементы.Добавить("ПодразделениеОтправитель");
	БлокируемыеЭлементы.Добавить("КФО");
	БлокируемыеЭлементы.Добавить("КФОВТабличнойЧасти");
	БлокируемыеЭлементы.Добавить("ИФО");
	БлокируемыеЭлементы.Добавить("МатериалыНоменклатура");
	БлокируемыеЭлементы.Добавить("МатериалыКПС");
	БлокируемыеЭлементы.Добавить("МатериалыКФО");
	БлокируемыеЭлементы.Добавить("МатериалыСчетУчета");
	БлокируемыеЭлементы.Добавить("МатериалыКЭК");
	БлокируемыеЭлементы.Добавить("МатериалыДополнительнаяАналитикаСчета");
	БлокируемыеЭлементы.Добавить("ТребуетсяУтилизация");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, БлокируемыеЭлементы,
		"ТолькоПросмотр", РедактированиеЗапрещено);
	Если Не РедактированиеЗапрещено Тогда 
		ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(Форма);
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьРеквизитыНедоступныеЕслиВыбраноРешение(Объект)
	Объект.ВыдатьВЛичноеПользование = Ложь;
	Объект.ПолучательИмущества = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	Объект.Комиссия = ПредопределенноеЗначение("Справочник.ПостоянноДействующиеКомиссии.ПустаяСсылка");
	Объект.СоставКомиссии.Очистить();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "МатериалыКФО", "Видимость",
		Форма.Объект.КФОВТабличнойЧасти);
	
	ЭтоАктПриемаПередачи0510434 = ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
		Объект.ПервичныйДокумент, "Акт0510434");
	ЭтоАктОСписании0510460или0510461 = Форма.ЭтоАктСписания0510460или0510461;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МатериалыЗаполнитьКПСНоменклатура",
		"Видимость", Не Объект.ЕстьРешениеОПрекращенииПризнанияАктивом);
	
	ЭлементыСписанияБезРешения = Новый Массив;
	ЭлементыСписанияБезРешения.Добавить("ДокументОснование");
	ЭлементыСписанияБезРешения.Добавить("АналитикаОперацииСДрагМатериалами");
	ЭлементыСписанияБезРешения.Добавить("НоменклатураЛома");
	ЭлементыСписанияБезРешения.Добавить("СписокНФАДокументаОснования");
	ЭлементыСписанияБезРешения.Добавить("ДрагоценныеМатериалы");
	ЭлементыСписанияБезРешения.Добавить("ДрагоценныеМатериалыЗаполнитьСписокДМДляСписания");
	ЭлементыСписанияБезРешения.Добавить("ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыСписанияБезРешения,
		"Видимость", Не Объект.ЕстьРешениеОПрекращенииПризнанияАктивом);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РешениеОПрекращенииПризнанияАктивом",
		"Видимость", Объект.ЕстьРешениеОПрекращенииПризнанияАктивом);
	
	// Элементы только акта списания 0510460
	Элементы61н = Новый Массив;
	Элементы61н.Добавить("ТребуетсяУтилизация");
	Элементы61н.Добавить("МатериалыПричинаСписанияСсылка");
	Элементы61н.Добавить("МатериалыСерияБСО");
	Элементы61н.Добавить("МатериалыНачальныйНомерБСО");
	Элементы61н.Добавить("МатериалыКонечныйНомерБСО");
	Элементы61н.Добавить("МатериалыУстановитьПричинуСписания");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, Элементы61н,
		"Видимость", ЭтоАктОСписании0510460или0510461);
	
	Элементы61нДляСписания = Новый Массив;
	Элементы61нДляСписания.Добавить("Комиссия");
	Элементы61нДляСписания.Добавить("ГруппаИндикаторКворумаПрисутствия");
	Элементы61нДляСписания.Добавить("СоставКомиссии1");
	Элементы61нДляСписания.Добавить("НадписьГолосование");
	Элементы61нДляСписания.Добавить("Сотрудник");
	Элементы61нДляСписания.Добавить("СохранитьРезультатыГолосования");
	Элементы61нДляСписания.Добавить("НадписьФайл");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, Элементы61нДляСписания,
		"Видимость", ЭтоАктОСписании0510460или0510461);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФайлСотрудника",
		"Видимость", ЭтоАктОСписании0510460или0510461
		И ЗначениеЗаполнено(Форма.ФайлСотрудника));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьУдалитьФайл",
		"Видимость", ЭтоАктОСписании0510460или0510461
		И ЗначениеЗаполнено(Форма.ФайлСотрудника));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НадписьФайлНеВыбран",
		"Видимость", ЭтоАктОСписании0510460или0510461
		И Не ЗначениеЗаполнено(Форма.ФайлСотрудника));
	
	// Элементы акта списания 0504230
	Элементы52н = Новый Массив;
	Элементы52н.Добавить("СоставКомиссии");
	Элементы52н.Добавить("НомерПриказа");
	Элементы52н.Добавить("ДатаПриказа");
	Элементы52н.Добавить("ДекорацияВыбратьКомиссию");
	Элементы52н.Добавить("ДолжностьПредседательКомиссии");
	Элементы52н.Добавить("ФамилияПредседательКомиссии");
	Элементы52н.Добавить("ИмяПредседательКомиссии");
	Элементы52н.Добавить("ОтчествоПредседательКомиссии");
	Элементы52н.Добавить("ВыбратьПредседателяКомиссии");
	Элементы52н.Добавить("ЗаключениеКомиссии");
	Элементы52н.Добавить("МатериалыПричинаСписания");
	Элементы52н.Добавить("МатериалыУстановитьНаправлениеРасхода");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, Элементы52н,
		"Видимость",
		Не ЭтоАктПриемаПередачи0510434
		И Не ЭтоАктОСписании0510460или0510461
		И Не Объект.ЕстьРешениеОПрекращенииПризнанияАктивом);
	
	// Общие реквизиты для выдачи в личное пользование
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВыдатьВЛичноеПользование",
		"Видимость",
		СчетУчета105(Форма) И Не ЭтоАктОСписании0510460или0510461 И Не Объект.ЕстьРешениеОПрекращенииПризнанияАктивом);
	ЭлементыПередачиИмущества = Новый Массив;
	ЭлементыПередачиИмущества.Добавить("ПолучательИмущества");
	ЭлементыПередачиИмущества.Добавить("ОткрытьНормуСотрудника");
	ЭлементыПередачиИмущества.Добавить("МатериалыВидимыеДефекты");
	ЭлементыПередачиИмущества.Добавить("МатериалыОсобыеОтметки");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыПередачиИмущества,
		"Видимость", Объект.ВыдатьВЛичноеПользование);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодразделениеПолучатель",
		"Видимость", Объект.ВыдатьВЛичноеПользование И Форма.УчетПоПодразделениямНаСчетахУчетаИмущества);

	// Основание списания
	ЭлементыОснования = Новый Массив;
	ЭлементыОснования.Добавить("ВидОснованияСписания");
	ЭлементыОснования.Добавить("ДатаОснованияСписания");
	ЭлементыОснования.Добавить("НомерОснованияСписания");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыОснования,
		"Видимость", Не ЭтоАктОСписании0510460или0510461);
	
	// Резервирование и подбор
	ЭлементыРезервированияПодбор = Новый Массив;
	ЭлементыРезервированияПодбор.Добавить("ПереключательРезервирование");
	ЭлементыРезервированияПодбор.Добавить("Аннулирован");
	ЭлементыРезервированияПодбор.Добавить("МатериалыПодборНоменклатуры");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ЭлементыРезервированияПодбор,
		"Видимость", Не Объект.ЕстьРешениеОПрекращенииПризнанияАктивом);
		
	// Прослеживаемость
	ВидимостьЭлементовПрослеживаемости = Форма.ВедетсяУчетПрослеживаемыхТоваров
		И СчетУчетаПрослеживаемый(Форма)
		И Форма.ЕстьПрослеживаемыеТовары
		И Не Объект.ЕстьРешениеОПрекращенииПризнанияАктивом;
	
	ИменаЭлементовПрослеживаемости = Новый Массив;
	ИменаЭлементовПрослеживаемости.Добавить("ОтражатьВПрослеживаемости");
	ИменаЭлементовПрослеживаемости.Добавить("МатериалыПрослеживаемыйТовар");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости);
	
	ИменаЭлементовДвиженияПрослеживаемости = Новый Массив;
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("МатериалыСтранаПроисхождения");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("МатериалыРНПТ");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("КодОперацииПрослеживаемости");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовДвиженияПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости И Объект.ОтражатьВПрослеживаемости);
	
	УстановитьВидимостьЭлементовЦМО_ЛичногоПользованияСчет27(Форма);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"МатериалыДополнительноеСубконтоСчета",
		"Видимость", Форма.ЕстьДополнительноеСубконто3 ИЛИ ЗначениеЗаполнено(Форма.ДополнительноеСубконто27ВидСубконто));
	
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(Форма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме = Неопределено)

	ПараметрыЗаполненияСчета = УправлениеМатериальнымиЗапасами.ПараметрыЗаполненияДанныхСчетовУчетаМЗВФорме();
	ПараметрыЗаполненияСчета.Организация = Объект.Организация;
	ПараметрыЗаполненияСчета.ДатаСчета = Объект.Дата;
	ПараметрыЗаполненияСчета.Включать113 = Истина;
	ПараметрыЗаполненияСчета.Включать106 = Истина;
	ПараметрыЗаполненияСчета.СписокВыбора = Элементы.СчетУчета.СписокВыбора;
	УправлениеМатериальнымиЗапасамиФормы.ЗаполнитьДанныеСчетовУчетаМЗВФорме(ЭтотОбъект, ПараметрыЗаполненияСчета,
		ДанныеСчетовВФорме);
	
	Для Каждого НастройкаСчета Из ДанныеСчетовВФорме Цикл
		Если ЗначениеЗаполнено(НастройкаСчета.ДополнительноеСубконто3) Тогда
			СчетаДопСубконто3.Добавить(НастройкаСчета.Счет);
		КонецЕсли;
	КонецЦикла;
	
	УправлениеМатериальнымиЗапасами.ЗаполнитьСчетаУчетаМЗ105(ЭтотОбъект);
	ОтключитьВидимостьКолонкиДопСубконто();
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		ДатаСчетов = Объект.Дата;
	Иначе
		ДатаСчетов = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	
	МассивСчетов27 = БухгалтерскийУчет.СписокСчетов("27", ДатаСчетов, , Объект.Организация);
	ФиксМассивСчетов27 = Новый ФиксированныйМассив(МассивСчетов27);
	СчетСсылка105 = БухгалтерскийУчет.СчетПоКоду("105.00", ДатаСчетов, Объект.Организация);
	СчетСсылка106 = БухгалтерскийУчет.СчетПоКоду("106.00", ДатаСчетов, Объект.Организация);
	СчетСсылка0133 = БухгалтерскийУчет.СчетПоКоду("01.33", ДатаСчетов, Объект.Организация);
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет105", СчетСсылка105);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет106", СчетСсылка106);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счет0133", СчетСсылка0133);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("Счета27", ФиксМассивСчетов27);
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СчетУчетаИмуществаВПользовании",
		БухгалтерскийУчет.СчетПоКоду("27.02", ДатаСчетов, Объект.Организация));

	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ПрослеживаемыеСчета",
		Новый ФиксированныйМассив(ПрослеживаемостьБГУ.СчетаУчетаНФАСПрослеживаемостью(ДатаСчетов, Объект.Организация)));
		
	УчетПоПодразделениямНаСчетахУчетаИмущества = УправлениеМатериальнымиЗапасами.ЕстьУчетПоПодразделениямСчетаУчета27(
		ЭтотОбъект.КэшПараметров.ИспользоватьУчетПоПодразделениям, ЭтотОбъект.КэшПараметров.Локальные.Счета27);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчета105(Форма)

	Возврат УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен105(Форма);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчетаПрослеживаемый(Форма)

	Возврат Форма.КэшПараметров.Локальные.ПрослеживаемыеСчета.Найти(Форма.Объект.СчетУчета) <> Неопределено;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчета27(Форма)

	Возврат Форма.КэшПараметров.Локальные.Счета27.Найти(Форма.Объект.СчетУчета) <> Неопределено;

КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
	РассчитатьПрослеживаемыеТовары();
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект);
	
	ДанныеСчетовВФорме = Неопределено;
	ЗаполнитьДанныеСчетовВФорме(ДанныеСчетовВФорме);
	УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ДанныеСчетовВФорме);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьВидимостьЭлементовЗагруженногоДокумента(ЭтотОбъект);
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	УстановитьЭтоАктСписания0510460или0510461(ЭтотОбъект);
	
	УправлениеМатериальнымиЗапасами.УстановитьВидДопСубконтоЛичногоПользования(
	ЭтотОбъект,
	Объект.ВыдатьВЛичноеПользование,
	ЭтотОбъект.КэшПараметров.Локальные.СчетУчетаИмуществаВПользовании,
	"МатериалыДополнительноеСубконтоСчета",
	"Материалы");
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьПризнакФормыДополнительноеСубконто3(ЭтотОбъект);

	ИзменитьОтборКЭК();
	УстановитьДоступностьКФО(ЭтотОбъект);
	УстановитьДоступностьЭлементов(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	УправлениеМатериальнымиЗапасамиФормыКлиентСервер.УстановитьПереключательРезервирование(ЭтотОбъект);
	ЗаполнитьДинамическиеКолонкиВоВсехСтроках();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДанныеДинамическихКолонокТаблицыМатериалы(ДанныеСчетовВФорме = Неопределено)
	ПараметрыЗаполненияКолонок = УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки_Параметры(
		ЭтотОбъект, Объект);
	ПараметрыЗаполненияКолонок.Включать106 = Истина;
	ПараметрыЗаполненияКолонок.Включать113 = Истина;
	ПараметрыЗаполненияКолонок.ДанныеСчетов = ДанныеСчетовВФорме;
	УправлениеМатериальнымиЗапасамиКлиентСервер.ЗаполнитьДинамическиеКолонки(ПараметрыЗаполненияКолонок);
КонецПроцедуры

&НаСервере
Процедура УправлениеЭлементамиГолосования()
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	Если Объект.Аннулирован Или (Объект.Проведен И НЕ Объект.Резервировать) Тогда
		Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		РешениеСотрудникаМодифицированность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСчетаУчетаНаСервере()
	ИзменитьОтборКЭК();
	Если НЕ СчетУчета105(ЭтотОбъект) Тогда
		Объект.ВыдатьВЛичноеПользование = Ложь;
		УправлениеМатериальнымиЗапасамиКлиентСервер.ОчиститьВидДопСубконтоЛичногоПользования(ЭтотОбъект, "МатериалыДополнительноеСубконтоСчета");
	КонецЕсли;
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьПризнакФормыДополнительноеСубконто3(ЭтотОбъект);
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ОтключитьВидимостьКолонкиДопСубконто();
	РассчитатьПрослеживаемыеТовары();
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьВидимостьКолонкиДопСубконто()

	Если ВсеСчета105.НайтиПоЗначению(Объект.СчетУчета) = Неопределено Тогда
		УправлениеМатериальнымиЗапасами.ОтключитьВидимостьКолонкиДопСубконто(Элементы.МатериалыДополнительнаяАналитикаСчета,
																			 Объект.СчетУчета);
	Иначе
		ПроверяемыеСчета = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеСчета, ВсеСчета105.ВыгрузитьЗначения());
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПроверяемыеСчета, ВсеСчета113.ВыгрузитьЗначения());
		СписокСчетов = Новый СписокЗначений;
		СписокСчетов.ЗагрузитьЗначения(ПроверяемыеСчета);
		УправлениеМатериальнымиЗапасами.ОтключитьВидимостьКолонкиДопСубконто(Элементы.МатериалыДополнительнаяАналитикаСчета,
																			 ПроверяемыеСчета);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ДополнитьСтруктуруПодбора()

	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("СчетУчета",				Объект.СчетУчета);
	ПараметрыПодбора.Вставить("КФО",					Объект.КФО);
	ПараметрыПодбора.Вставить("ЦМО", 					Объект.ЦМООтправитель);
	ПараметрыПодбора.Вставить("Подразделение",			Объект.ПодразделениеОтправитель);
	ПараметрыПодбора.Вставить("ПоказыватьОстатки",		Истина);
	ПараметрыПодбора.Вставить("ПоказыватьСчетУчета", Истина);
	ПараметрыПодбора.Вставить("ДополнитьСчетом113", Истина);
	ТипыНоменклатуры = Новый СписокЗначений;
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО"));
	ТипыНоменклатуры.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы"));
	ПараметрыПодбора.Вставить("ТипыНоменклатуры",		ТипыНоменклатуры);
	ПараметрыПодбора.Вставить("ИмяТаблицы",				"Материалы");
	
	Если СчетУчета27(ЭтотОбъект) Тогда
		ПараметрыПодбора.Вставить("ПодборОстатковВПользовании", Истина);
		ПараметрыПодбора.Вставить("СчетОстатковВПользовании", Объект.СчетУчета);
		Если ЗначениеЗаполнено (Объект.ПолучательИмущества) Тогда
			ПараметрыПодбора.Вставить("ПроверятьОстаткиВПользовании",	Истина);
			ПараметрыПодбора.Вставить("СотрудникОстатковВПользовании",	Объект.ПолучательИмущества);
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВыдатьВЛичноеПользование Тогда
		ПараметрыПодбора.Вставить("ВладелецНормыВыдачи", Объект.ПолучательИмущества);
	КонецЕсли;
	
	ДополнительноеСубконтоСчета = УправлениеМатериальнымиЗапасамиКлиентСервер.ДополнительнаяАналитикаСчетаУчетаМатериалов(Объект.СчетУчета, Объект.Организация);
	Если ЗначениеЗаполнено(ДополнительноеСубконтоСчета) Тогда
		ПараметрыПодбора.Вставить("ВидСубконтоДополнительнойАналитикиСчета", ДополнительноеСубконтоСчета);
	КонецЕсли;
	Возврат ПараметрыПодбора;

КонецФункции

&НаКлиенте
Процедура ДоступностьСвязанныхЭлементов()

	Элементы.ПодразделениеОтправитель.Доступность 	= ЗначениеЗаполнено(Объект.Организация);
	Элементы.ЦМООтправитель.Доступность				= ЗначениеЗаполнено(Объект.Организация);

КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборПодбораНаСервере(ВыбранноеЗначение);
	
	ТаблицаПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресПодобраннойНоменклатурыВХранилище);
	
	Если ТаблицаПодбора.Количество() Тогда
		ВтМатериалы = Объект.Материалы.Выгрузить();
		УправлениеМатериальнымиЗапасами.ЗаполнитьТаблицуИзПодбораМатериалов(ВтМатериалы, ТаблицаПодбора);
		
		Для Каждого СтрокаМатериалы Из ВтМатериалы Цикл
			Если СтрокаМатериалы.НоваяСтрока Тогда
				СтрокаМатериалы.КоличествоНорма = СтрокаМатериалы.Количество;
				ЗаполнитьДанныеСчетаВСтроке(ЭтотОбъект, СтрокаМатериалы, Ложь, Истина);
				СтрокаМатериалы.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			Иначе
				СтрокаМатериалыОбъект = Объект.Материалы[СтрокаМатериалы.НомерСтрокиДокумента-1];
				КпересчетаНормы = ?(СтрокаМатериалыОбъект.Количество > 0, СтрокаМатериалыОбъект.КоличествоНорма / СтрокаМатериалыОбъект.Количество, 1);
				СтрокаМатериалы.КоличествоНорма = СтрокаМатериалы.Количество*КпересчетаНормы;
			КонецЕсли;
		КонецЦикла;
		
		Объект.Материалы.Загрузить(ВтМатериалы);
		
		РассчитатьПрослеживаемыеТовары();
		УстановитьВидимостьЭлементов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДанныеСчетаВСтроке(Форма, Строка, ЗаполнятьСчет, ЭтоПодбор = Ложь)
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Форма, Строка);
	ПараметрыОбработки.ЗаполнятьСчет = ЗаполнятьСчет И Не СчетУчетаВТаблицеБратьИзШапки(Форма);
	ПараметрыОбработки.ДтКт = ?(СчетУчета0133(Форма), "Дт", "Кт");
	ПараметрыОбработки.Включать113 = Истина;
	ПараметрыОбработки.Включать106 = Истина;
	
	УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(Строка, ПараметрыОбработки);
	Если Не ЭтоПодбор Тогда
		РеквизитыНоменклатуры = УправлениеМатериальнымиЗапасамиВызовСервера.ПолучитьСвойстваНоменклатуры(Строка.Номенклатура, Форма.Объект.Дата);
		ЗаполнитьЗначенияСвойств(Строка, РеквизитыНоменклатуры,
			"ПрослеживаемыйТовар, КомплектСПрослеживаемымиТоварами, СтранаПроисхождения, ТипНоменклатуры");
		Строка.ЭтоБСО = РеквизитыНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО");
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьТипНоменклатурыВСтрокеДляБиологическихАктивов(Строка,
		РеквизитыНоменклатуры.ТипНоменклатуры);
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.ДополнительноеСубконто27ВидСубконто) Тогда
		Строка.ДополнительноеСубконтоВидСубконто = Форма.ДополнительноеСубконто27ВидСубконто;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКПСнаСервере()

	УправлениеМатериальнымиЗапасами.ЗаполнитьКПСвТабличнойЧастиДокументаМЗ(Объект.Материалы, Объект);	

КонецПроцедуры

&НаСервере
Функция СтруктураПараметровПолученияОстатков()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Ссылка",Объект.Ссылка);
	СтруктураПараметров.Вставить("Период",Объект.Дата);
	
	Если Объект.Ссылка.Пустая() Тогда
		СтруктураПараметров.Период = КонецДня(Объект.Дата);
	Иначе
		СтруктураПараметров.Период = Объект.Дата;
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции	
	
&НаСервере
Процедура УстановитьУсловноеОформление()

	ПараметрыУО = УправлениеМатериальнымиЗапасами.ПараметрыУстановкиУсловногоОформленияСпискаМатериалов();
	ПараметрыУО.ИмяТаблицы = "Материалы";
	ПараметрыУО.ИспользуетсяКЭКАвто = Истина;
	ПараметрыУО.ИмяКолонкиУчетПоКЭК = "УчетПоКЭК";
	ПараметрыУО.ИспользуетсяДопСубконто3 = Истина;
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеСпискаМатериаловПоПараметрам(
		ЭтотОбъект, ПараметрыУО);
	УправлениеМатериальнымиЗапасами.УстановитьУсловноеОформлениеКолонкиСуммаСписанияНУ(ЭтотОбъект);
	ПрослеживаемостьФормыБГУ.УстановитьУсловноеОформление(ЭтотОбъект);

	// Решение сотрудника.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.За);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.МатериалыРешениеСотрудникаПоРезолюции.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.РешениеСотрудникаПоРезолюции", ВидСравненияКомпоновкиДанных.Равно,
			Перечисления.РезультатыГолосованияЧленовКомиссии.Против);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ОтметкаОтрицательногоВыполненияЗадачи);
	
	// Текст подсказки полей БСО
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыСерияБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.СерияБСО", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Серия'"));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыНачальныйНомерБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.СерияБСО", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '№ начальный'"));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыКонечныйНомерБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.СерияБСО", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '№ конечный'"));
	
	// Видимость полей БСО
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыСерияБСО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыНачальныйНомерБСО");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыКонечныйНомерБСО");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.ЭтоБСО", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Поле "Срок эксплуатации"
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "МатериалыСрокВЭксплуатации");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Материалы.ЭтоБСО", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<не используется>'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиРНПТ(Знач ИдентификаторСтроки)
	СтрокиСРНПТ = Объект.СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	
	Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
		Объект.СведенияПрослеживаемости.Удалить(СтрокаСРНПТ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)

	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);

КонецПроцедуры

&НаСервере
Процедура ПоместитьМатериалыВХранилищеНаСервере(ПараметрыПодбора)
	
	ПараметрыПодбора.ПараметрыТчДокумента = Новый Структура("АдресТчВХранилище");
	КолонкиРеквизитов = УправлениеМатериальнымиЗапасами.КолонкиПодбораДляВыгрузкиТабличнойЧасти(ЭтотОбъект.ПолучитьРеквизиты("Объект.Материалы"));
	ТаблицаМатериалы = Объект.Материалы.Выгрузить(,КолонкиРеквизитов);
	ПараметрыПодбора.ПараметрыТчДокумента.АдресТчВХранилище = ПоместитьВоВременноеХранилище(ТаблицаМатериалы, ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
		СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки, ВыбранноеЗначение, СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр)
	
	СтрокаТабличнойЧасти = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТН(ЭтотОбъект, ИдентификаторСтроки, ВыбранноеЗначение);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеПрослеживаемостью()
	
	РассчитатьПрослеживаемыеТовары();
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура РассчитатьПрослеживаемыеТовары()

	ПрослеживаемыеТовары     = Объект.Материалы.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина));
	ЕстьПрослеживаемыеТовары = ПрослеживаемыеТовары.Количество() > 0;

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ГолосованиеКомиссии

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СохранитьРезультатыГолосования", "Доступность",
			ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РезультатыГолосованияСотрудника(ТаблицаДокумента)
	
	РезультатыГолосования = Новый Массив;
	
	Для Каждого СтрокаДокумента Из ТаблицаДокумента Цикл
		Если ЗначениеЗаполнено(СтрокаДокумента.РешениеСотрудникаПоРезолюции) Тогда
			РезультатГолосования = Новый Структура("ИдентификаторСтроки,РешениеСотрудникаПоРезолюции",
				СтрокаДокумента.ИдентификаторСтроки, СтрокаДокумента.РешениеСотрудникаПоРезолюции);
			РезультатыГолосования.Добавить(РезультатГолосования);
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатыГолосования;
	
КонецФункции

&НаКлиенте
Процедура УстановитьРешениеВСтрокахДокумента(РешениеСотрудника, ВоВсехСтроках = Истина)
	
	РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.ПустаяСсылка");
	Если РешениеСотрудника = "За" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За");
	ИначеЕсли РешениеСотрудника = "Против" Тогда
		РешениеСотрудникаПоРезолюции = ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против");
	КонецЕсли;
	
	Если ВоВсехСтроках Тогда
		Для Каждого СтрокаДокумента Из Объект.Материалы Цикл
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	Иначе
		Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.Материалы.ВыделенныеСтроки Цикл
			СтрокаДокумента = Объект.Материалы.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
			СтрокаДокумента.РешениеСотрудникаПоРезолюции = РешениеСотрудникаПоРезолюции;
		КонецЦикла;
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьРезультатыГолосованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатыГолосованияНаСервере(ДополнительныеПараметры.Сотрудник, ДополнительныеПараметры.РезультатыГолосования);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыГолосованияНаСервере(ЧленКомиссии, РезультатыГолосования)
	
	ОбщегоНазначенияБГУ.СохранитьРезультатыГолосованияНаСервере(Объект, ЧленКомиссии, РезультатыГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановитьРешениеЕдиногласноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		УстановитьРешениеЕдиногласноНаСервере(ДополнительныеПараметры);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРешениеЕдиногласноНаСервере(РезультатГолосования)
	
	ОбщегоНазначенияБГУ.УстановитьРешениеЕдиногласноНаСервере(Объект, "Материалы", РезультатГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

// Файлы сотрудников

&НаКлиенте
Процедура ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора)
	
	РаботаСФайламиБГУ.ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОткрепитьФайлСотрудникаНаСервере()
	
	РаботаСФайламиБГУ.ОткрепитьФайлСотрудника(ФайлСотрудника, Сотрудник, ЭтотОбъект);
	
КонецПроцедуры

// Конец Файлы сотрудников

#КонецОбласти

#Область УчетДрагМатериалов

&НаСервере
Процедура ЗаполнитьСписокДМДляСписанияНаСервере()
	ПараметрыПолученияОстатков = СтруктураПараметровПолученияОстатков();
	
	Если НЕ ЗначениеЗаполнено(ПараметрыПолученияОстатков.Ссылка) Тогда
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Период, ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;

	ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков);

	УчетДрагМатериалов.ЗаполнитьИсточникиОбразованияЛомаОтходовДрагМатериалов(Объект.Организация, Объект.ДрагоценныеМатериалы, Объект.Дата);
КонецПроцедуры	
	
&НаСервере
Функция ПолучитьТаблицуОСДляДМ()
	
	ТЧ = Объект.Материалы.Выгрузить();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТаблицаОбъектовНФА.Номенклатура,
			|	ТаблицаОбъектовНФА.Количество КАК Количество
			|ПОМЕСТИТЬ СписокНФАСписания
			|ИЗ
			|	&ТаблицаОбъектовНФА КАК ТаблицаОбъектовНФА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СписокНФАСписания.Номенклатура КАК ОбъектНФА,
			|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвНомер,
			|	СписокНФАСписания.Количество
			|ИЗ
			|	СписокНФАСписания КАК СписокНФАСписания";
			
	Запрос.УстановитьПараметр("ТаблицаОбъектовНФА", ТЧ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции	

&НаСервере
Процедура ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков)
	ТаблицаСписанияОбъектов = ПолучитьТаблицуОСДляДМ();
	
	ОстаткиДМ = УчетДрагМатериалов.ЗаполнитьДМДляСписанияМЗ(Объект.Организация, ТаблицаСписанияОбъектов, ПериодОстатков);
	
	Объект.ДрагоценныеМатериалы.Загрузить(ОстаткиДМ);
	
	Для Каждого ТекСтрока Из Объект.Материалы Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("ОбъектНФА", ТекСтрока.Номенклатура);
		НайденныеСтроки = ОстаткиДМ.НайтиСтроки(ПараметрыОтбора);		
		Если ТипЗнч(НайденныеСтроки) = Тип("Массив") Тогда
			Для Каждого ТекСтрокаМассива Из НайденныеСтроки Цикл
				ТекСтрока.КоличествоВсегоДМ = ТекСтрокаМассива.КоличествоВсего; 
				Прервать;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	Для каждого ТекСтрока Из Объект.ДрагоценныеМатериалы Цикл
		ТекСтрока.КлючСтроки = УчетДрагМатериаловКлиент.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА, "");
	КонецЦикла;
	
КонецПроцедуры	
	
&НаСервере
Процедура ЗаполнитьОбъектыСДрагМатериалами()
	ТаблицаВсехОбъектов = Объект.Материалы.Выгрузить(,"Номенклатура, Количество, КоличествоВсегоДМ");
	
	ТаблицаОбъектовМЗ = Новый ТаблицаЗначений;
	ТаблицаОбъектовМЗ.Колонки.Добавить("КлючСтроки",Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовМЗ.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаОбъектовМЗ.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТаблицаОбъектовМЗ.Колонки.Добавить("КоличествоВсегоДМ",Новый ОписаниеТипов("Число"));
	
	НеСодержатДрагМатериалы = УчетДрагМатериалов.ПолучитьМассивТиповНоменклатурыБезДрагМатериалов();
	
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Если НеСодержатДрагМатериалы.Найти(ТекСтрока.Номенклатура.ТипНоменклатуры) = Неопределено Тогда
				НоваяСтрока = ТаблицаОбъектовМЗ.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.КлючСтроки = УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.Номенклатура, ""); 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	ОбъектыНФАСДрагМатериалами.Загрузить(ТаблицаОбъектовМЗ);
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьВидимостьДанныхДрагМатериалов()
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Истина;
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
		
		Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные <> Неопределено Тогда
			ОтборДрагМатериаловДляОбъекта(Элементы.СписокНФАДокументаОснования.ТекущиеДанные.КлючСтроки);
		КонецЕсли;
	Иначе
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Ложь;
		Элементы.ДрагоценныеМатериалы.ОтборСтрок = Неопределено;
	КонецЕсли;	
	
	//Заголовки
	РеквизитыДрагМатериалы = Новый Массив;
	
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоВсегоДМЗаголовок");
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоЗаголовок");
	
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоВсегоДМ");
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличество");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		РеквизитыДрагМатериалы, "Видимость", Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектовДрагМатериалов(ТекущаяСтрока)

	ТекущаяСтрока.КоличествоВсегоДМЗаголовок = НСтр("ru = 'Всего:'");
	ТекущаяСтрока.КоличествоЗаголовок = НСтр("ru = 'Списать:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(Форма)
	
	Для каждого ТекущаяСтрока Из Форма.ОбъектыНФАСДрагМатериалами Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектовДрагМатериалов(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДрагМатериаловДляОбъекта(КлючСтроки)
	
	Элементы.ДрагоценныеМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки",КлючСтроки));
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКлючиСтрокДрагМатериалов()
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОДрагМатериалах(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.НайденныеСтроки Цикл
		Объект.ДрагоценныеМатериалы.Удалить(ТекСтрока);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА()
	Элемент = Элементы.СписокНФАДокументаОснования;
	ОтборДрагМатериаловДляОбъекта(Элемент.ТекущиеДанные.КлючСтроки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Асинх Функция СогласиеПользователяНаОчисткуМатериалы()
	
	ТекстВопроса = НСтр("ru = 'Таблична часть ""Материалы"" будет очищена'");
	Результат = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	Если Результат <> КодВозвратаДиалога.ОК Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЦМО_ЛичногоПользованияСчет27(Форма)

	Счет27 = СчетУчета27(Форма);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,"ЦМООтправитель",
	"Видимость",
	ЗначениеЗаполнено(Форма.Объект.ЦМООтправитель) ИЛИ НЕ Счет27);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,"ДержательИмущества",
	"Видимость",
	Счет27 И НЕ ЗначениеЗаполнено(Форма.Объект.ЦМООтправитель));
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОчисткаРеквизитовПолучателяИмуществаСчет27(Форма)

	Счет27 = СчетУчета27(Форма);
	
	Если Счет27 Тогда
		Если ЗначениеЗаполнено(Форма.Объект.ЦМООтправитель) Тогда
			Форма.Объект.ЦМООтправитель = ПредопределенноеЗначение("Справочник.ЦМО.ПустаяСсылка");
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Форма.Объект.ПолучательИмущества) И НЕ Форма.Объект.ВыдатьВЛичноеПользование Тогда
			Форма.Объект.ПолучательИмущества = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиИзмененияНастройкиКФО

&НаКлиенте
Процедура ЗаполнитьКФОВТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	ЗаполнитьКФОВТабличнойЧастиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКФОВтабличнойЧастиСервер()
	УправлениеМатериальнымиЗапасами.ЗаполнитьЗначениеРеквизитаВТабличнойЧасти(
	Объект.Материалы,
	"КФО",
	Объект.КФО);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗначенияКФОВТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	УправлениеМатериальнымиЗапасамиКлиент.ЗаполнитьКФОШапкиПриИзмененииНастройкиИспользования(ЭтотОбъект, ЗначенияКФОВТабличнойЧасти());
КонецПроцедуры

&НаСервере
Функция ЗначенияКФОВТабличнойЧасти();
	Возврат УправлениеМатериальнымиЗапасами.МассивРазличныхЗначенийКФОВТабличнойЧасти(Объект.Материалы, "КФО");
КонецФункции

#КонецОбласти

&НаСервере
Процедура ВыдатьВЛичноеПользованиеПриИзмененииСервер()
	
	УправлениеМатериальнымиЗапасами.УстановитьВидДопСубконтоЛичногоПользования(
	ЭтотОбъект,
	Объект.ВыдатьВЛичноеПользование,
	ЭтотОбъект.КэшПараметров.Локальные.СчетУчетаИмуществаВПользовании,
	"МатериалыДополнительноеСубконтоСчета",
	"Материалы");

	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ПриИзмененииКлючевогоРеквизитаТиповойОперацииНаСервере();
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчета106(Форма)

	Возврат УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавен106(Форма);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СчетУчета0133(Форма)

	Возврат УправлениеМатериальнымиЗапасамиФормыКлиентСервер.СчетУчетаРавенЗначению(Форма, "Счет0133");

КонецФункции

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
