
#Область СлужебныйПрограммныйИнтерфейс

// Устарела. Следует использовать РегистрыУчета.ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Форма, ГруппаФормы = "") Экспорт
	
	РегистрыУчета.ПриСозданииНаСервере(Форма, ГруппаФормы);
		
КонецПроцедуры

Процедура ДополнитьСвойстваРегистраУчета(СвойстваРегистраУчета, Знач Отчет) Экспорт
	
	РегистрыУчета.ДополнитьСвойстваРегистраУчета(СвойстваРегистраУчета, Отчет);
	
КонецПроцедуры

Функция СохранитьРегистрУчета(СвойстваРегистраУчета, Знач Отчет, НастройкиВРегистр) Экспорт
	
	Возврат РегистрыУчета.СохранитьРегистрУчета(СвойстваРегистраУчета, Отчет, НастройкиВРегистр); 
	
КонецФункции

Функция СохранитьРегистрыУчета(СвойстваРегистровУчета, НастройкиВРегистр) Экспорт
	
	Возврат РегистрыУчета.СохранитьРегистрыУчета(СвойстваРегистровУчета, НастройкиВРегистр); 
	
КонецФункции

Функция ОбластьТабличногоДокументаПоИмени(ТабличныйДокумент, ИмяОбласти) Экспорт
	
	Документ = Новый ТабличныйДокумент;
	
	ЗаполнитьЗначенияСвойств(Документ, ТабличныйДокумент);
	
	Документ.Присоединить(ТабличныйДокумент.ПолучитьОбласть(ИмяОбласти));
	
	//Удаление горизонтального разделителя с конца табличного документа, если таковой имеется		
	ТекущаяОбласть = Документ.Область(Документ.ВысотаТаблицы,,Документ.ВысотаТаблицы,);
	ТекущаяОбласть.НачалоСтраницы = Ложь;
	ТекущаяОбласть.КонецСтраницы = Ложь;
	
	Возврат Документ;
	
КонецФункции

#КонецОбласти