
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	Данные = ЗаписьОбъект.Макет.Получить();
	
	Если ТипЗнч(Данные)<> Тип("Строка") Тогда 
		Данные = "";
	КонецЕсли;	

	ТекстовыйДокумент.УстановитьТекст(Данные);
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Макет = Новый ХранилищеЗначения(ТекстовыйДокумент.ПолучитьТекст());
	
КонецПроцедуры

