
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИтогСкидка = 0;
	УслугиИтогСкидка = 0;
	МатериалыИтогСкидка = 0;
	ОСИтогСкидка = 0;
	
	ФормаВладельца = ЭтаФорма.ВладелецФормы;
	ВсеСкидкиНаценки.Очистить();
	Для каждого ТекСтрока Из ФормаВладельца.ВсеСкидкиНаценки Цикл
		НоваяСтрока = ВсеСкидкиНаценки.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		Если ТекСтрока.НомерТабличнойЧасти = 1 Тогда
			УслугиИтогСкидка = УслугиИтогСкидка + ТекСтрока.Всего;
		ИначеЕсли ТекСтрока.НомерТабличнойЧасти = 2 Тогда
			МатериалыИтогСкидка = МатериалыИтогСкидка + ТекСтрока.Всего;
		ИначеЕсли ТекСтрока.НомерТабличнойЧасти = 3 Тогда
			ОСИтогСкидка = ОСИтогСкидка + ТекСтрока.Всего;
		КонецЕсли;
	КонецЦикла;
	ИтогСкидка = ИтогСкидка + УслугиИтогСкидка + МатериалыИтогСкидка + ОСИтогСкидка;
КонецПроцедуры

#КонецОбласти
