#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	ИсполняемыеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрПериод = ИсполняемыеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
	Если ПараметрПериод.Использование Тогда
		СвойстваРегистраУчета.НачалоПериода = ПараметрПериод.Значение.ДатаНачала;
		СвойстваРегистраУчета.КонецПериода = ПараметрПериод.Значение.ДатаОкончания;
	КонецЕсли;

	ПолеОрганизация = Новый ПолеКомпоновкиДанных("ОрганизацияОтбор");
	Для каждого ЭлементОтбора Из ИсполняемыеНастройки.Отбор.Элементы Цикл
	
		Если ЭлементОтбора.ЛевоеЗначение = ПолеОрганизация И ЭлементОтбора.Использование
			И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			
			СвойстваРегистраУчета.Организация = ЭлементОтбора.ПравоеЗначение;
			Прервать;
			
		КонецЕсли;
	
	КонецЦикла;
	ПолеПодразделение = Новый ПолеКомпоновкиДанных("Подразделение");
	Для каждого ЭлементОтбора Из ИсполняемыеНастройки.Отбор.Элементы Цикл
	
		Если ЭлементОтбора.ЛевоеЗначение = ПолеПодразделение И ЭлементОтбора.Использование
			И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			
			СвойстваРегистраУчета.ПодразделениеОрганизации = ЭлементОтбора.ПравоеЗначение;
			Прервать;
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "НакопительнаяВедомостьПоРасходуПродуктовПитания");
	НастройкиВарианта.Описание = НСтр("ru = '(устарел) Накопительная ведомость по расходу продуктов питания'");

	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "НакопительнаяВедомостьПоРасходуПродуктовПитания_103н");
	НастройкиВарианта.Описание = НСтр("ru = 'Накопительная ведомость по расходу продуктов питания в редакции приказа 103н'");

КонецПроцедуры

Функция СвойстваОбъектаДляРасшифровкиСтандартнымиОтчетами(ОтчетОбъект) Экспорт
	
	ТекущиеНастройки = ОтчетОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	ПериодОтчета = ТекущиеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение;
	
	СвойстваОбъекта = Новый Структура;
	
	МассивОтчетов = Новый Массив;
	МассивОтчетов.Добавить("ОборотноСальдоваяВедомостьПоСчету");
	МассивОтчетов.Добавить("КарточкаСчета");
	СвойстваОбъекта.Вставить("ОтчетыРасшифровки", МассивОтчетов);
	
	СписокВидовСубконто = Новый СписокЗначений;
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	СвойстваОбъекта.Вставить("СписокВидовСубконто", СписокВидовСубконто);
	
	МассивОсновныхДействий = Новый Массив;
	МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
	МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
	МассивОсновныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Сгруппировать);
	
	СвойстваОбъекта.Вставить("МассивОсновныхДействий", МассивОсновныхДействий);
	
	РазрешенныеОтборы = Новый Массив;
	РазрешенныеОтборы.Добавить("Организация");
	РазрешенныеОтборы.Добавить("Номенклатура");
	РазрешенныеОтборы.Добавить("ЦМО");
	РазрешенныеОтборы.Добавить("КФО");
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("105.00").УчетПоПодразделениям Тогда
		РазрешенныеОтборы.Добавить("Подразделение");
	КонецЕсли;
	РазрешенныеОтборы.Добавить("ИФО");
	
	СвойстваОбъекта.Вставить("МассивРазрешенныхОтборов", РазрешенныеОтборы);
	
	Возврат СвойстваОбъекта;
	
КонецФункции

#КонецОбласти

#КонецЕсли