
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.РеконструкцияОС") Тогда
		ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
		ОткрытьФорму("Документ.РешениеОПризнанииОбъектовОС.ФормаОбъекта", ПараметрыФормы);
	Иначе	
		ПараметрыФормы = Новый Структура("РежимВводНаОсновании, ДокументОснование, ВидСоздаваемогоДокумента", 
			Истина, ПараметрКоманды, ВидДокумента());
		ОткрытьФорму("Справочник.ОсновныеСредства.Форма.ГрупповойВвод", 
			ПараметрыФормы,, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВидДокумента()
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.РешениеОПризнанииОбъектовОС"));
КонецФункции	

#КонецОбласти