#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает типовую операцию с которой установлена связь у данной операции.
//
// Параметры:
//  ТиповаяОперация - СправочникСсылка.ТиповыеОперации - Типовая операция для которой 
//		получается ведущая типовая операция.
// 
// Возвращаемое значение:
// Неопределено, СправочникСсылка.ТиповыеОперации - типовая операция или Неопределено, если связи нет.
//
Функция ВедущаяТиповаяОперация(ТиповаяОперация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвязанныеТиповыеОперации.ВедущаяТиповаяОперация КАК ВедущаяТиповаяОперация
	|ИЗ
	|	РегистрСведений.СвязанныеТиповыеОперации КАК СвязанныеТиповыеОперации
	|ГДЕ
	|	СвязанныеТиповыеОперации.ТиповаяОперация = &ТиповаяОперация";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВедущаяТиповаяОперация;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

// Записывает связь типовых операций.
//
// Параметры:
//  ТиповаяОперация			 - СправочникСсылка.ТиповыеОперации - типовая операция
//			для которой устанавливается связь.
//  ВедущаяТиповаяОперация	 - СправочникСсылка.ТиповыеОперации - ведущая типовая операция,
//			с которой устанавливается связь.
//
Процедура ЗаписатьСвязьОпераций(ТиповаяОперация, ВедущаяТиповаяОперация) Экспорт
	
	НаборЗаписей = РегистрыСведений.СвязанныеТиповыеОперации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ТиповаяОперация.Установить(ТиповаяОперация);
	
	Если ЗначениеЗаполнено(ВедущаяТиповаяОперация) Тогда
		
		Запись = НаборЗаписей.Добавить();
		Запись.ТиповаяОперация        = ТиповаяОперация;
		Запись.ВедущаяТиповаяОперация = ВедущаяТиповаяОперация;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли