
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидОтчета = Параметры.ВидОтчета;
	ПравилоЗаполнения = Параметры.ПравилоЗаполнения;
	Событие = Параметры.Событие;
	
	Если Параметры.Свойство("РеквизитыДокумента") И ЗначениеЗаполнено(Параметры.РеквизитыДокумента) Тогда
		
		РеквизитыДокумента = Параметры.РеквизитыДокумента;
		
		Если ТипЗнч(РеквизитыДокумента) = Тип("Структура") Тогда
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ВидОтчета", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
				
				ВидОтчета = Значение;
				
			КонецЕсли;
			
			Значение = Неопределено;
			Если РеквизитыДокумента.Свойство("ПравилоЗаполнения", Значение) И ТипЗнч(Значение) = Тип("СправочникСсылка.ПравилаЗаполнения") Тогда
				
				ПравилоЗаполнения = Значение;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыМетода = Неопределено;
	
	Если Событие = "СохранениеПараметраОбработки" Тогда
		
		АдресПараметров = Параметры.АдресПараметров;
		Если НЕ ПустаяСтрока(АдресПараметров) Тогда
			
			ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(ПравилоЗаполнения, Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	// Заполнение значений параметров
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура") И ЗначениеЗаполнено(ПараметрыМетода) Тогда
		
		ЗначениеСвойства = Неопределено;
		Если ПараметрыМетода.Свойство("ГруппаРаскрытия", ЗначениеСвойства) Тогда
			ГруппаРаскрытия = ЗначениеСвойства;
			ЗаполнитьПоляГруппировки();
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если ПараметрыМетода.Свойство("ПоляПроверки", ЗначениеСвойства) Тогда
			
			Для Каждого ВыбранноеПоле Из ЗначениеСвойства Цикл
				ЭлементСписка = ПоляПроверки.НайтиПоЗначению(ВыбранноеПоле);
				Если НЕ ЭлементСписка = Неопределено Тогда
					ЭлементСписка.Пометка = Истина;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ГруппаРаскрытияПриИзменении(Элемент)
	
	ЗаполнитьПоляГруппировки();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = СохранитьПараметры();
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить параметры'"));
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция СохранитьПараметры()
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ГруппаРаскрытия", ГруппаРаскрытия);
		
		ВыбранныеПоля = Новый Массив;
		Для Каждого Поле Из ПоляПроверки Цикл
			Если Поле.Пометка Тогда
				ВыбранныеПоля.Добавить(Поле.Значение);
			КонецЕсли;	
		КонецЦикла;
		СтруктураПараметров.Вставить("ПоляПроверки", ВыбранныеПоля);
		
		ПредставлениеПараметров();
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураПараметров , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров()
	
	КодГруппы =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГруппаРаскрытия,"Код");
	
	ПредставлениеПараметров = КодГруппы +"(";
	
	СтрокаРазделитель = "";
	Для каждого ЭлементСписка Из ПоляПроверки Цикл
		
		Если ЭлементСписка.Пометка Тогда
			ПредставлениеПараметров = ПредставлениеПараметров + СтрокаРазделитель + ЭлементСписка.Значение;
			
			СтрокаРазделитель = ",";
		КонецЕсли;
		
	КонецЦикла;
	
	ПредставлениеПараметров = ПредставлениеПараметров + ")";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляГруппировки()
	
	ПоляПроверки.Очистить();
	
	КолонкиОтчета = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьКолонкиВидаОтчета(ВидОтчета, , ГруппаРаскрытия);
	
	Для каждого КолонкаПроверки Из КолонкиОтчета Цикл
		
		ПоляПроверки.Добавить(КолонкаПроверки.Код, КолонкаПроверки.Представление);
		
	КонецЦикла;
	
КонецПроцедуры


