#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаЗаписи" Тогда 
		СтандартнаяОбработка = Ложь;
		
		Если Параметры.Свойство("Ключ") И Не Параметры.Ключ.Пустой() Тогда 
			
			ТипМакета = ПолучитьТипМакетаПоКлючу(Параметры.Ключ);
			
		ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения ")
			И ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.ЗначенияЗаполнения,"Владелец"))
			И ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.ЗначенияЗаполнения,"ИмяМакета"))
			И ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.ЗначенияЗаполнения,"ТипМакета")) Тогда 	
				
			ТипМакета = Параметры.ЗначенияЗаполнения.ТипМакета;
			
		ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И Не Параметры.ЗначениеКопирования.Пустой() Тогда 
			
			ТипМакета = ПолучитьТипМакетаПоКлючу(Параметры.ЗначениеКопирования);
			
		Иначе 
			
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаСозданияНовогоМакета;
			Возврат;
			
		КонецЕсли;	
		
		Если ТипМакета = Перечисления.ТипыХранимыхМакетовНастройки.ТекстовыйДокумент Тогда 
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаРедактированияТекстовыйДокумент;
			
		ИначеЕсли ТипМакета = Перечисления.ТипыХранимыхМакетовНастройки.ТабличныйДокумент Тогда
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаРедактированияТабличныйДокумент;
			
		ИначеЕсли ТипМакета = Перечисления.ТипыХранимыхМакетовНастройки.ДвоичныеДанные Тогда
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаРедактированияДвоичныеДанные;
			
		ИначеЕсли ТипМакета = Перечисления.ТипыХранимыхМакетовНастройки.СхемаКомпоновкиДанныхОтчета Тогда
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаРедактированияСхемаКомпоновкиДанныхОтчета;
			
		ИначеЕсли ТипМакета = Перечисления.ТипыХранимыхМакетовНастройки.ТаблицаЗначений Тогда
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаРедактированияТаблицаЗначений;
			
		ИначеЕсли ТипМакета = Перечисления.ТипыХранимыхМакетовНастройки.КоллекцияЗначений Тогда
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаРедактированияКоллекцияЗначений;
			
		ИначеЕсли ТипМакета = Перечисления.ТипыХранимыхМакетовНастройки.ХранилищеЗначения Тогда
			ВыбраннаяФорма = Метаданные.РегистрыСведений.ХранимыеМакетыНастроекОтчетов.Формы.ФормаРедактированияХранилищеЗначения;
			
		Иначе 
			ВызватьИсключение НСтр("ru = 'Неизвестный тип макета.'");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьТипМакетаПоКлючу(Ключ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец",Ключ.Владелец);
	Запрос.УстановитьПараметр("ИмяМакета",Ключ.ИмяМакета);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХранимыеМакетыНастроекОтчетов.ТипМакета КАК ТипМакета
	|ИЗ
	|	РегистрСведений.ХранимыеМакетыНастроекОтчетов КАК ХранимыеМакетыНастроекОтчетов
	|ГДЕ
	|	ХранимыеМакетыНастроекОтчетов.Владелец = &Владелец
	|	И ХранимыеМакетыНастроекОтчетов.ИмяМакета = &ИмяМакета";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить()[0].ТипМакета;
	
КонецФункции	

#КонецЕсли