
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	ВестиУчетПрослеживаемыхТоваров = ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров");
	ЗаполнитьСписокВидовКонтроляПродукции();
	
	ОбъектКопирования = Параметры.ЗначениеКопирования;
	ИспользоватьПодключаемоеОборудование = Истина;
	
	Справочники.ОсновныеСредства.ЗаполнитьСписокКодовКонтуровИдентификацииОС(Элементы.КодКонтураИдентификацииСведенийОбОбъекте);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если ПустаяСтрока(Объект.НаименованиеПолное) И Не ПустаяСтрока(Объект.Наименование) Тогда
			Объект.НаименованиеПолное = Объект.Наименование;
		КонецЕсли;
		ВидимостьСубконтоСчетаУчетаЗатрат();
		
		Элементы.СчетВложений.Видимость		= Ложь;
		Элементы.СчетВПути.Видимость		= Ложь;
		Элементы.СчетНаХранении.Видимость	= Ложь;
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	ДополнительныеПараметры.Вставить("Объект", Объект);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	ИнвентарныйНомерСписокНомеров = "Показать список";
	ИнвентарныйНомерБезНомеров = "Без инвентарных номеров";
	
	ОбновитьДрагоценныеМатериалы();
	ОбновитьИнвентарныеНомера();
	ОбновитьКарточкиКапвложений();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.КонтактнаяИнформация   
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаАдрес");
	ДополнительныеПараметры.Вставить("ПоложениеЗаголовкаКИ", ПоложениеЗаголовкаЭлементаФормы.Лево);
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	ИсправитьОтображениеАдреса();
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	ПараметрыРазмещения					= ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники		= Новый ОписаниеТипов("СправочникСсылка.КарточкиКапвложений");
	ПараметрыРазмещения.КоманднаяПанель	= Элементы.КарточкиКапвложений.КоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп	= "КарточкиКапвложений";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	УстановитьВидимостьКоманд1СНоменклатура("ФормаГруппаСервиса1СНоменклатура");
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	ОтобразитьАдресОбъекта();
	УстановитьЗаголовокЗаводскогоНомера();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементов();
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
	
	ЗаполнитьСписокВидаОбременения();
	
	Элементы.КодПоОК01394.Видимость = ЗначениеЗаполнено(Объект.КодПоОК01394);
	Элементы.ГруппаПравообладаниеОбременение.Видимость = (Объект.ИзменениеПравообладанияОбременения.Количество() > 0);
	
	ОбновитьДанныеГруппыПодконтрольнаяПродукция(ЭтаФорма);
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, "СканерШтрихкода");
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	Если ИспользоватьПодключаемоеОборудование Тогда
		МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("СканерШтрихкода"));
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЕдиныйКаталогОписанийТоваровИУслуг") Тогда
		НоменклатураЕдиногоКаталога = ВыбранноеЗначение;
		ИзмененТипНоменклатуры = Ложь;
		ЗаполнитьПоДаннымСервиса1СНоменклатураНаСервере(НоменклатураЕдиногоКаталога, ИзмененТипНоменклатуры);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение)	= Тип("Массив") Тогда
		Если ВыбранноеЗначение.Количество() > 0 Тогда
			Если ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.ЕдиныйКаталогОписанийТоваровИУслуг") Тогда 
				
				СписокНоменклатурыЕдиногоКаталога = ВыбранноеЗначение;
				УстановитьСоответствиеНоменклатуреСервисаНаСервере(СписокНоменклатурыЕдиногоКаталога);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.ОсновныеСредства.Форма.РазблокированиеРеквизитов") Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтотОбъект, ВыбранноеЗначение);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Подсистема "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	Если ИмяСобытия = "ОбновитьДрагМатериалы" Или
		ИмяСобытия = "ДокументыПоУчетуМатериальныхЗапасовИзменение" Или
		ИмяСобытия = "ДокументыПоУчетуОСИзменение" Тогда
		ОповеститьОбИзменении(Тип("РегистрНакопленияКлючЗаписи.НаличиеДрагМатериаловВОбъектахНФА"));
		ОбновитьДрагоценныеМатериалы();
	ИначеЕсли ИмяСобытия = "ЭлементОсновныеСредстваЗаписан" 
		ИЛИ ИмяСобытия = "СведенияКадастровогоУчетаЗаписаны" Тогда
		Прочитать();
	КонецЕсли;
	
	// ПодключаемоеОборудование
	УправлениеОсновнымиСредствамиКлиент.СканированиеШтрихкода(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "Запись_ИнвентарныйНомер" И Параметр.ОсновноеСредство = Объект.Ссылка Тогда
		ПрочитатьДанныеКарточки();
		УстановитьДоступностьЭлементов();
		Если Параметр.Свойство("ИнвентарныйНомер") Тогда
			ОповеститьОбИзменении(Параметр["ИнвентарныйНомер"]);
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.УчетныйНомерОбъектаКапвложенийДоПоступления) Тогда
		ДлинаНомера = СтрДлина(СокрЛП(Объект.УчетныйНомерОбъектаКапвложенийДоПоступления));
		Если ДлинаНомера <> 30 Тогда   
			Отказ = Истина;
			Текст = СтрШаблон(
			НСтр("ru = 'Длина учетного номера объекта капвложений равна %1, а должна быть 30 знаков.'"), ДлинаНомера);
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			Текст,, "УчетныйНомерОбъектаКапвложенийДоПоступления", "Объект");
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЗаписьОсновныеСредства");
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
	
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьДрагоценныеМатериалы();
	ОбновитьИнвентарныеНомера();
	ОбновитьКарточкиКапвложений();
	
	ИнтеграцияСервиса1СНоменклатураБГУ.ЗаписатьПривязкуНоменклатурыЕдиногоКлассификатора(ТекущийОбъект.Ссылка, НоменклатураЕдиногоКаталога);
	
	ПрочитатьДанныеКарточки();
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	ОбъектКопирования = Справочники.ОсновныеСредства.ПустаяСсылка();
	
	ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище);
	УстановитьДоступностьИсторииПрослеживаемости(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ОсновныеСредства",, Объект.Ссылка);
	
	ОбновитьДанныеГруппыПодконтрольнаяПродукция(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтаФорма, Объект, Отказ);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНФАПриИзменении(Элемент)
	
	Если Объект.ВидНФА <> ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС")
		И Объект.ВидНФА <> ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА") Тогда
		Объект.ГрупповойУчет = Ложь;
		СпособУчетаОбъектовОС = 0; // Индивидуальный учет.
	КонецЕсли;
	
	ВидНФАПриИзмененииНаСервере();
	
	УстановитьПрослеживаемыйТовар();
	УстановитьДоступностьЭлементов();
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипНФАПриИзменении(Элемент)
	УстановитьПрослеживаемыйТовар();
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоКазныПриИзменении(Элемент)
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаИндивидуальныйПриИзменении(Элемент)
	
	СпособУчетаОбъектовОСПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаГрупповойПриИзменении(Элемент)
	
	СпособУчетаОбъектовОСПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУчетаОбъектовОСПриИзменении()
	
	Объект.ГрупповойУчет = ?(СпособУчетаОбъектовОС = 0, Ложь, Истина);
	
	УстановитьДоступностьИнвентарныхНомеров();
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКОФПриИзменении(Элемент)
	
	Объект.АмортизационнаяГруппа = ПредопределенноеЗначение("Перечисление.АмортизационныеГруппы.ПустаяСсылка");
	Если ЗначениеЗаполнено(Объект.КодОКОФ) Тогда
		УправлениеОсновнымиСредствамиКлиент.НачалоВыбораАмортизационнойГруппы(Элементы.АмортизационнаяГруппа, Неопределено, Ложь, Объект.КодОКОФ, Объект.АмортизационнаяГруппа, Ложь);
		Объект.УдалитьКодПоОКОФ = "";
	КонецЕсли;
	
	Элементы.КодПоОКОФ.Видимость = ЗначениеЗаполнено(Объект.УдалитьКодПоОКОФ) И НЕ ЗначениеЗаполнено(Объект.КодОКОФ);
	
КонецПроцедуры

&НаКлиенте
Процедура АмортизационнаяГруппаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеОсновнымиСредствамиКлиент.НачалоВыбораАмортизационнойГруппы(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.КодОКОФ, Объект.АмортизационнаяГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура АмортизационнаяГруппаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	УправлениеОсновнымиСредствамиКлиент.НачалоВыбораАмортизационнойГруппы(Элемент, Неопределено, СтандартнаяОбработка, Объект.КодОКОФ, Объект.АмортизационнаяГруппа);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСведенийНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДатыСведений", ЭтаФорма);
	ПоказатьВводДаты(Оповещение, ДатаСведений, "Введите дату сведений", ЧастиДаты.Дата); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыСведений(Дата, Параметры) Экспорт
	
	Если Дата <> Неопределено Тогда
		ДатаСведений = Дата;
		ДатаСведенийПриИзменении();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСведенийПриИзменении()
	
	ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ДатаСведений));
	ДрагоценныеМатериалы.Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ДатаСведений));
	
	ПрочитатьДанныеКарточки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентарныйНомерСписокНомеровНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Элементы.СтраницыВидыНФА.ТекущаяСтраница = Элементы.СтраницаИнвентарныеНомера;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияИнвентарногоОбъектаНажатие(Элемент, СтандартнаяОбработка)
	
	УправлениеОсновнымиСредствамиКлиент.ПриНажатииСведенияИнвентарногоОбъекта(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияИнвентарногоОбъектаОткрытьСписок(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьСписокСведенияИнвентарногоОбъекта(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтроляПродукцииПриИзменении(Элемент)
	
	Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПустаяСсылка");
	Объект.ПрослеживаемыйТовар = Ложь;
	
	Если ВидКонтроляПродукции = 7 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ФотоОборудование");
	ИначеЕсли ВидКонтроляПродукции = 6 Тогда
		Объект.ПрослеживаемыйТовар = Истина;
	КонецЕсли;
	
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
	
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
		ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
		ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура КарточкиКапвложенийПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КодПоКТРУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура(); 
	Если ЗначениеЗаполнено(Объект.КодПоКТРУ) Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", ЭлементКТРУ(Объект.КодПоКТРУ));
	КонецЕсли;
	ОткрытьФорму("Справочник.КТРУ.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КодПоКТРУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗНЧ(ВыбранноеЗначение) = Тип("СправочникСсылка.КТРУ") 
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ВыбранноеЗначение = ПолучитьКодКТРУ(ВыбранноеЗначение);
	КонецЕсли;	
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИнвентарныеНомера

&НаКлиенте
Процедура ИнвентарныеНомераПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	СоздатьНовыйИнвентарныйНомер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СведенияОНеотделимыхУлучшениях

&НаКлиенте
Процедура СведенияОНеотделимыхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = Новый Структура("Ключ", ВыбраннаяСтрока);                            
	ПараметрыФормы.Вставить("ИменаНедоступныхРеквизитов", "Организация, Договор, ОсновноеСредство");
	ОткрытьФорму("РегистрСведений.СведенияОНеотделимыхУлучшенияхОбъектовПравПользованияОС.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОНеотделимыхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ Копирование Тогда
	
		Отказ = Истина;
		ОшибкиЗаполнения = Ложь;
		
		Если Объект.Организация.Пустая() Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не заполнено поле ""%1"".'"), "Организация"); 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Объект.Организация", , ОшибкиЗаполнения);
			
		КонецЕсли;
		
		Если Договор.Пустая() Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не заполнено поле ""%1"".'"), "Договор"); 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "Договор", , ОшибкиЗаполнения);
			
		КонецЕсли; 
			
		Если НЕ ОшибкиЗаполнения Тогда
			
			ОткрытьФормуВводаСведенийОНеотделимыхУлучшениях();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВводаСведенийОНеотделимыхУлучшениях()
	
	ЗначенияЗаполнения = Новый Структура("Организация, Договор, ОсновноеСредство");
	ЗначенияЗаполнения.Организация = Объект.Организация;
	ЗначенияЗаполнения.Договор = Договор;
	ЗначенияЗаполнения.ОсновноеСредство = Объект.Ссылка;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ИменаНедоступныхРеквизитов", "Организация, Договор, ОсновноеСредство");
	
	ОткрытьФорму("РегистрСведений.СведенияОНеотделимыхУлучшенияхОбъектовПравПользованияОС.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОтчетОДвиженииДрагМатериалов(Команда)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Объект.Организация);
	ПараметрыОтчета.Вставить("ОбъектНФА", Объект.Ссылка);
	ПараметрыОтчета.Вставить("НачалоПериода", '00010101000000');
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ТекущаяДата()));
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	ПараметрыВыполненияКоманды.Вставить("Уникальность", ЭтаФорма.КлючУникальности);
	
	СформироватьОтчетОДвиженииДрагМатериалов(ПараметрыОтчета, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияАмортизации(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Организация"		, Объект.Организация);
	СтруктураОтбора.Вставить("ОсновноеСредство"	, Объект.Ссылка);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор"								, СтруктураОтбора);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии"			, Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов"	, Ложь);
	ПараметрыФормы.Вставить("КлючВарианта"						, "КарточкаОС");
	
	ОткрытьФорму("Отчет.ИсторияАмортизации.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор, Окно);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИнвентарныйНомер(Команда)
	
	СоздатьНовыйИнвентарныйНомер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПОПеренести(Команда)
	
	ПараметрыФормы = Новый Структура("Организация,ОсновноеСредство,ЗаполнитьПриОткрытии",
		Объект.Организация, Объект.Ссылка, Истина);
	ОткрытьФорму("Обработка.ПомощникКорректировкиУчетаОС.Форма.ФормаПравообладаниеОбременение", ПараметрыФормы);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если СтрНайти(Команда.Имя, "КарточкиКапвложений") > 0 Тогда
		Источник = Элементы.КарточкиКапвложений;
		Если Источник.ВыделенныеСтроки.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Источник = Объект;
	КонецЕсли;
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Источник);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗаблокированныеРеквизиты = ЗапретРедактированияРеквизитовОбъектовКлиент.Реквизиты(ЭтаФорма);
	
	Если ЗаблокированныеРеквизиты.Количество() > 0 Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ссылка",					Объект.Ссылка);
		ПараметрыФормы.Вставить("ЗаблокированныеРеквизиты", ЗаблокированныеРеквизиты);
		
		ОткрытьФорму("Справочник.ОсновныеСредства.Форма.РазблокированиеРеквизитов", ПараметрыФормы, ЭтаФорма);
		
	Иначе
		
		ЗапретРедактированияРеквизитовОбъектовКлиент.ПоказатьПредупреждениеВсеВидимыеРеквизитыРазблокированы();
		
	КонецЕсли;
	
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура НастроитьЗаполнениеОтчетовПоДрагМатериалам(Команда)
	Отбор = Новый Структура("ОбъектНФА", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор, Истина, Истина);
	ОткрытьФорму("РегистрСведений.НастройкиЗаполненияОтчетовСтатистикиПоДрагМатериалам.ФормаСписка", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеОДрагМатериалахПоТехническойДокументации(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура;
		Если ЗначениеЗаполнено(ДанныеОДрагМатериалахПоТехДокументации) Тогда
			ПараметрыФормы.Вставить("Ключ", ДанныеОДрагМатериалахПоТехДокументации);
		Иначе
			ПараметрыФормы.Вставить("ОбъектНФА", Объект.Ссылка);
		КонецЕсли;	
		ОткрытьФорму("Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПрослеживаемости(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", АдресИсторииПрослеживаемостиХранилище);
	ПараметрыФормы.Вставить("НФА", Объект.Ссылка);
	ПараметрыФормы.Вставить("Наименование", Объект.Наименование);
	
	ОписаниеОповещения_Изменение = Новый ОписаниеОповещения("ИсторияПрослеживаемости_Изменение", ЭтотОбъект);

	ОткрытьФорму("ОбщаяФорма.ИсторияПрослеживаемостиНФА",
	ПараметрыФормы,
	ЭтотОбъект,
	,,,
	ОписаниеОповещения_Изменение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчетОДвиженииДрагМатериаловВКапвложениях(Команда)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация", Объект.Организация);
	ПараметрыОтчета.Вставить("Капвложение", Объект.Ссылка);
	ПараметрыОтчета.Вставить("НачалоПериода", '00010101000000');
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ТекущаяДата()));
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтаФорма);
	ПараметрыВыполненияКоманды.Вставить("Уникальность", ЭтаФорма.КлючУникальности);
	
	СформироватьОтчетОДвиженииДрагМатериалов(ПараметрыОтчета, ПараметрыВыполненияКоманды);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ДатаСведений = ОбщегоНазначенияБГУ.РабочаяДатаПользователя();
	
	СпособУчетаОбъектовОС = ?(Объект.ГрупповойУчет, 1, 0);
	ПрочитатьДанныеКарточки();
	ЗаполнитьСписокВыбораТипНФА();
	
	ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПрослеживаемыйТовар()

	Если ВестиУчетПрослеживаемыхТоваров
		И НЕ УправлениеОсновнымиСредствамиКлиентСервер.ПрослеживаемыйВидНФА(Объект.ВидНФА) Тогда
		Объект.ПрослеживаемыйТовар = Ложь;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ВидимостьСубконтоСчетаУчетаЗатрат()
	
	МассивПолей = Новый Массив;
	
	Для Сч = 1 По 3 Цикл
		БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
			"Субконто" + Сч, "Субконто" + Сч, "Субконто" + Сч, Истина, "Субконто" + Сч, Ложь, Ложь, Истина);
	КонецЦикла;
	
	БухгалтерскийУчетКлиентСервер.ДобавитьПолеДляУстановкиЗаголовковСубконто(МассивПолей, 
		"Подразделение", "ПодразделениеЗатрат", "ПодразделениеЗатрат", Ложь, "ПодразделениеЗатрат", Ложь, Ложь);
	
	БухгалтерскийУчетКлиентСервер.УстановитьЗаголовкиИДоступностьСубконто(СчетУчетаЗатрат, ЭтаФорма,, МассивПолей);
	
	Элементы.ПодразделениеЗатрат.Видимость	= ЗначениеЗаполнено(ПодразделениеЗатрат);
	Элементы.Субконто1.Видимость			= ЗначениеЗаполнено(Субконто1);
	Элементы.Субконто2.Видимость			= ЗначениеЗаполнено(Субконто2);
	Элементы.Субконто3.Видимость			= ЗначениеЗаполнено(Субконто3);
	Элементы.СубконтоНУ.Видимость			= ЗначениеЗаполнено(СубконтоНУ);
	
КонецПроцедуры

&НаСервере
Процедура ИсправитьОтображениеАдреса()
	
	Для Каждого ИнфоКонтакт Из ЭтаФорма["КонтактнаяИнформацияОписаниеДополнительныхРеквизитов"] Цикл
		ЭлементФормы = Элементы.Найти(ИнфоКонтакт.ИмяРеквизита);
		Если ЭлементФормы <> Неопределено Тогда
			ЭлементФормы.Ширина = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура обновляет таблицу инвентарных номеров ОС
//
&НаСервере
Процедура ОбновитьИнвентарныеНомера()
	
	ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("Период"			, КонецДня(ДатаСведений));
	ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("Организация"		, Объект.Организация);
	ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("ОсновноеСредство"	, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеКарточки()
	
	Если Объект.ВидНФА = Перечисления.ВидыНФА.ОС
		Или Объект.ВидНФА = Перечисления.ВидыНФА.НМА
		Или Объект.ВидНФА = Перечисления.ВидыНФА.НПА Тогда
		ПрочитатьДанныеОС();
	ИначеЕсли Объект.ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
		ПрочитатьДаннныеКапВложения();
	ИначеЕсли Объект.ВидНФА = Перечисления.ВидыНФА.ПраваПользованияИмуществом Тогда
		ПрочитатьДанныеПраваПользования()
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеОС()
	
	// Учетные данные
	
	ДанныеОбъектаОС = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(Объект.Ссылка, КонецДня(ДатаСведений));
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеОбъектаОС,
		"СчетУчета,КФО,КПС,СчетВложений,СчетВПути,СчетНаХранении,ВидУчета,ВидИмущества");
	КЭКСчетаУчета = ?(ЗначениеЗаполнено(ДанныеОбъектаОС.КЭК), ДанныеОбъектаОС.КЭК,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъектаОС.СчетУчета, "КОСГУДт"));
	
	ВидимостьСчетаУчета = ЗначениеЗаполнено(СчетУчета) Или
		Не ЗначениеЗаполнено(СчетВложений)
		И Не ЗначениеЗаполнено(СчетВПути)
		И Не ЗначениеЗаполнено(СчетНаХранении);
	
	Элементы.ГруппаСчетУчета.Видимость = Объект.ВидНФА <> Перечисления.ВидыНФА.КапВложения И ВидимостьСчетаУчета;
	Элементы.СчетВложений.Видимость    = ЗначениеЗаполнено(СчетВложений);
	Элементы.СчетВПути.Видимость       = ЗначениеЗаполнено(СчетВПути) И НЕ ЗначениеЗаполнено(СчетУчета);
	Элементы.СчетНаХранении.Видимость  = ЗначениеЗаполнено(СчетНаХранении);
	
	// Параметры амортизации
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("КПС", КПС);
	Запрос.УстановитьПараметр("Период", КонецДня(ДатаСведений));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ ВТ_ИнвНомера
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)) КАК СобытияОССрезПоследних
	|ГДЕ
	|	СобытияОССрезПоследних.ДатаСобытия <> ДАТАВРЕМЯ(1,1,1,0,0,0)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ИнвентарныеНомераОС.Ссылка
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	ИнвентарныеНомераОС.ОС = &ОсновноеСредство
	|	И НЕ ИнвентарныеНомераОС.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИнвентарныеНомераОС.Ссылка КАК ИнвентарныйНомер,
	|	ИнвентарныеНомераОС.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ИнвентарныеНомераОС.РеестровыйНомер КАК РеестровыйНомер,
	|	ИнвентарныеНомераОС.ИнойНомер КАК ИнойНомер,
	|	ИнвентарныеНомераОС.НомерПаспорта КАК НомерПаспорта,
	|	ИнвентарныеНомераОС.ДатаВыпуска КАК ДатаВыпуска
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	ИнвентарныеНомераОС.Ссылка В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ВТ_ИнвНомера.ИнвентарныйНомер КАК ИнвентарныйНомер
	|			ИЗ
	|				ВТ_ИнвНомера КАК ВТ_ИнвНомера)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АмортизацияОС.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	АмортизацияОС.КЭК КАК КЭК,
	|	АмортизацияОС.Субконто1 КАК Субконто1,
	|	АмортизацияОС.Субконто2 КАК Субконто2,
	|	АмортизацияОС.Субконто3 КАК Субконто3,
	|	ВЫБОР
	|		КОГДА АмортизацияОС.СчетУчетаЗатрат.УчетПоПодразделениям
	|			ТОГДА АмортизацияОС.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеЗатрат,
	|	ВЫБОР
	|		КОГДА АмортизацияОС.КПС = ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)
	|			ТОГДА &КПС
	|		ИНАЧЕ АмортизацияОС.КПС.Код
	|	КОНЕЦ КАК КПСЗатрат,
	|	АмортизацияОС.СубконтоНУ КАК СубконтоНУ
	|ИЗ
	|	РегистрСведений.АмортизацияОС.СрезПоследних(&Период, ОсновноеСредство = &ОсновноеСредство) КАК АмортизацияОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОС.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизацииОС.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&Период, ОсновноеСредство = &ОсновноеСредство) КАК ПараметрыАмортизацииОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетАмортизацииОС.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(&Период, ОсновноеСредство = &ОсновноеСредство) КАК РасчетАмортизацииОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераИнвентарныхКарточек.Организация КАК Организация,
	|	НомераИнвентарныхКарточек.ОсновноеСредство КАК ОсновноеСредство,
	|	НомераИнвентарныхКарточек.НомерИнвентарнойКарточки КАК НомерИнвентарнойКарточки,
	|	НомераИнвентарныхКарточек.ДатаИнвентарнойКарточки КАК ДатаИнвентарнойКарточки
	|ИЗ
	|	РегистрСведений.НомераИнвентарныхКарточек.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК НомераИнвентарныхКарточек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних.ПорядокВключенияСтоимостиВСоставРасходов КАК ПорядокВключенияСтоимостиВСоставРасходов
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОСНалоговыйУчетСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизацииОСНалоговыйУчетСрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользованияНУ
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК ПараметрыАмортизацииОСНалоговыйУчетСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПервоначальныеСведенияОСНалоговыйУчетУСНСрезПоследних.СрокПолезногоИспользованияУСН
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчетУСН.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК ПервоначальныеСведенияОСНалоговыйУчетУСНСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпециальныйКоэффициентАмортизации.СпециальныйКоэффициент КАК СпециальныйКоэффициентНУ
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК СпециальныйКоэффициентАмортизации";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	Выборка.Следующий();
	КоличествоИнвНомеров = Выборка.Количество;
	
	Для Сч = 1 По 8 Цикл
		Выборка = Результат[Сч].Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЦикла;
	
	Элементы.СпособНачисленияАмортизации.Видимость = ЗначениеЗаполнено(СпособНачисленияАмортизации);
	
	ВидимостьСубконтоСчетаУчетаЗатрат();
	
	РасшифровкаСрокаПолезногоИспользования =
		УправлениеОсновнымиСредствамиКлиентСервер.РасшифровкаСрокаПолезногоИспользования(СрокПолезногоИспользования);
		
	Если КоличествоИнвНомеров = 1 Тогда
		Справочники.ИнвентарныеНомераОС.ПрочитатьДанныеОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДаннныеКапВложения()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"			, Объект.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("Период"				, КонецДня(ДатаСведений));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК УчетныеДанныеОбъектаОССрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СчетВложений = Выборка.СчетУчета;
	Иначе
		СчетВложений = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	
	Справочники.ИнвентарныеНомераОС.ПрочитатьДанныеОбъекта(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеПраваПользования()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"			, Объект.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство"	, Объект.Ссылка);
	Запрос.УстановитьПараметр("Период"				, КонецДня(ДатаСведений));
	Запрос.УстановитьПараметр("Счет"				, БухгалтерскийУчет.СписокСчетов("111.40"));
	Запрос.УстановитьПараметр("СчетАмортизации"		, БухгалтерскийУчет.СписокСчетов("104.40"));
	Запрос.УстановитьПараметр("СчетОбесценения"		, БухгалтерскийУчет.СписокСчетов("114.40"));
	Запрос.УстановитьПараметр("Субконто"			, БухгалтерскийУчет.СписокСубконто("ОсновныеСредства,Договоры,ЦМО"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Справочник.Договоры) КАК Договор,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто2.Контрагент КАК Справочник.Контрагенты) КАК Правообладатель,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто3 КАК Справочник.ЦМО) КАК ЦМО,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК СчетУчета,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт КАК БалансоваяСтоимость
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счет),
	|			&Субконто,
	|			Организация = &Организация
	|				И Субконто1 = &ОсновноеСредство) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт КАК Амортизация
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СчетАмортизации),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &ОсновноеСредство) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт КАК Обесценение
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&СчетОбесценения),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &ОсновноеСредство) КАК ЖурналПроводокЕПСБУОстатки";
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[0].Выбрать();
	Если Выборка.Следующий() Тогда
		Договор = Выборка.Договор;
		Правообладатель = Выборка.Правообладатель;
		ЦМО = Выборка.ЦМО;
		СчетУчетаОбъектаПравПользованияОС = Выборка.СчетУчета;
		БалансоваяСтоимостьОбъектаПравПользованияОС = Выборка.БалансоваяСтоимость;
	Иначе
		Договор = Справочники.Договоры.ПустаяСсылка();
		Правообладатель = Справочники.Договоры.ПустаяСсылка();
		ЦМО = Справочники.ЦМО.ПустаяСсылка();
		СчетУчетаОбъектаПравПользованияОС = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
		БалансоваяСтоимостьОбъектаПравПользованияОС = 0;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЦМО) Тогда
		МестоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЦМО, "МестоХранения");
		АдресМестаХранения = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(МестоХранения,
			Справочники.ВидыКонтактнойИнформации.АдресМестаХранения);
	Иначе
		АдресМестаХранения = "";
	КонецЕсли;
	
	Выборка = Результат[1].Выбрать();
	Если Выборка.Следующий() Тогда
		АмортизацияОбъектаПравПользованияОС = Выборка.Амортизация;
	Иначе
		АмортизацияОбъектаПравПользованияОС = 0;
	КонецЕсли;
	
	Выборка = Результат[2].Выбрать();
	Если Выборка.Следующий() Тогда
		ОбесценениеОбъектаПравПользованияОС = Выборка.Обесценение;
	Иначе
		ОбесценениеОбъектаПравПользованияОС = 0;
	КонецЕсли;
	
	СведенияОНеотделимыхУлучшениях.Параметры.УстановитьЗначениеПараметра("Договор", Договор);
	СведенияОНеотделимыхУлучшениях.Параметры.УстановитьЗначениеПараметра("Организация", Объект.Организация);
	СведенияОНеотделимыхУлучшениях.Параметры.УстановитьЗначениеПараметра("ОсновноеСредство", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораТипНФА()
	
	Элементы.ТипНФА.СписокВыбора.Очистить();
	
	Если Объект.ВидНФА = Перечисления.ВидыНФА.ОС Тогда
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.ЖилыеПомещения);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.НежилыеПомещения);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Сооружения);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Оборудование);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Транспорт);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Инвентарь);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Биоресурсы);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.БиблиотечныйФонд);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.ИнвестиционнаяНедвижимость);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Прочие);
	ИначеЕсли Объект.ВидНФА = Перечисления.ВидыНФА.ПраваПользованияИмуществом Тогда
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.ЖилыеПомещения);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.НежилыеПомещения);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Сооружения);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Оборудование);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Транспорт);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Инвентарь);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Биоресурсы);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.Прочие);
		Элементы.ТипНФА.СписокВыбора.Добавить(Перечисления.ТипыНФА.НепроизведенныеАктивы);
	КонецЕсли;
	
КонецПроцедуры

// управление доступностью реквизитов

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	ЭтоОС				= (Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС"));
	ЭтоНМА				= (Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА"));
	ЭтоКапВложение		= (Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения"));
	ЭтоПравоПользования	= (Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.ПраваПользованияИмуществом"));
	
	УчитыватьМЦСДрагМатериаламиВКапвложениях = ЭтоКапВложение И ПолучитьКонстантуВестиУчетДрагМатериаловВМЦКапвложений();
	ЭтоОСНМАНПА = Не ЭтоКапВложение И Не ЭтоПравоПользования;
	
	Элементы.СтраницаОсновныеСведения.Видимость	   = ЭтоОСНМАНПА;
	Элементы.СтраницаДрагМатериалы.Видимость	   = ЭтоОСНМАНПА ИЛИ УчитыватьМЦСДрагМатериаламиВКапвложениях;
	Элементы.СтраницаПравообладания.Видимость	   = ЭтоОСНМАНПА;
	Элементы.СтраницаКарточекКапвложений.Видимость = НЕ ЭтоПравоПользования;
	
	Элементы.СтраницаКапВложение.Видимость = ЭтоКапВложение;
	Элементы.СтраницаПравоПользования.Видимость = ЭтоПравоПользования;
	Элементы.СтраницаНеотделимыеУлучшения.Видимость = ЭтоПравоПользования;
	
	Элементы.ТипНФА.Видимость = ЭтоОС Или ЭтоПравоПользования;
	
	Если ЭтоОСНМАНПА Тогда
		
		Элементы.ГруппаИндивидуальныйГрупповойУчет.ТолькоПросмотр = Не ЭтоОС И Не ЭтоНМА;
		Элементы.АмортизационнаяГруппа.Доступность = ЭтоОС Или ЭтоНМА;
		Элементы.ГруппаАмортизация.Видимость = ЗначениеЗаполнено(СчетУчетаЗатрат);
		
		Элементы.СтраницаДрагМатериалы.Доступность = ЭтоОС;
		
	КонецЕсли;
	
	Если ЭтоОСНМАНПА ИЛИ УчитыватьМЦСДрагМатериаламиВКапвложениях Тогда 
		
		Элементы.СтраницаДрагМатериалы.Доступность = ЭтоОС ИЛИ ЭтоКапВложение;
		
	КонецЕсли;
	
	Элементы.НаличиеДрагМатериаловОбъектНФА.Видимость = ЭтоКапВложение;  
	Элементы.НаличиеДрагМатериаловГруппаКоличествоМЦ.Видимость = ЭтоКапВложение; 
	Элементы.НаличиеДрагМатериаловИнвНомер.Видимость = НЕ ЭтоКапВложение;
	Элементы.КомандаОтчетОДвиженииДрагМатериалов.Видимость = НЕ ЭтоКапВложение;
	Элементы.КомандаОтчетОДвиженииДрагМатериаловВКапвложениях.Видимость = ЭтоКапВложение;
	Элементы.ОткрытьДанныеОДрагМатериалахПоТехДокументации.Видимость = НЕ УчитыватьМЦСДрагМатериаламиВКапвложениях; 
	
	УстановитьДоступностьИнвентарныхНомеров(ЭтоОСНМАНПА);
	
	Элементы.КодПоОКОФ.Видимость = ЗначениеЗаполнено(Объект.УдалитьКодПоОКОФ) И Не ЗначениеЗаполнено(Объект.КодОКОФ);
	
	Элементы.ГруппаНалоговыйУчет.Видимость = (КФО = ПредопределенноеЗначение("Перечисление.КВД.Внебюджет"));
	
	УстановитьДоступностьИсторииПрослеживаемости(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовПрослеживаемости(Форма)

	ДоступнаПрослеживаемость = УправлениеОсновнымиСредствамиКлиентСервер.ДоступнаПрослеживаемость(Форма.Объект);
	
	ИменаЭлементовПрослеживаемость = Новый Массив;
	ИменаЭлементовПрослеживаемость.Добавить("ПрослеживаемыйТовар");
	ИменаЭлементовПрослеживаемость.Добавить("ПрослеживаемыйТовар1");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементовПрослеживаемость,
		"Видимость", ДоступнаПрослеживаемость);
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("КодТНВЭД");
	ИменаЭлементов.Добавить("КодТНВЭД1");
	ИменаЭлементов.Добавить("СтранаПроисхождения");
	//ИменаЭлементов.Добавить("СтранаПроисхождения1");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Видимость", ДоступнаПрослеживаемость И Форма.Объект.ПрослеживаемыйТовар); 
		
	ИменаЭлементовИстория = Новый Массив;
	ИменаЭлементовИстория.Добавить("ИсторияПрослеживаемости");
	ИменаЭлементовИстория.Добавить("ИсторияПрослеживаемости1");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементовИстория,
		"Видимость", ДоступнаПрослеживаемость);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьИнвентарныхНомеров(ЭтоОСНМАНПА = Истина)
	
	Элементы.ИнвентарныйНомер.Видимость					= Не Объект.ГрупповойУчет;
	Элементы.ИнвентарныйНомерСписокНомеров.Видимость	= Объект.ГрупповойУчет И (КоличествоИнвНомеров > 0);
	Элементы.ИнвентарныйНомерБезНомеров.Видимость		= Объект.ГрупповойУчет И (КоличествоИнвНомеров = 0);
	
	Элементы.СтраницаИнвентарныйНомер.Видимость			= ЭтоОСНМАНПА И Не Объект.ГрупповойУчет;
	Элементы.СтраницаИнвентарныеНомера.Видимость		= ЭтоОСНМАНПА И Объект.ГрупповойУчет;
	
	Элементы.СоздатьИнвентарныйНомер.Видимость			= (КоличествоИнвНомеров = 0);
	Элементы.ГруппаДанныеИнвНомера.Видимость			= (КоличествоИнвНомеров > 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВидаОбременения()
	
	СписокВыбора = Элементы.ИзменениеПравообладанияОбремененияВидПраваОбременения.СписокВыбора;
	
	СписокВыбора.Добавить("Аренда");
	СписокВыбора.Добавить("Арест");
	СписокВыбора.Добавить("Безвозмездное пользование");
	СписокВыбора.Добавить("Безвозмездное срочное пользование земельными участками");
	СписокВыбора.Добавить("Доверительное управление");
	СписокВыбора.Добавить("Договор хранения");
	СписокВыбора.Добавить("Залог");
	СписокВыбора.Добавить("Защитные сооружения");
	СписокВыбора.Добавить("Инвестиционный договор");
	СписокВыбора.Добавить("Иные виды ограничения (обременения) прав, предусмотренных законодательством Российской Федерации");
	СписокВыбора.Добавить("Ипотека");
	СписокВыбора.Добавить("Найм жилого помещения");
	СписокВыбора.Добавить("Объект культурного наследия");
	СписокВыбора.Добавить("Оперативное управление");
	СписокВыбора.Добавить("Постоянное бессрочное пользование");
	СписокВыбора.Добавить("Сервитут");
	СписокВыбора.Добавить("Сервитут публичный");
	СписокВыбора.Добавить("Сервитут частный");
	СписокВыбора.Добавить("Собственность");
	
КонецПроцедуры

// Прочее

&НаКлиенте
Процедура УстановитьЗначениеШтрихкода(ТекКод) Экспорт
	
	НовыйЗначенияЗаполнения = Новый Структура;
	НовыйЗначенияЗаполнения.Вставить("Объект"			, Объект.Ссылка);
	НовыйЗначенияЗаполнения.Вставить("ИнвентарныйНомер"	, ИнвентарныйНомер);
	НовыйЗначенияЗаполнения.Вставить("Штрихкод"			, ТекКод);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", НовыйЗначенияЗаполнения);
	ОткрытьФорму("РегистрСведений.Штрихкоды.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйИнвентарныйНомер()
	
	ЗначенияЗаполнения	= Новый Структура("Владелец,ОС", Объект.Организация, Объект.Ссылка);
	ДопПараметры		= Новый Структура("Дата", ДатаСведений);
	ПараметрыФормы		= Новый Структура("ЗначенияЗаполнения,ДополнительныеПараметры", ЗначенияЗаполнения, ДопПараметры);
	
	ОткрытьФорму("Справочник.ИнвентарныеНомераОС.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭлементКТРУ(КодКТРУ)
	Возврат Справочники.КТРУ.НайтиПоКоду(КодКТРУ);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКодКТРУ(СсылкаКТРУ)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаКТРУ, "Код");
КонецФункции

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма,	РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры
&НаКлиенте

Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

#Область УчетДрагМатериалов

&НаСервере
Процедура ОбновитьДрагоценныеМатериалы()
	
	МассивСчетовМЗ = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗ();
	МассивСчетовМЗ = УчетДрагМатериалов.ДополнитьМассивСчетовДМДляМЦ(Объект.Организация, МассивСчетовМЗ, "Номенклатура");
	МассивСчетовМЗИК = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляМЗИК(); 
	
	ДрагоценныеМатериалы.Параметры.УстановитьЗначениеПараметра("Период"				, КонецДня(ДатаСведений));
	ДрагоценныеМатериалы.Параметры.УстановитьЗначениеПараметра("Организация"		, Объект.Организация);
	ДрагоценныеМатериалы.Параметры.УстановитьЗначениеПараметра("ОсновноеСредство"	, Объект.Ссылка);
	ДрагоценныеМатериалы.Параметры.УстановитьЗначениеПараметра("МассивСчетовМЗ"	, МассивСчетовМЗ);
	ДрагоценныеМатериалы.Параметры.УстановитьЗначениеПараметра("МассивСчетовМЗИК"	, МассивСчетовМЗИК);
	
	ЭтаФорма.ТипыНоменклатурыОтчетовДрагМатериалов.Загрузить(УчетДрагМатериалов.СписокНастроекОтчетовДрагМатериаловОбъектаОС(Объект.Организация, Объект.Ссылка, ТекущаяДата()));

	ДанныеОДрагМатериалахПоТехДокументации = УчетДрагМатериалов.ДанныеОДрагМатериалахПоПаспортуДляОбъектаНФА(Объект.Ссылка);
	
	СводноПоТехПаспорту = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОДрагМатериалахПоТехДокументации, "Наименование");

	Если ЗначениеЗаполнено(СводноПоТехПаспорту) Тогда
		ШаблонСтрокиОбщий = НСтр("ru = 'по документации: %1'");
		СведенияОДрагМатериалахВОбъектеНФАПоТехДокументации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиОбщий, 
			СводноПоТехПаспорту);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетОДвиженииДрагМатериалов(ПараметрыОтчета, ПараметрыВыполненияКоманды)
	
	ЭтоКапвложение = (Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения"));	
		
	ВыбранныйОтчет = "Отчет.ОтчетОДвиженииДрагМатериалов.Форма";	
	Если ЭтоКапвложение Тогда 
        ВыбранныйОтчет = "Отчет.ОтчетОДвиженииМЦКапвложенийСДрагМатериалами.Форма";

		ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии, КлючВарианта",
		ПараметрыОтчета, "ОтчетПоДрагоценнымМатериаламКапвложения", Истина, "ОтчетПоДрагоценнымМатериаламКапвложения"); 
	
	Иначе		
		ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии, КлючВарианта",
			ПараметрыОтчета, "ОтчетПоДрагоценнымМатериаламОС", Истина, "ОтчетПоДрагоценнымМатериаламОС");
	КонецЕсли;	
	
	ОткрытьФорму(ВыбранныйОтчет, ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонстантуВестиУчетДрагМатериаловВМЦКапвложений()
	Возврат УчетДрагМатериалов.ПолучитьКонстантуВестиУчетДрагМатериаловВМЦКапвложений();
КонецФункции

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#Область КлассификацияТоваровИУслуг

&НаКлиенте
Процедура ЗаполнитьПоДаннымСервиса1СНоменклатура(Команда)
	
	Отбор = Новый Структура("ТипНоменклатурыКаталога", ПредопределенноеЗначение("Перечисление.ТипыНоменклатурыЕдиногоКаталогаТоваровИУслуг.НоменклатураСервиса"));
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, РежимВыбора, ЗакрыватьПриВыборе, МножественныйВыбор, ТекущаяСтрока",
		Отбор, Истина, Истина, Истина, Ложь, НоменклатураЕдиногоКаталога);
	ОткрытьФорму("Справочник.ЕдиныйКаталогОписанийТоваровИУслуг.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымСервиса1СНоменклатураНаСервере(Знач НоменклатураИсточникДанных, ИзмененТипНоменклатуры)
	
	НоменклатураКаталога = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураИсточникДанных, "НоменклатураКаталога");
	СведенияНоменклатураКаталога = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураКаталога,
		"Наименование, СтавкаНДС, ЕдиницаИзмерения, КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения,
		|КатегорияНоменклатуры, НаименованиеДляПечати, КодТипаНоменклатуры, Артикул, Описание");
	
	ЗаполнитьЗначениясвойств(Объект, СведенияНоменклатураКаталога);
	Объект.НаименованиеПолное = СведенияНоменклатураКаталога.Наименование;
	Объект.Сведения = СведенияНоменклатураКаталога.Описание;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствиеНоменклатуреСервиса(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Установить соответствие возможно только после записи элемента справочника.'"));
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ТипНоменклатурыКаталога", ПредопределенноеЗначение("Перечисление.ТипыНоменклатурыЕдиногоКаталогаТоваровИУслуг.НоменклатураСервиса"));
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, РежимВыбора, ЗакрыватьПриВыборе, МножественныйВыбор",
		Отбор, Истина, Истина, Истина, Истина);
	ОткрытьФорму("Справочник.ЕдиныйКаталогОписанийТоваровИУслуг.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоответствиеНоменклатуреСервисаНаСервере(СписокНоменклатурыЕдиногоКаталога)
	
	Для Каждого ТекСтрока Из СписокНоменклатурыЕдиногоКаталога Цикл
		ИнтеграцияСервиса1СНоменклатураБГУ.ЗаписатьПривязкуНоменклатурыЕдиногоКлассификатора(Объект.Ссылка, ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьКлассификациюСервиса1СНоменклатура(Команда)
	
	Отбор = Новый Структура("Номенклатура", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор, Истина, Истина);
	ОткрытьФорму("РегистрСведений.НастройкаСоответствияНоменклатуреСервиса.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКоманд1СНоменклатура(НаименованиеГруппыКомандСервиса)
	
	ЕстьПравоДоступа = ПравоДоступа("Чтение", Метаданные.Справочники.ЕдиныйКаталогОписанийТоваровИУслуг);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, НаименованиеГруппыКомандСервиса,
		"Видимость", ЕстьПравоДоступа);
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСписокВидовКонтроляПродукции()

	СписокВыбора = Элементы.ВидКонтроляПродукции.СписокВыбора;
	ЗаполнитьСписокВыбораВидовКонтроляПродукции(СписокВыбора);
	СписокВыбораКапВложение = Элементы.ВидКонтроляПродукции1.СписокВыбора;
	ЗаполнитьСписокВыбораВидовКонтроляПродукции(СписокВыбораКапВложение);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВидовКонтроляПродукции(СписокВыбора)

	СписокВыбора.Добавить(0, НСтр("ru = 'Не контролируется'"));
	
	Если ЭлектронныеДокументыБГУ.ИспользованиеМаркировки(Объект.Организация) Тогда
		СписокВыбора.Добавить(7, НСтр("ru = 'Фотокамеры (кроме кинокамер), фотовспышки и лампы-вспышки'"));
	КонецЕсли;
	
	Если Объект.ПрослеживаемыйТовар ИЛИ ВестиУчетПрослеживаемыхТоваров Тогда
		СписокВыбора.Добавить(6, НСтр("ru = 'Прослеживаемый товар'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеГруппыПодконтрольнаяПродукция(Форма)
	
	Объект = Форма.Объект;
	
	Если Объект.ПрослеживаемыйТовар Тогда
		Форма.ВидКонтроляПродукции = 6;	
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ФотоОборудование") Тогда
		Форма.ВидКонтроляПродукции = 7;	
	Иначе
		Форма.ВидКонтроляПродукции = 0;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКарточкиКапвложений()
	КарточкиКапвложений.Параметры.УстановитьЗначениеПараметра("ОбъектВложений", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ОтобразитьАдресОбъекта()
	ЭлементРодитель = ?(Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения"),
		Элементы.ГруппаАдресКапвложения, Элементы.ГруппаАдресОС);
	Элементы.Переместить(Элементы.ГруппаАдрес, ЭлементРодитель);
КонецПроцедуры	     

&НаСервере
Процедура ВидНФАПриИзмененииНаСервере()
	
	ПрочитатьДанныеКарточки();
	ЗаполнитьСписокВыбораТипНФА();
	ОтобразитьАдресОбъекта();
	УстановитьЗаголовокЗаводскогоНомера();
	
	Если ЗначениеЗаполнено(Объект.ТипНФА)
		И Элементы.ТипНФА.СписокВыбора.НайтиПоЗначению(Объект.ТипНФА) = Неопределено Тогда
		 // Тип НФА не соответствует выбранному виду НФА.
		Объект.ТипНФА = ПредопределенноеЗначение("Перечисление.ТипыНФА.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьЗаголовокЗаводскогоНомера()
	ТекЗаголовок = Справочники.ОсновныеСредства.ЗаголовокПоляЗаводскойНомер(Объект.ВидНФА);
	Элементы.ИнвентарныеНомераЗаводскойНомер.Заголовок = ТекЗаголовок;
	Элементы.ИнвентарныйНомерЗаводскойНомер.Заголовок  = ТекЗаголовок;
КонецПроцедуры	

&НаКлиенте
Процедура ИсторияПрослеживаемости_Изменение(НоваяИстория, ПараметрыОповещения) Экспорт
	
	Если НоваяИстория <> Неопределено Тогда
		ЭтаФорма.Модифицированность = Истина;
		ИсторияПрослеживаемости_ИзменениеСервер(НоваяИстория);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИсторияПрослеживаемости_ИзменениеСервер(НоваяИстория)
	
	
	Объект.ИсторияПрослеживаемости.Очистить();
	Объект.ИсторияПрослеживаемости.Загрузить(НоваяИстория.Выгрузить());
	ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище)
	
	АдресИсторииПрослеживаемостиХранилище = ?(Объект.ИсторияПрослеживаемости.Количество(),
			ПоместитьВоВременноеХранилище(Объект.ИсторияПрослеживаемости.Выгрузить(), УникальныйИдентификатор),"");
		
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИсторииПрослеживаемости(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсторияПрослеживаемости", "Доступность", Не Объект.Ссылка.Пустая());
	
КонецПроцедуры

#КонецОбласти
