#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы.
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ОсновноеСредство");
	ИменаРеквизитов.Добавить("ИнвентарныйНомер");
	ИменаРеквизитов.Добавить("СчетУчета");
	ИменаРеквизитов.Добавить("КПС");
	ИменаРеквизитов.Добавить("КФО");
	ИменаРеквизитов.Добавить("Количество");
	ИменаРеквизитов.Добавить("Сумма");
	ИменаРеквизитов.Добавить("СуммаАмортизации");
	ИменаРеквизитов.Добавить("СуммаАмортизацииЗаТекущийМесяц");
	ИменаРеквизитов.Добавить("СуммаОбесценения");
	Результат.Вставить("ОсновныеСредства", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

// Формирует данные для печати ф. 0510440 "Решение о прекращении признания активом"
//
// Параметры:
//  МассивОбъектов - Массив - тип элементов ДокументСсылка.РешениеОПрекращенииПризнанияАктивомИК
//
// Возвращаемое значение:      
//  Структура с элементами:
//   * ВыборкаДокументов - выборка запроса
//   * ВыборкаОС - выборка запроса
//   * ВыборкаОпись - выборка запроса
//   * Драгметаллы - выборка запроса
//   * ПТС - выборка запроса
//   * ЕГРН - выборка запроса
//   * Характеристики - выборка запроса
//   * ВыборкаФайлы - выборка запроса
Функция ДанныеДляПечати0510440(МассивОбъектов) Экспорт
	
	ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();
	ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ЕдиницаИзмерения),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЕдиницаИзмерения, "Наименование"), "");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК ДатаАкта,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Документ.Организация
	|		ИНАЧЕ Документ.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Документ.Организация.НаименованиеПолное = """"
	|						ТОГДА Документ.Организация.Наименование
	|					ИНАЧЕ Документ.Организация.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ Документ.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА Документ.Организация.КодПоРПБС
	|		ИНАЧЕ Документ.Организация.ГоловнаяОрганизация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБС,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|		ИНАЧЕ Документ.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ Документ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Документ.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ Документ.Организация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБСПодр,
	|	Документ.Подразделение КАК СтруктурноеПодразделение,
	|	ВЫБОР
	|		КОГДА Документ.Подразделение.НаименованиеПолное = """"
	|			ТОГДА Документ.Подразделение.Наименование
	|		ИНАЧЕ Документ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделения,
	|	Документ.Организация.КодПоППП.НаименованиеПолное КАК Учредитель,
	|	Документ.Организация.КодПоППП.Код КАК ГлаваБК,
	|	Документ.Организация.Бюджет.НаименованиеПолное КАК БюджетНаименование,
	|	Документ.Организация.Бюджет.Код КАК ОКТМО,
	|	Документ.Комиссия.НаименованиеПриказа КАК НаименованиеПриказа,
	|	Документ.Комиссия.НомерПриказа КАК НомерПриказа,
	|	Документ.Комиссия.ДатаПриказа КАК ДатаПриказа,
	|	Документ.ВидЛокальногоАкта КАК ВидЛокальногоАкта,
	|	Документ.НомерЛокальногоАкта КАК НомерЛокальногоАкта,
	|	Документ.ДатаЛокальногоАкта КАК ДатаЛокальногоАкта,
	|	Документ.ИнвентарныйУчет КАК ИнвентарныйУчет,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Руководитель КАК Руководитель
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Дата,
	|	Документ.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ИнвентарныйНомер = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.Код
	|		ИНАЧЕ ОсновныеСредства.ИнвентарныйНомер
	|	КОНЕЦ КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.СуммаАмортизации + ОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизации,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ОсновныеСредства.КФО КАК КФО,
	|	ОсновныеСредства.КПС КАК КПС,
	|	ОсновныеСредства.СтатусОбъекта КАК СтатусОбъекта,
	|	ОсновныеСредства.ЦелеваяФункцияАктива КАК ЦелеваяФункцияАктива,
	|	ОсновныеСредства.Количество КАК КоличествоНеСоответствует,
	|	ОсновныеСредства.Сумма КАК СуммаНеСоответствует,
	|	ОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОсновныеСредства.РезолюцияКомиссии КАК РезолюцияКомиссии
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ИнвентарныеОС
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|	И ОсновныеСредства.Ссылка.ИнвентарныйУчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ ДатаВводаВЭксплуатацию
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ВТ.ОсновноеСредство
	|					ИЗ
	|						ИнвентарныеОС КАК ВТ)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)) КАК СобытияОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ СПИ
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ИнвентарныеОС КАК ВТ)) КАК РасчетАмортизацииОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОС,
	|	ОсновныеСредства.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	|	0 КАК СрокЭксплуатации,
	|	ОсновныеСредства.ОсновноеСредство.Сведения КАК Сведения,
	|	ЕСТЬNULL(ОсновныеСредства.ОсновноеСредство.МожетСодержатьДрагМатериалы, ЛОЖЬ) КАК МожетСодержатьДрагМатериалы,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.ИнойНомер КАК ИнойНомер,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ЕСТЬNULL(СПИ.СрокПолезногоИспользования, 0) КАК СрокПолезногоИспользования,
	|	ЕСТЬNULL(ДатаВводаВЭксплуатацию.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатацию,
	|	ОсновныеСредства.СчетУчета.Код КАК Счет,
	|	ПРЕДСТАВЛЕНИЕ(ОсновныеСредства.КФО) КАК КФО,
	|	ОсновныеСредства.КПС.Код КАК КПС,
	|	ОсновныеСредства.СчетУчета.КОСГУКт.Код КАК КЭК,
	|	ОсновныеСредства.СтатусОбъекта КАК Статус,
	|	ОсновныеСредства.ЦелеваяФункцияАктива КАК ЦелеваяФункция,
	|	ОсновныеСредства.КоличествоНеСоответствует КАК НеАктивКоличество,
	|	ОсновныеСредства.СуммаНеСоответствует КАК НеАктивСумма,
	|	ОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОсновныеСредства.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	&ЕдиницаИзмерения КАК ЕдИзм
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию
	|		ПО ОсновныеСредства.ОсновноеСредство = ДатаВводаВЭксплуатацию.ОсновноеСредство
	|			И ОсновныеСредства.ИнвентарныйНомер = ДатаВводаВЭксплуатацию.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ СПИ КАК СПИ
	|		ПО ОсновныеСредства.ОсновноеСредство = СПИ.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновныеСредства.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДрагоценныеМатериалы.ОбъектНФА КАК ОсновноеСредство,
	|	ДрагоценныеМатериалы.ВидДрагМатериала КАК Драгметалл,
	|	ДрагоценныеМатериалы.ЕдИзм КАК НаименованиеЕИ,
	|	ДрагоценныеМатериалы.ЕдИзм.Код КАК КодЕИ,
	|	ДрагоценныеМатериалы.МассаДМ КАК Количество
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В(&МассивОбъектов)
	|	И ДрагоценныеМатериалы.Ссылка.ИнвентарныйУчет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДрагоценныеМатериалы.НомерСтроки
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредствСрезПоследних.СерияНомер КАК СерияНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.ИдентификационныйНомер КАК ИдентификационныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.Марка КАК Марка,
	|	ПаспортаТранспортныхСредствСрезПоследних.Модель КАК Модель,
	|	ПаспортаТранспортныхСредствСрезПоследних.Тип КАК Тип,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДвигательМодель КАК ДвигательМодель,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДвигательНомер КАК ДвигательНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.НомерШасси КАК НомерШасси,
	|	ПаспортаТранспортныхСредствСрезПоследних.НомерКузова КАК НомерКузова,
	|	ПаспортаТранспортныхСредствСрезПоследних.ЭкологическийКласс КАК ЭкологическийКласс,
	|	ПаспортаТранспортныхСредствСрезПоследних.Масса КАК Масса,
	|	ПаспортаТранспортныхСредствСрезПоследних.ГаражныйНомер КАК ГаражныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.Грузоподъемность КАК Грузоподъемность,
	|	ПаспортаТранспортныхСредствСрезПоследних.Колонна КАК Колонна,
	|	ПаспортаТранспортныхСредствСрезПоследних.РегистрационныйЗнак КАК РегистрационныйЗнак,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|	ПаспортаТранспортныхСредствСрезПоследних.ДатаСнятияСУчета КАК ДатаСнятияСУчета
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ИнвентарныеОС КАК ВТ)) КАК ПаспортаТранспортныхСредствСрезПоследних
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастроваяСтоимость КАК КадастроваяСтоимость,
	|	СведенияКадастровогоУчетаСрезПоследних.ДоляПлощадиЧислитель КАК ДоляПлощадиЧислитель,
	|	СведенияКадастровогоУчетаСрезПоследних.ДоляПлощадиЗнаменатель КАК ДоляПлощадиЗнаменатель,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания, 
	| //00-00566128
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомерЗемлиНедвижимости КАК КадастровыйНомерЗемлиНедвижимости, 
	|	СведенияКадастровогоУчетаСрезПоследних.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости, 
	| //00-00566128
	|	СведенияКадастровогоУчетаСрезПоследних.УсловныйНомер КАК УсловныйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.ЭтоПомещение КАК ЭтоПомещение,
	|	СведенияКадастровогоУчетаСрезПоследних.КоличествоЭтажей КАК КоличествоЭтажей,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
	|	СведенияКадастровогоУчетаСрезПоследних.ОбщийОбъем КАК ОбщийОбъем,
	|	СведенияКадастровогоУчетаСрезПоследних.ПодземныйОбъем КАК ПодземныйОбъем
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ИнвентарныеОС КАК ВТ)) КАК СведенияКадастровогоУчетаСрезПоследних
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизиты.Ссылка КАК ОсновноеСредство,
	|	ДополнительныеРеквизиты.Свойство.Заголовок КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ДополнительныеРеквизиты.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
	|						ТОГДА ДополнительныеРеквизиты.Значение.Наименование
	|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеРеквизиты.Значение.ПолноеНаименование КАК СТРОКА(1000))
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеРеквизиты.Значение)
	|	КОНЕЦ КАК ЗначениеХарактеристики,
	|	ДополнительныеРеквизиты.ТекстоваяСтрока КАК ТекстоваяСтрока
	|ИЗ
	|	Справочник.ОсновныеСредства.ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ИнвентарныеОС КАК ВТ)
	|	И ДополнительныеРеквизиты.Значение <> НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДополнительныеСведения.Объект,
	|	ДополнительныеСведения.Свойство.Заголовок,
	|	ВЫБОР
	|		КОГДА ДополнительныеСведения.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
	|			ТОГДА ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1))) = """"
	|						ТОГДА ДополнительныеСведения.Значение.Наименование
	|					ИНАЧЕ ВЫРАЗИТЬ(ДополнительныеСведения.Значение.ПолноеНаименование КАК СТРОКА(1000))
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Значение)
	|	КОНЕЦ,
	|	""""
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|ГДЕ
	|	ВЫРАЗИТЬ(ДополнительныеСведения.Объект КАК Справочник.ОсновныеСредства) В
	|			(ВЫБРАТЬ
	|				ВТ.ОсновноеСредство
	|			ИЗ
	|				ИнвентарныеОС КАК ВТ)
	|	И ДополнительныеСведения.Значение <> НЕОПРЕДЕЛЕНО
	|ИТОГИ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основание.Ссылка КАК Ссылка,
	|	Основание.ДокументИнвентаризации КАК ДокументИнвентаризации,
	|	Основание.ДокументИнвентаризации.Номер КАК Номер,
	|	Основание.ДокументИнвентаризации.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(Основание.СчетУчета) КАК КодСчета,
	|	ПРЕДСТАВЛЕНИЕ(Основание.КФО) КАК КФО
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.Основание КАК Основание
	|ГДЕ
	|	Основание.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Основание.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК Ссылка,
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК ИмяФайла,
	|	Файлы.Описание КАК Описание
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла В(&МассивОбъектов)
	|	И НЕ Файлы.Служебный
	|	И НЕ Файлы.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДокументов = Новый Структура;
	ДанныеДокументов.Вставить("ВыборкаДокументов"	, РезультатЗапроса[00].Выбрать());
	ДанныеДокументов.Вставить("ВыборкаОС"			, РезультатЗапроса[05].Выбрать());
	ДанныеДокументов.Вставить("ВыборкаОпись"		, РезультатЗапроса[10].Выбрать());
	ДанныеДокументов.Вставить("Драгметаллы"			, РезультатЗапроса[06].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДокументов.Вставить("ПТС"					, РезультатЗапроса[07].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДокументов.Вставить("ЕГРН"				, РезультатЗапроса[08].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДокументов.Вставить("Характеристики"		, РезультатЗапроса[09].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеДокументов.Вставить("ВыборкаФайлы"		, РезультатЗапроса[11].Выбрать());
	
	Возврат ДанныеДокументов;
	
КонецФункции

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу разделителей документов для целей формирования текущего документа 
// "Решение о прекращении прознания активом (имущество казны)" по данным других документов
//
// Параметры:
//  - ДокОснование - ДокументСсылка - документ, по данным которого заполнияется текущий документ
//  - СсылкаЦелевогоДокумента - ДокументСсылка.РешениеОПрекращенииПризнанияАктивомИК - ссылка на текущий документ.
//						Следует передавать, только, если ссылка не пустая. Если передан, то данные этого 
//                      документа не учитываются, как отработанные. Передается, если документ заполняется
//                      из формы самого документа (при выборе документа-основания)
//
// Возвращаемое значение:
// 	- ТаблицаЗначений с полями:
//   * ЦМО - СправочникСсылка.ЦМО
//   * Подразделение - СправочникСсылка.Подразделения
//   * ПоИнвентарнымОбъектам - Булево
Функция ТаблицаРазделителейДокументов(ДокОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт
	Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьНФА") Тогда
		Возврат(РазделителиДокументов_ИнвентаризационнаяОписьНФА(ДокОснование, СсылкаЦелевогоДокумента));
	КонецЕсли;	
КонецФункции	

// Формирует текст запроса для получения НФА, уже отработанных данным документом
// по инвентаризации
//
// Возвращаемое значение:
// - Строка - текст запроса
Функция ТекстЗапроса_НФАОтработанныеПоИнвентаризации() Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК ДокументОтклонения,
	|	ОсновныеСредства.ДокументИнвентаризации КАК ДокументИнвентаризации,
	|	ОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОтклоненийВИнвентаризацииНФА.НеАктивы) КАК ВидОтклонения,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.Ссылка.ЦМО <> ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|			ТОГДА ОсновныеСредства.Ссылка.ЦМО.МестоХранения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
	|	КОНЕЦ КАК МестоИнвентаризации,
	|	ОсновныеСредства.Количество КАК Количество
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.ДокументИнвентаризации В(&ДокументыИнвентаризации)
	|	И НЕ ОсновныеСредства.Ссылка = &РешениеОПрекращенииПризнанияАктивомИКСсылка
	|	И НЕ ОсновныеСредства.Ссылка.ПометкаУдаления";
	
	Возврат ТекстЗапроса;
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ГолосованиеКомиссии

Процедура ЗаполнитьРезультатГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ЗаполнитьРезультатыГолосования = Не Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	Если ЗаполнитьРезультатыГолосования Тогда
		РезультатГолосованияСотрудника = ОбщегоНазначенияБГУ.РезультатыГолосованияСотрудникаПоДокументу(
			Форма.Сотрудник, Объект.Ссылка, Объект.Комиссия, Объект.Организация);
		РезультатГолосованияКомиссии = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(
			Объект.Ссылка, Объект.Комиссия, Объект.Организация);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		
		СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Неопределено;
		СтрокаТаблицы.ИтогГолосования = 0;
		СтрокаТаблицы.РезолюцияКомиссииОдобрена = Ложь;
		Если ЗаполнитьРезультатыГолосования Тогда
			
			Если РезультатГолосованияСотрудника.Количество() > 0 Тогда
				Результаты = РезультатГолосованияСотрудника.Найти(СтрокаТаблицы.ИдентификаторСтроки, "ИдентификаторСтроки");
				Если Результаты <> Неопределено Тогда
					СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Результаты.РезультатГолосования;
				КонецЕсли;
			КонецЕсли;
			
			Если РезультатГолосованияКомиссии.Количество() > 0 Тогда
				ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
					Объект.Ссылка, СтрокаТаблицы.ИдентификаторСтроки);
				РезультатыГолосованияПоСтроке = РезультатГолосованияКомиссии.НайтиСтроки(ОтборПоИдентификаторуСтроки);
				Если РезультатыГолосованияПоСтроке.Количество() > 0 Тогда
					СтрокаТаблицы.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
					СтрокаТаблицы.РезолюцияКомиссииОдобрена = РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УправлениеЭлементамиГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ДоступностьГолосования = Не Объект.Проведен;
	Если ПолучитьФункциональнуюОпцию("РезервироватьОСПриВыбытии") Тогда
		ДоступностьГолосования = Не Объект.Аннулирован
			И (Объект.Резервировать Или Не Объект.Проведен);
	КонецЕсли;
	
	ДоступностьГолосования = ДоступностьГолосования
		И Не Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("Сотрудник");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Доступность", ДоступностьГолосования);
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноПротивВоВсехСтроках");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И Не ЗначениеЗаполнено(Форма.Сотрудник));
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВоВсехСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВВыделенныхСтроках");
	ЭлементыГолосование.Добавить("ОсновныеСредстваРешениеСотрудникаПоРезолюции");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Видимость", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник));
	
	ЭлементыГолосование = Новый Массив;
	ЭлементыГолосование.Добавить("СохранитьРезультатыГолосования");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ЭлементыГолосование, "Доступность", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РешениеОПрекращенииПризнанияАктивом";
	КомандаПечати.Идентификатор		= "Решение";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Решение о прекращении признания активами объектов НФА'"), "0510440");
	КомандаПечати.Порядок			= 1;
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериалов", 3);
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Решение") Тогда
	//	
	//	ТабличныйДокумент = НапечататьРешение(МассивОбъектов, ОбъектыПечати);
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
	//		"Решение","Решение о прекращении признания активами объектов НФА (ф. 0510440)", ТабличныйДокумент);
	//	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументСсылка, "Номер, Дата, Организация, Ссылка, ТребуетсяУтилизация, Резервировать");

	Если РеквизитыДокумента.Резервировать Тогда
		Возврат;
	КонецЕсли;		
		
	НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, РеквизитыДокумента.Номер);
	ДатаПроведения = БухгалтерскийУчет.УстановленнаяДатаПроведения(ДокументСсылка);
	Если ЗначениеЗаполнено(ДатаПроведения) Тогда
		РеквизитыДокумента.Вставить("Дата", ДатаПроведения);
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"				, ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента"		, НСтр("ru = 'Решение о прекращении признания активами объектов нефинансовых активов'"));
	Запрос.УстановитьПараметр("НомерДокумента"		, НомерДокумента);
	Запрос.УстановитьПараметр("Одобренные"			, ОбщегоНазначенияБГУ.ОдобренныеОбъектыГолосования(ДокументСсылка));
	Запрос.УстановитьПараметр("УчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	Запрос.УстановитьПараметр("УчетПоПодр02"		, БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("02.3").УчетПоПодразделениям);
	
	ТаблицыЗапроса = Новый Массив;
	
	ТаблицыЗапроса.Добавить("ТаблицаОсновныеСредства");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ТаблицаОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка) КАК Договор,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	&НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.СчетУчета КАК СчетУчета,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизацииЗаТекущийМесяц,
	|	ТаблицаОсновныеСредства.РезолюцияКомиссии КАК РезолюцияКомиссии,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет,
	|	ЕСТЬNULL(ЗначенияДополнительныхРеквизитовОпераций.Значение, ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)) КАК ЦМОНаХранении
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.РешениеОПрекращенииПризнанияАктивомИК.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОпераций КАК ЗначенияДополнительныхРеквизитовОпераций
	|		ПО ТаблицаОсновныеСредства.Ссылка = ЗначенияДополнительныхРеквизитовОпераций.Объект
	|			И (ЗначенияДополнительныхРеквизитовОпераций.РеквизитОперации.ИмяДляФормулы = ""ЦМОНаХранении"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ТаблицаОсновныеСредства.Ссылка)
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|	И ТаблицаОсновныеСредства.ИдентификаторСтроки В(&Одобренные)
	|	И ЗначенияДополнительныхРеквизитовОпераций.Объект = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	Если НЕ РеквизитыДокумента.ТребуетсяУтилизация Тогда
			
		// Если ОС списывается с баланса, и НЕ приходуется на забалансовый счет 02.3, то это окончательное списание 
		// и нужно сформировать движение по регистру "СобытияОС"
	 	
		ТаблицыЗапроса.Добавить("СобытияОС");
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
		|	ТаблицаОсновныеСредства.Организация КАК Организация,
		|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
		|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
		//|	ТаблицаОсновныеСредства.РезолюцияКомиссии КАК ПричинаСписания,
		|	ТаблицаОсновныеСредства.ПричинаСписания КАК ПричинаСписания,
		|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
		|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
		|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
		|ИЗ
		|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
		|ГДЕ
		|	ТаблицаОсновныеСредства.ПообъектныйУчет
		|	И НЕ ТаблицаОсновныеСредства.СчетУчета.Забалансовый";
	КонецЕсли;
	
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.СчетУчета.Забалансовый
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	КОНЕЦ КАК ВидРаспоряжения,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|		И ТаблицаОсновныеСредства.СчетУчета.УчетПоПодразделениям
	|			ТОГДА ТаблицаОсновныеСредства.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ТаблицаОсновныеСредства.Сумма КАК Стоимость,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.ПричинаСписания КАК Причина
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	(ТаблицаОсновныеСредства.Сумма <> 0
	|	ИЛИ ТаблицаОсновныеСредства.Количество <> 0)";
	
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц КАК СуммаАмортизации,
	|	0 КАК СуммаОбесценения,
	|	ЛОЖЬ КАК ЭтоСписание
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.СуммаАмортизации + ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц,
	|	ТаблицаОсновныеСредства.СуммаОбесценения,
	|	ИСТИНА
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	(ТаблицаОсновныеСредства.СуммаАмортизации + ТаблицаОсновныеСредства.СуммаАмортизацииЗаТекущийМесяц <> 0
	|			ИЛИ ТаблицаОсновныеСредства.СуммаОбесценения <> 0)";
	
	Если РеквизитыДокумента.ТребуетсяУтилизация Тогда
			
		// Приходовать в регистр "СтоимостьОбъектовОСПоКонтрагентам" нужно, только если ОС принимается
		// на хранение на забалансовый счет	
		ТаблицыЗапроса.Добавить("СтоимостьОбъектовОСПоКонтрагентам");
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаХранении) КАК ВидРаспоряжения,
		|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период,
		|	ТаблицаОсновныеСредства.Организация КАК Организация,
		|	ВЫБОР
		|		КОГДА &УчетПоПодразделениям
		|				И &УчетПоПодр02
		|			ТОГДА ТаблицаОсновныеСредства.Подразделение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
		|	КОНЕЦ КАК Подразделение,
		|	ВЫБОР
		|		КОГДА ТаблицаОсновныеСредства.ЦМОНаХранении = ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
		|			ТОГДА ТаблицаОсновныеСредства.ЦМО
		|		ИНАЧЕ ТаблицаОсновныеСредства.ЦМОНаХранении
		|	КОНЕЦ КАК ЦМО,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Контрагент,
		|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка) КАК Договор,
		|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ТаблицаОсновныеСредства.Количество КАК Количество,
		|	ТаблицаОсновныеСредства.Количество КАК Стоимость,
		|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
		|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
		|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
		|ИЗ
		|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	КонецЕсли;	
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Многопоточный обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	Документы.РешениеОПрекращенииПризнанияАктивом.ЗарегистрироватьДокументыКОбработкеДляПереходаНаНовуюВерсию(
		Параметры, Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомИК"));	
	
КонецПроцедуры

// Парный обработчик к процедуре ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
// 
// Параметры:
//  Параметры - Структура:
//   * ОбработкаЗавершена - Булево
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Документы.РешениеОПрекращенииПризнанияАктивом.ОбработатьДокументыДляПереходаНаНовуюВерсию(
		Параметры, Тип("ДокументСсылка.РешениеОПрекращенииПризнанияАктивомИК"));
	
КонецПроцедуры

#КонецОбласти

// Формирует таблицу разделителей документов для ввода документов "Решение о прекращении
// признания активом (имущество казны)" по данным документа "Инвентаризационная опись НФА" (0510466)
//
// Параметры:
//  ДокИнвентаризации - ДокументСсылка.ИнвентаризационнаяОписьНФА - документ инвентаризации
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица разделителей с полями:
//   * ЦМО - СправочникСсылка.ЦМО
//   * Подразделение - СправочникСсылка.Подразделения
//   * ИнвентарныйОбъект - Булево
Функция РазделителиДокументов_ИнвентаризационнаяОписьНФА(ДокОснование, СсылкаЦелевогоДокумента)
	Запрос = Новый Запрос;
	Документы.ИнвентаризационнаяОписьНФА.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокОснование, СсылкаЦелевогоДокумента);
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеИнвентаризации.ИФО КАК ИФО,
	|	ДанныеИнвентаризации.ЦМОРаздела4 КАК ЦМО,
	|	ДанныеИнвентаризации.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ДанныеИнвентаризации.НФА КАК Справочник.ОсновныеСредства).ВидНФА <> ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС)
	|		ИЛИ ВЫБОР
	|			КОГДА ДанныеИнвентаризации.Количество <> 0
	|				ТОГДА ДанныеИнвентаризации.Сумма / ДанныеИнвентаризации.Количество
	|			ИНАЧЕ ДанныеИнвентаризации.Сумма
	|		КОНЕЦ > &ПервыйПредел
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПоИнвентарнымОбъектам
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации = &Ссылка
	|	И ДанныеИнвентаризации.ВидОбъекта В (6, 7)
	|	И (ДанныеИнвентаризации.КоличествоНеСоответствует <> 0
	|	ИЛИ ДанныеИнвентаризации.СуммаНеСоответствует <> 0)
	|СГРУППИРОВАТЬ ПО
	|	ДанныеИнвентаризации.ИФО,
	|	ДанныеИнвентаризации.ЦМОРаздела4,
	|	ДанныеИнвентаризации.Подразделение,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ДанныеИнвентаризации.НФА КАК Справочник.ОсновныеСредства).ВидНФА <> ЗНАЧЕНИЕ(Перечисление.ВидыНФА.ОС)
	|		ИЛИ ВЫБОР
	|			КОГДА ДанныеИнвентаризации.Количество <> 0
	|				ТОГДА ДанныеИнвентаризации.Сумма / ДанныеИнвентаризации.Количество
	|			ИНАЧЕ ДанныеИнвентаризации.Сумма
	|		КОНЕЦ > &ПервыйПредел
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОснование, "Дата");
	ПервыйПредел = УправлениеОсновнымиСредствами.ПолучитьПараметрыУчетаОС(ДатаДокумента).ПервыйПределОС;
	Запрос.УстановитьПараметр("ПервыйПредел", ПервыйПредел);
	
	ТаблицаРазделителей = Запрос.Выполнить().Выгрузить();
	СтруктураРазделителей = Новый Структура("Разделители, ЗаголовкиКолонок");
	СтруктураРазделителей.Вставить("Разделители", ТаблицаРазделителей);
	СтруктураРазделителей.Вставить("ЗаголовкиКолонок", Новый Структура("ПоИнвентарнымОбъектам", "По инвентарным объектам"));
	
	Возврат(СтруктураРазделителей);
КонецФункции	

#КонецОбласти

#КонецЕсли
