/////////////////////////////////////////////////////////////////////////////////
// БУХГАЛТЕРСКИЕ ОПЕРАЦИИ ПЕРЕОПРЕДЕЛЯЕМЫЙ
//
// Предназначен для возможности добавления функций, используемых в типовых     
// операциях при внедрении конфигурации.
//
// Обязательно содержит процедуры 
//	ЗаполнитьОписанияПользовательскихФункций,
//	ЗаполнитьОписанияПользовательскихФункцийУсловийОпераций,
//	ДобавитьОписаниеПользовательскойФункции.
//
// Процедура ДобавитьОписаниеПользовательскойФункции не должна изменяться при
// внедрении.
//
// В процедуре ЗаполнитьОписанияПользовательскихФункций заполняется список
// функций, которые могут использоваться в формулах проводок типовых операций.
// В процедуре ЗаполнитьОписанияПользовательскихФункцийУсловийОпераций
// заполняется список функций, которые могут использоваться в формулах типовой
// операции.
// Для добавления используется процедура ДобавитьОписаниеПользовательскойФункции
// Например,
//	ДобавитьОписаниеПользовательскойФункции("СчетПоКЭК", НСтр("ru = 'Определяет счет по КЭК'")));
//
// Функция, используемая в типовых операциях, должна быть экспортной. Если при вычислении возникает ошибка, которую надо показать пользователю, то можно
// добавить ее в общий список ошибок вызовом процедуры БухгалтерскиеОперации.ДобавитьОшибкуВКонтекстПроведения(ТекстОшибки, ИмяФункции)
// Например,
//	БухгалтерскиеОперации.ДобавитьОшибкуВКонтекстПроведения(НСтр("ru = 'Не заполнен КЭК'"), "БухгалтерскиеОперацииПереопределяемый.СчетПоКЭК")
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьОписанияПользовательскихФункций(ТаблицаФункций) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьОписанияПользовательскихФункцийУсловийОпераций(ТаблицаФункций) Экспорт
	
КонецПроцедуры

Процедура ДобавитьОписаниеПользовательскойФункции(ТаблицаПользовательскихФункций, ИмяФункции, ОписаниеФункции = "", Используется = Истина) Экспорт
	БухгалтерскиеОперации.ДобавитьОписаниеПользовательскойФункции(ТаблицаПользовательскихФункций, ИмяФункции, ОписаниеФункции, Используется);
КонецПроцедуры

#Область ИспользованиеРасширенийКонфигурации

// При реализации собственных модулей в конфигурации или расширении
// следует добавить их имена в массив ИменаМодулей.
//
// Пример реализации:
// Процедура ИменаМодулейОбъявленияФункций(ИменаМодулей) Экспорт
// 	ИменаМодулей.Добавить("МойМодуль");
// КонецПроцедуры
//
// Параметры:
//	ИменаМодулей - Массив - Массив, содержащий описания общих модулей.
//
// Пример:
//	ОписаниеРасширения = БухгалтерскиеОперацииСервер.ОписаниеРасширения(ИменаМодулей);
//	ОписаниеРасширения.Заголовок = НСтр("ru = 'Описание расширения для пользователя'");
//	ОписаниеРасширения.МодулиФункций.Добавить("ИмяМодуляСодержащегоФункцииДляПроводок");
//	ОписаниеРасширения.МодулиИсточниковДанных.Добавить("ИмяМодуляСодержащееФункцииИсточниковДанных");
//	ОписаниеРасширения.МодулиОбработчиков.Добавить("ИмяМодуляСодержащееПроцедурыОбработчикиПослеФормированияПроводок");
//
Процедура ИменаМодулейОбъявленияФункций(ИменаМодулей) Экспорт

	// Пример:
	//ОписаниеРасширения = БухгалтерскиеОперацииСервер.ОписаниеРасширения(ИменаМодулей);
	//ОписаниеРасширения.Заголовок = НСтр("ru = 'Описание расширения для пользователя'");
	//
	//ОписаниеРасширения.МодулиФункций.Добавить("ИмяМодуляСодержащегоФункцииДляПроводок");
	//
	//ОписаниеРасширения.МодулиИсточниковДанных.Добавить("ИмяМодуляСодержащееФункцииИсточниковДанных");
	//
	//ОписаниеРасширения.МодулиОбработчиков.Добавить("ИмяМодуляСодержащееПроцедурыОбработчикиПослеФормированияПроводок");

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ПрограммныйИнтерфейс



#КонецОбласти

#КонецЕсли 
 