
#Область ПрограммныйИнтерфейс

#Область ФормированиеРСКП 

// Формирует текст назначения платежа в документе РСКП (перечисление)
//
// Прарметры:
//    Объект - ДокументОбъект.РСКППеречисление или ДанныеФормыСтруктура
//    РасшифровкаПлатежа - Таблица значений или ДанныеФормыСтруктура
//    УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - Число, максимальная длина поля "Назначение платежа"
//
Процедура СформироватьТекстНазначенияПлатежаРСКППеречисление(Объект, 
	РасшифровкаПлатежа, 
	Контрагенты,
	РеквизитыДокументаОснования,
	УстановленнаяМаксимальнаяДлинаНазначенияПлатежа) Экспорт    
	
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	МассивКБК = Новый Массив;
	МассивНаправление = Новый Массив; 
	ЕстьЦС = Ложь;
	Для Каждого СтрРасшифровка Из РасшифровкаПлатежа Цикл
		Если МассивКБК.Найти(Прав(СтрРасшифровка.КБКНазначениеПлатежа, 3)) = Неопределено Тогда
			МассивКБК.Добавить(Прав(СтрРасшифровка.КБКНазначениеПлатежа, 3));
		КонецЕсли;
		Если МассивНаправление.Найти(СтрРасшифровка.НаправлениеПлатежа) = Неопределено Тогда 
			МассивНаправление.Добавить(СтрРасшифровка.НаправлениеПлатежа);
		КонецЕсли; 
		Если СтрРасшифровка.КодПоступленияЕБП = ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС") Тогда
			ЕстьЦС = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	РасшифровкаПлатежаКонтроль = МассивКБК.Количество() = 1;  
	
	Если (РасшифровкаПлатежа.Количество() < 2 ИЛИ РасшифровкаПлатежаКонтроль) 
		И НЕ ЕстьЦС 
		И Контрагенты.Количество() < 2 Тогда
		// 1. Указан один КБК в блоке «Расшифровка РСКП», «Код поступления» не равен «ЦС» и в блоке «Получатель» указана одна запись получателя
		// Это же условие действует, если в блоке «Расшифровка РСКП» во всех строках значения КБК одинаковы
		// <Признак авансового платежа>* <Направление платежа> <Дополнительная информация> <Документы-основания>** <НДС>***
		// <Признак авансового платежа>* <Направление платежа> <Дополнительная информация> <Документы-основания>** <НДС>***
		// Не заполняется  
        ТекстЧасть_0 = ?(Объект.ПризнакАвансовогоПлатежа, "Аванс", ""); 
		ТекстЧасть_1 = "";	
		ТекстЧасть_3 = "";
		Для Каждого Стр Из РеквизитыДокументаОснования Цикл
			Если Стр.НазначениеПлатежа Тогда
				// <Вид документа-основания> от <дд.мм.гггг> №<номер>
				ТекстЧасть_3 = ТекстЧасть_3 + " " + Стр.ДокументОснованиеВид + " от " + Формат(Стр.ДокументОснованиеДата, "ДФ=dd.MM.yyyy") + " №" + Стр.ДокументОснованиеНомер;
			КонецЕсли;
		КонецЦикла;
		ТекстЧасть_4 = "";
		НДС = Ложь;
		Если Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
			ТекстЧасть_4 = " БезНДС";
		ИначеЕсли ЗначениеЗаполнено(Объект.СуммаНДС) Тогда
			ТекстЧасть_4 = " НДС";
			НДС = Истина;
		КонецЕсли;  
		Для Каждого Стр Из МассивНаправление Цикл
			ТекстЧасть_1 = ТекстЧасть_1 + " " + Стр;
		КонецЦикла; 
		
		ТекстЧасть_2 = " " + Объект.ДополнительнаяИнформация; 
		ТекстНДС = ?(НДС, Формат(Объект.СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"), "");
		
		НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_0 + ТекстЧасть_1 + ТекстЧасть_2 + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС); 
		КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
		Если  КоррекцияПредв < 0 Тогда
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_0 + ТекстЧасть_1 + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС);  
		КонецЕсли;	
		Объект.НазначениеПлатежа = НазначениеПлатежаПредв;
		
		Для Каждого Стр Из РасшифровкаПлатежа Цикл 
			ТекстНДС = ?(НДС, Формат(Стр.СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"), ""); 
			ТекстНаправлениеПлатежа = " " + Стр.НаправлениеПлатежа;
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_0 + ТекстНаправлениеПлатежа + ТекстЧасть_2 + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС); 
			КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
			Если  КоррекцияПредв < 0 Тогда
				НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_0 + ТекстНаправлениеПлатежа + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС);  
			КонецЕсли;
			Стр.СтрокаНазначениеПлатежа = НазначениеПлатежаПредв;
		КонецЦикла;
		Для Каждого Стр Из Объект.Контрагенты Цикл
			Стр.СтрокаНазначениеПлатежа = "";
		КонецЦикла;
				
	ИначеЕсли (РасшифровкаПлатежа.Количество() < 2 ИЛИ РасшифровкаПлатежаКонтроль) 
		И ЕстьЦС 
		И Контрагенты.Количество() < 2 Тогда
		// 2. Указан один КБК в блоке «Расшифровка РСКП» и «Код поступления» равен «ЦС» и в блоке «Получатель» указана одна запись получателя 
		// <Признак авансового платежа>* <Дополнительная информация> <Документы-основания>** <НДС>***	
		// <Признак авансового платежа>* <Дополнительная информация> <Документы-основания>** <НДС>***	
		// Не заполняется 
		ТекстЧасть_1 = ?(Объект.ПризнакАвансовогоПлатежа, "Аванс ", "");
		ТекстЧасть_3 = "";
		Для Каждого Стр Из РеквизитыДокументаОснования Цикл
			Если Стр.НазначениеПлатежа Тогда
				// <Вид документа-основания> от <дд.мм.гггг> №<номер>
				ТекстЧасть_3 = ТекстЧасть_3 + " " + Стр.ДокументОснованиеВид + " от " + Формат(Стр.ДокументОснованиеДата,"ДФ=dd.MM.yyyy") + " №" + Стр.ДокументОснованиеНомер;
			КонецЕсли;
		КонецЦикла;
		ТекстЧасть_4 = ""; 
		НДС = Ложь;
		Если Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
			ТекстЧасть_4 = " БезНДС";
		ИначеЕсли ЗначениеЗаполнено(Объект.СуммаНДС) Тогда
			ТекстЧасть_4 = " НДС"; 
			НДС = Истина;
		КонецЕсли;  
		
		ТекстЧасть_2 = " " + Объект.ДополнительнаяИнформация; 
		ТекстНДС = ?(НДС, Формат(Объект.СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"), "");
		
		НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстЧасть_2 + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС); 
		КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
		Если  КоррекцияПредв < 0 Тогда
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС);  
		КонецЕсли;	
		Объект.НазначениеПлатежа = НазначениеПлатежаПредв;
		
		Для Каждого Стр Из РасшифровкаПлатежа Цикл  
			Если Стр.КодПоступленияЕБП = ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС") Тогда
				ТекстНаправлениеПлатежа = "";
			Иначе
				ТекстНаправлениеПлатежа = " " + Стр.НаправлениеПлатежа;
			КонецЕсли;	 
			ТекстНДС = ?(НДС, Формат(Стр.СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"), ""); 
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстНаправлениеПлатежа + ТекстЧасть_2 + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС); 
			КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
			Если  КоррекцияПредв < 0 Тогда
				НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстНаправлениеПлатежа + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС);  
			КонецЕсли;
			Стр.СтрокаНазначениеПлатежа = НазначениеПлатежаПредв;
		КонецЦикла;
		Для Каждого Стр Из Контрагенты Цикл
			Стр.СтрокаНазначениеПлатежа = "";
		КонецЦикла;	 
		
	ИначеЕсли РасшифровкаПлатежа.Количество() > 1 Тогда
		// 3. В блоке «Расшифровка РСКП» более одного элемента 
		// <Признак авансового платежа>* <Дополнительная информация> <Документы-основания>** <НДС>***	
		// <Признак авансового платежа>* <Направление платежа> <Документы-основания>** <НДС>***	
		// Не заполняется  
		ТекстЧасть_1 = ?(Объект.ПризнакАвансовогоПлатежа, "Аванс ", "");
		ТекстЧасть_3 = "";
		Для Каждого Стр Из РеквизитыДокументаОснования Цикл
			Если Стр.НазначениеПлатежа Тогда
				// <Вид документа-основания> от <дд.мм.гггг> №<номер>
				ТекстЧасть_3 = ТекстЧасть_3 + " " + Стр.ДокументОснованиеВид + " от " + Формат(Стр.ДокументОснованиеДата,"ДФ=dd.MM.yyyy") + " №" + Стр.ДокументОснованиеНомер;
			КонецЕсли;
		КонецЦикла;
		ТекстЧасть_4 = ""; 
		НДС = Ложь;
		Если Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
			ТекстЧасть_4 = " БезНДС";
		ИначеЕсли ЗначениеЗаполнено(Объект.СуммаНДС) Тогда
			ТекстЧасть_4 = " НДС"; 
			НДС = Истина;
		КонецЕсли; 
		ТекстЧасть_2 = " " + Объект.ДополнительнаяИнформация; 
		ТекстНДС = ?(НДС, Формат(Объект.СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"), "");
		
		НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстЧасть_2 + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС); 
		КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
		Если  КоррекцияПредв < 0 Тогда
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС);  
		КонецЕсли;	
		Объект.НазначениеПлатежа = НазначениеПлатежаПредв;

		Для Каждого Стр Из РасшифровкаПлатежа Цикл  
			ТекстНДС = ?(НДС, Формат(Стр.СуммаНДС, "ЧДЦ=2; ЧРД=.; ЧГ=0"), ""); 
			ТекстНаправлениеПлатежа = " " + Стр.НаправлениеПлатежа;
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстНаправлениеПлатежа + ТекстЧасть_3 + ТекстЧасть_4 + ТекстНДС); 
			КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
			Если  КоррекцияПредв < 0 Тогда
				НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстНаправлениеПлатежа + Лев(ТекстЧасть_3, СтрДлина(ТекстЧасть_3) + КоррекцияПредв) + ТекстЧасть_4 + ТекстНДС);  
			КонецЕсли;
			Стр.СтрокаНазначениеПлатежа = НазначениеПлатежаПредв;
		КонецЦикла;
		Для Каждого Стр Из Объект.Контрагенты Цикл
			Стр.СтрокаНазначениеПлатежа = "";
		КонецЦикла;	

	ИначеЕсли РасшифровкаПлатежа.Количество() < 2 
		И НЕ РасшифровкаПлатежа[0].КодПоступленияЕБП = ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС") 
		И Контрагенты.Количество()  > 1 Тогда 
		// 4. Указан один КБК в блоке «Расшифровка РСКП» и «Код поступления» не равен «ЦС» и в блоке «Получатель» указано более одной записи получателя
		// <Направление платежа> <Дополнительная информация> <Документы-основания>	
		// Не заполняется	
		// <Направление платежа> <Дополнительная информация> <Документы-основания>  
		ТекстЧасть_1 = "" + Объект.РасшифровкаПлатежа[0].НаправлениеПлатежа;
		ТекстЧасть_3 = "";
		Для Каждого Стр Из РеквизитыДокументаОснования Цикл
			Если Стр.НазначениеПлатежа Тогда
				// <Вид документа-основания> от <дд.мм.гггг> №<номер>
				ТекстЧасть_3 = ТекстЧасть_3 + " " + Стр.ДокументОснованиеВид + " от " + Формат(Стр.ДокументОснованиеДата,"ДФ=dd.MM.yyyy") + " №" + Стр.ДокументОснованиеНомер;
			КонецЕсли;
		КонецЦикла; 
		ТекстЧасть_2 = " " + Объект.ДополнительнаяИнформация; 
		
		НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстЧасть_2 + ТекстЧасть_3); 
		КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
		Если  КоррекцияПредв < 0 Тогда
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3);  
		КонецЕсли;	
		Объект.НазначениеПлатежа = НазначениеПлатежаПредв;
		
		Для Каждого Стр Из РасшифровкаПлатежа Цикл
			Стр.СтрокаНазначениеПлатежа = "";
		КонецЦикла;
		Для Каждого Стр Из Объект.Контрагенты Цикл  
			ТекстЧасть_2 = " " + Стр.ДополнительнаяИнформация;
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстЧасть_2 + ТекстЧасть_3); 
			КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
			Если  КоррекцияПредв < 0 Тогда
				НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3);  
			КонецЕсли;
			Стр.СтрокаНазначениеПлатежа = НазначениеПлатежаПредв;
		КонецЦикла;	
		
	ИначеЕсли РасшифровкаПлатежа.Количество() < 2 
		И РасшифровкаПлатежа[0].КодПоступленияЕБП = ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС") 
		И Контрагенты.Количество()  > 1 Тогда	
		// 5. Указан один КБК в блоке «Расшифровка РСКП» и «Код поступления» равен «ЦС» и в блоке «Получатель» указано более однойзаписи получателя 
		// <Дополнительная информация> <Документы-основания>	
		// Не заполняется	
		// <Дополнительная информация> <Документы-основания>   
		ТекстЧасть_1 = "";
		ТекстЧасть_3 = "";
		Для Каждого Стр Из РеквизитыДокументаОснования Цикл
			Если Стр.НазначениеПлатежа Тогда
				// <Вид документа-основания> от <дд.мм.гггг> №<номер>
				ТекстЧасть_3 = ТекстЧасть_3 + " " + Стр.ДокументОснованиеВид + " от " + Формат(Стр.ДокументОснованиеДата,"ДФ=dd.MM.yyyy") + " №" + Стр.ДокументОснованиеНомер;
			КонецЕсли;
		КонецЦикла;  
		ТекстЧасть_2 = " " + Объект.ДополнительнаяИнформация; 
		
		НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + ТекстЧасть_2 + ТекстЧасть_3); 
		КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
		Если  КоррекцияПредв < 0 Тогда
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_1 + Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3);  
		КонецЕсли;	
		Объект.НазначениеПлатежа = НазначениеПлатежаПредв;
		
		Для Каждого Стр Из РасшифровкаПлатежа Цикл
			Стр.СтрокаНазначениеПлатежа = "";
		КонецЦикла;
		Для Каждого Стр Из Контрагенты Цикл    
			ТекстЧасть_2 = Стр.ДополнительнаяИнформация;
			НазначениеПлатежаПредв = СокрЛП(ТекстЧасть_2 + ТекстЧасть_3); 
			КоррекцияПредв = УстановленнаяМаксимальнаяДлинаНазначенияПлатежа - СтрДлина(НазначениеПлатежаПредв); 
			Если  КоррекцияПредв < 0 Тогда
				НазначениеПлатежаПредв = СокрЛП(Лев(ТекстЧасть_2, СтрДлина(ТекстЧасть_2) + КоррекцияПредв) + ТекстЧасть_3);  
			КонецЕсли;
			Стр.СтрокаНазначениеПлатежа = НазначениеПлатежаПредв;
		КонецЦикла;	
		
	Иначе 
		Для Каждого Стр Из РасшифровкаПлатежа Цикл
			Стр.СтрокаНазначениеПлатежа = "";
		КонецЦикла;
	    Для Каждого Стр Из Контрагенты Цикл
			Стр.СтрокаНазначениеПлатежа = "";
		КонецЦикла;	
		Объект.НазначениеПлатежа = "";
	КонецЕсли;	

КонецПроцедуры

Функция СоответствиеКФОКодамПоступленийЕБП(Дата) Экспорт
	
	// 4      -    ГЗ – субсидии на финансовое обеспечение выполнения государственного (муниципального) задания
	// 5,6    -    ЦС – (до конца 2024 г.) - субсидии на иные цели в соответствии со статьей 78.1 БК РФ и субсидии на осуществление кап. вложений
	// 6      -    КВ – (с 2025 г.) - субсидии на осуществление кап. вложений
	// 5      -    ИЦ – (с 2025 г.) - субсидии на иные цели в соответствии со статьей 78.1 БК РФ
	// 5      -    ГР – гранты в форме субсидий, предоставляемые из бюджетов бюджетной системы Российской Федерации
	// 7      -    МС – средства обязательного медицинского страхования
	// 2      -    ПД – средства от приносящей доход деятельности и иные средства
	// 3      -    ОБ – средства, поступающие в рамках обеспечения заявки, исполнения контракта
	// 3      -    ВР – средства во временном распоряжении
	
	СоотвествиеКодов = Новый Соответствие;

	Если ГОД(Дата) < 2027 Тогда
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.Внебюджет"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ПД"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаИныеЦели"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.ВременноеРаспоряжение"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ВР")); 
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.БюджетныеИнвестиции"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.СредстваОМС"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.МС"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаГосзадание"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ГЗ"));
	Иначе
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.Внебюджет"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ПД"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаИныеЦели"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ИЦ"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.ВременноеРаспоряжение"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ВР"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.БюджетныеИнвестиции"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.КВ"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.СредстваОМС"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.МС"));
		СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаГосзадание"), ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ГЗ"));
	КонецЕсли;

	Возврат СоотвествиеКодов
	
КонецФункции	
	
Функция КодПоступленияЕБППоКФО(КФО, Дата) Экспорт   
	Возврат СоответствиеКФОКодамПоступленийЕБП(Дата).Получить(КФО);
КонецФункции  

Функция КФОПоКодуПоступленияЕБП(КодПоступления) Экспорт  
	
	СоотвествиеКодов = Новый Соответствие;  
	
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ГЗ"), ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаГосзадание"));
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС"), ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаИныеЦели"));
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.КВ"), ПредопределенноеЗначение("Перечисление.КВД.БюджетныеИнвестиции")); 
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ИЦ"), ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаИныеЦели")); 
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ГР"), ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаИныеЦели"));
    СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.МС"), ПредопределенноеЗначение("Перечисление.КВД.СредстваОМС"));  
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ПД"), ПредопределенноеЗначение("Перечисление.КВД.Внебюджет"));
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ОБ"), ПредопределенноеЗначение("Перечисление.КВД.ВременноеРаспоряжение"));
	СоотвествиеКодов.Вставить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ВР"), ПредопределенноеЗначение("Перечисление.КВД.ВременноеРаспоряжение"));
	 
	Возврат СоотвествиеКодов.Получить(КодПоступления);  
	
КонецФункции  


#КонецОбласти

Функция СписокОшибокНСПК() Экспорт   
	
	СписокОшибок = Новый Соответствие;
	СписокОшибок.Вставить("0001", "Номер карты не соответствует ни одному из диапазонов номеров платежных карт платежной системы");
	СписокОшибок.Вставить("0003", "Последняя цифра номера платежной карты содержит некорректный контрольный разряд");
	СписокОшибок.Вставить("0004", "Эмитент платежной карты не доступен в течение времени обработки Исходящего реестра в НСПК");
	СписокОшибок.Вставить("0005", "Эмитент сообщил об отсутствии платежной карты");
	СписокОшибок.Вставить("0007", "Неизвестный код выплаты");
	СписокОшибок.Вставить("0011", "Значение поля ""Дата рождения"" больше текущей даты или меньше даты 1 января 1900 года");
	СписокОшибок.Вставить("0012", "Эмитент платежной карты отклонил запрос на пополнение карты по причине несоответствия значения поля ""Дата рождения"" и даты рождения держателя карты по данным эмитента");
	СписокОшибок.Вставить("0013", "Эмитент платежной карты отклонил запрос по иным причинам, позволяющим использовать номер платежной карты в дальнейшем");
	СписокОшибок.Вставить("0014", "Эмитент карты отклонил запрос по иным причинам, не позволяющим использовать номер платежной карты в дальнейшем");
	СписокОшибок.Вставить("0015", "Эмитент карты отклонил запрос на пополнение карты, т.к. срок действия карты истек/карта заблокирована");
	СписокОшибок.Вставить("0016", "Эмитент отклонил запрос на пополнение карты, т.к. к счету получателя средств выпущены карты, не являющиеся национальными платежными инструментами");
	СписокОшибок.Вставить("0017", "Эмитент отклонил запрос на пополнение карты, т.к. карта заблокирована/счет карты закрыт в связи со смертью держателя");
	
	Возврат СписокОшибок;
	
КонецФункции

Функция ДопустимыеКодыСимволов() Экспорт
	
	// Допустимые символы ASCII  с 32 по 59, 61, с 63 по 126, 168 (Ё), 184 (ё), 185 (№) и с 192 по 255
	// Соответствие символов Unicode, по которым выполняется проверка в языке 1С:Предприятие:
	// 32 - 59, 61, 63 - 126, 1025(Ё), 1105(ё), 8470 (№), 1040-1103

	ДопустимыеСимволыКоды = Новый Соответствие;
	
	Для Сч = 32 По 59 Цикл
		ДопустимыеСимволыКоды.Вставить(Сч, Символ(Сч));
	КонецЦикла;
	ДопустимыеСимволыКоды.Вставить(61, Символ(61));
	Для Сч = 63 По 126 Цикл
		ДопустимыеСимволыКоды.Вставить(Сч, Символ(Сч));
	КонецЦикла;
	ДопустимыеСимволыКоды.Вставить(125, Символ(125));
	ДопустимыеСимволыКоды.Вставить(126, Символ(126));
	ДопустимыеСимволыКоды.Вставить(1025, Символ(1025));
	ДопустимыеСимволыКоды.Вставить(1105, Символ(1105));
	ДопустимыеСимволыКоды.Вставить(8470, Символ(8470));
	Для Сч = 1040 По 1103 Цикл
		ДопустимыеСимволыКоды.Вставить(Сч, Символ(Сч));
	КонецЦикла;   
	
	Возврат ДопустимыеСимволыКоды;
	
КонецФункции  

Функция ПроверитьДопустимыеСимволыВСтроке(СтрокаСимволов) Экспорт
	
	ДопустимыеСимволыКоды = ДопустимыеКодыСимволов();
	
	Ошибки = Новый Массив; 
	
	Для Инд = 1 По СтрДлина(СтрокаСимволов) Цикл
		ТекСимвол = Сред(СтрокаСимволов,Инд,1);
		ТекКод = КодСимвола(ТекСимвол);
		Если ДопустимыеСимволыКоды.Получить(ТекКод) = Неопределено Тогда 
			Ошибки.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 - й символ ""%2"" - ЗАПРЕЩЕН в обмене с ЕБП.'"), Инд, ТекСимвол));
		КонецЕсли 
	КонецЦикла;  
	
	Возврат Ошибки;
	
КонецФункции	

#КонецОбласти