#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
/////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция СоздатьОбъектОбработки(Знач Ссылка) Экспорт

	Если Ссылка = ПустаяСсылка() Тогда
		Возврат Неопределено;
		
	ИначеЕсли Ссылка.Предопределенный Тогда
		
		Возврат ПолучитьПредопределеннуюОбработкуПоСсылке(Ссылка).Создать();	

	Иначе 
		Попытка
			ПутьВременногоФайла = ПолучитьИмяВременногоФайла(".epf");
			ДвоичныеДанныеОбработки = Ссылка.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанныеОбработки.Записать(ПутьВременногоФайла);
			ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьВременногоФайла, Ложь);
			
			ВнешняяОбработка =  ПодключитьОбработкуЧерезПрослойку(ВнешняяОбработка, Ссылка.ВерсияAPI);
			
			Возврат ВнешняяОбработка; 
		Исключение
			ВызватьИсключение НСтр("ru = 'Обработка выгрузки устарела.'");
		КонецПопытки;	
		
	КонецЕсли;

КонецФункции // СоздатьОбъектОбработки()

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьПредопределеннуюОбработкуПоСсылке(Ссылка) Экспорт
	
	СоответствиеЭлементов = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиСерверПереопределяемый.ПолучитьСписокПредустановленныхОбработокФорматовВыгрузки();
	
	ИмяОбработки = СоответствиеЭлементов.Получить(Ссылка);
	
	Если ИмяОбработки = Неопределено Тогда 
		ВызватьИсключение НСтр("ru = 'Обработка выгрузки не реализована.'");
	КонецЕсли;	
	
	Возврат Обработки[ИмяОбработки];
	
КонецФункции	

Функция ПодключитьОбработкуЧерезПрослойку(Обработка, ВерсияAPI) Экспорт
	
	РедакцияAPI = ПолучитьРедакциюAPI(ВерсияAPI);
	
	Если РедакцияAPI = "1" Тогда 
		Прослойка = Обработки.ПрослойкаОбратнойСовместимостиФорматовВыгрузкиОтчетовV1.Создать();
		Прослойка.ОбработкаФормата = Обработка;
		Возврат ПодключитьОбработкуЧерезПрослойку(Прослойка, "2.0")
		
	ИначеЕсли РедакцияAPI = "2" Тогда 
		Прослойка = Обработки.ПрослойкаОбратнойСовместимостиФорматовВыгрузкиОтчетовV2.Создать();
		Прослойка.ОбработкаФормата = Обработка;
		Возврат ПодключитьОбработкуЧерезПрослойку(Прослойка, "3.0")
		
	ИначеЕсли РедакцияAPI = "3" Тогда 
		Возврат Обработка;
		
	Иначе 	
		ВызватьИсключение НСтр("ru = 'Неизвестная редакция API.'");
		
	КонецЕсли;	
	
	
КонецФункции

функция ПолучитьРедакциюAPI(ВерсияAPI) 
	
	МассивПодстрокВерсии = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВерсияAPI,".");
	
	Если МассивПодстрокВерсии.Количество() <> 2 Тогда 
		ВызватьИсключение НСтр("ru = 'Формат версии API не соответствует ожидаемому.'"); // номер версии АПИ это 2 числа типа "1.00"
	КонецЕсли;
	
	Возврат МассивПодстрокВерсии[0];
	
КонецФункции
	
Процедура ОбновитьНастройкиФорматов(ТекНастройка = Неопределено) Экспорт
	
	ОбновляемыеНастройки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ТекНастройка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФорматыВыгрузкиБухгалтерскойОтчетности.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности КАК ФорматыВыгрузкиБухгалтерскойОтчетности
			|ГДЕ
			|	ФорматыВыгрузкиБухгалтерскойОтчетности.Предопределенный = ИСТИНА";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ОбновляемыеНастройки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");	
	Иначе
		ОбновляемыеНастройки.Добавить(ТекНастройка);
	КонецЕсли;
	
	//для форматов
	ИменаПакетов = Новый Массив;
	ИменаПакетов.Добавить("http://v8.1c.ru/8.1/data/enterprise/current-config");
	
	Для Каждого Пакет Из ФабрикаXDTO.Пакеты Цикл
		ИменаПакетов.Добавить(Пакет.URIПространстваИмен);
	КонецЦикла;
	
	МодельКонфигурации = ФабрикаXDTO.ЭкспортМоделиXDTO(ИменаПакетов);
	
	МассивПакетовКонфигурации = Новый Массив;
	Для Каждого ТекПакет Из МодельКонфигурации.package Цикл
		МассивПакетовКонфигурации.Добавить(ТекПакет);
	КонецЦикла;
		
	СтруктураПараметровДляОбновленияФормата = Новый Структура();
	СтруктураПараметровДляОбновленияФормата.Вставить("мМассивПакетовКонфигурации",МассивПакетовКонфигурации);
	
	Для Каждого ОбновляемыйФормат Из ОбновляемыеНастройки Цикл 
		Попытка
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбновляемыйФормат,"Предопределенный") = Истина Тогда
				УстановитьПривилегированныйРежим(Истина);
				СохранитьОбработкуФормата(ОбновляемыйФормат,СтруктураПараметровДляОбновленияФормата);
				УстановитьПривилегированныйРежим(Ложь);
			Иначе
				СохранитьОбработкуФормата(ОбновляемыйФормат,СтруктураПараметровДляОбновленияФормата);
			КонецЕсли;			
			
		Исключение
			
			Шаблон = НСтр(
			"ru = 'Не удалось обновить настройки формата выгрузки ""%1"".
			|%2'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ОбновляемыйФормат,ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
		КонецПопытки;
		
	КонецЦикла;	
		
КонецПроцедуры

Процедура СохранитьОбработкуФормата(ОбновляемыйФормат,СтруктураПараметровДляОбновленияФормата)
	
	ПредыдущаяВерсия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбновляемыйФормат,"Версия");
	
	ОбновляемыйФорматОбъект = ОбновляемыйФормат.ПолучитьОбъект();
	ОбновляемыйФорматОбъект.СтруктураПараметровДляОбновленияФормата = СтруктураПараметровДляОбновленияФормата;
	
	ОбновляемыйФорматОбъект.ОбновитьОбработку();
	
	Если ОбновляемыйФорматОбъект.Версия <> ПредыдущаяВерсия Тогда	
		ОбновляемыйФорматОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНаименованияПредопределенных() Экспорт
	
	//ПереименоватьОбработкиВыгрузкиФК
	ФорматСсылка = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ФК_ГРБС_4_9;
	Если ФорматСсылка <> Неопределено Тогда
		ФорматОбъект = ФорматСсылка.ПолучитьОбъект();
		ФорматОбъект.Наименование = "Формат ФК для ГРБС (КУ)";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФорматОбъект);
	КонецЕсли;

	ФорматСсылка = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ФК_ФО_3_0_21;
	Если ФорматСсылка <> Неопределено Тогда
		ФорматОбъект = ФорматСсылка.ПолучитьОбъект();
		ФорматОбъект.Наименование = "Формат ФК для ФО и ГВБФ";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФорматОбъект);
	КонецЕсли;

	ФорматСсылка = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ФК_АУБУ_6_0;
	Если ФорматСсылка <> Неопределено Тогда
		ФорматОбъект = ФорматСсылка.ПолучитьОбъект();
		ФорматОбъект.Наименование = "Формат ФК для АУ и БУ";
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ФорматОбъект);
	КонецЕсли;
	
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбновитьНастройкиФорматов");
КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Представление = Данные.Наименование + ", " + Данные.Версия;
	СтандартнаяОбработка = Ложь
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Версия");
	СтандартнаяОбработка = Ложь;

КонецПроцедуры
