#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтавкаОплаты = Параметры.СтавкаОплаты;
	ПериодНачисленияНачало = Параметры.ПериодНачисленияНачало;
	ПериодНачисленияКонец = Параметры.ПериодНачисленияКонец;
	Льгота = Параметры.Льгота;
	ДнейПосещения = Параметры.ДнейПосещения;
	РабочихДней = Параметры.РабочихДней;
	
	Если Льгота.Пустая() Тогда
		
		Элементы.ДекорацияЛьгота.Видимость = Истина;
		Элементы.Льгота.Видимость = Ложь;
		
	КонецЕсли; 
	
	СтруктураДанных = РаботаСоСтудентамиПовтИсп.ПолучитьДанныеСтавки(СтавкаОплаты, ПериодНачисленияКонец);
	
	Если СтруктураДанных.ЭтоФиксированнаяСтавкаЗаПериод = Истина Тогда
		
		Элементы.ДнейПосещения.Видимость = Ложь;
		Элементы.РабочихДней.Видимость = Ложь;
		
		КоличествоДнейПериода = День(КонецМесяца(ПериодНачисленияКонец));
		КоличествоДнейРасчета = День(ПериодНачисленияКонец) - День(ПериодНачисленияНачало) + 1;
		
      ТекстФормулыРасчета = "(Ставка / Дней в месяце * Дней расчета) ";
		ТекстФормулыЧисла = "(" + Строка(СтруктураДанных.СуммаНачисления) 
				            + " / " + Строка(КоличествоДнейПериода) 
							   + " * " + Строка(КоличествоДнейРасчета)
								+ ")";
						 
		Если НЕ Льгота.Пустая() Тогда

			ТекстФормулыРасчета = ТекстФормулыРасчета + "* (100 - Процент льготы) / 100 ";
			ТекстФормулыЧисла = ТекстФормулыЧисла + " * (100 - " + Строка( ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Льгота, "ПроцентЛьготы")) + ") / 100";
			
		КонецЕсли; 						
		
		ТекстФормулыРасчета = ТекстФормулыРасчета + "= Результат"; 
		
		СуммаСтавки = РаботаСоСтудентамиКлиентСервер.ПолучитьЗначениеСтавки(СтавкаОплаты,,, ПериодНачисленияНачало, ПериодНачисленияКонец);
		КоэфЛьготы = РаботаСоСтудентамиПовтИсп.ПолучитьКоэффициентЛьготы(Льгота); 
		ТекстФормулыЧисла = ТекстФормулыЧисла + " = " + Строка(Формат(СуммаСтавки * КоэфЛьготы, "ЧЦ=15; ЧДЦ=2; ЧН=0"));
		
		Элементы.ДекорацияФормулаТекст.Заголовок = ТекстФормулыРасчета;
		Элементы.ДекорацияФормулаЧисла.Заголовок = ТекстФормулыЧисла;
		
	Иначе
		
		Элементы.КоличествоДнейПериода.Видимость = Ложь;
		Элементы.КоличествоДнейРасчета.Видимость = Ложь;
		
		ТекстФормулыРасчета = "(Фиксированная ставка за месяц + 
								    |Переменная ставка за месяц * Дней посещения / Количество рабочих дней + 
								    |Ставка за день * Дней посещения) ";									
									
		ТекстФормулыЧисла = "(" + СтруктураДанных.СуммаФиксированнаяСтавкаЗаМесяц + " + " 
		                        + СтруктураДанных.СуммаПеременнаяСтавкаЗаМесяц + " * " + Строка(Формат(ДнейПосещения, "ЧН=0")) + " / " + Строка(Формат(РабочихДней, "ЧН=0")) + " + "
						            + СтруктураДанных.СуммаСтавкаЗаДень + " * " + Строка(Формат(ДнейПосещения, "ЧН=0")) + ")";
		
		Если НЕ Льгота.Пустая() Тогда

			ТекстФормулыРасчета = ТекстФормулыРасчета + "* (100 - Процент льготы) / 100 ";
			ТекстФормулыЧисла = ТекстФормулыЧисла + " * (100 - " + Строка( ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Льгота, "ПроцентЛьготы")) + ") / 100";
			
		КонецЕсли;
		
		ТекстФормулыРасчета = ТекстФормулыРасчета + "= Результат"; 
		
		СуммаСтавки = РаботаСоСтудентамиКлиентСервер.ПолучитьЗначениеСтавки(СтавкаОплаты, РабочихДней, ДнейПосещения, ПериодНачисленияНачало, ПериодНачисленияКонец);
		КоэфЛьготы = РаботаСоСтудентамиПовтИсп.ПолучитьКоэффициентЛьготы(Льгота); 
		ТекстФормулыЧисла = ТекстФормулыЧисла + " = " + Строка(Формат(СуммаСтавки * КоэфЛьготы, "ЧЦ=15; ЧДЦ=2; ЧН=0"));
		
		Элементы.ДекорацияФормулаТекст.Заголовок = ТекстФормулыРасчета;
		Элементы.ДекорацияФормулаЧисла.Заголовок = ТекстФормулыЧисла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
