
#Область ОписаниеПеременных

// Имя таблицы СведенияПрослеживаемости или СведенияПрослеживаемостиФактические
&НаКлиенте
Перем ИмяТаблицыПрослеживаемости; // Строка

// Имя колонки для обновления текста РНПТ
&НаКлиенте
Перем ИмяКолонкиРНПТ; // Строка

// Имя таблицы, по которой выполняется выбор РНПТ
&НаКлиенте
Перем ИмяТаблицыДляПодбораРНПТ; // Строка

// Признак, что в подборе документов был добавлен документ
&НаКлиенте
Перем ЕстьДобавленыйДокумент; // Булево

&НаКлиенте
Перем ВыбранныйВидПоставки; // ПеречислениеСсылка.ВидыПоставкиТоваровРаботУслуг

&НаКлиенте
Перем ПолученоПодтверждениеПроведенияПриПроведении; // Булево

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части

	ВидимостьЭлементовЭДО = ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	УстановитьВидимостьЭлементовЭДО(ЭтотОбъект);

	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	УстановитьВидимостьЭлементовЭДОПослеИнициализацииЭлементовБЭД(ЭтотОбъект, ВидимостьЭлементовЭДО);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();
	ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияИС
	ИнтеграцияИС.ПриСозданииНаСервереВФормеДокументаОснования(ЭтотОбъект, Объект,
		ИнтеграцияИС.ПараметрыИнтеграцииВФорме("ВетИС",ИнтеграцияИС.ИмяЭлементаДляРазмещения()));
	// Конец ИнтеграцияИС
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом  
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ЕстьНеДобавленныеДокументыПоставки =
		Не РегистрыСведений.НезарегистрированныеПоступленияНФАПоАктамПриемкиТРУ.ВсеДокументыПоставкиДобавленыВАкт(
			Объект.Ссылка);
	ДокументыПоступленияПриОткрытии.ЗагрузитьЗначения(
		Объект.ДокументыПоступления.Выгрузить(, "ДокументОснование").ВыгрузитьКолонку("ДокументОснование"));
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ЕстьНеДобавленныеДокументыПоставки Тогда
		Отказ = Истина;
		
		ТекстВопроса = НСтр("ru = 'В документ добавлены не все документы поставки, введенные на основании.
			|Добавить документы поставки перед проведением?'");
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаОДобавленииДокументовПоставки", ЭтотОбъект);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да);
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки, , КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ПолученоПодтверждениеПроведенияПриПроведении = Неопределено
			И ПроверитьПроведениеОснований() Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'В документе присутствуют не проведенные документы поставки.
			|Провести документы поставки одновременно с ""Актом приемки товаров, работ, услуг""?'");
		Оповещение = Новый ОписаниеОповещения("ПослеОтветаОПроведенииДокументовПоставки", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Возврат;			
	КонецЕсли;
	
	ПроводитьДокументыПоступленияПриПроведенииАктаПриемкиТРУ =
		(ПолученоПодтверждениеПроведенияПриПроведении = Истина);
	ПолученоПодтверждениеПроведенияПриПроведении = Неопределено;
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаОПроведенииДокументовПоставки(Ответ, ДополнительныеПараметры) Экспорт
	ПолученоПодтверждениеПроведенияПриПроведении = (Ответ = КодВозвратаДиалога.Да);
	ПровестиПослеОбновленияФормы();	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПроведениеОснований()
	Если Объект.ВидПоставки <> ПредопределенноеЗначение("Перечисление.ВидыПоставкиТоваровРаботУслуг.ПрочаяПоставка")
			Или Объект.ДокументыПоступления.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЕстьНепроведенные = ЕстьНепроведенныеДокументыПоставки();
	Возврат ЕстьНепроведенные;
КонецФункции

&НаСервере
Функция ЕстьНепроведенныеДокументыПоставки()
	НепроведенныеДокументы = Документы.АктПриемкиТоваровРаботУслуг.НайтиНепроведенныеДокументыПоставки(Объект.ДокументыПоступления.Выгрузить());
	Возврат НепроведенныеДокументы.Количество() > 0;
КонецФункции

&НаКлиенте
Процедура ПослеОтветаОДобавленииДокументовПоставки(Ответ, ДополнительныеПараметры) Экспорт	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбновитьТаблицуДокументыПоступленияНаКлиенте();
		ПодключитьОбработчикОжидания("ПровестиПослеОбновленияФормы", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПослеОбновленияФормы()
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ПодготовитьФормуНаСервере();

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".    
	
	УстановитьВидимостьЭлементовЭДОПослеИнициализацииЭлементовБЭД(ЭтотОбъект, ВидимостьЭлементовЭДО);
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
		ЭтотОбъект.ОбновитьОтображениеДанных();	
	КонецЕсли;
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	// ИнтеграцияИС
	ИнтеграцияИСКлиент.ОбработкаОповещенияВФормеДокументаОснования(
		ЭтотОбъект,
		Объект,
		ИмяСобытия,
		Параметр,
		Источник);
	// Конец ИнтеграцияИС
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
	Если ИмяСобытия = "Запись_ПоступлениеНФАПоАктуПриемкиТРУ"
			И Параметр = Объект.Ссылка Тогда
		Если Объект.ДокументыПоступления.НайтиСтроки(Новый Структура("ДокументОснование", Источник)).Количество() = 0 Тогда
			Если Не Модифицированность Тогда
				Попытка
					ЗаблокироватьДанныеФормыДляРедактирования();
				Исключение
					ЕстьНеДобавленныеДокументыПоставки = Истина;
					УстановитьВидимостьЭлементов(ЭтотОбъект);
				КонецПопытки;
			КонецЕсли;
			Модифицированность = Истина;
			Объект.ДокументыПоступления.Добавить().ДокументОснование = Источник;
			ПоказатьОповещениеПользователя(
				НСтр("ru = 'Добавлен новый документ поставки'"),
				ПолучитьНавигационнуюСсылку(Источник),
				Источник,
				БиблиотекаКартинок.Информация32,
				СтатусОповещенияПользователя.Информация);		КонецЕсли;		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПроводитьДокументыПоступленияПриПроведенииАктаПриемкиТРУ",
		ПроводитьДокументыПоступленияПриПроведенииАктаПриемкиТРУ);
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);

	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтотОбъект);
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	НовыеЗначения = Новый Массив;
	Для Каждого СтрокаПоступления Из Объект.ДокументыПоступления Цикл
		Если ДокументыПоступленияПриОткрытии.НайтиПоЗначению(СтрокаПоступления.ДокументОснование) = Неопределено Тогда
			Оповестить("ЗаписьАктаПриемкиТРУ", СтрокаПоступления.ДокументОснование, Объект.Ссылка);
		КонецЕсли;
		НовыеЗначения.Добавить(СтрокаПоступления.ДокументОснование);
	КонецЦикла;
	ДокументыПоступленияПриОткрытии.ЗагрузитьЗначения(НовыеЗначения);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ПроводитьДокументыПоступленияПриПроведенииАктаПриемкиТРУ Тогда
		ОбработанныеТипы = Новый Массив;
		Для Каждого СтрокаПоступления Из Объект.ДокументыПоступления Цикл
			Если ОбработанныеТипы.Найти(ТипЗнч(СтрокаПоступления.ДокументОснование)) = Неопределено Тогда
				ОповеститьОбИзменении(ТипЗнч(СтрокаПоступления.ДокументОснование));
				ОбработанныеТипы.Добавить(ТипЗнч(СтрокаПоступления.ДокументОснование));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТ" Тогда
		ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.АктПриемкиТоваровРаботУслуг.Форма.ФормаВыбораДокументовПоставки" Тогда
		ОбработкаВыбораДокументовПоступления(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// Проверить правильность заполнения отклонений
	Для Каждого Строка Из Объект.ТоварыРаботыУслуги Цикл
		ОбработкаПроверкиЗаполненияКоличествоОтклонениеПоОбъему(Строка, Отказ);
		ОбработкаПроверкиЗаполненияСтранаПроисхожденияПринято(Строка, Отказ);
		ОбработкаПроверкиЗаполненияКоличествоОтклонение(Строка, Отказ);
		ОбработкаПроверкиЗаполненияКоличествоНесоответствующие(Строка, Отказ);
		ОбработкаПроверкаЗаполненияЕстьРасхождение(Строка, Отказ);
	КонецЦикла;

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтотОбъект, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтотОбъект, Команда);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	УстановитьРуководителя(); 
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидПоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидПоставки)
		Или ВыбранноеЗначение = Объект.ВидПоставки
		Или Объект.ДокументыПоступления.Количество() = 0 Тогда
		
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВыбранныйВидПоставки = ВыбранноеЗначение;
	
	ТекстВопроса = НСтр("ru = 'При изменении вида поставки таблицы документа будут очищены.
		|Изменить вид поставки?'");
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Очистить таблицы и изменить вид поставки'"));
	Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	ОбработчикОтвета = Новый ОписаниеОповещения("ПослеОтветаОбИзмененииВидаПоставки", ЭтотОбъект);
	ПоказатьВопрос(ОбработчикОтвета, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПоставкиПриИзменении(Элемент)
	ВидПоставкиПриИзмененииНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(Объект.Грузоотправитель) Тогда
		Объект.Грузоотправитель = Объект.Контрагент;
	КонецЕсли;
	
	ВидимостьЭлементовЭДО = ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	Если Параметры.Ключ.Пустая() И ВидимостьЭлементовЭДО Тогда
		Объект.ЭтоЭлектронныйДокумент = Истина;
	КонецЕсли;
	УстановитьВидимостьЭлементовЭДО(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьОплатуПриИзменении(Элемент)
	
	Если Объект.ЗапланироватьОплату Тогда
		Объект.ОплатитьДо = ПредельнаяДатаОплатыЗадолженности(Объект.Дата, Объект.Договор);
	Иначе
		Объект.ОплатитьДо = Неопределено;
	КонецЕсли;
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансаПриИзменении(Элемент)
	Объект.ЗачетАвансов.Очистить();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РешениеОСозданииКомиссииНеПринятоПриИзменении(Элемент)
	Если Объект.РешениеОСозданииКомиссииНеПринято И ЗначениеЗаполнено(Объект.Комиссия) Тогда
		СпроситьПроОчисткуКомиссииИОчистить();
	Иначе
		УстановитьВидимостьЭлементов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания,
		СтандартнаяОбработка);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаФИОНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ФИОКонтактногоЛицаНачалоВыбора(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаФИОАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗаполнитьДанныеВыбораПоляВводаЕслиЭтоСотрудник(Текст, ДанныеВыбора, Объект.ПредставительЗаказчикаФИО, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаФИООбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ОбработкаВыбораЕслиЭтоСотрудник(ВыбранноеЗначение, Объект.ПредставительЗаказчикаФИО, Объект.ПредставительЗаказчикаДолжность, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РуководительЗаказчикаФИОНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ФИОКонтактногоЛицаНачалоВыбора(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РуководительЗаказчикаФИОАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗаполнитьДанныеВыбораПоляВводаЕслиЭтоСотрудник(Текст, ДанныеВыбора, Объект.РуководительЗаказчикаФИО, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РуководительЗаказчикаФИООбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	ОбработкаВыбораЕслиЭтоСотрудник(ВыбранноеЗначение, Объект.РуководительЗаказчикаФИО, Объект.РуководительЗаказчикаДолжность, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаДолжностьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.Должности.ФормаВыбора", , Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаДолжностьАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗаполнитьДанныеВыбораПоляВводаДолжность(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РуководительЗаказчикаДолжностьНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.Должности.ФормаВыбора", , Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РуководительЗаказчикаДолжностьАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ЗаполнитьДанныеВыбораПоляВводаДолжность(Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПредставительПоставщикаФИОНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ФИОКонтактногоЛицаНачалоВыбора(Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПредставительЗаказчикаФИОПриИзменении(Элемент)
	УстановитьПараметрыВыбораОтветственногоЛица(Элемент);
	ЗаполнитьДолжностьОтветственногоЛица(Элемент.Имя);
	УстановитьСвойстваЭлементовОтветственныхЛицКонтрагентов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РуководительЗаказчикаФИОПриИзменении(Элемент)
	УстановитьПараметрыВыбораОтветственногоЛица(Элемент);
	ЗаполнитьДолжностьОтветственногоЛица(Элемент.Имя);
	УстановитьСвойстваЭлементовОтветственныхЛицКонтрагентов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПредставительПоставщикаФИОПриИзменении(Элемент)
	УстановитьПараметрыВыбораОтветственногоЛица(Элемент);
	ЗаполнитьДолжностьОтветственногоЛица(Элемент.Имя);
	УстановитьСвойстваЭлементовОтветственныхЛицКонтрагентов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура ДекорацияПредупреждениеОНеобходимостиОбновленияДокументаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОбновитьТаблицуДокументыПоступления" Тогда
		СтандартнаяОбработка = Ложь;
		ОбновитьТаблицуДокументыПоступленияНаКлиенте();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыПоступления

&НаКлиенте
Процедура ДокументыПоступленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	НачатьПодборДокументовПоступления();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТранспортировкаИПриемка

&НаКлиенте
Процедура ТранспортировкаИПриемкаОтправкаВремяПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	ТекущиеДанные.ОтправкаГруза = ТекущиеДанные.ОтправкаГруза - Секунда(ТекущиеДанные.ОтправкаГруза);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаПрибытиеНаМестоВремяПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	ТекущиеДанные.ПрибытиеНаМесто = ТекущиеДанные.ПрибытиеНаМесто - Секунда(ТекущиеДанные.ПрибытиеНаМесто);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаВыдачаГрузаВремяПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	ТекущиеДанные.ВыдачаГруза = ТекущиеДанные.ВыдачаГруза - Секунда(ТекущиеДанные.ВыдачаГруза);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаВскрытиеВагонаВремяПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	ТекущиеДанные.ВскрытиеВагона = ТекущиеДанные.ВскрытиеВагона - Секунда(ТекущиеДанные.ВскрытиеВагона);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаДоставкаНаСкладПолучателяВремяПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	ТекущиеДанные.ДоставкаНаСкладПолучателя =
		ТекущиеДанные.ДоставкаНаСкладПолучателя - Секунда(ТекущиеДанные.ДоставкаНаСкладПолучателя);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаВремяПриемкиНачалоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	ТекущиеДанные.ВремяПриемкиНачало = ТекущиеДанные.ВремяПриемкиНачало - Секунда(ТекущиеДанные.ВремяПриемкиНачало);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаВремяПриемкиОкончаниеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	ТекущиеДанные.ВремяПриемкиОкончание =
		ТекущиеДанные.ВремяПриемкиОкончание - Секунда(ТекущиеДанные.ВремяПриемкиОкончание);
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаМестоСоставленияАктаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	НачатьУстановкуАдресаМестоСоставленияАкта();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортировкаИПриемкаМестоСоставленияАктаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортировкаИПриемка.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ТекущиеДанные.МестоСоставленияАкта) Тогда
		ТекущиеДанные.МестоСоставленияАктаВоВнутреннемФормате = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСведенияОбУпаковке

&НаКлиенте
Процедура СведенияОбУпаковкеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ЗаполнитьСоставУпаковкиНаСервере(ВыбранноеЗначение);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбУпаковкеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.СведенияОбУпаковке.ТекущиеДанные;
		ТекущиеДанные.СоставУпаковки = ПредставлениеТоваровВУпаковкеНеВыбраны();
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбУпаковкеПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.СведенияОбУпаковке.ТекущийЭлемент.Имя = "СведенияОбУпаковкеСоставУпаковки" Тогда
		Отказ = Истина;
		ОткрытьФормуРедактированияСоставаУпаковки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СведенияОбУпаковкеСоставУпаковкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуРедактированияСоставаУпаковки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТоварыРаботыУслуги

&НаКлиенте
Процедура ТоварыРаботыУслугиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
		ЗаполнитьЗаголовкиВСтроке(ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура)
			И (ТипЗнч(ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
			Или ТипЗнч(ТекущиеДанные.Номенклатура) = Тип("СправочникСсылка.ДенежныеДокументы")) Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеНоменклатуры(ТекущиеДанные.Номенклатура)); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	РасчитатьСтроку(ТекущиеДанные, "Количество");
	ПересчитатьПринятоеКоличество(ТекущиеДанные, "Количество", ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиЦенаПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиСуммаПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиСтавкаНДСПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, "СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиСуммаНДСПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиВсегоПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.ТоварыРаботыУслуги.ТекущиеДанные, "Всего");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиКоличествоПринятоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	ПересчитатьПринятоеКоличество(ТекущиеДанные, "КоличествоПринято", ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиКоличествоПринятоНеСоответствующиеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	ПересчитатьПринятоеКоличество(ТекущиеДанные, "КоличествоПринятоНеСоответствующие", ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиКоличествоОтклонениеПоОбъемуПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	ПересчитатьПринятоеКоличество(ТекущиеДанные, "КоличествоОтклонениеПоОбъему", ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьПодборРНПТ("ТоварыРаботыУслуги", "СведенияПрослеживаемости", "РНПТ");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиРНПТОчистка(Элемент, СтандартнаяОбработка)
	РНПТОчисткаНаСервере(Элементы.Расхождения.ТекущиеДанные.ПолучитьИдентификатор(),
		"РНПТ",
		"СведенияПрослеживаемости");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРаботыУслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РНПТВыбор("ТоварыРаботыУслуги", Поле, "РНПТ", "СведенияПрослеживаемости", СтандартнаяОбработка)
КонецПроцедуры


&НаКлиенте
Процедура ТоварыРаботыУслугиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Элементы.ТоварыРаботыУслугиНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасхождения

&НаКлиенте
Процедура РасхожденияРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьПодборРНПТ("Расхождения", "СведенияПрослеживаемостиФактические", "РНПТФактические");

КонецПроцедуры

&НаКлиенте
Процедура РасхожденияПриИзменении(Элемент)
	УстановитьЗначениеЕстьРасхождения(Элементы.Расхождения.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияРНПТОчистка(Элемент, СтандартнаяОбработка)
	РНПТОчисткаНаСервере(Элементы.Расхождения.ТекущиеДанные.ПолучитьИдентификатор(),
		"РНПТФактические",
		"СведенияПрослеживаемостиФактические");
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	РНПТВыбор("Расхождения", Поле, "РНПТФактические", "СведенияПрослеживаемостиФактические", СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
		ЗаполнитьЗаголовкиВСтроке(Элементы.Расхождения.ТекущиеДанные);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияКоличествоНедостачаПриИзменении(Элемент)
	РассчитатьСуммыОтклонений(Элементы.Расхождения.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияКоличествоИзлишкиПриИзменении(Элемент)
	РассчитатьСуммыОтклонений(Элементы.Расхождения.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияКоличествоБракПриИзменении(Элемент)
	РассчитатьСуммыОтклонений(Элементы.Расхождения.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияКоличествоОтклонениеПриИзменении(Элемент)
	РассчитатьСуммыОтклонений(Элементы.Расхождения.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовТаблицыФормыСоставКомиссии

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора",, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьДокументы(Команда)
	НачатьПодборДокументовПоступления(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументамПоступления(Команда)
	ЗаполнитьПоДокументамПоступленияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСоставУпаковки(Команда)
	ОткрытьФормуРедактированияСоставаУпаковки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	ЗаполнитьАвансыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДО(Команда)
	ЗаполнитьДОНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено,
		СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура РедактироватьСМР(Команда)
	ПараметрыОткрытия = Новый Структура("АдресРезультата", СохранитьДанныеСМР());
	ОткрытьФорму("Документ.АктПриемкиТоваровРаботУслуг.Форма.СтроительноМонтажныеРаботы", ПараметрыОткрытия,
		ЭтотОбъект, , , , Новый ОписаниеОповещения("ПослеРедактированияСМР", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура УстановитьАдресМестоСоставленияАкта(Команда)
	НачатьУстановкуАдресаМестоСоставленияАкта();
КонецПроцедуры

&НаКлиенте
Процедура РасчетыЗаполнитьРеквизиты(Команда)
	
	ДополнительныеПараметры = Новый Структура("ИмяТЧ, ИдентификаторыСтрок",
		"ТоварыРаботыУслуги", ОбщегоНазначенияКлиент.СкопироватьРекурсивно(Элементы.Расчеты.ВыделенныеСтроки));
	ПриЗавершенииВыбора = Новый ОписаниеОповещения("ПриЗавершенииВыбораЗначенийЗаполнения",
		ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ИмяМенеджера", "Документы.АктПриемкиТоваровРаботУслуг");
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("ИФО", Объект.ИФО);
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ОткрытьФорму("Документ.АктПриемкиТоваровРаботУслуг.Форма.ГрупповоеИзменениеРеквизитовТабличнойЧасти",
		ПараметрыЗаполнения, ЭтотОбъект, , , , ПриЗавершенииВыбора);
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура ДобавитьДД(Команда)
	ДобавитьСтрокуТРУСУстановленнымТипом("СправочникСсылка.ДенежныеДокументы");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМЗ(Команда)
	ДобавитьСтрокуТРУСУстановленнымТипом("СправочникСсылка.Номенклатура");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОС(Команда)
	ДобавитьСтрокуТРУСУстановленнымТипом("СправочникСсылка.ОсновныеСредства");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьСтрокуТРУСУстановленнымТипом(ИмяТипа)
	Элементы.ТоварыРаботыУслуги.ДобавитьСтроку();
	НоваяСтрока = Элементы.ТоварыРаботыУслуги.ТекущиеДанные;
	Если НоваяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элементы.ТоварыРаботыУслугиНоменклатура.ОграничениеТипа = Новый ОписаниеТипов(ИмяТипа);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуДокументыПоступленияНаКлиенте()
	ОбновитьТаблицуДокументыПоступленияНаСервере();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуДокументыПоступленияНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ПоступлениеНФА КАК ПоступлениеНФА
	|ИЗ
	|	РегистрСведений.НезарегистрированныеПоступленияНФАПоАктамПриемкиТРУ КАК Т
	|ГДЕ
	|	Т.АктПриемкиТРУ = &АктПриемкиТРУ
	|	И Т.ПоступлениеНФА НЕ В (&ПоступлениеНФА)";
	Запрос.УстановитьПараметр("АктПриемкиТРУ", Объект.Ссылка);
	Запрос.УстановитьПараметр("ПоступлениеНФА",
		Объект.ДокументыПоступления.Выгрузить().ВыгрузитьКолонку("ДокументОснование"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ДокументыПоступления.Добавить();
		НоваяСтрока.ДокументОснование = Выборка.ПоступлениеНФА;
	КонецЦикла;
	Модифицированность = Истина;
	ЕстьНеДобавленныеДокументыПоставки = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗавершенииВыбораЗначенийЗаполнения(РезультатЗаполнения, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗаполнения) = Тип("Структура") Тогда
		ОбрабатываемаяТЧ = Объект[ДополнительныеПараметры.ИмяТЧ];
		Для Каждого ИдентификаторСтроки Из ДополнительныеПараметры.ИдентификаторыСтрок Цикл
			ТекущиеДанные = ОбрабатываемаяТЧ.НайтиПоИдентификатору(ИдентификаторСтроки);
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, РезультатЗаполнения);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачатьУстановкуАдресаМестоСоставленияАкта()
	ВыбранныйАдрес = "";
	ВыбранныйАдресВоВнутреннемФормате = "";
	ОбрабатываемыеСтроки = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(
		Элементы.ТранспортировкаИПриемка.ВыделенныеСтроки);
	Для Каждого ИдентификаторСтроки Из ОбрабатываемыеСтроки Цикл
		ДанныеСтроки = Элементы.ТранспортировкаИПриемка.ДанныеСтроки(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(ДанныеСтроки.МестоСоставленияАкта) Тогда
			ВыбранныйАдрес = ДанныеСтроки.МестоСоставленияАкта;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДанныеСтроки.МестоСоставленияАктаВоВнутреннемФормате) Тогда
			ВыбранныйАдресВоВнутреннемФормате = ДанныеСтроки.МестоСоставленияАктаВоВнутреннемФормате;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ДополнительныеПараметры = Новый Структура("ОбрабатываемыеСтроки", ОбрабатываемыеСтроки);
	ОповещениеОВыбореАдреса = Новый ОписаниеОповещения("ПриОповещенииОВыбореАдреса", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыВыбораАдреса = Новый Структура;
	ПараметрыВыбораАдреса.Вставить("ОткрытаПоСценарию", Ложь);
	ПараметрыВыбораАдреса.Вставить("Заголовок", НСтр("ru = 'Место составления акта'"));
	Если ЗначениеЗаполнено(ВыбранныйАдресВоВнутреннемФормате) Тогда
		ПараметрыВыбораАдреса.Вставить("ЗначенияПолей", ВыбранныйАдресВоВнутреннемФормате);
	ИначеЕсли ЗначениеЗаполнено(ВыбранныйАдрес) Тогда
		ПараметрыВыбораАдреса.Вставить("Представление", ВыбранныйАдрес);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.РасширенныйВводКонтактнойИнформации.Форма.ВводАдреса", ПараметрыВыбораАдреса, ЭтотОбъект, , , , ОповещениеОВыбореАдреса);

КонецПроцедуры

&НаКлиенте
Процедура ПриОповещенииОВыбореАдреса(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбрабатываемыеСтроки = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеПараметры, "ОбрабатываемыеСтроки");
	Если ОбрабатываемыеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ИдентификаторСтроки Из ОбрабатываемыеСтроки Цикл
		ТекущиеДанные = Объект.ТранспортировкаИПриемка.НайтиПоИдентификатору(ИдентификаторСтроки);	
		ТекущиеДанные.МестоСоставленияАкта = ВыбранноеЗначение.Представление;
		ТекущиеДанные.МестоСоставленияАктаВоВнутреннемФормате = ВыбранноеЗначение.Значение;
	КонецЦикла;
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСвязиПараметровВыбораОтветственногоЛица(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Массив")
			И ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			И ДополнительныеПараметры.Свойство("ИмяЭлемента") Тогда
		ИзменитьСвязиПараметровВыбораОтветственногоЛицаНаСервере(ДополнительныеПараметры.ИмяЭлемента, Результат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьСвязиПараметровВыбораОтветственногоЛицаНаСервере(Знач ИмяЭлемента, Знач НовыеСвязиПараметровВыбора)
	УправлениеНФА.УстановитьСвязиПараметровВыбораЭлементаОтветственногоЛица(Элементы[ИмяЭлемента],
		НовыеСвязиПараметровВыбора);
КонецПроцедуры

&НаКлиенте
Асинх Процедура СпроситьПроОчисткуКомиссииИОчистить()
	
	ТекстВопроса = НСтр("ru = 'Если решение о создании комиссии не принято, то нужно очистить комиссию в документе.
		|Очистить комиссию?'");
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да, очистить комиссию'"));
	Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Не очищать комиссию'"));
	Ответ = Ждать ВопросАсинх(ТекстВопроса, Кнопки, , КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Объект.РешениеОСозданииКомиссииНеПринято = Ложь;
		Возврат;
	КонецЕсли;
	
	Объект.Комиссия = ПредопределенноеЗначение("Справочник.ПостоянноДействующиеКомиссии.ПустаяСсылка");
	Объект.СоставКомиссии.Очистить();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораПоляВводаЕслиЭтоСотрудник(Текст, ДанныеВыбора, ФИО, СтандартнаяОбработка)
	Если ТипЗнч(ФИО) = Тип("Строка") Тогда
		ЗаполнитьДанныеВыбораПоляВводаСотрудника(Текст, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЕслиЭтоСотрудник(ВыбранноеЗначение, ФИО, Должность, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		ОбработкаВыбораСотрудника(ВыбранноеЗначение, ФИО, Должность, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФИОКонтактногоЛицаНачалоВыбора(Элемент, СтандартнаяОбработка)
	ПараметрыДляВыбора = УправлениеНФАКлиент.ПараметрыВыбораФИОКонтактногоЛицаАктПриемкиТРУ(ЭтотОбъект);
	ПараметрыДляВыбора.ДопустимыеТипы = ДопустимыеТипыЭлементаФормы(Элемент);
	ПараметрыДляВыбора.РеквизитКонтрагент = УправлениеНФАКлиентСервер.ИмяЭлементаВладелецОтветственногоЛица(
		Элемент.Имя);
	Если ПараметрыДляВыбора.РеквизитКонтрагент <> "" Тогда
		ПараметрыДляВыбора.Контрагент = Объект[ПараметрыДляВыбора.РеквизитКонтрагент];
	КонецЕсли;
	ПараметрыДляВыбора.ИзменениеСвязиПараметровВыбора =
		Новый ОписаниеОповещения("ИзменитьСвязиПараметровВыбораОтветственногоЛица",
			ЭтотОбъект, Новый Структура("ИмяЭлемента", Элемент.Имя));
	УправлениеНФАКлиент.НачатьВыборФИОКонтактногоЛицаАктПриемкиТРУ(Элемент, ПараметрыДляВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Функция ДопустимыеТипыЭлементаФормы(Элемент)
	ТипыДанных = Новый СписокЗначений;
	Если Элемент = Элементы.ПредставительЗаказчикаФИО
			Или Элемент = Элементы.РуководительЗаказчикаФИО Тогда
		ТипыДанных.Добавить(Тип("Строка"), НСтр("ru = 'Ввести вручную'"));
		Если Не ЗначениеЗаполнено(Объект.Заказчик) Или Объект.Заказчик = КонтрагентПоОрганизации Тогда
			ТипыДанных.Добавить(Тип("СправочникСсылка.Сотрудники"), НСтр("ru = 'Выбрать сотрудника'"));
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Заказчик) Тогда
			ТипыДанных.Добавить(Тип("СправочникСсылка.ОтветственныеЛицаКонтрагентов"),
				НСтр("ru = 'Выбрать ответственное лицо'"));
		КонецЕсли;
	ИначеЕсли Элемент = Элементы.ПредставительПоставщикаФИО Тогда
		ТипыДанных.Добавить(Тип("Строка"), НСтр("ru = 'Ввести вручную'"));
		ТипыДанных.Добавить(Тип("СправочникСсылка.ОтветственныеЛицаКонтрагентов"),
			НСтр("ru = 'Выбрать ответственное лицо'"));
	КонецЕсли;
	Возврат ТипыДанных;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораСотрудника(ВыбранноеЗначение, ФИО, Должность, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники")
			И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеСотрудника = ДанныеСотрудника(ВыбранноеЗначение, Объект.Дата);
		ФИО = ДанныеСотрудника.НаименованиеПолное;
		Если ЗначениеЗаполнено(ДанныеСотрудника.Должность) Тогда
			Должность = ДанныеСотрудника.Должность;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыВыбораОтветственногоЛица(Элемент)
	ПараметрыДляФормыВыбора = УправлениеНФАКлиент.ПараметрыУстановкиСвойстваПараметрыВыбораОтветственногоЛица();
	ПараметрыДляФормыВыбора.ЗначениеРеквизита = Объект[Элемент.Имя];
	ПараметрыДляФормыВыбора.РеквизитКонтрагент = УправлениеНФАКлиентСервер.ИмяЭлементаВладелецОтветственногоЛица(
		Элемент.Имя);
	ПараметрыДляФормыВыбора.РодительскийРеквизит = "Объект";
	ПараметрыДляФормыВыбора.Организация = "Организация";
	ПараметрыДляФормыВыбора.ИзменениеСвязиПараметровВыбора =
		Новый ОписаниеОповещения("ИзменитьСвязиПараметровВыбораОтветственногоЛица",
			ЭтотОбъект, Новый Структура("ИмяЭлемента", Элемент.Имя));
	УправлениеНФАКлиент.УстановитьПараметрыВыбораВСвойстваЭлементаОтветственногоЛица(Элемент, ПараметрыДляФормыВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДолжностьОтветственногоЛица(ИмяРеквизитаФИО)
	ОтветственноеЛицо = Объект[ИмяРеквизитаФИО];
	Если ЗначениеЗаполнено(ОтветственноеЛицо)
			И ТипЗнч(ОтветственноеЛицо) = Тип("СправочникСсылка.ОтветственныеЛицаКонтрагентов") Тогда
		ИмяРеквизитаДолжность = ИмяРеквизитаДолжность(ИмяРеквизитаФИО);
		Если ЗначениеЗаполнено(ИмяРеквизитаДолжность) Тогда
			Объект[ИмяРеквизитаДолжность] = ДолжностьОтветственногоЛица(ОтветственноеЛицо);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДолжностьОтветственногоЛица(ОтветственноеЛицо)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтветственноеЛицо, "Должность");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизитаДолжность(ИмяРеквизитаФИО)
	Если СтрЗаканчиваетсяНа(ИмяРеквизитаФИО, "ФИО") Тогда
		Возврат Лев(ИмяРеквизитаФИО, СтрДлина(ИмяРеквизитаФИО) - 3) + "Должность";
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Процедура ЗаполнитьДолжностиОтветственныхЛиц()
	ИменаРеквизитов = УправлениеНФАКлиентСервер.ИменаРеквизитовОтветственныхЛицКонтрагентовАктПриемкиТРУ();
	СсылкиОтветственныхЛиц = Новый Массив; // Массив из СправочникСсылка.ОтветственныеЛицаКонтрагентов
	ТипОтветственныеЛица = Тип("СправочникСсылка.ОтветственныеЛицаКонтрагентов");
	Для Каждого КлючИЗначение Из ИменаРеквизитов Цикл
		ПроверяемоеЗначение = Объект[КлючИЗначение.Ключ]; 
		Если ЗначениеЗаполнено(ПроверяемоеЗначение) И ТипЗнч(ПроверяемоеЗначение) = ТипОтветственныеЛица Тогда
			СсылкиОтветственныхЛиц.Добавить(ПроверяемоеЗначение);
		КонецЕсли;
	КонецЦикла;
	Если СсылкиОтветственныхЛиц.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОтветственныхЛиц = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(СсылкиОтветственныхЛиц, "Должность");
	Для Каждого КлючИЗначение Из ИменаРеквизитов Цикл
		ПрочитанноеЗначение = ДанныеОтветственныхЛиц.Получить(Объект[КлючИЗначение.Ключ]); 
		Если ПрочитанноеЗначение <> Неопределено Тогда
			Объект[КлючИЗначение.Значение] = ПрочитанноеЗначение.Должность;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораПоляВводаДолжность(Текст, ДанныеВыбора, СтандартнаяОбработка)
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ПараметрыВыбораДолжности = Новый Структура;
	ПараметрыВыбораДолжности.Вставить("СтрокаПоиска", Текст);
	ПараметрыВыбораДолжности.Вставить("СпособПоискаСтроки", СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть);
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Должности"), ПараметрыВыбораДолжности);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВыбораПоляВводаСотрудника(Текст, ДанныеВыбора, СтандартнаяОбработка)
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыВыбораСотрудника = Новый Структура;
	ПараметрыВыбораСотрудника.Вставить("Отбор", Новый Структура);
	ПараметрыВыбораСотрудника.Вставить("СтрокаПоиска", Текст);
	ПараметрыВыбораСотрудника.Отбор.Вставить("Владелец", Объект.Организация);
	ДанныеВыбора = ПолучитьДанныеВыбора(Тип("СправочникСсылка.Сотрудники"), ПараметрыВыбораСотрудника);
	Если ДанныеВыбора.Количество() <> 0 Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		ДанныеВыбора = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеСотрудника(Знач Сотрудник, Знач Дата)
	Возврат Справочники.Сотрудники.ДанныеСотрудника(Сотрудник, "Должность, НаименованиеПолное", Дата);
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеНоменклатуры(Знач Номенклатура)
	Результат = Новый Структура;
	Результат.Вставить("ЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Результат.Вставить("ЭтоУслуга", Ложь);
	Результат.Вставить("КодТовара", Справочники.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка());
	
	Если ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		ИменаРеквизитов = Новый Структура("КодТовара, ТипНоменклатуры, ЕдиницаИзмерения", "ОКП");
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, ИменаРеквизитов);
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.ДенежныеДокументы") Тогда
		ДанныеНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "ЕдиницаИзмерения");
	Иначе
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Результат, ДанныеНоменклатуры);
	Если ДанныеНоменклатуры.Свойство("ТипНоменклатуры") Тогда
		Результат.ЭтоУслуга = Перечисления.ТипыНоменклатуры.ПолучитьТипыУслугРабот().Найти(
			ДанныеНоменклатуры.ТипНоменклатуры) <> Неопределено;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыСтрок()
	ЗаполнитьЗаголовкиСтрок();
	ЗаполнитьПредставленияРНПТ();
	ЗаполнитьДополнительныеРеквизитыНоменклатурыВоВсехСтроках();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыНоменклатурыВоВсехСтроках()
	ВсяНоменклатура = Новый Массив; // Массив из СправочникСсылка.Номенклатура
	Для Каждого Строка Из Объект.ТоварыРаботыУслуги Цикл
		Если ТипЗнч(Строка.Номенклатура) = Тип("СправочникСсылка.Номенклатура")
				И ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			ВсяНоменклатура.Добавить(Строка.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	ВсеУслуги = Новый Соответствие;
	Если ВсяНоменклатура.Количество() = 0 Тогда
		РеквизитыНоменклатуры = Новый Соответствие;
	Иначе
		Для Каждого Значение Из Перечисления.ТипыНоменклатуры.ПолучитьТипыУслугРабот() Цикл 
			ВсеУслуги.Вставить(Значение, Истина);
		КонецЦикла;
		РеквизитыНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ВсяНоменклатура, "ТипНоменклатуры");
	КонецЕсли;
	ТипБулево = Новый ОписаниеТипов("Булево");
	Для Каждого Строка Из Объект.ТоварыРаботыУслуги Цикл
		Строка.ЭтоУслуга =
			ТипБулево.ПривестиЗначение(ВсеУслуги.Получить(РеквизитыНоменклатуры.Получить(Строка.Номенклатура)));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПослеРедактированияСМР(Результат, ДополнительныеПараметры) Экспорт
	Если Не ЭтоАдресВременногоХранилища(Результат) Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьДанныеСМР(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСМР(АдресВременногоХранилища)
	Данные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища); // см. Документы.АктПриемкиТоваровРаботУслуг.ПараметрыОткрытияФормыСМР
	Модифицированность = Истина;
	ЗаполнитьЗначенияСвойств(Объект, Данные,
		"СтройкаСМР,
		|КодОбъектаСтройки,
		|ОбъектСМР,
		|НачалоПериодаСМР,
		|ОкончаниеПериодаСМР,
		|КонтрагентСтроительныйКонтроль,
		|ПредставительСтроительныйКонтрольФИО,
		|ПредставительСтроительныйКонтрольДолжность");

	Объект.СтроительноМонтажныеРаботы.Очистить();
	Для Каждого СтрокаСМР Из Данные.СтроительноМонтажныеРаботы Цикл
		ЗаполнитьЗначенияСвойств(Объект.СтроительноМонтажныеРаботы.Добавить(), СтрокаСМР);
	КонецЦикла;
	
	Объект.СтоимостьСтроительноМонтажныхРабот.Очистить();
	Для Каждого СтрокаСтоимостиСМР Из Данные.СтоимостьСтроительноМонтажныхРабот Цикл
		ЗаполнитьЗначенияСвойств(Объект.СтоимостьСтроительноМонтажныхРабот.Добавить(), СтрокаСтоимостиСМР);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СохранитьДанныеСМР()
	Данные = Документы.АктПриемкиТоваровРаботУслуг.ПараметрыОткрытияФормыСМР();
	ЗаполнитьЗначенияСвойств(Данные, Объект,
		"СтройкаСМР,
		|КодОбъектаСтройки,
		|ОбъектСМР,
		|НачалоПериодаСМР,
		|ОкончаниеПериодаСМР,
		|Организация,
		|Дата,
		|Номер,
		|КонтрагентСтроительныйКонтроль,
		|ПредставительСтроительныйКонтрольФИО,
		|ПредставительСтроительныйКонтрольДолжность");
	Для Каждого СтрокаСМР Из Объект.СтроительноМонтажныеРаботы Цикл
		ЗаполнитьЗначенияСвойств(Данные.СтроительноМонтажныеРаботы.Добавить(), СтрокаСМР);
	КонецЦикла;
	
	Для Каждого СтрокаСтоимостиСМР Из Объект.СтоимостьСтроительноМонтажныхРабот Цикл
		ЗаполнитьЗначенияСвойств(Данные.СтоимостьСтроительноМонтажныхРабот.Добавить(), СтрокаСтоимостиСМР);
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор,
		"ВестиГрафикПлатежей,ВестиПланГрафикИсполнения"); 
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиГрафикПлатежей",
		?(РеквизитыДоговора.ВестиГрафикПлатежей = Истина, Истина, Ложь));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиПланГрафикИсполнения",
		?(РеквизитыДоговора.ВестиПланГрафикИсполнения = Истина, Истина, Ложь));
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьВидимостьЭлементов(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров,
		ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей);
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект,
		Объект.ЗапланироватьОплату);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПодборДокументовПоступления(ЗакрыватьПриВыборе = Истина)
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Организация'")),,,
			"Объект.Организация", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Договор'")),,,
			"Объект.Договор", Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ВидПоставки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Вид поставки'")),,,
			"Объект.ВидПоставки", Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикОкончанияПодбора = Новый ОписаниеОповещения("ПриОкончанииПодбора", ЭтотОбъект);
	
	ЕстьДобавленыйДокумент = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("Договор", Объект.Договор);
	ПараметрыФормы.Вставить("ВидПоставки", Объект.ВидПоставки);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ЗакрыватьПриВыборе);
	ОткрытьФорму("Документ.АктПриемкиТоваровРаботУслуг.Форма.ФормаВыбораДокументовПоставки",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОбработчикОкончанияПодбора,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаОбИзмененииВидаПоставки(Ответ, ДополнительныеПараметры) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ВидПоставки = ВыбранныйВидПоставки;
	Модифицированность = Истина;
	ВидПоставкиПриИзмененииНаКлиенте();
КонецПроцедуры

&НаСервере
Процедура ВидПоставкиПриИзмененииНаСервере()
	Объект.ДокументыПоступления.Очистить();
	Объект.ТоварыРаботыУслуги.Очистить();
	Объект.ТранспортировкаИПриемка.Очистить();
	Объект.СведенияОбУпаковке.Очистить();
	Объект.СоставУпаковок.Очистить();
	Объект.СведенияПрослеживаемости.Очистить();
	Объект.СведенияПрослеживаемостиФактические.Очистить();
	Объект.ЗачетАвансов.Очистить();
	Объект.ДенежныеОбязательства.Очистить();
	
	БухгалтерскиеОперацииСервер.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
	ОбщегоНазначенияБГУ.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВидПоставкиПриИзмененииНаКлиенте()
	ВидПоставкиПриИзмененииНаСервере();
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	БухгалтерскиеОперацииКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончанииПодбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЕстьДобавленыйДокумент Тогда
		ЕстьДобавленыйДокумент = Ложь;
		ОбработчикПослеОтвета = Новый ОписаниеОповещения("ПослеОтветаОЗаполненииДокумента", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Были добавлены документы поступления.
			|Заполнить документ по выбранным документам поступления (введенные расхождения будут очищены)?'");
		ПоказатьВопрос(ОбработчикПослеОтвета, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораДокументовПоступления(ВыбранноеЗначение)
	НовыеДокументы = Новый Массив;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого ПереданныйДокумент Из ВыбранноеЗначение Цикл
			Если ТипЗнч(ПереданныйДокумент) = Тип("Структура") Тогда
				НовыеДокументы.Добавить(ПереданныйДокумент.Ссылка);
			Иначе
				НовыеДокументы.Добавить(ПереданныйДокумент);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
			НовыеДокументы.Добавить(ВыбранноеЗначение.Ссылка);
		Иначе
			НовыеДокументы.Добавить(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаДокумента Из Объект.ДокументыПоступления Цикл
		ИндексНайденного = НовыеДокументы.Найти(СтрокаДокумента.ДокументОснование);
		Если ИндексНайденного <> Неопределено Тогда
			НовыеДокументы.Удалить(ИндексНайденного);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ДобавляемыйДокумент Из НовыеДокументы Цикл
		НоваяСтрока = Объект.ДокументыПоступления.Добавить();
		Если ТипЗнч(ДобавляемыйДокумент) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДобавляемыйДокумент);
			НоваяСтрока.ДокументОснование = ДобавляемыйДокумент.Ссылка;
		Иначе
			НоваяСтрока.ДокументОснование = ДобавляемыйДокумент;
		КонецЕсли;
		ЕстьДобавленыйДокумент = Истина;
	КонецЦикла;
	
	Если ВводДоступен() Тогда
		ПриОкончанииПодбора(, );
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект = Форма.Объект;
	
	НеотфактурованнаяПоставка = (Объект.ВидПоставки
		= ПредопределенноеЗначение("Перечисление.ВидыПоставкиТоваровРаботУслуг.НеотфактурованнаяПоставка"));
	
	ИменаЭлементовНеотфактурованнаяПоставка = Новый Массив;
	ИменаЭлементовНеотфактурованнаяПоставка.Добавить("ДенежныеОбязательстваИтогСумма");
	ИменаЭлементовНеотфактурованнаяПоставка.Добавить("Расчеты");
	ИменаЭлементовНеотфактурованнаяПоставка.Добавить("ЗачетАвансовЗаполнитьАвансы");
	ИменаЭлементовНеотфактурованнаяПоставка.Добавить("СпособЗачетаАванса");
	ИменаЭлементовНеотфактурованнаяПоставка.Добавить("ДенежныеОбязательства");
	ИменаЭлементовНеотфактурованнаяПоставка.Добавить("ДенежныеОбязательстваЗаполнитьДО");
	
	ИменаЭлементовПрочаяПоставка = Новый Массив;
	ИменаЭлементовПрочаяПоставка.Добавить("СуммаДенежногоОбязательства");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		ИменаЭлементовНеотфактурованнаяПоставка,
		"Видимость",
		НеотфактурованнаяПоставка);
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы,
		ИменаЭлементовПрочаяПоставка,
		"Видимость",
		Не НеотфактурованнаяПоставка);
	
	ВидимостьЗачетАвансов = НеотфактурованнаяПоставка
		И Объект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.ПоДокументу");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ЗачетАвансов",
		"Видимость", ВидимостьЗачетАвансов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Комиссия",
		"Видимость", Не Объект.РешениеОСозданииКомиссииНеПринято);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоставКомиссии",
		"Видимость", Не Объект.РешениеОСозданииКомиссииНеПринято);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ПричинаОтсутствияКомиссии",
		"Видимость", Объект.РешениеОСозданииКомиссииНеПринято);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияПредупреждениеОНеобходимостиОбновленияДокумента",
		"Видимость",
		Форма.ЕстьНеДобавленныеДокументыПоставки);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваЭлементовОтветственныхЛицКонтрагентов(Форма)
	УправлениеНФАКлиентСервер.УстановитьСвойстваЭлементовОтветственныхЛицКонтрагентовАктПриемкиТРУ(Форма, Форма.Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	Документы.АктПриемкиТоваровРаботУслуг.ЗаполнитьЗачетАвансов(Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДОНаСервере()
	Документы.АктПриемкиТоваровРаботУслуг.ЗаполнитьДенежныеОбязательства(Объект);
КонецПроцедуры

&НаСервере
Процедура РНПТОчисткаНаСервере(ИдентификаторСтрокиОбъекта, ПолеРНПТ, СведенияПрослеживаемости)
	ТекущиеДанные = Объект.ТоварыРаботыУслуги.НайтиПоИдентификатору(ИдентификаторСтрокиОбъекта);
	Если Не ТекущиеДанные.ПрослеживаемыйТовар Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиСРНПТ = Объект[СведенияПрослеживаемости].НайтиСтроки(
		Новый Структура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки));
	
	Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
		Объект[СведенияПрослеживаемости].Удалить(СтрокаСРНПТ);
	КонецЦикла;
	
	ТекущиеДанные[ПолеРНПТ] = "";
	ПроверитьИУстановитьЗначениеЕстьРасхождения(ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура РНПТВыбор(ИмяТабличнойЧасти, Поле, РНПТ, СведенияПрослеживаемости, СтандартнаяОбработка)
	ТекущиеДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	Если СтрЗаканчиваетсяНа(Поле.Имя, "РНПТ") Тогда
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ОткрытьПодборРНПТ(ИмяТабличнойЧасти, СведенияПрослеживаемости, РНПТ);
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	ИначеЕсли СтрЗаканчиваетсяНа(Поле.Имя, "ПрослеживаемыйТовар") Тогда
		Если ТекущиеДанные.ПрослеживаемыйТовар Тогда
			ПрослеживаемостьФормыБГУКлиент.ПоказатьПредупреждениеПрослеживаемыйТовар();
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборРНПТ(ИмяТаблицыПодбора, СведенияПрослеживаемости, КолонкаРНПТ)
	
	ТекущиеДанные = Элементы[ИмяТаблицыПодбора].ТекущиеДанные;
	Если Не ТекущиеДанные.ПрослеживаемыйТовар Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицыДляПодбораРНПТ = ИмяТаблицыПодбора;
	
	ПараметрыПодбора = ПрослеживаемостьФормыБГУКлиент.ПараметрыОткрытияФормыПодбораРНПТ("ТоварыРаботыУслуги");
	ПараметрыПодбора.ЭтоПоступление = Истина;
	СтруктураПараметров = ПрослеживаемостьФормыБГУКлиент.ПараметрыОткрытияФормыПодбораРНПТОС();
	СтруктураПараметров.Организация = Объект.Организация;
	СтруктураПараметров.Номенклатура = ТекущиеДанные.Номенклатура;
	СтруктураПараметров.Период = Объект.Дата;
	СтруктураПараметров.ВыборПоОстаткам = НЕ ПараметрыПодбора.ЭтоПоступление;
	СтруктураПараметров.ДатаТекущегоДокумента = Объект.Дата;
	СтруктураПараметров.ТекущийДокумент = Объект.Ссылка;
	СтруктураПараметров.Количество = ТекущиеДанные.Количество;

	ИмяТаблицыПрослеживаемости = СведенияПрослеживаемости;
	ИмяТаблицыДляПодбораРНПТ = ИмяТаблицыПодбора;
	ИмяКолонкиРНПТ = КолонкаРНПТ;
	АдресТаблицыРНПТВХранилище = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПоместитьРНПТВХранилищеНаСервере(АдресТаблицыРНПТВХранилище,
		ТекущиеДанные.ИдентификаторСтроки,
		ИмяТаблицыПрослеживаемости);
	СтруктураПараметров.Вставить("АдресТаблицыРНПТВХранилище", АдресТаблицыРНПТВХранилище);
	СтруктураПараметров.Вставить("ЭтоПоступление", ПараметрыПодбора.ЭтоПоступление);
	
	ОткрытьФорму("Справочник.НомераГТД.Форма." + ПараметрыПодбора.ИмяФормыПодбора, СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСтроку(СтрокаТЧ, ИмяРеквизита)
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", Ложь);
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	РассчитатьСуммыОтклонений(СтрокаТЧ);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьПринятоеКоличество(Строка, ИмяРеквизита, Объект)
	Если ИмяРеквизита = "КоличествоПринято"
		Или ИмяРеквизита = "Количество" Тогда
		Строка.КоличествоОтклонениеПоОбъему = Строка.Количество - Строка.КоличествоПринято;
	ИначеЕсли ИмяРеквизита = "КоличествоОтклонениеПоОбъему" Тогда
		Строка.КоличествоПринято = Строка.Количество - Строка.КоличествоОтклонениеПоОбъему;
	КонецЕсли;
	Если Строка.КоличествоОтклонениеПоОбъему > 0 Тогда
		Строка.КоличествоНедостача = Строка.КоличествоОтклонениеПоОбъему;
		Строка.КоличествоИзлишки = 0;
	ИначеЕсли Строка.КоличествоОтклонениеПоОбъему < 0 Тогда
		Строка.КоличествоНедостача = 0;
		Строка.КоличествоИзлишки = - Строка.КоличествоОтклонениеПоОбъему;
	Иначе
		Строка.КоличествоНедостача = 0;
		Строка.КоличествоИзлишки = 0;
	КонецЕсли;
	
	Если Строка.КоличествоОтклонениеПоОбъему < 0 Тогда
		Строка.КоличествоОтклонение = - Строка.КоличествоОтклонениеПоОбъему + Строка.КоличествоПринятоНеСоответствующие;
	Иначе
		Строка.КоличествоОтклонение = Строка.КоличествоОтклонениеПоОбъему + Строка.КоличествоПринятоНеСоответствующие;
	КонецЕсли;
	РассчитатьСуммыОтклонений(Строка);
	ПроверитьИУстановитьЗначениеЕстьРасхождения(Строка, Объект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСуммыОтклонений(Строка)
	Если Строка.Количество = 0 Тогда
		Возврат;
	КонецЕсли;
	Строка.СуммаПринято = Строка.КоличествоПринято * Строка.Всего / Строка.Количество;
	Строка.СуммаОтклонение = Строка.КоличествоОтклонение * Строка.Всего / Строка.Количество;
	Строка.СуммаБрак = Строка.КоличествоБрак * Строка.Всего / Строка.Количество;
	Строка.СуммаИзлишки = Строка.КоличествоИзлишки * Строка.Всего / Строка.Количество;
	Строка.СуммаНедостача = Строка.КоличествоНедостача * Строка.Всего / Строка.Количество;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияКоличествоОтклонениеПоОбъему(Строка, Отказ)
	Если Строка.Количество - Строка.КоличествоПринято <> Строка.КоличествоОтклонениеПоОбъему Тогда
		РасчетноеКоличество = Строка.Количество - Строка.КоличествоПринято;
		ТекстРасчетноеКоличество = СтрШаблон(НСтр("ru = 'Расчетное количество: %1 (гр. 8) - %2 (гр. 16) = %3.'"),
			Формат(Строка.Количество, "ЧДЦ=3; ЧН=0;"),
			Формат(Строка.КоличествоПринято, "ЧДЦ=3; ЧН=0;"),
			Формат(РасчетноеКоличество, "ЧДЦ=3; ЧН=0;"));
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Колонка",
			"Корректность",
			НСтр("ru = 'Отклонение по количеству (объему)'"),
			Строка.НомерСтроки,
			НСтр("ru = 'Приемка товаров, работ, услуг'"),
			ТекстРасчетноеКоличество);
		ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварыРаботыУслуги",
			Строка.НомерСтроки,
			"КоличествоОтклонениеПоОбъему");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ПутьКПолю, "Объект", Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияКоличествоОтклонение(Строка, Отказ)
	КоличествоОтклонениеПоОбъему = БухгалтерскийУчетКлиентСервер.МодульЧисла(Строка.КоличествоОтклонениеПоОбъему);
	КоличествоОтклонение = Строка.КоличествоПринятоНеСоответствующие + КоличествоОтклонениеПоОбъему;
	Если КоличествоОтклонение <> Строка.КоличествоОтклонение Тогда
		ТекстОшибкаРасхождения = СтрШаблон(НСтр("ru = 'Расчетное количество отклонений: %1 (гр. 17 разд. 4) + %2 (гр. 18 разд. 4) = %3'"),
			Формат(Строка.КоличествоПринятоНеСоответствующие, "ЧДЦ=3; ЧН=0;"),
			Формат(КоличествоОтклонениеПоОбъему, "ЧДЦ=3; ЧН=0;"),
			Формат(КоличествоОтклонение, "ЧДЦ=3; ЧН=0;"));
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Колонка",
			"Корректность",
			НСтр("ru = 'Количество отклонений'"),
			Строка.НомерСтроки,
			НСтр("ru = 'Расхождения'"),
			ТекстОшибкаРасхождения);
		ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварыРаботыУслуги",
			Строка.НомерСтроки,
			"КоличествоОтклонение");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ПутьКПолю, "Объект", Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияКоличествоНесоответствующие(Строка, Отказ)
	Если Строка.КоличествоПринятоНеСоответствующие = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПричинаУказана = ЗначениеЗаполнено(Строка.КоличествоБрак)
		Или ЗначениеЗаполнено(Строка.СтранаПроисхожденияПринято)
		Или ЗначениеЗаполнено(Строка.НесоответствиеТребованиям)
		Или ЗначениеЗаполнено(Строка.ОтклонениеПрочее)
		Или ЕстьРазличияВРНПТ(Объект, Строка);
		
	Если ПричинаУказана Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибкиНеСоответствующие = НСтр("ru = 'В разделе 4 указано количество не соответствующих качеству товаров, работ, услуг, но не указаны отклонения по качеству в разделе 5'");
	ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
		"Колонка",
		"Корректность",
		НСтр("ru = 'Количество принято не соответствующие'"),
		Строка.НомерСтроки,
		НСтр("ru = 'Приемка товаров, работ, услуг'"),
		ТекстОшибкиНеСоответствующие);
	ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварыРаботыУслуги",
		Строка.НомерСтроки,
		"КоличествоПринятоНеСоответствующие");
	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ПутьКПолю, "Объект", Отказ);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкаЗаполненияЕстьРасхождение(Строка, Отказ)
	Если Строка.ЕстьРасхождения И Строка.КоличествоПринятоНеСоответствующие = 0 И Строка.КоличествоОтклонениеПоОбъему = 0 Тогда
		ТекстОшибкиЕстьРасхождения = НСтр("ru = 'В строке указаны расхождения, но не заполнено количество отклонений и количество принятых, не соответствующих качеству'");
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Колонка",
			"Корректность",
			НСтр("ru = 'Количество принято не соответствующие'"),
			Строка.НомерСтроки,
			НСтр("ru = 'Приемка товаров, работ, услуг'"),
			ТекстОшибкиЕстьРасхождения);
		ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварыРаботыУслуги",
			Строка.НомерСтроки,
			"КоличествоПринятоНеСоответствующие");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ПутьКПолю, "Объект", Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияСтранаПроисхожденияПринято(Строка, Отказ)
	Если ЗначениеЗаполнено(Строка.СтранаПроисхожденияПринято)
		И Строка.СтранаПроисхожденияПринято = Строка.СтранаПроисхождения Тогда
		
		ТекстОшибкиСтрана = НСтр("ru = 'Страна происхождения в расхождениях указывается только в случае расхождений со страной происхождения по документам.'");
		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Колонка",
			"Корректность",
			НСтр("ru = 'Страна присхождения'"),
			Строка.НомерСтроки,
			НСтр("ru = 'Расхождения'"),
			ТекстОшибкиСтрана);
		ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТоварыРаботыУслуги",
			Строка.НомерСтроки,
			"СтранаПроисхожденияПринято");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , ПутьКПолю, "Объект", Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСвязанныхЭлементов(Форма)

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ЦМО");
	ИменаЭлементов.Добавить("Подразделение");
	ИменаЭлементов.Добавить("ОтветственныйИсполнитель");
	ИменаЭлементов.Добавить("Руководитель");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	УстановитьРуководителя();
	УстановитьДоступностьСвязанныхЭлементов(ЭтотОбъект);
	ВидимостьЭлементовЭДО = ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	Если Параметры.Ключ.Пустая() И ВидимостьЭлементовЭДО Тогда
		Объект.ЭтоЭлектронныйДокумент = Истина;
	КонецЕсли;
	УстановитьВидимостьЭлементовЭДО(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура УстановитьПолеКонтрагентПоОрганизации()
	КонтрагентПоОрганизации = Документы.АктПриемкиТоваровРаботУслуг.КонтрагентПоОрганизации(Объект.Организация);
КонецПроцедуры

&НаСервере
Процедура УстановитьРуководителя()

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель"), Объект.Организация,
			Объект.Дата, Объект.Подразделение);
	
		Объект.Руководитель = Руководитель.ОтветственноеЛицоСсылка;
	Иначе
		Объект.Руководитель = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	// Правильное заполнение поля СтранаПроисхожденияПринято
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Использование = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.СтранаПроисхожденияПринято",
		,
		ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.СтранаПроисхожденияПринято",
		Новый ПолеКомпоновкиДанных("Объект.ТоварыРаботыУслуги.СтранаПроисхождения"),
		ВидСравненияКомпоновкиДанных.Равно);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасхожденияСтранаПроисхожденияПринято");
	
	// Содержание услуги
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.ЭтоУслуга",
		Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЭлементУО.Отбор,
		"Объект.ТоварыРаботыУслуги.Номенклатура",
		,
		ВидСравненияКомпоновкиДанных.Заполнено);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТоварыРаботыУслугиСодержание");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыСодержание");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеЕстьРасхождения(ИдентификаторСтрокиОбъекта)
	СтрокаОбъекта = Объект.ТоварыРаботыУслуги.НайтиПоИдентификатору(ИдентификаторСтрокиОбъекта);
	Если СтрокаОбъекта.ПрослеживаемыйТовар Тогда
		УстановитьЗначениеЕстьРасхожденияНаСервере(ИдентификаторСтрокиОбъекта);
	Иначе
		ПроверитьИУстановитьЗначениеЕстьРасхождения(СтрокаОбъекта, Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеЕстьРасхожденияНаСервере(ИдентификаторСтрокиОбъекта)
	СтрокаОбъекта = Объект.ТоварыРаботыУслуги.НайтиПоИдентификатору(ИдентификаторСтрокиОбъекта);
	ПроверитьИУстановитьЗначениеЕстьРасхождения(СтрокаОбъекта, Объект);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьИУстановитьЗначениеЕстьРасхождения(СтрокаОбъекта, Объект)
	СтрокаОбъекта.ЕстьРасхождения = ЗначениеЗаполнено(СтрокаОбъекта.СтранаПроисхожденияПринято)
		И СтрокаОбъекта.СтранаПроисхождения <> СтрокаОбъекта.СтранаПроисхожденияПринято;
	СтрокаОбъекта.ЕстьРасхождения = СтрокаОбъекта.ЕстьРасхождения
		Или СтрокаОбъекта.КоличествоОтклонение <> 0
		Или ЗначениеЗаполнено(СтрокаОбъекта.НесоответствиеТребованиям)
		Или ЗначениеЗаполнено(СтрокаОбъекта.ОтклонениеПрочее);
	Если СтрокаОбъекта.ЕстьРасхождения Или Не СтрокаОбъекта.ПрослеживаемыйТовар Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка совпадения РНПТ вызывается только с сервера
	#Если Сервер Тогда
	СтрокаОбъекта.ЕстьРасхождения = ЕстьРазличияВРНПТ(Объект, СтрокаОбъекта);
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьРазличияВРНПТ(Объект, СтрокаОбъекта)
	Отбор = Новый Структура("ИдентификаторСтроки", СтрокаОбъекта.ИдентификаторСтроки);
	РНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Отбор, "РНПТ, Количество");
	РНПТФактические = Объект.СведенияПрослеживаемостиФактические.Выгрузить(Отбор, "РНПТ, Количество");
	
	РНПТ.Сортировать("РНПТ");
	РНПТФактические.Сортировать("РНПТ");
	
	РезультатСравнения = ОбщегоНазначенияБГУ.ФункцияСравненияОбъектов(РНПТ, РНПТФактические);
	Возврат Не РезультатСравнения;
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ИспользоватьКонтрольИсполненияДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров"));
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиГрафикПлатежей", ?(РеквизитыДоговора.ВестиГрафикПлатежей = Истина, Истина, Ложь));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиПланГрафикИсполнения", ?(РеквизитыДоговора.ВестиПланГрафикИсполнения = Истина, Истина, Ложь));
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьВидимостьЭлементов(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров,
		ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей);
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	ЗаполнитьПредставлениеТоваровВУпаковке();
	ЗаполнитьДополнительныеРеквизитыСтрок();
	УстановитьДоступностьСвязанныхЭлементов(ЭтотОбъект);
	УстановитьПолеКонтрагентПоОрганизации();
	УправлениеНФА.УстановитьСвязиПараметровВыбораВсехЭлементовОтветственныхЛиц(ЭтотОбъект, Объект);
	УстановитьСвойстваЭлементовОтветственныхЛицКонтрагентов(ЭтотОбъект);
	ЗаполнитьДолжностиОтветственныхЛиц();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаголовкиСтрок()
	Для Каждого Строка Из Объект.ТоварыРаботыУслуги Цикл
		ЗаполнитьЗаголовкиВСтроке(Строка);
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовкиВСтроке(Строка)
	Строка.ЗаголовокСумма = НСтр("ru = 'сумма'");
	Строка.ЗаголовокКоличество = НСтр("ru = 'кол-во'");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияРНПТ()
	Для Каждого СтрокаАкта Из Объект.ТоварыРаботыУслуги Цикл
		ЗаполнитьПредставленияРНПТВСтроке(СтрокаАкта, "РНПТ", "СведенияПрослеживаемости");
		ЗаполнитьПредставленияРНПТВСтроке(СтрокаАкта, "РНПТФактические", "СведенияПрослеживаемостиФактические");
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставленияРНПТВСтроке(Строка, РНПТ, СведенияПрослеживаемости)
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВПолеФормы(Строка[РНПТ],
		Строка.ПрослеживаемыйТовар,
		Строка.ИдентификаторСтроки,
		Объект[СведенияПрослеживаемости]);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы[ИмяТаблицыДляПодбораРНПТ].ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки,
			ВыбранноеЗначение,
			СтрокаТабличнойЧасти.ПолучитьИдентификатор(),
			ИмяТаблицыПрослеживаемости,
			ИмяКолонкиРНПТ);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр,
	Знач ИмяТаблицыПрослеживаемости, Знач ИмяКолонкиРНПТ)
	
	СтрокаТабличнойЧасти = Объект.ТоварыРаботыУслуги.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТСИменемТаблицы(ЭтотОбъект,
		ИдентификаторСтроки,
		ВыбранноеЗначение,
		ИмяТаблицыПрослеживаемости);
	ЗаполнитьПредставленияРНПТВСтроке(СтрокаТабличнойЧасти, ИмяКолонкиРНПТ, ИмяТаблицыПрослеживаемости);
	ПроверитьИУстановитьЗначениеЕстьРасхождения(СтрокаТабличнойЧасти, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Знач Адрес, Знач ИдентификаторСтроки, Знач СведенияПрослеживаемости)

	Отбор = Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки);
	ТаблицаРНПТ = Объект[СведенияПрослеживаемости].Выгрузить(Отбор);
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);

КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияСоставаУпаковки()
	ТекущиеДанные = Элементы.СведенияОбУпаковке.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторСтроки = ТекущиеДанные.ПолучитьИдентификатор();
	АдресСтрокиУпаковки = ПоместитьСоставУпаковкиВХранилище(ИдентификаторСтроки);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСтрокиУпаковки", АдресСтрокиУпаковки);
	ОткрытьФорму("Документ.АктПриемкиТоваровРаботУслуг.Форма.СоставУпаковки",
		ПараметрыФормы,
		Элементы.СведенияОбУпаковке,
		УникальныйИдентификатор, , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументамПоступленияНаСервере()

	Документы.АктПриемкиТоваровРаботУслуг.ЗаполнитьТоварыРаботыУслуги(Объект);
	Если Объект.ВидПоставки = Перечисления.ВидыПоставкиТоваровРаботУслуг.НеотфактурованнаяПоставка Тогда
		Если Объект.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
			Документы.АктПриемкиТоваровРаботУслуг.ЗаполнитьЗачетАвансов(Объект);
		КонецЕсли;
		Документы.АктПриемкиТоваровРаботУслуг.ЗаполнитьДенежныеОбязательства(Объект);
	Иначе
		Объект.СуммаДенежногоОбязательства = Объект.ТоварыРаботыУслуги.Итог("Всего");
	КонецЕсли;
	
	ЗаполнитьЗаголовкиСтрок();
	ЗаполнитьПредставленияРНПТ();
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСоставУпаковкиВХранилище(ИдентификаторСтроки)

	СтрокаУпаковки = Объект.СведенияОбУпаковке.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если Не ЗначениеЗаполнено(СтрокаУпаковки.ИдентификаторСтроки) Тогда
		СтрокаУпаковки.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	СтрокиВУпаковке = Новый Соответствие;
	Для Каждого СоответствиеСтрок Из Объект.СоставУпаковок Цикл
		Если СоответствиеСтрок.ИдентификаторСтрокиУпаковки = СтрокаУпаковки.ИдентификаторСтроки Тогда
			СтрокиВУпаковке.Вставить(СоответствиеСтрок.ИдентификаторСтрокиТовара, Истина);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеУпаковки = Новый Структура;
	ДанныеУпаковки.Вставить("ИдентификаторСтрокиУпаковки", СтрокаУпаковки.ИдентификаторСтроки);
	
	Для Каждого СтрокаАкта Из Объект.ТоварыРаботыУслуги Цикл
		Если ПустаяСтрока(СтрокаАкта.ИдентификаторСтроки) Тогда
			СтрокаАкта.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
	СоставАкта = Объект.ТоварыРаботыУслуги.Выгрузить( ,
		"Номенклатура, ЕдиницаИзмерения, СтранаПроисхождения, Количество, ИдентификаторСтроки");
	СоставАкта.Колонки.Добавить("ВходитВУпаковку", Новый ОписаниеТипов("Булево"));
	Для Каждого СтрокаСостава Из СоставАкта Цикл
		Если СтрокиВУпаковке.Получить(СтрокаСостава.ИдентификаторСтроки) = Истина Тогда
			СтрокаСостава.ВходитВУпаковку = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеУпаковки.Вставить("СоставАкта", СоставАкта);
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеУпаковки, УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ЗаполнитьСоставУпаковкиНаСервере(РезультатЗаполненияСостава)

	АдресСоставаУпаковки =
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатЗаполненияСостава, "АдресСоставаУпаковки"); // Строка
	Если ТипЗнч(АдресСоставаУпаковки) <> Тип("Строка") Или Не ЭтоАдресВременногоХранилища(АдресСоставаУпаковки) Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтрокиУпаковки = ПолучитьИзВременногоХранилища(АдресСоставаУпаковки); // Структура
	Если ТипЗнч(ДанныеСтрокиУпаковки) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторСтрокиУпаковки =
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеСтрокиУпаковки, "ИдентификаторСтрокиУпаковки"); // Строка
	Если Не ЗначениеЗаполнено(ИдентификаторСтрокиУпаковки) Тогда
		Возврат;
	КонецЕсли;
	
	// Удалить все товары из упаковки
	УдаляемыеСтроки = Объект.СоставУпаковок.НайтиСтроки(
		Новый Структура("ИдентификаторСтрокиУпаковки", ИдентификаторСтрокиУпаковки));
	Для Каждого СтрокаСостава Из УдаляемыеСтроки Цикл
		Объект.СоставУпаковок.Удалить(СтрокаСостава);
	КонецЦикла;
	
	// Добавить в упаковку выбранные товары
	
	СоставУпаковки = ДанныеСтрокиУпаковки.СоставУпаковки; // Соответствие из Булево
	Для Каждого СтрокаАкта Из Объект.ТоварыРаботыУслуги Цикл
		
		Если СоставУпаковки.Получить(СтрокаАкта.ИдентификаторСтроки) <> Неопределено Тогда
			СтрокаСостава = Объект.СоставУпаковок.Добавить();
			СтрокаСостава.ИдентификаторСтрокиТовара = СтрокаАкта.ИдентификаторСтроки;
			СтрокаСостава.ИдентификаторСтрокиУпаковки = ИдентификаторСтрокиУпаковки;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьПредставлениеТоваровВУпаковке();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеТоваровВУпаковке()
	
	СтрокиУпаковок = Новый Соответствие;
	Для Каждого СтрокаУпаковки Из Объект.СведенияОбУпаковке Цикл
		СтрокиУпаковок.Вставить(СтрокаУпаковки.ИдентификаторСтроки, СтрокаУпаковки);
	КонецЦикла;
	
	СтрокиТоваров = Новый Соответствие;
	Для Каждого СтрокаТовара Из Объект.ТоварыРаботыУслуги Цикл
		СтрокиТоваров.Вставить(СтрокаТовара.ИдентификаторСтроки, СтрокаТовара);
	КонецЦикла;
	
	СоставыУпаковок = Новый Соответствие;
	Для Каждого СоответствиеСтрок Из Объект.СоставУпаковок Цикл
		// Проверить, что такая упаковка есть
		Если СтрокиУпаковок.Получить(СоответствиеСтрок.ИдентификаторСтрокиУпаковки) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрокаАкта = СтрокиТоваров.Получить(СоответствиеСтрок.ИдентификаторСтрокиТовара);
		// Проверить, что такой товар есть
		Если СтрокаАкта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Состав = СоставыУпаковок.Получить(СоответствиеСтрок.ИдентификаторСтрокиУпаковки);
		Если Состав = Неопределено Тогда
			Состав = Новый Массив;
			СоставыУпаковок.Вставить(СоответствиеСтрок.ИдентификаторСтрокиУпаковки, Состав);
		КонецЕсли;
		Состав.Добавить(СтрокаАкта);
	КонецЦикла;
	
	Для Каждого СтрокаУпаковки Из Объект.СведенияОбУпаковке Цикл
		Состав = СоставыУпаковок.Получить(СтрокаУпаковки.ИдентификаторСтроки);
		Если Состав = Неопределено Или Состав.Количество() = 0 Тогда
			ПредставлениеТоваровВУпаковке = ПредставлениеТоваровВУпаковкеНеВыбраны();
		Иначе
			ПредставлениеТоваровВУпаковке = Строка(Состав[0].Номенклатура);
			Если Состав.Количество() = 2 Тогда
				ПредставлениеТоваровВУпаковке = ПредставлениеТоваровВУпаковке + "; " + Строка(Состав[1].Номенклатура);
			ИначеЕсли Состав.Количество() > 2 Тогда
				ПредставлениеТоваровВУпаковке = ПредставлениеТоваровВУпаковке
					+ СтрШаблон(НСтр("ru = ' и еще %1'"), Состав.Количество() - 1);
			КонецЕсли;
		КонецЕсли;
		СтрокаУпаковки.СоставУпаковки = ПредставлениеТоваровВУпаковке;
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеТоваровВУпаковкеНеВыбраны()

	Возврат НСтр("ru = 'Товары не выбраны'");

КонецФункции

&НаСервереБезКонтекста
Функция ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Договор)
	
	Возврат КонтрольИсполненияДоговоров.ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Договор);
	
КонецФункции

&НаСервере
Функция ВидимостьЭлементовЭДО(Контрагент, Организация)
	Возврат ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Контрагент, Организация);
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СпособСоставления", "Видимость", Форма.ВидимостьЭлементовЭДО);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КомандыЭДО", "Видимость", Ложь);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДОПослеИнициализацииЭлементовБЭД(Форма, ВидимостьЭлементовЭДО)
	
	ВидимостьСостоянияЭДО = ВидимостьЭлементовЭДО;
	Если СтрНайти(Форма.Элементы.ДекорацияСостояниеЭДО.Заголовок, НСтр("ru = 'Не начат'")) > 0
		ИЛИ СтрНайти(Форма.Элементы.ДекорацияСостояниеЭДО.Заголовок, НСтр("ru = 'ЭДО: Состояние ЭДО'")) > 0 Тогда
		ВидимостьСостоянияЭДО = Ложь;
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияЭДОАкт", "Видимость", ВидимостьСостоянияЭДО);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", ВидимостьСостоянияЭДО);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект);
КонецПроцедуры
//Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПослеОтветаОЗаполненииДокумента(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументамПоступленияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область Инициализация

ЕстьДобавленыйДокумент = Ложь;

#КонецОбласти
