
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Если НЕ ЭтоАдресВременногоХранилища(Параметры.АдресХранилища) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Организация", Параметры.Организация, Истина); 
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ВсеПлатежныеСистемы", Параметры.ВсеПлатежныеСистемы, Истина);
	ОтмеченныеКарты.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресХранилища));
	ВыбраноКоличество = ОтмеченныеКарты.Количество(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ПеренестиВДокумент Тогда 
		Выбрано = Новый Структура("АдресВХранилище", ПоместитьВыбранныеКартыВХранилище());
		ОповеститьОВыборе(Выбрано);
	КонецЕсли;	
КонецПроцедуры     

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("Массив") Тогда   
		ДобавитьВвыбранное(ВыбраннаяСтрока);
	КонецЕсли;	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВВыбор(Команда)
	Если ТипЗнч(Элементы.Список.ВыделенныеСтроки) = Тип("Массив") Тогда 
		ДобавитьВвыбранное(Элементы.Список.ВыделенныеСтроки);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзВыбора(Команда)  
	УдалитьВыбранноеНаСервере(Элементы.ОтмеченныеКарты.ВыделенныеСтроки);   
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть();
КонецПроцедуры     

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВыбранныеКартыВХранилище()
	ТабВыбранных = ОтмеченныеКарты.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТабВыбранных, УникальныйИдентификатор);
КонецФункции	

&НаКлиенте
Процедура ДобавитьВвыбранное(Массиввыбранных)
	Для Каждого Карта Из Массиввыбранных Цикл
		Если ОтмеченныеКарты.НайтиСтроки(Новый Структура("ПлатежнаяКарта", Карта)).Количество() = 0 Тогда
			НовКарта = ОтмеченныеКарты.Добавить();
			НовКарта.ПлатежнаяКарта = Карта;
		КонецЕсли;
	КонецЦикла;
	ВыбраноКоличество = ОтмеченныеКарты.Количество();   
КонецПроцедуры	

&НаСервере
Процедура УдалитьВыбранноеНаСервере(Знач МассивИдентификаторов)
	ТабУдаляемых = Новый ТаблицаЗначений;
	ТабУдаляемых.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число")); 
	Для Каждого Инд Из МассивИдентификаторов Цикл
		НовСтр = ТабУдаляемых.Добавить();
		НовСтр.Номер = ОтмеченныеКарты.Индекс(ОтмеченныеКарты.НайтиПоИдентификатору(Инд));
	КонецЦикла;	
	ТабУдаляемых.Сортировать("Номер Убыв");  
	Для Каждого Ном Из ТабУдаляемых Цикл 
		ОтмеченныеКарты.Удалить(Ном.Номер);
	КонецЦикла;
	ВыбраноКоличество = ОтмеченныеКарты.Количество();  
КонецПроцедуры	

#КонецОбласти
	
	
	
