////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураНастроек = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПодборНоменклатурыИзПрейскуранта", "");
	Если СтруктураНастроек <> Неопределено Тогда
		Если СтруктураНастроек.Свойство("ЗапрашиватьКоличество")
			И СтруктураНастроек.ЗапрашиватьКоличество Тогда
			ЗапрашиватьКоличество = Истина;
		КонецЕсли;
		Если СтруктураНастроек.Свойство("ЗапрашиватьЦену")
			И СтруктураНастроек.ЗапрашиватьЦену Тогда
			ЗапрашиватьЦену = Истина;
		КонецЕсли;
		Если СтруктураНастроек.Свойство("НеВыводитьНоменклатуруБезЦены")
			И СтруктураНастроек.НеВыводитьНоменклатуруБезЦены Тогда
			НеВыводитьНоменклатуруБезЦены = Истина;
		КонецЕсли;
		Если СтруктураНастроек.Свойство("ПоказыватьСнятыеСПродажи")
			И СтруктураНастроек.ПоказыватьСнятыеСПродажи Тогда
			ПоказыватьСнятыеСПродажи = Истина;
		КонецЕсли;
		Если СтруктураНастроек.Свойство("НеВыводитьНоменклатуруБезОстатка")
			И СтруктураНастроек.НеВыводитьНоменклатуруБезОстатка Тогда
			НеВыводитьНоменклатуруБезОстатка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ЗапрашиватьЦену.Видимость 					= Параметры.ЕстьЦена;
	Элементы.НеВыводитьНоменклатуруБезЦены.Видимость 	= Параметры.ЕстьЦена;
	Элементы.НеВыводитьНоменклатуруБезОстатка.Видимость = Параметры.ВедетсяКонтрольОстатков;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗапрашиватьКоличество"				, ЗапрашиватьКоличество);
	ПараметрыЗакрытия.Вставить("ЗапрашиватьЦену"      				, ЗапрашиватьЦену);
	ПараметрыЗакрытия.Вставить("НеВыводитьНоменклатуруБезЦены"  	, НеВыводитьНоменклатуруБезЦены);
	ПараметрыЗакрытия.Вставить("ПоказыватьСнятыеСПродажи" 			, ПоказыватьСнятыеСПродажи);
	ПараметрыЗакрытия.Вставить("НеВыводитьНоменклатуруБезОстатка" 	, НеВыводитьНоменклатуруБезОстатка);
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("ПодборНоменклатурыИзПрейскуранта", "", ПараметрыЗакрытия);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

