#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.УчетныйЛистТрактористаМашиниста";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма411АПК";
	КомандаПечати.Представление		= НСтр("ru = 'Учетный лист тракториста-машиниста (ф. 411-АПК)'");
	КомандаПечати.Порядок			= 1;

КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма411АПК") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма411АПК", "Учетный лист тракториста-машиниста (ф. 411-АПК)", ПечатьУчетногоЛистаТракториста(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//  ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьУчетногоЛистаТракториста(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Форма411АПК";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УчетныйЛистТрактористаМашиниста.ПФ_MXL_Форма411АПК");
	
	Запрос = Новый Запрос;
	Запрос.Текст =	
	
	"ВЫБРАТЬ
	|	УчетныйЛистТрактористаМашиниста.Ссылка,
	|	УчетныйЛистТрактористаМашиниста.Организация,
	|	ВЫРАЗИТЬ(УчетныйЛистТрактористаМашиниста.Организация КАК Справочник.Организации).КодОКПО КАК КодОКПО,
	|	ВЫРАЗИТЬ(УчетныйЛистТрактористаМашиниста.Организация КАК Справочник.Организации).НаименованиеПолное КАК НаименованиеОрганизации,
	|	ВЫРАЗИТЬ(УчетныйЛистТрактористаМашиниста.МОЛ КАК Справочник.Сотрудники).Код КАК ТабельныйНомер,
	|	УчетныйЛистТрактористаМашиниста.Номер КАК НомерУчетногоЛиста,
	|	УчетныйЛистТрактористаМашиниста.Дата КАК ДатаУчетногоЛиста,
	|	УчетныйЛистТрактористаМашиниста.СрокДействия,
	|	УчетныйЛистТрактористаМашиниста.МОЛ КАК Тракторист,
	|	УчетныйЛистТрактористаМашиниста.Агрегат КАК Машина,
	|	УчетныйЛистТрактористаМашиниста.Подразделение,
	|	УчетныйЛистТрактористаМашиниста.Участок,
	|	УчетныйЛистТрактористаМашиниста.Бригада,
	|	УчетныйЛистТрактористаМашиниста.Бригадир,
	|	УчетныйЛистТрактористаМашиниста.Прицепщик,
	|	УчетныйЛистТрактористаМашиниста.Профессия,
	|	УчетныйЛистТрактористаМашиниста.Категория,
	|	УчетныйЛистТрактористаМашиниста.ГаражныйНомер КАК ГаражныйНомер,
	|	УчетныйЛистТрактористаМашиниста.РегистрационныйНомернойЗнак КАК ГосударственныйНомернойЗнак,
	|	УчетныйЛистТрактористаМашиниста.РуководительПодразделения,
	|	МЕСЯЦ(УчетныйЛистТрактористаМашиниста.Дата) КАК МесяцДаты,
	|	ГОД(УчетныйЛистТрактористаМашиниста.Дата) КАК ГодДаты,
	|	УчетныйЛистТрактористаМашиниста.ДвижениеГорючего.(
	|		Ссылка,
	|		НомерСтроки,
	|		МаркаГорючего,
	|		КодМаркиГорючего,
	|		ВыданоГорючее,
	|		ОстатокГорючегоПриВыезде,
	|		ОстатокГорючегоПриВозвращении,
	|		ЕдиницаИзмерения
	|	)
	|ИЗ
	|	Документ.УчетныйЛистТрактористаМашиниста КАК УчетныйЛистТрактористаМашиниста
	|ГДЕ
	|	УчетныйЛистТрактористаМашиниста.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаУчетногоЛиста,
	|	НомерУчетногоЛиста";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДокументов = Результат.Выбрать();

	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПФ_MXL_Форма411АПК";
	ТабличныйДокумент.Автомасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ Результат.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, ВыборкаДокументов[Колонка.Имя]);	
		КонецЦикла;
		
		//---изменение представления данных в печатной форме----------------
		НаименованиеУчетногоЛиста = НСтр("ru = 'УЧЕТНЫЙ ЛИСТ № '");
		СтруктураДанных.Вставить("НаименованиеУчетногоЛиста", НаименованиеУчетногоЛиста);	
		
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаДокументов.Организация,
															Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
															
		СтруктураДанных.Вставить("НаименованиеОрганизацииАдресТелефон", СтруктураДанных.НаименованиеОрганизации+", "+АдресОрганизации+", "+ТелефонОрганизации);
	
		СтруктураДанных.Вставить("СрокДействияУчетногоЛиста", 	УчетГСМ.СрокДействияПутевогоЛиста(СтруктураДанных.ДатаУчетногоЛиста, СтруктураДанных.СрокДействия));
		
		СтруктураДанных.Вставить("МаркаТрактора", 	УчетГСМ.ПолучитьМаркуТС(СтруктураДанных.Машина));	
		СтруктураДанных.Вставить("ИнвентарныйНомер", 	УчетГСМ.ИнвентарныйНомерОбъекта(СтруктураДанных.Машина));	
		
		ДанныеВодителя = УчетГСМ.ПолучитьДанныеВодителя(СтруктураДанных.Тракторист, СтруктураДанных.ДатаУчетногоЛиста);
		Если ДанныеВодителя.Свойство("КлассВодителя") Тогда
			СтруктураДанных.Вставить("Классность", 	ДанныеВодителя.КлассВодителя);	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.Тракторист) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Тракторист, СтруктураДанных.ДатаУчетногоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ТрактористФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.РуководительПодразделения) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.РуководительПодразделения, СтруктураДанных.ДатаУчетногоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("РуководительПодразделенияФамилияИнициалы", КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Ложь));
			СтруктураДанных.Вставить("ДолжностьРуководителяПодразделения", ДанныеСотрудника.Должность);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураДанных.Прицепщик) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Прицепщик, СтруктураДанных.ДатаУчетногоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("ПрицепщикФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтруктураДанных.Бригадир) Тогда
			ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Бригадир, СтруктураДанных.ДатаУчетногоЛиста);
			Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
			СтруктураДанных.Вставить("БригадирФИО", ДанныеСотрудника.Фамилия + " "+ДанныеСотрудника.Имя+" "+ДанныеСотрудника.Отчество);
		КонецЕсли;
		
		//Движение горючего
		ВыборкаГорючее = ВыборкаДокументов.ДвижениеГорючего.Выбрать();
		
		ЕдиницыИзмеренияГСМ = НСтр("ru = 'кг (код по ОКЕИ - 166)'");
		НомерСтроки = 0;
		Пока ВыборкаГорючее.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если НомерСтроки > 1 Тогда
				Прервать;
			КонецЕсли;
			
			СтруктураДанных.Вставить("МаркаГорючего", ВыборкаГорючее.МаркаГорючего);
			СтруктураДанных.Вставить("КодМаркиГорючего", ВыборкаГорючее.КодМаркиГорючего);
			СтруктураДанных.Вставить("ЕдИзм"+НомерСтроки+"Горючего", ?(ЗначениеЗаполнено(ВыборкаГорючее.ЕдиницаИзмерения), ВыборкаГорючее.ЕдиницаИзмерения, "кг"));
			СтруктураДанных.Вставить("ПолученоГСМ", ВыборкаГорючее.ВыданоГорючее);
			СтруктураДанных.Вставить("ОстатокГСМНаНачало", ВыборкаГорючее.ОстатокГорючегоПриВыезде);
			СтруктураДанных.Вставить("ОстатокГСМНаКонец", ВыборкаГорючее.ОстатокГорючегоПриВозвращении);
			
			ЕдиницыИзмеренияГСМ = ?(ЗначениеЗаполнено(ВыборкаГорючее.ЕдиницаИзмерения), СокрЛП(ВыборкаГорючее.ЕдиницаИзмерения)+НСтр("ru = ' (код по ОКЕИ - '")+СокрЛП(ВыборкаГорючее.ЕдиницаИзмерения.Код)+НСтр("ru = ')'"), ЕдиницыИзмеренияГСМ);
		КонецЦикла;
		
		СтруктураДанных.Вставить("ЕдиницыИзмеренияГСМ", ЕдиницыИзмеренияГСМ);
		
		//вывод областей табличного документа
		
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Заполнить(СтруктураДанных);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(Область, "НомерУчетногоЛиста", СтруктураДанных.НомерУчетногоЛиста, СтруктураДанных.Ссылка, Неопределено, Истина);
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(Область);
		
		Для н = 1 По 11 Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;	
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Оборотная сторона
		Область = Макет.ПолучитьОбласть("ОборотнаяСторона");
		ТабличныйДокумент.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(Область);
		
		Для н = 1 По 15 Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
			ТабличныйДокумент.Вывести(Область);
		КонецЦикла;	
		
		Область = Макет.ПолучитьОбласть("ИтогиПодвал");
		Область.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(Область);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);		
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
КонецФункции	

#КонецОбласти

#КонецОбласти

#КонецЕсли
