#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Организация = ПолучитьЗначениеОтбора("Организация", Тип("СправочникСсылка.Организации"));
	УстановитьЗначениеПараметра("Организация", Организация);
	
	Подразделение = ПолучитьЗначениеОтбора("Подразделение", Тип("СправочникСсылка.Подразделения"));
	УстановитьЗначениеПараметра("Подразделение", Подразделение);
	
	Если ЗначениеПараметра(КомпоновщикНастроек.Настройки.ПараметрыДанных, "Форма103н") = Ложь Тогда
		МакетПодвала = СхемаКомпоновкиДанных.Макеты["Макет3"].Макет;
		МакетПодвала.Удалить(МакетПодвала[4]);
		МакетПодвала.Удалить(МакетПодвала[3]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначениеОтбора(ИмяЭлемента, ТипЭлемента)
	
	Значение = Новый (ТипЭлемента);
	
	ПолеОтбора = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
	Для Каждого Элемент Из Настройки.Отбор.Элементы Цикл
		
		Если Элемент.ЛевоеЗначение = ПолеОтбора И Элемент.Использование Тогда	
			Если ТипЗнч(Элемент.ПравоеЗначение) = ТипЭлемента Тогда
				Значение = Элемент.ПравоеЗначение;
			ИначеЕсли ТипЗнч(Элемент.ПравоеЗначение) = Тип("СписокЗначений") И Элемент.ПравоеЗначение.Количество() = 1 Тогда
				Значение = Элемент.ПравоеЗначение[0].Значение;
			КонецЕсли;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Значение;
		
КонецФункции

Процедура УстановитьЗначениеПараметра(ИмяПараметра, Значение)
	
	ПараметрОтбораОрганизация = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
	Для Каждого Элемент Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если Элемент.Параметр = ПараметрОтбораОрганизация Тогда
			Элемент.Значение = Значение;
			Элемент.Использование = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Функция ЗначениеПараметра(ПараметрыОтчета, ИмяПараметра)
	Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если Параметр = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат Параметр.Значение;
	КонецЕсли;
КонецФункции

#КонецОбласти

#КонецЕсли