#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("Код");
	Возврат МассивРеквизитов;
КонецФункции

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("Владелец");
	Результат.Добавить("ОС");
	
	Возврат Результат;
	
КонецФункции

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Формирует список возможных видов обременений для объектов ОС
//
// Возвращаемое значение:
// - СписокЗначений из Строка - список видов обременений
Функция ВидыОбременений() Экспорт
	СписокВидовОбременений = Новый СписокЗначений();
	СписокВидовОбременений.Добавить("Аренда");
	СписокВидовОбременений.Добавить("Ипотека");
	СписокВидовОбременений.Добавить("Доверительное управление");
	СписокВидовОбременений.Добавить("Рента");
	СписокВидовОбременений.Добавить("Сервитут");
	СписокВидовОбременений.Добавить("Арест");
	СписокВидовОбременений.Добавить("Залог");
	СписокВидовОбременений.Добавить("Концессионное соглашение");
	СписокВидовОбременений.Добавить("Безвомездное пользование");
	
	Возврат СписокВидовОбременений;
КонецФункции	

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Не Параметры.Свойство("Ключ") Тогда // Создается новый элемент
			
			Организация = Неопределено;
			ОсновноеСредство = Неопределено;
			
			ПолеОрганизация = "Владелец";
			ПолеОсновноеСредство = "ОС";
			Если Параметры.Свойство("ДополнительныеПараметры") Тогда
				Если Параметры["ДополнительныеПараметры"].Свойство("ПоляКлючей") Тогда
					ПоляКлючей = СтрРазделить(Параметры["ДополнительныеПараметры"], ",", ЛОжь);
					Если ПоляКлючей.Количество() > 0 И ЗначениеЗаполнено(ПоляКлючей[0]) Тогда
						ПолеОрганизация = ПоляКлючей[0];
						ПолеОсновноеСредство = ПоляКлючей[1];
					КонецЕсли;
				КонецЕсли;
				Параметры["ДополнительныеПараметры"].Свойство("Организация", Организация);
				Параметры["ДополнительныеПараметры"].Свойство("ОсновноеСредство", ОсновноеСредство);
			КонецЕсли;
			
			Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
				Если Организация = Неопределено Тогда
					Параметры["ЗначенияЗаполнения"].Свойство(ПолеОрганизация, Организация);
				КонецЕсли;
				Если ОсновноеСредство = Неопределено Тогда
					Параметры["ЗначенияЗаполнения"].Свойство(ПолеОсновноеСредство, ОсновноеСредство);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Организация) Тогда
				
				Период = Неопределено;
				Если Параметры.Свойство("ДополнительныеПараметры") И Параметры["ДополнительныеПараметры"].Свойство("Дата") Тогда
					Период = Параметры["ДополнительныеПараметры"]["Дата"];
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Период) Тогда
					Период = ТекущаяДатаСеанса();
				КонецЕсли;
				
				Шаблон = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(Организация, КонецМесяца(Период)).ШаблонИнвентарныхНомеров;
				
				Если ЗначениеЗаполнено(Шаблон) Тогда
					
					Если Не Параметры.Свойство("ДополнительныеПараметры") Тогда
						Параметры.Вставить("ДополнительныеПараметры", Новый Структура);
					КонецЕсли;
					
					Если Не Параметры.ДополнительныеПараметры.Свойство("Организация") Тогда
						Параметры.ДополнительныеПараметры.Вставить("Организация", Организация);
					КонецЕсли;
					Если Не Параметры.ДополнительныеПараметры.Свойство("ОсновноеСредство") Тогда
						Параметры.ДополнительныеПараметры.Вставить("ОсновноеСредство", ОсновноеСредство);
					КонецЕсли;
					Если Не Параметры.ДополнительныеПараметры.Свойство("Дата") Тогда
						Параметры.ДополнительныеПараметры.Вставить("Дата", Период);
					КонецЕсли;
					Если Не Параметры.ДополнительныеПараметры.Свойство("Шаблон") Тогда
						Параметры.ДополнительныеПараметры.Вставить("Шаблон", Шаблон);
					КонецЕсли;
					
					СтандартнаяОбработка = Ложь;
					
					ВыбраннаяФорма = Метаданные.Справочники.ИнвентарныеНомераОС.Формы.ФормаФормированиеИнвентарныхНомеров;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
		
		Если Не Параметры.Свойство("Отбор") И Не Параметры.Свойство("Организация") И Не Параметры.Свойство("ОсновноеСредство") Тогда
			
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = Метаданные.Справочники.ИнвентарныеНомераОС.Формы.ФормаВыбораБезОтборов;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Представление = СокрП(Данные.Код);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЕстьИнвентарныйНомер(Организация, ОсновноеСредство, ТекущийНомер = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"			, Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство"	, ОсновноеСредство);
	Запрос.УстановитьПараметр("Ссылка"				, ТекущийНомер);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	ИнвентарныеНомераОС.Владелец = &Организация
	|	И ИнвентарныеНомераОС.ОС = &ОсновноеСредство
	|	И НЕ ИнвентарныеНомераОС.ОС.ГрупповойУчет
	|	И НЕ ИнвентарныеНомераОС.ПометкаУдаления";
	
	Если ТекущийНомер <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И ИнвентарныеНомераОС.Ссылка <> &Ссылка";
	КонецЕсли;
	
	Результат = Не Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

Функция ПоследнийНомер(Организация, ДанныеШаблона = Неопределено) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнвентарныеНомераОС.Код КАК Значение
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	ИнвентарныеНомераОС.Владелец = &Организация
	|	И ИнвентарныеНомераОС.Код ПОДОБНО &ШаблонПоиска
	|
	|УПОРЯДОЧИТЬ ПО
	|	Значение УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ДанныеШаблона = Неопределено Тогда	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИнвентарныеНомераОС.Код ПОДОБНО &ШаблонПоиска", "");
	Иначе
		Если ДанныеШаблона.БезУчетаПрефикса Тогда
			ДлинаПрефикса = СтрДлина(ДанныеШаблона.Префикс);		
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИнвентарныеНомераОС.Код КАК Значение", "ПОДСТРОКА(ИнвентарныеНомераОС.Код, &НачальнаяПозиция, &Длина) КАК Значение");
			Запрос.УстановитьПараметр("НачальнаяПозиция", ДлинаПрефикса + 1);
			Запрос.УстановитьПараметр("Длина", ДанныеШаблона.ДлинаНомера);	
			ШаблонПоиска = Лев("______________________________", ДлинаПрефикса);
		Иначе
			ШаблонПоиска = ДанныеШаблона.Префикс;	
		КонецЕсли;		
		Для Сч = 1 По ДанныеШаблона.ДлинаНомера Цикл
			ШаблонПоиска = ШаблонПоиска + "[0-9]"; 
		КонецЦикла;
		Для Сч = СтрДлина(ДанныеШаблона.Префикс) + ДанныеШаблона.ДлинаНомера + 1 По 30 Цикл
			ШаблонПоиска = ШаблонПоиска + " "; // добиваем шаблон пробелами до полной длины кода
		КонецЦикла;
		Запрос.УстановитьПараметр("ШаблонПоиска", ШаблонПоиска);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = СокрП(Выборка.Значение);
		Если ДанныеШаблона <> Неопределено Тогда
			Результат = Прав(Результат, ДанныеШаблона.ДлинаНомера);
		КонецЕсли;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет наличие дублирования инвентарного номера в справочнике для указанной организации.
//
// Параметры:
//   ИнвНомерСсылка - СправочникСсылка.ИнвентарныеНомераОС - Ссылка на проверяемый инвентарный номер
//   ИнвНомерКод - Строка - Код проверяемого инвентарного номера
//   ИнвНомерЗаимствованныйСсылка - СправочникСсылка.ИнвентарныеНомераОС - Ссылка на заимствованный инвентарный номер
//   Организация - СправочникСсылка.Организации - Организация, для которой проверяется дублирование
//
// Возвращаемое значение:
//   Булево - Признак наличия дублирования инвентарного номера в справочнике "Инвентарные номера ОС"
Функция ЕстьДублированиеИнвентарногоНомера(ИнвНомерСсылка, ИнвНомерКод, ИнвНомерЗаимствованныйСсылка, Организация) Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ИнвентарныеНомераОС.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|ГДЕ
	|	ИнвентарныеНомераОС.Владелец = &Организация
	|	И ИнвентарныеНомераОС.Код = &ИнвНомерКод
	|	И НЕ ИнвентарныеНомераОС.Ссылка = &ИнвНомерСсылка
	|	И (&ЕстьИнвНомерЗаимствованный
	|	И НЕ ИнвентарныеНомераОС.Ссылка = &ИнвНомерЗаимствованныйСсылка
	|	ИЛИ НЕ &ЕстьИнвНомерЗаимствованный
	|	И НЕ (ИнвентарныеНомераОС.ИнвентарныйНомерЗаимствуется
	|	И ИнвентарныеНомераОС.ИнвентарныйНомерЗаимствованный = &ИнвНомерСсылка))";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ИнвНомерКод", СокрЛП(ИнвНомерКод));
	Запрос.УстановитьПараметр("ИнвНомерСсылка", ИнвНомерСсылка);
	Запрос.УстановитьПараметр("ИнвНомерЗаимствованныйСсылка", ИнвНомерЗаимствованныйСсылка);
	Запрос.УстановитьПараметр("ЕстьИнвНомерЗаимствованный", ЗначениеЗаполнено(ИнвНомерЗаимствованныйСсылка));
	
	Возврат(НЕ Запрос.Выполнить().Пустой());
КонецФункции	

#Область ТекстыЗапросовДляФормОСиИнвНомеров
// Тексты запросов получения данных для отображения в формах ОС и инвентарных номеров

Функция ТекстЗапроса_СобытияОС()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОС.Регистратор КАК Регистратор,
	|	СобытияОС.Событие КАК Событие,
	|	СобытияОС.ДатаСобытия КАК ДатаСобытия
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ИнвНомер = &ИнвентарныйНомер) КАК СобытияОС";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_СтоимостьОбъектовОС()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОстатки.СтоимостьОстаток КАК БалансоваяСтоимость
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ИнвентарныйНомер = &ИнвентарныйНомер
	|				И ВидРаспоряжения В (
	|					ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе), 
	|					ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет))) КАК СтоимостьОбъектовОСОстатки";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_АмортизацияОбъектовОС()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АмортизацияОбъектовОСОстатки.СуммаАмортизацииОстаток КАК СуммаАмортизации,
	|	АмортизацияОбъектовОСОстатки.СуммаОбесцененияОстаток КАК СуммаОбесценения
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ИнвентарныйНомер = &ИнвентарныйНомер) КАК АмортизацияОбъектовОСОстатки";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_СведенияКадастровогоУчета()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияКадастровогоУчетаСрезПоследних.Период КАК Период,
	|	СведенияКадастровогоУчетаСрезПоследних.Организация КАК Организация,
	|	СведенияКадастровогоУчетаСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияКадастровогоУчетаСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СведенияКадастровогоУчетаСрезПоследних.КадастровыйНомер КАК КадастровыйНомер
	|ИЗ
	|	РегистрСведений.СведенияКадастровогоУчета.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ИнвентарныйНомер = &ИнвентарныйНомер) КАК СведенияКадастровогоУчетаСрезПоследних";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_ПаспортаТранспортныхСредств()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПаспортаТранспортныхСредствСрезПоследних.Период КАК Период,
	|	ПаспортаТранспортныхСредствСрезПоследних.Организация КАК Организация,
	|	ПаспортаТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПаспортаТранспортныхСредствСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПаспортаТранспортныхСредствСрезПоследних.СерияНомер КАК СерияНомер
	|ИЗ
	|	РегистрСведений.ПаспортаТранспортныхСредств.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство
	|				И ИнвентарныйНомер = &ИнвентарныйНомер) КАК ПаспортаТранспортныхСредствСрезПоследних";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_СтавкиНалогаНаИмуществоПоОсновнымСредствам()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СтавкиНалогаНаИмуществоПоОсновнымСредствам.Регистратор КАК Регистратор,
	|	СтавкиНалогаНаИмуществоПоОсновнымСредствам.ПорядокНалогообложения КАК ПорядокНалогообложения,
	|	СтавкиНалогаНаИмуществоПоОсновнымСредствам.НалоговаяСтавка КАК НалоговаяСтавка
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмуществоПоОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОсновнымСредствам
	|ГДЕ
	|	СтавкиНалогаНаИмуществоПоОсновнымСредствам.Организация = &Организация
	|	И СтавкиНалогаНаИмуществоПоОсновнымСредствам.ОсновноеСредство = &ОсновноеСредство
	|	И СтавкиНалогаНаИмуществоПоОсновнымСредствам.ИнвентарныйНомер = &ИнвентарныйНомер
	|	И (СтавкиНалогаНаИмуществоПоОсновнымСредствам.Период <= &Период
	|	ИЛИ СтавкиНалогаНаИмуществоПоОсновнымСредствам.НачалоДействия <> ДАТАВРЕМЯ(1, 1, 1)
	|	И СтавкиНалогаНаИмуществоПоОсновнымСредствам.НачалоДействия <= &Период)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтавкиНалогаНаИмуществоПоОсновнымСредствам.Период УБЫВ,
	|	Регистратор УБЫВ";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_РегистрацияЗемельныхУчастков()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияЗемельныхУчастковСрезПоследних.Период КАК Период,
	|	РегистрацияЗемельныхУчастковСрезПоследних.Организация КАК Организация,
	|	РегистрацияЗемельныхУчастковСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РегистрацияЗемельныхУчастковСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РегистрацияЗемельныхУчастковСрезПоследних.НалоговыйОрган КАК НалоговыйОрган,
	|	РегистрацияЗемельныхУчастковСрезПоследних.КодПоОКАТО КАК КодПоОКАТО,
	|	РегистрацияЗемельныхУчастковСрезПоследних.НалоговаяСтавка КАК НалоговаяСтавка
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОсновноеСредство) КАК РегистрацияЗемельныхУчастковСрезПоследних";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_РегистрацияТранспортныхСредств()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияТранспортныхСредствСрезПоследних.Период КАК Период,
	|	РегистрацияТранспортныхСредствСрезПоследних.Организация КАК Организация,
	|	РегистрацияТранспортныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РегистрацияТранспортныхСредствСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РегистрацияТранспортныхСредствСрезПоследних.НалоговаяСтавка КАК НалоговаяСтавка
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(&Период, Организация = &Организация
	|	И ОсновноеСредство = &ОсновноеСредство
	|	И ИнвентарныйНомер = &ИнвентарныйНомер) КАК РегистрацияТранспортныхСредствСрезПоследних";
	
	Возврат ТекстЗапроса;
КонецФункции	

Функция ТекстЗапроса_Штрихкоды()
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Штрихкоды.ТипШтрихкода КАК ТипШтрихкода
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект = &ОсновноеСредство
	|	И Штрихкоды.ИнвентарныйНомер = &ИнвентарныйНомер";
	
	Возврат ТекстЗапроса;
КонецФункции	  

#КонецОбласти                                       

#Область ЗаполнениеРеквизитовФормОСиИнвНомеров

Процедура ЗаполнениеРеквизитов_ЕГРН(Форма, РезультатЗапроса)
	// ЕГРН
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		пЗаголовок = "Номер: " + Выборка.КадастровыйНомер; // 7 + 16 = 23 символов
		ЗначенияЗаполнения = Новый Структура("Период,Организация,ОсновноеСредство,ИнвентарныйНомер");
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Выборка);
		КлючЗаписи = РегистрыСведений.СведенияКадастровогоУчета.СоздатьКлючЗаписи(ЗначенияЗаполнения);
	Иначе
		пЗаголовок = "Не задано";
		КлючЗаписи = Неопределено;
	КонецЕсли;
	Форма.КлючиЗаписей.Вставить("КадастровыйУчет", КлючЗаписи);
	Форма.КадастровыйУчет = пЗаголовок;
КонецПроцедуры	

Процедура ПрочитатьДанныеОС_НМА_НПА(Форма, ЭтоФормаОС)
	Запрос = Новый Запрос;
	Запрос.Текст =
	ТекстЗапроса_СобытияОС() + ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапроса_СтоимостьОбъектовОС() + ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапроса_АмортизацияОбъектовОС() + ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапроса_СведенияКадастровогоУчета() + ОбщегоНазначения.РазделительПакетаЗапросов()   
	+ ТекстЗапроса_ПаспортаТранспортныхСредств() + ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапроса_СтавкиНалогаНаИмуществоПоОсновнымСредствам() + ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапроса_РегистрацияЗемельныхУчастков() + ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапроса_РегистрацияТранспортныхСредств() + ОбщегоНазначения.РазделительПакетаЗапросов()
	+ ТекстЗапроса_Штрихкоды();

	Если НЕ ЭтоФормаОС Тогда
		Организация      = Форма.Объект.Владелец;
		ОсновноеСредство = Форма.Объект.ОС;
		ИнвентарныйНомер = Форма.Объект.Ссылка;
	Иначе
		Организация      = Форма.Объект.Организация;
		ОсновноеСредство = Форма.Объект.Ссылка;
		ИнвентарныйНомер = Форма.ИнвентарныйНомер;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период"				, КонецДня(Форма.ДатаСведений));
	Запрос.УстановитьПараметр("Организация"			, Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство"	, ОсновноеСредство);
	Запрос.УстановитьПараметр("ИнвентарныйНомер"	, ИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	//Форма.КлючиЗаписей = Новый Структура;
	Элементы = Форма.Элементы;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	
	УстановитьОтображениеДатыСобытия(Форма, Элементы.ДатаПринятияКУчетуОбъектаОС);
	УстановитьОтображениеДатыСобытия(Форма, Элементы.ДатаВводаВЭксплуатациюОбъектаОС);
	УстановитьОтображениеДатыСобытия(Форма, Элементы.ДатаСписанияОбъектаОС);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Событие = Перечисления.ВидыСобытийОС.ПринятиеКУчету Тогда
			УстановитьОтображениеДатыСобытия(Форма, Элементы.ДатаПринятияКУчетуОбъектаОС, Выборка.ДатаСобытия);
			Форма.ДокументПринятияКУчетуОбъектаОС = Выборка.Регистратор;
		ИначеЕсли Выборка.Событие = Перечисления.ВидыСобытийОС.ВводВЭксплуатацию Тогда
			УстановитьОтображениеДатыСобытия(Форма, Элементы.ДатаВводаВЭксплуатациюОбъектаОС, Выборка.ДатаСобытия);
			Форма.ДокументВводаВЭксплуатациюОбектаОС = Выборка.Регистратор;
		ИначеЕсли Выборка.Событие = Перечисления.ВидыСобытийОС.Списание Тогда 
			УстановитьОтображениеДатыСобытия(Форма, Элементы.ДатаСписанияОбъектаОС, Выборка.ДатаСобытия);
			Форма.ДокументСписанияОбъектаОС = Выборка.Регистратор;
		КонецЕсли;
		
	КонецЦикла;
	
	// Стоимость
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Форма.ЦМО = Выборка.ЦМО;
		Форма.БалансоваяСтоимость = Выборка.БалансоваяСтоимость;
	Иначе
		Форма.ЦМО = Справочники.ЦМО.ПустаяСсылка();
		Форма.БалансоваяСтоимость = 0;
	КонецЕсли;
	
	// Амортизация и обесценение
	
	Выборка = РезультатЗапроса[2].Выбрать();
	Если Выборка.Следующий() Тогда
		Форма.СуммаАмортизации = Выборка.СуммаАмортизации;
		Форма.СуммаОбесценения = Выборка.СуммаОбесценения;
	Иначе
		Форма.СуммаАмортизации = 0;
		Форма.СуммаОбесценения = 0;
	КонецЕсли;
	
	// ЕГРН         
	ЗаполнениеРеквизитов_ЕГРН(Форма, РезультатЗапроса[3]);
	
	// ПТС
	Выборка = РезультатЗапроса[4].Выбрать();
	Если Выборка.Следующий() Тогда
		пЗаголовок = "Номер: " + Выборка.СерияНомер;
		ЗначенияЗаполнения = Новый Структура("Период,Организация,ОсновноеСредство,ИнвентарныйНомер");
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Выборка);
		КлючЗаписи = РегистрыСведений.ПаспортаТранспортныхСредств.СоздатьКлючЗаписи(ЗначенияЗаполнения);
	Иначе
		пЗаголовок = "Не задано";
		КлючЗаписи = Неопределено;
	КонецЕсли;
	Форма.КлючиЗаписей.Вставить("ПТС", КлючЗаписи);
	Форма.ПТС = пЗаголовок;
	
	
	// Налог на имущество
	Выборка = РезультатЗапроса[5].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ПорядокНалогообложения = Перечисления.ПорядокНалогообложенияИмущества.НеПодлежитНалогообложению Тогда
			пЗаголовок = "Не облагается";
		ИначеЕсли Выборка.ПорядокНалогообложения = Перечисления.ПорядокНалогообложенияИмущества.ПоОбщейСтавке Тогда
			пЗаголовок = "Общий";
		Иначе
			пЗаголовок = "По ставке: " + Выборка.НалоговаяСтавка;
		КонецЕсли;
		КлючЗаписи = Выборка.Регистратор;
	Иначе
		пЗаголовок = "Общий";
		КлючЗаписи = Неопределено;
	КонецЕсли;
	Форма.КлючиЗаписей.Вставить("НалогНаИмущество", КлючЗаписи);
	Форма.НалогНаИмущество = пЗаголовок;
	
	// Земельный налог
	Выборка = РезультатЗапроса[6].Выбрать();
	Если Выборка.Следующий() Тогда
		пЗаголовок = "Налоговая ставка: " + Выборка.НалоговаяСтавка;
		ЗначенияЗаполнения = Новый Структура("Период,Организация,ОсновноеСредство,ИнвентарныйНомер, НалоговыйОрган, КодПоОКАТО");
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Выборка);
		КлючЗаписи = РегистрыСведений.РегистрацияЗемельныхУчастков.СоздатьКлючЗаписи(ЗначенияЗаполнения);
	Иначе
		пЗаголовок = "Не облагается";
		КлючЗаписи = Неопределено;
	КонецЕсли;
	Форма.КлючиЗаписей.Вставить("ЗемельныйНалог", КлючЗаписи);
	Форма.ЗемельныйНалог = пЗаголовок;
	
	// Транспортный налог
	Выборка = РезультатЗапроса[7].Выбрать();
	Если Выборка.Следующий() Тогда
		пЗаголовок = "Налоговая ставка: " + Выборка.НалоговаяСтавка;
		ЗначенияЗаполнения = Новый Структура("Период,Организация,ОсновноеСредство,ИнвентарныйНомер");
		ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, Выборка);
		КлючЗаписи = РегистрыСведений.РегистрацияТранспортныхСредств.СоздатьКлючЗаписи(ЗначенияЗаполнения);
	Иначе
		пЗаголовок = "Не облагается";
		КлючЗаписи = Неопределено;
	КонецЕсли;
	Форма.КлючиЗаписей.Вставить("ТранспортныйНалог", КлючЗаписи);
	Форма.ТранспортныйНалог = пЗаголовок;
	
	// Штрихкоды
	Выборка = РезультатЗапроса[8].Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		ТекстНадписи = НСтр("ru = 'Не задано'");
	ИначеЕсли Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ТекстНадписи = НСтр("ru = 'Задан'") + " (" + Строка(Выборка.ТипШтрихкода) + ")";
	Иначе
		ТекстНадписи = НСтр("ru = 'Заданы'") + " (" + Строка(Выборка.Количество()) + ")";
	КонецЕсли;
	ЗначенияЗаполнения = Новый Структура("Объект,ИнвентарныйНомер,ТипШтрихкода",
		ОсновноеСредство, ИнвентарныйНомер, Выборка.ТипШтрихкода);
	ДанныеШтрихкоды = Новый Структура("Количество,ТипШтрихкода,КлючЗаписи", Выборка.Количество(),
		Выборка.ТипШтрихкода, РегистрыСведений.Штрихкоды.СоздатьКлючЗаписи(ЗначенияЗаполнения));
	Форма.КлючиЗаписей.Вставить("Штрихкоды", ДанныеШтрихкоды);
	
	Форма.Штрихкоды = ТекстНадписи;
	
КонецПроцедуры	

Процедура ПрочитатьДанныеКапвложения(Форма)
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса_СведенияКадастровогоУчета();

	Организация      = Форма.Объект.Организация;
	ОсновноеСредство = Форма.Объект.Ссылка;
	ИнвентарныйНомер = Форма.ИнвентарныйНомер;
	
	Запрос.УстановитьПараметр("Период"           , КонецДня(Форма.ДатаСведений));
	Запрос.УстановитьПараметр("Организация"      , Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство" , ОсновноеСредство);
	Запрос.УстановитьПараметр("ИнвентарныйНомер" , ИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// ЕГРН         
	ЗаполнениеРеквизитов_ЕГРН(Форма, РезультатЗапроса);
	
КонецПроцедуры	
	
#КонецОбласти                                       

Процедура ПрочитатьДанныеОбъекта(Форма) Экспорт

	Если СтрНайти(Форма.ИмяФормы, "ИнвентарныеНомераОС") > 0 Тогда
		ЭтоФормаОС = Ложь;
	ИначеЕсли СтрНайти(Форма.ИмяФормы, "ОсновныеСредства") > 0 Тогда
		ЭтоФормаОС = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	Форма.КлючиЗаписей = Новый Структура;
	Если ЭтоФормаОС И Форма.Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения") Тогда
		ПрочитатьДанныеКапвложения(Форма);
	Иначе
		ПрочитатьДанныеОС_НМА_НПА(Форма, ЭтоФормаОС);
	КонецЕсли;	
КонецПроцедуры

Процедура ПредставлениеПустыхДанныхОбъекта(Форма) Экспорт
	
	КлючиЗаписей = Новый Структура;
	КлючиЗаписей.Вставить("НалогНаИмущество"	, Неопределено);
	КлючиЗаписей.Вставить("ЗемельныйНалог"		, Неопределено);
	КлючиЗаписей.Вставить("ТранспортныйНалог"	, Неопределено);
	КлючиЗаписей.Вставить("КадастровыйУчет"		, Неопределено);
	КлючиЗаписей.Вставить("ПТС"					, Неопределено);
	КлючиЗаписей.Вставить("Штрихкоды"			, Неопределено);
	
	Форма.КлючиЗаписей = КлючиЗаписей;
	
	Форма.НалогНаИмущество	= "Не облагается";
	Форма.ЗемельныйНалог	= "Не облагается";
	Форма.ТранспортныйНалог	= "Не облагается";
	Форма.КадастровыйУчет	= "Не задано";
	Форма.ПТС				= "Не задано";
	Форма.Штрихкоды			= "Не задано";
	
	УстановитьОтображениеДатыСобытия(Форма, Форма.Элементы.ДатаПринятияКУчетуОбъектаОС);
	УстановитьОтображениеДатыСобытия(Форма, Форма.Элементы.ДатаВводаВЭксплуатациюОбъектаОС);
	УстановитьОтображениеДатыСобытия(Форма, Форма.Элементы.ДатаСписанияОбъектаОС);	
	
КонецПроцедуры

Процедура УстановитьОтображениеДатыСобытия(Форма, ЭлементДаты, ДатаСобытия = '00010101')
	
	Если ЗначениеЗаполнено(ДатаСобытия) Тогда
		Форма[ЭлементДаты.Имя] = Формат(ДатаСобытия, "ДЛФ=D");
		ЭлементДаты.Гиперссылка = Истина;
		ЭлементДаты.ЦветТекста = Новый Цвет;
	Иначе		
		Форма[ЭлементДаты.Имя] = НСтр("ru = 'Нет'");
		ЭлементДаты.Гиперссылка = Ложь;
		ЭлементДаты.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли