
//Одно задание

Процедура НачатьПодготовкуКОтправке(КонтекстВыполнения) Экспорт
	
	Если НЕ КонтекстВыполнения.Свойство("Версия") Тогда
		КонтекстВыполнения.Вставить("Версия",1.15);
	КонецЕсли;
	
	Если КонтекстВыполнения.Версия = 1.15 Тогда
		
		СертификатСущности = Неопределено;
		СертификатЗаголовка = Неопределено;
			
		Данные = ГосУслуги.ПолучитьДанныеПодготовки(КонтекстВыполнения.ЗаданиеНаЭкспортСсылка);
		
		Если НЕ Данные.Получить("НужнаПодготовка") Тогда
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
			Возврат;
		КонецЕсли;
		
		СоответствиеПараметров = Данные.Получить("СоответствиеПараметров");
		
		ОтпечатокПодписиСущностей = СоответствиеПараметров.Получить("ОтпечатокСущностей");
		
		ОтпечатокПодписиЗаголовка = СоответствиеПараметров.Получить("ОтпечатокЗаголовка");
		
		Если ОтпечатокПодписиСущностей = Неопределено И ОтпечатокПодписиЗаголовка = Неопределено Тогда
			//В параметрах не указано, что необходимо что-то подписывать, значит и подписывать ничего не будем
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
			Возврат;
		КонецЕсли;
		
		КонтекстВыполнения.Вставить("Данные", Данные);
		КонтекстВыполнения.Вставить("ОтпечатокПодписиСущностей", ОтпечатокПодписиСущностей);
		КонтекстВыполнения.Вставить("ОтпечатокПодписиЗаголовка", ОтпечатокПодписиЗаголовка);
		КонтекстВыполнения.Вставить("Результат", Истина);
		
		ЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(
			Новый ОписаниеОповещения("НачатьПодготовкуКОтправкеПослеСозданияМенеджераКриптографии",
				ЭтотОбъект, КонтекстВыполнения),"");
	
	ИначеЕсли КонтекстВыполнения.Версия = 1.16 Тогда
			
		// нужна другая процедура получения данных подготовки - с настройками из регистра НастройкаОрганизацийДляГИСГМП_УНП
		Данные = ГосУслуги.ПолучитьДанныеПодготовки_1_16(КонтекстВыполнения.ЗаданиеНаЭкспортСсылка);
	
		ПодписатьДанныеПоФормату_1_16(КонтекстВыполнения,Данные);
		
	Иначе
		ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
	КонецЕсли;	
КонецПроцедуры

Процедура ПодписатьДанныеПоФормату_1_16(КонтекстВыполнения,Данные)
	//если в файле - пакет начислений, то начисления по документам "Квитанция на оплату" и "Начисление от подведомственно" 
	//могут иметь различные сертификаты подписи - сущностей. Подпись заголовка всегда одна - подпись отправителя, которого следует получить по организации, 
	//выбранной в документе.
	//чтобы получить подписи сущностей - нужно выделять блоки сущностей, в них есть аттрибут ID - он формируется как  "N_" + ГУИД документа
	//из этих блоков можно по ГУИД найти документ и по документу опеределить сертификат.
		
		
	//Варианта 4:
	// 1 - подпись выполняется на клиенте, обращение к TSA серверу выполняется на клиенте
	// 2 - подпись выполняется на клиенте, обращение к TSA серверу выполняется на сервере
	// 3 - подпись выполняется на сервере, обращение к TSA серверу выполняется на клиенте
	// 4 - подпись выполняется на сервере, обращение к TSA серверу выполняется на сервере
	
	#Если ВебКлиент Тогда
		//обращение к TSA серверу выполняется только на сервере
		Данные["ОбращатьсяКTSAСерверуНаСервере"] = Истина;
	#КонецЕсли
	
	Если Данные["ОбращатьсяКTSAСерверуНаСервере"] = Истина
		И Данные["ПодписыватьСообщенияДляГИСГМПНаСервере"] = Истина Тогда
		//вариант 4
		СтруктураКонтекстаДляСервера = Новый Структура();
		Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
			СтруктураКонтекстаДляСервера.Вставить("ТекстОшибки",КонтекстВыполнения.ТекстОшибки);
		КонецЕсли;
		
		Результат  = ГосУслуги.ПодписатьДанныеПоФормату_1_16_НаСервере(СтруктураКонтекстаДляСервера,Данные);
		
		Для Каждого КлючИЗначение Из СтруктураКонтекстаДляСервера Цикл
			КонтекстВыполнения.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Результат);
				
	Иначе
		
		Если Данные["ПодписыватьСообщенияДляГИСГМПНаСервере"] = Ложь Тогда
			КомпонентаПодписи = КонтекстВыполнения.КомпонентаПодписи;
	    	
			Если КомпонентаПодписи = Неопределено Тогда
				ТекстОшибки = НСтр("ru='Не удалось создать компоненту для формирования электронной подписи.'");
				
				Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
					КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
				Иначе
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
				ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
				Возврат;
			Иначе
				//В версии 2.2.1.0 добавлено свойство СообщатьОбОшибке Булево и ТекстОшибки Строка
				КомпонентаПодписи.СообщатьОбОшибке = Ложь; //Если ложь, то компонента сама не будет выдавать сообщения об ошибке.
			КонецЕсли;
		КонецЕсли;
	
		ФайлыДляПереноса = Данные.Получить("ФайлыДанных");
		
		// а теперь парсим и ищем блоки подписей:
		//DoAcknowledgmentRequest - 1 элемент
		//ServiceCatalog - 1 элемент
		//Changes - 1 элемент
		//ExportRequest - 1 элемент
		//Charge - только тут могут быть разные сертификаты, а самих блоков в файле - несколько. Обрабатывается отдельно.
		
		МассивОдиночных = Новый Массив;
		МассивОдиночных.Добавить("DoAcknowledgmentRequest"); //квитирование		
		МассивОдиночных.Добавить("ExportRequest");  //запрос к системе
		МассивОдиночных.Добавить("ServiceCatalog"); //каталог услуг ИС РНИП или ИС УНП
		МассивОдиночных.Добавить("Changes");        //каталог услуг ИС РНИП или ИС УНП
				
		ВыражениеID = " Id=""";
		
		ТекПакетНачислений = Данные["ПакетНачислений"];
		
		СоответствиеОбновленныхФайлов = Новый Соответствие;
		
		НастройкиОтправителя = Данные["СоответствиеНастроекОтправителей"][Данные["Организация"]];
		
		//Принцип использования подписей участников следующий:
		//1) для подписи заголовка всегда используется сертификат заголовка отправителя - организации - прямого участника.
		//2) для подписи сущностей ExportRequest, DoAcknowledgmentRequest - всегда используется сертификат для подписи начислений отправителя - организации - прямого участника,
		//		т.к. предполагается, что все запросы к системе выполняет отправитель (АН - для себя, ГАН - для себя и подведомственных). 
		//		Такой сценарий был реализован для форматов 1.15, его и придерживаемся.
		//3) для подписи сущностей ServiceCatalog, Changes - всегда используется сертификат для подписи начислений отправителя - организации - прямого участника, 
		//		т.к. косвенного взаимодействия при обмене с ИС РНИП и ИС УНП не предусматривается.
		//4) для подписи начислений используется сертификат участника - сформировавшего начисление:
		//		- в документе "Квитанция на оплату" участник - в реквизите Организация - это может быть как участник прямого взаимодейстия, так и косвенного.
		//		- в документе "Начисление от подведомственного" участник - в реквизите Получатель - это участник косвенного взаимодействия.
		Отправитель = Неопределено;
		Если НастройкиОтправителя <> Неопределено Тогда
			ДанныеСертификатаСущности = НастройкиОтправителя.ДанныеСертификатаНачислений;
			ДанныеСертификатаЗаголовка= НастройкиОтправителя.ДанныеСертификатаСообщения;
			Отправитель = Данные["Организация"];
		Иначе
			НастройкиПодведомственного = Данные["СоответствиеНастроекПодведомственных"][Данные["Организация"]];
			
			Если НастройкиПодведомственного = Неопределено Тогда
				ТекстОшибки = "Для организации """ + Данные["Организация"]+""" не заданы настройки участника. Подпись не выполнена.";
						
				Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
					КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
				Иначе
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
			
				ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
				
				Возврат;
			КонецЕсли;                                                         
			
			НастройкиОтправителя = Данные["СоответствиеНастроекОтправителей"][НастройкиПодведомственного.Отправитель];			
			
			Если НастройкиОтправителя <> Неопределено Тогда
				ДанныеСертификатаЗаголовка = НастройкиОтправителя.ДанныеСертификатаСообщения;
				ДанныеСертификатаСущности = НастройкиОтправителя.ДанныеСертификатаНачислений;
				Отправитель = НастройкиПодведомственного.Отправитель;

			КонецЕсли;
		КонецЕсли;

		
		ПодписыватьXMLDSIG = Ложь;
		Тип_ЭП = Неопределено;
		Если Данные["СтруктураПараметровВидаОбмена"].Свойство("ТИП_ЭП",Тип_ЭП) Тогда
			ПодписыватьXMLDSIG = Тип_ЭП = "XMLDSIG";
		КонецЕсли;
		ИмяБлокаObject = "Object";
		ДлинаБлокаObject = СтрДлина(ИмяБлокаObject);
				
		Для Каждого КлючИЗначение ИЗ ФайлыДляПереноса Цикл
		    КонтекстВыполнения.Вставить("ИмяФайла",КлючИЗначение.Ключ);
			
			СодержимоеФайла = КлючИЗначение.Значение;
		
			ЕстьИзменения = Ложь;
			ФайлОбработан = Ложь;		
				
			Для Каждого ЭлМас Из МассивОдиночных Цикл
				НачальнаяПозиция = Найти(СодержимоеФайла,"<"+ЭлМас);
				Если НачальнаяПозиция = 0 Тогда
					Продолжить;
				КонецЕсли;
				ДлинаПодписываемогоТега = СтрДлина(ЭлМас);
				
				НачальныйБлок = Сред(СодержимоеФайла,1, НачальнаяПозиция-1);
		    	КонечнаяПозиция = Найти(СодержимоеФайла,"</"+ЭлМас+">");
				БлокПодписи = Сред(СодержимоеФайла,НачальнаяПозиция,КонечнаяПозиция+ДлинаПодписываемогоТега + 3 - НачальнаяПозиция);
				КонечныйБлок = Сред(СодержимоеФайла,КонечнаяПозиция + ДлинаПодписываемогоТега + 3);						
				
				Попытка
					
					ИдентификаторТекущейПодписи = "_" + Строка(Новый УникальныйИдентификатор()); 
					
					Если Данные["ПодписыватьСообщенияДляГИСГМПНаСервере"] = Истина Тогда
						
						СтруктураПодписи = ГосУслуги.ПодписатьБлокXML_XadesT(ИдентификаторТекущейПодписи,БлокПодписи,ЭлМас,ДанныеСертификатаСущности,"",Истина,Истина,НастройкиОтправителя.ПарольЭПНачисления);
						
						Если СтруктураПодписи.Свойство("ТекстОшибки") Тогда
							
							ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать элемент %1.
									|%2'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ЭлМас,СтруктураПодписи.ТекстОшибки);
							
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
							Возврат;
							
						Иначе					
							ТелоЗапроса64 = СтруктураПодписи.ТелоЗапроса64;
							Подпись = СтруктураПодписи.Подпись;
						КонецЕсли;
					Иначе
						КомпонентаПодписи.SignatureID = ИдентификаторТекущейПодписи;
						
						Попытка			
							КомпонентаПодписи.ПодписатьXadesT(
								БлокПодписи,
								ЭлМас,
								ДанныеСертификатаСущности,"",
								//Формат(ТекущаяДата(), "ДФ=yyyy-MM-ddTHH:mm:ss"),
								Истина,
								Истина,
								НастройкиОтправителя.ПарольЭПНачисления);
								
							Подпись = КомпонентаПодписи.Подпись;
							ТелоЗапроса64 = КомпонентаПодписи.ПолучитьТелоЗапросаКTSA();
						Исключение
							
							ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать элемент %1.
									|%2
									|Описание ошибки внешней компоненты: %3'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ЭлМас,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),КомпонентаПодписи.ТекстОшибки);
							
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
							Возврат;
						КонецПопытки;
					КонецЕсли;
					
					Если ПодписыватьXMLDSIG = Истина Тогда
					
						// XMLDSIG
						
						Подпись = Лев(Подпись,Найти(Подпись,"<"+ИмяБлокаObject)-1)+Сред(Подпись,Найти(Подпись,"</"+ИмяБлокаObject)+ДлинаБлокаObject+3);
						СодержимоеФайла = Сред(СодержимоеФайла, 1, КонечнаяПозиция - 1) + Подпись + Сред(СодержимоеФайла,КонечнаяПозиция);
					
					Иначе
						
						РезультатОтправки = ОтправитьЗапросКTSAСерверу(НастройкиОтправителя.АдресTSA,НастройкиОтправителя.СтруктураНастроекТSA,ТелоЗапроса64,ЭлМас,Данные["ОбращатьсяКTSAСерверуНаСервере"]);
						
						Если РезультатОтправки.Успех = Истина Тогда
							
							Если Данные["ПодписыватьСообщенияДляГИСГМПНаСервере"] = Истина Тогда
								ТекстОшибки = "";
								Подпись = ГосУслуги.ПоставитьШтампВремени(ИдентификаторТекущейПодписи,Подпись,РезультатОтправки.ТекстОтвета,ТекстОшибки);
								Если ЗначениеЗаполнено(ТекстОшибки) Тогда
									Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
										КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
									Иначе
										ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
									КонецЕсли;
							
									ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
									Возврат;
								КонецЕсли;
								
							Иначе
								Попытка
									КомпонентаПодписи.ПоставитьШтампВремени(РезультатОтправки.ТекстОтвета);
									Подпись = КомпонентаПодписи.Подпись;
								Исключение
									ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось поставить штамп времени в подпись элемента %1.
											|%2
											|Описание ошибки внешней компоненты: %3'");
									ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ЭлМас,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),КомпонентаПодписи.ТекстОшибки);
									
									Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
										КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
									Иначе
										ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
									КонецЕсли;
							
									ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
									Возврат;
								КонецПопытки;
							КонецЕсли;
							
							СодержимоеФайла = Сред(СодержимоеФайла, 1, КонечнаяПозиция - 1) + Подпись + Сред(СодержимоеФайла,КонечнаяПозиция);
								
						Иначе
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",РезультатОтправки.ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
							Возврат;
						КонецЕсли;
						
					КонецЕсли;
				Исключение
					
					ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать %1.
						|%2'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ЭлМас,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
					
					Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
						КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
					КонецЕсли;
			
					ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
									
					Возврат;					
				КонецПопытки;
						
				ФайлОбработан = Истина;
			КонецЦикла;
			
			Если НЕ ФайлОбработан Тогда
				// тут подписываем все Charge
				
				ПозицияПоиска = 1;
				
				ИмяУзла = "Charge";
				ДлинаТега = СтрДлина(ИмяУзла);
				
				Пока Истина Цикл
					НеОбработанныйТекст = Сред(СодержимоеФайла,ПозицияПоиска);
					
					НачальнаяПозиция = Найти(НеОбработанныйТекст,"<" + ИмяУзла);
					
					Если НачальнаяПозиция=0 Тогда
						Прервать;
					КонецЕсли;
					
					НачальныйБлок = Сред(НеОбработанныйТекст,1, НачальнаяПозиция-1);
				    КонечнаяПозиция = Найти(НеОбработанныйТекст,"</"+ИмяУзла+">");
					
					БлокПодписи = Сред(НеОбработанныйТекст,НачальнаяПозиция,КонечнаяПозиция+ДлинаТега + 3 - НачальнаяПозиция);
					КонечныйБлок = Сред(НеОбработанныйТекст,КонечнаяПозиция + ДлинаТега + 3);
					
					Если Найти(БлокПодписи,"Signature")>0 Тогда
						// это уже подписанное начисление, нужно искать следующее
						
						ПозицияПоиска = ПозицияПоиска + КонечнаяПозиция + ДлинаТега + 3;
						Продолжить;
					КонецЕсли;	
											
			        //нужно получить Id сущности - по нему получить участника - из участника получить сертификат начисления для подписи
					
					ПозицияНачалаВыраженияID = Найти(БлокПодписи,ВыражениеID);
					
					ТекГУИД = "";
					
					Если ПозицияНачалаВыраженияID>0 Тогда
						
						ТекГУИД = Сред(БлокПодписи,ПозицияНачалаВыраженияID+СтрДлина(ВыражениеID)+2,36);
						
						ТекУчастник = ТекПакетНачислений[ТекГУИД];
						
						НастройкиТекУчастника = Данные["СоответствиеНастроекОтправителей"][ТекУчастник];
				
						Если НастройкиТекУчастника = Неопределено Тогда
							
							НастройкиТекУчастника = Данные["СоответствиеНастроекПодведомственных"][ТекУчастник];
							
						КонецЕсли;
						
						ДанныеСертификатаСущности = НастройкиТекУчастника.ДанныеСертификатаНачислений;					
						
						Если НЕ ЗначениеЗаполнено(ДанныеСертификатаСущности) Тогда
							ТекстОшибки = НСтр("ru='Не удалось подписать начисление участника """+ТекУчастник+""".
							|Не задан сертификат подписи начислений.'");
											
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
							
							Возврат;
						КонецЕсли;
						
					КонецЕсли;					
					
					Если НЕ ЗначениеЗаполнено(НастройкиТекУчастника.АдресTSA) Тогда
						ТекстОшибки = НСтр("ru='Не удалось подписать начисление участника """+ТекУчастник+""".
						|Для участника не задан адрес TSA сервера для подписи начислений.'");
						
						Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
							КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
						Иначе
							ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
						КонецЕсли;
				
						ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
						Возврат;
					КонецЕсли;
					
					Попытка
						
					ИдентификаторТекущейПодписи = "_" + Строка(Новый УникальныйИдентификатор()); 
					
					Если Данные["ПодписыватьСообщенияДляГИСГМПНаСервере"] = Истина Тогда
						
						СтруктураПодписи = ГосУслуги.ПодписатьБлокXML_XadesT(ИдентификаторТекущейПодписи,БлокПодписи,ИмяУзла,ДанныеСертификатаСущности,"",Истина,Истина,НастройкиОтправителя.ПарольЭПНачисления);
						
						Если СтруктураПодписи.Свойство("ТекстОшибки") Тогда
							
							ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление.
									|%1'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,СтруктураПодписи.ТекстОшибки);
							
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
							Возврат;
							
						Иначе
							ТелоЗапроса64 = СтруктураПодписи.ТелоЗапроса64;
							Подпись = СтруктураПодписи.Подпись;
						КонецЕсли;
					Иначе
						КомпонентаПодписи.SignatureID = ИдентификаторТекущейПодписи;
						
						Попытка			
							КомпонентаПодписи.ПодписатьXadesT(
								БлокПодписи,
								ИмяУзла,
								ДанныеСертификатаСущности,"",
								//Формат(ТекущаяДата(), "ДФ=yyyy-MM-ddTHH:mm:ss"),
								Истина,
								Истина,
								НастройкиТекУчастника.ПарольЭПНачисления);
								
							Подпись = КомпонентаПодписи.Подпись;
							ТелоЗапроса64 = КомпонентаПодписи.ПолучитьТелоЗапросаКTSA();
						Исключение
							
							ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление.
									|%1
									|Описание ошибки внешней компоненты: %2'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),КомпонентаПодписи.ТекстОшибки);
							
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
							Возврат;
						КонецПопытки;
					КонецЕсли;
										
					Если ПодписыватьXMLDSIG = Истина Тогда
						// XMLDSIG
						Подпись = Лев(Подпись,Найти(Подпись,"<"+ИмяБлокаObject)-1)+Сред(Подпись,Найти(Подпись,"</"+ИмяБлокаObject)+ДлинаБлокаObject+3);
						СодержимоеФайла = Сред(СодержимоеФайла, 1, КонечнаяПозиция - 2 + ПозицияПоиска) + Подпись + Сред(СодержимоеФайла,КонечнаяПозиция+ПозицияПоиска-1);
			
						ПозицияПоиска = ПозицияПоиска + КонечнаяПозиция + ДлинаТега + 3 + СтрДлина(Подпись);
					
						ФайлОбработан = Истина;
						
					Иначе
						
						РезультатОтправки = ОтправитьЗапросКTSAСерверу(НастройкиОтправителя.АдресTSA,НастройкиОтправителя.СтруктураНастроекТSA,ТелоЗапроса64,"начисление",Данные["ОбращатьсяКTSAСерверуНаСервере"]);
						
						Если РезультатОтправки.Успех = Истина Тогда
							
							Если Данные["ПодписыватьСообщенияДляГИСГМПНаСервере"] = Истина Тогда
								ТекстОшибки = "";
								Подпись = ГосУслуги.ПоставитьШтампВремени(ИдентификаторТекущейПодписи,Подпись,РезультатОтправки.ТекстОтвета,ТекстОшибки);
								Если ЗначениеЗаполнено(ТекстОшибки) Тогда
									Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
										КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
									Иначе
										ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
									КонецЕсли;
							
									ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
									Возврат;
								КонецЕсли;
							Иначе
								
								Попытка
															
									КомпонентаПодписи.ПоставитьШтампВремени(РезультатОтправки.ТекстОтвета);
									Подпись = КомпонентаПодписи.Подпись;
									
								Исключение
									ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось поставить штамп времени в подпись начисления.
											|%1
											|Описание ошибки внешней компоненты: %2'");
									ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),КомпонентаПодписи.ТекстОшибки);
									
									Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
										КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
									Иначе
										ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
									КонецЕсли;
							
									ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
									Возврат;
								КонецПопытки;
							КонецЕсли;
													
							СодержимоеФайла = Сред(СодержимоеФайла, 1, КонечнаяПозиция - 2 + ПозицияПоиска) + Подпись + Сред(СодержимоеФайла,КонечнаяПозиция+ПозицияПоиска-1);
				
							ПозицияПоиска = ПозицияПоиска + КонечнаяПозиция + ДлинаТега + 3 + СтрДлина(Подпись);
						
							ФайлОбработан = Истина;
								
						Иначе
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",РезультатОтправки.ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
							Возврат;
						КонецЕсли;						
									
					КонецЕсли;
					
					Исключение
					
						ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление.
						|%1'");
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
						Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
							КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
						Иначе
							ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
						КонецЕсли;
				
						ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
						Возврат;					
					КонецПопытки;
				КонецЦикла;	
			КонецЕсли;
			
			
			//тут подписываем тело
			Если НЕ ЗначениеЗаполнено(ДанныеСертификатаЗаголовка) Тогда
				ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
				|Для участника """+Отправитель+""" не задан сертификат подписи всего сообщения.'");
								
				Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
					КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
				Иначе
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;
		
				ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
				
				Возврат;
			КонецЕсли;
			
			
			Если Найти(СодержимоеФайла,"<soapenv:Body")>0 Тогда
				НачальныйЗаголовок = "";
				Если Найти(СодержимоеФайла,"<?xml")>0 Тогда
					Позиция = Найти(СодержимоеФайла, "?>");
					Количество = 2;
					Если Сред(СодержимоеФайла,Позиция+2,1)=Символы.ПС Тогда
						Количество = 3;
					КонецЕсли;
					НачальныйЗаголовок = Лев(СодержимоеФайла,Позиция+2);
					СодержимоеФайлаБезЗаголовка = Сред(СодержимоеФайла,Позиция+Количество);
				КонецЕсли;
				
				ПозицияУТМ = Найти(СодержимоеФайлаБезЗаголовка,"<n1:GISGMPTransferMsg");
				ТекстДоУТМ = Лев(СодержимоеФайлаБезЗаголовка,ПозицияУТМ);
				ТекстДоУТМ = СтрЗаменить(СтрЗаменить(ТекстДоУТМ,Символы.ПС,""),Символы.Таб,"");
				
				ПозицияКонецУТМ = Найти(СодержимоеФайлаБезЗаголовка,"</n1:GISGMPTransferMsg");
				ТекстКонец = Сред(СодержимоеФайлаБезЗаголовка,ПозицияКонецУТМ);
				ТекстКонец = СтрЗаменить(СтрЗаменить(ТекстКонец,Символы.ПС,""),Символы.Таб,"");
				
				ТекстСередина = Сред(СодержимоеФайлаБезЗаголовка,ПозицияУТМ+1,ПозицияКонецУТМ-1-ПозицияУТМ);
				СодержимоеФайлаБезЗаголовка = ТекстДоУТМ + ТекстСередина+ТекстКонец;
				
							
				//Вставляем сертификат в заголовок
				СодержимоеФайлаБезЗаголовка = СтрЗаменить(СодержимоеФайлаБезЗаголовка,"%СертификатЗаголовка%",ДанныеСертификатаЗаголовка);
								
				ИмяИскомогоТега = "</wsse:BinarySecurityToken>";
				ДлинаИскомогоТега = СтрДлина(ИмяИскомогоТега);
				
				НачальнаяПозиция = Найти(СодержимоеФайлаБезЗаголовка, ИмяИскомогоТега);
				НачальныйБлок  = Сред(СодержимоеФайлаБезЗаголовка,1, НачальнаяПозиция+ДлинаИскомогоТега-1);
				
				КонечнаяПозиция = НачальнаяПозиция+ДлинаИскомогоТега;
				КонечныйБлок = СокрЛ(Сред(СодержимоеФайлаБезЗаголовка,КонечнаяПозиция));
				
				БлокПодписи = "";
				Попытка
					
					Подпись = "";
					ПодписалиЗаголовок = Ложь;
					Если Данные["ПодписыватьСообщенияДляГИСГМПНаСервере"] = Истина Тогда
						ТекстОшибки = "";
						Подпись = ГосУслуги.УстановитьПодписьXMLDSign(СодержимоеФайлаБезЗаголовка,"Body",ДанныеСертификатаЗаголовка, Ложь, Ложь,ПодписалиЗаголовок,НастройкиОтправителя.ПарольЭПСообщения,ТекстОшибки);
						Если ЗначениеЗаполнено(ТекстОшибки) Тогда
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
							Возврат;
						КонецЕсли;
						
					Иначе
						Попытка
							ПодписалиЗаголовок =  КомпонентаПодписи.XMLDSign(СодержимоеФайлаБезЗаголовка, "Body", ДанныеСертификатаЗаголовка, Ложь, Ложь,НастройкиОтправителя.ПарольЭПСообщения);
							Если ПодписалиЗаголовок Тогда
								Подпись = КомпонентаПодписи.Sign;
							КонецЕсли;
						Исключение
							ТекстОшибки = НСтр("ru='Не удалось подписать заголовок soap-пакета.
											|%1
											|Описание ошибки внешней компоненты: %2'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),КомпонентаПодписи.ТекстОшибки);
							
							Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
								КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
							Иначе
								ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							КонецЕсли;
					
							ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
												
							Возврат;
						КонецПопытки;
					КонецЕсли;
							
					//Подпись заголовка soap-пакета внешней компонентой
					Если ПодписалиЗаголовок = Истина Тогда
						СодержимоеФайла = НачальныйЗаголовок + НачальныйБлок + Подпись + КонечныйБлок;
						ЕстьИзменения = Истина;
					Иначе
						
						ТекстОшибки = НСтр("ru='Не удалось подписать заголовок soap-пакета.'");
							
						Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
							КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
						Иначе
							ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
						КонецЕсли;
				
						ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
											
						Возврат;
						
					КонецЕсли;				
				Исключение
					
					ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать заголовок soap-пакета.
						|%1'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
											
					Если КонтекстВыполнения.Свойство("ТекстОшибки") Тогда
						КонтекстВыполнения.Вставить("ТекстОшибки",ТекстОшибки);
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
					КонецЕсли;
			
					ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
										
					Возврат;
						
				КонецПопытки;
				ФайлОбработан = Истина;
			КонецЕсли;
			
			
			Если ФайлОбработан Тогда 
				СоответствиеОбновленныхФайлов.Вставить(КлючИЗначение.Ключ,СодержимоеФайла);
			КонецЕсли;
		КонецЦикла;
		Если СоответствиеОбновленныхФайлов.Количество()>0 Тогда
			//Записать изменения
			ГосУслуги.ОбновитьПрисоединенныеФайлы(СоответствиеОбновленныхФайлов);
		КонецЕсли;
		
		ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
	КонецЕсли;	
	
КонецПроцедуры

Функция ОтправитьЗапросКTSAСерверу(АдресTSA,СтруктураНастроекТSA,ТелоЗапроса64,ИмяБлока,ОтправлятьНаСервере) Экспорт
	//ТелоЗапроса64 - строка в Base64, если подписывается на клиенте
	// и двоичные данные, если подписывается на сервере
	
	Если ТипЗнч(ТелоЗапроса64) = Тип("Строка") Тогда
		ТелоЗапросаДвоичныеДанные = Base64Значение(ТелоЗапроса64);
	Иначе
		ТелоЗапросаДвоичныеДанные = ТелоЗапроса64;
	КонецЕсли;
		
	Если ОтправлятьНаСервере = Истина Тогда
		СтруктураНастроек = Новый Структура;
		СтруктураНастроек.Вставить("АдресTSA",АдресTSA);
		СтруктураНастроек.Вставить("СтруктураНастроекТSA",СтруктураНастроекТSA);
		//ТелоЗапросаДвоичныеДанные = Base64Значение(ТелоЗапроса64);
		Результат = ГосУслуги.ОтправитьЗапросКTSAСерверу(СтруктураНастроек,ТелоЗапросаДвоичныеДанные,ИмяБлока);
	Иначе
		ТекПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси(АдресTSA);
												
		СоединениеHTTP = Новый HTTPСоединение(СтруктураНастроекТSA.Хост,СтруктураНастроекТSA.Порт,,,ТекПрокси,90);					
								
			// формируем запрос к серверу TSA
		ЗаголовокHTTP 	= Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type", "application/timestamp-query");
		ЗаголовокHTTP.Вставить("Host", СтруктураНастроекТSA.Хост);
		
		ЗапросHTTP = Новый HTTPЗапрос(СтруктураНастроекТSA.АдресРесурса, ЗаголовокHTTP);
		
		ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ТелоЗапросаДвоичныеДанные);
			// обращаемся к серверу TSA и получаем ответ
			
		Результат = Новый Структура("Успех,ТекстОшибки,ТекстОтвета");
		ОтветHTTP = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
		Если ОтветHTTP.КодСостояния = 200 Тогда
			Результат.Успех = Истина;
			Ответ = ОтветHTTP.ПолучитьТелоКакДвоичныеДанные();
							
			Результат.ТекстОтвета = Base64Строка(Ответ);
			
		Иначе
			Результат.Успех = Ложь;
			ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать """+ИмяБлока+""".
			| TSA сервер вернул ошибку: (" + ОтветHTTP.КодСостояния + ") - " + ОтветHTTP.ПолучитьТелоКакСтроку()+"'");
			
			Результат.ТекстОшибки = ТекстОшибки;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НачатьПодготовкуКОтправкеПослеСозданияМенеджераКриптографии(МенеджерКриптографии, КонтекстВыполнения) Экспорт
	
	Если ТипЗнч(МенеджерКриптографии) <> Тип("МенеджерКриптографии") Тогда
		ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);		
		Возврат;
	КонецЕсли;	
		
	мХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	
	Если ЗначениеЗаполнено(КонтекстВыполнения.ОтпечатокПодписиСущностей) Тогда
		ДвоичныеДанныеОтпечаткаСущности = Base64Значение(КонтекстВыполнения.ОтпечатокПодписиСущностей);
		СертификатСущности = мХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечаткаСущности);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(КонтекстВыполнения.ОтпечатокПодписиЗаголовка) Тогда
		ДвоичныеДанныеОтпечаткаЗаголовка = Base64Значение(КонтекстВыполнения.ОтпечатокПодписиЗаголовка);
		СертификатЗаголовка = мХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечаткаЗаголовка);
	КонецЕсли;
		
    СущностьНеПодписана = Ложь;
	Если КонтекстВыполнения.ОтпечатокПодписиСущностей<>Неопределено И СертификатСущности = Неопределено Тогда
		СущностьНеПодписана = Истина;
	КонецЕсли;
	
	ЗаголовокНеПодписан = Ложь;
	Если КонтекстВыполнения.ОтпечатокПодписиЗаголовка<>Неопределено И СертификатЗаголовка = Неопределено Тогда
		ЗаголовокНеПодписан = Истина;
	КонецЕсли;
	
	ФайлыДляПереноса = КонтекстВыполнения.Данные.Получить("ФайлыДанных");
	
	СоответствиеОбновленныхФайлов = Новый Соответствие;
	
	ДанныеСертификатаСущности = "";	
	Если СертификатСущности <> Неопределено Тогда
		ДанныеСертификатаСущности = Base64Строка(СертификатСущности.Выгрузить());
		ДанныеСертификатаСущности = СтрЗаменить(ДанныеСертификатаСущности,Символы.ВК,"");
	КонецЕсли;
	
	ДанныеСертификатаЗаголовка = "";
	Если СертификатЗаголовка <> Неопределено Тогда
		ДанныеСертификатаЗаголовка = Base64Строка(СертификатЗаголовка.Выгрузить());
		ДанныеСертификатаЗаголовка = СтрЗаменить(ДанныеСертификатаЗаголовка,Символы.ВК,"");
	КонецЕсли;
	
	//
	
	Попытка
		КомпонентаПодписи = СоздатьОбъектДляПодписиXMLDSIG();
		Если КомпонентаПодписи = Неопределено Тогда
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
			Возврат;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось создать компоненту для формирования электронной подписи.'"));
	    ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
		Возврат;
	КонецПопытки;
	
	Для Каждого КлючИЗначение ИЗ ФайлыДляПереноса Цикл
		
		СодержимоеФайла = КлючИЗначение.Значение;
		
		ЕстьИзменения = Ложь;
				
		//Подпись начисления (документ "Квитанция на оплату")
		Если Найти(СодержимоеФайла,"<Charge")>0 И СущностьНеПодписана Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать начисление. Не найден сертификат для подписи сущности по установленному отпечатку. Проверьте установленные сертификаты.'"));
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
			Возврат;
		ИначеЕсли Найти(СодержимоеФайла,"<Catalog")>0 И СущностьНеПодписана Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать каталог услуг. Не найден сертификат для подписи сущности по установленному отпечатку. Проверьте установленные сертификаты.'"));	
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
			Возврат;
		Иначе
			
			ТегИмпортРеквест = "pirs:ImportRequest";
			ДлинаТегаИмпортРеквест = СтрДлина(ТегИмпортРеквест)+1; 
			
			НачальнаяПозиция = Найти(СодержимоеФайла,"<" + ТегИмпортРеквест);
			НачальныйБлок = Сред(СодержимоеФайла,1, НачальнаяПозиция-1);
		    КонечнаяПозиция = Найти(СодержимоеФайла,"</"+ТегИмпортРеквест+">");
			БлокПодписи = Сред(СодержимоеФайла,НачальнаяПозиция,КонечнаяПозиция+ДлинаТегаИмпортРеквест + 2 -НачальнаяПозиция);
			КонечныйБлок = Сред(СодержимоеФайла,КонечнаяПозиция + ДлинаТегаИмпортРеквест + 2);
			
			
			Если Найти(СодержимоеФайла,"<Charge")>0 И СертификатСущности <> Неопределено Тогда
			    Попытка
				    //Тут будет подпись сущности внешней компонентой
					Если КомпонентаПодписи.XMLDSign(БлокПодписи, "Charge", ДанныеСертификатаСущности, Истина, Истина) Тогда
						СодержимоеФайла = НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
						ЕстьИзменения = Истина;
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать начисление.'"));
						ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
						Возврат;
					КонецЕсли;
				Исключение
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление.'"));
					ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
					Возврат;					
				КонецПопытки;
				
			КонецЕсли;
			
			// Подпись каталога услуг
			Если Найти(СодержимоеФайла,"<ServiceCatalog")>0 И СертификатСущности <> Неопределено Тогда		
                Попытка
					//Подпись сущности внешней компонентой
					Если КомпонентаПодписи.XMLDSign(БлокПодписи, "ServiceCatalog", ДанныеСертификатаСущности, Истина, Истина) Тогда
						СодержимоеФайла = НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
						ЕстьИзменения = Истина;
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать каталог услуг.'"));
						ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
						Возврат;
					КонецЕсли;
				Исключение
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать каталог услуг.'"));
					ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
					Возврат;					
				КонецПопытки;								
			КонецЕсли;
			
			// Подпись измененного каталога услуг
			Если Найти(СодержимоеФайла,"<Changes")>0 И СертификатСущности <> Неопределено Тогда
				Попытка
					//Подпись сущности внешней компонентой
					Если КомпонентаПодписи.XMLDSign(БлокПодписи, "Changes", ДанныеСертификатаСущности, Истина, Истина) Тогда
						СодержимоеФайла = НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
						ЕстьИзменения = Истина;
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать каталог услуг.'"));
						ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
						Возврат;
					КонецЕсли;
				Исключение
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать каталог услуг.'"));
					ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
					Возврат;					
				КонецПопытки;	
			КонецЕсли;
		КонецЕсли;
		
		
		Если Найти(СодержимоеФайла,"<soapenv:Body")>0 И ЗаголовокНеПодписан Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать soap-пакет. Не найден сертификат для подписи заголовка soap-пакета по установленному отпечатку. Проверьте установленные сертификаты.'"));	
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
			Возврат;
		Иначе
			
			Если Найти(СодержимоеФайла,"<soapenv:Body")>0 И СертификатЗаголовка <> Неопределено Тогда
				НачальныйЗаголовок = "";
				Если Найти(СодержимоеФайла,"<?xml")>0 Тогда
					Позиция = Найти(СодержимоеФайла, "?>");
					Количество = 2;
					Если Сред(СодержимоеФайла,Позиция+2,1)=Символы.ПС Тогда
						Количество = 3;
					КонецЕсли;
					НачальныйЗаголовок = Лев(СодержимоеФайла,Позиция+2);
					СодержимоеФайлаБезЗаголовка = Сред(СодержимоеФайла,Позиция+Количество);
				КонецЕсли;
				
				ПозицияУТМ = Найти(СодержимоеФайлаБезЗаголовка,"<n1:UnifoTransferMsg");
				ТекстДоУТМ = Лев(СодержимоеФайлаБезЗаголовка,ПозицияУТМ);
				ТекстДоУТМ = СтрЗаменить(СтрЗаменить(ТекстДоУТМ,Символы.ПС,""),Символы.Таб,"");
				
				ПозицияКонецУТМ = Найти(СодержимоеФайлаБезЗаголовка,"</n1:UnifoTransferMsg");
				ТекстКонец = Сред(СодержимоеФайлаБезЗаголовка,ПозицияКонецУТМ);
				ТекстКонец = СтрЗаменить(СтрЗаменить(ТекстКонец,Символы.ПС,""),Символы.Таб,"");
				
				ТекстСередина = Сред(СодержимоеФайлаБезЗаголовка,ПозицияУТМ+1,ПозицияКонецУТМ-1-ПозицияУТМ);
				СодержимоеФайлаБезЗаголовка = ТекстДоУТМ + ТекстСередина+ТекстКонец;
				
							
				//Вставляем сертификат в заголовок
				СодержимоеФайлаБезЗаголовка = СтрЗаменить(СодержимоеФайлаБезЗаголовка,"%СертификатЗаголовка%",ДанныеСертификатаЗаголовка);
								
				ИмяИскомогоТега = "</wsse:BinarySecurityToken>";
				ДлинаИскомогоТега = СтрДлина(ИмяИскомогоТега);
				
				НачальнаяПозиция = Найти(СодержимоеФайлаБезЗаголовка, ИмяИскомогоТега);
				НачальныйБлок  = Сред(СодержимоеФайлаБезЗаголовка,1, НачальнаяПозиция+ДлинаИскомогоТега-1);
				
				КонечнаяПозиция = НачальнаяПозиция+ДлинаИскомогоТега;
				КонечныйБлок = СокрЛ(Сред(СодержимоеФайлаБезЗаголовка,КонечнаяПозиция));
				
				БлокПодписи = "";
				Попытка
					//Подпись заголовка soap-пакета внешней компонентой
					Если КомпонентаПодписи.XMLDSign(СодержимоеФайлаБезЗаголовка, "Body", ДанныеСертификатаЗаголовка, Ложь, Ложь) Тогда
						СодержимоеФайла = НачальныйЗаголовок + НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
						ЕстьИзменения = Истина;
					Иначе
						ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать заголовок soap-пакета.'"));
						ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
						Возврат;
					КонецЕсли;				
				Исключение
					ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать заголовок soap-пакета.'"));
					ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
					Возврат;					
				КонецПопытки;				
			КонецЕсли;
		КонецЕсли;
		
		// Это надо на сервере
		Если ЕстьИзменения Тогда 
			СоответствиеОбновленныхФайлов.Вставить(КлючИЗначение.Ключ,СодержимоеФайла);
		КонецЕсли;
				
	КонецЦикла;
	
	Если СоответствиеОбновленныхФайлов.Количество()>0 Тогда
		//Записать изменения
		ГосУслуги.ОбновитьПрисоединенныеФайлы(СоответствиеОбновленныхФайлов);
	КонецЕсли;
	
	ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
		
КонецПроцедуры

//

Процедура ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Результат)
	
	КонтекстВыполнения.Вставить("Результат",Результат);
	
	Если КонтекстВыполнения.Свойство("ПослеПодготовкиЗадания") Тогда
		ВыполнитьОбработкуОповещения(КонтекстВыполнения.ПослеПодготовкиЗадания,КонтекстВыполнения);

	ИначеЕсли КонтекстВыполнения.Свойство("ПродолжитьПослеПодготовки") Тогда
		ВыполнитьОбработкуОповещения(КонтекстВыполнения.ПродолжитьПослеПодготовки,Результат);
	КонецЕсли;
	
КонецПроцедуры

//список заданий

Процедура НачатьПодготовкуКОтправкеСпискаЗаданий(КонтекстВыполнения) Экспорт
	
	Если НЕ КонтекстВыполнения.Свойство("Версия") Тогда
		КонтекстВыполнения.Вставить("Версия",1.15);
	КонецЕсли;
	
	Если КонтекстВыполнения.Версия = 1.15 Тогда
		
		СертификатСущности = Неопределено;
		СертификатЗаголовка = Неопределено;
			
		Данные = ГосУслуги.ПолучитьДанныеПодготовкиСпискаЗаданий(КонтекстВыполнения.СписокЗаданий,КонтекстВыполнения.НастройкаОбмена);
		
		Если НЕ Данные.Получить("НужнаПодготовка") Тогда
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
			Возврат;
		КонецЕсли;
		
		СоответствиеПараметров = Данные.Получить("СоответствиеПараметров");
		
		ОтпечатокПодписиСущностей = СоответствиеПараметров.Получить("ОтпечатокСущностей");
		
		ОтпечатокПодписиЗаголовка = СоответствиеПараметров.Получить("ОтпечатокЗаголовка");
		
		Если ОтпечатокПодписиСущностей = Неопределено И ОтпечатокПодписиЗаголовка = Неопределено Тогда
			//В параметрах не указано, что необходимо что-то подписывать, значит и подписывать ничего не будем
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
			Возврат;
		КонецЕсли;

		КонтекстВыполнения.Вставить("Данные", Данные);
		КонтекстВыполнения.Вставить("ОтпечатокПодписиСущностей", ОтпечатокПодписиСущностей);
		КонтекстВыполнения.Вставить("ОтпечатокПодписиЗаголовка", ОтпечатокПодписиЗаголовка);
		КонтекстВыполнения.Вставить("Результат", Истина);
		
		ЭлектроннаяПодписьКлиент.СоздатьМенеджерКриптографии(
			Новый ОписаниеОповещения("НачатьПодготовкуКОтправкеСпискаЗаданийПослеСозданияМенеджераКриптографии",
				ЭтотОбъект, КонтекстВыполнения),"");
				
	ИначеЕсли КонтекстВыполнения.Версия = 1.16 Тогда

		СоответствиеЗаданий = ГосУслуги.ПолучитьДанныеПодготовкиСпискаЗаданий_1_16(КонтекстВыполнения.СписокЗаданий);
			
		//Подменяем общую обработку оповещения на свою и обрабатываем задания в цикле. 
		//После обработки каждого задания пишем результат обработки этого задания и текст ошибок.
		//После обработки всех заданий выполняем общую обработку.
		
		ПродолжатьПослеОбработки = Неопределено;
		КонтекстВыполнения.Свойство("ПродолжитьПослеПодготовки",ПродолжатьПослеОбработки);
		КонтекстВыполнения.Вставить("СтруктураРезультата","Результат,ТекстОшибки,ИмяФайла");
		КонтекстВыполнения.Вставить("СоответствиеРезультатовПодготовки", Новый Соответствие);
		
		КонтекстВыполнения.Вставить("ПослеПодготовкиЗадания",Новый ОписаниеОповещения("ПослеПодготовкиЗадания", ЭтотОбъект));	
		
		Для Каждого КлючИЗначение Из СоответствиеЗаданий Цикл
			КонтекстВыполнения.Вставить("ТекущееЗадание",КлючИЗначение.Ключ);
			КонтекстВыполнения.Вставить("ТекстОшибки","");
			КонтекстВыполнения.Вставить("ИмяФайла","");
			ПодписатьДанныеПоФормату_1_16(КонтекстВыполнения,КлючИЗначение.Значение);
		КонецЦикла;
		
		ЕстьОшибки = ГосУслуги.ПродолжениеПодготовкиФайлов_1_16(КонтекстВыполнения.СоответствиеРезультатовПодготовки);
		
		Если ПродолжатьПослеОбработки<>Неопределено Тогда
			ВыполнитьОбработкуОповещения(ПродолжатьПослеОбработки,НЕ ЕстьОшибки);
		КонецЕсли;
		
	Иначе
		ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Истина);
	КонецЕсли;

КонецПроцедуры

Процедура ПослеПодготовкиЗадания(КонтекстВыполнения,ДопПараметр) Экспорт
	СтруктураРезультата = Новый Структура(КонтекстВыполнения.СтруктураРезультата);
	ЗаполнитьЗначенияСвойств(СтруктураРезультата,КонтекстВыполнения);
	КонтекстВыполнения.СоответствиеРезультатовПодготовки.Вставить(КонтекстВыполнения.ТекущееЗадание,СтруктураРезультата);
КонецПроцедуры

Процедура НачатьПодготовкуКОтправкеСпискаЗаданийПослеСозданияМенеджераКриптографии(МенеджерКриптографии, КонтекстВыполнения) Экспорт
	
	Если ТипЗнч(МенеджерКриптографии) <> Тип("МенеджерКриптографии") Тогда
		ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);		
		Возврат;
	КонецЕсли;
	
	мХранилищеСертификатов = МенеджерКриптографии.ПолучитьХранилищеСертификатов();
	
	Если ЗначениеЗаполнено(КонтекстВыполнения.ОтпечатокПодписиСущностей) Тогда
		ДвоичныеДанныеОтпечаткаСущности = Base64Значение(КонтекстВыполнения.ОтпечатокПодписиСущностей);
		СертификатСущности = мХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечаткаСущности);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(КонтекстВыполнения.ОтпечатокПодписиЗаголовка) Тогда
		ДвоичныеДанныеОтпечаткаЗаголовка = Base64Значение(КонтекстВыполнения.ОтпечатокПодписиЗаголовка);
		СертификатЗаголовка = мХранилищеСертификатов.НайтиПоОтпечатку(ДвоичныеДанныеОтпечаткаЗаголовка);
	КонецЕсли;
		
    СущностьНеПодписана = Ложь;
	Если КонтекстВыполнения.ОтпечатокПодписиСущностей<>Неопределено И СертификатСущности = Неопределено Тогда
		СущностьНеПодписана = Истина;
	КонецЕсли;
	
	ЗаголовокНеПодписан = Ложь;
	Если КонтекстВыполнения.ОтпечатокПодписиЗаголовка<>Неопределено И СертификатЗаголовка = Неопределено Тогда
		ЗаголовокНеПодписан = Истина;
	КонецЕсли;
	
	СоответствияЗаданийИФайлов = КонтекстВыполнения.Данные.Получить("ЗаданияИФайлы");
	ДанныеСертификатаСущности = "";	
	Если СертификатСущности <> Неопределено Тогда
		ДанныеСертификатаСущности = Base64Строка(СертификатСущности.Выгрузить());
		ДанныеСертификатаСущности = СтрЗаменить(ДанныеСертификатаСущности,Символы.ВК,"");
	КонецЕсли;
	
	ДанныеСертификатаЗаголовка = "";
	Если СертификатЗаголовка <> Неопределено Тогда
		ДанныеСертификатаЗаголовка = Base64Строка(СертификатЗаголовка.Выгрузить());
		ДанныеСертификатаЗаголовка = СтрЗаменить(ДанныеСертификатаЗаголовка,Символы.ВК,"");
	КонецЕсли;
	
	//
	Попытка
		КомпонентаПодписи = СоздатьОбъектДляПодписиXMLDSIG();
		Если КомпонентаПодписи = Неопределено Тогда
			ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Ложь);
			Возврат;
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось создать компоненту для формирования электронной подписи.'"));
	    КомпонентаПодписи = Неопределено;
	КонецПопытки;
	//Если КомпонентаПодписи = Неопределено Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	СоответствиеРезультатовПодготовки = Новый Соответствие;
	
	СоответствиеОбновленныхФайлов = Новый Соответствие;	
	
	МассивНеПодписанных = Новый Массив;
	
	Для Каждого ГлКлючИЗначение Из СоответствияЗаданийИФайлов Цикл
	
		ФайлыДляПереноса = ГлКлючИЗначение.Значение;
			
		СоответствиеРезультатовПодготовкиПоЗаданию = Новый Соответствие;
		
		Для Каждого КлючИЗначение ИЗ ФайлыДляПереноса Цикл
			
			Если КомпонентаПодписи = Неопределено Тогда
				ТекстОшибки = НСтр("ru='Не удалось подключить компоненту для формирования ЭП. Подпись не выполнена'");
				СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
				Если МассивНеПодписанных.Найти(ГлКлючИЗначение.Ключ)=Неопределено Тогда
					МассивНеПодписанных.Добавить(ГлКлючИЗначение.Ключ);
				КонецЕсли;
				Продолжить;
			КонецЕсли;
						
			СодержимоеФайла = КлючИЗначение.Значение;
			
			ЕстьИзменения = Ложь;
					
			//Подпись начисления (документ "Квитанция на оплату")
			Если Найти(СодержимоеФайла,"<Charge")>0 И СущностьНеПодписана Тогда
				ТекстОшибки = НСтр("ru='Не удалось подписать начисление. Не найден сертификат для подписи сущности по установленному отпечатку. Проверьте установленные сертификаты.'");
				//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать начисление. Не найден сертификат для подписи сущности по установленному отпечатку. Проверьте установленные сертификаты.'"));
				СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
				Если МассивНеПодписанных.Найти(ГлКлючИЗначение.Ключ)=Неопределено Тогда
					МассивНеПодписанных.Добавить(ГлКлючИЗначение.Ключ);
				КонецЕсли;
				//Возврат Ложь;
				Продолжить;
			ИначеЕсли Найти(СодержимоеФайла,"<Catalog")>0 И СущностьНеПодписана Тогда
				//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать каталог услуг. Не найден сертификат для подписи сущности по установленному отпечатку. Проверьте установленные сертификаты.'"));	
				//Возврат Ложь;
				Если МассивНеПодписанных.Найти(ГлКлючИЗначение.Ключ)=Неопределено Тогда
					МассивНеПодписанных.Добавить(ГлКлючИЗначение.Ключ);
				КонецЕсли;
				ТекстОшибки = НСтр("ru='Не удалось подписать каталог услуг. Не найден сертификат для подписи сущности по установленному отпечатку. Проверьте установленные сертификаты.'");
				СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
				Продолжить;
			Иначе
				
				ТегИмпортРеквест = "pirs:ImportRequest";
				ДлинаТегаИмпортРеквест = СтрДлина(ТегИмпортРеквест)+1; 
				
				НачальнаяПозиция = Найти(СодержимоеФайла,"<" + ТегИмпортРеквест);
				НачальныйБлок = Сред(СодержимоеФайла,1, НачальнаяПозиция-1);
			    КонечнаяПозиция = Найти(СодержимоеФайла,"</"+ТегИмпортРеквест+">");
				БлокПодписи = Сред(СодержимоеФайла,НачальнаяПозиция,КонечнаяПозиция+ДлинаТегаИмпортРеквест + 2 -НачальнаяПозиция);
				КонечныйБлок = Сред(СодержимоеФайла,КонечнаяПозиция + ДлинаТегаИмпортРеквест + 2);
				
				
				Если Найти(СодержимоеФайла,"<Charge")>0 И СертификатСущности <> Неопределено Тогда
				    Попытка
					    //Тут будет подпись сущности внешней компонентой
						Если КомпонентаПодписи.XMLDSign(БлокПодписи, "Charge", ДанныеСертификатаСущности, Истина, Истина) Тогда
							СодержимоеФайла = НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
							ЕстьИзменения = Истина;
						Иначе
							ТекстОшибки = НСтр("ru='Не удалось подписать начисление.'");
							СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
							//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать начисление.'"));
							//Возврат Ложь;
							Продолжить;
						КонецЕсли;
					Исключение
						ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление.'");
						СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
						Если МассивНеПодписанных.Найти(ГлКлючИЗначение.Ключ)=Неопределено Тогда
							МассивНеПодписанных.Добавить(ГлКлючИЗначение.Ключ);
						КонецЕсли;
						Продолжить;
						//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление.'"));
						//Возврат Ложь;					
					КонецПопытки;
					
				КонецЕсли;
				
				// Подпись каталога услуг
				Если Найти(СодержимоеФайла,"<ServiceCatalog")>0 И СертификатСущности <> Неопределено Тогда		
	                Попытка
						//Подпись сущности внешней компонентой
						Если КомпонентаПодписи.XMLDSign(БлокПодписи, "ServiceCatalog", ДанныеСертификатаСущности, Истина, Истина) Тогда
							СодержимоеФайла = НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
							ЕстьИзменения = Истина;
						Иначе
							//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать каталог услуг.'"));
							//Возврат Ложь;
							
							ТекстОшибки = НСтр("ru='Не удалось подписать каталог услуг.'");
							СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
							Продолжить;
						КонецЕсли;
					Исключение
						//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать каталог услуг.'"));
						//Возврат Ложь;
						Если МассивНеПодписанных.Найти(ГлКлючИЗначение.Ключ)=Неопределено Тогда
							МассивНеПодписанных.Добавить(ГлКлючИЗначение.Ключ);
						КонецЕсли;
						ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать каталог услуг.'");
						СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
						Продолжить;

					КонецПопытки;								
				КонецЕсли;
				
				// Подпись измененного каталога услуг
				Если Найти(СодержимоеФайла,"<Changes")>0 И СертификатСущности <> Неопределено Тогда
					Попытка
						//Подпись сущности внешней компонентой
						Если КомпонентаПодписи.XMLDSign(БлокПодписи, "Changes", ДанныеСертификатаСущности, Истина, Истина) Тогда
							СодержимоеФайла = НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
							ЕстьИзменения = Истина;
						Иначе
							//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать каталог услуг.'"));
							//Возврат Ложь;
							ТекстОшибки = НСтр("ru='Не удалось подписать каталог услуг.'");
							СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
							Продолжить;
						КонецЕсли;
					Исключение
						//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать каталог услуг.'"));
						//Возврат Ложь;
						Если МассивНеПодписанных.Найти(ГлКлючИЗначение.Ключ)=Неопределено Тогда
							МассивНеПодписанных.Добавить(ГлКлючИЗначение.Ключ);
						КонецЕсли;
						ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать каталог услуг.'");
						СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
						Продолжить;
					КонецПопытки;	
				КонецЕсли;
			КонецЕсли;
			
			
			Если Найти(СодержимоеФайла,"<soapenv:Body")>0 И ЗаголовокНеПодписан Тогда
				//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать soap-пакет. Не найден сертификат для подписи заголовка soap-пакета по установленному отпечатку. Проверьте установленные сертификаты.'"));	
				//Возврат Ложь;
				ТекстОшибки = НСтр("ru='Не удалось подписать soap-пакет. Не найден сертификат для подписи заголовка soap-пакета по установленному отпечатку. Проверьте установленные сертификаты.'");
				СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
				Продолжить;
			Иначе
				
				Если Найти(СодержимоеФайла,"<soapenv:Body")>0 И СертификатЗаголовка <> Неопределено Тогда
					НачальныйЗаголовок = "";
					Если Найти(СодержимоеФайла,"<?xml")>0 Тогда
						Позиция = Найти(СодержимоеФайла, "?>");
						Количество = 2;
						Если Сред(СодержимоеФайла,Позиция+2,1)=Символы.ПС Тогда
							Количество = 3;
						КонецЕсли;
						НачальныйЗаголовок = Лев(СодержимоеФайла,Позиция+2);
						СодержимоеФайлаБезЗаголовка = Сред(СодержимоеФайла,Позиция+Количество);
					КонецЕсли;
					
					ПозицияУТМ = Найти(СодержимоеФайлаБезЗаголовка,"<n1:UnifoTransferMsg");
					ТекстДоУТМ = Лев(СодержимоеФайлаБезЗаголовка,ПозицияУТМ);
					ТекстДоУТМ = СтрЗаменить(СтрЗаменить(ТекстДоУТМ,Символы.ПС,""),Символы.Таб,"");
					
					ПозицияКонецУТМ = Найти(СодержимоеФайлаБезЗаголовка,"</n1:UnifoTransferMsg");
					ТекстКонец = Сред(СодержимоеФайлаБезЗаголовка,ПозицияКонецУТМ);
					ТекстКонец = СтрЗаменить(СтрЗаменить(ТекстКонец,Символы.ПС,""),Символы.Таб,"");
					
					ТекстСередина = Сред(СодержимоеФайлаБезЗаголовка,ПозицияУТМ+1,ПозицияКонецУТМ-1-ПозицияУТМ);
					СодержимоеФайлаБезЗаголовка = ТекстДоУТМ + ТекстСередина+ТекстКонец;
					
								
					//Вставляем сертификат в заголовок
					СодержимоеФайлаБезЗаголовка = СтрЗаменить(СодержимоеФайлаБезЗаголовка,"%СертификатЗаголовка%",ДанныеСертификатаЗаголовка);
									
					ИмяИскомогоТега = "</wsse:BinarySecurityToken>";
					ДлинаИскомогоТега = СтрДлина(ИмяИскомогоТега);
					
					НачальнаяПозиция = Найти(СодержимоеФайлаБезЗаголовка, ИмяИскомогоТега);
					НачальныйБлок  = Сред(СодержимоеФайлаБезЗаголовка,1, НачальнаяПозиция+ДлинаИскомогоТега-1);
					
					КонечнаяПозиция = НачальнаяПозиция+ДлинаИскомогоТега;
					КонечныйБлок = СокрЛ(Сред(СодержимоеФайлаБезЗаголовка,КонечнаяПозиция));
					
					БлокПодписи = "";
					Попытка
						//Подпись заголовка soap-пакета внешней компонентой
						Если КомпонентаПодписи.XMLDSign(СодержимоеФайлаБезЗаголовка, "Body", ДанныеСертификатаЗаголовка, Ложь, Ложь) Тогда
							СодержимоеФайла = НачальныйЗаголовок + НачальныйБлок + КомпонентаПодписи.Sign + КонечныйБлок;
							ЕстьИзменения = Истина;
						Иначе
							//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось подписать заголовок soap-пакета.'"));
							//Возврат Ложь;
							ТекстОшибки = НСтр("ru='Не удалось подписать заголовок soap-пакета.'");
							СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
							Продолжить;
						КонецЕсли;				
					Исключение
						//ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать заголовок soap-пакета.'"));
						//Возврат Ложь;
						Если МассивНеПодписанных.Найти(ГлКлючИЗначение.Ключ)=Неопределено Тогда
							МассивНеПодписанных.Добавить(ГлКлючИЗначение.Ключ);
						КонецЕсли;
						ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать заголовок soap-пакета.'");
						СоответствиеРезультатовПодготовкиПоЗаданию.Вставить(КлючИЗначение.Ключ,ТекстОшибки);
						Продолжить;

					КонецПопытки;				
				КонецЕсли;
			КонецЕсли;
			
			Если ЕстьИзменения Тогда 
				СоответствиеОбновленныхФайлов.Вставить(КлючИЗначение.Ключ,СодержимоеФайла);
			КонецЕсли;					
		КонецЦикла;
		
		СоответствиеРезультатовПодготовки.Вставить(ГлКлючИЗначение.Ключ,СоответствиеРезультатовПодготовкиПоЗаданию);
	КонецЦикла;
	
	Результат = НЕ ГосУслуги.ПродолжениеПодготовкиФайлов(СоответствиеОбновленныхФайлов,СоответствиеРезультатовПодготовки,МассивНеПодписанных);
	
	ОкончаниеПодготовкиКОтправке(КонтекстВыполнения,Результат);
	
КонецПроцедуры

//

// Подпись начислений отдельно от отправки
Процедура ПодписатьНачисления(ТЧДляПодписи,ИмяУзла,КомпонентаПодписи) Экспорт
	
	СтруктураТребований = ГосУслуги.ПолучитьСтруктуруТребованийКомпоненты();
	
	НужнаКомпонента = Истина;
	
	#Если ВебКлиент Тогда
		//обращение к TSA серверу выполняется только на сервере
		СтруктураТребований.ОбращатьсяКTSAСерверуНаСервере = Истина;
	#КонецЕсли
	
	Если СтруктураТребований.ОбращатьсяКTSAСерверуНаСервере = Истина
		И СтруктураТребований.ПодписыватьСообщенияДляГИСГМПНаСервере = Истина Тогда
		
		ГосУслуги.ПодписатьНачисления_НаСервере(ТЧДляПодписи,ИмяУзла);
		
	Иначе
		ДлинаТега = СтрДлина(ИмяУзла);
		
		
		Для Каждого СтрТЧ Из ТЧДляПодписи Цикл
			Если НЕ ЗначениеЗаполнено(СтрТЧ.РезультатФормирования) Тогда
				ТекстСообщения = НСтр("ru='Не удалось подписать начисление """+СтрТЧ.Объект+""" по причине: не удалось сформировать файл по причине: "+СтрТЧ.ТекстОшибки+"'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Продолжить;
			КонецЕсли;
			
			ПозицияНачалаФайла = 1;
			Если СтрНачинаетсяС(СтрТЧ.РезультатФормирования,"<?")  Тогда
				ПозицияНачалаФайла = СтрНайти(СтрТЧ.РезультатФормирования,"?>")+2;
				СтрТЧ.РезультатФормирования = СокрЛП(Сред(СтрТЧ.РезультатФормирования,ПозицияНачалаФайла));
			КонецЕсли;
		
			//Если Найти(СтрТЧ.РезультатФормирования,"<?xml version=""1.0"" encoding=""UTF-8""?>")>0 Тогда
			//	СтрТЧ.РезультатФормирования = СтрЗаменить(СтрТЧ.РезультатФормирования,"<?xml version=""1.0"" encoding=""UTF-8""?>"+Символы.ПС,"");		
			//КонецЕсли;
			
			Попытка
				
				ДанныеСертификата = СтрТЧ.СертификатЭПНачислений;		 
				
				НачальнаяПозиция = Найти(СтрТЧ.РезультатФормирования,"<" + ИмяУзла);
				НачальныйБлок = Сред(СтрТЧ.РезультатФормирования,1, НачальнаяПозиция-1);
			    КонечнаяПозиция = Найти(СтрТЧ.РезультатФормирования,"</"+ИмяУзла+">");
				БлокПодписи = Сред(СтрТЧ.РезультатФормирования,НачальнаяПозиция,КонечнаяПозиция+ДлинаТега + 3 -НачальнаяПозиция);
				КонечныйБлок = Сред(СтрТЧ.РезультатФормирования,КонечнаяПозиция + ДлинаТега + 3);
				
				ИдентификаторТекущейПодписи = "_" + Строка(Новый УникальныйИдентификатор());
				
				Если СтруктураТребований.ПодписыватьСообщенияДляГИСГМПНаСервере = Истина Тогда
						
					СтруктураПодписи = ГосУслуги.ПодписатьБлокXML_XadesT(ИдентификаторТекущейПодписи,БлокПодписи,ИмяУзла,ДанныеСертификата,"",Истина,Истина,СтрТЧ.ПарольЭПНачисления);
					
					Если СтруктураПодписи.Свойство("ТекстОшибки") Тогда
						
						ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление %1.
							|%2'");
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,СтрТЧ.Объект,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),СтруктураПодписи.ТекстОшибки);
									
						СтрТЧ.РезультатФормирования = "";

						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
										
						Возврат;
						
					Иначе
					
						ТелоЗапроса64 = СтруктураПодписи.ТелоЗапроса64;
						Подпись = СтруктураПодписи.Подпись;
					КонецЕсли;
				Иначе
					//В версии 2.2.1.0 добавлено свойство СообщатьОбОшибке Булево и ТекстОшибки Строка
					КомпонентаПодписи.СообщатьОбОшибке = Ложь; //Если ложь, то компонента сама не будет выдавать сообщения об ошибке.
					КомпонентаПодписи.SignatureID = ИдентификаторТекущейПодписи;
					
					Попытка 			
						КомпонентаПодписи.ПодписатьXadesT(
							БлокПодписи,
							ИмяУзла,
							ДанныеСертификата,"",
							//Формат(ТекущаяДата(), "ДФ=yyyy-MM-ddTHH:mm:ss"),
							Истина,
							Истина,
							СтрТЧ.ПарольЭПНачисления);
							
						Подпись = КомпонентаПодписи.Подпись;
						ТелоЗапроса64 = КомпонентаПодписи.ПолучитьТелоЗапросаКTSA();
					Исключение
						ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление %1.
							|%2
							|Описание ошибки внешней компоненты: %3'");
						ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,СтрТЧ.Объект,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),КомпонентаПодписи.ТекстОшибки);
					
						СтрТЧ.РезультатФормирования = "";

						ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);					
						
						Продолжить;
					КонецПопытки;
				КонецЕсли;
								
				РезультатОтправки = ОтправитьЗапросКTSAСерверу(СтрТЧ.АдресTSA,СтрТЧ.НастройкаTSA,ТелоЗапроса64,"начисление",СтруктураТребований.ОбращатьсяКTSAСерверуНаСервере);
						
				Если РезультатОтправки.Успех = Истина Тогда
						
					Если СтруктураТребований.ПодписыватьСообщенияДляГИСГМПНаСервере = Истина Тогда
						ТекстОшибки = "";
						Подпись = ГосУслуги.ПоставитьШтампВремени(ИдентификаторТекущейПодписи,Подпись,РезультатОтправки.ТекстОтвета,ТекстОшибки);
						
						Если ЗначениеЗаполнено(ТекстОшибки) Тогда
							СтрТЧ.РезультатФормирования = "";

							ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							Продолжить;	
						КонецЕсли;
						
					Иначе
						Попытка
							КомпонентаПодписи.ПоставитьШтампВремени(РезультатОтправки.ТекстОтвета);
							Подпись = КомпонентаПодписи.Подпись;
						Исключение
							ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось поставить штамп времени в подпись начисления %1.
								|%2
								|Описание ошибки внешней компоненты: %3'");
							ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,СтрТЧ.Объект,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),КомпонентаПодписи.ТекстОшибки);
						
							СтрТЧ.РезультатФормирования = "";

							ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
							Продолжить;
						КонецПопытки;
					КонецЕсли;
										
					СтрТЧ.РезультатФормирования = Сред(СтрТЧ.РезультатФормирования,1, КонечнаяПозиция - 1) + Подпись + Сред(СтрТЧ.РезультатФормирования,КонечнаяПозиция);
				
					ФайлОбработан = Истина;
						
				Иначе
					ТекстОшибки = РезультатОтправки.ТекстОшибки;
					
					СтрТЧ.РезультатФормирования = "";
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);

				КонецЕсли;
				
			Исключение
				
				ТекстОшибки = НСтр("ru='При формировании подписи возникла ошибка. Не удалось подписать начисление %1.
						|%2'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,СтрТЧ.Объект,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
				СтрТЧ.РезультатФормирования = "";

				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);					
			КонецПопытки;
					
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//

// компонента подписи

Функция УстановитьВК()
	
	Попытка
		УстановитьВнешнююКомпоненту("ОбщийМакет.КомпонентаXMLDSIG");
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить внешнюю компоненту ОбъектXMLDSIG.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;	
	
КонецФункции

Функция ПодключитьВК(ТихийРежим = Истина)
	
	КодВозврата = ПодключитьВнешнююКомпоненту("ОбщийМакет.КомпонентаXMLDSIG", "ОбъектXMLDSIG");
	
	Если НЕ КодВозврата И НЕ ТихийРежим Тогда
		ТекстСообщения = НСтр("ru='Не удалось подключить внешнюю компоненту ОбъектXMLDSIG.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат КодВозврата;
	
КонецФункции

Функция СоздатьОбъектДляПодписиXMLDSIG() Экспорт
	//создаем объект
	Крипт = НовыйОбъектДляПодписи(Истина);
	Если Крипт = Неопределено Тогда
		
		Если ПодключитьВК(Истина) Тогда
			
			Крипт = НовыйОбъектДляПодписи(Ложь);
			Если Крипт = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
						
		Иначе
			
			Если УстановитьВК() Тогда
				Если ПодключитьВК(Ложь) Тогда
					Крипт = НовыйОбъектДляПодписи(Ложь);
					Если Крипт = Неопределено Тогда
						Возврат Неопределено;
					КонецЕсли;
				Иначе
					Возврат Неопределено;
				КонецЕсли
			Иначе
				Возврат Неопределено;
			КонецЕсли
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Крипт;
	
КонецФункции

Функция НовыйОбъектДляПодписи(ТихийРежим = Истина)
	
	Попытка
		
		Крипт = Новый("Addin.ОбъектXMLDSIG.XMLDSignAddIn");                //
		Возврат Крипт;
		
	Исключение
		
		Если НЕ ТихийРежим Тогда
			ТекстСообщения = НСтр("ru='Не удалось создать объект для подписи xml файлов в формате XMLDSig.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции



// компонента подписи xades

Функция УстановитьВК_xades()
	
	Попытка
		УстановитьВнешнююКомпоненту("ОбщийМакет.Компонента_xades");
	Исключение
		ТекстСообщения = НСтр("ru='Не удалось установить внешнюю компоненту xades.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;	
	
КонецФункции

Функция ПодключитьВК_xades(ТихийРежим = Истина)
	
	КодВозврата = ПодключитьВнешнююКомпоненту("ОбщийМакет.Компонента_xades", "xades");
	
	Если НЕ КодВозврата И НЕ ТихийРежим Тогда
		ТекстСообщения = НСтр("ru='Не удалось подключить внешнюю компоненту xades.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	Возврат КодВозврата;
	
КонецФункции

Функция СоздатьОбъектДляПодписиXML_xades() Экспорт
	//создаем объект
	Крипт = НовыйОбъектДляПодписи_xades(Истина);
	Если Крипт = Неопределено Тогда
		
		Если ПодключитьВК_xades(Истина) Тогда
			
			Крипт = НовыйОбъектДляПодписи_xades(Ложь);
			Если Крипт = Неопределено Тогда
				Возврат Неопределено;
			КонецЕсли;
						
		Иначе
			
			Если УстановитьВК_xades() Тогда
				Если ПодключитьВК_xades(Ложь) Тогда
					Крипт = НовыйОбъектДляПодписи_xades(Ложь);
					Если Крипт = Неопределено Тогда
						Возврат Неопределено;
					КонецЕсли;
				Иначе
					Возврат Неопределено;
				КонецЕсли
			Иначе
				Возврат Неопределено;
			КонецЕсли
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Крипт;
	
КонецФункции

Функция НовыйОбъектДляПодписи_xades(ТихийРежим = Истина)
	
	Попытка
		
		Крипт = Новый("Addin.xades.Xades2AddIn");                //
		Возврат Крипт;
		
	Исключение
		
		Если НЕ ТихийРежим Тогда
			ТекстСообщения = НСтр("ru='Не удалось создать объект для подписи xml файлов в формате XadES-T.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецПопытки;
	
КонецФункции

//

Асинх Функция ПодписатьДанныеПоФорматуГИСГМП20НаКлиенте(КомпонентаПодписи, Участник,ТЧДанных,Знач ИмяУзлаПодписиСП="",Знач ИмяУзлаПодписиОВ="") Экспорт
	
	//Имя узла подписи СП может меняться - зависит от вида запроса, иногда может отсутствовать.
	//Имя узла подписи ОВ всегда одинаковое - SenderProvidedRequestData
	ТекстОшибки = "";
	Если НЕ ЗначениеЗаполнено(ИмяУзлаПодписиСП)
		И НЕ ЗначениеЗаполнено(ИмяУзлаПодписиОВ) Тогда
		Возврат ТекстОшибки;
	КонецЕсли;
	
	ШаблонПодписиСП = "%ПодписьСП%";
	
	ШаблонПодписиОВ = "%ПодписьОВ%";
	
	НастройкиПодисиУчастников = ГосУслуги.ПолучитьНастройкиПодписиУчастников20(Участник);
	
	//т.к. компонента если пароль не хранится выводит не информативное окно ввода пароля, то запрашиваем пароль сами	
	//СоответствиеПаролейСертификатов = Новый Соответствие;
	
	Для Каждого СтрокаТЧ ИЗ ТЧДанных Цикл
		
		ТекущийУчастник = СтрокаТЧ.ТекущийУчастник;
		
		НастройкиУчастника = НастройкиПодисиУчастников[ТекущийУчастник];
		Если НастройкиУчастника = Неопределено Тогда
			
			ТекстОшибки = "Для ""%1"" в настройках не заданы параметры подписи. Подпись не выполнена.";
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТекущийУчастник);
			
			Возврат ТекстОшибки;
		КонецЕсли;
		
		ИспользуемыйСертификат = НастройкиУчастника.СертификатЭПНачислений;
		ДанныеСертификатаСущности = НастройкиУчастника.ДанныеСертификатаНачислений;
		ТекПарольУчастника = НастройкиУчастника.ПарольЭПНачисления;
		ТипПрограммыСертификата = НастройкиУчастника.ТипПрограммыСертификатаНачислений;
		ПрограммаСертификата = НастройкиУчастника.ПрограммаСертификатаНачислений;
		ХранитьПароль = НастройкиУчастника.ХранитьПарольЭПНачисления;
		
		СодержимоеФайла = СтрокаТЧ.СодержимоеФайла;
		ПозицияНачалаФайла = 1;
		Если СтрНачинаетсяС(СодержимоеФайла,"<?")  Тогда
			ПозицияНачалаФайла = СтрНайти(СодержимоеФайла,"?>")+2;
			СодержимоеФайла = СокрЛП(Сред(СодержимоеФайла,ПозицияНачалаФайла));
		КонецЕсли;
		
		//СодержимоеФайла = СокрЛП(СтрЗаменить(СодержимоеФайла,"<?xml version=""1.0"" encoding=""UTF-8""?>",""));
				
		//если это обмен с эмулятором, то нужно послать эталонные сообщения
		//эталонные сообщения будут не подписаны и нужно их подписать
		НужнаПодписьСП = СтрНайти(СодержимоеФайла,ШаблонПодписиСП)>0;
		
		Если НужнаПодписьСП Тогда
			//В некоторых системах агрегаторах требуется подписывать ЭП-СП для запросов (платежей, начислений, квитирования и тд.)
			//Если в формате есть ШаблонПодписиСП, то определим подписываемый узел
			
			Если НЕ ЗначениеЗаполнено(ИмяУзлаПодписиСП) Тогда
			    
				Если СтрНайти(СодержимоеФайла,"ImportChargesRequest")>0 Тогда
					//Пакет начислений
					ИмяУзлаПодписиСП = "ImportChargesRequest";
					
					
				ИначеЕсли СтрНайти(СодержимоеФайла,"ImportRefundsRequest")>0 Тогда
				    //Пакет возвратов
					ИмяУзлаПодписиСП = "ImportRefundsRequest";
					
				ИначеЕсли СтрНайти(СодержимоеФайла,"ExportPaymentsRequest")>0 Тогда	
					//Запрос платежей
					ИмяУзлаПодписиСП = "ExportPaymentsRequest";
					
				ИначеЕсли СтрНайти(СодержимоеФайла,"ExportQuittancesRequest")>0 Тогда	
					//Запрос квитанций
					ИмяУзлаПодписиСП = "ExportQuittancesRequest";	
					
				ИначеЕсли СтрНайти(СодержимоеФайла,"ExportChargesRequest")>0 Тогда	
					//Запрос начислений и статусов квитирования
					ИмяУзлаПодписиСП = "ExportChargesRequest";
					
				ИначеЕсли СтрНайти(СодержимоеФайла,"ForcedAcknowledgementRequest")>0 Тогда	
					//Запрос на квитирование и отмену квитирования
					ИмяУзлаПодписиСП = "ForcedAcknowledgementRequest";
					
				ИначеЕсли СтрНайти(СодержимоеФайла,"ExportRefundsRequest")>0 Тогда	
					//Запрос возвратов
					ИмяУзлаПодписиСП = "ExportRefundsRequest";
					
				ИначеЕсли СтрНайти(СодержимоеФайла,"ImportCertificateRequest")>0 Тогда	
					//Передача сертификата ЭП
					ИмяУзлаПодписиСП = "ImportCertificateRequest";	
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИмяУзлаПодписиСП)
				И НЕ ЗначениеЗаполнено(ДанныеСертификатаСущности) Тогда
				//подписывать надо, но сертификат не указан, возможно это косвенный участник
				//укажем, что подписывать будем сертификатом ЭП-ОВ
				Отправитель = НастройкиУчастника.Отправитель;
				НастройкиОтправителя = НастройкиПодисиУчастников[Отправитель];
				ИспользуемыйСертификат = НастройкиОтправителя.СертификатЭПСообщения;
				ДанныеСертификатаСущности = НастройкиОтправителя.ДанныеСертификатаСообщения;
				ТекПарольУчастника = НастройкиОтправителя.ПарольЭПСообщения;
				ТипПрограммыСертификата = НастройкиОтправителя.ТипПрограммыСертификатаСообщения;
				ПрограммаСертификата = НастройкиОтправителя.ПрограммаСертификатаСообщения;
				ХранитьПароль = НастройкиОтправителя.ХранитьПарольЭПСообщения;
			КонецЕсли;
			
		КонецЕсли;
			
		
		Если ЗначениеЗаполнено(ИмяУзлаПодписиСП) Тогда		
			
			Если НЕ ЗначениеЗаполнено(ДанныеСертификатаСущности) Тогда
				ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
				|Для участника ""%1"" не задан сертификат подписи начислений.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТекущийУчастник);

				Возврат ТекстОшибки;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТипПрограммыСертификата) Тогда
				//попробуем автоматически определить
			    Попытка
					СвойстваКриптопровайдераРезультат = Ждать КомпонентаПодписи.ПолучитьСвойстваКриптопровайдераАсинх(ДанныеСертификатаСущности);
					ТекущийКриптопровайдер = КриптопровайдерИзОтветаКомпоненты(СвойстваКриптопровайдераРезультат.Значение);
					ТекТип = ТекущийКриптопровайдер["type"];
					Если ТекТип <> Неопределено Тогда
						ТипПрограммыСертификата = ТекТип;
						
						Если НастройкиУчастника.ДанныеСертификатаНачислений = ДанныеСертификатаСущности Тогда
							НастройкиУчастника.ТипПрограммыСертификатаНачислений = ТипПрограммыСертификата;
						ИначеЕсли НастройкиОтправителя.ДанныеСертификатаСообщения = ДанныеСертификатаСущности Тогда
							НастройкиОтправителя.ТипПрограммыСертификатаСообщения = ТипПрограммыСертификата;
						КонецЕсли;
					КонецЕсли;
				Исключение
					
					ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
						|Для участника ""%1"" в сертификате подписи начислений не указано приложение для подписи.
						|При автоматическом определении приложения возникла ошибка: %2'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТекущийУчастник,
						ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				    Возврат ТекстОшибки;
				КонецПопытки;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТипПрограммыСертификата) Тогда
				ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
				|Для участника ""%1"" в сертификате подписи начислений не указано приложение для подписи.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТекущийУчастник);

				Возврат ТекстОшибки;
			КонецЕсли;
			
			Если ХранитьПароль = Ложь Тогда
				Ждать КомпонентаПодписи.УстановитьЗапретитьПользовательскийИнтерфейсАсинх(Ложь);
			Иначе
				Ждать КомпонентаПодписи.УстановитьЗапретитьПользовательскийИнтерфейсАсинх(Истина);
			КонецЕсли;
						
			Попытка
				Подпись = Ждать ПодписатьДанныеПоФорматуГИСГМП20КомпонентойБСПНаКлиенте(КомпонентаПодписи,ДанныеСертификатаСущности,СодержимоеФайла,ИмяУзлаПодписиСП,ТекПарольУчастника,ТипПрограммыСертификата);	
				
				СодержимоеФайла = СтрЗаменить(СодержимоеФайла, ШаблонПодписиСП, Подпись);
				
				СтрокаТЧ.Подпись = Подпись;
				СтрокаТЧ.Сертификат = ИспользуемыйСертификат;
			Исключение
								
				ТекстОшибки = НСтр("ru='При формировании подписи СП возникла ошибка. Не удалось подписать %1.
						|%2'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ИмяУзлаПодписиСП,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
												
				Возврат ТекстОшибки;					
			КонецПопытки;
						
			СтрокаТЧ.Подписано = Истина;			
		КонецЕсли;
		
		//Имя узла подписи ОВ зависит от вида сообщения
		
		ТекИмяУзлаПодписиОВ = ИмяУзлаПодписиОВ;
		Если ТекИмяУзлаПодписиОВ = "Авто" Тогда
		
			Если СтрокаТЧ.ВидСообщения = ПредопределенноеЗначение("Перечисление.ТипыЗапросовСМЭВ3.ИмпортДанныхВСМЭВ")
				ИЛИ СтрокаТЧ.ВидСообщения = ПредопределенноеЗначение("Перечисление.ТипыЗапросовСМЭВ3.ИмпортЗапросаДанныхОтПоставщика") Тогда
				ТекИмяУзлаПодписиОВ = "SenderProvidedRequestData";//стандартный узел для подписи сообщений SendRequest
			ИначеЕсли СтрокаТЧ.ВидСообщения = ПредопределенноеЗначение("Перечисление.ТипыЗапросовСМЭВ3.ЗапросДанныхИзОчередиСМЭВ") Тогда //ТекущееДействие = "ЗапроситьДанныеИзОчередиОтветов"
				
				Если СтрНайти(СодержимоеФайла,"MessageTypeSelector")>0 Тогда
					//стандартный узел для подписи сообщений GetResponse
					//или запрос результата обработки по ID в ИС УНП
					ТекИмяУзлаПодписиОВ = "MessageTypeSelector";
				ИначеЕсли СтрНайти(СодержимоеФайла,"OriginalMessageID")>0 Тогда
					//это запрос результата обработки по ID в ИС РНИП
					ТекИмяУзлаПодписиОВ = "OriginalMessageID";
					
				КонецЕсли;
				
			ИначеЕсли СтрокаТЧ.ВидСообщения = ПредопределенноеЗначение("Перечисление.ТипыЗапросовСМЭВ3.ПодтверждениеПолученияСообщенияСМЭВ") Тогда //ТекущееДействие = "ПодтвердитьПолучениеСообщения"
				ТекИмяУзлаПодписиОВ = "AckTargetMessage";//стандартный узел для подписи сообщений Ack
			ИначеЕсли СтрокаТЧ.ВидСообщения = ПредопределенноеЗначение("Перечисление.ТипыЗапросовСМЭВ3.ЗапросДанныхИзОчередиСтатусов") Тогда //ТекущееДействие = "ЗапроситьДанныеИзОчередиСтатусов"
				ТекИмяУзлаПодписиОВ = "Timestamp";//стандартный узел для подписи сообщений GetStatus	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекИмяУзлаПодписиОВ)
			И ТекИмяУзлаПодписиОВ<>"Авто" Тогда
			
			Отправитель = НастройкиУчастника.Отправитель;
	
			НастройкиОтправителя = НастройкиПодисиУчастников[Отправитель];
						
			Если НастройкиОтправителя = Неопределено Тогда
				
				ТекстОшибки = "Для ""%1"" в настройках не заданы параметры подписи. Подпись не выполнена.";
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Отправитель);
				
				Возврат ТекстОшибки;
			КонецЕсли;
			
			ИспользуемыйСертификат = НастройкиОтправителя.СертификатЭПСообщения;
			ДанныеСертификатаЗаголовка = НастройкиОтправителя.ДанныеСертификатаСообщения;
			ТипПрограммыСертификата = НастройкиОтправителя.ТипПрограммыСертификатаСообщения;
			ПрограммаСертификата = НастройкиОтправителя.ПрограммаСертификатаСообщения;
			ХранитьПароль = НастройкиОтправителя.ХранитьПарольЭПСообщения;
			ТекПарольУчастника = НастройкиОтправителя.ПарольЭПСообщения;
					
			Если НЕ ЗначениеЗаполнено(ДанныеСертификатаЗаголовка) Тогда
				ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
				|Для участника ""%1"" не задан сертификат подписи всего сообщения.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Отправитель);
				
				Возврат ТекстОшибки;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТипПрограммыСертификата) Тогда
				//попробуем автоматически определить
			    Попытка
					СвойстваКриптопровайдераРезультат = Ждать КомпонентаПодписи.ПолучитьСвойстваКриптопровайдераАсинх(ДанныеСертификатаЗаголовка);
					ТекущийКриптопровайдер = КриптопровайдерИзОтветаКомпоненты(СвойстваКриптопровайдераРезультат.Значение);
					ТекТип = ТекущийКриптопровайдер["type"];
					Если ТекТип <> Неопределено Тогда
						ТипПрограммыСертификата = ТекТип;
						НастройкиОтправителя.ТипПрограммыСертификатаСообщения = ТипПрограммыСертификата;
					КонецЕсли;
				Исключение
					
					ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
						|Для участника ""%1"" в сертификате подписи всего сообщения не указано приложение для подписи.
						|При автоматическом определении приложения возникла ошибка: %2'");
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТекущийУчастник,
						ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				    Возврат ТекстОшибки;
				КонецПопытки;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТипПрограммыСертификата) Тогда
				ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
				|Для участника ""%1"" в сертификате подписи всего сообщения не указано приложение для подписи.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТекущийУчастник);

				Возврат ТекстОшибки;
			КонецЕсли;
			
			Если ХранитьПароль = Ложь Тогда
				Ждать КомпонентаПодписи.УстановитьЗапретитьПользовательскийИнтерфейсАсинх(Ложь);
			Иначе
				Ждать КомпонентаПодписи.УстановитьЗапретитьПользовательскийИнтерфейсАсинх(Истина);
			КонецЕсли;
						
			Попытка
				Подпись = Ждать ПодписатьДанныеПоФорматуГИСГМП20КомпонентойБСПНаКлиенте(КомпонентаПодписи,ДанныеСертификатаЗаголовка,СодержимоеФайла,ТекИмяУзлаПодписиОВ,ТекПарольУчастника,ТипПрограммыСертификата);	
			
				СодержимоеФайла = СтрЗаменить(СодержимоеФайла, ШаблонПодписиОВ, Подпись);
			Исключение
								
				ТекстОшибки = НСтр("ru='При формировании подписи ОВ возникла ошибка. Не удалось подписать %1.
						|%2'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ТекИмяУзлаПодписиОВ,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				Возврат ТекстОшибки;					
					
			КонецПопытки;
						
			СтрокаТЧ.Подписано = Истина;
			
		КонецЕсли;	
			
		СтрокаТЧ.СодержимоеФайла = СодержимоеФайла;
		
	КонецЦикла;
	
	Возврат ТекстОшибки;
КонецФункции

Асинх Функция ПодписатьПодтверждениеПолученияСообщенияНаКлиенте(Участник, СодержимоеФайла, КомпонентаПодписи, Знач НастройкиПодисиУчастников) Экспорт
	Отправитель = Участник;
	
	Если НастройкиПодисиУчастников = Неопределено Тогда
		НастройкиПодисиУчастников = ГосУслуги.ПолучитьНастройкиПодписиУчастников20(Участник);
	КонецЕсли;
	
	НастройкиОтправителя = НастройкиПодисиУчастников[Отправитель];
	
	СтруктураРезультата = Новый Структура("ТекстОшибки,СодержимоеФайла","","");
	
	Если НастройкиОтправителя = Неопределено Тогда
		
		ТекстОшибки = "Для ""%1"" в настройках не заданы параметры подписи. Подпись не выполнена.";
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Отправитель);
		
		СтруктураРезультата.ТекстОшибки = ТекстОшибки;
		
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	ИмяУзлаПодписи = "AckTargetMessage";
	ШаблонПодписиОВ = "%ПодписьОВ%";
	
	ИспользуемыйСертификат = НастройкиОтправителя.СертификатЭПСообщения;
	ДанныеСертификатаЗаголовка = НастройкиОтправителя.ДанныеСертификатаСообщения;
	ТипПрограммыСертификата = НастройкиОтправителя.ТипПрограммыСертификатаСообщения;
	ПрограммаСертификата = НастройкиОтправителя.ПрограммаСертификатаСообщения;
	ХранитьПароль = НастройкиОтправителя.ХранитьПарольЭПСообщения;
	ТекПарольУчастника = НастройкиОтправителя.ПарольЭПСообщения;
			
	Если НЕ ЗначениеЗаполнено(ДанныеСертификатаЗаголовка) Тогда
		ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
		|Для участника ""%1"" не задан сертификат подписи всего сообщения.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Отправитель);
		
		СтруктураРезультата.ТекстОшибки = ТекстОшибки;
		
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипПрограммыСертификата) Тогда
		//попробуем автоматически определить
	    Попытка
			СвойстваКриптопровайдераРезультат = Ждать КомпонентаПодписи.ПолучитьСвойстваКриптопровайдераАсинх(ДанныеСертификатаЗаголовка);
			ТекущийКриптопровайдер = КриптопровайдерИзОтветаКомпоненты(СвойстваКриптопровайдераРезультат.Значение);
			ТекТип = ТекущийКриптопровайдер["type"];
			Если ТекТип <> Неопределено Тогда
				ТипПрограммыСертификата = ТекТип;
				НастройкиОтправителя.ТипПрограммыСертификатаСообщения = ТипПрограммыСертификата;
			КонецЕсли;
		Исключение
			
			ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
				|Для участника ""%1"" в сертификате подписи всего сообщения не указано приложение для подписи.
				|При автоматическом определении приложения возникла ошибка: %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Участник,
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			СтруктураРезультата.ТекстОшибки = ТекстОшибки;
		
			Возврат СтруктураРезультата;
		КонецПопытки;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипПрограммыСертификата) Тогда
		ТекстОшибки = НСтр("ru='Не удалось подписать сообщение.
		|Для участника ""%1"" в сертификате подписи всего сообщения не указано приложение для подписи.'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,Участник);

		СтруктураРезультата.ТекстОшибки = ТекстОшибки;
		
		Возврат СтруктураРезультата;
	КонецЕсли;
	
	Если ХранитьПароль = Ложь Тогда
		Ждать КомпонентаПодписи.УстановитьЗапретитьПользовательскийИнтерфейсАсинх(Ложь);
	Иначе
		Ждать КомпонентаПодписи.УстановитьЗапретитьПользовательскийИнтерфейсАсинх(Истина);
	КонецЕсли;
				
	Попытка
		Подпись = Ждать ПодписатьДанныеПоФорматуГИСГМП20КомпонентойБСПНаКлиенте(КомпонентаПодписи,ДанныеСертификатаЗаголовка,СодержимоеФайла,ИмяУзлаПодписи,ТекПарольУчастника,ТипПрограммыСертификата);	
	
		СодержимоеФайла = СтрЗаменить(СодержимоеФайла, ШаблонПодписиОВ, Подпись);
		
		СтруктураРезультата.СодержимоеФайла = СодержимоеФайла;
	Исключение
						
		ТекстОшибки = НСтр("ru='При формировании подписи ОВ возникла ошибка. Не удалось подписать %1.
				|%2'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,ИмяУзлаПодписи,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		СтруктураРезультата.ТекстОшибки = ТекстОшибки;
		
		Возврат СтруктураРезультата;					
			
	КонецПопытки;
				
	Возврат СтруктураРезультата;	
КонецФункции

Функция КриптопровайдерИзОтветаКомпоненты(Знач Текст)

	Результат = Новый Соответствие;

	Попытка
		
		ЗаполнитьСоответствиеИзОтветаJSON(Результат, Текст);
		Возврат Результат;

	Исключение

		ИнформацияОбОшибке = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());

		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось прочитать ответ компоненты: %1
						 |%2'"), Текст, ИнформацияОбОшибке);

	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Для функции КриптопровайдерИзОтветаКомпоненты
Процедура ЗаполнитьСоответствиеИзОтветаJSON(Результат, Знач ТекстJSON)
	
	ТекстJSON = СтрЗаменить(СокрЛП(ТекстJSON), Символы.ПС, "");
	ТекстJSON = СокрЛП(Сред(ТекстJSON, 2, СтрДлина(ТекстJSON)-2));
	
	Пока ТекстJSON <> "" Цикл
		
		Позиция = СтрНайти(ТекстJSON, ":");
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ИмяЗначения = СокрЛП(Лев(ТекстJSON, Позиция-1));
		ИмяЗначения = СтрЗаменить(ИмяЗначения, """","");
		
		ЭтоЧисло = Ложь;
		ТекстJSON = СокрЛП(Сред(ТекстJSON, Позиция+1));
		Если Лев(ТекстJSON, 1) = """" Тогда
			ТекстJSON = СокрЛП(Сред(ТекстJSON, 2));
		Иначе
			ЭтоЧисло = Истина;
		КонецЕсли; 
		
		Позиция = 0;
		Для НоваяПозиция = 1 По СтрДлина(ТекстJSON) Цикл
			Символ = Сред(ТекстJSON, НоваяПозиция, 1);
			
			СледующийСимвол = Неопределено;
			Если Символ = "," Тогда
				Для СледующаяПозиция = НоваяПозиция + 1 По СтрДлина(ТекстJSON) Цикл
					СледующийСимвол = Сред(ТекстJSON, СледующаяПозиция, 1);
					Если СледующийСимвол <> " " Тогда
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли; 
			Если Символ = "," И (СледующийСимвол = Неопределено ИЛИ СледующийСимвол = """") Тогда
				Позиция = НоваяПозиция;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Позиция = 0 Тогда
			Значение = ТекстJSON;
			ТекстJSON = "";
		Иначе
			Значение = Лев(ТекстJSON, Позиция-1);
			ТекстJSON = СокрЛП(Сред(ТекстJSON, Позиция + ?(Сред(ТекстJSON, Позиция, 1) = ",", 1, 0)));
		КонецЕсли;
		
		Значение = СокрЛП(Значение);
		Если Значение = "true" Тогда
			Значение = Истина;
		ИначеЕсли Значение = "false" Тогда
			Значение = Ложь;
		ИначеЕсли Значение = "null" Тогда
			Значение = Неопределено;
		Иначе
			Если ЭтоЧисло Тогда
				Значение = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Значение);
			Иначе
				Значение = Лев(Значение, СтрДлина(Значение)-1);
			КонецЕсли;
		КонецЕсли;
		
		Результат.Вставить(ИмяЗначения, Значение);
		
	КонецЦикла;
	
КонецПроцедуры

Асинх Функция ПодписатьДанныеПоФорматуГИСГМП20КомпонентойБСПНаКлиенте(КомпонентаПодписиБСП,СертификатКриптографииBase64,СодержимоеФайла,ИмяУзлаПодписи,ТекПарольУчастника,ТипКриптопровайдера)
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////
	//Общая последовательность должна быть такой (на примере SendRequest):
	///////////////////////////////////////////////////////////////////////////////////////////////////////////
	//1. Каноникализация содержимого узла SenderProvidedRequestData;
	//2. Нормализация;
	//3. Расчет хэша;

	//4. Формирование ЭП-ОВ:
	//a. запись cодержимого хэша в CallerInformationSystemSignature\Signature\SignedInfo\Reference\DigestValue
	//b. каноникализация, нормализация элемента CallerInformationSystemSignature\Signature\SignedInfo
	//c. расчёт хэша элемента CallerInformationSystemSignature\Signature\SignedInfo
	//d. подпись хэша CallerInformationSystemSignature\Signature\SignedInfo
	//e. запись значения подписи в CallerInformationSystemSignature\Signature\SignatureValue
	//f. запись данных сертификата в CallerInformationSystemSignature\Signature\KeyInfo\X509Data\X509Certificate
	                   
	// Приводим значение сертификата к нужному виду
	//СертификатКриптографииBase64 = СтрЗаменить(СтрЗаменить(ДанныеСертификатаСущности, Символы.ПС, ""), Символы.ВК, "");
	
	ЭПКонвертXML = ГосУслугиКлиентСервер.ЭПКонвертXML();
	
	//В URI блока подписи подставляется значение атрибута Id подписываемомго узла, поэтому ожидается, что такой атрибут есть.
	ПозицияУзлаПодписи = СтрНайти(СодержимоеФайла,ИмяУзлаПодписи);
	ИмяИскомогоБлокаАтрибута = " Id=""";
	ДлинаБлокаИскомогоАтрибута = СтрДлина(ИмяИскомогоБлокаАтрибута);
	ПозицияIdНачало = СтрНайти(СодержимоеФайла,ИмяИскомогоБлокаАтрибута,,ПозицияУзлаПодписи);
	ПозицияIdКонец = СтрНайти(СодержимоеФайла,"""",,ПозицияIdНачало + ДлинаБлокаИскомогоАтрибута);
	
	ЗначениеURI = Сред(СодержимоеФайла,ПозицияIdНачало+ДлинаБлокаИскомогоАтрибута,ПозицияIdКонец-ПозицияIdНачало-ДлинаБлокаИскомогоАтрибута);
	
	ЭПКонвертXML = СтрЗаменить(ЭПКонвертXML, "%URI%", "#"+ЗначениеURI);
		   
	OID_Алгоритма = "1.2.643.7.1.1.2.2";//ИдентификаторАлгоритмаХеширования ГОСТ 2012/256  
	                   
	// Приводим текст подписной части Signature к канонической
	XPath_Signature = "(//. | //@* | //namespace::*)[ancestor-or-self::*[local-name()='Signature']]";
		
	ЭПКонвертXML = Ждать C14NАсинх(КомпонентаПодписиБСП, ЭПКонвертXML, XPath_Signature);
	ЭПКонвертXML = Ждать КанонизацияСМЭВ(КомпонентаПодписиБСП, ЭПКонвертXML);
	                   
	// 1. Приводим текст запроса, заключенный в тегах <ТекИмяУзлаПодписиОВ> к единой нормальной форме (канонизируем) по двум алгоритмам (C14N и СМЭВ)
	XPath_ИмяУзлаПодписи = "(//. | //@* | //namespace::*)[ancestor-or-self::*[local-name()='" + ИмяУзлаПодписи + "']]";
	КанонXML_ИмяУзлаПодписи = Ждать C14NАсинх(КомпонентаПодписиБСП, СодержимоеФайла, XPath_ИмяУзлаПодписи);
	// 2. Нормализация
	КанонXML_ИмяУзлаПодписи = Ждать КанонизацияСМЭВ(КомпонентаПодписиБСП, КанонXML_ИмяУзлаПодписи);
	
	//ТипКриптопровайдера - для КриптоПро = 80, берется из программы сертификата
	
	// 3. Хешируем наш запрос и помещаем значение в %DigestValue%
	АтрибутDigestValue = Ждать РезультатHash(КомпонентаПодписиБСП, КанонXML_ИмяУзлаПодписи, OID_Алгоритма, ТипКриптопровайдера);
	// 4.а
	ЭПКонвертXML = СтрЗаменить(ЭПКонвертXML, "%DigestValue%", АтрибутDigestValue);

	// 4.b Приводим текст запроса, заключенный в тегах <SignedInfo> к единой нормальной форме (канонизируем) по двум алгоритмам (C14N и СМЭВ)
	XPath_SignedInfo = "(//. | //@* | //namespace::*)[ancestor-or-self::*[local-name()='SignedInfo']]";
	Канон_SignedInfo = Ждать C14NАсинх(КомпонентаПодписиБСП, ЭПКонвертXML, XPath_SignedInfo);
	Канон_SignedInfo = Ждать КанонизацияСМЭВ(КомпонентаПодписиБСП, Канон_SignedInfo);

	// 4.c Хешируем SignedInfo
	ХэшSignedInfo = Ждать РезультатHash(КомпонентаПодписиБСП, Канон_SignedInfo, OID_Алгоритма, ТипКриптопровайдера);
	                   
	// 4.d Подписываем хэш <SignedInfo>.
	//АтрибутSignatureValue = КомпонентаКриптографии.Sign(ХэшSignedInfo, СертификатКриптографииBase64, ТекПарольУчастника);
	АтрибутSignatureValue = Ждать РезультатSign(КомпонентаПодписиБСП, Канон_SignedInfo, СертификатКриптографииBase64, ТекПарольУчастника);
	                   
	// 4.e запись значения подписи в CallerInformationSystemSignature\Signature\SignatureValue
	ЭПКонвертXML = СтрЗаменить(ЭПКонвертXML, "%SignatureValue%", АтрибутSignatureValue);
	                   
	// 4.f запись данных сертификата в CallerInformationSystemSignature\Signature\KeyInfo\X509Data\X509Certificate
	ЭПКонвертXML = СтрЗаменить(ЭПКонвертXML, "%BinarySecurityToken%", СертификатКриптографииBase64);
	
	Подпись = ЭПКонвертXML;
	
	Возврат Подпись;
КонецФункции

Асинх Функция КанонизацияСМЭВ(ОбъектКомпоненты, ТекстXML)
	
	Попытка
		Результат = Ждать ОбъектКомпоненты.TransformSMEVАсинх(ТекстXML);
		КанонизированныйТекстXML = Результат.Значение;
	Исключение
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("TransformSMEV",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если КанонизированныйТекстXML = Неопределено Тогда
		РезультатОшибка = Ждать ОбъектКомпоненты.ПолучитьОшибкуАсинх();
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("TransformSMEV",
			РезультатОшибка.Значение);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат КанонизированныйТекстXML;
	
КонецФункции

Асинх Функция C14NАсинх(ОбъектКомпоненты, КонвертXML, XPath)
	
	Попытка
		Результат = Ждать ОбъектКомпоненты.C14NАсинх(КонвертXML, XPath);
		КанонизированныйТекстXML = Результат.Значение;
	Исключение
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("C14N",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если КанонизированныйТекстXML = Неопределено Тогда
		
		РезультатОшибка = Ждать ОбъектКомпоненты.ПолучитьОшибкуАсинх();
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("C14N",
			РезультатОшибка.Значение);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат КанонизированныйТекстXML;
	
КонецФункции

Асинх Функция РезультатHash(ОбъектКомпоненты, КанонизированныйТекстXMLBody, OIDАлгоритмаХеширования, ТипКриптопровайдера)
	
	Попытка
		Результат = Ждать ОбъектКомпоненты.HashАсинх(
			КанонизированныйТекстXMLBody,
			OIDАлгоритмаХеширования,
			ТипКриптопровайдера);
		АтрибутDigestValue = Результат.Значение;
	Исключение
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("Hash",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если АтрибутDigestValue = Неопределено Тогда
		РезультатОшибка = Ждать ОбъектКомпоненты.ПолучитьОшибкуАсинх();
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("Hash",
			РезультатОшибка.Значение);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат АтрибутDigestValue;
	
КонецФункции

Асинх Функция РезультатSign(ОбъектКомпоненты, КанонизированныйТекстXMLSignedInfo,
	СертификатКриптографииBase64, ПарольДоступаКЗакрытомуКлючу)
	
	Попытка
		Результат = Ждать ОбъектКомпоненты.SignАсинх(
			КанонизированныйТекстXMLSignedInfo,
			СертификатКриптографииBase64,
			ПарольДоступаКЗакрытомуКлючу);
		АтрибутSignatureValue = Результат.Значение;
	Исключение
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("Sign",
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если АтрибутSignatureValue = Неопределено Тогда
		РезультатОшибка = Ждать ОбъектКомпоненты.ПолучитьОшибкуАсинх();
		ТекстОшибки = ЭлектроннаяПодписьСлужебныйКлиентСервер.ОшибкаВызоваМетодаКомпоненты("Sign",
			РезультатОшибка.Значение);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат АтрибутSignatureValue;
	
КонецФункции

Функция ОшибкаВызоваМетодаКомпоненты(ИмяМетода, ИнформацияОбОшибке) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Ошибка вызова метода %1 компоненты %2.'"), ИмяМетода, "ExtraCryptoAPI")
		+ Символы.ПС + ИнформацияОбОшибке;
	
КонецФункции
	


//

// порционная подготовка следующих запросов

Процедура ПолучитьСледующуюПорциюДанных(ЗаданиеСсылка,НастройкаОбмена,ИдентификаторФормы) Экспорт
	
	МассивФайлов = Новый Массив;
	Данные = ГосУслуги.СформироватьФайлыДляПолученияСледующейПорцииДанных(ЗаданиеСсылка);
	
	Если Данные = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось подготовить запрос следующей порции данных из сервиса.");
		Возврат;
	КонецЕсли;
	
	КонтекстВыполнения = Новый Структура;
	КонтекстВыполнения.Вставить("Результат",Истина);
	КонтекстВыполнения.Вставить("ЗаданиеНаЭкспортСсылка",ЗаданиеСсылка);
	КонтекстВыполнения.Вставить("Версия",1.16); // если не задана, то устанавливается 1.15

	ПодписатьДанныеПоФормату_1_16(КонтекстВыполнения,Данные);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивФайлов",Данные["ОтправляемыеФайлы"]);
	ТекстОшибки = "";
	
	КаталогВыгрузки = ЭкспортФайлов.ПолучитьКаталогЗаданияНаЭкспорт(ЗаданиеСсылка);
	ЭкспортФайловКлиент.ЭкспортФайловЗаданияНаЭкспорт(ЗаданиеСсылка,НастройкаОбмена,КаталогВыгрузки,ТекстОшибки,ИдентификаторФормы,ДополнительныеПараметры);
	
	//ЭкспортФайлов.ОтправитьФайлыПоHTTP(ЗаданиеСсылка,Неопределено,ТекстОшибки,ДополнительныеПараметры);
	
	ТребуетсяСледующаяИтерация = Ложь;
	ДополнительныеПараметры.Свойство("ТребуетсяСледующаяИтерация",ТребуетсяСледующаяИтерация);
	
	Если ТребуетсяСледующаяИтерация = Истина Тогда
		ПолучитьСледующуюПорциюДанных(ЗаданиеСсылка,НастройкаОбмена,ИдентификаторФормы);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПослеФормированияФайловПорции(Результат,ДополнительныеПараметры)Экспорт
		
КонецПроцедуры
