
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПлан();
	
	Если Параметры.РежимВыбора Тогда
		
		ЭтаФорма.Элементы.ПланПоступленийВыбытий.ТолькоПросмотр 		= Истина;
		ЭтаФорма.Элементы.ПланПоступленийВыбытий.КнопкаОткрытия 		= Ложь;
		ЭтаФорма.Элементы.ПланПоступленийВыбытий.КнопкаВыбора 			= Ложь;
		ЭтаФорма.Элементы.ПланПоступленийВыбытий.КнопкаОчистки 			= Ложь;
		ЭтаФорма.Элементы.ПланПоступленийВыбытий.КнопкаРегулирования 	= Ложь;
		ЭтаФорма.Элементы.ПланПоступленийВыбытий.КнопкаСпискаВыбора 	= Ложь;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список, 
	"ПризнакНацПроекта", 
	"_______[" + БюджетнаяКлассификацияКлиентСервер.СтрокаКодовНацПроектов('20241231') + "]____________"); 
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
	Список, 
	"ПризнакНацПроекта2025", 
	"_______[" + БюджетнаяКлассификацияКлиентСервер.СтрокаКодовНацПроектов() + "]____________");    
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"Владелец", 
	ПланПоступленийВыбытий, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(ПланПоступленийВыбытий));
	
	Элементы.Владелец.Видимость = НЕ ЗначениеЗаполнено(ПланПоступленийВыбытий); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ПланПоступленийВыбытийПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	Список, 
	"Владелец", 
	ПланПоступленийВыбытий, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	ЗначениеЗаполнено(ПланПоступленийВыбытий));
	
	Элементы.Владелец.Видимость = НЕ ЗначениеЗаполнено(ПланПоступленийВыбытий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции        

// Процедура устанавливает План поступлений (выбытий) в форме по данным переданного отбора.
//
&НаСервере
Процедура УстановитьПлан()
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		ПланПоступленийВыбытий = Параметры.Отбор.Владелец;
		Элементы.ПланПоступленийВыбытий.ТолькоПросмотр = Истина;
		Элементы.ПланПоступленийВыбытий.КнопкаОткрытия = Ложь;

	КонецЕсли;
	
КонецПроцедуры // УстановитьОрганизацию()

#КонецОбласти