#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Первоначальное заполнение регистра сведений "Параметры учета ОС"
// Вводятся границы стоимости для определения способа начисления амортизации
//
Процедура ЗаполнитьПоУмолчанию() Экспорт
	      
	НаборЗаписей = РегистрыСведений.ПараметрыУчетаОС.СоздатьНаборЗаписей();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период			= '19800101';
	Запись.ПервыйПределОС	= 1000;
	Запись.ВторойПределОС	= 10000;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период			= '20090101';
	Запись.ПервыйПределОС	= 3000;
	Запись.ВторойПределОС	= 20000;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период			= '20110101';
	Запись.ПервыйПределОС	= 3000;
	Запись.ВторойПределОС	= 40000;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Период			= '20180101';
	Запись.ПервыйПределОС	= 10000;
	Запись.ВторойПределОС	= 100000;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устерела. Использовать ЗаполнитьПоУмолчанию
Процедура УстановитьПараметрыУчетаОС() Экспорт
	ЗаполнитьПоУмолчанию();	
КонецПроцедуры

#КонецОбласти

#КонецЕсли