
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	//  Оповещение используется в документе УведомлениеОбУточненииВидаИПринадлежностиПлатежа и УведомлениеОбУточненииОперацийКлиента
	//	для подбора документов в табличную часть
	Оповестить("ВыбранПлатежноРасчетныйДокумент", Значение);
КонецПроцедуры

#КонецОбласти
