#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Формирует таблицу двдижений по регистру сведений "Операции капвложений"
// Вызывается после формирования таблицы проводок для документа при его проведении
//
// Параметры:
//  ТаблицаПроводок - Таблица значений. Таблица проводок, которые будут сформированы
//  ДокументОбъект - Документ объект. Документ, из которого формируются движения
//  ДополнительныеРеквизиты - Структура. Структура дополнительных реквизитов типовой бухгалтерской операции
//  ТабДвижений - Таблица значений. Исходящая таблица. Ее заполняет эта функция
//  ТекстОшибки - Строка. Исходящая строка, описание ошики. Ее заполняет эта функция, если была ошибка.
//
// Возвращает флаг ошибки. Если Истина - все ОК, иначе - Ложь
Функция ИнициализироватьТабДвиженийДляКарточкиКапвложений(
	ТаблицаПроводок, ДокументОбъект, ДополнительныеРеквизиты, ТабДвижений, ТекстОшибки) Экспорт

	ОперацииСоСчетом106 = Новый Массив;
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийРеконструкцияОС.МодернизацияОС);
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийРеконструкцияОС.МодернизацияНМА);
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийРеконструкцияОС.МодернизацияНПА);
	Если ОперацииСоСчетом106.Найти(ДокументОбъект.ВидОперации) = Неопределено 
		ИЛИ НЕ ДокументОбъект.ОтразитьВКарточкеКапвложений Тогда
		Возврат Истина;	
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокументОбъект.КарточкаКапвложений) Тогда
		ТекстОшибки = НСтр("ru = 'На закладке документа ""Стоимость вложений"" включен флажок 
		|""Отразить в:"", но не заполнена Карточка капвложений'");
		Возврат Ложь;
	КонецЕсли;	
	
	НоваяСтрока = ТабДвижений.Добавить();
	НоваяСтрока.Организация         = ДокументОбъект.Организация;
	НоваяСтрока.КарточкаКапвложений = ДокументОбъект.КарточкаКапвложений;
	НоваяСтрока.Период              = ДокументОбъект.Дата;

	Возврат Истина;
КонецФункции	

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, 
		"Организация,Дата,Номер,ВидОперации,КФО,ТолькоРегистрацияАкта, СформироватьПеремещение");
		
	Если ЗначенияРеквизитов.ТолькоРегистрацияАкта Тогда
		// Очистим старые движения документа. Автоматически они не удаляются.  
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Для каждого НаборЗаписей из ДокументОбъект.Движения Цикл
			ИмяРегистра = НаборЗаписей.Метаданные().Имя;
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить(ИмяРегистра, НаборЗаписей.ВыгрузитьКолонки());
		КонецЦикла;	
		
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"				, ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяФормыДокумента"	, НСтр("ru = 'Акт приема-сдачи отремонтированных, реконструированных и модернизированных объектов основных средств'"));
	Запрос.УстановитьПараметр("НомерДокумента"		, ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, ЗначенияРеквизитов.Номер));
	Запрос.УстановитьПараметр("Организация"			, ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("МоментВремени"		, Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("УчетПоПодразделениям", УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям());
	
	НомераТаблиц = Новый Структура;
	НомераТаблиц.Вставить("ОСДокумента", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	РеконструкцияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ОСДокумента
	|ИЗ
	|	Документ.РеконструкцияОС.ОсновныеСредства КАК РеконструкцияОСОсновныеСредства
	|ГДЕ
	|	РеконструкцияОСОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	НомераТаблиц.Вставить("ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации
	|ПОМЕСТИТЬ ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОСДокумента.ОсновноеСредство
	|					ИЗ
	|						ОСДокумента КАК ОСДокумента)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство";
	
	НомераТаблиц.Вставить("СобытияОССрезПоследних", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаВводаВЭксплуатацию
	|ПОМЕСТИТЬ СобытияОССрезПоследних
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОСДокумента.ОсновноеСредство
	|					ИЗ
	|						ОСДокумента КАК ОСДокумента)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)) КАК СобытияОССрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СобытияОССрезПоследних.ОсновноеСредство";
	
	НомераТаблиц.Вставить("РасчетАмортизацииОССрезПоследних", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.КоэффициентУскорения,
	|	РасчетАмортизацииОССрезПоследних.ПараметрВыработки
	|ПОМЕСТИТЬ РасчетАмортизацииОССрезПоследних
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОСДокумента.ОсновноеСредство
	|					ИЗ
	|						ОСДокумента КАК ОСДокумента)) КАК РасчетАмортизацииОССрезПоследних";
	
	НомераТаблиц.Вставить("СтоимостьОстатки", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.Договор КАК Договор
	|ПОМЕСТИТЬ СтоимостьОстатки
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&МоментВремени,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОСДокумента.ОсновноеСредство
	|					ИЗ
	|						ОСДокумента КАК ОСДокумента)
	|				И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки";
	
	НомераТаблиц.Вставить("ДанныеДокумента", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	РеконструкцияОСОсновныеСредства.Ссылка.Дата КАК Дата,
	|	РеконструкцияОСОсновныеСредства.Ссылка.Организация КАК Организация,
	|	РеконструкцияОСОсновныеСредства.Ссылка.Подразделение КАК Подразделение,
	|	РеконструкцияОСОсновныеСредства.Ссылка.ВидОперации КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА РеконструкцияОСОсновныеСредства.Ссылка.ВидПервичногоДокумента = """"
	|			ТОГДА &ИмяФормыДокумента
	|		ИНАЧЕ РеконструкцияОСОсновныеСредства.Ссылка.ВидПервичногоДокумента
	|	КОНЕЦ КАК НазваниеДокумента,
	|	ВЫБОР
	|		КОГДА РеконструкцияОСОсновныеСредства.Ссылка.НомерПервичногоДокумента = """"
	|			ТОГДА &НомерДокумента
	|		ИНАЧЕ РеконструкцияОСОсновныеСредства.Ссылка.НомерПервичногоДокумента
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА РеконструкцияОСОсновныеСредства.Ссылка.ДатаПервичногоДокумента = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА РеконструкцияОСОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ РеконструкцияОСОсновныеСредства.Ссылка.ДатаПервичногоДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|	РеконструкцияОСОсновныеСредства.Ссылка.НаименованиеГарантийногоТалона КАК НаименованиеГТ,
	|	РеконструкцияОСОсновныеСредства.Ссылка.НомерГарантийногоТалона КАК НомерГТ,
	|	РеконструкцияОСОсновныеСредства.Ссылка.ДатаГарантийногоТалона КАК ДатаГТ,
	|	РеконструкцияОСОсновныеСредства.Ссылка.СрокДействияГарантийногоТалона КАК СрокДействияГТ,
	|	РеконструкцияОСОсновныеСредства.Ссылка.Договор КАК ДоговорИсполнителя,
	|	РеконструкцияОСОсновныеСредства.ВидРаботы КАК ВидРаботы,
	|	РеконструкцияОСОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	РеконструкцияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РеконструкцияОСОсновныеСредства.ЦМО КАК ЦМО,
	|	РеконструкцияОСОсновныеСредства.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	РеконструкцияОСОсновныеСредства.СрокЭксплуатацииФакт КАК СрокЭксплуатацииФакт,
	|	РеконструкцияОСОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации КАК
	|		СрокПолезногоИспользованияПослеМодернизации,
	|	РеконструкцияОСОсновныеСредства.СрокПолезногоИспользованияПослеМодернизацииНУ КАК
	|		СрокПолезногоИспользованияПослеМодернизацииНУ,
	|	РеконструкцияОСОсновныеСредства.ПредполагаемыйОбъемВыработкиПослеМодернизации КАК
	|		ПредполагаемыйОбъемВыработкиПослеМодернизации,
	|	РеконструкцияОСОсновныеСредства.СчетУчетаЗатратПоАмортизационнойПремии КАК СчетУчетаЗатратПоАмортизационнойПремии,
	|	РеконструкцияОСОсновныеСредства.СубконтоПоАмортизационнойПремии1 КАК СубконтоПоАмортизационнойПремии1,
	|	РеконструкцияОСОсновныеСредства.СубконтоПоАмортизационнойПремии2 КАК СубконтоПоАмортизационнойПремии2,
	|	РеконструкцияОСОсновныеСредства.СубконтоПоАмортизационнойПремии3 КАК СубконтоПоАмортизационнойПремии3,
	|	РеконструкцияОСОсновныеСредства.СуммаКапитальныхВложенийВключаемыхВРасходыНУ КАК
	|		СуммаКапитальныхВложенийВключаемыхВРасходыНУ,
	|	РеконструкцияОСОсновныеСредства.СуммаРемонта + РеконструкцияОСОсновныеСредства.СуммаДемонтажа +
	|		РеконструкцияОСОсновныеСредства.СуммаТранспортировки КАК СуммаРемонта,
	|	РеконструкцияОСОсновныеСредства.СуммаМодернизации + РеконструкцияОСОсновныеСредства.СуммаДемонтажа +
	|		РеконструкцияОСОсновныеСредства.СуммаТранспортировки КАК СуммаМодернизации,
	|	РеконструкцияОСОсновныеСредства.Сумма1 КАК Сумма1,
	|	РеконструкцияОСОсновныеСредства.Сумма2 КАК Сумма2,
	|	РеконструкцияОСОсновныеСредства.Сумма4 КАК Сумма4,
	|	РеконструкцияОСОсновныеСредства.Сумма5 КАК Сумма5,
	|	РеконструкцияОСОсновныеСредства.Сумма6 КАК Сумма6,
	|	РеконструкцияОСОсновныеСредства.Сумма7 КАК Сумма7,
	|	РеконструкцияОСОсновныеСредства.СуммаМодернизацииНУ КАК СуммаМодернизацииНУ,
	|	РеконструкцияОСОсновныеСредства.СуммаМодернизацииНеУчитываетсяНУ КАК СуммаМодернизацииНеУчитываетсяНУ,
	|	РеконструкцияОСОсновныеСредства.СуммаМодернизацииЕНВД КАК СуммаМодернизацииЕНВД,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ЕСТЬNULL(СобытияОССрезПоследних.ДатаВводаВЭксплуатацию, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатацию,
	|	РасчетАмортизацииОССрезПоследних.КоэффициентУскорения КАК КоэффициентУскорения,
	|	РасчетАмортизацииОССрезПоследних.ПараметрВыработки КАК ПараметрВыработки,
	|	СтоимостьОстатки.Договор КАК Договор,
	|	РеконструкцияОСОсновныеСредства.ВосстановительнаяСтоимость КАК ВосстановительнаяСтоимость,
	|	РеконструкцияОСОсновныеСредства.ЦМОПолучатель КАК ЦМОПолучатель,
	|	РеконструкцияОСОсновныеСредства.Ссылка.СформироватьПеремещение КАК СформироватьПеремещение
	|ПОМЕСТИТЬ ДанныеДокумента
	|ИЗ
	|	Документ.РеконструкцияОС.ОсновныеСредства КАК РеконструкцияОСОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних КАК
	|			ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|		ПО РеконструкцияОСОсновныеСредства.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобытияОССрезПоследних КАК СобытияОССрезПоследних
	|		ПО РеконструкцияОСОсновныеСредства.ОсновноеСредство = СобытияОССрезПоследних.ОсновноеСредство
	|		И РеконструкцияОСОсновныеСредства.ИнвентарныйНомер = СобытияОССрезПоследних.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетАмортизацииОССрезПоследних КАК РасчетАмортизацииОССрезПоследних
	|		ПО РеконструкцияОСОсновныеСредства.ОсновноеСредство = РасчетАмортизацииОССрезПоследних.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОстатки КАК СтоимостьОстатки
	|		ПО РеконструкцияОСОсновныеСредства.ОсновноеСредство = СтоимостьОстатки.ОсновноеСредство
	|		И РеконструкцияОСОсновныеСредства.ИнвентарныйНомер = СтоимостьОстатки.ИнвентарныйНомер
	|ГДЕ
	|	РеконструкцияОСОсновныеСредства.Ссылка = &Ссылка";
	
	НомераТаблиц.Вставить("КапРемонтОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.ОсновноеСредство КАК ОС,
	|	ДанныеДокумента.ИнвентарныйНомер КАК ИнвНомер,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|			ТОГДА ДанныеДокумента.СуммаРемонта
	|		ИНАЧЕ ДанныеДокумента.СуммаМодернизации
	|	КОНЕЦ КАК СуммаНаКапРемонт,
	|	ДанныеДокумента.Сумма1 КАК Сумма1,
	|	ДанныеДокумента.Сумма2 КАК Сумма2,
	|	ДанныеДокумента.Сумма4 КАК Сумма4,
	|	ДанныеДокумента.Сумма5 КАК Сумма5,
	|	ДанныеДокумента.Сумма6 КАК Сумма6,
	|	ДанныеДокумента.Сумма7 КАК Сумма7,
	|	ДанныеДокумента.НазваниеДокумента КАК НазваниеДокумента,
	|	ДанныеДокумента.НомерДокумента КАК НомерДокумента,
	|	ДанныеДокумента.ДатаДокумента КАК ДатаДокумента,
	|	ДанныеДокумента.НаименованиеГТ КАК НаименованиеГТ,
	|	ДанныеДокумента.НомерГТ КАК НомерГТ,
	|	ДанныеДокумента.ДатаГТ КАК ДатаГТ,
	|	ДанныеДокумента.СрокДействияГТ КАК СрокДействияГТ,
	|	ДанныеДокумента.ДоговорИсполнителя КАК ДоговорИсполнителя,
	|	ДанныеДокумента.ВидРаботы КАК ВидРаботы
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДанныеДокумента.НомерСтроки";
	
	НомераТаблиц.Вставить("СтоимостьОбъектовОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК ВидРаспоряжения,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеДокумента.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ДанныеДокумента.ЦМО КАК ЦМО,
	|	ДанныеДокумента.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ДанныеДокумента.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ДанныеДокумента.СуммаМодернизации КАК Стоимость,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Реконструкция) КАК Событие,
	|	ДанныеДокумента.НазваниеДокумента КАК НазваниеДокумента,
	|	ДанныеДокумента.НомерДокумента КАК НомерДокумента,
	|	ДанныеДокумента.ДатаДокумента КАК ДатаДокумента,
	|	ДанныеДокумента.ДоговорИсполнителя КАК ДоговорИсполнителя,
	|	ДанныеДокумента.ВидРаботы КАК ВидРаботы,
	|	0 КАК Количество
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|	И ДанныеДокумента.СуммаМодернизации <> 0
	|	
	|ОБЪЕДИНИТЬ ВСЕ	
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ОсновноеСредство,
	|	ДанныеДокумента.ИнвентарныйНомер,
	|	ДанныеДокумента.ЦМО,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ДанныеДокумента.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДанныеДокумента.ВосстановительнаяСтоимость,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение),
	|	ДанныеДокумента.НазваниеДокумента,
	|	ДанныеДокумента.НомерДокумента,
	|	ДанныеДокумента.ДатаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	"""",
	|	1
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|	И ДанныеДокумента.СформироватьПеремещение
	|	И ДанныеДокумента.ЦМО <> ДанныеДокумента.ЦМОПолучатель
	|	
	|ОБЪЕДИНИТЬ ВСЕ	
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ОсновноеСредство,
	|	ДанныеДокумента.ИнвентарныйНомер,
	|	ДанныеДокумента.ЦМОПолучатель,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ДанныеДокумента.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДанныеДокумента.ВосстановительнаяСтоимость,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение),
	|	ДанныеДокумента.НазваниеДокумента,
	|	ДанныеДокумента.НомерДокумента,
	|	ДанныеДокумента.ДатаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка),
	|	"""",
	|	1
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|	И ДанныеДокумента.СформироватьПеремещение
	|	И ДанныеДокумента.ЦМО <> ДанныеДокумента.ЦМОПолучатель
	|";
	
	НомераТаблиц.Вставить("АмортизацияОбъектовОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеДокумента.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ДанныеДокумента.СуммаМодернизации КАК СуммаАмортизации
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|	И ДанныеДокумента.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|	И ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|	И ДанныеДокумента.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДанныеДокумента.СуммаМодернизации <> 0";
	
	НомераТаблиц.Вставить("РасчетАмортизацииОС", НомераТаблиц.Количество());              
	// группировка в запросе, на случай, если моедрнизируются ОС с групповым инвентарным учетом,
	// тогда в ДанныеДокумента будет столько строк, сколько инвентарных номеров, но в регистре "РасчетАмортизацииОС"
	// данные хранятся для объекта в целом, без инвентарных номеров.
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Организация КАК Организация,
	|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
	|	МАКСИМУМ(ДанныеДокумента.СрокПолезногоИспользованияПослеМодернизации) КАК СрокПолезногоИспользования,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|				ТОГДА ВЫБОР
	|						КОГДА ДанныеДокумента.СрокПолезногоИспользованияПослеМодернизации > ДанныеДокумента.СрокЭксплуатацииФакт
	|							ТОГДА ДанныеДокумента.СрокПолезногоИспользованияПослеМодернизации - ДанныеДокумента.СрокЭксплуатацииФакт
	|						ИНАЧЕ 1
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СрокИспользованияДляВычисленияАмортизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.Линейный)
	|					ИЛИ ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|					ИЛИ ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|				ТОГДА ДанныеДокумента.ОстаточнаяСтоимость + ДанныеДокумента.СуммаМодернизации
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СтоимостьДляВычисленияАмортизации,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.УменьшаемогоОстатка)
	|				ТОГДА ДанныеДокумента.КоэффициентУскорения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоэффициентУскорения,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|				ТОГДА ДанныеДокумента.ПараметрВыработки
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК ПараметрВыработки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ДанныеДокумента.СпособНачисленияАмортизации = ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПропорциональноОбъемуПродукции)
	|				ТОГДА ДанныеДокумента.ПредполагаемыйОбъемВыработкиПослеМодернизации
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ПредполагаемыйОбъемВыработки,
	|	МИНИМУМ(ДанныеДокумента.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	ДанныеДокумента КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|	И ДанныеДокумента.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	МИНИМУМ(ДанныеДокумента.НомерСтроки)";
	
	#Область НалоговыйУчет
	Если УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеМодернизацию(ЗначенияРеквизитов) Тогда
		
		НомераТаблиц.Вставить("ПервоначальныеСведенияОСНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		
		"ВЫБРАТЬ
		|	ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство,
		|	ПервоначальныеСведенияОСНалоговыйУчет.ПорядокВключенияСтоимостиВСоставРасходов
		|ПОМЕСТИТЬ ПервоначальныеСведенияОСНалоговыйУчет
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.СрезПоследних(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ОСДокумента.ОсновноеСредство
		|					ИЗ
		|						ОСДокумента КАК ОСДокумента)) КАК ПервоначальныеСведенияОСНалоговыйУчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство";
		
		НомераТаблиц.Вставить("ПараметрыАмортизацииОСНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.СрокПолезногоИспользованияПослеМодернизацииНУ КАК СрокПолезногоИспользования,
		|	ДанныеДокумента.Дата КАК Период
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведенияОСНалоговыйУчет
		|		ПО ДанныеДокумента.ОсновноеСредство = ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство
		|ГДЕ
		|	ДанныеДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
		|	И ПервоначальныеСведенияОСНалоговыйУчет.ПорядокВключенияСтоимостиВСоставРасходов = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокумента.НомерСтроки";
		
		НомераТаблиц.Вставить("ПараметрыАмортизационнойПремииНалоговыйУчет", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ДанныеДокумента.ОсновноеСредство КАК ОсновноеСредство,
		|	ДанныеДокумента.Организация КАК Организация,
		|	ДанныеДокумента.СчетУчетаЗатратПоАмортизационнойПремии КАК СчетУчетаРасходов,
		|	ДанныеДокумента.СубконтоПоАмортизационнойПремии1 КАК СубконтоРасходов1,
		|	ДанныеДокумента.СубконтоПоАмортизационнойПремии2 КАК СубконтоРасходов2,
		|	ДанныеДокумента.СубконтоПоАмортизационнойПремии3 КАК СубконтоРасходов3,
		|	ДанныеДокумента.Подразделение КАК ПодразделениеРасходов,
		|	ДанныеДокумента.Дата КАК Период
		|ИЗ
		|	ДанныеДокумента КАК ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальныеСведенияОСНалоговыйУчет КАК ПервоначальныеСведенияОСНалоговыйУчет
		|		ПО ДанныеДокумента.ОсновноеСредство = ПервоначальныеСведенияОСНалоговыйУчет.ОсновноеСредство
		|ГДЕ
		|	ДанныеДокумента.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
		|	И ПервоначальныеСведенияОСНалоговыйУчет.ПорядокВключенияСтоимостиВСоставРасходов = ЗНАЧЕНИЕ(Перечисление.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации)
		|	И ДанныеДокумента.СуммаКапитальныхВложенийВключаемыхВРасходыНУ > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеДокумента.НомерСтроки";
		
	КонецЕсли;
	#КонецОбласти
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РеконструкцияОС";
	КомандаПечати.Идентификатор		= "Акт0504103_103н";
	КомандаПечати.Представление		= НСтр("ru = 'Акт приема-сдачи отремонтированных ОС (ф.0504103) (52, ред. 103н)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РеконструкцияОС";
	КомандаПечати.Идентификатор		= "Акт0504103";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Акт приема-сдачи отремонтированных ОС (ф.0504103) (52н)'");
	КомандаПечати.Порядок			= 101;
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РеконструкцияОС";
	КомандаПечати.Идентификатор		= "ОС3";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Акт о приеме - сдаче отремонтированных ОС (ОС-3)'");
	КомандаПечати.Порядок			= 102;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Акт0504103") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"Акт0504103",
			"Акт приема-сдачи отремонтированных, реконструированных и модернизированных объектов основных средств (ф.0504103)",
			Печать0504103(МассивОбъектов, ОбъектыПечати));	
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Акт0504103_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"Акт0504103_103н",
			"Акт приема-сдачи отремонтированных, реконструированных и модернизированных объектов основных средств (ф.0504103) (в ред.103н)",
			Печать0504103(МассивОбъектов, ОбъектыПечати, "103н"));
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС3") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ОС3","ОС-3", ПечатьОС3(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьОС3(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИнвентарногоОбъектаОС_ОС3";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеконструкцияОС.ПФ_MXL_ОС_3");
	Строка1        = Макет.ПолучитьОбласть("Строка1");
	Строка1П       = Макет.ПолучитьОбласть("Строка1П");
	Шапка2         = Макет.ПолучитьОбласть("Шапка2");
	Строка2        = Макет.ПолучитьОбласть("Строка2");
	Строка2П       = Макет.ПолучитьОбласть("Строка2П");
	Подвал         = Макет.ПолучитьОбласть("Подвал");
	Стр_2_1        = Макет.ПолучитьОбласть("Стр_2_1");
	Комиссия       = Макет.ПолучитьОбласть("Комиссия");
	Стр_2_2        = Макет.ПолучитьОбласть("Стр_2_2");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеконструкцияОС.Дата КАК Дата,
	|	РеконструкцияОС.Договор КАК Договор
	|ПОМЕСТИТЬ ДоговорыДокументов
	|ИЗ
	|	Документ.РеконструкцияОС КАК РеконструкцияОС
	|ГДЕ
	|	РеконструкцияОС.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеконструкцияИК.Дата,
	|	РеконструкцияИК.Договор
	|ИЗ
	|	Документ.РеконструкцияИК КАК РеконструкцияИК
	|ГДЕ
	|	РеконструкцияИК.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыДокументов.Дата КАК Дата,
	|	ДоговорыДокументов.Договор КАК Договор,
	|	МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Период) КАК Период
	|ПОМЕСТИТЬ ДоговорыДокументовСДатой
	|ИЗ
	|	ДоговорыДокументов КАК ДоговорыДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|		ПО ДоговорыДокументов.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|			И ДоговорыДокументов.Дата >= СрокиИсполненияИСуммыОбязательств.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыДокументов.Дата,
	|	ДоговорыДокументов.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеконструкцияОС.Ссылка КАК Ссылка,
	|	РеконструкцияОС.Номер КАК Номер,
	|	РеконструкцияОС.Дата КАК пДата,
	|	РеконструкцияОС.Организация КАК Организация,
	|	РеконструкцияОС.Организация.НаименованиеПолное КАК пНаименованиеОрганизации,
	|	РеконструкцияОС.Организация.КодОКПО КАК пКодОКПО,
	|	РеконструкцияОС.Подразделение КАК Подразделение,
	|	РеконструкцияОС.Подразделение.Представление КАК пПодразделение,
	|	РеконструкцияОС.ИФО КАК ИФО,
	|	РеконструкцияОС.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	РеконструкцияОС.СчетКредита КАК СчетКредита,
	|	РеконструкцияОС.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	|			ТОГДА РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		ИНАЧЕ РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо.Наименование
	|	КОНЕЦ КАК пКонтрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	|			ТОГДА РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК пИсполнитОКПО,
	|	РеконструкцияОС.Договор КАК Договор,
	|	РеконструкцияОС.КФО КАК КФО,
	|	РеконструкцияОС.КПС КАК КПС,
	|	РеконструкцияОС.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	РеконструкцияОС.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	РеконструкцияОС.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	РеконструкцияОС.СуммаДокумента КАК СуммаДокумента,
	|	РеконструкцияОС.СуммаДемонтажа КАК СуммаДемонтажа,
	|	РеконструкцияОС.СуммаТранспортировки КАК СуммаТранспортировки,
	|	РеконструкцияОС.ДатаНачала КАК пДатаНач,
	|	РеконструкцияОС.ДатаОкончания КАК пДатаКон,
	|	РеконструкцияОС.Комментарий КАК Комментарий,
	|	РеконструкцияОС.НомерПриказа КАК НомерПриказа,
	|	РеконструкцияОС.ДатаПриказа КАК ДатаПриказа,
	|	РеконструкцияОС.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	РеконструкцияОС.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	РеконструкцияОС.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	РеконструкцияОС.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	РеконструкцияОС.ВидОперации КАК ВидОперации,
	|	РеконструкцияОС.Договор.ДатаДоговора КАК пДатаДоговора,
	|	РеконструкцияОС.Договор.НомерДоговора КАК пНомерДоговора,
	|	РеконструкцияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	РеконструкцияОСОсновныеСредства.ОсновноеСредство.Представление КАК пНаименованиеОС,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.Представление КАК пИнвНомер,
	|	РеконструкцияОСОсновныеСредства.ЦМО КАК ЦМО,
	|	РеконструкцияОСОсновныеСредства.ЦМО.Сотрудник КАК ЦМОСотрудник,
	|	РеконструкцияОСОсновныеСредства.ЦМО.МестоХранения КАК ЦМОМестоХранения,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.НомерПаспорта КАК пПаспНомер,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер КАК пЗавНомер,
	|	РеконструкцияОСОсновныеСредства.СрокЭксплуатацииФакт КАК СрокЭксплуатацииФакт,
	|	1 КАК Нпп,
	|	РеконструкцияОСОсновныеСредства.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	РеконструкцияОСОсновныеСредства.ВосстановительнаяСтоимость КАК ВосстановительнаяСтоимость,
	|	РеконструкцияОСОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации КАК СрокПолезногоИспользованияПослеМодернизации,
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.Сумма, 0) КАК СуммаДоговора,
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК пДатаКонДоговора,
	|	РеконструкцияОСОсновныеСредства.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.РеконструкцияОС КАК РеконструкцияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеконструкцияОС.ОсновныеСредства КАК РеконструкцияОСОсновныеСредства
	|		ПО РеконструкцияОС.Ссылка = РеконструкцияОСОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыДокументовСДатой КАК ДоговорыДокументовСДатой
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО ДоговорыДокументовСДатой.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|				И ДоговорыДокументовСДатой.Период = СрокиИсполненияИСуммыОбязательств.Период
	|		ПО РеконструкцияОС.Договор = ДоговорыДокументовСДатой.Договор
	|ГДЕ
	|	РеконструкцияОС.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеконструкцияИК.Ссылка,
	|	РеконструкцияИК.Номер,
	|	РеконструкцияИК.Дата,
	|	РеконструкцияИК.Организация,
	|	РеконструкцияИК.Организация.НаименованиеПолное,
	|	РеконструкцияИК.Организация.КодОКПО,
	|	РеконструкцияИК.Подразделение,
	|	РеконструкцияИК.Подразделение.Представление,
	|	РеконструкцияИК.ИФО,
	|	РеконструкцияИК.ВнеоборотныйАктив,
	|	РеконструкцияИК.СчетКредита,
	|	РеконструкцияИК.Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	|			ТОГДА РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|		ИНАЧЕ РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	|			ТОГДА РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	РеконструкцияИК.Договор,
	|	РеконструкцияИК.КФО,
	|	РеконструкцияИК.КПСУчетаИК,
	|	РеконструкцияИК.ВидПервичногоДокумента,
	|	РеконструкцияИК.НомерПервичногоДокумента,
	|	РеконструкцияИК.ДатаПервичногоДокумента,
	|	РеконструкцияИК.СуммаДокумента,
	|	РеконструкцияИК.СуммаДемонтажа,
	|	РеконструкцияИК.СуммаТранспортировки,
	|	РеконструкцияИК.ДатаНачала,
	|	РеконструкцияИК.ДатаОкончания,
	|	РеконструкцияИК.Комментарий,
	|	РеконструкцияИК.НомерПриказа,
	|	РеконструкцияИК.ДатаПриказа,
	|	РеконструкцияИК.ДолжностьПредседателяКомиссии,
	|	РеконструкцияИК.ФамилияПредседателяКомиссии,
	|	РеконструкцияИК.ИмяПредседателяКомиссии,
	|	РеконструкцияИК.ОтчествоПредседателяКомиссии,
	|	РеконструкцияИК.ВидОперации,
	|	РеконструкцияИК.Договор.ДатаДоговора,
	|	РеконструкцияИК.Договор.НомерДоговора,
	|	РеконструкцияИКОсновныеСредства.ОсновноеСредство,
	|	РеконструкцияИКОсновныеСредства.ОсновноеСредство.Представление,
	|	РеконструкцияИКОсновныеСредства.ИнвентарныйНомер,
	|	РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.Представление,
	|	РеконструкцияИКОсновныеСредства.ЦМО,
	|	РеконструкцияИКОсновныеСредства.ЦМО.Сотрудник,
	|	РеконструкцияИКОсновныеСредства.ЦМО.МестоХранения,
	|	РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.НомерПаспорта,
	|	РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер,
	|	РеконструкцияИКОсновныеСредства.СрокЭксплуатацииФакт,
	|	1,
	|	РеконструкцияИКОсновныеСредства.ОстаточнаяСтоимость,
	|	РеконструкцияИКОсновныеСредства.ВосстановительнаяСтоимость,
	|	РеконструкцияИКОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации,
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.Сумма, 0),
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ДАТАВРЕМЯ(1, 1, 1)),
	|	РеконструкцияИКОсновныеСредства.НомерСтроки
	|ИЗ
	|	Документ.РеконструкцияИК КАК РеконструкцияИК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеконструкцияИК.ОсновныеСредства КАК РеконструкцияИКОсновныеСредства
	|		ПО РеконструкцияИК.Ссылка = РеконструкцияИКОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыДокументовСДатой КАК ДоговорыДокументовСДатой
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО ДоговорыДокументовСДатой.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|				И ДоговорыДокументовСДатой.Период = СрокиИсполненияИСуммыОбязательств.Период
	|		ПО РеконструкцияИК.Договор = ДоговорыДокументовСДатой.Договор
	|ГДЕ
	|	РеконструкцияИК.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	пДата,
	|	Номер,
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеконструкцияОССоставКомиссии.Ссылка КАК Ссылка,
	|	РеконструкцияОССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РеконструкцияОССоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	РеконструкцияОССоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	РеконструкцияОССоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	РеконструкцияОССоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.РеконструкцияОС.СоставКомиссии КАК РеконструкцияОССоставКомиссии
	|ГДЕ
	|	РеконструкцияОССоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеконструкцияИКСоставКомиссии.Ссылка,
	|	РеконструкцияИКСоставКомиссии.НомерСтроки,
	|	РеконструкцияИКСоставКомиссии.ДолжностьЧленаКомиссии,
	|	РеконструкцияИКСоставКомиссии.ФамилияЧленаКомиссии,
	|	РеконструкцияИКСоставКомиссии.ИмяЧленаКомиссии,
	|	РеконструкцияИКСоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.РеконструкцияИК.СоставКомиссии КАК РеконструкцияИКСоставКомиссии
	|ГДЕ
	|	РеконструкцияИКСоставКомиссии.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаШапкаВся	= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия	= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапкаВся.Следующий() Цикл
		
		ВыборкаШапка = ВыборкаШапкаВся.Выбрать();
		КоличествоСтрок = ВыборкаШапка.Количество();
		
		СуммаМодернизацииВся = ВыборкаШапкаВся.СуммаДокумента;
		СуммаМодернизацииЗаЕд = Окр(?(КоличествоСтрок>0,СуммаМодернизацииВся/КоличествоСтрок,0),2);
		ОстатокМодернизации = СуммаМодернизацииВся - СуммаМодернизацииЗаЕд*КоличествоСтрок;
		
		СуммаДемонтажаВся = ВыборкаШапкаВся.СуммаДемонтажа;
		СтрЗатратыНаДемонтаж = Окр(?(КоличествоСтрок>0,СуммаДемонтажаВся/КоличествоСтрок,0),2);
		ОстатокДемонтажа = СуммаДемонтажаВся - СтрЗатратыНаДемонтаж*КоличествоСтрок;
		
		СуммаТранспортировкиВся = ВыборкаШапкаВся.СуммаТранспортировки;
		СтрЗатратыТранспорт = Окр(?(КоличествоСтрок>0,СуммаТранспортировкиВся/КоличествоСтрок,0),2);
		ОстатокТранспорт = СуммаТранспортировкиВся - СтрЗатратыТранспорт*КоличествоСтрок;
		
		ЭтоПервый = Истина;
		
		//Общие параметры
		НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапкаВся.Ссылка,ВыборкаШапкаВся.Номер);
		Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
			Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаШапка.Организация, ВыборкаШапка.пДата);
		
		ОргДиректор = Справочники.Сотрудники.ФамилияИО(Руководитель.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.пДата);
		Пока ВыборкаШапка.Следующий() Цикл 
			
			Если ЭтоПервый Тогда
				СуммаДоговорВся = ВыборкаШапка.СуммаДоговора;
				СтрСуммаДоговор = Окр(?(КоличествоСтрок>0,СуммаДоговорВся/КоличествоСтрок,0),2);
				ОстатокДоговор = СуммаДоговорВся - СтрСуммаДоговор*КоличествоСтрок;
				ЭтоПервый = Ложь;
			КонецЕсли;
			Если ВыборкаШапка.НомерСтроки = КоличествоСтрок Тогда
				СуммаМодернизацииЗаЕд = СуммаМодернизацииЗаЕд + ОстатокМодернизации;
				СтрЗатратыНаДемонтаж = СтрЗатратыНаДемонтаж + ОстатокДемонтажа;
				СтрЗатратыТранспорт = СтрЗатратыТранспорт + ОстатокТранспорт;
				СтрСуммаДоговор = СтрСуммаДоговор + ОстатокДоговор;
			КонецЕсли;
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Шапка1 = Макет.ПолучитьОбласть("Шапка1");
			
			Шапка1.Параметры.Заполнить(ВыборкаШапка);
			СтруктураШапка1 = Новый Структура("пНомерАкта,РукДолжность,ОргДиректор");
			СтруктураШапка1.пНомерАкта = НомерАкта;
			
			СтруктураШапка1.РукДолжность = Руководитель.ДолжностьПредставление;
			СтруктураШапка1.ОргДиректор	 = ОргДиректор;
			Шапка1.Параметры.Заполнить(СтруктураШапка1);
			ТабличныйДокумент.Вывести(Шапка1);
			
			Строка1.Параметры.Заполнить(ВыборкаШапка);
			СтрВосстановитСтоимость = Формат(ВыборкаШапка.ВосстановительнаяСтоимость,"ЧЦ=18; ЧДЦ=2; ЧН=-")
				+Символы.ПС+"("+Формат(ВыборкаШапка.ОстаточнаяСтоимость, "ЧЦ=18; ЧДЦ=2; ЧН=-")+")";
			СтруктураСтрока1 = Новый Структура("СтрВосстанСтоимость,пСрокЭксплуатации",СтрВосстановитСтоимость,УправлениеОсновнымиСредствами.МесяцВГод(ВыборкаШапка.СрокЭксплуатацииФакт));
			Строка1.Параметры.Заполнить(СтруктураСтрока1);
			ТабличныйДокумент.Вывести(Строка1);
			ТабличныйДокумент.Вывести(Строка1П);
			ТабличныйДокумент.Вывести(Шапка2);
			Строка2.Параметры.Заполнить(ВыборкаШапка);
			Подвал.Параметры.Заполнить(ВыборкаШапка);
			СтруктураСтрока2 = Новый Структура("СтрЗатратыНаДемонтаж,СтрЗатратыТранспорт,СтрСтоимостьРемФакт,СтрСтоимостьРекФакт,СтрСтоимостьРемПоДогу,СтрСтоимостьРекПоДогу");
			СтруктураПодвал = Новый Структура("СтрЗатратыНаДемонтаж,СтрЗатратыТранспорт,СтрСтоимостьРемПоДогу,СтрСтоимостьРекПоДогу,СтрСтоимостьРемФакт,СтрСтоимостьРекФакт,СтрКонСтоимостьОС,ПослМесяцАмортизации");
			Если ВыборкаШапка.ВидОперации = Перечисления.ВидыОперацийРеконструкцияОС.КапРемонтОС Тогда
				СтруктураСтрока2.СтрСтоимостьРемФакт = СуммаМодернизацииЗаЕд - СтрЗатратыНаДемонтаж - СтрЗатратыТранспорт;
				СтруктураСтрока2.СтрСтоимостьРекФакт = 0;
				СтруктураСтрока2.СтрСтоимостьРемПоДогу = СтрСуммаДоговор;
				СтруктураСтрока2.СтрСтоимостьРекПоДогу = 0;
				СтруктураПодвал.СтрСтоимостьРемПоДогу = СтрСуммаДоговор;
				СтруктураПодвал.СтрСтоимостьРекПоДогу = 0;
				СтруктураПодвал.СтрСтоимостьРемФакт = СуммаМодернизацииЗаЕд - СтрЗатратыНаДемонтаж - СтрЗатратыТранспорт;
				СтруктураПодвал.СтрСтоимостьРекФакт = 0;
				СтруктураПодвал.СтрКонСтоимостьОС = "";
				СтруктураПодвал.ПослМесяцАмортизации = "";
				Стр_2_1.Параметры.Заполнить(Новый Структура("пНазваниеРаботы", "ремонта"));
			Иначе
				СтруктураСтрока2.СтрСтоимостьРекФакт = СуммаМодернизацииЗаЕд - СтрЗатратыНаДемонтаж - СтрЗатратыТранспорт;
				СтруктураСтрока2.СтрСтоимостьРемФакт = 0;
				СтруктураСтрока2.СтрСтоимостьРемПоДогу = 0;
				СтруктураСтрока2.СтрСтоимостьРекПоДогу = СтрСуммаДоговор;
				СтруктураПодвал.СтрСтоимостьРемПоДогу = 0;
				СтруктураПодвал.СтрСтоимостьРекПоДогу = СтрСуммаДоговор;
				СтруктураПодвал.СтрСтоимостьРекФакт = СуммаМодернизацииЗаЕд - СтрЗатратыНаДемонтаж - СтрЗатратыТранспорт;
				СтруктураПодвал.СтрСтоимостьРемФакт = 0;
				СтруктураПодвал.СтрКонСтоимостьОС = Формат(ВыборкаШапка.ВосстановительнаяСтоимость + СуммаМодернизацииЗаЕд,"ЧЦ=18; ЧДЦ=2; ЧН=-");
				СтруктураПодвал.ПослМесяцАмортизации = Формат(КонецМесяца(ДобавитьМесяц(НачалоМесяца(ВыборкаШапка.пДата),ВыборкаШапка.СрокПолезногоИспользованияПослеМодернизации-1)), "ДФ='MMMM yyyy'");
				Стр_2_1.Параметры.Заполнить(Новый Структура("пНазваниеРаботы", "реконструкции, модернизации"));
			КонецЕсли;
			СтруктураСтрока2.СтрЗатратыНаДемонтаж = СтрЗатратыНаДемонтаж;
			СтруктураСтрока2.СтрЗатратыТранспорт = СтрЗатратыТранспорт;
			
			СтруктураПодвал.СтрЗатратыНаДемонтаж = СтрЗатратыНаДемонтаж;
			СтруктураПодвал.СтрЗатратыТранспорт = СтрЗатратыТранспорт;
			
			Строка2.Параметры.Заполнить(СтруктураСтрока2);
			Подвал.Параметры.Заполнить(СтруктураПодвал);
			
			ТабличныйДокумент.Вывести(Строка2);
			ТабличныйДокумент.Вывести(Строка2П);
			ТабличныйДокумент.Вывести(Подвал);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабличныйДокумент.Вывести(Стр_2_1);
			
			Если ВыборкаКомиссия.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
				ВыборкаКомиссияТекДок = ВыборкаКомиссия.Выбрать();
			Иначе
				ВыборкаКомиссияТекДок = Неопределено;
			КонецЕсли;
			пЧленыКомиссии = "";
			ОбластьКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(ВыборкаШапка, ВыборкаКомиссияТекДок, Комиссия, 3, пЧленыКомиссии);
			ТабличныйДокумент.Вывести(ОбластьКомиссия);
			
			Бухгалтер = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер, ВыборкаШапка.Организация, ВыборкаШапка.пДата);
			Стр_2_2.Параметры.Заполнить(Новый Структура("ОргБухгалтер", Справочники.Сотрудники.ФамилияИО(Бухгалтер.ОтветственноеЛицоСсылка, Истина, ВыборкаШапка.пДата)));
			
			ТабличныйДокумент.Вывести(Стр_2_2);
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Печать0504103(МассивОбъектов, ОбъектыПечати, Редакция = "")
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_Акт0504103";
	
	ИмяМакета = "Документ.РеконструкцияОС.ПФ_MXL_Акт0504103" + ?(ЗначениеЗаполнено(Редакция), "_", "") + Редакция;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ИмяМакета);
	
	Шапка						= Макет.ПолучитьОбласть("Шапка");
	РеквизитыДоговора			= Макет.ПолучитьОбласть("РеквизитыДоговора");
	ШапкаОбъекты				= Макет.ПолучитьОбласть("ШапкаОбъекты");
	СтрокаОбъекты				= Макет.ПолучитьОбласть("СтрокаОбъекты");
	ШапкаРаботыРасходы			= Макет.ПолучитьОбласть("ШапкаРаботыРасходы");
	СтрокаРаботыРасходы			= Макет.ПолучитьОбласть("СтрокаРаботыРасходы");
	ИтогиРаботыРасходы			= Макет.ПолучитьОбласть("ИтогиРаботыРасходы");
	ЗаключениеКомиссии1			= Макет.ПолучитьОбласть("ЗаключениеКомиссии1");
	ЗаключениеКомиссии2			= Макет.ПолучитьОбласть("ЗаключениеКомиссии2");
	ОбластьСоставКомиссии    	= Макет.ПолучитьОбласть("СоставКомиссии");
	КомиссияДата    	    	= Макет.ПолучитьОбласть("КомиссияДата");
	Подвал						= Макет.ПолучитьОбласть("Подвал");
	ОтметкаБухгалтерииШапка		= Макет.ПолучитьОбласть("ОтметкаБухгалтерииШапка");
	ОтметкаБухгалтерииСтрока	= Макет.ПолучитьОбласть("ОтметкаБухгалтерииСтрока");
	ОтметкаБухгалтерииПодвал	= Макет.ПолучитьОбласть("ОтметкаБухгалтерииПодвал");
	
	Результат			= ДанныеДляПечати0504103(МассивОбъектов);
	ВыборкаШапка		= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаВсеКомиссии	= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДвижений		= Результат[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Шапка
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(
			Шапка, "НомерАкта", ВыборкаШапка.НомерАкта, ВыборкаШапка.Ссылка, , Истина);
		
		Если ЗначениеЗаполнено(ВыборкаШапка.Руководитель) Тогда
			СотрудникиДокумента = Новый Массив; // Массив из СправочникСсылка.Сотрудники
			СотрудникиДокумента.Добавить(ВыборкаШапка.Руководитель);
			ДанныеСотрудниковДокумента = Справочники.Сотрудники.ДанныеСотрудников(СотрудникиДокумента,
				"Фамилия, Имя, Отчество", ВыборкаШапка.Дата); 
			РуководительПредставление = КорреспондентыКлиентСервер.ФИО(
				ДанныеСотрудниковДокумента.Получить(ВыборкаШапка.Руководитель), Истина);
		Иначе	
			Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
				Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаШапка.ОрганизацияСсылка, ВыборкаШапка.Дата);
			РуководительФИО = Новый Структура("Фамилия,Имя,Отчество", Руководитель.ОтветственноеЛицоФамилия,
				Руководитель.ОтветственноеЛицоИмя, Руководитель.ОтветственноеЛицоОтчество);
			РуководительПредставление = КорреспондентыКлиентСервер.ФИО(РуководительФИО, Истина);
		КонецЕсли;	 
		
		Шапка.Параметры.Заполнить(ВыборкаШапка);
		Шапка.Параметры.Заполнить(Новый Структура("ОргДиректор", РуководительПредставление));
		
		ТабличныйДокумент.Вывести(Шапка);
		
		// Таблица 1
		
		РеквизитыДоговора.Параметры.Заполнить(ВыборкаШапка);
		ТабличныйДокумент.Вывести(РеквизитыДоговора);
		
		// Таблица 2
		
		ТабличныйДокумент.Вывести(ШапкаОбъекты);
		
		ВыборкаОбъекты = ВыборкаШапка.Выбрать();
		Пока ВыборкаОбъекты.Следующий() Цикл 
			
			СтрокаОбъекты.Параметры.Заполнить(ВыборкаОбъекты);
			СтруктураОбъекта = Новый Структура;
			СтруктураОбъекта.Вставить("ИнвентарныйНомер", СокрП(ВыборкаОбъекты.ИнвентарныйНомер));
			СтруктураОбъекта.Вставить("СрокЭксплуатации", УправлениеОсновнымиСредствами.МесяцВГод(ВыборкаОбъекты.СрокЭксплуатации));
			СтрокаОбъекты.Параметры.Заполнить(СтруктураОбъекта);
			
			ТабличныйДокумент.Вывести(СтрокаОбъекты);
			
		КонецЦикла;
		
		// Таблица 3
		
		ВыборкаОбъекты.Сбросить();
		
		ТабличныйДокумент.Вывести(ШапкаРаботыРасходы);
		
		СуммаСтоимость = 0;
		Пока ВыборкаОбъекты.Следующий() Цикл 
			
			СтрокаРаботыРасходы.Параметры.Заполнить(ВыборкаОбъекты);
			СтрокаРаботыРасходы.Параметры.Заполнить(Новый Структура("пСрокПолезногоИспользованияПослеМодернизации",
				УправлениеОсновнымиСредствами.МесяцВГод(ВыборкаОбъекты.СрокПолезногоИспользованияПослеМодернизации)));
			ТабличныйДокумент.Вывести(СтрокаРаботыРасходы);
			
			СуммаСтоимость = СуммаСтоимость + ВыборкаОбъекты.Стоимость;
			
		КонецЦикла;
		
		ИтогиРаботыРасходы.Параметры.Заполнить(ВыборкаШапка);
		ИтогиРаботыРасходы.Параметры.Заполнить(Новый Структура("СуммаСтоимость", СуммаСтоимость));
		ТабличныйДокумент.Вывести(ИтогиРаботыРасходы);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Заключение комиссии
		
		ЗаключениеКомиссии1.Параметры.Заполнить(ВыборкаШапка);
		ТабличныйДокумент.Вывести(ЗаключениеКомиссии1);
		ЗаключениеКомиссии2.Параметры.Заполнить(ВыборкаШапка);
		ТабличныйДокумент.Вывести(ЗаключениеКомиссии2);
		
		Если ВыборкаВсеКомиссии.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			ВыборкаКомиссия = ВыборкаВсеКомиссии.Выбрать();
		Иначе
			ВыборкаКомиссия = Неопределено;
		КонецЕсли;
		СоставКомиссии = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(ВыборкаШапка, ВыборкаКомиссия, ОбластьСоставКомиссии);
		ТабличныйДокумент.Вывести(СоставКомиссии);
		
		ТабличныйДокумент.Вывести(КомиссияДата);
		
		ТабличныйДокумент.Вывести(Подвал);
		
		ТабличныйДокумент.Вывести(ОтметкаБухгалтерииШапка);
		
		// Бухгалтерская отметка
		
		ВыборкаДвижений.Сбросить();
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
		Проводка = Новый Структура("СчетДт,СчетКт,Сумма");
		Если ВыборкаДвижений.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаДвижение = ВыборкаДвижений.Выбрать();
			Пока ВыборкаДвижение.Следующий() Цикл
				Проводка.СчетДт	= УправлениеПечатьюБГУ.ПредставлениеСчета(ВыборкаДвижение, "Дт");
				Проводка.СчетКт	= УправлениеПечатьюБГУ.ПредставлениеСчета(ВыборкаДвижение, "Кт");
				Проводка.Сумма	= ВыборкаДвижение.Сумма;
				ОтметкаБухгалтерииСтрока.Параметры.Заполнить(Проводка);
				ТабличныйДокумент.Вывести(ОтметкаБухгалтерииСтрока);
			КонецЦикла;
		Иначе
			ОтметкаБухгалтерииСтрока.Параметры.Заполнить(Проводка);
			ТабличныйДокумент.Вывести(ОтметкаБухгалтерииСтрока);
		КонецЕсли;
		
		//Подписи ответственных лиц
		
		СведенияИсполнителя = УправлениеПечатьюБГУ.СведенияИсполнителяПоОтветственному(ВыборкаШапка.Ответственный,
			ВыборкаШапка.ОрганизацияСсылка, ВыборкаШапка.Дата, Истина);
		
		ДанныеИсполнителя = Новый Структура;
		ДанныеИсполнителя.Вставить("ФИОИсполнитель"			, СведенияИсполнителя.ФИО);
		ДанныеИсполнителя.Вставить("ДолжностьИсполнитель"	, СведенияИсполнителя.ДолжностьНаименование);
		ДанныеИсполнителя.Вставить("НомерТелефона"			, СведенияИсполнителя.НомерТелефона);
		ДанныеИсполнителя.Вставить("ЭлектроннаяПочта"		, СведенияИсполнителя.ЭлектроннаяПочта);
		
		ОтметкаБухгалтерииПодвал.Параметры.Заполнить(ДанныеИсполнителя);
		ТабличныйДокумент.Вывести(ОтметкаБухгалтерииПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеДляПечати0504103(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеконструкцияОС.Дата КАК Дата,
	|	РеконструкцияОС.Договор КАК Договор
	|ПОМЕСТИТЬ ДоговорыДокументов
	|ИЗ
	|	Документ.РеконструкцияОС КАК РеконструкцияОС
	|ГДЕ
	|	РеконструкцияОС.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РеконструкцияИК.Дата,
	|	РеконструкцияИК.Договор
	|ИЗ
	|	Документ.РеконструкцияИК КАК РеконструкцияИК
	|ГДЕ
	|	РеконструкцияИК.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыДокументов.Дата КАК Дата,
	|	ДоговорыДокументов.Договор КАК Договор,
	|	МАКСИМУМ(СрокиИсполненияИСуммыОбязательств.Период) КАК Период
	|ПОМЕСТИТЬ ДоговорыДокументовСДатой
	|ИЗ
	|	ДоговорыДокументов КАК ДоговорыДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|		ПО ДоговорыДокументов.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|		И ДоговорыДокументов.Дата >= СрокиИсполненияИСуммыОбязательств.Период
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыДокументов.Дата,
	|	ДоговорыДокументов.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеконструкцияОС.Ссылка КАК Ссылка,
	|	РеконструкцияОС.Дата КАК Дата,
	|	РеконструкцияОС.Номер КАК НомерАкта,
	|	ВЫБОР
	|		КОГДА РеконструкцияОС.Организация.НаименованиеПолное = """"
	|			ТОГДА РеконструкцияОС.Организация.Наименование
	|		ИНАЧЕ РеконструкцияОС.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Организация,
	|	РеконструкцияОС.Организация КАК ОрганизацияСсылка,
	|	РеконструкцияОС.Организация.ИНН КАК ИНН,
	|	РеконструкцияОС.Организация.КодОКПО КАК ОКПО,
	|	ВЫБОР
	|		КОГДА РеконструкцияОС.Подразделение.ОбособленноеПодразделение
	|			ТОГДА РеконструкцияОС.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ РеконструкцияОС.Организация.КПП
	|	КОНЕЦ КАК КПП,
	|	ВЫБОР
	|		КОГДА РеконструкцияОС.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА РеконструкцияОС.Подразделение.ОбособленноеПодразделение
	|					ТОГДА ВЫБОР
	|						КОГДА РеконструкцияОС.Подразделение.НаименованиеПолное = """"
	|							ТОГДА РеконструкцияОС.Подразделение.Наименование
	|						ИНАЧЕ РеконструкцияОС.Подразделение.НаименованиеПолное
	|					КОНЕЦ
	|				ИНАЧЕ РеконструкцияОС.Подразделение.Наименование
	|			КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Подразделение,
	|	РеконструкцияОС.ИФО КАК ИФО,
	|	РеконструкцияОС.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	РеконструкцияОС.СчетКредита КАК СчетКредита,
	|	ВЫБОР
	|		КОГДА РеконструкцияОС.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|				КОГДА РеконструкцияОС.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И НЕ РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|					ТОГДА РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|				ИНАЧЕ ПРЕДСТАВЛЕНИЕ(РеконструкцияОС.Контрагент)
	|			КОНЕЦ
	|		ИНАЧЕ РеконструкцияОС.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК Контрагент,
	|	РеконструкцияОС.Контрагент.ИНН КАК КонтрагентИНН,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	|			ТОГДА РеконструкцияОС.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентОКПО,
	|	РеконструкцияОС.Контрагент.КПП КАК КонтрагентКПП,
	|	РеконструкцияОС.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	РеконструкцияОС.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	РеконструкцияОС.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ВЫБОР
	|		КОГДА РеконструкцияОС.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|			ТОГДА РеконструкцияОС.СуммаДокумента - РеконструкцияОС.СуммаДемонтажа - РеконструкцияОС.СуммаТранспортировки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаМодернизация,
	|	ВЫБОР
	|		КОГДА РеконструкцияОС.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|			ТОГДА РеконструкцияОС.СуммаДокумента - РеконструкцияОС.СуммаДемонтажа - РеконструкцияОС.СуммаТранспортировки
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРемонт,
	|	РеконструкцияОС.СуммаДемонтажа КАК СуммаДемонтаж,
	|	РеконструкцияОС.СуммаТранспортировки КАК СуммаТранспортировка,
	|	РеконструкцияОС.ДатаНачала КАК НачалоФактически,
	|	РеконструкцияОС.ДатаОкончания КАК ОкончаниеФактически,
	|	РеконструкцияОС.ДатаНачалаРаботПоДоговору КАК НачалоРаботПоДоговору,
	|	РеконструкцияОС.ДатаОкончанияРаботПоДоговору КАК ОкончаниеРаботПоДоговору,
	|	РеконструкцияОС.ПримечаниеКДоговору КАК ПримечаниеКДоговору,
	|	РеконструкцияОС.Комментарий КАК Комментарий,
	|	РеконструкцияОС.НомерПриказа КАК НомерПриказа,
	|	РеконструкцияОС.ДатаПриказа КАК ДатаПриказа,
	|	РеконструкцияОС.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	|	РеконструкцияОС.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	|	РеконструкцияОС.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	|	РеконструкцияОС.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	|	РеконструкцияОС.ЗаключениеКомиссии КАК ЗаключениеКомиссии,
	|	РеконструкцияОС.ИзмененияВХарактеристике КАК ИзмененияВХарактеристике,
	|	РеконструкцияОС.ИзмененияВСПИ КАК ИзмененияВСПИ,
	|	РеконструкцияОС.ВидОперации КАК ВидОперации,
	|	РеконструкцияОС.Договор.ДатаДоговора КАК ДатаДоговора,
	|	РеконструкцияОС.Договор.НомерДоговора КАК НомерДоговора,
	|	РеконструкцияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(РеконструкцияОСОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное КАК
	|		Наименование,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.Представление КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.ИнойНомер = """"
	|			ТОГДА РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.НомерПаспорта
	|		ИНАЧЕ РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.ИнойНомер
	|	КОНЕЦ КАК ИнойНомер,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
	|	РеконструкцияОСОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
	|	РеконструкцияОСОсновныеСредства.СрокЭксплуатацииФакт КАК СрокЭксплуатации,
	|	РеконструкцияОСОсновныеСредства.ОстаточнаяСтоимость КАК ОстаточнаяСтоимость,
	|	РеконструкцияОСОсновныеСредства.ВосстановительнаяСтоимость КАК БалансоваяСтоимость,
	|	РеконструкцияОСОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации КАК
	|		СрокПолезногоИспользованияПослеМодернизации,
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.Сумма, 0) КАК СуммаДоговора,
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеПоДоговору,
	|	РеконструкцияОСОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	РеконструкцияОСОсновныеСредства.СуммаДемонтажа КАК Демонтаж,
	|	РеконструкцияОСОсновныеСредства.СуммаТранспортировки КАК Транспортировка,
	|	РеконструкцияОСОсновныеСредства.СуммаРемонта КАК Ремонт,
	|	РеконструкцияОСОсновныеСредства.СуммаМодернизации КАК Модернизация,
	|	РеконструкцияОСОсновныеСредства.СтоимостьПоОкончанииРабот КАК Стоимость,
	|	РеконструкцияОСОсновныеСредства.ВидРаботы КАК ВидРаботы,
	|	РеконструкцияОС.Ответственный КАК Ответственный,
	|	РеконструкцияОС.Руководитель КАК Руководитель
	|ИЗ
	|	Документ.РеконструкцияОС КАК РеконструкцияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеконструкцияОС.ОсновныеСредства КАК РеконструкцияОСОсновныеСредства
	|		ПО РеконструкцияОС.Ссылка = РеконструкцияОСОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыДокументовСДатой КАК ДоговорыДокументовСДатой
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО ДоговорыДокументовСДатой.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|			И ДоговорыДокументовСДатой.Период = СрокиИсполненияИСуммыОбязательств.Период
	|		ПО РеконструкцияОС.Договор = ДоговорыДокументовСДатой.Договор
	|ГДЕ
	|	РеконструкцияОС.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеконструкцияИК.Ссылка,
	|	РеконструкцияИК.Дата,
	|	РеконструкцияИК.Номер,
	|	ВЫБОР
	|		КОГДА РеконструкцияИК.Организация.НаименованиеПолное = """"
	|			ТОГДА РеконструкцияИК.Организация.Наименование
	|		ИНАЧЕ РеконструкцияИК.Организация.НаименованиеПолное
	|	КОНЕЦ,
	|	РеконструкцияИК.Организация,
	|	РеконструкцияИК.Организация.ИНН,
	|	РеконструкцияИК.Организация.КодОКПО,
	|	ВЫБОР
	|		КОГДА РеконструкцияИК.Подразделение.ОбособленноеПодразделение
	|			ТОГДА РеконструкцияИК.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ РеконструкцияИК.Организация.КПП
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеконструкцияИК.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА РеконструкцияИК.Подразделение.ОбособленноеПодразделение
	|					ТОГДА ВЫБОР
	|						КОГДА РеконструкцияИК.Подразделение.НаименованиеПолное = """"
	|							ТОГДА РеконструкцияИК.Подразделение.Наименование
	|						ИНАЧЕ РеконструкцияИК.Подразделение.НаименованиеПолное
	|					КОНЕЦ
	|				ИНАЧЕ РеконструкцияИК.Подразделение.Наименование
	|			КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	РеконструкцияИК.ИФО,
	|	РеконструкцияИК.ВнеоборотныйАктив,
	|	РеконструкцияИК.СчетКредита,
	|	ВЫБОР
	|		КОГДА РеконструкцияИК.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|				КОГДА РеконструкцияИК.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И НЕ РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|					ТОГДА РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|				ИНАЧЕ ПРЕДСТАВЛЕНИЕ(РеконструкцияИК.Контрагент)
	|			КОНЕЦ
	|		ИНАЧЕ РеконструкцияИК.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ,
	|	РеконструкцияИК.Контрагент.ИНН,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ЮридическиеЛица)
	|			ТОГДА РеконструкцияИК.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	РеконструкцияИК.Контрагент.КПП,
	|	РеконструкцияИК.ВидПервичногоДокумента,
	|	РеконструкцияИК.НомерПервичногоДокумента,
	|	РеконструкцияИК.ДатаПервичногоДокумента,
	|	ВЫБОР
	|		КОГДА РеконструкцияИК.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|			ТОГДА РеконструкцияИК.СуммаДокумента - РеконструкцияИК.СуммаДемонтажа - РеконструкцияИК.СуммаТранспортировки
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеконструкцияИК.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.КапРемонтОС)
	|			ТОГДА РеконструкцияИК.СуммаДокумента - РеконструкцияИК.СуммаДемонтажа - РеконструкцияИК.СуммаТранспортировки
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	РеконструкцияИК.СуммаДемонтажа,
	|	РеконструкцияИК.СуммаТранспортировки,
	|	РеконструкцияИК.ДатаНачала,
	|	РеконструкцияИК.ДатаОкончания,
	|	РеконструкцияИК.ДатаНачалаРаботПоДоговору,
	|	РеконструкцияИК.ДатаОкончанияРаботПоДоговору,
	|	РеконструкцияИК.ПримечаниеКДоговору,
	|	РеконструкцияИК.Комментарий,
	|	РеконструкцияИК.НомерПриказа,
	|	РеконструкцияИК.ДатаПриказа,
	|	РеконструкцияИК.ДолжностьПредседателяКомиссии,
	|	РеконструкцияИК.ФамилияПредседателяКомиссии,
	|	РеконструкцияИК.ИмяПредседателяКомиссии,
	|	РеконструкцияИК.ОтчествоПредседателяКомиссии,
	|	РеконструкцияИК.ЗаключениеКомиссии,
	|	"""",
	|	"""",
	|	РеконструкцияИК.ВидОперации,
	|	РеконструкцияИК.Договор.ДатаДоговора,
	|	РеконструкцияИК.Договор.НомерДоговора,
	|	РеконструкцияИКОсновныеСредства.ОсновноеСредство,
	|	ВЫРАЗИТЬ(РеконструкцияИКОсновныеСредства.ОсновноеСредство КАК Справочник.ОсновныеСредства).НаименованиеПолное,
	|	РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.Представление,
	|	ВЫБОР
	|		КОГДА РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.ИнойНомер = """"
	|			ТОГДА РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.НомерПаспорта
	|		ИНАЧЕ РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.ИнойНомер
	|	КОНЕЦ,
	|	РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер,
	|	РеконструкцияИКОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер,
	|	РеконструкцияИКОсновныеСредства.СрокЭксплуатацииФакт,
	|	РеконструкцияИКОсновныеСредства.ОстаточнаяСтоимость,
	|	РеконструкцияИКОсновныеСредства.ВосстановительнаяСтоимость,
	|	РеконструкцияИКОсновныеСредства.СрокПолезногоИспользованияПослеМодернизации,
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.Сумма, 0),
	|	ЕСТЬNULL(СрокиИсполненияИСуммыОбязательств.СрокИсполнения, ДАТАВРЕМЯ(1, 1, 1)),
	|	РеконструкцияИКОсновныеСредства.НомерСтроки,
	|	РеконструкцияИКОсновныеСредства.СуммаДемонтажа,
	|	РеконструкцияИКОсновныеСредства.СуммаТранспортировки,
	|	РеконструкцияИКОсновныеСредства.СуммаРемонта,
	|	РеконструкцияИКОсновныеСредства.СуммаМодернизации,
	|	РеконструкцияИКОсновныеСредства.СтоимостьПоОкончанииРабот,
	|	РеконструкцияИКОсновныеСредства.ВидРаботы,
	|	РеконструкцияИК.Ответственный,
	|	РеконструкцияИК.Руководитель
	|ИЗ
	|	Документ.РеконструкцияИК КАК РеконструкцияИК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеконструкцияИК.ОсновныеСредства КАК РеконструкцияИКОсновныеСредства
	|		ПО РеконструкцияИК.Ссылка = РеконструкцияИКОсновныеСредства.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыДокументовСДатой КАК ДоговорыДокументовСДатой
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СрокиИсполненияИСуммыОбязательств КАК СрокиИсполненияИСуммыОбязательств
	|			ПО ДоговорыДокументовСДатой.Договор = СрокиИсполненияИСуммыОбязательств.Обязательство
	|			И ДоговорыДокументовСДатой.Период = СрокиИсполненияИСуммыОбязательств.Период
	|		ПО РеконструкцияИК.Договор = ДоговорыДокументовСДатой.Договор
	|ГДЕ
	|	РеконструкцияИК.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеконструкцияОС.Дата,
	|	РеконструкцияОС.Номер,
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеконструкцияОССоставКомиссии.Ссылка КАК Ссылка,
	|	РеконструкцияОССоставКомиссии.НомерСтроки КАК НомерСтроки,
	|	РеконструкцияОССоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	|	РеконструкцияОССоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	|	РеконструкцияОССоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	|	РеконструкцияОССоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.РеконструкцияОС.СоставКомиссии КАК РеконструкцияОССоставКомиссии
	|ГДЕ
	|	РеконструкцияОССоставКомиссии.Ссылка В (&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеконструкцияИКСоставКомиссии.Ссылка,
	|	РеконструкцияИКСоставКомиссии.НомерСтроки,
	|	РеконструкцияИКСоставКомиссии.ДолжностьЧленаКомиссии,
	|	РеконструкцияИКСоставКомиссии.ФамилияЧленаКомиссии,
	|	РеконструкцияИКСоставКомиссии.ИмяЧленаКомиссии,
	|	РеконструкцияИКСоставКомиссии.ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.РеконструкцияИК.СоставКомиссии КАК РеконструкцияИКСоставКомиссии
	|ГДЕ
	|	РеконструкцияИКСоставКомиссии.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.Код КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.Код КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(,, Регистратор В (&МассивОбъектов),,) КАК
	|		ЖурналПроводокЕПСБУДвиженияССубконто
	|ГДЕ
	|	(ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|	ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский))
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.Код,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.Код
	|ИТОГИ
	|ПО
	|	Ссылка";
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#КонецОбласти

#КонецЕсли
