#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ВидОперации = Перечисления.ВидыОперацийРеконструкцияОС.КапРемонтОС Тогда
		Если СведенияПрослеживаемости.Количество() Тогда
			СведенияПрослеживаемости.Очистить();
		КонецЕсли;
	Иначе
		ПрослеживаемостьБГУ.УдалитьНеиспользуемыеСтрокиСведенийПрослеживаемости(ЭтотОбъект, "ОсновныеСредства");
		ПрослеживаемостьБГУ.СписаниеОСПриЗаписи(ЭтотОбъект, Отказ, РежимЗаписи);
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	ВО_КапРемонт = Перечисления.ВидыОперацийРеконструкцияОС.КапРемонтОС;
	Если ВидОперации = ВО_КапРемонт Тогда
		НеПроверяемыеРеквизиты.Добавить("ВнеоборотныйАктив");
		НеПроверяемыеРеквизиты.Добавить("СчетКредита");
		НеПроверяемыеРеквизиты.Добавить("СуммаДокумента");
	КонецЕсли;

	Если НЕ ВидОперации = ВО_КапРемонт ИЛИ НЕ СформироватьПеремещение Тогда
		НеПроверяемыеРеквизиты.Добавить("ЦМОПолучатель");
		НеПроверяемыеРеквизиты.Добавить("ОсновныеСредства.ЦМОПолучатель");
	КонецЕсли;
	
	// Уберем проверку заполненности карточки капвложений из стандартной проверки. Проверим сами
	ОперацииСоСчетом106 = Новый Массив;
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийРеконструкцияОС.МодернизацияОС);
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийРеконструкцияОС.МодернизацияНМА);
	ОперацииСоСчетом106.Добавить(Перечисления.ВидыОперацийРеконструкцияОС.МодернизацияНПА);
	Если ОперацииСоСчетом106.Найти(ВидОперации) = Неопределено ИЛИ НЕ ОтразитьВКарточкеКапвложений Тогда
		НепроверяемыеРеквизиты.Добавить("КарточкаКапвложений");
	КонецЕсли;		
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
	УправлениеОсновнымиСредствами.ПроверитьДублиИнвентарныхНомеровВТабЧасти(ЭтотОбъект, "ОсновныеСредства", Отказ);
	
	// Суммы в табличной части равны сумме капитальных вложений.
	СуммаМодернизацииРемонта = СуммаДокумента - (СуммаДемонтажа + СуммаТранспортировки);
	Если ВидОперации = Перечисления.ВидыОперацийРеконструкцияОС.КапРемонтОС Тогда
		
		Если ОсновныеСредства.Итог("СуммаРемонта") <> СуммаМодернизацииРемонта Тогда
			ТекстОшибки = НСтр("ru='Стоимость работ по ремонту не совпадает в итоговой стоимостью работ по ремонту табличной части.
				|В табличной части: %1; стоимость ремонта: %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				ОсновныеСредства.Итог("СуммаРемонта"),
				СуммаМодернизацииРемонта);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "СуммаРемонта", , Отказ);
		КонецЕсли;
		
	Иначе
		
		Если ОсновныеСредства.Итог("СуммаМодернизации") <> СуммаМодернизацииРемонта Тогда
			ТекстОшибки = НСтр("ru='Стоимость работ по модернизации не совпадает в итоговой стоимостью работ по модернизации табличной части.
				|В табличной части: %1; стоимость модернизации: %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				ОсновныеСредства.Итог("СуммаМодернизации"),
				СуммаМодернизацииРемонта);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "СуммаМодернизации", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОсновныеСредства.Итог("СуммаДемонтажа") <> ЭтотОбъект.СуммаДемонтажа Тогда
		ТекстОшибки = НСтр("ru='Стоимость работ по демонтажу не совпадает в итоговой стоимостью работ по демонтажу табличной части.
			|В табличной части: %1; затраты на демонтаж: %2'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
			ОсновныеСредства.Итог("СуммаДемонтажа"),
			ЭтотОбъект.СуммаДемонтажа);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "СуммаДемонтажа", "Объект", Отказ);
	КонецЕсли;
	
	Если ОсновныеСредства.Итог("СуммаТранспортировки") <> ЭтотОбъект.СуммаТранспортировки Тогда
		ТекстОшибки = НСтр("ru='Стоимость работ по транспортировке не совпадает в итоговой стоимостью работ по транспортировке табличной части.
			|В табличной части: %1; затраты по транспортировке: %2'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
			ОсновныеСредства.Итог("СуммаТранспортировки"),
			ЭтотОбъект.СуммаТранспортировки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "СуммаТранспортировки", "Объект", Отказ);
	КонецЕсли;
	
	#Область НалоговыйУчет
	Если УправлениеОсновнымиСредствамиКлиентСервер.ОтражатьВНалоговомУчетеМодернизацию(ЭтотОбъект) Тогда
		
		// Суммы в табличной части равны сумме капитальных вложений.
		Если ОсновныеСредства.Итог("СуммаМодернизацииНУ") <> ЭтотОбъект.СуммаМодернизацииНУ Тогда
			ТекстОшибки = НСтр("ru='Итоговая сумма расходов НУ в табличной части превышает сумму вложений.
				|В табличной части: %1; сумма вложений (НУ): %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				ОсновныеСредства.Итог("СуммаМодернизацииНУ"),
				ЭтотОбъект.СуммаМодернизацииНУ);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
				ЭтотОбъект, "СуммаМодернизацииНУ", "Объект", Отказ);
		КонецЕсли;
		
		Если ОсновныеСредства.Итог("СуммаМодернизацииНеУчитываетсяНУ") <> ЭтотОбъект.СуммаМодернизацииНеУчитываетсяНУ Тогда
			ТекстОшибки = НСтр("ru='Итоговая сумма неучитываемых расходов НУ в табличной части превышает сумму вложений.
				|В табличной части: %1; расходов, не учитываемых при налогообложении: %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				ОсновныеСредства.Итог("СуммаМодернизацииНеУчитываетсяНУ"),
				ЭтотОбъект.СуммаМодернизацииНеУчитываетсяНУ);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
				ЭтотОбъект, "СуммаМодернизацииНеУчитываетсяНУ", "Объект", Отказ);
		КонецЕсли;
		
		Если ОсновныеСредства.Итог("СуммаМодернизацииЕНВД") <> ЭтотОбъект.СуммаМодернизацииЕНВД Тогда
			ТекстОшибки = НСтр("ru='Итоговая сумма расходов ЕНВД в табличной части превышает сумму вложений.
				|В табличной части: %1; расходов по деятельности с особым порядком налогообложения (ЕНВД и пр.): %2'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				ОсновныеСредства.Итог("СуммаМодернизацииЕНВД"),
				ЭтотОбъект.СуммаМодернизацииЕНВД);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,
				ЭтотОбъект, "СуммаМодернизацииЕНВД", "Объект", Отказ);
		КонецЕсли;
		
		// Счет затрат по амортизационной премии, если кап. вложения включаются в расходы.
		Для Каждого СтрокаТаблицы Из ОсновныеСредства Цикл
			Если СтрокаТаблицы.СуммаКапитальныхВложенийВключаемыхВРасходыНУ > 0
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетУчетаЗатратПоАмортизационнойПремии) Тогда
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru = 'Счет учета затрат по амортизационной премии'"),
					СтрокаТаблицы.НомерСтроки,
					НСтр("ru = 'Основные средства'"));
				ПолеОшибки = "Объект.ОсновныеСредства["+(СтрокаТаблицы.НомерСтроки - 1)+"].СчетУчетаЗатратПоАмортизационнойПремии";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПолеОшибки, , Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	Если НЕ ТолькоРегистрацияАкта И ВидОперации <> Перечисления.ВидыОперацийРеконструкцияОС.КапРемонтОС Тогда
		ПрослеживаемостьБГУ.ОбработкаПроведения(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОПризнанииОбъектовОС") Тогда
		ЗаполнитьНаОсновании_РешениеОПризнанииОбъектовОС(ДанныеЗаполнения);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса_По_РешениеОПризнанииОбъектовОС()
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РешениеОПризнанииОбъектовОС.Организация КАК Организация,
	|	РешениеОПризнанииОбъектовОС.ИФО КАК ИФО,
	|	РешениеОПризнанииОбъектовОС.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА РешениеОПризнанииОбъектовОС.СчетУчета В ИЕРАРХИИ (&Счет10200)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.МодернизацияНМА)
	|		КОГДА РешениеОПризнанииОбъектовОС.СчетУчета В ИЕРАРХИИ (&Счет10300)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.МодернизацияНПА)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРеконструкцияОС.МодернизацияОС)
	|	КОНЕЦ КАК ВидОперации,
	|	РешениеОПризнанииОбъектовОС.КапитальноеВложение КАК ВнеоборотныйАктив,
	|	РешениеОПризнанииОбъектовОС.СчетВложений КАК СчетКредита,
	|	РешениеОПризнанииОбъектовОС.КФО КАК КФО,
	|	РешениеОПризнанииОбъектовОС.СуммаВложений КАК СуммаДокумента
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОС КАК РешениеОПризнанииОбъектовОС
	|ГДЕ
	|	РешениеОПризнанииОбъектовОС.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РешениеОПризнанииОбъектовОСКапитальныеВложения.ЦМО КАК ЦМО,
	|	РешениеОПризнанииОбъектовОСКапитальныеВложения.Договор КАК Договор,
	|	РешениеОПризнанииОбъектовОСКапитальныеВложения.КПС КАК КПС,
	|	РешениеОПризнанииОбъектовОСКапитальныеВложения.Сумма КАК Сумма
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОС.КапитальныеВложения КАК РешениеОПризнанииОбъектовОСКапитальныеВложения
	|ГДЕ
	|	РешениеОПризнанииОбъектовОСКапитальныеВложения.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка.ЦМО КАК ЦМО,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.СрокПолезногоИспользования КАК СрокПолезногоИспользованияПослеМодернизации,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка.СчетУчета КАК СчетУчета
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОС.ОсновныеСредства КАК РешениеОПризнанииОбъектовОСОсновныеСредства
	|ГДЕ
	|	РешениеОПризнанииОбъектовОСОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.ОсновноеСредство КАК ОсновноеСредство,
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.ВидРаботы КАК ВидРаботы,
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.СуммаДемонтажа КАК СуммаДемонтажа,
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.СуммаТранспортировки КАК СуммаТранспортировки,
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.СуммаРемонта КАК СуммаРемонта,
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.СуммаМодернизации КАК СуммаМодернизации,
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.СтоимостьПоОкончанииРабот КАК СтоимостьПоОкончанииРабот
	|ИЗ
	|	Документ.РешениеОПризнанииОбъектовОС.СведенияОВидахРабот КАК РешениеОПризнанииОбъектовОССведенияОВидахРабот
	|ГДЕ
	|	РешениеОПризнанииОбъектовОССведенияОВидахРабот.Ссылка = &Ссылка";

	Возврат ТекстЗапроса;
КонецФункции	

Процедура ЗаполнитьНаОсновании_РешениеОПризнанииОбъектовОС(ДанныеЗаполнения)
	КапитальныеВложения.Очистить();
	ОсновныеСредства.Очистить();
	
	Запрос = Новый Запрос(ТекстЗапроса_По_РешениеОПризнанииОбъектовОС());
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("Счет10200", БухгалтерскийУчет.СчетПоКоду("102.00", Дата));
	Запрос.УстановитьПараметр("Счет10300", БухгалтерскийУчет.СчетПоКоду("103.00", Дата));
	Результат = Запрос.ВыполнитьПакет();
	ВыборкаШапка    = Результат[0].Выбрать();
	ВыборкаВложения = Результат[1].Выбрать();
	ВыборкаОС       = Результат[2].Выбрать();
	ВыборкаРаботы   = Результат[3].Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
		
		Пока ВыборкаВложения.Следующий() Цикл
			СтрокаВложения = КапитальныеВложения.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаВложения, ВыборкаВложения);
		КонецЦикла;	     
		
		ПерваяСтрока = Истина;
		ПоискРабот = Новый Структура("ОсновноеСредство, ИнвентарныйНомер");
		Пока ВыборкаОС.Следующий() Цикл
			Если ПерваяСтрока И ОсновныеСредства.Количество() > 0 Тогда
				СтрокаОС = ОсновныеСредства[0];
			Иначе	
				СтрокаОС = ОсновныеСредства.Добавить();
			КонецЕсли;	
			ПерваяСтрока = Ложь;
			ЗаполнитьЗначенияСвойств(СтрокаОС, ВыборкаОС);              
			
			ВидРаботы_П                 = "";
			СуммаДемонтажа_П            = 0;
			СуммаТранспортировки_П      = 0;
			СуммаРемонта_П              = 0;
			СуммаМодернизации_П         = 0;
			СтоимостьПоОкончанииРабот_П = 0;
			
			ЗаполнитьЗначенияСвойств(ПоискРабот, СтрокаОС);
			Пока ВыборкаРаботы.НайтиСледующий(ПоискРабот) Цикл
				ВидРаботы_П = ВидРаботы_П + ?(ЗначениеЗаполнено(ВидРаботы_П), "; ", "") + ВыборкаРаботы.ВидРаботы;
				СуммаДемонтажа_П            = СуммаДемонтажа_П + ВыборкаРаботы.СуммаДемонтажа;
				СуммаТранспортировки_П      = СуммаТранспортировки_П + ВыборкаРаботы.СуммаТранспортировки;
				СуммаРемонта_П              = СуммаРемонта_П + ВыборкаРаботы.СуммаРемонта;
				СуммаМодернизации_П         = СуммаМодернизации_П + ВыборкаРаботы.СуммаМодернизации;
				СтоимостьПоОкончанииРабот_П = СтоимостьПоОкончанииРабот_П + ВыборкаРаботы.СтоимостьПоОкончанииРабот;
			КонецЦикла;	             
			СтрокаОС.ВидРаботы = ВидРаботы_П;
			СтрокаОС.СуммаДемонтажа            = СуммаДемонтажа_П;
			СтрокаОС.СуммаТранспортировки      = СуммаТранспортировки_П;
			СтрокаОС.СуммаРемонта              = СуммаРемонта_П;
			СтрокаОС.СуммаМодернизации         = СуммаМодернизации_П;
			СтрокаОС.СтоимостьПоОкончанииРабот = СтоимостьПоОкончанииРабот_П;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли