
#Область ПрограммныйИнтерфейс

Процедура ПослеЗаписи(Форма, Объект, ПараметрыЗаписи = Неопределено) Экспорт
	Оповестить("ДокументыПоУчетуМатериальныхЗапасовИзменение");
КонецПроцедуры

Процедура ПриИзмененииПереключателяРезервирования(Форма) Экспорт
	РезервированиеНФАКлиент.ПриИзмененииПереключателяРезервирования(Форма, Форма.Объект);
КонецПроцедуры

// Параметры открытия подбора.
// 
// Возвращаемое значение:
//  Структура - Параметры открытия подбора:
// * ДополнительныйПараметр - Неопределено -
// * ПараметрыОтбора - Неопределено -
// * ПроверяемыеРеквизиты - Строка -
// * РасширенныйПодбор - Булево
Функция ПараметрыОткрытияПодбора() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ДополнительныйПараметр", Неопределено);
	Результат.Вставить("ПараметрыОтбора", Неопределено);
	Результат.Вставить("ПроверяемыеРеквизиты", "");
	Результат.Вставить("РасширенныйПодбор", Ложь);
	Результат.Вставить("ПараметрыТчДокумента", Неопределено);
	Возврат Результат;
КонецФункции

// Открыть подбор материалов.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Объект - ДанныеФормыСтруктура
//  Параметры - см. ПараметрыОткрытияПодбора
Процедура ОткрытьПодборМатериалов(Форма, Объект, Параметры) Экспорт
	ПроверяемыеРеквизиты = СтрРазделить(Параметры.ПроверяемыеРеквизиты, ";");
	Отказ = Ложь;
	Для Каждого ИмяРеквизита Из ПроверяемыеРеквизиты Цикл
		
		ИмяСиноним = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяРеквизита, , , Истина);
		Если ЗначениеЗаполнено(Объект[ИмяСиноним[0]]) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле",
			"Заполнение", 
			?(ИмяСиноним.Количество() > 1, ИмяСиноним[1], ИмяСиноним[0]));
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения,
			,
			ИмяСиноним[0],
			"Объект",
			Отказ);
		
	КонецЦикла;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если Параметры.РасширенныйПодбор Тогда
		УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериаловРасширенный(Форма, Объект,
			Параметры.ДополнительныйПараметр, Параметры.ПараметрыОтбора, Параметры.ПараметрыТчДокумента);
	Иначе
		УправлениеМатериальнымиЗапасамиКлиент.ОткрытьПодборМатериалов(Форма, Объект,
			Параметры.ДополнительныйПараметр, Параметры.ПараметрыОтбора, Параметры.ПараметрыТчДокумента);
	КонецЕсли;
		
КонецПроцедуры

// Проверить заполнение реквизитов в форме.
// Реквизиты передаются строкой, разделенные ";". Если синоним отличается от имени реквизита, 
// можно через запятую к имени реквизита дописать синоним.
// Например,
// "Подразделение;ЦМОПолучатель,МОЛ/Место хранения".
// Будут проверены реквизиты Подразделение и ЦМОПолучатель.
// Если не заполнено подразделение, будет выведена ошибка "Не заполнено поле "Подразделение"".
// Если не заполнен ЦМОПолучатель, будет выведена ошибка "Не заполнено поле "МОЛ/Место хранения"".
// 
// Параметры:
//  Объект - ДанныеФормыСтруктура
//  СтрокаПроверяемыеРеквизиты - Строка
// 
// Возвращаемое значение:
//  Булево - Проверить реквизиты заполнены
Функция ПроверитьРеквизитыЗаполнены(Объект, СтрокаПроверяемыеРеквизиты) Экспорт
	ПроверяемыеРеквизиты = СтрРазделить(СтрокаПроверяемыеРеквизиты, ";");
	Отказ = Ложь;
	Для Каждого ИмяРеквизита Из ПроверяемыеРеквизиты Цикл
		
		ИмяСиноним = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяРеквизита, , , Истина);
		Если ЗначениеЗаполнено(Объект[ИмяСиноним[0]]) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле",
			"Заполнение", 
			?(ИмяСиноним.Количество() > 1, ИмяСиноним[1], ИмяСиноним[0]));
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ТекстСообщения,
			,
			ИмяСиноним[0],
			"Объект",
			Отказ);
		
	КонецЦикла;
	Возврат Не Отказ;
КонецФункции

// Параметры подбора основания в Решение о прекращении признания активом.
// Используется в ОткрытьПодборОснования_Решение0510440
// 
// Возвращаемое значение:
//  Структура - Параметры подбора основания решение0510440:
// * ИмяТипаДокумента - Строка - 
// * ПроверяемыеРеквизиты - Массив из Строка - 
// * ПараметрыФормы - Структура - 
// * ЭлементФормы - ТабличноеПоле
Функция ПараметрыПодбораОснования_Решение0510440() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ИмяТипаДокумента", "");
	Результат.Вставить("ПроверяемыеРеквизиты", Новый Массив);
	Результат.Вставить("ПараметрыФормы", Новый Структура);
	Результат.Вставить("ЭлементФормы");
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
КонецФункции

// Открыть подбор основания решение0510440.
// 
// Параметры:
//  Форма - см. Документ.РешениеОбОценкеИмуществаМЗ.Форма.ФормаДокумента
//  ПараметрыПодбора - см. ПараметрыПодбораОснования_Решение0510440
Процедура ОткрытьПодборОснования_Решение0510440(Форма, ПараметрыПодбора) Экспорт
	Если Не ПроверитьВыбранныйВидОснованияДляПодбора_Решение0510440(
			Форма.Объект.Основание, ПараметрыПодбора.ИмяТипаДокумента) Тогда
		Возврат;
	КонецЕсли;

	Если ПараметрыПодбора.ПроверяемыеРеквизиты.Количество() > 0
			И Не ПроверитьРеквизитыЗаполнены(Форма.Объект, СтрСоединить(ПараметрыПодбора.ПроверяемыеРеквизиты, ";")) Тогда
		Возврат;				
	КонецЕсли;
	
	ИмяФормыВыбораИнвентаризации = "Документ." + ПараметрыПодбора.ИмяТипаДокумента + ".ФормаВыбора";
	ОткрытьФорму(ИмяФормыВыбораИнвентаризации, ПараметрыПодбора.ПараметрыФормы, ПараметрыПодбора.ЭлементФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьОбОшибкеНеПравильныйТипОснования()
	ОбщегоНазначенияКлиент.СообщитьПользователю(
		НСтр("ru = 'В списке оснований уже выбраны документы из другого приказа.
				   |Заполнение по инвентаризациям из разных приказов не допускается.'"));
КонецПроцедуры

Функция ВыбраныОснованияТолькоЗаданногоТипа(ТабличнаяЧасть, ПроверяемыйТип)
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Если ЗначениеЗаполнено(Строка.ДокументИнвентаризации)
				И ТипЗнч(Строка.ДокументИнвентаризации) <> ПроверяемыйТип Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция ПроверитьВыбранныйВидОснованияДляПодбора_Решение0510440(ТабличнаяЧасть, ИмяПроверяемогоТипа)
	ПроверяемыйТип = Тип("ДокументСсылка." + ИмяПроверяемогоТипа);
	Если Не ВыбраныОснованияТолькоЗаданногоТипа(ТабличнаяЧасть, ПроверяемыйТип) Тогда
		СообщитьОбОшибкеНеПравильныйТипОснования();
		Возврат Ложь;
	КонецЕсли;

	Возврат Истина;
КонецФункции

#КонецОбласти