
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Событие = Параметры.Событие;
	
	АдресПараметров = Параметры.АдресПараметров;
	
	ТолькоПросмотр = Не(Событие = "СохранениеПараметраОбработки");
	
	Если ЭтоАдресВременногоХранилища(АдресПараметров) Тогда
		
		ПараметрыМетода = ПолучитьИзВременногоХранилища(АдресПараметров);
		
	Иначе
		
		ПараметрыМетода = Справочники.ПравилаЗаполнения.ПолучитьПараметрыМетода(Параметры.ПравилоЗаполнения,
				Параметры.ИмяМетода, Параметры.ИндексМетода);
		
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыМетода) = Тип("Структура") Тогда
		
		Значение = Неопределено;
		Если ПараметрыМетода.Свойство("ЗаголовокРаздела", Значение) Тогда
			ЗаголовокРаздела = Значение;
		КонецЕсли;
		
		Значение = Неопределено;
		Если ПараметрыМетода.Свойство("СправочнаяИнформация", Значение) Тогда
			ВосстановитьДанныеСправки(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ФорматированныйДокумент.ТолькоПросмотр = ТолькоПросмотр;
	Элементы.ЗаголовокРаздела.Видимость = Не ТолькоПросмотр;
	Элементы.ГруппаКомандыФорматированияДокумента.Видимость = Не ТолькоПросмотр;
	
	Элементы.ФормаПрименитьНастройки.Видимость = Не ТолькоПросмотр;
	Элементы.ФормаПрименитьНастройки.КнопкаПоУмолчанию = Не ТолькоПросмотр;
	
	Элементы.ФормаЗакрыть.Видимость = ТолькоПросмотр;
	Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = ТолькоПросмотр;
	
	Если ТолькоПросмотр Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = ЗаголовокРаздела;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	Отказ = Истина;
	ЗаполнениеОтчетностиКлиент.СохранениеПередЗакрытием(ЭтаФорма,Событие,"МетодыОбработкиДанныхОтчетности");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	СтруктураВозврата = ПодготовитьСтруктуруВозврата();
	
	Если ТипЗнч(СтруктураВозврата) = Тип("Структура") Тогда
		
		Модифицированность = Ложь;
		
		Закрыть(СтруктураВозврата);
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось сохранить параметры'"));
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция СохранитьДанныеСправки()
	
	Текст = Неопределено;
	Вложения = Неопределено;
	СправочнаяИнформация.ПолучитьHTML(Текст, Вложения);
	
	СтруктураСправки = Новый Структура;
	СтруктураСправки.Вставить("Текст", Текст);
	СтруктураСправки.Вставить("Вложения", Вложения);
	
	Возврат СтруктураСправки;
	
КонецФункции

&НаСервере
Процедура ВосстановитьДанныеСправки(СохраненноеЗначение)
	
	Если ТипЗнч(СохраненноеЗначение) = Тип("Структура") И СохраненноеЗначение.Свойство("Текст")
			И СохраненноеЗначение.Свойство("Вложения") Тогда
		
		СправочнаяИнформация.УстановитьHTML(СохраненноеЗначение.Текст, СохраненноеЗначение.Вложения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодготовитьСтруктуруВозврата() Экспорт 
	
	СтруктураВозврата = Новый Структура("АдресПараметров, ПредставлениеПараметров","","");
	
	Если ПустаяСтрока(АдресПараметров) Тогда
		АдресДляСохранения = ЭтаФорма.ВладелецФормы.УникальныйИдентификатор;
	Иначе
		АдресДляСохранения = АдресПараметров;
	КонецЕсли;
	
	Если СохранитьПараметрыНаСервере(АдресДляСохранения) Тогда
		
		СтруктураВозврата.АдресПараметров = АдресПараметров;
		СтруктураВозврата.ПредставлениеПараметров = ПредставлениеПараметров;
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СохранитьПараметрыНаСервере(Знач АдресДляСохранения)
	
	Если ПроверитьЗаполнение() Тогда
		
		СтруктураСправки = Новый Структура;
		СтруктураСправки.Вставить("ЗаголовокРаздела", ЗаголовокРаздела);
		СтруктураСправки.Вставить("СправочнаяИнформация", СохранитьДанныеСправки());
		
		ПредставлениеПараметров();
		
		АдресПараметров = ПоместитьВоВременноеХранилище(СтруктураСправки , АдресДляСохранения);
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПредставлениеПараметров()
	
	ПредставлениеПараметров = ЗаголовокРаздела;
	
КонецПроцедуры
