#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПереносОстатковВОперативныйУчет";
	КомандаПечати.Идентификатор		= "Обороты";
	КомандаПечати.Представление		= НСтр("ru = 'Обороты ОС за текущий год'");
	КомандаПечати.Порядок			= 1;
	
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидОперации", Перечисления.ОперацииПереносОстатковОперУчет.ПереносИноеДвиживое);
	
	// Стандартная бухгалтерская справка
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Обороты") Тогда
		
		ТабличныйДокумент = ОборотыОС(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Обороты", "Обороты ОС за текущий год", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОборотыОС(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПереносОперУчет_Обороты";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПереносОстатковВОперативныйУчет.Обороты");
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПереносОстатковВОперативныйУчет.Ссылка КАК Ссылка,
	|	ПереносОстатковВОперативныйУчет.Дата КАК Дата,
	|	ПереносОстатковВОперативныйУчет.Номер КАК Номер,
	|	ПереносОстатковВОперативныйУчет.Организация КАК Организация
	|ИЗ
	|	Документ.ПереносОстатковВОперативныйУчет КАК ПереносОстатковВОперативныйУчет
	|ГДЕ
	|	ПереносОстатковВОперативныйУчет.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СписокДокументов = ДокументыОборотов(Выборка.Ссылка, Выборка);
		
		ПараметрыШапки = Новый Структура("НомерДокумента,ДатаДокумента,НачалоПериода,КонецПериода",
			Выборка.Номер, Формат(Выборка.Дата, "ДЛФ=D"), Формат(НачалоГода(Выборка.Дата), "ДЛФ=D"), Формат(Выборка.Дата, "ДЛФ=D"));
		ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		Для Каждого Док Из СписокДокументов Цикл
			ОбластьСтрока.Параметры.Заполнить(Новый Структура("Документ", Док));
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидОперации,Организация,Дата,Номер");
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ОперацииПереносОстатковОперУчет.ПереносЗабаланс Тогда
		Возврат;
	КонецЕсли;
	
	НомерДокумента = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, ЗначенияРеквизитов.Номер);
	УчетНаСчете21ВУсловнойОценке = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(
		ЗначенияРеквизитов.Организация, ЗначенияРеквизитов.Дата).УчетНаСчете21ВУсловнойОценке;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"				, ДокументСсылка);
	Запрос.УстановитьПараметр("НазваниеДокумента"	, НСтр("ru = 'Бухгалтерская справка'"));
	Запрос.УстановитьПараметр("НомерДокумента"		, НомерДокумента);
	Запрос.УстановитьПараметр("Учет21Условно"		, УчетНаСчете21ВУсловнойОценке);
	
	ТаблицыЗапроса = Новый Массив;
	
	Если ЗначенияРеквизитов.ВидОперации = Перечисления.ОперацииПереносОстатковОперУчет.ПереносИноеДвиживое Тогда
		СтруктураДополнительныеСвойства.Вставить("НеФормироватьУчетныеДанныеИзПроводок");
	КонецЕсли;
	
	ТаблицыЗапроса.Добавить("");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ОперацииПереносОстатковОперУчет.ПереносИноеДвиживое)
	|			ТОГДА ДАТАВРЕМЯ(2021, 12, 31, 23, 59, 59)
	|		ИНАЧЕ ТаблицаОсновныеСредства.Ссылка.Дата
	|	КОНЕЦ КАК Период,
	|	ТаблицаОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Ссылка.Содержание КАК Содержание,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	&НазваниеДокумента КАК НазваниеДокумента,
	|	&НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ИнвентарныйНомер <> ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				ИЛИ НЕ ТаблицаОсновныеСредства.ОсновноеСредство.ГрупповойУчет
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПообъектныйУчет
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.ПереносОстатковВОперативныйУчет.ОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка";
	
	ТаблицыЗапроса.Добавить("СобытияОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Период КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.Период КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.Содержание КАК ПричинаСписания,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ПообъектныйУчет
	|	И ТаблицаОсновныеСредства.СуммаАмортизации <> 0";
	
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаОсновныеСредства.Период КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК ВидРаспоряжения,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.Сумма КАК Стоимость,
	|	ТаблицаОсновныеСредства.Количество КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание) КАК Событие,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	(ТаблицаОсновныеСредства.Сумма <> 0
	|			ИЛИ ТаблицаОсновныеСредства.Количество <> 0)
	|	И ТаблицаОсновныеСредства.СуммаАмортизации <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаОсновныеСредства.Период,
	|	ТаблицаОсновныеСредства.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.ОперативныйУчет),
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.ЦМО,
	|	ТаблицаОсновныеСредства.Подразделение,
	|	ВЫБОР
	|		КОГДА &Учет21Условно
	|			ТОГДА ТаблицаОсновныеСредства.Количество
	|		ИНАЧЕ ТаблицаОсновныеСредства.Сумма
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.Количество,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету),
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	(ТаблицаОсновныеСредства.Сумма <> 0
	|			ИЛИ ТаблицаОсновныеСредства.Количество <> 0)
	|	И ТаблицаОсновныеСредства.СуммаАмортизации <> 0";
	
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаОсновныеСредства.Период КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ТаблицаОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ИСТИНА КАК ЭтоСписание
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.СуммаАмортизации <> 0";
	
	ТаблицыЗапроса.Добавить("ПараметрыАмортизацииОСБухгалтерскийУчет");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаОсновныеСредства.Период КАК Период,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.СписаниеПриВводеВЭксплуатацию) КАК ПорядокПогашенияСтоимости,
	|	ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПустаяСсылка) КАК СпособНачисленияАмортизации
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
КонецПроцедуры

#КонецОбласти

Функция ДокументыОборотов(ДокументСсылка, Параметры = Неопределено) Экспорт
	
	ЗначенияРеквизитов = ?(Параметры <> Неопределено, Параметры,
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация,Дата"));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"			, ДокументСсылка);
	Запрос.УстановитьПараметр("Организация"		, ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("НачалоПериода"	, НачалоГода(ЗначенияРеквизитов.Дата));
	Запрос.УстановитьПараметр("КонецПериода"	, ЗначенияРеквизитов.Дата);
	Запрос.УстановитьПараметр("СписокСчетов"	, БухгалтерскийУчет.СписокСчетов("101.00"));
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПереносОстатковВОперативныйУчетОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ВТ_ОС
	|ИЗ
	|	Документ.ПереносОстатковВОперативныйУчет.ОсновныеСредства КАК ПереносОстатковВОперативныйУчетОсновныеСредства
	|ГДЕ
	|	ПереносОстатковВОперативныйУчетОсновныеСредства.Ссылка = &Ссылка
	|	И ПереносОстатковВОперативныйУчетОсновныеСредства.СуммаАмортизации <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОбороты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В (&СписокСчетов),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ОсновныеСредства),
	|			Организация = &Организация
	|				И Субконто1 В
	|					(ВЫБРАТЬ
	|						ВТ_ОС.ОсновноеСредство
	|					ИЗ
	|						ВТ_ОС КАК ВТ_ОС),
	|			,
	|			) КАК ЖурналПроводокЕПСБУОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор";
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
