#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

 #Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции 

#КонецОбласти

#Область ЗаполнениеДокумента    

//  Возвращает сведения о записи в регистре сведенеий "СостояниеПлатежноРасчетныхДокументов"
//    Входящие параметры: Ссылка - тип ссылка на документ "Уведомление об уточнении операции клиента"
//    Исходящие параметры: 
Функция ПолучитьСостояниеДокумента(Ссылка) экспорт
	СтруктураРеквизитов = Новый Структура;
	ПоляВыборки = "";
	//  Струкутра реквизитов динамическая, т.к. со временем может понадобится новый ресурс в регистр
	//  что-бы его не забыть будем каждый раз перебирать ресурсы регистра
	Для каждого Ресурс из Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Ресурсы цикл
		СтруктураРеквизитов.Вставить(Ресурс.Имя);
		ПоляВыборки = ПоляВыборки + "
		|	Состояние." + Ресурс.Имя + " КАК " + Ресурс.Имя + ", "
	КонецЦикла;	
	//  Добавка ввиде реквизита "ПервичныйОбразИРеквизиты"
	СтруктураРеквизитов.Вставить("ПервичныйОбразИРеквизиты");		
	ПоляВыборки = ПоляВыборки + "
	|	Состояние.ПервичныйОбразИРеквизиты КАК ПервичныйОбразИРеквизиты ";
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.УведомлениеОбУточненииОперацийКлиента") тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;	
		
	ТекстЗапроса = "ВЫБРАТЬ " + ПоляВыборки + "
					|ИЗ	
					|	РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК Состояние
					|ГДЕ 
					|	Состояние.ПлатежноРасчетныйДокумент = &Ссылка";
						
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Для каждого КлючЗначение из СтруктураРеквизитов Цикл
		ТекРеквизит = КлючЗначение.Ключ;
		СтруктураРеквизитов[ТекРеквизит] = Выборка[ТекРеквизит];
	КонецЦикла;	
		
	Возврат СтруктураРеквизитов;
КонецФункции	

Процедура ОтразитьРезультатОбработкиДокументаЕБП(ДокументСсылка, ДанныеКОбработке, ИнформацияОбОшибке = "", ЕстьВложения) Экспорт
	
	// Документ создается в ЕБП и выгружается в конечном статусе.
	// Повторная загрузка существующего документа невозможна
	
	ИнформацияОбОшибке = НСтр("ru = 'РСКП с идентификатором (%1), уже существует, обработка невозможна.'") + "
	|" + НСтр("ru = 'Документ: %2'"); ;
	ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОбОшибке, ДокументСсылка.УникальныйИдентификатор(), ДокументСсылка); 
	
КонецПроцедуры

Процедура СоздатьНовыйРСКППоДаннымЕБП(ДанныеКОбработке, Организация, ИнформацияОбОшибке = "", РСКПСсылка, ЕстьВложения) Экспорт  
	
	ТекстСтатусаЕБП = "";
	Если НЕ ДанныеКОбработке.Свойство("СтатусРСКП", ТекстСтатусаЕБП) Тогда
		ИнформацияОбОшибке = НСтр("ru = 'Не указан статус РСКП, присвоенный в ЕБП, обработка невозможна.'"); 
	Иначе  
		НовыйСтатусДокумента = ПлатежноРасчетныеДокументы.СтатусДокументаЕБП(ТекстСтатусаЕБП); 
		Если НовыйСтатусДокумента = Неопределено Тогда
			ИнформацияОбОшибке = НСтр("ru = 'Не удалось определить статус РСКП, присвоенный в ЕБП (%1), обработка невозможна.'");
			ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОбОшибке, ТекстСтатусаЕБП); 
		ИначеЕсли НЕ (НовыйСтатусДокумента = ПредопределенноеЗначение("Перечисление.СтатусыИсполненияДокумента.Исполнен")) Тогда
			ИнформацияОбОшибке = НСтр("ru = 'Документ может быть загружен только в статусе ""Исполнен"". Текущий статус: ""%1"".'");
			ИнформацияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОбОшибке, ТекстСтатусаЕБП); 
		КонецЕсли;  
	КонецЕсли;
	Если ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
		ИнформацияОбОшибке = ИнформацияОбОшибке + "
		|" + НСтр("ru = 'Не удалось создать РСКП (уточнение) по переданным данным'"); 
		Возврат;
	КонецЕсли; 
	
	НачатьТранзакцию();
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		
		НовыйДокумент = Документы.РСКПУточнение.СоздатьДокумент(); 
		НовыйДокумент.УстановитьСсылкуНового(РСКПСсылка); 
		НовыйДокумент.Заблокировать();  
		
		НовыйДокумент.Внешнее = Истина;
		НовыйДокумент.Организация = Организация; 
		НовыйДокумент.МодульИнтеграции = ДанныеКОбработке.МодульИнтеграции;
		
		//ЛицевойСчет   
		НовыйДокумент.ЛицевойСчет = Справочники.ЛицевыеСчета.ЛицевойСчетПоНомеру(ДанныеКОбработке.ЛицевойСчет, Организация); 
		Если Не ЗначениеЗаполнено(НовыйДокумент.ЛицевойСчет) Тогда
			ИнформацияОбОшибке = ИнформацияОбОшибке + ?(СтрДлина(ИнформацияОбОшибке) > 0, Символы.ПС, "") +
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не найден лицевой счет № %1'"), ДанныеКОбработке.ЛицевойСчет); 
		КонецЕсли;
		
		НовыйДокумент.Дата = ТекущаяДатаСеанса(); 
		НовыйДокумент.ДатаРСКП = ДанныеКОбработке.ДатаРСКП; 
		НовыйДокумент.НомерРСКП = ДанныеКОбработке.НомерРСКП;  
		
		НовыйДокумент.ВалютаДокумента = БиблиотекаФункцийОбмена.Валюта(ДанныеКОбработке.КодВалюты, "Код"); 
		Если НЕ ЗначениеЗаполнено(НовыйДокумент.ВалютаДокумента) Тогда
			НовыйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли; 
		КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НовыйДокумент.ВалютаДокумента, НовыйДокумент.ДатаРСКП);
		НовыйДокумент.Курс	= КурсКратность.Курс;
		НовыйДокумент.Кратность = КурсКратность.Кратность;
		ВРублях = НовыйДокумент.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		
		НовыйДокумент.СуммаДокументаВВалюте = ДанныеКОбработке.СуммаДокументаВВалюте;
		Если ВРублях Тогда
			НовыйДокумент.СуммаДокумента = НовыйДокумент.СуммаДокументаВВалюте;
		Иначе
			ДанныеКОбработке.Свойство("СуммаДокументаВРублях", НовыйДокумент.СуммаДокумента);
		КонецЕсли; 
		
		ЭтоКазенное = БухгалтерскийУчетПовтИсп.УчетнаяПолитикаОрганизации(Организация, НовыйДокумент.Дата).ЭтоКазенноеУчреждение;  
		
		ДанныеКОбработке.Свойство("НомерЗапросаНаВыяснение", НовыйДокумент.НомерЗапроса);
		ДанныеКОбработке.Свойство("ДатаЗапросаНаВыяснение", НовыйДокумент.ДатаЗапроса);
		Если ЗначениеЗаполнено(НовыйДокумент.НомерЗапроса) И ЗначениеЗаполнено(НовыйДокумент.ДатаЗапроса) Тогда
			// Ищем документ Запрос на выяснение принадлежности платежа
			// НовыйДокумент.ЗапросНаВыяснениеПринадлежностиПлатежа
		КонецЕсли;	
		
		ДанныеКОбработке.УТОЧНЯЕМЫЕРЕКВИЗИТЫ.Сортировать("НомерСтроки");
		Для Каждого СтрокаРасшифровки Из ДанныеКОбработке.УТОЧНЯЕМЫЕРЕКВИЗИТЫ Цикл 
			СтрДок = НовыйДокумент.УточняемыеРеквизиты.Добавить();
			//СтрДок.ИдентификаторСтроки = Новый УникальныйИдентификатор();
			СтрДок.ИдентификаторДокумента = СтрокаРасшифровки.ИдентификаторУточняемогоДокумента; 
			СтрДок.НаименованиеДокумента = СтрокаРасшифровки.НаименованиеУточняемогоДокумента;
			СтрДок.НомерДокумента = СтрокаРасшифровки.НомерУточняемогоДокумента; 
			СтрДок.ДатаДокумента = СтрокаРасшифровки.ДатаУточняемогоДокумента;
			СтрДок.НаименованиеПлательщика = СтрокаРасшифровки.УточняемоеНаименованиеПлательщика; 
			СтрДок.НаименованиеПолучателя = СтрокаРасшифровки.УточняемоеНаименованиеПолучателя;  
			СтрДок.НазначениеПлатежа = СтрокаРасшифровки.УточняемоеНазначениеПлатежа;
			СтрДок.КодЦели = Справочники.ВидыЦелевыхСредств.ВидЦелевыхТекстовомуКоду(СтрокаРасшифровки.УточняемыйКодЦС);
			СтрДок.ОбъектФАИП = БиблиотекаФункцийОбмена.ОбъектФАИПКМИПоТекстовомуКоду(СтрокаРасшифровки.УточняемыйКодФАИП, Организация);
            СтрДок.КодПрослеживаемости = СтрокаРасшифровки.УточняемыйКодПрослеживаемости;  
			
			// Кассовое поступление  
			Если СтрДок.НаименованиеДокумента = "Платежное поручение (входящее)" 
				ИЛИ СтрДок.НаименованиеДокумента = "Поручение о перечислении (входящее)" Тогда 
				Запрос = Новый Запрос("ВЫБРАТЬ
				|	ПоступлениеНаСчет.Ссылка КАК Ссылка,
				|	ПоступлениеНаСчетРасшифровкаПлатежа.Договор КАК Договор,
				|	ПоступлениеНаСчет.Контрагент КАК Контрагент
				|ИЗ
				|	Документ.ПоступлениеНаСчет КАК ПоступлениеНаСчет
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеНаСчет.РасшифровкаПлатежа КАК ПоступлениеНаСчетРасшифровкаПлатежа
				|		ПО (ПоступлениеНаСчетРасшифровкаПлатежа.Ссылка = ПоступлениеНаСчет.Ссылка)
				|ГДЕ
				|	ПоступлениеНаСчет.ДатаПервичногоДокумента = &ДатаПервичногоДокумента
				|	И ПоступлениеНаСчет.НомерПервичногоДокумента = &НомерПервичногоДокумента
				|	И ПоступлениеНаСчет.Организация = &Организация");   
				Запрос.УстановитьПараметр("ДатаПервичногоДокумента", СтрДок.ДатаДокумента); 
				Запрос.УстановитьПараметр("НомерПервичногоДокумента", СтрДок.НомерДокумента);
				Запрос.УстановитьПараметр("Организация", Организация);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда  
					СтрДок.УточняемыйДокумент = Выборка.Ссылка;  
					СтрДок.Договор = Выборка.Договор;
					СтрДок.Контрагент = Выборка.Контрагент;
				КонецЕсли;
			КонецЕсли;
			
			СтрДок.СуммаВал = СтрокаРасшифровки.УточняемаяСуммаВал;
			Если ВРублях Тогда
				СтрДок.Сумма = СтрДок.СуммаВал; 
			Иначе
				СтрДок.Сумма = СтрокаРасшифровки.УточняемаяСуммаРуб;
			КонецЕсли;  
			
            // Раздел лицевого счета   
			Если ЗначениеЗаполнено(НовыйДокумент.ЛицевойСчет) И ЗначениеЗаполнено(СтрокаРасшифровки.УточняемыйКодПоступления) Тогда 
				СтрДок.РазделЛС = Справочники.РазделыЛицевыхСчетов.РазделЛСПоКодуПоступленияЕБП(НовыйДокумент.ЛицевойСчет, СтрокаРасшифровки.УточняемыйКодПоступления, ИнформацияОбОшибке, Истина); 
			КонецЕсли; 
			
			// КПС
			Если ЗначениеЗаполнено(СтрокаРасшифровки.УточняемыйКБК) Тогда
				ТипКБК = БюджетнаяКлассификация.ВидКБКПоАналитическомуКоду(Прав(СтрокаРасшифровки.УточняемыйКБК, 3));
				Если НЕ ЗначениеЗаполнено(ТипКБК) Тогда
					Если СтрНайти(СтрДок.НаименованиеДокумента, "(входящее)") > 0 Тогда
						ТипКБК = ПредопределенноеЗначение("Перечисление.ВидыКБК.КДБ");
					Иначе
						ТипКБК = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ");   
					КонецЕсли;
				КонецЕсли;	
				Если ЭтоКазенное Тогда
					СтрДок.КБКНазначениеПлатежа = БиблиотекаФункцийОбмена.КПСПоТекстовомуКодуБК(СтрокаРасшифровки.УточняемыйКБК, ТипКБК,, НовыйДокумент.Дата, ИнформацияОбОшибке);
				Иначе
					СтрДок.КБКНазначениеПлатежа = БиблиотекаФункцийОбмена.КПСПоТекстовомуКодуБК(СтрокаРасшифровки.УточняемыйКБК, Перечисления.ВидыКБК.АУИБУ, ТипКБК, НовыйДокумент.Дата, ИнформацияОбОшибке); 
				КонецЕсли;	 
			КонецЕсли;  
		
		КонецЦикла;	
		
		ДанныеКОбработке.УТОЧНЕННЫЕРЕКВИЗИТЫ.Сортировать("НомерСтроки");
		Для Каждого СтрокаРасшифровки Из ДанныеКОбработке.УТОЧНЕННЫЕРЕКВИЗИТЫ Цикл   
			СтрДок = НовыйДокумент.УточненныеРеквизиты.Добавить(); 
			
			СтрДок.НазначениеПлатежа = СтрокаРасшифровки.УточненноеНазначениеПлатежа;
			СтрДок.КодЦели = Справочники.ВидыЦелевыхСредств.ВидЦелевыхТекстовомуКоду(СтрокаРасшифровки.УточненныйКодЦС);
			СтрДок.ОбъектФАИП = БиблиотекаФункцийОбмена.ОбъектФАИПКМИПоТекстовомуКоду(СтрокаРасшифровки.УточненныйКодФАИП, Организация);
            СтрДок.КодПрослеживаемости = СтрокаРасшифровки.УточненныйКодПрослеживаемости;  
			
			СтрДок.СуммаВал = СтрокаРасшифровки.УточненнаяСуммаВал;
			Если ВРублях Тогда
				СтрДок.Сумма = СтрДок.СуммаВал; 
			Иначе
				СтрДок.Сумма = СтрокаРасшифровки.УточненнаяСуммаРуб;
			КонецЕсли;  
			
            // Раздел лицевого счета   
			Если ЗначениеЗаполнено(НовыйДокумент.ЛицевойСчет) И ЗначениеЗаполнено(СтрокаРасшифровки.УточненныйКодПоступления) Тогда 
				СтрДок.РазделЛС = Справочники.РазделыЛицевыхСчетов.РазделЛСПоКодуПоступленияЕБП(НовыйДокумент.ЛицевойСчет, СтрокаРасшифровки.УточненныйКодПоступления, ИнформацияОбОшибке, Истина); 
			КонецЕсли; 
			
			// КПС  
			Если ЗначениеЗаполнено(СтрокаРасшифровки.УточненныйКБК) Тогда
				ТипКБК = БюджетнаяКлассификация.ВидКБКПоАналитическомуКоду(Прав(СтрокаРасшифровки.УточненныйКБК, 3));
				Если НЕ ЗначениеЗаполнено(ТипКБК) Тогда
					ТипКБК = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ");   
				КонецЕсли;	
				Если ЭтоКазенное Тогда
					СтрДок.КБКНазначениеПлатежа = БиблиотекаФункцийОбмена.КПСПоТекстовомуКодуБК(СтрокаРасшифровки.УточненныйКБК, ТипКБК,, НовыйДокумент.Дата, ИнформацияОбОшибке);
				Иначе
					СтрДок.КБКНазначениеПлатежа = БиблиотекаФункцийОбмена.КПСПоТекстовомуКодуБК(СтрокаРасшифровки.УточненныйКБК, Перечисления.ВидыКБК.АУИБУ, ТипКБК, НовыйДокумент.Дата, ИнформацияОбОшибке); 
				КонецЕсли;	 
			КонецЕсли;  
			
			СтрДок.ПричинаУточнения = СтрокаРасшифровки.ПричинаУточнения; 			
			
		КонецЦикла;	
								
		Если ЗначениеЗаполнено(ИнформацияОбОшибке) Тогда
			ОтменитьТранзакцию(); 
			ИнформацияОбОшибке =  ИнформацияОбОшибке + ?(СтрДлина(ИнформацияОбОшибке) > 0, Символы.ПС, "") + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()); 
			ЗаписьЖурналаРегистрации("Обмен ЕБП", УровеньЖурналаРегистрации.Ошибка,,, ИнформацияОбОшибке + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Иначе
			
			НовыйДокумент.Записать(); 
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостояниеПлатежноРасчетныхДокументов");
			ЭлементБлокировки.УстановитьЗначение("ПлатежноРасчетныйДокумент", НовыйДокумент.Ссылка); 
			Блокировка.Заблокировать();  
			
			НаборЗаписей = РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПлатежноРасчетныйДокумент.Установить(НовыйДокумент.Ссылка);
			НаборЗаписей.Прочитать(); 
			Если НаборЗаписей.Количество() =0 Тогда
				Запись = НаборЗаписей.Добавить();
			Иначе
				Запись = НаборЗаписей[0];
			КонецЕсли;
			Запись.ПлатежноРасчетныйДокумент = НовыйДокумент.Ссылка; 
			Запись.Статус = НовыйСтатусДокумента; 
			ДатаИсполнения = Неопределено;
			ДанныеКОбработке.Свойство("ДатаИсполненияРСКП", ДатаИсполнения); 
			Если Не ЗначениеЗаполнено(ДатаИсполнения) Тогда
				ДатаИсполнения = НовыйДокумент.ДатаРСКП;  
			КонецЕсли;
			Запись.ДатаПроведения = ДатаИсполнения;
			НаборЗаписей.Записать();
			
			ЗафиксироватьТранзакцию(); 
		КонецЕсли;
	Исключение
		ОтменитьТранзакцию(); 
		ИнформацияОбОшибке = ИнформацияОбОшибке + ?(СтрДлина(ИнформацияОбОшибке) > 0, Символы.ПС, "") + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("Обмен ЕБП", УровеньЖурналаРегистрации.Ошибка,,, ИнформацияОбОшибке + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры	

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

