
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
			ПриИзмененииРеквизитовЛицевогоСчетаНаСервере();
		КонецЕсли;
		
		Объект.КомиссияИРасходы = "OUR";
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	МаксимальнаяДлинаНазначенияПлатежа = Объект.Ссылка.Метаданные().Реквизиты.НазначениеПлатежа.Тип.КвалификаторыСтроки.Длина;
	МаксимальнаяДлинаИнформацияОтправителяПолучателю = Объект.Ссылка.Метаданные().Реквизиты.ИнформацияОтправителяПолучателю.Тип.КвалификаторыСтроки.Длина;
	
	РеквизитыПолучательОрганизация = РеквизитыПолучателя(Объект.Организация);
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокДлинаНазначенияПлатежаКлиент();
	УстановитьЗаголовокДлинаИнформацияОтправителяПолучателюКлиент();
	
	УстановитьВидимостьГруппыПолучателя();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РеквизитыПолучательОрганизация = РеквизитыПолучателя(Объект.Организация);
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, ТипЛицевогоСчета, НаДату",
		Объект.Организация, Объект.РеквизитыЛицевогоСчета, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Казначейский"), Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Модифицированность = Истина;
	
	Объект.РеквизитыЛицевогоСчета = ВыбранноеЗначение;
	
	ПриИзмененииРеквизитовЛицевогоСчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетОчистка(Элемент, СтандартнаяОбработка)
	Объект.РеквизитыЛицевогоСчета = "";
КонецПроцедуры

&НаКлиенте
Процедура СчетЗачисленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, ТипЛицевогоСчета, НаДату",
		Объект.Организация, Объект.РеквизитыЛицевогоСчетаПБС, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский"), Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетЗачисленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.РеквизитыЛицевогоСчетаПБС = ВыбранноеЗначение;
	
	ПриИзмененииРеквизитовЛицевогоСчетаПБСНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПолучателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Организация, ТекущаяСтрока, ТипЛицевогоСчета, НаДату",
		Объект.Организация, Объект.РеквизитыЛицевогоСчетаПБС, ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский"), Объект.Дата);
	ОткрытьФорму("Справочник.РеквизитыЛицевыхСчетов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПолучателяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Объект.РеквизитыЛицевогоСчетаПБС = ВыбранноеЗначение;
	
	ПриИзмененииРеквизитовЛицевогоСчетаПБСНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	ПриИзмененииПолучателяНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетПолучателяПриИзменении(Элемент)
	
	ПриИзмененииСчетаПолучателяНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура БанкКорреспондентПриИзменении(Элемент)
	РеквизитыБанкКорреспондент = РеквизитыБанка(Объект.БанкКорреспондент);
КонецПроцедуры

&НаКлиенте
Процедура БанкПосредник1ПриИзменении(Элемент)
	РеквизитыБанкПосредник1 = РеквизитыБанка(Объект.БанкПосредник1);
КонецПроцедуры

&НаКлиенте
Процедура БанкПосредник2ПриИзменении(Элемент)
	РеквизитыБанкПосредник2 = РеквизитыБанка(Объект.БанкПосредник2);
КонецПроцедуры

&НаКлиенте
Процедура БанкПосредник3ПриИзменении(Элемент)
	РеквизитыБанкПосредник3 = РеквизитыБанка(Объект.БанкПосредник3);
КонецПроцедуры

&НаКлиенте
Процедура НазначениеПлатежаПриИзменении(Элемент)
	УстановитьЗаголовокДлинаНазначенияПлатежаКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОтправителяПолучателюПриИзменении(Элемент)
	УстановитьЗаголовокДлинаИнформацияОтправителяПолучателюКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ТипОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы(Объект, ЭтотОбъект.Элементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводСебеКакПБСПриИзменении(Элемент)
	
	УстановитьВидимостьГруппыПолучателя();
	
	Если Объект.ПереводСебеКакПБС тогда
		Объект.Получатель = "";
		Объект.СчетПолучателя = "";
		РеквизитыПолучательКонтрагент = "";
		РеквизитыБанкПолучателяКонтрагента = "";
	Иначе
		Объект.ЛицевойСчетПБС = "";
		Объект.РеквизитыЛицевогоСчетаПБС = "";
		РеквизитыБанкПолучателяОрганизации = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПокупаемаяВалютаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаПлатежаСумма", "Заголовок", "Сумма, " + Объект.ВалютаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаПлатежаСумма", "Заголовок", "Сумма, " + Объект.ВалютаДокумента);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТабличнойЧасти_РасшифровкаПлатежа

&НаКлиенте
Процедура РасшифровкаПлатежаКБКНазначениеПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РасшифровкаПлатежа.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКПС(Элемент,
													СтандартнаяОбработка,
													ТекущиеДанные.КБКНазначениеПлатежа,
													Объект.Организация,
													,
													,
													,
													Объект.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииРеквизитовЛицевогоСчетаНаСервере()
	
	Объект.ЛицевойСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "Владелец");
	Объект.ОрганКазначейства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчета, "КассовыйОрган");
	
	РеквизитыОрганКазначейства = РеквизитыКазначейства(Объект.ОрганКазначейства);
	
	СвойстваЛицевогоСчета = ПлатежноРасчетныеДокументыПовтИсп.ПолучитьСвойстваЛицевогоСчета(Объект.ЛицевойСчет, Объект.Дата);
	ЗаполнитьЗначенияСвойств(Объект, СвойстваЛицевогоСчета, "ПерваяПодпись, ВтораяПодпись");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииРеквизитовЛицевогоСчетаПБСНаСервере()
	
	Объект.ЛицевойСчетПБС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчетаПБС, "Владелец");
	Объект.БанкКорреспондент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчетаПБС, "БанкДляРасчетов");
	
	РеквизитыБанкПолучателяОрганизации = РеквизитыБанка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчетаПБС, "КассовыйОрган"));
	РеквизитыБанкКорреспондент = РеквизитыБанка(Объект.БанкКорреспондент);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПолучателяНаСервере()
	
	РеквизитыПолучательКонтрагент = РеквизитыПолучателя(Объект.Получатель);
	
	Объект.СчетПолучателя = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(
								Объект.Получатель,
								"Документ.ЗаявлениеНаПроведениеОперацийСИностраннойВалютой",
								ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский"),
								"СчетПолучателя",
								"Получатель");
	ПриИзмененииСчетаПолучателяНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСчетаПолучателяНаСервере()
	
	Объект.БанкКорреспондент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетПолучателя, "БанкДляРасчетов");
	
	РеквизитыБанкПолучателяКонтрагента = РеквизитыБанка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетПолучателя, "КассовыйОрган"));
	РеквизитыБанкКорреспондент = РеквизитыБанка(Объект.БанкКорреспондент);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокДлинаНазначенияПлатежаКлиент()
	
	ДлинаПоля = СтрДлина(СокрП(Объект.НазначениеПлатежа));
	
	ДлинаНазначенияПлатежа = " " + Формат(ДлинаПоля, "ЧЦ=3; ЧН=0; ЧГ=0")+ " симв., макс. " + Формат(МаксимальнаяДлинаНазначенияПлатежа, "ЧЦ=3; ЧН=0; ЧГ=0") + " симв."
	+ ?(ДлинаПоля > МаксимальнаяДлинаНазначенияПлатежа, ", превышение " + Формат(ДлинаПоля - МаксимальнаяДлинаНазначенияПлатежа, "ЧЦ=3; ЧГ=0") + " симв.", "");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовокДлинаИнформацияОтправителяПолучателюКлиент()
	
	ДлинаПоля = СтрДлина(СокрП(Объект.ИнформацияОтправителяПолучателю));
	
	ДлинаИнформацииОтправителяПолучателю = " " + Формат(ДлинаПоля, "ЧЦ=3; ЧН=0; ЧГ=0")+ " симв., макс. " + Формат(МаксимальнаяДлинаИнформацияОтправителяПолучателю, "ЧЦ=3; ЧН=0; ЧГ=0") + " симв."
	+ ?(ДлинаПоля > МаксимальнаяДлинаИнформацияОтправителяПолучателю, ", превышение " + Формат(ДлинаПоля - МаксимальнаяДлинаИнформацияОтправителяПолучателю, "ЧЦ=3; ЧГ=0") + " симв.", "");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Документ, ЭлементыФормы)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "ПокупкаПродажа", "Видимость", Документ.ТипОперации = 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "ПереводСебеКакПБС", "Видимость", Документ.ТипОперации <> 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "Перевод", "Видимость", Документ.ТипОперации <> 0);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭлементыФормы, "НазначениеПлатежаПрочие", "Видимость", Документ.ТипОперации <> 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьГруппыПолучателя()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтотОбъект.Элементы, "ПолучательОрганизация", "Видимость", Объект.ПереводСебеКакПБС);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(ЭтотОбъект.Элементы, "ПолучательКонтрагент", "Видимость", НЕ Объект.ПереводСебеКакПБС);
	
КонецПРоцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	УстановитьВидимостьЭлементовФормы(Объект, ЭтотОбъект.Элементы);
	
	РеквизитыОрганКазначейства = РеквизитыКазначейства(Объект.ОрганКазначейства);
	Если Объект.ТипОперации > 0 Тогда
		Если Объект.ПереводСебеКакПБС Тогда
			РеквизитыПолучательОрганизация = РеквизитыПолучателя(Объект.Организация);
			РеквизитыБанкПолучателяОрганизации = РеквизитыБанка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РеквизитыЛицевогоСчетаПБС, "КассовыйОрган"));
		Иначе
			РеквизитыПолучательКонтрагент = РеквизитыПолучателя(Объект.Получатель);
			РеквизитыБанкПолучателяКонтрагента = РеквизитыБанка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетПолучателя, "КассовыйОрган"));
		КонецЕсли;
		РеквизитыБанкКорреспондент = РеквизитыБанка(Объект.БанкКорреспондент);
		РеквизитыБанкПосредник1 = РеквизитыБанка(Объект.БанкПосредник1);
		РеквизитыБанкПосредник2 = РеквизитыБанка(Объект.БанкПосредник2);
		РеквизитыБанкПосредник3 = РеквизитыБанка(Объект.БанкПосредник3);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РасшифровкаПлатежаСумма", "Заголовок", "Сумма, " + Объект.ВалютаДокумента);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыКазначейства(Казначейство)
	
	Если НЕ ЗначениеЗаполнено(Казначейство) Тогда
		Возврат "";
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Казначейство, "ИНН, НаименованиеЛатиницей");
	
	МеждународныйАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
		Казначейство, Справочники.ВидыКонтактнойИнформации.МеждународныйАдресКазначейства);
	
	Возврат "INN: " + Реквизиты.ИНН + ", " + Реквизиты.НаименованиеЛатиницей + ", " + МеждународныйАдрес;
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыПолучателя(Получатель)
	
	Если Не ЗначениеЗаполнено(Получатель) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТипЗнч(Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		ЮридическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель, "ЮридическоеФизическоеЛицо");
		НаименованиеЛатиницей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮридическоеЛицо, "НаименованиеЛатиницей");
		МеждународныйАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			ЮридическоеЛицо, Справочники.ВидыКонтактнойИнформации.МеждународныйАдресКонтрагенты);
	ИначеЕсли ТипЗнч(Получатель) = Тип("СправочникСсылка.Организации") Тогда
		НаименованиеЛатиницей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Получатель, "НаименованиеЛатиницей");
		МеждународныйАдрес = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(
			Получатель, Справочники.ВидыКонтактнойИнформации.МеждународныйАдресОрганизации);
	Иначе
		ВызватьИсключение(НСтр("ru='Параметр ""Получатель"" неподходящего типа.'"));
	КонецЕсли;
	
	Возврат НаименованиеЛатиницей + ", " + МеждународныйАдрес;
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитыБанка(Банк)
	
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат "";
	КонецЕсли;
	
	Реквизиты = "КоррСчет, СВИФТБИК, МеждународноеНаименование, Код, ГородМеждународный, АдресМеждународный";
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Банк, Реквизиты);
	
	СтрокаРеквизитыБанка = "";
	
	Для Каждого КлючЗначение Из ЗначенияРеквизитов Цикл
		
		Если Не ПустаяСтрока(СтрокаРеквизитыБанка) Тогда
			СтрокаРеквизитыБанка = СтрокаРеквизитыБанка + ", ";
		КонецЕсли;
		
		СтрокаРеквизитыБанка = СтрокаРеквизитыБанка + КлючЗначение.Значение;
		
	КонецЦикла;
	
	Возврат СтрокаРеквизитыБанка;
	
КонецФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
