#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ЭтоРегистрУчета() Экспорт
	
	Возврат Истина;
	
КонецФункции

Процедура СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета) Экспорт
	
	СтандартныеОтчеты.СвойстваРегистраУчета(ОтчетОбъект, СвойстваРегистраУчета); 
	
	СвойстваРегистраУчета.ОтчетНеЗаполнен = ОтчетОбъект.СписокСформированныхЛистов.Количество() = 0;
	
КонецПроцедуры

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации()
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       см. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "");
	НастройкиВарианта.Включен = Ложь;
КонецПроцедуры

// Формирует табличную часть отчета
Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища) Экспорт
	
	ПараметрыОтчета.СписокСформированныхЛистов.Очистить();
	
	// в связи со спецификой отчета переопределим перериод
	ПараметрыОтчета.Период = КонецКвартала(ПараметрыОтчета.КонецПериода);
	
	// Подготовка данных отчета
	ДанныеОтчета = ПодготовитьДанныеОтчета(ПараметрыОтчета);
	ПараметрыОтчета.Вставить("ДанныеОтчета", ДанныеОтчета);
	
	// Вывод печатной формы
	
	ПечатьТитульногоЛиста(ПараметрыОтчета);
	
	ПечатьРаздела1(ПараметрыОтчета);
	
	Если ПараметрыОтчета.ПрименяетсяУСНДоходыМинусРасходы Тогда
		
		ПечатьРаздела2(ПараметрыОтчета);
		
		ПечатьРаздела3(ПараметрыОтчета);
		
	Иначе
		
		ПечатьРазделаУменьшенияНалога(ПараметрыОтчета);
		
		ПечатьРазделаТорговогоСбора(ПараметрыОтчета);
		
	КонецЕсли;
	
	Если АдресХранилища <> Неопределено Тогда
		ПоместитьВоВременноеХранилище(ПараметрыОтчета.СписокСформированныхЛистов, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывестиШапкуРаздела1(ПараметрыОтчета, ТабличныйДокумент, Макет)
	
	Секция = Макет.ПолучитьОбласть("Шапка|Основная");
	ТабличныйДокумент.Вывести(Секция);
	Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "Шапка|Режим3","Шапка|Режим12"));
	Если ПараметрыОтчета.РежимПечатиГраф4и6 = 3 Тогда
		Секция = Макет.ПолучитьОбласть("Шапка|Режим3");
		Если ПараметрыОтчета.Период >= ДатаОтменыФормирования4РазделаКУДиР() Тогда
			Секция.Параметры.Заголовок4 = НСтр("ru = 'Доходы, учитываемые при исчислении налоговой базы
                                               |(рублей)'");
			Секция.Параметры.Заголовок6 = НСтр("ru = 'Расходы, учитываемые при исчислении налоговой базы
                                               |(рублей)'");
		Иначе
			Секция.Параметры.Заголовок4 = НСтр("ru = 'Доходы, учитываемые при исчислении налоговой базы'");
			Секция.Параметры.Заголовок6 = НСтр("ru = 'Расходы, учитываемые при исчислении налоговой базы'");
		КонецЕсли;
	Иначе
		Секция = Макет.ПолучитьОбласть("Шапка|Режим12");
		Секция.Параметры.Заголовок5 = "в т.ч. доходы, учитываемые при исчислении налоговой базы";
		Секция.Параметры.Заголовок7 = "в т.ч. расходы, учитываемые при исчислении налоговой базы";
	КонецЕсли;
	
	ТабличныйДокумент.Присоединить(Секция);
	
КонецПроцедуры

Процедура ПечатьТитульногоЛиста(ПараметрыОтчета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.Автомасштаб         = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_ТитульныйЛист";
	
	Секция = МакетТитульногоЛиста(ПараметрыОтчета.Период);
	
	Сведения = РегламентированнаяОтчетностьВызовСервера.ПолучитьСведенияОбОрганизации(
		ПараметрыОтчета.Организация, , "НаимЮЛПол,ИННЮЛ,КППЮЛ,ОКПО,АдрФакт");
	
	Секция.Параметры.НаПериод = "на " + Формат(Год(ПараметрыОтчета.Период), "ЧГ=") + " год";
	Секция.Параметры.ПолноеНаименованиеОрганизации = Сведения.НаимЮЛПол;
	
	Секция.Параметры.КодОКПО = Сведения.ОКПО;
	
	//Соберем банковские счета
	Счета = "";
	
	Данные = ПараметрыОтчета.ДанныеОтчета;
	Если Данные.БанковскиеСчета <> Неопределено Тогда
		БанковскиеСчетаВыборка = Данные.БанковскиеСчета.Выбрать();
		Пока БанковскиеСчетаВыборка.Следующий() Цикл
			
			РеквизитыПлательщика = Новый Структура("ПлательщикБанковскийСчет, ПлательщикНаименованиеБанка", "СчетНомер", "Банк");
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(
				БанковскиеСчетаВыборка.ЛицевойСчет,
				БанковскиеСчетаВыборка.РеквизитыЛицевогоСчета,
				РеквизитыПлательщика);
			
			Если ЗначениеЗаполнено(РеквизитыПлательщика.ПлательщикБанковскийСчет)
				И ЗначениеЗаполнено(РеквизитыПлательщика.ПлательщикНаименованиеБанка) Тогда
				НомСч = СокрЛП(РеквизитыПлательщика.ПлательщикБанковскийСчет);
				Банк  = СокрЛП(РеквизитыПлательщика.ПлательщикНаименованиеБанка);
				Счета = Счета+"№ "+НомСч+" в "+Банк+", ";
			КонецЕсли;
			
		КонецЦикла;
		Счета = Лев(Счета,СтрДлина(Счета)-2);
	КонецЕсли;
	Секция.Параметры.Счета = Счета;
	
	УчетнаяПолитика = Справочники.Организации.ПолучитьУчетнуюПолитику(ПараметрыОтчета.Организация, ПараметрыОтчета.Период);
	Если УчетнаяПолитика.ПрименяетсяУСН Тогда
		Секция.Параметры.ОбъектНалогообложения = УчетнаяПолитика.ОбъектНалогообложенияУСН;
	КонецЕсли;
	
	Если ПараметрыОтчета.Период < ДатаОтменыФормирования4РазделаКУДиР() Тогда
		
		//Проверим длину адреса
		СтрокаАдреса = СокрЛП(Сведения.АдрФакт);
		Если СтрДлина(СтрокаАдреса) > 45 Тогда
			
			ПозицияПереноса = 0;
			СтрокаПоиска = СтрокаАдреса;
			РезультатПоиска = СтрНайти(СтрокаПоиска, ",");
			
			Пока (РезультатПоиска + ПозицияПереноса < 45) И (РезультатПоиска > 0) Цикл
				ПозицияПереноса = ПозицияПереноса + РезультатПоиска;
				СтрокаПоиска = Прав(СтрокаПоиска, СтрДлина(СтрокаПоиска) - РезультатПоиска);
				РезультатПоиска = СтрНайти(СтрокаПоиска, ",");
			КонецЦикла;
			
			Если Не ПозицияПереноса = 0 Тогда
				Секция.Параметры.АдресОрганизации = Лев(СтрокаАдреса, ПозицияПереноса);
				Секция.Параметры.АдресОрганизации2 = Прав(СтрокаАдреса, СтрДлина(СтрокаАдреса) - ПозицияПереноса);
			Иначе
				СтрокаПоиска = СтрокаАдреса;
				РезультатПоиска = СтрНайти(СтрокаПоиска, " ");
				Пока (РезультатПоиска + ПозицияПереноса < 45) И (РезультатПоиска > 0) Цикл
					ПозицияПереноса = ПозицияПереноса + РезультатПоиска;
					СтрокаПоиска = Прав(СтрокаПоиска, СтрДлина(СтрокаПоиска) - РезультатПоиска);
					РезультатПоиска = СтрНайти(СтрокаПоиска, " ");
				КонецЦикла;
				ПозицияПереноса = ?(ПозицияПереноса = 0, 45, ПозицияПереноса);
				Секция.Параметры.АдресОрганизации = Лев(СтрокаАдреса, ПозицияПереноса);
				Секция.Параметры.АдресОрганизации2 = Прав(СтрокаАдреса, СтрДлина(СтрокаАдреса) - ПозицияПереноса);
			КонецЕсли;
			
		Иначе
			Секция.Параметры.АдресОрганизации = Сведения.АдрФакт;
		КонецЕсли;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Секция);
	
	ИНН = Сведения.ИННЮЛ;
	КПП = Сведения.КППЮЛ;
	
	Если СтрДлина(ИНН) <> 12 Тогда
		// Налогоплательщик - юр. лицо
		ИНН = "00" + ИНН;
	Иначе
		// Налогоплательщик - физ. лицо
		КПП = "";
	КонецЕсли;
	
	ИмяОбластиИНН = "ИНН";
	
	Для НомерСимвола = 1 По 12 Цикл
		
		ТабличныйДокумент.Область(ИмяОбластиИНН + НомерСимвола).Текст = ?(СтрДлина(ИНН) > 0, Сред(ИНН, НомерСимвола, 1), "");
		
		Если НомерСимвола <= 9 Тогда
			ТабличныйДокумент.Область("КПП" + НомерСимвола).Текст = Сред(КПП, НомерСимвола, 1);
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент, НСтр("ru = 'Титульный лист'"));
	
КонецПроцедуры

Процедура ПечатьРаздела1(ПараметрыОтчета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.Автомасштаб         = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_Раздел1";
	Макет = ПолучитьМакет("Раздел1");
	
	ВывестиШапкуРаздела1(ПараметрыОтчета, ТабличныйДокумент, Макет);
	
	ВыделятьНДС = ВыделятьНДС(ПараметрыОтчета);
	
	НачДата = НачалоКвартала(ПараметрыОтчета.НачалоПериода);
	КолКварталов = НомерКвартала(ПараметрыОтчета.Период);
	
	НПП = 1;
	
	ВыборкаКоличествоЗаписей = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "КоличествоЗаписейРаздела1ДоНачалаОтчета");
	
	Если ВыборкаКоличествоЗаписей <> Неопределено Тогда
		Пока ВыборкаКоличествоЗаписей.Следующий() Цикл
			НПП = НПП + ВыборкаКоличествоЗаписей.КоличествоСтрок + ВыборкаКоличествоЗаписей.КоличествоСтрокНДС;
		КонецЦикла;
	КонецЕсли;
	
	ТекКвартал              = НомерКвартала(НачДата);
	ПоследнийКварталПериода = НомерКвартала(ПараметрыОтчета.Период);
	
	ВыборкаЗаписей = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "ЗаписиРаздел1");
	
	ТаблицаРасшифровок = ПолучитьТаблицуДанных(ПараметрыОтчета.ДанныеОтчета, "ЗаписиРасшифровкиРаздел1");
	Если ПараметрыОтчета.ВыводитьРасшифровки И ЗначениеЗаполнено(ТаблицаРасшифровок) Тогда
		ТаблицаРасшифровок.Индексы.Добавить("Регистратор");
		ТаблицаРасшифровок.Индексы.Добавить("КлючЗаписиКУДиР");
		ТаблицаРасшифровок.Индексы.Добавить("ВидРасхода");
	КонецЕсли;
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		КварталЗаписи = КварталЗаписи(ВыборкаЗаписей.Период, ПараметрыОтчета);
		
		Пока КварталЗаписи <> ТекКвартал Цикл
			
			ВывестиИтогиЗаКвартал(ПараметрыОтчета, ТекКвартал, ПоследнийКварталПериода, Макет, ТабличныйДокумент);
			ТекКвартал = ТекКвартал + 1;
			
		КонецЦикла;
		
		Секция = Макет.ПолучитьОбласть("Строка|Основная");
		Секция.Параметры.НомерПП 						= НПП;
		Секция.Параметры.ТекРасшифровка					= ВыборкаЗаписей.Регистратор;
		Секция.Параметры.ПечДатаНомерДок 				= ВыборкаЗаписей.РеквизитыПервичногоДокумента;
		Секция.Параметры.ПечСодержОпер 					= ВыборкаЗаписей.Содержание;
		
		Если ПараметрыОтчета.РежимПечатиГраф4и6 < 2 Тогда
			//Выводим все строки
		ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаЗаписей.Графа5) И НЕ ЗначениеЗаполнено(ВыборкаЗаписей.Графа7) Тогда
			Продолжить;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Секция);
		
		НДСрасходовБУ = 0;
		
		Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "Строка|Режим3","Строка|Режим12"));
		Если ПараметрыОтчета.РежимПечатиГраф4и6 < 2 Тогда
			Секция.Параметры.ПечДоходыБУ = ВыборкаЗаписей.Графа4;
			Если ПараметрыОтчета.РежимПечатиНДС = 2 И ВыборкаЗаписей.Графа6 > 0 И ВыборкаЗаписей.Графа7 > 0 И ВыборкаЗаписей.НДС > 0
					И НЕ ВыделятьНДС Тогда 
				НДСрасходовБУ = ?(ВыборкаЗаписей.Графа6 >= ВыборкаЗаписей.Графа7, ВыборкаЗаписей.НДС,
					ВыборкаЗаписей.НДС*ВыборкаЗаписей.Графа6/ВыборкаЗаписей.Графа7);
				Секция.Параметры.ПечРасходыБУ = ВыборкаЗаписей.Графа6 - НДСрасходовБУ;
			Иначе
				Секция.Параметры.ПечРасходыБУ = ВыборкаЗаписей.Графа6;
			КонецЕсли;
		КонецЕсли;
		
		Секция.Параметры.ПечДоходы = ВыборкаЗаписей.Графа5;
		
		Если ВыборкаЗаписей.НДС = 0 ИЛИ ВыделятьНДС Тогда
			
			Секция.Параметры.ПечРасходы = ВыборкаЗаписей.Графа7;
			ТабличныйДокумент.Присоединить(Секция);
			
		ИначеЕсли ПараметрыОтчета.РежимПечатиНДС = 1 Тогда
			
			Секция.Параметры.ПечРасходы = "" + Формат(ВыборкаЗаписей.Графа7, "ЧДЦ=2") + "
			|в т.ч. НДС
			|" + Формат(ВыборкаЗаписей.НДС, "ЧДЦ=2");
			ТабличныйДокумент.Присоединить(Секция);
			
		Иначе // ПараметрыОтчета.РежимПечатиНДС = 2
			
			Секция.Параметры.ПечРасходы = ВыборкаЗаписей.Графа7 - ВыборкаЗаписей.НДС;
			ТабличныйДокумент.Присоединить(Секция);
			
		КонецЕсли;
		
		Если ПараметрыОтчета.ВыводитьРасшифровки И ЗначениеЗаполнено(ТаблицаРасшифровок) Тогда
			ЕстьШапка = Ложь;
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Регистратор", ВыборкаЗаписей.Регистратор);
			ПараметрыОтбора.Вставить("КлючЗаписиКУДиР", ВыборкаЗаписей.КлючЗаписиКУДиР);
			
			НайденныеСтроки = ТаблицаРасшифровок.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаРасшифровки Из НайденныеСтроки Цикл
				
				Если ПараметрыОтчета.РежимПечатиНДС = 2 И (НЕ ВыделятьНДС) И ВыборкаЗаписей.НДС <> 0 И СтрокаРасшифровки.ВидРасхода = Перечисления.ВидыРасходовУСН.НДС Тогда
					Продолжить;
				КонецЕсли;
				
				Если НЕ ЕстьШапка Тогда
					
					ТабличныйДокумент.НачатьГруппуСтрок("Расшифровка расходов строки №" + Строка(НПП), Ложь);
					
					Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "ШапкаРасшифровки3","ШапкаРасшифровки12"));
					Секция.Параметры.НомерПП = НПП;
					
					ТабличныйДокумент.Вывести(Секция);
					
					ЕстьШапка = Истина;
				КонецЕсли;
				
				Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "СтрокаРасшифровки3","СтрокаРасшифровки12"));
				Секция.Параметры.НомерПП       = Строка(НПП) + "." + СтрокаРасшифровки.НомерСтрокиРасшифровки;
				Секция.Параметры.ПечСодержОпер = СтрокаРасшифровки.Содержание;
				Если ЗначениеЗаполнено(СтрокаРасшифровки.ДокументОплатыРасходов) Тогда
					Секция.Параметры.ПечДатаНомерОплаты	= "Оплачено: "
						+ УчетУСН.РеквизитыПервичногоДокумента(СтрокаРасшифровки.ДокументОплатыРасходов);
					Секция.Параметры.ДокОплаты = СтрокаРасшифровки.ДокументОплатыРасходов;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаРасшифровки.ДокументПоступленияРасходов) Тогда
					Секция.Параметры.ДокПоступления = СтрокаРасшифровки.ДокументПоступленияРасходов;
				КонецЕсли;
				Секция.Параметры.ПечРасходы = СтрокаРасшифровки.Графа7;
				
				ТабличныйДокумент.Вывести(Секция);
				
			КонецЦикла;
			
			Если ЕстьШапка Тогда
				Секция = Макет.ПолучитьОбласть("ПодвалРасшифровки");
				ТабличныйДокумент.Вывести(Секция);
				ТабличныйДокумент.ЗакончитьГруппуСтрок();
			КонецЕсли;
			
		КонецЕсли;
		
		//Выведем строку НДС
		Если ПараметрыОтчета.РежимПечатиНДС = 2 И ВыборкаЗаписей.НДС <> 0 И НЕ ВыделятьНДС Тогда
			
			НПП = НПП + 1;
			
			Секция = Макет.ПолучитьОбласть("Строка|Основная");
			Секция.Параметры.НомерПП         = НПП;
			Секция.Параметры.ТекРасшифровка  = ВыборкаЗаписей.Регистратор;
			Секция.Параметры.ПечДатаНомерДок = ВыборкаЗаписей.РеквизитыПервичногоДокумента;
			Секция.Параметры.ПечСодержОпер   = ВыборкаЗаписей.Содержание +" (НДС)";
			ТабличныйДокумент.Вывести(Секция);
			Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "Строка|Режим3","Строка|Режим12"));
			Если ПараметрыОтчета.РежимПечатиГраф4и6 < 2 Тогда
				Секция.Параметры.ПечРасходыБУ = НДСрасходовБУ;
			КонецЕсли;
			Секция.Параметры.ПечРасходы = ВыборкаЗаписей.НДС;
			ТабличныйДокумент.Присоединить(Секция);
			
			Если ПараметрыОтчета.ВыводитьРасшифровки И ЗначениеЗаполнено(ТаблицаРасшифровок) Тогда
				ЕстьШапка = Ложь;
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("Регистратор", ВыборкаЗаписей.Регистратор);
				ПараметрыОтбора.Вставить("КлючЗаписиКУДиР", ВыборкаЗаписей.КлючЗаписиКУДиР);
				ПараметрыОтбора.Вставить("ВидРасхода", Перечисления.ВидыРасходовУСН.НДС);
				
				НайденныеСтроки = ТаблицаРасшифровок.НайтиСтроки(ПараметрыОтбора);
				Для Каждого СтрокаРасшифровки Из НайденныеСтроки Цикл
					
					Если ПараметрыОтчета.РежимПечатиНДС = 2 И ВыборкаЗаписей.НДС <> 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Если НЕ ЕстьШапка Тогда
						
						ТабличныйДокумент.НачатьГруппуСтрок("Расшифровка расходов строки №" + Строка(НПП), Ложь);
						
						Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "ШапкаРасшифровки3","ШапкаРасшифровки12"));
						Секция.Параметры.НомерПП = НПП;
						
						ТабличныйДокумент.Вывести(Секция);
						
						ЕстьШапка = Истина;
					КонецЕсли;
					
					Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "СтрокаРасшифровки3","СтрокаРасшифровки12"));
					Секция.Параметры.НомерПП       = Строка(НПП) + "." + СтрокаРасшифровки.НомерСтрокиРасшифровки;
					Секция.Параметры.ПечСодержОпер = СтрокаРасшифровки.Содержание;
					Если ЗначениеЗаполнено(СтрокаРасшифровки.ДокументОплатыРасходов) Тогда
						Секция.Параметры.ПечДатаНомерОплаты	= "Оплачено: "
							+ УчетУСН.РеквизитыПервичногоДокумента(СтрокаРасшифровки.ДокументОплатыРасходов);
						Секция.Параметры.ДокОплаты = СтрокаРасшифровки.ДокументОплатыРасходов;
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаРасшифровки.ДокументПоступленияРасходов) Тогда
						Секция.Параметры.ДокПоступления = СтрокаРасшифровки.ДокументПоступленияРасходов;
					КонецЕсли;
					Секция.Параметры.ПечРасходы = СтрокаРасшифровки.Графа7;
					
					ТабличныйДокумент.Вывести(Секция);
					
				КонецЦикла;
				
				Если ЕстьШапка Тогда
					Секция = Макет.ПолучитьОбласть("ПодвалРасшифровки");
					ТабличныйДокумент.Вывести(Секция);
					ТабличныйДокумент.ЗакончитьГруппуСтрок();
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		НПП = НПП + 1;
		
	КонецЦикла;
	
	Пока ПоследнийКварталПериода >= ТекКвартал Цикл
		
		ВывестиИтогиЗаКвартал(ПараметрыОтчета, ТекКвартал, ПоследнийКварталПериода, Макет, ТабличныйДокумент);
		ТекКвартал = ТекКвартал + 1;
		
	КонецЦикла;
	
	// Выведем подвал
	Если НомерКвартала(ПараметрыОтчета.Период) = 4 Тогда
		Секция = Макет.ПолучитьОбласть("Справка");
		
		П010 = 0;
		П020 = 0;
		
		ВыборкаОбороты = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "ОборотыРаздела1ПоКварталам", Истина);
		Пока ВыборкаОбороты.Следующий() Цикл
			П010 = П010 + ВыборкаОбороты.Графа5;
			П020 = П020 + ВыборкаОбороты.Графа7;
		КонецЦикла;
		
		П030 = 0;
		
		ТаблицаУбытков = ПолучитьТаблицуДанных(ПараметрыОтчета.ДанныеОтчета, "УбыткиРаздел3", Истина);
		Если ЗначениеЗаполнено(ТаблицаУбытков) Тогда
			П030 = ТаблицаУбытков[0].УбытокОтУплатыМинимальногоНалога;
		КонецЕсли;
		
		Секция.Параметры.ПечДоходы = П010;
		Секция.Параметры.ПечРасходы = П020;
		Секция.Параметры.Убыток030 = П030;
		
		Если П010 - П020 - П030 >= 0 Тогда
			Секция.Параметры.ИтогоДоходы = П010 - П020 - П030;
		Иначе
			Секция.Параметры.ИтогоРасходы = П020 + П030 - П010;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Секция);
	КонецЕсли;
	
	УстановитьШиринуКолонкиСодержание(ПараметрыОтчета, Макет, ТабличныйДокумент);
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ПовторятьПриПечатиСтроки = ТабличныйДокумент.Область(6,,6,);
	
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент,
		СтрШаблон(НСтр("ru = 'Раздел I. Доходы и расходы за %1 кв.'"), ПоследнийКварталПериода));
	
КонецПроцедуры

Процедура ПечатьРаздела2(ПараметрыОтчета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.Автомасштаб         = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_Раздел2";
	
	Макет = МакетРаздела2(ПараметрыОтчета.Период);
	
	Секция = Макет.ПолучитьОбласть("Шапка");
	Если ПараметрыОтчета.Период < ДатаОтменыФормирования4РазделаКУДиР() Тогда
		Секция.Параметры.ЗаПериод = ЗаголовокПериодНарастающимИтогом(ПараметрыОтчета.Период);
	КонецЕсли;
	ТабличныйДокумент.Вывести(Секция);
	
	ТаблицаРезультата = ПолучитьТаблицуДанных(ПараметрыОтчета.ДанныеОтчета, "ЗаписиРаздел2");
	ТаблицаОтчета = Неопределено;
	
	Если ЗначениеЗаполнено(ТаблицаРезультата) Тогда
	
		ТаблицаОтчета = ТаблицаРезультата.Скопировать();
		ТаблицаОтчета.Очистить();
		ТаблицаОтчета.Колонки.Добавить("ПечДатаОплаты");
		СтрокаТаблицыОтчета = Неопределено;
		СписокДат = "";
		Для Каждого СтрокаТаблицы Из ТаблицаРезультата Цикл
			Если СтрокаТаблицыОтчета = Неопределено Тогда
				СтрокаТаблицыОтчета = ТаблицаОтчета.Добавить();
			КонецЕсли;
			Если (СтрокаТаблицыОтчета.ОсновноеСредство						= СтрокаТаблицы.ОсновноеСредство) И
				(СтрокаТаблицыОтчета.ДокументМодернизации 					= СтрокаТаблицы.ДокументМодернизации) И
				(СтрокаТаблицыОтчета.ДатаВводаВЭксплуатацию 				= СтрокаТаблицы.ДатаВводаВЭксплуатацию) И
				(СтрокаТаблицыОтчета.ДатаВыбытия 							= СтрокаТаблицы.ДатаВыбытия) И
				(СтрокаТаблицыОтчета.СрокПолезногоИспользования				= СтрокаТаблицы.СрокПолезногоИспользования) И
				(СтрокаТаблицыОтчета.КоличествоКварталовВНалоговомПериоде	= СтрокаТаблицы.КоличествоКварталовВНалоговомПериоде) И
				(СтрокаТаблицыОтчета.ДоляСтоимостиЗаНалоговыйПериод 		= СтрокаТаблицы.ДоляСтоимостиЗаНалоговыйПериод) И
				(СтрокаТаблицыОтчета.ДоляСтоимостиЗаКвартал 		 		= СтрокаТаблицы.ДоляСтоимостиЗаКвартал) Тогда
				
				СтрокаТаблицыОтчета.ПервоначальнаяСтоимость 		= СтрокаТаблицыОтчета.ПервоначальнаяСтоимость
					+ СтрокаТаблицы.ПервоначальнаяСтоимость;
				СтрокаТаблицыОтчета.ОстаточнаяСтоимость 			= СтрокаТаблицыОтчета.ОстаточнаяСтоимость
					+ СтрокаТаблицы.ОстаточнаяСтоимость;
				СтрокаТаблицыОтчета.СуммаРасходовЗаНалоговыйПериод	= СтрокаТаблицыОтчета.СуммаРасходовЗаНалоговыйПериод
					+ СтрокаТаблицы.СуммаРасходовЗаНалоговыйПериод;
				СтрокаТаблицыОтчета.СуммаРасходовЗаКвартал 			= СтрокаТаблицыОтчета.СуммаРасходовЗаКвартал
					+ СтрокаТаблицы.СуммаРасходовЗаКвартал;
				СтрокаТаблицыОтчета.РасходыПрошлыхПериодов 			= СтрокаТаблицыОтчета.РасходыПрошлыхПериодов
					+ СтрокаТаблицы.РасходыПрошлыхПериодов;
				СтрокаТаблицыОтчета.ОставшаясяЧастьРасходов 		= СтрокаТаблицыОтчета.ОставшаясяЧастьРасходов
					+ СтрокаТаблицы.ОставшаясяЧастьРасходов;
				
				СписокДат = СписокДат + Формат(СтрокаТаблицы.ДатаОплаты, "ДФ=дд.ММ.гггг") + ", ";
			Иначе
				СтрокаТаблицыОтчета.ПечДатаОплаты = ?(Прав(СписокДат,2)=", ",Лев(СписокДат,СтрДлина(СписокДат)-2),СписокДат);
				
				СтрокаТаблицыОтчета 										= ТаблицаОтчета.Добавить();
				СтрокаТаблицыОтчета.ОсновноеСредство 						= СтрокаТаблицы.ОсновноеСредство;
				СтрокаТаблицыОтчета.ДокументМодернизации 					= СтрокаТаблицы.ДокументМодернизации;
				СтрокаТаблицыОтчета.ИнвентарныйНомер 						= СтрокаТаблицы.ИнвентарныйНомер;
				СтрокаТаблицыОтчета.ДатаВводаВЭксплуатацию 					= СтрокаТаблицы.ДатаВводаВЭксплуатацию;
				СтрокаТаблицыОтчета.ДатаВыбытия								= СтрокаТаблицы.ДатаВыбытия;
				СтрокаТаблицыОтчета.ДатаПодачиДокументовНаГосРегистрацию	= СтрокаТаблицы.ДатаПодачиДокументовНаГосРегистрацию;
				СтрокаТаблицыОтчета.СрокПолезногоИспользования 				= СтрокаТаблицы.СрокПолезногоИспользования;
				СтрокаТаблицыОтчета.КоличествоКварталовВНалоговомПериоде	= СтрокаТаблицы.КоличествоКварталовВНалоговомПериоде;
				СтрокаТаблицыОтчета.ДоляСтоимостиЗаНалоговыйПериод			= СтрокаТаблицы.ДоляСтоимостиЗаНалоговыйПериод;
				СтрокаТаблицыОтчета.ДоляСтоимостиЗаКвартал 					= СтрокаТаблицы.ДоляСтоимостиЗаКвартал;
				
				СтрокаТаблицыОтчета.ПервоначальнаяСтоимость 				= СтрокаТаблицы.ПервоначальнаяСтоимость;
				СтрокаТаблицыОтчета.ОстаточнаяСтоимость						= СтрокаТаблицы.ОстаточнаяСтоимость;
				СтрокаТаблицыОтчета.СуммаРасходовЗаНалоговыйПериод			= СтрокаТаблицы.СуммаРасходовЗаНалоговыйПериод;
				СтрокаТаблицыОтчета.СуммаРасходовЗаКвартал 					= СтрокаТаблицы.СуммаРасходовЗаКвартал;
				СтрокаТаблицыОтчета.РасходыПрошлыхПериодов 					= СтрокаТаблицы.РасходыПрошлыхПериодов;
				СтрокаТаблицыОтчета.ОставшаясяЧастьРасходов 				= СтрокаТаблицы.ОставшаясяЧастьРасходов;
				
				СписокДат = Формат(СтрокаТаблицы.ДатаОплаты, "ДФ=дд.ММ.гггг") + ", ";
			КонецЕсли;
		КонецЦикла;
		Если НЕ СтрокаТаблицыОтчета = Неопределено Тогда
			СтрокаТаблицыОтчета.ПечДатаОплаты = ?(Прав(СписокДат,2)=", ",Лев(СписокДат,СтрДлина(СписокДат)-2),СписокДат);
			ТаблицаОтчета.Удалить(0);
		КонецЕсли;
		
		НПП = 1;
		Для Каждого СтрокаТаблицыОтчета Из ТаблицаОтчета Цикл
			
			Секция = Макет.ПолучитьОбласть("Строка");
			Секция.Параметры.ПорядковыйНомер  = НПП;
			Секция.Параметры.ОсновноеСредство = СтрокаТаблицыОтчета.ОсновноеСредство;
			Если ЗначениеЗаполнено(СтрокаТаблицыОтчета.ДокументМодернизации) Тогда
				СтрокаСодержания = СтрокаТаблицыОтчета.ОсновноеСредство.Наименование
					+ ?(НЕ ЗначениеЗаполнено(СтрокаТаблицыОтчета.ИнвентарныйНомер), "", ", инв.№"
					+ СтрокаТаблицыОтчета.ИнвентарныйНомер) + " (" + СтрокаТаблицыОтчета.ДокументМодернизации.СобытиеОС.Наименование
					+ " от " + Формат(СтрокаТаблицыОтчета.ДокументМодернизации.Дата,"ДФ=дд.ММ.гггг") + ")";
			Иначе
				СтрокаСодержания = СтрокаТаблицыОтчета.ОсновноеСредство.Наименование
					+ ?(НЕ ЗначениеЗаполнено(СтрокаТаблицыОтчета.ИнвентарныйНомер), "", ", инв.№" + СтрокаТаблицыОтчета.ИнвентарныйНомер);
			КонецЕсли;
			Секция.Параметры.НаименованиеОС            = СтрокаСодержания;
			Секция.Параметры.ПечДатаВводаВЭксплуатацию = Формат(СтрокаТаблицыОтчета.ДатаВводаВЭксплуатацию, "ДФ=дд.ММ.гггг");
			Секция.Параметры.ДатаОплаты                = СтрокаТаблицыОтчета.ПечДатаОплаты;
			Секция.Параметры.ПервоначальнаяСтоимость   = СтрокаТаблицыОтчета.ПервоначальнаяСтоимость;
			
			Секция.Параметры.СуммаРасходовЗаОтчетныйПериод = СтрокаТаблицыОтчета.СуммаРасходовЗаНалоговыйПериод;
			
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицыОтчета.СрокПолезногоИспользования) Тогда
				СтрокаТаблицыОтчета.ОставшаясяЧастьРасходов = 0;
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицыОтчета.ДатаПодачиДокументовНаГосРегистрацию) Тогда
				Секция.Параметры.ДатаПодачиДокументовНаГосРегистрацию = СтрокаТаблицыОтчета.ДатаПодачиДокументовНаГосРегистрацию;
			КонецЕсли;
			
			Секция.Параметры.ОстаточнаяСтоимость        = СтрокаТаблицыОтчета.ОстаточнаяСтоимость;
			Секция.Параметры.СрокПолезногоИспользования = СтрокаТаблицыОтчета.СрокПолезногоИспользования;
			
			Секция.Параметры.КоличествоКварталовВНалоговомПериоде     = СтрокаТаблицыОтчета.КоличествоКварталовВНалоговомПериоде;
			Секция.Параметры.ПроцентПринятыхРасходов                  = СтрокаТаблицыОтчета.ДоляСтоимостиЗаНалоговыйПериод;
			Секция.Параметры.ПроцентПринятыхРасходовЗаКвартал         = СтрокаТаблицыОтчета.ДоляСтоимостиЗаКвартал;
			Секция.Параметры.СуммаРасходовЗаПоследнийКвартал          = СтрокаТаблицыОтчета.СуммаРасходовЗаКвартал;
			Секция.Параметры.СуммаРасходовПредыдущихПериодов          = СтрокаТаблицыОтчета.РасходыПрошлыхПериодов;
			Секция.Параметры.СуммаРасходовНеВключенныхВСоставРасходов = СтрокаТаблицыОтчета.ОставшаясяЧастьРасходов;
			
			Секция.Параметры.ПечДатаВыбытия = Формат(СтрокаТаблицыОтчета.ДатаВыбытия, "ДФ=дд.ММ.гггг");
			
			ТабличныйДокумент.Вывести(Секция);
			НПП = НПП + 1;
		КонецЦикла;
	
	КонецЕсли;
	
	Секция = Макет.ПолучитьОбласть("Итог");
	
	Если ЗначениеЗаполнено(ТаблицаОтчета) Тогда
		
		Секция.Параметры.ИтогоПервоначальнаяСтоимость = ТаблицаОтчета.Итог("ПервоначальнаяСтоимость");
		Секция.Параметры.ИтогоОстаточнаяСтоимость     = ТаблицаОтчета.Итог("ОстаточнаяСтоимость");
		
		Секция.Параметры.ИтогоСуммаРасходовЗаОтчетныйПериод = ТаблицаОтчета.Итог("СуммаРасходовЗаНалоговыйПериод");
		
		Секция.Параметры.ИтогоСуммаРасходовЗаПоследнийКвартал          = ТаблицаОтчета.Итог("СуммаРасходовЗаКвартал");
		Секция.Параметры.ИтогоСуммаРасходовПредыдущихПериодов          = ТаблицаОтчета.Итог("РасходыПрошлыхПериодов");
		Секция.Параметры.ИтогоСуммаРасходовНеВключенныхВСоставРасходов = ТаблицаОтчета.Итог("ОставшаясяЧастьРасходов");
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Секция);
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент, НСтр("ru = 'Раздел II. Расходы на ОС и НМА'"));
	
КонецПроцедуры

Процедура ПечатьРаздела3(ПараметрыОтчета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.Автомасштаб         = Истина;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_Раздел3";
	
	Секция = МакетРаздела3(ПараметрыОтчета.Период);
	
	ТаблицаУбытков = ПолучитьТаблицуДанных(ПараметрыОтчета.ДанныеОтчета, "УбыткиРаздел3");
	
	Если ЗначениеЗаполнено(ТаблицаУбытков) Тогда
		
		Раздел1_П010 = 0;
		Раздел1_П020 = 0;
		
		ВыборкаОбороты = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "ОборотыРаздела1ПоКварталам", Истина);
		Пока ВыборкаОбороты.Следующий() Цикл
			Раздел1_П010 = Раздел1_П010 + ВыборкаОбороты.Графа5;
			Раздел1_П020 = Раздел1_П020 + ВыборкаОбороты.Графа7;
		КонецЦикла;
		
		Раздел1_П030 = ТаблицаУбытков[0].УбытокОтУплатыМинимальногоНалога;
		Раздел1_П040 = ?(Раздел1_П010 - Раздел1_П020 - Раздел1_П030 >= 0, Раздел1_П010 - Раздел1_П020 - Раздел1_П030, 0);
		Раздел1_П041 = ?(Раздел1_П010 - Раздел1_П020 - Раздел1_П030 >= 0, 0, Раздел1_П020 + Раздел1_П030 - Раздел1_П010);
		
		П010 = ТаблицаУбытков.Итог("СуммаНеПеренесенныхУбытков");
		П120 = Раздел1_П040;
		П130 = Мин(Раздел1_П040, П010);
		П140 = Раздел1_П041;
		П150 = П010 - П130 + П140;
		
		СуммаКРаспределениюПоСтрокам = П130;
		
		Для Каждого СтрокаУбытка Из ТаблицаУбытков Цикл
			ПараметрСтроки1 = Формат(1+СтрокаУбытка.НомерСтроки, "ЧЦ=2; ЧВН=");
			ПараметрСтроки2 = Формат(14+СтрокаУбытка.НомерСтроки, "ЧЦ=2; ЧВН=");
			Секция.Области["П"+ПараметрСтроки1+"01"].Текст = Прав(СтрокаУбытка.Год, 2);
			Секция.Области["П"+ПараметрСтроки1+"03"].Текст = СтрокаУбытка.СуммаНеПеренесенныхУбытков;
			
			СуммаУбыткаПоСтроке = Мин(СуммаКРаспределениюПоСтрокам, СтрокаУбытка.СуммаНеПеренесенныхУбытков);
			СуммаКРаспределениюПоСтрокам = СуммаКРаспределениюПоСтрокам - СуммаУбыткаПоСтроке;
			
			Если СтрокаУбытка.НомерСтроки > 1 Тогда
				Секция.Области["П"+ПараметрСтроки2+"01"].Текст = Прав(СтрокаУбытка.Год, 2);
				Секция.Области["П"+ПараметрСтроки2+"03"].Текст = СтрокаУбытка.СуммаНеПеренесенныхУбытков - СуммаУбыткаПоСтроке;
			Иначе
				//Убыток "сгорел" - прошло больше 10 лет
				Если СтрокаУбытка.СуммаНеПеренесенныхУбытков - СуммаУбыткаПоСтроке > 0 Тогда
					П150 = П150 - СтрокаУбытка.СуммаНеПеренесенныхУбытков - СуммаУбыткаПоСтроке
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Секция.Области["П2501"].Текст = Прав(ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(Перечисления.ДоступныеПериодыОтчета.Год, НачалоГода(ПараметрыОтчета.Период), КонецГода(ПараметрыОтчета.Период)), 2);
		Секция.Области["П2503"].Текст = Раздел1_П041;
		
		Секция.Области["П0103"].Текст = П010;
		Секция.Области["П1203"].Текст = П120;
		Секция.Области["П1303"].Текст = П130;
		Секция.Области["П1403"].Текст = П140;
		Секция.Области["П1503"].Текст = П150;
		
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(Секция);
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент, НСтр("ru = 'Раздел III. Расчет убытка'"));
	
КонецПроцедуры

Процедура ПечатьРазделаУменьшенияНалога(ПараметрыОтчета)
	
	Если ПараметрыОтчета.Период < ДатаНачалаФормирования4РазделаКУДиР()
		Или ПараметрыОтчета.Период > ДатаОтменыФормирования4РазделаКУДиР() Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.Автомасштаб         = Истина;
	ТабличныйДокумент.КлючПараметровПечати= "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_Раздел4";
	
	Макет = ПолучитьМакет("Раздел4");
	Секция = Макет.ПолучитьОбласть("Шапка");
	Секция.Параметры.ЗаПериод = ЗаголовокПериодНарастающимИтогом(ПараметрыОтчета.Период);
	ТабличныйДокумент.Вывести(Секция);
	
	НачДата = НачалоКвартала(ПараметрыОтчета.НачалоПериода);
	КолКварталов = НомерКвартала(ПараметрыОтчета.Период);
	
	НПП = 1;
	
	ВыборкаКоличествоЗаписей = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "КоличествоЗаписейРазделаУменьшенияНалогаДоНачалаОтчета");
	Если ВыборкаКоличествоЗаписей <> Неопределено Тогда
		Пока ВыборкаКоличествоЗаписей.Следующий() Цикл
			НПП = НПП + ВыборкаКоличествоЗаписей.КоличествоСтрок;
		КонецЦикла;
	КонецЕсли;
	
	ТекКвартал              = НомерКвартала(НачДата);
	ПоследнийКварталПериода = НомерКвартала(ПараметрыОтчета.Период);
	
	ВыборкаЗаписей = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "ЗаписиРазделУменьшенияНалога");
	
	Пока ВыборкаЗаписей.Следующий() Цикл
		
		КварталЗаписи = КварталЗаписи(ВыборкаЗаписей.ПериодЗаписи, ПараметрыОтчета);
		
		Пока КварталЗаписи <> ТекКвартал Цикл
			
			ВывестиУменьшенияНалогаЗаКвартал(ПараметрыОтчета, ТекКвартал, ПоследнийКварталПериода, Макет, ТабличныйДокумент);
			ТекКвартал = ТекКвартал + 1;
			
		КонецЦикла;
		
		Секция = Макет.ПолучитьОбласть("Строка");
		Секция.Параметры.НомерПП = НПП;
		Секция.Параметры.Заполнить(ВыборкаЗаписей);
		
		Секция.Параметры.ПериодНачисленияПредставление = Формат(ВыборкаЗаписей.ПериодНачисления, "ДФ='ММММ гггг'");
		
		Секция.Параметры.ИтогоВзносов = ВыборкаЗаписей.ПФР + ВыборкаЗаписей.ФСС
			+ ВыборкаЗаписей.ФОМС + ВыборкаЗаписей.ФСС_НС
			+ ВыборкаЗаписей.Больничные + ВыборкаЗаписей.Дстрах;
		
		НПП = НПП + 1;
		ТабличныйДокумент.Вывести(Секция);
		
	КонецЦикла;
	
	Пока ПоследнийКварталПериода >= ТекКвартал Цикл
		
		ВывестиУменьшенияНалогаЗаКвартал(ПараметрыОтчета, ТекКвартал, ПоследнийКварталПериода, Макет, ТабличныйДокумент);
		ТекКвартал = ТекКвартал + 1;
		
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент, НСтр("ru = 'Раздел IV. Уменьшение налога'"));
	
КонецПроцедуры

Процедура ПечатьРазделаТорговогоСбора(ПараметрыОтчета)
	
	Если ПараметрыОтчета.Период < ДатаНачалаФормирования5РазделаКУДиР() Тогда
		Возврат;
	КонецЕсли;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.Автомасштаб         = Истина;
	ТабличныйДокумент.КлючПараметровПечати= "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_Раздел5";
	
	Макет  = МакетРазделаТорговогоСбора(ПараметрыОтчета.Период);
	Секция = Макет.ПолучитьОбласть("Шапка");
	Если ПараметрыОтчета.Период < ДатаОтменыФормирования4РазделаКУДиР() Тогда
		Секция.Параметры.ЗаПериод = ЗаголовокПериодНарастающимИтогом(ПараметрыОтчета.Период);
		ИмяЛиста = НСтр("ru = 'Раздел V. Уплаченный торговый сбор'");
	Иначе
		ИмяЛиста = НСтр("ru = 'Раздел IV. Уплаченный торговый сбор'");
	КонецЕсли;
	ТабличныйДокумент.Вывести(Секция);
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	
	ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент, ИмяЛиста);
	
КонецПроцедуры

Функция МакетТитульногоЛиста(Период)
	
	Если Период >= Дата("20240101") Тогда
		Макет = ПолучитьМакет("ТитульныйЛист_178н");
	ИначеЕсли Период >= Дата("20130101") Тогда
		Макет = ПолучитьМакет("ТитульныйЛист_135н");
		Макет.Параметры.РедакцияПриказаМинфина = РедакцияПриказаМинфина135н(Период);
	Иначе
		Макет = ПолучитьМакет("ТитульныйЛист_154н");
	КонецЕсли;
	
	Возврат Макет;
	
КонецФункции

Функция МакетРаздела2(Период)
	
	Если Период >= Дата("20240101") Тогда
		Макет = ПолучитьМакет("Раздел2_178н");
	ИначеЕсли Период >= Дата("20130101") Тогда
		Макет = ПолучитьМакет("Раздел2_135н");
	Иначе
		Макет = ПолучитьМакет("Раздел2_154н");
	КонецЕсли;
	
	Возврат Макет;
	
КонецФункции

Функция МакетРаздела3(Период)
	
	Если Период >= Дата("20240101") Тогда
		Макет = ПолучитьМакет("Раздел3_178н");
	ИначеЕсли Период >= Дата("20130101") Тогда
		Макет = ПолучитьМакет("Раздел3_135н");
		Макет.Параметры.ЗаПериод = ЗаголовокПериодНарастающимИтогом(Период);
	Иначе
		Макет = ПолучитьМакет("Раздел3_154н");
		Макет.Параметры.ЗаПериод = ЗаголовокПериодНарастающимИтогом(Период);
	КонецЕсли;
	
	Возврат Макет;
	
КонецФункции

Функция МакетРазделаТорговогоСбора(Период)
	
	Если Период >= Дата("20240101") Тогда
		Макет = ПолучитьМакет("Раздел4_178н");
	Иначе
		Макет = ПолучитьМакет("Раздел5");
	КонецЕсли;
	
	Возврат Макет;
	
КонецФункции

Функция РедакцияПриказаМинфина135н(Период)
	
	Если Период >= ДатаНачалаФормирования5РазделаКУДиР() Тогда
		// На титульном листе требуется указать дату и номер приказа, добавившего 5 раздел.
		Возврат НСтр("ru = '(в ред. Приказа Минфина России от 07.12.2016 № 227н)'");
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЗаголовокПериодНарастающимИтогом(Период) Экспорт
	
	Возврат СтрШаблон(НСтр("ru = 'за %1'"),
		ПредставлениеПериода(НачалоГода(Период), КонецКвартала(Период), "ФП = Истина"));
	
КонецФункции

Процедура ВывестиИтогиЗаКвартал(ПараметрыОтчета, ТекКвартал, ПоследнийКварталПериода, Макет, ТабличныйДокумент)
	
	Секция = Макет.ПолучитьОбласть("Итого|Основная");
	РимскоеЧисло = ТекКвартал;
	Секция.Параметры.ПечТекстИтогов = СтрШаблон(
		НСтр("ru = 'Итого за %1 квартал'"),
		СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(РимскоеЧисло, Ложь));
	ТабличныйДокумент.Вывести(Секция);
	
	Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "Итого|Режим3","Итого|Режим12"));
	
	ИтогПечДоходыБУ  = 0;
	ИтогПечРасходыБУ = 0;
	ИтогПечДоходы    = 0;
	ИтогПечРасходы   = 0;
	ПечДоходыБУ      = 0;
	ПечРасходыБУ     = 0;
	ПечДоходы        = 0;
	ПечРасходы       = 0;
	
	ВыборкаОбороты = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "ОборотыРаздела1ПоКварталам", Истина);
	
	Пока ВыборкаОбороты.Следующий() Цикл
		Если НомерКвартала(ВыборкаОбороты.Период) > ТекКвартал Тогда
			Прервать;
		КонецЕсли;
		ИтогПечДоходыБУ  = ИтогПечДоходыБУ + ВыборкаОбороты.Графа4;
		ИтогПечРасходыБУ = ИтогПечРасходыБУ + ВыборкаОбороты.Графа6;
		ИтогПечДоходы    = ИтогПечДоходы + ВыборкаОбороты.Графа5;
		ИтогПечРасходы   = ИтогПечРасходы + ВыборкаОбороты.Графа7;
		Если НомерКвартала(ВыборкаОбороты.Период) = ТекКвартал Тогда
			ПечДоходыБУ  = ВыборкаОбороты.Графа4;
			ПечРасходыБУ = ВыборкаОбороты.Графа6;
			ПечДоходы    = ВыборкаОбороты.Графа5;
			ПечРасходы   = ВыборкаОбороты.Графа7;
		КонецЕсли;
	КонецЦикла;
	
	Если ПараметрыОтчета.РежимПечатиГраф4и6 < 2 Тогда
		Секция.Параметры.ПечДоходыБУ = ПечДоходыБУ;
		Секция.Параметры.ПечРасходыБУ = ПечРасходыБУ;
	КонецЕсли;
	Секция.Параметры.ПечДоходы  = ПечДоходы;
	Секция.Параметры.ПечРасходы = ПечРасходы;
	ТабличныйДокумент.Присоединить(Секция);
	
	Если ТекКвартал <> 1 Тогда
		Секция = Макет.ПолучитьОбласть("Итого|Основная");
		Секция.Параметры.ПечТекстИтогов = СтрШаблон(
			НСтр("ru = 'Итого за %1'"),
			НазваниеПериодаНарастающимИтогом(ТекКвартал));
		ТабличныйДокумент.Вывести(Секция);
		
		Секция = Макет.ПолучитьОбласть(?(ПараметрыОтчета.РежимПечатиГраф4и6 = 3, "Итого|Режим3","Итого|Режим12"));
		Если ПараметрыОтчета.РежимПечатиГраф4и6 < 2 Тогда
			Секция.Параметры.ПечДоходыБУ = ИтогПечДоходыБУ;
			Секция.Параметры.ПечРасходыБУ = ИтогПечРасходыБУ;
		КонецЕсли;
		Секция.Параметры.ПечДоходы = ИтогПечДоходы;
		Секция.Параметры.ПечРасходы = ИтогПечРасходы;
		ТабличныйДокумент.Присоединить(Секция);
	КонецЕсли;
	
	Если ТекКвартал <> ПоследнийКварталПериода Тогда
		
		УстановитьШиринуКолонкиСодержание(ПараметрыОтчета, Макет, ТабличныйДокумент);
		
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		ТабличныйДокумент.ПовторятьПриПечатиСтроки = ТабличныйДокумент.Область(6,,6,);
		
		ПараметрыОтчета.СписокСформированныхЛистов.Добавить(ТабличныйДокумент,
			СтрШаблон(НСтр("ru = 'Раздел I. Доходы и расходы за %1 кв.'"), ТекКвартал));
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
		ТабличныйДокумент.Автомасштаб         = Истина;
		ТабличныйДокумент.КлючПараметровПечати= "ПАРАМЕТРЫ_ПЕЧАТИ_КнигаУчетаДоходовИРасходов_Раздел1";
		
		ВывестиШапкуРаздела1(ПараметрыОтчета, ТабличныйДокумент, Макет);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиУменьшенияНалогаЗаКвартал(ПараметрыОтчета, ТекКвартал, ПоследнийКварталПериода, Макет, ТабличныйДокумент)
	
	Секция = Макет.ПолучитьОбласть("Итог");
	РимскоеЧисло = ТекКвартал;
	Секция.Параметры.ПредставлениеПериодаИтогов = СтрШаблон(
		НСтр("ru = 'Итого за %1 квартал'"),
		СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(РимскоеЧисло, Ложь));
	
	ТекущийКвартал 		= Новый Структура("ПФР, ФСС, ФОМС, ФСС_НС, Больничные, Дстрах, ИтогоВзносов", 0, 0, 0, 0, 0, 0, 0);
	НарастающимИтогом 	= Новый Структура("ПФР, ФСС, ФОМС, ФСС_НС, Больничные, Дстрах, ИтогоВзносов", 0, 0, 0, 0, 0, 0, 0);
	
	ВыборкаИтоги = ПолучитьВыборкуДанных(ПараметрыОтчета.ДанныеОтчета, "ОборотыРазделаУменьшенияНалогаПоКварталам", Истина);
	
	Пока ВыборкаИтоги.Следующий() Цикл
	
		Если НомерКвартала(ВыборкаИтоги.Квартал) > ТекКвартал Тогда
			Прервать;
		КонецЕсли;
		НарастающимИтогом.ПФР        = НарастающимИтогом.ПФР + ВыборкаИтоги.ПФР;
		НарастающимИтогом.ФСС        = НарастающимИтогом.ФСС + ВыборкаИтоги.ФСС;
		НарастающимИтогом.ФОМС       = НарастающимИтогом.ФОМС + ВыборкаИтоги.ФОМС;
		НарастающимИтогом.ФСС_НС     = НарастающимИтогом.ФСС_НС + ВыборкаИтоги.ФСС_НС;
		НарастающимИтогом.Больничные = НарастающимИтогом.Больничные + ВыборкаИтоги.Больничные;
		НарастающимИтогом.Дстрах     = НарастающимИтогом.Дстрах + ВыборкаИтоги.Дстрах;
		
		НарастающимИтогом.ИтогоВзносов = НарастающимИтогом.ИтогоВзносов
			+ ВыборкаИтоги.ПФР + ВыборкаИтоги.ФСС
			+ ВыборкаИтоги.ФОМС + ВыборкаИтоги.ФСС_НС
			+ ВыборкаИтоги.Больничные + ВыборкаИтоги.Дстрах;
		
		Если НомерКвартала(ВыборкаИтоги.Квартал) = ТекКвартал Тогда
			ЗаполнитьЗначенияСвойств(ТекущийКвартал, ВыборкаИтоги);
			ТекущийКвартал.ИтогоВзносов = ВыборкаИтоги.ПФР + ВыборкаИтоги.ФСС
			+ ВыборкаИтоги.ФОМС + ВыборкаИтоги.ФСС_НС
			+ ВыборкаИтоги.Больничные + ВыборкаИтоги.Дстрах;
		КонецЕсли;
	КонецЦикла;
	
	Секция.Параметры.Заполнить(ТекущийКвартал);
	ТабличныйДокумент.Вывести(Секция);

	Если ТекКвартал <> 1 Тогда
		Секция = Макет.ПолучитьОбласть("Итог");
		Секция.Параметры.ПредставлениеПериодаИтогов = СтрШаблон(
			НСтр("ru = 'Итого за %1'"),
			НазваниеПериодаНарастающимИтогом(ТекКвартал));
		Секция.Параметры.Заполнить(НарастающимИтогом);
		ТабличныйДокумент.Вывести(Секция);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьШиринуКолонкиСодержание(ПараметрыОтчета, Макет, ТабличныйДокумент)

	// Если графы 4 и 6 скрыты - можно за их счет расширить Содержание
	Если ПараметрыОтчета.РежимПечатиГраф4и6 = 3 Тогда
		
		ШиринаСодержания = Макет.Область(,4,,4).ШиринаКолонки;
		ШиринаГраф4и6 = ШиринаОбласти(Макет.ПолучитьОбласть("Шапка|Режим12"))
			- ШиринаОбласти(Макет.ПолучитьОбласть("Шапка|Режим3"));
			
		ТабличныйДокумент.Область(,4,,4).ШиринаКолонки = ШиринаСодержания + ШиринаГраф4и6;
		
		// Заголовок раздела нужно сдвинуть в центр
		ТабличныйДокумент.Область(2,2,2,2).Отступ = 20;
		
	КонецЕсли;

КонецПроцедуры

// Возвращает суммарную ширину всех колонок переданного табличного документа
// в так называемых средних символах шрифта
// (см. также описание свойства ШиринаКолонки объекта ОбластьЯчеекТабличногоДокумента)
//
Функция ШиринаОбласти(ТабличныйДокумент)
	
	Если ТипЗнч(ТабличныйДокумент) <> Тип("ТабличныйДокумент")
		Или ТабличныйДокумент.ШиринаТаблицы = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Ширина = 0;
	
	Индекс = 0;
	Для Индекс = 1 По ТабличныйДокумент.ШиринаТаблицы Цикл
		Ширина = Ширина + ТабличныйДокумент.Область(,Индекс,,Индекс).ШиринаКолонки;
	КонецЦикла;
	
	Возврат Ширина;
	
КонецФункции

Функция ВыделятьНДС(ПараметрыОтчета)
	
	Возврат ПараметрыОтчета.ПрименяетсяУСНДоходыМинусРасходы
		И ПараметрыОтчета.РасходыНаНДСПоОплатеПоставщику;
	
КонецФункции

Функция НомерКвартала(ДатаВКвартале)
	
	Возврат Цел(Месяц(КонецКвартала(ДатаВКвартале))/3);
	
КонецФункции

Функция КварталЗаписи(ПериодЗаписи, ПараметрыОтчета)
	
	Если ПараметрыОтчета.НалоговыйПериодРасширен И ПериодЗаписи < НачалоГода(ПараметрыОтчета.Период) Тогда
		// Записи месяца регистрации (декабря) в случае расширенного налогового периода
		// отражаются в КУДиР первым кварталом следующего года.
		Возврат 1;
	Иначе
		Возврат НомерКвартала(ПериодЗаписи);
	КонецЕсли;
	
КонецФункции

Функция НазваниеПериодаНарастающимИтогом(НомерКвартала)

	ПредставлениеПериода = "";
	
	Если НомерКвартала = 2 Тогда
		ПредставлениеПериода = НСтр("ru = 'полугодие'");
	ИначеЕсли НомерКвартала = 3 Тогда
		ПредставлениеПериода = НСтр("ru = '9 месяцев'");
	ИначеЕсли НомерКвартала = 4 Тогда
		ПредставлениеПериода = НСтр("ru = 'год'");
	КонецЕсли;
	
	Возврат ПредставлениеПериода;

КонецФункции

Функция ПолучитьВыборкуДанных(ДанныеОтчета, ИмяРезультатаЗапроса, Сохранять = Ложь)
	
	Если Не ДанныеОтчета.Свойство(ИмяРезультатаЗапроса) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверное имя таблицы результата запроса: %1'"),
			ИмяРезультатаЗапроса);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Выборка = Неопределено;
	
	Если ДанныеОтчета.Свойство("Выборка" + ИмяРезультатаЗапроса) Тогда // Выборка получена
		Выборка = ДанныеОтчета["Выборка" + ИмяРезультатаЗапроса];
		Выборка.Сбросить();
	ИначеЕсли ДанныеОтчета[ИмяРезультатаЗапроса] <> Неопределено Тогда // Выборка не получена, есть результат запроса
		Выборка = ДанныеОтчета[ИмяРезультатаЗапроса].Выбрать();
		Если Сохранять Тогда
			ДанныеОтчета.Вставить("Выборка" + ИмяРезультатаЗапроса, Выборка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Выборка;
	
КонецФункции

Функция ПолучитьТаблицуДанных(ДанныеОтчета, ИмяРезультатаЗапроса, Сохранять = Ложь)
	
	Если Не ДанныеОтчета.Свойство(ИмяРезультатаЗапроса) Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Неверное имя таблицы результата запроса: %1'"),
			ИмяРезультатаЗапроса);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Таблица = Неопределено;
	
	Если ДанныеОтчета.Свойство("Таблица" + ИмяРезультатаЗапроса) Тогда // Таблица получена
		Таблица = ДанныеОтчета["Таблица" + ИмяРезультатаЗапроса];
	ИначеЕсли ДанныеОтчета[ИмяРезультатаЗапроса] <> Неопределено Тогда // Таблица не получена, есть результат запроса
		Таблица = ДанныеОтчета[ИмяРезультатаЗапроса].Выгрузить();
		Если Сохранять Тогда
			ДанныеОтчета.Вставить("Таблица" + ИмяРезультатаЗапроса, Таблица);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция ПодготовитьДанныеОтчета(ПараметрыОтчета)
	
	ДанныеОтчета = Новый Структура;
	
	НомераТаблиц = Новый Структура;
	
	Запрос = Новый Запрос;
	
	НачалоНалоговогоПериода = ПараметрыОтчета.НачалоНалоговогоПериода;
	
	Если НачалоКвартала(ПараметрыОтчета.НачалоПериода) = НачалоГода(ПараметрыОтчета.Период) Тогда
		НачалоПериодаОтчета = НачалоНалоговогоПериода;
	Иначе
		НачалоПериодаОтчета = НачалоКвартала(ПараметрыОтчета.НачалоПериода);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода",            НачалоПериодаОтчета);
	Запрос.УстановитьПараметр("КонецПериода",             КонецКвартала(ПараметрыОтчета.КонецПериода));
	Запрос.УстановитьПараметр("Организация",              ПараметрыОтчета.Организация);
	Запрос.УстановитьПараметр("НачалоНалоговогоПериода",  НачалоНалоговогоПериода);
	Запрос.УстановитьПараметр("НачалоКварталаОтчета",     НачалоКвартала(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("КонецГода",                КонецГода(ПараметрыОтчета.Период));
	Запрос.УстановитьПараметр("КонецПредыдущегоКвартала", НачалоКвартала(ПараметрыОтчета.Период) - 1);
	Запрос.УстановитьПараметр("НалоговыйПериодРасширен",  ПараметрыОтчета.НалоговыйПериодРасширен);
	Запрос.УстановитьПараметр("ПустаяДата",               Дата("00010101"));
	
	ВыделятьНДС = ВыделятьНДС(ПараметрыОтчета);
	
	Запрос.УстановитьПараметр("СчетчикСтрокНДС",
		?(НЕ ВыделятьНДС И ПараметрыОтчета.РежимПечатиНДС = 2, 1, 0));
	
	Запрос.Текст = ТекстЗапросаБанковскиеСчета(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаПодсчетСтрокРаздела1ДоТекущегоКвартала(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаПодсчетСтрокРазделаУменьшенияНалогаДоТекущегоКвартала(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаОборотыРаздела1ПоКварталам(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаОборотыРазделаУменьшенияНалогаПоКварталам(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаЗаписиРаздел1(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаЗаписиРасшифровкиРаздел1(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаЗаписиРаздел2(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаУбыткиРаздел3(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		+ ТекстЗапросаЗаписиРазделУменьшенияНалога(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
		;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ДанныеОтчета.Вставить(НомерТаблицы.Ключ, РезультатыЗапроса[НомерТаблицы.Значение]);
	КонецЦикла;
	
	Возврат ДанныеОтчета;
	
КонецФункции

Функция ТекстЗапросаБанковскиеСчета(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	НомераТаблиц.Вставить("БанковскиеСчета", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	РеквизитыЛицевыхСчетов.Ссылка КАК РеквизитыЛицевогоСчета
	|ИЗ
	|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЛицевыеСчета КАК ЛицевыеСчета
	|		ПО РеквизитыЛицевыхСчетов.Владелец = ЛицевыеСчета.Ссылка
	|ГДЕ
	|	ЛицевыеСчета.Владелец = &Организация
	|	И НЕ ЛицевыеСчета.ПометкаУдаления
	|	И НЕ РеквизитыЛицевыхСчетов.ПометкаУдаления
	|	И (ЛицевыеСчета.ДатаОткрытия = &ПустаяДата
	|			ИЛИ ЛицевыеСчета.ДатаОткрытия <= &КонецГода)
	|	И (ЛицевыеСчета.ДатаЗакрытия = &ПустаяДата
	|			ИЛИ ЛицевыеСчета.ДатаЗакрытия >= &НачалоНалоговогоПериода)";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаПодсчетСтрокРаздела1ДоТекущегоКвартала(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	Если НачалоКвартала(ПараметрыОтчета.НачалоПериода) = НачалоГода(ПараметрыОтчета.НачалоПериода) Тогда
		// Не нужно подсчитывать предыдущие записи
		ДанныеОтчета.Вставить("КоличествоЗаписейРаздела1ДоНачалаОтчета", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("КоличествоЗаписейРаздела1ДоНачалаОтчета", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА КнигаУчетаДоходовИРасходов.НДС <> 0
	|					ТОГДА &СчетчикСтрокНДС
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК КоличествоСтрокНДС
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
	|ГДЕ
	|	КнигаУчетаДоходовИРасходов.Период МЕЖДУ &НачалоНалоговогоПериода И &КонецПредыдущегоКвартала
	|	И КнигаУчетаДоходовИРасходов.Активность
	|	И КнигаУчетаДоходовИРасходов.Организация = &Организация
	|	И &УсловиеНенулевыеДоходыРасходыНУ"
	;
	
	Если ПараметрыОтчета.РежимПечатиГраф4и6 = 1 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеНенулевыеДоходыРасходыНУ", "ИСТИНА");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&УсловиеНенулевыеДоходыРасходыНУ",
			"(КнигаУчетаДоходовИРасходов.ДоходыУСН <> 0 ИЛИ КнигаУчетаДоходовИРасходов.РасходыУСН <> 0)");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаПодсчетСтрокРазделаУменьшенияНалогаДоТекущегоКвартала(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	Если ПараметрыОтчета.Период < ДатаНачалаФормирования4РазделаКУДиР()
		Или ПараметрыОтчета.Период > ДатаОтменыФормирования4РазделаКУДиР() Тогда
		ДанныеОтчета.Вставить("КоличествоЗаписейРазделаУменьшенияНалогаДоНачалаОтчета", Неопределено);
		Возврат "";
	КонецЕсли;
	
	Если НачалоКвартала(ПараметрыОтчета.НачалоПериода) = НачалоГода(ПараметрыОтчета.НачалоПериода) Тогда
		// Не нужно подсчитывать предыдущие записи
		ДанныеОтчета.Вставить("КоличествоЗаписейРазделаУменьшенияНалогаДоНачалаОтчета", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("КоличествоЗаписейРазделаУменьшенияНалогаДоНачалаОтчета", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок
	|ИЗ
	|	Документ.ЗаписьКУДиР.УменьшениеНалога КАК УменьшениеНалога
	|ГДЕ
	|	УменьшениеНалога.Ссылка.Дата МЕЖДУ &НачалоНалоговогоПериода И &КонецПредыдущегоКвартала
	|	И УменьшениеНалога.Ссылка.Организация = &Организация
	|	И УменьшениеНалога.Ссылка.Проведен";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаОборотыРаздела1ПоКварталам(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	НомераТаблиц.Вставить("ОборотыРаздела1ПоКварталам", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &НалоговыйПериодРасширен
	|				И ГОД(КнигаУчетаДоходовИРасходовОбороты.Период) < ГОД(&КонецПериода)
	|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(КнигаУчетаДоходовИРасходовОбороты.Период, КВАРТАЛ)
	|	КОНЕЦ КАК Период,
	|	СУММА(КнигаУчетаДоходовИРасходовОбороты.ДоходыВсегоОборот) КАК Графа4,
	|	СУММА(КнигаУчетаДоходовИРасходовОбороты.ДоходыУСНОборот) КАК Графа5,
	|	СУММА(КнигаУчетаДоходовИРасходовОбороты.РасходыВсегоОборот) КАК Графа6,
	|	СУММА(КнигаУчетаДоходовИРасходовОбороты.РасходыУСНОборот) КАК Графа7
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходов.Обороты(&НачалоНалоговогоПериода, &КонецПериода, Квартал, Организация = &Организация) КАК КнигаУчетаДоходовИРасходовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &НалоговыйПериодРасширен
	|				И ГОД(КнигаУчетаДоходовИРасходовОбороты.Период) < ГОД(&КонецПериода)
	|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(КнигаУчетаДоходовИРасходовОбороты.Период, КВАРТАЛ)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаОборотыРазделаУменьшенияНалогаПоКварталам(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	Если ПараметрыОтчета.Период < ДатаНачалаФормирования4РазделаКУДиР()
		Или ПараметрыОтчета.Период > ДатаОтменыФормирования4РазделаКУДиР() Тогда
		ДанныеОтчета.Вставить("ОборотыРазделаУменьшенияНалогаПоКварталам", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ОборотыРазделаУменьшенияНалогаПоКварталам", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СУММА(УменьшениеНалога.ПФР) КАК ПФР,
	|	СУММА(УменьшениеНалога.ФСС) КАК ФСС,
	|	СУММА(УменьшениеНалога.ФОМС) КАК ФОМС,
	|	СУММА(УменьшениеНалога.ФСС_НС) КАК ФСС_НС,
	|	СУММА(УменьшениеНалога.Больничные) КАК Больничные,
	|	СУММА(УменьшениеНалога.ДобровольноеСтрахование) КАК Дстрах,
	|	ВЫБОР
	|		КОГДА &НалоговыйПериодРасширен
	|				И ГОД(УменьшениеНалога.Ссылка.Дата) < ГОД(&КонецПериода)
	|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(УменьшениеНалога.Ссылка.Дата, КВАРТАЛ)
	|	КОНЕЦ КАК Квартал
	|ИЗ
	|	Документ.ЗаписьКУДиР.УменьшениеНалога КАК УменьшениеНалога
	|ГДЕ
	|	УменьшениеНалога.Ссылка.Дата МЕЖДУ &НачалоНалоговогоПериода И &КонецПериода
	|	И УменьшениеНалога.Ссылка.Организация = &Организация
	|	И УменьшениеНалога.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &НалоговыйПериодРасширен
	|				И ГОД(УменьшениеНалога.Ссылка.Дата) < ГОД(&КонецПериода)
	|			ТОГДА НАЧАЛОПЕРИОДА(&КонецПериода, ГОД)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(УменьшениеНалога.Ссылка.Дата, КВАРТАЛ)
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Квартал";
	;
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаЗаписиРаздел1(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	НомераТаблиц.Вставить("ЗаписиРаздел1", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КнигаУчетаДоходовИРасходов.Период КАК Период,
	|	КнигаУчетаДоходовИРасходов.Регистратор КАК Регистратор,
	|	КнигаУчетаДоходовИРасходов.НДС КАК НДС,
	|	КнигаУчетаДоходовИРасходов.Содержание КАК Содержание,
	|	КнигаУчетаДоходовИРасходов.РеквизитыПервичногоДокумента КАК РеквизитыПервичногоДокумента,
	|	КнигаУчетаДоходовИРасходов.КлючЗаписиКУДиР КАК КлючЗаписиКУДиР,
	|	КнигаУчетаДоходовИРасходов.ВидРасхода КАК ВидРасхода,
	|	КнигаУчетаДоходовИРасходов.ДоходыВсего КАК Графа4,
	|	КнигаУчетаДоходовИРасходов.ДоходыУСН КАК Графа5,
	|	КнигаУчетаДоходовИРасходов.РасходыВсего КАК Графа6,
	|	КнигаУчетаДоходовИРасходов.РасходыУСН КАК Графа7
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
	|ГДЕ
	|	КнигаУчетаДоходовИРасходов.Организация = &Организация
	|	И КнигаУчетаДоходовИРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И КнигаУчетаДоходовИРасходов.Активность
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	КнигаУчетаДоходовИРасходов.Регистратор,
	|	КнигаУчетаДоходовИРасходов.НомерСтроки"
	;
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаЗаписиРасшифровкиРаздел1(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	Если НЕ ПараметрыОтчета.ВыводитьРасшифровки Тогда
		ДанныеОтчета.Вставить("ЗаписиРасшифровкиРаздел1", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ЗаписиРасшифровкиРаздел1", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасшифровкаКУДиР.Период КАК Период,
	|	РасшифровкаКУДиР.Регистратор КАК Регистратор,
	|	РасшифровкаКУДиР.ВидРасхода КАК ВидРасхода,
	|	РасшифровкаКУДиР.КлючЗаписиКУДиР КАК КлючЗаписиКУДиР,
	|	РасшифровкаКУДиР.НомерСтрокиРасшифровки КАК НомерСтрокиРасшифровки,
	|	РасшифровкаКУДиР.Содержание КАК Содержание,
	|	РасшифровкаКУДиР.ДокументПоступленияРасходов КАК ДокументПоступленияРасходов,
	|	РасшифровкаКУДиР.ДокументОплатыРасходов КАК ДокументОплатыРасходов,
	|	РасшифровкаКУДиР.РасходыУСН КАК Графа7
	|ИЗ
	|	РегистрСведений.РасшифровкаКУДиР КАК РасшифровкаКУДиР
	|ГДЕ
	|	РасшифровкаКУДиР.Организация = &Организация
	|	И РасшифровкаКУДиР.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РасшифровкаКУДиР.Активность
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасшифровкаКУДиР.Период,
	|	Регистратор,
	|	НомерСтрокиРасшифровки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаЗаписиРаздел2(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	НомераТаблиц.Вставить("ЗаписиРаздел2", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КнигаУчетаДоходовИРасходовОСиНМА.ОсновноеСредство КАК ОсновноеСредство,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДокументМодернизации КАК ДокументМодернизации,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаОплаты КАК ДатаОплаты,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаПодачиДокументовНаГосРегистрацию КАК ДатаПодачиДокументовНаГосРегистрацию,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаВыбытия КАК ДатаВыбытия,
	|	КнигаУчетаДоходовИРасходовОСиНМА.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	КнигаУчетаДоходовИРасходовОСиНМА.КоличествоКварталовВНалоговомПериоде КАК КоличествоКварталовВНалоговомПериоде,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДоляСтоимостиЗаНалоговыйПериод КАК ДоляСтоимостиЗаНалоговыйПериод,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДоляСтоимостиЗаКвартал КАК ДоляСтоимостиЗаКвартал,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМА.ПервоначальнаяСтоимость) КАК ПервоначальнаяСтоимость,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМА.ОстаточнаяСтоимость) КАК ОстаточнаяСтоимость,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМА.СуммаРасходовЗаНалоговыйПериод) КАК СуммаРасходовЗаНалоговыйПериод,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМА.СуммаРасходовЗаКвартал) КАК СуммаРасходовЗаКвартал,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМА.РасходыПрошлыхПериодов) КАК РасходыПрошлыхПериодов,
	|	СУММА(КнигаУчетаДоходовИРасходовОСиНМА.ОставшаясяЧастьРасходов) КАК ОставшаясяЧастьРасходов,
	|	"""" КАК ИнвентарныйНомер
	|ИЗ
	|	РегистрНакопления.КнигаУчетаДоходовИРасходовОСиНМА КАК КнигаУчетаДоходовИРасходовОСиНМА
	|ГДЕ
	|	КнигаУчетаДоходовИРасходовОСиНМА.Период МЕЖДУ &НачалоКварталаОтчета И &КонецПериода
	|	И КнигаУчетаДоходовИРасходовОСиНМА.Организация = &Организация
	|	И КнигаУчетаДоходовИРасходовОСиНМА.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	КнигаУчетаДоходовИРасходовОСиНМА.ОсновноеСредство,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДокументМодернизации,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаОплаты,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаВводаВЭксплуатацию,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаПодачиДокументовНаГосРегистрацию,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДатаВыбытия,
	|	КнигаУчетаДоходовИРасходовОСиНМА.СрокПолезногоИспользования,
	|	КнигаУчетаДоходовИРасходовОСиНМА.КоличествоКварталовВНалоговомПериоде,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДоляСтоимостиЗаНалоговыйПериод,
	|	КнигаУчетаДоходовИРасходовОСиНМА.ДоляСтоимостиЗаКвартал
	|
	|УПОРЯДОЧИТЬ ПО
	|	КнигаУчетаДоходовИРасходовОСиНМА.ОсновноеСредство.Наименование,
	|	ДатаОплаты";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаУбыткиРаздел3(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	НомераТаблиц.Вставить("УбыткиРаздел3", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РегистрацияСуммыУбыткаУСН.Ссылка КАК Ссылка,
	|	РегистрацияСуммыУбыткаУСН.НомерСтроки КАК НомерСтроки,
	|	РегистрацияСуммыУбыткаУСН.Год КАК Год,
	|	РегистрацияСуммыУбыткаУСН.СуммаНеПеренесенныхУбытков КАК СуммаНеПеренесенныхУбытков,
	|	РегистрацияСуммыУбыткаУСН.Ссылка.УбытокОтУплатыМинимальногоНалога КАК УбытокОтУплатыМинимальногоНалога,
	|	РегистрацияСуммыУбыткаУСН.Ссылка.Проведен КАК Проведен
	|ИЗ
	|	Документ.РегистрацияСуммыУбыткаУСН.Убытки КАК РегистрацияСуммыУбыткаУСН
	|ГДЕ
	|	РегистрацияСуммыУбыткаУСН.Ссылка.Организация = &Организация
	|	И РегистрацияСуммыУбыткаУСН.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&КонецПериода, ГОД) И КОНЕЦПЕРИОДА(&КонецПериода, ГОД)
	|	И РегистрацияСуммыУбыткаУСН.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ТекстЗапросаЗаписиРазделУменьшенияНалога(НомераТаблиц, ДанныеОтчета, ПараметрыОтчета)
	
	Если ПараметрыОтчета.Период < ДатаНачалаФормирования4РазделаКУДиР()
		Или ПараметрыОтчета.Период > ДатаОтменыФормирования4РазделаКУДиР() Тогда
		ДанныеОтчета.Вставить("ЗаписиРазделУменьшенияНалога", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ЗаписиРазделУменьшенияНалога", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	УменьшениеНалога.ДатаНомер,
	|	УменьшениеНалога.Ссылка.Дата КАК ПериодЗаписи,
	|	УменьшениеНалога.ПериодНачисления КАК ПериодНачисления,
	|	УменьшениеНалога.ПФР КАК ПФР,
	|	УменьшениеНалога.ФСС КАК ФСС,
	|	УменьшениеНалога.ФОМС КАК ФОМС,
	|	УменьшениеНалога.ФСС_НС КАК ФСС_НС,
	|	УменьшениеНалога.Больничные КАК Больничные,
	|	УменьшениеНалога.ДобровольноеСтрахование КАК ДСтрах
	|ИЗ
	|	Документ.ЗаписьКУДиР.УменьшениеНалога КАК УменьшениеНалога
	|ГДЕ
	|	УменьшениеНалога.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И УменьшениеНалога.Ссылка.Организация = &Организация
	|	И УменьшениеНалога.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодЗаписи,
	|	ПериодНачисления,
	|	УменьшениеНалога.НомерСтроки";
	
	Возврат ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

Функция ДатаНачалаФормирования4РазделаКУДиР() Экспорт
	
	Возврат Дата(2013, 1, 1);
	
КонецФункции

// Дата, с которой отменяется формирование раздела IV "Уменьшение налога" Книги учета доходов и расходов.
// Приказ ФНС России от 07.11.2023 № ЕА-7-3/816@
// "Об утверждении форм книги учета доходов и расходов организаций
// и индивидуальных предпринимателей, применяющих упрощенную систему налогообложения,
// книги учета доходов индивидуальных предпринимателей, применяющих патентную систему
// налогообложения, и порядков их заполнения"
// 
// Возвращаемое значение:
//  Дата - 01 января 2024 года
//
Функция ДатаОтменыФормирования4РазделаКУДиР() Экспорт
	
	// Приказ ФНС России от 07.11.2023 № ЕА-7-3/816@
	Возврат Дата(2024, 1, 1);
	
КонецФункции

// Дата, с которой требуется формировать раздел V "Уплаченный торговый сбор" Книги учета доходов и расходов.
//
Функция ДатаНачалаФормирования5РазделаКУДиР() Экспорт
	
	// Приказ Минфина РФ от 07.12.2016 N 227н.
	Возврат Дата(2018, 1, 1);
	
КонецФункции

#КонецОбласти

#КонецЕсли