
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтображениеПоставляемыхДанных = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПоставляемыеДанные", "ОтображениеПоставляемыхДанных");
	
	Если ТипЗнч(ОтображениеПоставляемыхДанных)<>Тип("СписокЗначений") Тогда
		ОтображениеПоставляемыхДанных = Новый СписокЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Данные.ПоставляемыеДанныеСсылка КАК Ссылка,
	                      |	Данные.НаименованиеДанных КАК ВидДанных,
	                      |	ВЫБОР
	                      |		КОГДА Данные.ПоставляемыеДанныеСсылка В (&ОтображаемыеВидыДанных)
	                      |			ТОГДА ЛОЖЬ
	                      |		ИНАЧЕ ИСТИНА
	                      |	КОНЕЦ КАК Использовать
	                      |ПОМЕСТИТЬ СписокДанных
	                      |ИЗ
	                      |	&Данные КАК Данные
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СписокДанных.Ссылка,
	                      |	СписокДанных.ВидДанных,
	                      |	СписокДанных.Использовать
	                      |ИЗ
	                      |	СписокДанных КАК СписокДанных");
						  
	Запрос.УстановитьПараметр("Данные", ПоставляемыеДанныеБГУ.ПолучитьДоступныеОбновления(Истина));
					  
	Запрос.УстановитьПараметр("ОтображаемыеВидыДанных",ОтображениеПоставляемыхДанных.ВыгрузитьЗначения());
	
	Результат = Запрос.Выполнить();
	
	СписокДанных.Загрузить(Результат.Выгрузить());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ОтображениеПоставляемыхДанных = Новый СписокЗначений;    
	
	Для Каждого СтрокаПоставляемыхДанных Из СписокДанных Цикл
		
		Если НЕ СтрокаПоставляемыхДанных.Использовать Тогда
			ОтображениеПоставляемыхДанных.Добавить(СтрокаПоставляемыхДанных.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("ПоставляемыеДанные", "ОтображениеПоставляемыхДанных", ОтображениеПоставляемыхДанных);
	
	Закрыть(КодВозвратаДиалога.ОК);

КонецПроцедуры

#КонецОбласти