////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура вызывает заполнение отчета. В случае формирования по одной
 // организации, удаляются все дополнительные закладки и таблицы с формы,
 // кроме стандартных.
 // В случае формирования отчета по всем организациям, закладка Кассовая книга
 // прячется и на форме создаются закладки и таблицы для каждой организации.
 // 
&НаСервере
Процедура СформироватьОтчетСервер()
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	ОбъектОтчет = РеквизитФормыВЗначение("Отчет");
	ОбъектОтчет.СформироватьОтчет(ЖурналУчета, ТитульныеЛисты);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Отчет, Параметры);
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация) Тогда
		Отчет.Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Отчет.НачалоПериода = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = КонецДня(ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Очиститьсообщения();
	СформироватьОтчетСервер();
	Элементы.ГруппаТитул.Видимость = Отчет.ВывестиТитульныеЛисты;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода", Отчет.НачалоПериода);
	СтруктураПараметров.Вставить("КонецПериода",  Отчет.КонецПериода);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма, "УстановитьПериодЗавершение");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодЗавершение(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Отчет.НачалоПериода = РезультатВыбора.НачалоПериода;
		Отчет.КонецПериода  = РезультатВыбора.КонецПериода;
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли
	
КонецПроцедуры

