#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
	Если НЕ ЗначениеЗаполнено(Параметры.Организация) Тогда
		Отказ = Истина;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Параметры.ВидНалога) Тогда
		ВызватьИсключение НСтр("ru = 'Форма предназначена для открытия только из настроек конкретного налога'");
	КонецЕсли;
	
	Организация = Параметры.Организация;
	ВидНалога = Параметры.ВидНалога;
	
	ДатаИзменения = НачалоГода(ТекущаяДатаСеанса());
	
	УстановитьВидимостьДоступность();
	ЗаполнитьТаблицуНастройкаАналитики();
	
	Заголовок = СтрШаблон(НСтр("ru = 'Настройка аналитического учета: %1'"), ВидНалога);
	
	ОбновитьТекстПодсказки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодсказкаДанныеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если НавигационнаяСсылкаФорматированнойСтроки = "СтавкиНалогаНаИмущество" Тогда

		ПараметрыФормы  = Новый Структура("Отбор", Новый Структура("Организация", Организация));
		ОткрытьФорму("РегистрСведений.СтавкиНалогаНаИмуществоПоОсновнымСредствам.ФормаСписка",
			ПараметрыФормы,
			ЭтотОбъект);

	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "РегистрацииТранспортныхСредств" Тогда

		ПараметрыФормы  = Новый Структура("Отбор", Новый Структура("Организация", Организация));
		ОткрытьФорму("РегистрСведений.РегистрацияТранспортныхСредств.ФормаСписка",
			ПараметрыФормы,
			ЭтотОбъект);

	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "РегистрацииЗемельныхУчастков" Тогда

		ПараметрыФормы  = Новый Структура("Отбор", Новый Структура("Организация", Организация));
		ОткрытьФорму("РегистрСведений.РегистрацияЗемельныхУчастков.ФормаСписка",
			ПараметрыФормы,
			ЭтотОбъект);

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкаАналитики

&НаКлиенте
Процедура НастройкаАналитикиВидНалогаИлиПлатежаПриИзменении(Элемент)
	
	ЗаписатьИзменения(Элементы.НастройкаАналитики.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаАналитикиНалогСборПлатежПриИзменении(Элемент)
	
	ЗаписатьИзменения(Элементы.НастройкаАналитики.ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УменьшитьПериод(Команда)
	
	ДобавитьГод(-1);
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьПериод(Команда)
	
	ДобавитьГод(1);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Если Не ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.НастройкаАналитическогоУчетаИмущественныхНалогов) Тогда
		Элементы.НастройкаАналитики.ТолькоПросмотр = Истина;	
	КонецЕсли;

    ВидимостьКБК = ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаКБК",
		"Видимость", ВидимостьКБК);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНастройкаАналитики()
	
	НастройкаАналитики.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидНалога", ВидНалога);
	Запрос.УстановитьПараметр("Период", ДатаИзменения);
	
	Если ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		Запрос.Текст = ТекстЗапросаНастройкаАналитикиТранспортныйНалог();
		Запрос.УстановитьПараметр("НачалоГода", Дата(Год(ДатаИзменения), 1, 15)); 
	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		Запрос.Текст = ТекстЗапросаНастройкаАналитикиЗемельныйНалог();
		Запрос.УстановитьПараметр("НачалоГода", Дата(Год(ДатаИзменения), 1, 15)); 
	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		Запрос.Текст = ТекстЗапросаНастройкаАналитикиНалогНаИмущество();
	Иначе
		Возврат;
	КонецЕсли;

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;	
	
	ВыборкаАналитики = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаАналитики.Следующий() Цикл
		
		НоваяСтрока = НастройкаАналитики.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаАналитики);
		НоваяСтрока.ЗаголовокКодПоОКТМО = НСтр("ru = 'Код по ОКТМО:'");
		НоваяСтрока.ЗаголовокКБК 		= НСтр("ru = 'КБК:'");
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаНастройкаАналитикиТранспортныйНалог()

    Возврат
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацияТССрезПоследних.КодПоОКАТО <> """"
		|			ТОГДА РегистрацияТССрезПоследних.КодПоОКАТО
		|		ИНАЧЕ РегистрацииВНалоговомОргане.КодПоОКТМО
		|	КОНЕЦ КАК КодПоОКТМО
		|ПОМЕСТИТЬ ВТРегистрации
		|ИЗ
		|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(&НачалоГода, Организация = &Организация) КАК РегистрацияТССрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО РегистрацияТССрезПоследних.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	РегистрацияТССрезПоследних.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
		|	И РегистрацияТССрезПоследних.НалоговаяЛьгота <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоТранспортномуНалогу.ОсвобождениеОтНалогообложения)
		|	И (РегистрацияТССрезПоследних.КодПоОКАТО <> """"
		|			ИЛИ НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацияТранспортныхСредств.КодПоОКАТО <> """"
		|			ТОГДА РегистрацияТранспортныхСредств.КодПоОКАТО
		|		ИНАЧЕ РегистрацииВНалоговомОргане.КодПоОКТМО
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО РегистрацияТранспортныхСредств.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	РегистрацияТранспортныхСредств.Организация = &Организация
		|	И РегистрацияТранспортныхСредств.Период > &НачалоГода
		|	И РегистрацияТранспортныхСредств.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
		|	И РегистрацияТранспортныхСредств.НалоговаяЛьгота <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоТранспортномуНалогу.ОсвобождениеОтНалогообложения)
		|	И (РегистрацияТранспортныхСредств.КодПоОКАТО <> """"
		|			ИЛИ НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Организации.КодОКТМО
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.КодПоОКТМО КАК КодПоОКТМО,
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.НалогСборПлатеж КАК НалогСборПлатеж
		|ПОМЕСТИТЬ ВТНастройкаАналитики
		|ИЗ
		|	РегистрСведений.НастройкаАналитическогоУчетаИмущественныхНалогов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалога = &ВидНалога
		|				И КБК = """") КАК НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРегистрации.КодПоОКТМО КАК КодПоОКТМО,
		|	ЕСТЬNULL(ВТНастройкаАналитики.ВидНалогаИлиПлатежа, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)) КАК ВидНалогаИлиПлатежа,
		|	ЕСТЬNULL(ВТНастройкаАналитики.НалогСборПлатеж, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)) КАК НалогСборПлатеж
		|ИЗ
		|	ВТРегистрации КАК ВТРегистрации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкаАналитики КАК ВТНастройкаАналитики
		|		ПО ВТРегистрации.КодПоОКТМО = ВТНастройкаАналитики.КодПоОКТМО
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодПоОКТМО";
	
КонецФункции

&НаСервере
Функция ТекстЗапросаНастройкаАналитикиЗемельныйНалог()

    Возврат
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацияЗУСрезПоследних.КодПоОКАТО <> """"
		|			ТОГДА РегистрацияЗУСрезПоследних.КодПоОКАТО
		|		КОГДА НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL
		|			ТОГДА РегистрацииВНалоговомОргане.КодПоОКТМО
		|		ИНАЧЕ РегистрацияЗУСрезПоследних.Организация.КодОКТМО
		|	КОНЕЦ КАК КодПоОКТМО,
		|	РегистрацияЗУСрезПоследних.КБК КАК КБК
		|ПОМЕСТИТЬ ВТРегистрации
		|ИЗ
		|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(&НачалоГода, Организация = &Организация) КАК РегистрацияЗУСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО РегистрацияЗУСрезПоследних.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	РегистрацияЗУСрезПоследних.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
		|	И РегистрацияЗУСрезПоследних.НалоговаяЛьготаПоНалоговойБазе <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.ОсвобождениеОтНалогообложенияМестное)
		|	И РегистрацияЗУСрезПоследних.НалоговаяЛьготаПоНалоговойБазе <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.ОсвобождениеОтНалогообложенияПоСтатье395)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА РегистрацияЗУ.КодПоОКАТО <> """"
		|			ТОГДА РегистрацияЗУ.КодПоОКАТО
		|		КОГДА НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL
		|			ТОГДА РегистрацииВНалоговомОргане.КодПоОКТМО
		|		ИНАЧЕ РегистрацияЗУ.Организация.КодОКТМО
		|	КОНЕЦ,
		|	РегистрацияЗУ.КБК
		|ИЗ
		|	РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО РегистрацияЗУ.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	РегистрацияЗУ.Организация = &Организация
		|	И РегистрацияЗУ.Период > &НачалоГода
		|	И РегистрацияЗУ.ВидЗаписи = ЗНАЧЕНИЕ(Перечисление.ВидЗаписиОРегистрации.Регистрация)
		|	И РегистрацияЗУ.НалоговаяЛьготаПоНалоговойБазе <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.ОсвобождениеОтНалогообложенияМестное)
		|	И РегистрацияЗУ.НалоговаяЛьготаПоНалоговойБазе <> ЗНАЧЕНИЕ(Перечисление.ВидыНалоговыхЛьготПоЗемельномуНалогуПоНалоговойБазе.ОсвобождениеОтНалогообложенияПоСтатье395)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.КодПоОКТМО КАК КодПоОКТМО,
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.КБК КАК КБК,
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.НалогСборПлатеж КАК НалогСборПлатеж
		|ПОМЕСТИТЬ ВТНастройкаАналитики
		|ИЗ
		|	РегистрСведений.НастройкаАналитическогоУчетаИмущественныхНалогов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалога = &ВидНалога) КАК НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРегистрации.КодПоОКТМО КАК КодПоОКТМО,
		|	ВТРегистрации.КБК КАК КБК,
		|	ЕСТЬNULL(ВТНастройкаАналитики.ВидНалогаИлиПлатежа, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)) КАК ВидНалогаИлиПлатежа,
		|	ЕСТЬNULL(ВТНастройкаАналитики.НалогСборПлатеж, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)) КАК НалогСборПлатеж
		|ИЗ
		|	ВТРегистрации КАК ВТРегистрации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкаАналитики КАК ВТНастройкаАналитики
		|		ПО ВТРегистрации.КодПоОКТМО = ВТНастройкаАналитики.КодПоОКТМО
		|			И ВТРегистрации.КБК = ВТНастройкаАналитики.КБК
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодПоОКТМО,
		|	КБК";
	
КонецФункции

&НаСервере
Функция ТекстЗапросаНастройкаАналитикиНалогНаИмущество()

    Возврат
		"ВЫБРАТЬ
		|	ИСТИНА КАК Учитывать
		|ПОМЕСТИТЬ ВТУчитыватьОбщуюСтавку
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних
		|ГДЕ
		|	УчетнаяПолитикаОрганизацийСрезПоследних.НалогНаИмуществоПорядокНалогообложения В (ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены), ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
		|ГДЕ
		|	УчетнаяПолитикаОрганизаций.НалогНаИмуществоПорядокНалогообложения В (ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены), ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке))
		|	И УчетнаяПолитикаОрганизаций.Организация = &Организация
		|	И УчетнаяПолитикаОрганизаций.Период > &Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОсобыеЛьготыНеУстановлены) КАК ПорядокНалогообложения
		|ПОМЕСТИТЬ ВТПорядокНалогообложения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ОблагаетсяПоСниженнойСтавке)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ПорядокНалогообложенияИмущества.ПоОбщейСтавке)
		|ИЗ
		|	ВТУчитыватьОбщуюСтавку КАК ВТУчитыватьОбщуюСтавку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СтавкиСрезПоследних.КодПоОКТМО <> """"
		|			ТОГДА СтавкиСрезПоследних.КодПоОКТМО
		|		КОГДА НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL
		|			ТОГДА РегистрацииВНалоговомОргане.КодПоОКТМО
		|		ИНАЧЕ СтавкиСрезПоследних.Организация.КодОКТМО
		|	КОНЕЦ КАК КодПоОКТМО
		|ПОМЕСТИТЬ ВТРегистрации
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОсновнымСредствам.СрезПоследних(&Период, Организация = &Организация) КАК СтавкиСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО СтавкиСрезПоследних.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	СтавкиСрезПоследних.ПорядокНалогообложения В
		|			(ВЫБРАТЬ
		|				ВТПорядокНалогообложения.ПорядокНалогообложения КАК ПорядокНалогообложения
		|			ИЗ
		|				ВТПорядокНалогообложения КАК ВТПорядокНалогообложения)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА Ставки.КодПоОКТМО <> """"
		|			ТОГДА Ставки.КодПоОКТМО
		|		КОГДА НЕ РегистрацииВНалоговомОргане.КодПоОКТМО ЕСТЬ NULL
		|			ТОГДА РегистрацииВНалоговомОргане.КодПоОКТМО
		|		ИНАЧЕ Ставки.Организация.КодОКТМО
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаИмуществоПоОсновнымСредствам КАК Ставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|		ПО Ставки.НалоговыйОрган = РегистрацииВНалоговомОргане.Ссылка
		|ГДЕ
		|	Ставки.Организация = &Организация
		|	И Ставки.Период > &Период
		|	И Ставки.ПорядокНалогообложения В
		|			(ВЫБРАТЬ
		|				ВТПорядокНалогообложения.ПорядокНалогообложения КАК ПорядокНалогообложения
		|			ИЗ
		|				ВТПорядокНалогообложения КАК ВТПорядокНалогообложения)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Организации.КодОКТМО
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.КодПоОКТМО КАК КодПоОКТМО,
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.ВидНалогаИлиПлатежа КАК ВидНалогаИлиПлатежа,
		|	НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних.НалогСборПлатеж КАК НалогСборПлатеж
		|ПОМЕСТИТЬ ВТНастройкаАналитики
		|ИЗ
		|	РегистрСведений.НастройкаАналитическогоУчетаИмущественныхНалогов.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И ВидНалога = &ВидНалога
		|				И КБК = """") КАК НастройкаАналитическогоУчетаИмущественныхНалоговСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРегистрации.КодПоОКТМО КАК КодПоОКТМО,
		|	ЕСТЬNULL(ВТНастройкаАналитики.ВидНалогаИлиПлатежа, ЗНАЧЕНИЕ(Справочник.ВидыНалоговИПлатежей.ПустаяСсылка)) КАК ВидНалогаИлиПлатежа,
		|	ЕСТЬNULL(ВТНастройкаАналитики.НалогСборПлатеж, ЗНАЧЕНИЕ(Справочник.НалогиИПлатежиОрганизации.ПустаяСсылка)) КАК НалогСборПлатеж
		|ИЗ
		|	ВТРегистрации КАК ВТРегистрации
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройкаАналитики КАК ВТНастройкаАналитики
		|		ПО ВТРегистрации.КодПоОКТМО = ВТНастройкаАналитики.КодПоОКТМО
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодПоОКТМО";
	
КонецФункции

&НаСервере
Процедура ОбновитьТекстПодсказки()
	
	Если ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		
		ТекстПодсказкиДанные = СтрШаблон(
			НСтр("ru = 'Показаны территории, где <a href=""%1"">зарегистрированы транспортные средства</a>.'"),
						"РегистрацииТранспортныхСредств");

	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		
		ТекстПодсказкиДанные = СтрШаблон(
			НСтр("ru = 'Показаны территории <a href=""%1"">по месту нахождения земельных участков</a>.'"),
						"РегистрацииЗемельныхУчастков");

	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		
		ТекстПодсказкиДанные = СтрШаблон(
			НСтр("ru = 'Показаны территории, где <a href=""%1"">учтено недвижимое имущество</a>.'"),
						"СтавкиНалогаНаИмущество");

	Иначе
		ТекстПодсказкиДанные = "";	
	КонецЕсли;
	
	Элементы.ПодсказкаДанные.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(ТекстПодсказкиДанные);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(ТекущиеДанные)
	
	СтруктураЗаписи = Новый Структура;
	
	СтруктураЗаписи.Вставить("Период", 		ДатаИзменения);
	СтруктураЗаписи.Вставить("Организация", Организация); 
	СтруктураЗаписи.Вставить("ВидНалога", 	ВидНалога);
	
 	СтруктураЗаписи.Вставить("КодПоОКТМО",			ТекущиеДанные.КодПоОКТМО); 
	СтруктураЗаписи.Вставить("КБК", 				ТекущиеДанные.КБК); 
	СтруктураЗаписи.Вставить("ВидНалогаИлиПлатежа",	ТекущиеДанные.ВидНалогаИлиПлатежа); 
	СтруктураЗаписи.Вставить("НалогСборПлатеж", 	ТекущиеДанные.НалогСборПлатеж); 

	Попытка
		ЗаписатьИзмененияНаСервере(СтруктураЗаписи);
	Исключение
        ЗаполнитьТаблицуНастройкаАналитики();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьИзмененияНаСервере(Знач СтруктураЗаписи)
	
	МенеджерЗаписи = РегистрыСведений.НастройкаАналитическогоУчетаИмущественныхНалогов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГод(ЧислоЛет)
	
	Год = Год(ДатаИзменения) + ЧислоЛет;
	ДатаИзменения = Дата(Год, 1, 1);
	
	ЗаполнитьТаблицуНастройкаАналитики();
	
КонецПроцедуры

#КонецОбласти