///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет дополнить регистры с движениями документа дополнительными регистрами.
//
// Параметры:
//    Документ - ДокументСсылка - документ коллекцию движений которого необходимо дополнить.
//    РегистрыСДвижениями - Соответствие - соответствие с данными:
//        * Ключ     - ОбъектМетаданных - регистр как объект метаданных.
//        * Значение - Строка           - имя поля регистратора.
//
Процедура ПриОпределенииРегистровСДвижениями(Документ, РегистрыСДвижениями) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеГодаТехнологическоеГрупповое") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ФормированиеОстатковПоРасчетам") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеОстатковПоЖурналамСлужебный") Тогда
		
		ТипыДокументов = Документ.Метаданные().ТабличныеЧасти.СписокДокументов.Реквизиты.ДокСсылка.Тип.Типы();
		Для Каждого ТипДокумента Из ТипыДокументов Цикл 
			МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипДокумента);
			Для Каждого МетаданныеРегистра Из МетаданныеДокумента.Движения Цикл
				Если ПравоДоступа("Просмотр", МетаданныеРегистра) Тогда
					РегистрыСДвижениями.Вставить(МетаданныеРегистра, "Регистратор");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Позволяет рассчитать количество записей для дополнительных наборов, добавленных процедурой
// ПриОпределенииРегистровСДвижениями.
//
// Параметры:
//    Документ - ДокументСсылка - документ коллекцию движений которого необходимо дополнить.
//    РассчитанноеКоличество - Соответствие - соответствие с данными:
//        * Ключ     - Строка - полное имя регистра (вместо точек используется символ подчеркивания).
//        * Значение - Число  - рассчитанное количество записей.
//
Процедура ПриРасчетеКоличестваЗаписей(Документ, РассчитанноеКоличество) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеГодаТехнологическоеГрупповое") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ФормированиеОстатковПоРасчетам") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеОстатковПоЖурналамСлужебный") Тогда
		
		Для Каждого Элемент Из РассчитанноеКоличество Цикл 
			РассчитанноеКоличество.Вставить(Элемент.Ключ, 1);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Позволяет дополнить или переопределить коллекцию наборов данных для вывода движений документа.
//
// Параметры:
//    Документ - ДокументСсылка - документ, коллекцию движений которого необходимо дополнить.
//    НаборыДанных - Массив - сведения о наборах данных (тип элемента Структура).
//
Процедура ПриПодготовкеНабораДанных(Документ, НаборыДанных) Экспорт
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеГодаТехнологическоеГрупповое") И НаборыДанных.Количество() > 0 Тогда
		
		Отбор = "
		|    Регистратор В (
		|        ВЫБРАТЬ
		|            ДокСсылка
		|        ИЗ
		|            Документ.ЗакрытиеГодаТехнологическоеГрупповое.СписокДокументов
		|        ГДЕ
		|            Ссылка = &ДокументВладелец)";
		
		ИсключаемыйОтбор = "
		|ГДЕ
		|    Регистратор = &ДокументВладелец";
		
		Для Каждого Набор Из НаборыДанных Цикл 
			
			Набор.ТекстЗапроса = СтрЗаменить(Набор.ТекстЗапроса, ИсключаемыйОтбор, "");
			Набор.ТекстЗапроса = СтрЗаменить(Набор.ТекстЗапроса, "Регистратор = &ДокументВладелец", Отбор);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ФормированиеОстатковПоРасчетам") И НаборыДанных.Количество() > 0 Тогда
		
		Отбор = "
		|    Регистратор В (
		|        ВЫБРАТЬ
		|            ДокСсылка
		|        ИЗ
		|            Документ.ФормированиеОстатковПоРасчетам.СписокДокументов
		|        ГДЕ
		|            Ссылка = &ДокументВладелец)";
		
		ИсключаемыйОтбор = "
		|ГДЕ
		|    Регистратор = &ДокументВладелец";
		
		Для Каждого Набор Из НаборыДанных Цикл 
			
			Набор.ТекстЗапроса = СтрЗаменить(Набор.ТекстЗапроса, ИсключаемыйОтбор, "");
			Набор.ТекстЗапроса = СтрЗаменить(Набор.ТекстЗапроса, "Регистратор = &ДокументВладелец", Отбор);
			
		КонецЦикла;	  
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗакрытиеОстатковПоЖурналамСлужебный") И НаборыДанных.Количество() > 0 Тогда
		
		Отбор = "
		|    Регистратор В (
		|        ВЫБРАТЬ
		|            ДокСсылка
		|        ИЗ
		|            Документ.ЗакрытиеОстатковПоЖурналамСлужебный.СписокДокументов
		|        ГДЕ
		|            Ссылка = &ДокументВладелец)";
		
		ИсключаемыйОтбор = "
		|ГДЕ
		|    Регистратор = &ДокументВладелец";
		
		Для Каждого Набор Из НаборыДанных Цикл 
			
			Набор.ТекстЗапроса = СтрЗаменить(Набор.ТекстЗапроса, ИсключаемыйОтбор, "");
			Набор.ТекстЗапроса = СтрЗаменить(Набор.ТекстЗапроса, "Регистратор = &ДокументВладелец", Отбор);
			
		КонецЦикла;	  
	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
