
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияБГУ.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;	
	КонецЕсли;
	
	Отказ = Истина;
	Оповещение = Новый ОписаниеОповещения("ВыборИзСпискаЗавершение", ЭтотОбъект);
    СписокВыбораВидаНалога().ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Вид налога'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СписокВыбораВидаНалога()
	
	СписокВыбора = Новый СписокЗначений;
	
	СписокВыбора.Добавить(Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог, "Транспортный налог");
	СписокВыбора.Добавить(Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог, "Земельный налог");
	СписокВыбора.Добавить(Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество, "Налог на имущество");
	
	Возврат СписокВыбора;
КонецФункции

&НаКлиенте
Процедура ВыборИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;  

	СтруктураПараметров = ПолучитьСтруктуруПараметровФормы(ВыбранныйЭлемент.Значение);
	ОткрытьФорму("Документ.НачислениеИмущественныхНалогов.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруПараметровФормы(ВидНалога)
	
	СтруктураПараметров = Новый Структура;
	
	ЗначенияЗаполнения = ОбщегоНазначенияБГУКлиент.ЗначенияЗаполненияДинамическогоСписка(Список.КомпоновщикНастроек);
	
	Если ЗначениеЗаполнено(ВидНалога) Тогда
		ЗначенияЗаполнения.Вставить("ВидНалога", ВидНалога);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Возврат СтруктураПараметров;
	
КонецФункции

#КонецОбласти
