
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ИдентификаторДокумента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Параметры.ИдентификаторДокумента);
	
	ТипПС = ПланыСчетов.ТипВсеСсылки();
	Для каждого ТекРеквизит Из МетаданныеДокумента.Реквизиты Цикл
		ТипыРеквизита = ТекРеквизит.Тип.Типы();
		Если ТипыРеквизита.Количество()>0 Тогда
			Если ТипПС.СодержитТип(ТипыРеквизита[0]) Тогда
				РеквизитыДокумента.Добавить("Объект." + ТекРеквизит.Имя);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Для каждого ТекДопРеквизит Из Параметры.ДополнительныеРеквизиты Цикл
		//Если ТекДопРеквизит.РеквизитПроводки.ТипЗначения = ТипПС Тогда
			РеквизитыДокумента.Добавить(ТекДопРеквизит.Значение);
		//КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Параметры.ТекущаяСвязь) Тогда
		ИмяСвязи = Лев(Параметры.ТекущаяСвязь, Найти(Параметры.ТекущаяСвязь,"(")-1);
		ТекЭлементСписка = РеквизитыДокумента.НайтиПоЗначению(ИмяСвязи);
		Если ТекЭлементСписка<>Неопределено Тогда
			Элементы.РеквизитыДокумента.ТекущаяСтрока = ТекЭлементСписка.ПолучитьИдентификатор();
			ЭлементСвязи = Число(Сред(Параметры.ТекущаяСвязь, Найти(Параметры.ТекущаяСвязь,"(")+1,1));
		КонецЕсли;
	КонецЕсли;
	
	ЗапрещеноРедактированиеОперации = Параметры.ЗапрещеноРедактированиеОперации;
	Элементы.ФормаОК.Видимость = Не ЗапрещеноРедактированиеОперации;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЧНОЙ ЧАСТИ РеквизитыДокумента

&НаКлиенте
Процедура РеквизитыДокументаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	КомандаОК(Неопределено);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаОК(Команда)
	ТекущиеДанные = Элементы.РеквизитыДокумента.ТекущиеДанные;
	Если ЗапрещеноРедактированиеОперации ИЛИ ТекущиеДанные = Неопределено Тогда
		Закрыть();
	Иначе
		ОповеститьОВыборе(ТекущиеДанные.Значение+"("+ЭлементСвязи+")");
	КонецЕсли;
КонецПроцедуры

