
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьСписокИнтервалов();
	ЗаполнитьСписокСостояний();
	ЗаполнитьДополнительныеРеквизиты();
	
	УчетПоПодразделениямСчетовАмортизации = УправлениеОсновнымиСредствамиПовтИсп.ВедетсяУчетОСПоПодразделениям();
	Элементы.ОсновныеСредстваПодразделениеСчетаАмортизации.Видимость = УчетПоПодразделениямСчетовАмортизации;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОС();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);	
	// Конец Типовые операции и дополнительные табличные части

	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части

	ЗаполнитьДополнительныеРеквизиты();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтотОбъект);
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОС();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНФАПриИзменении(Элемент)
	
	Объект.СчетУчета = Неопределено;
	Объект.КФО		 = Неопределено;
	Объект.КПС		 = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)

	Если ПустаяСтрока(Элемент.ТекстРедактирования) Тогда
		Объект.КФО = Неопределено;
		Объект.КПС = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	    
	Если Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС") Тогда
		ОграниченияСчета = БухгалтерскийУчетКлиентСервер.СписокСчетов("101.00,108.51,108.52");
	ИначеЕсли Объект.ВидНФА = ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА") Тогда
		ОграниченияСчета = БухгалтерскийУчетКлиентСервер.СписокСчетов("102.00,108.54");
	Иначе
		ОграниченияСчета = Новый Массив;
	КонецЕсли;
		
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			Объект.СчетУчета, 
																			Объект.КПС, 
																			Объект.КФО), 
															Объект.Организация,
															Объект.ИФО,
															ОграниченияСчета,
															Объект.КФО,
															,
															Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(ВыбранноеЗначение, Объект.КПС, Объект.КФО);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
		ОбновитьТекстЗаголовковВСтрокеТаблицыОС(ТекущиеДанные);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ЗаполнитьТабличнуюЧасть(Элементы.ОсновныеСредства.ТекущиеДанные.ОсновноеСредство, Элементы.ОсновныеСредства.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетУчетаЗатратПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.СчетУчетаЗатрат);
	ТекущиеДанные.КоличествоСубконто = СвойстваСчета.КоличествоСубконто;

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетУчетаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если КонецГода(Объект.Дата) = КонецДня(Объект.Дата) Тогда
		ОграниченияСчета = БухгалтерскийУчетКлиентСервер.СписокСчетов("401.30");		
	Иначе		
		ОграниченияСчета = БухгалтерскийУчетКлиентСервер.СписокСчетов("106.24,106.34,109.00,401.20");		
	КонецЕсли;	
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.СчетУчетаЗатрат, 
																			ТекущиеДанные.КПС, 
																			Объект.КФО), 
															Объект.Организация,
															Объект.ИФО,
															ОграниченияСчета,
															Объект.КФО,
															,
															Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСчетУчетаЗатратОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		  	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;

	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(ВыбранноеЗначение, ТекущиеДанные.КПС,, ТекущиеДанные.КЭК);

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваКЭКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
												  СтандартнаяОбработка,
												  ТекущиеДанные.КЭК,
												  Объект.Организация, 
												  Объект.ИФО,
												  Объект.КФО, 
												  ТекущиеДанные.СчетУчетаЗатрат,
												  Объект.Дата,
												  "Дт");
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто1ПриИзменении(Элемент)
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "Субконто");
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.КФО = Объект.КФО;
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													ТекущиеДанные.Субконто1, ТекущиеДанные.СчетУчетаЗатрат, "Субконто");
													
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто2ПриИзменении(Элемент)
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "Субконто");
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.КФО = Объект.КФО;
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													ТекущиеДанные.Субконто2, ТекущиеДанные.СчетУчетаЗатрат, "Субконто");

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто3ПриИзменении(Элемент)
		БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "Субконто");
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСубконто3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.КФО = Объект.КФО;
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, Объект.Организация,
													ТекущиеДанные.Субконто3, ТекущиеДанные.СчетУчетаЗатрат, "Субконто");

КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСрокПолезногоИспользованияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	РассчитатьСтроку(ТекущаяСтрока, Объект.Организация, Объект.Дата, Объект.ВидНФА);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПорядокПогашенияСтоимостиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОсновныеСредства.ТекущиеДанные;
	РассчитатьСтроку(ТекущаяСтрока, Объект.Организация, Объект.Дата, Объект.ВидНФА);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваСпособНачисленияАмортизацииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОсновныеСредства.ТекущиеДанные;
	РассчитатьСтроку(ТекущаяСтрока, Объект.Организация, Объект.Дата, Объект.ВидНФА);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОС(Команда)

	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьОСПослеЗакрытияВопроса", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Таблица будет очищена! Продолжить выполнение операции?'");		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, НСтр("ru='Корректировка амортизации'"));
	Иначе
		ЗаполнитьТабличнуюЧасть();
		ОбновитьТекстЗаголовковВсехСтрокТаблицыОС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОСПослеЗакрытияВопроса(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ОсновныеСредства.Очистить();
		ЗаполнитьТабличнуюЧасть();
		ОбновитьТекстЗаголовковВсехСтрокТаблицыОС();
	КонецЕсли;
	
КонецПроцедуры

// Типовые операции
&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 
// Типовые операции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	СтруктураРеквизитов.Вставить("Дата");
	СтруктураРеквизитов.Вставить("ВидНФА", "Вид НФА");
	СтруктураРеквизитов.Вставить("СчетУчета", "Счет учета");
	Возврат СтруктураРеквизитов;

КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация"	, Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО"			, Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("КФО"			, Объект.КФО);
	ПараметрыПодбора.Отбор.Вставить("КПС"			, Объект.КПС);
	ПараметрыПодбора.Отбор.Вставить("Счет"			, Объект.СчетУчета);

	Если ЗначениеЗаполнено(Объект.ЦМО) Тогда
		ПараметрыПодбора.Отбор.Вставить("ЦМО", Объект.ЦМО);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Состояние) Тогда
		ПараметрыПодбора.Отбор.Вставить("Состояние", Объект.Состояние);
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения"	, ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаБалансе"));
	ПараметрыПодбора.Вставить("СкрытьКолонки"	, "ЦМО");
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОССервер(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()

	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);

КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(ВыбранноеЗначение);
	
	СписокОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
	ЗаполнитьТабличнуюЧасть(СписокОС.ВыгрузитьКолонку("ОсновноеСредство"));	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИнтервалов();
	
	СписокВыбораИнтервалов = Элементы.ИнтервалЦен.СписокВыбора;
	
	СписокВыбораИнтервалов.Добавить(0, НСтр("ru = 'Независимо от стоимости'"));
	СписокВыбораИнтервалов.Добавить(1, НСтр("ru = 'До 3 000 рублей'"));
	СписокВыбораИнтервалов.Добавить(2, НСтр("ru = 'От 3 000 до 10 000 рублей'"));
	СписокВыбораИнтервалов.Добавить(3, НСтр("ru = 'От 3 000 до 20 000 рублей'"));
	СписокВыбораИнтервалов.Добавить(4, НСтр("ru = 'От 10 000 до 20 000 рублей'"));	
	СписокВыбораИнтервалов.Добавить(5, НСтр("ru = 'От 20 000 до 40 000 рублей'"));
	СписокВыбораИнтервалов.Добавить(6, НСтр("ru = 'Дороже 20 000 рублей'"));
	СписокВыбораИнтервалов.Добавить(7, НСтр("ru = 'Дороже 40 000 рублей'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСостояний()
	
	СписокВыборкаСостояний = Элементы.Состояние.СписокВыбора;
	
	СписокВыборкаСостояний.Добавить(Перечисления.СостоянияОС.ПринятоКУчету);
	СписокВыборкаСостояний.Добавить(Перечисления.СостоянияОС.ВведеноВЭксплуатацию);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизиты()
	
	Для Каждого СтрокаОсновныеСредства Из Объект.ОсновныеСредства Цикл			
		ЗаполнитьДополнительныеРеквизитыСтроки(СтрокаОсновныеСредства);		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыСтроки(СтрокаОсновныеСредства)
	
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СтрокаОсновныеСредства.СчетУчетаЗатрат);
	СтрокаОсновныеСредства.КоличествоСубконто	= СвойстваСчета.КоличествоСубконто;
	СтрокаОсновныеСредства.УчетПоПодразделениям	= СвойстваСчета.УчетПоПодразделениям;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть(ОсновноеСредство = Неопределено, пТекущаяСтрока = Неопределено)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОССрезПоследних.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|				ТОГДА СобытияОССрезПоследних.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаПринятияКУчету,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОССрезПоследних.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	|				ТОГДА СобытияОССрезПоследних.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаВводаВЭксплуатацию,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА СобытияОССрезПоследних.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|				ТОГДА СобытияОССрезПоследних.ДатаСобытия
	|			ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|		КОНЕЦ) КАК ДатаСписания
	|ПОМЕСТИТЬ СобытияОС
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В (&ОС)) КАК СобытияОССрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОССрезПоследних.ОсновноеСредство,
	|	СобытияОССрезПоследних.ИнвНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА АмортизацияОС.ОсновноеСредство.ТипНФА = ЗНАЧЕНИЕ(Перечисление.ТипыНФА.БиблиотечныйФонд)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БиблиотечныйФонд,
	|	ВЫБОР
	|		КОГДА АмортизацияОС.КПС ЕСТЬ NULL
	|				ИЛИ АмортизацияОС.КПС = ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)
	|			ТОГДА &КПС
	|		ИНАЧЕ АмортизацияОС.КПС
	|	КОНЕЦ КАК КПС,
	|	АмортизацияОС.КЭК КАК КЭК,
	|	АмортизацияОС.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	АмортизацияОС.Подразделение КАК Подразделение,
	|	АмортизацияОС.Субконто1 КАК Субконто1,
	|	АмортизацияОС.Субконто2 КАК Субконто2,
	|	АмортизацияОС.Субконто3 КАК Субконто3,
	|	ПараметрыАмортизацииОСБУ.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ПараметрыАмортизацииОСБУ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	СтоимостьОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОстатки.ЦМО КАК ЦМО,
	|	ВЫБОР
	|		КОГДА СобытияОС.ОсновноеСредство ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	|		КОГДА СобытияОС.ДатаСписания <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|		КОГДА СобытияОС.ДатаВводаВЭксплуатацию <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|		КОГДА СобытияОС.ДатаПринятияКУчету <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние,
	|	СобытияОС.ДатаПринятияКУчету КАК ДатаПоступления,
	|	ЕСТЬNULL(РасчетАмортизацииОС.СрокПолезногоИспользования, 0) КАК СрокПолезногоИспользования,
	|	ЕСТЬNULL(РасчетАмортизацииОС.СрокИспользованияДляВычисленияАмортизации, 0) КАК СрокИспользованияДляВычисленияАмортизации,
	|	ЕСТЬNULL(РасчетАмортизацииОС.СтоимостьДляВычисленияАмортизации, 0) КАК СтоимостьДляВычисленияАмортизации,
	|	ЕСТЬNULL(ЕПСБУОстаткиСумма.СуммаОстатокДт, 0) КАК Сумма,
	|	ЕСТЬNULL(ЕПСБУОстаткиСумма.КоличествоОстатокДт, 0) КАК Количество,
	|	ЕСТЬNULL(ЕПСБУОстатки.СуммаОстатокКт, 0) КАК НачисленнаяАмортизация,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(&ДатаПериода, ГОД) = КОНЕЦПЕРИОДА(&ДатаПериода, ДЕНЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонецФинансовогоГода,
	|	ЕПСБУОстаткиСумма.Подразделение КАК ПодразделениеСчетаАмортизации
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В ИЕРАРХИИ (&Счет),
	|			,
	|			Организация = &Организация
	|				И КПС = &КПС
	|				И ИФО = &ИФО
	|				И КФО = &КФО
	|				И Субконто1 В (&ОС)
	|				И Субконто2 = &ЦМО) КАК ЕПСБУОстаткиСумма
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АмортизацияОС.СрезПоследних(&Период, ОсновноеСредство В (&ОС)) КАК АмортизацияОС
	|		ПО ЕПСБУОстаткиСумма.Субконто1 = АмортизацияОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|				&Период,
	|				Организация = &Организация
	|					И ОсновноеСредство В (&ОС)
	|					И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОстатки
	|		ПО ЕПСБУОстаткиСумма.Субконто1 = СтоимостьОстатки.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ СобытияОС КАК СобытияОС
	|		ПО ЕПСБУОстаткиСумма.Субконто1 = СобытияОС.ОсновноеСредство
	|			И (СтоимостьОстатки.ИнвентарныйНомер = СобытияОС.ИнвентарныйНомер)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетАмортизацииОС.СрезПоследних КАК РасчетАмортизацииОС
	|		ПО ЕПСБУОстаткиСумма.Субконто1 = РасчетАмортизацииОС.ОсновноеСредство
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|				&Период,
	|				Счет В (&СчетАм),
	|				,
	|				Организация = &Организация
	|					И КПС = &КПС
	|					И ИФО = &ИФО
	|					И КФО = &КФО
	|					И Субконто1 В (&ОС)) КАК ЕПСБУОстатки
	|		ПО ЕПСБУОстаткиСумма.Субконто1 = ЕПСБУОстатки.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&Период, ) КАК ПараметрыАмортизацииОСБУ
	|		ПО ЕПСБУОстаткиСумма.Субконто1 = ПараметрыАмортизацииОСБУ.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ВТ.КонецФинансовогоГода
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ.СчетУчетаЗатрат
	|	КОНЕЦ КАК СчетУчетаЗатрат,
	|	ВЫБОР
	|		КОГДА ВТ.КонецФинансовогоГода
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ.КПС
	|	КОНЕЦ КАК КПС,
	|	ВЫБОР
	|		КОГДА ВТ.КонецФинансовогоГода
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ.КЭК
	|	КОНЕЦ КАК КЭК,
	|	ВЫБОР
	|		КОГДА ВТ.КонецФинансовогоГода
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА ВТ.КонецФинансовогоГода
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА ВТ.КонецФинансовогоГода
	|			ТОГДА NULL
	|		ИНАЧЕ ВТ.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ВТ.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости,
	|	ВТ.СпособНачисленияАмортизации КАК СпособНачисленияАмортизации,
	|	ВТ.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ.Состояние КАК Состояние,
	|	ВТ.ДатаПоступления КАК ДатаПоступления,
	|	ВТ.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	ВТ.Сумма КАК Сумма,
	|	ВТ.Количество КАК Количество,
	|	ВТ.НачисленнаяАмортизация КАК НачисленнаяАмортизация,
	|	ВЫБОР
	|		КОГДА ВТ.Количество > 0
	|			ТОГДА ВТ.Сумма / ВТ.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена,
	|	ВТ.Подразделение КАК Подразделение,
	|	ВТ.ПодразделениеСчетаАмортизации КАК ПодразделениеСчетаАмортизации,
	|	ВЫБОР
	|		КОГДА ВТ.ОсновноеСредство.ТипНФА = ЗНАЧЕНИЕ(Перечисление.ТипыНФА.БиблиотечныйФонд)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК БиблиотечныйФонд
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	ВТ.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|	И ВТ.Состояние В(&Состояния)
	|	И &УсловиеСуммы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	МоментДокумента = Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	
	Запрос.УстановитьПараметр("Период",			МоментДокумента);
	Запрос.УстановитьПараметр("ДатаПериода",	Объект.Дата);
	Запрос.УстановитьПараметр("Организация",	Объект.Организация);
	Запрос.УстановитьПараметр("Счет",			Объект.СчетУчета);
	Запрос.УстановитьПараметр("ИФО",			Объект.ИФО);
	Запрос.УстановитьПараметр("КФО",			Объект.КФО);
	Запрос.УстановитьПараметр("КПС",			Объект.КПС);
	Запрос.УстановитьПараметр("СчетАм",			БухгалтерскийУчет.СписокСчетов("104.00"));
	
	Если ЗначениеЗаполнено(Объект.ЦМО) Тогда
		Запрос.УстановитьПараметр("ЦМО", Объект.ЦМО);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Субконто2 = &ЦМО", "ИСТИНА");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Состояние) Тогда
		Запрос.УстановитьПараметр("Состояния", Объект.Состояние);
	Иначе
		Запрос.УстановитьПараметр("Состояния", Элементы.Состояние.СписокВыбора.ВыгрузитьЗначения());
	КонецЕсли;
	
	ТекстУсловия = "";
	ГраницыИнтервала = ПолучитьГраницыИнтервала(Объект.ИнтервалЦен);
	Если ГраницыИнтервала.НижняяГраница <> 0 Тогда 
		ТекстУсловия = " И ВТ.Сумма >= &НижняяГраница";
		Запрос.УстановитьПараметр("НижняяГраница",	ГраницыИнтервала.НижняяГраница);
	КонецЕсли;
	Если ГраницыИнтервала.ВерхняяГраница <> 0 Тогда 
		ТекстУсловия = ТекстУсловия + " И ВТ.Сумма <= &ВерхняяГраница";
		Запрос.УстановитьПараметр("ВерхняяГраница",	ГраницыИнтервала.ВерхняяГраница);
	КонецЕсли;	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСуммы", "ВТ.Сумма <> 0" + ТекстУсловия);
		
	Если ОсновноеСредство <> Неопределено Тогда
		Запрос.УстановитьПараметр("ОС", ОсновноеСредство);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Субконто1 В (&ОС)", "ИСТИНА");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОсновноеСредство В (&ОС)", "ИСТИНА");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если пТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрока = Объект.ОсновныеСредства.НайтиПоИдентификатору(пТекущаяСтрока);
		ОчиститьСтроку(ТекущаяСтрока);
	КонецЕсли;
	
	Пока Выборка.Следующий()Цикл
		
		Если пТекущаяСтрока = Неопределено Тогда
			ТекущаяСтрока = Объект.ОсновныеСредства.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Выборка);
		
		Если Не Выборка.БиблиотечныйФонд Тогда
			Если Выборка.Количество > 1 Тогда
				ТекущаяСтрока.Количество = 1;
				ТекущаяСтрока.Сумма		 = Выборка.Цена;
				Если Выборка.СпособНачисленияАмортизации = Перечисления.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию Тогда
					Если Выборка.Состояние = Перечисления.СостоянияОС.ВведеноВЭксплуатацию Тогда
						ТекущаяСтрока.НачисленнаяАмортизация = Мин(Выборка.Цена, Выборка.НачисленнаяАмортизация);
					Иначе
						ТекущаяСтрока.НачисленнаяАмортизация  = 0;
					КонецЕсли;
				Иначе
					ТекущаяСтрока.НачисленнаяАмортизация = ?(Выборка.Количество > 0, Выборка.НачисленнаяАмортизация / Выборка.Количество, 0);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьДополнительныеРеквизитыСтроки(ТекущаяСтрока);
		
		РассчитатьСтроку(ТекущаяСтрока, Объект.Организация, Объект.Дата, Объект.ВидНФА);
		
	КонецЦикла;
	
	Если Выборка.Количество() = 0 Тогда
		
		Если ОсновноеСредство = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Отсуствуют основные средства, соответствующие установленым парметрам'"));
			
		Иначе
			НомерСтроки = Объект.ОсновныеСредства.Индекс(ТекущаяСтрока);
			ТекстСообщения = СтрШаблон(НСтр("ru='Стр %1: выбранное основное средство не соответствует установленым параметрам'"), НомерСтроки + 1);
			ПолеСообщения = СтрШаблон("Объект.ОсновныеСредства[%1].ОсновноеСредство", НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, ПолеСообщения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСтроку(ТекущаяСтрока)
	
	Реквизиты = Метаданные.Документы.КорректировкаАмортизации.ТабличныеЧасти.ОсновныеСредства.Реквизиты;
	Для Каждого Реквизит Из Реквизиты Цикл
		ТекущаяСтрока[Реквизит.Имя] = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьСтроку(ТекущаяСтрока, Организация, Дата, ВидНФА)
	
	ТекущаяСтрока.РассчитаннаяАмортизация = 0;
	ТекущаяСтрока.КорректировкаАмортизации = 0;
	ТекущаяСтрока.ОставшийсяСрок = 0;
	
	Если ТекущаяСтрока.Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если ТекущаяСтрока.ПорядокПогашенияСтоимости <> ПредопределенноеЗначение("Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации") Тогда 		
		ТекущаяСтрока.СпособНачисленияАмортизации = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.СпособНачисленияАмортизации) Тогда
		Возврат;
	КонецЕсли;	
	
	СрокЭксплР						= РассчитатьСрокЭксплуатацииСервер(ТекущаяСтрока.ОсновноеСредство,ТекущаяСтрока.ИнвентарныйНомер,Организация,КонецМесяца(Дата),Истина);
	ТекущаяСтрока.ДатаПоступления	= СрокЭксплР.ДатаВвода;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.ДатаПоступления) Тогда
		ТекстСообщения = НСтр("ru='Не заполнена дата принятия к учету для " + ТекущаяСтрока.ОсновноеСредство + "'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ОсновныеСредства["+Строка(ТекущаяСтрока.НомерСтроки-1)+"].ДатаПоступления");
		Возврат;
	КонецЕсли;
	
	// Расчет амортизации
	
	СрокЭкспл = СрокЭксплР.СрокЭксплМ;
	
	ТекущаяСтрока.РассчитаннаяАмортизация = ТекущаяСтрока.Сумма;
	
	Если ТекущаяСтрока.СпособНачисленияАмортизации = ПредопределенноеЗначение("Перечисление.СпособНачисленияАмортизации.Линейный") Тогда
		
		Если ТекущаяСтрока.СрокПолезногоИспользования = 0 Тогда
			ТекстСообщения = НСтр("ru='Не задан срок полезного использования для " + ТекущаяСтрока.ОсновноеСредство + "'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ОсновныеСредства["+Строка(ТекущаяСтрока.НомерСтроки-1)+"].СрокПолезногоИспользования");
			Возврат;
		КонецЕсли;
		
		к = СрокЭкспл/ТекущаяСтрока.СрокПолезногоИспользования;
		Если к < 1 Тогда
			ТекущаяСтрока.РассчитаннаяАмортизация = Окр(ТекущаяСтрока.Сумма*к,2,1); 
		КонецЕсли;
		
		ТекущаяСтрока.ОставшийсяСрок = ТекущаяСтрока.СрокПолезногоИспользования - СрокЭкспл;
		
	Иначе
		
		ТекущаяСтрока.КорректировкаАмортизации = Макс(ТекущаяСтрока.РассчитаннаяАмортизация - ТекущаяСтрока.НачисленнаяАмортизация, 0);

	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция РассчитатьСрокЭксплуатацииСервер(ОсновноеСредство,ИнвНомер,Организация,ТекДата,УчитыватьПринятие)

	Возврат УправлениеОсновнымиСредствами.РассчитатьСрокЭксплуатации(ОсновноеСредство,ИнвНомер,Организация,ТекДата,УчитыватьПринятие);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьГраницыИнтервала(ИнтервалЦен)
	
	ГраницыИнтервала = Новый Структура("НижняяГраница, ВерхняяГраница", 0, 0);
	
	Если ИнтервалЦен = 1 Тогда
		ГраницыИнтервала.НижняяГраница  = 0; 
		ГраницыИнтервала.ВерхняяГраница = 3000;		
	ИначеЕсли ИнтервалЦен = 2 Тогда
		ГраницыИнтервала.НижняяГраница  = 3000;
		ГраницыИнтервала.ВерхняяГраница = 10000;
	ИначеЕсли ИнтервалЦен = 3 Тогда
		ГраницыИнтервала.НижняяГраница  = 3000;
		ГраницыИнтервала.ВерхняяГраница = 20000;
	ИначеЕсли ИнтервалЦен = 4 Тогда
		ГраницыИнтервала.НижняяГраница  = 10000;
		ГраницыИнтервала.ВерхняяГраница = 20000;
	ИначеЕсли ИнтервалЦен = 5 Тогда
		ГраницыИнтервала.НижняяГраница  = 20000;
		ГраницыИнтервала.ВерхняяГраница = 40000;
	ИначеЕсли ИнтервалЦен = 6 Тогда
		ГраницыИнтервала.НижняяГраница  = 20000;
	ИначеЕсли ИнтервалЦен = 7 Тогда
		ГраницыИнтервала.НижняяГраница  = 40000; 
	КонецЕсли;
		
	Возврат ГраницыИнтервала;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыОС()
	
	Для Каждого ТекущаяСтрока Из Объект.ОсновныеСредства Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыОС(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыОС(ТекущаяСтрока)
	
	ТекущаяСтрока.ЗаголовокНачисленная		= НСтр("ru = 'начисленная:'");
	ТекущаяСтрока.ЗаголовокРассчитанная		= НСтр("ru = 'рассчитанная:'");
	ТекущаяСтрока.ЗаголовокКорректировка	= НСтр("ru = 'корректировка:'");
	
КонецПроцедуры

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
