
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьТолькоОстатки = Истина;
	
	Количество = Параметры.Количество;
	АдресТаблицыРНПТВХранилище = Параметры.АдресТаблицыРНПТВХранилище;
	
	ИмяТаблицы = Параметры.ИмяТаблицы;
	
	ТекПериод = Параметры.Период;
	ПериодОснование = Дата(1,1,1);
	Если НЕ ЗначениеЗаполнено(ТекПериод) Тогда
		ТекПериод = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	ПериодЗапроса = Новый Граница(КонецДня(ТекПериод), ВидГраницы.Включая);
	Если ЗначениеЗаполнено(Параметры.ТекущийДокумент) Тогда
			ПериодЗапроса = Новый Граница(Параметры.ТекущийДокумент.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;

	Если Параметры.ЭтоКорректировка Тогда
		Если ЗначениеЗаполнено(Параметры.ДокументОснование) Тогда
			ПериодОснование = Новый Граница(Параметры.ДокументОснование.МоментВремени());
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "ЭтоПоступление, Номенклатура, ОткрыватьДляПросмотра, Организация, КомплектСпрослеживаемымиТоварами");
	
	Остатки.Параметры.УстановитьЗначениеПараметра("Период",              ПериодЗапроса);
	Остатки.Параметры.УстановитьЗначениеПараметра("Номенклатура",        Параметры.Номенклатура);
	Остатки.Параметры.УстановитьЗначениеПараметра("Организация",         Параметры.Организация);
	Остатки.Параметры.УстановитьЗначениеПараметра("СтранаПроисхождения", Параметры.СтранаПроисхождения);
	Остатки.Параметры.УстановитьЗначениеПараметра("ЭтоПоступление",      ЭтоПоступление ИЛИ ОткрыватьДляПросмотра);
	Остатки.Параметры.УстановитьЗначениеПараметра("ДокументОснование",   Параметры.ДокументОснование);
	Остатки.Параметры.УстановитьЗначениеПараметра("ПериодОснование",     ПериодОснование);
	Остатки.Параметры.УстановитьЗначениеПараметра("ЭтоКорректировка",    Параметры.ЭтоКорректировка);
	
	СвойстваНоменклатуры = ЗначимыеРеквизитыНоменклатуры(Номенклатура);
	РаботаУслугаСпрослеживаемымиТоварами = КомплектСпрослеживаемымиТоварами И СвойстваНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа;
	ЭтоВыпуск = ЭтоПервичныйВыпуск(Параметры.ТекущийДокумент);
	
	ПоВариантамКомплектов = КомплектСпрослеживаемымиТоварами
		И (НЕ (ЭтоВыпуск ИЛИ ЭтоПоступление))
		И НЕ РаботаУслугаСпрослеживаемымиТоварами;
	
	ВариантКомплекта = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ВариантКомплекта", Справочники.ВариантыКомплектовМЗПТ.ПустаяСсылка());
	Если ПоВариантамКомплектов Тогда
		Если Не ЗначениеЗаполнено(ВариантКомплекта) Тогда
			ЗапросОсновногоВарианта = Справочники.ВариантыКомплектовМЗПТ.ПолучитьРезультатЗапросаВариантовПоВЛадельцу(Параметры.Номенклатура, Истина);
			Если Не ЗапросОсновногоВарианта.Пустой() Тогда
				Выборка = ЗапросОсновногоВарианта.Выбрать();
				Выборка.Следующий();
				ВариантКомплекта = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;
		Остатки.Параметры.УстановитьЗначениеПараметра("ВариантКомплекта", ВариантКомплекта);
	Иначе
		Остатки.Параметры.УстановитьЗначениеПараметра("ВариантКомплекта", Справочники.ВариантыКомплектовМЗПТ.ПустаяСсылка());
	КонецЕсли;
	Остатки.Параметры.УстановитьЗначениеПараметра("Комплект", КомплектСпрослеживаемымиТоварами);
		
	ТаблицаРНПТ = ПолучитьИзВременногоХранилища(ЭтотОбъект.АдресТаблицыРНПТВХранилище);
	
	Подбор.Очистить();
	Подбор.Загрузить(ТаблицаРНПТ);
	
	Если Параметры.ЭтоВозвратПоставщику Тогда
		Остатки.ТекстЗапроса = ТекстЗапросаВозвратТоваровПоставщику();
		Остатки.Параметры.УстановитьЗначениеПараметра("ДатаТекущегоДокумента", Параметры.ДатаТекущегоДокумента);
		Остатки.Параметры.УстановитьЗначениеПараметра("ТекущийДокумент",       Параметры.ТекущийДокумент);
		Остатки.Параметры.УстановитьЗначениеПараметра("ДокументРеализации",    Параметры.ДокументРеализации);
	КонецЕсли;
	Если Параметры.ЭтоВозврат Тогда
		Остатки.ТекстЗапроса = ТекстЗапросаВозвратТоваров();
		Остатки.Параметры.УстановитьЗначениеПараметра("ДатаРеализации",        Параметры.ДатаРеализации);
		Остатки.Параметры.УстановитьЗначениеПараметра("ДатаТекущегоДокумента", Параметры.ДатаТекущегоДокумента);
		Остатки.Параметры.УстановитьЗначениеПараметра("ТекущийДокумент",       Параметры.ТекущийДокумент);
	КонецЕсли;
	
	КоличествоПодобрано = Подбор.Итог("Количество");
	
	Если КомплектСпрослеживаемымиТоварами Тогда
		Если НЕ ЭтоПоступление Тогда
			ЗаполнитьТаблицуОстатков();
			ЗаполнитьТаблицуПотребностейКомплекта();
		КонецЕсли;
		ОбновитьВычисляемыеДанныеПодбор();
		РазныеЕдиницыИзмерения = Истина;
	Иначе
		РазныеЕдиницыИзмерения = СвойстваНоменклатуры.ЕдиницаИзмерения <> СвойстваНоменклатуры.КодТНВЭДЕдиницаИзмерения;
	КонецЕсли;	
		
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'РНПТ: %1'"),
		Параметры.Номенклатура);
	
	Если Параметры.ОткрыватьДляПросмотра Тогда
		Элементы.ПеренестиВДокумент.Заголовок = НСтр("ru = 'ОК'");
	КонецЕсли;
	
	УстановитьЗаголовкиКолонок(СвойстваНоменклатуры);
	УстановитьЗначениеПараметраПоказыватьТолькоОстатки(ЭтотОбъект);
	УстановитьТекстПодсказки(ЭтотОбъект);
	УстановитьВидимостьЭлементовФормы();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ЕстьОшибки = Ложь;
	Если Подбор.Количество() <> 0
		И Модифицированность Тогда
		
		Если КомплектСпрослеживаемымиТоварами  Тогда
			Если Не ЭтоПоступление Тогда
				СообщитьОшибкиКонтроляПодбораПоОстаткам(ЕстьОшибки);
			КонецЕсли;
		Иначе	
			Если КоличествоПодобрано > Количество  Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Список", 
				"Корректность",,,
				НСтр("ru = 'Подбор'"), 
				НСтр("ru = 'Подобранное количество РНПТ превышает количество, указанное в документе'"));
			ИначеЕсли КоличествоПодобрано < Количество Тогда
				ЕстьОшибки = Истина;
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Список", 
				"Корректность",,,
				НСтр("ru = 'Подбор'"), 
				НСтр("ru = 'Подобранное количество РНПТ меньше количества, указанного в документе'"));
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьОшибки Тогда
			Если ПеренестиВДокумент Тогда
				ПеренестиВДокумент = Ложь;
				Если ТекстСообщения = Неопределено Тогда 
					Отказ = ЕстьОшибки;
				Иначе	
					ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Подбор",,Отказ);
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Если Не ПеренестиВДокумент Тогда
				ТекстВопроса = НСтр("ru = 'Подобранные РНПТ не перенесены в документ.
					|
					|Перенести?'");
				Оповещение = Новый ОписаниеОповещения("ВопросПеренестиВДокументЗавершение", ЭтотОбъект);
				ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	СтруктураВозврата = ПриЗакрытииНаСервере();
	
	Если ПеренестиВДокумент Тогда
		ОповеститьОВыборе(СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	СтруктураВозврата = Новый Структура();
	
	Если ПеренестиВДокумент Тогда
		АдресТаблицыРНПТВХранилище = ПоместитьРНПТВХранилище();
		СтруктураВозврата.Вставить("АдресТаблицыРНПТВХранилище", АдресТаблицыРНПТВХранилище);
		СтруктураВозврата.Вставить("ВариантКомплектаПТ", ВариантКомплекта);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказыватьТолькоОстаткиПриИзменении(Элемент)
	
	УстановитьЗначениеПараметраПоказыватьТолькоОстатки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантКомплектаПТПриИзменении(Элемент)
	
	Если ПоВариантамКомплектов Тогда
		Остатки.Параметры.УстановитьЗначениеПараметра("ВариантКомплекта", ВариантКомплекта);
		Подбор.Очистить();
		ЗаполнитьТаблицуОстатков();
		ОбновитьВычисляемыеДанныеПодбор();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстатки

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаПодбора = Элементы.Остатки.ДанныеСтроки(ВыбраннаяСтрока);
	
	Если СтрокаПодбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоПодобрано = Подбор.Итог("Количество");
	Отбор = Новый Структура("РНПТ", СтрокаПодбора.РНПТ);
	
	Если КомплектСпрослеживаемымиТоварами Тогда
		Если ПоВариантамКомплектов Тогда
			Подбор.Очистить();
			Если ТаблицаПотребностейКомплекта.Итог("Потребность") = 0 Тогда
				ЗаполнитьТаблицуПотребностейКомплекта();
			КонецЕсли;
			Для Каждого СтрокаПотрбености Из ТаблицаПотребностейКомплекта Цикл
				ОтборКомплектующих = Новый Структура("Комплектующее", СтрокаПотрбености.Комплектующее);
				СтрокиПовторовКомплектующих = ТаблицаОстатков.НайтиСтроки(ОтборКомплектующих);
				Для Каждого СтрокаПодбора Из СтрокиПовторовКомплектующих Цикл
					Если СтрокаПотрбености.Потребность > 0 Тогда
						НоваяСтрока = Подбор.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПодбора);
						Дельта = СтрокаПотрбености.Потребность - НоваяСтрока.Количество;
						Если Дельта>=0 Тогда
							СтрокаПотрбености.Потребность = Дельта;
						Иначе
							НоваяСтрока.Количество = СтрокаПотрбености.Потребность;
							СтрокаПотрбености.Потребность = 0;
						КонецЕсли;
						КоэффициентПереводаЕИ = СтрокаПодбора.КоличествоПрослеживаемости / СтрокаПодбора.Количество;
						НоваяСтрока.КоличествоПрослеживаемости = НоваяСтрока.Количество * КоэффициентПереводаЕИ;
						НоваяСтрока.СуммаБезНДС = СтрокаПодбора.СуммаБезНДС / СтрокаПодбора.Количество * НоваяСтрока.Количество;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Иначе
			Отбор.Вставить("Комплектующее", СтрокаПодбора.Комплектующее);
			СтрокиСРНПТ = Подбор.НайтиСтроки(Отбор);
			
			ТекущаяСтрока =?(СтрокиСРНПТ.Количество() = 0, Подбор.Добавить(), СтрокиСРНПТ[0]);
			
			СтруктураРеквизитовПодбора = Новый Структура("КоличествоВложений, СтранаПроисхождения, СуммаБезНДС, Количество, КоличествоПрослеживаемости, Комплектующее, РНПТ");
			ЗаполнитьЗначенияСвойств(СтруктураРеквизитовПодбора, СтрокаПодбора);
			ЗаполнитьВычисляемыеРеквизитыСтрокиПодбора(СтруктураРеквизитовПодбора, Количество);
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураРеквизитовПодбора);
		КонецЕсли;
	Иначе
		СтрокиСРНПТ = Подбор.НайтиСтроки(Отбор);
		Если СтрокаПодбора.Количество + КоличествоПодобрано > Количество Тогда
			
			КоличествоСкорректированное = Количество - КоличествоПодобрано;
			
			Если КоличествоСкорректированное = 0 Тогда
				ТекстСообщения = НСтр("ru='Все РНПТ подобраны.'");
				ПоказатьПредупреждение(, ТекстСообщения);
				Возврат;
			КонецЕсли;
			
			Если СтрокиСРНПТ.Количество() = 0 Тогда
				НоваяСтрока = Подбор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПодбора);
				НоваяСтрока.Количество = КоличествоСкорректированное;
				НоваяСтрока.КоличествоПрослеживаемости = КоличествоПрослеживаемости(
				СтрокаПодбора.Количество, СтрокаПодбора.КоличествоПрослеживаемости, КоличествоСкорректированное);
			Иначе
				СтрокиСРНПТ[0].Количество = СтрокиСРНПТ[0].Количество + КоличествоСкорректированное;
				СтрокиСРНПТ[0].КоличествоПрослеживаемости = СтрокиСРНПТ[0].КоличествоПрослеживаемости + КоличествоПрослеживаемости(
				СтрокаПодбора.Количество, СтрокаПодбора.КоличествоПрослеживаемости, КоличествоСкорректированное);
			КонецЕсли;
		Иначе
			Если СтрокиСРНПТ.Количество() = 0 Тогда
				НоваяСтрока = Подбор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПодбора);
			Иначе
				СтрокиСРНПТ[0].Количество = СтрокиСРНПТ[0].Количество + СтрокаПодбора.Количество;
				СтрокиСРНПТ[0].КоличествоПрослеживаемости = СтрокиСРНПТ[0].КоличествоПрослеживаемости + СтрокаПодбора.КоличествоПрослеживаемости;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Поле <> Неопределено Тогда
		КоличествоПодобрано = Подбор.Итог("Количество");
		УстановитьТекстПодсказки(ЭтотОбъект);
	КонецЕсли;

	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ВыделенныеСтроки = Элемент.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() Тогда
		Если ПоВариантамКомплектов Тогда
			ОстаткиВыбор(Элемент, ВыделенныеСтроки[0], , СтандартнаяОбработка);
		Иначе
			Для Каждого ВыделеннаяСтрока Из Элемент.ВыделенныеСтроки Цикл
				ОстаткиВыбор(Элемент, ВыделеннаяСтрока, , СтандартнаяОбработка);
				КоличествоПодобрано = Подбор.Итог("Количество");
				УстановитьТекстПодсказки(ЭтотОбъект);
			КонецЦикла;
		КонецЕсли;
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПодбор

&НаКлиенте
Процедура ПодборПриИзменении(Элемент)
	
	КоличествоПодобрано = Подбор.Итог("Количество");
	УстановитьТекстПодсказки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомплектующееПриИзменении(Элемент)
	
	Если ЭтоПоступление Тогда
		ТекущиеДанные = Элементы.Подбор.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущиеДанные.СтранаПроисхождения = ЗначимыеРеквизитыНоменклатуры(ТекущиеДанные.Комплектующее).СтранаПроисхождения;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодборПередНачаломИзменения(Элемент, Отказ)
	ТекущееКоличествоКомплектующего = Элементы.Подбор.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ПодборКоличествоПриИзменении(Элемент)
	
	Если КомплектСпрослеживаемымиТоварами Тогда
		
		ТекущиеДанные = Элементы.Подбор.ТекущиеДанные;
		
		Если НЕ ПоВариантамКомплектов Тогда
			ТекущиеДанные.КоличествоВложений = ?(Количество > 0, ТекущиеДанные.Количество / Количество, 0);
		КонецЕсли;
		ТекущиеДанные.СуммаБезНДС = ?(ТекущееКоличествоКомплектующего > 0, ТекущиеДанные.СуммаБезНДС / ТекущееКоличествоКомплектующего * ТекущиеДанные.Количество, 0);
		
		Если ТекущееКоличествоКомплектующего > 0 И ТекущиеДанные.КоличествоПрослеживаемости > 0 Тогда
			ТекущиеДанные.КоличествоПрослеживаемости = ТекущиеДанные.КоличествоПрослеживаемости / ТекущееКоличествоКомплектующего * ТекущиеДанные.Количество;
		Иначе
			Если ЗначениеЗаполнено(ТекущиеДанные.Комплектующее) Тогда
				СвойстваКомплектующего = ЗначимыеРеквизитыНоменклатуры(ТекущиеДанные.Комплектующее);
				Если СвойстваКомплектующего.ЕдиницаИзмерения <> СвойстваКомплектующего.КодТНВЭДЕдиницаИзмерения Тогда
					ТекущиеДанные.КоличествоПрослеживаемости = СвойстваКомплектующего.ВесПоСертификатуТовара;
				Иначе
					ТекущиеДанные.КоличествоПрослеживаемости = ТекущиеДанные.Количество;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПеренестиВДокумент = НЕ ЭтаФорма.ТолькоПросмотр;
	Закрыть(КодВозвратаДиалога.OK);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьТаблицуОстатков()
	
	Запрос = Новый Запрос(Остатки.ТекстЗапроса);
	Для Каждого Элемент Из Остатки.Параметры.Элементы Цикл
		Запрос.УстановитьПараметр(Строка(Элемент.Параметр), Элемент.Значение);
	КонецЦикла;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	Если СхемаЗапроса.ПакетЗапросов.Количество() Тогда
		ТаблицаПомещения = СхемаЗапроса.ПакетЗапросов[0].ТаблицаДляПомещения;
		Если ТаблицаПомещения = "ВТ_ПрослеживаемыеТоварыОстатки" Тогда
			СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Источники[0].Соединения[0].ТипСоединения = ТипСоединенияСхемыЗапроса.Внутреннее;
			Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаОстатков.Загрузить(Запрос.Выполнить().Выгрузить());
	ТаблицаОстатков.Сортировать("ДатаПоступления");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПотребностейКомплекта()
	ТаблицаПотребностейКомплекта.Загрузить(РегистрыСведений.СоставыКомплектовМЗПТ.ПолучитьТаблицуОбеспеченияКомплекта(ЭтотОбъект, Количество));
КонецПроцедуры

&НаСервере
Процедура ОбновитьВычисляемыеДанныеПодбор()
	
	Для Каждого СтрокаПодбора Из Подбор Цикл
		ЗаполнитьВычисляемыеРеквизитыСтрокиПодбора(СтрокаПодбора, Количество);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗначимыеРеквизитыНоменклатуры(ТекущаяНоменклатура)
	
	Возврат	ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяНоменклатура, 
	"ЕдиницаИзмерения, 
	|КодТНВЭД.ЕдиницаИзмерения, 
	|ТипНоменклатуры,
	|ВесПоСертификатуТовара,
	|СтранаПроисхождения");

КонецФункции	

&НаСервере
Процедура ЗаполнитьВычисляемыеРеквизитыСтрокиПодбора(СтрокаПодбора, КоличествоКомплектов)
			
		СтрокаОстатков = ДанныеТаблицыОстатков(СтрокаПодбора);
		Если СтрокаОстатков.КоличествоВложений = 0 Тогда
			СтрокаПодбора.КоличествоВложений = ?(КоличествоКомплектов > 0, СтрокаПодбора.Количество / КоличествоКомплектов, 1);
		Иначе
			СтрокаПодбора.КоличествоВложений = СтрокаОстатков.КоличествоВложений;
		КонецЕсли;
		Если Не ЭтоПоступление Тогда
			СтрокаПодбора.СуммаБезНДС = ?(СтрокаОстатков.Количество > 0, СтрокаОстатков.СуммаБезНДС / СтрокаОстатков.Количество * СтрокаПодбора.Количество, 0);
		КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ДанныеТаблицыОстатков(СтрокаПодбора)
	
	СтрокаОстатков = Новый Структура;
	СтрокаОстатков.Вставить("РНПТ", Справочники.НомераГТД.ПустаяСсылка());
	СтрокаОстатков.Вставить("Комплектующее", Справочники.Номенклатура.ПустаяСсылка());
	СтрокаОстатков.Вставить("СтранаПроисхождения", Справочники.СтраныМира.ПустаяСсылка());
	СтрокаОстатков.Вставить("Количество", 0);
	СтрокаОстатков.Вставить("КоличествоПрослеживаемости", 0);
	СтрокаОстатков.Вставить("СуммаБезНДС", 0);
	СтрокаОстатков.Вставить("КоличествоВложений", 0);

	Отбор = Новый Структура("Комплектующее, РНПТ", СтрокаПодбора.Комплектующее, СтрокаПодбора.РНПТ);
	
	Если ЗначениеЗаполнено(СтрокаПодбора.СтранаПроисхождения) Тогда
		Отбор.Вставить("СтранаПроисхождения", СтрокаПодбора.СтранаПроисхождения);
	КонецЕсли;
	
	Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
	Если Строки.Количество() Тогда
		ЗаполнитьЗначенияСвойств(СтрокаОстатков, Строки[0]);
	КонецЕсли;
	
	Возврат СтрокаОстатков;

КонецФункции

&НаСервере
Процедура СообщитьОшибкиКонтроляПодбораПоОстаткам(Отказ)
		
	Ошибки = Неопределено;
	
	Для Каждого ПодбраннаяСтрока Из Подбор Цикл
		
		Дельта =  ДанныеТаблицыОстатков(ПодбраннаяСтрока).Количество - ПодбраннаяСтрока.Количество;
		Если Дельта < 0 Тогда			  
			ШаблонСообщения = НСтр("ru = 'Подобранное количество %1 превышает остаток на %2'"); 
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ПодбраннаяСтрока.Комплектующее, -Дельта);		  
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Подбор[%1].Комплектующее", ТекстОшибки,,Подбор.Индекс(ПодбраннаяСтрока)+1,,Подбор.Индекс(ПодбраннаяСтрока)); 					  
		КонецЕсли;
		  	  
	КонецЦикла;	
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		
КонецПроцедуры	

&НаСервере
Функция КоличествоПрослеживаемости(ОстатокВУчете, ОстатокВПрослеживаемости, ПодобранноеКоличество)
	
	МассивКоэффициентов = Новый Массив;
	МассивКоэффициентов.Добавить(ОстатокВУчете - ПодобранноеКоличество);
	МассивКоэффициентов.Добавить(ПодобранноеКоличество);
	МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
		ОстатокВПрослеживаемости, МассивКоэффициентов, 11);
	
	Возврат МассивСумм[1];
	
КонецФункции

&НаСервере
Функция ПоместитьРНПТВХранилище()
	
	Если НЕ РазныеЕдиницыИзмерения Тогда
		Для Каждого СтрокаРНПТ Из Подбор Цикл
			СтрокаРНПТ.КоличествоПрослеживаемости = СтрокаРНПТ.Количество;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаРНПТ = Подбор.Выгрузить();
	АдресТаблицыРНПТВХранилище = ПоместитьВоВременноеХранилище(ТаблицаРНПТ, УникальныйИдентификатор);
	
	Возврат АдресТаблицыРНПТВХранилище;
	
КонецФункции

&НаСервере
Процедура УстановитьЗаголовкиКолонок(СвойстваНоменклатуры)
	
	ТекстЗаголовкаКоличество = НСтр("ru = 'Количество'");
	ТекстЗаголовкаКоличествоПрослеживаемости = НСтр("ru = 'Количество прослеживаемости'");
	Если РазныеЕдиницыИзмерения Тогда
		ТекстЗаголовкаКоличество = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),
		ТекстЗаголовкаКоличество,
		СвойстваНоменклатуры.ЕдиницаИзмерения);
		ТекстЗаголовкаКоличествоПрослеживаемости = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"),
		ТекстЗаголовкаКоличествоПрослеживаемости,
		СвойстваНоменклатуры.КодТНВЭДЕдиницаИзмерения);
	КонецЕсли;
	Элементы.ОстаткиКоличество.Заголовок = ТекстЗаголовкаКоличество;
	Элементы.ПодборКоличество.Заголовок  = ТекстЗаголовкаКоличество;
	Элементы.ОстаткиКоличествоПрослеживаемости.Заголовок  = ТекстЗаголовкаКоличествоПрослеживаемости;
	Элементы.ПодборКоличествоПрослеживаемости.Заголовок   = ТекстЗаголовкаКоличествоПрослеживаемости;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// КоличествоПрослеживаемости в остатках
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ОстаткиКоличествоПрослеживаемости");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РазныеЕдиницыИзмерения", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// КоличествоПрослеживаемости в подборе
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПодборКоличествоПрослеживаемости");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"РазныеЕдиницыИзмерения", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ИменаЭлементовКомплект = Новый Массив; 
	ИменаЭлементовКомплект.Добавить("ОстаткиКомплектующее");
	ИменаЭлементовКомплект.Добавить("ОстаткиСуммаБезНДС");
	ИменаЭлементовКомплект.Добавить("ПодборКомплектующее"); 
	ИменаЭлементовКомплект.Добавить("ПодборСтранаПроисхождения");

	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	ИменаЭлементовКомплект,
	"Видимость",
	КомплектСпрослеживаемымиТоварами);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	"ПодборСуммаБезНДС",
	"Видимость",
	КомплектСпрослеживаемымиТоварами);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	"ПодборСуммаБезНДС",
	"ТолькоПросмотр",
	НЕ ЭтоПоступление);
	
	ИменаЭлементовПоВариантамКомплектов = Новый Массив;
	ИменаЭлементовПоВариантамКомплектов.Добавить("ОстаткиКоличествоВложений");
	ИменаЭлементовПоВариантамКомплектов.Добавить("ОстаткиВариантКомплекта");
	ИменаЭлементовПоВариантамКомплектов.Добавить("ПодборВариантКомплекта");

	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	ИменаЭлементовПоВариантамКомплектов,
	"Видимость",
	ПоВариантамКомплектов);
	
	ИменаЭлементовВариант = Новый Массив;
	ИменаЭлементовВариант.Добавить("ПодборКоличествоВложений");
	ИменаЭлементовВариант.Добавить("ВариантКомплектаПТ");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
	ИменаЭлементовВариант,
	"Видимость",
	ПоВариантамКомплектов ИЛИ ЭтоВыпуск);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	"ГруппаОстатки",
	"Видимость",
	НЕ (ЭтоПоступление ИЛИ ОткрыватьДляПросмотра));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	"ПодборДобавить",
	"Видимость",
	ЭтоПоступление);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
	"Остатки",
	"ТолькоПросмотр",
	ПоВариантамКомплектов ИЛИ РаботаУслугаСпрослеживаемымиТоварами);
		
	ЭтотОбъект.ТолькоПросмотр = ОткрыватьДляПросмотра;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗначениеПараметраПоказыватьТолькоОстатки(Форма)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
		Форма.Остатки, 
		"Количество", 
		0, 
		Форма.ПоказыватьТолькоОстатки, 
		ВидСравненияКомпоновкиДанных.Больше
		);

КонецПроцедуры

&НаКлиенте
Процедура ВопросПеренестиВДокументЗавершение(ОтветНаВопрос, ДополнительныеПараметры) Экспорт
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		ПеренестиВДокумент = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстПодсказки(Форма)
	
	Если Форма.КомплектСпрослеживаемымиТоварами Тогда
		Форма.НадписьПодобраноРНПТ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Подобрано %1 РНПТ для %2:'"), Форма.КоличествоПодобрано, Форма.Количество);
	Иначе	
		Форма.НадписьПодобраноРНПТ = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Подобрано %1 РНПТ из %2:'"), Форма.КоличествоПодобрано, Форма.Количество);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаВозвратТоваровПоставщику()

	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНомераГТД.Ссылка КАК РНПТ,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемости, 0) КАК КоличествоПрослеживаемости,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.ВариантКомплекта, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектовМЗПТ.ПустаяСсылка)) КАК ВариантКомплекта,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.Комплектующее, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Комплектующее,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоВложений, 0) КАК КоличествоВложений,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.СуммаБезНДС, 0) КАК СуммаБезНДС,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.ДатаПоступления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоступления
	|ИЗ
	|	Справочник.НомераГТД КАК СправочникНомераГТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоступленияМинусВозврат.РНПТ КАК РНПТ,
	|			ПоступленияМинусВозврат.Организация КАК Организация,
	|			ПоступленияМинусВозврат.СтранаПроисхождения КАК СтранаПроисхождения,
	|			ПоступленияМинусВозврат.Номенклатура КАК Номенклатура,
	|			ПоступленияМинусВозврат.ВариантКомплекта КАК ВариантКомплекта,
	|			ПоступленияМинусВозврат.Комплектующее КАК Комплектующее,
	|			ПоступленияМинусВозврат.КоличествоВложений КАК КоличествоВложений,
	|			СУММА(ПоступленияМинусВозврат.Количество) КАК Количество,
	|			СУММА(ПоступленияМинусВозврат.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости,
	|			СУММА(ПоступленияМинусВозврат.СуммаБезНДС) КАК СуммаБезНДС,
	|			ПоступленияМинусВозврат.ДатаПоступления КАК ДатаПоступления
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ЗакупленныеТовары.Организация КАК Организация,
	|				ЗакупленныеТовары.Номенклатура КАК Номенклатура,
	|				ЗакупленныеТовары.ВариантКомплекта КАК ВариантКомплекта,
	|				ЗакупленныеТовары.Комплектующее КАК Комплектующее,
	|				ЗакупленныеТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|				ЗакупленныеТовары.РНПТ КАК РНПТ,
	|				ЗакупленныеТовары.Количество КАК Количество,
	|				ЗакупленныеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|				ЕСТЬNULL(СоставыКомплектовМЗПТ.КоличествоВложений, 0) КАК КоличествоВложений,
	|				ЗакупленныеТовары.СуммаБезНДС КАК СуммаБезНДС,
	|				ЕСТЬNULL(СвойстваРНПТ.ДатаПоступления, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоступления
	|			ИЗ
	|				РегистрНакопления.ПрослеживаемыеТовары КАК ЗакупленныеТовары
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставыКомплектовМЗПТ КАК СоставыКомплектовМЗПТ
	|					ПО ЗакупленныеТовары.Организация = СоставыКомплектовМЗПТ.Организация
	|						И ЗакупленныеТовары.Номенклатура = СоставыКомплектовМЗПТ.Комплект
	|						И ЗакупленныеТовары.ВариантКомплекта = СоставыКомплектовМЗПТ.ВариантКомплекта
	|						И ЗакупленныеТовары.Комплектующее = СоставыКомплектовМЗПТ.Комплектующее
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваРНПТ КАК СвойстваРНПТ
	|					ПО ЗакупленныеТовары.РНПТ = СвойстваРНПТ.РНПТ
	|						И ЗакупленныеТовары.Организация = СвойстваРНПТ.Организация
	|			ГДЕ
	|				ЗакупленныеТовары.Организация = &Организация
	|				И ЗакупленныеТовары.Номенклатура = &Номенклатура
	|				И ВЫБОР
	|						КОГДА &Комплект
	|							ТОГДА ЗакупленныеТовары.Комплектующее <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|									И ЗакупленныеТовары.ВариантКомплекта = &ВариантКомплекта
	|						ИНАЧЕ ЗакупленныеТовары.СтранаПроисхождения = &СтранаПроисхождения
	|								И ЗакупленныеТовары.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					КОНЕЦ
	|				И ЗакупленныеТовары.Регистратор = &ДокументРеализации
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВозвращенныеТовары.Организация,
	|				ВозвращенныеТовары.Номенклатура,
	|				ВозвращенныеТовары.ВариантКомплекта,
	|				ВозвращенныеТовары.Комплектующее,
	|				ВозвращенныеТовары.СтранаПроисхождения,
	|				ВозвращенныеТовары.РНПТ,
	|				ВЫБОР
	|					КОГДА ВозвращенныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА ВозвращенныеТовары.Количество
	|					ИНАЧЕ -ВозвращенныеТовары.Количество
	|				КОНЕЦ,
	|				ВЫБОР
	|					КОГДА ВозвращенныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|						ТОГДА ВозвращенныеТовары.КоличествоПрослеживаемости
	|					ИНАЧЕ -ВозвращенныеТовары.КоличествоПрослеживаемости
	|				КОНЕЦ,
	|				ЕСТЬNULL(СоставыКомплектовМЗПТ.КоличествоВложений, 0),
	|				ВЫБОР
	|					КОГДА ВозвращенныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|						ТОГДА ЕСТЬNULL(-ВозвращенныеТовары.СуммаБезНДС, 0)
	|					ИНАЧЕ ЕСТЬNULL(ВозвращенныеТовары.СуммаБезНДС, 0)
	|				КОНЕЦ,
	|				ЕСТЬNULL(СвойстваРНПТ.ДатаПоступления, ДАТАВРЕМЯ(1, 1, 1))
	|			ИЗ
	|				РегистрНакопления.ПрослеживаемыеТовары КАК ВозвращенныеТовары
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставыКомплектовМЗПТ КАК СоставыКомплектовМЗПТ
	|					ПО ВозвращенныеТовары.Организация = СоставыКомплектовМЗПТ.Организация
	|						И ВозвращенныеТовары.Номенклатура = СоставыКомплектовМЗПТ.Комплект
	|						И ВозвращенныеТовары.ВариантКомплекта = СоставыКомплектовМЗПТ.ВариантКомплекта
	|						И ВозвращенныеТовары.Комплектующее = СоставыКомплектовМЗПТ.Комплектующее
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваРНПТ КАК СвойстваРНПТ
	|					ПО ВозвращенныеТовары.РНПТ = СвойстваРНПТ.РНПТ
	|						И ВозвращенныеТовары.Организация = СвойстваРНПТ.Организация
	|			ГДЕ
	|				ВозвращенныеТовары.Организация = &Организация
	|				И ВозвращенныеТовары.Номенклатура = &Номенклатура
	|				И ВЫБОР
	|						КОГДА &Комплект
	|							ТОГДА ВозвращенныеТовары.Комплектующее <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|									И ВозвращенныеТовары.ВариантКомплекта = &ВариантКомплекта
	|						ИНАЧЕ ВозвращенныеТовары.СтранаПроисхождения = &СтранаПроисхождения
	|								И ВозвращенныеТовары.Комплектующее = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					КОНЕЦ
	|				И ВозвращенныеТовары.Период <= &ДатаТекущегоДокумента
	|				И ВозвращенныеТовары.Регистратор <> &ТекущийДокумент
	|				И ВозвращенныеТовары.ОснованиеДляВозврата = &ДокументРеализации) КАК ПоступленияМинусВозврат
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоступленияМинусВозврат.РНПТ,
	|			ПоступленияМинусВозврат.СтранаПроисхождения,
	|			ПоступленияМинусВозврат.Номенклатура,
	|			ПоступленияМинусВозврат.Организация,
	|			ПоступленияМинусВозврат.КоличествоВложений,
	|			ПоступленияМинусВозврат.Комплектующее,
	|			ПоступленияМинусВозврат.ВариантКомплекта,
	|			ПоступленияМинусВозврат.ДатаПоступления) КАК ПрослеживаемыеТоварыОстатки
	|		ПО СправочникНомераГТД.Ссылка = ПрослеживаемыеТоварыОстатки.РНПТ"

КонецФункции
 
&НаСервере
Функция ТекстЗапросаВозвратТоваров()
	
	Возврат
	"ВЫБРАТЬ
	|	СправочникНомераГТД.Ссылка КАК РНПТ,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтранаПроисхождения,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ПрослеживаемыеТоварыОстатки.КоличествоПрослеживаемости, 0) КАК КоличествоПрослеживаемости
	|ИЗ
	|	Справочник.НомераГТД КАК СправочникНомераГТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РеализацияМинусВозврат.РНПТ КАК РНПТ,
	|			РеализацияМинусВозврат.Организация КАК Организация,
	|			РеализацияМинусВозврат.СтранаПроисхождения КАК СтранаПроисхождения,
	|			РеализацияМинусВозврат.Номенклатура КАК Номенклатура,
	|			СУММА(РеализацияМинусВозврат.Количество) КАК Количество,
	|			СУММА(РеализацияМинусВозврат.КоличествоПрослеживаемости) КАК КоличествоПрослеживаемости
	|		ИЗ
	|			(ВЫБРАТЬ
	|				РеализованныеТовары.Организация КАК Организация,
	|				РеализованныеТовары.Номенклатура КАК Номенклатура,
	|				РеализованныеТовары.СтранаПроисхождения КАК СтранаПроисхождения,
	|				РеализованныеТовары.Количество КАК Количество,
	|				РеализованныеТовары.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|				РеализованныеТовары.РНПТ КАК РНПТ
	|			ИЗ
	|				РегистрНакопления.ПрослеживаемыеТовары КАК РеализованныеТовары
	|			ГДЕ
	|				РеализованныеТовары.Организация = &Организация
	|				И РеализованныеТовары.Номенклатура = &Номенклатура
	|				И РеализованныеТовары.СтранаПроисхождения = &СтранаПроисхождения
	|				И &ДатаРеализации = НАЧАЛОПЕРИОДА(РеализованныеТовары.Период, ДЕНЬ)
	|				И РеализованныеТовары.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				И РеализованныеТовары.Регистратор <> &ТекущийДокумент
	|				И РеализованныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ВозвращенныеТовары.Организация,
	|				ВозвращенныеТовары.Номенклатура,
	|				ВозвращенныеТовары.СтранаПроисхождения,
	|				-ВозвращенныеТовары.Количество,
	|				-ВозвращенныеТовары.КоличествоПрослеживаемости,
	|				ВозвращенныеТовары.РНПТ
	|			ИЗ
	|				РегистрНакопления.ПрослеживаемыеТовары КАК ВозвращенныеТовары
	|			ГДЕ
	|				ВозвращенныеТовары.Организация = &Организация
	|				И ВозвращенныеТовары.Период <= &ДатаТекущегоДокумента
	|				И ВозвращенныеТовары.Номенклатура = &Номенклатура
	|				И ВозвращенныеТовары.СтранаПроисхождения = &СтранаПроисхождения
	|				И ВозвращенныеТовары.ДатаРеализации = &ДатаРеализации
	|				И ВозвращенныеТовары.Регистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
	|				И ВозвращенныеТовары.Регистратор <> &ТекущийДокумент
	|				И ВозвращенныеТовары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК РеализацияМинусВозврат
	|		
	|		СГРУППИРОВАТЬ ПО
	|			РеализацияМинусВозврат.РНПТ,
	|			РеализацияМинусВозврат.СтранаПроисхождения,
	|			РеализацияМинусВозврат.Номенклатура,
	|			РеализацияМинусВозврат.Организация) КАК ПрослеживаемыеТоварыОстатки
	|		ПО СправочникНомераГТД.Ссылка = ПрослеживаемыеТоварыОстатки.РНПТ";
	
КонецФункции

&НаСервере
Функция ЭтоПервичныйВыпуск(ДокументСсылка)
	
	ТипСсылки = ТипЗнч(ДокументСсылка);
	Возврат ТипСсылки = Тип("ДокументСсылка.ВыпускПродукцииСоСчета106");
	
КонецФункции

#КонецОбласти
