// Модуль предназначен для описания функций, возращающих дополнительные источники данных.
// Каждая функция может возвращать: требуемые параметры, колонки источника данных, сам источник данных (таблица значений).
// Варианты вызова функции взаимоисключающие. Вызываются автоматически.
// Параметры функций:
//	ВариантВызова - Строка	- "ПолучитьПоля" - функция вызвана для получения массива полей. Для добавления полей в массив используется функция "ДобавитьПолеРезультатаФункции".
//							- "ПолучитьПараметры" - функция вызвана для получения массива параметров. Для добавления параметров в массив используется функция "ДобавитьОписаниеПараметраФункции".
//							- "Выполнить" - функция вызвана для выполнения основного алгоритма.
//						Если вариант вызова "ПолучитьПоля" или "ПолучитьПараметры", то остальные параметры функции не заполняются и все содержат Неопределено
//	ИсточникиДанных - Структура - содержит данные объекта в виде структуры, содержащей в каждом ключе таблицу значений.
//								Данные шапки документа содержатся в ключе "Документ", данные табличных частей содержатся в ключах,
//								совпадающих с именем табличной части
//	ТиповаяОперация - СправочникСсылка.ТиповыеОперации - типовая операция, по которой формируются проводки
//	Параметры - Структура - содержит параметры функции: ключ - имя параметра, значение - значение параметра.
//						Состав параметров определяется из массива, который возвращается при вызове, где ВариантВызова = "ПолучитьПараметры"
//
// Возвращаемое значение:
//	ТаблицаЗначений - состав колонок должен совпадать с возращаемыми при вызове, где ВариантВызова = "ПолучитьПоля", т.к. эти поля могут использоваться в настройках
//
// Для использования функции ее нужно добавить в массив ВсеФункцииМодуля в функции ОписаниеФункцийМодуля.
// Для добавления используется функция ДобавитьЗаголовокОписанияФункции, которая возращает структуру описания текущей функции. В структуре уже заполнены имя функции, поля и параметры.
// Остается заполнить Заголовок и Описание и ТипыДокументов, если нужно.
//

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ОписаниеФункцийМодуля(ТипДокумента = Неопределено, ДобавлятьПоляПараметры = Истина) Экспорт

	ВсеФункцииМодуля = ОбъявленияВсехФункцийМодуля();
	Если ДобавлятьПоляПараметры Тогда
		Для Каждого ФункцияМодуля Из ВсеФункцииМодуля Цикл
			ЗаполнитьПоляИПараметрыФункции(ФункцияМодуля);
		КонецЦикла;
	КонецЕсли;
	
	ИндексПоследнейФункции = ВсеФункцииМодуля.ВГраница();
	
	// Функции модуля БухгалтерскиеОперацииИсточникиДанныхПереопределяемый
	
	ШаблонИмяФункции = ПрефиксФункцийПереопределяемогоМодуля() + ".%1";
	ШаблонЗаголовок  = НСтр("ru = '%1 (переопределяемый модуль)'");
	ШаблонОписание   = НСтр("ru = '%1
		|(Функция описана в переопределяемом модуле)'");
	БухгалтерскиеОперацииИсточникиДанныхПереопределяемый.ОбъявленияВсехФункцийМодуля(ВсеФункцииМодуля);
	Для Индекс = ИндексПоследнейФункции + 1 По ВсеФункцииМодуля.ВГраница() Цикл
	
		ВсеФункцииМодуля[Индекс].Имя          = СтрШаблон(ШаблонИмяФункции, ВсеФункцииМодуля[Индекс].Имя);
		ВсеФункцииМодуля[Индекс].Заголовок    = СтрШаблон(ШаблонЗаголовок, ВсеФункцииМодуля[Индекс].Заголовок);
		Если ЗначениеЗаполнено(ВсеФункцииМодуля[Индекс].Описание) Тогда
			ВсеФункцииМодуля[Индекс].Описание = СтрШаблон(ШаблонОписание, ВсеФункцииМодуля[Индекс].Описание);
		КонецЕсли;
	
	КонецЦикла;
	
	// Функции модулей расширений
	
	ИменаМодулейДопИсточников = БухгалтерскиеОперацииСервер.ОписанияМодулейРасширений("ИсточникиДанных");
	Если ИменаМодулейДопИсточников.Количество() > 0 Тогда
		
		ИндексПоследнейФункции = ВсеФункцииМодуля.ВГраница();
		ШаблонЗаголовок  = НСтр("ru = '%1 (из расширения)'");
		ШаблонОписание   = НСтр("ru = '%1
			|(Функция описана в расширении ""%2"")'");
		ОшибкиДопМодулей = Новый Массив;
	
		Для каждого ТекущийМодуль Из ИменаМодулейДопИсточников Цикл
			
			ИмяТекущегоМодуля = ТекущийМодуль.Ключ;
			
			ФункцииТекущегоМодуля = Новый Массив;
			ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяТекущегоМодуля);
			ОбщийМодуль.ОбъявленияВсехФункцийМодуля(ФункцииТекущегоМодуля);
			
			ФункцииДляПроверки = Новый Массив;
			Для каждого ФункцияМодуля Из ФункцииТекущегоМодуля Цикл
				ФункцииДляПроверки.Добавить(ФункцияМодуля.Имя);
			КонецЦикла; 
			ТекстОшибки = "";
			Если НЕ БухгалтерскиеОперацииСервер.ПроверитьИменаПроцедурРасширения(
				ФункцииДляПроверки, ИмяТекущегоМодуля, ТекстОшибки) Тогда
				
				ОшибкиДопМодулей.Добавить(ТекстОшибки);
				Продолжить;
			КонецЕсли;
			
			ШаблонИмяФункции  = "%ИмяМодуля%.%1";
			ШаблонИмяФункции = СтрЗаменить(ШаблонИмяФункции, "%ИмяМодуля%", ИмяТекущегоМодуля);
			Для Каждого ОписаниеФункции Из ФункцииТекущегоМодуля Цикл
				ВсеФункцииМодуля.Добавить(ОбщегоНазначения.СкопироватьРекурсивно(ОписаниеФункции));
				ТекущаяФункция = ВсеФункцииМодуля[ВсеФункцииМодуля.ВГраница()]; 
				
				ТекущаяФункция.Имя = СтрШаблон(ШаблонИмяФункции, ТекущаяФункция.Имя);
				ТекущаяФункция.Заголовок = СтрШаблон(ШаблонЗаголовок, ТекущаяФункция.Заголовок);
				ТекущаяФункция.Описание = СтрШаблон(ШаблонОписание, ТекущаяФункция.Описание, ТекущийМодуль.Значение);
				ЗаполнитьПоляИПараметрыФункции(ТекущаяФункция);
					
			КонецЦикла;
			
		КонецЦикла;
		
		Если ОшибкиДопМодулей.Количество() > 0 Тогда
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Обнаружены ошибки в объявлениях функций дополнительных источников.
				|%1'"), СтрСоединить(ОшибкиДопМодулей, Символы.ПС + Символы.ПС));
			ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииВычислениеИсточникаДанных(),
				УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
			ВызватьИсключение "Обнаружены ошибки в объявлениях функций дополнительных источников.
				|Подробную информацию см. в журнале регистрации";
			
		КонецЕсли;
		
	КонецЕсли;

	Если ТипДокумента = Неопределено Тогда
		Возврат ВсеФункцииМодуля;
	КонецЕсли;
	
	ДопустимыеФункцииМодуля = Новый Массив;
	
	Для каждого ТекФункцияМодуля Из ВсеФункцииМодуля Цикл
	
		Если ТекФункцияМодуля.ТипыДокументов.Количество() = 0
			ИЛИ ТекФункцияМодуля.ТипыДокументов.Найти(ТипДокумента) <> Неопределено Тогда
			ДопустимыеФункцииМодуля.Добавить(ТекФункцияМодуля);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ДопустимыеФункцииМодуля;

КонецФункции

Функция ДобавитьЗаголовокОписанияФункцииРасширения(ВсеФункцииМодуля, ИмяФункции) Экспорт
	
	Возврат ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, ИмяФункции);
	
КонецФункции

Функция ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, ИмяФункции)

	НоваяФункция = Новый Структура;
	НоваяФункция.Вставить("Имя",			  ИмяФункции);
	НоваяФункция.Вставить("Заголовок",		  "");
	НоваяФункция.Вставить("Описание",		  "");
	НоваяФункция.Вставить("ТипыДокументов",   Новый Массив);
	НоваяФункция.Вставить("Поля",             Новый Массив);
	НоваяФункция.Вставить("Параметры",        Новый Массив);
	НоваяФункция.Вставить("ЗависитОтФункций", "");
	
	ВсеФункцииМодуля.Добавить(НоваяФункция);
	Возврат ВсеФункцииМодуля[ВсеФункцииМодуля.ВГраница()];

КонецФункции

Процедура ЗаполнитьПоляИПараметрыФункции(ОписаниеФункции) Экспорт
	Перем Поля; // Массив
	Перем Параметры; // Массив
	
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ОписаниеФункции.Имя);
	Если ЧастиИмени.Количество() = 1 Тогда
		ПроверитьИмяФункции(ОписаниеФункции.Имя);
		ШаблонИмени = "%ИмяФункции%(%1, Неопределено, Неопределено, Неопределено)";
		ВызываемаяФункция = СтрЗаменить(ШаблонИмени, "%ИмяФункции%", ЧастиИмени[0]);
		Поля = Вычислить(СтрШаблон(ВызываемаяФункция, """ПолучитьПоля"""));
		Параметры = Вычислить(СтрШаблон(ВызываемаяФункция, """ПолучитьПараметры"""));
	ИначеЕсли ЧастиИмени.Количество() = 2 Тогда
		ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ЧастиИмени[0]);
		Поля = ОбщийМодуль.ВыполнитьФункциюПолученияИсточникаДанных(ЧастиИмени[1], "ПолучитьПоля", Неопределено, Неопределено, Неопределено);
		Параметры = ОбщийМодуль.ВыполнитьФункциюПолученияИсточникаДанных(ЧастиИмени[1], "ПолучитьПараметры", Неопределено, Неопределено, Неопределено);
	Иначе
		ВызватьИсключение "Не правильный формат имени функции доп. источника: " + ОписаниеФункции.Имя;
	КонецЕсли;

	Если ТипЗнч(Поля) = Тип("Массив") Тогда
		ОписаниеФункции.Поля = Поля;
	КонецЕсли;
	Если ТипЗнч(Параметры) = Тип("Массив") Тогда
		ОписаниеФункции.Параметры = Параметры;
	КонецЕсли;

КонецПроцедуры

Функция ВыполнитьФункциюПолученияИсточникаДанных(ИмяФункции, ИсточникиДанных, ТиповаяОперация, Параметры) Экспорт

	СоставИмениФункции = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ИмяФункции);
	Если СоставИмениФункции.Количество() = 1 Тогда
		ПроверитьИмяФункции(ИмяФункции);
		ТаблицаИсточника = Вычислить(ИмяФункции + "(""Выполнить"", ИсточникиДанных, ТиповаяОперация, Параметры)");
	ИначеЕсли СоставИмениФункции.Количество() = 2 Тогда
		
		Если СоставИмениФункции[0] = ПрефиксФункцийПереопределяемогоМодуля() Тогда
			
			ТаблицаИсточника = БухгалтерскиеОперацииИсточникиДанныхПереопределяемый.ВыполнитьФункциюПолученияИсточникаДанных(
				СоставИмениФункции[1], ИсточникиДанных, ТиповаяОперация, Параметры);
				
		ИначеЕсли БухгалтерскиеОперацииСервер.ОписанияМодулейРасширений("ИсточникиДанных")
			.Свойство(СоставИмениФункции[0]) Тогда
			
			ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(СоставИмениФункции[0]);
			Попытка
				ТаблицаИсточника = ОбщийМодуль.ВыполнитьФункциюПолученияИсточникаДанных(
					СоставИмениФункции[1],
					"Выполнить",
					ИсточникиДанных,
					ТиповаяОперация,
					Параметры);
			Исключение
				ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииВычислениеИсточникаДанных(),
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.ТиповыеОперации,
					ТиповаяОперация,
					СтрШаблон(НСтр("ru = 'Ошибка при вычислении источника данных в функции ""%1""'"), ИмяФункции));
				ВызватьИсключение;
			КонецПопытки;
			
		Иначе
			
			ТекстИсключения = СтрШаблон(НСтр("ru = 'Для использования типовой операции должно быть подключено расширение,
				|содержащее модуль ""%1"".
				|Расширение должно быть подключено не в безопасном режиме.
				|
				|Проверьте подключение расширения или выберите другую типовую операцию.'"), СоставИмениФункции[0]);
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТаблицаИсточника;

КонецФункции

Функция ОписаниеПолейИсточникаДанных(ИмяФункции) Экспорт

	Возврат ВычислитьФункциюИсточникаДанных(ИмяФункции, "ПолучитьПоля", Неопределено, Неопределено, Неопределено);

КонецФункции

Функция ОписаниеПараметровИсточникаДанных(ИмяФункции) Экспорт

	Возврат ВычислитьФункциюИсточникаДанных(ИмяФункции, "ПолучитьПараметры", Неопределено, Неопределено, Неопределено);

КонецФункции

Функция ВычислитьФункциюИсточникаДанных(ИмяФункции, ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	СоставИмениФункции = СтрРазделить(ИмяФункции, ".");
	Если СоставИмениФункции.Количество() = 1 Тогда
		ВызываемаяФункция = СтрШаблон("%1(""%2"", ИсточникиДанных, ТиповаяОперация, Параметры)",
			ИмяФункции, ВариантВызова);
	ИначеЕсли СоставИмениФункции.Количество() = 2 Тогда
		Если СоставИмениФункции[0] <> ПрефиксФункцийПереопределяемогоМодуля()
			И НЕ БухгалтерскиеОперацииСервер.ОписанияМодулейРасширений("ИсточникиДанных")
			.Свойство(СоставИмениФункции[0]) Тогда
			
			ТекстИсключения = СтрШаблон(
				НСтр("ru = 'Для использования типовой операции должно быть подключено расширение,
				|содержащее модуль ""%1"".
				|Расширение должно быть подключено не в безопасном режиме.
				|
				|Проверьте подключение расширения или выберите другую типовую операцию.'"), СоставИмениФункции[0]);
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;
		
		ВызываемаяФункция = СтрШаблон(
			"%1.ВыполнитьФункциюПолученияИсточникаДанных(""%2"", ""%3"", ИсточникиДанных, ТиповаяОперация, Параметры)",
			СоставИмениФункции[0], СоставИмениФункции[1], ВариантВызова);
	Иначе
			
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Для использования типовой операции должно быть подключено расширение,
			|содержащее модуль ""%1"".
			|Расширение должно быть подключено не в безопасном режиме.
			|
			|Проверьте подключение расширения или выберите другую типовую операцию.'"), СоставИмениФункции[0]);
		ВызватьИсключение ТекстИсключения;
			
	КонецЕсли;
	
	Попытка
		//@skip-check server-execution-safe-mode
		Результат = Вычислить(ВызываемаяФункция);
	Исключение
		ЗаписьЖурналаРегистрации(БухгалтерскиеОперацииСервер.СобытиеЖурналаРегистрацииВычислениеИсточникаДанных(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ТиповыеОперации,
			ТиповаяОперация,
			СтрШаблон(НСтр("ru = 'Ошибка при вычислении источника данных в функции ""%1""'"), ИмяФункции));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Добавляет в массив ВсеФункцииМодуля описания функций из модуля ИмяМодуля.
// В расширении необходимо расширить метод
// БухгалтерскиеОперацииИсточникиДанныхПереопределяемый.ДополнитьОбъявленияФункцийРасширений
// с аннотацией &После.
// Тело функции копируется из БухгалтерскиеОперацииИсточникиДанныхПереопределяемый.ДополнитьОбъявленияФункцийРасширений.
//
// Параметры:
//  ИмяМодуля		 - Строка - Имя собственного модуля расширения, содержащего описания функции источников данных.
//  ВсеФункцииМодуля - Массив - В модуле расширения в этот массив добавляются описания функций.
//
Процедура ДополнитьОбъявленияФункцийРасширений(ИмяМодуля, ВсеФункцииМодуля) Экспорт
	
	ОбщийМодуль = ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
	ОбщийМодуль.ОбъявленияВсехФункцийМодуля(ВсеФункцииМодуля);
	
КонецПроцедуры

// Возвращает префикс "Переопределяемый". Функции с этим префиксом должны находится в модуле
// БухгалтерскиеОперацииИсточникиДанныхПереопределяемый.
Функция ПрефиксФункцийПереопределяемогоМодуля() Экспорт

	Возврат "Переопределяемый";

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ЗачетАвансов

Функция ТаблицаРасчетовСЗачетомАвансов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",      Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",       Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКРасчетов",        Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СпособЗачетаАванса", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыЗачетаАвансов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидДеятельностиУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ОтражатьДоходПоВнебюджету", Новый ОписаниеТипов("Булево")); 
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПСРасчетовВТЧ", Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСЗачетомАвансов();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "НомерКорректировки")
		И ДокументОбъект.НомерКорректировки > 0 Тогда
		
		Реквизиты.Вставить("НомерКорректировки", ДокументОбъект.НомерКорректировки);
		Реквизиты.Вставить("КорректируемыйДокумент", ДокументОбъект.ДокументОснование);
	КонецЕсли;
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуРасчетовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтражатьДоходПоВнебюджету", Ложь) Тогда
		Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
			Если СтрокаТаблицы.КФО = Перечисления.КВД.СубсидииНаГосзадание
				ИЛИ СтрокаТаблицы.КФО = Перечисления.КВД.СубсидииНаИныеЦели
				ИЛИ СтрокаТаблицы.КФО = Перечисления.КВД.СредстваОМС Тогда
				СтрокаТаблицы.КФО = Перечисления.КВД.Внебюджет;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
		
	ТаблицаЗачетАвансовПоДокументу = УчетРасчетов.ПодготовитьТаблицуЗачетАвансовПоДокументу(
		ДокументОбъект, Реквизиты);
	
	Если НЕ Отказ Тогда
	
		// Подготовим таблицу для отражения зачета авансов и увеличения (уменьшения) задолженности
		// документами поступления и реализации материальных запасов, услуг, ОС и пр.
		ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов(
			ТаблицаДокумента,
			ТаблицаЗачетАвансовПоДокументу,
			Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСЗачетомАвансов", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ТаблицаРасчетовСЗачетомАвансовПоКомиссии(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",      Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКРасчетов",        Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СпособЗачетаАванса", Новый ОписаниеТипов("ПеречислениеСсылка.СпособыЗачетаАвансов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидДеятельностиУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ОтражатьДоходПоВнебюджету", Новый ОписаниеТипов("Булево")); 
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПСРасчетовВТЧ", Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСЗачетомАвансов();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Параметры.Вставить("СчетРасчетов", БухгалтерскийУчет.СчетПоКоду("210.05", ДокументОбъект.Дата, ДокументОбъект.Организация));
	
	ИспользоватьПустуюТаблицуРасчетов = Ложь;
	СвойстваСчетаРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Параметры.СчетРасчетов);
	Если СвойстваСчетаРасчетов.ЗапретитьИспользоватьВПроводках Тогда
		ИспользоватьПустуюТаблицуРасчетов = Истина;
	КонецЕсли;
	
	Если НЕ ИспользоватьПустуюТаблицуРасчетов Тогда
		Реквизиты = Новый Структура;
		Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
		Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
		Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
		Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "НомерКорректировки")
			И ДокументОбъект.НомерКорректировки > 0 Тогда
			
			Реквизиты.Вставить("НомерКорректировки", ДокументОбъект.НомерКорректировки);
			Реквизиты.Вставить("КорректируемыйДокумент", ДокументОбъект.ДокументОснование);
		КонецЕсли;
		
		Для Каждого Параметр Из Параметры Цикл
			Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
		
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
		Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
		
		ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуРасчетовПоДокументу(
			ДокументОбъект, Параметры, Отказ);
		
		Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОтражатьДоходПоВнебюджету", Ложь) Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
				Если СтрокаТаблицы.КФО = Перечисления.КВД.СубсидииНаГосзадание
					ИЛИ СтрокаТаблицы.КФО = Перечисления.КВД.СубсидииНаИныеЦели
					ИЛИ СтрокаТаблицы.КФО = Перечисления.КВД.СредстваОМС Тогда
					СтрокаТаблицы.КФО = Перечисления.КВД.Внебюджет;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
			
		ТаблицаЗачетАвансовПоДокументу = УчетРасчетов.ПодготовитьТаблицуЗачетАвансовПоДокументу(
			ДокументОбъект, Реквизиты);
		
		Если НЕ Отказ Тогда
		
			// Подготовим таблицу для отражения зачета авансов и увеличения (уменьшения) задолженности
			// документами поступления и реализации материальных запасов, услуг, ОС и пр.
			ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов(
				ТаблицаДокумента,
				ТаблицаЗачетАвансовПоДокументу,
				Реквизиты, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСЗачетомАвансовПоКомиссии", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ТаблицаРасчетовПриПоступленииДопРасходов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = ТаблицаРасчетовСЗачетомАвансов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПартияВложений", ПланыВидовХарактеристик.ВидыСубконто.Партии.ТипЗначения);
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ТаблицаРасчетовСЗачетомАвансов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Если Параметры.Свойство("ПартияВложений") И ЗначениеЗаполнено(Параметры.ПартияВложений) Тогда
		
		Если ТипЗнч(Параметры.ПартияВложений) <> Тип("ДокументСсылка.ПоступлениеОС") Тогда
			// КФО определим из проводок документа партии.
			КФОВложений = БухгалтерскиеОперации.РеквизитПроводкиДокумента("КФО",
				Параметры.ПартияВложений, "105.00,106.2П,106.3П,106.4П,106.27,106.37", "Дт");
			Параметры.Вставить("КФО", КФОВложений);
			
			Если НЕ ЗначениеЗаполнено(КФОВложений) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Документ партии %1 не формирует проводок по счетам вложений в МЗ и БА (105.00, 106.2П, 106.3П, 106.27, 106.37).'"),
					Параметры.ПартияВложений);
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстОшибки, "ПартияМПЗ", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(НСтр("ru='Документ партии не указан.'"), "ПартияМПЗ", Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения зачета авансов и увеличения (уменьшения) задолженности
		// подготовим типовой процедурой.
		ТаблицаРасчетов = ТаблицаРасчетовСЗачетомАвансов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
		
	Иначе
		
		ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСЗачетомАвансов();
		
		// Сохраним флаг отказа в контексте проведения.
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		КонтекстПроведения.ДополнительныеСвойства.Вставить(
			"ТаблицаРасчетовСЗачетомАвансов", ТаблицаРасчетов.Скопировать());
		КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
		БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
		
	КонецЕсли;
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ТаблицаРасчетовПоОплатеТруда(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",      Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ОсновнойКонтрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовПоОплатеТруда();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуРасчетовПоОплатеТрудаПоДокументу(
		Реквизиты.Ссылка, Параметры, Отказ);
	
	Если НЕ Отказ Тогда
	
		// Подготовим таблицу для отражения расчетов по оплате труда.
		ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовПоОплатеТруда(
			ТаблицаДокумента,
			Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСЗачетомАвансов", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

#КонецОбласти

#Область ПогашениеЗадолженности

Функция ТаблицаРасчетовСПогашениемЗадолженности(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",      Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",       Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЭтоАвансовыйПлатеж", Новый ОписаниеТипов("Булево"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ОтражениеАвансаУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокОтраженияАвансовУСН"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
		ДокументОбъект, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения погашения задолженности (организацией перед покупателями
		// или поставщиками перед организацией) документами движения денежных средств,
		ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСПогашениемЗадолженности(РасшифровкаПлатежа, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа.Скопировать());
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСПогашениемЗадолженности", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ТаблицаРасчетовСПолучателямиКомпенсацииРодительскойПлаты(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВедомостьКомпенсацииРодительскойПлаты",
			Новый ОписаниеТипов("ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате"));
		
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Отказ = Ложь;
	
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// При перечислении компенсации родительской платы расчеты ведутся с получателями компенсации,
		// указанными в ведомости компенсации родительской платы. Модифицируем таблицу РасшифровкаПлатежа.
		РасшифровкаПлатежаПоПолучателямКомпенсации = УчетРасчетов.ДетализироватьРасшифровкуПлатежаПоПолучателямКомпенсации(
			РасшифровкаПлатежа, Реквизиты.Ссылка, Параметры, Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения погашения задолженности перед получателями компенсации родительской платы,
		ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСПогашениемЗадолженности(
			РасшифровкаПлатежаПоПолучателямКомпенсации, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСПогашениемЗадолженности", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
КонецФункции

Функция ТаблицаРасчетовСПокупателямиЗаКассовуюСмену(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                  Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                  Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                  Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",        Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ОтчетПоКассовойСмене", Новый ОписаниеТипов("ДокументСсылка.ОтчетПоКассовойСмене"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Отказ = Ложь;
	
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоОтчетуПоКассовойСмене(
		Параметры.ОтчетПоКассовойСмене, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения погашения задолженности перед покупателями.
		ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСПогашениемЗадолженности(
			РасшифровкаПлатежа, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа.Скопировать());
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСПогашениемЗадолженности", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ТаблицаРасчетовСФизическимиЛицамиПоВедомости(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВедомостьНаВыплатуВБанк",
			Новый ОписаниеТипов("ДокументСсылка.ВедомостьНаВыплатуВБанк"));
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Если РеквизитыДокумента.КорСчет = БухгалтерскийУчет.СчетПоКоду("302.00") Тогда
		Реквизиты.Вставить("СчетРасчетов", БухгалтерскийУчет.СчетПоКоду("302.00"));
	Иначе
		Реквизиты.Вставить("СчетРасчетов", БухгалтерскийУчет.СчетПоКоду("304.03"));
	КонецЕсли;
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	
	Отказ = Ложь;
	
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// При перечислении сотрудникам по ведомости перечислений расчеты ведутся по сотрудникам,
		// указанным в ведомости на перечисление сотрудникам. Модифицируем таблицу РасшифровкаПлатежа.
		РасшифровкаПлатежаПоПолучателям = УчетРасчетов.ДетализироватьРасшифровкуПлатежаПоВедомостиПеречислений(
			РасшифровкаПлатежа, Реквизиты.Ссылка, Параметры, Отказ);
			
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения погашения задолженности перед получателями компенсации родительской платы,
		ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСПогашениемЗадолженности(
			РасшифровкаПлатежаПоПолучателям, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСПогашениемЗадолженности", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

Функция ТаблицаВыплатПоПлатежнойВедомости(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПлатежнаяВедомость0504403",
										Новый ОписаниеТипов("ДокументСсылка.ПлатежнаяВедомость0504403"));
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = РасчетыСПодотчетнымиЛицами.ПустаяТаблицаВыплатПодотчетнымЛицамИзКассы();
	
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ЕстьОшибки = Ложь;
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	
	Если Не ЗначениеЗаполнено(Параметры.ПлатежнаяВедомость0504403) 
		Или Не ТипЗнч(Параметры.ПлатежнаяВедомость0504403) = Тип("ДокументСсылка.ПлатежнаяВедомость0504403") Тогда  
		
		ТекстОшибки = НСтр("ru='Операция не может быть выполнена для документа ""%1"".
			|Недопустимый тип основания ""%2"", должен быть ""Платежная ведомость (ф. 0504403)""'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
			РеквизитыДокумента.Ссылка,
			ТипЗнч(Параметры.ПлатежнаяВедомость0504403));
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, РеквизитыДокумента.Ссылка,,, ЕстьОшибки);

	КонецЕсли;
	
	Если НЕ ЕстьОшибки Тогда
		ТаблицаРасчетов = КассаОрганизации.ТаблицаВыплатПоПлатежнойВедомости(Параметры.ПлатежнаяВедомость0504403);
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаВыплатПоПлатежнойВедомости", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ ЕстьОшибки;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

#КонецОбласти

#Область РасчетыСПодотчетнымиЛицами

Функция РасходыПоАвансовомуОтчету(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходов = РасчетыСПодотчетнымиЛицами.ПустаяТаблицаРасходовПоАвансовомуОтчету();
	
	Для Каждого Колонка Из ТаблицаРасходов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация", РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата", РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ДатаУтверждения", РеквизитыДокумента.Дата);
	Реквизиты.Вставить("СчетРасчетов", БухгалтерскиеОперации.СчетПоКоду("208.00", РеквизитыДокумента.Дата));
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Отказ = Ложь;
	
	ТаблицаРасходовПоДокументу = РасчетыСПодотчетнымиЛицами.ПодготовитьТаблицуРасходовПоАвансовомуОтчету(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// При перечислении подотчетным лицам по ведомости перечислений расчеты ведутся по сотрудникам,
		// указанным в ведомости на перечисление сотрудникам. Модифицируем таблицу РасшифровкаПлатежа.
		ТаблицаРасходов = РасчетыСПодотчетнымиЛицами.ТаблицаРасходовПоАвансовомуОтчетуСКурсамиВыдачи(
			ТаблицаРасходовПоДокументу, Реквизиты.Ссылка, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"РасходыПоАвансовомуОтчету", ТаблицаРасходов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходов;
	
КонецФункции

Функция ТаблицаКурсовыхРазницПриВозвратеАвансаПодотчетнымЛицом(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРезультат = РасчетыСПодотчетнымиЛицами.ПустаяТаблицаКурсовыхРазницПриВозвратеАвансаПодотчетнымЛицом();
	
	Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", 		РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация", 	РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата", 			РеквизитыДокумента.Дата);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс", 		КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Отказ = Ложь;
	
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		ТаблицаРезультат = РасчетыСПодотчетнымиЛицами.ТаблицаКурсовыхРазницПриВозвратеАванса(РасшифровкаПлатежа, Реквизиты, Отказ);
		
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ТаблицаРасчетовСПодотчетнымиЛицамиПоВедомости(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВедомостьНаВыплатуВБанк",
										Новый ОписаниеТипов("ДокументСсылка.ВедомостьНаВыплатуВБанк"));
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = РасчетыСПодотчетнымиЛицами.ПустаяТаблицаРасчетовСПодотчетнымиЛицамиПоВедомости();
	
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Реквизиты.Вставить("СчетРасчетов",    БухгалтерскиеОперации.СчетПоКоду("208.00", РеквизитыДокумента.Дата));
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Отказ = Ложь;
	
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда  
		
		// При перечислении подотчетным лицам по ведомости перечислений расчеты ведутся по сотрудникам,
		// указанным в ведомости на перечисление сотрудникам. Модифицируем таблицу РасшифровкаПлатежа.
		ТаблицаРасчетов = РасчетыСПодотчетнымиЛицами.ДетализироватьРасшифровкуПлатежаПоВедомостиПеречислений(
		РасшифровкаПлатежа, Реквизиты.Ссылка, Параметры, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСПодотчетнымиЛицамиПоВедомости", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
КонецФункции

Функция РасходыПоОтчетуОРасходах(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходов = РасчетыСПодотчетнымиЛицами.ПустаяТаблицаРасходовПоОтчетуОРасходах();
	
	Для Каждого Колонка Из ТаблицаРасходов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация", РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата", РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ДатаУтверждения", РеквизитыДокумента.ДатаУтверждения);
	Реквизиты.Вставить("Подразделение", РеквизитыДокумента.Подразделение);
	Реквизиты.Вставить("СчетРасчетов", БухгалтерскиеОперации.СчетПоКоду("208.00", РеквизитыДокумента.Дата));
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Реквизиты.Вставить("КурсыВалют", ИсточникиДанных.ДокументОбъект.КурсыВалют.Выгрузить());
	
	Отказ = Ложь;
	
	ТаблицаРасходовПоДокументу = РасчетыСПодотчетнымиЛицами.ПодготовитьТаблицуРасходовПоОтчетуОРасходах(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		ТаблицаРасходов = РасчетыСПодотчетнымиЛицами.ТаблицаРасходовПоОтчетуОРасходахСКурсамиВыдачи(
			ТаблицаРасходовПоДокументу, Реквизиты.Ссылка, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"РасходыПоОтчетуОРасходах", ТаблицаРасходов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходов;
	
КонецФункции

Функция ТаблицаОбязательствПоЗаявкеОбоснованиюЗакупки(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРезультат = РасчетыСПодотчетнымиЛицами.ПустаяТаблицаОбязательствПоЗаявкеОбоснованиюЗакупки();
	
	Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	
	Возврат РасчетыСПодотчетнымиЛицами.ТаблицаОбязательствПоЗаявкеОбоснованиюЗакупки(РеквизитыДокумента.Ссылка);
	
КонецФункции

Функция ТаблицаВыплатПоВедомостиНаВыдачуПодотчетнымЛицам(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВедомостьНаВыдачуПодотчетнымЛицам",
										Новый ОписаниеТипов("ДокументСсылка.ВедомостьНаВыдачуПодотчетнымЛицам"));
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = РасчетыСПодотчетнымиЛицами.ПустаяТаблицаВыплатПодотчетнымЛицамИзКассы();
	
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Реквизиты.Вставить("СчетРасчетов",    БухгалтерскиеОперации.СчетПоКоду("208.00", РеквизитыДокумента.Дата));
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Отказ = Ложь;
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	
	Если Не ЗначениеЗаполнено(Параметры.ВедомостьНаВыдачуПодотчетнымЛицам) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ТаблицаРасчетов = РасчетыСПодотчетнымиЛицами.ТаблицаВыплатПодотчетнымЛицамИзКассы(Параметры.ВедомостьНаВыдачуПодотчетнымЛицам);
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаВыплатПоВедомостиНаВыдачуПодотчетнымЛицам", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

#КонецОбласти

#Область УчетМатериальныхЗапасов

Функция ПоступлениеМатериальныхЗапасовРанееУчтенныхВПути(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПоступлениеМЗВПути", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеМЗВПути"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда

		ПоляФункции = Новый Массив;
		
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасовРанееУчтенныхВПути();
		Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("ИФО",             ДокументОбъект.ИФО);
	Реквизиты.Вставить("Подразделение",   ДокументОбъект.Подразделение);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	Реквизиты.Вставить("ДокументОснование", ДокументОбъект.ДокументОснование);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;

	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступлениеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения поступления материальных запасов.
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступленияМатериальныхЗапасовРанееУчтенныхВПути(
			ТаблицаДокумента, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаПоступлениеМатериальныхЗапасовРанееУчтенныхВПути", ТаблицаПоступления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
		
КонецФункции

Функция ПоступлениеМатериальныхЗапасов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПСРасчетовВТЧ",Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов();
	Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступлениеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения поступления материальных запасов.
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ТаблицаПоступлениеМатериальныхЗапасов(
			ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаПоступлениеМатериальныхЗапасов", ТаблицаПоступления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция ВосстановлениеМатериальныхЗапасов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	ТипИФО           = Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения");
	ТипКФО           = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");
	ТипКПС           = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
	ТипПодразделение = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	ТипЦМО           = Новый ОписаниеТипов("СправочникСсылка.ЦМО");
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                     ТипИФО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                     ТипКФО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                     ТипКПС);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",           ТипПодразделение);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПодразделениеПолучатель", ТипПодразделение);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЦМОПолучатель",           ТипЦМО);
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаВосстановления = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов();
	Для Каждого Колонка Из ТаблицаВосстановления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ВидПоступленияМЗ") Тогда
		ОприходованиеСЗабалансовогоСчета = ДокументОбъект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета;
	Иначе
		ОприходованиеСЗабалансовогоСчета = Истина;
	КонецЕсли;
	
	Если ОприходованиеСЗабалансовогоСчета Тогда
	
		ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
			ДокументОбъект, Параметры, Отказ);
		
		Если НЕ Отказ Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ЗабалансовыйСчет") Тогда
				ЗабалансовыйСчет = ДокументОбъект.ЗабалансовыйСчет;
			Иначе
				ЗабалансовыйСчет = БухгалтерскийУчет.СчетПоКоду("02.4", ДокументОбъект.Дата, ДокументОбъект.Организация);
			КонецЕсли;
			
			Если БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(ЗабалансовыйСчет, ПланыВидовХарактеристик.ВидыСубконто.Номенклатура) Тогда			
				// Подготовим таблицу для отражения списания материальных запасов.
				ВременнаяТаблица = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов(
					ТаблицаДокумента, Реквизиты, Отказ);
			Иначе
				ВременнаяТаблица = ТаблицаДокумента;
			КонецЕсли;
		
			Для Каждого Строка Из ВременнаяТаблица Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаВосстановления.Добавить(), Строка);
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаВосстановлениеМатериальныхЗапасов", ТаблицаВосстановления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаВосстановления;
	
КонецФункции

Функция СписаниеОСПриВосстановленииМатериальныхЗапасов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ОписаниеТиповСубконто  = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ТаблицаСписания = Новый ТаблицаЗначений;
	ТаблицаСписания.Колонки.Добавить("ИмяСписка", Новый ОписаниеТипов("Строка")); 
	ТаблицаСписания.Колонки.Добавить("СинонимСписка", Новый ОписаниеТипов("Строка")); 
	ТаблицаСписания.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(5, 0))); 
	ТаблицаСписания.Колонки.Добавить("КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД")); 
	ТаблицаСписания.Колонки.Добавить("СубконтоЗабалансовыйСчет1", ОписаниеТиповСубконто); 
	ТаблицаСписания.Колонки.Добавить("СубконтоЗабалансовыйСчет2", ОписаниеТиповСубконто); 
	ТаблицаСписания.Колонки.Добавить("СубконтоЗабалансовыйСчет3", ОписаниеТиповСубконто); 
	ТаблицаСписания.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3))); 
	ТаблицаСписания.Колонки.Добавить("Стоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2))); 

	Для Каждого Колонка Из ТаблицаСписания.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ВидПоступленияМЗ") Тогда
		ОприходованиеСЗабалансовогоСчета = ДокументОбъект.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета;
	Иначе
		ОприходованиеСЗабалансовогоСчета = Истина;
	КонецЕсли;
	
	Если ОприходованиеСЗабалансовогоСчета Тогда
	
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ЗабалансовыйСчет") Тогда
			ЗабалансовыйСчет = ДокументОбъект.ЗабалансовыйСчет;
		Иначе
			ЗабалансовыйСчет = БухгалтерскийУчет.СчетПоКоду("02.4", ДокументОбъект.Дата, ДокументОбъект.Организация);
		КонецЕсли;
		
		Если БухгалтерскийУчетПовтИсп.ЕстьСубконтоСчета(ЗабалансовыйСчет, ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства) Тогда			
		
			ТаблицаСписания = ТаблицаСписаниеОсновныхСредствСЗабаланса(ДокументОбъект, Отказ);
			
		КонецЕсли;	
			
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписанияОСПриВосстановленииМатериальныхЗапасов", ТаблицаСписания.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписания;
	
КонецФункции

Функция ТаблицаСписанияМЗ (ИсточникиДанных, ТиповаяОперация, Параметры, ВариантВызова)

	ПоляФункции = Новый Массив;
	
	ТаблицаСписания = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов();
	Для Каждого Колонка Из ТаблицаСписания.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	РассчитанныеДанные = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДокументОбъект.ДополнительныеСвойства, "РассчитанныеДанные");
	
	ИспользуетсяСохраненнаяТаблицаСписания = Ложь;
	Если РассчитанныеДанные <> Неопределено И ТипЗнч(РассчитанныеДанные) = Тип("Структура") Тогда
		ТаблицаСписания = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РассчитанныеДанные, "ТаблицаСписания");
		ИспользуетсяСохраненнаяТаблицаСписания = Истина;
	КонецЕсли;
	
	Если НЕ ИспользуетсяСохраненнаяТаблицаСписания Тогда
		ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
			ДокументОбъект, Параметры, Отказ);
		
		Если НЕ Отказ Тогда
			
			// Подготовим таблицу для отражения списания материальных запасов.
			ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов(
				ТаблицаДокумента, Реквизиты, Отказ);
			
		КонецЕсли;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	
	// Используем резервы на 114 при их наличии
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Реквизиты, "УчитыватьРезерв", Ложь) Тогда
		ТаблицаСписаниеРезервовМатериальныхЗапасов = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеРезервовМатериальныхЗапасов(
			ТаблицаСписания, ИсточникиДанных.ДокументОбъект, Реквизиты);
		КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеРезервовМатериальныхЗапасов", ТаблицаСписаниеРезервовМатериальныхЗапасов);
	КонецЕсли;

	// Сохраним Отказ и таблицу для формирования других источников данных.
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеМатериальныхЗапасов", ТаблицаСписания.Скопировать());
	Если Отказ Тогда
		КонтекстПроведения.Отказ = Истина;
	КонецЕсли;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписания;
	
КонецФункции

Функция СписаниеМатериальныхЗапасов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	ТипИФО           = Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения");
	ТипКФО           = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");
	ТипКПС           = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
	ТипПодразделение = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	ТипЦМО           = Новый ОписаниеТипов("СправочникСсылка.ЦМО");
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                                   ТипИФО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                                   ТипКФО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                                   ТипКПС);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",                         ТипПодразделение);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПодразделениеПолучатель",               ТипПодразделение);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЦМОПолучатель",                         ТипЦМО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "УчитыватьРезерв",                       Новый ОписаниеТипов("Булево"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "УменьшатьСтоимостьНаСуммуРезерва",      Новый ОписаниеТипов("Булево"));

		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Возврат ТаблицаСписанияМЗ (ИсточникиДанных, ТиповаяОперация, Параметры, ВариантВызова);
	
КонецФункции

Функция СписаниеИмуществаВПользовании(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Счет27", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Возврат ТаблицаСписанияМЗ (ИсточникиДанных, ТиповаяОперация, Параметры, ВариантВызова);
	
КонецФункции

Функция СписаниеНепризнанныхАктивом(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Возврат ТаблицаСписанияМЗ (ИсточникиДанных, ТиповаяОперация, Параметры, ВариантВызова);
	
КонецФункции

Функция РеализацияМатериальныхЗапасов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКДоходов",    Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРеализации = УправлениеМатериальнымиЗапасами.ПустаяТаблицаРеализацияМатериальныхЗапасов();
	Для Каждого Колонка Из ТаблицаРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуРеализацияМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения реализации материальных запасов,
	ТаблицаРеализации = УправлениеМатериальнымиЗапасами.ТаблицаРеализацияМатериальныхЗапасов(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаРеализацияМатериальныхЗапасов",
		ТаблицаРеализации.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРеализации;
	
КонецФункции

Функция ВозвратМатериальныхЗапасовПоставщику(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВосстанавливатьНДС", Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаВозврат = УправлениеМатериальнымиЗапасами.ПустаяТаблицаВозвратМатериальныхЗапасовПоставщику();
	Для Каждого Колонка Из ТаблицаВозврат.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаСписаниеМатериальныхЗапасов") Тогда
		ВызватьИсключение "Не обнаружена таблица списания материальных запасов.
			|Для формирования таблицы возврата материальных запасов поставщику используется таблица списания материальных запасов,
			|подготовленная функцией УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов.";
	КонецЕсли;
	
	// Подготовим таблицу для отражения возврата материальных запасов поставщику,
	ТаблицаВозврат = УправлениеМатериальнымиЗапасами.ТаблицаВозвратМатериальныхЗапасовПоставщику(
		ДокументОбъект,
		ДополнительныеСвойства.ТаблицаСписаниеМатериальныхЗапасов,
		Реквизиты, Отказ);
	
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаВозвратМатериальныхЗапасовПоставщику",
		ТаблицаВозврат.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаВозврат;
	
КонецФункции

Функция ДвижениеМЗНаХранениеПереработку(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаСписания = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов();
	Для Каждого Колонка Из ТаблицаСписания.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	Если НЕ Отказ Тогда
		
		Если ДокументОбъект.ВидПередачиМЗ <> Перечисления.ВидыПередачиМЗ.ПередачаНаХранениеВПереработку
				И ДокументОбъект.ВидПередачиМЗ <> Перечисления.ВидыПередачиМЗ.ПередачаНаРеализацию
				И ДокументОбъект.ВидПередачиМЗ <> Перечисления.ВидыПередачиМЗ.ВозвратТоваровПереданныхНаРеализацию
				И ДокументОбъект.ВидПередачиМЗ <> Перечисления.ВидыПередачиМЗ.ВозвратСХраненияИзПереработки Тогда
			ВызватьИсключение НСтр("ru = 'Функция источника данных ""Движение МЗ на хранение (в переработку)"" используется только для передачи
				|материалов на хранение (в переработку) и возврата с хранения (из переработки)'");
		КонецЕсли;
		
		УправлениеМатериальнымиЗапасами.ДоработатьТаблицуДокументаДляДвиженийРемонт(ДокументОбъект, ТаблицаДокумента);
		
		// Подготовим таблицу для отражения списания материальных запасов.
		ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов(
			ТаблицаДокумента, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеМатериальныхЗапасов", ТаблицаСписания.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписания;
	
КонецФункции

Функция ВыдачаМЗвЛичноеПользование(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	// Идентификация строки.
	ТаблицаРезультат.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаРезультат.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаРезультат.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	// Колонки исходной табличной части
	ТаблицаРезультат.Колонки.Добавить("Номенклатура",            Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаРезультат.Колонки.Добавить("ЦМОПолучатель",           Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаРезультат.Колонки.Добавить("ПодразделениеПолучатель", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаРезультат.Колонки.Добавить("КФО",                     Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаРезультат.Колонки.Добавить("СчетУчета",               Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаРезультат.Колонки.Добавить("КПС",                     Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаРезультат.Колонки.Добавить("Количество",              ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(10,3));
	// Уникальные колонки
	ТаблицаРезультат.Колонки.Добавить("Сумма", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(15,2));
	
	ПоляФункции = Новый Массив;
	Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицаСписание = Неопределено;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаСписаниеМатериальныхЗапасов", ТаблицаСписание) Тогда
		ВызватьИсключение "Не обнаружена таблица списания материальных запасов.
			|Для формирования таблицы выдачи имущества в личное пользование требуется источник данных,
			|подготовленный функцией СписаниеМатериальныхЗапасов.";
	КонецЕсли;
	
	ТаблицаМЗ = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "МатериальныеЗапасы", Истина);
	
	СписокЦМОПолучателей = ТаблицаМЗ.ВыгрузитьКолонку("ЦМОПолучатель");
	ПолучателиСотрудники = СписокЦМОПолучателей.Количество() > 0 И ТипЗнч(СписокЦМОПолучателей[0]) = Тип("СправочникСсылка.Сотрудники");
	Если ПолучателиСотрудники Тогда
	
		РеквизитыСотрудников = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(СписокЦМОПолучателей, "Контрагент")
	
	КонецЕсли;
	
	СинонимСписка = Метаданные.Документы.ВедомостьНаВыдачуМЗНаНуждыУчреждения.ТабличныеЧасти.МатериальныеЗапасы.Синоним;
	КопияТаблицаСписания = ТаблицаСписание.Скопировать();
	КопияТаблицаСписания.Индексы.Добавить("НомерСтроки, СчетУчета");
	
	КФОШапки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникиДанных.ДокументОбъект, "КФО");
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ИсточникиДанных.ДокументОбъект, "КФОВТабличнойЧасти") Тогда
		КФОШапки = НЕ ИсточникиДанных.ДокументОбъект.КФОВТабличнойЧасти;
	КонецЕсли;

	Для Каждого ТекСтрока Из ТаблицаМЗ Цикл
	
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		Если КФОШапки Тогда
			НоваяСтрока.КФО = ИсточникиДанных.ДокументОбъект.КФО;
		КонецЕсли;
		
		НоваяСтрока.ИмяСписка = "МатериальныеЗапасы";
		НоваяСтрока.СинонимСписка = СинонимСписка;
		
		Если ПолучателиСотрудники Тогда
			НоваяСтрока.ЦМОПолучатель = РеквизитыСотрудников.Получить(ТекСтрока.ЦМОПолучатель);
		КонецЕсли;
		
		НоваяСтрока.Сумма = КопияТаблицаСписания.Скопировать(
			Новый Структура("НомерСтроки, СчетУчета", ТекСтрока.НомерСтроки, ТекСтрока.СчетУчета), "Стоимость")
			.Итог("Стоимость");
	
	КонецЦикла;
	
	// сохраним результат для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаВыдачаМЗвЛичноеПользование",
		ТаблицаРезультат.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРезультат;

КонецФункции

Функция СписаниеВложенийВМЗ_Покупка(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ТипЦМО           = Новый ОписаниеТипов("СправочникСсылка.ЦМО");
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЦМО", ТипЦМО);
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ТаблицаСписания = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов();
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из ТаблицаСписания.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;

	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);

	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения списания материальных запасов.
		Если ДокументОбъект.Дата < '20210101' Тогда
			// Используется со старыми счетами 106 (с субконто Партии)
			ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписанияВложенийВМЗ_Покупка(
				ТаблицаДокумента, Реквизиты, Отказ);
		Иначе
			// Используется с новыми счетами 106 (без субконто Партии)
			ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов(
				ТаблицаДокумента, Реквизиты, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеМатериальныхЗапасов", ТаблицаСписания.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписания;
	
КонецФункции

Функция ОприходованиеМатериальныхЗапасовПоФактическойСтоимости(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ТаблицаСписания = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов();
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из ТаблицаСписания.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	Если НЕ Отказ Тогда
		
		ТаблицаДокумента.ЗаполнитьЗначения(Истина, "НеПересчитыватьСумму");
		
		// Подготовим таблицу для отражения списания материальных запасов и затрат.
		ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасовДляОприходования(
			ТаблицаДокумента, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеМатериальныхЗапасов", ТаблицаСписания.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписания;
	
КонецФункции

Функция СписаниеРезервовМатериальныхЗапасов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
		
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаСписанияРезервов = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеРезервовМатериальныхЗапасов();
	
	Для Каждого Колонка Из ТаблицаСписанияРезервов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получим Таблицу из обработчика списания материальных запасов
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	
	Возврат ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(КонтекстПроведения.ДополнительныеСвойства,
		"ТаблицаСписаниеРезервовМатериальныхЗапасов",
		ТаблицаСписанияРезервов);
		
КонецФункции

#КонецОбласти

#Область УчетМатериальныхЗапасов_ИмуществаКазны

Функция СписаниеМатериальныхЗапасовИмуществаКазны(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	ТипИФО           = Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения");
	ТипКФО           = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");
	ТипКПС           = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
	ТипПодразделение = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	ТипЦМО           = Новый ОписаниеТипов("СправочникСсылка.ЦМО");
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                     ТипИФО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                     ТипКФО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                     ТипКПС);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",           ТипПодразделение);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПодразделениеПолучатель", ТипПодразделение);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЦМО",                     ТипЦМО);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЦМОПолучатель",           ТипЦМО);
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаСписания = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов();
	Для Каждого Колонка Из ТаблицаСписания.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	Если НЕ Отказ Тогда
		
		ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов(
			ТаблицаДокумента, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеМатериальныхЗапасов", ТаблицаСписания.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписания;
	
КонецФункции

Функция РеализацияМатериальныхЗапасовИмуществаКазны(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКДоходов",    Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРеализации = УправлениеМатериальнымиЗапасами.ПустаяТаблицаРеализацияМатериальныхЗапасов();
	Для Каждого Колонка Из ТаблицаРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуРеализацияМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения реализации материальных запасов,
	ТаблицаРеализации = УправлениеМатериальнымиЗапасами.ТаблицаРеализацияМатериальныхЗапасов(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаРеализацияМатериальныхЗапасов",
		ТаблицаРеализации.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРеализации;
	
КонецФункции

#КонецОбласти

#Область УчетВозвратнойТары

Функция ПоступлениеВозвратнойТарыРанееУчтеннойВПути(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПоступлениеМЗВПути", Новый ОписаниеТипов("ДокументСсылка.ПоступлениеМЗВПути"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда

		ПоляФункции = Новый Массив;
		
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасовРанееУчтенныхВПути();
		Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",            ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",       ДокументОбъект.Организация);
	Реквизиты.Вставить("ИФО",               ДокументОбъект.ИФО);
	Реквизиты.Вставить("Подразделение",     ДокументОбъект.Подразделение);
	Реквизиты.Вставить("Дата",              ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация",   ТиповаяОперация);
	Реквизиты.Вставить("ДокументОснование", ДокументОбъект.ДокументОснование);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;

	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступлениеВозвратнойТарыПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения поступления материальных запасов.
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступленияВозвратнойТарыРанееУчтеннойВПути(
			ТаблицаДокумента, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ПоступлениеВозвратнойТарыРанееУчтеннойВПути", ТаблицаПоступления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
		
КонецФункции

Функция ПоступлениеВозвратнойТары(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПСРасчетовВТЧ",Новый ОписаниеТипов("Булево"));

		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеВозвратнойТары();
	Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуПоступлениеВозвратнойТарыПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения поступления возвратной тары.
		ТаблицаПоступления = УправлениеМатериальнымиЗапасами.ТаблицаПоступлениеВозвратнойТары(
			ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаПоступлениеВозвратнойТары", ТаблицаПоступления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция СписаниеВозвратнойТары(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаСписания = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеВозвратнойТары();
	Для Каждого Колонка Из ТаблицаСписания.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеВозвратнойТарыПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения списания возвратной тары.
		ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеВозвратнойТары(
			ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеВозвратнойТары", ТаблицаСписания.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписания;
	
КонецФункции

#КонецОбласти

#Область РозничнаяТорговля

Функция РозничнаяНаценкаПриПеремещенииВНТТ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаНаценка = УправлениеМатериальнымиЗапасами.ПустаяТаблицаРозничнаяНаценкаПриПеремещенииВНТТ();
	Для Каждого Колонка Из ТаблицаНаценка.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаСписаниеМатериальныхЗапасов") Тогда
		ВызватьИсключение "Не обнаружена таблица списания материальных запасов.
			|Для формирования таблицы начисления розничной наценки используется таблица списания материальных запасов,
			|подготовленная функцией УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов.";
	КонецЕсли;
	
	// Подготовим таблицу розничной наценки при перемещении материальных запасов в НТТ.
	ТаблицаНаценка = УправлениеМатериальнымиЗапасами.ТаблицаРозничнаяНаценкаПриПеремещенииВНТТ(
		ДополнительныеСвойства.ТаблицаСписаниеМатериальныхЗапасов,
		Реквизиты, Отказ);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаНаценка;
	
КонецФункции

Функция СписаниеМатериальныхЗапасовИзНТТ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКРозницы", Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ТребованиеНакладная0315006.ТабличныеЧасти.Материалы);
	
	ПоляФункции = Новый Массив;
	// Идентификация строки.
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПоляФункции,
		ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, Новый Массив));
	
	ВычисляемыеПоля = Новый Структура;
	
	// Счета учета товаров в рознице и торговой наценки.
	ОписаниеТипаСчет  = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	ВычисляемыеПоля.Вставить("СчетРозницы",   ОписаниеТипаСчет);
	ВычисляемыеПоля.Вставить("СчетНаценки",   ОписаниеТипаСчет);
	ВычисляемыеПоля.Вставить("СчетРозницыНУ", ОписаниеТипаСчет);
	ВычисляемыеПоля.Вставить("СчетНаценкиНУ", ОписаниеТипаСчет);
	
	ВычисляемыеПоля.Вставить("КЭКРозницы",    Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	
	// Сумма наценки, относящаяся к списываемым из НТТ товарам.
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ВычисляемыеПоля.Вставить("СуммаНаценки",                ОписаниеТипаСуммы);
	ВычисляемыеПоля.Вставить("СуммаНаценкиНУ",              ОписаниеТипаСуммы);
	ВычисляемыеПоля.Вставить("СуммаНаценкиНеУчитываетсяНУ", ОписаниеТипаСуммы);

	Для Каждого ВычисляемоеПоле Из ВычисляемыеПоля Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, ВычисляемоеПоле.Ключ, ВычисляемоеПоле.Значение);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	ПрефиксКолонки   = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Материалы");
	
	СтрДокумента = ИсточникиДанных["Документ"][0];
	ДокументСсылка = СтрДокумента[ПрефиксДокумента + "Ссылка"];
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	// Счет учета товаров в рознице определяется по значению реквизита КорСчет в шапке.
	КЭКРозницы   = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "КЭКРозницы", Справочники.КОСГУ.ПустаяСсылка());
	Счета105ОЦДИ = БухгалтерскийУчет.СписокСчетов("105.20");
	СчетРозницы  = ?(Счета105ОЦДИ.Найти(ДокументСсылка.КорСчет) <> Неопределено,
					БухгалтерскийУчет.СчетПоКоду("105.Б8"),
					БухгалтерскийУчет.СчетПоКоду("105.Г8"));
	СвойстваСчетаРозницы = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетРозницы);
	ВедетсяУчетПоПодразделениям = ИспользоватьУчетПоПодразделениям И СвойстваСчетаРозницы.УчетПоПодразделениям;
	
	// Выполним расчет торговой наценки по проданным товарам (в рамках заданных ЦМО, КФО, КПС и пр.),
	// как если бы этот расчет выполнялся регламентной операцией в конце месяца.
	// В полях СуммаНаценки(*) получим сумму наценки, относящуюся к реализованным товарам (с начала месяца по текущий момент).
	// В полях ТорговаяНаценкаОстаток(*) - общая сумма торговой наценки на начало месяца, которая состоит из:
	// 1) суммы наценки по реализованным товарам с начала месяца - поля СуммаНаценки(*);
	// 2) суммы наценки по товарам, списываемым из НТТ данной хозяйственной операцией;
	// 3) суммы наценки для остатка товаров, которые останутся в рознице после списания из НТТ.
	ТаблицыТорговойНаценки = УправлениеМатериальнымиЗапасами.РассчитатьТорговуюНаценку(ДокументСсылка, КЭКРозницы, Отказ);
	
	ТаблицаНаценкиБУ = ТаблицыТорговойНаценки["ТаблицаТорговойНаценкиБУ"];
	ТаблицаНаценкиБУ.Свернуть("ИФО,КФО,ЦМО,ПодразделениеРозницы,СчетНаценки,СчетРозницы,КПСРозницы,КЭКРозницы",
		"ПродажнаяСтоимостьРеализация,
		|ПродажнаяСтоимостьОстаток,
		|ТорговаяНаценкаОстаток,
		|СуммаНаценки");
	ТаблицаНаценкиБУ.Колонки.Добавить("СписаноПродажнаяСтоимость", ОписаниеТипаСуммы);
	ТаблицаНаценкиБУ.Колонки.Добавить("СписаноСуммаНаценки", ОписаниеТипаСуммы);
	
	ТаблицаНаценкиНУ = ТаблицыТорговойНаценки["ТаблицаТорговойНаценкиНУ"];
	ТаблицаНаценкиНУ.Свернуть("ИФО,КФО,ЦМО,СчетНаценки,СчетРозницы",
		"ПродажнаяСтоимостьРеализация,ПродажнаяСтоимостьЕНВДРеализация,
		|ПродажнаяСтоимостьОстаток,ПродажнаяСтоимостьЕНВДОстаток,
		|ТорговаяНаценкаОстаток,ТорговаяНаценкаЕНВДОстаток,ТорговаяНаценкаНеУчитываетсяНУОстаток,
		|СуммаНаценки,СуммаНаценкиНеУчитываетсяНУ");
	ТаблицаНаценкиНУ.Колонки.Добавить("СписаноПродажнаяСтоимость", ОписаниеТипаСуммы);
	ТаблицаНаценкиНУ.Колонки.Добавить("СписаноСуммаНаценки", ОписаниеТипаСуммы);
	ТаблицаНаценкиНУ.Колонки.Добавить("СписаноСуммаНаценкиНеУчитываетсяНУ", ОписаниеТипаСуммы);
	
	// Бухгалтерский учет - проверим достаточность остатка на счете розницы.
	ТаблицаСписания = ИсточникиДанных["Материалы"].Скопировать();
	ТаблицаСписания.Свернуть(ПрефиксКолонки+"КФО,"+ПрефиксКолонки+"КПС", ПрефиксКолонки+"СуммаПередачи");
	Для Каждого СтрокаСписания Из ТаблицаСписания Цикл
		
		КФОСписания   = СтрокаСписания[ПрефиксКолонки+"КФО"];
		КПССписания   = СтрокаСписания[ПрефиксКолонки+"КПС"];
		СуммаПередачи = СтрокаСписания[ПрефиксКолонки+"СуммаПередачи"];
		
		СтруктураПоиска = Новый Структура("ЦМО,КФО,СчетРозницы,КПСРозницы",
			ДокументСсылка.ЦМООтправитель,
			КФОСписания,
			СчетРозницы,
			КПССписания);
		Если ИспользоватьУчетПоИФО Тогда
			СтруктураПоиска.Вставить("ИФО", ДокументСсылка.ИФО);
		КонецЕсли;
		Если ВедетсяУчетПоПодразделениям Тогда
			СтруктураПоиска.Вставить("ПодразделениеРозницы", ДокументСсылка.ПодразделениеОтправитель);
		КонецЕсли;
		МассивСтрок = ТаблицаНаценкиБУ.НайтиСтроки(СтруктураПоиска);
		
		ОстатокВРознице = ?(МассивСтрок.Количество()=0, 0, МассивСтрок[0].ПродажнаяСтоимостьОстаток);
		
		Если СуммаПередачи > ОстатокВРознице Тогда
			
			ТекстОшибки = НСтр("ru='Сумма списания по КФО %1 и КПС %2 превышает остаток в рознице по счету %3.
				|
				|ЦМО: %4'")+?(ВедетсяУчетПоПодразделениям, НСтр("ru=', Подразделение: %5'"), "")+НСтр("ru='.
				|Остаток: %6; Не хватает: %7'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
				КФОСписания,
				КПССписания,
				СчетРозницы,
				ДокументСсылка.ЦМООтправитель,
				ДокументСсылка.ПодразделениеОтправитель,
				ОстатокВРознице,
				СуммаПередачи - ОстатокВРознице);
				
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументСсылка,,, Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Налоговый учет - проверим достаточность остатка на счете розницы.
	МассивКФОдляНУ = НалоговыйУчетКлиентСервер.ПолучитьМассивКФОдляНалоговогоУчета();
	ОтражаетсяВНалоговомУчете = НалоговыйУчетВызовСервера.ПлательщикНалогаНаПрибыль(ДокументСсылка.Организация, ДокументСсылка.Дата);
	Если ОтражаетсяВНалоговомУчете Тогда
	
		УчетнаяПолитика = БухгалтерскиеОперацииПовтИсп.УчетнаяПолитикаОрганизации(ДокументСсылка.Организация, ДокументСсылка.Дата);
		РозничнаяТорговляОблагаетсяЕНВД = УчетнаяПолитика.РозничнаяТорговляОблагаетсяЕНВД;
		
		ТаблицаСписания.Свернуть(ПрефиксКолонки+"КФО", ПрефиксКолонки+"СуммаПередачи");
		Для Каждого СтрокаСписания Из ТаблицаСписания Цикл
			
			КФОСписания   = СтрокаСписания[ПрефиксКолонки+"КФО"];
			СуммаПередачи = СтрокаСписания[ПрефиксКолонки+"СуммаПередачи"];
			
			Если МассивКФОдляНУ.Найти(КФОСписания) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураПоиска = Новый Структура("ЦМО,КФО",
				ДокументСсылка.ЦМООтправитель,
				КФОСписания);
			Если ИспользоватьУчетПоИФО Тогда
				СтруктураПоиска.Вставить("ИФО", ДокументСсылка.ИФО);
			КонецЕсли;
			МассивСтрок = ТаблицаНаценкиНУ.НайтиСтроки(СтруктураПоиска);
			
			Если НЕ РозничнаяТорговляОблагаетсяЕНВД Тогда
				ОстатокВРознице = ?(МассивСтрок.Количество()=0, 0, МассивСтрок[0].ПродажнаяСтоимостьОстаток);
			Иначе
				ОстатокВРознице = ?(МассивСтрок.Количество()=0, 0, МассивСтрок[0].ПродажнаяСтоимостьЕНВДОстаток);
			КонецЕсли;
			
			Если СуммаПередачи > ОстатокВРознице Тогда
				
				ТекстОшибки = НСтр("ru='Сумма списания по КФО %1 превышает остаток в рознице по счету налогового учета %2.
					|
					|ЦМО: %3.
					|Остаток: %4; Не хватает: %5'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
					КФОСписания,
					БухгалтерскийУчет.СчетПоКоду("Н41.02"),
					ДокументСсылка.ЦМООтправитель,
					ОстатокВРознице,
					СуммаПередачи - ОстатокВРознице);
					
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументСсылка,,, Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		СинонимТаблицыМатериалы = СтрДокумента.Документ_Ссылка. Метаданные().ТабличныеЧасти.Материалы.Синоним;
		
		Для каждого СтрокаТаблицы Из ИсточникиДанных["Материалы"] Цикл
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			
			НоваяСтрока.ИмяСписка     = "Материалы";
			НоваяСтрока.СинонимСписка = СинонимТаблицыМатериалы;
			НоваяСтрока.НомерСтроки   = СтрокаТаблицы.НомерСтроки;
			
			// Заполняем поля (кроме вычисляемых) из реквизитов источника данных.
			Для каждого ТекПолеФункции Из ПоляФункции Цикл
				Если ТекПолеФункции.Имя = "ИмяСписка"
					ИЛИ ТекПолеФункции.Имя = "СинонимСписка"
					ИЛИ ТекПолеФункции.Имя = "НомерСтроки" 
					ИЛИ ВычисляемыеПоля.Свойство(ТекПолеФункции.Имя) Тогда
					Продолжить;
				КонецЕсли;
				НоваяСтрока[ТекПолеФункции.Имя] = СтрокаТаблицы[ПрефиксКолонки + ТекПолеФункции.Имя];
			КонецЦикла;
			
			КФОПередачи   = СтрокаТаблицы[ПрефиксКолонки+"КФО"];
			КПСПередачи   = СтрокаТаблицы[ПрефиксКолонки+"КПС"];
			СуммаПередачи = СтрокаТаблицы[ПрефиксКолонки+"СуммаПередачи"];
			
			// Бухгалтерский учет.
			СтруктураПоиска = Новый Структура("ЦМО,КФО,СчетРозницы,КПСРозницы",
				ДокументСсылка.ЦМООтправитель,
				КФОПередачи,
				СчетРозницы,
				КПСПередачи);
			Если ИспользоватьУчетПоИФО Тогда
				СтруктураПоиска.Вставить("ИФО", ДокументСсылка.ИФО);
			КонецЕсли;
			Если ВедетсяУчетПоПодразделениям Тогда
				СтруктураПоиска.Вставить("ПодразделениеРозницы", ДокументСсылка.ПодразделениеОтправитель);
			КонецЕсли;
			МассивСтрок = ТаблицаНаценкиБУ.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() > 0 Тогда
				СтрокаНаценкиБУ = МассивСтрок[0];
				
				НоваяСтрока.СчетРозницы = СтрокаНаценкиБУ.СчетРозницы;
				НоваяСтрока.КЭКРозницы  = СтрокаНаценкиБУ.КЭКРозницы;
				НоваяСтрока.СчетНаценки = СтрокаНаценкиБУ.СчетНаценки;
				
				Если СуммаПередачи + СтрокаНаценкиБУ.ПродажнаяСтоимостьРеализация + СтрокаНаценкиБУ.СписаноПродажнаяСтоимость = СтрокаНаценкиБУ.ПродажнаяСтоимостьОстаток Тогда
					// Списываем из НТТ весь остаток товаров, а значит и всю наценку.
					НоваяСтрока.СуммаНаценки = СтрокаНаценкиБУ.ТорговаяНаценкаОстаток - СтрокаНаценкиБУ.СписаноСуммаНаценки;
				Иначе
					НоваяСтрока.СуммаНаценки = Окр(СтрокаНаценкиБУ.ТорговаяНаценкаОстаток * СуммаПередачи
												/ (СтрокаНаценкиБУ.ПродажнаяСтоимостьОстаток + СтрокаНаценкиБУ.ПродажнаяСтоимостьРеализация), 2);
				КонецЕсли;
				
				СтрокаНаценкиБУ.СписаноПродажнаяСтоимость = СтрокаНаценкиБУ.СписаноПродажнаяСтоимость + СуммаПередачи;
				СтрокаНаценкиБУ.СписаноСуммаНаценки       = СтрокаНаценкиБУ.СписаноСуммаНаценки       + НоваяСтрока.СуммаНаценки;
				
			КонецЕсли;
			
			// Налоговый учет.
			Если ОтражаетсяВНалоговомУчете Тогда
				
				Если МассивКФОдляНУ.Найти(КФОПередачи) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтруктураПоиска = Новый Структура("ЦМО,КФО",
					ДокументСсылка.ЦМООтправитель,
					КФОПередачи);
				Если ИспользоватьУчетПоИФО Тогда
					СтруктураПоиска.Вставить("ИФО", ДокументСсылка.ИФО);
				КонецЕсли;
				МассивСтрок = ТаблицаНаценкиНУ.НайтиСтроки(СтруктураПоиска);
				
				Если МассивСтрок.Количество() > 0 Тогда
					СтрокаНаценкиНУ = МассивСтрок[0];
					
					НоваяСтрока.СчетРозницыНУ = СтрокаНаценкиНУ.СчетРозницы;
					НоваяСтрока.СчетНаценкиНУ = СтрокаНаценкиНУ.СчетНаценки;
					
					Если НЕ РозничнаяТорговляОблагаетсяЕНВД Тогда
						
						Если СуммаПередачи + СтрокаНаценкиНУ.ПродажнаяСтоимостьРеализация + СтрокаНаценкиНУ.СписаноПродажнаяСтоимость = СтрокаНаценкиНУ.ПродажнаяСтоимостьОстаток Тогда
							// Списываем из НТТ весь остаток товаров, а значит и всю наценку.
							НоваяСтрока.СуммаНаценкиНУ              = СтрокаНаценкиНУ.ТорговаяНаценкаОстаток                - СтрокаНаценкиНУ.СписаноСуммаНаценки;
							НоваяСтрока.СуммаНаценкиНеУчитываетсяНУ = СтрокаНаценкиНУ.ТорговаяНаценкаНеУчитываетсяНУОстаток - СтрокаНаценкиНУ.СписаноСуммаНаценкиНеУчитываетсяНУ;
						Иначе
							НоваяСтрока.СуммаНаценкиНУ = Окр(СтрокаНаценкиНУ.ТорговаяНаценкаОстаток * СуммаПередачи
														/ (СтрокаНаценкиНУ.ПродажнаяСтоимостьОстаток + СтрокаНаценкиНУ.ПродажнаяСтоимостьРеализация), 2);
							НоваяСтрока.СуммаНаценкиНеУчитываетсяНУ = Окр(СтрокаНаценкиНУ.ТорговаяНаценкаНеУчитываетсяНУОстаток * СуммаПередачи
														/ (СтрокаНаценкиНУ.ПродажнаяСтоимостьОстаток + СтрокаНаценкиНУ.ПродажнаяСтоимостьРеализация), 2);
						КонецЕсли;
						
					Иначе
						
						Если СуммаПередачи + СтрокаНаценкиНУ.ПродажнаяСтоимостьЕНВДРеализация + СтрокаНаценкиНУ.СписаноПродажнаяСтоимость = СтрокаНаценкиНУ.ПродажнаяСтоимостьЕНВДОстаток Тогда
							// Списываем из НТТ весь остаток товаров, а значит и всю наценку.
							НоваяСтрока.СуммаНаценкиНУ = СтрокаНаценкиНУ.ТорговаяНаценкаЕНВДОстаток - СтрокаНаценкиНУ.СписаноСуммаНаценки;
						Иначе
							НоваяСтрока.СуммаНаценкиНУ = Окр(СтрокаНаценкиНУ.ТорговаяНаценкаЕНВДОстаток * СуммаПередачи
														/ (СтрокаНаценкиНУ.ПродажнаяСтоимостьЕНВДОстаток + СтрокаНаценкиНУ.ПродажнаяСтоимостьЕНВДРеализация), 2);
						КонецЕсли;
						
						НоваяСтрока.СуммаНаценкиНеУчитываетсяНУ = 0; // Не относится к деятельности с особым порядком налогообложения (ЕНВД и пр.).
						
					КонецЕсли;
					
					СтрокаНаценкиНУ.СписаноПродажнаяСтоимость          = СтрокаНаценкиНУ.СписаноПродажнаяСтоимость          + СуммаПередачи;
					СтрокаНаценкиНУ.СписаноСуммаНаценки                = СтрокаНаценкиНУ.СписаноСуммаНаценки                + НоваяСтрока.СуммаНаценкиНУ;
					СтрокаНаценкиНУ.СписаноСуммаНаценкиНеУчитываетсяНУ = СтрокаНаценкиНУ.СписаноСуммаНаценкиНеУчитываетсяНУ + НоваяСтрока.СуммаНаценкиНеУчитываетсяНУ;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		КонтекстЗаполненияОперации = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		КонтекстЗаполненияОперации.Отказ = Истина;
		БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстЗаполненияОперации);
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область УчетПродуктовПитания

Функция СписаниеПродуктовПитания(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаСписанияПродуктовПитания = УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеПродуктовПитания();
	Для Каждого Колонка Из ТаблицаСписанияПродуктовПитания.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Если ДокументОбъект.ЭтоВозврат Тогда
		Возврат ТаблицаСписанияПродуктовПитания; // В этом случае используется источник данных ВозвратПродуктовПитания.
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если НЕ Параметры.Свойство("ДополнительнаяАналитикаСчета") Тогда
		// Доп. аналитика на счетах учета продуктов питания 105.22,105.32 не используется,
		// если явно не указана в параметрах.
		Параметры.Вставить("ДополнительнаяАналитикаСчета", "<не используется>");
	КонецЕсли;
	
	ТаблицаДокумента = УправлениеМатериальнымиЗапасами.ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(
		ДокументОбъект, Параметры, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения списания материальных запасов стандартной функцией.
		ТаблицаСписания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеМатериальныхЗапасов(
			ТаблицаДокумента, Реквизиты, Отказ);
		
		// Добавим данные о категориях и количестве довольствующихся, а также о счете и аналитике затрат.
		ТаблицаСписанияПродуктовПитания = УправлениеМатериальнымиЗапасами.ТаблицаСписаниеПродуктовПитания(
			ТаблицаСписания, ДокументОбъект, Параметры, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеПродуктовПитания", ТаблицаСписанияПродуктовПитания.Скопировать());
	// Для механизма резервирования нужно сохранить таблицу списания в ключе "ТаблицаСписаниеМатериальныхЗапасов"
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаСписаниеМатериальныхЗапасов", КонтекстПроведения.ДополнительныеСвойства.ТаблицаСписаниеПродуктовПитания);
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписанияПродуктовПитания;
	
КонецФункции

Функция ВозвратПродуктовПитания(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаВозвратПродуктов = УправлениеМатериальнымиЗапасами.ПустаяТаблицаВозвратПродуктовПитания();
	Для Каждого Колонка Из ТаблицаВозвратПродуктов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Если НЕ ДокументОбъект.ЭтоВозврат Тогда
		Возврат ТаблицаВозвратПродуктов; // В этом случае используется источник данных СписаниеПродуктовПитания.
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если НЕ Параметры.Свойство("ДополнительнаяАналитикаСчета") Тогда
		// Доп. аналитика на счетах учета продуктов питания 105.22,105.32 не используется,
		// если явно не указана в параметрах.
		Параметры.Вставить("ДополнительнаяАналитикаСчета", "<не используется>");
	КонецЕсли;
	
	// Подготовим таблицу для отражения возврата продуктов питания.
	ТаблицаВозвратПродуктов = УправлениеМатериальнымиЗапасами.ТаблицаВозвратПродуктовПитания(
		ДокументОбъект, Параметры, Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаВозвратПродуктовПитания", ТаблицаВозвратПродуктов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаВозвратПродуктов;
	
КонецФункции

#КонецОбласти

#Область УчетУслугРабот

// Услуги сторонних организаций

Функция ПоступлениеУслугРабот(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                 Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                 Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                 Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",       Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПодразделениеЗатрат", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПоступления = УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот();
	Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуПоступлениеУслугРаботПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения поступления материальных запасов,
	ТаблицаПоступления = УчетРасчетов.ТаблицаПоступлениеУслугРабот(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеУслугРабот", ТаблицаПоступления.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция ПоступлениеУслугРаботПоСчетамУчетаЗатрат(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                 Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                 Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                 Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",       Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПодразделениеЗатрат", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ТаблицаПоступления = УчетРасчетов.ПустаяТаблицаПоступлениеУслугРаботПоСчетамЗатрат();
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуПоступлениеУслугРаботПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения поступления материальных запасов,
	ТаблицаПоступления = УчетРасчетов.ТаблицаПоступлениеУслугРабот(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ, ТаблицаПоступления);
	// и сохраним ее для формирования других источников данных.
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеУслугРабот", ТаблицаПоступления.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция ПоступлениеУслугРаботРезерв(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                 Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                 Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                 Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",       Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПодразделениеЗатрат", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПоступления = УчетРасчетов.ПустаяТаблицаПоступлениеУслугРаботРезерв();
	Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуПоступлениеУслугРаботПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения поступления материальных запасов,
	ТаблицаПоступления = УчетРасчетов.ТаблицаПоступлениеУслугРаботРезерв(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	// Таблица "ПоступлениеУслугРаботРезерв" содержит все колонки таблицы "ТаблицаПоступлениеУслугРабот",
	// поэтому для дальнейшей обработки ее можно сохранить под тем же именем.
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеУслугРабот", ТаблицаПоступления.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция ПоступлениеДопРасходов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",               Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",               Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",               Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЦМО",               Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",     Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетВложений",      Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПартияВложений",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыВидовХарактеристик.ВидыСубконто.Партии, "ТипЗначения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "БазаРаспределения", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",      Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПоступления = УчетРасчетов.ПустаяТаблицаПоступлениеДопРасходов();
	Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если Параметры.Свойство("ПартияВложений") И ЗначениеЗаполнено(Параметры.ПартияВложений) Тогда
		
		Если ТипЗнч(Параметры.ПартияВложений) <> Тип("ДокументСсылка.ПоступлениеОС") Тогда
			
			// КФО определим из проводок документа партии.
			СчетаВложений = "105.00,106.2П,106.3П,106.4П,106.27,106.37";
			КФОВложений = БухгалтерскиеОперации.РеквизитПроводкиДокумента("КФО",
				Параметры.ПартияВложений, СчетаВложений, "Дт");
			Параметры.Вставить("КФО", КФОВложений);
			
			Если НЕ ЗначениеЗаполнено(КФОВложений) Тогда
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					СтрШаблон(НСтр("ru='Документ партии %1 не формирует проводок по счетам вложений в МЗ и БА (%1).'"),
						СчетаВложений),
					Параметры.ПартияВложений);
				БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(ТекстОшибки, "ПартияМПЗ", Отказ);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		БухгалтерскиеОперацииСервер.ДобавитьСообщениеОбОшибке(НСтр("ru='Документ партии не указан.'"), "ПартияМПЗ", Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуПоступлениеУслугРаботПоДокументу(
			Реквизиты.Ссылка, Параметры);
		
		ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
			ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
			Неопределено);
		
		// Подготовим таблицу для отражения поступления доп. расходов.
		ТаблицаПоступления = УчетРасчетов.ТаблицаПоступлениеДопРасходов(
			ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеДопРасходов", ТаблицаПоступления.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

// Услуги оказанные

Функция РеализацияУслугРабот(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКРасчетов",   Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		// Аналитика доходов БУ и НУ.
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетДБП",               Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетДоходов",           Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СубконтоДоходов1" ,     Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СубконтоДоходов2",      Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СубконтоДоходов3",      Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидДеятельностиНУ",     Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетДоходовНУ",         Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СтатьяПрочихДоходовНУ", Новый ОписаниеТипов("СправочникСсылка.ПрочиеДоходыИРасходы"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРеализации = УчетРасчетов.ПустаяТаблицаРеализацияУслугРабот();
	Для Каждого Колонка Из ТаблицаРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	// Для корректной работы ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу.
	Если Параметры.Свойство("СубконтоДоходов1") И Параметры.СубконтоДоходов1 = Неопределено Тогда
		Параметры.СубконтоДоходов1 = "";
	КонецЕсли;
	Если Параметры.Свойство("СубконтоДоходов2") И Параметры.СубконтоДоходов2 = Неопределено Тогда
		Параметры.СубконтоДоходов2 = "";
	КонецЕсли;
	Если Параметры.Свойство("СубконтоДоходов3") И Параметры.СубконтоДоходов3 = Неопределено Тогда
		Параметры.СубконтоДоходов3 = "";
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуРеализацияУслугРаботПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения реализации услуг, работ,
	ТаблицаРеализации = УчетРасчетов.ТаблицаРеализацияУслугРабот(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаРеализацияУслугРабот", ТаблицаРеализации.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРеализации;
	
КонецФункции

// Завершение работ

Функция ЗавершениеРабот_НачислениеДоходов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ОписаниеТиповСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ВычисляемыеПоля = Новый Структура;
	
	// Счет и аналитика накопленных доходов будущих периодов.
	ВычисляемыеПоля.Вставить("Счет",              Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ВычисляемыеПоля.Вставить("КПС",               Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ВычисляемыеПоля.Вставить("КЭК",               Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ВычисляемыеПоля.Вставить("Подразделение",     Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ВычисляемыеПоля.Вставить("Субконто1",         ОписаниеТиповСубконто);
	ВычисляемыеПоля.Вставить("Субконто2",         ОписаниеТиповСубконто);
	ВычисляемыеПоля.Вставить("Субконто3",         ОписаниеТиповСубконто);
	
	// Вспомогательные поля для идентификации доходов будущих периодов.
	ВычисляемыеПоля.Вставить("Номенклатура",              Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВычисляемыеПоля.Вставить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
	
	// Суммы накопленных доходов будущих периодов.
	ВычисляемыеПоля.Вставить("СуммаДоходов", ОписаниеТипаСуммы);
	ВычисляемыеПоля.Вставить("СуммаДоходовВал", ОписаниеТипаСуммы);
	ВычисляемыеПоля.Вставить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	ПоляФункции = Новый Массив;
	Для Каждого ВычисляемоеПоле Из ВычисляемыеПоля Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, ВычисляемоеПоле.Ключ, ВычисляемоеПоле.Значение);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	// Номенклатура выполненных работ по всем этапам договора.
	НоменклатураРабот = Документы.ЗавершениеРабот.НоменклатураВыполненныхРабот(РеквизитыДокумента.Ссылка);
	
	// Накопленные доходы будущих периодов по всем этапам договора.
	ОстаткиДБП = Документы.ЗавершениеРабот.НакопленныеДоходыБудущихПериодов(
		Новый Граница(РеквизитыДокумента.Дата, ВидГраницы.Включая),
		РеквизитыДокумента.Организация, РеквизитыДокумента.ИФО, РеквизитыДокумента.КФО,
		НоменклатураРабот);
	
	ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	// Заполняем таблицу источника данных.
	Для Каждого ДБПпоВыполненнымРаботам Из ОстаткиДБП Цикл
		
		Если ДБПпоВыполненнымРаботам.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДБПпоВыполненнымРаботам);
		
		Если ИспользоватьВалютныйУчет
			И ЗначениеЗаполнено(ДБПпоВыполненнымРаботам.Валюта)
			И ДБПпоВыполненнымРаботам.Валюта <> ВалютаРегламентированногоУчета Тогда
			НоваяСтрока.Валюта = ДБПпоВыполненнымРаботам.Валюта;
			НоваяСтрока.СуммаДоходовВал = ДБПпоВыполненнымРаботам.ВалютнаяСумма;
			НоваяСтрока.СуммаДоходов = ДБПпоВыполненнымРаботам.Сумма;
		Иначе
			НоваяСтрока.Валюта = ВалютаРегламентированногоУчета;
			НоваяСтрока.СуммаДоходов = ДБПпоВыполненнымРаботам.Сумма;
			НоваяСтрока.СуммаДоходовВал = НоваяСтрока.СуммаДоходов;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ЗавершениеРабот_СписаниеРасходов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ОписаниеТиповСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ВычисляемыеПоля = Новый Структура;
	
	// Счет и аналитика накопленных расходов на выполнение работ.
	ВычисляемыеПоля.Вставить("СчетРасходов",              Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ВычисляемыеПоля.Вставить("КПСРасходов",               Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ВычисляемыеПоля.Вставить("КЭКРасходов",               Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ВычисляемыеПоля.Вставить("ПодразделениеРасходов",     Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ВычисляемыеПоля.Вставить("СубконтоРасходов1",         ОписаниеТиповСубконто);
	ВычисляемыеПоля.Вставить("СубконтоРасходов2",         ОписаниеТиповСубконто);
	ВычисляемыеПоля.Вставить("СубконтоРасходов3",         ОписаниеТиповСубконто);
	
	// Вспомогательные поля для идентификации расходов.
	ВычисляемыеПоля.Вставить("Номенклатура",              Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВычисляемыеПоля.Вставить("ВидЗатрат",                 Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ВычисляемыеПоля.Вставить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
	ВычисляемыеПоля.Вставить("ВидЗатратПредставление",    Новый ОписаниеТипов("Строка"));
	
	// Счет и аналитика доходов будущих периодов (ДБП).
	ВычисляемыеПоля.Вставить("СчетДБП",                   Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ВычисляемыеПоля.Вставить("КПС_ДБП",                   Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ВычисляемыеПоля.Вставить("КЭК_ДБП",                   Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ВычисляемыеПоля.Вставить("ПодразделениеДБП",          Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ВычисляемыеПоля.Вставить("СубконтоДБП1",              ОписаниеТиповСубконто);
	ВычисляемыеПоля.Вставить("СубконтоДБП2",              ОписаниеТиповСубконто);
	ВычисляемыеПоля.Вставить("СубконтоДБП3",              ОписаниеТиповСубконто);
	
	// Суммы накопленных расходов на выполнение работ.
	ВычисляемыеПоля.Вставить("СуммаРасходов",                ОписаниеТипаСуммы);
	ВычисляемыеПоля.Вставить("СуммаРасходовНУ",              ОписаниеТипаСуммы);
	ВычисляемыеПоля.Вставить("СуммаРасходовЕНВД",            ОписаниеТипаСуммы);
	ВычисляемыеПоля.Вставить("СуммаРасходовНеУчитываетсяНУ", ОписаниеТипаСуммы);

	ПоляФункции = Новый Массив;
	Для Каждого ВычисляемоеПоле Из ВычисляемыеПоля Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, ВычисляемоеПоле.Ключ, ВычисляемоеПоле.Значение);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	// Номенклатура выполненных работ по всем этапам договора.
	НоменклатураРабот = Документы.ЗавершениеРабот.НоменклатураВыполненныхРабот(РеквизитыДокумента.Ссылка);
	
	// Оставшиеся (не списанные) затраты на момент завершения работ.
	ОстаткиЗатрат = Документы.СписаниеЗатратПоУслугам.ОстаткиЗатратНаОказаниеУслуг(
		Новый Граница(РеквизитыДокумента.Дата, ВидГраницы.Включая),
		РеквизитыДокумента.Организация, РеквизитыДокумента.ИФО, РеквизитыДокумента.КФО,
		НоменклатураРабот);
		
	// Накопленные доходы будущих периодов по всем этапам договора.
	ОстаткиДБП = Документы.ЗавершениеРабот.НакопленныеДоходыБудущихПериодов(
		Новый Граница(РеквизитыДокумента.Дата, ВидГраницы.Включая),
		РеквизитыДокумента.Организация, РеквизитыДокумента.ИФО, РеквизитыДокумента.КФО,
		НоменклатураРабот);
	
	// Заполняем таблицу источника данных.
	Для Каждого ОстаткиЗатратБУ Из ОстаткиЗатрат.ТаблицаЗатратБУ Цикл
		
		Если ОстаткиЗатратБУ.Сумма <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДБПпоВыполненнымРаботам = ОстаткиДБП.НайтиСтроки(Новый Структура("Номенклатура", ОстаткиЗатратБУ.Номенклатура));
		Если ДБПпоВыполненнымРаботам.Количество() = 0 Тогда
			
			ТекстСообщения = НСтр("ru='По работам ""%1"" не отражены доходы будущих периодов на счете 401.40.
				|
				|Остаток расходов на счете %2 в сумме %3 не списан.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
				ОстаткиЗатратБУ.НоменклатураПредставление,
				ОстаткиЗатратБУ.Счет,
				ОбщегоНазначенияБГУ.ФорматСумм(ОстаткиЗатратБУ.Сумма));
				
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РеквизитыДокумента.Ссылка);
			Продолжить;
			
		КонецЕсли;
		
		// Остаток расходов распределим по КБК, КЭК и аналитике учета доходов на счете 401.40.
		БазаРаспределенияРасходов = Новый Массив;
		Для Каждого ДоходПоРаботам Из ДБПпоВыполненнымРаботам Цикл
			БазаРаспределенияРасходов.Добавить(ДоходПоРаботам.Сумма);
		КонецЦикла;
		
		РаспределениеРасходов = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			ОстаткиЗатратБУ.Сумма, БазаРаспределенияРасходов);
		Если РаспределениеРасходов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Индекс = 0 По РаспределениеРасходов.Количество() - 1 Цикл
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиЗатратБУ);
			
			НоваяСтрока.СуммаРасходов = РаспределениеРасходов[Индекс];
			
			НоваяСтрока.СчетРасходов          = ОстаткиЗатратБУ.Счет;
			НоваяСтрока.КПСРасходов           = ОстаткиЗатратБУ.КПС;
			НоваяСтрока.КЭКРасходов           = ОстаткиЗатратБУ.КЭК;
			НоваяСтрока.ПодразделениеРасходов = ОстаткиЗатратБУ.Подразделение;
			НоваяСтрока.СубконтоРасходов1     = ОстаткиЗатратБУ.Субконто1;
			НоваяСтрока.СубконтоРасходов2     = ОстаткиЗатратБУ.Субконто2;
			НоваяСтрока.СубконтоРасходов3     = ОстаткиЗатратБУ.Субконто3;
			
			ДБПпоРаботам = ДБПпоВыполненнымРаботам[Индекс];
			НоваяСтрока.СчетДБП          = ДБПпоРаботам.Счет;
			НоваяСтрока.КПС_ДБП          = ДБПпоРаботам.КПС;
			НоваяСтрока.КЭК_ДБП          = ДБПпоРаботам.КЭК;
			НоваяСтрока.ПодразделениеДБП = ДБПпоРаботам.Подразделение;
			НоваяСтрока.СубконтоДБП1     = ДБПпоРаботам.Субконто1;
			НоваяСтрока.СубконтоДБП2     = ДБПпоРаботам.Субконто2;
			НоваяСтрока.СубконтоДБП3     = ДБПпоРаботам.Субконто3;
			
		КонецЦикла;
		
	КонецЦикла;

	ОтражатьВНалоговомУчете = НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(
		РеквизитыДокумента.Организация, РеквизитыДокумента.Дата, РеквизитыДокумента.КФО);
	Если ОтражатьВНалоговомУчете Тогда
		
		Для Каждого ОстаткиЗатратНУ Из ОстаткиЗатрат.ТаблицаЗатратНУ Цикл
			
			Если ОстаткиЗатратНУ.Сумма <= 0
			   И ОстаткиЗатратНУ.СуммаЕНВД <= 0
			   И ОстаткиЗатратНУ.СуммаНеУчитываетсяНУ <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстаткиЗатратНУ);
			
			НоваяСтрока.СуммаРасходовНУ              = ОстаткиЗатратНУ.Сумма;
			НоваяСтрока.СуммаРасходовЕНВД            = ОстаткиЗатратНУ.СуммаЕНВД;
			НоваяСтрока.СуммаРасходовНеУчитываетсяНУ = ОстаткиЗатратНУ.СуммаНеУчитываетсяНУ;
			
			НоваяСтрока.СчетРасходов      = ОстаткиЗатратНУ.Счет;
			НоваяСтрока.СубконтоРасходов1 = ОстаткиЗатратНУ.Субконто1;
			НоваяСтрока.СубконтоРасходов2 = ОстаткиЗатратНУ.Субконто2;
			НоваяСтрока.СубконтоРасходов3 = ОстаткиЗатратНУ.Субконто3;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область УчетПроизводства

Функция ФактическаяСтоимостьВыпущеннойПродукции(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ПустаяТаблица = Документы.ЗакрытиеСчетовПроизводственныхЗатрат.ПустаяТаблицаФактическаяСтоимостьПродукции();
	Для Каждого Колонка Из ПустаяТаблица.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	ТаблицаФактическаяСтоимостьПродукции =
		Документы.ЗакрытиеСчетовПроизводственныхЗатрат.ТаблицаФактическаяСтоимостьПродукции(
			ДокументОбъект.Ссылка);
	
	Возврат ТаблицаФактическаяСтоимостьПродукции;
	
КонецФункции

Функция ВыпускПродукцииСоСчета106(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ПустаяТаблица = Документы.ВыпускПродукцииСоСчета106.ПустаяТаблицаВыпускПродукцииСоСчета106();
	Для Каждого Колонка Из ПустаяТаблица.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	ТаблицаВыпускПродукцииСоСчета106 =
		Документы.ВыпускПродукцииСоСчета106.ТаблицаВыпускПродукцииСоСчета106(
			ДокументОбъект.Ссылка);
	
	Возврат ТаблицаВыпускПродукцииСоСчета106;
	
КонецФункции

Функция ВыпускПродукцииСоСчета106НУ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ПустаяТаблица = Документы.ВыпускПродукцииСоСчета106.ПустаяТаблицаВыпускПродукцииСоСчета106НУ();
	Для Каждого Колонка Из ПустаяТаблица.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	ТаблицаВыпускПродукцииСоСчета106НУ =
		Документы.ВыпускПродукцииСоСчета106.ТаблицаВыпускПродукцииСоСчета106НУ(
			ДокументОбъект.Ссылка);
	
	Возврат ТаблицаВыпускПродукцииСоСчета106НУ;
	
КонецФункции

#КонецОбласти

#Область УчетОсновныхСредств

Функция ПоступлениеОсновныхСредств(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидЗатрат",     Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПоступления = УправлениеОсновнымиСредствами.ПустаяТаблицаПоступлениеОсновныхСредств();
	Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеОсновнымиСредствами.ПодготовитьТаблицуПоступлениеОсновныхСредствПоДокументу(
		Реквизиты.Ссылка, Параметры, Отказ);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения поступления основных средств.
		ТаблицаПоступления = УправлениеОсновнымиСредствами.ТаблицаПоступлениеОсновныхСредств(
			ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеОсновныхСредств",
		ТаблицаПоступления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция ВложенияВоВнеоборотныеАктивы(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",                 Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",                 Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",                 Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение",       Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",        Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетВложений",        Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВнеоборотныйАктив",   Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидЗатрат",           Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПодразделениеЗатрат", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПоступления = УправлениеОсновнымиСредствами.ПустаяТаблицаВложенияВоВнеоборотныеАктивы();
	Для Каждого Колонка Из ТаблицаПоступления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеОсновнымиСредствами.ПодготовитьТаблицуВложенияВоВнеоборотныеАктивыПоДокументу(
		ИсточникиДанных.ДокументОбъект, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения поступления основных средств,
	ТаблицаПоступления = УправлениеОсновнымиСредствами.ТаблицаВложенияВоВнеоборотныеАктивы(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаВложенияВоВнеоборотныеАктивы",
		ТаблицаПоступления.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция РеализацияОсновныхСредств(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКДоходов",    Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРеализации = УправлениеОсновнымиСредствами.ПустаяТаблицаРеализацияОсновныхСредств();
	Для Каждого Колонка Из ТаблицаРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеОсновнымиСредствами.ПодготовитьТаблицуРеализацияОсновныхСредствПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения реализации основных средств,
	ТаблицаРеализации = УправлениеОсновнымиСредствами.ТаблицаРеализацияОсновныхСредств(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаРеализацияОсновныхСредств",
		ТаблицаРеализации.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРеализации;
	
КонецФункции

Функция ПринятиеКУчетуОсновныхСредствПоКПС(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка"						, Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(80)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки"					, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0, ДопустимыйЗнак.Неотрицательный)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ОбъектВложений"					, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КПСВложений"					, Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетВложений"					, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ЦМОВложений"					, Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ДоговорВложений"				, Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КоличествоВложений"				, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаВложений"					, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаВложенийНУ"				, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаВложенийНеУчитываетсяНУ"	, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаВложенийЕНВД"				, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	// Добавляем все колонки таб.части "ОсновныеСредства".
	Для Каждого КолонкаДокумента Из Метаданные.Документы.ПринятиеКУчетуОбъектовОС.ТабличныеЧасти.ОсновныеСредства.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, КолонкаДокумента.Имя, КолонкаДокумента.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	ТаблицаКапВложений = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "КапитальныеВложения", Истина);
	КоэффициентыРаспределенияСуммы = ТаблицаКапВложений.ВыгрузитьКолонку("Сумма");
	КоэффициентыРаспределенияКоличества = ТаблицаКапВложений.ВыгрузитьКолонку("Количество");
	КоличествоСтрокВложений = ТаблицаКапВложений.Количество();
	
	ВедетсяУчетКапВложенийНУПоКПСиЦМО = НалоговыйУчет.ОтражатьВНалоговомУчете(ДокументОбъект.Организация, ДокументОбъект.Дата, ДокументОбъект.КФО)
		И (НалоговыйУчетПовтИсп.ВедетсяУчетКапВложенийНУПоКПС(ДокументОбъект.Дата)
		ИЛИ НалоговыйУчетПовтИсп.ВедетсяУчетКапВложенийНУПоЦМО(ДокументОбъект.Дата));
	Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
		КоэффициентыРаспределенияСуммаНУ = ТаблицаКапВложений.ВыгрузитьКолонку("СуммаНУ");
		КоэффициентыРаспределенияСуммаНеУчитываетсяНУ = ТаблицаКапВложений.ВыгрузитьКолонку("СуммаНеУчитываетсяНУ");
		КоэффициентыРаспределенияСуммаЕНВД = ТаблицаКапВложений.ВыгрузитьКолонку("СуммаЕНВД");
	КонецЕсли;
	
	Если ТаблицаКапВложений.Колонки.Найти("Договор") = Неопределено Тогда
		ТаблицаКапВложений.Колонки.Добавить("Договор");
	КонецЕсли;
	
	ТаблицаОС = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "ОсновныеСредства", Истина);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	Для Каждого ПолеРезультата Из ПоляФункции Цикл
		ТаблицаРезультат.Колонки.Добавить(ПолеРезультата.Имя, ПолеРезультата.Тип);
	КонецЦикла;
	
	// Распределим суммы кавложений (может быть несколько, например, по нескольким КПС)
	// на принимаемые к учету объекты (может быть несколько)
	КоличествоКапвложенийВсего = ТаблицаКапВложений.Итог("Количество");
	// Количества в таблице вложений может и не быть, если это изготовление.
	// Но количество должно быть заполнено в самом документе в реквизите "Количество"
	Если КоличествоКапвложенийВсего = 0 Тогда
		Если ИсточникиДанных.Свойство("Документ") И ТипЗнч(ИсточникиДанных.Документ) = Тип("ТаблицаЗначений") И ИсточникиДанных.Документ.Количество() <> 0 Тогда
			Если ИсточникиДанных.Документ.Колонки.Найти("Документ_Количество") <> Неопределено Тогда
				КоличествоКапвложенийВсего = ИсточникиДанных.Документ[0].Документ_Количество;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если КоличествоКапвложенийВсего <> 0 Тогда
		КапвложенийВсего = КоличествоКапвложенийВсего;
	Иначе	
		КапвложенийВсего = ТаблицаКапВложений.Итог("Сумма");
	КонецЕсли;	
	КапвложенийУжеСписано = 0;                
	
	ОтборВложений = Новый Структура("КПСВложений, ЦМОВложений, ДоговорВложений");
	Для Каждого СтрокаТаблицыОС Из ТаблицаОС Цикл   
		Если КоличествоКапвложенийВсего <> 0 Тогда
			КапвложенийУжеСписано = КапвложенийУжеСписано + СтрокаТаблицыОС.Количество;
		Иначе	
			КапвложенийУжеСписано = КапвложенийУжеСписано + СтрокаТаблицыОС.Сумма;
		КонецЕсли;	
		
		Если КапвложенийУжеСписано = КапвложенийВсего Тогда     
			// Если списываются последние капвложения, то суммы нужно рассчитывать не по коэффициентам,
			// а получать остаток от соответствующей общей суммы, чтобы избежать остатков по КПС
			РаспределенныеСуммы      = Новый Массив;
			РаспределенноеКоличество = Новый Массив;
			РаспределеннаяСуммаВсего = 0;
			
			Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
				РаспределенныеСуммаНУ              = Новый Массив;
				РаспределенныеСуммаНеУчитываетсяНУ = Новый Массив;
				РаспределенныеСуммаЕНВД            = Новый Массив;
				
				РаспределеннаяСуммаНУВсего = 0;
				РаспределеннаяСуммаНеУчитываетсяНУВсего = 0;
				РаспределеннаяСуммаЕНВДВсего = 0;
			КонецЕсли;	
			
			МаксИндексКапвложений = КоличествоСтрокВложений - 1;
			Для к = 0 по МаксИндексКапвложений Цикл   
				ОтборВложений.КПСВложений     = ТаблицаКапВложений[к].КПС;
				ОтборВложений.ЦМОВложений     = ТаблицаКапВложений[к].ЦМО;
				ОтборВложений.ДоговорВложений = ТаблицаКапВложений[к].Договор;
				ТаблицаРезультатДоп = ТаблицаРезультат.Скопировать(ОтборВложений);
				
				Если к = МаксИндексКапвложений Тогда
					ОстатокСуммыПоКПС     = КоэффициентыРаспределенияСуммы[к] - ТаблицаРезультатДоп.Итог("СуммаВложений");
					ОстатокСуммыПоОбъекту = СтрокаТаблицыОС.Сумма - РаспределеннаяСуммаВсего; 
					ДобавляемаяСумма      = Мин(ОстатокСуммыПоКПС, ОстатокСуммыПоОбъекту);
					
					Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
						ОстатокСуммаНУПоКПС     = КоэффициентыРаспределенияСуммаНУ[к] - ТаблицаРезультатДоп.Итог("СуммаВложенийНУ");
						ОстатокСуммаНУПоОбъекту = СтрокаТаблицыОС.СуммаНУ - РаспределеннаяСуммаНУВсего; 
						ДобавляемаяСуммаНУ      = Мин(ОстатокСуммаНУПоКПС, ОстатокСуммаНУПоОбъекту);

						ОстатокСуммаНеУчитываетсяНУПоКПС     = КоэффициентыРаспределенияСуммаНеУчитываетсяНУ[к] - ТаблицаРезультатДоп.Итог("СуммаВложенийНеУчитываетсяНУ");
						ОстатокСуммаНеУчитываетсяНУПоОбъекту = СтрокаТаблицыОС.СуммаНеУчитываетсяНУ - РаспределеннаяСуммаНеУчитываетсяНУВсего; 
						ДобавляемаяСуммаНеУчитываетсяНУ      = Мин(ОстатокСуммаНеУчитываетсяНУПоКПС, ОстатокСуммаНеУчитываетсяНУПоОбъекту);

						ОстатокСуммаЕНВДПоКПС     = КоэффициентыРаспределенияСуммаЕНВД[к] - ТаблицаРезультатДоп.Итог("СуммаВложенийЕНВД");
						ОстатокСуммаЕНВДПоОбъекту = СтрокаТаблицыОС.СуммаЕНВД - РаспределеннаяСуммаЕНВДВсего; 
						ДобавляемаяСуммаЕНВД      = Мин(ОстатокСуммаЕНВДПоКПС, ОстатокСуммаЕНВДПоОбъекту);
					КонецЕсли;	
				Иначе	
					ДобавляемаяСумма = КоэффициентыРаспределенияСуммы[к] - ТаблицаРезультатДоп.Итог("СуммаВложений");
					Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
						ДобавляемаяСуммаНУ = КоэффициентыРаспределенияСуммаНУ[к] - ТаблицаРезультатДоп.Итог("СуммаВложенийНУ");
						ДобавляемаяСуммаНеУчитываетсяНУ = КоэффициентыРаспределенияСуммаНеУчитываетсяНУ[к] - ТаблицаРезультатДоп.Итог("СуммаВложенийНеУчитываетсяНУ");
						ДобавляемаяСуммаЕНВД = КоэффициентыРаспределенияСуммаЕНВД[к] - ТаблицаРезультатДоп.Итог("СуммаВложенийЕНВД");
					КонецЕсли;	
				КонецЕсли;	
				
				РаспределенныеСуммы.Добавить(ДобавляемаяСумма);
				РаспределеннаяСуммаВсего = РаспределеннаяСуммаВсего + ДобавляемаяСумма;
				РаспределенноеКоличество.Добавить(КоэффициентыРаспределенияКоличества[к] - ТаблицаРезультатДоп.Итог("КоличествоВложений"));

				Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
					РаспределенныеСуммаНУ.Добавить(ДобавляемаяСуммаНУ);
					РаспределенныеСуммаНеУчитываетсяНУ.Добавить(ДобавляемаяСуммаНеУчитываетсяНУ);
					РаспределенныеСуммаЕНВД.Добавить(ДобавляемаяСуммаЕНВД);

					РаспределеннаяСуммаНУВсего = РаспределеннаяСуммаНУВсего + ДобавляемаяСуммаНУ;
					РаспределеннаяСуммаНеУчитываетсяНУВсего = РаспределеннаяСуммаНеУчитываетсяНУВсего + ДобавляемаяСуммаНеУчитываетсяНУ;
					РаспределеннаяСуммаЕНВДВсего = РаспределеннаяСуммаЕНВДВсего + ДобавляемаяСуммаЕНВД;
				КонецЕсли;	
			КонецЦикла;	
		Иначе	
			РаспределенныеСуммы = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаТаблицыОС["Сумма"], КоэффициентыРаспределенияСуммы, 2);
			РаспределенноеКоличество = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(СтрокаТаблицыОС["Количество"], КоэффициентыРаспределенияКоличества, 0);
			Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
				РаспределенныеСуммаНУ = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаТаблицыОС["СуммаНУ"], КоэффициентыРаспределенияСуммаНУ, 2);
				РаспределенныеСуммаНеУчитываетсяНУ = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаТаблицыОС["СуммаНеУчитываетсяНУ"], КоэффициентыРаспределенияСуммаНеУчитываетсяНУ, 2);
				РаспределенныеСуммаЕНВД = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаТаблицыОС["СуммаЕНВД"], КоэффициентыРаспределенияСуммаЕНВД, 2);
			КонецЕсли;
		КонецЕсли;
		
		Для ИндексСтрокиВложений = 0 По КоличествоСтрокВложений - 1 Цикл
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыОС);
			НоваяСтрока.КПСВложений		= ТаблицаКапВложений[ИндексСтрокиВложений].КПС;
			НоваяСтрока.ЦМОВложений		= ТаблицаКапВложений[ИндексСтрокиВложений].ЦМО;
			НоваяСтрока.ДоговорВложений	= ТаблицаКапВложений[ИндексСтрокиВложений].Договор;
			
			Если ИндексСтрокиВложений > 0 Тогда
				НоваяСтрока.Количество = 0;
			КонецЕсли;
			
			НоваяСтрока["СуммаВложений"] = ?(РаспределенныеСуммы = Неопределено, 0, РаспределенныеСуммы[ИндексСтрокиВложений]);
			НоваяСтрока["КоличествоВложений"] = ?(РаспределенноеКоличество = Неопределено, 0, РаспределенноеКоличество[ИндексСтрокиВложений]);
			
			Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
				НоваяСтрока["СуммаВложенийНУ"] =
					?(РаспределенныеСуммаНУ = Неопределено, 0, РаспределенныеСуммаНУ[ИндексСтрокиВложений]);
				НоваяСтрока["СуммаВложенийНеУчитываетсяНУ"] =
					?(РаспределенныеСуммаНеУчитываетсяНУ = Неопределено, 0, РаспределенныеСуммаНеУчитываетсяНУ[ИндексСтрокиВложений]);
				НоваяСтрока["СуммаВложенийЕНВД"] =
					?(РаспределенныеСуммаЕНВД = Неопределено, 0, РаспределенныеСуммаЕНВД[ИндексСтрокиВложений]);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция МодернизацияОсновныхСредств(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидЗатрат", Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаМодернизации = УправлениеОсновнымиСредствами.ПустаяТаблицаМодернизацияОсновныхСредств();
	Для Каждого Колонка Из ТаблицаМодернизации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	// Подготовим таблицу для отражения модернизации основных средств,
	ТаблицаМодернизации = УправлениеОсновнымиСредствами.ТаблицаМодернизацияОсновныхСредств(
		Реквизиты, Параметры, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаМодернизацияОсновныхСредств",
		ТаблицаМодернизации.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаМодернизации;
	
КонецФункции

Функция МодернизацияОсновныхСредствПоКПС(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаМодернизацииПоКПС = УправлениеОсновнымиСредствами.ПустаяТаблицаМодернизацияОсновныхСредств();
	
	Для Каждого Колонка Из ТаблицаМодернизацииПоКПС.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаКапВложений = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "КапитальныеВложения", Истина);
	КоэффициентыРаспределения = ТаблицаКапВложений.ВыгрузитьКолонку("Сумма");
	КоличествоСтрокВложений = ТаблицаКапВложений.Количество();
	
	Если ТаблицаКапВложений.Колонки.Найти("Договор") = Неопределено Тогда
		ТаблицаКапВложений.Колонки.Добавить("Договор");
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаМодернизацияОсновныхСредств") Тогда
		ВызватьИсключение "Не обнаружена таблица модернизации основных средств.
			|Для формирования таблицы модернизации основных средств по КПС,
			|используется таблица модернизации основных средств,
			|подготовленная функцией УправлениеОсновнымиСредствами.ТаблицаМодернизацияОсновныхСредств.";
	КонецЕсли;
	
	РаспределяемыеКолонки = Новый Массив;
	РаспределяемыеКолонки.Добавить("СуммаДемонтажа");
	РаспределяемыеКолонки.Добавить("СуммаМодернизации");
	РаспределяемыеКолонки.Добавить("СуммаТранспортировки");
	
	ВедетсяУчетКапВложенийНУПоКПСиЦМО = НалоговыйУчет.ОтражатьВНалоговомУчете(ДокументОбъект.Организация, ДокументОбъект.Дата, ДокументОбъект.КФО)
		И (НалоговыйУчетПовтИсп.ВедетсяУчетКапВложенийНУПоКПС(ДокументОбъект.Дата)
		ИЛИ НалоговыйУчетПовтИсп.ВедетсяУчетКапВложенийНУПоЦМО(ДокументОбъект.Дата));
	Если ВедетсяУчетКапВложенийНУПоКПСиЦМО Тогда
		РаспределяемыеКолонки.Добавить("СуммаМодернизацииНУ");
		РаспределяемыеКолонки.Добавить("СуммаМодернизацииНеУчитываетсяНУ");
		РаспределяемыеКолонки.Добавить("СуммаМодернизацииЕНВД");
		КоэффициентыРаспределенияСуммаНУ = ТаблицаКапВложений.ВыгрузитьКолонку("СуммаНУ");
		КоэффициентыРаспределенияСуммаНеУчитываетсяНУ = ТаблицаКапВложений.ВыгрузитьКолонку("СуммаНеУчитываетсяНУ");
		КоэффициентыРаспределенияСуммаЕНВД = ТаблицаКапВложений.ВыгрузитьКолонку("СуммаЕНВД");
	КонецЕсли;
	
	РаспределенныеСуммы = Новый Массив(РаспределяемыеКолонки.Количество());
	
	Для каждого СтрокаМодернизации Из ДополнительныеСвойства.ТаблицаМодернизацияОсновныхСредств Цикл
		
		Для ИндексКолонки = 0 По РаспределяемыеКолонки.ВГраница() Цикл
			
			Если РаспределяемыеКолонки[ИндексКолонки] = "СуммаМодернизацииНУ" Тогда
				РаспределенныеСуммы[ИндексКолонки] = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаМодернизации["СуммаМодернизацииНУ"], КоэффициентыРаспределенияСуммаНУ);
			ИначеЕсли РаспределяемыеКолонки[ИндексКолонки] = "СуммаМодернизацииНеУчитываетсяНУ" Тогда
				РаспределенныеСуммы[ИндексКолонки] = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаМодернизации["СуммаМодернизацииНеУчитываетсяНУ"], КоэффициентыРаспределенияСуммаНеУчитываетсяНУ);
			ИначеЕсли РаспределяемыеКолонки[ИндексКолонки] = "СуммаМодернизацииЕНВД" Тогда
				РаспределенныеСуммы[ИндексКолонки] = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаМодернизации["СуммаМодернизацииЕНВД"], КоэффициентыРаспределенияСуммаЕНВД);
			Иначе
				РаспределенныеСуммы[ИндексКолонки] = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
					СтрокаМодернизации[РаспределяемыеКолонки[ИндексКолонки]], КоэффициентыРаспределения);
			КонецЕсли;
		
		КонецЦикла;
		
		Для ИндексСтрокиВложений = 0 По КоличествоСтрокВложений - 1 Цикл
		
			НоваяСтрока = ТаблицаМодернизацииПоКПС.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМодернизации);
			НоваяСтрока.КПСВложений		= ТаблицаКапВложений[ИндексСтрокиВложений].КПС;
			НоваяСтрока.ЦМОВложений		= ТаблицаКапВложений[ИндексСтрокиВложений].ЦМО;
			НоваяСтрока.ДоговорВложений	= ТаблицаКапВложений[ИндексСтрокиВложений].Договор;
			
			Для ИндексКолонки = 0 По РаспределяемыеКолонки.ВГраница() Цикл
			
				Если РаспределенныеСуммы[ИндексКолонки] = Неопределено Тогда
					НоваяСтрока[РаспределяемыеКолонки[ИндексКолонки]] = 0;
				Иначе
					НоваяСтрока[РаспределяемыеКолонки[ИндексКолонки]] = РаспределенныеСуммы[ИндексКолонки][ИндексСтрокиВложений];
				КонецЕсли;
			
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЦикла;

//	Если ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.РешениеОПризнанииОбъектовОС")
//		ИЛИ ТипЗнч(Реквизиты.Ссылка) = Тип("ДокументСсылка.РешениеОПризнанииОбъектовОСИК") Тогда
//		Возврат ТаблицаМодернизацииПоКПС;
//	КонецЕсли;	
		
	// Корректировка копеек.
	
	// Добавим колонки для распределения сумм.
	ТаблицаКапВложений.Колонки.Добавить("СуммаМодернизации", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаКапВложений.Колонки.Добавить("СуммаДемонтажа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТаблицаКапВложений.Колонки.Добавить("СуммаТранспортировки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
//	КоэффициентыРаспределения = Новый Массив;
//	КоэффициентыРаспределения.Добавить(РеквизитыДокумента["СуммаДокумента"] - РеквизитыДокумента["СуммаДемонтажа"] - РеквизитыДокумента["СуммаТранспортировки"]);
//	КоэффициентыРаспределения.Добавить(РеквизитыДокумента["СуммаДемонтажа"]);
//	КоэффициентыРаспределения.Добавить(РеквизитыДокумента["СуммаТранспортировки"]);

	КоэффициентыРаспределения = Новый Массив;
	КоэффициентыРаспределения.Добавить(ДополнительныеСвойства.ТаблицаМодернизацияОсновныхСредств.Итог("СуммаМодернизации"));
	КоэффициентыРаспределения.Добавить(ДополнительныеСвойства.ТаблицаМодернизацияОсновныхСредств.Итог("СуммаДемонтажа"));
	КоэффициентыРаспределения.Добавить(ДополнительныеСвойства.ТаблицаМодернизацияОсновныхСредств.Итог("СуммаТранспортировки"));
	
	Для Каждого СтрокаКапВложений Из ТаблицаКапВложений Цикл
		
		РезультатРаспределения = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СтрокаКапВложений.Сумма, КоэффициентыРаспределения);
		
		Если РезультатРаспределения <> Неопределено Тогда
			СтрокаКапВложений.СуммаМодернизации = РезультатРаспределения[0];
			СтрокаКапВложений.СуммаДемонтажа = РезультатРаспределения[1];
			СтрокаКапВложений.СуммаТранспортировки = РезультатРаспределения[2];
		КонецЕсли;
		
	КонецЦикла;
	
	КопияТаблицы = ТаблицаМодернизацииПоКПС.Скопировать(,
		"ЦМОВложений, КПСВложений, СуммаМодернизации, СуммаДемонтажа, СуммаТранспортировки");
	КопияТаблицы.Свернуть("ЦМОВложений, КПСВложений", "СуммаМодернизации, СуммаДемонтажа, СуммаТранспортировки");
	
	ИтогиПоКПС = Новый Соответствие;
	Для каждого СтрокаИтогов Из КопияТаблицы Цикл
		СтруктураИтогов = Новый Структура("СуммаМодернизации, СуммаДемонтажа, СуммаТранспортировки");
		ЗаполнитьЗначенияСвойств(СтруктураИтогов, СтрокаИтогов);
		ИтогиПоКПС.Вставить(ПолучитьСтрокуИдентификаторов(СтрокаИтогов.ЦМОВложений, СтрокаИтогов.КПСВложений), СтруктураИтогов);
	КонецЦикла;
	
	КорректировкиПоКПС = Новый Соответствие;
	Для каждого СтрокаКапВложений Из ТаблицаКапВложений Цикл
		
		ТекущийИтогПоКПС = ИтогиПоКПС.Получить(ПолучитьСтрокуИдентификаторов(СтрокаКапВложений.ЦМО, СтрокаКапВложений.КПС));
		Если ТекущийИтогПоКПС = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтруктураКорректировок = Новый Структура;
		СтруктураКорректировок.Вставить("СуммаМодернизации", 
			СтрокаКапВложений.СуммаМодернизации - ТекущийИтогПоКПС.СуммаМодернизации);
		СтруктураКорректировок.Вставить("СуммаДемонтажа", 
			СтрокаКапВложений.СуммаДемонтажа - ТекущийИтогПоКПС.СуммаДемонтажа);
		СтруктураКорректировок.Вставить("СуммаТранспортировки", 
			СтрокаКапВложений.СуммаТранспортировки - ТекущийИтогПоКПС.СуммаТранспортировки);
		
		КорректировкиПоКПС.Вставить(ПолучитьСтрокуИдентификаторов(
			СтрокаКапВложений.ЦМО, СтрокаКапВложений.КПС), СтруктураКорректировок);
		
	КонецЦикла;
	
	КоличествоСтрокРезультата = ТаблицаМодернизацииПоКПС.Количество();
	Если КоличествоСтрокРезультата = ТаблицаКапВложений.Количество() И КоличествоСтрокРезультата > 0 Тогда
		Для Индекс = 1 По ТаблицаКапВложений.Количество() Цикл
			
			КорректируемаяСтрока = ТаблицаМодернизацииПоКПС[КоличествоСтрокРезультата - Индекс];
			ЗначенияКорректировок = КорректировкиПоКПС.Получить(ПолучитьСтрокуИдентификаторов(
				КорректируемаяСтрока.ЦМОВложений, КорректируемаяСтрока.КПСВложений));
			Если ЗначенияКорректировок = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			КорректируемаяСтрока.СуммаМодернизации = КорректируемаяСтрока.СуммаМодернизации + ЗначенияКорректировок.СуммаМодернизации;
			КорректируемаяСтрока.СуммаДемонтажа = КорректируемаяСтрока.СуммаДемонтажа + ЗначенияКорректировок.СуммаДемонтажа;
			КорректируемаяСтрока.СуммаТранспортировки = КорректируемаяСтрока.СуммаТранспортировки + ЗначенияКорректировок.СуммаТранспортировки;
		
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаМодернизацииПоКПС;
	
КонецФункции

Функция ВводОстатковОсновныхСредств(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаВводОстатков = УправлениеОсновнымиСредствами.ПустаяТаблицаВводОстатковОсновныхСредств();
	Для Каждого Колонка Из ТаблицаВводОстатков.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	// Подготовим таблицу для отражения ввода остатков основных средств,
	ТаблицаВводОстатков = УправлениеОсновнымиСредствами.ТаблицаВводОстатковОсновныхСредств(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаВводОстатковОсновныхСредств",
		ТаблицаВводОстатков.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаВводОстатков;
	
КонецФункции

Функция ПереносВложенийВНФА(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.ПереносВложенийВНФА.ТаблицаОстатки();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносВложенийВНФА.ТаблицаОстатки(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПеремещениеМеждуСчетамиНФА(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда		
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда		
		Таблица = УправлениеОсновнымиСредствами.ВнутреннееПеремещениеМеждуСчетамиНФА();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат УправлениеОсновнымиСредствами.ВнутреннееПеремещениеМеждуСчетамиНФА(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ИзменениеСтоимостиОС(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.ИзменениеСтоимостиОС.ТаблицаОС();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ИзменениеСтоимостиОС.ТаблицаОС(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция РешениеОбОценкеИмущества(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.РешениеОбОценкеИмущества.ТаблицаОС();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.РешениеОбОценкеИмущества.ТаблицаОС(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция МатериальныеЦенностиСДрагМатериалами(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
		
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаМЦСДрагМатериалами = УчетДрагМатериалов.ПустаяТаблицаМЦСДрагМатериалами();
	Для Каждого Колонка Из ТаблицаМЦСДрагМатериалами.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;                
	// Подготовим таблицу для отражения реализации материальных ценностей,
	ТаблицаМЦСДрагМатериалами = УчетДрагМатериалов.ПодготовитьТаблицуМЦСДрагМатериаламиПоДокументу(
		Реквизиты.Ссылка, Параметры);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаМЦСДрагМатериалами", ТаблицаМЦСДрагМатериалами.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаМЦСДрагМатериалами;
	
КонецФункции

Функция СписаниеКапВложенийНУ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаСписаниеКапВложенийНУ = НалоговыйУчет.ПустаяТаблицаСписаниеКапВложенийНУ();
	Для Каждого Колонка Из ТаблицаСписаниеКапВложенийНУ.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;                
	
	Реквизиты.Вставить("ПериодОстатков", НалоговыйУчет.ПериодПолученияОстатков(ДокументОбъект));
	
	ТаблицаДокумента = НалоговыйУчет.ПодготовитьТаблицуСписаниеКапВложенийНУПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	// Подготовим таблицу для отражения реализации основных средств,
	ТаблицаСписаниеКапВложенийНУ = НалоговыйУчет.ТаблицаСписаниеКапВложенийНУ(ТаблицаДокумента, Реквизиты);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаСписаниеКапВложенийНУ", ТаблицаСписаниеКапВложенийНУ.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаСписаниеКапВложенийНУ;
	
КонецФункции

Функция ПолучитьСтрокуИдентификаторов(СсылкаЦМО, СсылкаКПС)
	Результат = ""; 
	
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(СсылкаЦМО);
	МассивСсылок.Добавить(СсылкаКПС);
	
	Для каждого ТекСсылка из МассивСсылок Цикл
		Если НЕ ЗначениеЗаполнено(ТекСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = Результат + ТекСсылка.УникальныйИдентификатор();
	КонецЦикла;		
	
	Возврат Результат;	
КонецФункции	

Функция ОстаткиСтоимостиГрупповогоОбъекта(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		ТипСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
		
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Счет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"КПС", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИФО", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредствоНовое", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомерНовый", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Субконто2", ТипСубконто);
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Субконто3", ТипСубконто);
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Количество", Новый ОписаниеТипов("Число"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Сумма", Новый ОписаниеТипов("Число"));

		Возврат ПоляФункции;
	КонецЕсли;	
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		Возврат ПараметрыФункции;
	КонецЕсли;	

	ДокументОбъект = ИсточникиДанных["ДокументОбъект"];
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ПОДСТРОКА(ЕПСБУ.Код, 1, 3) В (""101"", ""102"", ""103"", ""108"")
	|	И НЕ ЕПСБУ.Забалансовый
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧИнвентарныеНомера.ИнвентарныйНомерВГруппе КАК ИнвентарныйНомерВГруппе,
	|	ТЧИнвентарныеНомера.ОсновноеСредство КАК ОсновноеСредствоНовое,
	|	ТЧИнвентарныеНомера.ИнвентарныйНомер КАК ИнвентарныйНомерНовый
	|ПОМЕСТИТЬ ТЧ_ИнвентарныеНомера
	|ИЗ
	|	&ТЧИнвентарныеНомера КАК ТЧИнвентарныеНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОстатки.Субконто2 ССЫЛКА Справочник.ЦМО
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Справочник.ЦМО)
	|		КОГДА ЖурналПроводокЕПСБУОстатки.Субконто3 ССЫЛКА Справочник.ЦМО
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто3 КАК Справочник.ЦМО)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|	КОНЕЦ КАК ЦМО,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ ОстаткиБУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаПроведения,
	|			Счет В
	|				(ВЫБРАТЬ
	|					Таб.Ссылка
	|				ИЗ
	|					Счета КАК Таб),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &ОС) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомерВГруппе,
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК ОсновноеСредствоНовое,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомерНовый,
	|	СУММА(СтоимостьОбъектовОСОстатки.КоличествоОстаток) КАК Количество,
	|	СУММА(СтоимостьОбъектовОСОстатки.СтоимостьОстаток) КАК Сумма
	|ПОМЕСТИТЬ ОстаткиРН
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&ДатаПроведения,
	|			Организация = &Организация
	|				И ОсновноеСредство = &ОС
	|				И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧ_ИнвентарныеНомера КАК ТЧ_ИнвентарныеНомера
	|		ПО СтоимостьОбъектовОСОстатки.ИнвентарныйНомер = ТЧ_ИнвентарныеНомера.ИнвентарныйНомерВГруппе
	|
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ЦМО,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиБУ.Счет КАК Счет,
	|	ОстаткиБУ.КПС КАК КПС,
	|	ОстаткиБУ.ИФО КАК ИФО,
	|	ОстаткиБУ.Подразделение КАК Подразделение,
	|	ОстаткиБУ.КФО КАК КФО,
	|	ОстаткиБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ОстаткиРН.ИнвентарныйНомерВГруппе, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ОстаткиРН.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК ОсновноеСредствоНовое,
	|	ЕСТЬNULL(ОстаткиРН.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК ИнвентарныйНомерНовый,
	|	ОстаткиБУ.Субконто2 КАК Субконто2,
	|	ОстаткиБУ.Субконто3 КАК Субконто3,
	|	ОстаткиРН.Количество КАК Количество,
	|	ОстаткиРН.Сумма КАК Сумма
	|ИЗ
	|	ОстаткиБУ КАК ОстаткиБУ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОстаткиРН КАК ОстаткиРН
	|		ПО ОстаткиБУ.ОсновноеСредство = ОстаткиРН.ОсновноеСредство
	|			И ОстаткиБУ.ЦМО = ОстаткиРН.ЦМО";	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаПроведения", ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ОС", ДокументОбъект.ОсновноеСредствоГрупповое);
	Запрос.УстановитьПараметр("ТЧИнвентарныеНомера", ДокументОбъект["ИнвентарныеНомера"].Выгрузить());
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ОстаткиАмортизацииГрупповогоОбъекта(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		ТипСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
		
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Счет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ЭтоАмортизация", Новый ОписаниеТипов("Булево"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"КПС", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИФО", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредствоНовое", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомерНовый", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Субконто2", ТипСубконто);
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Субконто3", ТипСубконто);
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"СуммаАмортизации", Новый ОписаниеТипов("Число"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"СуммаОбесценения", Новый ОписаниеТипов("Число"));

		Возврат ПоляФункции;
	КонецЕсли;	
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		Возврат ПараметрыФункции;
	КонецЕсли;	

	ДокументОбъект = ИсточникиДанных["ДокументОбъект"];
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ПОДСТРОКА(ЕПСБУ.Код, 1, 3) В (""104"", ""114"")
	|	И НЕ ЕПСБУ.Забалансовый
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧИнвентарныеНомера.ИнвентарныйНомерВГруппе КАК ИнвентарныйНомерВГруппе,
	|	ТЧИнвентарныеНомера.ОсновноеСредство КАК ОсновноеСредствоНовое,
	|	ТЧИнвентарныеНомера.ИнвентарныйНомер КАК ИнвентарныйНомерНовый
	|ПОМЕСТИТЬ ТЧ_ИнвентарныеНомера
	|ИЗ
	|	&ТЧИнвентарныеНомера КАК ТЧИнвентарныеНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ЖурналПроводокЕПСБУОстатки.Счет.Код, 1, 3) = ""104""
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоАмортизация,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2 КАК Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3 КАК Субконто3
	|ПОМЕСТИТЬ ОстаткиБУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ДатаПроведения, Счет В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета КАК Таб),, Организация = &Организация
	|	И Субконто1 = &ОС) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АмортизацияОбъектовОС.ОсновноеСредство КАК ОсновноеСредство,
	|	АмортизацияОбъектовОС.ИнвентарныйНомер КАК ИнвентарныйНомерВГруппе,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК
	|		ОсновноеСредствоНовое,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК
	|		ИнвентарныйНомерНовый,
	|	СУММА(АмортизацияОбъектовОС.СуммаАмортизацииОстаток) КАК СуммаАмортизации,
	|	СУММА(АмортизацияОбъектовОС.СуммаОбесцененияОстаток) КАК СуммаОбесценения
	|ПОМЕСТИТЬ ОстаткиРН
	|ИЗ
	|	РегистрНакопления.АмортизацияОбъектовОС.Остатки(&ДатаПроведения, Организация = &Организация
	|	И ОсновноеСредство = &ОС) КАК АмортизацияОбъектовОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЧ_ИнвентарныеНомера КАК ТЧ_ИнвентарныеНомера
	|		ПО АмортизацияОбъектовОС.ИнвентарныйНомер = ТЧ_ИнвентарныеНомера.ИнвентарныйНомерВГруппе
	|СГРУППИРОВАТЬ ПО
	|	АмортизацияОбъектовОС.ОсновноеСредство,
	|	АмортизацияОбъектовОС.ИнвентарныйНомер,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)),
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиБУ.Счет КАК Счет,
	|	ОстаткиБУ.ЭтоАмортизация КАК ЭтоАмортизация,
	|	ОстаткиБУ.КПС КАК КПС,
	|	ОстаткиБУ.ИФО КАК ИФО,
	|	ОстаткиБУ.Подразделение КАК Подразделение,
	|	ОстаткиБУ.КФО КАК КФО,
	|	ОстаткиБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ОстаткиРН.ИнвентарныйНомерВГруппе, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК
	|		ИнвентарныйНомер,
	|	ЕСТЬNULL(ОстаткиРН.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК
	|		ОсновноеСредствоНовое,
	|	ЕСТЬNULL(ОстаткиРН.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК
	|		ИнвентарныйНомерНовый,
	|	ОстаткиБУ.Субконто2 КАК Субконто2,
	|	ОстаткиБУ.Субконто3 КАК Субконто3,
	|	ОстаткиРН.СуммаАмортизации КАК СуммаАмортизации,
	|	ОстаткиРН.СуммаОбесценения КАК СуммаОбесценения
	|ИЗ
	|	ОстаткиБУ КАК ОстаткиБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиРН КАК ОстаткиРН
	|		ПО ОстаткиБУ.ОсновноеСредство = ОстаткиРН.ОсновноеСредство";	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаПроведения", ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ОС", ДокументОбъект.ОсновноеСредствоГрупповое);
	Запрос.УстановитьПараметр("ТЧИнвентарныеНомера", ДокументОбъект["ИнвентарныеНомера"].Выгрузить());
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ОстаткиСтоимостиГрупповогоОбъектаНУ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		ТипСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
		
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Счет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИФО", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредствоНовое", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомерНовый", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Сумма", Новый ОписаниеТипов("Число"));

		Возврат ПоляФункции;
	КонецЕсли;	
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		Возврат ПараметрыФункции;
	КонецЕсли;	

	ДокументОбъект = ИсточникиДанных["ДокументОбъект"];
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ПОДСТРОКА(ЕПСБУ.Код, 1, 3) В (""Н01"", ""Н04"")
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧИнвентарныеНомера.ИнвентарныйНомерВГруппе КАК ИнвентарныйНомерВГруппе,
	|	ТЧИнвентарныеНомера.ОсновноеСредство КАК ОсновноеСредствоНовое,
	|	ТЧИнвентарныеНомера.ИнвентарныйНомер КАК ИнвентарныйНомерНовый
	|ПОМЕСТИТЬ ТЧ_ИнвентарныеНомера
	|ИЗ
	|	&ТЧИнвентарныеНомера КАК ТЧИнвентарныеНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	СУММА(ЖурналПроводокЕПСБУОстатки.СуммаОстаток) КАК Сумма
	|ПОМЕСТИТЬ ОстаткиБУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ДатаПроведения, Счет В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета КАК Таб),, Организация = &Организация
	|	И Субконто1 = &ОС) КАК ЖурналПроводокЕПСБУОстатки
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.ИФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(СтоимостьОбъектовОСОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ КоличествоОбъектовПоРН
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(&ДатаПроведения, Организация = &Организация
	|	И ОсновноеСредство = &ОС
	|	И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиБУ.Счет КАК Счет,
	|	ОстаткиБУ.ИФО КАК ИФО,
	|	ОстаткиБУ.Подразделение КАК Подразделение,
	|	ОстаткиБУ.КФО КАК КФО,
	|	ОстаткиБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерВГруппе, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК
	|		ИнвентарныйНомер,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК
	|		ОсновноеСредствоНовое,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК
	|		ИнвентарныйНомерНовый,
	|	ВЫБОР
	|		КОГДА КоличествоОбъектовПоРН.Количество = 0
	|			ТОГДА ОстаткиБУ.Сумма
	|		ИНАЧЕ ОстаткиБУ.Сумма / КоличествоОбъектовПоРН.Количество
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ОстаткиБУ КАК ОстаткиБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоОбъектовПоРН КАК КоличествоОбъектовПоРН
	|		ПО ОстаткиБУ.ОсновноеСредство = КоличествоОбъектовПоРН.ОсновноеСредство,
	|	ТЧ_ИнвентарныеНомера КАК ТЧ_ИнвентарныеНомера";	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаПроведения", ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ОС", ДокументОбъект.ОсновноеСредствоГрупповое);
	Запрос.УстановитьПараметр("ТЧИнвентарныеНомера", ДокументОбъект["ИнвентарныеНомера"].Выгрузить());
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

Функция ОстаткиАмортизацииГрупповогоОбъектаНУ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		ТипСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
		
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Счет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИФО", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ОсновноеСредствоНовое", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"ИнвентарныйНомерНовый", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ДобавитьПолеРезультатаФункции(ПоляФункции, 
			"Сумма", Новый ОписаниеТипов("Число"));

		Возврат ПоляФункции;
	КонецЕсли;	
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		Возврат ПараметрыФункции;
	КонецЕсли;	

	ДокументОбъект = ИсточникиДанных["ДокументОбъект"];
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕПСБУ.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Счета
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ПОДСТРОКА(ЕПСБУ.Код, 1, 3) В (""Н02"", ""Н05"")
	|	И НЕ ЕПСБУ.ЭлементГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧИнвентарныеНомера.ИнвентарныйНомерВГруппе КАК ИнвентарныйНомерВГруппе,
	|	ТЧИнвентарныеНомера.ОсновноеСредство КАК ОсновноеСредствоНовое,
	|	ТЧИнвентарныеНомера.ИнвентарныйНомер КАК ИнвентарныйНомерНовый
	|ПОМЕСТИТЬ ТЧ_ИнвентарныеНомера
	|ИЗ
	|	&ТЧИнвентарныеНомера КАК ТЧИнвентарныеНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.ИФО КАК ИФО,
	|	ЖурналПроводокЕПСБУОстатки.Подразделение КАК Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК ОсновноеСредство,
	|	- ЖурналПроводокЕПСБУОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ОстаткиБУ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&ДатаПроведения, Счет В
	|		(ВЫБРАТЬ
	|			Таб.Ссылка
	|		ИЗ
	|			Счета КАК Таб),, Организация = &Организация
	|	И Субконто1 = &ОС) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(СтоимостьОбъектовОСОстатки.КоличествоОстаток) КАК Количество
	|ПОМЕСТИТЬ КоличествоОбъектовПоРН
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(&ДатаПроведения, Организация = &Организация
	|	И ОсновноеСредство = &ОС
	|	И ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)) КАК СтоимостьОбъектовОСОстатки
	|СГРУППИРОВАТЬ ПО
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиБУ.Счет КАК Счет,
	|	ОстаткиБУ.ИФО КАК ИФО,
	|	ОстаткиБУ.Подразделение КАК Подразделение,
	|	ОстаткиБУ.КФО КАК КФО,
	|	ОстаткиБУ.ОсновноеСредство КАК ОсновноеСредство,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерВГруппе, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК
	|		ИнвентарныйНомер,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ОсновноеСредствоНовое, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК
	|		ОсновноеСредствоНовое,
	|	ЕСТЬNULL(ТЧ_ИнвентарныеНомера.ИнвентарныйНомерНовый, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) КАК
	|		ИнвентарныйНомерНовый,
	|	ВЫБОР
	|		КОГДА КоличествоОбъектовПоРН.Количество = 0
	|			ТОГДА ОстаткиБУ.Сумма
	|		ИНАЧЕ ОстаткиБУ.Сумма / КоличествоОбъектовПоРН.Количество
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ОстаткиБУ КАК ОстаткиБУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоОбъектовПоРН КАК КоличествоОбъектовПоРН
	|		ПО ОстаткиБУ.ОсновноеСредство = КоличествоОбъектовПоРН.ОсновноеСредство,
	|	ТЧ_ИнвентарныеНомера КАК ТЧ_ИнвентарныеНомера";	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаПроведения", ДокументОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("ОС", ДокументОбъект.ОсновноеСредствоГрупповое);
	Запрос.УстановитьПараметр("ТЧИнвентарныеНомера", ДокументОбъект["ИнвентарныеНомера"].Выгрузить());
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции	

#КонецОбласти

#Область УчетОсновныхСредств_ИмуществаКазны

Функция РеализацияОсновныхСредствИмуществаКазны(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКДоходов",    Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРеализации = УправлениеОсновнымиСредствами.ПустаяТаблицаРеализацияОсновныхСредств();
	Для Каждого Колонка Из ТаблицаРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УправлениеОсновнымиСредствами.ПодготовитьТаблицуРеализацияОсновныхСредствПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения реализации основных средств,
	ТаблицаРеализации = УправлениеОсновнымиСредствами.ТаблицаРеализацияОсновныхСредств(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаРеализацияОсновныхСредств",
		ТаблицаРеализации.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРеализации;
	
КонецФункции

Функция РешениеОбОценкеИмуществаКазны(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.РешениеОбОценкеИмуществаКазны.ТаблицаОС();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.РешениеОбОценкеИмуществаКазны.ТаблицаОС(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция РешениеОПризнанииОбъектовОСИКПоКПС(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка"						, Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(80)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки"					, Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,0, ДопустимыйЗнак.Неотрицательный)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ОбъектВложений"					, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КПСВложений"					, Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетВложений"					, Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ЦМОВложений"					, Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ДоговорВложений"				, Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КоличествоВложений"				, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0)));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаВложений"					, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	// Добавляем все колонки таб.части "ОсновныеСредства".
	Для Каждого КолонкаДокумента Из Метаданные.Документы.РешениеОПризнанииОбъектовОСИК.ТабличныеЧасти.ОсновныеСредства.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, КолонкаДокумента.Имя, КолонкаДокумента.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	ТаблицаКапВложений = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "КапитальныеВложения", Истина);
	КоэффициентыРаспределенияСуммы = ТаблицаКапВложений.ВыгрузитьКолонку("Сумма");
	КоэффициентыРаспределенияКоличества = ТаблицаКапВложений.ВыгрузитьКолонку("Количество");
	КоличествоСтрокВложений = ТаблицаКапВложений.Количество();
	
	Если ТаблицаКапВложений.Колонки.Найти("Договор") = Неопределено Тогда
		ТаблицаКапВложений.Колонки.Добавить("Договор");
	КонецЕсли;
	
	ТаблицаОС = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "ОсновныеСредства", Истина);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	Для Каждого ПолеРезультата Из ПоляФункции Цикл
		ТаблицаРезультат.Колонки.Добавить(ПолеРезультата.Имя, ПолеРезультата.Тип);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицыОС Из ТаблицаОС Цикл
		
		РаспределенныеСуммы = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СтрокаТаблицыОС["Сумма"], КоэффициентыРаспределенияСуммы, 2);
		РаспределенноеКоличество = ОбщегоНазначенияБГУКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СтрокаТаблицыОС["Количество"], КоэффициентыРаспределенияКоличества, 0);
		
		Для ИндексСтрокиВложений = 0 По КоличествоСтрокВложений - 1 Цикл
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыОС);
			НоваяСтрока.КПСВложений		= ТаблицаКапВложений[ИндексСтрокиВложений].КПС;
			НоваяСтрока.ЦМОВложений		= ТаблицаКапВложений[ИндексСтрокиВложений].ЦМО;
			НоваяСтрока.ДоговорВложений	= ТаблицаКапВложений[ИндексСтрокиВложений].Договор;
			
			Если ИндексСтрокиВложений > 0 Тогда
				НоваяСтрока.Количество = 0;
			КонецЕсли;
			
			НоваяСтрока["СуммаВложений"] = ?(РаспределенныеСуммы = Неопределено, 0, РаспределенныеСуммы[ИндексСтрокиВложений]);
			НоваяСтрока["КоличествоВложений"] = ?(РаспределенноеКоличество = Неопределено, 0, РаспределенноеКоличество[ИндексСтрокиВложений]);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область ГТДИмпорт

Функция ТаможенныеПлатежиПоМатериальнымЗапасам(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетВложений",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидЗатрат",     Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаТаможенныеПлатежи = УчетРасчетов.ПустаяТаблицаТаможенныеПлатежиПоМатериальнымЗапасам();
	Для Каждого Колонка Из ТаблицаТаможенныеПлатежи.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаТаможенныеПлатежи = УчетРасчетов.ПодготовитьТаблицуТаможенныеПлатежиПоМатериальнымЗапасамПоДокументу(
		Реквизиты.Ссылка, Параметры, Отказ);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу таможенных платежей, связанных с приобретением материальных запасов.
		ТаблицаТаможенныеПлатежи = УчетРасчетов.ПодготовитьТаблицуТаможенныхПлатежей(
			ТаблицаТаможенныеПлатежи, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаможенныеПлатежиПоМатериальнымЗапасам",
		ТаблицаТаможенныеПлатежи.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаТаможенныеПлатежи;
	
КонецФункции

Функция ТаможенныеПлатежиПоВнеоборотнымАктивам(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетВложений",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидЗатрат",     Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаТаможенныеПлатежи = УчетРасчетов.ПустаяТаблицаТаможенныеПлатежиПоВнеоборотнымАктивам();
	Для Каждого Колонка Из ТаблицаТаможенныеПлатежи.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаТаможенныеПлатежи = УчетРасчетов.ПодготовитьТаблицуТаможенныеПлатежиПоВнеоборотнымАктивамПоДокументу(
		Реквизиты.Ссылка, Параметры, Отказ);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу таможенных платежей, связанных с приобретением внеоборотных активов.
		ТаблицаТаможенныеПлатежи = УчетРасчетов.ПодготовитьТаблицуТаможенныхПлатежей(
			ТаблицаТаможенныеПлатежи, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаможенныеПлатежиПоВнеоборотнымАктивам",
		ТаблицаТаможенныеПлатежи.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаТаможенныеПлатежи;
	
КонецФункции

Функция ТаможенныеШтрафы(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ИФО",           Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",           Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаТаможенныеШтрафы = УчетРасчетов.ПустаяТаблицаТаможенныеШтрафы();
	Для Каждого Колонка Из ТаблицаТаможенныеШтрафы.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаТаможенныеШтрафы = УчетРасчетов.ПодготовитьТаблицуТаможенныеШтрафыПоДокументу(
		Реквизиты.Ссылка, Параметры, Отказ);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения таможенных штрафов, включаемых в расходы организации.
		ТаблицаТаможенныеШтрафы = УчетРасчетов.ПодготовитьТаблицуТаможенныхПлатежей(
			ТаблицаТаможенныеШтрафы, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаможенныеШтрафы", ТаблицаТаможенныеШтрафы.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаТаможенныеШтрафы;
	
КонецФункции

#КонецОбласти

#Область УчетРодительскойПлаты

Функция СводноеНачислениеКомпенсации(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	ОписаниеТиповСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",             Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",             Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетДебета",      Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КЭКДебета",       Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СубконтоДебета1", ОписаниеТиповСубконто);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СубконтоДебета2", ОписаниеТиповСубконто);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СубконтоДебета3", ОписаниеТиповСубконто);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Обязательство",   Новый ОписаниеТипов("СправочникСсылка.Договоры"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	СвернутаяТаблица = Новый ТаблицаЗначений;
	СвернутаяТаблица.Колонки.Добавить("КФО",                   Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	СвернутаяТаблица.Колонки.Добавить("Сумма",                 ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18,2));
	СвернутаяТаблица.Колонки.Добавить("ИФО",                   Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	СвернутаяТаблица.Колонки.Добавить("СчетДебета",            Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	СвернутаяТаблица.Колонки.Добавить("КПСДебета",             Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	СвернутаяТаблица.Колонки.Добавить("КЭКДебета",             Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	СвернутаяТаблица.Колонки.Добавить("СубконтоДебета1",       ОписаниеТиповСубконто);
	СвернутаяТаблица.Колонки.Добавить("СубконтоДебета2",       ОписаниеТиповСубконто);
	СвернутаяТаблица.Колонки.Добавить("СубконтоДебета3",       ОписаниеТиповСубконто);
	СвернутаяТаблица.Колонки.Добавить("ПодразделениеДебета",   Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	СвернутаяТаблица.Колонки.Добавить("СчетРасчетов",          Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	СвернутаяТаблица.Колонки.Добавить("КПСРасчетов",           Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	СвернутаяТаблица.Колонки.Добавить("КЭКРасчетов",           Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	СвернутаяТаблица.Колонки.Добавить("СубконтоРасчетов1",     ОписаниеТиповСубконто);
	СвернутаяТаблица.Колонки.Добавить("СубконтоРасчетов2",     ОписаниеТиповСубконто);
	СвернутаяТаблица.Колонки.Добавить("СубконтоРасчетов3",     ОписаниеТиповСубконто);
	СвернутаяТаблица.Колонки.Добавить("ПодразделениеРасчетов", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	СвертываемыеКолонки = Новый Массив;
	ПоляФункции = Новый Массив;
	Для Каждого Колонка Из СвернутаяТаблица.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		Если Колонка.Имя <> "Сумма" Тогда
			СвертываемыеКолонки.Добавить(Колонка.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыОбъекта = ИсточникиДанных.Документ[0];
	СчетРасчетов     = БухгалтерскиеОперации.СчетПоКЭК(Параметры.КЭКДебета, "302.00");
	Контрагент       = БухгалтерскиеОперации.ПолучитьКонтрагентаДляУчетаКомпенсацииРодительскойПлаты();
	Договор          = Параметры.Обязательство;
	
	ДанныеПроводки = БухгалтерскийУчетКлиентСервер.ПараметрыРасчетаКЭКПроводки();
	ДанныеПроводки.Организация = РеквизитыОбъекта.Документ_Организация;
	ДанныеПроводки.ИФО         = РеквизитыОбъекта.Документ_ИФО;
	ДанныеПроводки.Дата        = РеквизитыОбъекта.Документ_Дата;
	ДанныеПроводки.Счет        = СчетРасчетов;
	ДанныеПроводки.Субконто1   = Контрагент;
	ДанныеПроводки.Субконто2   = Договор;
	ДанныеПроводки.Субконто3   = Неопределено;
	ДанныеПроводки.ДтКт        = "Кт";
	
	Для Каждого СтрокаТаблицы Из ИсточникиДанных.Начисления Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Начисления_КПС) Тогда
			КПС = СтрокаТаблицы.Начисления_КПС;
		Иначе
			КПС = Параметры.КПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицы.Начисления_КФО) Тогда
			КФО = СтрокаТаблицы.Начисления_КФО;
		Иначе
			КФО = Параметры.КФО;
		КонецЕсли;
		ДанныеПроводки.КФО = КФО;
		КЭКРасчетов = БухгалтерскийУчет.КЭКПроводки(ДанныеПроводки);
		
		НоваяСтрока = СвернутаяТаблица.Добавить();
		НоваяСтрока.КФО                     = КФО;
		НоваяСтрока.Сумма                   = СтрокаТаблицы.Начисления_СуммаКомпенсации;
		НоваяСтрока.ИФО                     = РеквизитыОбъекта.Документ_ИФО;
		НоваяСтрока.СчетДебета              = Параметры.СчетДебета;
		НоваяСтрока.КПСДебета               = КПС;
		НоваяСтрока.КЭКДебета               = Параметры.КЭКДебета;
		НоваяСтрока.СубконтоДебета1         = Параметры.СубконтоДебета1;
		НоваяСтрока.СубконтоДебета2         = Параметры.СубконтоДебета2;
		НоваяСтрока.СубконтоДебета3         = Параметры.СубконтоДебета3;
		НоваяСтрока.ПодразделениеДебета     = РеквизитыОбъекта.Документ_Подразделение;
		НоваяСтрока.СчетРасчетов            = СчетРасчетов;
		НоваяСтрока.КПСРасчетов             = КПС;
		НоваяСтрока.КЭКРасчетов             = КЭКРасчетов;
		НоваяСтрока.СубконтоРасчетов1       = Контрагент;
		НоваяСтрока.СубконтоРасчетов2       = Договор;
		НоваяСтрока.СубконтоРасчетов3       = Неопределено;
		НоваяСтрока.ПодразделениеРасчетов   = РеквизитыОбъекта.Документ_Подразделение;
		
	КонецЦикла;
	
	СвернутаяТаблица.Свернуть(СтрСоединить(СвертываемыеКолонки, ","), "Сумма");
	
	Возврат СвернутаяТаблица;
	
КонецФункции

#КонецОбласти

#Область Обязательства

// Принимаемые и принятые обязательства (бюджет)
//
Функция ОбязательстваБюджет(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОбязательства = РаботаСОбязательствами.ПустаяТаблицаПринятыеОбязательства();
	Для Каждого Колонка Из ТаблицаОбязательства.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента 			= РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации 	= РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Договор",     	  РеквизитыДокумента.Договор);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
			
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	// Подготовим таблицу денежных обязательств.
	ТаблицаОбязательства = РаботаСОбязательствами.ТаблицаПринятыеОбязательства("РасшифровкаОбязательстваБюджет", Реквизиты);
		
	Возврат ТаблицаОбязательства;
	
КонецФункции

// Принимаемые и принятые обязательства (бюджет)
//
Функция ОбязательстваВнеБюджет(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОбязательства = РаботаСОбязательствами.ПустаяТаблицаПринятыеОбязательства();
	Для Каждого Колонка Из ТаблицаОбязательства.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента 			= РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации 	= РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Договор",     	  РеквизитыДокумента.Договор);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
			
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	// Подготовим таблицу денежных обязательств.
	ТаблицаОбязательства = РаботаСОбязательствами.ТаблицаПринятыеОбязательства("РасшифровкаОбязательстваВнебюджет", Реквизиты);
		
	Возврат ТаблицаОбязательства;
	
КонецФункции

// Принятые денежные обязательства при расчетах с поставщиками и подрядчиками.
//
Функция ПринятыеДенежныеОбязательства(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПриниматьДенежныеОбязательства", Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаДенежныеОбязательства = УчетРасчетов.ПустаяТаблицаПринятыеДенежныеОбязательства();
	Для Каждого Колонка Из ТаблицаДенежныеОбязательства.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если НЕ Параметры.Свойство("ПриниматьДенежныеОбязательства")
	 ИЛИ НЕ Параметры.ПриниматьДенежныеОбязательства Тогда
		Возврат ТаблицаДенежныеОбязательства;
	КонецЕсли;
	
	Если ИсточникиДанных.Свойство("ДенежныеОбязательства")
		И ТипЗнч(ИсточникиДанных.ДенежныеОбязательства) = Тип("ТаблицаЗначений")
		И ИсточникиДанных.ДенежныеОбязательства.Количество() > 0 Тогда
		Возврат ТаблицаДенежныеОбязательства;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		УчетРасчетов.ПустаяТаблицаРасчетовСЗачетомАвансов());
	
	ТаблицыПоступления = Новый Структура;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеМатериальныхЗапасов") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаПоступлениеМатериальныхЗапасов);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеУслугРабот") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", ДополнительныеСвойства.ТаблицаПоступлениеУслугРабот);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеДопРасходов") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеДопРасходов", ДополнительныеСвойства.ТаблицаПоступлениеДопРасходов);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеДопРасходов", УчетРасчетов.ПустаяТаблицаПоступлениеДопРасходов());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаВложенияВоВнеоборотныеАктивы") Тогда
		ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы", ДополнительныеСвойства.ТаблицаВложенияВоВнеоборотныеАктивы);
	Иначе
		ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы", УправлениеОсновнымиСредствами.ПустаяТаблицаВложенияВоВнеоборотныеАктивы());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеОсновныхСредств") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", ДополнительныеСвойства.ТаблицаПоступлениеОсновныхСредств);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", УправлениеОсновнымиСредствами.ПустаяТаблицаПоступлениеОсновныхСредств());
	КонецЕсли;
	
	// Подготовим таблицу денежных обязательств.
	ТаблицаДенежныеОбязательства = УчетРасчетов.ТаблицаПринятыеДенежныеОбязательства(
		ТаблицаРасчетовСЗачетомАвансов,
		ТаблицыПоступления,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаДенежныеОбязательства;
	
КонецФункции

// Принятые денежные обязательства при отражение зарплаты в учете.
//
Функция ПринятыеДенежныеОбязательстваПоОплатеТруда(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПриниматьДенежныеОбязательства", Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаДенежныеОбязательства = УчетРасчетов.ПустаяТаблицаПринятыеДенежныеОбязательстваПоОплатеТруда();
	Для Каждого Колонка Из ТаблицаДенежныеОбязательства.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если НЕ Параметры.Свойство("ПриниматьДенежныеОбязательства")
	 ИЛИ НЕ Параметры.ПриниматьДенежныеОбязательства Тогда
		Возврат ТаблицаДенежныеОбязательства;
	КонецЕсли;
	
	// Подготовим таблицу денежных обязательств.
	ТаблицаДенежныеОбязательства = УчетРасчетов.ТаблицаПринятыеДенежныеОбязательстваПоОплатеТруда(
		РеквизитыДокумента.Ссылка,
		Параметры,
		Отказ);
	
	Возврат ТаблицаДенежныеОбязательства;
	
КонецФункции

// Принятые денежные обязательства по процентам, пени, штрафам к уплате.
//
Функция ПринятыеДенежныеОбязательстваПоПроцентамПениШтрафамКУплате(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПриниматьДенежныеОбязательства", Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаДенежныеОбязательства = УчетРасчетов.ПустаяТаблицаПринятыеДенежныеОбязательства();
	Для Каждого Колонка Из ТаблицаДенежныеОбязательства.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если НЕ Параметры.Свойство("ПриниматьДенежныеОбязательства")
	 ИЛИ НЕ Параметры.ПриниматьДенежныеОбязательства Тогда
		Возврат ТаблицаДенежныеОбязательства;
	КонецЕсли;
	
	// Подготовим таблицу денежных обязательств.
	ТаблицаДенежныеОбязательства = УчетРасчетов.ТаблицаПринятыеДенежныеОбязательстваПоПроцентамПениШтрафамКУплате(
		ДокументОбъект,
		Реквизиты);
	
	Возврат ТаблицаДенежныеОбязательства;
	
КонецФункции

// Расчеты с подотчетниками - таблица корректировки денежных обязательств
//
Функция АвансовыйОтчет_ТаблицаКорректировкиДенежныхОбязательств(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ПоляФункции = Новый Массив;
	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Обязательство", 	Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "РазделЛицСчета", 	Новый ОписаниеТипов("СправочникСсылка.РазделыЛицевыхСчетов"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КФО", 				Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КПС", 				Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов")); 
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КЭК", 				Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ДопКлассификация",	Новый ОписаниеТипов("СправочникСсылка.ДополнительнаяБюджетнаяКлассификация"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КодМероприятия",	Новый ОписаниеТипов("СправочникСсылка.Мероприятия"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КодЦели",			Новый ОписаниеТипов("СправочникСсылка.ВидыЦелевыхСредств"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Валюта",			Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Сумма", 			ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаВВалюте", 		ОписаниеТипаСуммы);
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	
	ЗаявлениеНаВыдачуАванса = РеквизитыДокумента.ЗаявлениеНаВыдачуАванса;
	
	Если ЗначениеЗаполнено(ЗаявлениеНаВыдачуАванса) Тогда
		РеквизитыЗаявления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ЗаявлениеНаВыдачуАванса, "ОснованиеПринятияОбязательства, РазделЛицевогоСчета");
		Обязательство = РеквизитыЗаявления.ОснованиеПринятияОбязательства;
		РазделЛицСчета = РеквизитыЗаявления.РазделЛицевогоСчета;
	Иначе
		Обязательство = РеквизитыДокумента.ОснованиеПринятияОбязательства;
		РазделЛицСчета = РеквизитыДокумента.РазделЛицевогоСчета;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Обязательство) Тогда
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("ЗаявлениеНаВыдачуАванса", ЗаявлениеНаВыдачуАванса);
	Реквизиты.Вставить("Обязательство", Обязательство);
	Реквизиты.Вставить("РазделЛицСчета", РазделЛицСчета);
	Реквизиты.Вставить("Дата", РеквизитыДокумента.Дата);
	Реквизиты.Вставить("Организация", РеквизитыДокумента.Организация);
	
	ТаблицаРезультат = РасчетыСПодотчетнымиЛицами.ТаблицаДенежныхОбязательствПоТЧАвансовогоОтчета(Реквизиты);
	
	Если ТаблицаРезультат.Количество() = 0 Тогда
		
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
		
		РасходыПоАвансовомуОтчету = ?(ДополнительныеСвойства.Свойство("РасходыПоАвансовомуОтчету"),
			ДополнительныеСвойства.РасходыПоАвансовомуОтчету,
			РасчетыСПодотчетнымиЛицами.ПустаяТаблицаРасходовПоАвансовомуОтчету());
			
		ТаблицаРезультат = РасчетыСПодотчетнымиЛицами.ТаблицаКорректировкиДенежныхОбязательствПоАвансовомуОтчету(
			Реквизиты, РасходыПоАвансовомуОтчету);
		
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаКорректировкиДенежныхОбязательств", ТаблицаРезультат.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

// Фондовая касса - поступление денежных документов с постоплатой
//
Функция ФондоваяКассаПринятыеДенежныеОбязательства(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ПриниматьДенежныеОбязательства", Новый ОписаниеТипов("Булево"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;

	ПоляФункции = Новый Массив;
	
	ТаблицаДенежныеОбязательства = УчетРасчетов.ПустаяТаблицаПринятыеДенежныеОбязательства();
	
	Для Каждого Колонка Из ТаблицаДенежныеОбязательства.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;                                                                                             
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Если НЕ Параметры.Свойство("ПриниматьДенежныеОбязательства")
	 ИЛИ НЕ Параметры.ПриниматьДенежныеОбязательства Тогда
		Возврат ТаблицаДенежныеОбязательства;
	КонецЕсли;
	
	Если ИсточникиДанных.Свойство("ДенежныеОбязательства")
		И ТипЗнч(ИсточникиДанных.ДенежныеОбязательства) = Тип("ТаблицаЗначений")
		И ИсточникиДанных.ДенежныеОбязательства.Количество() > 0 Тогда
		Возврат ТаблицаДенежныеОбязательства;
	КонецЕсли;
		
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		УчетРасчетов.ПустаяТаблицаРасчетовСЗачетомАвансов());
		
	ТаблицыПоступления = Новый Структура;
	

	ТаблицаДенежныеОбязательства = УчетРасчетов.ТаблицаПринятыеДенежныеОбязательства(
		ТаблицаРасчетовСЗачетомАвансов,
		ТаблицыПоступления,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаДенежныеОбязательства;

КонецФункции	

// Отложенные обязательства для корректировки.
// 
// Параметры: См. ТестоваяФункцияСПараметром
//  ВариантВызова - см. ТестоваяФункцияСПараметром.ВариантВызова
//  ИсточникиДанных - см. ТестоваяФункцияСПараметром.ИсточникиДанных
//  ТиповаяОперация - см. ТестоваяФункцияСПараметром.ТиповаяОперация
//  Параметры - см. ТестоваяФункцияСПараметром.Параметры
// 
// Возвращаемое значение:
//  см. Документы.АктПриемкиТоваровРаботУслуг.ПустаяТаблицаКорректировкиОтложенныхОбязательств
Функция ОтложенныеОбязательстваДляКорректировки(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СкорректироватьОтложенныеОбязательства", Новый ОписаниеТипов("Булево"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЧастичнаяПриемка", Новый ОписаниеТипов("Булево"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "РазделЛицевогоСчета", Новый ОписаниеТипов("СправочникСсылка.РазделыЛицевыхСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Резерв", Новый ОписаниеТипов("СправочникСсылка.Резервы"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРезерва", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		ТаблицаКорректировки = Документы.АктПриемкиТоваровРаботУслуг.ПустаяТаблицаКорректировкиОтложенныхОбязательств();
		Для Каждого Колонка Из ТаблицаКорректировки.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;

	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Отказ = Ложь;
	ТаблицаКорректировки = Документы.АктПриемкиТоваровРаботУслуг.ТаблицаКорректировкиОтложенныхОбязательств(
		Реквизиты,
		Отказ);
	Если Отказ Тогда
		// Сохраним полученный Отказ.
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		КонтекстПроведения.Отказ = Отказ;
		БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	КонецЕсли;

	Возврат ТаблицаКорректировки;
	
КонецФункции

// Остатки резервов для корректировки.
// 
// Параметры: См. ТестоваяФункцияСПараметром
//  ВариантВызова - см. ТестоваяФункцияСПараметром.ВариантВызова
//  ИсточникиДанных - см. ТестоваяФункцияСПараметром.ИсточникиДанных
//  ТиповаяОперация - см. ТестоваяФункцияСПараметром.ТиповаяОперация
//  Параметры - см. ТестоваяФункцияСПараметром.Параметры
// 
// Возвращаемое значение:
//  см. Документы.АктПриемкиТоваровРаботУслуг.ПустаяТаблицаКорректировкиРезервов
Функция ОстаткиРезервовДляКорректировки(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ЧастичнаяПриемка", Новый ОписаниеТипов("Булево"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Резерв", Новый ОписаниеТипов("СправочникСсылка.Резервы"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРезерва", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПСРезерва", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		ТаблицаКорректировки = Документы.АктПриемкиТоваровРаботУслуг.ПустаяТаблицаКорректировкиРезервов();
		Для Каждого Колонка Из ТаблицаКорректировки.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;

	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	Отказ = Ложь;
	ТаблицаКорректировки = Документы.АктПриемкиТоваровРаботУслуг.ТаблицаКорректировкиРезервов(
		Реквизиты,
		Отказ);
	Если Отказ Тогда
		// Сохраним полученный Отказ.
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		КонтекстПроведения.Отказ = Отказ;
		БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	КонецЕсли;

	Возврат ТаблицаКорректировки;
	
КонецФункции

#КонецОбласти

#Область НДС

Функция ТаблицаАннулированияСчетаФактуры(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		ТипСчетФактура = Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданный,
			|ДокументСсылка.СчетФактураПолученный,
			|ДокументСсылка.ИсправительныйСчетФактураВыданный,
			|ДокументСсылка.ИсправительныйСчетФактураПолученный,
			|ДокументСсылка.КорректировочныйСчетФактураВыданный,
			|ДокументСсылка.КорректировочныйСчетФактураПолученный,
			|ДокументСсылка.ГТДИмпорт");
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетФактура", ТипСчетФактура);
		
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	// Поля - все колонки из проводок:
	ПоляФункции = Новый Массив;
	ТипСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ПустаяТаблица = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Для Каждого Колонка Из ПустаяТаблица.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если ВРег(Лев(ИмяКолонки, 8)) = ВРег("Субконто") Тогда
			ТипЗначенияКолонки = ТипСубконто;
		Иначе
			ТипЗначенияКолонки = Колонка.ТипЗначения
		КонецЕсли;
		ДобавитьПолеРезультатаФункции(ПоляФункции, ИмяКолонки, ТипЗначенияКолонки);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	// Заполняем возвращаемую таблицу значений:
	КонтекстПроведения			= БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ПроводимыйДокументСсылка	= КонтекстПроведения.Ссылка;
	ШапкаДокумента				= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроводимыйДокументСсылка, "Ссылка,Дата,ДопЛист,КорректируемыйПериод");
	
	ЗапросПроводки = Новый Запрос();
	ЗапросПроводки.УстановитьПараметр("СчетФактураСсылка",			Параметры["СчетФактура"]);
	ЗапросПроводки.УстановитьПараметр("ПроводимыйДокументСсылка",	ПроводимыйДокументСсылка);
	ЗапросПроводки.Текст = "
	|ВЫБРАТЬ
	|	*,
	|	// Инвертируем значения ресурсов:
	|	-Сумма					КАК Сумма,
	|	-ВалютнаяСуммаДт		КАК ВалютнаяСуммаДт,
	|	-ВалютнаяСуммаКт		КАК ВалютнаяСуммаКт,
	|	-КоличествоДт			КАК КоличествоДт,
	|	-КоличествоКт			КАК КоличествоКт,
	|	-СуммаНеУчитываетсяНУ	КАК СуммаНеУчитываетсяНУ,
	|	-СуммаЕНВД				КАК СуммаЕНВД,
	|	-СуммаНДС				КАК СуммаНДС
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|		,
	|		,
	|		Регистратор = &СчетФактураСсылка
	|		И	Активность = Истина
	|	)";
	
	ВыборкаПроводки = ЗапросПроводки.Выполнить().Выбрать();
	
	Пока ВыборкаПроводки.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПроводки);
		НоваяСтрока["Период"] = ШапкаДокумента["Дата"];
	КонецЦикла;
	
	Возврат ТаблицаРезультат;		
	
КонецФункции

Функция ТаблицаАннулированияСчетаФактуры_РегистрацияСтрокиКнигиПродаж(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		ТипСчетФактура = Новый ОписаниеТипов("ДокументСсылка.СчетФактураВыданный,
			|ДокументСсылка.СчетФактураПолученный,
			|ДокументСсылка.ИсправительныйСчетФактураВыданный,
			|ДокументСсылка.ИсправительныйСчетФактураПолученный,
			|ДокументСсылка.КорректировочныйСчетФактураВыданный,
			|ДокументСсылка.КорректировочныйСчетФактураПолученный,
			|ДокументСсылка.РегистрацияСтрокиКнигиПродаж");
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетФактура", ТипСчетФактура);
		
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	// Поля - все колонки из проводок:
	ПоляФункции = Новый Массив;
	ТипСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	ПустаяТаблица = РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	Для Каждого Колонка Из ПустаяТаблица.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		Если ВРег(Лев(ИмяКолонки, 8)) = ВРег("Субконто") Тогда
			ТипЗначенияКолонки = ТипСубконто;
		Иначе
			ТипЗначенияКолонки = Колонка.ТипЗначения
		КонецЕсли;
		ДобавитьПолеРезультатаФункции(ПоляФункции, ИмяКолонки, ТипЗначенияКолонки);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	// Заполняем возвращаемую таблицу значений:
	КонтекстПроведения			= БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ПроводимыйДокументСсылка	= КонтекстПроведения.Ссылка;
	ШапкаДокумента				= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроводимыйДокументСсылка, "Ссылка,Дата,ДопЛист,КорректируемыйПериод");
	
	ЗапросПроводки = Новый Запрос();
	ЗапросПроводки.УстановитьПараметр("СчетФактураСсылка",			Параметры["СчетФактура"]);
	ЗапросПроводки.УстановитьПараметр("ПроводимыйДокументСсылка",	ПроводимыйДокументСсылка);
	ЗапросПроводки.Текст = "
	|ВЫБРАТЬ
	|	*,
	|	// Инвертируем значения ресурсов:
	|	-Сумма					КАК Сумма,
	|	-ВалютнаяСуммаДт		КАК ВалютнаяСуммаДт,
	|	-ВалютнаяСуммаКт		КАК ВалютнаяСуммаКт,
	|	-КоличествоДт			КАК КоличествоДт,
	|	-КоличествоКт			КАК КоличествоКт,
	|	-СуммаНеУчитываетсяНУ	КАК СуммаНеУчитываетсяНУ,
	|	-СуммаЕНВД				КАК СуммаЕНВД,
	|	-СуммаНДС				КАК СуммаНДС
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|		,
	|		,
	|		Регистратор = &СчетФактураСсылка
	|		И	Активность = Истина
	|	)";
	
	ВыборкаПроводки = ЗапросПроводки.Выполнить().Выбрать();
	
	Пока ВыборкаПроводки.Следующий() Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПроводки);
		НоваяСтрока["Период"] = ШапкаДокумента["Дата"];
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область ВводОстатков

Функция ВводОстатковМатериалы106хП(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Номенклатура",	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ВидЗатрат",		Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ЦМО",			Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетДт",		Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетНУ",		Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КПСДт",			Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КЭКДт",			Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КоличествоДт",	ОбщегоНазначения.ОписаниеТипаЧисло(15,3,ДопустимыйЗнак.Неотрицательный));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Сумма",			ОбщегоНазначения.ОписаниеТипаЧисло(15,2,ДопустимыйЗнак.Любой));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаНУ",		ОбщегоНазначения.ОписаниеТипаЧисло(15,2,ДопустимыйЗнак.Любой));
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ШапкаДокумента = РеквизитыДокумента(ИсточникиДанных);
	
	ЗапросИсточник = Новый Запрос();
	ЗапросИсточник.УстановитьПараметр("ДокСсылка",			ШапкаДокумента.Ссылка);
	ЗапросИсточник.УстановитьПараметр("ОтражатьВБухУчете",	ШапкаДокумента.ОтражатьВБухгалтерскомУчете);
	ЗапросИсточник.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Табличная часть Материалы106хП
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НомерСтроки		КАК НомерСтроки,
	|	КЭК				КАК КЭК,
	|	Количество		КАК Количество,
	|	СчетНУ			КАК СчетНУ,
	|	
	|	// Поля связи
	|	Номенклатура	КАК Номенклатура,
	|	Счет			КАК Счет,
	|	КПС				КАК КПС
	|ПОМЕСТИТЬ
	|	ТаблЧастьМатериалы106хП
	|ИЗ
	|	Документ.ВводНачальныхОстатков.Материалы106хП
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|ИНДЕКСИРОВАТЬ ПО
	|	// Поля связи
	|	Номенклатура,
	|	Счет,
	|	КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Табличная часть Затраты106хП
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НомерСтроки		КАК НомерСтроки,
	|	ВидЗатрат		КАК ВидЗатрат,
	|	ЦМО				КАК ЦМО,
	|	Сумма			КАК Сумма,
	|	СуммаНУ			КАК СуммаНУ,
	|	
	|	// Поля связи
	|	Номенклатура	КАК Номенклатура,
	|	Счет			КАК Счет,
	|	КПС				КАК КПС
	|ПОМЕСТИТЬ
	|	ТаблЧастьЗатраты106хП
	|ИЗ
	|	Документ.ВводНачальныхОстатков.Затраты106хП
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|ИНДЕКСИРОВАТЬ ПО
	|	// Поля связи
	|	Номенклатура,
	|	Счет,
	|	КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Номера первых строк табличной части Затраты106хП
	|//		для каждого ключа связи обеих таблиц.
	|//		Используется для использования поля Количество основной таблицы
	|//		в проводках только 1 раз, а не по количеству строк зависимой таблицы.
	|//
	|ВЫБРАТЬ
	|	МИНИМУМ(НомерСтроки)	КАК НомерСтроки
	|ПОМЕСТИТЬ
	|	ТаблЧастьЗатраты106хП_НомераПервыхСтрок
	|ИЗ
	|	ТаблЧастьЗатраты106хП	КАК Затраты
	|СГРУППИРОВАТЬ ПО
	|	// Поля связи
	|	Номенклатура,
	|	Счет,
	|	// Поле КПС используется только при бух.учете
	|	ВЫБОР
	|		КОГДА &ОтражатьВБухУчете = ИСТИНА ТОГДА
	|			КПС
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Искомая таблица для дальнейшего формирования проводок
	|//
	|ВЫБРАТЬ
	|	Материалы.Номенклатура						КАК Номенклатура,
	|	Затраты.ВидЗатрат							КАК ВидЗатрат,
	|	Затраты.ЦМО									КАК ЦМО,
	|	
	|	// Дебет
	|	Материалы.Счет								КАК СчетДт,
	|	Материалы.КПС								КАК КПСДт,
	|	Материалы.КЭК								КАК КЭКДт,
	|	// Устанавливаем поле Количество только для первых строк зависимой таблицы Затраты
	|	ВЫБОР
	|		КОГДА НомераПервыхСтрок.НомерСтроки ЕСТЬ NULL ТОГДА
	|			0
	|		ИНАЧЕ
	|			Материалы.Количество			
	|	КОНЕЦ										КАК КоличествоДт,
	|	
	|	Затраты.Сумма								КАК Сумма,
	|	Затраты.СуммаНУ								КАК СуммаНУ,
	|	Материалы.СчетНУ							КАК СчетНУ
	|ИЗ
	|	ТаблЧастьМатериалы106хП КАК Материалы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблЧастьЗатраты106хП КАК Затраты
	|		// Поля связи
	|		ПО	Материалы.Номенклатура = Затраты.Номенклатура
	|		И	Материалы.Счет = Затраты.Счет
	|		И	Материалы.КПС = Затраты.КПС
	|		// Требование заполненных значений
	|		И	(Затраты.Сумма <> 0 ИЛИ Затраты.СуммаНУ <> 0)
	|	ЛЕВОЕ СОЕДИНЕНИЕ	ТаблЧастьЗатраты106хП_НомераПервыхСтрок	КАК НомераПервыхСтрок
	|		ПО	Затраты.НомерСтроки = НомераПервыхСтрок.НомерСтроки
	|УПОРЯДОЧИТЬ ПО
	|	Материалы.НомерСтроки
	|;";
	
	Возврат ЗапросИсточник.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область УпрощеннаяСистемаНалогообложения

// Поступление расходов (УСН)

// Базовая функция поступления расходов УСН.
//
Функция ПоступлениеРасходовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "АвтоОтражениеВУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	// Поступление расходов будем отражать для всех таблиц поступления (материалов, тары, услуг и пр.),
	// которые сформированы к текущему моменту.
	ТаблицыПоступления = Новый Структура;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеМатериальныхЗапасов") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаПоступлениеМатериальныхЗапасов);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеВозвратнойТары") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеВозвратнойТары", ДополнительныеСвойства.ТаблицаПоступлениеВозвратнойТары);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеВозвратнойТары", УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеВозвратнойТары());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеУслугРабот") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", ДополнительныеСвойства.ТаблицаПоступлениеУслугРабот);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеДопРасходов") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеДопРасходов", ДополнительныеСвойства.ТаблицаПоступлениеДопРасходов);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеДопРасходов", УчетРасчетов.ПустаяТаблицаПоступлениеДопРасходов());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаВложенияВоВнеоборотныеАктивы") Тогда
		ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы", ДополнительныеСвойства.ТаблицаВложенияВоВнеоборотныеАктивы);
	Иначе
		ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы", УправлениеОсновнымиСредствами.ПустаяТаблицаВложенияВоВнеоборотныеАктивы());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеОсновныхСредств") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", ДополнительныеСвойства.ТаблицаПоступлениеОсновныхСредств);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", УправлениеОсновнымиСредствами.ПустаяТаблицаПоступлениеОсновныхСредств());
	КонецЕсли;
	
	// Подготовим таблицу поступления расходов УСН,
	ТаблицаРасходовУСН = УчетУСН.ТаблицаПоступлениеРасходовУСН(
		ТаблицыПоступления,
		Реквизиты,
		Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеРасходовУСН", ТаблицаРасходовУСН.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Расходы УСН на приобретение материальных запасов.
//
Функция ПоступлениеМатериальныхЗапасовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоступлениеРасходовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаПоступлениеРасходовУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица поступления расходов УСН.
			|Для формирования таблицы расходов УСН на приобретение материальных запасов,
			|используется таблица поступления расходов УСН,
			|подготовленная функцией УчетУСН.ТаблицаПоступлениеРасходовУСН.";
	КонецЕсли;
	
	// Выделим из всех расходов УСН только расходы на приобретение материальных запасов.
	Возврат ДополнительныеСвойства.ТаблицаПоступлениеРасходовУСН.Скопировать(
		Новый Структура("ИмяСписка", "Материалы"));
	
КонецФункции

// Расходы УСН на приобретение возвратной тары.
//
Функция ПоступлениеВозвратнойТарыУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоступлениеРасходовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаПоступлениеРасходовУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица поступления расходов УСН.
			|Для формирования таблицы расходов УСН на приобретение возвратной тары,
			|используется таблица поступления расходов УСН,
			|подготовленная функцией УчетУСН.ТаблицаПоступлениеРасходовУСН.";
	КонецЕсли;
	
	// Выделим из всех расходов УСН только расходы на приобретение возвратной тары.
	Возврат ДополнительныеСвойства.ТаблицаПоступлениеРасходовУСН.Скопировать(
		Новый Структура("ИмяСписка", "ВозвратнаяТара"));
	
КонецФункции

Функция ВводОстатковРасходовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицыРасходов = УчетУСН.ПодготовитьТаблицыВводОстатковРасходовУСН(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу начальных остатков по расходам УСН.
		ТаблицаРасходовУСН = УчетУСН.ТаблицаВводОстатковРасходовУСН(
			ТаблицыРасходов,
			Реквизиты,
			Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаВводОстатковРасходовУСН", ТаблицаРасходовУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Функция РасходыУСНПоАвансовомуОтчету(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "АвтоОтражениеВУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицыРасходов = УчетУСН.ПодготовитьТаблицыРасходовПоАвансовомуОтчету(
		Реквизиты.Ссылка, Реквизиты);
	
	// Подготовим таблицу поступления расходов УСН по данным авансового отчета,
	ТаблицаРасходовУСН = УчетУСН.ТаблицаПоступлениеРасходовУСН(
		ТаблицыРасходов,
		Реквизиты,
		Отказ);
	// и сохраним для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеРасходовУСН", ТаблицаРасходовУСН.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Функция РасходыУСНПоОтчетуОРасходахПодотчетногоЛица(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "АвтоОтражениеВУСН", Новый ОписаниеТипов("ПеречислениеСсылка.ОтражениеВУСН"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Если ДополнительныеСвойства.Свойство("РасходыПоОтчетуОРасходах") Тогда
		РасходыПодотчетногоЛица = ДополнительныеСвойства.РасходыПоОтчетуОРасходах;
	ИначеЕсли ДополнительныеСвойства.Свойство("РасходыПоАвансовомуОтчету") Тогда
		РасходыПодотчетногоЛица = ДополнительныеСвойства.РасходыПоАвансовомуОтчету;
	Иначе
		ВызватьИсключение "Не обнаружена таблица расходов подотчетного лица.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица расходов подотчетного лица,
			|подготовленная функциями РасходыПоОтчетуОРасходах или РасходыПоАвансовомуОтчету.";
	КонецЕсли;
	
	ТаблицыРасходов = УчетУСН.ПодготовитьТаблицыРасходовУСНПоРасходамПодотчетногоЛица(
		РасходыПодотчетногоЛица, ДокументОбъект);
	
	// Подготовим таблицу поступления расходов УСН по данным отчета о расходах подотчетного лица,
	ТаблицаРасходовУСН = УчетУСН.ТаблицаПоступлениеРасходовУСН(
		ТаблицыРасходов,
		Реквизиты,
		Отказ);
	// и сохраним для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеРасходовУСН", ТаблицаРасходовУСН.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Функция РасходыУСНПоЭквайринговойОперации(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицыРасходов = УчетУСН.ПодготовитьТаблицыРасходовПоЭквайринговойОперации(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу поступления расходов УСН по данным эквайринговой операции.
		ТаблицаРасходовУСН = УчетУСН.ТаблицаПоступлениеРасходовУСН(
			ТаблицыРасходов,
			Реквизиты,
			Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеРасходовУСН", ТаблицаРасходовУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Функция РасходыУСНПоИмущественнымНалогам(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПоступлениеРасходовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаРасходовУСН = УчетУСН.ТаблицаНачислениеИмущественныхНалогов(ДокументОбъект, Реквизиты);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеРасходовУСН", ТаблицаРасходовУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Базовая функция оплаты расходов УСН за счет аванса поставщику.
//
Функция ЗачетАвансовПоставщикуУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов") Тогда
		ВызватьИсключение "Не обнаружены данные зачета авансов.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица зачета авансов,
			|подготовленная функцией УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов.";
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаПоступлениеРасходовУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица поступления расходов УСН.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица поступления расходов УСН,
			|подготовленная функцией УчетУСН.ТаблицаПоступлениеРасходовУСН.";
	КонецЕсли;
	
	// Подготовим таблицу оплаченных расходов УСН за счет авансов поставщику,
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаЗачетАвансовПоставщикуУСН(
		ДополнительныеСвойства.ТаблицаПоступлениеРасходовУСН,
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Реквизиты,
		Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаЗачетАвансовПоставщикуУСН", ТаблицаОплаченныхРасходовУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Оплата расходов УСН на приобретение материальных запасов.
//
Функция ОплатаМатериальныхЗапасовЗаСчетАвансовПоставщикуУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ЗачетАвансовПоставщикуУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаЗачетАвансовПоставщикуУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица зачета авансов поставщику (УСН).
			|Для формирования таблицы оплаты расходов УСН на приобретение возвратной тары,
			|используется таблица зачета авансов поставщику (УСН),
			|подготовленная функцией УчетУСН.ТаблицаЗачетАвансовПоставщикуУСН.";
	КонецЕсли;
	
	// Выделим из всех расходов УСН только расходы на приобретение материальных запасов.
	Возврат ДополнительныеСвойства.ТаблицаЗачетАвансовПоставщикуУСН.Скопировать(
		Новый Структура("ИмяСписка", "Материалы"));
	
КонецФункции

// Оплата расходов УСН на приобретение возвратной тары.
//
Функция ОплатаВозвратнойТарыЗаСчетАвансовПоставщикуУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ЗачетАвансовПоставщикуУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаЗачетАвансовПоставщикуУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица зачета авансов поставщику (УСН).
			|Для формирования таблицы оплаты расходов УСН на приобретение возвратной тары,
			|используется таблица зачета авансов поставщику (УСН),
			|подготовленная функцией УчетУСН.ТаблицаЗачетАвансовПоставщикуУСН.";
	КонецЕсли;
	
	// Выделим из всех расходов УСН только расходы на приобретение возвратной тары.
	Возврат ДополнительныеСвойства.ТаблицаЗачетАвансовПоставщикуУСН.Скопировать(
		Новый Структура("ИмяСписка", "ВозвратнаяТара"));
	
КонецФункции

// Базовая функция оплаты расходов УСН платежными документами.
//
Функция ОплатаПоставщикуУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаРасчетовСПогашениемЗадолженности") Тогда
		ВызватьИсключение "Не обнаружены данные о погашении задолженности.
			|Для формирования таблицы оплаченных расходов УСН используется таблица погашения задолженности,
			|подготовленная функцией УчетРасчетов.ТаблицаРасчетовСПогашениемЗадолженности.";
	КонецЕсли;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаОплатаПоставщикуУСН(
		ДополнительныеСвойства.ТаблицаРасчетовСПогашениемЗадолженности,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ОплаченныеРасходыУСНПоАвансовомуОтчету(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаПоступлениеРасходовУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица поступления расходов УСН.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица поступления расходов УСН,
			|подготовленная функцией УчетУСН.ТаблицаПоступлениеРасходовУСН.";
	КонецЕсли;
	
	// 1. Расходы на приобретение материальных запасов, услуг и пр. считаем оплаченными,
	// т.к. при регистрации авансового отчета расчеты с подотчетным лицом должны быть завершены.
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаОплаченныеАвансомРасходыПодотчетнихЛиц(
		ДополнительныеСвойства.ТаблицаПоступлениеРасходовУСН,
		Реквизиты,
		Отказ);
	
	// 2. Добавим расходы УСН, оплаченные подотчетным лицом поставщикам.
	ТаблицаОплатПоставщикам = УчетУСН.ПодготовитьТаблицуОплатПоставщикамПодотчетнымЛицом(
		Реквизиты.Ссылка, Реквизиты);
	РасходыУСНОплаченныеПоставщикуПодотчетнымЛицом = УчетУСН.ТаблицаОплатаПоставщикуУСН(
		ТаблицаОплатПоставщикам,
		Реквизиты,
		Отказ);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
		РасходыУСНОплаченныеПоставщикуПодотчетнымЛицом,
		ТаблицаОплаченныхРасходовУСН);
	
	// 3. Добавим расходы УСН по зарегистрированным ранее приходным документам, указанным в строках авансового отчета.
	ТаблицаОплатПоПриходнымДокументам = УчетУСН.ПодготовитьТаблицуОплатПоПриходнымДокументам(
		Реквизиты.Ссылка, Реквизиты);
	ОплаченныеРасходыУСНПоПриходнымДокументам = УчетУСН.ТаблицаОплатаПоставщикуУСН(
		ТаблицаОплатПоПриходнымДокументам,
		Реквизиты,
		Отказ);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(
		ОплаченныеРасходыУСНПоПриходнымДокументам,
		ТаблицаОплаченныхРасходовУСН);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ОплаченныеАвансомРасходыПодотчетнихЛицУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаПоступлениеРасходовУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица поступления расходов УСН.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица поступления расходов УСН,
			|подготовленная функцией УчетУСН.ТаблицаПоступлениеРасходовУСН.";
	КонецЕсли;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаОплаченныеАвансомРасходыПодотчетнихЛиц(
		ДополнительныеСвойства.ТаблицаПоступлениеРасходовУСН,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ОплаченныеРасходыПодотчетнихЛицУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Если ДополнительныеСвойства.Свойство("РасшифровкаПлатежаУнифицированная") Тогда
		РасшифровкаПлатежаУнифицированная = ДополнительныеСвойства.РасшифровкаПлатежаУнифицированная;
	Иначе
		РасшифровкаПлатежаУнифицированная = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
			ДокументОбъект, Реквизиты, Отказ);
	КонецЕсли;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаОплаченныеРасходыПодотчетнихЛиц(
		РасшифровкаПлатежаУнифицированная,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Оплата труда, налоги с ФОТ (УСН)

Функция РасходыУСННаОплатуТрудаИНалогиСФОТ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ОсновнойКонтрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаРасходыУСННаОплатуТрудаИНалогиСФОТ();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	// Подготовим таблицы начислений, удержаний и налогов с ФОТ по данным документа отражения зар. платы в учете.
	ТаблицыРасходов = УчетУСН.ПодготовитьТаблицыРасходовПриОтраженииЗарплаты(
		ДокументОбъект, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу поступления расходов УСН на оплату труда и налогов в ФОТ.
		ТаблицаРасходовУСН = УчетУСН.ТаблицаРасходыУСННаОплатуТрудаИНалогиСФОТ(
			ТаблицыРасходов,
			Реквизиты,
			Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаПоступлениеРасходовУСН",
		ТаблицаРасходовУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Функция НачисленияЗаСчетНалоговыхПлатежейУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ОсновнойКонтрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаНачисления = УчетУСН.ПустаяТаблицаНачисленияЗаСчетНалоговыхПлатежей();
	Для Каждого Колонка Из ТаблицаНачисления.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	// Подготовим таблицу начислений за счет налоговых платежей:
	// - в рамках обязательного социального страхования от НС и ПЗ;
	// - за счет средств государственного социального страхования.
	ТаблицаНачисления = УчетУСН.ПодготовитьТаблицуНачисленийЗаСчетНалоговыхПлатежейПоДокументу(
		ДокументОбъект, Реквизиты, Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("НачисленияЗаСчетНалоговыхПлатежейУСН",
		ТаблицаНачисления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаНачисления;
	
КонецФункции

// Удержания из оплаты труда (алименты и пр.) (УСН) 

Функция ОплаченныеАвансомУдержанияИзОплатыТрудаУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаПоступлениеРасходовУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица поступления расходов УСН.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица поступления расходов УСН,
			|подготовленная функцией УчетУСН.ТаблицаПоступлениеРасходовУСН.";
	КонецЕсли;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаОплаченныеАвансомУдержанияИзОплатыТруда(
		ДополнительныеСвойства.ТаблицаПоступлениеРасходовУСН,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ПеречислениеУдержанийИзОплатыТрудаУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Если ДополнительныеСвойства.Свойство("ТаблицаРасчетовСПогашениемЗадолженности") Тогда
		
		ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаПеречислениеУдержанийИзОплатыТруда(
			ДополнительныеСвойства.ТаблицаРасчетовСПогашениемЗадолженности,
			Реквизиты,
			Отказ);
		
	Иначе
		
		Реквизиты.Вставить("СчетРасчетов", БухгалтерскийУчет.СчетПоКоду("304.03", ДокументОбъект.Дата, ДокументОбъект.Организация));
		РасшифровкаПлатежаУнифицированная = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
			ДокументОбъект, Реквизиты, Отказ);
		
		ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаПеречислениеУдержанийИзОплатыТруда(
			РасшифровкаПлатежаУнифицированная,
			Реквизиты,
			Отказ);
		
	КонецЕсли;
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Налоги и сборы (УСН)

Функция РасчетыПоНалогамИСборамУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетыУСН = УчетУСН.ПустаяТаблицаРасчетыПоНалогамИСборамУСН();
	Для Каждого Колонка Из ТаблицаРасчетыУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	РасшифровкаНалоговогоПлатежа = УчетУСН.ПодготовитьТаблицуРасшифровкаНалоговогоПлатежаПоДокументу(
		ДокументОбъект, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения прочих расчетов УСН по налогам и сборам.
		ТаблицаРасчетыУСН = УчетУСН.ТаблицаРасчетыПоНалогамИСборамУСН(
			РасшифровкаНалоговогоПлатежа,
			Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетыПоНалогамИСборамУСН", ТаблицаРасчетыУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетыУСН;
	
КонецФункции

Функция УплатаНалоговИСборовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаРасчетыПоНалогамИСборамУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица расчетов УСН по налогам и сборам.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица поступления расчетов УСН,
			|подготовленная функцией УчетУСН.ТаблицаРасчетыПоНалогамИСборамУСН.";
	КонецЕсли;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаУплатаНалоговИСборовУСН(
		ДополнительныеСвойства.ТаблицаРасчетыПоНалогамИСборамУСН,
		Реквизиты, Отказ);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ЗачетОплатыНалоговИСборовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаПоступлениеРасходовУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица поступления расходов УСН.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица поступления расходов УСН,
			|подготовленная функцией УчетУСН.ТаблицаПоступлениеРасходовУСН.";
	КонецЕсли;
	
	// При отражении зарплаты могут начисления за счет страховых взносов.
	НачисленияЗаСчетНалоговыхПлатежейУСН = ?(ДополнительныеСвойства.Свойство("НачисленияЗаСчетНалоговыхПлатежейУСН"),
		ДополнительныеСвойства.НачисленияЗаСчетНалоговыхПлатежейУСН,
		УчетУСН.ПустаяТаблицаНачисленияЗаСчетНалоговыхПлатежей());
	
	// Подготовим таблицу оплаченных расходов УСН на налоги (взносы).
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаЗачетОплатыНалоговИСборовУСН(
		ДополнительныеСвойства.ТаблицаПоступлениеРасходовУСН,
		НачисленияЗаСчетНалоговыхПлатежейУСН,
		Реквизиты, Отказ);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

Функция ОплатаНалоговИСборовЧерезЕНПвУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаРаспределениеЕНП = УчетУСН.ПодготовитьТаблицуРаспределениеЕНППоДокументу(
		ДокументОбъект, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу оплаченных расходов УСН по налогам и сборам.
		ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаОплатаНалоговИСборовЧерезЕНПвУСН(
			ТаблицаРаспределениеЕНП, Реквизиты, Отказ);
			
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаОплатаНалоговИСборовЧерезЕНПвУСН", ТаблицаОплаченныхРасходовУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

// Списание материальных запасов (УСН)

Функция СписаниеМатериальныхЗапасовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаСписаниеМатериальныхЗапасовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицыСписания = Новый Структура;
	Если ДополнительныеСвойства.Свойство("ТаблицаСписаниеМатериальныхЗапасов") Тогда
		ТаблицыСписания.Вставить("СписаниеМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаСписаниеМатериальныхЗапасов);
	ИначеЕсли ДополнительныеСвойства.Свойство("ТаблицаСписаниеПродуктовПитания") Тогда
		ТаблицыСписания.Вставить("СписаниеМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаСписаниеПродуктовПитания);
	Иначе
		ТаблицыСписания.Вставить("СписаниеМатериальныхЗапасов", УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеМатериальныхЗапасов());
	КонецЕсли;
	
	// Подготовим таблицу списания материальных запасов для целей УСН.
	ТаблицаРасходовУСН = УчетУСН.ТаблицаСписаниеМатериальныхЗапасовУСН(
		ТаблицыСписания,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

Функция СписаниеВозвратнойТарыУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаСписаниеМатериальныхЗапасовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	ТаблицыСписания = Новый Структура;
	Если ДополнительныеСвойства.Свойство("ТаблицаСписаниеВозвратнойТары") Тогда
		ТаблицыСписания.Вставить("СписаниеВозвратнойТары", ДополнительныеСвойства.ТаблицаСписаниеВозвратнойТары);
	Иначе
		ТаблицыСписания.Вставить("СписаниеВозвратнойТары", УправлениеМатериальнымиЗапасами.ПустаяТаблицаСписаниеВозвратнойТары());
	КонецЕсли;
	
	// Подготовим таблицу списания возвратной тары для целей УСН.
	ТаблицаРасходовУСН = УчетУСН.ТаблицаСписаниеМатериальныхЗапасовУСН(
		ТаблицыСписания,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Списание доп. расходов (УСН)

Функция СписаниеДопРасходовУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаСписаниеДопРасходовУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаРасходовУСН = УчетУСН.ТаблицаСписаниеДопРасходовУСН(Реквизиты);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Распределение расходов по видам деятельности (УСН)

Функция РаспределениеРасходовПоВидамДеятельностиУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаРаспределениеРасходовПоВидамДеятельностиУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаРасходовУСН = УчетУСН.ТаблицаРаспределениеРасходовПоВидамДеятельностиУСН(Реквизиты);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Ввод остатков ОС и НМА (УСН)

Функция ВводОстатковОсновныхСредствУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаВводОстатковОсновныхСредствУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаВводОстатковОсновныхСредств") Тогда
		ВызватьИсключение "Не обнаружена таблица ввода остатков основных средств.
			|Для формирования таблицы ввода остатков основных средств УСН,
			|используется таблица ввода остатков основных средств,
			|подготовленная функцией УправлениеОсновнымиСредствами.ТаблицаВводОстатковОсновныхСредств.";
	КонецЕсли;
	
	// Подготовим таблицу ввода остатков ОС и НМА для целей УСН.
	ТаблицаРасходовУСН = УчетУСН.ТаблицаВводОстатковОсновныхСредствУСН(
		ДополнительныеСвойства.ТаблицаВводОстатковОсновныхСредств,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Принятие к учету ОС и НМА (УСН)

Функция ПринятиеКУчетуОсновныхСредствУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПринятиеКУчетуОсновныхСредствУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаДокумента = УчетУСН.ПодготовитьТаблицуПринятиеКУчетуОсновныхСредствПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	// Подготовим таблицу расходов УСН для отражения операции принятия к учету объектов ОС и НМА.
	ТаблицаРасходовУСН = УчетУСН.ТаблицаПринятиеКУчетуОсновныхСредствУСН(
		ТаблицаДокумента, Реквизиты.Ссылка,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Модернизация ОС и НМА (УСН)

Функция МодернизацияОсновныхСредствУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаМодернизацияОсновныхСредствУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаМодернизацияОсновныхСредств") Тогда
		ВызватьИсключение "Не обнаружена таблица модернизации основных средств.
			|Для формирования таблицы модернизации основных средств для УСН,
			|используется таблица модернизации основных средств,
			|подготовленная функцией УправлениеОсновнымиСредствами.ТаблицаМодернизацияОсновныхСредств.";
	КонецЕсли;
	
	// Подготовим таблицу расходов УСН для отражения операции модернизации объектов ОС и НМА.
	ТаблицаРасходовУСН = УчетУСН.ТаблицаМодернизацияОсновныхСредствУСН(
		ДополнительныеСвойства.ТаблицаМодернизацияОсновныхСредств, Реквизиты.Ссылка,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Ввод в эксплуатацию ОС (УСН)

Функция ВводВЭксплуатациюОсновныхСредствУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаВводВЭксплуатациюОсновныхСредствУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаДокумента = УчетУСН.ПодготовитьТаблицуВводВЭксплуатациюОсновныхСредствПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	// Подготовим таблицу расходов УСН для отражения операции ввода в эксплуатацию объектов ОС.
	ТаблицаРасходовУСН = УчетУСН.ТаблицаВводВЭксплуатациюОсновныхСредствУСН(
		ТаблицаДокумента, Реквизиты.Ссылка,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Признание расходов на ОС и НМА (УСН)

Функция ПризнаниеРасходовНаОсновныеСредстваУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасходовУСН = УчетУСН.ПустаяТаблицаПризнанныхРасходовНаПриобретениеОсновныхСредствУСН();
	Для Каждого Колонка Из ТаблицаРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	ТаблицаРасходовУСН = УчетУСН.ТаблицаПризнанныхРасходовНаПриобретениеОсновныхСредствУСН(Реквизиты);
	
	Возврат ТаблицаРасходовУСН;
	
КонецФункции

// Исключение НДС, предъявленного покупателям из доходов (УСН) с 2025 г.

// Отражение в УСН зачета авансов полученных документами реализации по договорам с покупателями (Дт УД).
//
Функция ЗачетАвансовПолученныхУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидДеятельностиУСН",
			Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СпособИсключенияНДСИзДоходовУСН",
			Новый ОписаниеТипов("ПеречислениеСсылка.СпособыИсключенияНДСизДоходовУСН"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаЗачетАвансовПолученныхУСН = УчетУСН.ПустаяТаблицаЗачетАвансовПолученныхУСН();
	Для Каждого Колонка Из ТаблицаЗачетАвансовПолученныхУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов") Тогда
		ВызватьИсключение "Не обнаружены данные расчетов с контрагентами.
			|Для формирования таблицы планируемых оплат используется таблица расчетов с контрагентами,
			|подготовленная функцией УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов.";
	КонецЕсли;
	
	ТаблицыРеализации = Новый Структура;
	Если ДополнительныеСвойства.Свойство("ТаблицаРеализацияМатериальныхЗапасов") Тогда
		ТаблицыРеализации.Вставить("РеализацияМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаРеализацияМатериальныхЗапасов);
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ТаблицаРеализацияОсновныхСредств") Тогда
		ТаблицыРеализации.Вставить("РеализацияОсновныхСредств", ДополнительныеСвойства.ТаблицаРеализацияОсновныхСредств);
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("ТаблицаРеализацияУслугРабот") Тогда
		ТаблицыРеализации.Вставить("РеализацияУслугРабот", ДополнительныеСвойства.ТаблицаРеализацияУслугРабот);
	КонецЕсли;
	
	ТаблицаЗачетАвансовПолученныхУСН = УчетУСН.ТаблицаЗачетАвансовПолученныхУСН(
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		ТаблицыРеализации,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаЗачетАвансовПолученныхУСН;
	
КонецФункции

// Отражение в УСН погашения задолженности документами поступления денежных средств от покупателей.
//
Функция ПогашениеЗадолженностиПокупателейУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "УказатьВручнуюДоходыУСН", Новый ОписаниеТипов("Булево"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПогашениеЗадолженностиПокупателейУСН = УчетУСН.ПустаяТаблицаПогашениеЗадолженностиПокупателейУСН();
	Для Каждого Колонка Из ТаблицаПогашениеЗадолженностиПокупателейУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	Если МетаданныеДокумента.Имя = "ЭквайринговаяОперация" Тогда
		Если НЕ (ДокументОбъект.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаПлатежнойКартой
			 ИЛИ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаЭлектроннымиСредствамиПлатежаПоРеестру
			 ИЛИ ДокументОбъект.ВидОперации = Перечисления.ВидыОперацииЭквайринга.ОплатаЧерезСервисПриемаПлатежей) Тогда
			Возврат ТаблицаПогашениеЗадолженностиПокупателейУСН; // Не отражается.
		КонецЕсли;
		Если ДокументОбъект.ОтменаОплатыВыполнена Тогда
			Возврат ТаблицаПогашениеЗадолженностиПокупателейУСН; // Не отражается.
		КонецЕсли;
	КонецЕсли;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаРасчетовСПогашениемЗадолженности") Тогда
		ВызватьИсключение "Не обнаружены данные о погашении задолженности.
			|Для формирования таблицы сумм НДС для исключения из доходов УСН используется таблица погашения задолженности,
			|подготовленная функцией УчетРасчетов.ТаблицаРасчетовСПогашениемЗадолженности.";
	КонецЕсли;
	
	ТаблицаПогашениеЗадолженностиПокупателейУСН = УчетУСН.ТаблицаПогашениеЗадолженностиПокупателейУСН(
		ДополнительныеСвойства.ТаблицаРасчетовСПогашениемЗадолженности,
		Реквизиты,
		Отказ);
	
	Возврат ТаблицаПогашениеЗадолженностиПокупателейУСН;
	
КонецФункции

// Оплата поставщику (УСН)

// Начисление обязательств за счет резерва (неотфактурованные поставки)
//
Функция НачислениеОбязательствЗаСчетРезерваУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаНачислениеОбязательствЗаСчетРезерваУСН = УчетУСН.ПустаяТаблицаНачислениеОбязательствЗаСчетРезерваУСН();
	Для Каждого Колонка Из ТаблицаНачислениеОбязательствЗаСчетРезерваУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	// Поступление расходов будем отражать для всех таблиц поступления (материалов, тары, услуг и пр.),
	// которые сформированы к текущему моменту.
	ТаблицыПоступления = Новый Структура;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеМатериальныхЗапасов") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаПоступлениеМатериальныхЗапасов);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", УправлениеМатериальнымиЗапасами.ПустаяТаблицаПоступлениеМатериальныхЗапасов());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеУслугРабот") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", ДополнительныеСвойства.ТаблицаПоступлениеУслугРабот);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", УчетРасчетов.ПустаяТаблицаПоступлениеУслугРабот());
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеОсновныхСредств") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", ДополнительныеСвойства.ТаблицаПоступлениеОсновныхСредств);
	Иначе
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", УправлениеОсновнымиСредствами.ПустаяТаблицаПоступлениеОсновныхСредств());
	КонецЕсли;
	
	ТаблицыПриемкаТоваровРаботУслуг = УчетУСН.ПодготовитьТаблицыПриемкаТоваровРаботУслугУСН(
		ТаблицыПоступления, ДокументОбъект, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу поступления расходов УСН по данным эквайринговой операции.
		ТаблицаНачислениеОбязательствЗаСчетРезерваУСН = УчетУСН.ТаблицаНачислениеОбязательствЗаСчетРезерваУСН(
			ТаблицыПриемкаТоваровРаботУслуг,
			Реквизиты,
			Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаНачислениеОбязательствЗаСчетРезерваУСН", ТаблицаНачислениеОбязательствЗаСчетРезерваУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаНачислениеОбязательствЗаСчетРезерваУСН;
	
КонецФункции

// Зачет авансов выданных поставщику при начислении обязательств за счет резерва (неотфактурованные поставки)
//
Функция ЗачетАвансовНачислениеОбязательствЗаСчетРезерваУСН(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ПустаяТаблицаОплаченныхРасходовУСН();
	Для Каждого Колонка Из ТаблицаОплаченныхРасходовУСН.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов") Тогда
		ВызватьИсключение "Не обнаружены данные зачета авансов.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица зачета авансов,
			|подготовленная функцией УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов.";
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаНачислениеОбязательствЗаСчетРезерваУСН") Тогда
		ВызватьИсключение "Не обнаружена таблица начисления обязательств за счет резерва для отражения расходов УСН.
			|Для формирования таблицы оплаченных расходов УСН  используется таблица начисления обязательств за счет резерва для отражения расходов УСН,
			|подготовленная функцией УчетУСН.НачислениеОбязательствЗаСчетРезерваУСН.";
	КонецЕсли;
	
	// Подготовим таблицу оплаченных расходов УСН за счет авансов поставщику,
	ТаблицаОплаченныхРасходовУСН = УчетУСН.ТаблицаЗачетАвансовПоставщикуУСН(
		ДополнительныеСвойства.ТаблицаНачислениеОбязательствЗаСчетРезерваУСН,
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Реквизиты,
		Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаЗачетАвансовНачислениеОбязательствЗаСчетРезерваУСН", ТаблицаОплаченныхРасходовУСН.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаОплаченныхРасходовУСН;
	
КонецФункции

#КонецОбласти

#Область ЗакрытиеГода

Функция ЗакрытиеГодаУпрощенно(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ОписаниеТипаСуммы		= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	ОписаниеТипаКоличества	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	ОписаниеТипаСтрока		= Новый ОписаниеТипов("Строка");
	ОписаниеТипаДата		= Новый ОписаниеТипов("Дата");
	ОписаниеТипаСубконто	= Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;

	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ВалютаДт",					Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ВалютаКт",					Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ВалютнаяСуммаДт",			ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ВалютнаяСуммаКт",			ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ВидПервичногоДокумента",   	ОписаниеТипаСтрока);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ДатаПервичногоДокумента",  	ОписаниеТипаДата);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИФО",						Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КПСДт",						Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КПСКт",						Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КФО",						Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КЭКДт",						Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КЭККт",						Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КоличествоДт",				ОписаниеТипаКоличества);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КоличествоКт",				ОписаниеТипаКоличества);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерПервичногоДокумента",  ОписаниеТипаСтрока);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Период",  					ОписаниеТипаДата);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ПодразделениеДт",  			Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ПодразделениеКт",  			Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Содержание",   				ОписаниеТипаСтрока); 
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоДт1",   			ОписаниеТипаСубконто);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоДт2",   			ОписаниеТипаСубконто);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоДт3",   			ОписаниеТипаСубконто);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоКт1",   			ОписаниеТипаСубконто);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоКт2",   			ОписаниеТипаСубконто);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоКт3",   			ОписаниеТипаСубконто);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Сумма",						ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетДт",					Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетКт",					Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		//ЖурналОпераций

	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	ТаблицаСчетов = Новый ТаблицаЗначений;
	ТаблицаСчетов.Колонки.Добавить("Счет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаСчетов.Колонки.Добавить("ДтКт", Новый ОписаниеТипов("Булево"));
	
	СтрокаСчета = ТаблицаСчетов.Добавить();
	СтрокаСчета.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("210.02");
	СтрокаСчета.ДтКт = Истина;
	
	СтрокаСчета = ТаблицаСчетов.Добавить();
	СтрокаСчета.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("304.04");
	СтрокаСчета.ДтКт = Ложь;
	
	СтрокаСчета = ТаблицаСчетов.Добавить();
	СтрокаСчета.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("304.05");
	СтрокаСчета.ДтКт = Ложь;
	
	СтрокаСчета = ТаблицаСчетов.Добавить();
	СтрокаСчета.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("304.06");
	СтрокаСчета.ДтКт = Ложь;
	
	СтрокаСчета = ТаблицаСчетов.Добавить();
	СтрокаСчета.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("401.10");
	СтрокаСчета.ДтКт = Ложь;
	
	СтрокаСчета = ТаблицаСчетов.Добавить();
	СтрокаСчета.Счет = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("401.20");
	СтрокаСчета.ДтКт = Истина;                                                         
	
	//СчетаДокумента = ИсточникиДанных.ЗакрываемыеСчета.Выгрузить();
	СчетаДокумента = ИсточникиДанных.ЗакрываемыеСчета.Скопировать(, "ЗакрываемыеСчета_ИФО, ЗакрываемыеСчета_КПС40130, ЗакрываемыеСчета_КФО, ЗакрываемыеСчета_КЭК40130, ЗакрываемыеСчета_Счет, ЗакрываемыеСчета_Счет40130");
	
	ИсточникДокумент = ИсточникиДанных.Документ[0];
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаСчетов", 		ТаблицаСчетов);
	Запрос.УстановитьПараметр("ЗакрываемыеСчета",	СчетаДокумента);
	Запрос.УстановитьПараметр("Период", 			Новый Граница(КонецДня(ИсточникДокумент.Документ_ФинансовыйГод),
																		ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Дата",				ИсточникДокумент.Документ_Дата);
	Запрос.УстановитьПараметр("Номер",				ИсточникДокумент.Документ_Номер);
	Запрос.УстановитьПараметр("ВидДокумента",		"Закрытие года");
	Запрос.УстановитьПараметр("Организация", 		ИсточникДокумент.Документ_Организация);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаСчетов.Счет,
	|	ТаблицаСчетов.ДтКт
	|ПОМЕСТИТЬ ТаблицаСчетов
	|ИЗ
	|	&ТаблицаСчетов КАК ТаблицаСчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакрытиеГодаЗакрываемыеСчета.ЗакрываемыеСчета_Счет КАК Счет,
	|	ЕСТЬNULL(ЗакрытиеГодаЗакрываемыеСчета.ЗакрываемыеСчета_ИФО, 
	|					ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЗакрытиеГодаЗакрываемыеСчета.ЗакрываемыеСчета_КФО КАК КФО,
	|	ЗакрытиеГодаЗакрываемыеСчета.ЗакрываемыеСчета_Счет40130 КАК Счет40130,
	|	ЗакрытиеГодаЗакрываемыеСчета.ЗакрываемыеСчета_КПС40130 КАК КПС40130,
	|	ЗакрытиеГодаЗакрываемыеСчета.ЗакрываемыеСчета_КЭК40130 КАК КЭК40130
	|ПОМЕСТИТЬ ЗакрываемыеСчета
	|ИЗ
	|	&ЗакрываемыеСчета КАК ЗакрытиеГодаЗакрываемыеСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.ИФО, 
	|					ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)) КАК ИФО,
	|	ЖурналПроводокЕПСБУОстатки.КФО,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУОстатки.Подразделение, 
	|					ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)) КАК Подразделение,
	|	ЖурналПроводокЕПСБУОстатки.КПС,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2,
	|	ЖурналПроводокЕПСБУОстатки.Субконто3,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт,
	|	ЖурналПроводокЕПСБУОстатки.КЭК
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В
	|				(ВЫБРАТЬ
	|					ЗакрываемыеСчета.Счет
	|				ИЗ
	|					ЗакрываемыеСчета),
	|			,
	|			Организация = &Организация) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ИФО,
	|	Остатки.КФО,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА ЗакрываемыеСчета.Счет40130
	|		ИНАЧЕ Остатки.Счет
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА ЗакрываемыеСчета.КПС40130
	|		ИНАЧЕ Остатки.КПС
	|	КОНЕЦ КАК КПСДт,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА ЗакрываемыеСчета.КЭК40130
	|		ИНАЧЕ Остатки.КЭК
	|	КОНЕЦ КАК КЭКДт,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Подразделение
	|	КОНЕЦ КАК ПодразделениеДт,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Субконто1
	|	КОНЕЦ КАК СубконтоДт1,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Субконто2
	|	КОНЕЦ КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Субконто3
	|	КОНЕЦ КАК СубконтоДт3,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСчетов.ДтКт
	|			ТОГДА ЗакрываемыеСчета.Счет40130
	|		ИНАЧЕ Остатки.Счет
	|	КОНЕЦ КАК СчетКт,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСчетов.ДтКт
	|			ТОГДА ЗакрываемыеСчета.КПС40130
	|		ИНАЧЕ Остатки.КПС
	|	КОНЕЦ КАК КПСКт,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСчетов.ДтКт
	|			ТОГДА ЗакрываемыеСчета.КЭК40130
	|		ИНАЧЕ Остатки.КЭК
	|	КОНЕЦ КАК КЭККт,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Подразделение
	|	КОНЕЦ КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Субконто1
	|	КОНЕЦ КАК СубконтоКт1,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Субконто2
	|	КОНЕЦ КАК СубконтоКт2,
	|	ВЫБОР
	|		КОГДА НЕ ТаблицаСчетов.ДтКт
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Остатки.Субконто3
	|	КОНЕЦ КАК СубконтоКт3,
	|	ВЫБОР
	|		КОГДА ТаблицаСчетов.ДтКт
	|			ТОГДА Остатки.СуммаОстатокДт
	|		ИНАЧЕ Остатки.СуммаОстатокКт
	|	КОНЕЦ КАК Сумма,
	|	ТаблицаСчетов.ДтКт
	|ПОМЕСТИТЬ Проводки
	|ИЗ
	|	Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакрываемыеСчета КАК ЗакрываемыеСчета
	|		ПО Остатки.Счет = ЗакрываемыеСчета.Счет
	|			И Остатки.ИФО = ЗакрываемыеСчета.ИФО
	|			И Остатки.КФО = ЗакрываемыеСчета.КФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетов КАК ТаблицаСчетов
	|		ПО Остатки.Счет = ТаблицаСчетов.Счет
	|ГДЕ
	|	ЗакрываемыеСчета.Счет40130 ЕСТЬ НЕ NULL 
	|	И ЗакрываемыеСчета.Счет40130 <> ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Дата КАК Период,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Журналы.ПустаяСсылка) КАК ЖурналОпераций,
	|	ВЫБОР
	|		КОГДА Проводки.ДтКт
	|			ТОГДА СпрКПСКт.Код
	|		ИНАЧЕ СпрКПСДт.Код
	|	КОНЕЦ КАК ПредставлениеКПС,
	|	ПРЕДСТАВЛЕНИЕ(Проводки.КФО) КАК ПредставлениеКФО,
	|	ВЫБОР
	|		КОГДА Проводки.ДтКт
	|			ТОГДА ЕПСБУКт.Код
	|		ИНАЧЕ ЕПСБУДт.Код
	|	КОНЕЦ КАК ПредставлениеСчета,
	|	ВЫБОР
	|		КОГДА Проводки.ДтКт
	|			ТОГДА СпрКЭККт.Код
	|		ИНАЧЕ СпрКЭКДт.Код
	|	КОНЕЦ КАК ПредставлениеКЭК,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(250)) КАК Содержание,
	|	&ВидДокумента КАК ВидПервичногоДокумента,
	|	&Дата КАК ДатаПервичногоДокумента,
	|	&Номер КАК НомерПервичногоДокумента,
	|	Проводки.ИФО,
	|	Проводки.КФО,
	|	Проводки.СчетДт,
	|	Проводки.КПСДт,
	|	Проводки.КЭКДт,
	|	Проводки.ПодразделениеДт,
	|	Проводки.СубконтоДт1,
	|	Проводки.СубконтоДт2,
	|	Проводки.СубконтоДт3,
	|	Проводки.СчетКт,
	|	Проводки.КПСКт,
	|	Проводки.КЭККт,
	|	Проводки.ПодразделениеКт,
	|	Проводки.СубконтоКт1,
	|	Проводки.СубконтоКт2,
	|	Проводки.СубконтоКт3,
	|	Проводки.Сумма,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт1.ВидСубконто, 
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) КАК ВидСубконтоДт1,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт2.ВидСубконто, 
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) КАК ВидСубконтоДт2,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоДт3.ВидСубконто, 
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) КАК ВидСубконтоДт3,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт1.ВидСубконто, 
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) КАК ВидСубконтоКт1,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт2.ВидСубконто, 
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) КАК ВидСубконтоКт2,
	|	ЕСТЬNULL(ЕПСБУВидыСубконтоКт3.ВидСубконто, 
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)) КАК ВидСубконтоКт3,
	|	0 КАК КоличествоДт,
	|	0 КАК КоличествоКт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаДт,
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК ВалютнаяСуммаКт,
	|	ИСТИНА КАК Активность
	|ИЗ
	|	Проводки КАК Проводки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоДт1
	|		ПО Проводки.СчетДт = ЕПСБУВидыСубконтоДт1.Ссылка
	|			И (ЕПСБУВидыСубконтоДт1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоДт2
	|		ПО Проводки.СчетДт = ЕПСБУВидыСубконтоДт2.Ссылка
	|			И (ЕПСБУВидыСубконтоДт2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоДт3
	|		ПО Проводки.СчетДт = ЕПСБУВидыСубконтоДт3.Ссылка
	|			И (ЕПСБУВидыСубконтоДт3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоКт1
	|		ПО Проводки.СчетКт = ЕПСБУВидыСубконтоКт1.Ссылка
	|			И (ЕПСБУВидыСубконтоКт1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоКт2
	|		ПО (ЕПСБУВидыСубконтоКт2.НомерСтроки = 2)
	|			И Проводки.СчетКт = ЕПСБУВидыСубконтоКт2.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконтоКт3
	|		ПО Проводки.СчетКт = ЕПСБУВидыСубконтоКт3.Ссылка
	|			И (ЕПСБУВидыСубконтоКт3.НомерСтроки = 3)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУДт
	|		ПО Проводки.СчетДт = ЕПСБУДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ КАК ЕПСБУКт
	|		ПО Проводки.СчетКт = ЕПСБУКт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК СпрКПСДт
	|		ПО Проводки.КПСДт = СпрКПСДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификационныеПризнакиСчетов КАК СпрКПСКт
	|		ПО Проводки.КПСКт = СпрКПСКт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК СпрКЭКДт
	|		ПО Проводки.КЭКДт = СпрКЭКДт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КОСГУ КАК СпрКЭККт
	|		ПО Проводки.КЭККт = СпрКЭККт.Ссылка";
				   
	ТаблицаПроводок = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ТекПроводка Из ТаблицаПроводок Цикл
		
		СтрокаРезультата = ТаблицаРезультат.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаРезультата, ТекПроводка );
	
		СтрокаРезультата.Содержание = "Закрытие счета " 
								+ ТекПроводка.ПредставлениеКПС + "."
								+ ТекПроводка.ПредставлениеКФО + "."
								+ ТекПроводка.ПредставлениеСчета + "."
								+ ТекПроводка.ПредставлениеКЭК;
								
	КонецЦикла; 
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область УчетИностраннойВалюты

Функция ТаблицаКурсовыхРазницПоКФО(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));

	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КурсоваяРазница", ОписаниеТипаСуммы);

	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет") Тогда
		Возврат ТаблицаРезультат;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", РеквизитыДокумента.Ссылка);
	
	КурсоваяРазницаПоДокументу = 0;
	
	МетаданныеДокумента = Реквизиты.Ссылка.Метаданные();
	
	Если МетаданныеДокумента.Имя = "ПоручениеНаПокупкуВалюты" Тогда
		
		Если РеквизитыДокумента.ВидПоручения = 0 Тогда
			КурсоваяРазницаПоДокументу = РеквизитыДокумента.СуммаДокумента - РеквизитыДокумента.СуммаРублейДляПокупкиВалюты;
		ИначеЕсли РеквизитыДокумента.ВидПоручения = 1 Тогда
			КурсоваяРазницаПоДокументу = РеквизитыДокумента.СуммаДокумента - РеквизитыДокумента.КурсПокупки * РеквизитыДокумента.СуммаДокументаВВалюте;
		КонецЕсли;
		
		ПолеКоэффициент = "СуммаВал";
		ПолеРаспределяемаяСумма = "СуммаДокументаВВалюте";
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПоручениеНаПродажуВалюты" Тогда
		
		КурсоваяРазницаПоДокументу = РеквизитыДокумента.СуммаРублейКЗачислению - РеквизитыДокумента.СуммаДокумента;
		
		ПолеКоэффициент = "СуммаВал";
		ПолеРаспределяемаяСумма = "СуммаДокументаВВалюте";
		
	ИначеЕсли МетаданныеДокумента.Имя = "КассовоеВыбытие" Тогда
		
		ВалютаИТипЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ЛицевойСчет, "ВалютаСчета, ТипЛицевогоСчета");
		ВалютаЛицевогоСчета = ВалютаИТипЛицевогоСчета.ВалютаСчета;
		ТипЛицевогоСчета = ВалютаИТипЛицевогоСчета.ТипЛицевогоСчета;
		Если ЗначениеЗаполнено(ВалютаЛицевогоСчета)
			И РеквизитыДокумента.ВалютаДокумента <> ВалютаЛицевогоСчета
			И ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский")
			И БухгалтерскийУчет.СчетВИерархии(РеквизитыДокумента.КорСчет, "206.00, 208.00, 302.00") Тогда
			
			КурсоваяРазницаПоДокументу = РеквизитыДокумента.СуммаДокумента
				- РеквизитыДокумента.СуммаПроданнойВалюты * РеквизитыДокумента.КурсПроданнойВалюты / ?(РеквизитыДокумента.КратностьПроданнойВалюты = 0, 1, РеквизитыДокумента.КратностьПроданнойВалюты);
			
		Иначе
			Возврат ТаблицаРезультат;
		КонецЕсли;
		
		ПолеКоэффициент = "СуммаВал";
		ПолеРаспределяемаяСумма = "СуммаДокументаВВалюте";
		
	ИначеЕсли МетаданныеДокумента.Имя = "КассовоеПоступление" Тогда
		
		ВалютаИТипЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ЛицевойСчет, "ВалютаСчета, ТипЛицевогоСчета");
		ВалютаЛицевогоСчета = ВалютаИТипЛицевогоСчета.ВалютаСчета;
		ТипЛицевогоСчета = ВалютаИТипЛицевогоСчета.ТипЛицевогоСчета;
		Если ЗначениеЗаполнено(ВалютаЛицевогоСчета)
			И РеквизитыДокумента.ВалютаДокумента <> ВалютаЛицевогоСчета
			И ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский")
			И РеквизитыДокумента.КорСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка() Тогда
			
			КурсоваяРазницаПоДокументу = РеквизитыДокумента.СуммаКупленнойВалюты * РеквизитыДокумента.КурсКупленнойВалюты / ?(РеквизитыДокумента.КратностьКупленнойВалюты = 0, 1, РеквизитыДокумента.КратностьКупленнойВалюты)
				- РеквизитыДокумента.СуммаДокумента;
			
		Иначе
			Возврат ТаблицаРезультат;
		КонецЕсли;
		
		ПолеКоэффициент = "СуммаВал";
		ПолеРаспределяемаяСумма = "СуммаДокументаВВалюте";  
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПоступлениеНаСчет" Тогда
		
		ВалютаИТипЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ЛицевойСчет, "ВалютаСчета, ТипЛицевогоСчета");
		ВалютаЛицевогоСчета = ВалютаИТипЛицевогоСчета.ВалютаСчета;
		ТипЛицевогоСчета = ВалютаИТипЛицевогоСчета.ТипЛицевогоСчета;
		Если ЗначениеЗаполнено(ВалютаЛицевогоСчета)
			И РеквизитыДокумента.ВалютаДокумента <> ВалютаЛицевогоСчета
			И ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский")
			И РеквизитыДокумента.КорСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка() Тогда
			
			КурсоваяРазницаПоДокументу = РеквизитыДокумента.СуммаКупленнойВалюты * РеквизитыДокумента.КурсКупленнойВалюты / ?(РеквизитыДокумента.КратностьКупленнойВалюты = 0, 1, РеквизитыДокумента.КратностьКупленнойВалюты)
				- РеквизитыДокумента.СуммаДокумента;
			
		Иначе
			Возврат ТаблицаРезультат;
		КонецЕсли;
		
		ПолеКоэффициент = "СуммаВал";
		ПолеРаспределяемаяСумма = "СуммаДокументаВВалюте";
		
	ИначеЕсли МетаданныеДокумента.Имя = "ПриходныйКассовыйОрдер" Тогда
		
		Если ЗначениеЗаполнено(РеквизитыДокумента.ВалютаДокумента)
			И ЗначениеЗаполнено(РеквизитыДокумента.ПроданнаяВалюта)
			И НЕ РеквизитыДокумента.ВалютаДокумента = РеквизитыДокумента.ПроданнаяВалюта
			И БухгалтерскийУчет.СчетВИерархии(РеквизитыДокумента.КорСчет, "201.20") Тогда
			
			КурсоваяРазницаПоДокументу = РеквизитыДокумента.СуммаДокумента * РеквизитыДокумента.Курс / ?(РеквизитыДокумента.Кратность = 0, 1, РеквизитыДокумента.Кратность)
				- РеквизитыДокумента.СуммаПроданнойВалюты * РеквизитыДокумента.КурсПроданнойВалюты / ?(РеквизитыДокумента.КратностьПроданнойВалюты = 0, 1, РеквизитыДокумента.КратностьПроданнойВалюты);
			
		Иначе
			Возврат ТаблицаРезультат;
		КонецЕсли;
		
		ПолеКоэффициент = "Сумма";
		ПолеРаспределяемаяСумма = "СуммаДокумента";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ОбщегоНазначенияБГУ.ПоместитьТабЧастьВВиртуальнуюТаблицу(
		Запрос,
		"РасшифровкаПлатежа",
		"КФО,Подразделение,"+ПолеКоэффициент,
		Реквизиты.Ссылка,
		Реквизиты);
	
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	РасшифровкаПлатежа.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежа.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА &Подразделение
	|		ИНАЧЕ РасшифровкаПлатежа.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	СУММА(РасшифровкаПлатежа."+ПолеКоэффициент+") КАК СуммаВал
	|ИЗ
	|	ТаблицаРасшифровкаПлатежа КАК РасшифровкаПлатежа
	|
	|СГРУППИРОВАТЬ ПО
	|	РасшифровкаПлатежа.КФО,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежа.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА &Подразделение
	|		ИНАЧЕ РасшифровкаПлатежа.Подразделение
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Подразделение", РеквизитыДокумента.Подразделение);
	
	ТаблицаПоДокументу = Запрос.Выполнить().Выгрузить();
	
	СуммаДокументаВВалюте = РеквизитыДокумента[ПолеРаспределяемаяСумма];
	
	Если ТаблицаПоДокументу.Количество() = 1 Тогда
		СтрокаРезультата = ТаблицаРезультат.Добавить();
		СтрокаРезультата.КФО = ТаблицаПоДокументу[0].КФО;
		СтрокаРезультата.Подразделение = ТаблицаПоДокументу[0].Подразделение;
		СтрокаРезультата.КурсоваяРазница = КурсоваяРазницаПоДокументу;
	ИначеЕсли ТаблицаПоДокументу.Количество() > 1 Тогда
		КурсоваяРазницаПоСтрокам = 0;
		Для Каждого СтрокаКФО Из ТаблицаПоДокументу Цикл
			СтрокаРезультата = ТаблицаРезультат.Добавить();
			СтрокаРезультата.КФО = СтрокаКФО.КФО;
			СтрокаРезультата.Подразделение = СтрокаКФО.Подразделение;
			СтрокаРезультата.КурсоваяРазница = КурсоваяРазницаПоДокументу*СтрокаКФО.СуммаВал/СуммаДокументаВВалюте;
			КурсоваяРазницаПоСтрокам = КурсоваяРазницаПоСтрокам + СтрокаРезультата.КурсоваяРазница;
		КонецЦикла;
		Если КурсоваяРазницаПоДокументу <> КурсоваяРазницаПоСтрокам Тогда
			// корректируем курсовую разницу в последней строке
			СтрокаРезультата.КурсоваяРазница = СтрокаРезультата.КурсоваяРазница + КурсоваяРазницаПоДокументу - КурсоваяРазницаПоСтрокам;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПоступлениеНаличныхСБанковскогоСчета_ПКО(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ПроданнаяВалюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаПроданнойВалюты", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаРуб", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	
	Для Каждого Колонка Из Метаданные.Документы.ПриходныйКассовыйОрдер.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РасшифровкаПлатежа = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "РасшифровкаПлатежа", Истина);
	
	КоэффициентыРаспределения = РасшифровкаПлатежа.ВыгрузитьКолонку("Сумма");
	СуммыПроданнойВалюты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
		РеквизитыДокумента.СуммаПроданнойВалюты, КоэффициентыРаспределения);
	КурсПересчета = РеквизитыДокумента.Курс / ?(РеквизитыДокумента.Кратность = 0, 1, РеквизитыДокумента.Кратность);
	РублевыеЭквиваленты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
		РеквизитыДокумента.СуммаДокумента * КурсПересчета, КоэффициентыРаспределения);
	
	Если ЗначениеЗаполнено(РеквизитыДокумента.ВалютаДокумента)
		И ЗначениеЗаполнено(РеквизитыДокумента.ПроданнаяВалюта)
		И НЕ РеквизитыДокумента.ВалютаДокумента = РеквизитыДокумента.ПроданнаяВалюта
		И БухгалтерскийУчет.СчетВИерархии(РеквизитыДокумента.КорСчет, "201.20") Тогда
		ЕстьКонвертацияВалюты = Истина;
	Иначе
		ЕстьКонвертацияВалюты = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасшифровкаПлатежа);
		НоваяСтрока.ИмяСписка = "РасшифровкаПлатежа";
		НоваяСтрока.СинонимСписка = "Расшифровка платежа";
		НоваяСтрока.СуммаРуб = РублевыеЭквиваленты.Получить(СтрокаРасшифровкаПлатежа.НомерСтроки - 1);
		Если ЕстьКонвертацияВалюты И СуммыПроданнойВалюты <> Неопределено Тогда
			НоваяСтрока.ПроданнаяВалюта = РеквизитыДокумента.ПроданнаяВалюта;
			НоваяСтрока.СуммаПроданнойВалюты = СуммыПроданнойВалюты.Получить(СтрокаРасшифровкаПлатежа.НомерСтроки - 1);
		Иначе
			НоваяСтрока.ПроданнаяВалюта = РеквизитыДокумента.ВалютаДокумента;
			НоваяСтрока.СуммаПроданнойВалюты = СтрокаРасшифровкаПлатежа.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция РасшифровкаПлатежаСРублевымЭквивалентом_РКО(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаРуб", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	
	Для Каждого Колонка Из Метаданные.Документы.РасходныйКассовыйОрдер.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РасшифровкаПлатежа = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "РасшифровкаПлатежа", Истина);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	
	КоэффициентыРаспределения = РасшифровкаПлатежа.ВыгрузитьКолонку("Сумма");
	КурсПересчета = КонтекстПроведения.Курс / ?(КонтекстПроведения.Кратность = 0, 1, КонтекстПроведения.Кратность);
	РублевыеЭквиваленты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(
		РеквизитыДокумента.СуммаДокумента * КурсПересчета, КоэффициентыРаспределения);
	
	Для Каждого СтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасшифровкаПлатежа);
		НоваяСтрока.ИмяСписка = "РасшифровкаПлатежа";
		НоваяСтрока.СинонимСписка = "Расшифровка платежа";
		НоваяСтрока.СуммаРуб = РублевыеЭквиваленты.Получить(СтрокаРасшифровкаПлатежа.НомерСтроки - 1);
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция РасшифровкаПлатежаСРублевымЭквивалентом_ЗКР(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	Для Каждого Колонка Из Метаданные.Документы.ЗаявкаНаКассовыйРасход.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РасшифровкаПлатежа = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "РасшифровкаПлатежа", Истина);
	
	Если РеквизитыДокумента.ВалютаДокумента <> БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета()
		И (НЕ ЗначениеЗаполнено(РеквизитыДокумента.Договор)
			ИЛИ НЕ РаботаСОбязательствами.СведенияОВалютеОбязательства(РеквизитыДокумента.Договор).ОплатаВРублях) Тогда
		
		КурсПересчета = ПлатежноРасчетныеДокументы.ПолучитьСостояниеЗаявки(РеквизитыДокумента.Ссылка).Курс;
		ОбщегоНазначенияБГУ.РаспределитьСуммуПоКолонкеТаблицы(
			РеквизитыДокумента.СуммаДокументаВВалюте * КурсПересчета, РасшифровкаПлатежа, "Сумма", "СуммаВал");
		
		Если КурсПересчета = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Курс иностранной валюты выписки не заполнен, проводки будут сформированы с нулевой суммой!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, РеквизитыДокумента.Ссылка, , "Объект");
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасшифровкаПлатежа);
		НоваяСтрока.ИмяСписка = "РасшифровкаПлатежа";
		НоваяСтрока.СинонимСписка = "Расшифровка платежа";
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПоступлениеСредствСоСчета20123_КассовоеПоступление(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КупленнаяВалюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаКупленнойВалюты", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	
	Для Каждого Колонка Из Метаданные.Документы.КассовоеПоступление.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РасшифровкаПлатежа = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "РасшифровкаПлатежа", Истина);
	
	КоэффициентыРаспределения = РасшифровкаПлатежа.ВыгрузитьКолонку("СуммаВал");
	СуммаКупленнойВалюты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(РеквизитыДокумента.СуммаКупленнойВалюты, КоэффициентыРаспределения);
	
	ВалютаИТипЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ЛицевойСчет, "ВалютаСчета, ТипЛицевогоСчета");
	ВалютаЛицевогоСчета = ВалютаИТипЛицевогоСчета.ВалютаСчета;
	ТипЛицевогоСчета = ВалютаИТипЛицевогоСчета.ТипЛицевогоСчета;
	
	Если ЗначениеЗаполнено(РеквизитыДокумента.ВалютаДокумента)
		И ЗначениеЗаполнено(ВалютаЛицевогоСчета)
		И НЕ РеквизитыДокумента.ВалютаДокумента = ВалютаЛицевогоСчета
		И ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский")
		И РеквизитыДокумента.КорСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка() Тогда
		ЕстьКонвертацияВалюты = Истина;
	Иначе
		ЕстьКонвертацияВалюты = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасшифровкаПлатежа);
		НоваяСтрока.ИмяСписка = "РасшифровкаПлатежа";
		НоваяСтрока.СинонимСписка = "Расшифровка платежа";
		Если ЕстьКонвертацияВалюты И СуммаКупленнойВалюты <> Неопределено Тогда
			НоваяСтрока.КупленнаяВалюта = ВалютаЛицевогоСчета;
			НоваяСтрока.СуммаКупленнойВалюты = СуммаКупленнойВалюты.Получить(СтрокаРасшифровкаПлатежа.НомерСтроки - 1);
		Иначе
			НоваяСтрока.КупленнаяВалюта = РеквизитыДокумента.ВалютаДокумента;
			НоваяСтрока.СуммаКупленнойВалюты = СтрокаРасшифровкаПлатежа.СуммаВал;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПеречислениеПодотчетнымЛицам_КассовоеВыбытие(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ПроданнаяВалюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаПроданнойВалюты", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	
	Для Каждого Колонка Из Метаданные.Документы.КассовоеВыбытие.ТабличныеЧасти.РасшифровкаПлатежа.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РасшифровкаПлатежа = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "РасшифровкаПлатежа", Истина);
	
	КоэффициентыРаспределения = РасшифровкаПлатежа.ВыгрузитьКолонку("СуммаВал");
	СуммаПроданнойВалюты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(РеквизитыДокумента.СуммаПроданнойВалюты, КоэффициентыРаспределения);
	
	ВалютаИТипЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ЛицевойСчет, "ВалютаСчета, ТипЛицевогоСчета");
	ВалютаЛицевогоСчета = ВалютаИТипЛицевогоСчета.ВалютаСчета;
	ТипЛицевогоСчета = ВалютаИТипЛицевогоСчета.ТипЛицевогоСчета;
	
	Если ЗначениеЗаполнено(РеквизитыДокумента.ВалютаДокумента)
		И ЗначениеЗаполнено(ВалютаЛицевогоСчета)
		И НЕ РеквизитыДокумента.ВалютаДокумента = ВалютаЛицевогоСчета
		И ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский")
		И БухгалтерскийУчет.СчетВИерархии(РеквизитыДокумента.КорСчет, "208.00") Тогда
		ЕстьКонвертацияВалюты = Истина;
	Иначе
		ЕстьКонвертацияВалюты = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасшифровкаПлатежа);
		НоваяСтрока.ИмяСписка = "РасшифровкаПлатежа";
		НоваяСтрока.СинонимСписка = "Расшифровка платежа";
		Если ЕстьКонвертацияВалюты И СуммаПроданнойВалюты <> Неопределено Тогда
			НоваяСтрока.ПроданнаяВалюта = ВалютаЛицевогоСчета;
			НоваяСтрока.СуммаПроданнойВалюты = СуммаПроданнойВалюты.Получить(СтрокаРасшифровкаПлатежа.НомерСтроки - 1);
		Иначе
			НоваяСтрока.ПроданнаяВалюта = РеквизитыДокумента.ВалютаДокумента;
			НоваяСтрока.СуммаПроданнойВалюты = СтрокаРасшифровкаПлатежа.СуммаВал;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ПоступлениеСредствСоСчета20123_ПоступлениеНаСчет(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ИмяСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КупленнаяВалюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СуммаКупленнойВалюты", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	
	Для Каждого Колонка Из Метаданные.Документы.ПоступлениеНаСчет.ТабличныеЧасти.ДетализацияПлатежа.Реквизиты Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.Тип);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РасшифровкаПлатежа = ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, "ДетализацияПлатежа", Истина);
	
	КоэффициентыРаспределения = РасшифровкаПлатежа.ВыгрузитьКолонку("СуммаВал");
	СуммаКупленнойВалюты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(РеквизитыДокумента.СуммаКупленнойВалюты, КоэффициентыРаспределения);
	
	ВалютаИТипЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыДокумента.ЛицевойСчет, "ВалютаСчета, ТипЛицевогоСчета");
	ВалютаЛицевогоСчета = ВалютаИТипЛицевогоСчета.ВалютаСчета;
	ТипЛицевогоСчета = ВалютаИТипЛицевогоСчета.ТипЛицевогоСчета;
	
	Если ЗначениеЗаполнено(РеквизитыДокумента.ВалютаДокумента)
		И ЗначениеЗаполнено(ВалютаЛицевогоСчета)
		И НЕ РеквизитыДокумента.ВалютаДокумента = ВалютаЛицевогоСчета
		И ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский")
		И РеквизитыДокумента.КорСчет = ПланыСчетов.ЕПСБУ.ПустаяСсылка() Тогда
		ЕстьКонвертацияВалюты = Истина;
	Иначе
		ЕстьКонвертацияВалюты = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРасшифровкаПлатежа Из РасшифровкаПлатежа Цикл
		НоваяСтрока = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасшифровкаПлатежа);
		НоваяСтрока.ИмяСписка = "РасшифровкаПлатежа";
		НоваяСтрока.СинонимСписка = "Расшифровка платежа";
		Если ЕстьКонвертацияВалюты И СуммаКупленнойВалюты <> Неопределено Тогда
			НоваяСтрока.КупленнаяВалюта = ВалютаЛицевогоСчета;
			НоваяСтрока.СуммаКупленнойВалюты = СуммаКупленнойВалюты.Получить(СтрокаРасшифровкаПлатежа.НомерСтроки - 1);
		Иначе
			НоваяСтрока.КупленнаяВалюта = РеквизитыДокумента.ВалютаДокумента;
			НоваяСтрока.СуммаКупленнойВалюты = СтрокаРасшифровкаПлатежа.СуммаВал;
		КонецЕсли; 
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область КурсовыеРазницыНУ

// Отражение курсовых разниц в НУ при регламентной переоценке валютных остатков
// - во внереализационных доходах (расходах) налогового учета (Н91);
// - на счетах налогового учета отложенных (до момента погашения задолженности) курсовых разниц (Н92).
//
Функция ПереоценкаВалютныхОстатковНУ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПереоценкаВалютныхОстатковНУ = НалоговыйУчет.ПустаяТаблицаПереоценкаВалютныхОстатковНУ();
	Для Каждого Колонка Из ТаблицаПереоценкаВалютныхОстатковНУ.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаПереоценкаВалютныхОстатковНУ = НалоговыйУчет.ТаблицаПереоценкаВалютныхОстатковНУ(
		ИсточникиДанных.ДокументОбъект);
	
	Возврат ТаблицаПереоценкаВалютныхОстатковНУ;
	
КонецФункции

// Отражение отложенных курсовых разниц НУ во внереализационных доходах (расходах) при погашении задолженности
// документами движения денежных средств.
//
Функция ОтражениеОтложенныхКурсовыхРазницНУ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОтложенныхКурсовыхРазницНУ = НалоговыйУчет.ПустаяТаблицаОтложенныхКурсовыхРазницНУ();
	Для Каждого Колонка Из ТаблицаОтложенныхКурсовыхРазницНУ.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	Реквизиты.Вставить("КорСчет",         ДокументОбъект.КорСчет);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаРасчетовСПогашениемЗадолженности") Тогда
		ТаблицаОтложенныхКурсовыхРазницНУ = НалоговыйУчет.ТаблицаОтложенныхКурсовыхРазницНУПриПогашенииЗадолженности(
			ДополнительныеСвойства.ТаблицаРасчетовСПогашениемЗадолженности,
			Реквизиты,
			Отказ);
	ИначеЕсли ДополнительныеСвойства.Свойство("РасшифровкаПлатежаУнифицированная") Тогда
		ТаблицаОтложенныхКурсовыхРазницНУ = НалоговыйУчет.ТаблицаОтложенныхКурсовыхРазницНУПоРасшифровкеПлатежа(
			ДополнительныеСвойства.РасшифровкаПлатежаУнифицированная,
			Реквизиты,
			Отказ);
	Иначе // Нет подходящих рассчитанных таблиц.
		
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
		Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
		РасшифровкаПлатежаУнифицированная = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
			ДокументОбъект, Реквизиты, Отказ);
		
		ТаблицаОтложенныхКурсовыхРазницНУ = НалоговыйУчет.ТаблицаОтложенныхКурсовыхРазницНУПоРасшифровкеПлатежа(
			РасшифровкаПлатежаУнифицированная,
			Реквизиты,
			Отказ);
		
	КонецЕсли;
	
	Возврат ТаблицаОтложенныхКурсовыхРазницНУ;
	
КонецФункции

#КонецОбласти

#Область КонтрольИсполненияДоговоров

Функция ОплатаПоставщикамКредиторам(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции,
			"СчетРасчетов", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплатаПоставщикамКредиторам = КонтрольИсполненияДоговоров.ПустаяТаблицаОплатаПоставщикамКредиторам();
	Для Каждого Колонка Из ТаблицаОплатаПоставщикамКредиторам.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("РасшифровкаПлатежаУнифицированная") Тогда
		
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
		Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
		
		РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
			ДокументОбъект, Реквизиты, Отказ);
		ДополнительныеСвойства.Вставить("РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа);
		
	КонецЕсли;
	
	ТаблицаОплатаПоставщикамКредиторам = КонтрольИсполненияДоговоров.ТаблицаОплатаПоставщикамКредиторам(
		ДополнительныеСвойства.РасшифровкаПлатежаУнифицированная,
		ДокументОбъект,
		Реквизиты,
		Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаОплатаПоставщикамКредиторам", ТаблицаОплатаПоставщикамКредиторам.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаОплатаПоставщикамКредиторам;
	
КонецФункции

Функция ОплатаОтПокупателейДебиторов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции,
			"СчетРасчетов", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаОплатаОтПокупателейДебиторов = КонтрольИсполненияДоговоров.ПустаяТаблицаОплатаОтПокупателейДебиторов();
	Для Каждого Колонка Из ТаблицаОплатаОтПокупателейДебиторов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("РасшифровкаПлатежаУнифицированная") Тогда
		
		Если МетаданныеДокумента.Имя = "ПереносОплатыОбразование" Тогда
			
			РасшифровкаПлатежа = Документы.ПереносОплатыОбразование.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
				ДокументОбъект, Реквизиты, Отказ);
			ДополнительныеСвойства.Вставить("РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа);
			
		ИначеЕсли МетаданныеДокумента.Имя = "ПереносОплатыОтПокупателей" Тогда
			
			РасшифровкаПлатежа = Документы.ПереносОплатыОтПокупателей.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
				ДокументОбъект, Реквизиты, Отказ);
			ДополнительныеСвойства.Вставить("РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа);
			
		Иначе
			
			КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
			Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
			Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
			
			РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
				ДокументОбъект, Реквизиты, Отказ);
			ДополнительныеСвойства.Вставить("РасшифровкаПлатежаУнифицированная", РасшифровкаПлатежа);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаОплатаОтПокупателейДебиторов = КонтрольИсполненияДоговоров.ТаблицаОплатаОтПокупателейДебиторов(
		ДополнительныеСвойства.РасшифровкаПлатежаУнифицированная,
		ДокументОбъект,
		Реквизиты,
		Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаОплатаОтПокупателейДебиторов", ТаблицаОплатаОтПокупателейДебиторов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаОплатаОтПокупателейДебиторов;
	
КонецФункции

Функция ИсполнениеОбязательствПоставщиками(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции,
			"СчетРасчетов", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции,
			"КПСРасчетов", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаИсполнениеОбязательствПоставщиками = КонтрольИсполненияДоговоров.ПустаяТаблицаИсполнениеОбязательствПоставщиками();
	Для Каждого Колонка Из ТаблицаИсполнениеОбязательствПоставщиками.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	// Поступление расходов будем отражать для всех таблиц поступления (материалов, тары, услуг и пр.),
	// которые сформированы к текущему моменту.
	ТаблицыПоступления = Новый Структура;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеМатериальныхЗапасов") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаПоступлениеМатериальныхЗапасов);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаВозвратМатериальныхЗапасовПоставщику") Тогда
		ТаблицыПоступления.Вставить("ВозвратМатериальныхЗапасовПоставщику", ДополнительныеСвойства.ТаблицаВозвратМатериальныхЗапасовПоставщику);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеУслугРабот") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеУслугРабот", ДополнительныеСвойства.ТаблицаПоступлениеУслугРабот);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеДопРасходов") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеДопРасходов", ДополнительныеСвойства.ТаблицаПоступлениеДопРасходов);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаВложенияВоВнеоборотныеАктивы") Тогда
		ТаблицыПоступления.Вставить("ВложенияВоВнеоборотныеАктивы", ДополнительныеСвойства.ТаблицаВложенияВоВнеоборотныеАктивы);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаПоступлениеОсновныхСредств") Тогда
		ТаблицыПоступления.Вставить("ПоступлениеОсновныхСредств", ДополнительныеСвойства.ТаблицаПоступлениеОсновныхСредств);
	КонецЕсли;
	
	ТаблицаИсполнениеОбязательствПоставщиками = КонтрольИсполненияДоговоров.ТаблицаИсполнениеОбязательствПоставщиками(
		ТаблицыПоступления,
		ДокументОбъект,
		Реквизиты,
		Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаИсполнениеОбязательствПоставщиками", ТаблицаИсполнениеОбязательствПоставщиками.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаИсполнениеОбязательствПоставщиками;
	
КонецФункции

Функция ИсполнениеДоговоровСПокупателями(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаИсполнениеДоговоровСПокупателями = КонтрольИсполненияДоговоров.ПустаяТаблицаИсполнениеДоговоровСПокупателями();
	Для Каждого Колонка Из ТаблицаИсполнениеДоговоровСПокупателями.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	// Исполнение договоров с покупателями будем отражать для всех таблиц реализации (товаров, услуг и пр.),
	// которые сформированы к текущему моменту.
	ТаблицыРеализации = Новый Структура;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаРеализацияМатериальныхЗапасов") Тогда
		ТаблицыРеализации.Вставить("РеализацияМатериальныхЗапасов", ДополнительныеСвойства.ТаблицаРеализацияМатериальныхЗапасов);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаРеализацияОсновныхСредств") Тогда
		ТаблицыРеализации.Вставить("РеализацияОсновныхСредств", ДополнительныеСвойства.ТаблицаРеализацияОсновныхСредств);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаРеализацияУслугРабот") Тогда
		ТаблицыРеализации.Вставить("РеализацияУслугРабот", ДополнительныеСвойства.ТаблицаРеализацияУслугРабот);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицаРеализацияФинансовыхАктивов") Тогда
		ТаблицыРеализации.Вставить("РеализацияФинансовыхАктивов", ДополнительныеСвойства.ТаблицаРеализацияФинансовыхАктивов);
	КонецЕсли;
	
	ТаблицаИсполнениеДоговоровСПокупателями = КонтрольИсполненияДоговоров.ТаблицаИсполнениеДоговоровСПокупателями(
		ТаблицыРеализации,
		ДокументОбъект,
		Реквизиты,
		Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаИсполнениеДоговоровСПокупателями", ТаблицаИсполнениеДоговоровСПокупателями.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаИсполнениеДоговоровСПокупателями;
	
КонецФункции

Функция ПланОплатПоФактуПоступленияРеализации(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВидРасчетов", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыРасчетовПоЗаймам"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаПланОплатПоФактуПоступленияРеализации = КонтрольИсполненияДоговоров.ПустаяТаблицаПланОплатПоФактуПоступленияРеализации();
	Для Каждого Колонка Из ТаблицаПланОплатПоФактуПоступленияРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов") Тогда
		ВызватьИсключение "Не обнаружены данные расчетов с контрагентами.
			|Для формирования таблицы планируемых оплат используется таблица расчетов с контрагентами,
			|подготовленная функцией УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов.";
	КонецЕсли;
	
	ТаблицаПланОплатПоФактуПоступленияРеализации = КонтрольИсполненияДоговоров.ТаблицаПланОплатПоФактуПоступленияРеализации(
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		ДокументОбъект,
		Реквизиты,
		Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаПланОплатПоФактуПоступленияРеализации", ТаблицаПланОплатПоФактуПоступленияРеализации.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПланОплатПоФактуПоступленияРеализации;
	
КонецФункции

Функция ДатаИсполненияПриПоступленииСредствВР(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ДатаИсполнения", Новый ОписаниеТипов("Дата"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС30401", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаДатаИсполненияПриПоступленииСредствВР = КонтрольИсполненияДоговоров.ПустаяТаблицаДатаИсполненияПриПоступленииСредствВР();
	Для Каждого Колонка Из ТаблицаДатаИсполненияПриПоступленииСредствВР.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	Реквизиты.Вставить("СчетРасчетов", БухгалтерскийУчет.СчетПоКоду("304.01", ДокументОбъект.Дата, ДокументОбъект.Организация));
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(ДокументОбъект, Реквизиты, Отказ);
	
	ТаблицаДатаИсполненияПриПоступленииСредствВР = КонтрольИсполненияДоговоров.ТаблицаДатаИсполненияПриПоступленииСредствВР(
		РасшифровкаПлатежа,
		ДокументОбъект,
		Реквизиты,
		Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаДатаИсполненияПриПоступленииСредствВР", ТаблицаДатаИсполненияПриПоступленииСредствВР.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаДатаИсполненияПриПоступленииСредствВР;
	
КонецФункции

Функция ДатаИсполненияПриПеречисленииСредствВР(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС30401", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаДатаИсполненияПриПеречисленииСредствВР = КонтрольИсполненияДоговоров.ПустаяТаблицаДатаИсполненияПриПеречисленииСредствВР();
	Для Каждого Колонка Из ТаблицаДатаИсполненияПриПеречисленииСредствВР.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация",     ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата",            ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	Реквизиты.Вставить("СчетРасчетов", БухгалтерскийУчет.СчетПоКоду("304.01", ДокументОбъект.Дата, ДокументОбъект.Организация));
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(ДокументОбъект, Реквизиты, Отказ);
	
	ТаблицаДатаИсполненияПриПеречисленииСредствВР = КонтрольИсполненияДоговоров.ТаблицаДатаИсполненияПриПеречисленииСредствВР(
		РасшифровкаПлатежа,
		ДокументОбъект,
		Реквизиты,
		Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаДатаИсполненияПриПеречисленииСредствВР", ТаблицаДатаИсполненияПриПеречисленииСредствВР.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаДатаИсполненияПриПеречисленииСредствВР;
	
КонецФункции

#КонецОбласти

#Область ПереносОстатков64нНФА

Функция Приказ64нНФАОстатки(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда		
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда		
		Таблица = Документы.ПереносОстатков64нНФА.ПустаяТаблицаОстатки();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатков64нНФА.ТаблицаОстатки(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Приказ64нНФАОбороты(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда	
		Таблица = Документы.ПереносОстатков64нНФА.ПустаяТаблицаОбороты();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;	
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатков64нНФА.ТаблицаОбороты(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПереносОстатков64нРасчеты

Функция Приказ64нРасчетыОстатки(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда		
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда		
		Таблица = Документы.ПереносОстатков64нРасчеты.ПустаяТаблицаОстатки();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатков64нРасчеты.ТаблицаОстатки(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Приказ64нРасчетыОбороты(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда	
		Таблица = Документы.ПереносОстатков64нРасчеты.ПустаяТаблицаОбороты();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;	
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатков64нРасчеты.ТаблицаОбороты(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПереносОстатков64нКЭК

Функция Приказ64нКЭКОстатки(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда		
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда		
		Таблица = Документы.ПереносОстатков64нКЭК.ПустаяТаблицаОстатки();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;
		
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатков64нКЭК.ТаблицаОстатки(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция Приказ64нКЭКОбороты(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда	
		Таблица = Документы.ПереносОстатков64нКЭК.ПустаяТаблицаОбороты();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения,, "Null"));
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;	
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатков64нКЭК.ТаблицаОбороты(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПереносОстатков198нНФА

Функция Приказ198нНФАОстатки(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда		
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда		
		Таблица = Документы.ПереносОстатков198нНФА.ПустаяТаблицаОстатки();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;	
		Возврат	ПоляФункции;	
	КонецЕсли;
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатков198нНФА.ТаблицаОстатки(РеквизитыДокумента);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ПереносОстатковБиологическиеАктивы

Функция ПереносОстатковБиологическиеАктивыОС(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиОС();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиОС(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПереносОстатковБиологическиеАктивыМЗ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиМЗ();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиМЗ(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПереносОстатковБиологическиеАктивыВложения(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиВложения();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиВложения(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПереносОстатковБиологическиеАктивыВПути(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Таблица = Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиВПути();
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из Таблица.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова = "Выполнить" Тогда
		РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
		Возврат Документы.ПереносОстатковБиологическиеАктивы.ТаблицаОстаткиВПути(РеквизитыДокумента);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область КорректировкаПоступленияИРеализацииМЗ

Функция ПроводкиКорректируемогоДокумента(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ТипСубконто = Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип;
	МетаданныеРБ = Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ;

	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ВалютаДт", МетаданныеРБ.Измерения.Валюта.Тип);
	ТаблицаРезультат.Колонки.Добавить("ВалютаКт", МетаданныеРБ.Измерения.Валюта.Тип);
	ТаблицаРезультат.Колонки.Добавить("ВалютнаяСуммаДт", МетаданныеРБ.Ресурсы.ВалютнаяСумма.Тип);
	ТаблицаРезультат.Колонки.Добавить("ВалютнаяСуммаКт", МетаданныеРБ.Ресурсы.ВалютнаяСумма.Тип);
	ТаблицаРезультат.Колонки.Добавить("ВидПервичногоДокумента", МетаданныеРБ.Реквизиты.ВидПервичногоДокумента.Тип);
	ТаблицаРезультат.Колонки.Добавить("ДатаПервичногоДокумента", МетаданныеРБ.Реквизиты.ДатаПервичногоДокумента.Тип);
	ТаблицаРезультат.Колонки.Добавить("ЖурналОпераций", МетаданныеРБ.Измерения.ЖурналОпераций.Тип);
	ТаблицаРезультат.Колонки.Добавить("ИФО", МетаданныеРБ.Измерения.ИФО.Тип);
	ТаблицаРезультат.Колонки.Добавить("КоличествоДт", МетаданныеРБ.Ресурсы.Количество.Тип);
	ТаблицаРезультат.Колонки.Добавить("КоличествоКт", МетаданныеРБ.Ресурсы.Количество.Тип);
	ТаблицаРезультат.Колонки.Добавить("КПСДт", МетаданныеРБ.Измерения.КПС.Тип);
	ТаблицаРезультат.Колонки.Добавить("КПСКт", МетаданныеРБ.Измерения.КПС.Тип);
	ТаблицаРезультат.Колонки.Добавить("КФО", МетаданныеРБ.Измерения.КФО.Тип);
	ТаблицаРезультат.Колонки.Добавить("КЭКДт", МетаданныеРБ.Измерения.КЭК.Тип);
	ТаблицаРезультат.Колонки.Добавить("КЭККт", МетаданныеРБ.Измерения.КЭК.Тип);
	ТаблицаРезультат.Колонки.Добавить("НомерПервичногоДокумента", МетаданныеРБ.Реквизиты.НомерПервичногоДокумента.Тип);
	ТаблицаРезультат.Колонки.Добавить("Организация", МетаданныеРБ.Измерения.Организация.Тип);
	ТаблицаРезультат.Колонки.Добавить("ПодразделениеДт", МетаданныеРБ.Измерения.Подразделение.Тип);
	ТаблицаРезультат.Колонки.Добавить("ПодразделениеКт", МетаданныеРБ.Измерения.Подразделение.Тип);
	ТаблицаРезультат.Колонки.Добавить("Содержание", МетаданныеРБ.Реквизиты.Содержание.Тип);
	ТаблицаРезультат.Колонки.Добавить("СубконтоДт1", ТипСубконто);
	ТаблицаРезультат.Колонки.Добавить("СубконтоДт2", ТипСубконто);
	ТаблицаРезультат.Колонки.Добавить("СубконтоДт3", ТипСубконто);
	ТаблицаРезультат.Колонки.Добавить("СубконтоКт1", ТипСубконто);
	ТаблицаРезультат.Колонки.Добавить("СубконтоКт2", ТипСубконто);
	ТаблицаРезультат.Колонки.Добавить("СубконтоКт3", ТипСубконто);
	ТаблицаРезультат.Колонки.Добавить("Сумма", МетаданныеРБ.Ресурсы.Сумма.Тип);
	ТаблицаРезультат.Колонки.Добавить("СуммаЕНВД", МетаданныеРБ.Ресурсы.СуммаЕНВД.Тип);
	ТаблицаРезультат.Колонки.Добавить("СуммаНДС", МетаданныеРБ.Ресурсы.СуммаНДС.Тип);
	ТаблицаРезультат.Колонки.Добавить("СуммаНеУчитываетсяНУ", МетаданныеРБ.Ресурсы.СуммаНеУчитываетсяНУ.Тип);
	ТаблицаРезультат.Колонки.Добавить("СчетДт", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаРезультат.Колонки.Добавить("СчетКт", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаРезультат.Колонки.Добавить("ХарактеристикаДвиженияДт", МетаданныеРБ.Реквизиты.ХарактеристикаДвиженияДт.Тип);
	ТаблицаРезультат.Колонки.Добавить("ХарактеристикаДвиженияКт", МетаданныеРБ.Реквизиты.ХарактеристикаДвиженияКт.Тип);
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
		
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ЭтоКорректировка")
		И ДокументОбъект.ЭтоКорректировка
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект, "ДокументОснование") Тогда
		Документ = ДокументОбъект.ДокументОснование;
	Иначе
		Документ = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаДт КАК ВалютаДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютаКт КАК ВалютаКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаДт КАК ВалютнаяСуммаДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВалютнаяСуммаКт КАК ВалютнаяСуммаКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВидМежотчетногоПериода КАК ВидМежотчетногоПериода,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ЖурналОпераций КАК ЖурналОпераций,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ИФО КАК ИФО,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт КАК КоличествоДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт КАК КоличествоКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.НомерСтроки КАК НомерСтроки,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Организация КАК Организация,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Период КАК Период,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ПодразделениеДт КАК ПодразделениеДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ПодразделениеКт КАК ПодразделениеКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Содержание КАК Содержание,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма КАК Сумма,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СуммаЕНВД КАК СуммаЕНВД,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СуммаНДС КАК СуммаНДС,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СуммаНеУчитываетсяНУ КАК СуммаНеУчитываетсяНУ,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.УточнениеПериода КАК УточнениеПериода,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ХарактеристикаДвиженияДт КАК ХарактеристикаДвиженияДт,
		|	ЖурналПроводокЕПСБУДвиженияССубконто.ХарактеристикаДвиженияКт КАК ХарактеристикаДвиженияКт
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Регистратор = &Регистратор И Сумма > 0, , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		Запрос.УстановитьПараметр("Регистратор", Документ);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(), Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ПроводкиКорректируемогоДокумента", ТаблицаРезультат.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРезультат;

КонецФункции

#КонецОбласти 

#Область Извещения

Функция ПодтверждениеПолученияНФА(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	ТипыНФА = Новый Массив;
	ТипыНФА.Добавить(Тип("СправочникСсылка.ОсновныеСредства"));
	ТипыНФА.Добавить(Тип("СправочникСсылка.Номенклатура"));
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ИмяСписка",     ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаРезультат.Колонки.Добавить("СинонимСписка", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
	ТаблицаРезультат.Колонки.Добавить("НомерСтроки",   ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
	
	ТаблицаРезультат.Колонки.Добавить("НФА",        Новый ОписаниеТипов(ТипыНФА));
	ТаблицаРезультат.Колонки.Добавить("Количество", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(10, 3));
	ТаблицаРезультат.Колонки.Добавить("Сумма",      ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(18, 2));
	ТаблицаРезультат.Колонки.Добавить("КФО",        Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаРезультат.Колонки.Добавить("СчетУчета",  Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		ПоляФункции = Новый Массив;
		Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
			ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
		КонецЦикла;
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИзвещениеВходящееОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ИзвещениеВходящееОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ИзвещениеВходящееОсновныеСредства.Количество КАК Количество,
	|	ИзвещениеВходящееОсновныеСредства.Сумма КАК Сумма,
	|	ИзвещениеВходящееОсновныеСредства.КФО КАК КФО,
	|	ИзвещениеВходящееОсновныеСредства.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ ТЧОсновныеСредства
	|ИЗ
	|	&ТЧОсновныеСредства КАК ИзвещениеВходящееОсновныеСредства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзвещениеВходящееМатериалы.НомерСтроки КАК НомерСтроки,
	|	ИзвещениеВходящееМатериалы.Номенклатура КАК Номенклатура,
	|	ИзвещениеВходящееМатериалы.Количество КАК Количество,
	|	ИзвещениеВходящееМатериалы.Сумма КАК Сумма,
	|	ИзвещениеВходящееМатериалы.КФО КАК КФО,
	|	ИзвещениеВходящееМатериалы.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ ТЧМатериалы
	|ИЗ
	|	&ТЧМатериалы КАК ИзвещениеВходящееМатериалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИзвещениеВходящееВозвратнаяТара.НомерСтроки КАК НомерСтроки,
	|	ИзвещениеВходящееВозвратнаяТара.Номенклатура КАК Номенклатура,
	|	ИзвещениеВходящееВозвратнаяТара.Количество КАК Количество,
	|	ИзвещениеВходящееВозвратнаяТара.Сумма КАК Сумма,
	|	ИзвещениеВходящееВозвратнаяТара.КФО КАК КФО,
	|	ИзвещениеВходящееВозвратнаяТара.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ ТЧВозвратнаяТара
	|ИЗ
	|	&ТЧВозвратнаяТара КАК ИзвещениеВходящееВозвратнаяТара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Субконто3 КАК НФА,
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт КАК СуммаОстатокДт
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счета),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Поставщик
	|				И Субконто2 = &ИсходящееИзвещение) КАК ЖурналПроводокЕПСБУОстатки
	|ГДЕ
	|	(ЖурналПроводокЕПСБУОстатки.Счет, ЖурналПроводокЕПСБУОстатки.КФО, ЖурналПроводокЕПСБУОстатки.Субконто3) В
	|			(ВЫБРАТЬ
	|				ТЧОсновныеСредства.СчетУчета,
	|				ТЧОсновныеСредства.КФО,
	|				ТЧОсновныеСредства.ОсновноеСредство
	|			ИЗ
	|				ТЧОсновныеСредства КАК ТЧОсновныеСредства
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				ТЧМатериалы.СчетУчета,
	|				ТЧМатериалы.КФО,
	|				ТЧМатериалы.Номенклатура
	|			ИЗ
	|				ТЧМатериалы КАК ТЧМатериалы
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				ТЧВозвратнаяТара.СчетУчета,
	|				ТЧВозвратнаяТара.КФО,
	|				ТЧВозвратнаяТара.Номенклатура
	|			ИЗ
	|				ТЧВозвратнаяТара КАК ТЧВозвратнаяТара)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ТЧОсновныеСредства.ОсновноеСредство КАК НФА,
	|	ТЧОсновныеСредства.Количество КАК Количество,
	|	ТЧОсновныеСредства.Сумма КАК Сумма,
	|	ТЧОсновныеСредства.КФО КАК КФО,
	|	ТЧОсновныеСредства.СчетУчета КАК СчетУчета,
	|	Остатки.СуммаОстатокДт КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ТЧОсновныеСредства.Сумма > Остатки.СуммаОстатокДт
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибка,
	|	&ИмяТЧОсновныеСредства КАК ИмяСписка,
	|	&СинонимТЧОсновныеСредства КАК СинонимСписка,
	|	1 КАК ПорядокТЧ
	|ИЗ
	|	ТЧОсновныеСредства КАК ТЧОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТЧОсновныеСредства.ОсновноеСредство = Остатки.НФА
	|			И ТЧОсновныеСредства.КФО = Остатки.КФО
	|			И (Остатки.Счет = ТЧОсновныеСредства.СчетУчета)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧМатериалы.НомерСтроки,
	|	ТЧМатериалы.Номенклатура,
	|	ТЧМатериалы.Количество,
	|	ТЧМатериалы.Сумма,
	|	ТЧМатериалы.КФО,
	|	ТЧМатериалы.СчетУчета,
	|	Остатки.СуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ТЧМатериалы.Сумма > Остатки.СуммаОстатокДт
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	&ИмяТЧНоменклатура,
	|	&СинонимТЧНоменклатура,
	|	2
	|ИЗ
	|	ТЧМатериалы КАК ТЧМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТЧМатериалы.Номенклатура = Остатки.НФА
	|			И ТЧМатериалы.КФО = Остатки.КФО
	|			И (Остатки.Счет = ТЧМатериалы.СчетУчета)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВозвратнаяТара.НомерСтроки,
	|	ТЧВозвратнаяТара.Номенклатура,
	|	ТЧВозвратнаяТара.Количество,
	|	ТЧВозвратнаяТара.Сумма,
	|	ТЧВозвратнаяТара.КФО,
	|	ТЧВозвратнаяТара.СчетУчета,
	|	Остатки.СуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ТЧВозвратнаяТара.Сумма > Остатки.СуммаОстатокДт
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	&ИмяТЧВозвратнаяТара,
	|	&СинонимТЧВозвратнаяТара,
	|	3
	|ИЗ
	|	ТЧВозвратнаяТара КАК ТЧВозвратнаяТара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ТЧВозвратнаяТара.Номенклатура = Остатки.НФА
	|			И ТЧВозвратнаяТара.КФО = Остатки.КФО
	|			И ТЧВозвратнаяТара.СчетУчета = Остатки.Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕстьОшибка УБЫВ,
	|	ПорядокТЧ,
	|	НомерСтроки";
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Запрос.УстановитьПараметр("Период", Новый Граница(Новый МоментВремени(ДокументОбъект.Дата, ДокументОбъект.Ссылка),
		ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Счета", БухгалтерскийУчет.СписокСчетов("05", ДокументОбъект.Дата, Ложь,
		ДокументОбъект.Организация));
	Запрос.УстановитьПараметр("Поставщик", ДокументОбъект.Поставщик);
	Запрос.УстановитьПараметр("ИсходящееИзвещение", ДокументОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("Организация", ДокументОбъект.Организация);

	Запрос.УстановитьПараметр("ТЧОсновныеСредства", ДокументОбъект.ОсновныеСредства.Выгрузить());
	Запрос.УстановитьПараметр("ТЧМатериалы", ДокументОбъект.Материалы.Выгрузить());
	Запрос.УстановитьПараметр("ТЧВозвратнаяТара", ДокументОбъект.ВозвратнаяТара.Выгрузить());
	Запрос.УстановитьПараметр("ИмяТЧОсновныеСредства", "ОсновныеСредства");
	Запрос.УстановитьПараметр("СинонимТЧОсновныеСредства", МетаданныеДокумента.ТабличныеЧасти.ОсновныеСредства.Синоним);
	Запрос.УстановитьПараметр("ИмяТЧНоменклатура", "Материалы");
	Запрос.УстановитьПараметр("СинонимТЧНоменклатура", МетаданныеДокумента.ТабличныеЧасти.Материалы.Синоним);
	Запрос.УстановитьПараметр("ИмяТЧВозвратнаяТара", "ВозвратнаяТара");
	Запрос.УстановитьПараметр("СинонимТЧВозвратнаяТара", МетаданныеДокумента.ТабличныеЧасти.ВозвратнаяТара.Синоним);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отказ = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Отказ И Выборка.ЕстьОшибка Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Если Выборка.СуммаОстаток < Выборка.Сумма Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Остаток %1 меньше суммы в документе %2'"), Формат(
					Выборка.СуммаОстаток, "ЧДЦ=2;"), Формат(Выборка.Сумма, "ЧДЦ=2;")); 
				ТекстОшибки = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
					"Колонка",
					"Корректность",
					НСтр("ru = 'Сумма'"),
					Выборка.НомерСтроки,
					Выборка.СинонимСписка,
					ТекстСообщения);
				ПутьКПолю = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(Выборка.ИмяСписка, Выборка.НомерСтроки,
					"Сумма");
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументОбъект.Ссылка, ПутьКПолю, "Объект");
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(), Выборка);
		
	КонецЦикла;

	Если Отказ Тогда
		// Сохраним контекст.
		КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
		КонтекстПроведения.Отказ = Истина;
		БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	КонецЕсли;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

#КонецОбласти

#Область УчетФинансовыхВложений

Функция ТаблицаВложенийВФинансовыеАктивы(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаВложений = УчетФинансовыхВложений.ПустаяТаблицаВложенийВФинансовыеАктивы();
	
	Для Каждого Колонка Из ТаблицаВложений.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
		
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка", ДокументОбъект.Ссылка);
	Реквизиты.Вставить("Организация", ДокументОбъект.Организация);
	Реквизиты.Вставить("Дата", ДокументОбъект.Дата);
	Реквизиты.Вставить("ТиповаяОперация", ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс", КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетФинансовыхВложений.ТаблицаВложенийВФинансовыеАктивыПоДокументу(
		ДокументОбъект, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов, Неопределено);
	
	// Подготовим таблицу для отражения поступления вложений в финансовые активы
	ТаблицаПоступления = УчетФинансовыхВложений.ТаблицаВложенийВФинансовыеАктивы(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаПоступлениеВложенийВФинансовыеАктивы", ТаблицаПоступления.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПоступления;
	
КонецФункции

Функция РеализацияФинансовыхАктивов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРеализации = УчетФинансовыхВложений.ПустаяТаблицаРеализацияФинансовыхАктивов();
	Для Каждого Колонка Из ТаблицаРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаДокумента = УчетФинансовыхВложений.ПодготовитьТаблицуРеализацияФинансовыхАктивовПоДокументу(
		Реквизиты.Ссылка, Параметры);
	
	ТаблицаРасчетовСЗачетомАвансов = ?(ДополнительныеСвойства.Свойство("ТаблицаРасчетовСЗачетомАвансов"),
		ДополнительныеСвойства.ТаблицаРасчетовСЗачетомАвансов,
		Неопределено);
	
	// Подготовим таблицу для отражения реализации финансовых активов,
	ТаблицаРеализации = УчетФинансовыхВложений.ТаблицаРеализацияФинансовыхАктивов(
		ТаблицаДокумента, ТаблицаРасчетовСЗачетомАвансов, Реквизиты, Отказ);
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаРеализацияФинансовыхАктивов",
		ТаблицаРеализации.Скопировать());
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРеализации;
	
КонецФункции

#КонецОбласти

#Область УчетГосударственногоДолгаВЦенныхБумагах

Функция ТаблицаДляВыкупаЦенныхБумаг(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",
			Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Количество",
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(12, 0, ДопустимыйЗнак.Неотрицательный)));
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРеализации = УчетФинансовыхВложений.ПустаяТаблицаДляВыкупаЦенныхБумаг();
	Для Каждого Колонка Из ТаблицаРеализации.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДополнительныеСвойства = КонтекстПроведения.ДополнительныеСвойства;
	Реквизиты.Вставить("Курс", КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	// Подготовим таблицу для отражения выкупа ценных бумаг,
	ТаблицаВыкупа = УчетФинансовыхВложений.ТаблицаДляВыкупаЦенныхБумаг(Реквизиты, Параметры, Отказ);
	
	// и сохраним ее для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаДляВыкупаЦенныхБумаг",
		ТаблицаВыкупа.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаВыкупа;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

Функция ТаблицаРасчетовПриПоступленииОсновныхСредств(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = ТаблицаРасчетовСЗачетомАвансов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетВложений", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ТаблицаРасчетовСЗачетомАвансов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаРасчетовСЗачетомАвансов(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	
КонецФункции

Функция ТаблицаРасчетовССотрудникамиПоВедомости(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "ВедомостьНаВыплатуВБанк",
										Новый ОписаниеТипов("ДокументСсылка.ВедомостьНаВыплатуВБанк"));
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ПоляФункции = Новый Массив;
	
	ТаблицаРасчетов = УчетРасчетов.ПустаяТаблицаРасчетовСПогашениемЗадолженности();
	Для Каждого Колонка Из ТаблицаРасчетов.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РеквизитыДокумента = РеквизитыДокумента(ИсточникиДанных);
	РеквизитыТиповойОперации = РеквизитыТиповойОперации(ИсточникиДанных);
	
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("Ссылка",          РеквизитыДокумента.Ссылка);
	Реквизиты.Вставить("Организация",     РеквизитыДокумента.Организация);
	Реквизиты.Вставить("Дата",            РеквизитыДокумента.Дата);
	Реквизиты.Вставить("ТиповаяОперация", РеквизитыТиповойОперации.ТиповаяОперация);
	
	Реквизиты.Вставить("СчетРасчетов",    БухгалтерскийУчет.СчетПоКоду("302.00"));
	
	Для Каждого Параметр Из Параметры Цикл
		Реквизиты.Вставить(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Реквизиты.Вставить("Курс",      КонтекстПроведения.Курс);
	Реквизиты.Вставить("Кратность", КонтекстПроведения.Кратность);
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	
	Отказ = Ложь;
	
	РасшифровкаПлатежа = УчетРасчетов.ПодготовитьТаблицуРасшифровкаПлатежаПоДокументу(
		Реквизиты.Ссылка, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		
		// При перечислении сотрудникам по ведомости перечислений расчеты ведутся по сотрудникам,
		// указанным в ведомости на перечисление сотрудникам. Модифицируем таблицу РасшифровкаПлатежа.
		РасшифровкаПлатежаПоПолучателям = УчетРасчетов.ДетализироватьРасшифровкуПлатежаПоВедомостиПеречислений(
			РасшифровкаПлатежа, Реквизиты.Ссылка, Параметры, Отказ);
			
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		// Подготовим таблицу для отражения погашения задолженности перед получателями компенсации родительской платы,
		ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСПогашениемЗадолженности(
			РасшифровкаПлатежаПоПолучателям, Реквизиты, Отказ);
		
	КонецЕсли;
	
	// Сохраним таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаРасчетовСПогашениемЗадолженности", ТаблицаРасчетов.Скопировать());
	КонтекстПроведения.Отказ = КонтекстПроведения.Отказ ИЛИ Отказ;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРасчетов;
	
КонецФункции

////////////////////////////////////////////////////////////

Функция ТаблицаЗачетаАванса_ОсновныеСредства(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",			Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",			Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетВложения",	Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, Неопределено, Неопределено);
	КонецЕсли;		
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	ПараметрыРасчетаОстатковАванса = СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, СтрокаДокумента, ТаблицаРасчетов, ПараметрыРасчетаАванса);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаЗачетаАванса", ТаблицаЗачетаАванса);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаЗачетаАванса;
	
КонецФункции

// ФУНКЦИИ ЗАЧЕТА ВЫДАННЫХ АВАНСОВ

// --- Поступление МЗ; Поступление МЗ (в пути) ---

Функция ТаблицаЗачетаАванса_МЗ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеМЗ");		

	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, Неопределено, Неопределено);
	КонецЕсли;		
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	ПараметрыРасчетаОстатковАванса = СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, СтрокаДокумента, ТаблицаРасчетов, ПараметрыРасчетаАванса);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	Возврат ТаблицаЗачетаАванса;
	
КонецФункции

Функция ПоступлениеМЗ_Материалы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеМЗ");		

	КонецЕсли;
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("Сумма");
	ПересчитываемыеПоля.Добавить("СуммаНДС");
	ПересчитываемыеПоля.Добавить("Всего");
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ПоступлениеМЗ.ТабличныеЧасти.Материалы);
	МассивМетаданных.Добавить(Метаданные.Документы.ПоступлениеМЗВПути.ТабличныеЧасти.Материалы);
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	ПараметрыПодготовкиТЧ = ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов(ВариантВызова, ИсточникиДанных, Параметры, "Материалы", ПоляФункции, ПересчитываемыеПоля, ПараметрыРасчетаАванса);
	ПараметрыПодготовкиТЧ.ИмяКолонкиДенежногоОбязательства = "Всего";	
	Возврат ПодготовитьТабличнуюЧастьСЗачетомАванса(ПараметрыПодготовкиТЧ);
	
КонецФункции // ПоступлениеМЗ_Материалы_СЗачетомАванса()

Функция ПоступлениеМЗ_ВозвратнаяТара_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеМЗ");		

	КонецЕсли;
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("Сумма");
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ПоступлениеМЗ.ТабличныеЧасти.ВозвратнаяТара);
	МассивМетаданных.Добавить(Метаданные.Документы.ПоступлениеМЗВПути.ТабличныеЧасти.ВозвратнаяТара);
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	ПараметрыПодготовкиТЧ = ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов(ВариантВызова, ИсточникиДанных, Параметры, "ВозвратнаяТара", ПоляФункции, ПересчитываемыеПоля, ПараметрыРасчетаАванса);
	ПараметрыПодготовкиТЧ.ИмяКолонкиДенежногоОбязательства = "Сумма";	
	Возврат ПодготовитьТабличнуюЧастьСЗачетомАванса(ПараметрыПодготовкиТЧ);
	
КонецФункции // ПоступлениеМЗ_Материалы_СЗачетомАванса()

Функция ТаблицаПринятияДенежногоОбязательства_МЗ(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеМЗ");		

	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		
		Возврат ОписаниеПолейТаблицыПринятияДенежногоОбязательства();
		
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицыДляРасчетаТаблицыПринятияДО = Новый Массив;
	ТаблицыДляРасчетаТаблицыПринятияДО.Добавить(ПоступлениеМЗ_Материалы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры));
	ТаблицыДляРасчетаТаблицыПринятияДО.Добавить(ПоступлениеМЗ_ВозвратнаяТара_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры));
	
	Возврат ЗаполнитьТаблицуПринятияДенежногоОбязательства(ТаблицыДляРасчетаТаблицыПринятияДО);

КонецФункции // ТаблицаПринятияДенежногоОбязательства_МЗ()


// Накладная на отпуск М-15

Функция НакладнаяНаОтпускМ15_Материалы_ВозвратПоставщику(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.НакладнаяНаОтпускМ15.ТабличныеЧасти.Материалы);
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("Всего");
	ПересчитываемыеПоля.Добавить("СуммаНДС");
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетУчетаНУ",              Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	// Поля учетной стоимости материальных запасов.
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Стоимость",                ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СтоимостьНУ",              ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СтоимостьНеУчитываетсяНУ", ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СтоимостьЕНВД",            ОписаниеТипаСуммы);
	// Поля разниц стоимости возврата и учетной стоимости материальных запасов.
	ДобавитьПолеРезультатаФункции(ПоляФункции, "РазницаСтоимости",         ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "РазницаСтоимостиНУ",       ОписаниеТипаСуммы);
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ПересчитываемыеПоля", ПересчитываемыеПоля);
	ПараметрыРасчета.Вставить("ИсточникиДанных", ИсточникиДанных);
	ПараметрыРасчета.Вставить("ПоляФункции", ПоляФункции);
	ПараметрыРасчета.Вставить("ИмяТабличнойЧасти", "Материалы");
	
	Возврат ПодготовитьТаблицуНакладнойМ15ДляВозвратаПоставщику(ПараметрыРасчета);
	
КонецФункции

Функция НакладнаяНаОтпускМ15_ВозвратнаяТара_ВозвратПоставщику(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.НакладнаяНаОтпускМ15.ТабличныеЧасти.ВозвратнаяТара);
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("Сумма");
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18, 2, ДопустимыйЗнак.Любой));
	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетУчетаНУ",              Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	// Поля учетной стоимости материальных запасов.
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Стоимость",                ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СтоимостьНУ",              ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СтоимостьНеУчитываетсяНУ", ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СтоимостьЕНВД",            ОписаниеТипаСуммы);
	// Поля разниц стоимости возврата и учетной стоимости материальных запасов.
	ДобавитьПолеРезультатаФункции(ПоляФункции, "РазницаСтоимости",         ОписаниеТипаСуммы);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "РазницаСтоимостиНУ",       ОписаниеТипаСуммы);
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ПересчитываемыеПоля", ПересчитываемыеПоля);
	ПараметрыРасчета.Вставить("ИсточникиДанных", ИсточникиДанных);
	ПараметрыРасчета.Вставить("ПоляФункции", ПоляФункции);
	ПараметрыРасчета.Вставить("ИмяТабличнойЧасти", "ВозвратнаяТара");
	
	Возврат ПодготовитьТаблицуНакладнойМ15ДляВозвратаПоставщику(ПараметрыРасчета);

КонецФункции

Функция ПодготовитьТаблицуНакладнойМ15ДляВозвратаПоставщику(ПараметрыРасчета)
	
	ПересчитываемыеПоля = ПараметрыРасчета.ПересчитываемыеПоля;
	ИсточникиДанных = ПараметрыРасчета.ИсточникиДанных;
	ПоляФункции = ПараметрыРасчета.ПоляФункции;
	ИмяТабличнойЧасти = ПараметрыРасчета.ИмяТабличнойЧасти;
	
	ВычисляемыеПоля = Новый Массив;
	Для каждого ИмяКолонки Из ПересчитываемыеПоля Цикл
		ВычисляемыеПоля.Добавить(ИмяКолонки + "_ВРублях");
	КонецЦикла;
	ВычисляемыеПоля.Добавить("СчетУчетаНУ");
	ВычисляемыеПоля.Добавить("Стоимость");
	ВычисляемыеПоля.Добавить("СтоимостьНУ");
	ВычисляемыеПоля.Добавить("СтоимостьНеУчитываетсяНУ");
	ВычисляемыеПоля.Добавить("СтоимостьЕНВД");
	ВычисляемыеПоля.Добавить("РазницаСтоимости");
	ВычисляемыеПоля.Добавить("РазницаСтоимостиНУ");

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрДокумента = ИсточникиДанных["Документ"][0];
	ДокументСсылка = СтрДокумента[ПрефиксДокумента + "Ссылка"];
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);

	ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных(ИмяТабличнойЧасти);
	ПрефиксДопРеквизита = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит");
	
	ПараметрыТекущегоКурса = Новый Структура("Валюта,Курс,Кратность",
		Константы.ВалютаРегламентированногоУчета.Получить(), 1, 1);
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ПараметрыНовогоКурса = Новый Структура("Валюта,Курс,Кратность",
		СтрДокумента[ПрефиксДокумента + "ВалютаДокумента"],
		КонтекстПроведения.Курс,
		КонтекстПроведения.Кратность);
		
	КФОвШапке = ИсточникиДанных["Документ"].Колонки.Найти(ПрефиксДокумента + "КФО") <> Неопределено;
	КФОвТЧ = ИсточникиДанных[ИмяТабличнойЧасти].Колонки.Найти(ПрефиксКолонки + "КФО") <> Неопределено;
	                                                                 
	Для каждого СтрокаТаблицы Из ИсточникиДанных[ИмяТабличнойЧасти] Цикл
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		
		// Заполняем поля (кроме вычисляемых) из реквизитов источника данных.
		Для каждого ТекПолеФункции Из ПоляФункции Цикл
			Если ВычисляемыеПоля.Найти(ТекПолеФункции.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока[ТекПолеФункции.Имя] = СтрокаТаблицы[ПрефиксКолонки + ТекПолеФункции.Имя];
		КонецЦикла;
		
		// Суммы в рублях.
		Для каждого ПересчитываемоеПоле Из ПересчитываемыеПоля Цикл
		
			НоваяСтрока[ПересчитываемоеПоле + "_ВРублях"] = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(СтрокаТаблицы[ПрефиксКолонки + ПересчитываемоеПоле],
					ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
		
		КонецЦикла;
		
		Если КФОвШапке Тогда
			ОтражатьВНалоговомУчете = БухгалтерскиеОперации.ОтражатьВНалоговомУчете(
				СтрДокумента[ПрефиксДокумента + "Организация"], СтрДокумента[ПрефиксДокумента + "Дата"], СтрДокумента[ПрефиксДокумента + "КФО"]);
		ИначеЕсли КФОВТЧ Тогда
			ОтражатьВНалоговомУчете = БухгалтерскиеОперации.ОтражатьВНалоговомУчете(
				СтрДокумента[ПрефиксДокумента + "Организация"], СтрДокумента[ПрефиксДокумента + "Дата"], СтрокаТаблицы[ПрефиксКолонки + "КФО"]);
		Иначе
			ОтражатьВНалоговомУчете = Ложь;
		КонецЕсли;
		// Учетная стоимость материальных запасов
		НоваяСтрока.Стоимость                = БухгалтерскиеОперации.ПолучитьРеквизитСписанияНоменклатуры(
			"Стоимость",                ДокументСсылка, СтрокаТаблицы.НомерСтроки, ИмяТабличнойЧасти, "БУ");
		Если ОтражатьВНалоговомУчете Тогда
		
			НоваяСтрока.СчетУчетаНУ              = БухгалтерскиеОперации.ПолучитьРеквизитСписанияНоменклатуры(
				"СчетУчета",                ДокументСсылка, СтрокаТаблицы.НомерСтроки, ИмяТабличнойЧасти, "НУ");
				
			// Учетная стоимость материальных запасов в НУ
			НоваяСтрока.СтоимостьНУ              = БухгалтерскиеОперации.ПолучитьРеквизитСписанияНоменклатуры(
				"Стоимость",                ДокументСсылка, СтрокаТаблицы.НомерСтроки, ИмяТабличнойЧасти, "НУ");
			НоваяСтрока.СтоимостьНеУчитываетсяНУ = БухгалтерскиеОперации.ПолучитьРеквизитСписанияНоменклатуры(
				"СтоимостьНеУчитываетсяНУ", ДокументСсылка, СтрокаТаблицы.НомерСтроки, ИмяТабличнойЧасти, "НУ");
			НоваяСтрока.СтоимостьЕНВД            = БухгалтерскиеОперации.ПолучитьРеквизитСписанияНоменклатуры(
				"СтоимостьЕНВД",            ДокументСсылка, СтрокаТаблицы.НомерСтроки, ИмяТабличнойЧасти, "НУ");
			
		КонецЕсли;
		
		// Разницы стоимости возврата и учетной стоимости материальных запасов.
		Если ИмяТабличнойЧасти = "Материалы" Тогда
			СтоимостьВозврата = ?(СтрокаТаблицы[ПрефиксДопРеквизита+"ВосстанавливатьНДС"],
					НоваяСтрока.Всего_ВРублях - НоваяСтрока.СуммаНДС_ВРублях,
					НоваяСтрока.Всего_ВРублях);
		Иначе
			СтоимостьВозврата = НоваяСтрока.Сумма_ВРублях;
		КонецЕсли;
		НоваяСтрока.РазницаСтоимости   = НоваяСтрока.Стоимость - СтоимостьВозврата;
		НоваяСтрока.РазницаСтоимостиНУ = (НоваяСтрока.СтоимостьНУ + НоваяСтрока.СтоимостьНеУчитываетсяНУ + НоваяСтрока.СтоимостьЕНВД) - СтоимостьВозврата;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;

КонецФункции


// --- Поступление услуг, работ

Функция ТаблицаЗачетаАванса_ПоступлениеУслуг(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры) Экспорт

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеУслуг");
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, Неопределено, Неопределено);
	КонецЕсли;		
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	ПараметрыРасчетаОстатковАванса = СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, СтрокаДокумента, ТаблицаРасчетов, ПараметрыРасчетаАванса);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	Возврат ТаблицаЗачетаАванса;
	
КонецФункции

Функция ПоступлениеУслуг_УслугиИРаботы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры) Экспорт
	Перем Параметр_КФО;

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеУслуг");

	КонецЕсли;
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("Сумма");
	ПересчитываемыеПоля.Добавить("СуммаНДС");
	ПересчитываемыеПоля.Добавить("Всего");
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ПоступлениеУслугРабот.ТабличныеЧасти.УслугиИРаботы);
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	ПараметрыПодготовкиТЧ = ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов(ВариантВызова, ИсточникиДанных, Параметры, "УслугиИРаботы", ПоляФункции, ПересчитываемыеПоля, ПараметрыРасчетаАванса);
	ПараметрыПодготовкиТЧ.ИмяКолонкиДенежногоОбязательства = "Всего";	
	Возврат ПодготовитьТабличнуюЧастьСЗачетомАванса(ПараметрыПодготовкиТЧ);
	
КонецФункции // ПоступлениеМЗ_Материалы_СЗачетомАванса()

Функция ТаблицаПринятияДенежногоОбязательства_ПоступлениеУслуг(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры) Экспорт

	ГруппируемыеПоля = "КПС,КЭК";
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеУслуг");

	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		
		Возврат ОписаниеПолейТаблицыПринятияДенежногоОбязательства(ГруппируемыеПоля);
		
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицыДляРасчетаТаблицыПринятияДО = Новый Массив;
	ТаблицыДляРасчетаТаблицыПринятияДО.Добавить(ПоступлениеУслуг_УслугиИРаботы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры));
	
	Возврат ЗаполнитьТаблицуПринятияДенежногоОбязательства(ТаблицыДляРасчетаТаблицыПринятияДО, ГруппируемыеПоля);

КонецФункции // ТаблицаПринятияДенежногоОбязательства_МЗ()


// --- Поступление ОС; Поступление ОС (в пути) ---

Функция ТаблицаЗачетаАванса_ОС(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеОС");
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		
		Возврат ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, Неопределено, Неопределено);
		
	КонецЕсли;		
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	ПараметрыРасчетаОстатковАванса = СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, СтрокаДокумента, ТаблицаРасчетов, ПараметрыРасчетаАванса);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	Возврат ТаблицаЗачетаАванса;
	
КонецФункции

Функция ПоступлениеОС_КапВложения_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеОС");
		
	КонецЕсли;
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("Сумма");
	ПересчитываемыеПоля.Добавить("СуммаНДС");
	ПересчитываемыеПоля.Добавить("Всего");
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ПоступлениеОС.ТабличныеЧасти.КапВложения);
	МассивМетаданных.Добавить(Метаданные.Документы.ПоступлениеОСВПути.ТабличныеЧасти.КапВложения);
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	ПараметрыПодготовкиТЧ = ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов(ВариантВызова, ИсточникиДанных, Параметры, "КапВложения", ПоляФункции, ПересчитываемыеПоля, ПараметрыРасчетаАванса);
	ПараметрыПодготовкиТЧ.ИмяКолонкиДенежногоОбязательства = "Всего";	
	Возврат ПодготовитьТабличнуюЧастьСЗачетомАванса(ПараметрыПодготовкиТЧ);
	
КонецФункции // ПоступлениеМЗ_Материалы_СЗачетомАванса()

Функция ТаблицаПринятияДенежногоОбязательства_ПоступлениеОС(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	ГруппируемыеПоля = "КПС,КЭК";
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ПоступлениеОС");
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		
		Возврат ОписаниеПолейТаблицыПринятияДенежногоОбязательства(ГруппируемыеПоля);

	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ОписаниеПолейТаблицыПринятияДенежногоОбязательства(ГруппируемыеПоля));
	
	ТаблицыДляРасчетаТаблицыПринятияДО = Новый Массив;
	ТаблицаРасчетаДО = ПоступлениеОС_КапВложения_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	Если ЗначениеЗаполнено(ПараметрыРасчетаАванса.Параметр_СчетВложения) Тогда
		ЗаданКЭК = Истина;
		КЭК = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыРасчетаАванса.Параметр_СчетВложения, "КОСГУДт");
	Иначе
		ЗаданКЭК = Ложь;
	КонецЕсли;
	
	Для каждого ТекСтрока Из ТаблицаРасчетаДО Цикл
		
		Если ТекСтрока.СуммаДенежногоОбязательства <> 0 Тогда
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.КПС				= ПараметрыРасчетаАванса.Параметр_КПС;
			Если ЗаданКЭК Тогда
				НоваяСтрока.КЭК	= КЭК;
			Иначе
				СчетУчета	= ТекСтрока.СчетУчета;
				НоваяСтрока.КЭК	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СчетУчета, "КОСГУДт");
			КонецЕсли;
			НоваяСтрока.Сумма			= ТекСтрока.СуммаДенежногоОбязательства;
			НоваяСтрока.Сумма_ВРублях	= ТекСтрока.СуммаДенежногоОбязательства_ВРублях;
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаРезультат.Свернуть(ГруппируемыеПоля, "Сумма, Сумма_ВРублях");
	
	Возврат ТаблицаРезультат;
		
КонецФункции // ТаблицаПринятияДенежногоОбязательства_МЗ()


// --- ПКО фондовый ---

Функция ТаблицаЗачетаАванса_ПКО(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, Неопределено, Неопределено);
	КонецЕсли;		
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	ПараметрыРасчетаОстатковАвансов = ПараметрыРасчетаТаблицыАвансов();
	
	Объект = ИсточникиДанных.Документ[0];
	Ссылка = Объект[ПрефиксДокумента + "Ссылка"];
	Если Ссылка.Пустая() Тогда
		Период = Новый Граница(КонецДня(Объект[ПрефиксДокумента + "Дата"]), ВидГраницы.Включая);
	Иначе
		Период = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	ПараметрыРасчетаОстатковАвансов.Период 		= Период;
	ПараметрыРасчетаОстатковАвансов.ИФО			= Объект[ПрефиксДокумента + "ИФО"];
	ПараметрыРасчетаОстатковАвансов.Организация = Объект[ПрефиксДокумента + "Организация"];
	ПараметрыРасчетаОстатковАвансов.Контрагент	= Объект[ПрефиксДокумента + "Контрагент"];
	ПараметрыРасчетаОстатковАвансов.Договор		= Объект[ПрефиксДокумента + "Договор"];
	
	Если ЗначениеЗаполнено(ПараметрыРасчетаАванса.Параметр_КФО) Тогда
		ПараметрыРасчетаОстатковАвансов.КФО.Добавить(ПараметрыРасчетаАванса.Параметр_КФО);
	КонецЕсли;
	
	Для каждого СтрокаТаблицыРасчетов Из ТаблицаРасчетов Цикл

		Если ПараметрыРасчетаОстатковАвансов.КФО.Найти(СтрокаТаблицыРасчетов.КФО) = Неопределено Тогда
			ПараметрыРасчетаОстатковАвансов.КФО.Добавить(СтрокаТаблицыРасчетов.КФО);
		КонецЕсли;
		Если ПараметрыРасчетаОстатковАвансов.КПС.Найти(СтрокаТаблицыРасчетов.КПС) = Неопределено Тогда
			ПараметрыРасчетаОстатковАвансов.КПС.Добавить(СтрокаТаблицыРасчетов.КПС);
		КонецЕсли;
		Если ПараметрыРасчетаОстатковАвансов.Счета302.Найти(СтрокаТаблицыРасчетов.СчетРасчетов) = Неопределено Тогда
			ПараметрыРасчетаОстатковАвансов.Счета302.Добавить(СтрокаТаблицыРасчетов.СчетРасчетов);
		КонецЕсли;
		Если ПараметрыРасчетаОстатковАвансов.КЭК.Найти(БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(СтрокаТаблицыРасчетов.СчетРасчетов)) = Неопределено Тогда
			ПараметрыРасчетаОстатковАвансов.КЭК.Добавить(БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(СтрокаТаблицыРасчетов.СчетРасчетов));
		КонецЕсли;

	КонецЦикла;

	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАвансов);
	
	Возврат ТаблицаЗачетаАванса;
	
КонецФункции


// --- Таможенная декларация по импорту ---

Функция ТаблицаЗачетаАванса_ГТДИмпорт(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ГТДИмпорт");
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, Неопределено, Неопределено);
	КонецЕсли;		
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	ПараметрыРасчетаОстатковАванса = СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, СтрокаДокумента, ТаблицаРасчетов, ПараметрыРасчетаАванса);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	Возврат ТаблицаЗачетаАванса;
	
КонецФункции

Функция ГТДИмпорт_Материалы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ГТДИмпорт");

	КонецЕсли;
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("ФактурнаяСтоимость");
	ПересчитываемыеПоля.Добавить("СуммаНДС");
	ПересчитываемыеПоля.Добавить("СуммаПошлины");
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ГТДИмпорт.ТабличныеЧасти.Материалы);
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	ПараметрыПодготовкиТЧ = ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов(ВариантВызова, ИсточникиДанных, Параметры, "Материалы", ПоляФункции, ПересчитываемыеПоля, ПараметрыРасчетаАванса);	
	ПараметрыПодготовкиТЧ.МассивКолонокДенежногоОбязательства = ПересчитываемыеПоля;
	Возврат ПодготовитьТабличнуюЧастьСЗачетомАванса(ПараметрыПодготовкиТЧ);
	
КонецФункции // ПоступлениеМЗ_Материалы_СЗачетомАванса()

Функция ГТДИмпорт_ОсновныеСредства_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ГТДИмпорт");

	КонецЕсли;
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("ФактурнаяСтоимость");
	ПересчитываемыеПоля.Добавить("СуммаНДС");
	ПересчитываемыеПоля.Добавить("СуммаПошлины");
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ГТДИмпорт.ТабличныеЧасти.ОсновныеСредства);
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	ПараметрыПодготовкиТЧ = ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов(ВариантВызова, ИсточникиДанных, Параметры, "ОсновныеСредства", ПоляФункции, ПересчитываемыеПоля, ПараметрыРасчетаАванса);
	ПараметрыПодготовкиТЧ.МассивКолонокДенежногоОбязательства = ПересчитываемыеПоля;
	Возврат ПодготовитьТабличнуюЧастьСЗачетомАванса(ПараметрыПодготовкиТЧ);
	
КонецФункции // ПоступлениеМЗ_Материалы_СЗачетомАванса()

Функция ГТДИмпорт_Штрафы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ГТДИмпорт");

	КонецЕсли;
	
	ПересчитываемыеПоля = Новый Массив;
	ПересчитываемыеПоля.Добавить("ТаможенныйШтрафВал");
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить(Метаданные.Документы.ГТДИмпорт);
	
	ПоляФункции = ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля);
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2,ДопустимыйЗнак.Любой));
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);
	ТаблицаРасчетов.Свернуть("Валюта, КПС, КФО, СчетРасчетов", "Сумма");
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	ПараметрыРасчетаОстатковАванса = СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, СтрокаДокумента, ТаблицаРасчетов, ПараметрыРасчетаАванса);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	ТаблицаЗачетаАванса.Свернуть("Валюта, КПС, КФО, СчетРасчетов", "Сумма, ВалютнаяСумма");
	ТаблицаЗачетаАванса.Колонки.Добавить("Курс", Новый ОписаниеТипов("Число"));
	ТаблицаЗачетаАванса.Колонки.Добавить("ВалютнаяСуммаВсего", ОписаниеТипаСуммы);
	ТаблицаЗачетаАванса.Колонки.Добавить("ДоляЗачетаАванса", Новый ОписаниеТипов("Число"));
	
	СтруктураПоискаРасчетов = Новый Структура("Валюта, КПС, КФО, СчетРасчетов");
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Для каждого СтрокаЗачетаАванса Из ТаблицаЗачетаАванса Цикл
	
		СтрокаЗачетаАванса.Курс = ?(СтрокаЗачетаАванса.ВалютнаяСумма = 0, 1, СтрокаЗачетаАванса.Сумма / СтрокаЗачетаАванса.ВалютнаяСумма);
		ЗаполнитьЗначенияСвойств(СтруктураПоискаРасчетов, СтрокаЗачетаАванса);
		СтрокиРасчетов = ТаблицаРасчетов.НайтиСтроки(СтруктураПоискаРасчетов);
		Для каждого ТекСтрокаРасчетов Из СтрокиРасчетов Цикл
			СтрокаЗачетаАванса.ВалютнаяСуммаВсего = СтрокаЗачетаАванса.ВалютнаяСуммаВсего + ТекСтрокаРасчетов.Сумма;
		КонецЦикла;
		СтрокаЗачетаАванса.ДоляЗачетаАванса = СтрокаЗачетаАванса.ВалютнаяСумма / СтрокаЗачетаАванса.ВалютнаяСуммаВсего;
	
	КонецЦикла;
	
	Курс		= КонтекстПроведения.Курс;
	Кратность	= КонтекстПроведения.Кратность;
	
	ИменаКолонок_ВРублях = Новый Массив;
	Для каждого ИмяКолонки Из ПересчитываемыеПоля Цикл
	
		ИменаКолонок_ВРублях.Добавить(ИмяКолонки + "_ВРублях");
	
	КонецЦикла; 
	
	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	ТаблицаРезультат.Колонки.Добавить("СуммаДенежногоОбязательства", ОписаниеТипаСуммы);
	ТаблицаРезультат.Колонки.Добавить("СуммаДенежногоОбязательства_ВРублях", ОписаниеТипаСуммы);
	
	СтруктураПоискаАвансов = Новый Структура("Валюта, КПС, КФО, СчетРасчетов");
	СтруктураПоискаАвансов.Вставить("КПС",		ПараметрыРасчетаАванса.Параметр_КПС);
	СтруктураПоискаАвансов.Вставить("КФО",		СтрокаДокумента[ПрефиксДокумента + "КФО"]);
	СтруктураПоискаАвансов.Вставить("СчетРасчетов",	ПараметрыРасчетаАванса.Параметр_СчетРасчетовПоШтрафам);
	
	Если СтрокаДокумента[ПрефиксДокумента + "ТаможенныйШтрафВал"] <> 0 Тогда
		СтруктураПоискаАвансов.Вставить("Валюта",		СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"]);
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		Для каждого ТекПолеФункции Из ПоляФункции Цикл
			
			Если ИменаКолонок_ВРублях.Найти(ТекПолеФункции.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекПолеФункции.Имя = "ТаможенныйШтраф" Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока[ТекПолеФункции.Имя] = СтрокаДокумента[ПрефиксДокумента + ТекПолеФункции.Имя];
		
		КонецЦикла; 
		
		СтрокиАвансов = ТаблицаЗачетаАванса.НайтиСтроки(СтруктураПоискаАвансов);
		Если СтрокиАвансов.Количество() = 1 Тогда
			
			Для каждого ПересчитываемоеПоле Из ПересчитываемыеПоля Цикл
			
				НоваяСтрока[ПересчитываемоеПоле + "_ВРублях"] = НоваяСтрока[ПересчитываемоеПоле] *  СтрокиАвансов[0].Курс * СтрокиАвансов[0].ДоляЗачетаАванса
					+ НоваяСтрока[ПересчитываемоеПоле] *  Курс / Кратность * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
					
			КонецЦикла; 
			
			НоваяСтрока.СуммаДенежногоОбязательства = НоваяСтрока["ТаможенныйШтрафВал"] * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
			НоваяСтрока.СуммаДенежногоОбязательства_ВРублях = НоваяСтрока["ТаможенныйШтрафВал"] *  Курс / Кратность * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
			
		Иначе
			
			Для каждого ПересчитываемоеПоле Из ПересчитываемыеПоля Цикл
			
				НоваяСтрока[ПересчитываемоеПоле + "_ВРублях"] = НоваяСтрока[ПересчитываемоеПоле] *  Курс / Кратность;
			
			КонецЦикла; 
			
			НоваяСтрока.СуммаДенежногоОбязательства = НоваяСтрока["ТаможенныйШтрафВал"];
			НоваяСтрока.СуммаДенежногоОбязательства_ВРублях = НоваяСтрока["ТаможенныйШтрафВал_ВРублях"];
			
		КонецЕсли;
	КонецЕсли;	
	
	Если СтрокаДокумента[ПрефиксДокумента + "ТаможенныйШтраф"] <> 0 Тогда
		СтруктураПоискаАвансов.Вставить("Валюта", Константы.ВалютаРегламентированногоУчета.Получить());
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		Для каждого ТекПолеФункции Из ПоляФункции Цикл
			
			Если ИменаКолонок_ВРублях.Найти(ТекПолеФункции.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекПолеФункции.Имя = "ТаможенныйШтрафВал" Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекПолеФункции.Имя = "ВалютаДокумента" Тогда
				НоваяСтрока[ТекПолеФункции.Имя] = Константы.ВалютаРегламентированногоУчета.Получить();
			Иначе
				НоваяСтрока[ТекПолеФункции.Имя] = СтрокаДокумента[ПрефиксДокумента + ТекПолеФункции.Имя];
			КонецЕсли;
		
		КонецЦикла; 
		
		СтрокиАвансов = ТаблицаЗачетаАванса.НайтиСтроки(СтруктураПоискаАвансов);
		Если СтрокиАвансов.Количество() = 1 Тогда
			
			НоваяСтрока.СуммаДенежногоОбязательства = НоваяСтрока["ТаможенныйШтраф"] * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
			
		Иначе
			
			НоваяСтрока.СуммаДенежногоОбязательства = НоваяСтрока["ТаможенныйШтраф"];
			
		КонецЕсли;
		НоваяСтрока.СуммаДенежногоОбязательства_ВРублях = НоваяСтрока.СуммаДенежногоОбязательства;
		
	КонецЕсли;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРезультат;
	
КонецФункции // ПоступлениеМЗ_Материалы_СЗачетомАванса()

Функция ТаблицаПринятияДенежногоОбязательства_ГТДИмпорт(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	ГруппируемыеПоля = "КПС,КЭК";
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		
		Возврат ОписаниеПараметровДляФункцийПоступленияНФА("ГТДИмпорт");
		
	КонецЕсли;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		
		Возврат ОписаниеПолейТаблицыПринятияДенежногоОбязательства(ГруппируемыеПоля);

	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ОписаниеПолейТаблицыПринятияДенежногоОбязательства(ГруппируемыеПоля));
	
	ПараметрыРасчетаАванса = СтруктураПараметровДляЗачетаАвансов(Параметры);
	
	ТаблицаРасчетаДО = ГТДИмпорт_Материалы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	Для каждого ТекСтрока Из ТаблицаРасчетаДО Цикл
		
		КЭК340 = БухгалтерскийУчетПовтИсп.КЭКПоКоду("340");
		
		Если ТекСтрока.СуммаДенежногоОбязательства <> 0 Тогда
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.КПС				= ПараметрыРасчетаАванса.Параметр_КПС;
			НоваяСтрока.КЭК				= КЭК340;
			НоваяСтрока.Сумма			= ТекСтрока.СуммаДенежногоОбязательства;
			НоваяСтрока.Сумма_ВРублях	= ТекСтрока.СуммаДенежногоОбязательства_ВРублях;
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаРасчетаДО = ГТДИмпорт_ОсновныеСредства_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	Для каждого ТекСтрока Из ТаблицаРасчетаДО Цикл
		
		КЭК310 = БухгалтерскийУчетПовтИсп.КЭКПоКоду("310");
		
		Если ТекСтрока.СуммаДенежногоОбязательства <> 0 Тогда
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.КПС				= ПараметрыРасчетаАванса.Параметр_КПС;
			НоваяСтрока.КЭК				= КЭК310;
			НоваяСтрока.Сумма			= ТекСтрока.СуммаДенежногоОбязательства;
			НоваяСтрока.Сумма_ВРублях	= ТекСтрока.СуммаДенежногоОбязательства_ВРублях;
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаРасчетаДО = ГТДИмпорт_Штрафы_СЗачетомАванса(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры);
	Для каждого ТекСтрока Из ТаблицаРасчетаДО Цикл
		
		СчетРасчетов = ПараметрыРасчетаАванса.Параметр_СчетРасчетовПоШтрафам;
		КЭК = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(СчетРасчетов);
		
		Если ТекСтрока.СуммаДенежногоОбязательства <> 0 Тогда
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.КПС				= ПараметрыРасчетаАванса.Параметр_КПС;
			НоваяСтрока.КЭК				= КЭК;
			НоваяСтрока.Сумма			= ТекСтрока.СуммаДенежногоОбязательства;
			НоваяСтрока.Сумма_ВРублях	= ТекСтрока.СуммаДенежногоОбязательства_ВРублях;
		КонецЕсли;
	
	КонецЦикла;
	
	ТаблицаРезультат.Свернуть(ГруппируемыеПоля, "Сумма, Сумма_ВРублях");
	
	Возврат ТаблицаРезультат;
		
КонецФункции // ТаблицаПринятияДенежногоОбязательства_МЗ()


// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ ЗАЧЕТА АВАНСОВ

Функция ЗаполнитьПоляФункцииИзОписанияМетаданных(МассивМетаданных, ПересчитываемыеПоля)

	ПоляФункции = Новый Массив;
	ДобавитьПоляИзПересеченияТабличныхЧастей(ПоляФункции, МассивМетаданных);
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2,ДопустимыйЗнак.Любой));
    Для каждого ИмяПересчитываемогоПоля Из ПересчитываемыеПоля Цикл
	
		ДобавитьПолеРезультатаФункции(ПоляФункции, ИмяПересчитываемогоПоля + "_ВРублях", ОписаниеТипаСуммы);
	
	КонецЦикла; 
	
	Возврат ПоляФункции;
	
КонецФункции

Функция ПолучитьОстаткиАванса_ПустаяТаблица() Экспорт

	ТаблицаАвансов = Новый ТаблицаЗначений;
	ТаблицаАвансов.Колонки.Добавить("Счет",					Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаАвансов.Колонки.Добавить("Организация",			Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаАвансов.Колонки.Добавить("КПС",					Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаАвансов.Колонки.Добавить("ИФО",					Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаАвансов.Колонки.Добавить("КФО",					Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаАвансов.Колонки.Добавить("Подразделение",		Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ТаблицаАвансов.Колонки.Добавить("Валюта",				Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаАвансов.Колонки.Добавить("Контрагент",			Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаАвансов.Колонки.Добавить("Договор",				Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаАвансов.Колонки.Добавить("ДокументАванса");
	ТаблицаАвансов.Колонки.Добавить("ДатаАванса",			Новый ОписаниеТипов("Дата"));
	ТаблицаАвансов.Колонки.Добавить("ДопСубконто");
	ТаблицаАвансов.Колонки.Добавить("СуммаОстаток",			Новый ОписаниеТипов("Число"));
	ТаблицаАвансов.Колонки.Добавить("ВалютнаяСуммаОстаток",	Новый ОписаниеТипов("Число"));
	ТаблицаАвансов.Колонки.Добавить("Валютный_206",			Новый ОписаниеТипов("Булево"));
	ТаблицаАвансов.Колонки.Добавить("СчетРасчетов",			Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	Возврат ТаблицаАвансов;

КонецФункции // ПолучитьОстаткиАвансоа_ПустаяТаблица()

Функция ОписаниеПолейТаблицыПринятияДенежногоОбязательства(ГруппируемыеПоля = "КПС")

	ПоляФункции = Новый Массив;
	Если Найти(ГруппируемыеПоля, "КПС") > 0 Тогда
		ДобавитьПолеРезультатаФункции(ПоляФункции, "КПС",		Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));	
	КонецЕсли;
	Если Найти(ГруппируемыеПоля, "КЭК") > 0 Тогда
		ДобавитьПолеРезультатаФункции(ПоляФункции, "КЭК",		Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));	
	КонецЕсли;
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Сумма",			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Сумма_ВРублях",	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));	
	Возврат ПоляФункции;	

КонецФункции // ОписаниеПолейТаблицыПринятияДенежногоОбязательства()

Процедура ДобавитьПоляИзПересеченияТабличныхЧастей(Поля, ТаблицаМетаданных)

	Для каждого РеквизитМетаданного Из ТаблицаМетаданных[0].Реквизиты Цикл
		
		ЕстьВоВсехМетаданных = Истина;
		Для ИндексМетаданных = 1 По ТаблицаМетаданных.ВГраница() Цикл
		
			Если ТаблицаМетаданных[ИндексМетаданных].Реквизиты.Найти(РеквизитМетаданного.Имя) = Неопределено Тогда
				ЕстьВоВсехМетаданных = Ложь;
				Прервать;
			КонецЕсли;
		
		КонецЦикла; 
		
		Если Не ЕстьВоВсехМетаданных Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавитьПолеРезультатаФункции(Поля, РеквизитМетаданного.Имя, РеквизитМетаданного.Тип);
	
	КонецЦикла; 
	
КонецПроцедуры

Функция ОписаниеПараметровДляФункцийПоступленияНФА(ВидПоступления)

	ПараметрыФункции = Новый Массив;
	Если ВидПоступления = "ПоступлениеМЗ" Тогда
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",			Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетов",	Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
	ИначеЕсли ВидПоступления = "ПоступлениеУслуг" Тогда
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",			Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		
	ИначеЕсли ВидПоступления = "ПоступлениеОС" Тогда
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",			Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",			Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетВложения",	Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
	ИначеЕсли ВидПоступления = "ГТДИмпорт" Тогда
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КФО",					Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "КПС",					Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "СчетРасчетовПоШтрафам",	Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
		
	КонецЕсли;
	Возврат ПараметрыФункции;

КонецФункции // ОписаниеПараметровДляФункцийПоступленияНФА()

Функция СтруктураПараметровДляЗачетаАвансов(Параметры) Экспорт
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;
	Перем Параметр_КПС;
	Перем Параметр_СчетВложения;
	Перем Параметр_СчетРасчетовПоШтрафам;

	Если НЕ Параметры.Свойство("КФО", Параметр_КФО) Тогда
		Параметр_КФО = Перечисления.КВД.ПустаяСсылка();
	КонецЕсли;
	Если НЕ Параметры.Свойство("КПС", Параметр_КПС) Тогда
		Параметр_КПС = Справочники.КлассификационныеПризнакиСчетов.ПустаяСсылка();
	КонецЕсли;
	Если НЕ Параметры.Свойство("СчетВложения", Параметр_СчетВложения) Тогда
		Параметр_СчетВложения = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	Если НЕ Параметры.Свойство("СчетРасчетов", Параметр_СчетРасчетов) Тогда
		Параметр_СчетРасчетов = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	Если НЕ Параметры.Свойство("СчетРасчетовПоШтрафам", Параметр_СчетРасчетовПоШтрафам) Тогда
		Параметр_СчетРасчетовПоШтрафам = ПланыСчетов.ЕПСБУ.ПустаяСсылка();
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Параметр_СчетРасчетов",				Параметр_СчетРасчетов);
	Результат.Вставить("Параметр_СчетВложения",				Параметр_СчетВложения);
	Результат.Вставить("Параметр_КФО",						Параметр_КФО);
	Результат.Вставить("Параметр_КПС",						Параметр_КПС);
	Результат.Вставить("Параметр_СчетРасчетовПоШтрафам",	Параметр_СчетРасчетовПоШтрафам);
	
	Возврат Результат;

КонецФункции // СтруктураПараметровДляЗачетаАвансов()

Функция СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, Объект, ТаблицаРасчетов, ПараметрыРасчетаАванса) Экспорт

	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	ПараметрыРасчетаОстатковАвансов = ПараметрыРасчетаТаблицыАвансов();
	
	Ссылка = Объект[ПрефиксДокумента + "Ссылка"];
	Если Ссылка.Пустая() Тогда
		Период = Новый Граница(КонецДня(Объект[ПрефиксДокумента + "Дата"]), ВидГраницы.Включая);
	Иначе
		Период = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	ПараметрыРасчетаОстатковАвансов.Период 		= Период;
	ПараметрыРасчетаОстатковАвансов.ИФО			= Объект[ПрефиксДокумента + "ИФО"];
	ПараметрыРасчетаОстатковАвансов.Организация = Объект[ПрефиксДокумента + "Организация"];
	ПараметрыРасчетаОстатковАвансов.Контрагент	= Объект[ПрефиксДокумента + "Контрагент"];
	ПараметрыРасчетаОстатковАвансов.Договор		= Объект[ПрефиксДокумента + "Договор"];
	
	Если ЗначениеЗаполнено(ПараметрыРасчетаАванса.Параметр_КФО) Тогда
		ПараметрыРасчетаОстатковАвансов.КФО.Добавить(ПараметрыРасчетаАванса.Параметр_КФО);
	КонецЕсли;
	
	Для каждого СтрокаТаблицыРасчетов Из ТаблицаРасчетов Цикл
	
		Если ПараметрыРасчетаОстатковАвансов.КПС.Найти(СтрокаТаблицыРасчетов.КПС) = Неопределено Тогда
			ПараметрыРасчетаОстатковАвансов.КПС.Добавить(СтрокаТаблицыРасчетов.КПС);
		КонецЕсли;
		Если ПараметрыРасчетаОстатковАвансов.Счета302.Найти(СтрокаТаблицыРасчетов.СчетРасчетов) = Неопределено Тогда
			ПараметрыРасчетаОстатковАвансов.Счета302.Добавить(СтрокаТаблицыРасчетов.СчетРасчетов);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ПараметрыРасчетаОстатковАвансов;

КонецФункции // СтруктураПараметровРасчетаОстатковАванса()

Функция ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов(ВариантВызова, ИсточникиДанных, Параметры, ИмяТабличнойЧасти, ПоляФункции, ПересчитываемыеПоля, ПараметрыРасчетаАванса)

	ПараметрыПодготовкиТЧ = Новый Структура;
	// обязательные параметры
	ПараметрыПодготовкиТЧ.Вставить("ВариантВызова",				ВариантВызова);
	ПараметрыПодготовкиТЧ.Вставить("ИсточникиДанных",			ИсточникиДанных);
	ПараметрыПодготовкиТЧ.Вставить("Параметры",					Параметры);
	ПараметрыПодготовкиТЧ.Вставить("ИмяТабличнойЧасти",			ИмяТабличнойЧасти);
	ПараметрыПодготовкиТЧ.Вставить("ПоляФункции",				ПоляФункции);
	ПараметрыПодготовкиТЧ.Вставить("ПересчитываемыеПоля",		ПересчитываемыеПоля);
	ПараметрыПодготовкиТЧ.Вставить("ПараметрыРасчетаАванса",	ПараметрыРасчетаАванса);
	// необязательные параметры
	ПараметрыПодготовкиТЧ.Вставить("ИмяКолонкиДенежногоОбязательства",		"");
	ПараметрыПодготовкиТЧ.Вставить("МассивКолонокДенежногоОбязательства",	Неопределено);
	ПараметрыПодготовкиТЧ.Вставить("ТаблицаРасчетов",						Неопределено);
	
	Возврат ПараметрыПодготовкиТЧ;
	
КонецФункции // ОбщиеПараметрыПодготовкиТабличнойЧастиСЗачетомАвансов()

Функция ПоляФункцииТаблицыОстатковАвансов()

	ПоляФункции = Новый Массив;
	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КФО",				Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "КПС",				Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетРасчетов",		Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетАванса",		Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Валюта",			Новый ОписаниеТипов("СправочникСсылка.Валюты"));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Сумма",				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ВалютнаяСумма",		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ДокументАванса",	ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов.ТипЗначения);
	ДобавитьПолеРезультатаФункции(ПоляФункции, "ДопСубконто",		Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);
	
	Возврат ПоляФункции;

КонецФункции // ПоляФункцииТаблицыОстатковАвансов()


// ОБЩИЕ ФУНКЦИИ ЗАЧЕТА ВЫДАННЫХ АВАНСОВ

Функция ПодготовитьТабличнуюЧастьСЗачетомАванса(ПараметрыФункции)
	
	ВариантВызова = ПараметрыФункции.ВариантВызова;
	ИсточникиДанных						= ПараметрыФункции.ИсточникиДанных;
	Параметры							= ПараметрыФункции.Параметры;
	ИмяТабличнойЧасти					= ПараметрыФункции.ИмяТабличнойЧасти;
	ПоляФункции							= ПараметрыФункции.ПоляФункции;
	ПересчитываемыеПоля					= ПараметрыФункции.ПересчитываемыеПоля;
	ПараметрыРасчетаАванса				= ПараметрыФункции.ПараметрыРасчетаАванса;
	ИмяКолонкиДенежногоОбязательства	= ПараметрыФункции.ИмяКолонкиДенежногоОбязательства;
	МассивКолонокДенежногоОбязательства	= ПараметрыФункции.МассивКолонокДенежногоОбязательства;
	ТаблицаРасчетов						= ПараметрыФункции.ТаблицаРасчетов;
	
	ОписаниеТипаСуммы = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2,ДопустимыйЗнак.Любой));
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	МетаданныеСсылки = Метаданные.НайтиПоТипу(ТипЗначенияСсылки);
	ПараметрыЗаполнения_КПСвТЧ = МетаданныеСсылки.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты.Найти("КПС") <> Неопределено;
	ПараметрыЗаполнения_КФОвТЧ = МетаданныеСсылки.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты.Найти("КФО") <> Неопределено;
	ПараметрыЗаполнения_ЭтоПоступлениеУслуг = ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеУслугРабот");
	ПараметрыЗаполнения_ЭтоПоступлениеОС = (ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеОС"))
										ИЛИ (ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеОСВПути"));
	ПараметрыЗаполнения_ЭтоПоступлениеМЗ = (ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеМЗ"))
										ИЛИ (ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеМЗВПути"));
	ПараметрыЗаполнения_ЭтоГТДИмпорт = (ТипЗначенияСсылки = Тип("ДокументСсылка.ГТДИмпорт"));
	
	ТаблицаРасчетов = ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса);
	ТаблицаРасчетов.Свернуть("Валюта, КПС, КФО, СчетРасчетов", "Сумма");
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных["Документ"][0];
	ТекущийКонтекст = Новый Структура;
	ТекущийКонтекст.Вставить("Период", ?(ДокументСсылка.Пустая(), СтрокаДокумента[ПрефиксДокумента + "Дата"], ДокументСсылка));
	ТекущийКонтекст.Вставить("ТаблицаРасчетов", ТаблицаРасчетов);
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("КонтекстРасчетаАвансов", ТекущийКонтекст);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	ПараметрыРасчетаОстатковАванса = СтруктураПараметровРасчетаОстатковАванса(ТипЗначенияСсылки, СтрокаДокумента, ТаблицаРасчетов, ПараметрыРасчетаАванса);
	ТаблицаЗачетаАванса = ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	ТаблицаЗачетаАванса.Свернуть("Валюта, КПС, КФО, СчетРасчетов", "Сумма, ВалютнаяСумма");
	ТаблицаЗачетаАванса.Колонки.Добавить("Курс", Новый ОписаниеТипов("Число"));
	ТаблицаЗачетаАванса.Колонки.Добавить("ВалютнаяСуммаВсего", ОписаниеТипаСуммы);
	ТаблицаЗачетаАванса.Колонки.Добавить("ДоляЗачетаАванса", Новый ОписаниеТипов("Число"));
	
	СтруктураПоискаРасчетов = Новый Структура("Валюта, КПС, КФО, СчетРасчетов");
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	Для каждого СтрокаЗачетаАванса Из ТаблицаЗачетаАванса Цикл
	
		СтрокаЗачетаАванса.Курс = ?(СтрокаЗачетаАванса.ВалютнаяСумма = 0, 1, СтрокаЗачетаАванса.Сумма / СтрокаЗачетаАванса.ВалютнаяСумма);
		ЗаполнитьЗначенияСвойств(СтруктураПоискаРасчетов, СтрокаЗачетаАванса);
		СтрокиРасчетов = ТаблицаРасчетов.НайтиСтроки(СтруктураПоискаРасчетов);
		Для каждого ТекСтрокаРасчетов Из СтрокиРасчетов Цикл
			СтрокаЗачетаАванса.ВалютнаяСуммаВсего = СтрокаЗачетаАванса.ВалютнаяСуммаВсего + ТекСтрокаРасчетов.Сумма;
		КонецЦикла;
		СтрокаЗачетаАванса.ДоляЗачетаАванса = СтрокаЗачетаАванса.ВалютнаяСумма / СтрокаЗачетаАванса.ВалютнаяСуммаВсего;
	
	КонецЦикла;
	
	Курс		= КонтекстПроведения.Курс;
	Кратность	= КонтекстПроведения.Кратность;
	
	ИменаКолонок_ВРублях = Новый Массив;
	Для каждого ИмяКолонки Из ПересчитываемыеПоля Цикл
	
		ИменаКолонок_ВРублях.Добавить(ИмяКолонки + "_ВРублях");
	
	КонецЦикла; 
	
	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	ТаблицаРезультат.Колонки.Добавить("СуммаДенежногоОбязательства", ОписаниеТипаСуммы);
	ТаблицаРезультат.Колонки.Добавить("СуммаДенежногоОбязательства_ВРублях", ОписаниеТипаСуммы);
	
	СтруктураПоискаАвансов = Новый Структура("Валюта, КПС, КФО, СчетРасчетов");
	ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных(ИмяТабличнойЧасти);
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	ПрефиксДопРеквизита = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит");
	Для каждого СтрокаДокумента Из ИсточникиДанных[ИмяТабличнойЧасти] Цикл
		
		НоваяСтрока = ТаблицаРезультат.Добавить();
		Для каждого ТекПолеФункции Из ПоляФункции Цикл
			
			Если ИменаКолонок_ВРублях.Найти(ТекПолеФункции.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока[ТекПолеФункции.Имя] = СтрокаДокумента[ПрефиксКолонки + ТекПолеФункции.Имя];
		
		КонецЦикла; 
		
		СтруктураПоискаАвансов = Новый Структура("Валюта, КПС, КФО, СчетРасчетов");
		СтруктураПоискаАвансов.Вставить("Валюта",		СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"]);
		Если ПараметрыЗаполнения_КПСвТЧ Тогда
			СтруктураПоискаАвансов.Вставить("КПС",		СтрокаДокумента[ПрефиксКолонки + "КПС"]);
		Иначе
			СтруктураПоискаАвансов.Вставить("КПС",		ПараметрыРасчетаАванса.Параметр_КПС);
		КонецЕсли;			
		Если ПараметрыЗаполнения_КФОвТЧ Тогда
			СтруктураПоискаАвансов.Вставить("КФО",		СтрокаДокумента[ПрефиксКолонки + "КФО"]);
		Иначе
			СтруктураПоискаАвансов.Вставить("КФО",		ПараметрыРасчетаАванса.Параметр_КФО);
		КонецЕсли;			
		СчетРасчетов = ПараметрыРасчетаАванса.Параметр_СчетРасчетов;
		Если ПараметрыЗаполнения_ЭтоПоступлениеУслуг Тогда
			СчетРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьАналитическийСчетПоКЭК(СтрокаДокумента[ПрефиксКолонки + "КЭК"], "302.00",, КонтекстПроведения.ДокументОбъект.Дата);
		ИначеЕсли ПараметрыЗаполнения_ЭтоПоступлениеОС Тогда
			СчетРасчетов = БухгалтерскиеОперации.СчетПоставщикаТМЦ(СтрокаДокумента[ПрефиксКолонки + "ВнеоборотныйАктив"], ?(ЗначениеЗаполнено(ПараметрыРасчетаАванса.Параметр_СчетВложения),ПараметрыРасчетаАванса.Параметр_СчетВложения,СтрокаДокумента.КапВложения_СчетУчета));
		ИначеЕсли ПараметрыЗаполнения_ЭтоПоступлениеМЗ И Не ЗначениеЗаполнено(СчетРасчетов) Тогда
			СчетРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("302.34");
		ИначеЕсли ПараметрыЗаполнения_ЭтоГТДИмпорт Тогда
			Если ИмяТабличнойЧасти = "Материалы" Тогда
				СчетРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("302.34");
			ИначеЕсли ИмяТабличнойЧасти = "ОсновныеСредства" Тогда
				СчетРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("302.31");
			КонецЕсли;
		КонецЕсли;
		СтруктураПоискаАвансов.Вставить("СчетРасчетов",	СчетРасчетов);
		СтрокиАвансов = ТаблицаЗачетаАванса.НайтиСтроки(СтруктураПоискаАвансов);
		Если СтрокиАвансов.Количество() = 1 Тогда
			
			Для каждого ПересчитываемоеПоле Из ПересчитываемыеПоля Цикл
			
				НоваяСтрока[ПересчитываемоеПоле + "_ВРублях"] = НоваяСтрока[ПересчитываемоеПоле] *  СтрокиАвансов[0].Курс * СтрокиАвансов[0].ДоляЗачетаАванса
					+ НоваяСтрока[ПересчитываемоеПоле] *  Курс / Кратность * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
					
			КонецЦикла; 
			
			Если ЗначениеЗаполнено(ИмяКолонкиДенежногоОбязательства) Тогда
				НоваяСтрока.СуммаДенежногоОбязательства = НоваяСтрока[ИмяКолонкиДенежногоОбязательства] * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
				НоваяСтрока.СуммаДенежногоОбязательства_ВРублях = НоваяСтрока[ИмяКолонкиДенежногоОбязательства] *  Курс / Кратность * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
			ИначеЕсли ЗначениеЗаполнено(МассивКолонокДенежногоОбязательства) Тогда
				
				Для каждого КолонкаДО Из МассивКолонокДенежногоОбязательства Цикл
				
					НоваяСтрока.СуммаДенежногоОбязательства 		= НоваяСтрока.СуммаДенежногоОбязательства			
																	+ НоваяСтрока[КолонкаДО] * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);
					НоваяСтрока.СуммаДенежногоОбязательства_ВРублях = НоваяСтрока.СуммаДенежногоОбязательства_ВРублях	
																	+ НоваяСтрока[КолонкаДО] *  Курс / Кратность * (1 - СтрокиАвансов[0].ДоляЗачетаАванса);

				КонецЦикла; 
				
			КонецЕсли;
			
		Иначе
			
			Для каждого ПересчитываемоеПоле Из ПересчитываемыеПоля Цикл
			
				НоваяСтрока[ПересчитываемоеПоле + "_ВРублях"] = НоваяСтрока[ПересчитываемоеПоле] *  Курс / Кратность;
			
			КонецЦикла; 
			
			Если ЗначениеЗаполнено(ИмяКолонкиДенежногоОбязательства) Тогда
				НоваяСтрока.СуммаДенежногоОбязательства = НоваяСтрока[ИмяКолонкиДенежногоОбязательства];
				НоваяСтрока.СуммаДенежногоОбязательства_ВРублях = НоваяСтрока[ИмяКолонкиДенежногоОбязательства + "_ВРублях"];
			ИначеЕсли ЗначениеЗаполнено(МассивКолонокДенежногоОбязательства) Тогда
				
				Для каждого КолонкаДО Из МассивКолонокДенежногоОбязательства Цикл
				
					НоваяСтрока.СуммаДенежногоОбязательства			= НоваяСтрока.СуммаДенежногоОбязательства			+ НоваяСтрока[КолонкаДО];
					НоваяСтрока.СуммаДенежногоОбязательства_ВРублях	= НоваяСтрока.СуммаДенежногоОбязательства_ВРублях	+ НоваяСтрока[КолонкаДО + "_ВРублях"];
				
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаРезультат;

КонецФункции

Функция ПолучитьОстаткиАванса(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса) Экспорт

	Если КонтекстПроведения.ДополнительныеСвойства.Свойство("ТаблицаАвансов") = Истина Тогда
		Возврат КонтекстПроведения.ДополнительныеСвойства.ТаблицаАвансов.Скопировать();
	КонецЕсли;
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	СтрокаДокумента = ИсточникиДанных.Документ[0];
	
	Если СтрокаДокумента[ПрефиксДокумента + "СпособЗачетаАванса"] = Перечисления.СпособыЗачетаАвансов.Автоматически Тогда
		
		ТаблицаАвансов = ПолучитьОстаткиАванса_Автоматически(ПараметрыРасчетаОстатковАванса);
		
	ИначеЕсли СтрокаДокумента[ПрефиксДокумента + "СпособЗачетаАванса"] = Перечисления.СпособыЗачетаАвансов.ПоДокументу Тогда
		
		ТаблицаАвансов = ПолучитьОстаткиАванса_ПоДокументу(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
		
	Иначе
		
		ТаблицаАвансов = ПолучитьОстаткиАванса_ПустаяТаблица();
		
	КонецЕсли;
	
	КонтекстПроведения.ДополнительныеСвойства.Вставить("ТаблицаАвансов", ТаблицаАвансов);
	
	Возврат ТаблицаАвансов.Скопировать();

КонецФункции // ПолучитьОстаткиАванса()

Функция ПолучитьОстаткиАванса_Автоматически(ПараметрыРасчетаОстатковАванса) Экспорт 
	
	ВызватьИсключение НСтр("ru = 'Функция устарела'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция ПолучитьОстаткиАванса_ПоДокументу(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса) 

	ВызватьИсключение НСтр("ru = 'Функция устарела'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

Функция ЗаполнитьТаблицуПринятияДенежногоОбязательства(ТаблицыДляРасчетаТаблицыПринятияДО, ГруппируемыеПоля = "КПС")

	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ОписаниеПолейТаблицыПринятияДенежногоОбязательства(ГруппируемыеПоля));
	
	Для каждого ТаблицаРасчетаДО Из ТаблицыДляРасчетаТаблицыПринятияДО Цикл
	
		Для каждого ТекСтрока Из ТаблицаРасчетаДО Цикл
			
			Если ТекСтрока.СуммаДенежногоОбязательства <> 0 Тогда
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока, ГруппируемыеПоля);
				НоваяСтрока.Сумма			= ТекСтрока.СуммаДенежногоОбязательства;
				НоваяСтрока.Сумма_ВРублях	= ТекСтрока.СуммаДенежногоОбязательства_ВРублях;
			КонецЕсли;
		
		КонецЦикла;  
	
	КонецЦикла; 
	
	ТаблицаРезультат.Свернуть(ГруппируемыеПоля, "Сумма, Сумма_ВРублях");
	
	Возврат ТаблицаРезультат;

КонецФункции

Функция ТаблицаРасчетовДляЗачетаАвансов(КонтекстПроведения, ИсточникиДанных, Параметры)
	Перем Параметр_СчетРасчетов;
	Перем Параметр_КФО;
	Перем Параметр_КПС;
	Перем Параметр_СчетВложения;
	Перем Параметр_СчетРасчетовПоШтрафам;
	
	ДокументСсылка = КонтекстПроведения.Ссылка;
	ТипЗначенияСсылки = ТипЗнч(ДокументСсылка);
	
	ТаблицаРасчетов = Новый ТаблицаЗначений;
	ТаблицаРасчетов.Колонки.Добавить("СчетРасчетов",	Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	ТаблицаРасчетов.Колонки.Добавить("КФО",				Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	ТаблицаРасчетов.Колонки.Добавить("КПС",				Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
	ТаблицаРасчетов.Колонки.Добавить("Сумма",			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(18,2)));
	ТаблицаРасчетов.Колонки.Добавить("Валюта",			Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	
	Параметры.Свойство("Параметр_СчетРасчетов",				Параметр_СчетРасчетов);
	Параметры.Свойство("Параметр_КФО",						Параметр_КФО);
	Параметры.Свойство("Параметр_КПС",						Параметр_КПС);
	Параметры.Свойство("Параметр_СчетВложения", 			Параметр_СчетВложения);
	Параметры.Свойство("Параметр_СчетРасчетовПоШтрафам",	Параметр_СчетРасчетовПоШтрафам);
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	
	Если ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеМЗ")
		ИЛИ ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеМЗВПути") Тогда
			
		Если Не ЗначениеЗаполнено(Параметр_СчетРасчетов) Тогда
			Параметр_СчетРасчетов = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("302.34");
		КонецЕсли;
			
		ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Материалы");
		
		Для каждого СтрокаДокумента Из ИсточникиДанных.Материалы Цикл
		
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.СчетРасчетов	= Параметр_СчетРасчетов;
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксКолонки + "Всего"];
			НоваяСтрока.КФО				= Параметр_КФО;
			НоваяСтрока.КПС				= СтрокаДокумента[ПрефиксКолонки + "КПС"];
			НоваяСтрока.Валюта			= СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"];
			
		КонецЦикла;
			
		ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("ВозвратнаяТара");
		
		Для каждого СтрокаДокумента Из ИсточникиДанных.ВозвратнаяТара Цикл
		
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.СчетРасчетов	= Параметр_СчетРасчетов;
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксКолонки + "Сумма"];
			НоваяСтрока.КФО				= Параметр_КФО;
			НоваяСтрока.КПС				= СтрокаДокумента[ПрефиксКолонки + "КПС"];
			НоваяСтрока.Валюта			= СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"];
			
		КонецЦикла;
			
	ИначеЕсли ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеУслугРабот") Тогда
			
		ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("УслугиИРаботы");
		
		Для каждого СтрокаДокумента Из ИсточникиДанных.УслугиИРаботы Цикл
			
			Если ЗначениеЗаполнено(СтрокаДокумента[ПрефиксКолонки + "КЭК"]) Тогда
				
				СчетПоКЭК = БухгалтерскийУчетПовтИсп.ПолучитьАналитическийСчетПоКЭК(СтрокаДокумента[ПрефиксКолонки + "КЭК"], "302.00",, КонтекстПроведения.ДокументОбъект.Дата);
					
				НоваяСтрока = ТаблицаРасчетов.Добавить();
				НоваяСтрока.СчетРасчетов	= СчетПоКЭК;
				НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксКолонки + "Всего"];
				НоваяСтрока.КФО				= Параметр_КФО;
				НоваяСтрока.КПС				= СтрокаДокумента[ПрефиксКолонки + "КПС"];
				НоваяСтрока.Валюта			= СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"];
					
			КонецЕсли;
		
		КонецЦикла;
		
	ИначеЕсли ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеОС") 
		ИЛИ ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеОСВПути") Тогда
		
		ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("КапВложения");
		
		Для каждого СтрокаДокумента Из ИсточникиДанных.КапВложения Цикл
		
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			Если ТипЗначенияСсылки = Тип("ДокументСсылка.ПоступлениеОСВПути") Тогда
				НоваяСтрока.СчетРасчетов	= БухгалтерскиеОперации.СчетПоКоду("302.31");
			Иначе
				НоваяСтрока.СчетРасчетов	= БухгалтерскиеОперации.СчетПоставщикаТМЦ(СтрокаДокумента[ПрефиксКолонки + "ВнеоборотныйАктив"], ?(ЗначениеЗаполнено(Параметр_СчетВложения),Параметр_СчетВложения,СтрокаДокумента.КапВложения_СчетУчета));
			КонецЕсли;
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксКолонки + "Всего"];
			НоваяСтрока.КФО				= Параметр_КФО;
			НоваяСтрока.КПС				= Параметр_КПС;
			НоваяСтрока.Валюта			= СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"];
			
		КонецЦикла;
		
	ИначеЕсли ТипЗначенияСсылки = Тип("ДокументСсылка.ГТДИмпорт") Тогда
		
		ПрефиксКолонки	= БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Материалы");
		ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
		
		Для каждого СтрокаДокумента Из ИсточникиДанных.Материалы Цикл
		
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.СчетРасчетов	= БухгалтерскиеОперации.СчетПоКоду("302.34");
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксКолонки + "СуммаПошлины"] 
										+ СтрокаДокумента[ПрефиксКолонки + "ФактурнаяСтоимость"]
										+ ?(СтрокаДокумента[ПрефиксДокумента + "УчитыватьНДС"] = Истина, СтрокаДокумента[ПрефиксКолонки + "СуммаНДС"], 0);
			НоваяСтрока.КФО				= Параметр_КФО;
			НоваяСтрока.КПС				= Параметр_КПС;
			НоваяСтрока.Валюта			= СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"];
			
		КонецЦикла;
		
		ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("ОсновныеСредства");
		
		Для каждого СтрокаДокумента Из ИсточникиДанных.ОсновныеСредства Цикл
		
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.СчетРасчетов	= БухгалтерскиеОперации.СчетПоКоду("302.31");
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксКолонки + "СуммаПошлины"] 
										+ СтрокаДокумента[ПрефиксКолонки + "ФактурнаяСтоимость"]
										+ ?(СтрокаДокумента[ПрефиксДокумента + "УчитыватьНДС"] = Истина, СтрокаДокумента[ПрефиксКолонки + "СуммаНДС"], 0);
			НоваяСтрока.КФО				= Параметр_КФО;
			НоваяСтрока.КПС				= Параметр_КПС;
			НоваяСтрока.Валюта			= СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"];
			
		КонецЦикла;
		
		СтрокаДокумента = ИсточникиДанных.Документ[0];
		Если СтрокаДокумента[ПрефиксДокумента + "ТаможенныйШтраф"] <> 0 Тогда
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.СчетРасчетов	= Параметр_СчетРасчетовПоШтрафам;
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксДокумента + "ТаможенныйШтраф"];
			НоваяСтрока.КФО				= Параметр_КФО;
			НоваяСтрока.КПС				= Параметр_КПС;
			НоваяСтрока.Валюта			= ВалютаРеглУчета;
		КонецЕсли;
		
		Если СтрокаДокумента[ПрефиксДокумента + "ТаможенныйШтрафВал"] <> 0 Тогда
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.СчетРасчетов	= Параметр_СчетРасчетовПоШтрафам;
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксДокумента + "ТаможенныйШтрафВал"];
			НоваяСтрока.КФО				= Параметр_КФО;
			НоваяСтрока.КПС				= Параметр_КПС;
			НоваяСтрока.Валюта			= СтрокаДокумента[ПрефиксДокумента + "ВалютаДокумента"];
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияСсылки = Тип("ДокументСсылка.ПриходныйОрдерФондовый") Тогда
		
		ВалютаРубли = Константы.ВалютаРегламентированногоУчета.Получить();
		ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Расшифровка");
		Для каждого СтрокаДокумента Из ИсточникиДанных.Расшифровка Цикл
		
			НоваяСтрока = ТаблицаРасчетов.Добавить();
			НоваяСтрока.СчетРасчетов	= СтрокаДокумента[ПрефиксДокумента + "КорСчет"];
			НоваяСтрока.Сумма			= СтрокаДокумента[ПрефиксКолонки + "Сумма"];
			НоваяСтрока.КФО				= СтрокаДокумента[ПрефиксКолонки + "КФО"];;
			НоваяСтрока.КПС				= СтрокаДокумента[ПрефиксКолонки + "КПС"];;
			НоваяСтрока.Валюта			= ВалютаРубли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаРасчетов;

КонецФункции // ТаблицаРасчетовДляЗачетаАвансов()

Функция ТаблицаЗачетаАванса_Основная(ВариантВызова, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса)
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункцииТаблицыОстатковАвансов();
	КонецЕсли;

	Если ВариантВызова <> "Выполнить" Тогда
		ВызватьИсключение "Неправильный вариант вызова функции ТаблицаЗачетаАванса_Основная: " + ВариантВызова;
	КонецЕсли;
	
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	
	ТаблицаРасчетов = КонтекстПроведения.ДополнительныеСвойства.КонтекстРасчетаАвансов.ТаблицаРасчетов;
	ТаблицаРасчетов.Свернуть("СчетРасчетов, КФО, КПС, Валюта", "Сумма");
	
	ОстаткиАвансов = ПолучитьОстаткиАванса(КонтекстПроведения, ИсточникиДанных, ПараметрыРасчетаАванса, ПараметрыРасчетаОстатковАванса);
	
	Результат = ПолучитьТаблицуЗачетаАвансовИзТаблицыРасчетовИТаблицыОстатковАвансов(ТаблицаРасчетов, ОстаткиАвансов);
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	Возврат Результат;
	
Конецфункции

Функция ПолучитьТаблицуЗачетаАвансовИзТаблицыРасчетовИТаблицыОстатковАвансов(ТаблицаРасчетов, ОстаткиАвансов) Экспорт

	ПоляФункции	= ПоляФункцииТаблицыОстатковАвансов();
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ТаблицаРезультат = Новый ТаблицаЗначений;	
	ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции);
	
	СтруктураПоиска = Новый Структура("СчетРасчетов, КФО, КПС, Валюта");
	
	Для каждого СтрокаРасчетов Из ТаблицаРасчетов Цикл
		
		Если СтрокаРасчетов.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СуммаКЗачету = СтрокаРасчетов.Сумма;
	
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРасчетов);
		СтрокиАванса = ОстаткиАвансов.НайтиСтроки(СтруктураПоиска);
		
		Для каждого ТекСтрокаАванса Из СтрокиАванса Цикл
		
			Если ТекСтрокаАванса.Валюта = ВалютаРегламентированногоУчета Тогда
				РублеваяСумма = Мин(ТекСтрокаАванса.СуммаОстаток, СуммаКЗачету);
				Если РублеваяСумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				ВалютнаяСумма = РублеваяСумма;
				Валюта = ВалютаРегламентированногоУчета;
				
				СуммаКЗачету = СуммаКЗачету - РублеваяСумма; 
			Иначе
				Валюта = ТекСтрокаАванса.Валюта;
				Если СуммаКЗачету >= ТекСтрокаАванса.ВалютнаяСуммаОстаток Тогда
					
					РублеваяСумма = ТекСтрокаАванса.СуммаОстаток;
					ВалютнаяСумма = ТекСтрокаАванса.ВалютнаяСуммаОстаток;
					
				ИначеЕсли СуммаКЗачету < ТекСтрокаАванса.ВалютнаяСуммаОстаток Тогда
					
					КурсОстатка = Окр(ТекСтрокаАванса.СуммаОстаток / ТекСтрокаАванса.ВалютнаяСуммаОстаток, 4);
					РублеваяСумма = СуммаКЗачету * КурсОстатка;
					ВалютнаяСумма = СуммаКЗачету;
					
				КонецЕсли;
				Если РублеваяСумма <= 0 Тогда
					Продолжить;
				КонецЕсли;
				СуммаКЗачету = СуммаКЗачету - ВалютнаяСумма; 
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРезультат.Добавить();
			НоваяСтрока.КФО				= СтрокаРасчетов.КФО;
			НоваяСтрока.КПС				= СтрокаРасчетов.КПС;
			НоваяСтрока.СчетРасчетов	= СтрокаРасчетов.СчетРасчетов;
			НоваяСтрока.СчетАванса		= ТекСтрокаАванса.Счет;
			НоваяСтрока.ДокументАванса	= ТекСтрокаАванса.ДокументАванса;
			НоваяСтрока.ДопСубконто		= ТекСтрокаАванса.ДопСубконто;
			НоваяСтрока.Валюта			= Валюта;
			НоваяСтрока.Сумма			= РублеваяСумма;
			НоваяСтрока.ВалютнаяСумма	= ВалютнаяСумма;
			
			Если СуммаКЗачету = 0 Тогда
				Прервать;
			КонецЕсли;
		
		КонецЦикла; 
	
	КонецЦикла; 
	
	Возврат ТаблицаРезультат;		

КонецФункции // ПолучитьТаблицуЗачетаАвансовИзТаблицыРасчетовИТаблицыОстатковАвансов()

Функция ПараметрыРасчетаТаблицыАвансов()
	
	Результат = Новый Структура;
	Результат.Вставить("Период");
	Результат.Вставить("Организация");
	Результат.Вставить("Контрагент");
	Результат.Вставить("Договор",	Справочники.Договоры.ПустаяСсылка());
	Результат.Вставить("КПС",		Новый Массив);
	Результат.Вставить("КФО",		Новый Массив);
	Результат.Вставить("ИФО",		Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
	Результат.Вставить("КЭК",		Новый Массив);
	Результат.Вставить("Счета302",	Новый Массив);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РазукомплектацияКапвложений

Функция ТаблицаДляРазукомплектацииВложений(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)
	ТипИФО           = Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения");
	ТипКФО           = Новый ОписаниеТипов("ПеречислениеСсылка.КВД");
	ТипКПС           = Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов");
	ТипПодразделение = Новый ОписаниеТипов("СправочникСсылка.Подразделения");
	ТипЦМО           = Новый ОписаниеТипов("СправочникСсылка.ЦМО");
	ТипСумма         = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	ТипКоличество    = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0));
	ТипОС            = Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства");
	ТипСчет          = Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
	ТипКЭК           = Новый ОписаниеТипов("СправочникСсылка.КОСГУ");
	
	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		Возврат ПараметрыФункции;
	КонецЕсли;
	
	ТаблицаПроводок = Новый ТаблицаЗначений;
	ТаблицаПроводок.Колонки.Добавить("ОбъектВложений", ТипОС);
	ТаблицаПроводок.Колонки.Добавить("ИФО", ТипИФО);
	ТаблицаПроводок.Колонки.Добавить("КФО", ТипКФО);
	ТаблицаПроводок.Колонки.Добавить("КПС", ТипКПС);
	ТаблицаПроводок.Колонки.Добавить("ЦМООтправитель", ТипЦМО);
	ТаблицаПроводок.Колонки.Добавить("ПодразделениеОтправитель", ТипПодразделение);
	ТаблицаПроводок.Колонки.Добавить("ЦМОПриемник", ТипЦМО);
	ТаблицаПроводок.Колонки.Добавить("ПодразделениеПриемник", ТипПодразделение);

	ТаблицаПроводок.Колонки.Добавить("КоличествоДт", ТипКоличество);
	ТаблицаПроводок.Колонки.Добавить("КоличествоКт", ТипКоличество);
	
	ТаблицаПроводок.Колонки.Добавить("СчетДт", ТипСчет);
	ТаблицаПроводок.Колонки.Добавить("КЭКДт", ТипКЭК);
	
	ТаблицаПроводок.Колонки.Добавить("Сумма", ТипСумма);

	ПоляФункции = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаПроводок.Колонки Цикл
		ДобавитьПолеРезультатаФункции(ПоляФункции, Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Отказ = Ложь;
	
	ТаблицаПроводок.Очистить();
	
	ДокументОбъект = ИсточникиДанных.ДокументОбъект;
	Для каждого СтрокаТЧ из ДокументОбъект.КапвложенияЦелевые Цикл
		НоваяСтрока = ТаблицаПроводок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
		НоваяСтрока.КоличествоДт = СтрокаТЧ.КоличествоОбъектов;
		НоваяСтрока.КоличествоКт = СтрокаТЧ.КоличествоВложений;
		
		СтрокаКапвложенияИсходные = ДокументОбъект.КапвложенияИсходные.Найти(СтрокаТЧ.ИдентификаторСтрокиКапвложений);
		СтрокаОбъектыЦелевые      = ДокументОбъект.ОбъектыЦелевые.Найти(СтрокаТЧ.ИдентификаторСтрокиОбъектов);
		
		Если СтрокаКапвложенияИсходные <> Неопределено Тогда
			НоваяСтрока.ЦМООтправитель = СтрокаКапвложенияИсходные.ЦМО;
			НоваяСтрока.ПодразделениеОтправитель = СтрокаКапвложенияИсходные.Подразделение;
		КонецЕсли;	

		Если СтрокаОбъектыЦелевые <> Неопределено Тогда
			НоваяСтрока.СчетДт = СтрокаОбъектыЦелевые.СчетУчета;
			НоваяСтрока.КЭКДт  = БухгалтерскиеОперации.КЭКПроводки(
				ДокументОбъект.Организация, 
				НоваяСтрока.ИФО, 
				НоваяСтрока.КФО,
				ДокументОбъект.Дата,
				СтрокаОбъектыЦелевые.СчетУчета,
				НоваяСтрока.ОбъектВложений, 
				Неопределено, 
				Неопределено, 
				"Дт");
			НоваяСтрока.ЦМОПриемник = СтрокаОбъектыЦелевые.ЦМО;
			НоваяСтрока.ПодразделениеПриемник = СтрокаОбъектыЦелевые.Подразделение;
		КонецЕсли;	
	КонецЦикла;	
	
	// Сохраним Отказ и таблицу для формирования других источников данных.
	КонтекстПроведения = БухгалтерскиеОперацииСервер.ПолучитьКонтекстЗаполненияОперации();
	КонтекстПроведения.ДополнительныеСвойства.Вставить(
		"ТаблицаПроводок", ТаблицаПроводок.Скопировать());
	Если Отказ Тогда
		КонтекстПроведения.Отказ = Истина;
	КонецЕсли;
	БухгалтерскиеОперацииСервер.СохранитьКонтекстЗаполненияОперации(КонтекстПроведения);
	
	Возврат ТаблицаПроводок;
КонецФункции	

#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъявленияВсехФункцийМодуля()

	ВсеФункцииМодуля = Новый Массив;
	
	// НДС
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаАннулированияСчетаФактуры");
	ФункцияМодуля.Заголовок	= "Таблица аннулирования счета-фактуры";
	ФункцияМодуля.Описание	= НСтр("ru='Таблица для аннулирования проводок счета-фактуры'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РегистрацияСтрокиКнигиПокупок");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаАннулированияСчетаФактуры_РегистрацияСтрокиКнигиПродаж");
	ФункцияМодуля.Заголовок	= "Таблица аннулирования счета-фактуры";
	ФункцияМодуля.Описание	= НСтр("ru='Таблица для аннулирования проводок счета-фактуры'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РегистрацияСтрокиКнигиПродаж");
	
	// Ввод остатков
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВводОстатковМатериалы106хП");
	ФункцияМодуля.Заголовок	= НСтр("ru='Ввод начальных остатков материалов 106.хП'");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ВводНачальныхОстатков");
	
	// --- Закрытие года (Закрытие балансовых счетов в конце года)
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ЗакрытиеГодаУпрощенно");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица закрытия балансовых счетов в конце года (старая форма)");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит данные по операциям закрытия года, 
	|применяется для устаревшей формы документа ""Закрытие балансовых счетов в конце года"", 
	|с целью сохранения совместимости с ранее выпущенными версиями конфигурации.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ЗакрытиеГода");	
	
	// --- Перенос по приказу 64н
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "Приказ64нНФАОстатки");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатков64нНФА");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "Приказ64нНФАОбороты");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица оборотов");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатков64нНФА");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "Приказ64нРасчетыОстатки");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатков64нРасчеты");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "Приказ64нРасчетыОбороты");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица оборотов");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатков64нРасчеты");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "Приказ64нКЭКОстатки");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатков64нКЭК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "Приказ64нКЭКОбороты");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица оборотов");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатков64нКЭК");
	
	// --- Перенос по приказу 198н
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "Приказ198нНФАОстатки");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатков198нНФА");
	
	// --- Перенос по приказу 192н Биологические активы
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПереносОстатковБиологическиеАктивыОС");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков ОС");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатковБиологическиеАктивы");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПереносОстатковБиологическиеАктивыМЗ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков МЗ");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатковБиологическиеАктивы");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПереносОстатковБиологическиеАктивыВложения");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков Вложения");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатковБиологическиеАктивы");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПереносОстатковБиологическиеАктивыВПути");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица остатков В пути");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносОстатковБиологическиеАктивы");
	
	// --- Корректировка поступления и реализации МЗ
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПроводкиКорректируемогоДокумента");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Проводки корректируемого документа");
	ФункцияМодуля.Описание	= "Возвращает таблицу проводок документа, указанного в параметре ""Документ"". Если параметр не заполнен, то пытается получить документ из реквизита ""Документ-основание"".";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12");
	
	#Область ЗачетАвансов
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовСЗачетомАвансов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Расчеты с контрагентами (зачет авансов)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица расчетов для зачета авансов и увеличения (уменьшения) задолженности документами поступления и реализации материальных запасов, услуг, ОС и пр.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг,
		|ПоступлениеИК,
		|ПоступлениеМЗ,
		|ПоступлениеМЗВПути,
		|ПоступлениеУслугРабот,
		|ПоступлениеУслугРаботПоСчетамУчетаЗатрат,
		|ПоступлениеОС,
		|ПоступлениеОСВПути,
		|ПоступлениеОСИК,
		|ПриходныйОрдерФондовый,
		|ГТДИмпорт,
		|АктОбОказанииУслуг,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12,
		|НакладнаяНаОтпускИК,
		|НачислениеДоходов,
		|НачислениеЗаУслугиОбразования,
		|НачислениеРодительскойПлаты,
		|НачислениеСтудентамЗаПрочиеУслуги,
		|ОтчетКомиссионера
		|СписаниеДоходовБудущихПериодов,
		|НачислениеАмортизацииПравПользованияОС,
		|ПередачаГруппОбъектовОС,
		|ПередачаЗдания,
		|ПередачаОбъектаОС,
		|СдачаЭтапаРабот,
		|ПередачаОбъектовОС,
		|ПередачаОбъектовИК,
		|ИзвещениеИсходящее,
		|ФормированиеВложенийВФинансовыеАктивы,
		|ВыбытиеФинансовыхВложений");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовПриПоступленииДопРасходов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Расчеты с контрагентами (поступление доп.расходов)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица расчетов для зачета авансов и увеличения задолженности при поступлении дополнительных расходов, включаемых в стоимость активов.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеУслугРабот");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовСЗачетомАвансовПоКомиссии");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Расчеты с контрагентами (зачет авансов по комиссии)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица расчетов для зачета авансов и увеличения (уменьшения) задолженности документами поступления и реализации материальных запасов, услуг по комисионной торговле'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктОбОказанииУслуг,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовПоОплатеТруда");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Расчеты по оплате труда'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица расчетов с сотрудниками по оплате труда.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ОтражениеЗарплатыВУчете");
	
	#КонецОбласти
	
	#Область ПогашениеЗадолженности
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовСПогашениемЗадолженности");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Расчеты с контрагентами (погашение задолженности)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица расчетов для погашения задолженности (организацией перед покупателями или поставщиками перед организацией) документами движения денежных средств'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|ЗаявкаНаВозврат,
		|КассовоеПоступление,
		|ПоступлениеНаСчет,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|ПриходныйКассовыйОрдер,
		|РасходныйКассовыйОрдер,
		|ЭквайринговаяОперация,
		|РСКППеречисление,
		|РСКПВозврат");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовСПолучателямиКомпенсацииРодительскойПлаты");
	ФункцияМодуля.Заголовок = НСтр("ru='Расчеты с получателями компенсации родительской платы'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица расчетов для погашения задолженности перед получателями компенсации родительской платы.
		|Для расчетно-платежных документов, сформированных на основании документа ""Ведомость получателей компенсации родительской платы к выплате"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|РСКППеречисление");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовСПокупателямиЗаКассовуюСмену");
	ФункцияМодуля.Заголовок = НСтр("ru='Расчеты с покупателями из отчета по кассовой смене'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица расчетов для погашения задолженности перед покупателями из отчета по кассовой смене.
		|Для расчетно-платежных документов, сформированных на основании документа ""Отчет по кассовой смене"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ПриходныйКассовыйОрдер");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовСФизическимиЛицамиПоВедомости");
	ФункцияМодуля.Заголовок = НСтр("ru='Расчеты с физ. лицами по ведомости перечислений'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица расчетов с физ. лицами для перечисления денежных средств по ведомости перечислений.
		|Для расчетно-платежных документов, сформированных на основании документа ""Ведомость в банк"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|РСКППеречисление");
	
	#КонецОбласти
	
	#Область РасчетыСПодотчетнымиЛицами
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасходыПоАвансовомуОтчету");
	ФункцияМодуля.Заголовок = НСтр("ru='Отражение расходов подотчетного лица (авансовый отчет)'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица расходов подотчетного лица с учетом курсов выдачи денежных средств под отчет.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"АвансовыйОтчет");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаКурсовыхРазницПриВозвратеАвансаПодотчетнымЛицом");
	ФункцияМодуля.Заголовок = НСтр("ru='Таблица курсовых разниц при возврате иностранной валюты подотчетным лицом'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица курсовых разниц при возврате иностранной валюты подотчетным лицом.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ПриходныйКассовыйОрдер");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовСПодотчетнымиЛицамиПоВедомости");
	ФункцияМодуля.Заголовок = НСтр("ru='Расчеты с подотчетными лицами по ведомости перечислений'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица расчетов с подотчетными лицами для перечисления денежных средств по ведомости перечислений.
		|Для расчетно-платежных документов, сформированных на основании документа ""Ведомость в банк"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|РСКППеречисление");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасходыПоОтчетуОРасходах");
	ФункцияМодуля.Заголовок = НСтр("ru='Отражение расходов подотчетного лица (отчет о расходах)'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица расходов подотчетного лица с учетом курсов выдачи денежных средств под отчет.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ОтчетОРасходахПодотчетногоЛица");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаОбязательствПоЗаявкеОбоснованиюЗакупки");
	ФункцияМодуля.Заголовок = НСтр("ru='Таблица обязательств для их исполнения через подотчетное лицо'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица обязательств для их исполнения через подотчетное лицо'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ЗаявкаОбоснованиеЗакупкиМалогоОбъема,
		|ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаВыплатПоВедомостиНаВыдачуПодотчетнымЛицам");
	ФункцияМодуля.Заголовок = НСтр("ru='Расчеты по ведомости на выдачу денег из кассы подотчетным лицам'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица выплат по ведомости на выдачу денег из кассы подотчетным лицам.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"РасходныйКассовыйОрдер");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаВыплатПоПлатежнойВедомости");
	ФункцияМодуля.Заголовок = НСтр("ru='Расчеты по платежной ведомости на выдачу денег из кассы'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица выплат по платежной ведомости на выдачу денег из кассы.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"РасходныйКассовыйОрдер");
	
	#КонецОбласти
	
	#Область УчетМатериальныхЗапасов

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеМатериальныхЗапасовРанееУчтенныхВПути");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление материальных запасов, ранее учтенных как МЗ в пути'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление материальных запасов, ранее учтенных как МЗ в пути'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеМатериальныхЗапасов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление материальных запасов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление материальных запасов'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг,
		|ВводНачальныхОстатков,
		|ПоступлениеИК,
		|ПоступлениеМЗ,
		|ПоступлениеМЗВПути");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеМатериальныхЗапасов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание материальных запасов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание материальных запасов'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктОбУтилизацииМЗ,
		|АктОбУтилизацииМЗИК,
		|АктСписанияИК,
		|АктСписанияМЗ,
		|АктСписанияМягкогоИХозИнвентаря,
		|ВедомостьНаВыдачуМЗНаНуждыУчреждения,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12,
		|ОтчетКомиссионера
		|ПереводГотовойПродукцииВСоставОС,
		|ПоступлениеМЗ,
		|РешениеОПрекращенииПризнанияАктивомМЗ,
		|ТаксировкаПутевогоЛиста,
		|ТаксировкаРабочегоЛистаАгрегата,
		|ТребованиеНакладная0315006");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеРезервовМатериальныхЗапасов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание резервов под снижение стоимости материальных запасов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание резервов под снижение стоимости материальных запасов'");
	ФункцияМодуля.ЗависитОтФункций = "СписаниеМатериальныхЗапасов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктСписанияМЗ,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12
		|ТребованиеНакладная0315006");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВосстановлениеМатериальныхЗапасов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Восстановление материальных запасов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Восстановление материальных запасов'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ,
		|РешениеОбОценкеИмуществаМЗ,
		|РешениеОбОценкеИмуществаМЗИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеИмуществаВПользовании");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание имущества из личного пользования'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание имущества из личного пользования'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ");

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеОСПриВосстановленииМатериальныхЗапасов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание ОС со счета 02 при восстановлении материальных запасов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание ОС со счета 02 при восстановлении материальных запасов'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ,
		|РешениеОбОценкеИмуществаМЗ");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеНепризнанныхАктивом");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание объектов не признанных активами'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание объектов не признанных активами'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РешениеОПрекращенииПризнанияАктивомМЗ");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РеализацияМатериальныхЗапасов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Реализация материальных запасов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Реализация материальных запасов'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаОтпускМ15,НакладнаяНаРеализациюТорг12,ОтчетКомиссионера");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВозвратМатериальныхЗапасовПоставщику");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Возврат материальных запасов поставщику'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Возврат материальных запасов поставщику'");
	ФункцияМодуля.ЗависитОтФункций = "СписаниеМатериальныхЗапасов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаОтпускМ15");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ДвижениеМЗНаХранениеПереработку");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Движение МЗ на хранение (в переработку)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Передача и возврат материальных запасов (давальческого сырья) на хранение и в переработку'");
	ФункцияМодуля.ЗависитОтФункций = "СписаниеМатериальныхЗапасов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаОтпускМ15");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВыдачаМЗвЛичноеПользование");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Выдача МЗ в личное пользование'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица материалов для формирования проводок передачи МЗ в личное пользование'");
	ФункцияМодуля.ЗависитОтФункций = "СписаниеМатериальныхЗапасов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ВедомостьНаВыдачуМЗНаНуждыУчреждения");

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеВложенийВМЗ_Покупка");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание вложений в МЗ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание вложений в МЗ при покупке'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаОтпускМ15,
		|ТребованиеНакладная0315006");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОприходованиеМатериальныхЗапасовПоФактическойСтоимости");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оприходование МЗ по фактической стоимости'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Оприходование материальных запасов по стоимости, накопленой на счетах 106.2П и 106.3П'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ОприходованиеМЗПоФактическойСтоимости,
		|ОприходованиеМЗПоФактическойСтоимостиИК");
	
	#КонецОбласти
	
	#Область УчетМатериальныхЗапасовИмуществаКазны
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РеализацияМатериальныхЗапасовИмуществаКазны");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Реализация материальных запасов имущества казны'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Реализация материальных запасов имущества казны'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаОтпускИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеМатериальныхЗапасовИмуществаКазны");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание материальных запасов имущества казны'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание материальных запасов имущества казны'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаОтпускИК,
		|ТребованиеНакладнаяИК");
	
	#КонецОбласти
	
	#Область УчетВозвратнойТары

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеВозвратнойТарыРанееУчтеннойВПути");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление возвратной тары, ранее учтенной как МЗ в пути'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление возвратной тары, ранее учтенной как МЗ в пути'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеВозвратнойТары");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление возвратной тары'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление возвратной тары'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеМЗ,ПоступлениеМЗВПути");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеВозвратнойТары");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание возвратной тары'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание возвратной тары'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "НакладнаяНаОтпускМ15,НакладнаяНаРеализациюТорг12");
	
	#КонецОбласти
	
	#Область РозничнаяТорговля
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РозничнаяНаценкаПриПеремещенииВНТТ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Розничная наценка при перемещении в НТТ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Розничная наценка при перемещении материальных запасов в неавтоматизированную торговую точку (НТТ).'");
	ФункцияМодуля.ЗависитОтФункций = "СписаниеМатериальныхЗапасов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ТребованиеНакладная0315006");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеМатериальныхЗапасовИзНТТ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание материальных запасов из НТТ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит данные таблицы ""Материалы"", дополненные колонками, необходимыми для отражения операции списания товаров из НТТ.
		|В колонках ""СчетРозницы"" и ""СчетРозницыНУ"" содержатся счета учета товаров в рознице (105.Б8 или 105.Г8 для бухгалтерского учета, Н41.02 для налогового учета).
		|В колонках ""СчетНаценки"" и ""СчетНаценкиНУ"" содержатся счета учета торговой наценки (105.29 или 105.39 для бухгалтерского учета, Н42 для налогового учета).
		|В колонках ""СуммаНаценки"", ""СуммаНаценкиНУ"" и ""СуммаНаценкиНеУчитываетсяНУ"" содержится сумма торговой наценки, которая относится к указанным товарам.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ТребованиеНакладная0315006");
	
	#КонецОбласти
	
	#Область УчетПродуктовПитания
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеПродуктовПитания");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание продуктов питания'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание продуктов питания'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"МенюТребование");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВозвратПродуктовПитания");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Возврат продуктов питания'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Возврат продуктов питания'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"МенюТребование");
	
	#КонецОбласти
	
	#Область УчетУслугРабот
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеУслугРабот");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление услуг, работ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление услуг, работ'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг,
		|ПоступлениеУслугРабот,
		|НачислениеАмортизацииПравПользованияОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеУслугРаботПоСчетамУчетаЗатрат");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление услуг, работ (по счетам учета затрат)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление услуг, работ (по счетам учета затрат)'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеУслугРаботПоСчетамУчетаЗатрат");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеУслугРаботРезерв");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление услуг, работ (Резерв)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление услуг, работ (Резерв)'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеУслугРаботПоСчетамУчетаЗатрат");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеДопРасходов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление доп. расходов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление доп. расходов'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовПриПоступленииДопРасходов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеУслугРабот");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РеализацияУслугРабот");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Реализация услуг, работ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Реализация услуг, работ'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктОбОказанииУслуг,НачислениеДоходов,НачислениеЗаУслугиОбразования,СдачаЭтапаРабот,НачислениеСтудентамЗаПрочиеУслуги,СписаниеДоходовБудущихПериодов");
	
	// Завершение работ
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ЗавершениеРабот_НачислениеДоходов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица накопленных доходов за выполненные работы'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит остатки накопленных на счете 401.40 доходов по всем этапам выполненных работ.
		|В колонках ""Счет"", ""КПС"", ""КЭК"", ""Подразделение"" и ""Субконто1-3"" содержится счет и аналитика учета доходов будущих периодов.
		|В колонках ""Номенклатура"" и ""НоменклатураПредставление"" содержится информация о номенклатуре выполненных работ.
		|В колонке ""СуммаДоходов"" содержится сумма остатка доходов будущих периодов на момент завершения работ.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ЗавершениеРабот");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ЗавершениеРабот_СписаниеРасходов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица накопленных расходов на выполнение работ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит остатки накопленных (не списанных) расходов по всем этапам выполненных работ.
		|В колонках ""СчетРасходов"", ""КПСРасходов"", ""КЭКРасходов"", ""ПодразделениеРасходов"" и ""СубконтоРасходов1-3"" содержится счет и аналитика учета расходов на выполнение работ.
		|В колонках ""СчетДБП"", ""КПС_ДБП"", ""КЭК_ДБП"", ""ПодразделениеДБП"" и ""СубконтоДБП1-3"" содержится счет и аналитика учета ДБП, соответствующих расходам на выполнение работ.
		|В колонках ""Номенклатура"" и ""НоменклатураПредставление"" содержится информация о номенклатуре выполненных работ.
		|В колонках ""СуммаРасходов"", ""СуммаРасходовНУ"", ""СуммаРасходовЕНВД"" и ""СуммаРасходовНеУчитываетсяНУ"" содержится сумма остатка расходов на момент завершения работ.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ЗавершениеРабот");
	
	#КонецОбласти
	
	#Область УчетПроизводства
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ФактическаяСтоимостьВыпущеннойПродукции");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Фактическая стоимость выпущенной продукции'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит данные о фактической стоимости выпущенной продукции,
		|отраженные в регламентном документе ""Закрытие счетов производственных затрат"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ЗакрытиеСчетовПроизводственныхЗатрат");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВыпускПродукцииСоСчета106");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Выпуск продукции со счета 106.хИ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит данные о выпущенной продукции (таб.часть ""Продукция""),
		|дополненные данными о затратах на ее изготовление (таб.часть ""Затраты""),
		|по данным бухгалтерского учета, отраженным в документе ""Выпуск продукции со счета 106.хИ"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ВыпускПродукцииСоСчета106");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВыпускПродукцииСоСчета106НУ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Выпуск продукции со счета 106.хИ (НУ)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит данные о выпущенной продукции (таб.часть ""Продукция""),
		|дополненные данными о затратах на ее изготовление (таб.часть ""Затраты""),
		|по данным налогового учета, отраженным в документе ""Выпуск продукции со счета 106.хИ"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ВыпускПродукцииСоСчета106");
	
	#КонецОбласти
	
	#Область УчетОсновныхСредств
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеОсновныхСредств");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление основных средств'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление основных средств'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов,ТаблицаРасчетовПриПоступленииОсновныхСредств";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг,
		|ПоступлениеОС,
		|ПоступлениеОСВПути,
		|ПоступлениеОСИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВложенияВоВнеоборотныеАктивы");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Вложения во внеоборотные активы'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Вложения во внеоборотные активы'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеУслугРабот,ТребованиеНакладная0315006");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РеализацияОсновныхСредств");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Реализация основных средств'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Реализация основных средств'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПередачаГруппОбъектовОС,ПередачаЗдания,ПередачаОбъектаОС,ПередачаОбъектовОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПринятиеКУчетуОсновныхСредствПоКПС");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятие к учету основных средств (по КПС)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Распределение вложений по разным КПС по объектам ОС, НМА.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПринятиеКУчетуОбъектовОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПринятиеКУчетуОбъектовИК");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "МодернизацияОсновныхСредств");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Модернизация основных средств'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Модернизация основных средств'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РеконструкцияОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РеконструкцияИК");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОСИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "МодернизацияОсновныхСредствПоКПС");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Модернизация основных средств (по КПС)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Распределение вложений по разным КПС по объектам ОС, НМА.'");
	ФункцияМодуля.ЗависитОтФункций = "МодернизацияОсновныхСредств";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РеконструкцияОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РеконструкцияИК");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОСИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВводОстатковОсновныхСредств");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Ввод остатков основных средств'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Ввод остатков основных средств'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ВводНачальныхОстатков,ВводНачальныхОстатковОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПереносВложенийВНФА");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица вложений'");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереносВложенийВНФА");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПеремещениеМеждуСчетамиНФА");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Перемещение между счетами ОС, НМА, НПА'");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "НакладнаяНаВнутреннееПеремещениеОС2");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ВнутреннееПеремещениеИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РешениеОбОценкеИмущества");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица ОС'");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОбОценкеИмущества");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РешениеОбОценкеИмуществаКазны");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица ОС'");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОбОценкеИмуществаКазны");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеКапВложенийНУ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание кап. вложений (НУ)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание (выбытие) вложений во внеоборотные активы в налоговом учете по налогу на прибыль (Н08).'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПередачаОбъектовОС,СписаниеОбъектовОС,СписаниеТранспорта,НакладнаяНаВнутреннееПеремещениеОС2");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "МатериальныеЦенностиСДрагМатериалами");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Материальные ценности с драгоценными материалами'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Материальные ценности с драгоценными материалами'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаВнутреннееПеремещениеОС2,ВнутреннееПеремещениеИК,ПередачаОбъектовОС,ПередачаОбъектовИК,ПоступлениеОС,ПоступлениеОСИК,ПринятиеКУчетуОбъектовОС,ПринятиеКУчетуОбъектовИК,РазукомплектацияКапвложений,РешениеОПризнанииОбъектовОС,РешениеОПризнанииОбъектовОСИК,СписаниеОбъектовОС,СписаниеОбъектовИК,ИзменениеНаличияДрагМатериалов,ТребованиеНакладная0315006");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОстаткиСтоимостиГрупповогоОбъекта");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Остатки стоимости группового объекта'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Остатки стоимости группового объекта'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереводОбъектовОСизГрупповогоУчетаНаИндивидуальный");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОстаткиАмортизацииГрупповогоОбъекта");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Остатки амортизации, обесценения группового объекта'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Остатки амортизации, обесценения группового объекта'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереводОбъектовОСизГрупповогоУчетаНаИндивидуальный");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОстаткиСтоимостиГрупповогоОбъектаНУ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Остатки стоимости группового объекта (НУ)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Остатки стоимости группового объекта (НУ)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереводОбъектовОСизГрупповогоУчетаНаИндивидуальный");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОстаткиАмортизацииГрупповогоОбъектаНУ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Остатки амортизации группового объекта (НУ)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Остатки амортизации группового объекта (НУ)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереводОбъектовОСизГрупповогоУчетаНаИндивидуальный");
	
	#КонецОбласти
	
	#Область УчетОсновныхСредств_ИмуществаКазны
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РеализацияОсновныхСредствИмуществаКазны");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Реализация основных средств имущества казны'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Реализация основных средств имущества казны'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПередачаОбъектовИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ИзменениеСтоимостиОС");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица ОС'");
	ФункцияМодуля.Описание	= "";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ИзменениеСтоимостиОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ИзменениеСтоимостиИК");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РешениеОПризнанииОбъектовОСИКПоКПС");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Решение о признании объектов имущества казны (по КПС)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Распределение вложений по разным КПС по объектам имущества казны.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОСИК");
	
	#КонецОбласти
	
	#Область ГТДИмпорт
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаможенныеПлатежиПоМатериальнымЗапасам");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таможенные платежи по материальным запасам'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таможенные платежи (сборы, пошлины, НДС), связанные с приобретением материальных запасов'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаможенныеПлатежиПоВнеоборотнымАктивам");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таможенные платежи по внеоборотным активам'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таможенные платежи (сборы, пошлины, НДС), связанные с приобретением внеоборотных активов'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаможенныеШтрафы");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таможенные штрафы'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таможенные штрафы'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
	
	#КонецОбласти
	
	#Область УчетРодительскойПлаты

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СводноеНачислениеКомпенсации");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Сводное начисление компенсации'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Начисление компенсации родительской платы сводно'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "НачислениеКомпенсацииРодительскойПлаты");

	#КонецОбласти
	
	#Область УчетФинансовыхВложений
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаВложенийВФинансовыеАктивы");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица вложений в финансовые активы'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица вложений в финансовые активы'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ФормированиеВложенийВФинансовыеАктивы");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РеализацияФинансовыхАктивов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Реализация финансовых активов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Реализация финансовых активов'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ВыбытиеФинансовыхВложений");
	
	#КонецОбласти
	
	#Область УчетГосударственногоДолгаВЦенныхБумагах
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаДляВыкупаЦенныхБумаг");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица для выкупа ценных бумаг'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица для выкупа ценных бумаг'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|КассовоеВыбытие,
		|ПлатежноеПоручение");
	
	#КонецОбласти
	
	#Область Обязательства
	
	// --- Принимаемые и принятые обязательства ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОбязательстваБюджет");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятые (принимаемые) обязательства по бюджетной деятельности'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Принятые (принимаемые) обязательства по бюджетной деятельности.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РегистрацияОбязательствИСведенийПоДоговорам");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОбязательстваВнеБюджет");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятые (принимаемые) обязательства по внебюджетной деятельности'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Принятые (принимаемые) обязательства по внебюджетной деятельности.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РегистрацияОбязательствИСведенийПоДоговорам");
	
	// ----- Поставщики ----
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПринятыеДенежныеОбязательства");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятые денежные обязательства'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Принятые денежные обязательства'");
	ФункцияМодуля.ЗависитОтФункций = "ПоступлениеМатериальныхЗапасов,ПоступлениеУслугРабот,ПоступлениеДопРасходов,ВложенияВоВнеоборотныеАктивы,ПоступлениеОсновныхСредств";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеИК,
		|ПоступлениеМЗ,
		|ПоступлениеМЗВПути,
		|ПоступлениеУслугРабот,
		|ПоступлениеОС,
		|ПоступлениеОСВПути,
		|ПоступлениеОСИК,
		|ГТДИмпорт,
		|ИзвещениеИсходящее,
		|ОтчетКомиссионера,
		|НачислениеАмортизацииПравПользованияОС");
	
	// --- Отражение зарплаты в учете ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПринятыеДенежныеОбязательстваПоОплатеТруда");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятые денежные обязательства при отражении зарплаты в учете'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Принятые денежные обязательства по оплате труда и налогов с ФОТ.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ОтражениеЗарплатыВУчете");
	
	// ---- Проценты, пени, штрафы к уплате
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПринятыеДенежныеОбязательстваПоПроцентамПениШтрафамКУплате");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятые денежные обязательства по процентам, пени, штрафам к уплате'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Принятые денежные обязательства по процентам, пени, штрафам к уплате'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "НачислениеПроцентовПенейШтрафовКУплате");
	
	// --- Авансовый отчет
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "АвансовыйОтчет_ТаблицаКорректировкиДенежныхОбязательств");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Таблица корректировки денежных обязательств по Авансовому отчету'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Таблица содержит данные по отклонениям денежных обязательств, 
	|принятых по ""Заявлению на выдачу аванса"" и рассчитанных по таблице ""Израсходовано"" Авансового отчета.'");
	ФункцияМодуля.ЗависитОтФункций = "РасходыПоАвансовомуОтчету";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "АвансовыйОтчет");
	
	// ---- Фондовая касса
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ФондоваяКассаПринятыеДенежныеОбязательства");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятые денежные обязательства при поступлении денежных документов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Принятые денежные обязательства при поступлении денежных документов с оплатой после факта поступления'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПриходныйОрдерФондовый");

	// ---- Акт приемки товаров, работ, услуга
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОтложенныеОбязательстваДляКорректировки");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Корректировка отложенных обязательств'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Корректировка отложенных обязательств при приемке товаров, работ, услуг'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОстаткиРезервовДляКорректировки");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Корректировка резервов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Корректировка резервов при приемке товаров, работ, услуг'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг");
	
	#КонецОбласти
	
	#Область УпрощеннаяСистемаНалогообложения
	
	// --- УСН: Поступление расходов ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеРасходовУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление расходов УСН'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление расходов УСН'");
	ФункцияМодуля.ЗависитОтФункций = "ПоступлениеМатериальныхЗапасов,ПоступлениеВозвратнойТары,ПоступлениеУслугРабот,ПоступлениеДопРасходов,ВложенияВоВнеоборотныеАктивы,ПоступлениеОсновныхСредств";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ,
		|ПоступлениеУслугРабот,
		|ПоступлениеУслугРаботПоСчетамУчетаЗатрат,
		|ПоступлениеОС,
		|НачислениеАмортизацииПравПользованияОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеМатериальныхЗапасовУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление материальных запасов (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление материальных запасов (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ПоступлениеРасходовУСН";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеВозвратнойТарыУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление возвратной тары (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление возвратной тары (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ПоступлениеРасходовУСН";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасходыУСНПоЭквайринговойОперации");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление расходов УСН (эквайринговая операция)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление расходов УСН (эквайринговая операция)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ЭквайринговаяОперация");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасходыУСНПоИмущественнымНалогам");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Начисление имущественных налогов (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Начисление имущественных налогов (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НачислениеИмущественныхНалогов");
	
	// --- УСН: Начисление обязательств за счет резерва (Дт 401.60 Кт 302.00) ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "НачислениеОбязательствЗаСчетРезерваУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Начисление обязательств за счет резерва (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Начисление обязательств за счет резерва (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ПоступлениеМатериальныхЗапасов,ПоступлениеУслугРабот,ПоступлениеОсновныхСредств";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг,
		|ПоступлениеУслугРабот");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ЗачетАвансовНачислениеОбязательствЗаСчетРезерваУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Зачет авансов поставщику при начислении обязательств за счет резерва (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Зачет авансов поставщику при начислении обязательств за счет резерва (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "НачислениеОбязательствЗаСчетРезерваУСН";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг,
		|ПоступлениеУслугРабот");
	
	// --- УСН: Ввод остатков ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВводОстатковРасходовУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Ввод остатков расходов (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Ввод остатков расходов (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ВводНачальныхОстатков");
	
	// --- УСН: Авансовый отчет ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасходыУСНПоАвансовомуОтчету");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление расходов УСН (авансовый отчет)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление расходов УСН (авансовый отчет)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АвансовыйОтчет");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплаченныеРасходыУСНПоАвансовомуОтчету");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплата расходов УСН (авансовый отчет)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Оплата расходов УСН (авансовый отчет)'");
	ФункцияМодуля.ЗависитОтФункций = "РасходыУСНПоАвансовомуОтчету";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АвансовыйОтчет");
	
	// --- УСН: Отчет о расходах подотчетного лица ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасходыУСНПоОтчетуОРасходахПодотчетногоЛица");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Поступление расходов УСН (отчет о расходах подотчетного лица)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Поступление расходов УСН (отчет о расходах подотчетного лица)'");
	ФункцияМодуля.ЗависитОтФункций = "РасходыПоОтчетуОРасходах";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ОтчетОРасходахПодотчетногоЛица");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплаченныеАвансомРасходыПодотчетнихЛицУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплаченные авансом расходы подотчетных лиц (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Признание расходов УСН  на сумму выданных авансов при отражении отчета о расходах подотчетного лица'");
	ФункцияМодуля.ЗависитОтФункций = "РасходыУСНПоОтчетуОРасходахПодотчетногоЛица";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ОтчетОРасходахПодотчетногоЛица");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплаченныеРасходыПодотчетнихЛицУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплаченные расходы подотчетных лиц (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Признание расходов УСН при погашении задолженности подотчетным лицам документами оплаты'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РасходныйКассовыйОрдер,
		|ПлатежноеПоручение,
		|КассовоеВыбытие,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|РСКППеречисление");
	
	// --- УСН: Отражение зар. платы в учете ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасходыУСННаОплатуТрудаИНалогиСФОТ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Расходы УСН на оплату труда и налоги с ФОТ'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Расходы УСН на оплату труда и уплату налогов с ФОТ'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовПоОплатеТруда";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ОтражениеЗарплатыВУчете");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "НачисленияЗаСчетНалоговыхПлатежейУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Начисления за счет налоговых платежей (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Начисления за счет налоговых платежей:
		|- в рамках обязательного социального страхования от НС и ПЗ;
		|- за счет средств государственного социального страхования.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ОтражениеЗарплатыВУчете");
	
	// --- УСН: Удержания из оплаты труда (алименты и пр.) ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплаченныеАвансомУдержанияИзОплатыТрудаУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплаченные авансом удержания из оплаты труда (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Признание расходов УСН  на сумму оплаченных авансом удержаний из оплаты труда при отражении зар. платы в учете'");
	ФункцияМодуля.ЗависитОтФункций = "РасходыУСННаОплатуТрудаИНалогиСФОТ";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ОтражениеЗарплатыВУчете");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПеречислениеУдержанийИзОплатыТрудаУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Перечисление удержаний из оплаты труда (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Признание расходов УСН при перечислении удержаний контрагентам документами оплаты'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСФизическимиЛицамиПоВедомости";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РасходныйКассовыйОрдер,
		|ПлатежноеПоручение,
		|КассовоеВыбытие,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|РСКППеречисление");
	
	// --- УСН: Оплата поставщику: зачет авансов ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ЗачетАвансовПоставщикуУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Зачет авансов поставщику (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Зачет авансов поставщику (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ПоступлениеРасходовУСН,РасходыУСННаОплатуТрудаИНалогиСФОТ";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ,
		|ПоступлениеУслугРабот,
		|ПоступлениеУслугРаботПоСчетамУчетаЗатрат,
		|ПоступлениеОС,
		|ОтражениеЗарплатыВУчете,
		|НачислениеАмортизацииПравПользованияОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплатаМатериальныхЗапасовЗаСчетАвансовПоставщикуУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплата материальных запасов за счет авансов поставщику (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Оплата материальных запасов за счет авансов поставщику (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ЗачетАвансовПоставщикуУСН";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплатаВозвратнойТарыЗаСчетАвансовПоставщикуУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплата возвратной тары за счет авансов поставщику (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Оплата возвратной тары за счет авансов поставщику (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ЗачетАвансовПоставщикуУСН";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ");
	
	// --- УСН: Оплата поставщику: погашение задолженности ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплатаПоставщикуУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплата поставщику (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Оплата поставщику (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСПогашениемЗадолженности";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РасходныйКассовыйОрдер,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|РСКППеречисление");
	
	// --- УСН: Уплата налогов и сборов ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасчетыПоНалогамИСборамУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Расчеты по налогам и сборам (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Расчеты по налогам и сборам (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"КассовоеПоступление,
		|ПоступлениеНаСчет,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|СводнаяЗаявкаНаКассовыйРасход,
		|РСКППеречисление");
		
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "УплатаНалоговИСборовУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Уплата налогов и сборов (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Уплата налогов и сборов (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "РасчетыПоНалогамИСборамУСН";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"КассовоеВыбытие,
		|ПлатежноеПоручение,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|СводнаяЗаявкаНаКассовыйРасход,
		|РСКППеречисление");
		
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ЗачетОплатыНалоговИСборовУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Зачет оплаты налогов и сборов (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Зачет оплаты налогов и сборов (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ПоступлениеРасходовУСН,НачисленияЗаСчетНалоговыхПлатежейУСН";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеМЗ,
		|ПоступлениеОС,
		|ПоступлениеУслугРабот,
		|ПоступлениеУслугРаботПоСчетамУчетаЗатрат,
		|ОтражениеЗарплатыВУчете,
		|НачислениеАмортизацииПравПользованияОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплатаНалоговИСборовЧерезЕНПвУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплата налогов и сборов через ЕНП (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Оплата налогов и сборов через ЕНП (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РаспределениеЕНП");
		
	// --- УСН: Списание материальных запасов ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеМатериальныхЗапасовУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание материальных запасов (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание материальных запасов (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "СписаниеМатериальныхЗапасов,СписаниеНепризнанныхАктивом";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктСписанияМЗ,
		|АктСписанияМягкогоИХозИнвентаря,
		|ВедомостьНаВыдачуМЗНаНуждыУчреждения,
		|МенюТребование,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12,
		|ОтчетКомиссионера
		|РешениеОПрекращенииПризнанияАктивомМЗ,
		|ТаксировкаПутевогоЛиста,
		|ТаксировкаРабочегоЛистаАгрегата,
		|ТребованиеНакладная0315006");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеВозвратнойТарыУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание возвратной тары (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание возвратной тары (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "СписаниеВозвратнойТары";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"НакладнаяНаОтпускМ15,НакладнаяНаРеализациюТорг12");
	
	// --- УСН: Списание доп. расходов ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "СписаниеДопРасходовУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Списание доп. расходов (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Списание доп. расходов (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"СписаниеДопРасходовУСН");
	
	// --- УСН: Распределение расходов по видам деятельности ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РаспределениеРасходовПоВидамДеятельностиУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Распределение расходов по видам деятельности (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Распределение расходов по видам деятельности (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РаспределениеРасходовПоВидамДеятельностиУСН");
	
	// --- УСН: Ввод остатков ОС и НМА ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВводОстатковОсновныхСредствУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Ввод остатков ОС, НМА (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Ввод остатков ОС, НМА (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ВводОстатковОсновныхСредств";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ВводНачальныхОстатков,ВводНачальныхОстатковОС");
	
	// --- УСН: Принятие к учету ОС и НМА ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПринятиеКУчетуОсновныхСредствУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Принятие к учету ОС, НМА (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Принятие к учету ОС, НМА (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПринятиеКУчетуОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПринятиеКУчетуОбъектаОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПринятиеКУчетуЗдания");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПринятиеКУчетуОбъектовОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОС");
	
	// --- УСН: Модернизация ОС и НМА ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "МодернизацияОсновныхСредствУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Модернизация ОС, НМА (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Модернизация ОС, НМА (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "МодернизацияОсновныхСредств";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РеконструкцияОС");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "РешениеОПризнанииОбъектовОС");
	
	// --- УСН: Ввод в эксплуатацию ОС ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ВводВЭксплуатациюОсновныхСредствУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Ввод в эксплуатацию ОС (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Ввод в эксплуатацию ОС (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ТребованиеНакладнаяОС");
	
	// --- УСН: Признание расходов на ОС и НМА ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПризнаниеРасходовНаОсновныеСредстваУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Признание расходов на ОС и НМА (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Признание расходов на ОС и НМА (УСН)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РасчетРасходовНаОСиНМАПриУСН");
	
	// --- УСН: Исключение НДС, предъявленного покупателям из доходов (УСН) с 2025 г. ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ЗачетАвансовПолученныхУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Зачет авансов полученных (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Зачет авансов полученных документами реализации по договорам с покупателями (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов,РеализацияМатериальныхЗапасов,РеализацияОсновныхСредств,РеализацияУслугРабот";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктОбОказанииУслуг,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12,
		|НачислениеДоходов,
		|НачислениеЗаУслугиОбразования,
		|НачислениеСтудентамЗаПрочиеУслуги,
		|СписаниеДоходовБудущихПериодов,
		|СдачаЭтапаРабот,
		|ПередачаОбъектовОС");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПогашениеЗадолженностиПокупателейУСН");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Погашение задолженности покупателей (УСН)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Погашение задолженности документами поступления денежных средств от покупателей (УСН)'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСПогашениемЗадолженности";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПриходныйКассовыйОрдер,
		|КассовоеПоступление,
		|ПоступлениеНаСчет,
		|ЭквайринговаяОперация");
	
	#КонецОбласти
	
	#Область УчетИностраннойВалюты
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеНаличныхСБанковскогоСчета_ПКО");
	ФункцияМодуля.Заголовок = НСтр("ru='Поступление наличных денежных средств с банковского счета'");
	ФункцияМодуля.Описание = НСтр("ru='Поступление наличных денежных средств с банковского счета'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПриходныйКассовыйОрдер");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасшифровкаПлатежаСРублевымЭквивалентом_РКО");
	ФункцияМодуля.Заголовок = НСтр("ru='Расшифровка платежа (с рублевыми эквивалентами)'");
	ФункцияМодуля.Описание = НСтр("ru='Расшифровка платежа (с рублевыми эквивалентами)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РасходныйКассовыйОрдер");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "РасшифровкаПлатежаСРублевымЭквивалентом_ЗКР");
	ФункцияМодуля.Заголовок = НСтр("ru='Расшифровка платежа (с рублевыми эквивалентами по курсу выписки)'");
	ФункцияМодуля.Описание = НСтр("ru='Расшифровка платежа (с рублевыми эквивалентами по курсу выписки)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ЗаявкаНаКассовыйРасход");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеСредствСоСчета20123_КассовоеПоступление");
	ФункцияМодуля.Заголовок = НСтр("ru='Зачисление денежных средств на банковский счет со счета 201.23'");
	ФункцияМодуля.Описание = НСтр("ru='Зачисление денежных средств на банковский счет со счета 201.23'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"КассовоеПоступление");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПеречислениеПодотчетнымЛицам_КассовоеВыбытие");
	ФункцияМодуля.Заголовок = НСтр("ru='Перечисление подотчетным лицам'");
	ФункцияМодуля.Описание = НСтр("ru='Перечисление подотчетным лицам'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"КассовоеВыбытие");   
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеСредствСоСчета20123_ПоступлениеНаСчет");
	ФункцияМодуля.Заголовок = НСтр("ru='Зачисление денежных средств на банковский счет со счета 201.23'");
	ФункцияМодуля.Описание = НСтр("ru='Зачисление денежных средств на банковский счет со счета 201.23'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПоступлениеНаСчет");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаКурсовыхРазницПоКФО");
	ФункцияМодуля.Заголовок = НСтр("ru='Таблица курсовых разниц при купле-продаже иностранной валюты в разрезе КФО'");
	ФункцияМодуля.Описание = НСтр("ru='Таблица курсовых разниц при купле-продаже иностранной валюты в разрезе КФО'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ПоручениеНаПокупкуВалюты,
		|ПоручениеНаПродажуВалюты,
		|КассовоеВыбытие,
		|КассовоеПоступление,
		|ПоступлениеНаСчет,
		|ПриходныйКассовыйОрдер");
	
	#КонецОбласти
	
	#Область КурсовыеРазницыНУ
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПереоценкаВалютныхОстатковНУ");
	ФункцияМодуля.Заголовок = НСтр("ru='Переоценка валютных остатков (НУ)'");
	ФункцияМодуля.Описание = НСтр("ru='Переоценка валютных остатков (НУ) регламентным документом переоценки валютных остатков'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПереоценкаВалютныхОстатков");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОтражениеОтложенныхКурсовыхРазницНУ");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Отражение отложенных курсовых разниц (НУ)'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Отражение отложенных курсовых разниц (НУ) при погашении задолженности документами движения денежных средств'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСПогашениемЗадолженности";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПриходныйКассовыйОрдер,
		|РасходныйКассовыйОрдер,
		|КассовоеПоступление,
		|ПоступлениеНаСчет,
		|КассовоеВыбытие,
		|ЗаявкаНаКассовыйРасход,
		|РСКППеречисление");
	
	#КонецОбласти
	
	#Область КонтрольИсполненияДоговоров
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплатаПоставщикамКредиторам");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплата поставщикам, кредиторам'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Формирование движений по регистру ""Оплата поставщикам, кредиторам"".'");
	ФункцияМодуля.ЗависитОтФункций =
		"ТаблицаРасчетовСПогашениемЗадолженности";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПриходныйКассовыйОрдер,
		|РасходныйКассовыйОрдер,
		|КассовоеПоступление,
		|ПоступлениеНаСчет,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|РСКППеречисление");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ОплатаОтПокупателейДебиторов");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Оплата от покупателей, дебиторов'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Формирование движений по регистру ""Оплата от покупателей, дебиторов"".'");
	ФункцияМодуля.ЗависитОтФункций =
		"ТаблицаРасчетовСПогашениемЗадолженности";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ПриходныйКассовыйОрдер,
		|РасходныйКассовыйОрдер,
		|КассовоеПоступление,
		|ПоступлениеНаСчет,
		|КассовоеВыбытие,
		|ПереносОплатыОбразование,
		|ПереносОплатыОтПокупателей,
		|ПлатежноеПоручение,
		|ЗаявкаНаВозврат,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|ЭквайринговаяОперация,
		|РСКППеречисление,
		|РСКПВозврат");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ИсполнениеОбязательствПоставщиками");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Исполнение обязательств поставщиками'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Формирование движений по регистру ""Исполнение обязательств поставщиками"".'");
	ФункцияМодуля.ЗависитОтФункций =
		"ПоступлениеМатериальныхЗапасов,
		|ВозвратМатериальныхЗапасовПоставщику,
		|ПоступлениеУслугРабот,
		|ПоступлениеУслугРаботРезерв,
		|ПоступлениеДопРасходов,
		|ПоступлениеОсновныхСредств,
		|ВложенияВоВнеоборотныеАктивы,
		|ТаблицаВложенийВФинансовыеАктивы";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктПриемкиТоваровРаботУслуг,
		|ПоступлениеИК,
		|ПоступлениеМЗ,
		|ПоступлениеМЗВПути,
		|ПоступлениеУслугРабот,
		|ПоступлениеУслугРаботПоСчетамУчетаЗатрат,
		|ПоступлениеОС,
		|ПоступлениеОСВПути,
		|ПоступлениеОСИК,
		|НакладнаяНаОтпускМ15,
		|НачислениеАмортизацииПравПользованияОС,
		|ФормированиеВложенийВФинансовыеАктивы");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ИсполнениеДоговоровСПокупателями");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Исполнение договоров с покупателями'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Формирование движений по регистру ""Исполнение договоров с покупателями"".'");
	ФункцияМодуля.ЗависитОтФункций =
		"РеализацияМатериальныхЗапасов,
		|РеализацияМатериальныхЗапасовИмуществаКазны,
		|РеализацияОсновныхСредств,
		|РеализацияУслугРабот,
		|РеализацияФинансовыхАктивов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктОбОказанииУслуг,
		|НакладнаяНаОтпускИК,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12,
		|ОтчетКомиссионера,
		|НачислениеДоходов,
		|НачислениеЗаУслугиОбразования,
		|НачислениеСтудентамЗаПрочиеУслуги,
		|ПередачаОбъектовИК,
		|ПередачаОбъектовОС,
		|СдачаЭтапаРабот,
		|СписаниеДоходовБудущихПериодов,
		|ВыбытиеФинансовыхВложений");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПланОплатПоФактуПоступленияРеализации");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'План оплат по факту поступления, реализации'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Формирование движений по регистрам графиков платежей при выборе опции ""Запланировать оплату"" в документах поступления и реализации товаров, работ, услуг.'");
	ФункцияМодуля.ЗависитОтФункций = "ТаблицаРасчетовСЗачетомАвансов";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"АктОбОказанииУслуг,
		|АктПриемкиТоваровРаботУслуг,
		|ИзвещениеИсходящее,
		|НакладнаяНаОтпускМ15,
		|НакладнаяНаРеализациюТорг12,
		|ПоступлениеМЗ,
		|ПоступлениеОС,
		|ПоступлениеУслугРабот,
		|ПоступлениеУслугРаботПоСчетамУчетаЗатрат,
		|СдачаЭтапаРабот");
	
	// Средства, полученные во временное распоряжение (304.01)
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ДатаИсполненияПриПоступленииСредствВР");
	ФункцияМодуля.Заголовок = НСтр("ru='Дата исполнения при поступлении средств во временном распоряжении (304 01)'");
	ФункцияМодуля.Описание = НСтр("ru='Дата исполнения при поступлении средств во временном распоряжении (304 01)'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"КассовоеПоступление,ПоступлениеНаСчет,ПриходныйКассовыйОрдер");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ДатаИсполненияПриПеречисленииСредствВР");
	ФункцияМодуля.Заголовок = НСтр("ru='Дата исполнения при перечислении средств во временном распоряжении (304 01)'");
	ФункцияМодуля.Описание = НСтр("ru='Дата исполнения при перечислении средств во временном распоряжении (304 01)");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"ЗаявкаНаВозврат,
		|ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|КассовоеВыбытие,
		|ПлатежноеПоручение,
		|РасходныйКассовыйОрдер,
		|РСКППеречисление,
		|РСКПВозврат");
	
	#КонецОбласти
	
#Область Извещения

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПодтверждениеПолученияНФА");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Подтверждение получения НФА'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Включает данные табличных частей ""Основные средства"", ""Материалы"", ""Возвратная тара"".
		|Выполняет контроль суммы остатков.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ИзвещениеВходящее");

#КонецОбласти
	
	#Область УстаревшиеПроцедурыИФункции
	
	// --- Расчеты с контрагентами при поступлении основных средств ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовПриПоступленииОсновныхСредств");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Расчеты с контрагентами (поступление основных средств)'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Таблица расчетов для зачета авансов и увеличения задолженности при поступлении ОС, НМА, НПА.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеОС,ПоступлениеОСВПути");
	
	// --- Зачет аванса МЗ ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаЗачетаАванса_МЗ");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица зачета аванса'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Возвращает таблицу для зачета аванса, по текущему документу.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеМЗ,ПоступлениеМЗВПути");
	
	ОбщийЗаголовок = НСтр("ru = '(устарела) Табличная часть ""%1"", скорректированная на суммы зачета валютного аванса'");										
	ОбщееОписание = НСтр("ru = '(устарела) К указанной табличной части добавляются колонки, содержащие рублевые суммы.
								|Если документ формирует проводки зачета аванса выданного, то рублевые суммы
								|складываются из рублевых сумм зачета аванса (по курсу аванса) и рублевых сумм
								|по курсу документа.
								|Колонки добавляются с постфиксом ""_ВРублях"" в имени.
								|Например, ""Всего_ВРублях"".'");
								
	// --- Поступление МЗ; Поступление МЗ (в пути) ---
								
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеМЗ_Материалы_СЗачетомАванса");
	ФункцияМодуля.Заголовок	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбщийЗаголовок, "Материалы");
	ФункцияМодуля.Описание	= ОбщееОписание;
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеМЗ,ПоступлениеМЗВПути");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеМЗ_ВозвратнаяТара_СЗачетомАванса");
	ФункцияМодуля.Заголовок	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбщийЗаголовок, "Возвратная тара");
	ФункцияМодуля.Описание	= ОбщееОписание;
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеМЗ,ПоступлениеМЗВПути");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаПринятияДенежногоОбязательства_МЗ");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица принятия денежного обязательства'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Скорректированные на суммы зачета валютного аванса суммы из таблиц ""Материалы"" и ""Возвратная тара"", свернутые по ""КПС"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеМЗ,ПоступлениеМЗВПути");
	
	// --- Накладная на отпуск М-15: Возврат поставщику ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "НакладнаяНаОтпускМ15_Материалы_ВозвратПоставщику");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица ""Материалы"" для возврата поставщику'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Таблица содержит данные таблицы ""Материалы"", пересчитанные по курсу документа и дополненные колонками ""Всего_ВРублях"", ""СуммаНДС_ВРублях"".
		|В колонке ""СчетУчетаНУ"" содержится счет налогового учета, соответствующий счету бухгалтерского учета, указанному в таблице ""Материалы"".
		|В колонках ""Стоимость"", ""СтоимостьНУ"", ""СтоимостьНеУчитываетсяНУ"" и ""СтоимостьЕНВД"" содержится учетная стоимость (стоимость списания) материальных запасов.
		|В колонках ""РазницаСтоимости"", ""РазницаСтоимостиНУ"" содержится разница между учетной стоимостью материальных запасов и стоимостью возврата, указанной в таблице ""Материалы"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "НакладнаяНаОтпускМ15");
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "НакладнаяНаОтпускМ15_ВозвратнаяТара_ВозвратПоставщику");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица ""Возвратная тара"" для возврата поставщику'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Таблица содержит данные таблицы ""Возвратная тара"", пересчитанные по курсу документа и дополненные колонками ""Сумма_ВРублях"".
		|В колонке ""СчетУчетаНУ"" содержится счет налогового учета, соответствующий счету бухгалтерского учета, указанному в таблице ""Возвратная тара"".
		|В колонках ""Стоимость"", ""СтоимостьНУ"", ""СтоимостьНеУчитываетсяНУ"" и ""СтоимостьЕНВД"" содержится учетная стоимость (стоимость списания) возвратной тары.
		|В колонках ""РазницаСтоимости"", ""РазницаСтоимостиНУ"" содержится разница между учетной стоимостью тары и стоимостью возврата, указанной в таблице ""Возвратная тара"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "НакладнаяНаОтпускМ15");
	
	// --- Поступление услуг, работ
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаЗачетаАванса_ПоступлениеУслуг");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица зачета аванса'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Возвращает таблицу для зачета аванса, по текущему документу.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеУслугРабот");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеУслуг_УслугиИРаботы_СЗачетомАванса");
	ФункцияМодуля.Заголовок	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбщийЗаголовок, "Услуги и работы");
	ФункцияМодуля.Описание	= ОбщееОписание;
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеУслугРабот");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаПринятияДенежногоОбязательства_ПоступлениеУслуг");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица принятия денежного обязательства'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Скорректированные на суммы зачета валютного аванса суммы из таблицы ""Услуги и работы"", свернутые по ""КПС"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеУслугРабот");

	// --- Поступление ОС; Поступление ОС (в пути) ---

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаЗачетаАванса_ОС");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица зачета аванса'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Возвращает таблицу для зачета аванса, по текущему документу.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеОС,ПоступлениеОСВПути");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ПоступлениеОС_КапВложения_СЗачетомАванса");
	ФункцияМодуля.Заголовок	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбщийЗаголовок, "Капитальные вложения");
	ФункцияМодуля.Описание	= ОбщееОписание;
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеОС,ПоступлениеОСВПути");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаПринятияДенежногоОбязательства_ПоступлениеОС");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица принятия денежного обязательства'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Скорректированные на суммы зачета валютного аванса суммы из таблицы ""Капитальные вложения"", свернутые по ""КПС"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПоступлениеОС,ПоступлениеОСВПути");

	// --- ПКО фондовый ---

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаЗачетаАванса_ПКО");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица зачета аванса'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Возвращает таблицу для зачета аванса, по текущему документу.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ПриходныйОрдерФондовый");

	// --- Таможенная декларация по импорту ---

	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаЗачетаАванса_ГТДИмпорт");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица зачета аванса'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Возвращает таблицу для зачета аванса, по текущему документу.'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ГТДИмпорт_Материалы_СЗачетомАванса");
	ФункцияМодуля.Заголовок	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбщийЗаголовок, "Материалы");
	ФункцияМодуля.Описание	= ОбщееОписание;
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ГТДИмпорт_ОсновныеСредства_СЗачетомАванса");
	ФункцияМодуля.Заголовок	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОбщийЗаголовок, "Основные средства");
	ФункцияМодуля.Описание	= ОбщееОписание;
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ГТДИмпорт_Штрафы_СЗачетомАванса");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Суммы штрафов, скорректированные на суммы зачета аванса (валютного аванса)'");;
	ФункцияМодуля.Описание	= "(устарела)";
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
										
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаПринятияДенежногоОбязательства_ГТДИмпорт");
	ФункцияМодуля.Заголовок	= НСтр("ru = '(устарела) Таблица принятия денежного обязательства'");
	ФункцияМодуля.Описание	= НСтр("ru = '(устарела) Скорректированные на суммы зачета аванса суммы из таблиц ""Основные средства"", ""Материалы"" и полей ""Сумма штрафа"" и ""Сумма штрафа (Вал)"", свернутые по ""КПС"" и ""КЭК"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, "ГТДИмпорт");
	
	// --- Перечисление денежных средств по ведомости в банк ---
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаРасчетовССотрудникамиПоВедомости");
	ФункцияМодуля.Заголовок = НСтр("ru='(устарела) Расчеты с сотрудниками по ведомости перечислений'");
	ФункцияМодуля.Описание = НСтр("ru='(устарела) Таблица расчетов с сотрудниками для перечисления денежных средств по ведомости перечислений.
		|Для расчетно-платежных документов, сформированных на основании документа ""Ведомость в банк"".'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, 
		"ЗаявкаНаКассовыйРасход,
		|ЗаявкаНаКассовыйРасходСокращенная,
		|КассовоеВыбытие,
		|ПлатежноеПоручение");
	
	#КонецОбласти
	
	#Область РазукомплектацияКапвложений
	
	ФункцияМодуля = ДобавитьЗаголовокОписанияФункции(ВсеФункцииМодуля, "ТаблицаДляРазукомплектацииВложений");
	ФункцияМодуля.Заголовок	= НСтр("ru = 'Разукомплектация вложений'");
	ФункцияМодуля.Описание	= НСтр("ru = 'Разукомплектация вложений'");
	ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля,
		"РазукомплектацияКапвложений");
	
	#КонецОбласти
	
	Возврат ВсеФункцииМодуля;

КонецФункции

Процедура ДобавитьПолеРезультатаФункции(Поля, ИмяПоля, Тип) Экспорт

	Поля.Добавить(Новый Структура("Имя, Тип", ИмяПоля, Тип));

КонецПроцедуры

Процедура ДобавитьОписаниеПараметраФункции(Параметры, ИмяПараметра, Тип) Экспорт

	Параметры.Добавить(Новый Структура("Имя, Тип", ИмяПараметра, Тип));

КонецПроцедуры

Процедура ДобавитьКолонкиРезультатаПоОписанию(ТаблицаРезультат, ПоляФункции) Экспорт

	Для каждого ПолеРезультата Из ПоляФункции Цикл
	
		ТаблицаРезультат.Колонки.Добавить(ПолеРезультата.Имя, ПолеРезультата.Тип);
	
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьТипыДокументовВОбъявлениеФункции(ФункцияМодуля, ИменаДокументовСтрокой) Экспорт

	ИменаДокументов = СтрРазделить(ИменаДокументовСтрокой, ",;" + Символы.ПС, Ложь);
	Для каждого ИмяДокумента Из ИменаДокументов Цикл
	
		ФункцияМодуля.ТипыДокументов.Добавить(Тип("ДокументСсылка." + ИмяДокумента));
	
	КонецЦикла;

КонецПроцедуры

Функция РеквизитыДокумента(ИсточникиДанных) Экспорт
	
	Реквизиты = Новый Структура;
	
	ПрефиксДокумента = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("Документ");
	ДлинаПрефикса    = СтрДлина(ПрефиксДокумента);
	
	ДанныеДокумента = ИсточникиДанных["Документ"][0];
	Для Каждого Колонка Из ИсточникиДанных["Документ"].Колонки Цикл
		Если Лев(Колонка.Имя, ДлинаПрефикса) = ПрефиксДокумента Тогда
			Реквизиты.Вставить(Сред(Колонка.Имя, ДлинаПрефикса+1), ДанныеДокумента[Колонка.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Реквизиты;
	
КонецФункции

Функция РеквизитыТиповойОперации(ИсточникиДанных) Экспорт
	
	Реквизиты = Новый Структура;
	
	ПрефиксДопРеквизита = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных("ДополнительныйРеквизит");
	ДлинаПрефикса       = СтрДлина(ПрефиксДопРеквизита);
	
	ДанныеДокумента = ИсточникиДанных["Документ"][0];
	Для Каждого Колонка Из ИсточникиДанных["Документ"].Колонки Цикл
		Если Лев(Колонка.Имя, ДлинаПрефикса) = ПрефиксДопРеквизита Тогда
			Реквизиты.Вставить(Сред(Колонка.Имя, ДлинаПрефикса+1), ДанныеДокумента[Колонка.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	Реквизиты.Вставить("ТиповаяОперация", ДанныеДокумента.ТиповаяОперация);
	
	Возврат Реквизиты;
	
КонецФункции

Функция ПолучитьТаблицуДанныхИзИсточниковДанных(ИсточникиДанных, ИмяТаблицыДанных, УдалятьПрефикс) Экспорт

	ПрефиксКолонки = БухгалтерскиеОперацииСервер.ПрефиксКолонкиИсточникаДанных(ИмяТаблицыДанных);
	ИменаКолонок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("НомерСтроки");
	Для каждого КолонкаИсточника Из ИсточникиДанных[ИмяТаблицыДанных].Колонки Цикл
	
		Если СтрНачинаетсяС(КолонкаИсточника.Имя, ПрефиксКолонки) Тогда
			ИменаКолонок.Добавить(КолонкаИсточника.Имя);
		КонецЕсли;
	
	КонецЦикла;
	
	Таблица = ИсточникиДанных[ИмяТаблицыДанных].Скопировать(,СтрСоединить(ИменаКолонок, ","));
	
	Если УдалятьПрефикс Тогда
		
		ДлинаПрефикса = СтрДлина(ПрефиксКолонки);
		Для каждого Колонка Из Таблица.Колонки Цикл
			
			Если СтрНачинаетсяС(Колонка.Имя, ПрефиксКолонки) Тогда
				Колонка.Имя = Сред(Колонка.Имя, ДлинаПрефикса + 1);
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Таблица;

КонецФункции

// Тестовая функция с параметром.
// 
// Параметры:
//  ВариантВызова - Строка
//  ИсточникиДанных - Структура
//  ТиповаяОперация - СправочникСсылка.ТиповыеОперации
//  Параметры - Структура
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Тестовая функция с параметром
Функция ТестоваяФункцияСПараметром(ВариантВызова, ИсточникиДанных, ТиповаяОперация, Параметры)

	Если ВариантВызова = "ПолучитьПараметры" Тогда
		ПараметрыФункции = Новый Массив;
		
		ДобавитьОписаниеПараметраФункции(ПараметрыФункции, "Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
		
		Возврат ПараметрыФункции;
	КонецЕсли;
	
		ПоляФункции = Новый Массив;
		
		Для каждого ТекПоле Из Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Измерения Цикл
			
			Если ТекПоле.Балансовый Тогда
				ДобавитьПолеРезультатаФункции(ПоляФункции, ТекПоле.Имя, ТекПоле.Тип);	
			Иначе
				ДобавитьПолеРезультатаФункции(ПоляФункции, ТекПоле.Имя + "Дт", ТекПоле.Тип);	
				ДобавитьПолеРезультатаФункции(ПоляФункции, ТекПоле.Имя + "Кт", ТекПоле.Тип);
			КонецЕсли;
		
		КонецЦикла; 
		
		Для каждого ТекПоле Из Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Ресурсы Цикл
			
			Если ТекПоле.Балансовый Тогда
				ДобавитьПолеРезультатаФункции(ПоляФункции, ТекПоле.Имя, ТекПоле.Тип);	
			Иначе
				ДобавитьПолеРезультатаФункции(ПоляФункции, ТекПоле.Имя + "Дт", ТекПоле.Тип);	
				ДобавитьПолеРезультатаФункции(ПоляФункции, ТекПоле.Имя + "Кт", ТекПоле.Тип);
			КонецЕсли;
		
		КонецЦикла; 
		
		Для каждого ТекПоле Из Метаданные.РегистрыБухгалтерии.ЖурналПроводокЕПСБУ.Реквизиты Цикл
			
			ДобавитьПолеРезультатаФункции(ПоляФункции, ТекПоле.Имя, ТекПоле.Тип);	
		
		КонецЦикла;
		
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетДт", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоДт1", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоДт2", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоДт3", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СчетКт", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоКт1", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоКт2", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "СубконтоКт3", Метаданные.ПланыВидовХарактеристик.ВидыСубконто.Тип);	
	ДобавитьПолеРезультатаФункции(ПоляФункции, "Регистратор", Документы.ТипВсеСсылки());	
		
	
	Если ВариантВызова = "ПолучитьПоля" Тогда
		Возврат ПоляФункции;
	КонецЕсли;
	
	Если ВариантВызова <> "Выполнить" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	Для каждого ПолеРезультата Из ПоляФункции Цикл
	
		ТаблицаРезультат.Колонки.Добавить(ПолеРезультата.Имя, ПолеРезультата.Тип);
	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Организация = &Организация, , 5) КАК ЖурналПроводокЕПСБУДвиженияССубконто";
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаРезультат.Добавить(), Выборка);
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции // ТестоваяФункцияСПараметром()

Функция ТаблицаСписаниеОсновныхСредствСЗабаланса(ПоступлениеМЗ, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставДокумента.СубконтоЗабалансовыйСчет1,
	|	СоставДокумента.СубконтоЗабалансовыйСчет2,
	|	СоставДокумента.СубконтоЗабалансовыйСчет3,
	|	СоставДокумента.Количество,
	|	СоставДокумента.НомерСтроки,
	|	СоставДокумента.КФО
	|ПОМЕСТИТЬ СоставДокумента
	|ИЗ
	|	&СоставДокумента КАК СоставДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Субконто1,
	|	ЖурналПроводокЕПСБУОстатки.Субконто2,
	|	ЕстьNULL(ЖурналПроводокЕПСБУОстатки.Субконто3, НЕОПРЕДЕЛЕНО) КАК Субконто3,
	|	ЖурналПроводокЕПСБУОстатки.Счет,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстатокДт,
	|	ЖурналПроводокЕПСБУОстатки.КФО
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(&Период, Счет = &Счет,, Организация = &Организация
	|	И &УсловиеПодразделение
	|	И &УсловиеИФО) КАК ЖурналПроводокЕПСБУОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставДокумента.КФО,
	|	СоставДокумента.СубконтоЗабалансовыйСчет1,
	|	СоставДокумента.СубконтоЗабалансовыйСчет2,
	|	СоставДокумента.СубконтоЗабалансовыйСчет3,
	|	СоставДокумента.Количество,
	|	СоставДокумента.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ЕстьNULL(Остатки.КоличествоОстатокДт, 0) = 0
	|			ТОГДА 0
	|		КОГДА Остатки.КоличествоОстатокДт = СоставДокумента.Количество
	|			ТОГДА Остатки.СуммаОстатокДт
	|		ИНАЧЕ ВЫРАЗИТЬ(СоставДокумента.Количество * Остатки.СуммаОстатокДт / Остатки.КоличествоОстатокДт КАК Число(15, 2))
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ЕстьNULL(Остатки.КоличествоОстатокДт, 0) < СоставДокумента.Количество
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Нехватка,
	|	ЕстьNULL(Остатки.КоличествоОстатокДт, 0) КАК КоличествоОстаток
	|ИЗ
	|	СоставДокумента КАК СоставДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО СоставДокумента.СубконтоЗабалансовыйСчет1 = Остатки.Субконто1
	|		И СоставДокумента.СубконтоЗабалансовыйСчет2 = Остатки.Субконто2
	|		И СоставДокумента.СубконтоЗабалансовыйСчет3 = Остатки.Субконто3
	|		И СоставДокумента.КФО = Остатки.КФО";
	
	Запрос.УстановитьПараметр("СоставДокумента", ПоступлениеМЗ.Материалы.Выгрузить());
	Запрос.УстановитьПараметр("Счет", ПоступлениеМЗ.ЗабалансовыйСчет);
	Запрос.УстановитьПараметр("Организация", ПоступлениеМЗ.Организация);
	Запрос.УстановитьПараметр("Подразделение", ПоступлениеМЗ.Подразделение);
	Запрос.УстановитьПараметр("ИФО", ПоступлениеМЗ.ИФО);
	Запрос.УстановитьПараметр("Период", Новый Граница(ПоступлениеМЗ.Ссылка.МоментВремени(), ВидГраницы.Исключая));
	
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(ПоступлениеМЗ.ЗабалансовыйСчет);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") И СвойстваСчета.УчетПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПодразделение", "Подразделение = &Подразделение");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПодразделение", "ИСТИНА");
	КонецЕсли; 
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИФО = &ИФО");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеИФО", "ИСТИНА");
	КонецЕсли; 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СтрокиНехватки = Результат.НайтиСтроки(Новый Структура("Нехватка", Истина));
	Если СтрокиНехватки.Количество() > 0 Тогда
		ИмяПоляСубконтоОС = "";
		Для Индекс = 1 По СвойстваСчета.КоличествоСубконто Цикл
			Если СвойстваСчета["ВидСубконто" + Индекс] = ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства Тогда
				ИмяПоляСубконтоОС = "СубконтоЗабалансовыйСчет" + Индекс;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	СинонимСписка = НСтр("ru = 'Материалы'");
	Для Каждого Нехватка Из СтрокиНехватки Цикл
		
		ТекстОшибки = НСтр("ru='Указанное количество ""%5"" превышает остаток по счету %4.
			|Остаток: %1; Не хватает: %2'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки,
			Нехватка.КоличествоОстаток,
			Нехватка.Количество - Нехватка.КоличествоОстаток,
			,
			СвойстваСчета.Код,
			Нехватка[ИмяПоляСубконтоОС]);
			
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
			НСтр("ru = 'Количество'"),
			Нехватка.НомерСтроки,
			СинонимСписка,
			ТекстОшибки);
			
		ПолеКоличество = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Материалы", Нехватка.НомерСтроки, "Количество");
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ПоступлениеМЗ.Ссылка, ПолеКоличество, "Объект", Отказ);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьИмяФункции(ИмяФункции)
	ИмяФункцииВРег = ВРег(ИмяФункции);
	ВсеИсточники = ОбъявленияВсехФункцийМодуля();
	Для Каждого ФункцияИсточника Из ВсеИсточники Цикл
		Если ИмяФункцииВРег = ВРег(ФункцияИсточника.Имя) Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	ВызватьИсключение СтрШаблон(НСтр("ru = 'В источник данных в модуле БухгалтерскиеОперацииИсточникиДанных передано имя несуществующей функции
		|%1'"), ИмяФункции);
КонецПроцедуры

#КонецОбласти


#КонецЕсли
