////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если БюджетнаяОтчетностьКлиентСервер.КонфигурацияЯвляетсяПодчиненной() Тогда 
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
	Иначе 
		Элементы.Список.ИзменятьСоставСтрок = Истина;
	КонецЕсли;
	
	БюджетнаяОтчетность.ПриСозданииНаСервереФормыСпискаКомпонентаОтчета(ЭтаФорма, Список, "ВидОтчета", Элементы.ВидОтчета);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВидОтчетаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ВидОтчета, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ВидОтчета));
КонецПроцедуры