
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		// Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если КлючНазначенияИспользования = "ИсторияХарактеристикПоДоговору" Тогда
		
		ОтборДоговор = Неопределено;
		
		Если НЕ Параметры.Отбор.Свойство("Договор", ОтборДоговор) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		
		// Отбор по договору
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Договор", ОтборДоговор, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Параметры.Отбор.Удалить("Договор");
		
		// Запретим редактирование напрямую
		Элементы.Список.ИзменятьСоставСтрок = Ложь;
		
		// Сгруппируем по виду
		ЭлементГруппировки 					= Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")); 
		ЭлементГруппировки.Поле 			= Новый ПолеКомпоновкиДанных("ВидХарактеристики");
		ЭлементГруппировки.Использование 	= Истина;

				
		// Уберем договор (есть отбор) и вид (есть группировка)
		Элементы.Договор.Видимость 				= Ложь;	
		Элементы.ВидХарактеристики.Видимость 	= Ложь;	
		
		Заголовок = ОтборДоговор;
				
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


