#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КэшФормы = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	
	ПереданноеДеревоКомиссий = КэшФормы.ДеревоАктуальныхКомиссий;
	
	РеквизитДерево = РеквизитФормыВЗначение("Дерево");
	
	ИнвентаризацияСервер.ДополнитьДеревоЗначений(РеквизитДерево, ПереданноеДеревоКомиссий);
	
	ЗначениеВРеквизитФормы(РеквизитДерево, "Дерево");
	
	УстановитьУсловноеОформление();
	
	УстановитьТекущуюСтрокуДерева(РеквизитДерево, Параметры.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Дерево

&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Закрыть(ПолучитьВозвращаемоеЗначение(ВыбраннаяСтрока));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьВозвращаемоеЗначение(ВыбраннаяСтрока)
	
	ТекДанные = Дерево.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("НомерКомиссии",			ТекДанные.НомерКомиссии);
	ВозвращаемоеЗначение.Вставить("НомерРабочейКомиссии",	ТекДанные.НомерРабочейКомиссии);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// Выделение жирным шрифтом полей в строке комиссии (основной)
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Выделение жирным шрифтом полей в строке комиссии (основной)'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дерево.ЭтоРабочаяКомиссия");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	 
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоНомерКомиссииСтрокой");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоКомиссия");
	
	
	//---
	// Выделение серым цветом полей комиссии (основной)
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Выделение серым цветом полей комиссии (основной)'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дерево.ЭтоРабочаяКомиссия");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоНомерРабочейКомиссииСтрокой");
	
	
	//---
	// Выделение серым цветом полей рабочей комиссии
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Выделение серым цветом полей рабочей комиссии'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дерево.ЭтоРабочаяКомиссия");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоНомерКомиссииСтрокой");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоКомиссия");
	
	
	//---
	// Выделение жирным шрифтом полей рабочей комиссии
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Выделение жирным шрифтом полей рабочей комиссии'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дерево.ЭтоРабочаяКомиссия");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоНомерРабочейКомиссииСтрокой");
	
	
	//---
	// Выделение фоном четных строк комиссий
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Выделение фоном четных строк комиссий'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дерево.ЧетныйНомерКомиссии");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Истина;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаГруппировкиОтчета1);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоКомиссия");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоНомерРабочейКомиссииСтрокой");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоПредставлениеАктов");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоНомерКомиссииСтрокой");
	
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоПолеПустое");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекущуюСтрокуДерева(РеквизитДерево, ТекущаяСтрока)
	
	МассивСтрок = РеквизитДерево.Строки.НайтиСтроки(ТекущаяСтрока, Истина);
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	КоординатыСтроки = ИнвентаризацияСервер.ОпределитьКоординатыСтрокиДереваЗначений(РеквизитДерево, МассивСтрок[0]);
	
	ИдСтроки = ИнвентаризацияСервер.ПолучитьИдентификаторСтрокиДереваПоКоординатам(Дерево, КоординатыСтроки);
	
	Элементы.Дерево.ТекущаяСтрока = ИдСтроки;
	
КонецПроцедуры

#КонецОбласти
