/////////////////////////////////////////////////////////////////////////////////
// ВЫГРУЗКА ЗАГРУЗКА СЛУЖЕБНЫХ ДАННЫХ                                          //
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает Истина, если список успешно прочитан
//
// Параметры:
//  МассивИмена (вых) - Массив строк - имен файлов с расширением
//
Функция ПрочитатьСписокФайлов(ЧтениеXML, МассивИмена) Экспорт
	
	Результат = Истина;
	
	Попытка
	
		ЧтениеXML.ПерейтиКСодержимому();
		
		// Количество файлов (ItemCount)
		ЧтениеXML.ПрочитатьАтрибут();
		КоличествоЭлементов = XMLЗначение(Тип("Число"), ЧтениеXML.Значение);
		
		// Читать имена	
		МассивИмена = Новый Массив;
		
		Для н = 0 По (КоличествоЭлементов - 1) Цикл
			
			ЧтениеXML.Прочитать();  		// <FileName>
			ЧтениеXML.Прочитать();  		// Текст елемента
			
			ТекущееИмя = ЧтениеXML.Значение;
			МассивИмена.Добавить(ТекущееИмя);
			
			ЧтениеXML.Прочитать();  		// </FileName>
		
		КонецЦикла;
		
	Исключение
		
		Результат = Ложь;	
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// МассивПараметры - Массив структур с полями:
//  МассивСсылки - Массив ссылок на объекты, подлежащие выгрузке
//  НевыгружаемыеПоля - Строка. Имена полей, через запятую, которые не подлежат выгрузке
//
Процедура УниверсальнаяВыгрузкаСправочников(ПолноеИмяФайла, МассивПараметры, 
	КомментарийКФайлу, ДатаОбновления, ЗаписьXML = Неопределено) Экспорт
		
	// Получить данные для выгрузки
	
	КоличествоПараметров = МассивПараметры.Количество();
	
	Если (КоличествоПараметров > 0) Тогда
		
		Запрос = Новый Запрос;
		ТекстЗапроса = "";
		
		МассивИмена = Новый Массив(КоличествоПараметров);
		
		Для н = 0 По (КоличествоПараметров - 1) Цикл
			
			Если (МассивПараметры[н].МассивСсылки.Количество() > 0) Тогда
				
				ТекСсылка = МассивПараметры[н].МассивСсылки[0];
				МетаданныеСправочника = ТекСсылка.Метаданные();
				МассивИмена[н] = МетаданныеСправочника.Имя;
								
				ИмяПараметра = "пСписок" + Строка(н);
				ПоляВыборки = ПолучитьПоляВыборкиСправочника(ТекСсылка, МассивПараметры[н].НевыгружаемыеПоля);
				
				Если ПустаяСтрока(ПоляВыборки) Тогда       // Если нет полей, то выбрать все
					ПоляВыборки = "ИсточникЗапроса.*";
				КонецЕсли;
				
				ТекстЗапроса = ТекстЗапроса + "
					|ВЫБРАТЬ
					|	" + ПоляВыборки + "
					|ИЗ
					|	Справочник." + МассивИмена[н] + " КАК ИсточникЗапроса
					|ГДЕ
					|	ИсточникЗапроса.Ссылка В (&" + ИмяПараметра + ")
					|
					|УПОРЯДОЧИТЬ ПО
					|	ИсточникЗапроса.Ссылка";
					
				// Если имеются табличные части, то необходимо упорядочить их по номеру строки 
						
				Для Каждого МетаданныеТЧ Из МетаданныеСправочника.ТабличныеЧасти Цикл
					
					ТекстЗапроса = ТекстЗапроса + ",
						|	ИсточникЗапроса." + МетаданныеТЧ.Имя + ".НомерСтроки";	
					
				КонецЦикла;
					
				ТекстЗапроса = ТекстЗапроса + ";
					|
					|////////////////////////////////////////////////////////////////////////////////
					|";
					
				Запрос.УстановитьПараметр(ИмяПараметра, МассивПараметры[н].МассивСсылки);	
					
			КонецЕсли;	
				
		КонецЦикла;
		
		Если Не ПустаяСтрока(ТекстЗапроса) Тогда
			
			Запрос.Текст = ТекстЗапроса;
			МассивРезультаты = Запрос.ВыполнитьПакет();
			КоличествоЗапросов = МассивРезультаты.Количество();
			
		Иначе	
			
			КоличествоЗапросов = 0;
			
		КонецЕсли;	
		
	Иначе
		
		КоличествоЗапросов = 0;
		
	КонецЕсли;	
	
	Если ЗаписьXML=Неопределено Тогда
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.ОткрытьФайл(ПолноеИмяФайла);
	КонецЕсли; 
	
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьКомментарий("Дата и время выгрузки: " + ТекущаяДата());
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("FileContent");
	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен(
		"nspxml", "http://www.w3.org/2001/XMLSchema");	
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен(
		"nspxmlsi", "http://www.w3.org/2001/XMLSchema-instance");
		
	// Количество запросов может отличаться от количества параметров в том случае,
	//  если в параметрах имеются пустые массивы ссылок
		
	Если (КоличествоЗапросов > 0) Тогда
			
		// Записать количество элементов каждого справочника
		МассивВыборки = Новый Массив(КоличествоЗапросов);
		ТекЗапрос = 0;
		
		Для н = 0 По (КоличествоПараметров - 1) Цикл
			
			Если (МассивПараметры[н].МассивСсылки.Количество() > 0) Тогда
				
				МассивВыборки[ТекЗапрос] = МассивРезультаты[ТекЗапрос].Выбрать();
				ИмяАтрибута = МассивИмена[н] + "_Count";
				ЗаписьXML.ЗаписатьАтрибут(ИмяАтрибута, XMLСтрока(МассивВыборки[ТекЗапрос].Количество()));
				
				ТекЗапрос = ТекЗапрос + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Комментарий
	ЗаписьXML.ЗаписатьАтрибут("Description", XMLСтрока(КомментарийКФайлу));	
	
	// Дата обновления
	ЗаписьXML.ЗаписатьАтрибут("Date", XMLСтрока(ДатаОбновления));
	
	// Сами элементы справочников
	ТекЗапрос = 0;
	
	Для н = 0 По (КоличествоПараметров - 1) Цикл
		
		Если (МассивПараметры[н].МассивСсылки.Количество() > 0) Тогда
			
			ВыгрузкаСправочника(ЗаписьXML, МассивВыборки[ТекЗапрос], 
				МассивИмена[н], МассивПараметры[н].НевыгружаемыеПоля);
			ТекЗапрос = ТекЗапрос + 1;
			
		КонецЕсли;		
				
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();     // FileContent
	ЗаписьXML.Закрыть();
		
КонецПроцедуры

// Читает лишь заголовок, извлекая лишь комментарий, имена объектов (справочников, записей и тп), 
//  а также количество объектов каждого объекта
//
// Параметры:
//  МассивОбъекты (вых) - Массив структур с плями:
//   Имя - Строка. Имя объекта как в конфигураторе
//   КоличествоЭлементов - Число. Число экзэмпляров каждого типа в файле выгрузки
//
// Возвращает Истина, если структура заголовка соответствует
//
Функция ПолучитьСвойстваФайлаЗагрузки(ЧтениеXML, Комментарий = Неопределено, 
	ДатаОбновления = Неопределено, МассивОбъекты = Неопределено) Экспорт
	
	Результат = Истина;
	
	Попытка
	
		ЧтениеXML.ПерейтиКСодержимому();  		// FileContent
		
		ЧтениеXML.ПрочитатьАтрибут();  			// xmlns:nspxml
		ЧтениеXML.ПрочитатьАтрибут();           // xmlns:nspxmlsi
		
		// Имена справочников с количеством элементов
		ЧтениеXML.ПрочитатьАтрибут();
		МассивОбъекты = Новый Массив;
		ПредыдущееИмя = "";
		
		Пока (ЧтениеXML.Имя <> "Description") Цикл
	
			ИмяДлина = СтрДлина(ЧтениеXML.Имя);
			Имя = Лев(ЧтениеXML.Имя, ИмяДлина - 6);
			
			Если (Имя = ПредыдущееИмя) Тогда
				Возврат Ложь;	
			КонецЕсли;
			
			Количество = XMLЗначение(Тип("Число"), ЧтениеXML.Значение);
			
			МассивОбъекты.Добавить(Новый Структура(
				"Имя, КоличествоЭлементов", Имя, Количество));
			
			ЧтениеXML.ПрочитатьАтрибут();
			ПредыдущееИмя = Имя;
			
		КонецЦикла;
		
		// Комментарий (Description)
		Комментарий = XMLЗначение(Тип("Строка"), ЧтениеXML.Значение);		
		
		// Дата обновления (Date)
		ЧтениеXML.ПрочитатьАтрибут();
		ДатаОбновления = XMLЗначение(Тип("Дата"), ЧтениеXML.Значение);		
		
	Исключение
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Читает данные объектов справочников из файла XML и записывает их в базу.
//
// Параметры:
//  ЧтениеXML    - ЧтениеXML, входной. Объект чтения XML.
//  ЗаменятьСуществующие - Булево, входной. Если Истина, то существующие в базе 
//                 объекты с такими же ссылками будут перезаписаны.
//  Комментарий  - Строка, выходной. Комментарий к данным файла XML.
//  ДатаОбновления - Дата, выходной. Дата обновления файла XML.
//  МассивСправочники - Массив, выходной. Содержит информацию о загруженных данных. 
//                 Элемент массива - структура с полями:
//                 Имя - Строка. Имя справочника как задано в конфигураторе. 
//                 КоличествоЭлементов - Число. Число объектов справочника 
//                 данного вида в файле выгрузки.
//  РазмерТранзакции - Число, входной. Количество объектов, загружаемых 
//                 в пределах одной транзакции.
//  Прогресс     - Число, выходной. Значение индикатора формы прогресса. 
//  МассивСправочникиИсключения  - Массив входящий. Содержит имена справочников, 
//                 которые нужно пропустить при обновлении данных.
//
// Возвращаемое значение: 
//  Истина       - данные объектов справочников успешно загружены из файла.
//  Ложь         - при загрузке данных объектов справочников произошла ошибка.
//
Функция УниверсальнаяЗагрузкаСправочников(ЧтениеXML, ЗаменятьСуществующие,
	Комментарий = Неопределено, ДатаОбновления = Неопределено, МассивСправочники = Неопределено, 
	РазмерТранзакции = 0, Прогресс = 0, МассивСправочникиИсключения = Неопределено) Экспорт
	
	Результат = Истина;
	
	Попытка
	
		Комментарий = 0;
		ДатаОбновления = 0;
		МассивСправочники = 0;  
		
		Если МассивСправочникиИсключения  = Неопределено Тогда
			 МассивСправочникиИсключения  = Новый Массив;
		КонецЕсли;	
		
		ФорматСоответствует = ПолучитьСвойстваФайлаЗагрузки(ЧтениеXML, Комментарий, 
			ДатаОбновления, МассивСправочники);
		
		Если Не(ФорматСоответствует) Тогда
			ВызватьИсключение "Формат файла не соответствует формату объектов";	
		КонецЕсли;
		
		СоответствиеИОМ = Новый Соответствие;
		Для н = 0 По (МассивСправочники.Количество() - 1) Цикл	
			
			Если МассивСправочникиИсключения.Найти(МассивСправочники[н].Имя) <> Неопределено Тогда
				ЗаменятьСуществующиеСпр = Ложь; 
			Иначе
				ЗаменятьСуществующиеСпр = ЗаменятьСуществующие;	
			КонецЕсли;	
			
			ЗагрузкаСправочника(ЧтениеXML, МассивСправочники[н].Имя, 
				МассивСправочники[н].КоличествоЭлементов, ЗаменятьСуществующиеСпр,
				РазмерТранзакции, Прогресс, СоответствиеИОМ);
				
		КонецЦикла;
	
	Исключение
		
		Результат = Ложь;
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // УниверсальнаяЗагрузкаСправочников()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получает XDTO-типы справочника и его табличных частей.
//
// Параметры:
//  ИмяСправочника - Строка, входной. Имя справочника как задано в конфигураторе.
//  ТипСправочник - ТипОбъектаXDTO, выходной. XDTO-тип справочника.
//  МассивТипыТЧ - Массив, выходной. Массив объектов типа ТипОбъектаXDTO. 
//                 XDTO-типы табличных частей справочника.
//
Процедура ПолучитьТипыXDTOСправочника(ИмяСправочника, ТипСправочник, МассивТипыТЧ)
	
	// Получить XDTO-тип справочника
	ИмяТипаXDTO = "CatalogObject." + ИмяСправочника;
	ТипСправочник = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/enterprise/current-config", ИмяТипаXDTO);
	
	
	// Получить XDTO-типы табличных частей	
	ПустаяСсылка = Справочники[ИмяСправочника].ПустаяСсылка();
	МетаданныеСправочника = ПустаяСсылка.Метаданные();
	КоличествоТЧ = МетаданныеСправочника.ТабличныеЧасти.Количество();
	
	
	Если (КоличествоТЧ > 0) Тогда
		
		МассивТипыТЧ = Новый Массив(КоличествоТЧ);
		
		Для н = 0 По (КоличествоТЧ - 1) Цикл
			
			ИмяТипаXDTO = "CatalogTabularSectionRow." + 
				ИмяСправочника + "." + МетаданныеСправочника.ТабличныеЧасти[н].Имя;
			МассивТипыТЧ[н]	= ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/enterprise/current-config", ИмяТипаXDTO);
			
		КонецЦикла;	
			
	КонецЕсли;	
	
КонецПроцедуры

// Получает имя свойства объекта XDTO, соответствующее указанному 
// свойству объекта справочника.
//
// Параметры:
//  ИмяПоля - Строка. Имя свойства объекта справочника.
//
// Возвращаемое значение: 
//  Строка. Имя свойства XDTO.
//
Функция ПолучитьИмяСвойстваXDTOПоИмениПоля_Справочник(ИмяПоля)
	
	Если (ИмяПоля = "Код") Тогда
		ИмяСвойстваXDTO = "Code";	
	ИначеЕсли (ИмяПоля = "ПометкаУдаления") Тогда
		ИмяСвойстваXDTO = "DeletionMark";	
	ИначеЕсли (ИмяПоля = "Наименование") Тогда
		ИмяСвойстваXDTO = "Description";	
	ИначеЕсли (ИмяПоля = "Ссылка") Тогда
		ИмяСвойстваXDTO = "Ref";	
	ИначеЕсли (ИмяПоля = "Родитель") Тогда
		ИмяСвойстваXDTO = "Parent";
	ИначеЕсли (ИмяПоля = "Владелец") Тогда
		ИмяСвойстваXDTO = "Owner";
				
	// Обычный реквизит	
	Иначе
		ИмяСвойстваXDTO = ИмяПоля;
	КонецЕсли;
	
	
	Возврат ИмяСвойстваXDTO;
	
КонецФункции

// Получает имя свойства объекта справочника, соответствующее указанному 
// свойству объекта XDTO.
//
// Параметры:
//  ИмяСвойстваXDTO - Строка. Имя свойства XDTO.
//
// Возвращаемое значение: 
//  Строка. Имя свойства объекта справочника.
//
Функция ПолучитьИмяПоляПоИмениСвойстваXDTO_Справочник(ИмяСвойстваXDTO)
	
	// Для справочников
	Если (ИмяСвойстваXDTO = "Code") Тогда
		ИмяПоля = "Код";	
	ИначеЕсли (ИмяСвойстваXDTO = "DeletionMark") Тогда
		ИмяПоля = "ПометкаУдаления";	
	ИначеЕсли (ИмяСвойстваXDTO = "Description") Тогда
		ИмяПоля = "Наименование";	
	ИначеЕсли (ИмяСвойстваXDTO = "Ref") Тогда
		ИмяПоля = "Ссылка";	
	ИначеЕсли (ИмяСвойстваXDTO = "Parent") Тогда
		ИмяПоля = "Родитель";
	ИначеЕсли (ИмяСвойстваXDTO = "Owner") Тогда
		ИмяПоля = "Владелец";
		
	// Обычный реквизит
	Иначе
		ИмяПоля = ИмяСвойстваXDTO;
	КонецЕсли;
	
	
	Возврат ИмяПоля;

КонецФункции

// Получает имя свойства записи регистра сведений, соответствующее указанному 
// свойству объекта XDTO.
//
// Параметры:
//  ИмяСвойстваXDTO - Строка. Имя свойства XDTO.
//
// Возвращаемое значение: 
//  Строка. Имя свойства записи регистра сведений.
//
Функция ПолучитьИмяПоляПоИмениСвойстваXDTO_РегистрСведений(ИмяСвойстваXDTO)
	
	Если (ИмяСвойстваXDTO = "Period") Тогда
		ИмяПоля = "Период";
		
	// Обычный реквизит
	Иначе
		ИмяПоля = ИмяСвойстваXDTO;
	КонецЕсли;
	
	
	Возврат ИмяПоля;
	
КонецФункции

Функция ЗначениеСвойстваXDTO(ТипОбъектаXDTO, ОбъектXDTO, ИмяСвойстваXDTO)
	
	СвойствоЗаполнено = (ОбъектXDTO.Свойства().Получить(ИмяСвойстваXDTO) <> Неопределено);
		
	
	Если (СвойствоЗаполнено) Тогда
		
		// Свойство в объекте есть
		СвойствоXDTO = ТипОбъектаXDTO.Свойства.Получить(ИмяСвойстваXDTO);	
		ТипСвойстваXDTO = СвойствоXDTO.Тип;	
		ПредставлениеСвойства = ОбъектXDTO[ИмяСвойстваXDTO];
		
		Если (ТипСвойстваXDTO.Имя = "AnyRef")
			ИЛИ (ТипСвойстваXDTO.Имя = "AnyIBRef") Тогда
		
			// Это произвольная ссылка. Ее тип уже известен, т. к. был явно указан при записи
			Результат = ПредставлениеСвойства;
							
		ИначеЕсли (ТипСвойстваXDTO.Имя = "anyType") Тогда
			
			// Сменшанные типы пока что не загружаются
			Результат = Неопределено;
			
		Иначе
			
			ЗначениеСвойстваXDTO = ФабрикаXDTO.Создать(ТипСвойстваXDTO, ПредставлениеСвойства);
			Результат = ЗначениеСвойстваXDTO.Значение;
	
		КонецЕсли;
					
	Иначе
		
		// В объекте свойства нет. Подставить пустое значение
		Результат = Неопределено;
		
	КонецЕсли;
	
			
	Возврат Результат;
	
КонецФункции

// Заполняет свойства объекта XDTO на основании коллекции значений свойств объекта.
//
// Параметры:
//  ТипОбъектаXDTO - ТипОбъектаXDTO. XDTO-тип объекта.
//  ОбъектXDTO   - ЗначениеXDTO. Объект XDTO, свойства которого следует заполнить.
//  ВыборкаОбъекта - Произвольный. Коллекция значений свойств объекта, 
//                 где Ключ - имя свойства, Значение - значение свойства.
//  СоотвНевыгружаемыеПоля - Соответствие. Соответствие полей, которые 
//                 не подлежат заполнению. Ключ - Строка, имя свойства.
//  ТабличныеЧасти - Произвольный. Коллекция имен табличных частей объекта 
//                 для заполнения.
//  МассивТипыТЧ - Массив. Массив объектов типа ТипОбъектаXDTO. 
//                 XDTO-типы табличных частей объекта.
//
Процедура ЗаполнитьСвойстваОбъектаXDTO(ТипОбъектаXDTO, ОбъектXDTO, ВыборкаОбъекта, 
	СоотвНевыгружаемыеПоля = Неопределено, ТабличныеЧасти = Неопределено, МассивТипыТЧ = Неопределено)
	
	// Сначала заполнить реквизиты
	
	Для каждого СвойствоОбъектаXDTO Из ТипОбъектаXDTO.Свойства Цикл
		
		Если (СвойствоОбъектаXDTO.ВерхняяГраница > 1) Тогда
			// Это табличная часть. Она будет отрабатываться отдельно
			Продолжить;
		КонецЕсли;	
			
		
		// Получить имя поля как в выборке
				
		Если (Найти(ТипОбъектаXDTO.Имя, "Catalog") = 1) Тогда
			ИмяПоля = ПолучитьИмяПоляПоИмениСвойстваXDTO_Справочник(СвойствоОбъектаXDTO.Имя);
		ИначеЕсли (Найти(ТипОбъектаXDTO.Имя, "InformationRegisterRecord") = 1) Тогда
			ИмяПоля = ПолучитьИмяПоляПоИмениСвойстваXDTO_РегистрСведений(СвойствоОбъектаXDTO.Имя);
		КонецЕсли;
		
				
		Если ((СоотвНевыгружаемыеПоля <> Неопределено) И 
			(СоотвНевыгружаемыеПоля.Получить(ИмяПоля) <> Неопределено)) Тогда
			
			// Поле не подлежит выгрузке
			Продолжить;
		КонецЕсли;
		
		Если НЕ (ИмяПоля = "ОбластьДанных") Тогда
		
			// Непосредственное заполнение свойства
			ЗаполнитьЗначениеСвойстваОбъектаXDTO(ТипОбъектаXDTO, ОбъектXDTO, 
			СвойствоОбъектаXDTO.Имя, ВыборкаОбъекта[ИмяПоля]);
		
		КонецЕсли; 
				
	КонецЦикла;
		
	           
	
	// Заполнение табличных частей справочника
		
	Если (ТабличныеЧасти <> Неопределено) Тогда
	
		Для н = 0 По (ТабличныеЧасти.Количество() - 1) Цикл
			
			ТекТЧ = ТабличныеЧасти[н];
			ВыборкаТЧ = ВыборкаОбъекта[ТекТЧ.Имя].Выбрать();
			
			
			Пока ВыборкаТЧ.Следующий() Цикл
				
				ОбъектXDTOТЧ = ФабрикаXDTO.Создать(МассивТипыТЧ[н]);
				ЗаполнитьСвойстваОбъектаXDTO(МассивТипыТЧ[н], ОбъектXDTOТЧ, ВыборкаТЧ);
				ОбъектXDTO[ТекТЧ.Имя].Добавить(ОбъектXDTOТЧ);
				
			КонецЦикла;
					
		КонецЦикла;
		
	КонецЕсли;	
		
КонецПроцедуры // ЗаполнитьСвойстваОбъектаXDTO()


// Возвращает XDTO-значение свойства или Неопределено
//
Процедура ЗаполнитьЗначениеСвойстваОбъектаXDTO(ТипОбъектаXDTO, ОбъектXDTO, ИмяСвойстваXDTO, ЗначениеСвойства)
	
	Если НЕ ЗначениеЗаполнено(ЗначениеСвойства) Тогда	
		Возврат;	     // Не записывать пустые ссылки
	КонецЕсли;
	
	
	СвойствоXDTO = ТипОбъектаXDTO.Свойства.Получить(ИмяСвойстваXDTO);
	ТипСвойстваXDTO = СвойствоXDTO.Тип;
	
	
	Если (ТипСвойстваXDTO.Имя = "AnyRef")
		ИЛИ (ТипСвойстваXDTO.Имя = "AnyIBRef") Тогда
		
		// Это произвольная ссылка, наверняка на справочник. Ее необходимо уточнить
		МетаданныеСправочника = ЗначениеСвойства.Метаданные();
		ИмяТипа = "CatalogRef." + МетаданныеСправочника.Имя;
		ТипСвойстваXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/enterprise/current-config", 
			ИмяТипа);
						
	ИначеЕсли (ТипСвойстваXDTO.Имя = "anyType") Тогда
			
		// Сменшанные типы пока что не выгружаются
		Возврат;
		
	КонецЕсли;
		
	ЗначениеСвойстваXDTO = ФабрикаXDTO.Создать(ТипСвойстваXDTO, ЗначениеСвойства);
	ОбъектXDTO[ИмяСвойстваXDTO] = ЗначениеСвойстваXDTO;	
		
КонецПроцедуры

// Выгружает в XML данные объектов справочника.
//
// Параметры:
//  ЗаписьXML    - ЗаписьXML. Объект записи XML.
//  ВыборкаСправочника - ВыборкаИзРезультатаЗапроса. Выборка данных 
//                 объектов справочников для выгрузки. 
//  ИмяСправочника - Строка. Имя справочника как задано в конфигураторе.
//  НевыгружаемыеПоля - Строка. Имена невыгружаемых полей, разделенные запятыми. 
//
Процедура ВыгрузкаСправочника(ЗаписьXML, ВыборкаСправочника, ИмяСправочника,
	НевыгружаемыеПоля = "")
		
	ТипСправочник = 0;
	МассивТипыТЧ = 0;
	
	ПолучитьТипыXDTOСправочника(ИмяСправочника, ТипСправочник, МассивТипыТЧ);
	
	// Получить соответствие невыгружаемых полей
	МассивНевыгружаемыеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НевыгружаемыеПоля, ","); 
	СоотвНевыгружаемыеПоля = Новый Соответствие;
	
	Для н = 0 По (МассивНевыгружаемыеПоля.Количество() - 1) Цикл
		СоотвНевыгружаемыеПоля.Вставить(СокрЛП(МассивНевыгружаемыеПоля[н]), Истина);			
	КонецЦикла;
	
	// Непосредственная запись
	
	ПустаяСсылка = Справочники[ИмяСправочника].ПустаяСсылка();
	МетаданныеСправочника = ПустаяСсылка.Метаданные();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Catalog_" + ИмяСправочника);
	
	Пока ВыборкаСправочника.Следующий() Цикл
		
		ОбъектСправочникXDTO = ФабрикаXDTO.Создать(ТипСправочник);
		ЗаполнитьСвойстваОбъектаXDTO(ТипСправочник, ОбъектСправочникXDTO, ВыборкаСправочника, 
			СоотвНевыгружаемыеПоля, МетаданныеСправочника.ТабличныеЧасти, МассивТипыТЧ);	
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектСправочникXDTO, ИмяСправочника);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

// Служит для получения подстроки указания полей выборки запроса получения 
// данных объектов для выгрузки.
//
// Параметры:
//  ПоляВыборки  - Строка, выходной. Результирующая строка, содержащая 
//                 описание полей выборки запроса.
//  Свойства     - Коллекция строк, входной. Свойства объекта для выборки запроса.
//  СоотвНевыгружаемыеПоля - Соответствие, входной. Соответствие полей, которые 
//                 не подлежат заполнению. Ключ - Строка, имя свойства.
//
Процедура ВключитьКоллекциюВПоляВыборки(ПоляВыборки, Свойства, СоотвНевыгружаемыеПоля)
	
	Для каждого Свойство Из Свойства Цикл
		
		Если (СоотвНевыгружаемыеПоля.Получить(Свойство.Имя) = Неопределено) Тогда
			
			Если Не ПустаяСтрока(ПоляВыборки) Тогда
				ПоляВыборки = ПоляВыборки + ",
					|";
			КонецЕсли;
				
			ПоляВыборки = ПоляВыборки + "ИсточникЗапроса." + Свойство.Имя;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Получает строку запроса с описанием полей выборки справочника для выгрузки.
//
// Параметры:
//  СправочникСсылка - СправочникСсылка. Ссылка на какой-либо объект справочника. 
//                 Нужна для получения метаданных.
//  НевыгружаемыеПоля - Строка. Имена полей, через запятую, которые 
//                 не подлежат выгрузке.
//
// Возвращаемое значение: 
//  Строка. Результирующая строка, содержащая описание полей выборки запроса.
//
Функция ПолучитьПоляВыборкиСправочника(СправочникСсылка, НевыгружаемыеПоля)
	
	Результат = "";
	
	// Получить соответствие невыгружаемых полей
	МассивНевыгружаемыеПоля = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НевыгружаемыеПоля, ","); 
	
	СоотвНевыгружаемыеПоля = Новый Соответствие;
	
	Для н = 0 По (МассивНевыгружаемыеПоля.Количество() - 1) Цикл
		СоотвНевыгружаемыеПоля.Вставить(СокрЛП(МассивНевыгружаемыеПоля[н]), Истина);			
	КонецЦикла;
	
	МетаданныеСправочника = СправочникСсылка.Метаданные();
	
	// Свойства
	
	МассивСвойства = Новый Массив;
	
	МассивСвойства.Добавить(Новый Структура("Имя", "Код"));
	МассивСвойства.Добавить(Новый Структура("Имя", "ПометкаУдаления"));
	МассивСвойства.Добавить(Новый Структура("Имя", "Ссылка"));
	
	Если (МетаданныеСправочника.ДлинаНаименования > 0) Тогда
		МассивСвойства.Добавить(Новый Структура("Имя", "Наименование"));
	КонецЕсли;
	
	Если (МетаданныеСправочника.Иерархический) Тогда
		МассивСвойства.Добавить(Новый Структура("Имя", "Родитель"));
	КонецЕсли;
	
	Если (МетаданныеСправочника.Владельцы.Количество() > 0) Тогда
		МассивСвойства.Добавить(Новый Структура("Имя", "Владелец"));
	КонецЕсли;
	
	ВключитьКоллекциюВПоляВыборки(Результат, МассивСвойства, СоотвНевыгружаемыеПоля);	
	
	// Реквизиты

	ВключитьКоллекциюВПоляВыборки(Результат, МетаданныеСправочника.Реквизиты, СоотвНевыгружаемыеПоля);
	
	// Потом табличные части
	
	ВключитьКоллекциюВПоляВыборки(Результат, МетаданныеСправочника.ТабличныеЧасти, СоотвНевыгружаемыеПоля);	
	
	Возврат Результат;
	
КонецФункции // ПолучитьПоляВыборкиСправочника()

// Записывает значения свойств из объекта XDTO в объект (справочник, 
// запись регистра сведений). Используется при загрузке данных из XML-файла.
//
// Параметры:
//  ТипОбъектаXDTO - ТипОбъектаXDTO. Тип объекта XDTO, из которого 
//                 получаются значения свойств.
//  ОбъектXDTO   - ЗначениеXDTO. Объект XDTO, из которого получаются 
//                 значения свойств.
//  СправочникОбъект - СправочникОбъект, РегистрСведенийЗапись. Объект 
//                 для заполнения.
//  Реквизиты    - Коллекция объектов с полем "Имя". Данные о реквизитах объекта.
//  ТабличныеЧасти - Коллекция объектов с полем "Имя". Данные о 
//                 табличных частях объекта.
//  МассивТипыТЧ - Массив объектов типа ТипОбъектаXDTO. 
//                 XDTO-типы табличных частей справочника.
//
Процедура ЗаполнитьОбъектПоОбъектуXDTO(ТипОбъектаXDTO, ОбъектXDTO, СправочникОбъект, Реквизиты,
	ТабличныеЧасти = Неопределено, МассивТипыТЧ = Неопределено, СоответствиеИОМ = Неопределено)
	
	Если СоответствиеИОМ = Неопределено Тогда
		СоответствиеИОМ = Новый Соответствие;
	КонецЕсли;
	
	// Сначала заполнить реквизиты
	
	Для каждого Реквизит Из Реквизиты Цикл
		ЗначениеРеквизита = Неопределено;
		ИмяСвойстваXDTO = ПолучитьИмяСвойстваXDTOПоИмениПоля_Справочник(Реквизит.Имя);
		Если ТипЗнч(Реквизит) = Тип("Структура") Тогда
			ЗначениеРеквизита = ЗначениеСвойстваXDTO(ТипОбъектаXDTO, ОбъектXDTO, ИмяСвойстваXDTO);
		ИначеЕсли ТипЗнч(Реквизит) = Тип("ОбъектМетаданных") Тогда
			Если Реквизит.Тип.СодержитТип(Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных")) Тогда
				СсылкаНаИОМ = ЗначениеСвойстваXDTO(ТипОбъектаXDTO, ОбъектXDTO, ИмяСвойстваXDTO);
				Если СсылкаНаИОМ = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ПолноеИмя = СоответствиеИОМ[Строка(СсылкаНаИОМ.УникальныйИдентификатор())];
				Если ПолноеИмя <> Неопределено Тогда
					ЗначениеРеквизита = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя",ПолноеИмя);
				КонецЕсли;
				Если ЗначениеРеквизита = Неопределено Тогда
					ЗначениеРеквизита = СсылкаНаИОМ;
					//ЗначениеРеквизита = Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка();
				КонецЕсли;
			Иначе	
				ЗначениеРеквизита = ЗначениеСвойстваXDTO(ТипОбъектаXDTO, ОбъектXDTO, ИмяСвойстваXDTO);	
			КонецЕсли;
		КонецЕсли;
		
		Если Реквизит.Имя = "Код" И ЗначениеРеквизита = Неопределено Тогда
			Продолжить;
		Иначе
			СправочникОбъект[Реквизит.Имя] = ЗначениеРеквизита; 
		КонецЕсли;
				
	КонецЦикла;
		
	// Заполнить табличные части
	
	Если (ТабличныеЧасти <> Неопределено) Тогда
		
		Для м = 0 По (ТабличныеЧасти.Количество() - 1) Цикл
			
			ТабличнаяЧасть = ТабличныеЧасти[м];
			ТЧНеПустая = (ОбъектXDTO.Свойства().Получить(ТабличнаяЧасть.Имя) <> Неопределено);
			
			Если (ТЧНеПустая) Тогда
				
				ТипСписка = ТипЗнч(ОбъектXDTO[ТабличнаяЧасть.Имя]);
		
				Если (ТипСписка = Тип("СписокXDTO")) Тогда
					КоличествоСтрок = ОбъектXDTO[ТабличнаяЧасть.Имя].Количество();	
				Иначе //(ТипСписка = Тип("ОбъектXDTO"))
					КоличествоСтрок = 1;
				КонецЕсли;
				
				Для н = 0 По (КоличествоСтрок - 1) Цикл
				
					Если (ТипСписка = Тип("СписокXDTO")) Тогда
						ОбъектXDTOТЧ = ОбъектXDTO[ТабличнаяЧасть.Имя].ПолучитьXDTO(н);	
					Иначе //(ТипСписка = Тип("ОбъектXDTO"))
						ОбъектXDTOТЧ = ОбъектXDTO[ТабличнаяЧасть.Имя];
					КонецЕсли;
							
							
					НоваяСтрока = СправочникОбъект[ТабличнаяЧасть.Имя].Добавить();		
					ЗаполнитьОбъектПоОбъектуXDTO(МассивТипыТЧ[м], ОбъектXDTOТЧ, НоваяСтрока, 
						ТабличнаяЧасть.Реквизиты,,,СоответствиеИОМ);
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьОбъектПоОбъектуXDTO()

// Загружает объекты справочника из файла XML.
//
// Параметры:
//  ЧтениеXML    - ЧтениеXML. Объект чтения XML.
//  ИмяСправочника - Строка. Имя справочника как задано в конфигураторе.
//  КоличествоЭлементов - Число. Количество элементов, которое должно быть загружено.
//  ЗаменятьСуществующие - Булево. Если Истина, то существующие в базе 
//                 объекты с такими же ссылками будут перезаписаны.
//  РазмерТранзакции - Число. Объект записи XML.
//  Прогресс     - Число. Значение индикатора формы прогресса.
//
Процедура ЗагрузкаСправочника(ЧтениеXML, ИмяСправочника, КоличествоЭлементов, ЗаменятьСуществующие,
	РазмерТранзакции, Прогресс,СоответствиеИОМ)
	
	ТипСправочник = 0;
	МассивТипыТЧ = 0;
	
	ПолучитьТипыXDTOСправочника(ИмяСправочника, ТипСправочник, МассивТипыТЧ);
	
	// Непосредственное чтение
	
	ЧтениеXML.Прочитать();
	ЧтениеXML.Прочитать();
	
	ПустаяСсылка = Справочники[ИмяСправочника].ПустаяСсылка();
	МетаданныеСправочника = ПустаяСсылка.Метаданные();
	
	ОбработкаИОМ = Ложь;
	Если ИмяСправочника = "ИдентификаторыОбъектовМетаданных" Тогда
		ОбработкаИОМ = Истина;
	КонецЕсли;
	
	Для м = 0 По (КоличествоЭлементов - 1) Цикл
		
		Если ((РазмерТранзакции <> 0) И (м = 0)) Тогда
			НачатьТранзакцию();
		КонецЕсли;
		
		ОбъектСправочникXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
		Если ОбработкаИОМ Тогда
			СоответствиеИОМ.Вставить(ОбъектСправочникXDTO.ref,ОбъектСправочникXDTO.ПолноеИмя);
			Продолжить;
		КонецЕсли;
		
		// Узнать, надо ли создавать новый объект
		СправочникСсылка = ЗначениеСвойстваXDTO(ТипСправочник, ОбъектСправочникXDTO, "Ref");
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
		
		Если (СправочникОбъект = Неопределено) Тогда
			
			СправочникОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
			СправочникОбъект.УстановитьСсылкуНового(СправочникСсылка);
			
		ИначеЕсли Не(ЗаменятьСуществующие) Тогда	
			Продолжить;	
		Иначе
			
			// Раз объект перезаписывается, надо очистить все его табличные части
			
			Для каждого ТабличнаяЧасть Из МетаданныеСправочника.ТабличныеЧасти Цикл
				СправочникОбъект[ТабличнаяЧасть.Имя].Очистить();		
			КонецЦикла;
				
		КонецЕсли;
		
		// Сначала заполнить свойства (кроме ссылки)
		
		МассивСвойства = Новый Массив;
		
		Если Метаданные.Справочники[ИмяСправочника].ДлинаКода >0 Тогда
			МассивСвойства.Добавить(Новый Структура("Имя", "Код"));
		КонецЕсли;
		
		МассивСвойства.Добавить(Новый Структура("Имя", "ПометкаУдаления"));
		
		Если (МетаданныеСправочника.ДлинаНаименования > 0) Тогда
			МассивСвойства.Добавить(Новый Структура("Имя", "Наименование"));
		КонецЕсли;
		
		Если (МетаданныеСправочника.Иерархический) Тогда
			МассивСвойства.Добавить(Новый Структура("Имя", "Родитель"));
		КонецЕсли;
		
		Если (МетаданныеСправочника.Владельцы.Количество() > 0) Тогда
			МассивСвойства.Добавить(Новый Структура("Имя", "Владелец"));
		КонецЕсли;
		
		ЗаполнитьОбъектПоОбъектуXDTO(ТипСправочник, ОбъектСправочникXDTO, СправочникОбъект, 
			МассивСвойства);
			
		// Заполнить реквизиты с табличными частями
		
		ЗаполнитьОбъектПоОбъектуXDTO(ТипСправочник, ОбъектСправочникXDTO, СправочникОбъект, 
			МетаданныеСправочника.Реквизиты, МетаданныеСправочника.ТабличныеЧасти, МассивТипыТЧ, СоответствиеИОМ);
			
		Попытка	
			СправочникОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Запись объекта'"), УровеньЖурналаРегистрации.Ошибка, МетаданныеСправочника,
			СправочникОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;	
		
		Прогресс = Прогресс + 1;
		
		Если (РазмерТранзакции <> 0) Тогда
			Если (((м % РазмерТранзакции) = 0) Или (м = (КоличествоЭлементов - 1))) Тогда
				ЗафиксироватьТранзакцию();
				
				Если (м < (КоличествоЭлементов - 1)) Тогда
					НачатьТранзакцию();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры // ЗагрузкаСправочника()

#КонецОбласти
