#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// обработка обеспечивает трансформацию вызовов версии api 3.** в версию api 2.**
//  
////////////////////////////////////////////////////////////////////////////////

Перем ОбработкаФормата Экспорт; // обработка реализующая API версси 2 должно быть заполнено до первого вызова.

Перем СтруктураДанных;

////////////////////////////////////////////////////////////////////////////////
// имитация реквизитов обработки.

Перем ФорматОбмена Экспорт;
Перем РеализацияФормата  Экспорт;

// Имитация реквизитов обработки.
////////////////////////////////////////////////////////////////////////////////
// Заполнение информации обработки.
// Интерфейс

Процедура ЗаполнитьИнформациюОбработки(ДанныеОбработки) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	СформироватьСтруктуруДанныхЗаполненияИнформации();
	
	МетаданныеОбработки = ОбработкаФормата.Метаданные();
	Если Найти(МетаданныеОбработки.Имя, "ПрослойкаОбратнойСовместимости") Тогда 
		МетаданныеОбработки = ОбработкаФормата.ПолучитьМетаданныеПодключеннойобработки();
	КонецЕсли;	
		
	
	
	ДанныеОбработки.Версия = "0.0.0.1";
	
	ДанныеОбработки.НаименованиеПоУмолчанию = МетаданныеОбработки.Синоним;
	ДанныеОбработки.ИнформацияОбОбработке = МетаданныеОбработки.Синоним;;
	
	ДанныеОбработки.СпособыОтправки.Добавить("Каталог");
	ДанныеОбработки.СпособыОтправки.Добавить("FTP");
	ДанныеОбработки.СпособыОтправки.Добавить("ЭлектроннаяПочта");
	
	
	СохраненныеДанные = Неопределено;
	УникальныйИдентификаторХранилища = Новый УникальныйИдентификатор;
	
	ОбработкаФормата.ИнициализацияУправляемогоРежима(Неопределено,
	СохраненныеДанные,
	ЭтотОбъект,
	УникальныйИдентификаторХранилища);
 
	ДанныеОбработки.ВидыОтчетов = ОбработкаФормата.ПолучитьИспользуемыеВидыОтчетов();
	
	
	ОбработкаФормата.ЗарегистрироватьРедактируемыеНастройки(ЭтотОбъект);
	
	Для Каждого РедактируемаяНастройка Из СтруктураДанных.ТаблицаРедактируемыхНастроек Цикл
		
		НоваяДопНастройка = ДанныеОбработки.ДополнительныеНастройки.Добавить();
		НоваяДопНастройка.Имя = РедактируемаяНастройка.Имя;
		НоваяДопНастройка.Заголовок = РедактируемаяНастройка.Заголовок;
		НоваяДопНастройка.ТипЗначения = РедактируемаяНастройка.Тип;
		НоваяДопНастройка.СписокВыбора = РедактируемаяНастройка.СписокВыбора;   
		НоваяДопНастройка.ЗначениеПоУмолчанию = РедактируемаяНастройка.ЗначениеПоУмолчанию;
		НоваяДопНастройка.ЗапоминатьЗначение = Истина;
		НоваяДопНастройка.ПроверкаЗаполнения = Ложь;

	КонецЦикла;
	
	ОбработкаФормата.ОтключитьУправляемыйРежим(ЭтотОбъект);
	
КонецПроцедуры	

// Интерфейс
////////////////////////////////////////////////////////////////////////////////
// Служебные

Процедура СформироватьСтруктуруДанныхЗаполненияИнформации()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТаблицаРедактируемыхНастроек",Новый ТаблицаЗначений);
	СтруктураДанных.ТаблицаРедактируемыхНастроек.Колонки.Добавить("Имя"         , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));
	СтруктураДанных.ТаблицаРедактируемыхНастроек.Колонки.Добавить("Заголовок"   , Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));
	СтруктураДанных.ТаблицаРедактируемыхНастроек.Колонки.Добавить("Тип"         , Новый ОписаниеТипов("ОписаниеТипов"));
	СтруктураДанных.ТаблицаРедактируемыхНастроек.Колонки.Добавить("ВидРеквизита", Новый ОписаниеТипов("ВидПоляФормы"));
	СтруктураДанных.ТаблицаРедактируемыхНастроек.Колонки.Добавить("СписокВыбора", Новый ОписаниеТипов("СписокЗначений"));
	СтруктураДанных.ТаблицаРедактируемыхНастроек.Колонки.Добавить("ЗначениеПоУмолчанию");
	
КонецПроцедуры	

// Служебные
// Заполнение информации обработки.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Заполнение таблицы зависимостей.
// Интерфейс

Процедура ЗаполнитьТаблицуЗависимостей(МассивОтчетов, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
	// Обраобки до 3 версии api сами решают зависимости как могут.
	
КонецПроцедуры

// Интерфейс
// Заполнение таблицы зависимостей.
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// формирование файлов отчетов.
// Интерфейс

Процедура СформироватьФайлыОтчетов(ТаблицаДанных, ТаблицаЗависимостей, ДополнительныеНастройкиФормата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СформироватьСтруктуруДанныхФормированияФайлов();
	
	
	ПараметрыВыгрузки = Новый Структура;
	Для Каждого НастройкаФормата Из ДополнительныеНастройкиФормата Цикл
		
		ПараметрыВыгрузки.Вставить(НастройкаФормата.Имя, НастройкаФормата.Значение);
		
	КонецЦикла;
	
	ОбработкаФормата.ИнициализацияУправляемогоРежима(Неопределено, Неопределено, ЭтотОбъект, Новый УникальныйИдентификатор);
	
	Для Каждого ДанныеПакетаДляВыгрузки Из ТаблицаДанных Цикл 
		
		ВременныйКаталог = ПолучитьИмяВременногоФайла() + ПолучитьРазделительПути();
		СоздатьКаталог(ВременныйКаталог);
		
		СписокДокументов = ДанныеПакетаДляВыгрузки.Отчеты.ВыгрузитьКолонку("Отчет");
		
		РезультатВыгрузки = ОбработкаФормата.ВыполнитьВыгрузку(СписокДокументов, ВременныйКаталог, ПараметрыВыгрузки);
		
		
		
		ВременныйПодкаталог = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог, Строка(Новый УникальныйИдентификатор)) + ПолучитьРазделительПути();
		СоздатьКаталог(ВременныйПодкаталог);
		
		Для Каждого ДанныеПакета Из РезультатВыгрузки.Строки Цикл  // пакет всегда один 
			Для Каждого ДанныеФайла Из ДанныеПакета.Строки Цикл 
				
				Если ТипЗнч(ДанныеФайла.ИмяФайла) = Тип("Структура") Тогда
					СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДанныеФайла.ИмяФайла.ПолноеИмяФайла, Ложь);
					ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.ИмяФайла.АдресВременногоХранилища);
					ДвоичныеДанные.Записать(ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйПодкаталог, СтруктураИмениФайла.Имя));  
					
				Иначе
					СтруктураИмениФайла = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ДанныеФайла.ИмяФайла, Ложь);
					Если не ЗначениеЗаполнено(СтруктураИмениФайла.Путь) Тогда // это имя файла
						КопироватьФайл(
						ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог, СтруктураИмениФайла.Имя), 
						ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйПодкаталог, СтруктураИмениФайла.Имя));
						
					Иначе 
						файл = Новый Файл(СтруктураИмениФайла.ПолноеИмя);
						Если файл.Существует() Тогда // это полное имя файла
							КопироватьФайл(
							СтруктураИмениФайла.ПолноеИмя, 
							ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйПодкаталог, СтруктураИмениФайла.Имя));
							
						Иначе // это относительное имя файла
							СоздатьКаталог(ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйПодкаталог, СтруктураИмениФайла.Путь));
							КопироватьФайл(
							ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйКаталог, СтруктураИмениФайла.ПолноеИмя), 
							ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ВременныйПодкаталог, СтруктураИмениФайла.ПолноеИмя));
							
						КонецЕсли;
						
					КонецЕсли;	
	
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;	
		
		ИмяВременногоФайлаАрхива = ПолучитьИмяВременногоФайла("ZIP");
		ЗаписьZipФайла = Новый ЗаписьZipФайла(ИмяВременногоФайлаАрхива);
		ЗаписьZipФайла.Добавить(ВременныйПодкаталог + "*", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
		ЗаписьZipФайла.Записать();
		
		
		НоваяСтрокаФайловОтчетов = ДанныеПакетаДляВыгрузки.ФайлыОтчетов.Добавить();
		НоваяСтрокаФайловОтчетов.ДанныеФайлов = Новый ДвоичныеДанные(ИмяВременногоФайлаАрхива);
		
		
		
		Попытка
			УдалитьФайлы(ВременныйКаталог);
		Исключение
		КонецПопытки;
		Попытка
			УдалитьФайлы(ИмяВременногоФайлаАрхива);
		Исключение
		КонецПопытки;

		
	КонецЦикла;	
	
	ОбработкаФормата.ОтключитьУправляемыйРежим(ЭтотОбъект);
	
КонецПроцедуры	

// Интерфейс
////////////////////////////////////////////////////////////////////////////////
// Служебные

Процедура СформироватьСтруктуруДанныхФормированияФайлов()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ПротоколВыгрузкиОтчетов",Новый ТаблицаЗначений);
	СтруктураДанных.ПротоколВыгрузкиОтчетов.Колонки.Добавить("Отчет");
	СтруктураДанных.ПротоколВыгрузкиОтчетов.Колонки.Добавить("ТекстСообщения");
	СтруктураДанных.ПротоколВыгрузкиОтчетов.Колонки.Добавить("СтатусСообщения");
	
КонецПроцедуры	

// Служебные
// формирование файлов отчетов 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Методы используемые клиентскими обработкми.

// Добавляет настройку, которую можно ввести в диалоге выгрузки. Вызывается внешней обработкой.
//
Процедура ДобавитьНастройку(Знач Имя, Знач Синоним, Знач ОписаниеТипов, Знач ВидРеквизита, Знач ЗначениеПоУмолчанию = Неопределено, Знач СписокВыбора = Неопределено) Экспорт

	Если Не (ВидРеквизита = ВидПоляФормы.ПолеВвода
		 Или ВидРеквизита = ВидПоляФормы.ПолеНадписи
		 Или ВидРеквизита = ВидПоляФормы.ПолеПереключателя
		 Или ВидРеквизита = ВидПоляФормы.ПолеФлажка) Тогда
		 
		ВызватьИсключение НСтр("ru = 'Недопустимое значение параметра 4 (ВидРеквизита)'");
		 
	КонецЕсли;
	
	СтрокаНастроек               = СтруктураДанных.ТаблицаРедактируемыхНастроек.Добавить();
	СтрокаНастроек.Имя           = Имя;
	СтрокаНастроек.Заголовок     = Синоним;
	СтрокаНастроек.Тип           = ОписаниеТипов;
	СтрокаНастроек.ВидРеквизита  = ВидРеквизита;
	СтрокаНастроек.СписокВыбора  = СписокВыбора;
	СтрокаНастроек.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
	
КонецПроцедуры // ДобавитьНастройку()

// Создает дерево значений, которое необходимо заполнить данными о выгруженных файлах.
//
// Возвращаемое значение:
//   ДеревоЗначений. Колонки: Организация,Период,ИмяФайла.
//
Функция ПолучитьХранилищеРезультатовВыгрузки() Экспорт

	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Дерево.Колонки.Добавить("Период",Новый ОписаниеТипов("СправочникСсылка.Периоды"));
	Дерево.Колонки.Добавить("ИмяФайла");
	Дерево.Колонки.Добавить("СписокОтчетовФайла");
	Дерево.Колонки.Добавить("ВидДокументаОтправки");
	
	Возврат Дерево;

КонецФункции

// Добавляет ветку верхнего уровня по которой будет создан документ "ПакетВыгрузкиОтчетности".
//
// Параметры:
//  Хранилище    - ДеревоЗначений - хранилище, полученное методом
//                 ПолучитьХранилищеРезультатовВыгрузки().
//  Организация  - Организация пакета.
//  Период       - Период пакета.
//
// Возвращаемое значение:
//  СтрокаДереваЗначений - должна использоваться в качестве параметра метода
// ДобавитьФайлКПакету().
//
Функция ДобавитьПакетФайлов(Хранилище,Организация = Неопределено,Период = Неопределено, ВидДокументаОтправки = Неопределено) Экспорт
	
	Если ТипЗнч(Хранилище) <> Тип("ДеревоЗначений") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Пакет = Хранилище.Строки.Добавить();
	Пакет.Организация = Организация;
	Пакет.Период	  = Период;
	Пакет.ВидДокументаОтправки = ВидДокументаОтправки;
	
	Возврат Пакет;
	
КонецФункции // ДобавитьПакетФайлов()

// Добавляет файл к ветке документа "ПакетВыгрузкиОтчетности". 
//
// Параметры:
//  Пакет		- СтрокаДереваЗначений - ветка, 
//					описывающая организацию и период.
//
//  ИмяФайла	- Строка - имя файла.
//
Процедура ДобавитьФайлКПакету(Пакет, ИмяФайла, Знач СписокОтчетовФайла = Неопределено) Экспорт
	
	Если ТипЗнч(Пакет) <> Тип("СтрокаДереваЗначений") И Пакет.Уровень() <> 1 Тогда
		Шаблон = НСтр(
		"ru = 'Ошибка взаимодействия с обработкой старого формат. 
		|Неверные входные параметры при добавлении файла в пакет.'");
		ОбщегоНазначения.СообщитьПользователю(Шаблон);
		Возврат; // Неверные входные параметры
	КонецЕсли;
	
	НовыйФайл = Пакет.Строки.Добавить();
	НовыйФайл.ИмяФайла = ИмяФайла;
	НовыйФайл.СписокОтчетовФайла = СписокОтчетовФайла;
	
КонецПроцедуры // ДобавитьФайлКПакету()

// Добавление комментария к выгружаемому отчету.
//
// Параметры:
//  Отчет		   - ДокументСсылка.УниверсальныйРегламентированныйОтчет
//                   отчет, для которого добавляется комментарий.
//  ТекстСообщения - Строка. Текст комментария.
//
//  СтатусСообщения - Тип: СтатусСообщения - признак важности сообщения.
//
Процедура ЗаписатьВПротоколВыгрузки(Отчет, ТекстСообщения, СтатусСообщения = Неопределено) Экспорт

	ЗаписьПротокола = СтруктураДанных.ПротоколВыгрузкиОтчетов.Добавить();
	ЗаписьПротокола.Отчет 			= Отчет;
	ЗаписьПротокола.ТекстСообщения 	= ТекстСообщения;
	ЗаписьПротокола.СтатусСообщения	= СтатусСообщения;

КонецПроцедуры // ЗаписатьВПротоколВыгрузки()

// Методы используемые клиентскими обработкми.
////////////////////////////////////////////////////////////////////////////////
// служебные

Функция ПолучитьМетаданныеПодключеннойОбработки() Экспорт
	
	ОбработкаФормата.Метаданные();
	
КонецФункции	

// служебные
////////////////////////////////////////////////////////////////////////////////
// имитация реквизитов обработки.

ФорматОбмена = Неопределено;
РеализацияФормата = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.ПустаяСсылка();

// Имитация реквизитов обработки.
////////////////////////////////////////////////////////////////////////////////

#КонецЕсли