&НаКлиенте
Перем МаксимальноеКоличествоСтрок, НужноПересчитатьРублевыеСуммыВТаблицеФрагментов;

&НаКлиенте
Перем ИсключитьЗаполнениеНомеровСтрок, НужноЗаполнитьИтоги;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьПереданныеСведения();
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МаксимальноеКоличествоСтрок = 99;
	
	ЗаполнитьСлужебныеКолонкиТаблицы();
	
	ОбновитьИтогиТаблицы(ЭтотОбъект);
	
	ОбновитьТекстОтклонения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	НепроверяемыеРеквизиты.Добавить("ТаблицаИсходнаяСтрока.ДатаАктаСверки");
	НепроверяемыеРеквизиты.Добавить("ТаблицаИсходнаяСтрока.НомерАктаСверки");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	Документы.ИнвентаризационнаяОписьРасчетовСКонтрагентами.ПроверитьФормуРазбивкиСтроки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИтогСуммаОтклонениеНажатие(Элемент, СтандартнаяОбработка)
	
	НажатаГиперссылкаИтого(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаФрагментыСтроки

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиПриИзменении(Элемент)
	
	Если ИсключитьЗаполнениеНомеровСтрок = Истина Тогда
		ИсключитьЗаполнениеНомеровСтрок = Неопределено;
	Иначе
		ЗаполнитьСлужебныеКолонкиТаблицы();
	КонецЕсли;
	
	Если НужноПересчитатьРублевыеСуммыВТаблицеФрагментов = Истина Тогда
		НужноПересчитатьРублевыеСуммыВТаблицеФрагментов = Неопределено;
		
		ПересчитатьРублевыеСуммыВТаблицеФрагментов();
	КонецЕсли;
	
	Если НужноЗаполнитьИтоги = Истина Тогда
		НужноЗаполнитьИтоги = Неопределено;
		
		ОбновитьИтогиТаблицы(ЭтотОбъект);
		
		ОбновитьТекстОтклонения(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ТаблицаФрагментыСтроки.Количество() >= МаксимальноеКоличествоСтрок Тогда
		Отказ = Истина;
		
		ТекстСообщения = СтрШаблон(НСтр("ru='Достигнуто максимально допустимое количество фрагментов строки (%1)'"), МаксимальноеКоличествоСтрок);
		
		ПоказатьПредупреждение(, ТекстСообщения, 20);
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиПередУдалением(Элемент, Отказ)
	
	Если ТаблицаФрагментыСтроки.Количество() = Элементы.ТаблицаФрагментыСтроки.ВыделенныеСтроки.Количество() Тогда
		Отказ = Истина;
		
		ПоказатьПредупреждение(, НСтр("ru='Не предусмотрена полная очистка таблицы фрагментов строк.
			|Должна присутствовать хотя бы одна строка.'"));
		
		Возврат;
	КонецЕсли;
	
	НужноЗаполнитьИтоги = Истина;
	
	Если ЭтоИностраннаяВалюта Тогда
		// В таблице могут быть строки, в которых рублевая сумма была скорректирована ранее,
		// и отличается от расчета по курсу.
		НужноПересчитатьРублевыеСуммыВТаблицеФрагментов = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		ИсключитьЗаполнениеНомеровСтрок = Истина;
		
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные;
	
	ЗаполнитьЗначенияСвойств(ТекДанные, СтруктураЗаполненияНовойСтроки);
	
	Если Копирование Тогда
		ОбновитьИтогиТаблицы(ЭтотОбъект);
		ОбновитьТекстОтклонения(ЭтотОбъект)
	Иначе
		ЗаполнитьСуммыВНовойСтрокеТаблицыФрагментов(ТекДанные);
	КонецЕсли;
	
	НужноЗаполнитьИтоги = Истина;
	
	Если ЭтоИностраннаяВалюта Тогда
		// В таблице могут быть строки, в которых рублевая сумма была скорректирована ранее,
		// и отличается от расчета по курсу.
		НужноПересчитатьРублевыеСуммыВТаблицеФрагментов = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиСуммаВалПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные;
	
	РассчитатьСуммыВСтрокеФрагмента(Элемент);
	
	НастроитьФлажокТребуетРеклассификации(ТекДанные);
	
	ОчиститьСтатусПриПустойСуммеБухУчета(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиСуммаРубПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные;
	
	РассчитатьСуммыВСтрокеФрагмента(Элемент);
	
	НастроитьФлажокТребуетРеклассификации(ТекДанные);
	
	ОчиститьСтатусПриПустойСуммеБухУчета(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиСтатусЗадолженностиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные;
	
	НастроитьФлажокТребуетРеклассификации(ТекДанные);
	
	ОчиститьПоляОтраженияПросроченнойДолгосрочной(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиЗаключениеКомиссииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.НачатьВыборЗаключенияКомиссииПоИнвОписи(ЭтотОбъект, Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиЗаключениеКомиссииОткрытие(Элемент, СтандартнаяОбработка)
	
	ИнвентаризацияКлиент.НачатьВводТекстовойСтрокиЗаключенияКомиссии(ЭтотОбъект, СтандартнаяОбработка, "ТаблицаФрагментыСтроки");

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиПричинаОбразованияПояснениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОткрытьФормуРедактированияТекстаОтраженияЗадолженности(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаФрагментыСтрокиПричинаОбразованияДополнительноНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОткрытьФормуРедактированияТекстаОтраженияЗадолженности(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПроверитьИПеренестиВДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьПереданныеСведения()
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ИсходнаяСтрока,
		"Контрагент,Договор,КФО,Счет,КПС,КЭК,ИФО,Подразделение,Валюта,ВидНалогаИПлатежа,НалогИПлатежОрганизации");
	
	// Переносим суммы исходной строки на форму для работы условного оформления.
	ИсходнаяСтрокаСуммаВал = Параметры.ИсходнаяСтрока.СуммаВал;
	ИсходнаяСтрокаСуммаРуб = Параметры.ИсходнаяСтрока.СуммаРуб;
	
	ЭтоИностраннаяВалюта = ЗначениеЗаполнено(Валюта) И Валюта <> Параметры.ВалютаРУ;
	
	ЭтоДебиторскаяЗадолженность = (Параметры.ИмяТЧ = "Раздел21");
	
	СпискиЗабалансовыхСчетов = Документы.ИнвентаризационнаяОписьРасчетовСКонтрагентами.ПолучитьСпискиЗабалансовыхСчетов();
	
	ЗабалансовыеСчета.ЗагрузитьЗначения(СпискиЗабалансовыхСчетов[?(ЭтоДебиторскаяЗадолженность, "ДЗ", "КЗ")]);
	
	ЭтоЗабалансовыйСчет = (ЗабалансовыеСчета.НайтиПоЗначению(Счет) <> Неопределено);
	
	ИдентификаторСтроки = Параметры.ИсходнаяСтрока.ИдентификаторСтроки;
	
	ТаблицаИсходнаяСтрока.Очистить();
	
	НоваяСтрока = ТаблицаИсходнаяСтрока.Добавить();
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры.ИсходнаяСтрока);
	
	ТаблицаФрагментыСтроки.Очистить();
	
	СписокНомеров = Новый СписокЗначений();
	
	Если Параметры.ФрагментыСтроки = Неопределено Тогда
		НоваяСтрока = ТаблицаФрагментыСтроки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры.ИсходнаяСтрока);
		
		СписокНомеров.Добавить(Параметры.ИсходнаяСтрока.НомерСтроки);
	Иначе
		Для Каждого СтруктураСтроки Из Параметры.ФрагментыСтроки Цикл
			НоваяСтрока = ТаблицаФрагментыСтроки.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
			
			СписокНомеров.Добавить(СтруктураСтроки.НомерСтроки);
		КонецЦикла;
	КонецЕсли;
	
	СписокНомеров.СортироватьПоЗначению();
	
	НомераСтрокФрагментов = Новый ФиксированныйМассив(СписокНомеров.ВыгрузитьЗначения());
	
	ВремСтруктураЗаполненияНовойСтроки = Новый Структура("
		|Валюта");
	
	ЗаполнитьЗначенияСвойств(ВремСтруктураЗаполненияНовойСтроки, Параметры.ИсходнаяСтрока);
	
	СтруктураЗаполненияНовойСтроки = Новый ФиксированнаяСтруктура(ВремСтруктураЗаполненияНовойСтроки);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	Заголовок = СтрШаблон(НСтр("ru='Разбивка строки раздела %1'"), ?(Параметры.ИмяТЧ = "Раздел21", "2.1", "2.2"));
	
	// Значения настроек из общего модуля.
	ПриОтсутствииАктаСверкиСчитатьВсюЗадолженностьНеподтвержденной =
		ИнвентаризацияКлиентСервер.ПриОтсутствииАктаСверкиСчитатьВсюЗадолженностьНеподтвержденной();
	
	ДоступноУказаниеАктаСверкиПриОтсутствииПодтвержденнойЗадолженности =
		ИнвентаризацияКлиентСервер.ДоступноУказаниеАктаСверкиПриОтсутствииПодтвержденнойЗадолженности();
	
	ОбеспечиватьРавенствоИтоговРублевыхФрагментовРазбиваемойСумме =
		ИнвентаризацияКлиентСервер.ОбеспечиватьРавенствоИтоговРублевыхФрагментовРазбиваемойСумме();
		
	СтатусыЗадолженностиДопускающиеРеклассификацию.ЗагрузитьЗначения(
		ИнвентаризацияКлиентСервер.ПолучитьСтатусыЗадолженностиДопускающиеРеклассификацию());
		
	СтатусыЗадолженностиДопускающиеОтражениеПросроченной.ЗагрузитьЗначения(
		ИнвентаризацияКлиентСервер.ПолучитьСтатусыЗадолженностиДопускающиеОтражениеПросроченной());
		
	ПредставлениеВалюты = Строка(Валюта);
	
	НастроитьФормуПоВалюте();
	
	НастроитьИтогиНулевыхСуммБухУчета();
	
	НастроитьНедоступностьИзмененияКолонок();
	
	НастроитьСписокВыбораСтатусаЗадолженности();
	
	ЗаполнитьСписокВыбораКодаПричиныОбразования();
	
	// Для формы выбора заключения комиссии.
	Объект = Новый Структура("Ссылка", Параметры.ОписьСсылка);
	Объект = Новый ФиксированнаяСтруктура(Объект);
	
	УстановитьУсловноеОформление(); // Важно размещение в конец процедуры, после полного выполнения инициализации.
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Документы.ИнвентаризационнаяОписьРасчетовСКонтрагентами.УстановитьУсловноеОформление_ФормаРазбивкиСтроки(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСлужебныеКолонкиТаблицы()
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТаблицы Из ТаблицаФрагментыСтроки Цикл
		НомерСтроки = НомерСтроки + 1;
		
		СтрокаТаблицы.НомерСтроки = НомерСтроки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСписокВыбораСтатусаЗадолженности()
	
	Если ЭтоДебиторскаяЗадолженность Тогда
		Если ЭтоЗабалансовыйСчет Тогда
			Список = ИнвентаризацияКлиентСервер.ПолучитьСтатусыДебиторскойЗадолженностиЗабалансовыеСчета();
		Иначе
			Список = ИнвентаризацияКлиентСервер.ПолучитьСтатусыДебиторскойЗадолженностиБалансовыеСчета();
		КонецЕсли;
	Иначе
		Если ЭтоЗабалансовыйСчет Тогда
			Список = ИнвентаризацияКлиентСервер.ПолучитьСтатусыКредиторскойЗадолженностиЗабалансовыеСчета();
		Иначе
			Список = ИнвентаризацияКлиентСервер.ПолучитьСтатусыКредиторскойЗадолженностиБалансовыеСчета();
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ТаблицаФрагментыСтрокиСтатусЗадолженности.СписокВыбора.ЗагрузитьЗначения(Список);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВалюте()
	
	Если Не ЭтоИностраннаяВалюта Тогда
		ИменаЭлементов = Новый Массив();
		ИменаЭлементов.Добавить("ИтогСуммаВал");
		
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ИменаЭлементов, "ФорматРедактирования", "ЧН=х");
	КонецЕсли;
	
	ИменаЭлементов = Новый Массив();
	ИменаЭлементов.Добавить("ИтогСуммаОтклонение");
	
	Положение = ?(ЭтоИностраннаяВалюта, ГоризонтальноеПоложениеЭлемента.Лево, ГоризонтальноеПоложениеЭлемента.Право);
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов, "ГоризонтальноеПоложениеВГруппе", Положение);
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ИменаЭлементов, "ГоризонтальноеПоложение", Положение);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьИтогиНулевыхСуммБухУчета()
	
	ИменаЭлементов = Новый Массив();
	
	Если ИсходнаяСтрокаСуммаВал = 0 Тогда
		ИменаЭлементов.Добавить("ИтогСуммаВал");
	КонецЕсли;
	
	Если ИсходнаяСтрокаСуммаРуб = 0 Тогда
		ИменаЭлементов.Добавить("ИтогСуммаРуб");
	КонецЕсли;
	
	Если ИменаЭлементов.Количество() > 0 Тогда
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ИменаЭлементов, "ФорматРедактирования", "ЧН=х");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПредставлениеВалюты(ФормаДокумента, ЭтоИностраннаяВалюта)
	
	Если ЭтоИностраннаяВалюта Тогда
		Возврат ФормаДокумента.ПредставлениеВалюты;
	Иначе
		Возврат НСтр("ru='руб.'");
	КонецЕсли;
	
КонецФункции

#Область ИменаПолей

&НаКлиентеНаСервереБезКонтекста
Функция ИмяПоляСумма(ПостфиксВидаСуммы, ПостфиксВалютная)
	
	Возврат СтрШаблон("Сумма%1%2", ПостфиксВидаСуммы, ПостфиксВалютная);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяПоляИтогКолонкиФрагментов(КомпонентыИмени)
	
	Возврат СтрШаблон("Итог%1", ИмяПоляСумма(КомпонентыИмени.ВидСуммы, КомпонентыИмени.Валютная));
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыделитьКомпонентыИмениПоля(Знач ИмяПоля)
	
	Если СтрНайти(ИмяПоля, "Подтвержденная") > 0 Тогда
		ВидСуммы = "Подтвержденная";
		ИмяПоля = СтрЗаменить(ИмяПоля, "Подтвержденная", "");
		
	ИначеЕсли СтрНайти(ИмяПоля, "Неподтвержденная") > 0 Тогда
		ВидСуммы = "Неподтвержденная";
		ИмяПоля = СтрЗаменить(ИмяПоля, "Неподтвержденная", "");
		
	Иначе
		ВидСуммы = "";
	КонецЕсли;
	
	Если СтрНайти(ИмяПоля, "Вал") > 0 Тогда
		Валютная = "Вал";
		
	ИначеЕсли СтрНайти(ИмяПоля, "Руб") > 0 Тогда
		Валютная = "Руб";
		
	Иначе
		Валютная = "";
	КонецЕсли;
	
	Возврат НовыйКомпонентыИмени(ВидСуммы, Валютная);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НовыйКомпонентыИмени(ПостфиксВидаСуммы = "", ПостфиксВалютная = "")
	
	КомпонентыИмени = Новый Структура();
	КомпонентыИмени.Вставить("ВидСуммы", ПостфиксВидаСуммы);
	КомпонентыИмени.Вставить("Валютная", ПостфиксВалютная);
	
	Возврат КомпонентыИмени;
	
КонецФункции

#КонецОбласти

#Область РедактированиеИсходнойСтроки

&НаКлиенте
Процедура РассчитатьСуммыВИсходнойСтроке(Элемент)
	
	КомпонентыИмени = ВыделитьКомпонентыИмениПоля(Элемент.Имя);
	
	ПостфиксВидаСуммы	= КомпонентыИмени.ВидСуммы;
	ПостфиксВалютная	= КомпонентыИмени.Валютная;
	
	ИмяПоляБухУчет	= ИмяПоляСумма("", ПостфиксВалютная);
	ИмяПоляСумма	= ИмяПоляСумма(ПостфиксВидаСуммы, ПостфиксВалютная);
	
	ТекДанные = Элементы.ТаблицаИсходнаяСтрока.ТекущиеДанные;
	
	СуммаБухУчет	= ТекДанные[ИмяПоляБухУчет];
	Сумма			= ТекДанные[ИмяПоляСумма];
	
	ИзмененныеПоля = Новый Структура();
	ИзмененныеПоля.Вставить(ИмяПоляСумма, КомпонентыИмени);
	
	// Любая сумма <= Бух.учет (вал., руб.)
	Если (СуммаБухУчет >= 0 И Сумма > СуммаБухУчет) Или (СуммаБухУчет <= 0 И Сумма < СуммаБухУчет) Тогда
		ТекДанные[ИмяПоляСумма] = СуммаБухУчет;
		
		Сумма = СуммаБухУчет;
	КонецЕсли;
	
	Если ПостфиксВидаСуммы = "Подтвержденная" Или ПостфиксВидаСуммы = "Неподтвержденная" Тогда
		// Бух.учет = Подтвержденная + Неподтвержденная (вал., руб.)
		// Такое равенство поддерживается при опциональной настройке.
		
		ПостфиксВидСуммыКор = ?(ПостфиксВидаСуммы = "Подтвержденная", "Неподтвержденная", "Подтвержденная");
		
		ИмяПоляСуммаКор	= ИмяПоляСумма(ПостфиксВидСуммыКор, ПостфиксВалютная);
		
		Если Сумма = 0 И Не ПриОтсутствииАктаСверкиСчитатьВсюЗадолженностьНеподтвержденной Тогда
			СуммаКор = 0;
		Иначе
			СуммаКор = СуммаБухУчет - Сумма;
		КонецЕсли;
		
		ТекДанные[ИмяПоляСумма]		= Сумма;
		ТекДанные[ИмяПоляСуммаКор]	= СуммаКор;
		
		ИзмененныеПоля.Вставить(ИмяПоляСуммаКор, ВыделитьКомпонентыИмениПоля(ИмяПоляСуммаКор));
	КонецЕсли;
	
	Если ПостфиксВалютная = "Вал" Тогда
		ПересчитатьРублевыеСуммыВИсходнойСтроке(ТекДанные, ИзмененныеПоля);
	КонецЕсли;
	
	ОчиститьНедоступныеПоляВИсходнойСтроке(ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРублевыеСуммыВИсходнойСтроке(ТекДанные, ИзмененныеПоля)
	
	Перем Курс;
	
	// В исходной строке редактируются только Подтвержденная и Неподтвержденная задолженности.
	// Просроченная не редактируется.
	// Поэтому ВидСуммы всегда Подтвержденная или Неподтвержденная.
	
	Для Каждого Элемент Из ИзмененныеПоля Цикл
		ИмяПоляСуммаВал = Элемент.Ключ;
		КомпонентыИмени = Элемент.Значение;
		
		Если Курс = Неопределено Тогда
			Курс = ПолучитьКурсВалютыРасчетов(ЭтотОбъект);
		КонецЕсли;
		
		ИмяПоляСуммаРуб = ИмяПоляСумма(КомпонентыИмени.ВидСуммы, "Руб");
		
		ТекДанные[ИмяПоляСуммаРуб] = ТекДанные[ИмяПоляСуммаВал] * Курс;
	КонецЦикла;
	
	Если ОбеспечиватьРавенствоИтоговРублевыхФрагментовРазбиваемойСумме Тогда
		ВыравнятьИтогРублевыхСуммВИсходнойСтроке(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьКурсВалютыРасчетов(ФормаДокумента)
	
	// Курс определяем из остатков бух.учета.
	ИсходнаяСтрока = ФормаДокумента.ТаблицаИсходнаяСтрока[0];
	
	СуммаВал = ИсходнаяСтрока.СуммаВал;
	
	Если ЗначениеЗаполнено(СуммаВал) Тогда
		Возврат ИсходнаяСтрока.СуммаРуб / СуммаВал;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыравнятьИтогРублевыхСуммВИсходнойСтроке(ТекДанные)
	
	Если НужноВыравнятьИтогРублевойСуммыПодтвержденнаяНеподтвержденная(ТекДанные) Тогда
		ВыравнятьИтогРублевойСуммыПодтвержденнаяНеподтвержденная(ТекДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НужноВыравнятьИтогРублевойСуммыПодтвержденнаяНеподтвержденная(ТекДанные)
	
	Если ТекДанные.СуммаПодтвержденнаяВал = 0 И ТекДанные.СуммаНеподтвержденнаяВал = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат (ТекДанные.СуммаПодтвержденнаяРуб + ТекДанные.СуммаНеподтвержденнаяРуб) <> ТекДанные.СуммаРуб;
	
КонецФункции

&НаКлиенте
Процедура ВыравнятьИтогРублевойСуммыПодтвержденнаяНеподтвержденная(ТекДанные)
	
	// Корректируем наибольшую рублевую сумму.
	
	СуммаПодтвержденнаяРуб = ТекДанные.СуммаПодтвержденнаяРуб;
	СуммаНеподтвержденнаяРуб = ТекДанные.СуммаНеподтвержденнаяРуб;
	СуммаБухУчетРуб = ТекДанные.СуммаРуб;
	
	Подтвержденная = Макс(СуммаПодтвержденнаяРуб, -СуммаПодтвержденнаяРуб);
	Неподтвержденная = Макс(СуммаНеподтвержденнаяРуб, -СуммаНеподтвержденнаяРуб);
	
	Если Подтвержденная > Неподтвержденная Тогда
		ИмяПоля = "СуммаПодтвержденнаяРуб";
	Иначе
		ИмяПоля = "СуммаНеподтвержденнаяРуб";
	КонецЕсли;
	
	ТекДанные[ИмяПоля] = СуммаБухУчетРуб - (СуммаПодтвержденнаяРуб + СуммаНеподтвержденнаяРуб - ТекДанные[ИмяПоля]);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНедоступныеПоляВИсходнойСтроке(СтрокаТаблицы)
	
	Если Не ДоступноУказаниеАктаСверкиПриОтсутствииПодтвержденнойЗадолженности Тогда
		ОчиститьПоляАктаСверкиПриОтсутствииПодтвержденнойЗадолженности(СтрокаТаблицы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляАктаСверкиПриОтсутствииПодтвержденнойЗадолженности(СтрокаТаблицы)
	
	// Поля акта сверки недоступны (очищаются), если отсутствует подтвержденная сумма.
	
	Если СтрокаТаблицы.СуммаПодтвержденнаяВал = 0 И СтрокаТаблицы.СуммаПодтвержденнаяРуб = 0 Тогда
		СтрокаТаблицы.ДатаАктаСверки = '00010101';
		СтрокаТаблицы.НомерАктаСверки = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРазбиваемуюСумму(ФормаДокумента, КомпонентыИмени)
	
	Возврат ФормаДокумента[СтрШаблон("ИсходнаяСтрока%1", ИмяПоляСумма(КомпонентыИмени.ВидСуммы, КомпонентыИмени.Валютная))];
	
КонецФункции

#КонецОбласти

#Область РедактированиеФрагментовСтроки

&НаКлиенте
Процедура РассчитатьСуммыВСтрокеФрагмента(Элемент)
	
	КомпонентыИмени = ВыделитьКомпонентыИмениПоля(Элемент.Имя);
	
	ИдСтроки = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные.ПолучитьИдентификатор();
	
	РассчитатьСуммыВСтрокеФрагментаСервер(ИдСтроки, КомпонентыИмени);
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыВСтрокеФрагментаСервер(ИдСтроки, КомпонентыИмени)
	
	ПостфиксВидаСуммы	= КомпонентыИмени.ВидСуммы;
	ПостфиксВалютная	= КомпонентыИмени.Валютная;
	
	ИмяПоля = ИмяПоляСумма(ПостфиксВидаСуммы, ПостфиксВалютная);
	
	РазбиваемаяСумма = ПолучитьРазбиваемуюСумму(ЭтотОбъект, КомпонентыИмени);
	
	ТекДанные = ТаблицаФрагментыСтроки.НайтиПоИдентификатору(ИдСтроки);
	
	ВведеннаяСумма = ТекДанные[ИмяПоля];
	
	ИзмененныеПоля = Новый Структура();
	ИзмененныеПоля.Вставить(ИмяПоля, КомпонентыИмени);
	
	// Любая сумма <= сумма в исходной строке
	Если (РазбиваемаяСумма >= 0 И ВведеннаяСумма > РазбиваемаяСумма) Или (РазбиваемаяСумма <= 0 И ВведеннаяСумма < РазбиваемаяСумма) Тогда
		ВведеннаяСумма = РазбиваемаяСумма;
		
		ТекДанные[ИмяПоля] = ВведеннаяСумма;
	КонецЕсли;
	
	Если ПостфиксВалютная = "Вал" Тогда
		ПересчитатьРублевыеСуммыВСтрокеФрагмента(ЭтотОбъект, ТекДанные, ИзмененныеПоля);
	КонецЕсли;
	
	ОбновитьИтогиТаблицы(ЭтотОбъект);
	
	ОбновитьТекстОтклонения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтатусПриПустойСуммеБухУчета(СтрокаТаблицы)
	
	// Поле статуса задолженности недоступно (очищается), если отсутствует сумма по бух.учету.
	
	Если СтрокаТаблицы.СуммаВал = 0 И СтрокаТаблицы.СуммаРуб = 0 Тогда
		СтрокаТаблицы.СтатусЗадолженности = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыВНовойСтрокеТаблицыФрагментов(СтрокаТаблицы)
	
	ПостфиксВалютная = ?(ЭтоИностраннаяВалюта, "Вал", "Руб");
	
	КомпонентыИмени = НовыйКомпонентыИмени("", ПостфиксВалютная);
	
	РезультатДиагностики = ДиагностироватьНаличиеОтклонения(ЭтотОбъект, КомпонентыИмени);
	
	Если ЗначениеЗаполнено(РезультатДиагностики.НеХватает) Тогда
		ИмяПоля = ИмяПоляСумма("" , ПостфиксВалютная);
		
		СтрокаТаблицы[ИмяПоля] = РезультатДиагностики.НеХватает;
		
		Если ЭтоИностраннаяВалюта Тогда
			ИзмененноеПоле = Новый Структура();
			ИзмененноеПоле.Вставить(ИмяПоля, ВыделитьКомпонентыИмениПоля(ИмяПоля));
			
			ПересчитатьРублевыеСуммыВСтрокеФрагмента(ЭтотОбъект, СтрокаТаблицы, ИзмененноеПоле);
		КонецЕсли;
		
		ОбновитьИтогиТаблицы(ЭтотОбъект);
		
		ОбновитьТекстОтклонения(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьРублевыеСуммыВСтрокеФрагмента(ФормаДокумента, ТекДанные, ИзмененныеПоля)
	
	Курс = ПолучитьКурсВалютыРасчетов(ФормаДокумента);
	
	Для Каждого Элемент Из ИзмененныеПоля Цикл
		ИмяПоляСуммаВал = Элемент.Ключ;
		КомпонентыИмени = Элемент.Значение;
		
		ИмяПоляСуммаРуб = ИмяПоляСумма(КомпонентыИмени.ВидСуммы, "Руб");
		
		ТекДанные[ИмяПоляСуммаРуб] = ТекДанные[ИмяПоляСуммаВал] * Курс;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьРублевыеСуммыВТаблицеФрагментов()
	
	Курс = ПолучитьКурсВалютыРасчетов(ЭтотОбъект);
	
	Для Каждого СтрокаТаблицы Из ТаблицаФрагментыСтроки Цикл
		СтрокаТаблицы.СуммаРуб = СтрокаТаблицы.СуммаВал * Курс;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФлажокТребуетРеклассификации(ТекДанные)
	
	ТекДанные.СуммаТребуетРеклассификации = 
		(ЗначениеЗаполнено(ТекДанные.СуммаВал) Или ЗначениеЗаполнено(ТекДанные.СуммаРуб))
		И СтатусыЗадолженностиДопускающиеРеклассификацию.НайтиПоЗначению(ТекДанные.СтатусЗадолженности) <> Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ИтогиФрагментовСтроки

&НаКлиенте
Процедура НажатаГиперссылкаИтого(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяПоля = СтрЗаменить(Элемент.Имя, "Итог", "");
	ИмяПоля = СтрЗаменить(ИмяПоля, "Отклонение", "");
	
	КомпонентыИмени = ВыделитьКомпонентыИмениПоля(ИмяПоля);
	
	КомпонентыИмени.Валютная = ?(ЭтоИностраннаяВалюта, "Вал", "Руб");
	
	ПостфиксВидаСуммы	= КомпонентыИмени.ВидСуммы;
	ПостфиксВалютная	= КомпонентыИмени.Валютная;
	
	РезультатДиагностики = ДиагностироватьНаличиеОтклонения(ЭтотОбъект, КомпонентыИмени);
	
	Если РезультатДиагностики.Совпадает
		И ЭтоИностраннаяВалюта И ОбеспечиватьРавенствоИтоговРублевыхФрагментовРазбиваемойСумме Тогда
		ПостфиксВалютная = "Руб";
		
		КомпонентыИмени.Валютная = ПостфиксВалютная;
		
		РезультатДиагностики = ДиагностироватьНаличиеОтклонения(ЭтотОбъект, КомпонентыИмени);
	КонецЕсли;
	
	ДиагностикаВыполненаДляВалютнойСуммы = (КомпонентыИмени.Валютная = "Вал");
	
	Если РезультатДиагностики.Совпадает Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНаправление = ?(ЗначениеЗаполнено(РезультатДиагностики.ПревышеноНа), НСтр("ru='Уменьшить'"), НСтр("ru='Увеличить'"));
	
	ВеличинаИзменения = ?(ЗначениеЗаполнено(РезультатДиагностики.ПревышеноНа), РезультатДиагностики.ПревышеноНа, РезультатДиагностики.НеХватает);
	
	ИмяПоля = ИмяПоляСумма(ПостфиксВидаСуммы, ПостфиксВалютная);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяПоля",					ИмяПоля);
	ДополнительныеПараметры.Вставить("КомпонентыИмени",			КомпонентыИмени);
	ДополнительныеПараметры.Вставить("ТекДанные",				ТекДанные);
	ДополнительныеПараметры.Вставить("РезультатДиагностики",	РезультатДиагностики);
	ДополнительныеПараметры.Вставить("ДиагностикаВыполненаДляВалютнойСуммы", ДиагностикаВыполненаДляВалютнойСуммы);
	
	Оповещение = Новый ОписаниеОповещения("НажатаГиперссылкаИтогоВыбор", ЭтотОбъект, ДополнительныеПараметры);
	
	ТекстВопроса = СтрШаблон(НСтр("ru='%1 на %2 %3 сумму в текущей строке таблицы фрагментов?'"),
		ТекстНаправление,
		Формат(ВеличинаИзменения, "ЧДЦ=2"),
		ПолучитьПредставлениеВалюты(ЭтотОбъект, ДиагностикаВыполненаДляВалютнойСуммы));
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура НажатаГиперссылкаИтогоВыбор(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = ДополнительныеПараметры.ИмяПоля;
	
	КомпонентыИмени = ДополнительныеПараметры.КомпонентыИмени;
	
	РазбиваемаяСумма = ПолучитьРазбиваемуюСумму(ЭтотОбъект, КомпонентыИмени);
	
	Если ЗначениеЗаполнено(ДополнительныеПараметры.РезультатДиагностики.НеХватает) Тогда
		НовоеЗначение = ДополнительныеПараметры.ТекДанные[ИмяПоля]
			+ ДополнительныеПараметры.РезультатДиагностики.НеХватает;
			
	ИначеЕсли ЗначениеЗаполнено(ДополнительныеПараметры.РезультатДиагностики.ПревышеноНа) Тогда
		НовоеЗначение = ДополнительныеПараметры.ТекДанные[ИмяПоля]
			- ДополнительныеПараметры.РезультатДиагностики.ПревышеноНа;
	КонецЕсли;
	
	Если НовоеЗначение < 0 Тогда
		НовоеЗначение = 0;
	КонецЕсли;
	
	Если РазбиваемаяСумма >= 0 И НовоеЗначение > РазбиваемаяСумма Или РазбиваемаяСумма <= 0 И НовоеЗначение < РазбиваемаяСумма Тогда
		НовоеЗначение = РазбиваемаяСумма;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекДанные[ИмяПоля] = НовоеЗначение;
	
	Если НовоеЗначение = 0 Тогда
		// Очищаем статус задолженности.
		ДополнительныеПараметры.ТекДанные.СтатусЗадолженности = Неопределено;
		ДополнительныеПараметры.ТекДанные.СуммаТребуетРеклассификации = Ложь;
	КонецЕсли;
	
	НастроитьФлажокТребуетРеклассификации(ДополнительныеПараметры.ТекДанные);
	
	Если ДополнительныеПараметры.ДиагностикаВыполненаДляВалютнойСуммы Тогда
		КомпонентыИмени = ВыделитьКомпонентыИмениПоля(ИмяПоля);
		
		ИзмененныеПоля = Новый Структура();
		ИзмененныеПоля.Вставить(ИмяПоля, КомпонентыИмени);
		
		ПересчитатьРублевыеСуммыВСтрокеФрагмента(ЭтотОбъект, ДополнительныеПараметры.ТекДанные, ИзмененныеПоля);
	КонецЕсли;
	
	ОбновитьИтогиТаблицы(ЭтотОбъект);
	
	ОбновитьТекстОтклонения(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтогиТаблицы(ФормаДокумента)
	
	ТаблицаФрагментыСтроки = ФормаДокумента.ТаблицаФрагментыСтроки;
	
	ФормаДокумента.ИтогСуммаВал = ТаблицаФрагментыСтроки.Итог("СуммаВал");
	ФормаДокумента.ИтогСуммаРуб = ТаблицаФрагментыСтроки.Итог("СуммаРуб");
	
	ФормаДокумента.КоличествоФрагментовСтроки = ТаблицаФрагментыСтроки.Количество();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстОтклонения(ФормаДокумента)
	
	ФормаДокумента.ИтогСуммаОтклонение = ПолучитьТекстОтклонения(ФормаДокумента, ФормаДокумента.ЭтоИностраннаяВалюта);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьТекстОтклонения(ФормаДокумента, ЭтоИностраннаяВалюта)
	
	ПостфиксВалютная = ?(ЭтоИностраннаяВалюта, "Вал", "Руб");
	
	КомпонентыИмени = НовыйКомпонентыИмени("", ПостфиксВалютная);
	
	РазбиваемаяСумма = ПолучитьРазбиваемуюСумму(ФормаДокумента, КомпонентыИмени);
	
	Если РазбиваемаяСумма = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	РезультатДиагностики = ДиагностироватьНаличиеОтклонения(ФормаДокумента, КомпонентыИмени);
	
	Если РезультатДиагностики.Совпадает Тогда
		Если ЭтоИностраннаяВалюта И ФормаДокумента.ОбеспечиватьРавенствоИтоговРублевыхФрагментовРазбиваемойСумме Тогда
			Возврат ПолучитьТекстОтклонения(ФормаДокумента, Ложь);
		Иначе
			Возврат НСтр("ru='Совпадает'");
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(РезультатДиагностики.ПревышеноНа) Тогда
		Возврат СтрШаблон(НСтр("ru='Превышено на %1 %2'"),
			Формат(РезультатДиагностики.ПревышеноНа, "ЧДЦ=2"),
			ПолучитьПредставлениеВалюты(ФормаДокумента, ЭтоИностраннаяВалюта));
		
	Иначе
		Возврат СтрШаблон(НСтр("ru='Не хватает %1 %2'"),
			Формат(РезультатДиагностики.НеХватает, "ЧДЦ=2"),
			ПолучитьПредставлениеВалюты(ФормаДокумента, ЭтоИностраннаяВалюта));
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИтогКолонкиФрагментов(ФормаДокумента, КомпонентыИмени)
	
	ИмяПоляИтог = ИмяПоляИтогКолонкиФрагментов(КомпонентыИмени);
	
	Возврат ФормаДокумента[ИмяПоляИтог];
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДиагностироватьНаличиеОтклонения(ФормаДокумента, КомпонентыИмени)
	
	РазбиваемаяСумма = ПолучитьРазбиваемуюСумму(ФормаДокумента, КомпонентыИмени);
	
	Итог = ПолучитьИтогКолонкиФрагментов(ФормаДокумента, КомпонентыИмени);
	
	Результат = Новый Структура("Совпадает,ПревышеноНа,НеХватает", Ложь, 0, 0);
	
	Результат.Совпадает = (Итог = РазбиваемаяСумма);
	
	Если Итог > РазбиваемаяСумма Тогда
		Результат.ПревышеноНа = Итог - РазбиваемаяСумма;
	Иначе
		Результат.НеХватает = РазбиваемаяСумма - Итог;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗаполнения

&НаКлиенте
Функция ПроверитьПередЗакрытием()
	
	Отказ = Ложь;
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоИностраннаяВалюта Тогда
		ПроверитьРублевыеСуммыФрагментов(Отказ);
	КонецЕсли;
	
	Возврат Не Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьРублевыеСуммыФрагментов(Отказ)
	
	ИмяПоля = "СуммаРуб";
	
	РазбиваемаяСумма	= ЭтотОбъект["ИсходнаяСтрока" + ИмяПоля];
	ИтогПоТаблице		= ЭтотОбъект["Итог" + ИмяПоля];
	
	Если ИтогПоТаблице = РазбиваемаяСумма Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ТекстПояснения = СтрШаблон(
		НСтр("ru='Итог по колонке ""Сумма в рублях"" (%1) отличается от разбиваемой суммы (%2) исходной строки'"),
		Формат(ИтогПоТаблице, "ЧДЦ=2"),
		Формат(РазбиваемаяСумма, "ЧДЦ=2"));
	
	ТекстВопроса = НСтр("ru='Продолжить и заменить указанную сумму в исходной строке на значение итога?'");
	
	Оповещение = Новый ОписаниеОповещения("ПроверитьРублевыеСуммыФрагментовВыбор", ЭтотОбъект);

	ТекстСообщения = СтрШаблон(НСтр("ru='Справочно.
		|%1
		|
		|%2'"),
		ТекстПояснения,
		ТекстВопроса);
	
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьРублевыеСуммыФрагментовВыбор(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть(ПолучитьВозвращаемоеЗначениеКлиент());
	
КонецПроцедуры

#КонецОбласти

#Область ВозвращаемоеЗначение

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыбора = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		
		Закрыть();
	КонецЕсли;
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ПроверитьИПеренестиВДокумент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИПеренестиВДокумент()
	
	Если Не ПроверитьПередЗакрытием() Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть(ПолучитьВозвращаемоеЗначениеКлиент());
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьВозвращаемоеЗначениеКлиент()
	
	Возврат ПолучитьВозвращаемоеЗначениеСервер();
	
КонецФункции

&НаСервере
Функция ПолучитьВозвращаемоеЗначениеСервер()
	
	Если Не ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
		ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	Таблица = ТаблицаФрагментыСтроки.Выгрузить();
	
	ФрагментыСтроки = ОбщегоНазначения.ТаблицаЗначенийВМассив(Таблица);
	
	Счетчик = 0;
	
	Для Каждого СтруктураСтроки Из ФрагментыСтроки Цикл
		Счетчик = Счетчик + 1;
		
		СтруктураСтроки.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
		СтруктураСтроки.Вставить("ПризнакФрагментаСтроки", Истина);
		СтруктураСтроки.Вставить("ПризнакПервогоФрагментаСтроки", (Счетчик = 1));
		
		СтруктураСтроки.Удалить("НомерСтроки");
	КонецЦикла;
	
	Результат = Новый Структура();
	Результат.Вставить("ИсходнаяСтрока",		ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаИсходнаяСтрока.Выгрузить())[0]);
	Результат.Вставить("ФрагментыСтроки",		ФрагментыСтроки);
	Результат.Вставить("НомераСтрокФрагментов",	НомераСтрокФрагментов);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НедоступныеКолонки

&НаСервере
Процедура НастроитьНедоступностьИзмененияКолонок()
	
	НедоступныеКолонки = Новый Массив();
	
	НедоступныеКолонки.Добавить("ТаблицаИсходнаяСтрокаВалюта");
	НедоступныеКолонки.Добавить("ТаблицаИсходнаяСтрокаСуммаВал");
	НедоступныеКолонки.Добавить("ТаблицаИсходнаяСтрокаСуммаРуб");
	
	ИнвентаризацияСервер.НастроитьНедоступностьИзмененияКолонокНаФормеОписи(ЭтотОбъект, НедоступныеКолонки);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НедоступностьИзмененияКолонок_Очистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОтражениеПросроченнойИДолгосрочнойЗадолженности

&НаСервере
Процедура ЗаполнитьСписокВыбораКодаПричиныОбразования()
	
	Если Параметры.ИмяТЧ = "Раздел21" Тогда
		ВидЗадолженности = Перечисления.ВидыЗадолженности.Дебиторская;
		
	ИначеЕсли Параметры.ИмяТЧ = "Раздел22" Тогда
		ВидЗадолженности = Перечисления.ВидыЗадолженности.Кредиторская;
		
	Иначе
		Возврат;
	КонецЕсли;
	
	ПричиныОбразования = БухгалтерскийУчет.ПереченьПричинПросроченнойЗадолженности(ВидЗадолженности);
	
	Элементы.ТаблицаФрагментыСтрокиПричинаОбразованияКод.СписокВыбора.ЗагрузитьЗначения(ПричиныОбразования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактированияТекстаОтраженияЗадолженности(Элемент, СтандартнаяОбработка)
	
	ИмяПоля = СтрЗаменить(Элемент.Имя, "ТаблицаФрагментыСтроки", "");
	
	Если ИмяПоля = "ПричинаОбразованияПояснение" Тогда
		ЗаголовокПоля = НСтр("ru='Причина возникновения задолженности'");
	ИначеЕсли ИмяПоля = "ПричинаОбразованияДополнительно" Тогда
		ЗаголовокПоля = НСтр("ru='Дополнительное описание причины возникновения задолженности'");
	Иначе
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеПоля = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные[ИмяПоля];
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяПоля",	ИмяПоля);
	
	Оповещение = Новый ОписаниеОповещения("ВведенТекстОтраженияЗадолженности", ЭтотОбъект, ДополнительныеПараметры);
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, ЗначениеПоля, ЗаголовокПоля);
	
КонецПроцедуры

&НаКлиенте
Процедура ВведенТекстОтраженияЗадолженности(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоля = ДополнительныеПараметры.ИмяПоля;
	
	ТекДанные = Элементы.ТаблицаФрагментыСтроки.ТекущиеДанные;
	
	ТекДанные[ИмяПоля] = ВыбранноеЗначение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПоляОтраженияПросроченнойДолгосрочной(ТекДанные)
	
	СтатусДопускаетОтражение = (СтатусыЗадолженностиДопускающиеОтражениеПросроченной.НайтиПоЗначению(ТекДанные.СтатусЗадолженности) <> Неопределено);
	
	Если СтатусДопускаетОтражение Тогда
		Возврат;
	КонецЕсли;
	
	ОчищающаяСтруктура = Новый Структура("
		|ДатаВозникновения,
		|ПричинаОбразованияКод,
		|ПричинаОбразованияПояснение,
		|ПричинаОбразованияДополнительно");
	
	ЗаполнитьЗначенияСвойств(ТекДанные, ОчищающаяСтруктура);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

