
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
	Данные = ЗаписьОбъект.Макет.Получить();
	
	Если ТипЗнч(Данные) = тип("Структура") Тогда 
		УстановитьТипКоллекции("Структура");
		
	ИначеЕсли ТипЗнч(Данные) = тип("Соответствие") Тогда 
		УстановитьТипКоллекции("Соответствие");
		
	Иначе 
		УстановитьТипКоллекции("");
		
		Возврат;
	КонецЕсли;	
		
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Данные,Коллекция);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Данные = Неопределено;
	
	Если ТипКоллекции = "Структура" Тогда 
		
		Данные = Новый Структура;
		
	ИначеЕсли ТипКоллекции = "Соответствие" Тогда 	
		
		Данные = Новый Соответствие;
		
	КонецЕсли;
	
	Если Данные <> Неопределено Тогда 
		Для Каждого СтрокаКоллекции из Коллекция Цикл
			Данные.Вставить(СтрокаКоллекции.Ключ,СтрокаКоллекции.Значение);
		КонецЦикла;
	КонецЕсли;	
	
	ТекущийОбъект.Макет = Новый ХранилищеЗначения(Данные);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	КоллекцияДляПроверки = Коллекция.Выгрузить();
	КоллекцияДляПроверки.Колонки.Добавить("Счетчик");
	КоллекцияДляПроверки.ЗаполнитьЗначения(1,"Счетчик");
	КоллекцияДляПроверки.Свернуть("Ключ","Счетчик");
	
	Для Каждого СтрокаКоллнецииДляПроверки из КоллекцияДляПроверки Цикл 
		Если СтрокаКоллнецииДляПроверки.Счетчик = 1 Тогда 
			Продолжить;
		КонецЕсли;	
		
		Отказ = Истина;
		ЗадвоенныеСтроки = Коллекция.НайтиСтроки(Новый Структура("Ключ",СтрокаКоллнецииДляПроверки.Ключ));
		
		Для Каждого ЗадвоеннаяСтрока из ЗадвоенныеСтроки Цикл 
			
			Шаблон = НСтр(
			"ru = 'Существует несколько строк с ключом ""%1"".'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,СтрокаКоллнецииДляПроверки.Ключ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Коллекция",Коллекция.Индекс(ЗадвоеннаяСтрока)+1,"Ключ"));
			
		КонецЦикла;
		
	КонецЦикла;	
	
	
	Если ТипКоллекции = "Структура" Тогда 
		
		Для Каждого СтрокаКоллекции из Коллекция Цикл 
			РезультатПроверки = БюджетнаяОтчетностьКлиентСервер.СтрокаСоответствуетТребованиямКИменамПеременных(СтрокаКоллекции.Ключ);
			
			Если РезультатПроверки.Результат Тогда 
				Продолжить;
			КонецЕсли;
			Отказ = Истина;
			
			Шаблон = НСтр(
			"ru = 'Ключь строки соответствия не соответствует требованиям к именам переменных. 
			|Причина: %1'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,РезультатПроверки.Причина);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Коллекция",Коллекция.Индекс(СтрокаКоллекции)+1,"Ключ"));
		КонецЦикла;	
		
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьТипКоллекции(Команда)
	УстановитьТипКоллекции(ТипКоллекции);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьТипКоллекции(НовыйТипКоллекции)
	
	Коллекция.Очистить();
	
	Если НовыйТипКоллекции = "Структура" или НовыйТипКоллекции = "Соответствие" Тогда 
		
		ТипКоллекции = НовыйТипКоллекции;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаРедактированияКоллекции;
		Если НовыйТипКоллекции = "Структура" Тогда 
			Элементы.КоллекцияКлючь.ОграничениеТипа = Новый ОписаниеТипов("Строка");
			Элементы.КоллекцияКлючь.ВыбиратьТип = Ложь;
		Иначе 
			Элементы.КоллекцияКлючь.ВыбиратьТип = Истина;
		КонецЕсли;	
		
	Иначе 
		
		ТипКоллекции = "";
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаВыборТипаКоллекции;                 
		
	КонецЕсли;	
	
	
КонецПроцедуры	

