#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСтатусыНеИнвентаризационнойКомиссии() Экспорт
	
	// Разрешены лишь некоторые значения перечисления.
	
	МассивСтатусов = Новый Массив();
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.Председатель);
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.ЧленКомиссии);
	
	Возврат МассивСтатусов;
	
КонецФункции

Функция ПолучитьСтатусыИнвентаризационнойКомиссии() Экспорт
	
	// Разрешены все значения перечисления.
	
	МассивСтатусов = Новый Массив();
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.Председатель);
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.ЗаместительПредседателя);
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо);
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.ЗаместительУполномоченногоПредседателемЛица);
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.ЧленКомиссии);
	МассивСтатусов.Добавить(Перечисления.СтатусыЧленовКомиссии.Эксперт);
	
	Возврат МассивСтатусов;
	
КонецФункции

#КонецОбласти

#КонецЕсли