////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТипЗнч(Параметры.ЗначениеКопирования) = Тип("СправочникСсылка.ОбластиЗаполнения") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		
		ОбъектКопирования = Параметры.ЗначениеКопирования.ПолучитьОбъект();
		
		Буфер = ОбъектКопирования.НаборыДанных.Получить();
		СправочникОбъект.НаборыДанных = Новый ХранилищеЗначения(Буфер, Новый СжатиеДанных(9));
		
		Буфер = ОбъектКопирования.СхемаИсточника.Получить();
		СправочникОбъект.СхемаИсточника = Новый ХранилищеЗначения(Буфер, Новый СжатиеДанных(9));
		
		Буфер = ОбъектКопирования.ТаблицаСвязейСКартами.Получить();
		СправочникОбъект.ТаблицаСвязейСКартами = Новый ХранилищеЗначения(Буфер, Новый СжатиеДанных(9));
		
		Буфер = ОбъектКопирования.СхемаЗаполнения.Получить();
		СправочникОбъект.СхемаЗаполнения = Новый ХранилищеЗначения(Буфер, Новый СжатиеДанных(9));
		
	КонецЕсли;
	
	ВидОтчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец,"Владелец");
	
	ЗаполнитьОбщиеПараметры();
	
	ЗаполнитьКартыДанных();
	
	ЗаполнитьДоступныеВызовы();
	
	ЗаполнитьНаборыДанных(СправочникОбъект);
	
	ТаблицаСвязей = СправочникОбъект.ТаблицаСвязейСКартами.Получить();
	Если ТипЗнч(ТаблицаСвязей) = Тип("ТаблицаЗначений") Тогда
		
		АдресТаблицыСвязей = ПоместитьВоВременноеХранилище(ТаблицаСвязей, УникальныйИдентификатор);
		
	КонецЕсли;
	
	СхемаИсточника = СправочникОбъект.СхемаИсточника.Получить();
	Если ТипЗнч(СхемаИсточника) = Тип("СхемаКомпоновкиДанных") Тогда
		
		АдресСхемыИсточника = ПоместитьВоВременноеХранилище(СхемаИсточника, УникальныйИдентификатор);
		
		ИнициализироватьКомпоновщик();
		
	КонецЕсли;
	
	СхемаЗаполнения = СправочникОбъект.СхемаЗаполнения.Получить();
	Если ТипЗнч(СхемаЗаполнения) = Тип("ТаблицаЗначений") Тогда
		
		АдресСхемыЗаполнения = ПоместитьВоВременноеХранилище(СхемаЗаполнения, УникальныйИдентификатор);
		
	КонецЕсли;
	
	СхемаКомпоновки = СправочникОбъект.СхемаКомпоновки.Получить();
	Если ТипЗнч(СхемаКомпоновки) = Тип("СхемаКомпоновкиДанных") Тогда
		
		АдресСхемыКомпоновки = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.УсловиеПрименения) Тогда
		Элементы.Условие.Заголовок = "Условие применения области заполнения (*)";
	Иначе
		Элементы.Условие.Заголовок = "Условие применения области заполнения";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ФормаРедактированияИсточника" Тогда
		
		Если ИмяСобытия = "РедактированиеИсточника" И Параметр.ОбластьЗаполнения = Объект.Ссылка Тогда
			
			АдресСхемыИсточника = Параметр.АдресСхемы;
			АдресаНаборов = Параметр.АдресаНаборов;
			АдресКомпоновщикаНастроек = Параметр.АдресКомпоновщикаНастроек;
			АдресТаблицыСвязей = Параметр.АдресТаблицыСвязей;
			
			ЗагрузитьВычисляемыеПараметры(Параметр.АдресВычисляемыхПараметров);
			
			СхемаКомпоновкиАктуальна = Ложь;
			
			Модифицированность = Истина;
			
		КонецЕсли;
		
	ИначеЕсли Источник = "СхемаЗаполнения" Тогда
		
		Если ИмяСобытия = "ЗаполнениеСхемыДанных" И Параметр.ОбластьЗаполнения = Объект.Ссылка Тогда
			
			АдресСхемыКомпоновки = Параметр.АдресСхемыКомпоновки;
			АдресСхемыЗаполнения = Параметр.АдресСхемыЗаполнения;
			
			Объект.ВидСхемыЗаполнения = Параметр.ВидСхемыЗаполнения;
			
			СхемаКомпоновкиАктуальна = Истина;
			
			Модифицированность = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем СхемаКомпоновки;
	Перем СхемаИсточника;
	Перем ТаблицаСвязейСКартами;
	Перем СхемаЗаполнения;
	
	ТекущийОбъект.Инициализирована = Истина;
	
	Если НЕ ПустаяСтрока(АдресСхемыИсточника) Тогда
		СхемаИсточника = ПолучитьИзВременногоХранилища(АдресСхемыИсточника);
		ТекущийОбъект.СхемаИсточника = Новый ХранилищеЗначения(СхемаИсточника, Новый СжатиеДанных(9));
	Иначе
		ТекущийОбъект.Инициализирована = Ложь;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(АдресТаблицыСвязей) Тогда
		ТаблицаСвязейСКартами = ПолучитьИзВременногоХранилища(АдресТаблицыСвязей);
		ТекущийОбъект.ТаблицаСвязейСКартами = Новый ХранилищеЗначения(ТаблицаСвязейСКартами, Новый СжатиеДанных(9));
	Иначе
		ТекущийОбъект.Инициализирована = Ложь;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(АдресСхемыЗаполнения) Тогда
		СхемаЗаполнения = ПолучитьИзВременногоХранилища(АдресСхемыЗаполнения);
		ТекущийОбъект.СхемаЗаполнения = Новый ХранилищеЗначения(СхемаЗаполнения, Новый СжатиеДанных(9));
	Иначе
		ТекущийОбъект.Инициализирована = Ложь;
	КонецЕсли;
	
	Если НЕ СхемаКомпоновкиАктуальна И НЕ ПустаяСтрока(СхемаИсточника) И НЕ ПустаяСтрока(СхемаЗаполнения) Тогда
		СхемаКомпоновки = ЗаполнениеОтчетностиСервер.ПолучитьСхемуКомпоновки(СхемаИсточника, СхемаЗаполнения, ТаблицаСвязейСКартами, 
				ТекущийОбъект.ВидСхемыЗаполнения);
	ИначеЕсли НЕ ПустаяСтрока(АдресСхемыКомпоновки) Тогда
		СхемаКомпоновки = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновки);
	КонецЕсли;
	
	Если ТипЗнч(СхемаКомпоновки) = Тип("СхемаКомпоновкиДанных") Тогда
		ТекущийОбъект.СхемаКомпоновки = Новый ХранилищеЗначения(СхемаКомпоновки, Новый СжатиеДанных(9));
	Иначе
		ТекущийОбъект.Инициализирована = Ложь;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(АдресаНаборов) Тогда
		
		СохраняемыеНаборыДанных = Новый Массив;
		Для каждого ЭлементСписка Из АдресаНаборов Цикл
			
			СтруктураНабора = Новый Структура("Наименование, ВидТаблицы, НаборДанных, Комментарий");
			
			ЗаполнитьЗначенияСвойств(СтруктураНабора, ЭлементСписка.Значение);
			СтруктураНабора.НаборДанных = ПолучитьИзВременногоХранилища(ЭлементСписка.Значение.АдресСхемы);
			
			СохраняемыеНаборыДанных.Добавить(СтруктураНабора);
			
		КонецЦикла;
		
		ТекущийОбъект.НаборыДанных = Новый ХранилищеЗначения(СохраняемыеНаборыДанных, Новый СжатиеДанных(9));
		
	Иначе
		
		ТекущийОбъект.Инициализирована = Ложь;
		
	КонецЕсли;
	
	Если ИзменялсяСоставВычисляемыхПараметров Тогда
		ТекущийОбъект.Инициализирована = Ложь;
	КонецЕсли;
	
	Если НЕ ТекущийОбъект.Инициализирована Тогда
		
		ТекстОшибки = "";
		Попытка
			ТекущийОбъект.Инициализирована = ТекущийОбъект.ИнициализироватьОбластьЗаполнения(Истина, Неопределено, Неопределено, Истина, ТекстОшибки);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;
		
		Если НЕ ТекущийОбъект.Инициализирована Тогда
			
			ТекстСообщения = НСтр("ru = 'Область заполнения ""%1"" не инициализирована. Ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекущийОбъект.Наименование, ТекстОшибки);
			
			ЗаписьЖурналаРегистрации("ОбластиЗаполнения.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.ПравилаЗаполнения, ТекущийОбъект.Наименование, ТекстСообщения);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаполнитьНаборыДанных(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ИзменялсяСоставВычисляемыхПараметров = Ложь;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура УсловиеПримененияПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.УсловиеПрименения) Тогда
		Элементы.Условие.Заголовок = "Условие применения области заполнения (*)";
	Иначе
		Элементы.Условие.Заголовок = "Условие применения области заполнения";
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗадатьИсточник(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Событие", "РедактированиеИсточника");
	ПараметрыФормы.Вставить("ПравилоЗаполнения",Объект.Владелец);
	ПараметрыФормы.Вставить("ОбластьЗаполнения",Объект.Ссылка);
	ПараметрыФормы.Вставить("КартыДанных",КартыДанных);
	ПараметрыФормы.Вставить("АдресСтруктурыКартДанных",АдресСтруктурыКартДанных);
	ПараметрыФормы.Вставить("АдресСхемы",АдресСхемыИсточника);
	ПараметрыФормы.Вставить("АдресаНаборов",АдресаНаборов);
	ПараметрыФормы.Вставить("АдресТаблицыПараметров",АдресТаблицыПараметров);
	ПараметрыФормы.Вставить("АдресТаблицыСвязей",АдресТаблицыСвязей);
	ПараметрыФормы.Вставить("АдресКомпоновщикаНастроек", АдресКомпоновщикаНастроек);
	ПараметрыФормы.Вставить("АдресВычисляемыхПараметров", ПолучитьАдресВычисляемыхПараметров());
	ПараметрыФормы.Вставить("Заголовок",Объект.Наименование);
	
	ОткрытьФорму("Справочник.ОбластиЗаполнения.Форма.ФормаРедактированияИсточника",ПараметрыФормы,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьСхемуЗаполнения(Команда)
	
	СтрокиОбласти = Новый Массив;
	Для каждого ВыбСтрока Из Объект.СоставОбласти Цикл
		СтрокиОбласти.Добавить(ВыбСтрока.СтрокаОтчета);
	КонецЦикла;
	
	СтруктураАналитики = ПолучитьАналитикуИГрафыСтрокОбласти(СтрокиОбласти);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСхемыКомпоновки", АдресСхемыКомпоновки);
	ПараметрыФормы.Вставить("АдресСхемыИсточника", АдресСхемыИсточника);
	ПараметрыФормы.Вставить("АдресСхемыЗаполнения", АдресСхемыЗаполнения);
	ПараметрыФормы.Вставить("ВидСхемыЗаполнения", Объект.ВидСхемыЗаполнения);
	ПараметрыФормы.Вставить("АдресТаблицыСвязей", АдресТаблицыСвязей);
	ПараметрыФормы.Вставить("АдресДоступныхВызовов", АдресДоступныхВызовов);
	ПараметрыФормы.Вставить("АдресКомпоновщикаНастроек", АдресКомпоновщикаНастроек);
	ПараметрыФормы.Вставить("СтруктураАналитики", Новый ФиксированнаяСтруктура(СтруктураАналитики));
	ПараметрыФормы.Вставить("Событие", "ЗаполнениеСхемыДанных");
	ПараметрыФормы.Вставить("Заголовок",Объект.Наименование);
	ПараметрыФормы.Вставить("ПравилоЗаполнения",Объект.Владелец);
	ПараметрыФормы.Вставить("ОбластьЗаполнения",Объект.Ссылка);	
	
	ОткрытьФорму("Справочник.ОбластиЗаполнения.Форма.СхемаЗаполнения", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборСтрок(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",Новый Структура("Владелец", ВидОтчета));
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("РазрешитьВыборКорня", Ложь);
	
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяФормы","Справочник.СтрокиОтчетов.Форма.ФормаВыбора"); 
	ДополнительныеПараметры.Вставить("ПараметрыФормы",ПараметрыФормы);
	ДополнительныеПараметры.Вставить("ВладелецФормы",ЭтаФорма);
	ДополнительныеПараметры.Вставить("ПервичнаяПроверка","ТипЗнч(Результат) = Тип(""Массив"")");
	
	СтруктураОбработкиРезультата = Новый Структура;
	СтруктураОбработкиРезультата.Вставить("СоставОбласти",Объект.СоставОбласти);
	
	ДополнительныеПараметры.Вставить("ОбработкаРезультата", Новый ОписаниеОповещения("ПослеЗакрытияДочернейФормы",ЭтаФорма,СтруктураОбработкиРезультата));
		
	БюджетнаяОтчетностьКлиент.ОткрытьФормуСПростойОбработкой(ДополнительныеПараметры);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедуры ПриСозданииНаСервере

&НаСервере
Функция ПолучитьАдресВычисляемыхПараметров()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ВычисляемыеПараметры.Выгрузить(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьВычисляемыеПараметры(АдресВычисляемыхПараметров)
	
	ВПараметры = ПолучитьИзВременногоХранилища(АдресВычисляемыхПараметров);
			
	Объект.ВычисляемыеПараметры.Загрузить(ВПараметры);
	ИзменялсяСоставВычисляемыхПараметров = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбщиеПараметры()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаЗаполненияОбщиеПараметры.ИмяПараметра,
		|	ПравилаЗаполненияОбщиеПараметры.ЗначениеПараметра
		|ИЗ
		|	Справочник.ПравилаЗаполнения.ОбщиеПараметры КАК ПравилаЗаполненияОбщиеПараметры
		|ГДЕ
		|	ПравилаЗаполненияОбщиеПараметры.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПравилаЗаполненияОбщиеПараметры.НомерСтроки";
		
	Запрос.УстановитьПараметр("Ссылка", Объект.Владелец);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Таблица = Результат.Выгрузить();
		
	Иначе
		
		Таблица = Новый ТаблицаЗначений;
		Таблица.Колонки.Добавить("ИмяПараметра");
		Таблица.Колонки.Добавить("ЗначениеПараметра");
		
	КонецЕсли;
	
	АдресТаблицыПараметров = ПоместитьВоВременноеХранилище(Таблица, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКартыДанных()
	
	СтруктураКартДанных = Справочники.ПравилаЗаполнения.ПолучитьКартыДанных(Объект.Владелец);
	
	КартыДанных.Очистить();
	
	Для каждого КлючИЗначение Из СтруктураКартДанных Цикл
		
		ТаблицаКарты = КлючИЗначение.Значение;
		
		КартыДанных.Добавить(ПоместитьВоВременноеХранилище(ТаблицаКарты, УникальныйИдентификатор), КлючИЗначение.Ключ);
		
		СписокКолонокКарт = Новый СписокЗначений;
		
		Для каждого Колонка Из ТаблицаКарты.Колонки Цикл
			
			СтруктураКолонки = Новый Структура("Имя, ТипЗначения", Колонка.Имя, Колонка.ТипЗначения);
			
			СписокКолонокКарт.Добавить(СтруктураКолонки);
			
		КонецЦикла;
		
	КонецЦикла;
	
	АдресСтруктурыКартДанных = ПоместитьВоВременноеХранилище(СтруктураКартДанных, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаборыДанных(СправочникОбъект)
	
	АдресаНаборов.Очистить();
	НаборыДанныхИсточника = СправочникОбъект.НаборыДанных.Получить();
	Если ТипЗнч(НаборыДанныхИсточника) = Тип("Массив") Тогда
		
		Для каждого ЭлементНабора Из НаборыДанныхИсточника Цикл
			
			Если ТипЗнч(ЭлементНабора.НаборДанных) = Тип("СхемаКомпоновкиДанных") Тогда
				
				СтруктураНабора = Новый Структура("Наименование,ВидТаблицы,АдресСхемы,Комментарий");
				ЗаполнитьЗначенияСвойств(СтруктураНабора,ЭлементНабора);
				
				СтруктураНабора.АдресСхемы = ПоместитьВоВременноеХранилище(ЭлементНабора.НаборДанных,УникальныйИдентификатор);
				
				АдресаНаборов.Добавить(СтруктураНабора,ЭлементНабора.Наименование);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщик()
	
	СхемаИсточника = ПолучитьИзВременногоХранилища(АдресСхемыИсточника);
	
	КомпоновщикНастроекВрем = Новый КомпоновщикНастроекКомпоновкиДанных;
	ИсточникНастроекВрем = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыИсточника);
	КомпоновщикНастроекВрем.Инициализировать(ИсточникНастроекВрем);
	КомпоновщикНастроекВрем.ЗагрузитьНастройки(СхемаИсточника.ВариантыНастроек.Основной.Настройки);
	
	АдресКомпоновщикаНастроек = ЗаполнениеОтчетностиСервер.СохранитьКомпоновщикНастроек(КомпоновщикНастроекВрем, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеВызовы()
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	
	// Заполнение массива доступных методов
	
	СтруктураМетодов = ЗаполнениеОтчетностиСерверПовтИсп.ПолучитьДеревоМетодов("СправочнаяИнформацияПоМетодам");
	
	ДеревоЗначений = СтруктураМетодов.ДеревоМетодов.Скопировать();
	МассивРазрешенныхВызовов = Новый Массив;
	Для каждого Элемент Из СтруктураМетодов.МассивРазрешенныхВызовов Цикл
		МассивРазрешенныхВызовов.Добавить(Элемент);
	КонецЦикла;
	
	// Добавление карт данных
	
	Если КартыДанных.Количество() <> 0 Тогда
		
		СтрокаКореньКарты = ДеревоЗначений.Строки.Добавить();
		СтрокаКореньКарты.Наименование = "Карты данных";
		СтрокаКореньКарты.Уровень = 0;
		
		Для каждого Элемент Из КартыДанных Цикл
			
			СтрокаКарта = СтрокаКореньКарты.Строки.Добавить();
			СтрокаКарта.Наименование = Элемент.Представление;
			СтрокаКарта.Шаблон = "&"+Элемент.Представление;
			СтрокаКарта.Уровень = 3;
			
			ТаблицаДанных = ПолучитьИзВременногоХранилища(Элемент.Значение);
			
			Если ТипЗнч(ТаблицаДанных) = Тип("ТаблицаЗначений") Тогда
				
				Для каждого Колонка Из ТаблицаДанных.Колонки Цикл
					
					СтрокаКолонка = СтрокаКарта.Строки.Добавить();
					СтрокаКолонка.Наименование = Колонка.Имя;
					СтрокаКолонка.Шаблон = Колонка.Имя;
					СтрокаКолонка.Уровень = 3;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Добавление структуры вида отчета
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтрокиОтчетов.Код КАК Код,
		|	""Строки"" КАК Раздел,
		|	СтрокиОтчетов.Представление,
		|	СтрокиОтчетов.ПорядковыйНомер КАК ПорядковыйНомер
		|ИЗ
		|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
		|ГДЕ
		|	СтрокиОтчетов.Владелец = &ВидОтчета
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КолонкиОтчетов.Код,
		|	""Графы"",
		|	КолонкиОтчетов.Представление,
		|	КолонкиОтчетов.ПорядковыйНомер
		|ИЗ
		|	Справочник.КолонкиОтчетов КАК КолонкиОтчетов
		|ГДЕ
		|	КолонкиОтчетов.Владелец = &ВидОтчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Раздел,
		|	ПорядковыйНомер,
		|	Код
		|ИТОГИ ПО
		|	Раздел";
		
	Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);
	
	Результат = Запрос.Выполнить();
	
	СтрокаКореньКарты = ДеревоЗначений.Строки.Добавить();
	СтрокаКореньКарты.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Структура вида отчета %1'"), ВидОтчета);
	СтрокаКореньКарты.Уровень = 0;
	
	ВыборкаРаздел = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаРаздел.Следующий() Цикл
		
		СтрокаКарта = СтрокаКореньКарты.Строки.Добавить();
		СтрокаКарта.Наименование = ВыборкаРаздел.Раздел;
		СтрокаКарта.Уровень = 0;
		
		ВыборкаДетальныеЗаписи = ВыборкаРаздел.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтрокаКолонка = СтрокаКарта.Строки.Добавить();
			СтрокаКолонка.Наименование = ВыборкаДетальныеЗаписи.Код + " - " + ВыборкаДетальныеЗаписи.Представление;
			СтрокаКолонка.Шаблон = """"+ВыборкаДетальныеЗаписи.Код+"""";
			СтрокаКолонка.Уровень = 3;
			
		КонецЦикла;
		
	КонецЦикла;
	
	АдресДоступныхВызовов = ПоместитьВоВременноеХранилище(ДеревоЗначений, УникальныйИдентификатор);

	
КонецПроцедуры

&НаСервере
Функция ПолучитьАналитикуИГрафыСтрокОбласти(Знач СтрокиОбласти)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказателиОтчетов.Ссылка,
		|	ПоказателиОтчетов.ГруппаРаскрытия,
		|	ПоказателиОтчетов.Колонка.Код,
		|	ПоказателиОтчетов.Колонка.ПорядковыйНомер,
		|	ПоказателиОтчетов.Колонка.Наименование
		|ПОМЕСТИТЬ ПоказателиСтрок
		|ИЗ
		|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|ГДЕ
		|	ПоказателиОтчетов.Строка В(&СтрокиОбласти)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ГруппыРаскрытияАналитика.НомерСтроки) КАК НомерСтроки,
		|	ГруппыРаскрытияАналитика.ВидАналитики.Код КАК Код,
		|	ГруппыРаскрытияАналитика.ВидАналитики.Наименование КАК Наименование
		|ИЗ
		|	ПоказателиСтрок КАК ПоказателиСтрок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
		|		ПО ПоказателиСтрок.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ГруппыРаскрытияАналитика.ВидАналитики.Код,
		|	ГруппыРаскрытияАналитика.ВидАналитики.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ПоказателиСтрок.КолонкаПорядковыйНомер) КАК НомерСтроки,
		|	ПоказателиСтрок.КолонкаКод КАК Код,
		|	ПоказателиСтрок.КолонкаНаименование КАК Наименование
		|ИЗ
		|	ПоказателиСтрок КАК ПоказателиСтрок
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоказателиСтрок.КолонкаНаименование,
		|	ПоказателиСтрок.КолонкаКод
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки,
		|	Код";
	
	Запрос.УстановитьПараметр("СтрокиОбласти", СтрокиОбласти);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаАналитики = МассивРезультатов[1].Выгрузить();
	ТаблицаГраф = МассивРезультатов[2].Выгрузить();
	
	Структура = Новый Структура;
	Структура.Вставить("Аналитика", ПоместитьВоВременноеХранилище(ТаблицаАналитики, УникальныйИдентификатор));
	Структура.Вставить("Графы", ПоместитьВоВременноеХранилище(ТаблицаГраф, УникальныйИдентификатор));
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияДочернейФормы(Результат, ДополнительныеПараметры) Экспорт 
	
	Для Каждого СтрокаОтчета Из Результат Цикл
		Если ТипЗнч(СтрокаОтчета) <> Тип("СправочникСсылка.СтрокиОтчетов") или СтрокаОтчета.Пустая() Тогда 
			Продолжить;
		КонецЕсли;	
		СтрокаСостава = ДополнительныеПараметры.СоставОбласти.Добавить();
		СтрокаСостава.СтрокаОтчета = СтрокаОтчета;
	КонецЦикла;
	Модифицированность = Истина;
	
КонецПроцедуры	







