
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		
		ОтборФакультет = Параметры.Отбор.Владелец;
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборФакультет", "ТолькоПросмотр", Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОтборФакультет", "КнопкаОткрытия", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Факультет", "Видимость", Ложь);
		ОтборФакультетПриИзмененииНаСервере();
		
	КонецЕсли;
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборФакультетПриИзменении(Элемент)
	
	ОтборФакультетПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	Если ЗначениеЗаполнено(Родитель) Тогда
		ПараметрыФормы.Вставить("Владелец", ОпределитьВладельца(Родитель));
		ПараметрыФормы.Вставить("Родитель", Родитель);
	ИначеЕсли ЗначениеЗаполнено(ОтборФакультет) Тогда
		ПараметрыФормы.Вставить("Владелец", ОтборФакультет);
	КонецЕсли;
	
	Если Не Группа Тогда
		ОткрытьФорму("Справочник.ГруппыСтудентов.ФормаОбъекта", ПараметрыФормы, Элемент);
	Иначе
		ПараметрыФормы.Вставить("ЭтоГруппа", Истина);
		ОткрытьФорму("Справочник.ГруппыСтудентов.ФормаГруппы", ПараметрыФормы, Элемент);
	КонецЕсли;
	
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтборФакультетПриИзмененииНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Факультет", ОтборФакультет,,, ЗначениеЗаполнено(ОтборФакультет));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Факультет", "Видимость", НЕ ЗначениеЗаполнено(ОтборФакультет));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьВладельца(Родитель)
	Возврат Родитель.Владелец;
КонецФункции

#КонецОбласти


