#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы.
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("Номенклатура");
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСоответствиеВидовОтчетаКомитентуФормам() Экспорт

	ФормыОтчетовКомитенту = Новый Соответствие;
	ФормыОтчетовКомитенту.Вставить(Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОПродажах, "ФормаДокументаОПродажах");
	ФормыОтчетовКомитенту.Вставить(Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОЗакупках, "ФормаДокументаОЗакупках");
	
	Возврат ФормыОтчетовКомитенту;

КонецФункции  

Процедура УстановитьЗаголовокФормы(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ТекстЗаголовка = НСтр("ru = 'Отчет комитенту'");
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекстЗаголовка = ТекстЗаголовка + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru=' %1 от %2'"), Объект.Номер, Формат(Объект.Дата, "ДЛФ=D"));
	Иначе
		ТекстЗаголовка = ТекстЗаголовка + НСтр("ru = ' (создание)'");
	КонецЕсли;
	
	Форма.Заголовок = ТекстЗаголовка + " (" + Строка(Объект.ВидОперации) + ")";

КонецПроцедуры

#Область ПодготовкаДанныхЭДО

Функция ПодготовитьДанныеДляЭД(ДокументСсылка) Экспорт
	
	ВалютаРегУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Если Не ЗначениеЗаполнено(ДокументСсылка.ВалютаДокумента) Тогда
		КурсВзаиморасчетов = 1;
		КратностьВзаиморасчетов = 1;
	Иначе
		КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументСсылка.ВалютаДокумента, ДокументСсылка.Дата);
		КурсВзаиморасчетов = КурсКратность.Курс;
		КратностьВзаиморасчетов = КурсКратность.Кратность;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("КурсВзаиморасчетов", КурсВзаиморасчетов);
	Запрос.УстановитьПараметр("РегламентированнаяВалюта", ВалютаРегУчета);
	Запрос.УстановитьПараметр("ЕдИзмШт", Справочники.КлассификаторЕдиницИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию());
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Общие данные для заполнения данных документа и табличной части
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка										КАК Ссылка,
	|	Дата										КАК Дата,
	|	Номер										КАК Номер,
	|	Организация									КАК Организация,
	|	Подразделение								КАК Подразделение,
	|	Контрагент									КАК Контрагент,
	|	Договор										КАК Договор,
	|	НЕОПРЕДЕЛЕНО								КАК ДокументОснование,
	|	УслугаПоВознаграждению						КАК НФА,
	|	ВЫБОР
	|		КОГДА УслугаПоВознаграждению.ЕдиницаИзмерения <> ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) ТОГДА
	|			УслугаПоВознаграждению.ЕдиницаИзмерения
	|		ИНАЧЕ
	|			&ЕдИзмШт
	|	КОНЕЦ										КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА УслугаПоВознаграждению.НаименованиеПолное = """" ТОГДА
	|			УслугаПоВознаграждению.Наименование
	|		ИНАЧЕ
	|			УслугаПоВознаграждению.НаименованиеПолное
	|	КОНЕЦ										КАК СодержаниеУслуги,
	|	ВалютаДокумента								КАК ВалютаДокумента,
	|	&КурсВзаиморасчетов							КАК Курс,
	|	1											КАК Количество,
	|	СуммаНДСВознаграждения						КАК СуммаНДС,
	|	СуммаВознаграждения							КАК СуммаСНДС,
	|	СтавкаНДСВознаграждения						КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА СуммаВключаетНДС ТОГДА
	|			СуммаВознаграждения - СуммаНДСВознаграждения
	|		ИНАЧЕ
	|			СуммаВознаграждения
	|	КОНЕЦ										КАК СуммаБезНДС,
	|	ВЫБОР
	|		КОГДА СуммаВключаетНДС ТОГДА
	|			СуммаВознаграждения - СуммаНДСВознаграждения
	|		ИНАЧЕ
	|			СуммаВознаграждения
	|	КОНЕЦ										КАК Цена,
	|	
	|	ОтветственныйПередалТРУВид					КАК ОтветственныйПередалТРУВид,
	|	ОтветственныйПередалТРУДолжность			КАК ОтветственныйПередалТРУДолжность,
	|	ОтветственныйПередалТРУИныеСведения			КАК ОтветственныйПередалТРУИныеСведения,
	|	ОтветственныйПередалТРУ						КАК ОтветственныйПередалТРУ,
	|	ОтветственныйПередалТРУДоверенность			КАК ОтветственныйПередалТРУДоверенность,
	|	ОтветственныйПередалТРУОснованиеПолномочий	КАК ОтветственныйПередалТРУОснованиеПолномочий,
	|	ОтветственныйПередалТРУДокументПолномочий	КАК ОтветственныйПередалТРУДокументПолномочий,
	|	ОтветственныйПередалТРУКонтрагент			КАК ОтветственныйПередалТРУКонтрагент,
	|	ДатаПередачиТРУ								КАК ДатаПередачиТРУ,
	|	ТРУПереданы									КАК ТРУПереданы,
	|	РеквизитыЛицевогоСчета						КАК РеквизитыЛицевогоСчета,
	|	РасчетныйСчетКонтрагента					КАК РасчетныйСчетКонтрагента
	|ПОМЕСТИТЬ
	|	ОбщаяТаблицаДанных
	|ИЗ
	|	Документ.ОтчетКомитенту
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные для реквизитов шапки Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ
	|	Ссылка														КАК Ссылка,
	|	Дата														КАК Дата,
	|	Номер														КАК Номер,
	|	Организация													КАК Организация,
	|	Подразделение												КАК Подразделение,
	|	Контрагент													КАК Контрагент,
	|	ДокументОснование											КАК ДокументОснование,
	|	Договор														КАК Договор,
	|	ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).НомерДоговора		КАК ДокументОснованиеНомер,
	|	ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).ДатаДоговора		КАК ДокументОснованиеДата,
	|	ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).ВидОбязательства	КАК ДокументОснованиеНаименование,
	|	ВалютаДокумента												КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			ВЫРАЗИТЬ(ВалютаДокумента КАК Справочник.Валюты).Код
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(&РегламентированнаяВалюта КАК Справочник.Валюты).Код
	|	КОНЕЦ														КАК ВалютаКод,
	|	ВЫБОР
	|		КОГДА ВалютаДокумента <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) ТОГДА
	|			ВЫРАЗИТЬ(ВалютаДокумента КАК Справочник.Валюты).НаименованиеПолное
	|		ИНАЧЕ
	|			ВЫРАЗИТЬ(&РегламентированнаяВалюта КАК Справочник.Валюты).НаименованиеПолное
	|	КОНЕЦ														КАК ВалютаНаименование,
	|	Курс														КАК Курс,
	|	ОтветственныйПередалТРУВид									КАК ОтветственныйПередалТРУВид,
	|	ОтветственныйПередалТРУДолжность							КАК ОтветственныйПередалТРУДолжность,
	|	ОтветственныйПередалТРУИныеСведения							КАК ОтветственныйПередалТРУИныеСведения,
	|	ОтветственныйПередалТРУ										КАК ОтветственныйПередалТРУ,
	|	ОтветственныйПередалТРУДоверенность							КАК ОтветственныйПередалТРУДоверенность,
	|	ОтветственныйПередалТРУОснованиеПолномочий					КАК ОтветственныйПередалТРУОснованиеПолномочий,
	|	ОтветственныйПередалТРУДокументПолномочий					КАК ОтветственныйПередалТРУДокументПолномочий,
	|	ОтветственныйПередалТРУКонтрагент							КАК ОтветственныйПередалТРУКонтрагент,
	|	ДатаПередачиТРУ												КАК ДатаПередачиТРУ,
	|	ТРУПереданы													КАК ТРУПереданы,
	|	РеквизитыЛицевогоСчета										КАК РеквизитыЛицевогоСчета,
	|	РасчетныйСчетКонтрагента									КАК РасчетныйСчетКонтрагента
	|ИЗ
	|	ОбщаяТаблицаДанных КАК ОбщаяТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Данные для табличной части СоставНФА
	|//
	|ВЫБРАТЬ
	|	НФА														КАК НФА,
	|	ЕдиницаИзмерения										КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) ТОГДА
	|			НФА.ЕдиницаИзмерения.Наименование
	|		ИНАЧЕ
	|			ЕдиницаИзмерения.Наименование
	|	КОНЕЦ													КАК ЕдиницаИзмеренияНаименование,
	|	ВЫБОР
	|		КОГДА ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка) ТОГДА
	|			НФА.ЕдиницаИзмерения.Код
	|		ИНАЧЕ
	|			ЕдиницаИзмерения.Код
	|	КОНЕЦ													КАК ЕдиницаИзмеренияКод,
	|	СодержаниеУслуги										КАК СодержаниеУслуги,
	|	Количество												КАК Количество,
	|	СуммаНДС												КАК СуммаНДС,
	|	СуммаСНДС												КАК СуммаСНДС,
	|	СтавкаНДС												КАК СтавкаНДС,
	|	СуммаБезНДС												КАК СуммаБезНДС,
	|	Цена													КАК Цена
	|ИЗ
	|	ОбщаяТаблицаДанных";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Данные = Новый Структура();
	Данные.Вставить("Шапка", РезультатыЗапроса[1].Выгрузить());
	Данные.Вставить("ТабЧасть", РезультатыЗапроса[2].Выгрузить());
	
	Возврат Данные;
	
КонецФункции	

Процедура ЗаполнитьСведенияОПриемкеПередачеПоставщикаДляУПД(Объект) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;	
	КонецЕсли;
	
	ЛицевойСчетОрганизиции = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация,
			"Документ.ОтчетКомитенту", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский,, "РеквизитыЛицевогоСчета");
	Если ЗначениеЗаполнено(ЛицевойСчетОрганизиции.РеквизитыЛицевогоСчета) Тогда
		Объект.РеквизитыЛицевогоСчета = ЛицевойСчетОрганизиции.РеквизитыЛицевогоСчета;
	КонецЕсли;
	
	Если ЭлектронныеДокументыБГУ.УПДЗаполнятьДатуПередачиПоДатеДокументаРеализации(Объект.Организация) Тогда
		
		Объект.ДатаПередачиТРУ = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
		Объект.ТРУПереданы = Истина;
		
	КонецЕсли;  
	
	СведенияПоОтветственному = ЭлектронныеДокументыБГУ.ПолучитьСведенияОтветственныхЭлектронныУПД(Объект.Организация);
	
	Если ЗначениеЗаполнено(СведенияПоОтветственному) Тогда
		
		Объект.ОтветственныйПередалТРУ 						= СведенияПоОтветственному.ОтветственныйПередалТРУ;	
		Объект.ОтветственныйПередалТРУВид 					= СведенияПоОтветственному.ОтветственныйПередалТРУВид;
		Объект.ОтветственныйПередалТРУДоверенность 			= СведенияПоОтветственному.ОтветственныйПередалТРУДоверенность;
		Объект.ОтветственныйПередалТРУДолжность 			= СведенияПоОтветственному.ОтветственныйПередалТРУДолжность;
		Объект.ОтветственныйПередалТРУИныеСведения 			= СведенияПоОтветственному.ОтветственныйПередалТРУИныеСведения;
		Объект.ОтветственныйПередалТРУКонтрагент 			= СведенияПоОтветственному.ОтветственныйПередалТРУКонтрагент;
		Объект.ОтветственныйПередалТРУДокументПолномочий 	= СведенияПоОтветственному.ОтветственныйПередалТРУДокументПолномочий;
		Объект.ОтветственныйПередалТРУОснованиеПолномочий 	= ""; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаСписка"
		ИЛИ ВидФормы = "ФормаВыбора" Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВидОперации = Параметры.Ключ.ВидОперации;
	ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") 
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
		И Параметры.ЗначенияЗаполнения.Свойство("ВидОперации") Тогда 
		ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") 
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
		И ТипЗнч(Параметры.ЗначениеКопирования) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда 
		ВидОперации = Параметры.ЗначениеКопирования.ВидОперации;
	ИначеЕсли Параметры.Свойство("Основание") 
		И ЗначениеЗаполнено(Параметры.Основание) Тогда
		// На основании ПоступленияТоваровУслуг вводится отчет комитенту о продажах.
		ДоговорОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Основание, "Договор");
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорОснования, "ВидДоговора");
		Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
			ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку Тогда
			ВидОперации = Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОЗакупках;
		Иначе
			ВидОперации = Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОПродажах;
		КонецЕсли;
	Иначе
		Если ПолучитьФункциональнуюОпцию("ВестиУчетПоРеализацииТоваровУслугКомитентов") Тогда
			ВидОперации = Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОПродажах;
		Иначе
			ВидОперации = Неопределено;
		КонецЕсли;
	КонецЕсли;
		
	СтандартнаяОбработка = Ложь;
	ФормыОтчетовКомитенту = ПолучитьСоответствиеВидовОтчетаКомитентуФормам();
	ВыбраннаяФорма = ФормыОтчетовКомитенту[ВидОперации];
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ВидОперацииДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВидОперации");
	
	НомераТаблиц = Новый Структура;
	Если ВидОперацииДокумента = Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОПродажах Тогда
		ИнициализироватьЗапросыПоРеализованнымТоварамКомитентов(Запрос, НомераТаблиц);
	Иначе
		ИнициализироватьЗапросыПоЗакупленнымТоварамДляКомитентов(Запрос, НомераТаблиц);
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	БухгалтерскийУчет.УстановитьПериодВТаблицахДляПроведения(ТаблицыДляДвижений, ДокументСсылка);
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыПоРеализованнымТоварамКомитентов(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("РеализованныеТоварыКомитентов", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация КАК Организация,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата КАК Период,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Договор КАК ДоговорКомитента,
	|	ОтчетКомитентуОПродажахТовары.Номенклатура КАК Номенклатура,
	|	ОтчетКомитентуОПродажахТовары.Покупатель КАК Покупатель,
	|	ОтчетКомитентуОПродажахТовары.ДатаРеализации КАК ДатаРеализации,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов КАК ДокументРасчетов,
	|	СУММА(ОтчетКомитентуОПродажахТовары.Количество) КАК Количество,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаПоступления) КАК СуммаПоступления,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ОтчетКомитентуОПродажахТовары.Сумма) КАК Выручка
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ОтчетКомитентуОПродажахТовары
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахТовары.Номенклатура,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Договор,
	|	ОтчетКомитентуОПродажахТовары.Покупатель,
	|	ОтчетКомитентуОПродажахТовары.ДатаРеализации,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов";
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыПоЗакупленнымТоварамДляКомитентов(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("ЗакупленныеТоварыКомитентов", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация КАК Организация,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата КАК Период,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Договор КАК ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажахТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ОтчетКомитентуОПродажахТовары.Количество) КАК Количество,
	|	СУММА(ОтчетКомитентуОПродажахТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ОтчетКомитентуОПродажахТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА ОтчетКомитентуОПродажахТовары.Сумма
	|			ИНАЧЕ ОтчетКомитентуОПродажахТовары.Сумма + ОтчетКомитентуОПродажахТовары.СуммаНДС
	|		КОНЕЦ) КАК Сумма,
	|	ОтчетКомитентуПоставщики.Партия КАК Партия
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ОтчетКомитентуОПродажахТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту.Поставщики КАК ОтчетКомитентуПоставщики
	|		ПО ОтчетКомитентуОПродажахТовары.Ссылка = ОтчетКомитентуПоставщики.Ссылка
	|			И ОтчетКомитентуОПродажахТовары.КлючСтроки = ОтчетКомитентуПоставщики.КлючСтроки
	|ГДЕ
	|	ОтчетКомитентуОПродажахТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетКомитентуОПродажахТовары.Номенклатура,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Организация,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Дата,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Контрагент,
	|	ОтчетКомитентуОПродажахТовары.Ссылка.Договор,
	|	ОтчетКомитентуОПродажахТовары.Покупатель,
	|	ОтчетКомитентуОПродажахТовары.ДатаРеализации,
	|	ОтчетКомитентуОПродажахТовары.ДокументРасчетов,
	|	ОтчетКомитентуПоставщики.Партия";
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Отчет комитенту
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ОтчетКомитенту";
	КомандаПечати.Представление = НСтр("ru = 'Отчет комитенту'");

	// Акт об оказании услуг
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОтчетКомитенту") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ОтчетКомитенту", "Отчет комитенту",
			ПечатьОтчетаКомитенту(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОбОказанииУслуг") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"АктОбОказанииУслуг",
															"Акт об оказании услуг",
															ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьОтчетаКомитенту(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетКомитенту_ОтчетКомитенту";
	
	ВыводитьКоды = Ложь;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧПоставщики.Ссылка КАК Ссылка,
	|	ТЧПоставщики.НомерСтроки КАК НомерСтроки,
	|	ТЧПоставщики.КлючСтроки КАК КлючСтроки,
	|	ТЧПоставщики.Поставщик КАК Поставщик,
	|	ТЧПоставщики.Партия КАК Партия,
	|	ДокПоступления.Дата КАК ДатаПартии,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.ДатаПервичногоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаВходящегоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.НомерПервичногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерВходящегоСчетаФактуры,
	|	ЕСТЬNULL(ДокПоступления.ДатаПервичногоДокумента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ДокПоступления.НомерПервичногоДокумента, """") КАК НомерВходящегоДокумента,
	|	ТЧПоставщики.СчетФактура КАК СчетФактураВыданный,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Дата, ТЧПоставщики.ДатаСФ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаВыданногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Номер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерВыданногоСчетаФактуры
	|ПОМЕСТИТЬ ВТ_РеквизитыПартий
	|ИЗ
	|	Документ.ОтчетКомитенту.Поставщики КАК ТЧПоставщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ДокПоступления
	|		ПО ТЧПоставщики.Партия = ДокПоступления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО (ДокПоступления.Ссылка = СчетФактураПолученный.ДокументОснование)
	|ГДЕ
	|	ТЧПоставщики.Ссылка В(&МассивОбъектов)
	|	И ТЧПоставщики.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитенту.ОтчетОЗакупках)
	|	И ТИПЗНАЧЕНИЯ(ТЧПоставщики.Партия) = ТИП(Документ.ПоступлениеМЗ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧПоставщики.Ссылка,
	|	ТЧПоставщики.НомерСтроки,
	|	ТЧПоставщики.КлючСтроки,
	|	ТЧПоставщики.Поставщик,
	|	ТЧПоставщики.Партия,
	|	ПоступлениеУслугРабот.Дата,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.ДатаПервичногоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL
	|			ТОГДА СчетФактураПолученный.Ссылка.НомерПервичногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЕСТЬNULL(ПоступлениеУслугРабот.ДатаПервичногоДокумента, ДАТАВРЕМЯ(1, 1, 1)),
	|	ЕСТЬNULL(ПоступлениеУслугРабот.НомерПервичногоДокумента, """"),
	|	ТЧПоставщики.СчетФактура,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Дата, ТЧПоставщики.ДатаСФ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТЧПоставщики.ПолученСФ
	|			ТОГДА ЕСТЬNULL(ТЧПоставщики.СчетФактура.Номер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ
	|ИЗ
	|	Документ.ОтчетКомитенту.Поставщики КАК ТЧПоставщики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслугРабот КАК ПоступлениеУслугРабот
	|		ПО ТЧПоставщики.Партия = ПоступлениеУслугРабот.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО (ПоступлениеУслугРабот.Ссылка = СчетФактураПолученный.ДокументОснование)
	|ГДЕ
	|	ТЧПоставщики.Ссылка В(&МассивОбъектов)
	|	И ТЧПоставщики.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитенту.ОтчетОЗакупках)
	|	И ТИПЗНАЧЕНИЯ(ТЧПоставщики.Партия) = ТИП(Документ.ПоступлениеУслугРабот)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТЧПоставщики.Ссылка,
	|	ТЧПоставщики.КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование ССЫЛКА Документ.НакладнаяНаОтпускМ15
	|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15)
	|		КОГДА ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование ССЫЛКА Документ.НакладнаяНаРеализациюТорг12
	|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование КАК Документ.НакладнаяНаРеализациюТорг12)
	|	КОНЕЦ КАК ДокОснование,
	|	ПоступлениеМЗ.Ссылка КАК ДокументРасчетов
	|ПОМЕСТИТЬ ВТ_ДокОснованияВозвратов
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ОтчетКомитентуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ОтчетКомитентуТовары.ДокументРасчетов = ПоступлениеМЗ.Ссылка
	|ГДЕ
	|	ОтчетКомитентуТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитенту.ОтчетОПродажах)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование ССЫЛКА Документ.НакладнаяНаОтпускМ15
	|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15)
	|		КОГДА ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование ССЫЛКА Документ.НакладнаяНаРеализациюТорг12
	|			ТОГДА ВЫРАЗИТЬ(ОтчетКомитентуТовары.ДокументРасчетов.ДокументОснование КАК Документ.НакладнаяНаРеализациюТорг12)
	|	КОНЕЦ,
	|	ПоступлениеМЗ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	ВТ_ДокументыОснованияВозвратов.ДокументРасчетов КАК ДокументРасчетов
	|ПОМЕСТИТЬ ВТ_СФДокОснованияВозвратов
	|ИЗ
	|	ВТ_ДокОснованияВозвратов КАК ВТ_ДокументыОснованияВозвратов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ВТ_ДокументыОснованияВозвратов.ДокОснование = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданный.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировочныйСчетФактураВыданный.Ссылка КАК Ссылка,
	|	КорректировочныйСчетФактураВыданный.Номер КАК НомерКорСФ,
	|	КорректировочныйСчетФактураВыданный.Дата КАК ДатаКорСФ,
	|	ВТ_СФДокуОснованияВозвратов.ДокументРасчетов КАК ДокументРасчетов
	|ПОМЕСТИТЬ ВТ_КорСФПоВозвратам
	|ИЗ
	|	ВТ_СФДокОснованияВозвратов КАК ВТ_СФДокуОснованияВозвратов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировочныйСчетФактураВыданный КАК КорректировочныйСчетФактураВыданный
	|		ПО ВТ_СФДокуОснованияВозвратов.Ссылка = КорректировочныйСчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	НЕ КорректировочныйСчетФактураВыданный.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка КАК Ссылка,
	|	ОтчетКомитентуТовары.ДокументРасчетов КАК ДокументРасчетов,
	|	СчетФактураВыданный.Дата КАК Дата,
	|	СчетФактураВыданный.Номер КАК Номер
	|ПОМЕСТИТЬ ТаблицаСчетовФактур
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ОтчетКомитентуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ОтчетКомитентуТовары.ДокументРасчетов = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	ОтчетКомитентуТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитенту.ОтчетОПродажах)
	|	И НЕ СчетФактураВыданный.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураВыданный.Ссылка,
	|	ОтчетКомитентуТовары.ДокументРасчетов,
	|	СчетФактураВыданный.Дата,
	|	СчетФактураВыданный.Номер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_КорСФПоВозвратам.Ссылка,
	|	ВТ_КорСФПоВозвратам.ДокументРасчетов,
	|	ВТ_КорСФПоВозвратам.ДатаКорСФ,
	|	ВТ_КорСФПоВозвратам.НомерКорСФ
	|ИЗ
	|	ВТ_КорСФПоВозвратам КАК ВТ_КорСФПоВозвратам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуОПродажах.Ссылка КАК Ссылка,
	|	ОтчетКомитентуОПродажах.Ссылка.ВидОперации КАК ВидОперации,
	|	ОтчетКомитентуОПродажах.Ссылка.Номер КАК Номер,
	|	ОтчетКомитентуОПродажах.Ссылка.Дата КАК Дата,
	|	ОтчетКомитентуОПродажах.Ссылка.Договор КАК ДоговорКонтрагента,
	|	ОтчетКомитентуОПродажах.Ссылка.Контрагент КАК Контрагент,
	|	ОтчетКомитентуОПродажах.Ссылка.Организация КАК Организация,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|	ОтчетКомитентуОПродажах.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ОтчетКомитентуОПродажах.Ссылка.СтавкаНДСВознаграждения КАК СтавкаНДСВознаграждения,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ОтчетКомитентуОПродажах.Ссылка.Подразделение КАК ПодразделениеОрганизации,
	|	ОтчетКомитентуОПродажах.НомерСтроки КАК НомерСтроки,
	|	0 КАК НомерСтрокиПоставщики,
	|	ОтчетКомитентуОПродажах.Номенклатура КАК Товар,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомитентуОПродажах.Содержание ПОДОБНО """"
	|			ТОГДА ОтчетКомитентуОПродажах.Содержание
	|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА СправочникНоменклатура.Наименование
	|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|	КОНЕЦ КАК ТоварНаименование,
	|	ОтчетКомитентуОПродажах.ЕдиницаИзмерения.Представление КАК ЕдиницаИзмерения,
	|	ОтчетКомитентуОПродажах.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХранения,
	|	ОтчетКомитентуОПродажах.Количество КАК Количество,
	|	ОтчетКомитентуОПродажах.Цена КАК Цена,
	|	ОтчетКомитентуОПродажах.Сумма КАК Сумма,
	|	ОтчетКомитентуОПродажах.СуммаНДС КАК СуммаНДС,
	|	ОтчетКомитентуОПродажах.Покупатель КАК ПокупательПоставщик,
	|	ОтчетКомитентуОПродажах.ДатаРеализации КАК ДатаПродажи,
	|	ОтчетКомитентуОПродажах.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	НЕОПРЕДЕЛЕНО КАК Партия,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаПартии,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоСчетаФактуры,
	|	"""" КАК НомерВходящегоСчетаФактуры,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВходящегоДокумента,
	|	"""" КАК НомерВходящегоДокумента,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВыданногоСчетаФактуры,
	|	"""" КАК НомерВыданногоСчетаФактуры,
	|	ОтчетКомитентуОПродажах.Покупатель КАК ПолеДляИтогов,
	|	ТаблицаСчетовФактур.ДокументРасчетов КАК ДокументРасчетов,
	|	ТаблицаСчетовФактур.Ссылка КАК СчетФактураПокупателю,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Количество > 0
	|			ТОГДА ""Реализация товаров и услуг""
	|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
	|			ТОГДА ""Возврат товаров""
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ КАК ВидСобытия,
	|	ТаблицаСчетовФактур.Номер КАК НомерСФКомиссионера,
	|	ТаблицаСчетовФактур.Дата КАК ДатаСФКомиссионера,
	|	ВЫБОР
	|		КОГДА ОтчетКомитентуОПродажах.Количество < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозврат,
	|	ОтчетКомитентуОПродажах.Ссылка.Организация.НаименованиеПолное КАК ПредставлениеОрганизации,
	|	ОтчетКомитентуОПродажах.Ссылка.Контрагент.Наименование КАК ПредставлениеКонтрагента,
	|	ОтчетКомитентуОПродажах.Покупатель.ИНН КАК ПокупательИНН,
	|	ОтчетКомитентуОПродажах.Покупатель.КПП КАК ПокупательКПП,
	|	ОтчетКомитентуОПродажах.Покупатель.Наименование КАК ПокупательНаименование,
	|	ОтчетКомитентуОПродажах.Покупатель.ЮридическоеФизическоеЛицо КАК ПокупательЮридическоеФизическоеЛицо,
	|	ОтчетКомитентуОПродажах.Ссылка.ОтветственныйИсполнитель.Наименование КАК ОтветственныйИсполнительНаименование,
	|	ОтчетКомитентуОПродажах.Покупатель.ВидКонтрагента КАК ПокупательВидКонтрагента
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ОтчетКомитентуОПродажах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ОтчетКомитентуОПродажах.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСчетовФактур КАК ТаблицаСчетовФактур
	|		ПО ОтчетКомитентуОПродажах.ДокументРасчетов = ТаблицаСчетовФактур.ДокументРасчетов
	|ГДЕ
	|	ОтчетКомитентуОПродажах.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуОПродажах.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитенту.ОтчетОПродажах)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОтчетКомитентуТовары.Ссылка,
	|	ОтчетКомитентуТовары.Ссылка.ВидОперации,
	|	ОтчетКомитентуТовары.Ссылка.Номер,
	|	ОтчетКомитентуТовары.Ссылка.Дата,
	|	ОтчетКомитентуТовары.Ссылка.Договор,
	|	ОтчетКомитентуТовары.Ссылка.Контрагент,
	|	ОтчетКомитентуТовары.Ссылка.Организация,
	|	ОтчетКомитентуТовары.Ссылка.СуммаДокумента,
	|	ОтчетКомитентуТовары.Ссылка.ВалютаДокумента,
	|	ОтчетКомитентуТовары.Ссылка.СтавкаНДСВознаграждения,
	|	ОтчетКомитентуТовары.Ссылка.СуммаВознаграждения,
	|	ОтчетКомитентуТовары.Ссылка.Подразделение,
	|	ОтчетКомитентуТовары.НомерСтроки,
	|	ВТ_РеквизитыПартий.НомерСтроки,
	|	ОтчетКомитентуТовары.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ ОтчетКомитентуТовары.Содержание ПОДОБНО """"
	|			ТОГДА ОтчетКомитентуТовары.Содержание
	|		КОГДА СправочникНоменклатура.НаименованиеПолное ПОДОБНО """"
	|			ТОГДА СправочникНоменклатура.Наименование
	|		ИНАЧЕ СправочникНоменклатура.НаименованиеПолное
	|	КОНЕЦ,
	|	ОтчетКомитентуТовары.ЕдиницаИзмерения.Представление,
	|	ОтчетКомитентуТовары.Номенклатура.ЕдиницаИзмерения,
	|	ОтчетКомитентуТовары.Количество,
	|	ОтчетКомитентуТовары.Цена,
	|	ОтчетКомитентуТовары.Сумма,
	|	ОтчетКомитентуТовары.СуммаНДС,
	|	ЕСТЬNULL(ВТ_РеквизитыПартий.Поставщик, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ОтчетКомитентуТовары.Ссылка.СуммаВключаетНДС,
	|	ВТ_РеквизитыПартий.Партия,
	|	ВТ_РеквизитыПартий.ДатаПартии,
	|	ВТ_РеквизитыПартий.ДатаВходящегоСчетаФактуры,
	|	ВТ_РеквизитыПартий.НомерВходящегоСчетаФактуры,
	|	ВТ_РеквизитыПартий.ДатаВходящегоДокумента,
	|	ВТ_РеквизитыПартий.НомерВходящегоДокумента,
	|	ВТ_РеквизитыПартий.ДатаВыданногоСчетаФактуры,
	|	ВТ_РеквизитыПартий.НомерВыданногоСчетаФактуры,
	|	ВТ_РеквизитыПартий.Партия,
	|	NULL,
	|	NULL,
	|	NULL,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	NULL,
	|	ОтчетКомитентуТовары.Ссылка.Организация.НаименованиеПолное,
	|	ОтчетКомитентуТовары.Ссылка.Контрагент.Наименование,
	|	ЕСТЬNULL(ВТ_РеквизитыПартий.Поставщик.ИНН, """"),
	|	ЕСТЬNULL(ВТ_РеквизитыПартий.Поставщик.КПП, """"),
	|	ЕСТЬNULL(ВТ_РеквизитыПартий.Поставщик.Наименование, """"),
	|	ВТ_РеквизитыПартий.Поставщик.ЮридическоеФизическоеЛицо,
	|	ОтчетКомитентуТовары.Ссылка.ОтветственныйИсполнитель.Наименование,
	|	ВТ_РеквизитыПартий.Поставщик.ВидКонтрагента
	|ИЗ
	|	Документ.ОтчетКомитенту.Товары КАК ОтчетКомитентуТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ОтчетКомитентуТовары.Номенклатура = СправочникНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РеквизитыПартий КАК ВТ_РеквизитыПартий
	|		ПО ОтчетКомитентуТовары.КлючСтроки = ВТ_РеквизитыПартий.КлючСтроки
	|			И ОтчетКомитентуТовары.Ссылка = ВТ_РеквизитыПартий.Ссылка
	|ГДЕ
	|	ОтчетКомитентуТовары.Ссылка В(&МассивОбъектов)
	|	И ОтчетКомитентуТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОтчетКомитенту.ОтчетОЗакупках)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ПолеДляИтогов,
	|	ЭтоВозврат,
	|	СчетФактураПокупателю
	|ИТОГИ
	|	МАКСИМУМ(Ссылка),
	|	МАКСИМУМ(ВидОперации),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Контрагент),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(ВалютаДокумента),
	|	МАКСИМУМ(СуммаВознаграждения),
	|	МИНИМУМ(НомерСтрокиПоставщики),
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	МАКСИМУМ(ПокупательПоставщик),
	|	МАКСИМУМ(ДатаПартии),
	|	МАКСИМУМ(ДатаВходящегоСчетаФактуры),
	|	МАКСИМУМ(НомерВходящегоСчетаФактуры),
	|	МАКСИМУМ(ДатаВходящегоДокумента),
	|	МАКСИМУМ(НомерВходящегоДокумента),
	|	МАКСИМУМ(ДатаВыданногоСчетаФактуры),
	|	МАКСИМУМ(НомерВыданногоСчетаФактуры),
	|	МАКСИМУМ(НомерСФКомиссионера),
	|	МАКСИМУМ(ДатаСФКомиссионера),
	|	МАКСИМУМ(ЭтоВозврат)
	|ПО
	|	Ссылка,
	|	ВидСобытия,
	|	ПолеДляИтогов,
	|	СчетФактураПокупателю";
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
	
	Итого = 0;
	НомерПП = 1;
	
	ПервыйДокумент = Истина;
	
	ОтчетНапечатан = Ложь;
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ОтчетНапечатан = Истина;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ВыборкаДокументов.ВидОперации = Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОПродажах Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитенту.ПФ_MXL_ОтчетКомитентуОПродажах");
			ЭтоКомиссияПоПродаже = Истина;
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитенту.ПФ_MXL_ОтчетКомитентуОЗакупках");
			ЭтоКомиссияПоПродаже = Ложь;
		КонецЕсли;
		
		// Выводим шапку накладной
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБГУ.СформироватьЗаголовокДокумента(ВыборкаДокументов.Ссылка, НСтр("ru = 'Отчет комитенту'"));
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ПредставлениеОрганизации = ВыборкаДокументов.ПредставлениеОрганизации;
		
		ПредставлениеКонтрагента = ВыборкаДокументов.ПредставлениеКонтрагента;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
		ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
		ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапки = ?(ВыводитьКоды, "ШапкаСКодом", "ШапкаТаблицы");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьШапки);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		Итого = 0;
		НомерПП = 1;
		ОбластьСтроки = ?(ВыводитьКоды,	"СтрокаСКодом", "Строка");
		ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
		
		КоличествоТоваров = 0;
		
		ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;
		
		Если ПечататьСВидомСобытия Тогда
			
			ОбластьМакетаСобытия = Макет.ПолучитьОбласть("ВидСобытия");
			
		Иначе
			
			ОбластьМакетаСобытия = Неопределено;
			
		КонецЕсли;
		
		ВыборкаПоВидуСобытия = ВыборкаДокументов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ВидСобытия");
		
		Пока ВыборкаПоВидуСобытия.Следующий() Цикл
			
			Если ПечататьСВидомСобытия Тогда
				// Выводит вид события
				ОбластьМакетаСобытия.Параметры.ПредставлениеСобытия = ВыборкаПоВидуСобытия.ВидСобытия;
				ТабличныйДокумент.Вывести(ОбластьМакетаСобытия);
			КонецЕсли;
			
			ВыборкаКонтрагентов = ВыборкаПоВидуСобытия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагентов.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ПокупательЮридическоеФизическоеЛицо) Тогда
					Если ТипЗнч(ВыборкаКонтрагентов.ПокупательЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
						ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты;
					Иначе
						ВидКИАдрес = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица;
					КонецЕсли;
					АдресКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
					ВыборкаКонтрагентов.ПокупательЮридическоеФизическоеЛицо, ВидКИАдрес);
				КонецЕсли;
				
				
				Если ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = НСтр("ru = 'Покупатель: '") + ВыборкаКонтрагентов.ПокупательНаименование;
				Иначе
					ТекстКонтрагент = НСтр("ru = 'Поставщик: '") + ВыборкаКонтрагентов.ПокупательНаименование;;
				КонецЕсли;
				
				ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' Адрес: '") + АдресКонтрагента;
				КПП = ВыборкаКонтрагентов.ПокупательКПП;
				Если ЗначениеЗаполнено(КПП) Тогда
					КПП = "/" + КПП;
				КонецЕсли;
				Если ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП покупателя: '") + ВыборкаКонтрагентов.ПокупательИНН + КПП;
				Иначе
					ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = ' ИНН/КПП поставщика: '") + ВыборкаКонтрагентов.ПокупательИНН + КПП;
				КонецЕсли;
				
				// Сформируем информацию о реквизитах партии поставки.
				Если НЕ ЭтоКомиссияПоПродаже Тогда
					ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
					
					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоДокумента)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоДокумента) Тогда
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоДокумента 
						+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоДокумента, "ДЛФ=Д");
					Иначе
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Поступление от поставщика: № '") + Формат(ВыборкаКонтрагентов.ДатаПартии, "ДЛФ=Д");
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры) Тогда
						ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Получен счет-фактура поставщика: № '") + ВыборкаКонтрагентов.НомерВходящегоСчетаФактуры 
						+ НСтр("ru = ' от '") + Формат(ВыборкаКонтрагентов.ДатаВходящегоСчетаФактуры, "ДЛФ=Д");
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры)
						И ЗначениеЗаполнено(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры) Тогда
						
						ТекстКонтрагент = ТекстКонтрагент + Символы.ПС;
						ТекстКонтрагент = ТекстКонтрагент + НСтр("ru = 'Выдан счет-фактура комитенту: № '") 
						+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаКонтрагентов.НомерВыданногоСчетаФактуры, Истина, Ложь) 
						+ " от " + Формат(ВыборкаКонтрагентов.ДатаВыданногоСчетаФактуры, "ДЛФ=Д");
					КонецЕсли;
					
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагент");
				ОбластьМакета.Параметры.ПредставлениеКонтрагента = ТекстКонтрагент;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
				Если ПечататьСВидомСобытия Тогда
					ОбластьМакетаДокументПоПокупателю = Макет.ПолучитьОбласть("ДокументПокупателю");
				КонецЕсли;
				
				ИтогоПоКонтрагенту = 0;
				
				ВыборкаПоСчетФактуре = ВыборкаКонтрагентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "СчетФактураПокупателю");
				Пока ВыборкаПоСчетФактуре.Следующий() Цикл
					
					Если ПечататьСВидомСобытия Тогда
						
						ПредставлениеДокумента = ПолучитьПредставлениеДокументаВыданногоПокупателю(ВыборкаПоСчетФактуре);
						
						Если ЗначениеЗаполнено(ПредставлениеДокумента) Тогда 
							
							ОбластьМакетаДокументПоПокупателю.Параметры.ПредставлениеДокумента = ПредставлениеДокумента;
							ТабличныйДокумент.Вывести(ОбластьМакетаДокументПоПокупателю);
							
						КонецЕсли;
						
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть(ОбластьСтроки);
					
					ВыборкаТоваров = ВыборкаПоСчетФактуре.Выбрать();
					
					Пока ВыборкаТоваров.Следующий() Цикл
						
						КоличествоТоваров = КоличествоТоваров + 1;
						
						ОбластьМакета.Параметры.Заполнить(ВыборкаТоваров);
						ОбластьМакета.Параметры.НомерСтроки = НомерПП;
						
						Если НЕ ВыборкаТоваров.СуммаВключаетНДС Тогда
							СуммаПоСтроке = ВыборкаТоваров.Сумма + ВыборкаТоваров.СуммаНДС;
							ОбластьМакета.Параметры.Цена = ?(ВыборкаТоваров.Количество <> 0, СуммаПоСтроке/ВыборкаТоваров.Количество, 0);
							ОбластьМакета.Параметры.Сумма = СуммаПоСтроке;
						Иначе
							СуммаПоСтроке = ВыборкаТоваров.Сумма;
						КонецЕсли;			
						ТабличныйДокумент.Вывести(ОбластьМакета);
						
						Итого = Итого + СуммаПоСтроке;
						НомерПП = НомерПП + 1;
						ИтогоПоКонтрагенту = ИтогоПоКонтрагенту + СуммаПоСтроке;
						
					КонецЦикла;	
					
				КонецЦикла;
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаКонтрагентИтог");
				ОбластьМакета.Параметры.Заполнить(ВыборкаКонтрагентов);
				ОбластьМакета.Параметры.Сумма = ИтогоПоКонтрагенту;
				ТабличныйДокумент.Вывести(ОбластьМакета);
				
			КонецЦикла;	
			
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ОбластьМакета.Параметры.Всего = Итого;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		
		ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(Итого, ВыборкаДокументов.ВалютаДокумента);
		
		ОбластьМакета.Параметры.СуммаВознаграждения = НСтр("ru = 'Сумма комиссионного вознаграждения составила'") + " "
		+ ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ВыборкаДокументов.СуммаВознаграждения, ВыборкаДокументов.ВалютаДокумента);
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = НСтр("ru = 'Всего наименований %Количество%, на сумму'") + " "
		+ ОбщегоНазначенияБГУ.ФорматСумм(Итого, ВыборкаДокументов.ВалютаДокумента);
		
		ОбластьМакета.Параметры.ИтоговаяСтрока = СтрЗаменить(ОбластьМакета.Параметры.ИтоговаяСтрока, "%Количество%", КоличествоТоваров);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.ОтветственныйПредставление = КорреспондентыКлиентСервер.ФИО(ВыборкаДокументов.ОтветственныйИсполнительНаименование);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
		НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
		
	КонецЦикла;
	
	Если НЕ ОтчетНапечатан Тогда 
		Шаблон = МассивОбъектов[0];
		
		Если Шаблон.ВидОперации = Перечисления.ВидыОперацийОтчетКомитенту.ОтчетОПродажах Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитенту.ПФ_MXL_ОтчетКомитентуОПродажах");
			ЭтоКомиссияПоПродаже = Истина;
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетКомитенту.ПФ_MXL_ОтчетКомитентуОЗакупках");
			ЭтоКомиссияПоПродаже = Ложь;
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБГУ.СформироватьЗаголовокДокумента(Шаблон, НСтр("ru = 'Отчет комитенту'"));
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,"Организация, Контрагент");
		
		ПредставлениеОрганизации = ДанныеДокумента.Организация;
		
		ПредставлениеКонтрагента = ДанныеДокумента.Контрагент;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Комитент");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеКонтрагента;
		ОбластьМакета.Параметры.Поставщик               = ВыборкаДокументов.Контрагент;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(ВыборкаДокументов);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеОрганизации;
		ОбластьМакета.Параметры.Получатель              = ВыборкаДокументов.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ПечататьСВидомСобытия = ЭтоКомиссияПоПродаже И НЕ Макет.Области.Найти("ВидСобытия") = Неопределено;
		
		Если ПечататьСВидомСобытия Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ВидСобытия");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Итого");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.ОтветственныйПредставление = КорреспондентыКлиентСервер.ФИО(ВыборкаДокументов.ОтветственныйИсполнительНаименование);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
		ТабличныйДокумент.ВысотаТаблицы + 1, ОбъектыПечати, Шаблон);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_АктВыполненныхУслуг");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока 	= Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги 	= Макет.ПолучитьОбласть("Итоги");
	ОбластьПодвал 	= Макет.ПолучитьОбласть("Подвал");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫПЕЧАТИ_АКТВЫПОЛНЕННЫХУСЛУГ";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументОтчетКомитенту.Ссылка КАК Ссылка,
	|	ДокументОтчетКомитенту.Номер КАК пНомер,
	|	ДокументОтчетКомитенту.Дата КАК пДата,
	|	ДокументОтчетКомитенту.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ИспользоватьУчетПоПодразделениям.Значение
	|				И ЕСТЬNULL(ДокументОтчетКомитенту.Подразделение.ОбособленноеПодразделение, ЛОЖЬ)
	|				И ЕСТЬNULL(ДокументОтчетКомитенту.Подразделение.НаименованиеПолное, """") <> """"
	|			ТОГДА ДокументОтчетКомитенту.Подразделение.НаименованиеПолное
	|		КОГДА ДокументОтчетКомитенту.Организация.НаименованиеПолное = """"
	|			ТОГДА ДокументОтчетКомитенту.Организация.Наименование
	|		ИНАЧЕ ДокументОтчетКомитенту.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ДокументОтчетКомитенту.Организация.ИНН КАК ИННОрганизации,
	|	ВЫБОР
	|		КОГДА ИспользоватьУчетПоПодразделениям.Значение
	|				И ЕСТЬNULL(ДокументОтчетКомитенту.Подразделение.ОбособленноеПодразделение, ЛОЖЬ)
	|				И ЕСТЬNULL(ДокументОтчетКомитенту.Подразделение.РегистрацияВНалоговомОргане, ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|			ТОГДА ДокументОтчетКомитенту.Подразделение.РегистрацияВНалоговомОргане.КПП
	|		ИНАЧЕ ДокументОтчетКомитенту.Организация.КПП
	|	КОНЕЦ КАК КППОрганизации,
	|	ДокументОтчетКомитенту.Организация.КодОКПО КАК ОрганизацияКодОКПО,
	|	ДокументОтчетКомитенту.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДокументОтчетКомитенту.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументОтчетКомитенту.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ДокументОтчетКомитенту.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ДокументОтчетКомитенту.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ДокументОтчетКомитенту.Контрагент.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ ДокументОтчетКомитенту.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	ДокументОтчетКомитенту.Контрагент.ИНН КАК КонтрагентИНН,
	|	ДокументОтчетКомитенту.Контрагент.КПП КАК КонтрагентКПП,
	|	ВЫБОР
	|		КОГДА КонтрагентыКППИстория.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК БылоИзменениеКППКонтрагента,
	|	ПРЕДСТАВЛЕНИЕ(ДокументОтчетКомитенту.Договор) КАК пДоговор,
	|	ВЫБОР
	|		КОГДА ДокументОтчетКомитенту.ВалютаДокумента = &ПустаяВалюта
	|			ТОГДА &РегламентированнаяВалюта
	|		ИНАЧЕ ДокументОтчетКомитенту.ВалютаДокумента
	|	КОНЕЦ КАК ВалютаДокумента,
	|	ВЫБОР
	|		КОГДА ДокументОтчетКомитенту.ВалютаДокумента = &ПустаяВалюта
	|				ИЛИ ДокументОтчетКомитенту.ВалютаДокумента = &РегламентированнаяВалюта
	|			ТОГДА ""Руб.""
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ДокументОтчетКомитенту.ВалютаДокумента)
	|	КОНЕЦ КАК пВалюта,
	|	ДокументОтчетКомитенту.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	ДокументОтчетКомитенту.Руководитель КАК Руководитель,
	|	ВЫРАЗИТЬ(ДокументОтчетКомитенту.Контрагент КАК Справочник.Контрагенты).ОбособленноеПодразделение КАК КонтрагентОбособленноеПодразделение,
	|	ВЫРАЗИТЬ(ДокументОтчетКомитенту.Контрагент КАК Справочник.Контрагенты).ГоловнаяОрганизация КАК КонтрагентГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА ДокументОтчетКомитенту.Контрагент.ОбособленноеПодразделение = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА """"
	|					КОГДА НЕ ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация.НаименованиеСокращенное = """"
	|						ТОГДА ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация.НаименованиеСокращенное
	|					КОГДА ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ВЫРАЗИТЬ(ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(1000))
	|					ИНАЧЕ ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентГоловнаяОрганизацияПредставление,
	|	ВЫБОР
	|		КОГДА ДокументОтчетКомитенту.Контрагент.ОбособленноеПодразделение = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА """"
	|					ИНАЧЕ ДокументОтчетКомитенту.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо.ИНН
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентГоловнаяОрганизацияИНН
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ДокументОтчетКомитенту
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КППИстория КАК КонтрагентыКППИстория
	|		ПО ДокументОтчетКомитенту.Контрагент = КонтрагентыКППИстория.Ссылка
	|			И (КонтрагентыКППИстория.НомерСтроки = 1)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ИспользоватьУчетПоПодразделениям КАК ИспользоватьУчетПоПодразделениям
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ДокументОтчетКомитенту.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	пДата,
	|	пНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументОтчетКомитенту.Ссылка КАК Ссылка,
	|	1 КАК пНом,
	|	ДокументОтчетКомитенту.УслугаПоВознаграждению КАК пНаименование,
	|	1 КАК пКоличество,
	|	ДокументОтчетКомитенту.СуммаВознаграждения КАК пЦена,
	|	ДокументОтчетКомитенту.СуммаВознаграждения КАК пСумма,
	|	ДокументОтчетКомитенту.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ДокументОтчетКомитенту.СуммаНДСВознаграждения КАК пСуммаНДС,
	|	ДокументОтчетКомитенту.СуммаВознаграждения КАК Всего,
	|	ДокументОтчетКомитенту.УслугаПоВознаграждению.ЕдиницаИзмерения КАК пЕдИзм
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ДокументОтчетКомитенту
	|ГДЕ
	|	ДокументОтчетКомитенту.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПустаяВалюта",Справочники.Валюты.ПустаяСсылка());
	Запрос.УстановитьПараметр("РегламентированнаяВалюта", Константы.ВалютаРегламентированногоУчета.Получить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = РезультатЗапроса[0].Выбрать();
	ВыборкаВсеСтроки = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		МассивДляПроверки = Новый Массив;
		МассивДляПроверки.Добавить(ОбластьИтоги);
		МассивДляПроверки.Добавить(ОбластьПодвал);
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
		НаименованиеОрганизации = СтрШаблон(НСтр("ru = '%1 ИНН %2 КПП %3'"),
			ВыборкаШапка.НаименованиеОрганизации, ВыборкаШапка.ИННОрганизации, ВыборкаШапка.КППОрганизации);
		ПараметрОрганизация = Новый Структура;
		ПараметрОрганизация.Вставить("пНаименованиеОрганизации", НаименованиеОрганизации);
		ОбластьШапка.Параметры.Заполнить(ПараметрОрганизация);
		РегистрыСведений.НастройкиПечатиПрефиксаНомера.УстановитьНомерДляПечатиВОбластьПечати(ОбластьШапка,
			"пНомер",ВыборкаШапка.пНомер, ВыборкаШапка.Ссылка, Неопределено, Истина);
		
		АдресОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация,
			Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
		ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация,
			Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
			
		ДопДанныеПечати = Новый Структура;
		
		ДопДанныеПечати.Вставить("пАдресТелефон", АдресОрганизации + ?(ПустаяСтрока(ТелефонОрганизации), "", ", тел.:"+ТелефонОрганизации));
		
		Если ВыборкаШапка.БылоИзменениеКППКонтрагента Тогда
			КПП = Справочники.Контрагенты.ПолучитьКПП(ВыборкаШапка.Контрагент, ВыборкаШапка.пДата);
		Иначе
			КПП = ВыборкаШапка.КонтрагентКПП;
		КонецЕсли;
		
		ДанныеКонтрагента = Новый Массив;
		Если ВыборкаШапка.КонтрагентОбособленноеПодразделение Тогда
			ДанныеКонтрагента.Добавить(ВыборкаШапка.КонтрагентГоловнаяОрганизацияПредставление);
			Если ЗначениеЗаполнено(ВыборкаШапка.КонтрагентГоловнаяОрганизацияИНН) Тогда
				ДанныеКонтрагента.Добавить(СтрШаблон(НСтр("ru = 'ИНН %1'"), ВыборкаШапка.КонтрагентГоловнаяОрганизацияИНН));
			КонецЕсли;
			Если ЗначениеЗаполнено(КПП) Тогда
				ДанныеКонтрагента.Добавить(СтрШаблон(НСтр("ru = 'КПП %1'"), КПП));
			КонецЕсли;
		Иначе
			ДанныеКонтрагента.Добавить(ВыборкаШапка.КонтрагентНаименование);
			Если ЗначениеЗаполнено(ВыборкаШапка.КонтрагентИНН) Тогда
				ДанныеКонтрагента.Добавить(СтрШаблон(НСтр("ru = 'ИНН %1'"), ВыборкаШапка.КонтрагентИНН));
			КонецЕсли;
			Если ЗначениеЗаполнено(КПП) Тогда
				ДанныеКонтрагента.Добавить(СтрШаблон(НСтр("ru = 'КПП %1'"), КПП));
			КонецЕсли;
		КонецЕсли;
		
		ДопДанныеПечати.Вставить("пЗаказчик", СтрСоединить(ДанныеКонтрагента, " "));
		ДопДанныеПечати.Вставить("пДата", Формат(ВыборкаШапка.пДата, "ДЛФ=DD"));
		
		ОбластьШапка.Параметры.Заполнить(ДопДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ВыборкаВсеСтроки.Сбросить();
		ОтборСтрок = Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
		Если ВыборкаВсеСтроки.НайтиСледующий(ОтборСтрок) Тогда
			ВыборкаСтрок = ВыборкаВсеСтроки.Выбрать();
			КоличествоСтрок = ВыборкаСтрок.Количество();
		Иначе
			КоличествоСтрок = 0;
		КонецЕсли;
		ИтогСумма = 0;
		ИтогНДС = 0;
		
		СтавкиНДС = Новый Массив();
		
		Пока КоличествоСтрок > 0 И ВыборкаСтрок.Следующий() Цикл
			
			Попытка 
				
				Если ВыборкаСтрок.пНом = КоличествоСтрок Тогда
					
					МассивДляПроверки.Добавить(ОбластьСтрока);
					
					Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивДляПроверки) Тогда
						ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
						ТабличныйДокумент.Вывести(ОбластьЗаголовок);
					КонецЕсли;
					
				ИначеЕсли НЕ ТабличныйДокумент.ПроверитьВывод(ОбластьСтрока) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
					ТабличныйДокумент.Вывести(ОбластьЗаголовок);
				КонецЕсли;	
				
			Исключение 
				ОписаниеОшибки = НСтр("ru='В системе не установлено ни одного принтера.'");
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
			КонецПопытки;
			
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрок);
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			ИтогСумма 	= ИтогСумма + ВыборкаСтрок.пСумма;
			ИтогНДС 	= ИтогНДС 	+ ВыборкаСтрок.пСуммаНДС;
			
			Если СтавкиНДС.Найти(ВыборкаСтрок.СтавкаНДС) = Неопределено Тогда
				СтавкиНДС.Добавить(ВыборкаСтрок.СтавкаНДС);
			КонецЕсли;
			
		КонецЦикла;
		
		Если КоличествоСтрок = 0 Тогда
			Область = Макет.ПолучитьОбласть("Строка");
			ТабличныйДокумент.Вывести(Область);
		КонецЕсли;
		
		ДопДанныеПечати = Новый Структура;
		
		ДопДанныеПечати.Вставить("пИтогСумма", ИтогСумма);
		
		ДанныеПечатиИтоговНДС = УправлениеПечатьюБГУ.ДанныеПечатиИтоговНДС(ИтогНДС, СтавкиНДС, ВыборкаШапка.СуммаВключаетНДС);
		
		ДопДанныеПечати.Вставить("пТекстНДС",	ДанныеПечатиИтоговНДС.Заголовок);
		ДопДанныеПечати.Вставить("пИтогНДС",	ДанныеПечатиИтоговНДС.Сумма);
		
		Если ВыборкаШапка.СуммаВключаетНДС Тогда
			пИтогВсего = ИтогСумма;
		Иначе
			пИтогВсего = ИтогСумма + ИтогНДС;
		КонецЕсли;
		
		ДопДанныеПечати.Вставить("пИтогВсего", пИтогВсего);
		
		ОбластьИтоги.Параметры.Заполнить(ДопДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьИтоги);
		
		ДопДанныеПечати = Новый Структура;
		
		ДопДанныеПечати.Вставить("пИтогВсегоПрописью", ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(пИтогВсего, ВыборкаШапка.ВалютаДокумента));
		ДопДанныеПечати.Вставить("пИтогНДСПрописью", ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(ИтогНДС, ВыборкаШапка.ВалютаДокумента));
		ДопДанныеПечати.Вставить("РуководительФИО",  Справочники.Сотрудники.ФамилияИО(ВыборкаШапка.Руководитель, Истина, ВыборкаШапка.пДата));
		
		ДанныеПодписанта = Новый Структура("СсылкаНаОбъект, Период, Должность", ВыборкаШапка.Руководитель, ВыборкаШапка.пДата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеПодписанта);
		
		ДопДанныеПечати.Вставить("РуководительДолжность", ДанныеПодписанта.Должность);
		
		ОбластьПодвал.Параметры.Заполнить(ДопДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

Функция ПолучитьПредставлениеДокументаВыданногоПокупателю(ВыборкаПоСчетФактуре)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоСчетФактуре.СчетФактураПокупателю) Тогда
		Возврат Неопределено;
	КонецЕсли;

// Формирует текст по какому счету-фактуре выдавался товар
	ЭтоВозврат = ВыборкаПоСчетФактуре.ЭтоВозврат;
	
	Если ЭтоВозврат Тогда
		
		КСчетамФактурам = ОписаниеИсправляемыхДокументов(ЭтоВозврат, ВыборкаПоСчетФактуре.СчетФактураПокупателю);
		
		ПредставлениеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выдан покупателю корректировочный счет-фактура № %1 от %2 к счетам-фактурам:%3'"), 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоСчетФактуре.НомерСФКомиссионера, Истина, Ложь),
		Формат(ВыборкаПоСчетФактуре.ДатаСФКомиссионера, "ДФ=dd.MM.yyyy"), КСчетамФактурам);
		
	Иначе

		ПредставлениеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выдан покупателю счет-фактура № %1 от %2'"), 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаПоСчетФактуре.НомерСФКомиссионера, Истина, Ложь),
		Формат(ВыборкаПоСчетФактуре.ДатаСФКомиссионера, "ДФ=dd.MM.yyyy"));
	
	КонецЕсли;

	Возврат ПредставлениеДокумента;
	
КонецФункции

Функция ОписаниеИсправляемыхДокументов(ЭтоВозврат, СчетФактураПокупателю)
	
	Если НЕ ЭтоВозврат ИЛИ НЕ ЗначениеЗаполнено(СчетФактураПокупателю) Тогда
		Возврат "";
	КонецЕсли;

	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		СчетФактураПокупателю, "ДокументОснование");

	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат "";
	КонецЕсли;
	
	ОписаниеИсправляемыхСчетовФактур = "";
	
	ПараметрыИсправляемыйДокумента = ПараметрыИсходногоДокумента(Результат);
		
	ОписаниеДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='№ %1 от %2%3 '"),
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ПараметрыИсправляемыйДокумента.Номер, Истина, Ложь),
		Формат(ПараметрыИсправляемыйДокумента.Дата, "ДФ=dd.MM.yyyy"));
		
	ОписаниеИсправляемыхСчетовФактур = ОписаниеИсправляемыхСчетовФактур + ОписаниеДокумента;
		
	
	Возврат ОписаниеИсправляемыхСчетовФактур;
	
КонецФункции

Функция ПараметрыИсходногоДокумента(ИсходныйДокумент)

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсходныйДокумент, "Номер, Дата");

КонецФункции

Функция ПолучитьМаксимальныйКлючСтроки(Поставщики) Экспорт
	
	Если Поставщики.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	СписокКлючей = Новый СписокЗначений;
	СписокКлючей.ЗагрузитьЗначения(Поставщики.Выгрузить(, "КлючСтроки").ВыгрузитьКолонку("КлючСтроки"));
	СписокКлючей.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Возврат СписокКлючей[0].Значение;
	
КонецФункции

Функция ПолучитьЗакупленные(Реквизиты) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Организация",         Реквизиты.Организация);
	Запрос.УстановитьПараметр("Контрагент",          Реквизиты.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",  Реквизиты.Договор);
	Запрос.УстановитьПараметр("Период",              Реквизиты.Период);
	Запрос.УстановитьПараметр("ДокументПоступления", Реквизиты.ДокументПоступления);
	
	Если Реквизиты.СпособЗаполнения = "ЗаполнитьЗакупленнымиПоДоговору" Тогда
		ТекстЗапросаИсточник = 
		"ВЫБРАТЬ
		|	ЗакупленныеТоварыКомитентовОстатки.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗакупленныеТоварыКомитентовОстатки.Партия ССЫЛКА Документ.СчетФактураВыданный
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЗакупленныеТоварыКомитентовОстатки.Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Услуга)
		|	КОНЕЦ КАК ЭтоУслуга,
		|	ЗакупленныеТоварыКомитентовОстатки.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗакупленныеТоварыКомитентовОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЗакупленныеТоварыКомитентовОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
		|	ЗакупленныеТоварыКомитентовОстатки.СуммаОстаток КАК СуммаОстаток,
		|	ЗакупленныеТоварыКомитентовОстатки.Партия КАК Партия,
		|	ЗакупленныеТоварыКомитентовОстатки.Контрагент КАК Контрагент,
		|	ЗакупленныеТоварыКомитентовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТ_ЗакупленныеТоварыКомитентовОстатки
		|ИЗ
		|	РегистрНакопления.ЗакупленныеТоварыКомитентов.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Контрагент = &Контрагент
		|				И ДоговорКонтрагента = &ДоговорКонтрагента
		|				И Партия = &ДокументПоступления) КАК ЗакупленныеТоварыКомитентовОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	Номенклатура";
	Иначе
		ТекстЗапросаИсточник = 
		"ВЫБРАТЬ
		|	ЗакупленныеТоварыКомитентов.Номенклатура КАК Номенклатура,
		|	ЗакупленныеТоварыКомитентов.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЗакупленныеТоварыКомитентов.Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Услуга) КАК ЭтоУслуга,
		|	СУММА(ЗакупленныеТоварыКомитентов.Количество) КАК КоличествоОстаток,
		|	СУММА(ЗакупленныеТоварыКомитентов.Сумма) КАК СуммаОстаток,
		|	СУММА(ЗакупленныеТоварыКомитентов.СуммаНДС) КАК СуммаНДСОстаток,
		|	ЗакупленныеТоварыКомитентов.Партия КАК Партия,
		|	ЗакупленныеТоварыКомитентов.Контрагент КАК Контрагент,
		|	ЗакупленныеТоварыКомитентов.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТ_ЗакупленныеТоварыКомитентовОстатки
		|ИЗ
		|	РегистрНакопления.ЗакупленныеТоварыКомитентов КАК ЗакупленныеТоварыКомитентов
		|ГДЕ
		|	ЗакупленныеТоварыКомитентов.Контрагент = &Контрагент
		|	И ЗакупленныеТоварыКомитентов.ДоговорКонтрагента = &ДоговорКонтрагента
		|	И ЗакупленныеТоварыКомитентов.Регистратор = &ДокументПоступления
		|	И ЗакупленныеТоварыКомитентов.Активность
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗакупленныеТоварыКомитентов.Номенклатура,
		|	ЗакупленныеТоварыКомитентов.Номенклатура.ЕдиницаИзмерения,
		|	ЗакупленныеТоварыКомитентов.Номенклатура.ТипНоменклатуры = Значение(Перечисление.ТипыНоменклатуры.Услуга),
		|	ЗакупленныеТоварыКомитентов.Партия,
		|	ЗакупленныеТоварыКомитентов.Контрагент,
		|	ЗакупленныеТоварыКомитентов.ДоговорКонтрагента
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Партия,
		|	Номенклатура";
	КонецЕсли;

	Запрос.Текст = ТекстЗапросаИсточник + ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаПервичногоДокумента) КАК ДатаСФ,
	|	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.Ссылка.НомерПервичногоДокумента) КАК НомерСчетаФактуры,
	|	СчетФактураПолученныйДокументыОснования.Ссылка.Контрагент КАК Контрагент,
	|	СчетФактураПолученныйДокументыОснования.Ссылка.Комитент КАК Комитент,
	|	СчетФактураПолученныйДокументыОснования.Ссылка.ДоговорКомитента КАК ДоговорКомитента
	|ПОМЕСТИТЬ ВТ_ДатыСчетовФактур
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|ГДЕ
	|	НЕ СчетФактураПолученныйДокументыОснования.Ссылка.ПометкаУдаления
	|	И СчетФактураПолученныйДокументыОснования.ДокументОснование В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия
	|			ИЗ
	|				ВТ_ЗакупленныеТоварыКомитентовОстатки)
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование,
	|	СчетФактураПолученныйДокументыОснования.Ссылка.Контрагент,
	|	СчетФактураПолученныйДокументыОснования.Ссылка.Комитент,
	|	СчетФактураПолученныйДокументыОснования.Ссылка.ДоговорКомитента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТовары.Ссылка КАК Партия,
	|	ПоступлениеТовары.Номенклатура КАК Номенклатура,
	|	1 КАК НомерТабЧасти,
	|	МИНИМУМ(ПоступлениеТовары.НомерСтроки) КАК НомерСтроки,
	|	ПоступлениеТовары.СтавкаНДС КАК СтавкаНДС,
	|	"""" КАК Содержание,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТовары.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ПоступлениеТовары.Сумма
	|			ИНАЧЕ ПоступлениеТовары.Сумма + ПоступлениеТовары.СуммаНДС
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ПоступлениеТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ПоступлениеТовары.Количество) КАК Количество,
	|	ПоступлениеТовары.Всего / ПоступлениеТовары.Количество КАК Цена,
	|	"""" КАК НомерДляСодержания,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаДляСодержания,
	|	НЕОПРЕДЕЛЕНО КАК Контрагент
	|ПОМЕСТИТЬ ВТ_СтрокиДокументов
	|ИЗ
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки КАК ВТ_ЗакупленныеТоварыКомитентовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДоговорыКонтрагентов
	|			ПО ПоступлениеТовары.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
	|		ПО (ПоступлениеТовары.Ссылка = ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия)
	|			И (ПоступлениеТовары.Номенклатура = ВТ_ЗакупленныеТоварыКомитентовОстатки.Номенклатура)
	|ГДЕ
	|	ПоступлениеТовары.Комитент = &Контрагент
	|	И ПоступлениеТовары.ДоговорКомитента = &ДоговорКонтрагента
	|	И ПоступлениеТовары.КомиссионнаяТорговля
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТовары.Ссылка,
	|	ПоступлениеТовары.Номенклатура,
	|	ПоступлениеТовары.СтавкаНДС,
	|	ПоступлениеТовары.Всего / ПоступлениеТовары.Количество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеАгентскиеУслуги.Ссылка,
	|	ПоступлениеАгентскиеУслуги.Номенклатура,
	|	2,
	|	МИНИМУМ(ПоступлениеАгентскиеУслуги.НомерСтроки),
	|	ПоступлениеАгентскиеУслуги.СтавкаНДС,
	|	ВЫРАЗИТЬ(ПоступлениеАгентскиеУслуги.Содержание КАК СТРОКА(500)),
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеАгентскиеУслуги.Ссылка.СуммаВключаетНДС = ИСТИНА
	|				ТОГДА ПоступлениеАгентскиеУслуги.Сумма
	|			ИНАЧЕ ПоступлениеАгентскиеУслуги.Сумма + ПоступлениеАгентскиеУслуги.СуммаНДС
	|		КОНЕЦ),
	|	СУММА(ПоступлениеАгентскиеУслуги.СуммаНДС),
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеАгентскиеУслуги.Количество = 0
	|				ТОГДА 1
	|			ИНАЧЕ ПоступлениеАгентскиеУслуги.Количество
	|		КОНЕЦ),
	|	ПоступлениеАгентскиеУслуги.Всего / ПоступлениеАгентскиеУслуги.Количество,
	|	"""",
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки КАК ВТ_ЗакупленныеТоварыКомитентовОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслугРабот.УслугиИРаботы КАК ПоступлениеАгентскиеУслуги
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК ДоговорыКонтрагентов
	|			ПО ПоступлениеАгентскиеУслуги.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
	|		ПО (ПоступлениеАгентскиеУслуги.Ссылка = ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия)
	|			И (ПоступлениеАгентскиеУслуги.Номенклатура = ВТ_ЗакупленныеТоварыКомитентовОстатки.Номенклатура)
	|ГДЕ
	|	ПоступлениеАгентскиеУслуги.Комитент = &Контрагент
	|	И ПоступлениеАгентскиеУслуги.ДоговорКомитента = &ДоговорКонтрагента
	|	И ПоступлениеАгентскиеУслуги.КомиссионнаяТорговля
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеАгентскиеУслуги.Номенклатура,
	|	ВЫРАЗИТЬ(ПоступлениеАгентскиеУслуги.Содержание КАК СТРОКА(500)),
	|	ПоступлениеАгентскиеУслуги.Всего / ПоступлениеАгентскиеУслуги.Количество,
	|	ПоступлениеАгентскиеУслуги.СтавкаНДС,
	|	ПоступлениеАгентскиеУслуги.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	2,
	|	1,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС),
	|	"""",
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.СуммаОстаток,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.СуммаНДСОстаток,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.КоличествоОстаток,
	|	0,
	|	ВЫРАЗИТЬ(ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия КАК Документ.СчетФактураВыданный).НомерДокументаОплаты,
	|	ВЫРАЗИТЬ(ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия КАК Документ.СчетФактураВыданный).ДатаДокументаОплаты,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки КАК ВТ_ЗакупленныеТоварыКомитентовОстатки
	|ГДЕ
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия ССЫЛКА Документ.СчетФактураВыданный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Партия,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.Номенклатура КАК Номенклатура,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.ЭтоУслуга КАК ЭтоУслуга,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия КАК Партия,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.СуммаНДСОстаток КАК СуммаНДСОстаток,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВТ_СтрокиДокументов.НомерТабЧасти КАК НомерТабЧасти,
	|	ВТ_СтрокиДокументов.НомерСтроки КАК НомерСтроки,
	|	ВТ_СтрокиДокументов.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_СтрокиДокументов.Содержание КАК Содержание,
	|	ВТ_СтрокиДокументов.Количество КАК Количество,
	|	ВТ_СтрокиДокументов.Сумма КАК Сумма,
	|	ВТ_СтрокиДокументов.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия ССЫЛКА Документ.СчетФактураВыданный
	|			ТОГДА ВЫРАЗИТЬ(ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия КАК Документ.СчетФактураВыданный).Контрагент
	|		КОГДА ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия ССЫЛКА Документ.ПоступлениеУслугРабот
	|			ТОГДА ПоступлениеУслугРабот.Контрагент
	|		ИНАЧЕ ПоступлениеМЗ.Контрагент
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ДатыСчетовФактур.ДатаСФ ЕСТЬ NULL
	|			ТОГДА ВТ_ДатыСчетовФактур.ДатаСФ
	|		КОГДА ПоступлениеМЗ.ДатаПервичногоДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ПоступлениеМЗ.ДатаПервичногоДокумента
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ПоступлениеМЗ.Дата, ДЕНЬ)
	|	КОНЕЦ КАК ДатаСФ,
	|	ЕСТЬNULL(ВТ_ДатыСчетовФактур.НомерСчетаФактуры, """") КАК НомерСчетаФактуры,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ДатыСчетовФактур.ДатаСФ ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолученСФ,
	|	ВТ_СтрокиДокументов.НомерДляСодержания КАК НомерДляСодержания,
	|	ВТ_СтрокиДокументов.ДатаДляСодержания КАК ДатаДляСодержания
	|ИЗ
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки КАК ВТ_ЗакупленныеТоварыКомитентовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия = ПоступлениеМЗ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДатыСчетовФактур КАК ВТ_ДатыСчетовФактур
	|		ПО ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия = ВТ_ДатыСчетовФактур.ДокументОснование
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СтрокиДокументов КАК ВТ_СтрокиДокументов
	|		ПО ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия = ВТ_СтрокиДокументов.Партия
	|			И ВТ_ЗакупленныеТоварыКомитентовОстатки.Номенклатура = ВТ_СтрокиДокументов.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеУслугРабот КАК ПоступлениеУслугРабот
	|		ПО ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия = ПоступлениеУслугРабот.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поставщик,
	|	ДатаСФ,
	|	ВТ_ЗакупленныеТоварыКомитентовОстатки.Партия,
	|	ВТ_СтрокиДокументов.НомерТабЧасти,
	|	ВТ_СтрокиДокументов.НомерСтроки
	|ИТОГИ
	|	МИНИМУМ(КоличествоОстаток),
	|	МИНИМУМ(СуммаНДСОстаток),
	|	МИНИМУМ(СуммаОстаток),
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	МАКСИМУМ(ДатаСФ),
	|	МАКСИМУМ(НомерСчетаФактуры),
	|	МАКСИМУМ(ПолученСФ),
	|	МАКСИМУМ(НомерДляСодержания),
	|	МАКСИМУМ(ДатаДляСодержания)
	|ПО
	|	Поставщик,
	|	Партия,
	|	Номенклатура";
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ДокументПоступления) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Партия = &ДокументПоступления", "");
	КонецЕсли;
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#КонецОбласти

#КонецЕсли
