
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдресТаблицыРеквизитов", АдресТаблицыРеквизитов) Тогда
		ТабРеквизитов = ПолучитьИзВременногоХранилища(АдресТаблицыРеквизитов);
		
		ЗначениеВРеквизитФормы(ТабРеквизитов, "ТаблицаЗаполняемыхРеквизитов");
	КонецЕсли;
	
	Для К = 1 По 3 Цикл
		СубконтоСчета.Добавить(Неопределено, "Субконто" + К);
		СубконтоСчетаНУ.Добавить(Неопределено, "СубконтоНУ" + К);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыформыТаблицаЗаполняемыхРеквизитов

&НаКлиенте
Процедура ТаблицаЗаполняемыхРеквизитовПередНачаломИзменения(Элемент, Отказ)
	ТекущиеДанные = Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущиеДанные;
	ТипРеквизита = ТекущиеДанные.ТипЗначенияРеквизита;
	
	ИмяРеквизита = ТекущиеДанные.ИмяРеквизита;
	
	ТекущееЗначениеРеквизита = ТекущиеДанные.ЗначениеРеквизита;
	
	Если Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент.Имя = "Отметка" Тогда
		Если Найти(ИмяРеквизита, "СубконтоНУ") > 0 Тогда
			Индекс = Число(Прав(ИмяРеквизита, 1));
			ТипРеквизита = СубконтоСчетаНУ[Индекс - 1].Значение;
		ИначеЕсли Найти(ИмяРеквизита, "Субконто") > 0 Тогда
			Индекс = Число(Прав(ИмяРеквизита, 1));
			ТипРеквизита = СубконтоСчета[Индекс - 1].Значение;
		КонецЕсли;
		
		Если ТипРеквизита = Неопределено Тогда
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли Найти(ИмяРеквизита, "Счет") Или Найти(ИмяРеквизита, "Субконто") Тогда
		Если ИмяРеквизита = "СчетДт" Тогда
			Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент.ОграничениеТипа = ТипРеквизита;
			ВидОперации = ЗначениеВидаОперации();
			ПараметрыВыбораСчета = Новый Структура;
			
			Если ВидОперации <> Неопределено Тогда
				ПараметрыВыбораСчета = ПолучитьПараметрыВыбораСчетДтНаСервере(ВидОперации);
		
				ПараметрыВыбораСчета.Вставить("КодТекущейСтроки", ?(ТекущиеДанные.ЗначениеРеквизита <> Неопределено, ТекущиеДанные.ЗначениеРеквизита, ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка")));
				ПараметрыВыбораСчета.Вставить("ТипСчета", ПредопределенноеЗначение("Перечисление.ТипыСчетов.Бухгалтерский"));
				ПараметрыВыбораСчета.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			КонецЕсли;
			
			ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыВыбораСчета, Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент);
		ИначеЕсли ИмяРеквизита = "СчетНУ" Тогда
			Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент.ОграничениеТипа = ТипРеквизита;
			
			ПараметрыВыбораСчета = Новый Структура;
			ПараметрыВыбораСчета.Вставить("КодТекущейСтроки", ?(ТекущиеДанные.ЗначениеРеквизита <> Неопределено, ТекущиеДанные.ЗначениеРеквизита, ПредопределенноеЗначение("ПланСчетов.ЕПСБУ.ПустаяСсылка")));
			ПараметрыВыбораСчета.Вставить("ТипСчета", ПредопределенноеЗначение("Перечисление.ТипыСчетов.Налоговый"));
			ПараметрыВыбораСчета.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
		
			ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыВыбораСчета, Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент);
		ИначеЕсли Найти(ИмяРеквизита, "СубконтоНУ") > 0 Тогда
			Индекс = Число(Прав(ИмяРеквизита, 1));
			ТипРеквизита = СубконтоСчетаНУ[Индекс - 1].Значение;
			
			Если ТипРеквизита = Неопределено Тогда
				Отказ = Истина;
			Иначе
				Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент.ОграничениеТипа = ТипРеквизита;
			КонецЕсли;
		ИначеЕсли Найти(ИмяРеквизита, "Субконто") > 0 Тогда
			Индекс = Число(Прав(ИмяРеквизита, 1));
			ТипРеквизита = СубконтоСчета[Индекс - 1].Значение;
			
			Если ТипРеквизита = Неопределено Тогда
				Отказ = Истина;
			Иначе
				Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент.ОграничениеТипа = ТипРеквизита;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущийЭлемент.ОграничениеТипа = ТипРеквизита;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаполняемыхРеквизитовЗначениеРеквизитаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаЗаполняемыхРеквизитов.ТекущиеДанные;
	
	Если ТекущиеДанные.ЗначениеРеквизита <> ТекущееЗначениеРеквизита Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.ЗначениеРеквизита) Тогда
			ТекущиеДанные.ЗначениеЗаполнено = Истина;
			ТекущиеДанные.Отметка = Истина;
		Иначе
			ТекущиеДанные.ЗначениеЗаполнено = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗаполняемыхРеквизитовЗначениеРеквизитаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ПланСчетовСсылка.ЕПСБУ") Тогда
		ОбработатьВыборСчета(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьИЗаполнить(Команда)
	ПоместитьТаблицуРеквизитовВХранилище();	
	Закрыть(АдресТаблицыРеквизитов);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьВыборСчета(Счет)
	Если Счет.ТипСчета = Перечисления.ТипыСчетов.Бухгалтерский Тогда
		СписокСубконто = СубконтоСчета;
		Суффикс = "";
	Иначе
		СписокСубконто = СубконтоСчетаНУ;
		Суффикс = "НУ";
	КонецЕсли;
	
	СписокСубконто.Очистить();
	
	ВидыСубконто = Счет.ВидыСубконто;
	
	Для К = 1 По 3 Цикл
		Если ВидыСубконто.Количество() >= К Тогда
			Значение = ВидыСубконто[К-1].ВидСубконто.ТипЗначения;
		Иначе
			Значение = Неопределено;
		КонецЕсли;
		
		СписокСубконто.Добавить(Значение, "Субконто" + Суффикс + К);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПоместитьТаблицуРеквизитовВХранилище()
	ТабРеквизитов = РеквизитФормыВЗначение("ТаблицаЗаполняемыхРеквизитов");
	Результат = ТабРеквизитов.НайтиСтроки(Новый Структура("Отметка", Истина));
	
	Если Результат.Количество() > 0 Тогда
		АдресТаблицыРеквизитов = ПоместитьВоВременноеХранилище(Результат, АдресТаблицыРеквизитов);
	Иначе
		АдресТаблицыРеквизитов = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗначениеВидаОперации()
	ТаблицаРеквизитов = РеквизитФормыВЗначение("ТаблицаЗаполняемыхРеквизитов");
	СтрокаВидОперации = ТаблицаРеквизитов.Найти("ВидОперации", "ИмяРеквизита");
	
	Если СтрокаВидОперации <> Неопределено Тогда
		Возврат СтрокаВидОперации.ЗначениеРеквизита;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПараметрыВыбораСчетДтНаСервере(ЗаписьВидОперации)
	ПараметрыВыбораСчета = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СоответствиеОперацийУчетаЗарплаты.ОперацияБГУ.ОграниченияСчет.(
	|		Счет КАК Счет
	|	) КАК СписокСчетов
	|ИЗ
	|	РегистрСведений.СоответствиеОперацийУчетаЗарплаты КАК СоответствиеОперацийУчетаЗарплаты
	|ГДЕ
	|	СоответствиеОперацийУчетаЗарплаты.ОперацияЗГУ = &ОперацияЗГУ");
	
	Запрос.УстановитьПараметр("ОперацияЗГУ", ЗаписьВидОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСчетов = Новый Массив;
	
	Если Выборка.Следующий() Тогда
		ВыборкаСчет = Выборка.СписокСчетов.Выбрать();
		
		Пока ВыборкаСчет.Следующий() Цикл
			МассивСчетов.Добавить(ВыборкаСчет.Счет);	
		КонецЦикла;
	КонецЕсли;
	
	Если МассивСчетов.Количество() > 0 Тогда
		ПараметрыВыбораСчета.Вставить("ОграниченияСписокСчетов", МассивСчетов);
	Иначе
		//по корреспонденции
		ПараметрыВыбораСчета.Вставить("КорреспонденцияКтКод", "302.00");
		
	КонецЕсли;	
	
	Возврат ПараметрыВыбораСчета;
КонецФункции

#КонецОбласти