
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		Организация =  Параметры.Организация;
	ИначеЕсли Параметры.Отбор.Свойство("Владелец") Тогда
		Организация = Параметры.Отбор["Владелец"].Владелец;
	КонецЕсли;
	
	ОрганизацияДоп = Справочники.Организации.ПереопределитьОтборПоОрганизации(Организация);
	
	ПравоеЗначение 	= Неопределено;
	ВидСравненияОрг	= Неопределено;
	Если Организация = ОрганизацияДоп Тогда
		ПравоеЗначение = Организация;
		ВидСравненияОрг = ВидСравненияКомпоновкиДанных.Равно;
	Иначе
		ПравоеЗначение = Новый Массив;
		ПравоеЗначение.Добавить(Организация);
		ПравоеЗначение.Добавить(ОрганизацияДоп);
		ВидСравненияОрг = ВидСравненияКомпоновкиДанных.ВСписке;
		
		НовоеПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		НовоеПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("ВладелецВладелец");
		НовоеПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
		НовоеПолеГруппировки.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
		НовоеПолеГруппировки.Использование = Истина;

	КонецЕсли;	
	
	НовоеПолеГруппировки = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	НовоеПолеГруппировки.Поле = Новый ПолеКомпоновкиДанных("Владелец");
	НовоеПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	НовоеПолеГруппировки.ТипДополнения = ТипДополненияПериодаКомпоновкиДанных.БезДополнения;
	НовоеПолеГруппировки.Использование = Истина;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец.Владелец",
		ПравоеЗначение, ВидСравненияОрг,, ЗначениеЗаполнено(Организация));
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец.ТипЛицевогоСчета",
		Параметры.ТипЛицевогоСчета, ВидСравненияКомпоновкиДанных.Равно, ,ЗначениеЗаполнено(Параметры.ТипЛицевогоСчета));
	
	Если ЗначениеЗаполнено(Параметры.НаДату) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец.ДатаОткрытия",
			Параметры.НаДату, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, Истина);
		
		ГруппаДатаЗакрытия = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы,
			"ГруппаДатаЗакрытия", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаДатаЗакрытия, "Владелец.ДатаЗакрытия",
			ВидСравненияКомпоновкиДанных.БольшеИлиРавно, Параметры.НаДату, "ДатаЗакрытияБольше", Истина);
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаДатаЗакрытия, "Владелец.ДатаЗакрытия",
			ВидСравненияКомпоновкиДанных.Равно, Дата('00010101'), "ДатаЗакрытияРавно", Истина);
		
	КонецЕсли;
	
	Если НЕ Параметры.РазрешитьВыборЛСсСопровождениемНаРазделах Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец.КазначейскоеСопровождениеНаРазделах",
			Ложь, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.КомандыФормы);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти
