#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс 

Функция ДействующиеКодыПоступлений(КодСчета = "") Экспорт
	
	ДействующиеКоды = Новый Массив; 
	ДействующиеКоды.Добавить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ВР"));
	Если НЕ ЗначениеЗаполнено(КодСчета) Или Лев(КодСчета, 2) = "80" Или Лев(КодСчета, 2) = "90" Тогда
		ДействующиеКоды.Добавить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ГЗ"));
		ДействующиеКоды.Добавить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ГР"));
		ДействующиеКоды.Добавить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.МС"));
		ДействующиеКоды.Добавить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ОБ"));
		ДействующиеКоды.Добавить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ПД"));
		ДействующиеКоды.Добавить(ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ЦС")); 
	КонецЕсли;

    Возврат ДействующиеКоды;
	
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий 

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Исключаем из списка выбора ЦС и КВ, коды пока не применяются.
	
	СтандартнаяОбработка = ЛОЖЬ;  
	ДанныеВыбора = Новый СписокЗначений; 
	ДанныеВыбора.ЗагрузитьЗначения(ДействующиеКодыПоступлений());
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли