#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("ОсновноеСредство");
	ИменаРеквизитов.Добавить("ИнвентарныйНомер");
	ИменаРеквизитов.Добавить("Количество");
	ИменаРеквизитов.Добавить("Сумма");
	ИменаРеквизитов.Добавить("СуммаАмортизации");
	ИменаРеквизитов.Добавить("СуммаОбесценения");
	Результат.Вставить("ОсновныеСредства", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

// Формирует запрос для получения данных печати и результат запроса добавляет в массив ДанныеВидовДокументов
//
// Параметры:
//  ДанныеВидовДокументов - Массив - в этот массив процедура добавит результат запроса
//  МассивОбъектов - Массив - массив документов-ссылок одного вида
Процедура ДобавитьДанныеДляПечати0510442(ДанныеВидовДокументов, МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РешениеОбОценкеИмущества.Ссылка КАК Ссылка,
	|	РешениеОбОценкеИмущества.Номер КАК Номер,
	|	РешениеОбОценкеИмущества.Дата КАК ДатаАкта,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА РешениеОбОценкеИмущества.Организация
	|		ИНАЧЕ РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ВЫБОР
	|					КОГДА РешениеОбОценкеИмущества.Организация.НаименованиеПолное = """"
	|						ТОГДА РешениеОбОценкеИмущества.Организация.Наименование
	|					ИНАЧЕ РешениеОбОценкеИмущества.Организация.НаименованиеПолное
	|				КОНЕЦ
	|		ИНАЧЕ РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА РешениеОбОценкеИмущества.Организация.КодПоРПБС
	|		ИНАЧЕ РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБС,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|		ИНАЧЕ РешениеОбОценкеИмущества.Организация
	|	КОНЕЦ КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ РешениеОбОценкеИмущества.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмущества.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.Пустаяссылка)
	|			ТОГДА """"
	|		ИНАЧЕ РешениеОбОценкеИмущества.Организация.КодПоРПБС
	|	КОНЕЦ КАК КодРПБСПодр,
	|	РешениеОбОценкеИмущества.Подразделение КАК СтруктурноеПодразделение,
	|	ВЫБОР
	|		КОГДА РешениеОбОценкеИмущества.Подразделение.НаименованиеПолное = """"
	|			ТОГДА РешениеОбОценкеИмущества.Подразделение.Наименование
	|		ИНАЧЕ РешениеОбОценкеИмущества.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделения,
	|	РешениеОбОценкеИмущества.Организация.КодПоППП.НаименованиеПолное КАК Учредитель,
	|	РешениеОбОценкеИмущества.Организация.КодПоППП.Код КАК ГлаваБК,
	|	РешениеОбОценкеИмущества.Организация.Бюджет.НаименованиеПолное КАК БюджетНаименование,
	|	РешениеОбОценкеИмущества.Организация.Бюджет.Код КАК ОКТМО,
	|	РешениеОбОценкеИмущества.Получатель КАК Получатель,
	|	РешениеОбОценкеИмущества.Получатель.Наименование КАК НаименованиеПолучателя,
	|	РешениеОбОценкеИмущества.ВидПервичногоДокумента КАК ВидДокументаОСогласовании,
	|	РешениеОбОценкеИмущества.ДатаПервичногоДокумента КАК ДатаДокументаОСогласовании,
	|	РешениеОбОценкеИмущества.НомерПервичногоДокумента КАК НомерДокументаОСогласовании,
	|	РешениеОбОценкеИмущества.Комиссия.НаименованиеПриказа КАК НаименованиеПриказа,
	|	РешениеОбОценкеИмущества.Комиссия.НомерПриказа КАК НомерПриказа,
	|	РешениеОбОценкеИмущества.Комиссия.ДатаПриказа КАК ДатаПриказа,
	|	РешениеОбОценкеИмущества.Ответственный КАК Ответственный,
	|	РешениеОбОценкеИмущества.Руководитель КАК Руководитель
	|ИЗ
	|	Документ.РешениеОбОценкеИмущества КАК РешениеОбОценкеИмущества
	|ГДЕ
	|	РешениеОбОценкеИмущества.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РешениеОбОценкеИмущества.Дата,
	|	РешениеОбОценкеИмущества.Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ОсновныеСредства.МетодРыночныхЦен КАК МетодРыночныхЦен,
	|	ОсновныеСредства.ОпределенаОценщиком КАК ОпределенаОценщиком,
	|	ОсновныеСредства.СправедливаяСтоимость КАК СправедливаяСтоимость,
	|	ОсновныеСредства.ОценкаНомер КАК ОценкаНомер,
	|	ОсновныеСредства.ОценкаДата КАК ОценкаДата
	|ПОМЕСТИТЬ ОсновныеСредства
	|ИЗ
	|	Документ.РешениеОбОценкеИмущества.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СобытияОССрезПоследних.ДатаСобытия КАК ДатаСобытия,
	|	СобытияОССрезПоследних.ИнвНомер КАК ИнвентарныйНомер
	|ПОМЕСТИТЬ ДатаВводаВЭксплуатацию
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						ОсновныеСредства.ОсновноеСредство
	|					ИЗ
	|						ОсновныеСредства КАК ОсновныеСредства)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)) КАК СобытияОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования
	|ПОМЕСТИТЬ СПИ
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ОсновныеСредства.ОсновноеСредство
	|				ИЗ
	|					ОсновныеСредства КАК ОсновныеСредства)) КАК РасчетАмортизацииОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка КАК Ссылка,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОсновноеСредство.НаименованиеПолное = """"
	|			ТОГДА ОсновныеСредства.ОсновноеСредство.Наименование
	|		ИНАЧЕ ОсновныеСредства.ОсновноеСредство.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОС,
	|	ОсновныеСредства.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	|	ОсновныеСредства.ИнвентарныйНомер.РеестровыйНомер КАК РеестровыйНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.ЗаводскойНомер КАК ЗаводскойНомер,
	|	ОсновныеСредства.ИнвентарныйНомер.ИнойНомер КАК ИнойНомер,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.Количество КАК Количество,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ОсновныеСредства.МетодРыночныхЦен КАК МетодРыночныхЦен,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОпределенаОценщиком
	|			ТОГДА 0
	|		ИНАЧЕ ОсновныеСредства.СправедливаяСтоимость
	|	КОНЕЦ КАК СправедливаяСтоимость,
	|	ВЫБОР
	|		КОГДА ОсновныеСредства.ОпределенаОценщиком
	|			ТОГДА ОсновныеСредства.СправедливаяСтоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОценкаСумма,
	|	ОсновныеСредства.ОценкаНомер КАК ОценкаНомер,
	|	ОсновныеСредства.ОценкаДата КАК ОценкаДата,
	|	ЕСТЬNULL(СПИ.СрокПолезногоИспользования, 0) КАК СрокПолезногоИспользования,
	|	ЕСТЬNULL(ДатаВводаВЭксплуатацию.ДатаСобытия, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВводаВЭксплуатацию
	|ИЗ
	|	ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию
	|		ПО ОсновныеСредства.ОсновноеСредство = ДатаВводаВЭксплуатацию.ОсновноеСредство
	|			И ОсновныеСредства.ИнвентарныйНомер = ДатаВводаВЭксплуатацию.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ СПИ КАК СПИ
	|		ПО ОсновныеСредства.ОсновноеСредство = СПИ.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОсновныеСредства.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК Ссылка,
	|	Файлы.Ссылка КАК Файл,
	|	Файлы.Наименование КАК ИмяФайла,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.Описание КАК Описание
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла В(&МассивОбъектов)
	|	И НЕ Файлы.Служебный
	|	И НЕ Файлы.ПометкаУдаления";
	
	ДанныеВидовДокументов.Добавить(Запрос.ВыполнитьПакет());
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ГолосованиеКомиссии

Процедура ЗаполнитьРезультатГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ЗаполнитьРезультатыГолосования = Не Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Комиссия)
		И ЗначениеЗаполнено(Объект.Организация);
	Если ЗаполнитьРезультатыГолосования Тогда
		РезультатГолосованияСотрудника = ОбщегоНазначенияБГУ.РезультатыГолосованияСотрудникаПоДокументу(
			Форма.Сотрудник, Объект.Ссылка, Объект.Комиссия, Объект.Организация);
		РезультатГолосованияКомиссии = ОбщегоНазначенияБГУ.РезультатыГолосованияКомиссийПоДокументам(
			Объект.Ссылка, Объект.Комиссия, Объект.Организация);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Объект.ОсновныеСредства Цикл
		
		СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Неопределено;
		СтрокаТаблицы.ИтогГолосования = 0;
		СтрокаТаблицы.РезолюцияКомиссииОдобрена = Ложь;
		Если ЗаполнитьРезультатыГолосования Тогда
			
			Если РезультатГолосованияСотрудника.Количество() > 0 Тогда
				Результаты = РезультатГолосованияСотрудника.Найти(СтрокаТаблицы.ИдентификаторСтроки, "ИдентификаторСтроки");
				Если Результаты <> Неопределено Тогда
					СтрокаТаблицы.РешениеСотрудникаПоРезолюции = Результаты.РезультатГолосования;
				КонецЕсли;
			КонецЕсли;
			
			Если РезультатГолосованияКомиссии.Количество() > 0 Тогда
				ОтборПоИдентификаторуСтроки = Новый Структура("Документ, ИдентификаторСтроки",
					Объект.Ссылка, СтрокаТаблицы.ИдентификаторСтроки);
				РезультатыГолосованияПоСтроке = РезультатГолосованияКомиссии.НайтиСтроки(ОтборПоИдентификаторуСтроки);
				Если РезультатыГолосованияПоСтроке.Количество() > 0 Тогда
					СтрокаТаблицы.ИтогГолосования = РезультатыГолосованияПоСтроке[0].ИтогГолосования;
					СтрокаТаблицы.РезолюцияКомиссииОдобрена = РезультатыГолосованияПоСтроке[0].РезолюцияКомиссииОдобрена;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ВФормеЕстьРезультатыГолосования = (Объект.ОсновныеСредства.Итог("ИтогГолосования") <> 0);
КонецПроцедуры

Процедура УправлениеЭлементамиГолосования(Форма) Экспорт
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если НЕ Форма.ВФормеЕстьРезультатыГолосования Тогда
		ЭлементыГолосование = Новый Массив;
		ЭлементыГолосование.Добавить("ГруппаГолосование");
		ЭлементыГолосование.Добавить("ОсновныеСредстваПодменюУстановитьРешение");
		ЭлементыГолосование.Добавить("ОсновныеСредстваПодменюУстановитьРешениеЕдиногласно");
		ЭлементыГолосование.Добавить("ОсновныеСредстваРезолюцияКомиссии");
		ЭлементыГолосование.Добавить("ОсновныеСредстваРешениеСотрудникаПоРезолюции");
		ЭлементыГолосование.Добавить("ОсновныеСредстваГруппаПроцентГолосовЗа");
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ЭлементыГолосование, "Видимость", ЛОЖЬ);
	Иначе	
		ДоступностьГолосования = Не Объект.Ссылка.Пустая() И Не Объект.Проведен
			И ЗначениеЗаполнено(Объект.Комиссия)
			И ЗначениеЗаполнено(Объект.Организация);
		
		ЭлементыГолосование = Новый Массив;
		ЭлементыГолосование.Добавить("Сотрудник");
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ЭлементыГолосование, "Доступность", ДоступностьГолосования);
		
		ЭлементыГолосование = Новый Массив;
		ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноЗаВоВсехСтроках");
		ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЕдиногласноПротивВоВсехСтроках");
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ЭлементыГолосование, "Видимость", ДоступностьГолосования И Не ЗначениеЗаполнено(Форма.Сотрудник));
		
		ЭлементыГолосование = Новый Массив;
		ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВоВсехСтроках");
		ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВоВсехСтроках");
		ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеЗаВВыделенныхСтроках");
		ЭлементыГолосование.Добавить("ОсновныеСредстваУстановитьРешениеПротивВВыделенныхСтроках");
		ЭлементыГолосование.Добавить("ОсновныеСредстваРешениеСотрудникаПоРезолюции");
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ЭлементыГолосование, "Видимость", ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник));
		
		ЭлементыГолосование = Новый Массив;
		ЭлементыГолосование.Добавить("СохранитьРезультатыГолосования");
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
			ЭлементыГолосование, "Доступность", 
			ДоступностьГолосования И ЗначениеЗаполнено(Форма.Сотрудник) И Форма.РешениеСотрудникаМодифицированность);
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"				, ДокументСсылка);
	
	ДатаПроведения = БухгалтерскийУчет.УстановленнаяДатаПроведения(ДокументСсылка);
	ДатаЗапроса = ?(ЗначениеЗаполнено(ДатаПроведения), ДатаПроведения, ДокументСсылка.МоментВремени());
	Запрос.УстановитьПараметр("Период", ДатаЗапроса);
	
	Запрос.УстановитьПараметр("ИмяДокумента"		, НСтр("ru = 'Решение об оценке стоимости имущества, отчуждаемого не в пользу организаций бюджетной сферы'"));
	Запрос.УстановитьПараметр("УчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	ТаблицыЗапроса = Новый Массив;
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ДатыПроведенияДокументов.ДатаПроведения ЕСТЬ NULL
	|				ИЛИ ДатыПроведенияДокументов.ДатаПроведения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА ОсновныеСредства.Ссылка.Дата
	|		ИНАЧЕ ДатыПроведенияДокументов.ДатаПроведения
	|	КОНЕЦ КАК Период,
	|	ОсновныеСредства.Ссылка.Организация КАК Организация,
	|	ОсновныеСредства.Ссылка.СпособПереоценки КАК СпособПереоценки,
	|	ОсновныеСредства.НомерСтроки КАК Порядок,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА &УчетПоПодразделениям
	|			ТОГДА ОсновныеСредства.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ОсновныеСредства.Сумма - ОсновныеСредства.СуммаАмортизации - ОсновныеСредства.СуммаОбесценения = 0
	|			ТОГДА 1
	|		ИНАЧЕ (ОсновныеСредства.СправедливаяСтоимость + ОсновныеСредства.СуммаОбесценения) / (ОсновныеСредства.Сумма - ОсновныеСредства.СуммаАмортизации)
	|	КОНЕЦ КАК ЧИСЛО(29, 16)) КАК Коэффициент,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СправедливаяСтоимость КАК СправедливаяСтоимость,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ОсновныеСредства.Ссылка.Дата КАК ДатаДокумента
	|ПОМЕСТИТЬ ВТ_ОсновныеСредства
	|ИЗ
	|	Документ.РешениеОбОценкеИмущества.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПроведенияДокументов КАК ДатыПроведенияДокументов
	|		ПО (ДатыПроведенияДокументов.Документ = ОсновныеСредства.Ссылка)
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОстатки.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(
	|			&Период,
	|			ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|				И (Организация, ОсновноеСредство, ИнвентарныйНомер) В
	|					(ВЫБРАТЬ
	|						ВТ_ОсновныеСредства.Организация КАК Организация,
	|						ВТ_ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|						ВТ_ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер
	|					ИЗ
	|						ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства)) КАК СтоимостьОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеСредства.Период КАК Период,
	|	ВТ_ОсновныеСредства.Организация КАК Организация,
	|	ВТ_ОсновныеСредства.Порядок КАК Порядок,
	|	ВТ_ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_ОсновныеСредства.Подразделение КАК Подразделение,
	|	ВТ_ОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ВТ_ОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ВТ_ОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.ПересчитатьПропорционально)
	|			ТОГДА ВТ_ОсновныеСредства.Сумма * (ВТ_ОсновныеСредства.Коэффициент - 1)
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.СписатьАмортизацию)
	|			ТОГДА ВТ_ОсновныеСредства.СправедливаяСтоимость - ВТ_ОсновныеСредства.Сумма 
	|				+ ВТ_ОсновныеСредства.СуммаОбесценения + ВТ_ОсновныеСредства.СуммаАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(18, 2)) КАК Сумма,
	|	ВТ_ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ВТ_ОсновныеСредства.СпособПереоценки КАК СпособПереоценки,
	|	ВТ_Остатки.ЦМО КАК ЦМО,
	|	ВТ_Остатки.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_Стоимость
	|ИЗ
	|	ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_ОсновныеСредства.ОсновноеСредство = ВТ_Остатки.ОсновноеСредство
	|			И ВТ_ОсновныеСредства.ИнвентарныйНомер = ВТ_Остатки.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеСредства.Период КАК Период,
	|	ВТ_ОсновныеСредства.Организация КАК Организация,
	|	ВТ_ОсновныеСредства.Порядок КАК Порядок,
	|	ВТ_ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.ПересчитатьПропорционально)
	|			ТОГДА ВТ_ОсновныеСредства.СуммаАмортизации * (ВТ_ОсновныеСредства.Коэффициент - 1)
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.СписатьАмортизацию)
	|			ТОГДА -ВТ_ОсновныеСредства.СуммаАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(18, 2)) КАК СуммаАмортизации
	|ПОМЕСТИТЬ ВТ_Амортизация
	|ИЗ
	|	ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства";
	
	ТаблицыЗапроса.Добавить("СтоимостьОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе) КАК ВидРаспоряжения,
	|	ВТ_Стоимость.Период КАК Период,
	|	ВТ_Стоимость.Организация КАК Организация,
	|	ВТ_Стоимость.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Стоимость.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_Стоимость.ЦМО КАК ЦМО,
	|	ВТ_Стоимость.Договор КАК Договор,
	|	ВТ_Стоимость.Подразделение КАК Подразделение,
	|	ВТ_Стоимость.Сумма КАК Стоимость,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Переоценка) КАК Событие,
	|	ВТ_Стоимость.НазваниеДокумента КАК НазваниеДокумента,
	|	ВТ_Стоимость.НомерДокумента КАК НомерДокумента,
	|	ВТ_Стоимость.ДатаДокумента КАК ДатаДокумента,
	|	ВТ_Стоимость.Порядок КАК Порядок
	|ИЗ
	|	ВТ_Стоимость КАК ВТ_Стоимость
	|ГДЕ
	|	ВТ_Стоимость.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	ВТ_Стоимость.Период,
	|	ВТ_Стоимость.Организация,
	|	ВТ_Стоимость.ОсновноеСредство,
	|	ВТ_Стоимость.ИнвентарныйНомер,
	|	ВТ_Стоимость.ЦМО,
	|	ВТ_Стоимость.Договор,
	|	ВТ_Стоимость.Подразделение,
	|	-ВТ_Стоимость.Сумма,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Переоценка),
	|	ВТ_Стоимость.НазваниеДокумента,
	|	ВТ_Стоимость.НомерДокумента,
	|	ВТ_Стоимость.ДатаДокумента,
	|	ВТ_Стоимость.Порядок
	|ИЗ
	|	ВТ_Стоимость КАК ВТ_Стоимость
	|ГДЕ
	|	ВТ_Стоимость.Сумма < 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе),
	|	ВТ_Стоимость.Период,
	|	ВТ_Стоимость.Организация,
	|	ВТ_Стоимость.ОсновноеСредство,
	|	ВТ_Стоимость.ИнвентарныйНомер,
	|	ВТ_Стоимость.ЦМО,
	|	ВТ_Стоимость.Договор,
	|	ВТ_Стоимость.Подразделение,
	|	ВТ_Стоимость.СуммаАмортизации,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Переоценка),
	|	ВТ_Стоимость.НазваниеДокумента,
	|	ВТ_Стоимость.НомерДокумента,
	|	ВТ_Стоимость.ДатаДокумента,
	|	ВТ_Стоимость.Порядок
	|ИЗ
	|	ВТ_Стоимость КАК ВТ_Стоимость
	|ГДЕ
	|	ВТ_Стоимость.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.СписатьАмортизацию)
	|		И ВТ_Стоимость.СуммаАмортизации <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	ТаблицыЗапроса.Добавить("АмортизацияОбъектовОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ВТ_Амортизация.Период КАК Период,
	|	ВТ_Амортизация.Организация КАК Организация,
	|	ВТ_Амортизация.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_Амортизация.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_Амортизация.СуммаАмортизации КАК СуммаАмортизации,
	|	ВТ_Амортизация.Порядок КАК Порядок
	|ИЗ
	|	ВТ_Амортизация КАК ВТ_Амортизация
	|ГДЕ
	|	ВТ_Амортизация.СуммаАмортизации > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ВТ_Амортизация.Период,
	|	ВТ_Амортизация.Организация,
	|	ВТ_Амортизация.ОсновноеСредство,
	|	ВТ_Амортизация.ИнвентарныйНомер,
	|	-ВТ_Амортизация.СуммаАмортизации,
	|	ВТ_Амортизация.Порядок
	|ИЗ
	|	ВТ_Амортизация КАК ВТ_Амортизация
	|ГДЕ
	|	ВТ_Амортизация.СуммаАмортизации < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	ТаблицыЗапроса.Добавить("");
	ТаблицыЗапроса.Добавить("РасчетАмортизацииОС");
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ТЧ_АмортизируемыеОС
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			&Период,
	|			(Организация, ОсновноеСредство) В
	|				(ВЫБРАТЬ
	|					ВТ.Организация,
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ВТ_ОсновныеСредства КАК ВТ)) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|ГДЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ПорядокПогашенияСтоимости = ЗНАЧЕНИЕ(Перечисление.ПорядокПогашенияСтоимостиОС.НачислениеАмортизации)
	|	И ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособНачисленияАмортизации <> ЗНАЧЕНИЕ(Перечисление.СпособНачисленияАмортизации.ПриВводеВЭксплуатацию)
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОсновныеСредства.Период КАК Период,
	|	РасчетАмортизацииОССрезПоследних.Организация КАК Организация,
	|	РасчетАмортизацииОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезногоИспользования,
	|	РасчетАмортизацииОССрезПоследних.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	РасчетАмортизацииОССрезПоследних.КоэффициентУскорения КАК КоэффициентУскорения,
	|	РасчетАмортизацииОССрезПоследних.ПараметрВыработки КАК ПараметрВыработки,
	|	РасчетАмортизацииОССрезПоследних.ПредполагаемыйОбъемВыработки КАК ПредполагаемыйОбъемВыработки,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВТ_ОсновныеСредства.СправедливаяСтоимость КАК СтоимостьДляВычисленияАмортизации
	|ИЗ
	|	РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	|			&Период,
	|			ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					ВТ.ОсновноеСредство
	|				ИЗ
	|					ТЧ_АмортизируемыеОС КАК ВТ)) КАК РасчетАмортизацииОССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				ВТ_ОсновныеСредства.Период КАК Период,
	|				ВТ_ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|				ВТ_ОсновныеСредства.СправедливаяСтоимость КАК СправедливаяСтоимость,
	|				МИНИМУМ(ВТ_ОсновныеСредства.Порядок) КАК Порядок,
	|				МАКСИМУМ(ВТ_ОсновныеСредства.ИнвентарныйНомер) КАК ИнвентарныйНомер
	|			ИЗ
	|				ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|			СГРУППИРОВАТЬ ПО	
	|				ВТ_ОсновныеСредства.Период,
	|				ВТ_ОсновныеСредства.ОсновноеСредство,
	|				ВТ_ОсновныеСредства.СправедливаяСтоимость) КАК ВТ_ОсновныеСредства
	|		ПО РасчетАмортизацииОССрезПоследних.ОсновноеСредство = ВТ_ОсновныеСредства.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОсновныеСредства.Порядок";
	
	Результат = Запрос.ВыполнитьПакет();
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, ТаблицыЗапроса);
	
	ДатаДокумента = ?(ЗначениеЗаполнено(ДатаПроведения), ДатаПроведения, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Дата"));
	Для Каждого СтрокаТаблицы Из СтруктураДополнительныеСвойства.ТаблицыДляДвижений.РасчетАмортизацииОС Цикл
		СрокЭксплуатацииФакт = УправлениеОсновнымиСредствами.ФактическийСрокЭксплуатации(
			СтрокаТаблицы.ОсновноеСредство, 
			СтрокаТаблицы.ИнвентарныйНомер, 
			СтрокаТаблицы.Организация, 
			ДатаДокумента);
		СтрокаТаблицы.СрокИспользованияДляВычисленияАмортизации = Макс(СтрокаТаблицы.СрокПолезногоИспользования - СрокЭксплуатацииФакт, 1);
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает таблицу для источника данных при формировании проводок
//
Функция ТаблицаОС(РеквизитыДокумента = Неопределено) Экспорт
	
	Если РеквизитыДокумента = Неопределено Тогда
		
		ОписаниеТипаСчет	= Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ");
		ОписаниеТипаСуммы	= Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой));
		
		ПустаяТаблица = Новый ТаблицаЗначений;
		
		// Идентификация строки.
		ПустаяТаблица.Колонки.Добавить("ИмяСписка"          , ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
		ПустаяТаблица.Колонки.Добавить("СинонимСписка"      , ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(50));
		ПустаяТаблица.Колонки.Добавить("НомерСтроки"        , ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(5));
		ПустаяТаблица.Колонки.Добавить("ИдентификаторСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(36));
		// Таблица
		ПустаяТаблица.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
		ПустаяТаблица.Колонки.Добавить("ИнвентарныйНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
		ПустаяТаблица.Колонки.Добавить("Стоимость"       , ОписаниеТипаСуммы);
		ПустаяТаблица.Колонки.Добавить("СуммаАмортизации", ОписаниеТипаСуммы);
		
		ПустаяТаблица.Колонки.Добавить("СчетУчета", ОписаниеТипаСчет);
		ПустаяТаблица.Колонки.Добавить("КФО", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
		ПустаяТаблица.Колонки.Добавить("КПС", Новый ОписаниеТипов("СправочникСсылка.КлассификационныеПризнакиСчетов"));
		ПустаяТаблица.Колонки.Добавить("ЦМО", Новый ОписаниеТипов("СправочникСсылка.ЦМО"));
		ПустаяТаблица.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
		ПустаяТаблица.Колонки.Добавить("СчетАмортизации", ОписаниеТипаСчет);
		ПустаяТаблица.Колонки.Добавить("ЭтоПовышениеСтоимости", Новый ОписаниеТипов("Булево"));
		
		Возврат ПустаяТаблица;
		
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка.СпособПереоценки КАК СпособПереоценки,
	|	ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ОсновныеСредства.Сумма КАК Сумма,
	|	ОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	ОсновныеСредства.СправедливаяСтоимость КАК СправедливаяСтоимость,
	|	ОсновныеСредства.СуммаОбесценения КАК СуммаОбесценения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ОсновныеСредства.Сумма - ОсновныеСредства.СуммаАмортизации = 0
	|			ТОГДА 1
	|		ИНАЧЕ (ОсновныеСредства.СправедливаяСтоимость + ОсновныеСредства.СуммаОбесценения) / (ОсновныеСредства.Сумма -
	|			ОсновныеСредства.СуммаАмортизации)
	|	КОНЕЦ КАК ЧИСЛО(29, 16)) КАК Коэффициент,
	|	Выбор
	|		когда (ОсновныеСредства.Сумма - ОсновныеСредства.СуммаАмортизации -
	|			ОсновныеСредства.СуммаОбесценения) < ОсновныеСредства.СправедливаяСтоимость
	|			тогда Истина
	|		иначе Ложь
	|	конец КАК ЭтоПовышениеСтоимости
	|ПОМЕСТИТЬ ВТ_ОсновныеСредства
	|ИЗ
	|	Документ.РешениеОбОценкеИмущества.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	ОсновныеСредства.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьОбъектовОСОстатки.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОСОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОСОстатки.ЦМО КАК ЦМО,
	|	СтоимостьОбъектовОСОстатки.Договор КАК Договор
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС.Остатки(&Период,
	|		ВидРаспоряжения = ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе)
	|	И Организация = &Организация
	|	И (ОсновноеСредство, ИнвентарныйНомер) В
	|		(ВЫБРАТЬ
	|			ВТ_ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|			ВТ_ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер
	|		ИЗ
	|			ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства)) КАК СтоимостьОбъектовОСОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УчетныеДанныеОбъектаОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	УчетныеДанныеОбъектаОССрезПоследних.СчетУчета КАК СчетУчета,
	|	УчетныеДанныеОбъектаОССрезПоследних.КФО КАК КФО,
	|	УчетныеДанныеОбъектаОССрезПоследних.КПС КАК КПС
	|ПОМЕСТИТЬ УчетныеДанные
	|ИЗ
	|	РегистрСведений.УчетныеДанныеОбъектаОС.СрезПоследних(&Период,
	|		ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаНФА.НаБалансе)
	|	И &Организация = Организация
	|	И ОсновноеСредство В
	|		(ВЫБРАТЬ
	|			ВТ_ОсновныеСредства.ОсновноеСредство
	|		ИЗ
	|			ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства)) КАК УчетныеДанныеОбъектаОССрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""ОсновныеСредства"" КАК ИмяСписка,
	|	""Основные средства"" КАК СинонимСписка,
	|	ВТ_ОсновныеСредства.НомерСтроки КАК НомерСтроки,
	|	ВТ_ОсновныеСредства.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВТ_ОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ВТ_ОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.ПересчитатьПропорционально)
	|			ТОГДА ВТ_ОсновныеСредства.Сумма * (ВТ_ОсновныеСредства.Коэффициент - 1)
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.СписатьАмортизацию)
	|			ТОГДА ВТ_ОсновныеСредства.СправедливаяСтоимость - ВТ_ОсновныеСредства.Сумма 
	|				+ ВТ_ОсновныеСредства.СуммаОбесценения + ВТ_ОсновныеСредства.СуммаАмортизации 
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(18, 2)) КАК Стоимость,
	|	ВЫРАЗИТЬ(ВЫБОР
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.ПересчитатьПропорционально)
	|			ТОГДА ВТ_ОсновныеСредства.СуммаАмортизации * (ВТ_ОсновныеСредства.Коэффициент - 1)
	|		КОГДА ВТ_ОсновныеСредства.СпособПереоценки = ЗНАЧЕНИЕ(Перечисление.СпособыПереоценкиОС.СписатьАмортизацию)
	|			ТОГДА - ВТ_ОсновныеСредства.СуммаАмортизации
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЧИСЛО(18, 2)) КАК СуммаАмортизации,
	|	ВТ_ОсновныеСредства.ЭтоПовышениеСтоимости КАК ЭтоПовышениеСтоимости,
	|	УчетныеДанные.СчетУчета КАК СчетУчета,
	|	УчетныеДанные.КФО КАК КФО,
	|	УчетныеДанные.КПС КАК КПС,
	|	Остатки.ЦМО КАК ЦМО,
	|	Остатки.Договор КАК Договор,
	|	СоответствиеСчетовОС.СчетАмортизации КАК СчетАмортизации
	|ИЗ
	|	ВТ_ОсновныеСредства КАК ВТ_ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ВТ_ОсновныеСредства.ОсновноеСредство = Остатки.ОсновноеСредство
	|		И ВТ_ОсновныеСредства.ИнвентарныйНомер = Остатки.ИнвентарныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчетныеДанные КАК УчетныеДанные
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеСчетовОС КАК СоответствиеСчетовОС
	|			ПО УчетныеДанные.СчетУчета = СоответствиеСчетовОС.СчетОС
	|		ПО ВТ_ОсновныеСредства.ОсновноеСредство = УчетныеДанные.ОсновноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОсновныеСредства.НомерСтроки";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка"		, РеквизитыДокумента.Ссылка);
	Запрос.УстановитьПараметр("Период"		, РеквизитыДокумента.Дата);
	Запрос.УстановитьПараметр("Организация"	, РеквизитыДокумента.Организация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РешениеОбОценкеИмущества";
	КомандаПечати.Идентификатор		= "Решение";
	КомандаПечати.Представление		= НСтр("ru = 'Решение об оценке имущества (ф. 0510442)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"Решение") Тогда
		
		ТабличныйДокумент = НапечататьРешение(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"Решение", "Решение об оценке имущества (ф. 0510442)", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НапечататьРешение(МассивОбъектов, ОбъектыПечати)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПроверитьДостижениеКворумаПрисутствияПриПечати(МассивОбъектов);
	// Конец ИндикаторКворумаПрисутствия
	
	ТабличныйДокумент						= Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПараметрыПечати_Решение0510442";
	ТабличныйДокумент.ТолькоПросмотр		= Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_РешениеОбОценкеСтоимостиИмущества0510442");
	
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьР1Шапка		= Макет.ПолучитьОбласть("Раздел1_Шапка");
	ОбластьР1Строка		= Макет.ПолучитьОбласть("Раздел1_Строка");
	ОбластьПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПриложение	= Макет.ПолучитьОбласть("Приложение");
	ОбластьКомиссияС	= Макет.ПолучитьОбласть("Комиссия_Строка");
	ОбластьИсполнитель	= Макет.ПолучитьОбласть("Исполнитель");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	
	ДанныеВидовДокументов = Новый Массив; // массив результатов запроса по разным видам документов
	Для Каждого Документ Из ОбщегоНазначенияБГУ.ДокументыПоТипам(МассивОбъектов) Цикл
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ.Значение[0]);
		МенеджерДокумента.ДобавитьДанныеДляПечати0510442(ДанныеВидовДокументов, Документ.Значение);
	КонецЦикла;                   
	
	Для каждого ДанныеДляПечати Из ДанныеВидовДокументов Цикл
		ВыборкаДокументов	= ДанныеДляПечати[0].Выбрать();
		ВыборкаОС			= ДанныеДляПечати[4].Выбрать();
		ВыборкаФайлы		= ДанныеДляПечати[5].Выбрать();

		ДанныеПечатиОбщие = УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов);

		СоставКомиссий = ОбщегоНазначенияБГУ.СоставКомиссийПоДокументам(МассивОбъектов);
		
		ПервыйДокумент = Истина;
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			НомерСтраницы = 1;
			
			ДанныеПечатиОбщиеДокумента = ДанныеПечатиОбщие.Получить(ВыборкаДокументов.Ссылка);

			// Шапка
			
			ОбластьШапка.Параметры.Заполнить(ВыборкаДокументов);
			ОбластьШапка.Параметры.Дата = ВыборкаДокументов.ДатаАкта;
			
			ПараметрыШапки	= Новый Структура;
			ПараметрыШапки.Вставить("НомерАкта", ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
				ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер));
				
			// Данные руководителя
			Если ВыборкаДокументов.Владелец().Колонки.Найти("Руководитель") <> Неопределено И ЗначениеЗаполнено(ВыборкаДокументов["Руководитель"]) Тогда
				ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность, Подразделение", 
					ВыборкаДокументов["Руководитель"], ВыборкаДокументов.ДатаАкта);
				Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина, Истина);
				ФИОРуководителя = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);                 
				ДолжностьРуководителя = Строка(ДанныеСотрудника.Должность);
			Иначе	
				Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации(
					Перечисления.ОтветственныеЛицаОрганизаций.Руководитель, ВыборкаДокументов.Организация,
					ВыборкаДокументов.ДатаАкта, ВыборкаДокументов.СтруктурноеПодразделение);
				ФИОРуководителя = КорреспондентыКлиентСервер.ФИО(Руководитель, Истина, "ОтветственноеЛицо");
				ДолжностьРуководителя = Руководитель.ДолжностьПредставление;
			КонецЕсли;	
			ПараметрыШапки.Вставить("ДолжностьРуководителя", ДолжностьРуководителя);
			ПараметрыШапки.Вставить("ФИОРуководителя", ФИОРуководителя);
				
			ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
			ОбластьШапка.Параметры.Заполнить(ДанныеПечатиОбщиеДокумента);
			ТабличныйДокумент.Вывести(ОбластьШапка);
			
			СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
			
			// Раздел 1
			
			ТабличныйДокумент.Вывести(ОбластьР1Шапка);
			
			ВыборкаОС.Сбросить();
			
			Пока ВыборкаОС.НайтиСледующий(СтруктураПоиска) Цикл
				
				ФактическийСрокЭксплуатации = УправлениеОсновнымиСредствами.РассчитатьМесяцыЭксплуатации(,
					ВыборкаОС.ДатаВводаВЭксплуатацию, ВыборкаДокументов.ДатаАкта);
				ПараметрыСтроки = Новый Структура("СрокЭксплуатации", ФактическийСрокЭксплуатации);
				
				ОбластьР1Строка.Параметры.Заполнить(ВыборкаОС);
				ОбластьР1Строка.Параметры.Заполнить(ПараметрыСтроки);
				ТабличныйДокумент.Вывести(ОбластьР1Строка);
				
			КонецЦикла;
			
			// Приложения
			
			ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
			Сч = 0;
			Пока ВыборкаФайлы.НайтиСледующий(СтруктураПоиска) Цикл
				Сч = Сч + 1;
				ОбластьПриложение.Параметры.Заполнить(Новый Структура("Номер", Сч));
				ОбластьПриложение.Параметры.Заполнить(ВыборкаФайлы);
				ТабличныйДокумент.Вывести(ОбластьПриложение);
			КонецЦикла;
			
			// Комиссия
			
			// Председатель
			Отбор = Новый Структура("Ссылка,Председатель", ВыборкаДокументов.Ссылка, Истина);
			СтрокиПредседатель = СоставКомиссий.НайтиСтроки(Отбор);
			ДанныеПредседателя = Новый Структура("Должность,НаименованиеДолжности,Сотрудник,ОсобыеОтметки,ФайлОсобогоМнения,ФИО,ПредставлениеЧленаКомиссии");
			Для Каждого Председатель Из СтрокиПредседатель Цикл
				ЗаполнитьЗначенияСвойств(ДанныеПредседателя, Председатель);
				ДанныеПредседателя.ПредставлениеЧленаКомиссии = НСтр("ru = 'Председатель комиссии:'");
				ДанныеПредседателя.ФИО = КорреспондентыКлиентСервер.ФИО(Председатель);
				ОбластьКомиссияС.Параметры.Заполнить(ДанныеПредседателя);
			КонецЦикла;
			ТабличныйДокумент.Вывести(ОбластьКомиссияС);
			
			// Члены комиссии
			Отбор = Новый Структура("Ссылка,Председатель", ВыборкаДокументов.Ссылка, Ложь);
			СтрокиЧленыКомиссии = СоставКомиссий.НайтиСтроки(Отбор);
			ПерваяСтрока = Истина;
			ДанныеЧК = Новый Структура("Должность,НаименованиеДолжности,Сотрудник,ОсобыеОтметки,ФайлОсобогоМнения,ФИО,ПредставлениеЧленаКомиссии");
			Для Каждого ЧленКомиссии Из СтрокиЧленыКомиссии Цикл
				ЗаполнитьЗначенияСвойств(ДанныеЧК, ЧленКомиссии);
				ДанныеЧК.ФИО = КорреспондентыКлиентСервер.ФИО(ЧленКомиссии);
				ДанныеЧК.ПредставлениеЧленаКомиссии = ?(ПерваяСтрока, НСтр("ru = 'Члены комиссии:'"), "");
				ОбластьКомиссияС.Параметры.Заполнить(ДанныеЧК);
				ТабличныйДокумент.Вывести(ОбластьКомиссияС);
				ПерваяСтрока = Ложь;
			КонецЦикла;
			
			// Исполнитель

			Если ДанныеПечатиОбщиеДокумента <> Неопределено И ЗначениеЗаполнено(ДанныеПечатиОбщиеДокумента.ОтветственныйФИО) Тогда
				СведенияИсполнителя = Новый Структура;
				СведенияИсполнителя.Вставить("ДолжностьНаименование", ДанныеПечатиОбщиеДокумента.ОтветственныйДолжность);
				СведенияИсполнителя.Вставить("ФИО", КорреспондентыКлиентСервер.ФИО(ДанныеПечатиОбщиеДокумента.ОтветственныйФИО, Истина));
				СведенияИсполнителя.Вставить("НомерТелефона", ДанныеПечатиОбщиеДокумента.ОтветственныйТелефон);
				СведенияИсполнителя.Вставить("ЭлектроннаяПочта", ДанныеПечатиОбщиеДокумента.ОтветственныйЭлПочта);         
			Иначе	
				СведенияИсполнителя = УправлениеПечатьюБГУ.СведенияИсполнителяПоОтветственному(ВыборкаДокументов.Ответственный,
					ВыборкаДокументов.Организация, ВыборкаДокументов.ДатаАкта, Истина, Ложь);
			КонецЕсли;	
			ОбластьИсполнитель.Параметры.Заполнить(СведенияИсполнителя);
			ТабличныйДокумент.Вывести(ОбластьИсполнитель);
			
			// Подвал
			
			ТабличныйДокумент.Вывести(ОбластьПодвал);
			
			// В табличном документе зададим имя области, в которую был
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
				НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументов.Ссылка);
			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Зарегистрировать данные к обработке для перехода на новую версию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	УправлениеПечатью.ЗарегистрироватьНовоеИмяМакета(
		"ОбщийМакет.ПФ_MXL_РешениеОбОценкеСтоимостиИмущества0510442", 
		Параметры);
	
КонецПроцедуры

// Обработать данные для перехода на новую версию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Макеты = Новый Соответствие;
	Макеты["ОбщийМакет.ПФ_MXL_РешениеОбОценкеСтоимостиИмущества0510442"] = "Документ.РешениеОбОценкеИмущества.ПФ_MXL_Решение0510442";
	УправлениеПечатью.ПеренестиПользовательскиеМакеты(Макеты, Параметры);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
