#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(ОсновноеСредство) Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды
		ИЛИ ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзПользования Тогда
		
		УправлениеОсновнымиСредствами.ПроверитьСобытиеОСвПользовании(
			УправлениеОсновнымиСредствами.НоваяТаблицаОСИнвНомер(ОсновноеСредство, ИнвентарныйНомер),
			Организация,
			Дата,
			Ссылка,
			Ложь,
			?(ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды,
				Перечисления.ВидыСобытийОС.СдачаВАренду,
				Перечисления.ВидыСобытийОС.ПередачаВБезвозмездноеПользование),
			Отказ);
			
		Если Отказ Тогда
			ПроверяемыеРеквизиты.Очистить();
		КонецЕсли;
		
		Если ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ВозвратИзАренды Тогда
			СчетОбъекта = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("25");
		Иначе
			СчетОбъекта = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду("26");
		КонецЕсли;
		
		ПризнакиУчета = БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета(СчетОбъекта);
		
		МассивНепроверяемыхРеквизитов.Добавить("ВнеоборотныйАктив");
		МассивНепроверяемыхРеквизитов.Добавить("СчетКредита");
		МассивНепроверяемыхРеквизитов.Добавить("Количество");
		
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользования");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатрат");
		МассивНепроверяемыхРеквизитов.Добавить("СубконтоЗатрат1");
		МассивНепроверяемыхРеквизитов.Добавить("СубконтоЗатрат2");
		МассивНепроверяемыхРеквизитов.Добавить("СубконтоЗатрат3");
		МассивНепроверяемыхРеквизитов.Добавить("КЭКЗатрат");
		МассивНепроверяемыхРеквизитов.Добавить("ПодразделениеЗатрат");
		Если Не ПризнакиУчета.УчетПоКПС Тогда
			МассивНепроверяемыхРеквизитов.Добавить("КПС");
		КонецЕсли;
		Если Не ПризнакиУчета.УчетПоПодразделениям Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Подразделение");
			МассивНепроверяемыхРеквизитов.Добавить("ПодразделениеОтправитель");
		КонецЕсли;
			
		МассивНепроверяемыхРеквизитов.Добавить("СпособНачисленияАмортизации");
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокПогашенияСтоимости");
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатратПоАмортизационнойПремии");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		Возврат;
		
	Иначе
			
		МассивНепроверяемыхРеквизитов.Добавить("ЦМООтправитель");
		МассивНепроверяемыхРеквизитов.Добавить("ПодразделениеОтправитель");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновноеСредство) И ЗначениеЗаполнено(ИнвентарныйНомер) Тогда
		Если ОсновноеСредствоУжеПринятоКУчету() Тогда
			Отказ = Истина;
			ПроверяемыеРеквизиты.Очистить();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	СвойстваСчетаУчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетУчета);
	
	Если СвойстваСчетаУчета.Забалансовый Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИнвентарныйНомер");
	КонецЕсли;
	
	Если Не УправлениеОсновнымиСредствамиКлиентСервер.ЭтоПриобретениеИлиИзготовление(ВидПоступления) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВнеоборотныйАктив");
		МассивНепроверяемыхРеквизитов.Добавить("СчетКредита");
		МассивНепроверяемыхРеквизитов.Добавить("Количество");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОсновноеСредство) Тогда
		СтруктураЗапрашиваемыхСчетов = УправлениеОсновнымиСредствамиКлиентСервер.СтруктураЗапрашиваемыхСчетов();
		СтруктураЗапрашиваемыхСчетов.ЖилыеПомещения		= Истина;
		СтруктураЗапрашиваемыхСчетов.НежилыеПомещения	= Истина;
		СтруктураЗапрашиваемыхСчетов.Сооружения			= Истина;
		СтруктураЗапрашиваемыхСчетов.Аренда				= Истина;
		СтруктураЗапрашиваемыхСчетов.Хранение			= Истина;
		СчетаУчета = УправлениеОсновнымиСредствамиПовтИсп.ПолучитьМассивСчетовОС(Неопределено,
																				Истина,
																				Истина,
																				Истина);
		Если СчетаУчета.Найти(СчетУчета) = Неопределено
			И НЕ БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(СчетУчета).Забалансовый Тогда
			ТекстСообщения = НСтр("ru='Документ предназначен для принятия к учету зданий (сооружений).
										|Выбрано неверное основное средство'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство",,Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетКредита) ИЛИ ЗначениеЗаполнено(ВнеоборотныйАктив) Тогда
		Если ПроверяемыеРеквизиты.Найти("СчетКредита") = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("СчетКредита");
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("ВнеоборотныйАктив") = Неопределено Тогда
			ПроверяемыеРеквизиты.Добавить("ВнеоборотныйАктив");
		КонецЕсли;
	КонецЕсли;
	
	УправлениеОсновнымиСредствами.ДобавитьНепроверяемыеРеквизитыСчетаЗатрат(Ложь, ПорядокПогашенияСтоимости, СчетУчетаЗатрат, МассивНепроверяемыхРеквизитов);
	
	Если НЕ СвойстваСчетаУчета.УчетПоКПС Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КПС");
	КонецЕсли;
	
	// Налоговый учет по налогу на прибыль
	ОтражатьВНалоговомУчете = НалоговыйУчетКлиентСервер.ОтражатьВНалоговомУчете(Организация, Дата, КФО);
	
	Если НЕ ОтражатьВНалоговомУчете Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокВключенияСтоимостиВСоставРасходовНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатратПоАмортизационнойПремии");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
	КонецЕсли;
	
	ВыбранСчетПрочихРасходов = БухгалтерскийУчетКлиентСервер.СчетВИерархии(СчетУчетаЗатрат, "401.20");
	Если НЕ ВыбранСчетПрочихРасходов
	 ИЛИ ПорядокВключенияСтоимостиВСоставРасходовНУ = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.СтоимостьНеВключаетсяВРасходы Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяПрочихРасходов");
	КонецЕсли;
	
	Если НЕ ПорядокВключенияСтоимостиВСоставРасходовНУ = Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если НЕ НачислятьАмортизациюНУ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияНУ");
	КонецЕсли;
	
	Если ПорядокВключенияСтоимостиВСоставРасходовНУ <> Перечисления.ПорядокВключенияСтоимостиОСВСоставРасходовНУ.НачислениеАмортизации
			ИЛИ ПроцентКапитальныхВложенийВключаемыхВРасходыНУ = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетУчетаЗатратПоАмортизационнойПремии");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПервоначальнаяСтоимость					= 0;
	ПервоначальнаяСтоимостьНУ				= 0;
	Количество								= 0;
	ИнвентарныйНомер						= Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
	ДатаВводаВЭксплуатацию					= '00010101';
	ОставшийсяСрокПолезногоИспользования	= 0;
	СуммаАмортизации						= 0;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ВидПоступления = Перечисления.ВидыОперацийПринятияКУчетуОС.ПоступлениеНаСчет101 Тогда
		ДатаВводаВЭксплуатацию					= '00010101';   
		ОставшийсяСрокПолезногоИспользования	= 0;
		СуммаАмортизации						= 0;
	КонецЕсли;
	Если ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуИзготовление
		И ВидПоступления <> Перечисления.ВидыОперацийПринятияКУчетуОС.ПринятиеКУчетуПриобретение Тогда
		
		ВнеоборотныйАктив = Неопределено;
		СчетКредита = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОсновноеСредствоУжеПринятоКУчету()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПРЕДСТАВЛЕНИЕ(СобытияОС.Событие) КАК Событие,
	               |	СобытияОС.ДатаСобытия,
	               |	ВЫБОР
	               |		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	               |			ТОГДА 1
	               |		КОГДА СобытияОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВводВЭксплуатацию)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ КАК Поле1,
	               |	СобытияОС.Регистратор,
	               |	ПРЕДСТАВЛЕНИЕ(СобытияОС.Регистратор) КАК ПредставлениеРегистратора
	               |ИЗ
	               |	РегистрСведений.СобытияОС КАК СобытияОС
	               |ГДЕ
	               |	СобытияОС.Организация = &Организация
	               |	И СобытияОС.ОсновноеСредство = &ОсновноеСредство
	               |	И СобытияОС.ИнвНомер = &ИнвНомер";
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Запрос.Текст = Запрос.Текст + "
	               |	И СобытияОС.Период <= &Период";
		Запрос.УстановитьПараметр("Период", 		КонецДня(Дата));
	Иначе
		Запрос.Текст = Запрос.Текст + "
	               |	И СобытияОС.МоментВремени <= &МоментВремени
	               |	И СобытияОС.Регистратор <> &Регистратор";
		Запрос.УстановитьПараметр("МоментВремени",	МоментВремени());
		Запрос.УстановитьПараметр("Регистратор",	Ссылка);
	КонецЕсли;	
	Запрос.Текст = Запрос.Текст + "	
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Поле1";
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство",	ОсновноеСредство);
	Запрос.УстановитьПараметр("ИнвНомер",			ИнвентарныйНомер);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если ОсновноеСредство.ГрупповойУчет Тогда
			ТекстСообщения = НСтр("ru='По выбранному инвентарному номеру уже произведено [ВидСобытияОС] документом [Регистратор]'");
			ВставляемыеПараметры = Новый Структура("ВидСобытияОС, Регистратор", Выборка.Событие, Выборка.ПредставлениеРегистратора);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения, ВставляемыеПараметры);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ИнвентарныйНомер");
		Иначе
			ТекстСообщения = НСтр("ru='По выбранному объекту ОС, НМА, НПА уже произведено [ВидСобытияОС] документом [Регистратор]'");
			ВставляемыеПараметры = Новый Структура("ВидСобытияОС, Регистратор", Выборка.Событие, Выборка.ПредставлениеРегистратора);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ТекстСообщения, ВставляемыеПараметры);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновноеСредство");
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли