
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда
		Если Не ПустаяСтрока(Объект.Наименование) И ПустаяСтрока(Объект.НаименованиеПолное) Тогда
			// создание нового из поля выбора
			Объект.НаименованиеПолное = Объект.Наименование;
		КонецЕсли;
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку();
		ПодготовитьФормуНаСервере();
		Если Параметры.ДополнительныеПараметры.Свойство("СчетУчета") Тогда
			Объект.СчетУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ДополнительныеПараметры["СчетУчета"], "Код");
		ИначеЕсли Не ЗначениеЗаполнено(Объект.СчетУчета) И ЗначениеЗаполнено(Объект.ТипНоменклатуры) Тогда
			Объект.СчетУчета = УправлениеМатериальнымиЗапасамиКлиентСервер.КодСчетаПоТипуНоменклатуры(Объект.ТипНоменклатуры);
		КонецЕсли;
		Справочники.Номенклатура.ИнициализироватьХарактеристикиГосуслугиДляРедактированияВФорме(ЭтотОбъект, НоменклатураСсылка);
		Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Госуслуга") Тогда
			ИспользоватьОсновнойШаблон = Истина;
			ОсновнойШаблонНП = Справочники.ШаблоныЗаполненияНПКвитанцииНаОплату.ПолучитьШаблонЗаполнения(Справочники.Номенклатура.ПустаяСсылка());
			ТекШаблонНП = ОсновнойШаблонНП;
			Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
				ПрочитатьДанныеШаблонаНП();
			Иначе
				ЗаполнитьШаблонНПГосуслуги(ТекущаяДатаСеанса());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокВидовКонтроляПродукции();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ДополнительныеСвойства");
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГИСГМП", "Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюГИСГМП"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИСРНИП", "Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьИнтеграциюСУНИФО"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодконтрольнаяПродукцияВЕТИС", "Видимость",
		ПолучитьФункциональнуюОпцию("ВестиУчетПодконтрольныхТоваровВЕТИС"));
		
	ОбновитьДрагоценныеМатериалы();
	
	УстановитьВидимостьКоманд1СНоменклатура("ФормаГруппаСервиса1СНоменклатура");
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	СопоставлениеНоменклатурыКонтрагентов.ПриСозданииФормыНоменклатуры(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтотОбъект, Элементы.ИнформационныеСсылки);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменениеДлиныНаименованияДляЧекаККМ();	
	
	ОбновитьДанныеГруппыПодконтрольнаяПродукция(ЭтаФорма);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Госуслуга") Тогда
		
		ОбщегоНазначенияБГУКлиент.УстановитьРежимИзмененияРегистра(ЭтотОбъект, "РеквизитыГосуслуги");
		
		Если Не ИспользоватьОсновнойШаблон И НЕ ЗначениеЗаполнено(ТекШаблонНП) Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран шаблон назначения платежа.'"));
		КонецЕсли;
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ЗаписьНоменклатура");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Госуслуга") Тогда
		ЗаписатьРеквизитыГосуслуги();
		ЗаписатьШаблонНазначенияПлатежа();
	Иначе
		ПроверитьИУдалитьРеквизитыГосуслуги();
	КонецЕсли;
		
	ЗаписатьСоставНоменклатурнойГруппы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НоменклатураСсылка = ТекущийОбъект.Ссылка;
	ПодготовитьФормуНаСервере();
	ПрочитатьРеквизитыГосуслуги();
	
	ПрочитатьДанныеШаблонаНП();
	
	ПрочитатьСоставНоменклатурнойГруппы();
	
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьДрагоценныеМатериалы();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПрочитатьРеквизитыГосуслуги();
	УстановитьДоступностьИсторииРеквизитовГосуслуги(ЭтотОбъект);
	УстановитьДоступностьСпецификации(ЭтотОбъект);
	УстановитьВидимостьДоступностьВариантовКомплектов(ЭтотОбъект);
	УстановитьДоступностьИсторииПрослеживаемости(ЭтотОбъект);
	
	ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище);

	ИнтеграцияСервиса1СНоменклатураБГУ.ЗаписатьПривязкуНоменклатурыЕдиногоКлассификатора(ТекущийОбъект.Ссылка, НоменклатураЕдиногоКаталога);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеХарактеристикГосуслуги" И Параметр = НоменклатураСсылка Тогда
		
		ПрочитатьРеквизитыГосуслуги();
		
	ИначеЕсли (ИмяСобытия = "ОбновитьДрагМатериалы") ИЛИ 
			(ИмяСобытия = "ДокументыПоУчетуМатериальныхЗапасовИзменение") ИЛИ 
			(ИмяСобытия = "ДокументыПоУчетуОСИзменение") Тогда
		
		ОбновитьДрагоценныеМатериалы();
	КонецЕсли;	
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекущийОбъект.УстановитьСсылкуНового(НоменклатураСсылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Госуслуга") Тогда
		
		Оповестить("ИзменениеХарактеристикГосуслуги", Объект.Ссылка);
		
	КонецЕсли;
	
	ОбновитьДанныеГруппыПодконтрольнаяПродукция(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ПрослеживаемыйТовар Тогда
		
		Если Не ЗначениеЗаполнено(Объект.КодТНВЭД) Тогда
			СообщениеОбОшибке = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'ТН ВЭД'"));
			ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке, , "КодТНВЭД", "Объект", Отказ);
		Иначе
			Если Объект.ВесПоСертификатуТовара = 0 Тогда
				ДанныеЕдиницыПрослеживаемости = ДанныеЕдиницыИзмеренияТНВЭД(Объект.КодТНВЭД);
				ЗаполнятьВесТовараПоСертификату = ЗаполнятьВесТовараПоСертификату(Объект, ДанныеЕдиницыПрослеживаемости);
				Если ЗаполнятьВесТовараПоСертификату Тогда
					СообщениеОбОшибке = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,,НСтр("ru = 'Вес из сертификата'"));
					ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке, , "ВесПоСертификатуТовара", "Объект", Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
							
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	ТипНоменклатурыПриИзмененииНаСервере(ОбщегоНазначенияКлиент.ДатаСеанса());
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(СписокСчетов) И Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ") Тогда 
		ПараметрыФормы = ПараметрыФормыДляВыбораСчета();
	Иначе
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ОграниченияСчета", СчетМЗ);
		ПараметрыФормы.Вставить("КодТекущейСтроки", Объект.СчетУчета);
	КонецЕсли;
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОсновнойШаблонПриИзменении(Элемент)
	Если ИспользоватьОсновнойШаблон Тогда
		ТекШаблонНП = ОсновнойШаблонНП;
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ТекШаблонНП", "АвтоОтметкаНезаполненного", Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекШаблонНППриИзменении(Элемент)
	ИспользоватьОсновнойШаблон = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОКПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("КодТекущейСтроки", Элемент.ТекстРедактирования);
	ОткрытьФорму("Справочник.ОбщероссийскийКлассификаторПродукции.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДляЧекаККМПриИзменении(Элемент)
	ИзменениеДлиныНаименованияДляЧекаККМ();
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеДляЧекаККМИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	ИзменениеДлиныНаименованияДляЧекаККМ(Текст);
КонецПроцедуры

&НаКлиенте
Процедура МетодРаспределенияСтоимостиПроизводстваПриИзменении(Элемент)
	УстановитьВидимостьКоэффициентаРаспределения(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ТипПроизводственнойОперацииПриИзменении(Элемент)
	УстановитьВидимостьИсходногоСырья(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидКонтроляПродукцииПриИзменении(Элемент)
	
	Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПустаяСсылка");
	Объект.ПрослеживаемыйТовар = Ложь;
	Объект.КомплектСПрослеживаемымиТоварами = Ложь;
	
	Если ВидКонтроляПродукции = 2 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Обувь");
	ИначеЕсли ВидКонтроляПродукции = 3 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Табак");
	ИначеЕсли ВидКонтроляПродукции = 4 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ЛегкаяПромышленность");
	ИначеЕсли ВидКонтроляПродукции = 5 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ЛекарственныеПрепараты");
	ИначеЕсли ВидКонтроляПродукции = 6 Тогда
		Объект.ПрослеживаемыйТовар = Истина;
	ИначеЕсли ВидКонтроляПродукции = 7 Тогда
		Объект.КомплектСПрослеживаемымиТоварами = Истина;
	ИначеЕсли ВидКонтроляПродукции = 8 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ФотоОборудование");
	ИначеЕсли ВидКонтроляПродукции = 9 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.МолочнаяПродукция");
	ИначеЕсли ВидКонтроляПродукции = 10 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.УпакованнаяВода");
	ИначеЕсли ВидКонтроляПродукции = 11 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.БАДы");
	ИначеЕсли ВидКонтроляПродукции = 12 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КреслаКоляски");
	ИначеЕсли ВидКонтроляПродукции = 13 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Духи");
	ИначеЕсли ВидКонтроляПродукции = 14 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.СоковаяПродукция");
	ИначеЕсли ВидКонтроляПродукции = 15 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Шины");
	ИначеЕсли ВидКонтроляПродукции = 16 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Велосипеды");
	ИначеЕсли ВидКонтроляПродукции = 17 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Антисептики");
	ИначеЕсли ВидКонтроляПродукции = 18 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Морепродукты");
	ИначеЕсли ВидКонтроляПродукции = 19 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.МедицинскиеИзделия");
	ИначеЕсли ВидКонтроляПродукции = 20 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия");
	ИначеЕсли ВидКонтроляПродукции = 21 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ТехническиеСредстваРеабилитации");
	ИначеЕсли ВидКонтроляПродукции = 22 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.БезалкогольныеНапитки");
	ИначеЕсли ВидКонтроляПродукции = 23 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ВетеринарныеПрепараты");
	ИначеЕсли ВидКонтроляПродукции = 24 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотных");
		
	ИначеЕсли ВидКонтроляПродукции = 25 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ИгрыИИгрушкиДляДетей");
	ИначеЕсли ВидКонтроляПродукции = 26 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.РадиоэлектроннаяПродукция");
	ИначеЕсли ВидКонтроляПродукции = 27 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ТитановаяМеталлопродукция");
	ИначеЕсли ВидКонтроляПродукции = 28 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.РастительныеМасла");
	ИначеЕсли ВидКонтроляПродукции = 29 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ОптоволокноИОптоволоконнаяПродукция");
	ИначеЕсли ВидКонтроляПродукции = 30 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Мясо");
	ИначеЕсли ВидКонтроляПродукции = 31 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПечатнаяПродукция");
	ИначеЕсли ВидКонтроляПродукции = 32 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.СтроительныеМатериалы");
	ИначеЕсли ВидКонтроляПродукции = 33 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ОтопительныеПриборы");
	ИначеЕсли ВидКонтроляПродукции = 34 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Бакалея");
	ИначеЕсли ВидКонтроляПродукции = 35 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ТелефоныИНоутбуки");
	ИначеЕсли ВидКонтроляПродукции = 36 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПиротехническиеИзделияИСредстваПожарнойБезопасности");
	ИначеЕсли ВидКонтроляПродукции = 37 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КабельнаяПродукция");
	ИначеЕсли ВидКонтроляПродукции = 38 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.МоторныеМасла");
	ИначеЕсли ВидКонтроляПродукции = 39 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КонсервированнаяПродукция");
	ИначеЕсли ВидКонтроляПродукции = 40 Тогда
		Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотныхВлажные");
	КонецЕсли;
	
	ПоказатьДополнительныеРеквизитыПоПрослеживаемости(ЭтотОбъект);
	ПоказатьДополнительныеРеквизитыПоМаркировке(ЭтотОбъект);
	УстановитьВидимостьДоступностьВариантовКомплектов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодТНВЭДПриИзменении(Элемент)
	ПриИзмененииЗависимыхРеквизитовПрослеживаемости(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СтранаПроисхожденияПриИзменении(Элемент)
	ПриИзмененииЗависимыхРеквизитовПрослеживаемости(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	ПоказатьДополнительныеРеквизитыПоПрослеживаемости(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыГосуслугиКодОКВЭД2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", 				"Выбор вида деятельности по ОКВЭД");
	ПараметрыФормы.Вставить("НазваниеМакета",  			"ОКВЭД2");
	ПараметрыФормы.Вставить("Префикс",					"Классификатор");
	ПараметрыФормы.Вставить("ИмяРеквизитаКод",  		"КодОКВЭД2");
	ПараметрыФормы.Вставить("ИмяРеквизитаНаименование",	"НаименованиеОКВЭД2");
	
	ВыбратьИзКлассификатора(ПараметрыФормы);
КонецПроцедуры
 
&НаКлиенте
 Процедура ВыбратьИзКлассификатора(ПараметрыФормы)
	 
	 ПараметрыФормы.Вставить("ТекущийПериод",   		?(ЗначениеЗаполнено(РеквизитыГосуслуги.Период),РеквизитыГосуслуги.Период,ТекущаяДата()));
	 ПараметрыФормы.Вставить("ТекущийКод",      		РеквизитыГосуслуги[ПараметрыФормы.ИмяРеквизитаКод]);
	 ПараметрыФормы.Вставить("ВернутьВсеРеквизиты",		Истина);
	 
	 ДополнительныеПараметры = Новый Структура("ИмяРеквизитаКод, ИмяРеквизитаНаименование", ПараметрыФормы.ИмяРеквизитаКод, ПараметрыФормы.ИмяРеквизитаНаименование);
	 
	 ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьИзКлассификатораЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	 
	 ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
	 
 КонецПроцедуры	
 
&НаКлиенте
Процедура ВыбратьИзКлассификатораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		РеквизитыГосуслуги[ДополнительныеПараметры.ИмяРеквизитаКод] = РезультатЗакрытия.Код;
		
		РеквизитыГосуслуги[ДополнительныеПараметры.ИмяРеквизитаНаименование] = РезультатЗакрытия.Наименование;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыГосуслугиКодОКВЭД2ПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(РеквизитыГосуслуги.КодОКВЭД2) Тогда
		РеквизитыГосуслуги.НаименованиеОКВЭД2 = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	Если Объект.СтавкаНДС <> ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		Объект.КодРаздел7ДекларацииНДС = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьЭлементаКодРаздел7ДекларацииНДС(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыКомплектовМЗПТНажатие(Элемент)
	
	Отбор = Новый Структура("Владелец", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.ВариантыКомплектовМЗПТ.ФормаСписка",
	ПараметрыФормы,
	ЭтотОбъект,
	ЭтотОбъект.УникальныйИдентификатор,
	ЭтотОбъект.Окно,
	ЭтотОбъект.НавигационнаяСсылка);

КонецПроцедуры

&НаКлиенте
Процедура КодПоКТРУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.КТРУ.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры  

&НаКлиенте
Процедура КодПоКТРУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗНЧ(ВыбранноеЗначение) = Тип("СправочникСсылка.КТРУ") 
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ВыбранноеЗначение = ПолучитьКодКТРУ(ВыбранноеЗначение);
	КонецЕсли;	 
КонецПроцедуры    

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ ИНФОРМАЦИОННЫЙ ЦЕНТР

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтотОбъект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтотОбъект.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицы_СоставНоменклатурнойГруппы

&НаКлиенте
Процедура СоставНоменклатурнойГруппыПриИзменении(Элемент)
	УстановитьЗаголовокСвернутойГруппыСоставНоменклатурнойГруппы(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьЦеныНоменклатуры(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		ТекстВопроса = НСтр("ru='Сначала нужно записать элемент.
								|Записать?'");
								
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьЦеныНоменклатурыЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
        Возврат;
		
	КонецЕсли;
	
	ОткрытьЦеныНоменклатурыФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦеныНоменклатурыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		
        Возврат;
		
	КонецЕсли;
	
    Записать();
    
    ОткрытьЦеныНоменклатурыФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЦеныНоменклатурыФрагмент()
    
    Перем ПараметрыФормы;
    
    ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Номенклатура", НоменклатураСсылка));
    ОткрытьФорму("РегистрСведений.ЦеныНоменклатуры.ФормаСписка", ПараметрыФормы, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСпецификациюНоменклатуры(Команда)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ТекстВопроса = НСтр("ru='Сначала нужно записать элемент.
								|Записать?'");
								
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьСпецификациюНоменклатурыЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
        Возврат;
		
	КонецЕсли;
	
	ОткрытьСпецификациюНоменклатурыФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСпецификациюНоменклатурыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		
        Возврат;
		
	КонецЕсли;
	
    Записать();
    
    ОткрытьСпецификациюНоменклатурыФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСпецификациюНоменклатурыФрагмент()
    
    ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец", НоменклатураСсылка));
    ОткрытьФорму("Справочник.СпецификацииНоменклатуры.ФормаСписка", ПараметрыФормы, ЭтотОбъект, НоменклатураСсылка);

КонецПроцедуры

&НаКлиенте
Процедура ИсторияРеквизитовГосуслуги(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	Отбор = Новый Структура("Номенклатура", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.ХарактеристикиГосуслуг.ФормаСписка", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкуНоменклатуры(Команда)
	
	Если НЕ ЗначениеЗаполнено(РеквизитыГосуслуги.НастройкаДополнительныхХарактеристикНоменклатуры) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбрана настройка доп. характеристик номенклатуры.'"));
		Возврат;	
	КонецЕсли;
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Текст = НСтр("ru = 'Перед установкой дополнительных параметров, необходимо записать элемент. Записать?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("УстановитьНастройкуНоменклатурыЗавершение", ЭтотОбъект), Текст,РежимДиалогаВопрос.ОКОтмена);
        Возврат;
	КонецЕсли;
	
	УстановитьНастройкуНоменклатурыФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкуНоменклатурыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
        Возврат;
	КонецЕсли;
	
    Записать();
    
    УстановитьНастройкуНоменклатурыФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНастройкуНоменклатурыФрагмент()
    
    ПараметрыФормы = Новый Структура("НастройкаДополнительныхХарактеристикНоменклатуры,Номенклатура,Период",РеквизитыГосуслуги.НастройкаДополнительныхХарактеристикНоменклатуры,Объект.Ссылка,РеквизитыГосуслуги.Период);	
    ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаДополнительныхХарактеристик", ПараметрыФормы);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура НастройкаИспользованияИдентификаторов(Команда)
	
	Если Модифицированность ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Текст = НСтр("ru = 'Перед установкой настройки использования идентификаторов плательщика, необходимо записать элемент. Записать?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("НастройкаИспользованияИдентификаторовЗавершение", ЭтотОбъект), Текст,РежимДиалогаВопрос.ОКОтмена);
        Возврат;
	КонецЕсли;
	
	НастройкаИспользованияИдентификаторовФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИспользованияИдентификаторовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
        Возврат;
	КонецЕсли;
	
    Записать();
    
    НастройкаИспользованияИдентификаторовФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура НастройкаИспользованияИдентификаторовФрагмент()
    
    ПараметрыФормы = Новый Структура("Номенклатура",Объект.Ссылка);	
    ОткрытьФорму("РегистрСведений.НастройкаИспользованияИдентификаторовПлательщика.Форма.ФормаНабораЗаписей", ПараметрыФормы, ЭтотОбъект);
    
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчетОДвиженииДрагМатериалов(Команда)
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ОбъектНФА", Объект.Ссылка);
	ПараметрыОтчета.Вставить("НачалоПериода", '00010101000000');
	ПараметрыОтчета.Вставить("КонецПериода", КонецДня(ОбщегоНазначенияКлиент.ДатаСеанса()));
	
	ПараметрыВыполненияКоманды = Новый Структура;
	ПараметрыВыполненияКоманды.Вставить("Источник", ЭтотОбъект);
	ПараметрыВыполненияКоманды.Вставить("Уникальность", ЭтотОбъект.КлючУникальности);
	
	СформироватьОтчетОДвиженииДрагМатериалов(ПараметрыОтчета, ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЗаполнениеОтчетовПоДрагМатериалам(Команда)
	Отбор = Новый Структура("ОбъектНФА", НоменклатураСсылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор, Истина, Истина);
	ОткрытьФорму("РегистрСведений.НастройкиЗаполненияОтчетовСтатистикиПоДрагМатериалам.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеОДрагМатериалахПоТехническойДокументации(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура;
		Если ЗначениеЗаполнено(ДанныеОДрагМатериалахПоТехДокументации) Тогда
			ПараметрыФормы.Вставить("Ключ", ДанныеОДрагМатериалахПоТехДокументации);
		Иначе
			ПараметрыФормы.Вставить("ОбъектНФА", Объект.Ссылка);
		КонецЕсли;	
		ОткрытьФорму("Справочник.ДрагМатериалыВОбъектахНФАПоТехДокументации.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ИсторияПрослеживаемости(Команда)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", АдресИсторииПрослеживаемостиХранилище);
	ПараметрыФормы.Вставить("НФА", Объект.Ссылка);
	ПараметрыФормы.Вставить("Наименование", Объект.Наименование);
	
	ОписаниеОповещения_Изменение = Новый ОписаниеОповещения("ИсторияПрослеживаемости_Изменение", ЭтотОбъект);

	ОткрытьФорму("ОбщаяФорма.ИсторияПрослеживаемостиНФА",
	ПараметрыФормы,
	ЭтотОбъект,
	,,,
	ОписаниеОповещения_Изменение,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище)
	
	АдресИсторииПрослеживаемостиХранилище = ?(Объект.ИсторияПрослеживаемости.Количество(),
			ПоместитьВоВременноеХранилище(Объект.ИсторияПрослеживаемости.Выгрузить(), УникальныйИдентификатор),"");
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьДополнительныеРеквизитыПоМаркировке(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьКодаGTIN = Ложь;
	Если Форма.ВидКонтроляПродукции = 8 ИЛИ Форма.ВидКонтроляПродукции = 9 ИЛИ Форма.ВидКонтроляПродукции = 10 ИЛИ Форма.ВидКонтроляПродукции = 14
		ИЛИ Форма.ВидКонтроляПродукции = 22 ИЛИ Форма.ВидКонтроляПродукции = 23 ИЛИ Форма.ВидКонтроляПродукции = 24 Тогда
		ВидимостьКодаGTIN = Истина;	
	КонецЕсли;	

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "КодGTIN",
		"Видимость", ВидимостьКодаGTIN);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьДополнительныеРеквизитыПоПрослеживаемости(Форма, ДанныеТНВЭД = Неопределено)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	ПоказыватьВесТовараПоСертификату = Ложь;
	
	Если Форма.ВестиУчетПрослеживаемыхТоваров И ЗначениеЗаполнено(Объект.КодТНВЭД) Тогда
		
		Если ДанныеТНВЭД = Неопределено Тогда
			ДанныеТНВЭД = ДанныеЕдиницыИзмеренияТНВЭД(Объект.КодТНВЭД);
		КонецЕсли;
		
		Если Объект.ПрослеживаемыйТовар Тогда
			Форма.НаименованиеЕдиницыПрослеживаемости = ДанныеТНВЭД.Наименование;
			ПоказыватьВесТовараПоСертификату = ЗаполнятьВесТовараПоСертификату(Объект, ДанныеТНВЭД)
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВесПоСертификатуТовара",
		"Видимость", ПоказыватьВесТовараПоСертификату);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НаименованиеЕдиницыПрослеживаемости",
		"Видимость", ПоказыватьВесТовараПоСертификату);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВесПоСертификатуТовара",
		"АвтоОтметкаНезаполненного", Объект.ВесПоСертификатуТовара = 0);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииЗависимыхРеквизитовПрослеживаемости(Форма)
	
	Объект = Форма.Объект;
	Если Форма.ВестиУчетПрослеживаемыхТоваров И ЗначениеЗаполнено(Объект.КодТНВЭД) Тогда
		ДанныеТНВЭД = ДанныеЕдиницыИзмеренияТНВЭД(Объект.КодТНВЭД);
		
		ПризнакПрослеживаемыйТовар = ?(ДанныеТНВЭД.ПрослеживаемыйТовар,
		ДанныеТНВЭД.ПрослеживаемыйТовар И НЕ ИсключенИзПрослеживаемости(ДанныеТНВЭД.КодТНВЭД, Объект.СтранаПроисхождения),
		ДанныеТНВЭД.ПрослеживаемыйТовар);
		
		Если ПризнакПрослеживаемыйТовар <> Объект.ПрослеживаемыйТовар Тогда
			
			Объект.ПрослеживаемыйТовар = ПризнакПрослеживаемыйТовар;
			
			ОбновитьДанныеГруппыПодконтрольнаяПродукция(Форма);
			ПоказатьДополнительныеРеквизитыПоПрослеживаемости(Форма, ДанныеТНВЭД);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИсключенИзПрослеживаемости(Знач КодТНВЭД, Знач СтранаПроисхождения)
	Возврат Обработки.ПомощникИсключенияНФАИзПрослеживаемости.ИсключенИзПрослеживаемости(КодТНВЭД, СтранаПроисхождения); 
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнятьВесТовараПоСертификату(Объект, ДанныеЕдиницыПрослеживаемости)
	Возврат ДанныеЕдиницыПрослеживаемости.ЕдиницаИзмерения <> Объект.ЕдиницаИзмерения;
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеЕдиницыИзмеренияТНВЭД(Знач КодТНВЭД)

	Результат = Новый Структура("Код, Наименование, КодТНВЭД, ПрослеживаемыйТовар", "", "", "", Ложь);
	Результат.Вставить("ЕдиницаИзмерения", Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторТНВЭД.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КлассификаторТНВЭД.Код КАК КодТНВЭД,
	|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Код, """") КАК Код,
	|	ЕСТЬNULL(КлассификаторТНВЭД.ЕдиницаИзмерения.Наименование, """") КАК Наименование,
	|	КлассификаторТНВЭД.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|ГДЕ
	|	КлассификаторТНВЭД.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", КодТНВЭД);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВидовКонтроляПродукции()

	СписокВыбора = Элементы.ВидКонтроляПродукции.СписокВыбора;
	СписокВыбора.Добавить(0, НСтр("ru = 'Не контролируется'"));
		
	Если Объект.КомплектСПрослеживаемымиТоварами Или ВестиУчетПрослеживаемыхТоваров Тогда
		СписокВыбора.Добавить(7, НСтр("ru = 'Комплект с прослеживаемыми товарами'"));
	КонецЕсли;
	
	Если Объект.ПрослеживаемыйТовар Или ВестиУчетПрослеживаемыхТоваров Тогда
		СписокВыбора.Добавить(6, НСтр("ru = 'Прослеживаемый товар'"));
	КонецЕсли;

	СписокВыбора.Добавить(2, НСтр("ru = 'Маркировка обувной продукции'"));
	СписокВыбора.Добавить(3, НСтр("ru = 'Маркировка табачной продукции'"));
	СписокВыбора.Добавить(4, НСтр("ru = 'Маркировка товаров легкой промышленности и одежды'"));
	СписокВыбора.Добавить(5, НСтр("ru = 'Маркировка лекарственных препаратов'"));
	СписокВыбора.Добавить(8, НСтр("ru = 'Маркировка фотооборудования'"));
	СписокВыбора.Добавить(9, НСтр("ru = 'Маркировка молочной продукции'"));
	СписокВыбора.Добавить(10, НСтр("ru = 'Маркировка упакованной воды'"));
	СписокВыбора.Добавить(11, НСтр("ru = 'Маркировка БАДов'"));
	СписокВыбора.Добавить(12, НСтр("ru = 'Маркировка кресел-колясок'"));
	СписокВыбора.Добавить(13, НСтр("ru = 'Маркировка духов'"));
	СписокВыбора.Добавить(14, НСтр("ru = 'Маркировка соковой продукции'"));
	СписокВыбора.Добавить(15, НСтр("ru = 'Маркировка шин'"));
	СписокВыбора.Добавить(16, НСтр("ru = 'Маркировка велосипедов'"));
	СписокВыбора.Добавить(17, НСтр("ru = 'Маркировка антисептиков'"));
	СписокВыбора.Добавить(18, НСтр("ru = 'Маркировка морепродуктов'"));
	СписокВыбора.Добавить(19, НСтр("ru = 'Маркировка медицинских изделий'"));
	СписокВыбора.Добавить(20, НСтр("ru = 'Маркировка парфюмерных и косметических средствх и бытовой химии'"));
	СписокВыбора.Добавить(21, НСтр("ru = 'Маркировка технических средств реабилитации'"));
	СписокВыбора.Добавить(22, НСтр("ru = 'Маркировка безалкогольных напитков'"));
	СписокВыбора.Добавить(23, НСтр("ru = 'Маркировка ветеринарных препаратов'"));
	СписокВыбора.Добавить(24, НСтр("ru = 'Маркировка кормов для животных'"));
	СписокВыбора.Добавить(25, НСтр("ru = 'Маркировка игр и игрушек для детей'"));
	СписокВыбора.Добавить(26, НСтр("ru = 'Маркировка радиоэлектронной продукции'"));
	СписокВыбора.Добавить(27, НСтр("ru = 'Маркировка титановой металлопродукции'"));
	СписокВыбора.Добавить(28, НСтр("ru = 'Маркировка растительных масел'"));
	СписокВыбора.Добавить(29, НСтр("ru = 'Маркировка оптоволокна и оптоволоконной продукции'"));
	СписокВыбора.Добавить(30, НСтр("ru = 'Маркировка мяса'"));
	СписокВыбора.Добавить(31, НСтр("ru = 'Маркировка печатной продукции'"));
	СписокВыбора.Добавить(32, НСтр("ru = 'Маркировка строительных материалов'"));
	СписокВыбора.Добавить(33, НСтр("ru = 'Маркировка отопительных приборов'"));
	СписокВыбора.Добавить(34, НСтр("ru = 'Маркировка бакалеи'"));
	СписокВыбора.Добавить(35, НСтр("ru = 'Маркировка телефонов и ноутбуков'"));
	СписокВыбора.Добавить(36, НСтр("ru = 'Маркировка пиротехнических изделий и средств пожарной безопасности'"));
	СписокВыбора.Добавить(37, НСтр("ru = 'Маркировка кабельной продукции'"));
	СписокВыбора.Добавить(38, НСтр("ru = 'Маркировка моторных масел'"));
	СписокВыбора.Добавить(39, НСтр("ru = 'Маркировка консервированной продукции'"));
	СписокВыбора.Добавить(40, НСтр("ru = 'Маркировка влажных кормов для животных'"));

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьЭлементаКодРаздел7ДекларацииНДС(Форма)
	
	Форма.Элементы.КодРаздел7ДекларацииНДС.Видимость = (Форма.Объект.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
	
КонецПроцедуры

&НаСервере
Процедура ТипНоменклатурыПриИзмененииНаСервере(ДатаСеанса)
	ЗаполнитьШаблонНПГосуслуги(ДатаСеанса);
	Объект.СчетУчета = УправлениеМатериальнымиЗапасамиКлиентСервер.КодСчетаПоТипуНоменклатуры(Объект.ТипНоменклатуры);
	УстановитьВозможныйСчетМЗ();
	УстановитьВидимостьИДоступностьЭлементов(ЭтотОбъект);
	ОбновитьЭлементыДополнительныхРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблонНПГосуслуги(ДатаСеанса)
	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Госуслуга") Тогда
		Если НЕ ЗначениеЗаполнено(РеквизитыГосуслуги.Период) Тогда
			РеквизитыГосуслуги.Период = ДатаСеанса;
		КонецЕсли;
		ПрочитатьДанныеШаблонаНП();
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИсторииРеквизитовГосуслуги(Форма)
	ЗначениеДоступности = НЕ Форма.Объект.Ссылка.Пустая();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ИсторияРеквизитовГосуслуги",
		"Доступность", ЗначениеДоступности);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИсторииПрослеживаемости(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИсторияПрослеживаемости", "Доступность", Не Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьСпецификации(Форма)
	ЗначениеДоступности = НЕ Форма.Объект.Ссылка.Пустая();
	ИменаЭлементовСпецификации = Новый Массив;
	ИменаЭлементовСпецификации.Добавить("ОткрытьСпецификациюНоменклатуры");
	ИменаЭлементовСпецификации.Добавить("ОсновнаяСпецификацияНоменклатуры");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементовСпецификации, "Доступность", ЗначениеДоступности);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКоэффициентаРаспределения(Форма)

	ВидимостьКоэффициента = Форма.Объект.МетодРаспределенияСтоимостиПроизводства = ПредопределенноеЗначение("Перечисление.МетодыРаспределенияСтоимостиПроизводства.РучноеЗаданиеКоэффициентов");
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоставНоменклатурнойГруппыКоэффициент",
		"Видимость", ВидимостьКоэффициента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоставНоменклатурнойГруппы",
		"Подвал", ВидимостьКоэффициента);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "СоставНоменклатурнойГруппы",
		"Шапка", ВидимостьКоэффициента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьВариантовКомплектов(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ПризнакВидимости = (ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Элементы, "ВидКонтроляПродукции", "Видимость")
		И Объект.КомплектСПрослеживаемымиТоварами);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВариантыКомплектовМЗПТ", "Видимость", ПризнакВидимости);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВариантыКомплектовМЗПТ", "Доступность", Не Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокСвернутойГруппыСоставНоменклатурнойГруппы(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ГруппаСоставНоменклатурнойГруппы",
		"ЗаголовокСвернутогоОтображения",
		СтрШаблон(НСтр("ru = 'Состав номенклатурной группы (выбрано: %1)'"),
			Форма.СоставНоменклатурнойГруппы.Количество()));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыСКонтролемВидовПродукции(ТипНоменклатуры)
	Возврат ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыГруппаПродукцииИлиУслуг(ТипНоменклатуры)
	Возврат ТипНоменклатуры =  ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.НоменклатурнаяГруппа")
		Или ТипНоменклатуры =  ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГруппаУслуг");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыНоменклатурнаяГруппа(ТипНоменклатуры)
	Возврат ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.НоменклатурнаяГруппа");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыСоСтранойПроисходждения(ТипНоменклатуры)
	
	Возврат УправлениеМатериальнымиЗапасамиКлиентСервер.ТипНоменклатурыСоСтранойПроисходждения(ТипНоменклатуры);	
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыСоСчетомУчета(ТипНоменклатуры)

	Возврат УправлениеМатериальнымиЗапасамиКлиентСервер.ТипНоменклатурыСоСчетомУчета(ТипНоменклатуры);
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыСЦеной(ТипНоменклатуры)
	Возврат ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Тара")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ГСМ")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Медикаменты")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МолоднякИЖивотныеНаОткорме")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МягкийИнвентарь")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Оборудование")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Посуда")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПродуктыПитания")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Стройматериалы")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.ПрочиеМЗ")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.УслугиАренды")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
		Или ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыСоСпецификацией(ТипНоменклатуры)
	Возврат ТипНоменклатуры =  ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Блюдо")
		Или ТипНоменклатуры =  ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Продукция");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыБСО(ТипНоменклатуры)
	Возврат ТипНоменклатуры =  ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БСО");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыБА(ТипНоменклатуры)
	Возврат ТипНоменклатуры =  ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.БиологическиеАктивы");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипНоменклатурыГосуслуга(ТипНоменклатуры)
	Возврат ТипНоменклатуры =  ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Госуслуга");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьЭлементовПоТипуНоменклатуры(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ВидимостьБСО = ТипНоменклатурыБСО(Объект.ТипНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "БСО", "Видимость", ВидимостьБСО);
	
	ВидимостьИнвНомера = ТипНоменклатурыБА(Объект.ТипНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ИнвентарныйНомер", "Видимость", ВидимостьИнвНомера);
	
	ВидимостьСчетаУчета = ТипНоменклатурыСоСчетомУчета(Объект.ТипНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СчетУчета", "Видимость", ВидимостьСчетаУчета);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВключитьВСоставВнеоборотныхАктивов",
		"Видимость", ВидимостьСчетаУчета И Не ТипНоменклатурыБА(Объект.ТипНоменклатуры));
	
	ВидимостьСоставаГруппы = ТипНоменклатурыГруппаПродукцииИлиУслуг(Объект.ТипНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СоставНоменклатурнойГруппы", "Видимость", ВидимостьСоставаГруппы);
	УстановитьВидимостьКоэффициентаРаспределения(Форма);
	
	ВидимостьПроизводственныхРеквизитов = ТипНоменклатурыНоменклатурнаяГруппа(Объект.ТипНоменклатуры);
	ИменаЭлементовПроизводственныхРеквизитов = Новый Массив;
	ИменаЭлементовПроизводственныхРеквизитов.Добавить("ТипПроизводственнойОперации");
	ИменаЭлементовПроизводственныхРеквизитов.Добавить("МетодРаспределенияСтоимостиПроизводства");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовПроизводственныхРеквизитов, "Видимость", ВидимостьПроизводственныхРеквизитов);
	УстановитьВидимостьИсходногоСырья(Форма);
	
	ВидимостьСтраны     = ТипНоменклатурыСоСтранойПроисходждения(Объект.ТипНоменклатуры);
	ИменаЭлементовСтраны = Новый Массив;
	ИменаЭлементовСтраны.Добавить("СтранаПроисхождения");
	ИменаЭлементовСтраны.Добавить("НомерГТД");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовСтраны, "Видимость", ВидимостьСтраны);
	
	ВидимостьЦены		  = ТипНоменклатурыСЦеной(Объект.ТипНоменклатуры); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОткрытьЦеныНоменклатуры", "Видимость", ВидимостьЦены);
	
	ВидимостьСпецификации = ТипНоменклатурыСоСпецификацией(Объект.ТипНоменклатуры);
	ИменаЭлементовСпецификации = Новый Массив;
	ИменаЭлементовСпецификации.Добавить("ОткрытьСпецификациюНоменклатуры");
	ИменаЭлементовСпецификации.Добавить("ОсновнаяСпецификацияНоменклатуры");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовСпецификации, "Видимость", ВидимостьСпецификации);
	
	ИменаЭлементовГосЗакупки = Новый Массив;
	ИменаЭлементовГосЗакупки.Добавить("КодКаталога");
	ИменаЭлементовГосЗакупки.Добавить("КодПоКТРУ");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовГосЗакупки, "Видимость",
		Не ТипНоменклатурыГруппаПродукцииИлиУслуг(Объект.ТипНоменклатуры));
	
	ВидимостьВидовКонтроляПродукции = ТипНоменклатурыСКонтролемВидовПродукции(Объект.ТипНоменклатуры);
	ИменаЭлементовКонтроляПродукции = Новый Массив;
	ИменаЭлементовКонтроляПродукции.Добавить("ВидКонтроляПродукции");
	ИменаЭлементовКонтроляПродукции.Добавить("ГруппаВидКонтроля");
	ИменаЭлементовКонтроляПродукции.Добавить("КодВидаНоменклатурнойКлассификации");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовКонтроляПродукции, "Видимость", ВидимостьВидовКонтроляПродукции);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
	Элементы,
	"ИсторияПрослеживаемости",
	"Видимость",
	Форма.ВестиУчетПрослеживаемыхТоваров И ВидимостьВидовКонтроляПродукции);
	
	СодержатДрагМатериалы = Форма.ТипыНоменклатурыБезДрагМатериалов.НайтиПоЗначению(Объект.ТипНоменклатуры) = Неопределено;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДрагМатериалы", "Видимость", СодержатДрагМатериалы);
	
	ЭтоГосУслуга = ТипНоменклатурыГосуслуга(Объект.ТипНоменклатуры);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвойстваГосуслуги", "Видимость", ЭтоГосУслуга);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СвойстваМПЗ", "Видимость", НЕ ЭтоГосУслуга);
	Если ЭтоГосУслуга Тогда
		УстановитьДоступностьИсторииРеквизитовГосуслуги(Форма);
	КонецЕсли;
	
	ВидимостьПризнакаРаботыСПрослеживаемымиТоварами = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
		И Форма.ВестиУчетПрослеживаемыхТоваров;
	
	ИменаЭлементовПрослеживаемыеРаботы = Новый Массив;
	ИменаЭлементовПрослеживаемыеРаботы.Добавить("ГруппаПрослеживаемаяРабота");
	ИменаЭлементовПрослеживаемыеРаботы.Добавить("КомплектСПрослеживаемымиТоварами");
	ИменаЭлементовПрослеживаемыеРаботы.Добавить("ИсторияПрослеживаемостиРаботы");

	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовПрослеживаемыеРаботы, "Видимость", ВидимостьПризнакаРаботыСПрослеживаемымиТоварами);
	
	НастроитьВидимостьЭлементаКодРаздел7ДекларацииНДС(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	
	УстановитьДоступностьСпецификации(Форма);
	Если ТипНоменклатурыГосуслуга(Форма.Объект.ТипНоменклатуры) Тогда
		УстановитьДоступностьИсторииРеквизитовГосуслуги(Форма);
	КонецЕсли;
	
	УстановитьДоступностьИсторииПрослеживаемости(Форма)
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьИДоступностьЭлементов(Форма)
	
	ВидимостьЭлементовПоТипуНоменклатуры(Форма);
	УстановитьВидимостьДоступностьВариантовКомплектов(Форма);
	УстановитьДоступностьЭлементов(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьИсходногоСырья(Форма)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ИсходноеСырье", "Видимость",
		Форма.Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.НоменклатурнаяГруппа")
		И Форма.Объект.ТипПроизводственнойОперации = ПредопределенноеЗначение("Перечисление.ТипыПроизводственныхОпераций.Разделка"));
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСоставНоменклатурнойГруппы()

	Регистр = РегистрыСведений.СоставНоменклатурныхГрупп.СоздатьНаборЗаписей();
	Регистр.Отбор.НоменклатурнаяГруппа.Установить(НоменклатураСсылка);
	Регистр.Прочитать();
	
	ЗначениеВРеквизитФормы(Регистр, "СоставНоменклатурнойГруппы");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСоставНоменклатурнойГруппы()
	
	Регистр = РеквизитФормыВЗначение("СоставНоменклатурнойГруппы");
	Регистр.Отбор.НоменклатурнаяГруппа.Установить(НоменклатураСсылка);
	Для Каждого СтрокаРегистра Из Регистр Цикл
		СтрокаРегистра.НоменклатурнаяГруппа = НоменклатураСсылка;
	КонецЦикла;
	Регистр.Записать();		
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРеквизитыГосуслуги()

	Справочники.Номенклатура.ЗаписатьХарактеристикиГосуслугиПослеРедактированияВФорме(ЭтотОбъект, НоменклатураСсылка);

КонецПроцедуры

&НаСервере
Процедура ЗаписатьШаблонНазначенияПлатежа()
    //Перед записью необходимо выполнять проверку, что если не ИспользоватьОсновнойШаблон, 
	//то ТекШаблонНП должен быть заполнен
	//  
	Запись = РегистрыСведений.ШаблоныНазначенияПлатежаКвитанцииНаОплатуГосУслуг.СоздатьМенеджерЗаписи();
	Запись.Номенклатура = Объект.Ссылка;
	Если ЗначениеЗаполнено(ИспользуемыйШаблонНП) Тогда
		//Запись уже есть
		
		Запись.Прочитать();
		Если ИспользоватьОсновнойШаблон Тогда
			//Надо удалить имеющуюся запись
			Запись.Удалить();
		Иначе
			Если ИспользуемыйШаблонНП <> ТекШаблонНП Тогда
				//Записать новое значение
				Запись.Шаблон = ТекШаблонНП;
				Запись.Записать(Истина);
			КонецЕсли;	
		КонецЕсли;
	Иначе
		//Записи нет
		Если ИспользоватьОсновнойШаблон Тогда
			//Ничего не делаем
		Иначе
			Запись.Шаблон = ТекШаблонНП;
			Запись.Записать(Истина);
		КонецЕсли;
	КонецЕсли;
	ПрочитатьДанныеШаблонаНП();		
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеШаблонаНП()
	Если Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Госуслуга Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШаблоныНазначенияПлатежаКвитанцииНаОплатуГосУслуг.Номенклатура,
			|	ШаблоныНазначенияПлатежаКвитанцииНаОплатуГосУслуг.Шаблон
			|ИЗ
			|	РегистрСведений.ШаблоныНазначенияПлатежаКвитанцииНаОплатуГосУслуг КАК ШаблоныНазначенияПлатежаКвитанцииНаОплатуГосУслуг
			|ГДЕ
			|	ШаблоныНазначенияПлатежаКвитанцииНаОплатуГосУслуг.Номенклатура В(&Номенклатура)";
			
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Объект.Ссылка);
		МассивНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
		Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) Тогда
				ИспользуемыйШаблонНП = ВыборкаДетальныеЗаписи.Шаблон;
			Иначе
				ОсновнойШаблонНП = ВыборкаДетальныеЗаписи.Шаблон;
			КонецЕсли;				
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ИспользуемыйШаблонНП) Тогда
			ТекШаблонНП = ИспользуемыйШаблонНП;
		Иначе
			ТекШаблонНП = ОсновнойШаблонНП;
			ИспользоватьОсновнойШаблон = Истина;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьИУдалитьРеквизитыГосуслуги();
	
	Справочники.Номенклатура.ПроверитьИУдалитьРеквизитыГосуслуги(НоменклатураСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРеквизитыГосуслуги();
	
	Справочники.Номенклатура.ПрочитатьХарактеристикиГосуслугиДляРедактированияВФорме(ЭтотОбъект, НоменклатураСсылка, "РеквизитыГосуслуги");
	ПериодНастройкиИД = РегистрыСведений.НастройкаИспользованияИдентификаторовПлательщика.ПолучитьПериодАктуальныхНастроек(НоменклатураСсылка);
	Если ЗначениеЗаполнено(ПериодНастройкиИД) Тогда
		ТекстЗаголовка = Нстр("ru='Настройка использования идентификаторов от %1'");
		ТекстЗаголовка = СтрШаблон(ТекстЗаголовка, Формат(ПериодНастройкиИД, "ДФ=dd.MM.yyyy"));
	Иначе
		ТекстЗаголовка = НСтр("ru='Задать настройку использования идентификаторов'");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НастройкаИспользованияИдентификаторов",
		"Заголовок", );
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодКТРУ(СсылкаКТРУ)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаКТРУ, "Код");
КонецФункции	

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
      УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область УчетДрагМатериалов

&НаСервере
Процедура ОбновитьДрагоценныеМатериалы()

	ЭтотОбъект.ДрагоценныеМатериалы.Загрузить(УчетДрагМатериалов.СписокДрагМатериаловОбъектаМЗ(Объект.Ссылка, ТекущаяДатаСеанса()));	

	ЭтотОбъект.ТипыНоменклатурыОтчетовДрагМатериалов.Загрузить(УчетДрагМатериалов.СписокНастроекОтчетовДрагМатериаловОбъектаМЗ(Объект.Ссылка, ТекущаяДатаСеанса()));	

	ДанныеОДрагМатериалахПоТехДокументации = УчетДрагМатериалов.ДанныеОДрагМатериалахПоПаспортуДляОбъектаНФА(Объект.Ссылка);
	
	СводноПоТехПаспорту = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОДрагМатериалахПоТехДокументации, "Наименование");

	Если ЗначениеЗаполнено(СводноПоТехПаспорту) Тогда
		ШаблонСтрокиОбщий = НСтр("ru = 'по документации: %1'");
		СведенияОДрагМатериалахВОбъектеНФАПоТехДокументации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтрокиОбщий, 
			СводноПоТехПаспорту);
	КонецЕсли;	
	
КонецПроцедуры // ОбновитьДрагоценныеМатериалы()

&НаКлиенте
Процедура СформироватьОтчетОДвиженииДрагМатериалов(ПараметрыОтчета, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии, КлючВарианта");
	ПараметрыФормы.Отбор                       = ПараметрыОтчета;
	ПараметрыФормы.КлючНазначенияИспользования = "ОтчетПоДрагоценнымМатериаламМЗ";
	ПараметрыФормы.СформироватьПриОткрытии     = Истина;
	ПараметрыФормы.КлючВарианта                = "ОтчетПоДрагоценнымМатериаламМЗ";
	
	ОткрытьФорму("Отчет.ОтчетОДвиженииДрагМатериалов.Форма", 
	                ПараметрыФормы, 
	                ПараметрыВыполненияКоманды.Источник, 
	                ПараметрыВыполненияКоманды.Уникальность);	
		
КонецПроцедуры	

#КонецОбласти

&НаКлиенте
Процедура ИзменениеДлиныНаименованияДляЧекаККМ(ТекстНаименования = Неопределено)
	
	Если ТекстНаименования = Неопределено Тогда
		ТекстНаименования = Объект.НаименованиеДляЧекаККМ;
	КонецЕсли;	
	
	ДлинаПоля = СтрДлина(СокрП(ТекстНаименования));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДлинаНаименованияДляЧекаККМ",
		"Заголовок", СтрШаблон(НСтр("ru = '%1 симв.'"), Формат(ДлинаПоля, "ЧЦ=3; ЧН=0; ЧГ=0")));
	
КонецПроцедуры

#Область КлассификацияТоваровИУслуг

&НаКлиенте
Процедура ЗаполнитьПоДаннымСервиса1СНоменклатура(Команда)
	
	Отбор = Новый Структура("ТипНоменклатурыКаталога", ПредопределенноеЗначение("Перечисление.ТипыНоменклатурыЕдиногоКаталогаТоваровИУслуг.НоменклатураСервиса"));
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, РежимВыбора, ЗакрыватьПриВыборе, МножественныйВыбор, ТекущаяСтрока",
		Отбор, Истина, Истина, Истина, Ложь, НоменклатураЕдиногоКаталога);
	ОткрытьФорму("Справочник.ЕдиныйКаталогОписанийТоваровИУслуг.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЕдиныйКаталогОписанийТоваровИУслуг") Тогда
		НоменклатураЕдиногоКаталога = ВыбранноеЗначение;
		ИзмененТипНоменклатуры = Ложь;
		ЗаполнитьПоДаннымСервиса1СНоменклатураНаСервере(НоменклатураЕдиногоКаталога, ИзмененТипНоменклатуры);
		Если ИзмененТипНоменклатуры Тогда
			УстановитьВидимостьИДоступностьЭлементов(ЭтотОбъект);
			Объект.СчетУчета = УправлениеМатериальнымиЗапасамиКлиентСервер.КодСчетаПоТипуНоменклатуры(Объект.ТипНоменклатуры);
			ОбновитьЭлементыДополнительныхРеквизитов();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ВыбранноеЗначение)	= Тип("Массив") Тогда
		Если ВыбранноеЗначение.Количество() > 0 Тогда
			Если ТипЗнч(ВыбранноеЗначение[0]) = Тип("СправочникСсылка.ЕдиныйКаталогОписанийТоваровИУслуг") Тогда 
				
				СписокНоменклатурыЕдиногоКаталога = ВыбранноеЗначение;
				УстановитьСоответствиеНоменклатуреСервисаНаСервере(СписокНоменклатурыЕдиногоКаталога);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДаннымСервиса1СНоменклатураНаСервере(Знач НоменклатураИсточникДанных, ИзмененТипНоменклатуры)
	НоменклатураКаталога = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураИсточникДанных, "НоменклатураКаталога");
	СведенияНоменклатураКаталога = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоменклатураКаталога,
		"Наименование, СтавкаНДС, ЕдиницаИзмерения, КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения,
		|КатегорияНоменклатуры, НаименованиеДляПечати, КодТипаНоменклатуры, Артикул");
	
	ЗаполнитьЗначениясвойств(Объект, СведенияНоменклатураКаталога);
	Объект.НаименованиеПолное = СведенияНоменклатураКаталога.Наименование;
	Объект.НаименованиеДляЧекаККМ = СведенияНоменклатураКаталога.НаименованиеДляПечати;
	Если СведенияНоменклатураКаталога.КодТипаНоменклатуры = 1 Тогда
		Если НЕ Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Объект.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
			ИзмененТипНоменклатуры = Истина;
		КонецЕсли;
		Объект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Услуга;
	ИначеЕсли СведенияНоменклатураКаталога.КодТипаНоменклатуры = 0 Тогда
		Объект.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.Товар;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.ЕдиницаИзмерения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В справочнике единиц измерения отсутствует элемент с наименованием ""%2"" (код № %1)"". Требуется добавить новый элемент и указать единицу измерения вручную.'"),
			СведенияНоменклатураКаталога.КодЕдиницыИзмерения, СведенияНоменклатураКаталога.НаименованиеЕдиницыИзмерения);
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСоответствиеНоменклатуреСервиса(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Установить соответствие возможно только после записи элемента справочника.'"));
		Возврат;	
	КонецЕсли;
	
	Отбор = Новый Структура("ТипНоменклатурыКаталога", ПредопределенноеЗначение("Перечисление.ТипыНоменклатурыЕдиногоКаталогаТоваровИУслуг.НоменклатураСервиса"));
	ПараметрыФормы = Новый Структура("Отбор, ЗакрыватьПриЗакрытииВладельца, РежимВыбора, ЗакрыватьПриВыборе, МножественныйВыбор",
		Отбор, Истина, Истина, Истина, Истина);
	ОткрытьФорму("Справочник.ЕдиныйКаталогОписанийТоваровИУслуг.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСоответствиеНоменклатуреСервисаНаСервере(СписокНоменклатурыЕдиногоКаталога)
	Для каждого ТекСтрока Из СписокНоменклатурыЕдиногоКаталога Цикл
		ИнтеграцияСервиса1СНоменклатураБГУ.ЗаписатьПривязкуНоменклатурыЕдиногоКлассификатора(Объект.Ссылка, ТекСтрока);
	КонецЦикла;
		
КонецПроцедуры	

&НаКлиенте
Процедура НастроитьКлассификациюСервиса1СНоменклатура(Команда)
	
	Отбор = Новый Структура("Номенклатура", НоменклатураСсылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор, Истина, Истина);
	ОткрытьФорму("РегистрСведений.НастройкаСоответствияНоменклатуреСервиса.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКоманд1СНоменклатура(НаименованиеГруппыКомандСервиса)
	ЕстьПравоДоступа = ПравоДоступа("Чтение", Метаданные.Справочники.ЕдиныйКаталогОписанийТоваровИУслуг);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, НаименованиеГруппыКомандСервиса, 
		"Видимость", ЕстьПравоДоступа);
КонецПроцедуры

#КонецОбласти

#Область ПодконтрольнаяПродукция

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДанныеГруппыПодконтрольнаяПродукция(Форма)
	
	Объект = Форма.Объект;
	
	Если Объект.ПрослеживаемыйТовар Тогда
		Форма.ВидКонтроляПродукции = 6;
	ИначеЕсли Объект.КомплектСПрослеживаемымиТоварами Тогда
		Форма.ВидКонтроляПродукции = 7;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Обувь") Тогда
		Форма.ВидКонтроляПродукции = 2;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Табак") Тогда
		Форма.ВидКонтроляПродукции = 3;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ЛегкаяПромышленность") Тогда
		Форма.ВидКонтроляПродукции = 4;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ЛекарственныеПрепараты") Тогда
		Форма.ВидКонтроляПродукции = 5;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ФотоОборудование") Тогда
		Форма.ВидКонтроляПродукции = 8;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.МолочнаяПродукция") Тогда
		Форма.ВидКонтроляПродукции = 9;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.УпакованнаяВода") Тогда
		Форма.ВидКонтроляПродукции = 10;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.БАДы") Тогда
		Форма.ВидКонтроляПродукции = 11;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КреслаКоляски") Тогда
		Форма.ВидКонтроляПродукции = 12;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Духи") Тогда
		Форма.ВидКонтроляПродукции = 13;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.СоковаяПродукция") Тогда
		Форма.ВидКонтроляПродукции = 14;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Шины") Тогда
		Форма.ВидКонтроляПродукции = 15;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Велосипеды") Тогда
		Форма.ВидКонтроляПродукции = 16;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Антисептики") Тогда
		Форма.ВидКонтроляПродукции = 17;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Морепродукты") Тогда
		Форма.ВидКонтроляПродукции = 18;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.МедицинскиеИзделия") Тогда
		Форма.ВидКонтроляПродукции = 19;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия") Тогда
		Форма.ВидКонтроляПродукции = 20;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ТехническиеСредстваРеабилитации") Тогда
		Форма.ВидКонтроляПродукции = 21;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.БезалкогольныеНапитки") Тогда
		Форма.ВидКонтроляПродукции = 22;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ВетеринарныеПрепараты") Тогда
		Форма.ВидКонтроляПродукции = 23;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотных") Тогда
		Форма.ВидКонтроляПродукции = 24; 
		
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ИгрыИИгрушкиДляДетей") Тогда
		Форма.ВидКонтроляПродукции = 25;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.РадиоэлектроннаяПродукция") Тогда
		Форма.ВидКонтроляПродукции = 26;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ТитановаяМеталлопродукция") Тогда
		Форма.ВидКонтроляПродукции = 27;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.РастительныеМасла") Тогда
		Форма.ВидКонтроляПродукции = 28;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ОптоволокноИОптоволоконнаяПродукция") Тогда
		Форма.ВидКонтроляПродукции = 29;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Мясо") Тогда
		Форма.ВидКонтроляПродукции = 30;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПечатнаяПродукция") Тогда
		Форма.ВидКонтроляПродукции = 31;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.СтроительныеМатериалы") Тогда
		Форма.ВидКонтроляПродукции = 32;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ОтопительныеПриборы") Тогда
		Форма.ВидКонтроляПродукции = 33;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.Бакалея") Тогда
		Форма.ВидКонтроляПродукции = 34;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ТелефоныИНоутбуки") Тогда
		Форма.ВидКонтроляПродукции = 35;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.ПиротехническиеИзделияИСредстваПожарнойБезопасности") Тогда
		Форма.ВидКонтроляПродукции = 36;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КабельнаяПродукция") Тогда
		Форма.ВидКонтроляПродукции = 37;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.МоторныеМасла") Тогда
		Форма.ВидКонтроляПродукции = 38;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КонсервированнаяПродукция") Тогда
		Форма.ВидКонтроляПродукции = 39;
	ИначеЕсли Объект.ВидМаркируемойПродукции = ПредопределенноеЗначение("Перечисление.ВидыМаркируемойПродукции.КормаДляЖивотныхВлажные") Тогда
		Форма.ВидКонтроляПродукции = 40;
	Иначе
		Форма.ВидКонтроляПродукции = 0;
	КонецЕсли;
	
	ПоказатьДополнительныеРеквизитыПоМаркировке(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура КодВидаНоменклатурнойКлассификацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборИзПеречняСИЗ", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьВыборКодаВидаНоменклатурнойКлассификации(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзПеречняСИЗ(РезультатВыбора, ДополнительныеПараметры) Экспорт

	Если Не РезультатВыбора = Неопределено Тогда 
		Объект.КодВидаНоменклатурнойКлассификации = РезультатВыбора.КодВидаНоменклатурнойКлассификации;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ВестиУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров("");
	УстановитьВозможныйСчетМЗ();
	ЗаполнитьСписокСчетов();
	ТипыНоменклатурыБезДрагМатериалов.ЗагрузитьЗначения(УчетДрагМатериалов.ПолучитьМассивТиповНоменклатурыБезДрагМатериалов());
	УстановитьВидимостьИДоступностьЭлементов(ЭтотОбъект);
	УстановитьЗаголовокСвернутойГруппыСоставНоменклатурнойГруппы(ЭтотОбъект);
	ПоказатьДополнительныеРеквизитыПоПрослеживаемости(ЭтотОбъект);
	ПоказатьДополнительныеРеквизитыПоМаркировке(ЭтотОбъект);
	УстановитьВидимостьУстаревшихРеквизитов();
	ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище);

КонецПроцедуры

&НаСервере
Процедура УстановитьВозможныйСчетМЗ()

	Если ТипНоменклатурыБА(Объект.ТипНоменклатуры) Тогда
		СчетМЗ = БухгалтерскийУчет.СчетПоКоду("113.00", ТекущаяДатаСеанса());
	Иначе
		СчетМЗ = БухгалтерскийУчет.СчетПоКоду("105.00", ТекущаяДатаСеанса());
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьУстаревшихРеквизитов()
	
	Если ЗначениеЗаполнено(Объект.КодТНВЭД) ИЛИ НЕ ЗначениеЗаполнено(Объект.УдалитьКодТНВЭД) Тогда
		ВидимостьУдалитьТНВЭД = Ложь;
	Иначе
		ВидимостьУдалитьТНВЭД = Истина;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "УдалитьКодТНВЭД",
		"Видимость", ВидимостьУдалитьТНВЭД);
	
	НевидимыеУдалитьОКП = Новый Массив;
	Если ЗначениеЗаполнено(Объект.ОКП) Тогда
		НевидимыеУдалитьОКП.Добавить("УдалитьОКП");
		НевидимыеУдалитьОКП.Добавить("УдалитьКодОКПД2");
	Иначе
		Если Не ЗначениеЗаполнено(Объект.УдалитьОКП) Тогда
			НевидимыеУдалитьОКП.Добавить("УдалитьОКП");
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.УдалитьКодОКПД2) Тогда
			НевидимыеУдалитьОКП.Добавить("УдалитьКодОКПД2");
		КонецЕсли;
	КонецЕсли;
	Если НевидимыеУдалитьОКП.Количество() > 0 Тогда
		ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, НевидимыеУдалитьОКП,
			"Видимость", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСчетов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕПСБУ.Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ЕПСБУ.Ссылка В ИЕРАРХИИ (&Счет)
	|	И НЕ ЕПСБУ.ЭлементГруппа";
	
	Счета = Новый Массив;
	Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("105.00", ТекущаяДатаСеанса()));
	
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоРеализацииТоваровУслугКомитентов") Тогда
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("02.33", ТекущаяДатаСеанса()));
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоЗакупкеТоваровУслугДляКомитентов") Тогда
		Счета.Добавить(БухгалтерскийУчет.СчетПоКоду("02.34", ТекущаяДатаСеанса()));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Счет", Счета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокСчетов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

Функция ПараметрыФормыДляВыбораСчета()

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОграниченияСписокСчетов", СписокСчетов);
	ПараметрыФормы.Вставить("ВидСравненияВСписке",     Истина);
	ПараметрыФормы.Вставить("НаДату",                  ТекущаяДатаСеанса());
	
	Возврат ПараметрыФормы;

КонецФункции

&НаКлиенте
Процедура ИсторияПрослеживаемости_Изменение(НоваяИстория, ПараметрыОповещения) Экспорт
	
	Если НоваяИстория <> Неопределено Тогда
		ЭтаФорма.Модифицированность = Истина;
		ИсторияПрослеживаемости_ИзменениеСервер(НоваяИстория);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИсторияПрослеживаемости_ИзменениеСервер(НоваяИстория)
	
	Объект.ИсторияПрослеживаемости.Очистить();
	Объект.ИсторияПрослеживаемости.Загрузить(НоваяИстория.Выгрузить());
	ПоместитьИсториюПрослеживаемостиВХранилище(АдресИсторииПрослеживаемостиХранилище);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
