#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|	ПО ЭтотСписок.Контрагент.ЮридическоеФизическоеЛицо = Пользователи.ФизическоеЛицо
	|
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Пользователи.Ссылка, NULL КАК ИСТИНА)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписание(
	Описание, 
	ДокументСсылка, 
	Форма.Элементы.Контрагент,
	ДокументОбъект.Контрагент,
	Форма.Элементы.ГруппаКонтрагент);
	
КонецПроцедуры

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции  

// Возвращает массив структур, содержащих значения реквизитов документа для выгрузки
//
// Параметры:
// МассивОбъектов               - Массив объектов данного вида
// ИспользоватьДопКл            - Признак применения доп. классификации и указании ее значений в структурах реквизитов документов
// ИспользоватьКодМероприятия   - Признак применения кодов мероприятий
// ИспользоватьКЭК              - Признак использования КЭК
// ИспользоватьАналитическийКод - Признак использования аналитического кода
// ИспользоватьКФО              - Признак применения КФО и указания значений КФО в структурах реквизитов документа
// ИспользоватьКОСГУПолучателя  - Признак использования КОСГУПолучателя
Функция ЗначенияРеквизитовДокумента(МассивОбъектов, ИспользоватьДопКл = Ложь, ИспользоватьКодМероприятия = Ложь, ИспользоватьКЭК = Ложь, ИспользоватьАналитическийКод = Ложь, ИспользоватьКФО = Ложь, ИспользоватьКОСГУПолучателя = Ложь) Экспорт  
	
	Возврат ПлатежноРасчетныеДокументы.ЗначенияРеквизитовЗаявкаНаКассовыйРасход(МассивОбъектов, ИспользоватьДопКл, ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьАналитическийКод, ИспользоватьКФО, ИспользоватьКОСГУПолучателя);
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//  Возвращает сведения о записи в регистре сведенеий "СостояниеПлатежноРасчетныхДокументов"
//    Входящие параметры: Ссылка - тип ссылка на документ "Уведомление об уточнении операции клиента"
//    Исходящие параметры: 
Функция ПолучитьСостояниеДокумента(Ссылка) экспорт
	СтруктураРеквизитов = Новый Структура;
	ПоляВыборки = "";
	//  Струкутра реквизитов динамическая, т.к. со временем может понадобится новый ресурс в регистр
	//  что-бы его не забыть будем каждый раз перебирать ресурсы регистра
	Для каждого Ресурс из Метаданные.РегистрыСведений.СостояниеПлатежноРасчетныхДокументов.Ресурсы цикл
		СтруктураРеквизитов.Вставить(Ресурс.Имя);
		ПоляВыборки = ПоляВыборки + "
		|	Состояние." + Ресурс.Имя + " КАК " + Ресурс.Имя + ", "
	КонецЦикла;	
	//  Добавка ввиде реквизита "ПервичныйОбразИРеквизиты"
	СтруктураРеквизитов.Вставить("ПервичныйОбразИРеквизиты");		
	ПоляВыборки = ПоляВыборки + "
	|	Состояние.ПервичныйОбразИРеквизиты КАК ПервичныйОбразИРеквизиты ";
	
	Если ТипЗнч(Ссылка) <> Тип("ДокументСсылка.ЗаявкаНаКассовыйРасход") тогда
		Возврат СтруктураРеквизитов;
	КонецЕсли;	
		
	ТекстЗапроса = "ВЫБРАТЬ " + ПоляВыборки + "
					|ИЗ	
					|	РегистрСведений.СостояниеПлатежноРасчетныхДокументов КАК Состояние
					|ГДЕ 
					|	Состояние.ПлатежноРасчетныйДокумент = &Ссылка";
						
	Запрос = Новый Запрос(ТекстЗапроса);				
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
		
	Для каждого КлючЗначение из СтруктураРеквизитов Цикл
		ТекРеквизит = КлючЗначение.Ключ;
		СтруктураРеквизитов[ТекРеквизит] = Выборка[ТекРеквизит];
	КонецЦикла;	
		
	Возврат СтруктураРеквизитов;
КонецФункции	

// Заполняет реквизиты документа на основании указанного расчетного счета получателя 
// Входящие параметры: Объект - тип ссылка на документ "Заявка на кассовый расход"
Процедура ЗаполнитьРеквизитыПолучателя(Объект) экспорт
	
	РеквизитыПолучателя = Новый Структура("КонтрагентИНН, КонтрагентКПП, КонтрагентНаименование, КонтрагентБанковскийСчет, КонтрагентНаименованиеБанка, КонтрагентБИКБанка, КонтрагентКорСчетБанка",
	"ИНН", "КПП", "Корреспондент", "СчетНомер", "Банк", "БИК", "КоррСчет");
	                                                                                                                                    
	ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(Объект.СчетКонтрагента, Объект.СчетКонтрагента, РеквизитыПолучателя);
	
	СтруктураРеквизитов = Новый Структура("ТипЛицевогоСчета, Код"); 
    СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.СчетКонтрагента, СтруктураРеквизитов);
	
	Если СтруктураРеквизитов.ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский Тогда
		РеквизитыПолучателя.Вставить("КонтрагентЛицевойСчет",СтруктураРеквизитов.Код);
	Иначе
		РеквизитыПолучателя.Вставить("КонтрагентЛицевойСчет","");
	КонецЕсли;	
    
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыПолучателя);
		
КонецПроцедуры  

Процедура ЗаполнитьРеквизитыИногоПлательщика(Объект) Экспорт    
	
	ДатаСведений = ТекущаяДатаСеанса(); 
	
	Объект.ИнойПлательщикИНН            = "";
	Объект.ИнойПлательщикКПП            = "";  
	Объект.ИнойПлательщиеНаименование   = "";
	Объект.ИнойПлательщиеПризнак        = "";    
	Объект.ИнойПлательщикВидДокумента   = "";
	Объект.ИнойПлательщикНомерДокумента = "";
    Объект.ИнойПлательщикГражданство    = "";

	
	Если ЗначениеЗаполнено(Объект.ИнойПлательщик) Тогда     
		
		Если Объект.ИнойПлательщик.ВидКонтрагента = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
			
			Объект.ИнойПлательщиеПризнак        = "2";   
			Объект.ИнойПлательщикИНН            = Объект.ИнойПлательщик.ИНН;
				
			Объект.ИнойПлательщиеНаименование   = Справочники.ФизическиеЛица.ФИОФизлица(Объект.ИнойПлательщик.ЮридическоеФизическоеЛицо, ДатаСведений);  
			Объект.ИнойПлательщикГражданство    = Справочники.ФизическиеЛица.ГражданствоФизЛица(Объект.ИнойПлательщик.ЮридическоеФизическоеЛицо, ДатаСведений);
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ДокументыФизическихЛицСрезПоследних.Представление,
			|	ДокументыФизическихЛицСрезПоследних.ВидДокумента,
			|	ДокументыФизическихЛицСрезПоследних.Серия,
			|	ДокументыФизическихЛицСрезПоследних.Номер
			|ИЗ
			|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&ДатаЗапроса, Физлицо = &Физлицо) КАК ДокументыФизическихЛицСрезПоследних
			|");
			Запрос.УстановитьПараметр("Физлицо",     Объект.ИнойПлательщик.ЮридическоеФизическоеЛицо);
			Запрос.УстановитьПараметр("ДатаЗапроса", ДатаСведений);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда   
				
				Объект.ИнойПлательщикВидДокумента   = Выборка.ВидДокумента;
				Объект.ИнойПлательщикНомерДокумента = Выборка.Серия + ?(ЗначениеЗаполнено(Выборка.Серия), " ", "") + Выборка.Номер;
				
			КонецЕсли;
		
		ИначеЕсли Объект.ИнойПлательщик.ВидКонтрагента = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		
			Объект.ИнойПлательщиеПризнак        = "1";   
			Объект.ИнойПлательщикИНН            = Объект.ИнойПлательщик.ИНН;
			Объект.ИнойПлательщикКПП            = Объект.ИнойПлательщик.КПП;
			Объект.ИнойПлательщиеНаименование   = Объект.ИнойПлательщик.ЮридическоеФизическоеЛицо.НаименованиеПолное;   
								
		КонецЕсли; 	
					
	КонецЕсли;	
	
КонецПроцедуры	

Функция ЗначенияЗаполненияПоПоступлениюТМЦ(ДокументДО, ДокументТМЦ) Экспорт
	
	ИмяТаблицы = "Документ." + ДокументТМЦ.Метаданные().Имя;
	
	ЭтоАванс = ИмяТаблицы = "Документ.РегистрацияОбязательствИСведенийПоДоговорам"; 
	
	ЕстьВидДокумента = ОбщегоНазначения.ЕстьРеквизитОбъекта("ВидПервичногоДокумента", ДокументТМЦ.Метаданные()); 
	ЕстьДатаПодписания = ОбщегоНазначения.ЕстьРеквизитОбъекта("ДатаПодписанияПервичногоДокумента", ДокументТМЦ.Метаданные());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументТМЦ", ДокументТМЦ);
	Запрос.УстановитьПараметр("ДокументДО", ДокументДО);
	Запрос.УстановитьПараметр("ДокументТМЦСиноним", ДокументТМЦ.Метаданные().Синоним);
	Запрос.УстановитьПараметр("СчетаДО", 
		БухгалтерскийУчет.СписокСчетов("502.12",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументТМЦ, "Дата")));
		
	Запрос.Текст = "ВЫБРАТЬ 
	|//[0]///////////////////////////////////////////////////////////////////////////
	|" + ?(ЭтоАванс, " 
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ОснованиеИзменений = """"
	|			ТОГДА ПоступлениеМЗ.Договор.ВидОбязательства
	|		ИНАЧЕ ПоступлениеМЗ.ОснованиеИзменений
	|	КОНЕЦ КАК ДокументОснованиеВид,", ?(ЕстьВидДокумента, " 
	|	ПоступлениеМЗ.ВидПервичногоДокумента КАК ДокументОснованиеВид,", "
	|   &ДокументТМЦСиноним КАК ДокументОснованиеВид,")) + "
	|" + ?(ЭтоАванс, " 
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ОснованиеИзменений = """"
	|			ТОГДА ПоступлениеМЗ.Договор.ДатаДоговора
	|		ИНАЧЕ ПоступлениеМЗ.ОснованиеИзмененийДата
	|	КОНЕЦ КАК ДокументОснованиеДата,", ?(ЕстьДатаПодписания, "
	|	ПоступлениеМЗ.ДатаПодписанияПервичногоДокумента КАК ДокументОснованиеДата,", ?(ЕстьВидДокумента, " 
	|	ПоступлениеМЗ.ДатаПервичногоДокумента КАК ДокументОснованиеДата,", "
	|	ПоступлениеМЗ.Дата КАК ДокументОснованиеДата,"))) + "
	|" + ?(ЭтоАванс, " 
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ОснованиеИзменений = """"
	|			ТОГДА ПоступлениеМЗ.Договор.НомерДоговора
	|		ИНАЧЕ ПоступлениеМЗ.ОснованиеИзмененийНомер
	|	КОНЕЦ КАК ДокументОснованиеНомер,", ?(ЕстьВидДокумента, "
	|	ПоступлениеМЗ.НомерПервичногоДокумента КАК ДокументОснованиеНомер,", "
	|	ПоступлениеМЗ.Номер КАК ДокументОснованиеНомер,")) + "
	|	ПоступлениеМЗ.ВалютаДокумента КАК ВалютаДокумента1,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	ПоступлениеМЗ.ИФО КАК ИФО,
	|	ПоступлениеМЗ.Контрагент КАК Контрагент,
	|	ПоступлениеМЗ.Договор КАК Договор,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Контрагент = ПоступлениеМЗ.Договор.Контрагент
	|			ТОГДА ПоступлениеМЗ.Договор.СчетКонтрагента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетКонтрагента
	|ИЗ
	|	&ИмяТаблицы КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка = &ДокументТМЦ
	|;
	|
	|//[1]///////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДенежномОбязательстве.ИсточникСредств КАК ИсточникСредств,
	|	СведенияОДенежномОбязательстве.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияОДенежномОбязательстве.ОрганКазначейства КАК ОрганКазначейства,
	|	СведенияОДенежномОбязательстве.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	|	СведенияОДенежномОбязательстве.ОбъектФАИП КАК ОбъектФАИП
	|ИЗ
	|	Документ.СведенияОДенежномОбязательстве КАК СведенияОДенежномОбязательстве
	|ГДЕ
	|	СведенияОДенежномОбязательстве.Ссылка = &ДокументДО
	|;
	|
	|//[2]///////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КБКНазначениеПлатежа,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КОСГУНазначениеПлатежа,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).ИсточникСредств  КАК ИсточникСредств,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК Сумма,
	|	СУММА(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма) КАК СуммаВал
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор = &ДокументТМЦ
	|				И СчетКт В (&СчетаДО),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).ИсточникСредств
	|;
	|
	|//[3]///////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).Владелец КАК ЛицевойСчет,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).ИсточникСредств  КАК ИсточникСредств,
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов) КАК РазделЛицевогоСчета,
	|	РеквизитыЛицевыхСчетов.Ссылка КАК РеквизитыЛицевогоСчета,
	|	РеквизитыЛицевыхСчетов.КассовыйОрган КАК ОрганКазначейства
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор = &ДокументТМЦ
	|				И СчетКт В (&СчетаДО),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
	|		ПО (ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.РазделыЛицевыхСчетов).Владелец = РеквизитыЛицевыхСчетов.Владелец)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ИмяТаблицы); 
		
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", МассивРезультатов[0].Выгрузить());
	Результат.Вставить("ШапкаДО", МассивРезультатов[1].Выгрузить());
    Результат.Вставить("РасшифровкаПлатежа", МассивРезультатов[2].Выгрузить());
	Результат.Вставить("ЛицевойСчет", МассивРезультатов[3].Выгрузить());
	
	Результат.Вставить("КорСчет", БухгалтерскийУчет.СчетПоКоду(?(ЭтоАванс, "206.00", "302.00"), Неопределено, Неопределено));
	Результат.Вставить("ЭтоАванс", ЭтоАванс); 
	
	Если Результат.ШапкаДО.Количество() = 0 
		И (Результат.ЛицевойСчет.Количество() = 0
		ИЛИ НЕ ЗначениеЗаполнено(Результат.ЛицевойСчет[0].РеквизитыЛицевогоСчета)) Тогда  
		
		ДанныеЛицевогоСчета = Неопределено;
		
		Если ДокументТМЦ.Метаданные().Имя = "РегистрацияОбязательствИСведенийПоДоговорам" Тогда 
			ДанныеЛицевогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументТМЦ, 
			Новый Структура("ЛицевойСчет,РеквизитыЛицевогоСчета,ОрганФК",,,"ОрганКазначейства"));
		КонецЕсли;	
		
		Если ДанныеЛицевогоСчета = Неопределено Или НЕ ЗначениеЗаполнено(ДанныеЛицевогоСчета.РеквизитыЛицевогоСчета) Тогда 
			Если Результат.Шапка.Количество() > 0 Тогда
				МассивКФО = Результат.РасшифровкаПлатежа.ВыгрузитьКолонку("КФО");
				ДанныеЛицевогоСчета = ПлатежноРасчетныеДокументы.ДанныеЛицевогоСчетаПоКФО(Результат.Шапка[0].Организация, МассивКФО);
			КонецЕсли;
		Конецесли;
		
		Если НЕ ДанныеЛицевогоСчета = Неопределено Тогда
			Если Результат.ЛицевойСчет.Количество() = 0 Тогда
				Результат.ЛицевойСчет.Добавить();
			КонецЕсли;
			Результат.ЛицевойСчет[0].ЛицевойСчет = ДанныеЛицевогоСчета.ЛицевойСчет;
			Результат.ЛицевойСчет[0].РеквизитыЛицевогоСчета = ДанныеЛицевогоСчета.РеквизитыЛицевогоСчета;
			Результат.ЛицевойСчет[0].ОрганКазначейства = ДанныеЛицевогоСчета.ОрганФК;
			
			Если ДанныеЛицевогоСчета.Свойство("РазделыИКФО") Тогда
				Для Каждого Стр ИЗ Результат.РасшифровкаПлатежа Цикл
					Если НЕ ЗначениеЗаполнено(Стр.ИсточникСредств) Тогда
						ИсточникПоКФО = ДанныеЛицевогоСчета.РазделыИКФО.НайтиСтроки(Новый Структура("КФО", Стр.КФО));
						Если ИсточникПоКФО.Количество() > 0 Тогда
							Стр.ИсточникСредств = ИсточникПоКФО[0].ИсточникСредств;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаявкаНаКассовыйРасход";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0531801_19н";
	КомандаПечати.Представление		= НСтр("ru = 'Заявка на кассовый расход'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаявкаНаКассовыйРасход";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0531801_21н";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Заявка на кассовый расход (пр. 21н)'");
	КомандаПечати.Порядок			= 100;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаявкаНаКассовыйРасход";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0531801_16н";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Заявка на кассовый расход (пр. 16н)'");
	КомандаПечати.Порядок			= 150;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ЗаявкаНаКассовыйРасход";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0531801";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Заявка на кассовый расход (пр. 8н)'");
	КомандаПечати.Порядок			= 200;
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "РасчетныйДокументБезККТ", 5);
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0531801") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма0531801",
			"Заявка на кассовый расход",
			ПечатьЗаявкиНаРасход(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0531801_16н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма0531801_16н",
			"Заявка на кассовый расход (в ред. приказа 16н)",
			ПечатьЗаявкиНаРасход16н(МассивОбъектов, ОбъектыПечати, "16н"));
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0531801_21н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма0531801_21н",
			"Заявка на кассовый расход (в ред. приказа 21н)",
			ПечатьЗаявкиНаРасход16н(МассивОбъектов, ОбъектыПечати, "21н"));
	КонецЕсли;	
		
   	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0531801_19н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_Форма0531801_19н",
			"Заявка на кассовый расход (в ред. приказа 19н)",
			ПечатьЗаявкиНаРасход16н(МассивОбъектов, ОбъектыПечати, "19н"));
	КонецЕсли;	
		
КонецПроцедуры

// Функция формирует табличный документ Заявка на кассовый расход (ф.0531801)
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьЗаявкиНаРасход(МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы 					= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб 						= Истина; 
	ТабДокумент.ВерхнийКолонтитул.Выводить 			= Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2; 
	ТабДокумент.НижнийКолонтитул.Выводить 			= Истина;
	ТабДокумент.ПолеСверху 							= 10;
	ТабДокумент.ПолеСнизу 							= 12;
	ТабДокумент.РазмерКолонтитулаСверху 			= 10;
	ТабДокумент.РазмерКолонтитулаСнизу 				= 12;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаКассовыйРасход_ЗаявкаНаКассовыйРасход";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаНаКассовыйРасход.ПФ_MXL_Форма0531801");
	
	ДанныеДляПечатиМассив = ПлатежноРасчетныеДокументы.ЗначенияРеквизитовЗаявкаНаКассовыйРасход(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеДляПечати Из ДанныеДляПечатиМассив Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		
		
		// Вывод в табличный документ
		ОбластьВывода = Макет.ПолучитьОбласть("Заголовок");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		
		ТабДокумент.Вывести(ОбластьВывода);
		
		// Дальше надо смотреть, умещается ли на страницу
		// Раздел 1
		ШапкаРаздела 			= Макет.ПолучитьОбласть("ШапкаРаздела");
		ДанныеДляПечати.Вставить("пНомерСтраницы", "1");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_1", ДанныеДляПечати, ДанныеДляПечати, ,ШапкаРаздела); 
		
		// Раздел 2
		
		// <-- раздел 2 со след. страницы
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ШапкаРаздела = Макет.ПолучитьОбласть("ШапкаРаздела");
		ДанныеДляПечати.Вставить("пНомерСтраницы", "2");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		
		ТабДокумент.Вывести(ШапкаРаздела);
		// <--
		
		// Таблица раздела 2
		Если ДанныеДляПечати.ВыводитьРаздел_2 Тогда
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_2", Новый Структура, ДанныеДляПечати);  
			Для Каждого СтрВыборка Из ДанныеДляПечати.РеквизитыДокументаОснования Цикл 
				ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_2_Строка", СтрВыборка, ДанныеДляПечати, "Раздел_2_Шапка", ШапкаРаздела);  
			КонецЦикла;
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель_2"));
		КонецЕсли;
		
		// Раздел 3
		ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_3", ДанныеДляПечати, ДанныеДляПечати, ,ШапкаРаздела); 
		
		// Раздел 4
		Если ДанныеДляПечати.ВыводитьРаздел_4 Тогда
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_4", ДанныеДляПечати, ДанныеДляПечати, ,ШапкаРаздела); 
		КонецЕсли;
		
		// Раздел 5
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ШапкаРаздела = Макет.ПолучитьОбласть("ШапкаРаздела");
		ДанныеДляПечати.Вставить("пНомерСтраницы", "3");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ШапкаРаздела);
		
		ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_5", Новый Структура, ДанныеДляПечати);  
		Для Каждого СтрВыборка Из ДанныеДляПечати.РасшифровкаПлатежа Цикл 
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_5_Строка", СтрВыборка, ДанныеДляПечати, "Раздел_5_Шапка", ШапкаРаздела);  
		КонецЦикла;
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель"));
		
		// Последняя подпись ответственного исполнителя 
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ОтметкаФК"));
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;
	
КонецФункции

// Функция формирует табличный документ Заявка на кассовый расход (ф.0531801) в ред. приказа 16н
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьЗаявкиНаРасход16н(МассивОбъектов, ОбъектыПечати, Приказ = "21н")
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы 					= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб 						= Истина; 
    ТабДокумент.ВерхнийКолонтитул.Выводить 			= Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2; 
	ТабДокумент.НижнийКолонтитул.Выводить 			= Истина;
	ТабДокумент.ПолеСверху 							= 10;
	ТабДокумент.ПолеСнизу 							= 12;
    ТабДокумент.РазмерКолонтитулаСверху 			= 10;
	ТабДокумент.РазмерКолонтитулаСнизу 				= 12;
    ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаКассовыйРасход_ЗаявкаНаКассовыйРасход";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаНаКассовыйРасход.ПФ_MXL_Форма0531801_" + Приказ);

	ДанныеДляПечатиМассив = ПлатежноРасчетныеДокументы.ЗначенияРеквизитовЗаявкаНаКассовыйРасход(МассивОбъектов);
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеДляПечати Из ДанныеДляПечатиМассив Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		
		// Вывод в табличный документ
		ОбластьВывода = Макет.ПолучитьОбласть("Заголовок");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		
		ТабДокумент.Вывести(ОбластьВывода);
		
		// Дальше надо смотреть, умещается ли на страницу
		// Раздел 1
		ШапкаРаздела 			= Макет.ПолучитьОбласть("ШапкаРаздела");
		ДанныеДляПечати.Вставить("пНомерСтраницы", "1");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_1", ДанныеДляПечати, ДанныеДляПечати, ,ШапкаРаздела); 
		
		// Раздел 2
		
		// <-- раздел 2 со след. страницы
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ШапкаРаздела = Макет.ПолучитьОбласть("ШапкаРаздела");
		ДанныеДляПечати.Вставить("пНомерСтраницы", "2");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		
		ТабДокумент.Вывести(ШапкаРаздела);
		// <--
		
		// Таблица раздела 2
		Если ДанныеДляПечати.ВыводитьРаздел_2 Тогда
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_2", Новый Структура, ДанныеДляПечати);  
			Для Каждого СтрВыборка Из ДанныеДляПечати.РеквизитыДокументаОснования Цикл 
				ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_2_Строка", СтрВыборка, ДанныеДляПечати, "Раздел_2_Шапка", ШапкаРаздела);  
			КонецЦикла;
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель_2"));
		КонецЕсли;
		
		// Раздел 3
		ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_3", ДанныеДляПечати, ДанныеДляПечати, ,ШапкаРаздела); 
		
		// Раздел 4
		Если ДанныеДляПечати.ВыводитьРаздел_4 Тогда
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_4", ДанныеДляПечати, ДанныеДляПечати, ,ШапкаРаздела); 
		КонецЕсли;
		
		// Раздел 5
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ШапкаРаздела = Макет.ПолучитьОбласть("ШапкаРаздела");
		ДанныеДляПечати.Вставить("пНомерСтраницы", "3");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ШапкаРаздела);
		
		ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_5", Новый Структура, ДанныеДляПечати);  
		Для Каждого СтрВыборка Из ДанныеДляПечати.РасшифровкаПлатежа Цикл 
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "Раздел_5_Строка", СтрВыборка, ДанныеДляПечати, "Раздел_5_Шапка", ШапкаРаздела);  
		КонецЦикла;
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель"));
		
		// Последняя подпись ответственного исполнителя 
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ОтметкаФК"));
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, Область, ИсточникПараметров, ПоляПодвала, Шапка = Неопределено, ШапкаРаздела = Неопределено)
	
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(Макет.ПолучитьОбласть(Область));
	ВыводимыеОбласти.Добавить(Макет.ПолучитьОбласть("Подвал"));
	ВыводимыеОбласти[0].Параметры.Заполнить(ИсточникПараметров);
	ВыводимыеОбласти[1].Параметры.Заполнить(ПоляПодвала);
	
	Попытка 
		Если НЕ ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
			ТабДокумент.Вывести(ВыводимыеОбласти[1]);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Если НЕ ШапкаРаздела = Неопределено Тогда
				ТабДокумент.Вывести(ШапкаРаздела);	
			КонецЕсли;	
			Если НЕ Шапка = Неопределено Тогда
				ТабДокумент.Вывести(Макет.ПолучитьОбласть(Шапка));	
			КонецЕсли;	
		КонецЕсли;
		ТабДокумент.Вывести(ВыводимыеОбласти[0]);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='В системе не установлено ни одного принтера.'"));
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
