#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате") Тогда
		ПлатежноРасчетныеДокументы.ЗаполнитьНаОснованииВедомостиКомпенсацииРодительскойПлатыКВыплате(ЭтотОбъект,
			ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьНаВыплатуВБанк") Тогда
		
		// проверим, был ли уже введен расчетно-платежный документ на основании ведомости
		РасчетноПлатежныйДокумент =
			ПлатежноРасчетныеДокументы.ВведенныйНаОснованииВедомостиВБанкРасчетноПлатежныйДокумент(ДанныеЗаполнения);
		
		Если ЗначениеЗаполнено(РасчетноПлатежныйДокумент) И Ссылка <> РасчетноПлатежныйДокумент Тогда
			
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='На основании ведомости уже введен расчетно-платежный документ (%1)'"),
				РасчетноПлатежныйДокумент);
			ВызватьИсключение ТекстИсключения;
			
		Иначе
			
			Если НЕ ДанныеЗаполнения.ПолучитьОбъект().ПроверитьЗаполнение() Тогда
				ВызватьИсключение "В ведомости есть ошибки заполнения (см. окно сообщений)! Ввод на основании невозможен."
			КонецЕсли;
			
			Организация				= ДанныеЗаполнения.Организация;
			ИФО						= ДанныеЗаполнения.ИФО;
			Дата					= ДанныеЗаполнения.Дата;
			СуммаДокументаВВалюте	= ДанныеЗаполнения.СуммаДокумента;
			СуммаДокумента			= ДанныеЗаполнения.СуммаДокумента;
			ДокументОснование		= ДанныеЗаполнения;
			КодВидаДохода			= ДанныеЗаполнения.КодВидаДохода;
			ВалютаДокумента			= Константы.ВалютаРегламентированногоУчета.Получить();
			КурсКратность			= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
			Курс					= КурсКратность.Курс;
			Кратность				= КурсКратность.Кратность;
			
			РасшифровкаПлатежа.Очистить();
			
			ТаблицаДляЗаполнения = ДанныеЗаполнения.РасшифровкаПлатежа.Выгрузить();
			ТаблицаДляЗаполнения.Свернуть("КФО,КПС,КЭК,КодЦели,КодМероприятия,ДопКлассификация","Сумма");
			ТаблицаДляЗаполнения.Сортировать("КФО,КПС,КЭК");
			
			Для Каждого СтрокаОснования Из ТаблицаДляЗаполнения Цикл
				СтрРасшифровка = РасшифровкаПлатежа.Добавить();
				СтрРасшифровка.КФО						= СтрокаОснования.КФО;
				СтрРасшифровка.КБКНазначениеПлатежа		= СтрокаОснования.КПС;
				СтрРасшифровка.КОСГУНазначениеПлатежа	= СтрокаОснования.КЭК;
				СтрРасшифровка.КодЦели					= СтрокаОснования.КодЦели;
				СтрРасшифровка.КодМероприятия			= СтрокаОснования.КодМероприятия;
				СтрРасшифровка.ДопКлассификация			= СтрокаОснования.ДопКлассификация;
				СтрРасшифровка.СуммаВал					= СтрокаОснования.Сумма;
				СтрРасшифровка.Сумма					= СтрокаОснования.Сумма;
				СтрРасшифровка.ВидРасчетов 				= ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг");
				
				ДопустимыеИсточникиСредств = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ЛицевойСчет,СтрРасшифровка.КФО);
				Если ДопустимыеИсточникиСредств.Количество() = 1 Тогда
					СтрРасшифровка.ИсточникСредств = ДопустимыеИсточникиСредств[0];
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СведенияОДенежномОбязательстве") Тогда
		
		ДокументТМЦ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ПодтверждающийДокумент");
		
		Если НЕ Метаданные.Документы.ЗаявкаНаКассовыйРасход.ВводитсяНаОсновании.Содержит(ДокументТМЦ.Метаданные()) Тогда
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='Ввод на основании денежного обязательства, принятого по документу %1 невозможен!'"),
									ДокументТМЦ.Метаданные().Синоним);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
		ЗаполнитьПоДО(ДанныеЗаполнения, ДокументТМЦ);
		
		ДокументОснование = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеМЗ") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеМЗВПути") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеОС") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеОСВПути") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеУслугРабот") ИЛИ  
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктПриемкиТоваровРаботУслуг") ИЛИ
		ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам") Тогда
		
		ДокументДО = Документы.СведенияОДенежномОбязательстве.ДенежноеОбязательствоПоДокументуТМЦ(ДанныеЗаполнения);
		
		ЗаполнитьПоДО(ДокументДО, ДанныеЗаполнения); 
		
		ДокументОснование = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявлениеНаВыдачуАванса") Тогда
		
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииЗаявленияНаВыдачуАванса(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		ЗаполнитьНаОснованииАвансовогоОтчета(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомандировании") Тогда
		
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииРешенияОКомандировании(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомпенсацииРасходовДляКрайнегоСевера") Тогда
		
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииРешенияОКомпенсации(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъема")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаОбоснованиеЗакупкиМалогоОбъемаЧерезПодотчетноеЛицо") Тогда
		
		ПлатежноРасчетныеДокументы.ЗаполнитьПлатежныйДокументНаОснованииЗаявкиОбоснования(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетОРасходахПодотчетногоЛица") Тогда
		
		ПлатежноРасчетныеДокументы.ЗаполнитьНаОснованииОтчетаОРасходахПодотчетногоЛица(ЭтотОбъект, ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КассовоеПоступление") Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	КассовоеПоступление.Ссылка КАК ДокументОснование,
		|	КассовоеПоступление.Организация КАК Организация,
		|	КассовоеПоступление.ИФО КАК ИФО,
		|	КассовоеПоступление.ЛицевойСчет КАК ЛицевойСчет,
		|	КассовоеПоступление.Плательщик КАК Контрагент,
		|	КассовоеПоступление.СчетКонтрагента КАК СчетКонтрагента,
		|	КассовоеПоступление.СуммаДокумента КАК СуммаДокумента,
		|	КассовоеПоступление.СтавкаНДС КАК СтавкаНДС,
		|	КассовоеПоступление.СуммаНДС КАК СуммаНДС,
		|	КассовоеПоступление.Договор КАК Договор,
		|	КассовоеПоступление.ВалютаДокумента КАК ВалютаДокумента,
		|	КассовоеПоступление.Курс КАК Курс,
		|	КассовоеПоступление.Кратность КАК Кратность,
		|	КассовоеПоступление.СуммаДокументаВВалюте КАК СуммаДокументаВВалюте,
		|	КассовоеПоступление.НазначениеПлатежа КАК НазначениеПлатежа,
		|	КассовоеПоступление.НалогСборПлатеж КАК НалогСборПлатеж,
		|	КассовоеПоступление.Подразделение КАК Подразделение,
		|	КассовоеПоступление.КорСчет КАК КорСчет
		|ИЗ
		|	Документ.КассовоеПоступление КАК КассовоеПоступление
		|ГДЕ
		|	КассовоеПоступление.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КассовоеПоступлениеРасшифровкаПлатежа.ИсточникСредств КАК ИсточникСредств,
		|	КассовоеПоступлениеРасшифровкаПлатежа.КБКНазначениеПлатежа КАК КБКНазначениеПлатежа,
		|	КассовоеПоступлениеРасшифровкаПлатежа.КОСГУНазначениеПлатежа КАК КОСГУНазначениеПлатежа,
		|	КассовоеПоступлениеРасшифровкаПлатежа.Примечание КАК Примечание,
		|	КассовоеПоступлениеРасшифровкаПлатежа.СуммаВал КАК СуммаВал,
		|	КассовоеПоступлениеРасшифровкаПлатежа.Сумма КАК Сумма,
		|	КассовоеПоступлениеРасшифровкаПлатежа.КодЦели КАК КодЦели,
		|	КассовоеПоступлениеРасшифровкаПлатежа.КодМероприятия КАК КодМероприятия,
		|	КассовоеПоступлениеРасшифровкаПлатежа.ДопКлассификация КАК ДопКлассификация,
		|	КассовоеПоступлениеРасшифровкаПлатежа.КФО КАК КФО,
		|	КассовоеПоступлениеРасшифровкаПлатежа.СчетРасчетов КАК СчетРасчетов,
		|	КассовоеПоступлениеРасшифровкаПлатежа.СпособПогашенияЗадолженности КАК СпособПогашенияЗадолженности,
		|	КассовоеПоступлениеРасшифровкаПлатежа.ДопСубконтоРасчетов КАК ДопСубконтоРасчетов,
		|	КассовоеПоступлениеРасшифровкаПлатежа.ВидРасчетов КАК ВидРасчетов
		|ИЗ
		|	Документ.КассовоеПоступление.РасшифровкаПлатежа КАК КассовоеПоступлениеРасшифровкаПлатежа
		|ГДЕ
		|	КассовоеПоступлениеРасшифровкаПлатежа.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения); 
	
		Результат = Запрос.ВыполнитьПакет();
		
		Выборка = Результат[0].Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
		ЭтотОбъект.РасшифровкаПлатежа.Загрузить(Результат[1].Выгрузить());
		
		Документы.ЗаявкаНаКассовыйРасход.ЗаполнитьРеквизитыПолучателя(ЭтотОбъект);
			
		КурсКратность 		= РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, Дата);
		Курс 				= КурсКратность.Курс;
		Кратность 			= КурсКратность.Кратность;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РеквизитыЛицевыхСчетов.Ссылка КАК Ссылка,
		|	РеквизитыЛицевыхСчетов.КассовыйОрган КАК КассовыйОрган
		|ИЗ
		|	Справочник.РеквизитыЛицевыхСчетов КАК РеквизитыЛицевыхСчетов
		|ГДЕ
		|	РеквизитыЛицевыхСчетов.Владелец = &Владелец");
				
		Запрос.УстановитьПараметр("Владелец", ЛицевойСчет);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			РеквизитыЛицевогоСчета = Выборка.Ссылка;
			ОрганКазначейства = Выборка.КассовыйОрган;
		КонецЕсли;	

		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Отказ = ПлатежноРасчетныеДокументы.ВыполнитьДвиженияПлатежноРасчетногоДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);	
	
	НельзяПровести = НЕ (СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма"));
	
	Если НельзяПровести Тогда
		ТекстСообщения = НСтр("ru='Проведение невозможно. Сумма документа не равна сумме расшифровки платежа. Не распределена сумма: '") + Формат((СуммаДокументаВВалюте - РасшифровкаПлатежа.Итог("СуммаВал")),"ЧДЦ=2");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, "СуммаДокументаВВалюте", "Объект");
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НельзяПровести Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ УчетРасчетов.ИспользуетсяНастройкаПогашенияЗадолженности(КорСчет) Тогда
		
		Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
			СтрокаРасшифровки.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Автоматически;
			СтрокаРасшифровки.ДопСубконтоРасчетов = Неопределено;
		КонецЦикла;
		
	КонецЕсли;
	
	КонтрольИсполненияДоговоров.ОчиститьДвиженияРегистровПодсистемы(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПлатежноРасчетныеДокументы.ПриЗаписиНаСервереУстановкаСтатуса(Отказ, ЭтотОбъект);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	
	// Очистим поле "Оплатить до", т.к. данный платеж, скорее всего, уже был оплачен в документе, который копируем.
	Для Каждого СтрокаРасшифровки Из РасшифровкаПлатежа Цикл
		СтрокаРасшифровки.ОплатитьДо = Дата("00010101");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

// Заполняет документ остатками задолженности к погашению.
//
Процедура ЗаполнитьПоОстаткамЗадолженности() Экспорт
	
	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	РасшифровкаПлатежа.Очистить();
	
	ПлатежноРасчетныеДокументы.ЗаполнитьРасшифровкуПлатежаПоОстаткамЗадолженности(
		РасшифровкаПлатежа, ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьПоДО(ДокументДО, ДокументТМЦ)
	
	ДанныеДляЗаполнения = Документы.ЗаявкаНаКассовыйРасход.ЗначенияЗаполненияПоПоступлениюТМЦ(ДокументДО, ДокументТМЦ);
	
	ИсточникСредствШапка = Неопределено;
	
	Если ДанныеДляЗаполнения.Шапка.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.Шапка[0]);
		Если ЗначениеЗаполнено(Договор) Тогда
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, "ВидОбязательства,ДатаДоговора,НомерДоговора,КраткоеСодержание");
			НомерОбязательства = РаботаСОбязательствами.ПолучитьУчетныйНомерОбязательства(Договор);
			ТекущаяСтрокаРеквизитов = РеквизитыДокументаОснования.Добавить();
			ТекущаяСтрокаРеквизитов.ДокументОснованиеВид		= РеквизитыДоговора.ВидОбязательства;
			ТекущаяСтрокаРеквизитов.ДокументОснованиеДата 		= РеквизитыДоговора.ДатаДоговора;
			ТекущаяСтрокаРеквизитов.ДокументОснованиеНомер		= РеквизитыДоговора.НомерДоговора;
			ТекущаяСтрокаРеквизитов.ДокументОснованиеПредмет 	= РеквизитыДоговора.КраткоеСодержание;
		КонецЕсли;
		ТекущаяСтрокаРеквизитов = РеквизитыДокументаОснования.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрокаРеквизитов, ДанныеДляЗаполнения.Шапка[0]);
		Документы.ЗаявкаНаКассовыйРасход.ЗаполнитьРеквизитыПолучателя(ЭтотОбъект);
	Конецесли;
	
	Если ДанныеДляЗаполнения.ШапкаДО.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.ШапкаДО[0]);
		ИсточникСредствШапка = ДанныеДляЗаполнения.ШапкаДО[0].ИсточникСредств;
	ИначеЕсли ДанныеДляЗаполнения.ЛицевойСчет.Количество() > 0
		И ЗначениеЗаполнено(ДанныеДляЗаполнения.ЛицевойСчет[0].РеквизитыЛицевогоСчета) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДляЗаполнения.ЛицевойСчет[0]);
	Конецесли;
	
	Для Каждого Стр Из ДанныеДляЗаполнения.РасшифровкаПлатежа Цикл
		НовСтр =  РасшифровкаПлатежа.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		Если НЕ ЗначениеЗаполнено(НовСтр.ИсточникСредств) Тогда
			НовСтр.ИсточникСредств = ИсточникСредствШапка;
		КонецЕсли;
		НовСтр.ВидРасчетов = ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг");
	КонецЦикла;
	
	ВалютаДокумента = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	Курс = 1;
	Кратность = 1;
	
	СуммаДокументаВВалюте = РасшифровкаПлатежа.Итог("СуммаВал");
	СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");
	
	КорСчет = ДанныеДляЗаполнения.КорСчет;
	ПризнакАвансовогоПлатежа = ДанныеДляЗаполнения.ЭтоАванс;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииАвансовогоОтчета(ДокументОснование)
	
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование.Сотрудник, "Контрагент");
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("пСчет", 							БухгалтерскийУчет.СписокСчетов("208.00"));
	Запрос.УстановитьПараметр("Организация", 					ДокументОснование.Организация);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("Субконто1", 						Контрагент);
	Запрос.УстановитьПараметр("АвансовыйОчетСсылка",			ДокументОснование);
	Запрос.УстановитьПараметр("ДокументыАвансов", 				ДокументОснование.Получено.ВыгрузитьКолонку("ДокументАванса"));
	Запрос.УстановитьПараметр("ДокументыИзрасходовано", 		ДокументОснование.Израсходовано.ВыгрузитьКолонку("ПриходныйДокумент"));
	Запрос.УстановитьПараметр("ДокументыПерерасхода", 			ДокументОснование.ОстатокПерерасход.ВыгрузитьКолонку("ДокументПерерасхода"));
	Запрос.УстановитьПараметр("ДокументыОстатка", 				ДокументОснование.ОстатокПерерасход.ВыгрузитьКолонку("ДокументОстатка"));
	
	Запрос.УстановитьПараметр("МоментВремени", РасчетыСПодотчетнымиЛицами.МоментВремениДокументаНачальногоОстатка(ДокументОснование));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОстатки.Счет КАК Счет,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЕСТЬNULL(Валюты.Ссылка, &ВалютаРегламентированногоУчета) КАК Валюта,
	|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Валюты.Ссылка ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокДт
	|		ИНАЧЕ ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаОстатокДт
	|	КОНЕЦ КАК ПредыдущийАвансОстаток,
	|	ВЫБОР
	|		КОГДА Валюты.Ссылка ЕСТЬ NULL
	|			ТОГДА ЖурналПроводокЕПСБУОстатки.СуммаОстатокКт
	|		ИНАЧЕ ЖурналПроводокЕПСБУОстатки.ВалютнаяСуммаОстатокКт
	|	КОНЕЦ КАК ПредыдущийАвансПерерасход,
	|	0 КАК Получено,
	|	0 КАК Израсходовано,
	|	0 КАК ВозвращенОстаток,
	|	0 КАК ВыданПерерасход
	|ПОМЕСТИТЬ ДетальныеДанные
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&МоментВремени,
	|			Счет В (&пСчет),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Субконто1) КАК ЖурналПроводокЕПСБУОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ЖурналПроводокЕПСБУОстатки.Валюта = Валюты.Ссылка
	|			И (Валюты.Ссылка <> &ВалютаРегламентированногоУчета)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналПроводокЕПСБУОбороты.Счет,
	|	ЖурналПроводокЕПСБУОбороты.КПС,
	|	ЖурналПроводокЕПСБУОбороты.КФО,
	|	ЕСТЬNULL(Валюты.Ссылка, &ВалютаРегламентированногоУчета),
	|	ЖурналПроводокЕПСБУОбороты.Субконто1,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыАвансов)
	|			ТОГДА ВЫБОР
	|					КОГДА Валюты.Ссылка ЕСТЬ NULL
	|						ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборотДт - ЖурналПроводокЕПСБУОбороты.СуммаОборотКт
	|					ИНАЧЕ ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотДт - ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотКт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыИзрасходовано)
	|				ИЛИ ЖурналПроводокЕПСБУОбороты.Регистратор = &АвансовыйОчетСсылка
	|			ТОГДА ВЫБОР
	|					КОГДА Валюты.Ссылка ЕСТЬ NULL
	|						ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборотКт - ЖурналПроводокЕПСБУОбороты.СуммаОборотДт
	|					ИНАЧЕ ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотКт - ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотДт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыОстатка)
	|			ТОГДА ВЫБОР
	|					КОГДА Валюты.Ссылка ЕСТЬ NULL
	|						ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборотКт - ЖурналПроводокЕПСБУОбороты.СуммаОборотДт
	|					ИНАЧЕ ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотКт - ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотДт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыПерерасхода)
	|			ТОГДА ВЫБОР
	|					КОГДА Валюты.Ссылка ЕСТЬ NULL
	|						ТОГДА ЖурналПроводокЕПСБУОбороты.СуммаОборотДт - ЖурналПроводокЕПСБУОбороты.СуммаОборотКт
	|					ИНАЧЕ ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотДт - ЖурналПроводокЕПСБУОбороты.ВалютнаяСуммаОборотКт
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Обороты(
	|			&МоментВремени,
	|			,
	|			Регистратор,
	|			Счет В (&пСчет),
	|			,
	|			Организация = &Организация
	|				И Субконто1 = &Субконто1,
	|			,
	|			) КАК ЖурналПроводокЕПСБУОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ЖурналПроводокЕПСБУОбороты.Валюта = Валюты.Ссылка
	|			И (Валюты.Ссылка <> &ВалютаРегламентированногоУчета)
	|ГДЕ
	|	(ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыАвансов)
	|			ИЛИ ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыИзрасходовано)
	|			ИЛИ ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыОстатка)
	|			ИЛИ ЖурналПроводокЕПСБУОбороты.Регистратор В (&ДокументыПерерасхода)
	|			ИЛИ ЖурналПроводокЕПСБУОбороты.Регистратор = &АвансовыйОчетСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДетальныеДанные.Счет КАК Счет,
	|	МАКСИМУМ(СоответствияАналитическихСчетовКЭК.КЭК) КАК КЭК
	|ПОМЕСТИТЬ СчетКЭК
	|ИЗ
	|	ДетальныеДанные КАК ДетальныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияАналитическихСчетовКЭК КАК СоответствияАналитическихСчетовКЭК
	|		ПО ДетальныеДанные.Счет = СоответствияАналитическихСчетовКЭК.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Счет
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствияАналитическихСчетовКЭК.КЭК) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДетальныеДанные.Счет КАК КорСчет,
	|	ДетальныеДанные.КПС КАК КПС,
	|	ДетальныеДанные.КФО КАК КФО,
	|	ДетальныеДанные.Валюта КАК ВалютаДокумента,
	|	ДетальныеДанные.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА СУММА(ДетальныеДанные.ПредыдущийАвансОстаток) - СУММА(ДетальныеДанные.ПредыдущийАвансПерерасход) + СУММА(ДетальныеДанные.Получено) - СУММА(ДетальныеДанные.Израсходовано) - СУММА(ДетальныеДанные.ВозвращенОстаток) + СУММА(ДетальныеДанные.ВыданПерерасход) < 0
	|			ТОГДА -СУММА(ДетальныеДанные.ПредыдущийАвансОстаток) + СУММА(ДетальныеДанные.ПредыдущийАвансПерерасход) - СУММА(ДетальныеДанные.Получено) + СУММА(ДетальныеДанные.Израсходовано) + СУММА(ДетальныеДанные.ВозвращенОстаток) - СУММА(ДетальныеДанные.ВыданПерерасход)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	АвансовыйОтчет.Организация КАК Организация,
	|	АвансовыйОтчет.ИФО КАК ИФО,
	|	АвансовыйОтчет.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.ЗаявлениеНаВыдачуАванса = ЗНАЧЕНИЕ(Документ.ЗаявлениеНаВыдачуАванса.ПустаяСсылка)
	|			ТОГДА АвансовыйОтчет.ОснованиеПринятияОбязательства
	|		ИНАЧЕ АвансовыйОтчет.ЗаявлениеНаВыдачуАванса.ОснованиеПринятияОбязательства
	|	КОНЕЦ КАК Договор,
	|	ЕСТЬNULL(СчетКЭК.КЭК, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭК
	|ИЗ
	|	ДетальныеДанные КАК ДетальныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетКЭК КАК СчетКЭК
	|		ПО ДетальныеДанные.Счет = СчетКЭК.Счет,
	|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &АвансовыйОчетСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДетальныеДанные.Счет,
	|	ДетальныеДанные.КПС,
	|	ДетальныеДанные.КФО,
	|	ДетальныеДанные.Валюта,
	|	ДетальныеДанные.Контрагент,
	|	АвансовыйОтчет.Организация,
	|	АвансовыйОтчет.ИФО,
	|	АвансовыйОтчет.Подразделение,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.ЗаявлениеНаВыдачуАванса = ЗНАЧЕНИЕ(Документ.ЗаявлениеНаВыдачуАванса.ПустаяСсылка)
	|			ТОГДА АвансовыйОтчет.ОснованиеПринятияОбязательства
	|		ИНАЧЕ АвансовыйОтчет.ЗаявлениеНаВыдачуАванса.ОснованиеПринятияОбязательства
	|	КОНЕЦ,
	|	СчетКЭК.КЭК
	|
	|ИМЕЮЩИЕ
	|	СУММА(ДетальныеДанные.ПредыдущийАвансОстаток) - СУММА(ДетальныеДанные.ПредыдущийАвансПерерасход) + СУММА(ДетальныеДанные.Получено) - СУММА(ДетальныеДанные.Израсходовано) - СУММА(ДетальныеДанные.ВозвращенОстаток) + СУММА(ДетальныеДанные.ВыданПерерасход) < 0
	|ИТОГИ
	|	МАКСИМУМ(Контрагент),
	|	СУММА(Сумма),
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(ИФО),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(Договор)
	|ПО
	|	ВалютаДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	КорСчет = БухгалтерскийУчет.СчетПоКоду("208.00", ТекущаяДатаСеанса());
	
	ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(Ссылка);
	СчетКонтрагента = Справочники.БанковскиеИКазначейскиеСчета.ПолучитьСчетПоУмолчанию(Контрагент, ИмяТаблицы);
	
	Документы.ЗаявкаНаКассовыйРасход.ЗаполнитьРеквизитыПолучателя(ЭтотОбъект);
	
	КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, ТекущаяДатаСеанса());
	Курс = КурсКратность.Курс;
	Кратность = КурсКратность.Кратность;
	
	РасшифровкаПлатежа.Очистить();
	
	ВыборкаРасшифровка = Выборка.Выбрать();
	Пока ВыборкаРасшифровка.Следующий() Цикл
		
		СтрРасшифровка = РасшифровкаПлатежа.Добавить();
		СтрРасшифровка.КФО = ВыборкаРасшифровка.КФО;
		СтрРасшифровка.КБКНазначениеПлатежа = ВыборкаРасшифровка.КПС;
		СтрРасшифровка.КОСГУНазначениеПлатежа = ВыборкаРасшифровка.КЭК;
		СтрРасшифровка.СуммаВал = ВыборкаРасшифровка.Сумма;
		СтрРасшифровка.Сумма = ВыборкаРасшифровка.Сумма * Курс / ?(Кратность = 0, 1, Кратность);
		СтрРасшифровка.ВидРасчетов = ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг");
		
		ДопустимыеИсточникиСредств = ПлатежноРасчетныеДокументыПовтИсп.ДопустимыеИсточникиСредств(ЛицевойСчет, СтрРасшифровка.КФО);
		Если ДопустимыеИсточникиСредств.Количество() = 1 Тогда
			СтрРасшифровка.ИсточникСредств = ДопустимыеИсточникиСредств[0];
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаДокументаВВалюте = РасшифровкаПлатежа.Итог("СуммаВал");
	СуммаДокумента = РасшифровкаПлатежа.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
