#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьСуммуДолга = Истина;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаполнитьСуммуДолга",
		"Доступность", Ложь);
	
	УправлениеДоступностьюЭлементовФормы(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	УправлениеДоступностьюЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВсяЗадолженностьСогласованаПриИзменении(Элемент)

	Если Не ВсяЗадолженностьСогласована Тогда
		ДокументОснованиеОсновногоДолга = Ложь;
		ДокументОснованиеПроценты       = Ложь;
	КонецЕсли;

	УправлениеДоступностьюЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОсновногоДолгаПриИзменении(Элемент)
	УстановитьДоступностьРеквизитовДокументаОснования(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПроцентыПриИзменении(Элемент)
	УстановитьДоступностьРеквизитовДокументаОснованияПоПроцентам(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СуммаДолгаНаименованиеДокументаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", , Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НачисленныеПроцентыНаименованиеДокументаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", , Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	РезультатЗакрытия = Новый Структура;
	РезультатЗакрытия.Вставить("ЗаполнитьСуммуДолга",                      ЗаполнитьСуммуДолга);
	РезультатЗакрытия.Вставить("ВсяЗадолженностьСогласована",              ВсяЗадолженностьСогласована);
	РезультатЗакрытия.Вставить("ДокументОснованиеОсновногоДолга",          ДокументОснованиеОсновногоДолга);
	РезультатЗакрытия.Вставить("СуммаДолгаНаименованиеДокумента",          СуммаДолгаНаименованиеДокумента);
	РезультатЗакрытия.Вставить("СуммаДолгаДатаДокумента",                  СуммаДолгаДатаДокумента);
	РезультатЗакрытия.Вставить("СуммаДолгаНомерДокумента",                 СуммаДолгаНомерДокумента);
	РезультатЗакрытия.Вставить("ДокументОснованиеПроценты",                ДокументОснованиеПроценты);
	РезультатЗакрытия.Вставить("НачисленныеПроцентыНаименованиеДокумента", НачисленныеПроцентыНаименованиеДокумента);
	РезультатЗакрытия.Вставить("НачисленныеПроцентыДатаДокумента",         НачисленныеПроцентыДатаДокумента);
	РезультатЗакрытия.Вставить("НачисленныеПроцентыНомерДокумента",        НачисленныеПроцентыНомерДокумента);
	РезультатЗакрытия.Вставить("ЗаполнитьПросроченнуюЗадолженность",       ЗаполнитьПросроченнуюЗадолженность);

	Закрыть(РезультатЗакрытия);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеДоступностьюЭлементовФормы(Форма)
	
	Элементы = Форма.Элементы;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснованиеОсновногоДолга",
		"Доступность", Форма.ВсяЗадолженностьСогласована);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснованиеПроценты",
		"Доступность", Форма.ВсяЗадолженностьСогласована);
	
	УстановитьДоступностьРеквизитовДокументаОснования(Форма);
	УстановитьДоступностьРеквизитовДокументаОснованияПоПроцентам(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитовДокументаОснования(Форма)

	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаДолгаНаименованиеДокумента",
		"Доступность", Форма.ДокументОснованиеОсновногоДолга);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаДолгаДатаДокумента",
		"Доступность", Форма.ДокументОснованиеОсновногоДолга);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СуммаДолгаНомерДокумента",
		"Доступность", Форма.ДокументОснованиеОсновногоДолга);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитовДокументаОснованияПоПроцентам(Форма)

	Элементы = Форма.Элементы;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленныеПроцентыНаименованиеДокумента",
		"Доступность", Форма.ДокументОснованиеПроценты);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленныеПроцентыДатаДокумента",
		"Доступность", Форма.ДокументОснованиеПроценты);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "НачисленныеПроцентыНомерДокумента",
		"Доступность", Форма.ДокументОснованиеПроценты);
	
КонецПроцедуры
	
#КонецОбласти

