
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СоответствиеОтборов = Новый Соответствие;
	СоответствиеОтборов.Вставить("Бюджет","Бюджет");
	СоответствиеОтборов.Вставить("НаДату","НаДату");
	
	Если Параметры.Свойство("Бюджет", Бюджет) И ЗначениеЗаполнено(Параметры.Бюджет) Тогда
		Если НЕ ТипЗнч(Параметры.ДополнительныйОтбор) = Тип("Структура") Тогда
			Параметры.ДополнительныйОтбор = Новый Структура;
		КонецЕсли;
		Параметры.ДополнительныйОтбор.Вставить("Бюджет", Бюджет);
	КонецЕсли;	
	
	БюджетнаяКлассификация.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, Отказ, СоответствиеОтборов);
	
	Если ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		
		НачальноеЗначениеВыбора = Параметры.ТекущаяСтрока;
		
		Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("Строка") Тогда

			НачальноеЗначениеВыбора =  Справочники.ГлавыПоБюджетнойКлассификации.НайтиВКлассификации(Параметры.ТекущаяСтрока, Бюджет, НаДату);
			
		КонецЕсли;	
		
		Параметры.ТекущаяСтрока = НачальноеЗначениеВыбора;

		Элементы.Список.ТекущаяСтрока = НачальноеЗначениеВыбора;
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	БюджетнаяКлассификацияКлиентСервер.УстановитьОтборНаДату(ЭтаФорма,НаДату);
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетПриИзменении(Элемент)
	БюджетнаяКлассификацияКлиентСервер.УстановитьОтборПоБюджету(ЭтаФорма,Бюджет);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	БюджетнаяКлассификацияКлиентСервер.ПриОбновленииСоставаПользовательскихНастроек(СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
