#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация,Дата,ВалютаДокумента,АвтоматическиОтразитьВГрафикахИсполненияДоговоров");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("СведенияОбОбъектахПравПользованияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	ОсновныеСведения.ДатаПринятияКУчету КАК Период,
	|	ОсновныеСведения.Ссылка.Договор КАК Договор,
	|	ОсновныеСведения.Ссылка.Организация КАК Организация,
	|	ОсновныеСведения.ОсновноеСредство КАК ОсновноеСредство,
	|	ОсновныеСведения.УсловиеПользования КАК УсловиеПользования,
	|	ОсновныеСведения.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	ОсновныеСведения.ДатаНачалаАмортизации КАК ДатаНачалаСрокаПользования,
	|	ОсновныеСведения.ДатаОкончанияАмортизации КАК ДатаОкончанияСрокаПользования,
	|	ОсновныеСведения.АренднаяПлатаСумма КАК АренднаяПлатаСумма,
	|	ОсновныеСведения.АренднаяПлатаЗаПериод КАК АренднаяПлатаЗаПериод,
	|	ОсновныеСведения.АренднаяПлатаДеньНачисления КАК АренднаяПлатаДеньНачисления,
	|	ОсновныеСведения.ВидПервичногоДокумента КАК ДокументОснованиеВид,
	|	ОсновныеСведения.ДатаПервичногоДокумента КАК ДокументОснованиеДата,
	|	ОсновныеСведения.НомерПервичногоДокумента КАК ДокументОснованиеНомер,
	|	NULL КАК ТипИзмененийУсловийПользования,
	|	NULL КАК НачалоПериодаПересчета,
	|	NULL КАК КонецПериодаПересчета,
	|	ОсновныеСведения.ДатаПриемкиОбъектаВПользование КАК ДатаПриемкиОбъектаВПользование
	|ИЗ
	|	Документ.ВводИсторииПравПользованияОС.ОсновныеСредства КАК ОсновныеСведения
	|ГДЕ
	|	ОсновныеСведения.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОбИзменениях.ДатаИзменения,
	|	СведенияОбИзменениях.Ссылка.Договор,
	|	СведенияОбИзменениях.Ссылка.Организация,
	|	СведенияОбИзменениях.ОсновноеСредство,
	|	СведенияОбИзменениях.УсловиеПользования,
	|	NULL,
	|	СведенияОбИзменениях.ДатаНачалаАмортизации,
	|	СведенияОбИзменениях.ДатаОкончанияАмортизации,
	|	СведенияОбИзменениях.АренднаяПлатаСумма,
	|	СведенияОбИзменениях.АренднаяПлатаЗаПериод,
	|	NULL,
	|	СведенияОбИзменениях.ВидПервичногоДокумента,
	|	СведенияОбИзменениях.ДатаПервичногоДокумента,
	|	СведенияОбИзменениях.НомерПервичногоДокумента,
	|	СведенияОбИзменениях.ТипИзмененийУсловийПользования,
	|	СведенияОбИзменениях.НачалоПериодаПересчета,
	|	СведенияОбИзменениях.КонецПериодаПересчета,
	|	NULL
	|ИЗ
	|	Документ.ВводИсторииПравПользованияОС.СведенияОбИзменениях КАК СведенияОбИзменениях
	|ГДЕ
	|	СведенияОбИзменениях.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	НомераТаблиц.Вставить("ГрафикАмортизацииПравПользованияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ВводИсторииПравПользованияОС.Ссылка КАК Ссылка,
	|	ВводИсторииПравПользованияОС.ДатаПринятияКУчету КАК Период,
	|	ВводИсторииПравПользованияОС.Ссылка.Организация КАК Организация,
	|	ВводИсторииПравПользованияОС.Ссылка.Договор КАК Договор,
	|	ГрафикАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	ГрафикАмортизации.ДатаНачисленияАмортизации КАК ДатаНачисленияАмортизации,
	|	ГрафикАмортизации.ОплатитьДо КАК ОплатитьДо,
	|	ИСТИНА КАК ПоПервоначальнойОценке,
	|	ГрафикАмортизации.Амортизация КАК Амортизация,
	|	ГрафикАмортизации.АренднаяПлата КАК АренднаяПлата
	|ИЗ
	|	Документ.ВводИсторииПравПользованияОС.ОсновныеСредства КАК ВводИсторииПравПользованияОС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИсторииПравПользованияОС.ПервоначальныйГрафикАмортизации КАК ГрафикАмортизации
	|		ПО ВводИсторииПравПользованияОС.Ссылка = ГрафикАмортизации.Ссылка
	|			И ВводИсторииПравПользованияОС.ОсновноеСредство = ГрафикАмортизации.ОсновноеСредство
	|ГДЕ
	|	ВводИсторииПравПользованияОС.Ссылка = &Ссылка
	|	И (ГрафикАмортизации.Амортизация <> 0
	|			ИЛИ ГрафикАмортизации.АренднаяПлата <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОбИзменениях.Ссылка,
	|	СведенияОбИзменениях.ДатаИзменения,
	|	СведенияОбИзменениях.Ссылка.Организация,
	|	СведенияОбИзменениях.Ссылка.Договор,
	|	ГрафикАмортизации.ОсновноеСредство,
	|	ГрафикАмортизации.ДатаНачисленияАмортизации,
	|	ГрафикАмортизации.ОплатитьДо,
	|	ЛОЖЬ,
	|	ГрафикАмортизации.Амортизация,
	|	ГрафикАмортизации.АренднаяПлата
	|ИЗ
	|	Документ.ВводИсторииПравПользованияОС.СведенияОбИзменениях КАК СведенияОбИзменениях
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИсторииПравПользованияОС.ГрафикАмортизации КАК ГрафикАмортизации
	|		ПО СведенияОбИзменениях.Ссылка = ГрафикАмортизации.Ссылка
	|			И СведенияОбИзменениях.ОсновноеСредство = ГрафикАмортизации.ОсновноеСредство
	|			И СведенияОбИзменениях.ДатаИзменения = ГрафикАмортизации.ДатаИзменения
	|ГДЕ
	|	СведенияОбИзменениях.Ссылка = &Ссылка
	|	И (ГрафикАмортизации.Амортизация <> 0
	|			ИЛИ ГрафикАмортизации.АренднаяПлата <> 0)";
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров")
		И ЗначенияРеквизитов.АвтоматическиОтразитьВГрафикахИсполненияДоговоров Тогда
		
		Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(ЗначенияРеквизитов.ВалютаДокумента), ЗначенияРеквизитов.ВалютаДокумента,
			Константы.ВалютаРегламентированногоУчета.Получить()));
		
		НомераТаблиц.Вставить("ИсполнениеОбязательствПоставщиками", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ГрафикАмортизации.ДатаНачисленияАмортизации КАК Период,
		|	ПервоначальныеСведения.Ссылка.Организация КАК Организация,
		|	ПервоначальныеСведения.Ссылка.Контрагент КАК Контрагент,
		|	ПервоначальныеСведения.Ссылка.Договор КАК Договор,
		|	ПервоначальныеСведения.СчетРасчетов КАК СчетРасчетов,
		|	&Валюта КАК Валюта,
		|	ПервоначальныеСведения.Ссылка.ИФО КАК ИФО,
		|	ПервоначальныеСведения.Ссылка.КФО КАК КФО,
		|	ПервоначальныеСведения.КПСРасчетов КАК КПС,
		|	ПервоначальныеСведения.КЭКРасходов КАК КЭК,
		|	ПервоначальныеСведения.ОсновноеСредство КАК ОсновноеСредство,
		|	ГрафикАмортизации.ДатаНачисленияАмортизации КАК ИсполнитьДо,
		|	ГрафикАмортизации.АренднаяПлата КАК Сумма
		|ИЗ
		|	Документ.ВводИсторииПравПользованияОС.ОсновныеСредства КАК ПервоначальныеСведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИсторииПравПользованияОС.ПервоначальныйГрафикАмортизации КАК ГрафикАмортизации
		|		ПО ПервоначальныеСведения.Ссылка = ГрафикАмортизации.Ссылка
		|			И ПервоначальныеСведения.ОсновноеСредство = ГрафикАмортизации.ОсновноеСредство
		|ГДЕ
		|	ПервоначальныеСведения.Ссылка = &Ссылка
		|	И ПервоначальныеСведения.Ссылка.Договор.ВестиПланГрафикИсполнения
		|	И ГрафикАмортизации.АренднаяПлата <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрафикАмортизации.ДатаНачисленияАмортизации,
		|	СведенияОбИзменениях.Ссылка.Организация,
		|	СведенияОбИзменениях.Ссылка.Контрагент,
		|	СведенияОбИзменениях.Ссылка.Договор,
		|	СведенияОбИзменениях.СчетРасчетов,
		|	&Валюта,
		|	СведенияОбИзменениях.Ссылка.ИФО,
		|	СведенияОбИзменениях.Ссылка.КФО,
		|	СведенияОбИзменениях.КПСРасчетов,
		|	СведенияОбИзменениях.КЭКРасходов,
		|	СведенияОбИзменениях.ОсновноеСредство,
		|	ГрафикАмортизации.ДатаНачисленияАмортизации,
		|	ГрафикАмортизации.АренднаяПлата
		|ИЗ
		|	Документ.ВводИсторииПравПользованияОС.СведенияОбИзменениях КАК СведенияОбИзменениях
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИсторииПравПользованияОС.ГрафикАмортизации КАК ГрафикАмортизации
		|		ПО СведенияОбИзменениях.Ссылка = ГрафикАмортизации.Ссылка
		|			И СведенияОбИзменениях.ОсновноеСредство = ГрафикАмортизации.ОсновноеСредство
		|			И СведенияОбИзменениях.ДатаИзменения = ГрафикАмортизации.ДатаИзменения
		|ГДЕ
		|	СведенияОбИзменениях.Ссылка = &Ссылка
		|	И СведенияОбИзменениях.Ссылка.Договор.ВестиПланГрафикИсполнения
		|	И ГрафикАмортизации.АренднаяПлата <> 0";
		
		НомераТаблиц.Вставить("ОплатаПоставщикамКредиторам", НомераТаблиц.Количество());
		Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
		"ВЫБРАТЬ
		|	ГрафикАмортизации.ОплатитьДо КАК Период,
		|	ПервоначальныеСведения.Ссылка.Организация КАК Организация,
		|	ПервоначальныеСведения.Ссылка.Контрагент КАК Контрагент,
		|	ПервоначальныеСведения.Ссылка.Договор КАК Договор,
		|	ПервоначальныеСведения.СчетРасчетов КАК СчетРасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг) КАК ВидРасчетов,
		|	&Валюта КАК Валюта,
		|	ПервоначальныеСведения.Ссылка.ИФО КАК ИФО,
		|	ПервоначальныеСведения.Ссылка.КФО КАК КФО,
		|	ПервоначальныеСведения.КПСРасчетов КАК КПС,
		|	ПервоначальныеСведения.КЭКРасходов КАК КЭК,
		|	ПервоначальныеСведения.ОсновноеСредство КАК ОсновноеСредство,
		|	ГрафикАмортизации.ОплатитьДо КАК ОплатитьДо,
		|	ГрафикАмортизации.АренднаяПлата КАК Сумма
		|ИЗ
		|	Документ.ВводИсторииПравПользованияОС.ОсновныеСредства КАК ПервоначальныеСведения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИсторииПравПользованияОС.ПервоначальныйГрафикАмортизации КАК ГрафикАмортизации
		|		ПО ПервоначальныеСведения.Ссылка = ГрафикАмортизации.Ссылка
		|			И ПервоначальныеСведения.ОсновноеСредство = ГрафикАмортизации.ОсновноеСредство
		|ГДЕ
		|	ПервоначальныеСведения.Ссылка = &Ссылка
		|	И ПервоначальныеСведения.Ссылка.Договор.ВестиГрафикПлатежей
		|	И ГрафикАмортизации.АренднаяПлата <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ГрафикАмортизации.ОплатитьДо,
		|	СведенияОбИзменениях.Ссылка.Организация,
		|	СведенияОбИзменениях.Ссылка.Контрагент,
		|	СведенияОбИзменениях.Ссылка.Договор,
		|	СведенияОбИзменениях.СчетРасчетов,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыРасчетовПоЗаймам.ОсновнойДолг),
		|	&Валюта,
		|	СведенияОбИзменениях.Ссылка.ИФО,
		|	СведенияОбИзменениях.Ссылка.КФО,
		|	СведенияОбИзменениях.КПСРасчетов,
		|	СведенияОбИзменениях.КЭКРасходов,
		|	СведенияОбИзменениях.ОсновноеСредство,
		|	ГрафикАмортизации.ОплатитьДо,
		|	ГрафикАмортизации.АренднаяПлата
		|ИЗ
		|	Документ.ВводИсторииПравПользованияОС.СведенияОбИзменениях КАК СведенияОбИзменениях
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводИсторииПравПользованияОС.ГрафикАмортизации КАК ГрафикАмортизации
		|		ПО СведенияОбИзменениях.Ссылка = ГрафикАмортизации.Ссылка
		|			И СведенияОбИзменениях.ОсновноеСредство = ГрафикАмортизации.ОсновноеСредство
		|			И СведенияОбИзменениях.ДатаИзменения = ГрафикАмортизации.ДатаИзменения
		|ГДЕ
		|	СведенияОбИзменениях.Ссылка = &Ссылка
		|	И СведенияОбИзменениях.Ссылка.Договор.ВестиГрафикПлатежей
		|	И ГрафикАмортизации.АренднаяПлата <> 0";
		
	КонецЕсли;
	
	НомераТаблиц.Вставить("ВТ_СведенияОбИмуществе", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВТ_ПриемкаОбъектовВПользование", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("СоставОбъектовПравПользованияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	СведенияОбИмуществе.Ссылка.Дата КАК Дата,
	|	СведенияОбИмуществе.Ссылка.Договор КАК Договор,
	|	СведенияОбИмуществе.Ссылка.Организация КАК Организация,
	|	СведенияОбИмуществе.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияОбИмуществе.НаименованиеОбъекта КАК НаименованиеОбъекта,
	|	СведенияОбИмуществе.Количество КАК Количество,
	|	СведенияОбИмуществе.НаименованиеХарактеристик КАК НаименованиеХарактеристик,
	|	СведенияОбИмуществе.ЗначениеХарактеристик КАК ЗначениеХарактеристик
	|ПОМЕСТИТЬ ВТ_СведенияОбИмуществе
	|ИЗ
	|	Документ.ВводИсторииПравПользованияОС.СведенияОбИмуществе КАК СведенияОбИмуществе
	|ГДЕ
	|	СведенияОбИмуществе.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВводИсторииПравПользованияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	МИНИМУМ(ВводИсторииПравПользованияОСОсновныеСредства.ДатаПриемкиОбъектаВПользование) КАК ДатаПриемкиОбъектаВПользование
	|ПОМЕСТИТЬ ВТ_ПриемкаОбъектовВПользование
	|ИЗ
	|	Документ.ВводИсторииПравПользованияОС.ОсновныеСредства КАК ВводИсторииПравПользованияОСОсновныеСредства
	|ГДЕ
	|	ВводИсторииПравПользованияОСОсновныеСредства.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводИсторииПравПользованияОСОсновныеСредства.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ПриемкаОбъектовВПользование.ДатаПриемкиОбъектаВПользование, СведенияОбИмуществе.Дата) КАК Период,
	|	СведенияОбИмуществе.Договор КАК Договор,
	|	СведенияОбИмуществе.Организация КАК Организация,
	|	СведенияОбИмуществе.ОсновноеСредство КАК ОсновноеСредство,
	|	СведенияОбИмуществе.НаименованиеОбъекта КАК НаименованиеОбъекта,
	|	СведенияОбИмуществе.Количество КАК Количество,
	|	СведенияОбИмуществе.НаименованиеХарактеристик КАК НаименованиеХарактеристик,
	|	СведенияОбИмуществе.ЗначениеХарактеристик КАК ЗначениеХарактеристик,
	|	ПриемкаОбъектовВПользование.ДатаПриемкиОбъектаВПользование КАК ДатаПриемкиОбъектаВПользование
	|ИЗ
	|	ВТ_СведенияОбИмуществе КАК СведенияОбИмуществе
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПриемкаОбъектовВПользование КАК ПриемкаОбъектовВПользование
	|		ПО СведенияОбИмуществе.ОсновноеСредство = ПриемкаОбъектовВПользование.ОсновноеСредство";
	
	Результат = Запрос.ВыполнитьПакет();
	
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(СтруктураДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Функция ЗаполнитьОсновныеСведения(Объект) Экспорт
	
	Отказ = Ложь;
	
	Объект.ОсновныеСредства.Очистить();
	
	// 1. По документам ПринятиеКУчетуПравПользованияОС.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Договор",     Объект.Договор);
	Запрос.УстановитьПараметр("Счета11140",  БухгалтерскийУчет.СписокСчетов("111.40"));
	Запрос.УстановитьПараметр("Счета30200",  БухгалтерскийУчет.СписокСчетов("302.00"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты11140.Организация КАК Организация,
	|	ВЫРАЗИТЬ(Обороты11140.Регистратор КАК Документ.ПринятиеКУчетуПравПользованияОС) КАК Регистратор,
	|	Обороты11140.Период КАК Период,
	|	Обороты11140.СчетДт КАК Счет11140,
	|	ВЫРАЗИТЬ(Обороты11140.СубконтоДт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(Обороты11140.СубконтоДт2 КАК Справочник.Договоры) КАК Договор,
	|	ВЫРАЗИТЬ(Обороты11140.СубконтоДт3 КАК Справочник.ЦМО) КАК ЦМО,
	|	Обороты11140.СуммаОборот КАК ВсегоСправедливая,
	|	ВЫБОР
	|		КОГДА Обороты11140.СчетКт В (&Счета30200)
	|			ТОГДА Обороты11140.СуммаОборот
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Всего
	|ПОМЕСТИТЬ ПринятиеКУчетуПравПользования
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			,
	|			,
	|			Регистратор,
	|			СчетДт В ИЕРАРХИИ (&Счета11140),
	|			,
	|			,
	|			,
	|			СубконтоДт2 = &Договор
	|				И Организация = &Организация) КАК Обороты11140
	|ГДЕ
	|	Обороты11140.Регистратор ССЫЛКА Документ.ПринятиеКУчетуПравПользованияОС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПринятиеКУчетуПравПользования.Организация КАК Организация,
	|	ПринятиеКУчетуПравПользования.Регистратор КАК Регистратор,
	|	ПринятиеКУчетуПравПользования.Период КАК Период,
	|	ПринятиеКУчетуПравПользования.Счет11140 КАК Счет11140,
	|	ПринятиеКУчетуПравПользования.ОсновноеСредство КАК ОсновноеСредство,
	|	ПринятиеКУчетуПравПользования.ЦМО КАК ЦМО,
	|	ПринятиеКУчетуПравПользования.Договор КАК Договор,
	|	ПринятиеКУчетуПравПользования.Договор.ВидОбязательства КАК ВидПервичногоДокумента,
	|	ПринятиеКУчетуПравПользования.Договор.ДатаДоговора КАК ДатаПервичногоДокумента,
	|	ПринятиеКУчетуПравПользования.Договор.НомерДоговора КАК НомерПервичногоДокумента,
	|	ДокументРегистратор.Номер КАК РегистраторНомер,
	|	ДокументРегистратор.Дата КАК РегистраторДата,
	|	ДокументРегистратор.ВидПервичногоДокумента КАК РегистраторВидПервичногоДокумента,
	|	ДокументРегистратор.ДатаПервичногоДокумента КАК РегистраторДатаПервичногоДокумента,
	|	ДокументРегистратор.НомерПервичногоДокумента КАК РегистраторНомерПервичногоДокумента,
	|	СУММА(ПринятиеКУчетуПравПользования.ВсегоСправедливая) КАК ВсегоСправедливая,
	|	СУММА(ПринятиеКУчетуПравПользования.Всего) КАК Всего
	|ПОМЕСТИТЬ ПервоначальныеСведения
	|ИЗ
	|	ПринятиеКУчетуПравПользования КАК ПринятиеКУчетуПравПользования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуПравПользованияОС КАК ДокументРегистратор
	|		ПО ПринятиеКУчетуПравПользования.Регистратор = ДокументРегистратор.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПринятиеКУчетуПравПользования.Организация,
	|	ПринятиеКУчетуПравПользования.Регистратор,
	|	ПринятиеКУчетуПравПользования.Период,
	|	ПринятиеКУчетуПравПользования.Счет11140,
	|	ПринятиеКУчетуПравПользования.ОсновноеСредство,
	|	ПринятиеКУчетуПравПользования.ЦМО,
	|	ПринятиеКУчетуПравПользования.Договор,
	|	ПринятиеКУчетуПравПользования.Договор.ВидОбязательства,
	|	ПринятиеКУчетуПравПользования.Договор.ДатаДоговора,
	|	ПринятиеКУчетуПравПользования.Договор.НомерДоговора,
	|	ДокументРегистратор.Дата,
	|	ДокументРегистратор.Номер,
	|	ДокументРегистратор.ВидПервичногоДокумента,
	|	ДокументРегистратор.НомерПервичногоДокумента,
	|	ДокументРегистратор.ДатаПервичногоДокумента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Период,
	|	Организация,
	|	Договор,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизацииПравПользованияОС.Регистратор КАК Регистратор,
	|	ПараметрыАмортизацииПравПользованияОС.Период КАК Период,
	|	ПараметрыАмортизацииПравПользованияОС.Организация КАК Организация,
	|	ПараметрыАмортизацииПравПользованияОС.Договор КАК Договор,
	|	ПараметрыАмортизацииПравПользованияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииПравПользованияОС.ВидОперации КАК ВидОперации,
	|	ПараметрыАмортизацииПравПользованияОС.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	ПараметрыАмортизацииПравПользованияОС.ДатаНачалаАмортизации КАК ДатаНачалаАмортизации,
	|	ПараметрыАмортизацииПравПользованияОС.ДатаОкончанияАмортизации КАК ДатаОкончанияАмортизации,
	|	ПараметрыАмортизацииПравПользованияОС.СчетРасчетов КАК СчетРасчетов,
	|	ПараметрыАмортизацииПравПользованияОС.КПСРасчетов КАК КПСРасчетов,
	|	ПараметрыАмортизацииПравПользованияОС.КЭКРасходов КАК КЭКРасходов
	|ПОМЕСТИТЬ ПараметрыАмортизацииВРегистраторе
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииПравПользованияОС КАК ПараметрыАмортизацииПравПользованияОС
	|ГДЕ
	|	ПараметрыАмортизацииПравПользованияОС.Договор = &Договор
	|	И ПараметрыАмортизацииПравПользованияОС.Организация = &Организация
	|	И ПараметрыАмортизацииПравПользованияОС.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ПервоначальныеСведения.Регистратор
	|			ИЗ
	|				ПервоначальныеСведения КАК ПервоначальныеСведения)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Период,
	|	Организация,
	|	Договор,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведения.Регистратор КАК Регистратор,
	|	ПервоначальныеСведения.Период КАК Период,
	|	ПервоначальныеСведения.Организация КАК Организация,
	|	ПервоначальныеСведения.Счет11140 КАК Счет11140,
	|	ПервоначальныеСведения.ОсновноеСредство КАК ОсновноеСредство,
	|	ПервоначальныеСведения.Договор КАК Договор,
	|	ПервоначальныеСведения.ЦМО КАК ЦМО,
	|	ПервоначальныеСведения.РегистраторНомер КАК РегистраторНомер,
	|	ПервоначальныеСведения.РегистраторДата КАК РегистраторДата,
	|	ПервоначальныеСведения.РегистраторДата КАК ДатаПринятияКУчету,
	|	ПервоначальныеСведения.РегистраторВидПервичногоДокумента КАК РегистраторВидПервичногоДокумента,
	|	ПервоначальныеСведения.РегистраторДатаПервичногоДокумента КАК РегистраторДатаПервичногоДокумента,
	|	ПервоначальныеСведения.РегистраторНомерПервичногоДокумента КАК РегистраторНомерПервичногоДокумента,
	|	ПервоначальныеСведения.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ПервоначальныеСведения.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ПервоначальныеСведения.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	ПервоначальныеСведения.ВсегоСправедливая КАК ВсегоСправедливая,
	|	ПервоначальныеСведения.Всего КАК Всего,
	|	ПараметрыАмортизацииВРегистраторе.ВидОперации КАК ВидОперации,
	|	ПараметрыАмортизацииВРегистраторе.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	ПараметрыАмортизацииВРегистраторе.ДатаНачалаАмортизации КАК ДатаНачалаАмортизации,
	|	ПараметрыАмортизацииВРегистраторе.ДатаОкончанияАмортизации КАК ДатаОкончанияАмортизации,
	|	ПараметрыАмортизацииВРегистраторе.СчетРасчетов КАК СчетРасчетов,
	|	ПараметрыАмортизацииВРегистраторе.КПСРасчетов КАК КПСРасчетов,
	|	ПараметрыАмортизацииВРегистраторе.КЭКРасходов КАК КЭКРасходов
	|ИЗ
	|	ПервоначальныеСведения КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииВРегистраторе КАК ПараметрыАмортизацииВРегистраторе
	|		ПО ПервоначальныеСведения.Регистратор = ПараметрыАмортизацииВРегистраторе.Регистратор
	|			И ПервоначальныеСведения.Период = ПараметрыАмортизацииВРегистраторе.Период
	|			И ПервоначальныеСведения.Организация = ПараметрыАмортизацииВРегистраторе.Организация
	|			И ПервоначальныеСведения.Договор = ПараметрыАмортизацииВРегистраторе.Договор
	|			И ПервоначальныеСведения.ОсновноеСредство = ПараметрыАмортизацииВРегистраторе.ОсновноеСредство";
	
	ОсновныеСведения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаСведений Из ОсновныеСведения Цикл
		
		НоваяСтрока = Объект.ОсновныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСведений);
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.ВидПервичногоДокумента)
			И Не ЗначениеЗаполнено(НоваяСтрока.ДатаПервичногоДокумента)
			И Не ЗначениеЗаполнено(НоваяСтрока.НомерПервичногоДокумента) Тогда
			// Если в договоре не заполнены реквизиты, возьмем из документа принятия к учету.
			НоваяСтрока.ВидПервичногоДокумента = СтрокаСведений.РегистраторВидПервичногоДокумента;
			НоваяСтрока.ДатаПервичногоДокумента = СтрокаСведений.РегистраторДатаПервичногоДокумента;
			НоваяСтрока.НомерПервичногоДокумента = СтрокаСведений.РегистраторНомерПервичногоДокумента;
		КонецЕсли;
		
	КонецЦикла;
	
	// 2. По документам ВводНачальныхОстатков.
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Договор",     Объект.Договор);
	Запрос.УстановитьПараметр("Счета11140",  БухгалтерскийУчет.СписокСчетов("111.40"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Обороты11140.Организация КАК Организация,
	|	ВЫРАЗИТЬ(Обороты11140.Регистратор КАК Документ.ВводНачальныхОстатков) КАК Регистратор,
	|	Обороты11140.Период КАК Период,
	|	Обороты11140.СчетДт КАК Счет11140,
	|	ВЫРАЗИТЬ(Обороты11140.СубконтоДт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ВЫРАЗИТЬ(Обороты11140.СубконтоДт2 КАК Справочник.Договоры) КАК Договор,
	|	ВЫРАЗИТЬ(Обороты11140.СубконтоДт3 КАК Справочник.ЦМО) КАК ЦМО
	|ПОМЕСТИТЬ ВводОстатковПравПользования
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ОборотыДтКт(
	|			,
	|			,
	|			Регистратор,
	|			СчетДт В ИЕРАРХИИ (&Счета11140),
	|			,
	|			,
	|			,
	|			СубконтоДт2 = &Договор
	|				И Организация = &Организация) КАК Обороты11140
	|ГДЕ
	|	Обороты11140.Регистратор ССЫЛКА Документ.ВводНачальныхОстатков
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Период,
	|	Организация,
	|	Договор,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыАмортизацииПравПользованияОС.Регистратор КАК Регистратор,
	|	ПараметрыАмортизацииПравПользованияОС.Период КАК Период,
	|	ПараметрыАмортизацииПравПользованияОС.Организация КАК Организация,
	|	ПараметрыАмортизацииПравПользованияОС.Договор КАК Договор,
	|	ПараметрыАмортизацииПравПользованияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииПравПользованияОС.ВидОперации КАК ВидОперации,
	|	ПараметрыАмортизацииПравПользованияОС.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	ПараметрыАмортизацииПравПользованияОС.ДатаНачалаАмортизации КАК ДатаНачалаАмортизации,
	|	ПараметрыАмортизацииПравПользованияОС.ДатаОкончанияАмортизации КАК ДатаОкончанияАмортизации,
	|	ПараметрыАмортизацииПравПользованияОС.СчетРасчетов КАК СчетРасчетов,
	|	ПараметрыАмортизацииПравПользованияОС.КПСРасчетов КАК КПСРасчетов,
	|	ПараметрыАмортизацииПравПользованияОС.КЭКРасходов КАК КЭКРасходов
	|ПОМЕСТИТЬ ПараметрыАмортизацииВРегистраторе
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииПравПользованияОС КАК ПараметрыАмортизацииПравПользованияОС
	|ГДЕ
	|	ПараметрыАмортизацииПравПользованияОС.Договор = &Договор
	|	И ПараметрыАмортизацииПравПользованияОС.Организация = &Организация
	|	И ПараметрыАмортизацииПравПользованияОС.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВводОстатковПравПользования.Регистратор
	|			ИЗ
	|				ВводОстатковПравПользования КАК ВводОстатковПравПользования)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Период,
	|	Организация,
	|	Договор,
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПервоначальныеСведения.Регистратор КАК Регистратор,
	|	ПервоначальныеСведения.Период КАК Период,
	|	ПервоначальныеСведения.Организация КАК Организация,
	|	ПервоначальныеСведения.Счет11140 КАК Счет11140,
	|	ПервоначальныеСведения.ОсновноеСредство КАК ОсновноеСредство,
	|	ПервоначальныеСведения.Договор КАК Договор,
	|	ПервоначальныеСведения.ЦМО КАК ЦМО,
	|	ПараметрыАмортизацииВРегистраторе.ДатаНачалаАмортизации КАК ДатаПринятияКУчету,
	|	ПервоначальныеСведения.Договор.ВидОбязательства КАК ВидПервичногоДокумента,
	|	ПервоначальныеСведения.Договор.ДатаДоговора КАК ДатаПервичногоДокумента,
	|	ПервоначальныеСведения.Договор.НомерДоговора КАК НомерПервичногоДокумента,
	|	ПараметрыАмортизацииВРегистраторе.ВидОперации КАК ВидОперации,
	|	ПараметрыАмортизацииВРегистраторе.СпособПризнанияРасходов КАК СпособПризнанияРасходов,
	|	ПараметрыАмортизацииВРегистраторе.ДатаНачалаАмортизации КАК ДатаНачалаАмортизации,
	|	ПараметрыАмортизацииВРегистраторе.ДатаОкончанияАмортизации КАК ДатаОкончанияАмортизации,
	|	ПараметрыАмортизацииВРегистраторе.СчетРасчетов КАК СчетРасчетов,
	|	ПараметрыАмортизацииВРегистраторе.КПСРасчетов КАК КПСРасчетов,
	|	ПараметрыАмортизацииВРегистраторе.КЭКРасходов КАК КЭКРасходов
	|ИЗ
	|	ВводОстатковПравПользования КАК ПервоначальныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииВРегистраторе КАК ПараметрыАмортизацииВРегистраторе
	|		ПО ПервоначальныеСведения.Регистратор = ПараметрыАмортизацииВРегистраторе.Регистратор
	|			И ПервоначальныеСведения.Период = ПараметрыАмортизацииВРегистраторе.Период
	|			И ПервоначальныеСведения.Организация = ПараметрыАмортизацииВРегистраторе.Организация
	|			И ПервоначальныеСведения.Договор = ПараметрыАмортизацииВРегистраторе.Договор
	|			И ПервоначальныеСведения.ОсновноеСредство = ПараметрыАмортизацииВРегистраторе.ОсновноеСредство";
	
	ОсновныеСведения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаСведений Из ОсновныеСведения Цикл
		
		НоваяСтрока = Объект.ОсновныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСведений);
		
	КонецЦикла;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
