
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноПродолжать = Ложь;
	
	Если Параметры.ЕстьОшибки = Ложь Тогда
		МожноПродолжать = Истина;
	КонецЕсли;
	
	Этап = Параметры.ЭтапОбмена;
	ТекущееДействие = Параметры.ТекущееДействие;
	
	Если Этап = "Формирование" Тогда
	    Элементы.ГруппаОшибкиСообщений.Видимость = Ложь;
				
		Если ЭтоАдресВременногоХранилища(Параметры.АдресОбъектыОбмена) Тогда
			ТЧ = ПолучитьИзВременногоХранилища(Параметры.АдресОбъектыОбмена);
			
			Для Каждого СтрТЧ Из ТЧ Цикл
				НовСтр = ОбъектыОбмена.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,СтрТЧ);
				НовСтр.Результат = Истина;
				Если ЗначениеЗаполнено(СтрТЧ.ОписаниеОшибки) Тогда
					НовСтр.Результат = Ложь;
					
					ТаблицаОшибок = ЗначениеИзСтрокиВнутр(СтрТЧ.ОписаниеОшибки);
		
					Если ТипЗнч(ТаблицаОшибок) = Тип("ТаблицаЗначений") Тогда
						НовСтр.КоличествоОшибок = ТаблицаОшибок.Количество();
						НовСтр.СведенияОбОшибках.Загрузить(ТаблицаОшибок);	
					КонецЕсли; 
					
				КонецЕсли;
				МожноПродолжать = МожноПродолжать ИЛИ НовСтр.Результат;
			КонецЦикла;
			ОбъектыОбмена.Сортировать("Результат Возр,Объект");//отсортируем
			УдалитьИзВременногоХранилища(Параметры.АдресОбъектыОбмена);
		КонецЕсли;
						
	ИначеЕсли Этап = "Отправка" Тогда
		
		Элементы.ГруппаОшибкиСообщений.Заголовок = "Результат обмена с сервисом";
		
		Элементы.ГруппаФормированиеФайлов.Видимость = Ложь;
		Элементы.ФайлыРезультатаФормированияИдентификаторСообщения.Видимость = Ложь;
		//Элементы.ФайлыРезультатаФормированияФорматОбмена.Видимость = Ложь;
		
		Если ЭтоАдресВременногоХранилища(Параметры.АдресСообщенияОбмена) Тогда
			ТЧСообщений = ПолучитьИзВременногоХранилища(Параметры.АдресСообщенияОбмена);
			
			Для Каждого СтрТЧ Из ТЧСообщений Цикл
				НовСтр = ФайлыРезультатаФормирования.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,СтрТЧ,,"ТаблицаОшибок"); 
				
				Если ТипЗнч(СтрТЧ.ТаблицаОшибок) = Тип("ТаблицаЗначений") Тогда
					Для Каждого СтрОшибки Из СтрТЧ.ТаблицаОшибок Цикл
						ЗаполнитьЗначенияСвойств(НовСтр.ТаблицаОшибок.Добавить(),СтрОшибки);	
					КонецЦикла;
				КонецЕсли;
				МожноПродолжать = МожноПродолжать ИЛИ СтрТЧ.ЕстьДанные;//если есть данные в ответе, продолжать можно
			КонецЦикла;
						
		КонецЕсли;
		
		Элементы.ФайлыРезультатаФормированияЕстьДанные.Видимость = Истина;
		
		Если Параметры.ТребуетсяПодтверждение = Истина Тогда
			//можно и прервать и продолжить
			Элементы.ФормаПродолжитьОбмен.Заголовок = Нстр("ru='Подтвердить получение'");
		Иначе
			Элементы.ФормаПрервать.Видимость = Ложь;
			Элементы.ФормаПродолжитьОбмен.Заголовок = Нстр("ru='Закрыть'");
		КонецЕсли;
	КонецЕсли; 
	
		
	Элементы.ФормаПродолжитьОбмен.Доступность = МожноПродолжать ИЛИ Элементы.ФормаПрервать.Видимость = Ложь;
	
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтотОбъект.Заголовок = Параметры.Заголовок;
		ЭтотОбъект.АвтоЗаголовок = Ложь;
	КонецЕсли;
	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОбъектыОбмена

&НаКлиенте
Процедура ОбъектыОбменаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.ОбъектыОбмена.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ОбъектыОбменаОбъект" Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ТекДанные.Объект) Тогда
		    ПоказатьЗначение(,ТекДанные.Объект);	
		КонецЕсли; 
	ИначеЕсли Поле.Имя = "ОбъектыОбменаФормат" Тогда
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ТекДанные.Формат) Тогда
		    ПоказатьЗначение(,ТекДанные.Формат);	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрерватьОбмен(Команда)
	Закрыть("Прервать");
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбмен(Команда)
	Закрыть("Продолжить");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлыОбмена(Команда)
	
	МассивВыделенных = Элементы.ФайлыРезультатаФормирования.ВыделенныеСтроки;
	Если МассивВыделенных.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru='Для сохранения файлов текущего обмена выделите нужные строки таблицы, файлы из которых требуется сохранить.'"));
		Возврат;
	КонецЕсли;
	ОбработкаСохраненияФайловОбмена(Неопределено, Новый Структура("Этап,Список","Начало",МассивВыделенных));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСохраненияФайловОбмена(Результат, ДополнительныеПараметры) Экспорт 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаСохраненияФайловОбмена", ЭтотОбъект, ДополнительныеПараметры);
	Если ДополнительныеПараметры.Этап = "Начало" Тогда
		
		ДополнительныеПараметры.Вставить("ВыгруженныеФайлы",Новый Массив);
		
		ДополнительныеПараметры.Этап = "РезультатПодключенияРасширения";
		БюджетнаяОтчетностьКлиентПереопределяемый.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "РезультатПодключенияРасширения" Тогда
		
		РезультатВыгрузки = СформироватьВыгрузку(ДополнительныеПараметры.Список, Истина);
		
		
		ДополнительныеПараметры.Вставить("РасширениеПодключено",Результат);
		ДополнительныеПараметры.Вставить("ПоместитьВАрхив",Истина);
	    ДополнительныеПараметры.Вставить("РезультатВыгрузки", РезультатВыгрузки);
		
		Если РезультатВыгрузки.Количество() <> 0 Тогда
			
			Если Результат Тогда 
				
				ДополнительныеПараметры.Этап = "ВыгрузкаСРасширением";
				ВыполнитьОбработкуОповещения(ОписаниеОповещения);
				
			Иначе 
				
				ДополнительныеПараметры.Этап = "ВыгрузкаБезРасширения";
				ВыполнитьОбработкуОповещения(ОписаниеОповещения);
				
			КонецЕсли;
			
		Иначе 
			
			ДополнительныеПараметры.Этап = "Завершение";
			ВыполнитьОбработкуОповещения(ОписаниеОповещения);
			
		КонецЕсли;
		
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "ВыгрузкаСРасширением" Тогда 	
		
		Если ДополнительныеПараметры.РезультатВыгрузки.Количество() = 1 Тогда
			РежимДиалога = РежимДиалогаВыбораФайла.Сохранение;
		Иначе
			РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога;
		КонецЕсли;
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалога);
		Диалог.Фильтр = НСтр("ru = '(*.zip)|*.zip'");
		
		ПолучаемыеФайлы = Новый Массив;
		Для Каждого ОписаниеФайла Из ДополнительныеПараметры.РезультатВыгрузки Цикл
			ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ОписаниеФайла.ИмяФайла, ОписаниеФайла.Адрес));
		КонецЦикла;
		
		ДополнительныеПараметры.Этап = "ВыгрузкаСРасширениемЗавершение";
		НачатьПолучениеФайлов(ОписаниеОповещения,ПолучаемыеФайлы,Диалог, Истина);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "ВыгрузкаСРасширениемЗавершение" Тогда 	
		
		Если Результат <> Неопределено Тогда 
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДополнительныеПараметры.ВыгруженныеФайлы, Результат);
		КонецЕсли;
		
		ДополнительныеПараметры.Этап = "Завершение";
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "ВыгрузкаБезРасширения" Тогда 
		
		
		ПолучаемыйФайл = ДополнительныеПараметры.РезультатВыгрузки[0];
		ПолучитьФайл(ПолучаемыйФайл.Адрес, ПолучаемыйФайл.ИмяФайла, Истина);
		
		ДополнительныеПараметры.ВыгруженныеФайлы.Добавить(ПолучаемыйФайл);
		
		ДополнительныеПараметры.Этап = "Завершение";
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);
		
		////////////////////////////////////////////////////////////////////////////////
	ИначеЕсли ДополнительныеПараметры.Этап = "Завершение" Тогда 
		
		Если ДополнительныеПараметры.ВыгруженныеФайлы.Количество() > 0 Тогда 
			
			ТекстОповещения = НСтр("ru = 'Выгрузка файлов обмена'");
			
			ТекстПояснения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Выгружено: %1'"),
			    СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(НСтр("ru = ';%1 файл;;%1 файла;%1 файлов;%1 файла'"),ДополнительныеПараметры.ВыгруженныеФайлы.Количество()));
			
			ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснения, БиблиотекаКартинок.Успешно32);
			
		Иначе 
			
			ТекстОповещения = НСтр("ru = 'Выгрузка файлов обмена'");
			ТекстПояснения = НСтр("ru = 'Не удалось выгрузить файлы обмена'");
			
			ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснения, БиблиотекаКартинок.Ошибка32);

		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция СформироватьВыгрузку(Знач ВыгружаемыеОбъекты, Знач ПоместитьВАрхив = Ложь)
	
	ВыгруженныеФайлы = Новый Массив;
	
	Если ПоместитьВАрхив Тогда
		ИмяАрхива     = ПолучитьИмяВременногоФайла("zip");
		КаталогАрхива = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла());
		СоздатьКаталог(КаталогАрхива);
		АрхиваторОбщий= Новый ЗаписьZipФайла(ИмяАрхива);
	КонецЕсли;
	
	ТаблицаИменИПояснений = Новый ТаблицаЗначений;
	ТаблицаИменИПояснений.Колонки.Добавить("ИмяЗначения");
	ТаблицаИменИПояснений.Колонки.Добавить("ИмяФайла");
	
	НовСтр = ТаблицаИменИПояснений.Добавить();
	НовСтр.ИмяЗначения = "СодержимоеФайла";
	НовСтр.ИмяФайла = "Сообщение %1, формат %2 - (запрос).txt";
	
	НовСтр = ТаблицаИменИПояснений.Добавить();
	НовСтр.ИмяЗначения = "СообщениеОтвет";
	НовСтр.ИмяФайла = "Сообщение %1, формат %2 - (ответ).txt";
	
	Инд = 1;
	Для Каждого ТекИд Из ВыгружаемыеОбъекты Цикл
		СтрокаТаблицы = ФайлыРезультатаФормирования.НайтиПоИдентификатору(ТекИд);
		Для Каждого СтрТЧ Из ТаблицаИменИПояснений Цикл
			ЗаписываемоеЗначение = СтрокаТаблицы[СтрТЧ.ИмяЗначения];
			Если ЗначениеЗаполнено(ЗаписываемоеЗначение) Тогда
				ТекИмя = ПолучитьИмяВременногоФайла("txt");
				ЗаписьТекста = Новый ЗаписьТекста(ТекИмя,КодировкаТекста.UTF8);
				ЗаписьТекста.Записать(ЗаписываемоеЗначение);
				ЗаписьТекста.Закрыть();
				
				ДДанные = Новый ДвоичныеДанные(ТекИмя);				
				Если Сред(ДДанные, 1, 8) = "EF BB BF" Тогда
					Строка64 = Base64Строка(ДДанные);
					Строка64 = Прав(Строка64,СтрДлина(Строка64)-4); // Удаляем 3 символа BOM
					ДДанные = Base64Значение(Строка64);
					ДДанные.Записать(ТекИмя);
					
					Строка64 = Неопределено
				КонецЕсли;
				ДДанные = Неопределено;
				
				ТекИмяФайла = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрТЧ.ИмяФайла,Инд,СтрокаТаблицы.ФорматОбмена);
				
				СохраняемоеИмяОтдельногоФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(ТекИмяФайла," ");
				
				Если ПоместитьВАрхив Тогда
			
					ПереместитьФайл(ТекИмя, КаталогАрхива + СохраняемоеИмяОтдельногоФайла);
					АрхиваторОбщий.Добавить(КаталогАрхива + СохраняемоеИмяОтдельногоФайла);
					
				Иначе
					
					ОписаниеФайла = ОписаниеВыгруженногоФайла(ТекИмя, СохраняемоеИмяОтдельногоФайла);
					ВыгруженныеФайлы.Добавить(ОписаниеФайла);
					УдалитьФайлы(ТекИмя);
					
				КонецЕсли;
		
			КонецЕсли;
		КонецЦикла;
		Инд = Инд + 1;
	КонецЦикла;
		
	Если ПоместитьВАрхив Тогда
		
		АрхиваторОбщий.Записать();
		ДанныеФайла   = Новый ДвоичныеДанные(ИмяАрхива);
		ОписаниеФайла = ОписаниеВыгруженногоФайла(ИмяАрхива, "Файлы обмена ЕИС "+Формат(ТекущаяДатаСеанса(),"ДФ=yyyyMMdd")+".zip");
			
		ВыгруженныеФайлы.Добавить(ОписаниеФайла);
		УдалитьФайлы(ИмяАрхива);
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(ВыгруженныеФайлы);

КонецФункции // СформироватьВыгрузку()

&НаСервере
Функция ОписаниеВыгруженногоФайла(Знач ПолноеИмя, Знач ХранимоеИмя = "")

	Описание = Новый Структура;
	
	Файл = Новый Файл(ПолноеИмя);
	
	Описание.Вставить("ИмяФайла", ?(ПустаяСтрока(ХранимоеИмя),Файл.Имя,ХранимоеИмя));
	
	Если Файл.Существует() Тогда
		ДанныеФайла = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		Описание.Вставить("Адрес", ПоместитьВоВременноеХранилище(ДанныеФайла));
	Иначе
		Описание.Вставить("Адрес", Неопределено);
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции // ОписаниеВыгруженногоФайла()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти