
#Область ОбработчикиСобытийЭлементовТаблицыФормыНаборЗаписей

&НаКлиенте
Процедура НаборЗаписейПередУдалением(Элемент, Отказ)
	ТекущаяСтрока = Элемент.ТекущиеДанные.ИсходныйНомерСтроки;
	УдалитьЗапись(ТекущаяСтрока-1);
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаписатьНаборЗаписей();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УдалитьЗапись(Строка)
	НЗ = РеквизитФормыВЗначение("НаборЗаписей");
	НЗ.Удалить(Строка);
	НЗ.Записать();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаборЗаписей()
	РеквизитФормыВЗначение("НаборЗаписей").Записать();
КонецПроцедуры

#КонецОбласти
