#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Метаданные.Справочники.ПланыПоступленийВыбытий.Реквизиты.Бюджет.Имя);
	Результат.Добавить(Метаданные.Справочники.ПланыПоступленийВыбытий.Реквизиты.КФО.Имя);
	Результат.Добавить(Метаданные.Справочники.ПланыПоступленийВыбытий.Реквизиты.ВидПоказателя.Имя);
	Результат.Добавить(Метаданные.Справочники.ПланыПоступленийВыбытий.Реквизиты.УточнениеПоказателя.Имя);

	Возврат Результат;
	
КонецФункции

#КонецЕсли