#Область СлужебныйПрограммныйИнтерфейс

#Область Печать

Функция ВыполнитьКомандуПечати(ОписаниеКоманды) Экспорт
	
	ДанныеПечатиУведомления = ЕдиныйНалоговыйСчетВызовСервера.ДанныеПечатиУведомления(ОписаниеКоманды.ОбъектыПечати[0]);
	
	Если ОписаниеКоманды.Форма.ИмяФормы	= "Документ.УведомлениеОбИсчисленныхСуммахНалогов.Форма.ФормаСписка"
		И ЗначениеЗаполнено(ДанныеПечатиУведомления.ПоследнийЦиклОбмена) Тогда
		ОписаниеКоманды.Форма.СтруктураРеквизитовФормы = Новый Структура;
		ОписаниеКоманды.Форма.СтруктураРеквизитовФормы.Вставить("мСохраненныйДок", ДанныеПечатиУведомления.УведомленияДляПечати);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ОписаниеКоманды.Форма, "СтруктураРеквизитовФормы")
		И ТипЗнч(ОписаниеКоманды.Форма["СтруктураРеквизитовФормы"]) = Тип("Структура") Тогда
		
		ОписаниеКоманды.Форма.СтруктураРеквизитовФормы.Вставить("ПоследнийЦиклОбмена",
			ДанныеПечатиУведомления.ПоследнийЦиклОбмена);
		
	КонецЕсли;
	
	РегламентированнаяОтчетностьКлиент.ОткрытьФормуПредварительногоПросмотра(ОписаниеКоманды.Форма, , Ложь, 
		ДанныеПечатиУведомления.СписокПечатаемыхЛистов, ДанныеПечатиУведомления.ДополнительныеПараметры);
	
КонецФункции

Функция ВыполнитьКомандуПечатиPDF417(ОписаниеКоманды) Экспорт
	
	// Команда для формы документа, в котором есть экспортный метод
	ОписаниеКоманды.Форма.ПоказатьСДвухмернымШтрихкодомPDF417();
	
КонецФункции

#КонецОбласти

Процедура ПередОткрытиемФормыУведомления(Организация, СтандартнаяОбработка) Экспорт
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

Процедура ПриВыбореВидаУведомления(Форма, ПараметрыУведомления) Экспорт
	
	ЗначенияЗаполнения = Новый Структура("Организация", ПараметрыУведомления.Организация);
	ПараметрыУведомления.Вставить("ЗначенияЗаполнения",
		ЗначенияЗаполнения);
	ПараметрыУведомления.Вставить("ВидУведомления",
		ПараметрыУведомления.ВидУведомления);
		
	ИмяОбъекта = "";
	Если ПараметрыУведомления.ВидУведомления = ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ИсчисленныеСуммыНалогов") Тогда
		ИмяОбъекта = "УведомлениеОбИсчисленныхСуммахНалогов";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяОбъекта) Тогда
		ОткрытьФорму("Документ." + ИмяОбъекта + ".Форма.ФормаСозданияУведомления",
			ПараметрыУведомления,
			Форма);
	КонецЕсли;
		
КонецПроцедуры

Процедура СальдоЕНППоДаннымУчетаРасшифровка(Организация, ДатаАктуальности) Экспорт
	ПараметрыФормы = ЕдиныйНалоговыйСчетВызовСервера.ПараметрыОткрытияОСВРасшифровкаСальдоЕНП(Организация, ДатаАктуальности);
	ОткрытьФорму("Отчет.ОборотноСальдоваяВедомостьПоСчету.Форма", ПараметрыФормы, , Истина);
КонецПроцедуры

#КонецОбласти