
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокКолонок.Очистить();
	СписокКолонок.Добавить("Код","Код",Истина);
	СписокКолонок.Добавить("Наименование","Наименование",Истина);
	СПодчиненными = Истина;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	ТабДок = СформироватьНаСервере();
	ТабДок.Показать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьНаСервере()
	
	Дерево = ПолучитьИзВременногоХранилища(Параметры.ТабличнаяЧасть);
	ДанныеКосгу = ПолучитьДанные();
    ВыведенныеСтроки = Новый Массив;
	
	Если НЕ ВыводитьВТекстовыйДокумент Тогда
		ТабДок = Новый ТабличныйДокумент;
		Макет = Справочники.ГруппыПодгруппыКИФ.ПолучитьМакет("МакетПечатиКлассификатора");
		СтруктураМакетов = Новый Структура;
		СтруктураДанных = Новый Структура;
		Для Каждого Элемент Из СписокКолонок Цикл
			Если Элемент.Пометка Тогда
				СтруктураМакетов.Вставить(Элемент.Значение, Макет.ПолучитьОбласть("ЗаголовокКИФ|Область"+Элемент.Значение));
				СтруктураДанных.Вставить(Элемент.Значение, Макет.ПолучитьОбласть("СтрокаДанныхКИФ|Область"+Элемент.Значение));
			КонецЕсли;
		КонецЦикла;
		ВывелиПервый = Ложь;
		Для Каждого КлючИЗначение Из СтруктураМакетов Цикл
			Если НЕ ВывелиПервый Тогда
				ТабДок.Вывести(КлючИЗначение.Значение);
				ВывелиПервый = Истина;
			Иначе
				ТабДок.Присоединить(КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
		Если НЕ ТолькоВыделенные Тогда			
			ВывестиСтрокиКоллекции(ДанныеКосгу,Дерево.Строки,ТабДок,СтруктураДанных,СПодчиненными,ВыведенныеСтроки);			
		Иначе
			Для Каждого ВыделеннаяСтрока Из Параметры.ВыделенныеСтроки Цикл
				Ссылка = ВыделеннаяСтрока.Значение.Ссылка;
				Если ВыведенныеСтроки.Найти(Ссылка)=Неопределено Тогда
					СтрокаДерева = Дерево.Строки.Найти(Ссылка,"Ссылка",Истина);
					Если СтрокаДерева<>Неопределено Тогда
						 ВывестиСтроку(ДанныеКосгу,СтрокаДерева,ТабДок,СтруктураДанных,СПодчиненными,ВыведенныеСтроки);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Возврат ТабДок;	
	Иначе
		ТекДок = Новый ТекстовыйДокумент;
		ТекстВывода = "";
		Если НЕ ТолькоВыделенные Тогда			
			ВывестиСтрокиКоллекции(ДанныеКосгу,Дерево.Строки,,,СПодчиненными,ВыведенныеСтроки,Истина,ТекстВывода);			
		Иначе
			Для Каждого ВыделеннаяСтрока Из Параметры.ВыделенныеСтроки Цикл
				Ссылка = ВыделеннаяСтрока.Значение.Ссылка;
				Если ВыведенныеСтроки.Найти(Ссылка)=Неопределено Тогда
					СтрокаДерева = Дерево.Строки.Найти(Ссылка,"Ссылка",Истина);
					Если СтрокаДерева<>Неопределено Тогда
						 ВывестиСтроку(ДанныеКосгу,СтрокаДерева,,,СПодчиненными,ВыведенныеСтроки,Истина, ТекстВывода);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ТекДок.УстановитьТекст(ТекстВывода);
        Возврат ТекДок;
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ВывестиСтроку(ДанныеКосгу, СтрокаДерева, ТабДок = Неопределено, ОбластьДанные = Неопределено, СПодчиненными = Ложь, ВыведенныеСтроки, ВТекстовыйДокумент = Ложь, ТекстВывода = "")
	
	СтруктураПараметров = Новый Структура("Код,Наименование",ПолучитьКод(СтрокаДерева),СтрокаДерева.Наименование);

	Если Найти(СокрЛП(СтрокаДерева.КОСГУ),", ")>0 Тогда
		ПроверитьСтроку(ДанныеКосгу,СтрокаДерева,ТабДок,СтруктураПараметров,ОбластьДанные,ВТекстовыйДокумент, ТекстВывода);
	Иначе
		СтруктураПараметров.Код = СтруктураПараметров.Код + " " +СтрокаДерева.Косгу;
		Если НЕ ВТекстовыйДокумент Тогда
			Если ЗначениеЗаполнено(СтрокаДерева.Ссылка) Тогда
				ВывелиПервый = Ложь;
				Для Каждого КлючИЗначение Из ОбластьДанные Цикл
					ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение.Параметры,СтруктураПараметров);
					Если НЕ ВывелиПервый Тогда
						ТабДок.Вывести(КлючИЗначение.Значение,СтрокаДерева.Уровень());
						ВывелиПервый = Истина;
					Иначе
						ТабДок.Присоединить(КлючИЗначение.Значение);
					КонецЕсли;
				КонецЦикла;
				
				ВыведенныеСтроки.Добавить(СтрокаДерева.Ссылка);
			КонецЕсли;
		Иначе
				ТекстВывода = ТекстВывода + ?(ТекстВывода = "" ,"",Символы.ПС) +?(СписокКолонок[0].Пометка," "+СтруктураПараметров.Код,"")
							+?(СписокКолонок[2].Пометка," "+СтруктураПараметров.Наименование,"");
				ВыведенныеСтроки.Добавить(СтрокаДерева.Ссылка);
		КонецЕсли;
	КонецЕсли;
	Если СПодчиненными Тогда
		ВывестиСтрокиКоллекции(ДанныеКосгу, СтрокаДерева.Строки,ТабДок,ОбластьДанные,СПодчиненными,ВыведенныеСтроки,ВТекстовыйДокумент, ТекстВывода);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПроверитьСтроку(ДанныеКосгу, СтрокаДерева, ТабДок, СтруктураПараметров, ОбластьДанные = Неопределено, ВТекстовыйДокумент = Ложь, ТекстВывода="")
	
	Если Найти(СокрЛП(СтрокаДерева.КОСГУ),", ")>0 Тогда
		МассивКОСГУ = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(СтрокаДерева.КОСГУ),", ");
		Код = СтруктураПараметров.Код;
		Если ТипЗнч(СтрокаДерева.Ссылка) = Тип("СправочникСсылка.ВидыКИФ") Тогда
			Код = СтруктураПараметров.Код;
			Для Каждого Элемент Из МассивКОСГУ Цикл
				СтруктураПараметров.Код = Код + " " + Элемент;
				Если ВТекстовыйДокумент Тогда
					ТекстВывода = ТекстВывода + ?(ТекстВывода = "" ,"",Символы.ПС) + ?(СписокКолонок[0].Пометка,"000 ","")
						+?(СписокКолонок[1].Пометка," "+СтруктураПараметров.Код,"")+?(СписокКолонок[2].Пометка," "+СтруктураПараметров.Наименование,"")+?(СписокКолонок[3].Пометка," "+СтруктураПараметров.Уровень,"");
				Иначе
					ВывелиПервый = Ложь;	
					Для Каждого КлючИЗначение Из ОбластьДанные Цикл
						ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение.Параметры,СтруктураПараметров);
						Если НЕ ВывелиПервый Тогда
							ТабДок.Вывести(КлючИЗначение.Значение,СтрокаДерева.Уровень());
							ВывелиПервый = Истина;
						Иначе
							ТабДок.Присоединить(КлючИЗначение.Значение);
						КонецЕсли;
					КонецЦикла;
                КонецЕсли;
			КонецЦикла;
		Иначе
			Отбор = Новый Структура("Ссылка",СтрокаДерева.Ссылка);
			СтрокиКосгу = ДанныеКосгу.НайтиСтроки(Отбор);
			Для Каждого Элемент Из СтрокиКосгу Цикл
				СтруктураПараметров.Код = Код + " " + Элемент.КОСГУ;
				СтруктураПараметров.Наименование = Элемент.Наименование;
				Если ВТекстовыйДокумент Тогда
					ТекстВывода = ТекстВывода + ?(ТекстВывода = "" ,"",Символы.ПС) + ?(СписокКолонок[0].Пометка,"000 ","")
						+?(СписокКолонок[1].Пометка," "+СтруктураПараметров.Код,"")+?(СписокКолонок[2].Пометка," "+СтруктураПараметров.Наименование,"")+?(СписокКолонок[3].Пометка," "+СтруктураПараметров.Уровень,"");
				Иначе
                    ВывелиПервый = Ложь;
					Для Каждого КлючИЗначение Из ОбластьДанные Цикл
						ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение.Параметры,СтруктураПараметров);
						Если НЕ ВывелиПервый Тогда
							ТабДок.Вывести(КлючИЗначение.Значение,СтрокаДерева.Уровень());
							ВывелиПервый = Истина;
						Иначе
							ТабДок.Присоединить(КлючИЗначение.Значение);
						КонецЕсли;
					КонецЦикла;
                КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКод(СтрокаДерева)
	
	Код = СокрЛП(СтрокаДерева.Код);
	Если НЕ ПустаяСтрока(Код) Тогда
			Код = Код;
	КонецЕсли;
	
	Возврат Код;  
	
КонецФункции

&НаСервере
Процедура ВывестиСтрокиКоллекции(ДанныеКосгу, СтрокиКоллекции, ТабДок = Неопределено, ОбластьДанные = Неопределено, СПодчиненными = Ложь, ВыведенныеСтроки, ВТекстовыйДокумент = Ложь, ТекстВывода="")
	
	Если НЕ ВТекстовыйДокумент Тогда
		ТабДок.НачатьГруппуСтрок(); 
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из СтрокиКоллекции Цикл
		СтруктураПараметров = Новый Структура("Код,Наименование",ПолучитьКод(СтрокаДерева),СтрокаДерева.Наименование);
		Если Найти(СокрЛП(СтрокаДерева.КОСГУ),", ")>0 Тогда
			ПроверитьСтроку(ДанныеКосгу,СтрокаДерева,ТабДок,СтруктураПараметров,ОбластьДанные,ВТекстовыйДокумент, ТекстВывода);
		Иначе
			СтруктураПараметров.Код = СтруктураПараметров.Код + " " +СтрокаДерева.Косгу;
			Если НЕ ВТекстовыйДокумент Тогда
				Если ЗначениеЗаполнено(СтрокаДерева.Ссылка) Тогда 
					ВывелиПервый = Ложь;
					Для Каждого КлючИЗначение Из ОбластьДанные Цикл
						ЗаполнитьЗначенияСвойств(КлючИЗначение.Значение.Параметры,СтруктураПараметров);
						Если НЕ ВывелиПервый Тогда
							ТабДок.Вывести(КлючИЗначение.Значение,СтрокаДерева.Уровень());
							ВывелиПервый = Истина;
						Иначе
							ТабДок.Присоединить(КлючИЗначение.Значение);
						КонецЕсли;
					КонецЦикла;
					ВыведенныеСтроки.Добавить(СтрокаДерева.Ссылка);
				КонецЕсли;
			Иначе
				ТекстВывода = ТекстВывода + ?(ТекстВывода = "" ,"",Символы.ПС) + ?(СписокКолонок[0].Пометка,"000 ","")
							+ ?(СписокКолонок[1].Пометка, " " + СтруктураПараметров.Код,"") + ?(СписокКолонок[2].Пометка, " " 
							+ СтруктураПараметров.Наименование, "") + ?(СписокКолонок[3].Пометка, " " + СтруктураПараметров.Уровень,"");
				ВыведенныеСтроки.Добавить(СтрокаДерева.Ссылка);
			КонецЕсли;
	    КонецЕсли;
		Если СПодчиненными Тогда
			ВывестиСтрокиКоллекции(ДанныеКосгу,СтрокаДерева.Строки,ТабДок,ОбластьДанные,СПодчиненными,ВыведенныеСтроки,ВТекстовыйДокумент, ТекстВывода);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ВТекстовыйДокумент Тогда
    	ТабДок.ЗакончитьГруппуСтрок();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыПодгруппыКИФДопустимыеКОСГУ.Ссылка,
		|	ГруппыПодгруппыКИФДопустимыеКОСГУ.КОСГУ КАК КОСГУ,
		|	ГруппыПодгруппыКИФДопустимыеКОСГУ.Наименование
		|ИЗ
		|	Справочник.ГруппыПодгруппыКИФ.ДопустимыеКОСГУ КАК ГруппыПодгруппыКИФДопустимыеКОСГУ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатьиКИФДопустимыеКОСГУ.Ссылка,
		|	СтатьиКИФДопустимыеКОСГУ.КОСГУ,
		|	СтатьиКИФДопустимыеКОСГУ.Наименование
		|ИЗ
		|	Справочник.СтатьиКИФ.ДопустимыеКОСГУ КАК СтатьиКИФДопустимыеКОСГУ
		|
		|УПОРЯДОЧИТЬ ПО
		|	КОСГУ";

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
