#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьМакетИНастройкиСтраницыБланка(Бланк,ИмяСтраницы) Экспорт	
	
	СтруктураОтвета = Новый Структура("ПараметрыНастройкиБланка,Макет",Неопределено,Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	БланкиОтчетовМакетРаскрытий.Макет КАК Макет,
		|	БланкиОтчетовСтраницыБланка.ПараметрыНастройкиБланка КАК ПараметрыНастройкиБланка
		|ИЗ
		|	Справочник.БланкиОтчетов.СтраницыБланка КАК БланкиОтчетовСтраницыБланка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БланкиОтчетов.МакетРаскрытий КАК БланкиОтчетовМакетРаскрытий
		|		ПО БланкиОтчетовСтраницыБланка.Ссылка = БланкиОтчетовМакетРаскрытий.Ссылка
		|			И (БланкиОтчетовСтраницыБланка.ИмяСтраницы = БланкиОтчетовМакетРаскрытий.ИмяСтраницы
		|				И БланкиОтчетовМакетРаскрытий.ОсновнаяЧасть = ИСТИНА)
		|ГДЕ
		|	БланкиОтчетовСтраницыБланка.Ссылка = &Ссылка
		|	И БланкиОтчетовСтраницыБланка.ИмяСтраницы = &ИмяСтраницы";

	Запрос.УстановитьПараметр("Ссылка", Бланк);
	Запрос.УстановитьПараметр("ИмяСтраницы", ИмяСтраницы);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтруктураОтвета.ПараметрыНастройкиБланка = ВыборкаДетальныеЗаписи.ПараметрыНастройкиБланка.Получить();
	    СтруктураОтвета.Макет = ВыборкаДетальныеЗаписи.Макет.Получить();	
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьПустуюТаблицуНастроекБланка() Экспорт
	
	БулевыйТип = БюджетнаяОтчетность.ПолучитьОписаниеТиповБулево();
	
	мНастройкиБланка = Новый ТаблицаЗначений;
	мНастройкиБланка.Колонки.Добавить("ИмяЯчейки");
	мНастройкиБланка.Колонки.Добавить("СтруктураНастроек");
	мНастройкиБланка.Колонки.Добавить("ЕстьПредставление",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьОтбор",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьСвязанныеРеквизиты",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьФильтрПоЗначению",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьРасчетныеИтоги",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьВыборИзКПС",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьСписокДоступныхЗначений",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьУсловноеОформлениеБланка",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьИспользуемыеНастройкиУОБланка",БулевыйТип);
	мНастройкиБланка.Колонки.Добавить("ЕстьДругиеПоказателиВУсловииУО",БулевыйТип);
	
	мНастройкиБланка.Колонки.Добавить("ЕстьВыборЗначенийИзСписка",БулевыйТип);
	
	мНастройкиБланка.Индексы.Добавить("ИмяЯчейки");
	
	Возврат мНастройкиБланка;
КонецФункции

Процедура ДополнитьТаблицуНастроекКолонками(мНастройкиБланка) Экспорт
	ТипБулево = БюджетнаяОтчетность.ПолучитьОписаниеТиповБулево(); 
	Если мНастройкиБланка.Колонки.Найти("ЕстьФильтрПоЗначению") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьФильтрПоЗначению",ТипБулево);
	КонецЕсли;
	Если мНастройкиБланка.Колонки.Найти("ЕстьРасчетныеИтоги") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьРасчетныеИтоги",ТипБулево);
	КонецЕсли;
	Если мНастройкиБланка.Колонки.Найти("ЕстьВыборИзКПС") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьВыборИзКПС",ТипБулево);
	КонецЕсли;
	Если мНастройкиБланка.Колонки.Найти("ЕстьСписокДоступныхЗначений") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьСписокДоступныхЗначений",ТипБулево);
	КонецЕсли;
	Если мНастройкиБланка.Колонки.Найти("ЕстьУсловноеОформлениеБланка") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьУсловноеОформлениеБланка",ТипБулево);
	КонецЕсли;
	Если мНастройкиБланка.Колонки.Найти("ЕстьИспользуемыеНастройкиУОБланка") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьИспользуемыеНастройкиУОБланка",ТипБулево);
	КонецЕсли;
	Если мНастройкиБланка.Колонки.Найти("ЕстьДругиеПоказателиВУсловииУО") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьДругиеПоказателиВУсловииУО",ТипБулево);
	КонецЕсли;
	Если мНастройкиБланка.Колонки.Найти("ЕстьВыборЗначенийИзСписка") = Неопределено Тогда
		мНастройкиБланка.Колонки.Добавить("ЕстьВыборЗначенийИзСписка",ТипБулево);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьНастройкиБланка(БланкСсылка) Экспорт
	
	ПараметрыНастройкиБланка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(БланкСсылка,"ПараметрыНастройкиБланка");
	мНастройкиБланка = ПараметрыНастройкиБланка.Получить();	
	ДополнитьТаблицуНастроекКолонками(мНастройкиБланка);	
	Возврат мНастройкиБланка;
	
КонецФункции

Функция ПолучитьМассивИменПоказателей(ТаблДок,ВидОтчета) Экспорт
	
	МассивИменОбластей = Новый Массив;
	Для Каждого ТекОбласть Из ТаблДок.Области Цикл
		МассивИменОбластей.Добавить(ТекОбласть.Имя);	
	КонецЦикла;
	
	//Массив показателей раскрытия, которые выводятся на данной странице: Строка_КодСтроки
	МассивКодовСтрок = Новый Массив;
	Для Каждого ТекИмя Из МассивИменОбластей Цикл
		Если СтрНачинаетсяС(ТекИмя,"Строка_") Тогда
			МассивКодовСтрок.Добавить(Сред(ТекИмя,8));
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоказателиОтчетов.Код КАК Код
		|ИЗ
		|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|ГДЕ
		|	ПоказателиОтчетов.Владелец = &Владелец
		|	И ПоказателиОтчетов.Код В(&МассивИмен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоказателиОтчетов.Код КАК Код
		|ИЗ
		|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|ГДЕ
		|	ПоказателиОтчетов.Владелец = &Владелец
		|	И ПоказателиОтчетов.Строка.Код В(&МассивКодовСтрок)";
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.УстановитьПараметр("МассивИмен", МассивИменОбластей);
	Запрос.УстановитьПараметр("МассивКодовСтрок", МассивКодовСтрок);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	МассивИменПоказателей = Новый Массив;
	
	ВыборкаПоказателей = РезультатыЗапроса[0].Выбрать();
	Пока ВыборкаПоказателей.Следующий() Цикл
		ДобавляемыйКод = СокрЛП(ВыборкаПоказателей.Код);
		Если МассивИменПоказателей.Найти(ДобавляемыйКод) = Неопределено Тогда
			МассивИменПоказателей.Добавить(ДобавляемыйКод);
		КонецЕсли;
	КонецЦикла;
	
	ВыборкаПоказателейПоСтрокам = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаПоказателейПоСтрокам.Следующий() Цикл
		ДобавляемыйКод = СокрЛП(ВыборкаПоказателейПоСтрокам.Код);
		Если МассивИменПоказателей.Найти(ДобавляемыйКод) = Неопределено Тогда
			МассивИменПоказателей.Добавить(ДобавляемыйКод);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивИменПоказателей;
		
КонецФункции

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	СпрКомпл.Ссылка
			|ИЗ
			|	Справочник.БланкиОтчетов КАК СпрКомпл
			|ГДЕ
			|	ПОДСТРОКА(СпрКомпл.ХешРеквизитов, 1, 1) = """"";
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Параметры.ОбработкаЗавершена = Ложь;
	ПолноеИмяОбъекта = "Справочник.БланкиОтчетов";
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("Справочник.БланкиОтчетов");
		Элемент.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		
		Попытка
		
			Блокировка.Заблокировать();
		
		Исключение
			
			// Объект не удается заблокировать - попробуем обработать его на следующей итерации.
			// Отдельно обрабатывать ошибку не требуется, т.к. в худшем случае обработчик зациклится
			// и прервется автоматически.
			ЗафиксироватьТранзакцию();
			Продолжить;
			
		КонецПопытки;
		
		// Проверка существования ссылки
		Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Ссылка) Тогда
			
			// Вероятно был удален раньше, чем обработчик дошел до него
			ЗафиксироватьТранзакцию();
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			Продолжить;
		
		КонецЕсли;
		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		
		Попытка
		
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Объект,Ложь,Ложь);
			ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = НСтр("ru = 'Не удалось записать спавочник: %Справочник% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.Справочники.БланкиОтчетов,
				Выборка.Ссылка,
				ТекстСообщения);
			ВызватьИсключение;
		
		КонецПопытки;
	
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ЗаполнитьТЧСтраницы() Экспорт
	
	Если ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БланкиОтчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БланкиОтчетов КАК БланкиОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БланкиОтчетов.СтраницыБланка КАК БланкиОтчетовСтраницыБланка
		|		ПО БланкиОтчетовСтраницыБланка.Ссылка = БланкиОтчетов.Ссылка
		|ГДЕ
		|	БланкиОтчетовСтраницыБланка.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сжатие = Новый СжатиеДанных(9);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекБланк = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		НовСтр = ТекБланк.СтраницыБланка.Добавить();
		НовСтр.ИмяСтраницы = "Стр_1";
		НовСтр.РодительскаяСтраница = "";
		НовСтр.ПользовательскоеНаименование = "Основная";
		
		ТаблДок = ТекБланк.Макет.Получить();
		Если ТаблДок = Неопределено Тогда
			ТаблДок = Новый ТабличныйДокумент;
		КонецЕсли;
		
		НовСтр.Макет = Новый ХранилищеЗначения(ТаблДок,Сжатие);
			
		ТекНастройки = ТекБланк.ПараметрыНастройкиБланка.Получить();
		
		Если ТекНастройки = Неопределено Тогда
			ТекНастройки = Справочники.БланкиОтчетов.ПолучитьПустуюТаблицуНастроекБланка();
		Иначе
			Справочники.БланкиОтчетов.ДополнитьТаблицуНастроекКолонками(ТекНастройки);
		КонецЕсли;
		//Нет смысла в настройки показателей добавлять показатели страницы, т.к. страница всего одна и оптимизации это не даст.
				
		НовСтр.ПараметрыНастройкиБланка = Новый ХранилищеЗначения(ТекНастройки,Новый СжатиеДанных(5));

		ТекБланк.СформироватьОсновныеМакетыСтраницБланка();
		
		ТекБланк.ДополнительныеСвойства.Вставить("ХешОбновлен",Истина);//Ничего не изменилось
		
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ТекБланк,Истина,Ложь);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти


#КонецОбласти

Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	МассивРедактируемыхРеквизитов = Новый Массив;
	МассивРедактируемыхРеквизитов.Добавить("ЕдиницаИзмеренияПоУмолчанию");
	МассивРедактируемыхРеквизитов.Добавить("РаскрытиеВМакете");
	МассивРедактируемыхРеквизитов.Добавить("УровеньТочностиПоУмолчанию");
	МассивРедактируемыхРеквизитов.Добавить("Описание");
	МассивРедактируемыхРеквизитов.Добавить("Комментарий");
	Возврат МассивРедактируемыхРеквизитов;	
КонецФункции

#КонецЕсли
