#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем СоответствиеПрошлыхНастроекПечатиСтраниц;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Процедура - обработчик события объекта "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ)
	
	//Хеш рассчитывается всегда
	РассчитатьХешПоРеквизитамОбъекта();
	
	Если БюджетнаяОтчетность.ЗагрузкаКомплектаОтчетности(ЭтотОбъект) Тогда
		СоответствиеПрошлыхНастроекПечатиСтраниц = Новый Соответствие;	
		
		Если ЗначениеЗаполнено(Ссылка) Тогда
				
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	БланкиОтчетовСтраницыБланка.ИмяСтраницы КАК ИмяСтраницы,
				|	БланкиОтчетовСтраницыБланка.Ориентация КАК Ориентация,
				|	БланкиОтчетовСтраницыБланка.МасштабПечати КАК МасштабПечати,
				|	БланкиОтчетовСтраницыБланка.АвтоМасштаб КАК АвтоМасштаб
				|ИЗ
				|	Справочник.БланкиОтчетов.СтраницыБланка КАК БланкиОтчетовСтраницыБланка
				|ГДЕ
				|	БланкиОтчетовСтраницыБланка.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				СтруктураНастроек = Новый Структура("Ориентация,МасштабПечати,АвтоМасштаб");
				ЗаполнитьЗначенияСвойств(СтруктураНастроек,ВыборкаДетальныеЗаписи);
				СоответствиеПрошлыхНастроекПечатиСтраниц.Вставить(ВыборкаДетальныеЗаписи.ИмяСтраницы,СтруктураНастроек);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбменДанными.Загрузка 
		ИЛИ БюджетнаяОтчетность.ЗагрузкаКомплектаОтчетности(ЭтотОбъект) 
		ИЛИ ПометкаУдаления Тогда
			
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если БюджетнаяОтчетность.ЗагрузкаКомплектаОтчетности(ЭтотОбъект) Тогда
		
		Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
			УдалитьНастройкиПечатиБланкаОтчета();	
		КонецЕсли;		

	КонецЕсли;
	
	Если ОбменДанными.Загрузка 
		ИЛИ БюджетнаяОтчетность.ЗагрузкаКомплектаОтчетности(ЭтотОбъект) 
		ИЛИ ПометкаУдаления Тогда
			
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура РассчитатьХешПоРеквизитамОбъекта() Экспорт
	
	Если ОбменДанными.Загрузка Тогда 
		Если ОбменДанными.Отправитель <> Неопределено Тогда
			//Если это загрузка данных из главного узла, то ничего делать не нужно.
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ХешОбновлен")
		И ЗначениеЗаполнено(ХешРеквизитов) Тогда
		Возврат;	
	КонецЕсли;
	
	ДопустимыеВР = БюджетнаяОтчетностьСервер.ПолучитьДопустимыеВидыРеквизитаДляХеша();
	
	МассивФормированияХеша = Новый Массив;
	//Порядок следования реквизитов: стандартные, по алфавиту, обычные, по алфавиту
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Код",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Наименование",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"ПометкаУдаления",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
	
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"ЕдиницаИзмеренияПоУмолчанию",МассивФормированияХеша,ДопустимыеВР.Перечисление,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Комментарий",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"Описание",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	
	Попытка
		Для Инд = 0 По СтраницыБланка.Количество()-1 Цикл
			
			ТекСтраница = СтраницыБланка[Инд];
			
			БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ТекСтраница,"ИмяСтраницы",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
			БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ТекСтраница,"РодительскаяСтраница",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
			БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ТекСтраница,"ПользовательскоеНаименование",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
			БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ТекСтраница,"Макет",МассивФормированияХеша,ДопустимыеВР.ХранилищеЗначения,ДопустимыеВР);
			
			//Ориентация, МасштабПечати, АвтоМасштаб не добавляем в хеш, т.к. эти свойства берутся из Табличного документа, в реквизите Макет
			//В Своде они нужны для редактирования параметров печати в форме Бланка и чтобы можно было проще увидеть, какие настройки заданы сейчас.
			//Также используются для удаления пользовательских настроек печати - если у страницы с таким ИмяСтраницы изменились значения этих реквизитов,
			//то удаляем настройки печати этой страницы.
			//БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ТекСтраница,"Ориентация",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
			//БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ТекСтраница,"МасштабПечати",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
			//БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ТекСтраница,"АвтоМасштаб",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);

			МассивФормированияХеша.Добавить("ПараметрыНастройкиБланка");
			МассивФормированияХеша.Добавить("=");
			МассивФормированияХеша.Добавить(Символы.ПС);
	
			ТекПараметры = ТекСтраница.ПараметрыНастройкиБланка.Получить();
			Если ТекПараметры <> Неопределено Тогда
				Справочники.БланкиОтчетов.ДополнитьТаблицуНастроекКолонками(ТекПараметры);
				
				ТекПараметры.Сортировать("ИмяЯчейки");
				Для Каждого СтрТЧ Из ТекПараметры Цикл
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ИмяЯчейки",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьВыборИзКПС",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					//"ЕстьОтбор" //Настройка Отбор не используется
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьПредставление",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьРасчетныеИтоги",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьСвязанныеРеквизиты",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьСписокДоступныхЗначений",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьФильтрПоЗначению",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьУсловноеОформлениеБланка",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьИспользуемыеНастройкиУОБланка",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
					БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьДругиеПоказателиВУсловииУО",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);

					МассивФормированияХеша.Добавить("СтруктураНастроек=");
					МассивФормированияХеша.Добавить(Символы.ПС);
					Если СтрТЧ.ЕстьВыборИзКПС Тогда
						МассивФормированияХеша.Добавить("ВыборИзКПС=");
						МассивФормированияХеша.Добавить(СтрТЧ.СтруктураНастроек.ВыборИзКПС.ВыборИзКПС);
						МассивФормированияХеша.Добавить("ВидПоказателя=");
						МассивФормированияХеша.Добавить(СтрСоединить(СтрТЧ.СтруктураНастроек.ВыборИзКПС.ВидПоказателя.ВыгрузитьЗначения(),","));
						МассивФормированияХеша.Добавить(Символы.ПС);
					КонецЕсли;
							
					Если СтрТЧ.ЕстьПредставление Тогда
						МассивФормированияХеша.Добавить("Представление=");
						МассивФормированияХеша.Добавить(СокрЛП(СтрТЧ.СтруктураНастроек.Представление));
						МассивФормированияХеша.Добавить(Символы.ПС);
					КонецЕсли;
					
					Если СтрТЧ.ЕстьРасчетныеИтоги Тогда
						МассивФормированияХеша.Добавить("РасчетныеИтоги=");
						
						СтрТЧ.СтруктураНастроек.РасчетныеИтоги.АналитикаИтогов.Сортировать("Аналитика");
						Для Каждого СтрТЧАИ Из СтрТЧ.СтруктураНастроек.РасчетныеИтоги.АналитикаИтогов Цикл
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧАИ,"Аналитика",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							СтрТЧАИ.ТаблицаСоответствия.Сортировать("ГруппаРаскрытия");
							Для Каждого СтрТабСоотв Из СтрТЧАИ.ТаблицаСоответствия Цикл
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТабСоотв,"ГруппаРаскрытия",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТабСоотв,"ФормулаАналитикиИтогов",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							КонецЦикла;
						КонецЦикла;
						
						ЕстьКолонкаСпособРасчета = (СтрТЧ.СтруктураНастроек.РасчетныеИтоги.ПоказателиИтогов.Колонки.Найти("СпособРасчета") <> Неопределено);
						
						СтрТЧ.СтруктураНастроек.РасчетныеИтоги.ПоказателиИтогов.Сортировать("ИмяПоказателя");
						Для Каждого СтрТЧПИ Из СтрТЧ.СтруктураНастроек.РасчетныеИтоги.ПоказателиИтогов Цикл
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧПИ,"ИмяПоказателя",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧПИ,"НеМасштабируется",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧПИ,"Формула",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							Если ЕстьКолонкаСпособРасчета Тогда
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧПИ,"СпособРасчета",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							КонецЕсли;
						КонецЦикла;

					КонецЕсли;
					
					Если СтрТЧ.ЕстьСвязанныеРеквизиты Тогда
						МассивФормированияХеша.Добавить("СвязанныеРеквизиты=");
						ТабСР = СтрТЧ.СтруктураНастроек.СвязанныеРеквизиты;
						
						Если ТабСР.Колонки.Найти("Наименование") = Неопределено Тогда
							ТабСР.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
						КонецЕсли;
						Если ТабСР.Колонки.Найти("ИсторияВвода") = Неопределено Тогда 
							ТабСР.Колонки.Добавить("ИсторияВвода",Новый ОписаниеТипов("Булево"));
						КонецЕсли;
						Если ТабСР.Колонки.Найти("ПредопределенныеЗначения") = Неопределено Тогда
							ТабСР.Колонки.Добавить("ПредопределенныеЗначения",Новый ОписаниеТипов("Булево"));
						КонецЕсли;
						
						Для Каждого СтрСР Из СтрТЧ.СтруктураНастроек.СвязанныеРеквизиты Цикл
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрСР,"Имя",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрСР,"ИсточникДанных",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							Если ЗначениеЗаполнено(СтрСР.Наименование) Тогда
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрСР,"Наименование",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							КонецЕсли;	
							Если СтрСР.ИсторияВвода = Истина Тогда	
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрСР,"ИсторияВвода",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							КонецЕсли;	
							Если СтрСР.ПредопределенныеЗначения = Истина Тогда									
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрСР,"ПредопределенныеЗначения",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							КонецЕсли;
						КонецЦикла;
						
						Если СтрТЧ.СтруктураНастроек.Свойство("ТаблицаПредопределенныеЗначения")
							И ТипЗнч(СтрТЧ.СтруктураНастроек.ТаблицаПредопределенныеЗначения) = Тип("ТаблицаЗначений") Тогда
							Для Каждого СтрТаб Из СтрТЧ.СтруктураНастроек.ТаблицаПредопределенныеЗначения Цикл
								Для Каждого ТекКол Из СтрТЧ.СтруктураНастроек.ТаблицаПредопределенныеЗначения.Колонки Цикл
									БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТаб,ТекКол.Имя,МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
								КонецЦикла;
							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
					
					Если СтрТЧ.ЕстьСписокДоступныхЗначений Тогда
						МассивФормированияХеша.Добавить("СписокДоступныхЗначений=");
						МассивФормированияХеша.Добавить(СтрСоединить(СтрТЧ.СтруктураНастроек.СписокДоступныхЗначений,","));
						МассивФормированияХеша.Добавить(Символы.ПС);
					КонецЕсли;
					
					Если СтрТЧ.ЕстьУсловноеОформлениеБланка Тогда //переделать
						МассивФормированияХеша.Добавить("ПараметрыУсловногоОформления=");
						
						ПараметрыУсловногоОформления = СтрТЧ.СтруктураНастроек.ПараметрыУсловногоОформления;
						ТабУО = ПараметрыУсловногоОформления.ТаблицаУсловноеОформление;
						Для Каждого СтрТЧУО Из ТабУО Цикл
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"Отключить",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"Условие",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"Комментарий",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ИзменятьЦветФона",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ИзменятьЦветТекста",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ИзменятьШрифт",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"НастройкаПоУмолчанию",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							
							Если СтрТЧУО.ИзменятьШрифт Тогда
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ШрифтОбычный",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ШрифтПолужирный",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ШрифтНаклонный",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ШрифтЗачеркивание",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							КонецЕсли;
							
							Если СтрТЧУО.ИзменятьЦветФона Тогда
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ЦветФона",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);				
							КонецЕсли;
							
							Если СтрТЧУО.ИзменятьЦветТекста Тогда
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧУО,"ЦветТекста",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);				
							КонецЕсли;
							
						КонецЦикла;
						
						МассивФормированияХеша.Добавить(Символы.ПС);
					КонецЕсли;
					
					Если СтрТЧ.ЕстьВыборЗначенийИзСписка Тогда
						БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрТЧ,"ЕстьВыборЗначенийИзСписка",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
						МассивФормированияХеша.Добавить("ВыборЗначенийИзСписка=");
						
						Если СтрТЧ.СтруктураНастроек.Свойство("НастройкаВыбораЗначенийИзСписка")
							И ТипЗнч(СтрТЧ.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка) = Тип("Структура") Тогда
							Если СтрТЧ.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка.Свойство("ТаблицаНастройки")
								И ТипЗнч(СтрТЧ.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка.ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
								
								ТабВыбора = СтрТЧ.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка.ТаблицаНастройки;
								
								Для Каждого СтрВыбора Из ТабВыбора Цикл
									БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрВыбора,"Значение",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
									БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрВыбора,"Представление",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
								КонецЦикла;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
					Если СтрТЧ.ЕстьФильтрПоЗначению Тогда
						МассивФормированияХеша.Добавить("ФильтрПоЗначению=");
						МассивФормированияХеша.Добавить(СтрСоединить(СтрТЧ.СтруктураНастроек.ФильтрПоЗначению.ВыгрузитьКолонку("КодЭлемента"),","));
						МассивФормированияХеша.Добавить(Символы.ПС);
					КонецЕсли;
					
					Если СтрТЧ.ИмяЯчейки = "<НастройкаОтборов>" Тогда
						СтрТЧ.СтруктураНастроек.ГруппыОтборов.Сортировать("НаименованиеГруппы");
						МассивФормированияХеша.Добавить("НастройкаОтборов=");
						Для Каждого СтрОтбора Из СтрТЧ.СтруктураНастроек.ГруппыОтборов Цикл
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрОтбора,"НаименованиеГруппы",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрОтбора,"ОтображатьНаименование",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрОтбора,"Свернутая",МассивФормированияХеша,ДопустимыеВР.Булево,ДопустимыеВР);
							МассивФормированияХеша.Добавить("ТаблицаПолейОтборов=");
							Для Каждого СтрПолейОтбора Из СтрОтбора.ТаблицаПолейОтборов Цикл
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрПолейОтбора,"НаименованиеПоля",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
								БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(СтрПолейОтбора,"ЯчейкиПоиска",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
							КонецЦикла;	
						КонецЦикла;
					КонецЕсли;
					
					Если СтрТЧ.ИмяЯчейки = "<ПоказателиСтраницы>" Тогда
						ПоказателиТекСтр = СтрТЧ.СтруктураНастроек.ПоказателиСтраницы;
						МассивФормированияХеша.Добавить("ПоказателиСтраницы=");
						МассивФормированияХеша.Добавить(СтрСоединить(ПоказателиТекСтр,","));
						МассивФормированияХеша.Добавить(Символы.ПС);
					КонецЕсли;
					Если СтрТЧ.ИмяЯчейки = "<ОтображениеЯчеек>" Тогда
						ЯчейкиДляКомпактногоОтображения = СтрТЧ.СтруктураНастроек.ЯчейкиДляКомпактногоОтображения;
						МассивФормированияХеша.Добавить("ЯчейкиДляКомпактногоОтображения=");
						МассивФормированияХеша.Добавить(ЯчейкиДляКомпактногоОтображения);
						МассивФормированияХеша.Добавить(Символы.ПС);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	Исключение
		//Если вдруг изменилась структура настроек бланка, то сделаем хеш уникальным.
		МассивФормированияХеша.Добавить(Строка(Новый УникальныйИдентификатор));
	КонецПопытки;
			
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"РаскрытиеВМакете",МассивФормированияХеша,ДопустимыеВР.Перечисление,ДопустимыеВР);
	БюджетнаяОтчетностьСервер.ОбработатьРеквизитДляХеша(ЭтотОбъект,"УровеньТочностиПоУмолчанию",МассивФормированияХеша,ДопустимыеВР.Строка,ДопустимыеВР);
	//Реквизиты: Утвержден, ФиксацияСлева, ФиксацияСверху, РучнаяНастройкаКолонкиРаскрытия, КолонкаРаскрытия - не используются
	
	СтрокаХеша = СтрСоединить(МассивФормированияХеша);
	ХешированиеД = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеД.Добавить(СтрокаХеша);
		
	ХешРеквизитов = Base64Строка(ХешированиеД.ХешСумма);
		
	ХешированиеД = Неопределено;
	МассивФормированияХеша = Неопределено;
		
КонецПроцедуры

Процедура СформироватьОсновныеМакетыСтраницБланка() Экспорт
	
	СписокИмен =  ПолучитьСписокИменГруппРаскрытия(Владелец);
	МакетРаскрытий.Очистить();
	
	Сжатие = Новый СжатиеДанных(9);
	
	Для Каждого СтрТЧ Из СтраницыБланка Цикл
		
		ТаблДок = СтрТЧ.Макет.Получить();
		
		ТекНастройки = СтрТЧ.ПараметрыНастройкиБланка.Получить();
		Если ТипЗнч(ТекНастройки) <> Тип("ТаблицаЗначений") Тогда		
			ТекНастройки = Справочники.БланкиОтчетов.ПолучитьПустуюТаблицуНастроекБланка();
		Иначе
			Справочники.БланкиОтчетов.ДополнитьТаблицуНастроекКолонками(ТекНастройки);
		КонецЕсли;
	
		Для Каждого ИмяГруппыРаскрытия Из СписокИмен Цикл
					
			СтруктураМакета = Новый Структура;
			КодГруппыРаскрытия = СокрЛП(ИмяГруппыРаскрытия.Значение);
			
			ПризнакУдаления = Ложь;
			
			ДобавитьОбластьВСтруктуру(СтруктураМакета, ТаблДок, КодГруппыРаскрытия, "Шапка"		,ПризнакУдаления);
			ДобавитьОбластьВСтруктуру(СтруктураМакета, ТаблДок, КодГруппыРаскрытия, "Содержимое",ПризнакУдаления);
			ДобавитьОбластьВСтруктуру(СтруктураМакета, ТаблДок, КодГруппыРаскрытия, "Подвал"	,ПризнакУдаления);
			
			ЕстьТакойМакет = Ложь;
			Для Каждого КлючИЗначение Из СтруктураМакета Цикл
				Если КлючИЗначение.Значение <> Неопределено Тогда
					ЕстьТакойМакет = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьТакойМакет = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПризнакУдаления Тогда
				ТаблДок.УдалитьОбласть(ТаблДок.Область(КодГруппыРаскрытия+"_Боковик"),ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
			
			НоваяСтрока = МакетРаскрытий.Добавить();
			НоваяСтрока.КодГруппыРаскрытия = КодГруппыРаскрытия;
			НоваяСтрока.ОсновнаяЧасть      = Ложь;
			НоваяСтрока.ИмяСтраницы        = СтрТЧ.ИмяСтраницы;
			НоваяСтрока.Макет              = Новый ХранилищеЗначения(СтруктураМакета, Сжатие);
			
		КонецЦикла;
		
		Для Каждого СтрНастройки Из ТекНастройки Цикл
			Если Лев(СтрНастройки.ИмяЯчейки,15) <> "РасчетныеИтоги_" Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураМакета = Новый Структура;
			ПризнакУдаления = Ложь;
			
			ДобавитьОбластьВСтруктуру(СтруктураМакета, ТаблДок, СтрНастройки.ИмяЯчейки, "Шапка"	,ПризнакУдаления);
			ДобавитьОбластьВСтруктуру(СтруктураМакета, ТаблДок, СтрНастройки.ИмяЯчейки, "Содержимое",ПризнакУдаления);
			ДобавитьОбластьВСтруктуру(СтруктураМакета, ТаблДок, СтрНастройки.ИмяЯчейки, "Подвал"	,ПризнакУдаления);
			
			Если ПризнакУдаления Тогда
				ТаблДок.УдалитьОбласть(ТаблДок.Область(СтрНастройки.ИмяЯчейки+"_Боковик"),ТипСмещенияТабличногоДокумента.ПоВертикали);
			КонецЕсли;
			
			НоваяСтрока = МакетРаскрытий.Добавить();
			НоваяСтрока.КодГруппыРаскрытия = СтрНастройки.ИмяЯчейки;
			НоваяСтрока.ИмяСтраницы        = СтрТЧ.ИмяСтраницы;
			НоваяСтрока.ОсновнаяЧасть      = Ложь;
			НоваяСтрока.Макет              = Новый ХранилищеЗначения(СтруктураМакета, Сжатие);
		КонецЦикла;
		//
		
		НоваяСтрока                    = МакетРаскрытий.Добавить();
		НоваяСтрока.КодГруппыРаскрытия = Неопределено;
		НоваяСтрока.ОсновнаяЧасть      = Истина;
		НоваяСтрока.ИмяСтраницы        = СтрТЧ.ИмяСтраницы;
		
		НоваяСтрока.Макет = Новый ХранилищеЗначения(ТаблДок, Сжатие);
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает список значений с кодами групп раскрытия, определенных
// для указанного вида отчета.
//
Функция ПолучитьСписокИменГруппРаскрытия(ВидОтчета)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоказателиОтчетов.ГруппаРаскрытия.Код КАК Код,
	|	ПоказателиОтчетов.ГруппаРаскрытия.Наименование КАК Наименование,
	|	"""" КАК КодСтроки
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &Владелец
	|	И ПоказателиОтчетов.ГруппаРаскрытия <> &ПустаяГруппаРаскрытия
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоказателиОтчетов.ГруппаРаскрытия.Код,
	|	ПоказателиОтчетов.ГруппаРаскрытия.Наименование,
	|	ПоказателиОтчетов.Строка.Код
	|ИЗ
	|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|ГДЕ
	|	ПоказателиОтчетов.Владелец = &Владелец
	|	И ПоказателиОтчетов.ГруппаРаскрытия <> &ПустаяГруппаРаскрытия";
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.УстановитьПараметр("ПустаяГруппаРаскрытия",Справочники.ГруппыРаскрытия.ПустаяСсылка());
	
	СписокИмен = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокИмен.Добавить(СокрЛП(Выборка.Код)+?(НЕ ПустаяСтрока(Выборка.КодСтроки),"_"+СокрЛП(Выборка.КодСтроки),""), СокрЛП(Выборка.Наименование));
	КонецЦикла;
	
	Возврат СписокИмен;
	
КонецФункции

Процедура ДобавитьОбластьВСтруктуру(СтруктураМакета, ТаблДок, КодГруппыРаскрытия, ВидОбласти,ФлагУдаления = Ложь)
	
	Область = ТаблДок.Области.Найти(?(ВидОбласти = "Содержимое",КодГруппыРаскрытия,КодГруппыРаскрытия + "_"+ВидОбласти));
	
	Если Область <> Неопределено Тогда
		
		Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
		
			Если ТаблДок.Области.Найти(КодГруппыРаскрытия + "_Боковик") = Неопределено Тогда
				//Сообщить("Не задана область боковика вертикальных секций раскрытия для группы "+КодГруппыРаскрытия,СтатусСообщения.Важное);
				СтруктураМакета.Вставить(ВидОбласти, Неопределено);
				Возврат;
			КонецЕсли;
			
			ОбластьДляВставки = ТаблДок.Область(КодГруппыРаскрытия + "_Боковик|"+Область.Имя);
			ВертикальныйРежим = Истина;
			ФлагУдаления = Истина; //Признак того, что область нужно удалить вручную
		Иначе
			ВертикальныйРежим = Ложь;
			ОбластьДляВставки = Область;
		КонецЕсли;
		
		СтруктураМакета.Вставить(ВидОбласти, ТаблДок.ПолучитьОбласть(ОбластьДляВставки.Имя));
		
		Если ВертикальныйРежим Тогда
			ОбластьМакета = СтруктураМакета[ВидОбласти].Область(,1,,СтруктураМакета[ВидОбласти].ШиринаТаблицы);
			ОбластьМакета.Имя = Область.Имя;
		Иначе
			ТаблДок.УдалитьОбласть(ОбластьДляВставки,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
	Иначе
		СтруктураМакета.Вставить(ВидОбласти, Неопределено);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьНастройкиПечатиБланкаОтчета()
	
	Перем Выборка, ИмяКлюча, КлючНастроек, ОтборНастроек, ПрефиксКлюча, Причина, СтрТЧ, ТекстСообщения;
		
	ИмяКлюча = ПечатьРегламентированныхФорм.ПолучитьКлючНастроекПечати(Ссылка);
	ПрефиксКлюча = "Общее/НастройкиПечатиТабличногоДокумента/";
	
	Если СоответствиеПрошлыхНастроекПечатиСтраниц = Неопределено Тогда
		СоответствиеПрошлыхНастроекПечатиСтраниц = Новый Соответствие;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрТЧ Из СтраницыБланка Цикл
		
		НастройкиОтличаются = Истина;//по умолчанию настройки отличаются
		СтруктураПрошлыхНастроек = СоответствиеПрошлыхНастроекПечатиСтраниц[СтрТЧ.ИмяСтраницы];		
		Если СтруктураПрошлыхНастроек<>Неопределено Тогда
			НастройкиОтличаются = Ложь;//если есть настройки в базе для такой страницы, то сравним
			Для Каждого КлючИЗначение Из СтруктураПрошлыхНастроек Цикл
				Если КлючИЗначение.Значение<>СтрТЧ[КлючИЗначение.Ключ] Тогда
					НастройкиОтличаются = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НастройкиОтличаются = Ложь Тогда
			Продолжить; //настройки Ориентация, МасштабПечати, АвтоМасштаб не изменились, удалять настройки пользователя не будем
		КонецЕсли;
		
		КлючНастроекОбъекта = ПрефиксКлюча+ИмяКлюча+"_"+СтрТЧ.ИмяСтраницы;
		
		ОтборНастроек = Новый Структура("КлючОбъекта",КлючНастроекОбъекта);
		Выборка = ХранилищеСистемныхНастроек.Выбрать(ОтборНастроек);
		
		Попытка
			Если Выборка.Следующий() Тогда
			
				ХранилищеСистемныхНастроек.Удалить(Выборка.КлючОбъекта,"",Неопределено);
				
			КонецЕсли;
		Исключение
				
			ТекстСообщения = НСтр("ru='Не удалось удалить настройки печати по ключу объекта %1 по причине %2'");
			Причина = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,КлючНастроекОбъекта,Причина);
			
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("ИмпортКомплектаОтчетности.Удаление настроек печати",УровеньЖурналаРегистрации.Предупреждение,Метаданные.Справочники.БланкиОтчетов,Ссылка,ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли