
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);

	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	РасчетыЗаполнитьДобавленныеКолонки();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);

КонецПроцедуры

#КонецОбласти

#Область ИнформационныеСсылки

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Расчеты

&НаКлиенте
Процедура РасчетыПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Расчеты.ТекущиеДанные;
	
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.Счет, РасчетыПоляАналитикиСчета());
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетРасчетов, РасчетыПоляАналитикиСчетаРасчетов());
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.Расчеты.ТекущиеДанные;
		РасчетыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыСчетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расчеты.ТекущиеДанные;
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		ТекущиеДанные, ТекущиеДанные.Счет, РасчетыПоляАналитикиСчета());
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.Счет, РасчетыПоляАналитикиСчета());
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыОплатитьДоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Расчеты.ТекущиеДанные;
	
	Отбор = Новый Структура("ВидРасчетов,КФО,КодЦели,КодМероприятия,ДопКлассификация");
	ЗаполнитьЗначенияСвойств(Отбор, ТекущиеДанные);
	Отбор.Вставить("ИФО", Объект.ИФО);
	Отбор.Вставить("Контрагент", ТекущиеДанные.КонтрагентРасчетов);
	Отбор.Вставить("Договор", ТекущиеДанные.ДоговорРасчетов);
	Отбор.Вставить("Валюта", БухгалтерскийУчетВызовСервераПовтИсп.ВалютаРегламентированногоУчета());
	Отбор.Вставить("КПС", ТекущиеДанные.КПС);
	Отбор.Вставить("КЭК", БухгалтерскийУчетВызовСервераПовтИсп.АналитическийКЭКпоСчету(ТекущиеДанные.СчетРасчетов));
	Отбор.Вставить("ЭтоПоступление", Истина);
	
	СписокОчередныхПлатежей = СписокОчередныхПлатежейПоГрафику(Объект.Организация, ТекущиеДанные.Договор, Отбор);
	
	Элемент.СписокВыбора.Очистить();
	Для Каждого Платеж Из СписокОчередныхПлатежей Цикл
		Элемент.СписокВыбора.Добавить(Платеж.Значение, Платеж.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыСчетРасчетовПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расчеты.ТекущиеДанные;
	ТекущиеДанные.ДопСубконтоРасчетов = Неопределено;
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		ТекущиеДанные, ТекущиеДанные.СчетРасчетов, РасчетыПоляАналитикиСчетаРасчетов());
	БухгалтерскийУчетКлиентСервер.УстановитьПараметрыПолейАналитикиСчета(
		ЭтотОбъект, ТекущиеДанные.СчетРасчетов, РасчетыПоляАналитикиСчетаРасчетов());
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Расчеты.ТекущиеДанные;
	Если ТекущиеДанные.Валюта = ТекущиеДанные.ВалютаРеглУчета Тогда
		ТекущиеДанные.СуммаВал = ТекущиеДанные.Сумма;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РасчетыЗаполнитьДобавленныеКолонки()
	
	Для Каждого СтрокаТаблицы Из Объект.Расчеты Цикл
		РасчетыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(ЭтотОбъект, СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РасчетыПоляАналитикиСчета()

	// Пути к данным полей аналитики счета, выбираемого в таблице формы.
	Возврат Новый Структура("Счет, КПС, Подразделение, Субконто3",
		"Объект.Расчеты.Счет",
		"Объект.Расчеты.КПС",
		"Объект.Расчеты.Подразделение",
		"Объект.Расчеты.ДопСубконто");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция РасчетыПоляАналитикиСчетаРасчетов()

	// Пути к данным полей аналитики счета, выбираемого в таблице формы.
	Возврат Новый Структура("Счет, Субконто3",
		"Объект.Расчеты.СчетРасчетов",
		"Объект.Расчеты.ДопСубконтоРасчетов");

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РасчетыЗаполнитьДобавленныеКолонкиВСтрокеТаблицы(Форма, СтрокаТаблицы)
	
	СтрокаТаблицы.ВалютаРеглУчета = Форма.КэшПараметров.ВалютаРегламентированногоУчета;
	
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		СтрокаТаблицы, СтрокаТаблицы.Счет, РасчетыПоляАналитикиСчета());
	БухгалтерскийУчетКлиентСервер.УстановитьДоступностьПолейАналитикиСчета(
		СтрокаТаблицы, СтрокаТаблицы.СчетРасчетов, РасчетыПоляАналитикиСчетаРасчетов());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Организация'"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыВопроса = ЗаполнитьДокументПараметрыВопроса();
	Если ЗначениеЗаполнено(ПараметрыВопроса.ЗадатьВопрос) Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДокументОбработкаОтвета", ЭтотОбъект, ПараметрыЗаполнения);
		ПоказатьВопрос(Оповещение, ПараметрыВопроса.ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьДокументНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериоду(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Объект.НачалоПериода;
	Диалог.Период.ДатаОкончания = Объект.КонецПериода;
	Диалог.Показать(Новый ОписаниеОповещения("УстановитьОтборПоПериодуЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоПериодуЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Если Период <> Неопределено Тогда
		
		Объект.НачалоПериода = Период.ДатаНачала;
		Объект.КонецПериода  = Период.ДатаОкончания;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ВалютаРубли = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	
	РасчетыЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоПереносОплатыМеждуДоговорамиКонтрагента = (Объект.ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийПереносОплатыОтПокупателей.ПереносОплатыМеждуДоговорамиКонтрагента"));
	ЭтоПереносОплатыМеждуКонтрагентами = (Объект.ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийПереносОплатыОтПокупателей.ПереносОплатыМеждуКонтрагентами"));
	ЭтоПереносОплатыПрочихКредиторов = (Объект.ВидОперации = ПредопределенноеЗначение(
		"Перечисление.ВидыОперацийПереносОплатыОтПокупателей.ПереносОплатыПрочихКредиторов"));
	
	Если ЭтоПереносОплатыМеждуДоговорамиКонтрагента ИЛИ ЭтоПереносОплатыМеждуКонтрагентами Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаОтбор", "Заголовок", НСтр("ru = 'Отбор по остаткам расчетов'"));
	ИначеЕсли ЭтоПереносОплатыПрочихКредиторов Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			"ГруппаОтбор", "Заголовок", НСтр("ru = 'Отбор поступлений денежных средств'"));
	КонецЕсли;
	
	// Перенос оплаты прочих кредиторов.
	ОтборПоПериоду = Новый Массив;
	ОтборПоПериоду.Добавить("НачалоПериода");
	ОтборПоПериоду.Добавить("КонецПериода");
	ОтборПоПериоду.Добавить("УстановитьОтборПоПериоду");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		ОтборПоПериоду, "Видимость", ЭтоПереносОплатыПрочихКредиторов);
	
	КолонкиОплачено = Новый Массив;
	КолонкиОплачено.Добавить("РасчетыОплаченоСумма");
	КолонкиОплачено.Добавить("РасчетыОплаченоСуммаВал");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		КолонкиОплачено, "Видимость", ЭтоПереносОплатыПрочихКредиторов);
	
	// Перенос оплаты между договорами контрагента, между контрагентами.
	КолонкиОстаток = Новый Массив;
	КолонкиОстаток.Добавить("РасчетыОстатокСумма");
	КолонкиОстаток.Добавить("РасчетыОстатокСуммаВал");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		КолонкиОстаток, "Видимость", ЭтоПереносОплатыМеждуДоговорамиКонтрагента ИЛИ ЭтоПереносОплатыМеждуКонтрагентами);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Валютные суммы.
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыВалюта");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыОплаченоСуммаВал");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыОстатокСуммаВал");
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "РасчетыСуммаВал");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Расчеты.Валюта", ВидСравненияКомпоновкиДанных.Равно,
			ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	БухгалтерскийУчет.УстановитьУсловноеОформлениеПолейАналитикиСчета(
		УсловноеОформление, РасчетыПоляАналитикиСчета());
	БухгалтерскийУчет.УстановитьУсловноеОформлениеПолейАналитикиСчета(
		УсловноеОформление, РасчетыПоляАналитикиСчетаРасчетов());
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьДокументПараметрыВопроса()
	
	ПараметрыВопроса = Новый Структура;
	ПараметрыВопроса.Вставить("ЗадатьВопрос", Ложь);
	ПараметрыВопроса.Вставить("ТекстВопроса",
		НСтр("ru = 'Заполнить документ по остаткам на счетах бухгалтерского учета?'") );
	
	ЕстьДанныеВДокументе = (Объект.Расчеты.Количество() > 0);
	Если Объект.Проведен И ЕстьДанныеВДокументе Тогда
		ПараметрыВопроса.ТекстВопроса = ПараметрыВопроса.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Проведение документа будет отменено, а данные будут очищены.'");
		ПараметрыВопроса.ЗадатьВопрос = Истина;
	ИначеЕсли Объект.Проведен Тогда
		ПараметрыВопроса.ТекстВопроса = ПараметрыВопроса.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Проведение документа будет отменено.'");
		ПараметрыВопроса.ЗадатьВопрос = Истина;
	ИначеЕсли ЕстьДанныеВДокументе Тогда
		ПараметрыВопроса.ТекстВопроса = ПараметрыВопроса.ТекстВопроса + Символы.ПС +
			НСтр("ru = 'Данные документа будут очищены.'");
		ПараметрыВопроса.ЗадатьВопрос = Истина;
	КонецЕсли;
	
	Возврат ПараметрыВопроса;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДокументОбработкаОтвета(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийПереносОплатыОтПокупателей.ПереносОплатыМеждуДоговорамиКонтрагента
		ИЛИ Объект.ВидОперации = Перечисления.ВидыОперацийПереносОплатыОтПокупателей.ПереносОплатыМеждуКонтрагентами Тогда
		Отказ = Документы.ПереносОплатыОтПокупателей.ЗаполнитьПоОстаткамРасчетов(Объект);
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийПереносОплатыОтПокупателей.ПереносОплатыПрочихКредиторов Тогда
		Отказ = Документы.ПереносОплатыОтПокупателей.ЗаполнитьПоПоступлениямОплаты(Объект);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РасчетыЗаполнитьДобавленныеКолонки();
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

#Область КонтрольИсполненияДоговоров

&НаСервереБезКонтекста
Функция СписокОчередныхПлатежейПоГрафику(Организация, Договор, Отбор)
	
	Возврат КонтрольИсполненияДоговоров.СписокОчередныхПлатежейПоГрафику(Организация, Договор, Отбор);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
