
#Область СлужебныйПрограммныйИнтерфейс

Функция ПустоеДеревоЭлементовФормы() Экспорт

	// используемые типы
	ТипыГруппировок = Новый Массив;
	ТипыГруппировок.Добавить(Тип("ГруппировкаПодчиненныхЭлементовФормы"));
	ТипыГруппировок.Добавить(Тип("ГруппировкаКолонок"));
	ОписаниеТипаГруппировок = Новый ОписаниеТипов(ТипыГруппировок);
	
	ТипСтрока                           = Новый ОписаниеТипов("Строка");
	ТипБулево                           = Новый ОписаниеТипов("Булево");
	ТипЧисло                            = Новый ОписаниеТипов("Число");
	ТипОписаниеТипов                    = Новый ОписаниеТипов("ОписаниеТипов");
	ТипНеопределено                     = Новый ОписаниеТипов("Неопределено");
	ТипФорматированнаяСтрока            = Новый ОписаниеТипов("ФорматированнаяСтрока");
	ТипОтображениеПодсказки             = Новый ОписаниеТипов("ОтображениеПодсказки");
	ТипСквозноеВыравнивание             = Новый ОписаниеТипов("СквозноеВыравнивание");
	ТипВыравниваниеЭлементовИЗаголовков = Новый ОписаниеТипов("ВыравниваниеЭлементовИЗаголовков");
	ТипГоризонтальноеПоложениеЭлемента  = Новый ОписаниеТипов("ГоризонтальноеПоложениеЭлемента");
	ТипВертикальноеПоложениеЭлемента    = Новый ОписаниеТипов("ВертикальноеПоложениеЭлемента");
	ТипПоложениеЗаголовкаЭлементаФормы  = Новый ОписаниеТипов("ПоложениеЗаголовкаЭлементаФормы");
	ТипПроверкаЗаполнения               = Новый ОписаниеТипов("ПроверкаЗаполнения");
	ТипМассив                           = Новый ОписаниеТипов("Массив");
	ТипЦвет                             = Новый ОписаниеТипов("Цвет");
	
	// описание дерева
	Результат = Новый ДеревоЗначений;
	Колонки = Результат.Колонки;
	// общие свойства
	Колонки.Добавить("ИмяДляФормулы",                      ТипСтрока);
	Колонки.Добавить("Имя",                                ТипСтрока);
	Колонки.Добавить("ИмяЭлемента",                        ТипСтрока);
	Колонки.Добавить("Заголовок",                          ТипСтрока);
	Колонки.Добавить("ТипЭлемента",                        ТипОписаниеТипов);
	Колонки.Добавить("ВидЭлемента",                        ТипНеопределено);
	Колонки.Добавить("Валютный",                           ТипБулево);
	Колонки.Добавить("Подсказка",                          ТипСтрока);
	Колонки.Добавить("НеПовторять",                        ТипБулево);
	Колонки.Добавить("ПереопределенныйРеквизит",           ТипБулево);
	Колонки.Добавить("РасширеннаяПодсказка",               ТипФорматированнаяСтрока);
	Колонки.Добавить("ОтображениеПодсказки",               ТипОтображениеПодсказки);
	Колонки.Добавить("РастягиватьПоГоризонтали",           ТипНеопределено);
	// реквизиты команды
	Колонки.Добавить("Действие",                           ТипСтрока);
	Колонки.Добавить("ИмяКартинки",                        ТипСтрока);
	// реквизиты группы
	Колонки.Добавить("ОтображатьЗаголовок",                ТипБулево);
	Колонки.Добавить("Группировка",                        ОписаниеТипаГруппировок);
	Колонки.Добавить("Отображение",                        ТипСтрока);
	Колонки.Добавить("Объединенная",                       ТипБулево);
	Колонки.Добавить("СквозноеВыравнивание",               ТипСквозноеВыравнивание);
	Колонки.Добавить("ВыравниваниеЭлементовИЗаголовков",   ТипВыравниваниеЭлементовИЗаголовков);
	Колонки.Добавить("ГоризонтальноеПоложениеВГруппе",     ТипГоризонтальноеПоложениеЭлемента);
	Колонки.Добавить("ВертикальноеПоложениеВГруппе",       ТипВертикальноеПоложениеЭлемента);
	Колонки.Добавить("ГоризонтальноеПоложениеПодчиненных", ТипГоризонтальноеПоложениеЭлемента);
	Колонки.Добавить("ВертикальноеПоложениеПодчиненных",   ТипВертикальноеПоложениеЭлемента);
	Колонки.Добавить("РастягиватьПоВертикали",             ТипНеопределено);
	// реквизиты элемента
	Колонки.Добавить("ТипЗначения",                        ТипОписаниеТипов);
	Колонки.Добавить("Реквизит",                           ТипСтрока);
	Колонки.Добавить("Путь",                               ТипСтрока);
	Колонки.Добавить("СвязиПараметровВыбора",              ТипНеопределено);
	Колонки.Добавить("СвязиПоТипу",                        ТипСтрока);
	Колонки.Добавить("СтруктураСвязиПоТипу",               ТипНеопределено);
	Колонки.Добавить("ПараметрыВыбора",                    ТипМассив);
	Колонки.Добавить("ПоложениеЗаголовка",                 ТипПоложениеЗаголовкаЭлементаФормы);
	Колонки.Добавить("ЦветФона",                           ТипЦвет);
	Колонки.Добавить("ШиринаЭлемента",                     ТипЧисло);
	Колонки.Добавить("ФункциональныеОпции",                ТипМассив);
	Колонки.Добавить("ТолькоЧтение",                       ТипБулево);
	Колонки.Добавить("Видимость",                          ТипБулево);
	Колонки.Добавить("АвтоМаксимальнаяШирина",             ТипБулево);
	Колонки.Добавить("МаксимальнаяШирина",                 ТипЧисло);
	Колонки.Добавить("ВысотаЗаголовка",                    ТипЧисло);
	Колонки.Добавить("ПроверкаВвода",                      ТипПроверкаЗаполнения);
	Колонки.Добавить("ПодсказкаВвода",                     ТипСтрока);
	Колонки.Добавить("ПодсказкаРастягиватьПоГоризонтали",  ТипНеопределено);
	Колонки.Добавить("ПодсказкаРастягиватьПоВертикали",    ТипНеопределено);
	Колонки.Добавить("ПодсказкаАвтоМаксимальнаяШирина",    ТипБулево);
	Колонки.Добавить("ПодсказкаМаксимальнаяШирина",        ТипЧисло);
	Колонки.Добавить("СписокВыбора",                       Новый ОписаниеТипов("СписокЗначений"));
	// подключаемые процедуры элемента
	Колонки.Добавить("НачалоВыбора",                       ТипСтрока);
	Колонки.Добавить("ПриИзменении",                       ТипСтрока);
	// доп. колонки
	Колонки.Добавить("ИмяТаблицы",                         ТипСтрока);
	Колонки.Добавить("ПредопределеннаяТЧ",                 ТипБулево);
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьРеквизитыЭлементыНаФорму(ПараметрыДобавленияЭлементовФормы) Экспорт
	
	Форма                          = ПараметрыДобавленияЭлементовФормы.Форма;
	Объект                         = ПараметрыДобавленияЭлементовФормы.Объект;
	ТипЗначенияСсылки              = ПараметрыДобавленияЭлементовФормы.ТипЗначенияСсылки;
	ПолеДляРеквизитовОперации      = ПараметрыДобавленияЭлементовФормы.ПолеДляРеквизитовОперации;
	ПолеДляДополнительныхТабЧастей = ПараметрыДобавленияЭлементовФормы.ПолеДляДополнительныхТабЧастей;
	ДобавлятьДопТабЧасти           = ПараметрыДобавленияЭлементовФормы.ДобавлятьДопТабЧасти;
	ТиповаяОперация                = ПараметрыДобавленияЭлементовФормы.ТиповаяОперация;
	ПовторноеЧтениеОбъекта         = ПараметрыДобавленияЭлементовФормы.ПовторноеЧтениеОбъекта;
	РеквизитыФормы                 = ПараметрыДобавленияЭлементовФормы.РеквизитыФормы;
	ВалютныйУчет                   = ПараметрыДобавленияЭлементовФормы.ВалютныйУчет;
	ПредварительныйПросмотр        = ПараметрыДобавленияЭлементовФормы.ПредварительныйПросмотр;
	
	ИдентификаторДокумента = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗначенияСсылки);
	
	Если ЗначениеЗаполнено(РеквизитыФормы) Тогда
		РеквизитыФормыСтруктурой = Новый Структура(СтрСоединить(РеквизитыФормы,","));
	Иначе
		РеквизитыФормыСтруктурой = Новый Структура;
	КонецЕсли;
	
	// проверить необходимость вывода поля "Типовая операция"
	Если ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации Тогда
		
		Если Не ЗначениеЗаполнено(ТиповаяОперация) Тогда
			Если НЕ Справочники.ТиповыеОперации.ЕстьТиповаяОперацияВидаДокумента(ИдентификаторДокумента) Тогда
				// В справочнике нет типовых операций для этого документа. Не выводим поле типовой операции.
				ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// получить переопределенные реквизиты, которые не добавляются на форму,
	// а отображаются в имеющиеся реквизиты/колонки/таблицы
	ПереопределенныеРеквизиты = Новый ТаблицаЗначений;
	ПереопределенныеРеквизиты.Колонки.Добавить("ИмяДляФормулы", Новый ОписаниеТипов("Строка"));
	ПереопределенныеРеквизиты.Колонки.Добавить("ИмяРеквизита",  Новый ОписаниеТипов("Строка"));
	ПереопределенныеРеквизиты.Колонки.Добавить("ИмяЭлемента",   Новый ОписаниеТипов("Строка"));
	
	// сформировать дерево добавляемых элементов формы
	ДеревоЭлементовФормы = ПустоеДеревоЭлементовФормы();
	
	Если ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации Тогда
		
		Если РеквизитыФормыСтруктурой.Свойство("ТиповыеОперации_ПереопределенныеРеквизиты")
			И ТипЗнч(Форма["ТиповыеОперации_ПереопределенныеРеквизиты"]) = Тип("СписокЗначений") Тогда
			// задан список переопределенных реквизитов формы
			Для каждого ОписаниеПереопределенногоРеквизита Из Форма["ТиповыеОперации_ПереопределенныеРеквизиты"] Цикл
				
				ЭлементФормы = Форма.Элементы.Найти(ОписаниеПереопределенногоРеквизита.Значение);
				Если ЭлементФормы <> Неопределено Тогда
					ПереопределенныйРеквизит = ПереопределенныеРеквизиты.Добавить();
					ПереопределенныйРеквизит.ИмяДляФормулы = ВРЕГ(ОписаниеПереопределенногоРеквизита.Представление);
					СоставПутиКДанным = СтрРазделить(ЭлементФормы.ПутьКДанным, ".");
					Если СоставПутиКДанным.Количество() = 3 Тогда
						// реквизит физической табличной части
						ПереопределенныйРеквизит.ИмяРеквизита = СоставПутиКДанным[2];
					ИначеЕсли СоставПутиКДанным.Количество() = 2 Тогда
						// реквизит виртуальной табличной части
						ПереопределенныйРеквизит.ИмяРеквизита = СоставПутиКДанным[1];
					Иначе
						ПереопределенныйРеквизит.ИмяРеквизита = ЭлементФормы.ПутьКДанным;
					КонецЕсли;
					ПереопределенныйРеквизит.ИмяЭлемента = ЭлементФормы.Имя;
				КонецЕсли;
			
			КонецЦикла;
		КонецЕсли;
		ПереопределенныеРеквизиты.Индексы.Добавить("ИмяДляФормулы");
	
		ДеревоЭлементовТиповойОперации = ДеревоЭлементовТиповойОперации(ТиповаяОперация, ИдентификаторДокумента, НЕ ПредварительныйПросмотр);
		ДобавитьИзДереваВДерево(ДеревоЭлементовТиповойОперации, ДеревоЭлементовФормы, ПереопределенныеРеквизиты);
		
	КонецЕсли;
	
	Если ДобавлятьДопТабЧасти Тогда
		
		ДеревоЭлементовДополнительныхТабличныхЧастей = ДеревоЭлементовДополнительныхТабличныхЧастей(ИдентификаторДокумента);
		ДобавитьИзДереваВДерево(ДеревоЭлементовДополнительныхТабличныхЧастей, ДеревоЭлементовФормы, ПереопределенныеРеквизиты);
		
	КонецЕсли;
	
	// существующие реквизиты используются чтобы ловить конфликты имени физического реквизита и добавляемого
	// в случае конфликтов возможна неправильная интерпретация данных при формировании проводок
	СуществующиеРеквизитыФормы = Новый Соответствие;
	СуществующиеРеквизитыФормы.Вставить("ЭтотОбъект", БухгалтерскиеОперацииСервер.ПолучитьИменаРеквизитовФормы(Форма, "", Истина));
	Для каждого ЭлементДерева Из ДеревоЭлементовФормы.Строки Цикл
	
		Если ЭлементДерева.ВидЭлемента = Неопределено И ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(
				ЭлементДерева.ТипЭлемента, Тип("ТаблицаФормы")) Тогда
				
			Если РеквизитыФормыСтруктурой.Свойство(ЭлементДерева.Имя) Тогда
				Если ЭлементДерева.ПредопределеннаяТЧ <> Истина Тогда 
					СуществующиеРеквизитыФормы.Вставить(ВРЕГ(ЭлементДерева.Имя), Новый Массив);
				Иначе
					ПолноеИмяТЧ = "Объект." + ЭлементДерева.Имя;
					СуществующиеРеквизитыФормы.Вставить(ВРЕГ(ПолноеИмяТЧ), БухгалтерскиеОперацииСервер.ПолучитьИменаРеквизитовФормы(Форма, ПолноеИмяТЧ, Истина));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
	
	// заполнить таблицу добавляемых реквизитов/доп. колонок
	ДобавленныеРеквизитыОперации = ПустаяТаблицаДобавленныхРеквизитовОперации();
	
	ПараметрыПроверкиРеквизитов = Новый Структура;
	ПараметрыПроверкиРеквизитов.Вставить("ВалютныйУчет",                 ВалютныйУчет);
	ПараметрыПроверкиРеквизитов.Вставить("ПовторноеЧтениеОбъекта",       ПовторноеЧтениеОбъекта);
	ПараметрыПроверкиРеквизитов.Вставить("ДобавленныеРеквизитыОперации", ДобавленныеРеквизитыОперации);
	ПараметрыПроверкиРеквизитов.Вставить("ДобавляемыеРеквизиты",         Новый Массив);
	ПараметрыПроверкиРеквизитов.Вставить("УдаляемыеРеквизиты",           Новый Массив);
	ПараметрыПроверкиРеквизитов.Вставить("СуществующиеРеквизитыФормы",   СуществующиеРеквизитыФормы);
	ПараметрыПроверкиРеквизитов.Вставить("КонфликтыИменРеквизитов",      Новый СписокЗначений);
	
	ПроверитьДобавляемыеРеквизитыРекурсивно(ДеревоЭлементовФормы, ПараметрыПроверкиРеквизитов);
		
	КонфликтыИменРеквизитов = ПараметрыПроверкиРеквизитов.КонфликтыИменРеквизитов;
	
	// изменить реквизиты формы
	ДобавляемыеРеквизиты = ПараметрыПроверкиРеквизитов.ДобавляемыеРеквизиты;
	Если Не ПовторноеЧтениеОбъекта Тогда
		ДобавитьОбязательныеРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;
	УдаляемыеРеквизиты = Новый Массив;
	Если ПовторноеЧтениеОбъекта Тогда
		Для каждого ОписаниеДопРеквизита Из Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"] Цикл
		
			Если НЕ ОписаниеДопРеквизита.ЭтоГруппа
				И НЕ ОписаниеДопРеквизита.НеПовторять
				И ЗначениеЗаполнено(ОписаниеДопРеквизита.ИмяРеквизита) Тогда
				
				Если НЕ ОписаниеДопРеквизита.ПереопределенныйРеквизит Тогда
					УдаляемыеРеквизиты.Добавить(ОписаниеДопРеквизита.ИмяРеквизита);
				КонецЕсли;
			КонецЕсли;
		
		КонецЦикла;
	КонецЕсли;
	
	Если ДобавляемыеРеквизиты.Количество() > 0 ИЛИ УдаляемыеРеквизиты.Количество() > 0 Тогда
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	КонецЕсли;
	
	Если НЕ ДобавлятьДопТабЧасти Тогда
		// если ранее были добавлены реквизиты таб. частей, то данных о них над переписать в новую таблицу
		Для каждого СтрокаРеквизита Из Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"] Цикл
		
			Если ЗначениеЗаполнено(СтрокаРеквизита.ИмяТаблицы) Тогда
				ЗаполнитьЗначенияСвойств(ДобавленныеРеквизитыОперации.Добавить(), СтрокаРеквизита);
			КонецЕсли;
		
		КонецЦикла;
	КонецЕсли;
	
	Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"].Загрузить(ДобавленныеРеквизитыОперации);
	
	// изменить элементы формы
	
	Для каждого ОписаниеРеквизита Из ПереопределенныеРеквизиты Цикл
		
		ВидимостьЭлемента = ДобавленныеРеквизитыОперации.Найти(ОписаниеРеквизита.ИмяЭлемента, "ИмяЭлемента") <> Неопределено;
			
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
			ОписаниеРеквизита.ИмяЭлемента, "Видимость", ВидимостьЭлемента);
		
	КонецЦикла; 
	
	Если ПовторноеЧтениеОбъекта Тогда
		УдалитьДобавленныеЭлементыФормыПриПовторномЧтении(Форма,
			Форма["БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"], ПолеДляРеквизитовОперации)
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПовторноеЧтениеОбъекта",         ПовторноеЧтениеОбъекта);
	ДополнительныеПараметры.Вставить("ВалютныйУчет",                   ВалютныйУчет);
	ДополнительныеПараметры.Вставить("ПолеДляДополнительныхТабЧастей", ПолеДляДополнительныхТабЧастей);
	ДополнительныеПараметры.Вставить("КонфликтыИменРеквизитов",        КонфликтыИменРеквизитов);
	ДополнительныеПараметры.Вставить("ДеревоЭлементов",                ДеревоЭлементовФормы);
	ДополнительныеПараметры.Вставить("ТиповаяОперация",                ТиповаяОперация);
	
	ОбновитьЭлементыФормы(Форма, ДеревоЭлементовФормы, ПолеДляРеквизитовОперации, ДополнительныеПараметры);
	ДополнительныеПараметры = Неопределено;
	
	// заполнить служебные реквизиты формы
	ПризнакФормированияПроводокАвтоматически = ПолучитьФункциональнуюОпцию("ФормированиеПроводокПриПроведенииДокумента");
	Форма["БухгалтерскиеОперации_ПризнакФормированияПроводокАвтоматически"] = ПризнакФормированияПроводокАвтоматически;
	
	Если Не ПовторноеЧтениеОбъекта Тогда
		ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы(Форма, Объект, ТиповаяОперация);
	КонецЕсли;
	
	Если ВалютныйУчет И ПризнакФормированияПроводокАвтоматически Тогда
		Форма.КэшПараметров.Служебные.ОбновлятьКурсВалютыАвтоматически = Истина;
	КонецЕсли;
	
	Форма["БухгалтерскиеОперации_СписокЗависимыхЭлементов"] = ПолучитьСписокСвязанныхРеквизитов(ТиповаяОперация, ИдентификаторДокумента.Имя, ДобавленныеРеквизитыОперации);
	Форма["СписокЭлементовСКонфликтамиИмен"] = КонфликтыИменРеквизитов;
	
	Если Не ПовторноеЧтениеОбъекта И НЕ ПредварительныйПросмотр Тогда
		Форма["БухгалтерскиеОперации_ИмяГруппыЭлементовТиповойОперации"] = ПолеДляРеквизитовОперации.Имя;
	КонецЕсли;
	
	Если ПризнакФормированияПроводокАвтоматически
		И Не ПовторноеЧтениеОбъекта
		И ПараметрыДобавленияЭлементовФормы.ДобавлятьДопРеквизитыОперации Тогда
		
		ДобавитьКомандыУправленияТиповымиОперациями(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ДеревоЭлементовФормыТиповойОперации(ТиповаяОперация, ИдентификаторДокумента) Экспорт
	
	ДокументыБезКнопкиПросмотра = БухгалтерскиеОперацииСервер.ДокументыФормирующиеПроводкиВсегдаОдновременно();
	ДокументыБезКнопкиПросмотра.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("ДокументСсылка.ОперацияБух")));
	
	Результат = ПустоеДеревоЭлементовФормы();
	
	КнопкаПредварительныйПросмотра = ПолучитьФункциональнуюОпцию("ФормированиеПроводокПриПроведенииДокумента")
		И ДокументыБезКнопкиПросмотра.Найти(ИдентификаторДокумента) = Неопределено;
	ДобавитьЭлементыФормыТиповойОперации(Результат, ИдентификаторДокумента, КнопкаПредварительныйПросмотра,
		БухгалтерскийУчет.ПоДокументуВозможноИсправлениеОшибок(ИдентификаторДокумента));
	
	Если ЗначениеЗаполнено(ТиповаяОперация) Тогда
		ДополнитьДеревоЭлементовТиповойОперацииДополнительнымиРеквизитами(Результат, ТиповаяОперация);
		ДобавитьОтветственногоИсполнителя(Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Видимость команды предварительного просмотра операции.
// 
// Параметры:
//  Ссылка - ДокументСсылка
// 
// Возвращаемое значение:
//  Булево - Видимость команды предварительного просмотра операции
Функция ВидимостьКомандыПредварительногоПросмотраОперации(Ссылка) Экспорт

	Если Ссылка.Пустая() Тогда
		Видимость = Истина;
	Иначе
		УстановитьПривилегированныйРежим(Истина);	
		ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Проведен");
		УстановитьПривилегированныйРежим(Ложь);

		Если НЕ ДокументПроведен Тогда
			Видимость = Истина;
		Иначе
			Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;

	Возврат Видимость;
	
КонецФункции

Функция ВидимостьПоФункциональнымОпциям(Форма, ПереданныеФО) Экспорт

	Если Не ЗначениеЗаполнено(ПереданныеФО) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(ПереданныеФО) = Тип("Массив") Тогда
		МассивФО = ПереданныеФО;
	Иначе
		МассивФО = СтрРазделить(ПереданныеФО, ",");
	КонецЕсли;
	
	Для каждого ТекФО Из МассивФО Цикл
		Если Форма.ПолучитьФункциональнуюОпциюФормы(ТекФО) = Истина Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	// функциональные опции заданы, но ни одна не равна истине
	Возврат Ложь;

КонецФункции

Функция ШаблонСвойствЭлементаФормы(ЭтоГруппа) Экспорт

	ШаблонЗаполнения = Новый Структура;

	Если ЭтоГруппа Тогда
		ШаблонЗаполнения.Вставить("ВидГруппы",                          "Обычная группа");
		ШаблонЗаполнения.Вставить("Отображение",                        "Нет");
		ШаблонЗаполнения.Вставить("Группировка",                        "Вертикальная");
		ШаблонЗаполнения.Вставить("Объединенная",                       Истина);
		ШаблонЗаполнения.Вставить("ОтображатьЗаголовок",                Ложь);
		ШаблонЗаполнения.Вставить("СквозноеВыравнивание",               "Авто");
		ШаблонЗаполнения.Вставить("ВыравниваниеЭлементовИЗаголовков",   "Авто");
		ШаблонЗаполнения.Вставить("Подсказка",                          "");
		ШаблонЗаполнения.Вставить("ПодсказкаПредставление",             "");
		ШаблонЗаполнения.Вставить("ОтображениеПодсказки",               "Авто");
		ШаблонЗаполнения.Вставить("ГоризонтальноеПоложениеВГруппе",     "Авто");
		ШаблонЗаполнения.Вставить("ВертикальноеПоложениеВГруппе",       "Авто");
		ШаблонЗаполнения.Вставить("ГоризонтальноеПоложениеПодчиненных", "Авто");
		ШаблонЗаполнения.Вставить("ВертикальноеПоложениеПодчиненных",   "Авто");
		ШаблонЗаполнения.Вставить("РастягиватьПоГоризонтали",           "Авто");
		ШаблонЗаполнения.Вставить("РастягиватьПоВертикали",             "Авто");
	Иначе
		ШаблонЗаполнения.Вставить("ВидЭлемента",                       "Поле ввода");
		ШаблонЗаполнения.Вставить("ПоложениеЗаголовка",                "Авто");
		ШаблонЗаполнения.Вставить("ТолькоЧтение",                      Ложь);
		ШаблонЗаполнения.Вставить("Видимость",                         Истина);
		ШаблонЗаполнения.Вставить("АвтоМаксимальнаяШирина",            Истина);
		ШаблонЗаполнения.Вставить("МаксимальнаяШирина",                0);
		ШаблонЗаполнения.Вставить("РастягиватьПоГоризонтали",          "Авто");
		ШаблонЗаполнения.Вставить("ВысотаЗаголовка",                   0);
		ШаблонЗаполнения.Вставить("ПроверкаВвода",                     "Не проверять");
		ШаблонЗаполнения.Вставить("ПодсказкаВвода",                    "");
		ШаблонЗаполнения.Вставить("Подсказка",                         "");
		ШаблонЗаполнения.Вставить("ПодсказкаПредставление",            "");
		ШаблонЗаполнения.Вставить("ОтображениеПодсказки",              "Авто");
		ШаблонЗаполнения.Вставить("ПодсказкаРастягиватьПоГоризонтали", "Авто");
		ШаблонЗаполнения.Вставить("ПодсказкаРастягиватьПоВертикали",   "Авто");
		ШаблонЗаполнения.Вставить("ПодсказкаАвтоМаксимальнаяШирина",   Истина);
		ШаблонЗаполнения.Вставить("ПодсказкаМаксимальнаяШирина",       0);
		ШаблонЗаполнения.Вставить("СвязиПараметровВыбора",             "");
		ШаблонЗаполнения.Вставить("ПараметрыВыбора",                   "");
		ШаблонЗаполнения.Вставить("СвязиПоТипу");
	КонецЕсли;
	
	Возврат ШаблонЗаполнения;

КонецФункции

Процедура ЗаполнитьСвойстваЭлементаФормыИзСтарогоФорматаНастроек(СвойстваЭлемента, СтарыеНастройки, ЭтоГруппа) Экспорт

	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	Если ЭтоГруппа Тогда
		Если ТипЗнч(СтарыеНастройки.ВидЭлемента) = Тип("Число") Тогда
			ВидЭлемента = ?(СтарыеНастройки.ВидЭлемента = 1, "Страница",
				?(СтарыеНастройки.ВидЭлемента = 2, "Страницы", "Обычная группа"));
		Иначе
			ВидЭлемента = ?(ТипСтрока.ПривестиЗначение(СтарыеНастройки.ВидЭлемента) = "", "Обычная группа", СтарыеНастройки.ВидЭлемента);
		КонецЕсли;
		Если ТипЗнч(СтарыеНастройки.Отображение) = Тип("Число") Тогда
			Отображение = ?(СтарыеНастройки.Отображение = 1, "Сильное выделение",
				?(СтарыеНастройки.Отображение = 2, "Слабое выделение",
				?(СтарыеНастройки.Отображение = 3, "Нормальное выделение", "Без отображения")));
		Иначе
			Отображение = ?(ТипСтрока.ПривестиЗначение(СтарыеНастройки.Отображение) = "", "Без отображения", СтарыеНастройки.Отображение);
		КонецЕсли;
		Если ТипЗнч(СтарыеНастройки.ГруппировкаЭлементов) = Тип("Число") Тогда
			Группировка = ?(СтарыеНастройки.ГруппировкаЭлементов = 1, "Вертикальная", "Горизонтальная");
		Иначе
			Группировка = ?(ТипСтрока.ПривестиЗначение(СтарыеНастройки.ГруппировкаЭлементов) = "", "Вертикальная", СтарыеНастройки.ГруппировкаЭлементов);
		КонецЕсли;
			
		СвойстваЭлемента.ВидГруппы                = ВидЭлемента;
		СвойстваЭлемента.Отображение              = Отображение;
		СвойстваЭлемента.Группировка              = Группировка;
		СвойстваЭлемента.ОтображатьЗаголовок      = ?(ЗначениеЗаполнено(СтарыеНастройки.ОтображатьЗаголовок), СтарыеНастройки.ОтображатьЗаголовок, Ложь);
		СвойстваЭлемента.РастягиватьПоГоризонтали = ?(СтарыеНастройки.РастягиватьПоГоризонтали = Истина, Истина, "Авто");
	Иначе
		
		ТипБулево = Новый ОписаниеТипов("Булево");
		
		Если ТипЗнч(СтарыеНастройки.ВидЭлемента) = Тип("Число") Тогда
			ВидЭлемента = ?(СтарыеНастройки.ВидЭлемента = 1, "Поле флажка", "Поле ввода");
		Иначе
			ВидЭлемента = ?(ТипСтрока.ПривестиЗначение(СтарыеНастройки.ВидЭлемента) = "", "Поле ввода", СтарыеНастройки.ВидЭлемента);
		КонецЕсли;
		Если ТипЗнч(СтарыеНастройки.ПоложениеЗаголовка) = Тип("Число") Тогда
			ПоложениеЗаголовкаЭлемента = ?(СтарыеНастройки.ПоложениеЗаголовка = 0, "Авто",
				?(СтарыеНастройки.ПоложениеЗаголовка = 2, "Лево",
				?(СтарыеНастройки.ПоложениеЗаголовка = 3, "Верх",
				?(СтарыеНастройки.ПоложениеЗаголовка = 4, "Право",
				?(СтарыеНастройки.ПоложениеЗаголовка = 5, "Низ", "Нет")))));
		Иначе
			ПоложениеЗаголовкаЭлемента = ?(ТипСтрока.ПривестиЗначение(СтарыеНастройки.ПоложениеЗаголовка) = "", "Авто", СтарыеНастройки.ПоложениеЗаголовка);
		КонецЕсли;
		Обязательный = ?(ТипБулево.ПривестиЗначение(СтарыеНастройки.Обязательный) = Истина, "Выдавать ошибку", "Не проверять");
		
		СвойстваЭлемента.ВидЭлемента              = ВидЭлемента;
		СвойстваЭлемента.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлемента;
		СвойстваЭлемента.ТолькоЧтение             = СтарыеНастройки.ЗапретитьИзменение;
		СвойстваЭлемента.Видимость                = НЕ ТипБулево.ПривестиЗначение(СтарыеНастройки.НевидимыйЭлемент);
		СвойстваЭлемента.РастягиватьПоГоризонтали = ?(СтарыеНастройки.РастягиватьПоГоризонтали = Истина, Истина, "Авто");
		СвойстваЭлемента.ПроверкаВвода            = Обязательный;
		СвойстваЭлемента.СвязиПараметровВыбора    = СтарыеНастройки.СвязиПараметровВыбора;
		СвойстваЭлемента.СвязиПоТипу              = СтарыеНастройки.СвязиПоТипу;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаменитьУстаревшееОтображениеОбычнойГруппы(Значение, ИзменилисьДанныеРеквизита = Ложь) Экспорт

	Если Значение = "Без отображения" Тогда
		Значение = "Нет";
		ИзменилисьДанныеРеквизита = Истина;
	ИначеЕсли Значение = "Нормальное выделение" Тогда
		Значение = "Обычное выделение";
		ИзменилисьДанныеРеквизита = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустаяТаблицаДобавленныхРеквизитовОперации()
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	ДобавленныеРеквизитыОперации = Новый ТаблицаЗначений;
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ИмяДляФормулы",            ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ИмяРеквизита",             ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ИмяЭлемента",              ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("Заголовок",                ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ФункциональныеОпции",      ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("Обязательный",             ОписаниеТиповБулево);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ЭтоГруппа",                ОписаниеТиповБулево);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("Видимость",                ОписаниеТиповБулево);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ВидимостьПоФО",            ОписаниеТиповБулево);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ПереопределенныйРеквизит", ОписаниеТиповБулево);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("НеПовторять",              ОписаниеТиповБулево);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ДополнительныйРеквизит",   ОписаниеТиповБулево);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ИмяТаблицы",               ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ИмяРеквизитаТаблицы",      ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ЗаголовокТаблицы",         ОписаниеТиповСтрока);
	ДобавленныеРеквизитыОперации.Колонки.Добавить("ПредопределеннаяТЧ",       ОписаниеТиповБулево);
	
	Возврат ДобавленныеРеквизитыОперации;
	
КонецФункции

Процедура ПроверитьДобавляемыеРеквизитыРекурсивно(Дерево, ПараметрыПроверкиРеквизитов, ИмяТабличнойЧасти = "", ЗаголовокТабличнойЧасти = "", ПредопределеннаяТЧ = Ложь)
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если СтрокаДерева.Валютный И НЕ ПараметрыПроверкиРеквизитов.ВалютныйУчет Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДобавленногоРеквизита = ПараметрыПроверкиРеквизитов.ДобавленныеРеквизитыОперации.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДобавленногоРеквизита, СтрокаДерева,,"ФункциональныеОпции");
		СтрокаДобавленногоРеквизита.ВидимостьПоФО = Истина;
		Если СтрокаДерева.Реквизит = "ТиповаяОперация" Тогда
			СтрокаДобавленногоРеквизита.ИмяДляФормулы = "ТиповаяОперация";
		ИначеЕсли СтрокаДерева.Реквизит = "Курс" Тогда
			СтрокаДобавленногоРеквизита.ИмяДляФормулы = "Курс";
		ИначеЕсли СтрокаДерева.Реквизит = "Кратность" Тогда
			СтрокаДобавленногоРеквизита.ИмяДляФормулы = "Кратность";
		КонецЕсли;
		СтрокаДобавленногоРеквизита.Обязательный = (СтрокаДерева.ПроверкаВвода = ПроверкаЗаполнения.ВыдаватьОшибку);
		СтрокаДобавленногоРеквизита.ИмяРеквизита = СтрокаДерева.Имя;
		СтрокаДобавленногоРеквизита.ЭтоГруппа = ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(СтрокаДерева.ТипЭлемента, Тип("ГруппаФормы"))
			ИЛИ ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(СтрокаДерева.ТипЭлемента, Тип("ТаблицаФормы"));
		СтрокаДобавленногоРеквизита.ФункциональныеОпции = СтрСоединить(СтрокаДерева.ФункциональныеОпции, ",");
		
		Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
			СтрокаДобавленногоРеквизита.ЗаголовокТаблицы = ЗаголовокТабличнойЧасти;
			СтрокаДобавленногоРеквизита.ПредопределеннаяТЧ = ПредопределеннаяТЧ;
			СтрокаДобавленногоРеквизита.ИмяРеквизитаТаблицы = ИмяТабличнойЧасти;
		КонецЕсли;
		
		Если СтрокаДерева.ТипЭлемента.СодержитТип(Тип("ГруппаФормы")) Тогда
			
			ПроверитьДобавляемыеРеквизитыРекурсивно(СтрокаДерева, ПараметрыПроверкиРеквизитов, ИмяТабличнойЧасти, ЗаголовокТабличнойЧасти, ПредопределеннаяТЧ);
			
		ИначеЕсли СтрокаДерева.ТипЭлемента.СодержитТип(Тип("ПолеФормы")) Тогда
			
			Если ПараметрыПроверкиРеквизитов.ПовторноеЧтениеОбъекта И СтрокаДерева.НеПовторять Тогда
				Продолжить;
			КонецЕсли;
		
			Если СтрокаДерева.ПереопределенныйРеквизит Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ПредопределеннаяТЧ Тогда
				СтрокаДерева.Путь = ИмяТабличнойЧасти;
			КонецЕсли;
			
			ПараметрыПроверкиРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
				СтрокаДерева.Имя,
				СтрокаДерева.ТипЗначения,
				СтрокаДерева.Путь,
				СтрокаДерева.Заголовок,
				Истина));
				
			// проверка уникальности имени для формулы в пределах табличной части
			Если ЗначениеЗаполнено(ИмяТабличнойЧасти) Тогда
				
				Если ПредопределеннаяТЧ Тогда
					ИмяРодительскойТЧ = СтрокаДерева.Путь;
				Иначе
					ИмяРодительскойТЧ = "";
					ТекРодитель = СтрокаДерева.Родитель;
					Пока ТекРодитель <> Неопределено Цикл
						
						Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТекРодитель.ТипЭлемента, Тип("ТаблицаФормы")) Тогда
							ИмяРодительскойТЧ = ТекРодитель.Имя;
							Прервать;
						КонецЕсли;
						ТекРодитель = ТекРодитель.Родитель;
						
					КонецЦикла;
				КонецЕсли;
					
				СуществующиеРеквизитыТЧ = ПараметрыПроверкиРеквизитов.СуществующиеРеквизитыФормы.Получить(ВРЕГ(ИмяРодительскойТЧ));
				Если СуществующиеРеквизитыТЧ <> Неопределено
					И СуществующиеРеквизитыТЧ.Найти(ВРЕГ(СтрокаДерева.ИмяДляФормулы)) <> Неопределено Тогда
					// конфликт - колонка существует
					ПараметрыПроверкиРеквизитов.КонфликтыИменРеквизитов.Добавить(
						СтрокаДерева.Путь + "." + СтрокаДерева.ИмяДляФормулы, СтрокаДерева.Имя);
				КонецЕсли;
					
			КонецЕсли;
			
		ИначеЕсли СтрокаДерева.ТипЭлемента.СодержитТип(Тип("ТаблицаФормы")) Тогда
			
			Если НЕ СтрокаДерева.ПредопределеннаяТЧ И НЕ СтрокаДерева.ПереопределенныйРеквизит
				И НЕ (ПараметрыПроверкиРеквизитов.ПовторноеЧтениеОбъекта И СтрокаДерева.НеПовторять) Тогда
				ПараметрыПроверкиРеквизитов.ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
					СтрокаДерева.Имя,
					Новый ОписаниеТипов("ТаблицаЗначений"),
					СтрокаДерева.Путь,
					СтрокаДерева.Заголовок,
					Истина));
			КонецЕсли;
			
			СтрокаДобавленногоРеквизита.ЗаголовокТаблицы = СтрокаДерева.Заголовок;
			СтрокаДобавленногоРеквизита.ИмяТаблицы = СтрокаДерева.Имя;
			
			ПроверитьДобавляемыеРеквизитыРекурсивно(СтрокаДерева, ПараметрыПроверкиРеквизитов, СтрокаДерева.Имя, СтрокаДерева.Заголовок, СтрокаДерева.ПредопределеннаяТЧ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЭлементыФормы(Форма, ДеревоЭлементов, ПолеДляЭлементов, ДополнительныеПараметры, ПрефиксЭлементов = "")

	Для Каждого ТекСтрокаДерева Из ДеревоЭлементов.Строки Цикл
		
		Если ДополнительныеПараметры.ПовторноеЧтениеОбъекта И ТекСтрокаДерева.НеПовторять Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаДерева.Валютный И НЕ ДополнительныеПараметры.ВалютныйУчет Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрокаДерева.ТипЭлемента.СодержитТип(Тип("ГруппаФормы")) Тогда
			
			Если ТекСтрокаДерева.ПереопределенныйРеквизит Тогда
				НоваяГруппа = Форма.Элементы.Найти(ТекСтрокаДерева.ИмяЭлемента);
			Иначе
				НоваяГруппа = ДобавитьГруппуФормы(Форма, ТекСтрокаДерева, ПолеДляЭлементов, ПрефиксЭлементов);
			КонецЕсли;
			
			ОбновитьЭлементыФормы(Форма, ТекСтрокаДерева, НоваяГруппа, ДополнительныеПараметры, ПрефиксЭлементов);
			
		ИначеЕсли ТекСтрокаДерева.ТипЭлемента.СодержитТип(Тип("КомандаФормы")) Тогда
			
			Если НЕ ТекСтрокаДерева.ПереопределенныйРеквизит Тогда
				ДобавитьКнопкуФормы(Форма, ТекСтрокаДерева, ПолеДляЭлементов);
			КонецЕсли;
			
		ИначеЕсли ТекСтрокаДерева.ТипЭлемента.СодержитТип(Тип("ТаблицаФормы")) Тогда
			
			Если ТекСтрокаДерева.ПредопределеннаяТЧ Или ТекСтрокаДерева.ПереопределенныйРеквизит Тогда
				НайденныеТаблицы = НайтиЭлементыФормыРеальнойТаблицы(Форма, ТекСтрокаДерева.Имя, 
					ТекСтрокаДерева.ПредопределеннаяТЧ);
				Если НайденныеТаблицы.Количество() = 1 Тогда
					СуществующаяТаблица = НайденныеТаблицы[0];
					ОбновитьЭлементыФормы(Форма, ТекСтрокаДерева, СуществующаяТаблица,
						ДополнительныеПараметры, ТекСтрокаДерева.Имя);
				ИначеЕсли НайденныеТаблицы.Количество() > 1 Тогда
					// На форме несколько таблиц, связанных с одной таблицей документа.
					// Колонки необходимо добавить во все связанные таблицы.
					// В каждую таблицу элементы добавляются с суффиксом, чтобы имена элементов были разными.
					ИсходныеИменаЭлементов = ПолучитьИсходныеИменаПодчиненныхСтрок(ТекСтрокаДерева);
					Для Каждого СуществующаяТаблица Из НайденныеТаблицы Цикл
						ДобавитьСуффиксКИменамПодчиненныхСтрокИерархически(ТекСтрокаДерева, ИсходныеИменаЭлементов,
							СуществующаяТаблица.Имя);
						ОбновитьЭлементыФормы(Форма, ТекСтрокаДерева, СуществующаяТаблица,
							ДополнительныеПараметры, ТекСтрокаДерева.Имя);
					КонецЦикла;
				КонецЕсли;
			Иначе
				НоваяТаблица = ДобавитьТаблицуФормы(Форма, ТекСтрокаДерева, ДополнительныеПараметры.ПолеДляДополнительныхТабЧастей);
				ОбновитьЭлементыФормы(Форма, ТекСтрокаДерева, НоваяТаблица, ДополнительныеПараметры, ТекСтрокаДерева.Имя);
			КонецЕсли;
			
		Иначе
			
			ДобавитьПолеФормы(Форма, ТекСтрокаДерева, ПолеДляЭлементов, ДополнительныеПараметры, ПрефиксЭлементов);
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьИсходныеИменаПодчиненныхСтрок(ТекСтрокаДерева)
	ИсходныеИмена = Новый Массив;
	ДобавитьИсходныеИменаПодчиненныхСтрокИерархически(ТекСтрокаДерева, ИсходныеИмена);
	Возврат ИсходныеИмена;
КонецФункции

// Иерархический обход дерева и сохранение колонки "ИмяЭлемента" в массив.
// При изменении порядка обхода необходимо также изменить порядок обхода в процедуре
// ДобавитьСуффиксКИменамПодчиненныхСтрокИерархически.
// 
// Параметры:
//  ТекСтрокаДерева - СтрокаДереваЗначений - Тек строка дерева
//  ИсходныеИмена - Массив из Строка - Исходные имена
Процедура ДобавитьИсходныеИменаПодчиненныхСтрокИерархически(ТекСтрокаДерева, ИсходныеИмена)
	Для Каждого Строка Из ТекСтрокаДерева.Строки Цикл
		ИсходныеИмена.Добавить(Строка.ИмяЭлемента);
		ДобавитьИсходныеИменаПодчиненныхСтрокИерархически(Строка, ИсходныеИмена);
	КонецЦикла;
КонецПроцедуры

// Иерархический обход дерева и добавление переданного суффикса к значению колонки "ИмяЭлемента".
// Порядок обхода дерева должен быть одинаковым с порядком в процедуре
// ДобавитьИсходныеИменаПодчиненныхСтрокИерархически.
// 
// Параметры:
//  ТекСтрокаДерева - СтрокаДереваЗначений - Тек строка дерева
//  ИсходныеИмена - Массив из Строка - Исходные имена
//  Суффикс - Строка - Суффикс
//  Индекс - Число - Индекс
Процедура ДобавитьСуффиксКИменамПодчиненныхСтрокИерархически(ТекСтрокаДерева, ИсходныеИмена, Суффикс, Индекс = 0)
	Для Каждого Строка Из ТекСтрокаДерева.Строки Цикл
		Строка.ИмяЭлемента = ИсходныеИмена[Индекс] + Суффикс;
		Индекс = Индекс + 1;
		ДобавитьСуффиксКИменамПодчиненныхСтрокИерархически(Строка, ИсходныеИмена, Суффикс, Индекс);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьГруппировкуЭлементов(УпакованныеНастройки, НоваяГруппа)
	Перем ТекстовоеЗначение;

	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		УпакованныеНастройки.Свойство("Группировка", ТекстовоеЗначение);
	КонецЕсли;
	
	Если ТекстовоеЗначение = "Вертикальная" Тогда
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Иначе
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьОтображениеГруппы(УпакованныеНастройки, НоваяГруппа)
	Перем ТекстовоеЗначение;

	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		УпакованныеНастройки.Свойство("Отображение", ТекстовоеЗначение);
	КонецЕсли;

	Если ТекстовоеЗначение = "Обычное выделение" Тогда
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
	ИначеЕсли ТекстовоеЗначение = "Сильное выделение" Тогда
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
	ИначеЕсли ТекстовоеЗначение = "Слабое выделение" Тогда
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	Иначе
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВидЭлементаГруппы(УпакованныеНастройки, НоваяГруппа)
	Перем ТекстовоеЗначение;

	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		УпакованныеНастройки.Свойство("ВидЭлемента", ТекстовоеЗначение);
	КонецЕсли;

	Если ТекстовоеЗначение = "Страница" Тогда
		НоваяГруппа.ВидЭлемента = ВидГруппыФормы.Страница;
	ИначеЕсли ТекстовоеЗначение = "Страницы" Тогда
		НоваяГруппа.ВидЭлемента = ВидГруппыФормы.Страницы;
	Иначе
		НоваяГруппа.ВидЭлемента = ВидГруппыФормы.ОбычнаяГруппа;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗначениеОтображениеПодсказки(ТекстОтображениеПодсказки, ЭлементГруппы)
	
	Если ТекстОтображениеПодсказки = "Всплывающая" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.Всплывающая;
	ИначеЕсли ТекстОтображениеПодсказки = "Кнопка" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	ИначеЕсли ТекстОтображениеПодсказки = "Нет" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	ИначеЕсли ТекстОтображениеПодсказки = "Отображать авто" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьАвто;
	ИначеЕсли ТекстОтображениеПодсказки = "Отображать сверху" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
	ИначеЕсли ТекстОтображениеПодсказки = "Отображать слева" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСлева;
	ИначеЕсли ТекстОтображениеПодсказки = "Отображать снизу" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	ИначеЕсли ТекстОтображениеПодсказки = "Отображать справа" Тогда
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСправа;
	Иначе
		ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗначениеГоризонтальноеПоложение(ТекстГоризонтальноеПоложение, УстанавливаемоеПоле)
	
	Если ТекстГоризонтальноеПоложение = "Лево" Тогда
		УстанавливаемоеПоле = ГоризонтальноеПоложениеЭлемента.Лево;
	ИначеЕсли ТекстГоризонтальноеПоложение = "Право" Тогда
		УстанавливаемоеПоле = ГоризонтальноеПоложениеЭлемента.Право;
	ИначеЕсли ТекстГоризонтальноеПоложение = "Центр" Тогда
		УстанавливаемоеПоле = ГоризонтальноеПоложениеЭлемента.Центр;
	Иначе
		УстанавливаемоеПоле = ГоризонтальноеПоложениеЭлемента.Авто;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗначениеВертикальноеПоложение(ТекстВертикальноеПоложение, УстанавливаемоеПоле)
	
	Если ТекстВертикальноеПоложение = "Верх" Тогда
		УстанавливаемоеПоле = ВертикальноеПоложениеЭлемента.Верх;
	ИначеЕсли ТекстВертикальноеПоложение = "Низ" Тогда
		УстанавливаемоеПоле = ВертикальноеПоложениеЭлемента.Низ;
	ИначеЕсли ТекстВертикальноеПоложение = "Центр" Тогда
		УстанавливаемоеПоле = ВертикальноеПоложениеЭлемента.Центр;
	Иначе
		УстанавливаемоеПоле = ВертикальноеПоложениеЭлемента.Авто;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьВыравниваниеЭлементовИЗаголовков(УпакованныеНастройки, НоваяГруппа)
	Перем ТекстовоеЗначение;

	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		УпакованныеНастройки.Свойство("ВыравниваниеЭлементовИЗаголовков", ТекстовоеЗначение);
	КонецЕсли;
	
	Если ТекстовоеЗначение = "Нет" Тогда
		НоваяГруппа.ВыравниваниеЭлементовИЗаголовков = ВариантВыравниванияЭлементовИЗаголовков.Нет;
	ИначеЕсли ТекстовоеЗначение = "Элементы лево, заголовки лево" Тогда
		НоваяГруппа.ВыравниваниеЭлементовИЗаголовков = ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиЛево;
	ИначеЕсли ТекстовоеЗначение = "Элементы лево, заголовки право" Тогда
		НоваяГруппа.ВыравниваниеЭлементовИЗаголовков = ВариантВыравниванияЭлементовИЗаголовков.ЭлементыЛевоЗаголовкиПраво;
	ИначеЕсли ТекстовоеЗначение = "Элементы право, заголовки лево" Тогда
		НоваяГруппа.ВыравниваниеЭлементовИЗаголовков = ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиЛево;
	ИначеЕсли ТекстовоеЗначение = "Элементы право, заголовки право" Тогда
		НоваяГруппа.ВыравниваниеЭлементовИЗаголовков = ВариантВыравниванияЭлементовИЗаголовков.ЭлементыПравоЗаголовкиПраво;
	Иначе
		НоваяГруппа.ВыравниваниеЭлементовИЗаголовков = ВариантВыравниванияЭлементовИЗаголовков.Авто;
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьСквозноеВыравнивание(УпакованныеНастройки, НоваяГруппа)
	Перем ТекстовоеЗначение;

	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		УпакованныеНастройки.Свойство("СквозноеВыравнивание", ТекстовоеЗначение);
	КонецЕсли;
	
	Если ТекстовоеЗначение = "Использовать" Тогда
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
	ИначеЕсли ТекстовоеЗначение = "Не использовать" Тогда
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.НеИспользовать;
	Иначе
		НоваяГруппа.СквозноеВыравнивание = СквозноеВыравнивание.Авто;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидПоляФормыПоСохраненномуЗначению(СохраненноеЗначение)
	Если СохраненноеЗначение = 1 Тогда
		Возврат ВидПоляФормы.ПолеФлажка;
	Иначе
		Возврат ВидПоляФормы.ПолеВвода;
	КонецЕсли;
КонецФункции

Функция ПоложениеЗаголовкаЭлементаПоСохраненномуЗначению(СохраненноеЗначение)
	Если СохраненноеЗначение = 1 Тогда
		Возврат ПоложениеЗаголовкаЭлементаФормы.Нет;
	ИначеЕсли СохраненноеЗначение = 2 Тогда
		Возврат ПоложениеЗаголовкаЭлементаФормы.Лево;
	ИначеЕсли СохраненноеЗначение = 3 Тогда
		Возврат ПоложениеЗаголовкаЭлементаФормы.Верх;
	ИначеЕсли СохраненноеЗначение = 4 Тогда
		Возврат ПоложениеЗаголовкаЭлементаФормы.Право;
	ИначеЕсли СохраненноеЗначение = 5 Тогда
		Возврат ПоложениеЗаголовкаЭлементаФормы.Низ;
	Иначе
		Возврат ПоложениеЗаголовкаЭлементаФормы.Авто;
	КонецЕсли;
КонецФункции

Функция ДеревоЭлементовТиповойОперации(ТиповаяОперация, ИдентификаторДокумента, ИспользоватьКэширование = Ложь)
	Если ИспользоватьКэширование Тогда
		ДанныеДерева = БухгалтерскиеОперацииПовтИспНаВремяСеанса.ДеревоЭлементовФормыТиповойОперации(
			ТиповаяОперация, ИдентификаторДокумента);
	Иначе
		ДанныеДерева = ДеревоЭлементовФормыТиповойОперации(ТиповаяОперация, ИдентификаторДокумента);
	КонецЕсли;
	
	Возврат ДанныеДерева;
КонецФункции

Процедура ДобавитьЭлементыФормыТиповойОперации(ДеревоЭлементов, ИдентификаторДокумента, ВидимостьКнопки = Ложь, ВозможноИсправлениеОшибок = Ложь)

	ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяГруппыДляВыводаТиповойОперацииНаФорму();
	ПрефиксЭлементовОперации = БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации();
	
	Группа = ДобавитьОписаниеЭлементаВДерево(ДеревоЭлементов, ИмяРеквизита,
		ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ГруппаФормы"));
	
	Группа.Заголовок                = НСтр("ru = 'Типовая операция документа'");
	Группа.НеПовторять              = Истина;
	Группа.СквозноеВыравнивание     = СквозноеВыравнивание.НеИспользовать;
	
	ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыТиповаяОперация();
	Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
		ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ПолеФормы"));
	Элемент.Заголовок                = НСтр("ru = 'Типовая операция'");
	Элемент.ЦветФона                 = Метаданные.ЭлементыСтиля.ФонУправляющегоПоля.Значение;
	Элемент.ТипЗначения              = Новый ОписаниеТипов("СправочникСсылка.ТиповыеОперации");
	Элемент.Реквизит                 = "ТиповаяОперация";
	Элемент.НачалоВыбора             = "Подключаемый_ПриНачалеВыбораТиповойОперации";
	Элемент.ПриИзменении             = "Подключаемый_ПриИзмененииТиповойОперации";
	Элемент.НеПовторять              = Истина;
	Элемент.АвтомаксимальнаяШирина   = Ложь;
	Элемент.МаксимальнаяШирина       = 80;
	Если ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Элемент.ПараметрыВыбора.Добавить(
			Новый ПараметрВыбора("Отбор.ИдентификаторДокумента", ИдентификаторДокумента));
	КонецЕсли;
	
	Если ВидимостьКнопки Тогда
		ИмяРеквизита = "ОткрытьОперацию";
		Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
			ПрефиксЭлементовОперации + ИмяРеквизита, Тип("КомандаФормы"));
			
		Элемент.Заголовок   = НСтр("ru = 'Предварительный просмотр'");
		Элемент.Действие    = "Подключаемый_КомандаОткрытьОперацию";
		Элемент.Подсказка   = НСтр("ru = 'Предварительный просмотр проводок до проведения документа'");
		Элемент.Реквизит    = "ОткрытьОперацию";
		Элемент.ИмяКартинки = "ДебетКредит";
		Элемент.НеПовторять = Истина;
	КонецЕсли;
	
	Если ВозможноИсправлениеОшибок Тогда
	
		ИмяРеквизита = "ГруппаИсправлениеОшибокПрошлыхЛет";
		Группа = ДобавитьОписаниеЭлементаВДерево(ДеревоЭлементов, ИмяРеквизита,
			ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ГруппаФормы"));
		Группа.Заголовок           = НСтр("ru = 'Исправление ошибок прошлых лет'");
		Группа.НеПовторять = Истина;
		Группа.РасширеннаяПодсказка = ОбщегоНазначенияБГУ.ПодсказкаГруппыИсправлениеОшибок();
		Группа.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		
		ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФлажокИсправлениеОшибокПрошлыхЛет();
		Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
			ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ПолеФормы"));
		Элемент.ИмяДляФормулы            = ИмяРеквизита;
		Элемент.ВидЭлемента              = ВидПоляФормы.ПолеФлажка;
		Элемент.Заголовок = НСтр("ru = 'Исправление ошибок прошлых лет'");
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
		Элемент.ТипЗначения              = Новый ОписаниеТипов("Булево");
		Элемент.НеПовторять = Истина;
		Элемент.ПриИзменении        = "Подключаемый_ПриИзмененииДопРеквизита";
		
		ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательИсправлениеОшибокПрошлыхЛет();
		Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
			ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ПолеФормы"));
		Элемент.ИмяДляФормулы              = ИмяРеквизита;
		Элемент.ВидЭлемента                = ВидПоляФормы.ПолеВвода;
		Элемент.РастягиватьПоГоризонтали   = Ложь;
		Элемент.Заголовок = НСтр("ru = 'Порядок исправления'");
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ТипЗначения              = Новый ОписаниеТипов("ПеречислениеСсылка.ПорядокИсправленияОшибокПрошлыхЛет");
		Элемент.СписокВыбора.Добавить(Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаПрошлогоГода, НСтр("ru = 'прошлого года'"));
		Элемент.СписокВыбора.Добавить(Перечисления.ПорядокИсправленияОшибокПрошлыхЛет.ОшибкаРанееПрошлогоГода, НСтр("ru = 'ранее прошлого года'"));
		Элемент.НеПовторять = Истина;
		Элемент.ПриИзменении        = "Подключаемый_ПриИзмененииДопРеквизита";
		
		ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательВыявительОшибкиПрошлыхЛет();
		Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
			ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ПолеФормы"));
		Элемент.ИмяДляФормулы              = ИмяРеквизита;
		Элемент.ВидЭлемента                = ВидПоляФормы.ПолеВвода;
		Элемент.РастягиватьПоГоризонтали   = Ложь;
		Элемент.Заголовок = НСтр("ru = 'выявлено'");
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элемент.ТипЗначения              = Новый ОписаниеТипов("ПеречислениеСсылка.ВыявительОшибокПрошлыхЛет");
		Элемент.СписокВыбора.Добавить(Перечисления.ВыявительОшибокПрошлыхЛет.Самостоятельно, НСтр("ru = 'самостоятельно'"));
		Элемент.СписокВыбора.Добавить(Перечисления.ВыявительОшибокПрошлыхЛет.ОрганКонтроля, НСтр("ru = 'органом контроля'"));
		Элемент.НеПовторять = Истина;
		Элемент.ПриИзменении        = "Подключаемый_ПриИзмененииДопРеквизита";
		
		ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаПереключательПричинаОшибкиПрошлыхЛет();
		Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
			ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ПолеФормы"));
		Элемент.ИмяДляФормулы              = ИмяРеквизита;
		Элемент.ВидЭлемента                = ВидПоляФормы.ПолеВвода;
		Элемент.РастягиватьПоГоризонтали   = Ложь;
		Элемент.Заголовок = НСтр("ru = 'причина'");
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		Элемент.ТипЗначения              = Новый ОписаниеТипов("СправочникСсылка.ПричиныОшибокПрошлыхЛет");
		Элемент.НеПовторять = Истина;
		Элемент.ПриИзменении        = "Подключаемый_ПриИзмененииДопРеквизита";
		Элемент.ПроверкаВвода = ПроверкаЗаполнения.ВыдаватьОшибку;
	
	КонецЕсли;
	
	ИмяРеквизита = "КурсКратность";
	Группа = ДобавитьОписаниеЭлементаВДерево(ДеревоЭлементов, ИмяРеквизита,
		ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ГруппаФормы"));
	Группа.Заголовок           = НСтр("ru = 'Курс и кратность валюты'");
	Группа.Валютный            = Истина;
	Группа.НеПовторять         = Истина;
	
	ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыКурс();
	Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
		ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ПолеФормы"));
	Элемент.Заголовок                = НСтр("ru = 'Курс'");
	Элемент.РастягиватьПоГоризонтали = Ложь;
	Элемент.ТипЗначения              = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,4));
	Элемент.Реквизит                 = "Курс";
	Элемент.Валютный                 = Истина;
	Элемент.НеПовторять              = Истина;
	
	ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыКратность();
	Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
		ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ПолеФормы"));
	Элемент.Заголовок                = НСтр("ru = 'Кратность'");
	Элемент.РастягиватьПоГоризонтали = Ложь;
	Элемент.ТипЗначения              = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10,0));
	Элемент.Реквизит                 = "Кратность";
	Элемент.Валютный                 = Истина;
	Элемент.НеПовторять              = Истина;
	
	ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяКомандыФормыОбновитьКурсВалюты();
	Элемент = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
		ПрефиксЭлементовОперации + ИмяРеквизита, Тип("КомандаФормы"));
		
	Элемент.Заголовок   = НСтр("ru = 'Обновить курс'");
	Элемент.Действие    = "Подключаемый_ОбновитьКурсВалюты";
	Элемент.Подсказка   = НСтр("ru = 'Обновить курс валюты'");
	Элемент.Реквизит    = ИмяРеквизита;
	Элемент.Валютный    = Истина;
	Элемент.НеПовторять = Истина;

КонецПроцедуры

// Добавить описание элемента в дерево.
// 
// Параметры:
//  ТекущаяСтрока - ДеревоЗначений, СтрокаДереваЗначений, Неопределено - Текущая строка
//  ИмяРеквизита - Строка - Имя реквизита
//  ИмяЭлемента - Строка - Имя элемента
//  ТипЭлемента - Тип - Тип элемента
// 
// Возвращаемое значение:
//  СтрокаДереваЗначений: см. ПустоеДеревоЭлементовФормы
Функция ДобавитьОписаниеЭлементаВДерево(ТекущаяСтрока, ИмяРеквизита, ИмяЭлемента, ТипЭлемента)

	НовыйЭлемент = ТекущаяСтрока.Строки.Добавить();
	НовыйЭлемент.Имя                      = ИмяРеквизита;
	НовыйЭлемент.ИмяЭлемента              = ИмяЭлемента;
	
	// значения по умолчанию
	НовыйЭлемент.Видимость = Истина;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	Если ТипЭлемента = Тип("ГруппаФормы") Тогда
		НовыйЭлемент.ТипЭлемента              = Новый ОписаниеТипов("ГруппаФормы");
		НовыйЭлемент.ВидЭлемента              = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлемент.ОтображатьЗаголовок      = Ложь;
		НовыйЭлемент.Группировка              = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		НовыйЭлемент.Отображение              = ОтображениеОбычнойГруппы.Нет;
		НовыйЭлемент.Объединенная             = Истина;
		НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		НовыйЭлемент.РастягиватьПоВертикали   = Неопределено;
	ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда
		НовыйЭлемент.ТипЭлемента              = Новый ОписаниеТипов("ПолеФормы");
		НовыйЭлемент.ВидЭлемента              = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПоложениеЗаголовка       = ПоложениеЗаголовкаЭлементаФормы.Авто;
		НовыйЭлемент.АвтоМаксимальнаяШирина   = Истина;
		НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		НовыйЭлемент.ЦветФона                 = Новый Цвет;
		НовыйЭлемент.ПроверкаВвода            = ПроверкаЗаполнения.НеПроверять;
		НовыйЭлемент.СписокВыбора             = Новый СписокЗначений;
	ИначеЕсли ТипЭлемента = Тип("КомандаФормы") Тогда
		НовыйЭлемент.ТипЭлемента              = Новый ОписаниеТипов("КомандаФормы");
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	Иначе
		НовыйЭлемент.ТипЭлемента              = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЭлемента));
		НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	КонецЕсли;
	
	Возврат НовыйЭлемент;

КонецФункции

Процедура ДобавитьИзДереваВДерево(ДеревоИсточник, ДеревоПриемник, ПереопределенныеРеквизиты)
	
	Для каждого СтрокаИсточник Из ДеревоИсточник.Строки Цикл
	
		СтрокаПриемник = ДеревоПриемник.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник);
		Если СтрокаИсточник.Реквизит = "ТиповаяОперация"
			ИЛИ СтрокаИсточник.Реквизит = "Курс"
			ИЛИ СтрокаИсточник.Реквизит = "Кратность" Тогда
			
			СтрокаПоиска = ВРЕГ(СтрокаПриемник.Реквизит);
		ИначеЕсли ЗначениеЗаполнено(СтрокаПриемник.ИмяТаблицы) Тогда
			СтрокаПоиска = СтрШаблон("%1.%2", ВРЕГ(СтрокаПриемник.ИмяТаблицы), ВРЕГ(СтрокаПриемник.ИмяДляФормулы));
		Иначе
			СтрокаПоиска = ВРЕГ(СтрокаПриемник.ИмяДляФормулы);
		КонецЕсли;
		ПереопределенныйРеквизит = ПереопределенныеРеквизиты.Найти(СтрокаПоиска, "ИмяДляФормулы");
		Если ПереопределенныйРеквизит <> Неопределено Тогда
			СтрокаПриемник.ПереопределенныйРеквизит = Истина;
			СтрокаПриемник.ИмяЭлемента = ПереопределенныйРеквизит.ИмяЭлемента;
			СтрокаПриемник.Имя = ПереопределенныйРеквизит.ИмяРеквизита;
		КонецЕсли;
		ДобавитьИзДереваВДерево(СтрокаИсточник, СтрокаПриемник, ПереопределенныеРеквизиты);
	
	КонецЦикла;

КонецПроцедуры

Функция ДеревоЭлементовДополнительныхТабличныхЧастей(ИдентификаторДокумента)
	
	Результат = ДеревоЭлементовФормыДополнительныхТабличныхЧастей(ИдентификаторДокумента);
	
	Возврат Результат;
КонецФункции

Функция ДеревоЭлементовФормыДополнительныхТабличныхЧастей(ИдентификаторДокумента) Экспорт

	Результат = ПустоеДеревоЭлементовФормы();
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.Наименование КАК ЗаголовокТЧ,
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.ИмяТабличнойЧасти КАК ИмяТЧ,
	|	КолонкиДополнительныхТабличныхЧастей.ЭтоГруппа,
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.ПредопределеннаяТабличнаяЧасть КАК ПредопределеннаяТЧ,
	|	КолонкиДополнительныхТабличныхЧастей.Наименование КАК ЗаголовокРеквизита,
	|	КолонкиДополнительныхТабличныхЧастей.ИмяКолонки КАК ИмяРеквизита,
	|	КолонкиДополнительныхТабличныхЧастей.ОписаниеТипаКолонки.ТипЗначения КАК ТипЗначенияРеквизита,
	|	КолонкиДополнительныхТабличныхЧастей.СвязиПараметровВыбора,
	|	КолонкиДополнительныхТабличныхЧастей.ПараметрыВыбора,
	|	КолонкиДополнительныхТабличныхЧастей.СвязьПоТипу,
	|	КолонкиДополнительныхТабличныхЧастей.Обязательный КАК ОбязательныйРеквизит,
	|	КолонкиДополнительныхТабличныхЧастей.Родитель КАК Родитель,
	|	КолонкиДополнительныхТабличныхЧастей.Ссылка КАК Ссылка,
	|	КолонкиДополнительныхТабличныхЧастей.ОтборЭлементов,
	|	КолонкиДополнительныхТабличныхЧастей.ГруппировкаЭлементов,
	|	КолонкиДополнительныхТабличныхЧастей.ВидЭлемента
	|ИЗ
	|	Справочник.КолонкиДополнительныхТабличныхЧастей КАК КолонкиДополнительныхТабличныхЧастей
	|ГДЕ
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.ИдентификаторДокумента = &ИдентификаторДокумента
	|	И НЕ КолонкиДополнительныхТабличныхЧастей.ПометкаУдаления
	|	И НЕ КолонкиДополнительныхТабличныхЧастей.Владелец.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	КолонкиДополнительныхТабличныхЧастей.Владелец.Код,
	|	КолонкиДополнительныхТабличныхЧастей.Код
	|ИТОГИ ПО
	|	КолонкиДополнительныхТабличныхЧастей.Владелец,
	|	Ссылка ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Для каждого ВыборкаТЧ Из Дерево.Строки Цикл
		
		ТабличнаяЧасть = ДобавитьОписаниеЭлементаВДерево(Результат, ВыборкаТЧ.ИмяТЧ,
			БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовДополнительныхТабличныхЧастей() + ВыборкаТЧ.ИмяТЧ,
			Тип("ТаблицаФормы"));
		
		ТабличнаяЧасть.Заголовок 				= ВыборкаТЧ.ЗаголовокТЧ;
		ТабличнаяЧасть.ИмяДляФормулы			= ВыборкаТЧ.ИмяТЧ;
		ТабличнаяЧасть.РастягиватьПоГоризонтали	= Истина;
		ТабличнаяЧасть.НеПовторять 				= Истина;
		ТабличнаяЧасть.ПредопределеннаяТЧ		= ВыборкаТЧ.ПредопределеннаяТЧ;
		
		ДобавитьРекурсивноЭлементыДополнительнойТабличнойЧасти(ВыборкаТЧ, ТабличнаяЧасть, Неопределено);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьРекурсивноЭлементыДополнительнойТабличнойЧасти(ВыборкаЭлементы, Дерево, ТекущаяСсылка)

	Для каждого ВыборкаЭлементы Из ВыборкаЭлементы.Строки Цикл
		
		Если ВыборкаЭлементы.Ссылка = ТекущаяСсылка Тогда
			Продолжить;
		КонецЕсли;
		
		ДобавленныйЭлемент = ДобавитьЭлементДополнительнойТабличнойЧасти(ВыборкаЭлементы, Дерево);
	
		Если ВыборкаЭлементы.ЭтоГруппа Тогда
			ДобавитьРекурсивноЭлементыДополнительнойТабличнойЧасти(ВыборкаЭлементы, ДобавленныйЭлемент, ВыборкаЭлементы.Ссылка);
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

Функция ДобавитьЭлементДополнительнойТабличнойЧасти(ВыборкаЭлементы, Дерево)
	
	ИмяРеквизита = СтрШаблон(БухгалтерскиеОперацииКлиентСервер.ШаблонИмениРеквизитаФормы(),
		СтрЗаменить(Строка(ВыборкаЭлементы.Ссылка.УникальныйИдентификатор()), "-", "_"), ВыборкаЭлементы.ИмяРеквизита);
	ИмяЭлемента = БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации() + ИмяРеквизита;
	
	Если ВыборкаЭлементы.ЭтоГруппа Тогда
		
		НовыйЭлемент = ДобавитьОписаниеЭлементаВДерево(Дерево, ИмяРеквизита,
			ИмяЭлемента, Тип("ГруппаФормы"));
		НовыйЭлемент.ИмяТаблицы						= ВыборкаЭлементы.ИмяТЧ;
		НовыйЭлемент.ИмяДляФормулы					= ВыборкаЭлементы.ИмяРеквизита;
		НовыйЭлемент.Заголовок						= ВыборкаЭлементы.ЗаголовокРеквизита;
		НовыйЭлемент.РастягиватьПоГоризонтали		= Истина;
		НовыйЭлемент.ВидЭлемента					= ВидГруппыФормы.ГруппаКолонок;
		НовыйЭлемент.Группировка					= ГруппировкаКолонокТаблицыПоСтроке(ВыборкаЭлементы.ГруппировкаЭлементов);
		НовыйЭлемент.Отображение					= ОтображениеОбычнойГруппы.Нет;
		НовыйЭлемент.НеПовторять					= Истина;
		НовыйЭлемент.ПредопределеннаяТЧ				= ВыборкаЭлементы.ПредопределеннаяТЧ;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(ВыборкаЭлементы.ТипЗначенияРеквизита) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		НовыйЭлемент = ДобавитьОписаниеЭлементаВДерево(Дерево, ИмяРеквизита,
			ИмяЭлемента, Тип("ПолеФормы"));
		НовыйЭлемент.ИмяТаблицы					= ВыборкаЭлементы.ИмяТЧ;
		НовыйЭлемент.ИмяДляФормулы				= ВыборкаЭлементы.ИмяРеквизита;
		НовыйЭлемент.Заголовок 					= ВыборкаЭлементы.ЗаголовокРеквизита;
		НовыйЭлемент.РастягиватьПоГоризонтали	= Истина;
		НовыйЭлемент.ВидЭлемента 				= ВидПоляФормыПоСтроке(ВыборкаЭлементы.ВидЭлемента);
		НовыйЭлемент.Видимость					= Истина;
		НовыйЭлемент.ПредопределеннаяТЧ			= ВыборкаЭлементы.ПредопределеннаяТЧ;
		НовыйЭлемент.Валютный 					= Ложь;
		НовыйЭлемент.НеПовторять 				= Истина;
		НовыйЭлемент.ТипЗначения				= ВыборкаЭлементы.ТипЗначенияРеквизита;
		НовыйЭлемент.СвязиПоТипу				= ВыборкаЭлементы.СвязьПоТипу;
		Если НЕ ПустаяСтрока(ВыборкаЭлементы.СвязиПараметровВыбора) Тогда
			МассивСвязей = ЗначениеИзСтрокиВнутр(ВыборкаЭлементы.СвязиПараметровВыбора);
			СвязиПараметровВыбора = Новый Массив;
			Для каждого ТекСвязь Из МассивСвязей Цикл
			
				СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора(	ТекСвязь.Имя,
																			ТекСвязь.Реквизит,
																			?(ТекСвязь.Режим = "НеИзменять",
																				РежимИзмененияСвязанногоЗначения.НеИзменять,
																				РежимИзмененияСвязанногоЗначения.Очищать)));
																			
			
			КонецЦикла; 
			
			НовыйЭлемент.СвязиПараметровВыбора	= СвязиПараметровВыбора;
		КонецЕсли;
		НовыйЭлемент.Путь 						= ?(ВыборкаЭлементы.ПредопределеннаяТЧ, "Объект.", "") + ВыборкаЭлементы.ИмяТЧ;
		Если ВыборкаЭлементы.ОбязательныйРеквизит Тогда
			НовыйЭлемент.ПроверкаВвода				= ПроверкаЗаполнения.ВыдаватьОшибку;
		КонецЕсли;
		НовыйЭлемент.ПриИзменении				= "Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти";
		Если Не ПустаяСтрока(ВыборкаЭлементы.СвязьПоТипу) Тогда
			Скобка = Найти(ВыборкаЭлементы.СвязьПоТипу, "(");
			Если Скобка > 0 Тогда
				// удалим из структуры связи по типу "Объект." для облегчения последующего поиска связанных элементов
				ВедущийЭлементИмя = Лев(ВыборкаЭлементы.СвязьПоТипу, Скобка-1);
				Если Лев(ВедущийЭлементИмя, 7) = "Объект." Тогда
					ВедущийЭлементИмя = Сред(ВедущийЭлементИмя, 8);
				КонецЕсли;
				ВедущийЭлементНомер = Сред(ВыборкаЭлементы.СвязьПоТипу, Скобка+1, 1);
				Если Число(ВедущийЭлементНомер) <> 0 Тогда
					СтруктураЗависимости = Новый Структура;
					СтруктураЗависимости.Вставить("ВедущийЭлемент", ВедущийЭлементИмя);
					СтруктураЗависимости.Вставить("ПорядокЭлемента", ВедущийЭлементНомер);
					СтруктураЗависимости.Вставить("ЗависимыйЭлемент", СтрШаблон("%1.%2", ВыборкаЭлементы.ИмяТЧ, ВыборкаЭлементы.ИмяРеквизита));
					СтруктураЗависимости.Вставить("ЗависимостьПоДоступности", Истина);
					СтруктураЗависимости.Вставить("ЗависимостьПоЗаголовку", Истина);
					НовыйЭлемент.СтруктураСвязиПоТипу	= СтруктураЗависимости;
				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ВыборкаЭлементы.ОтборЭлементов) Тогда
			ПараметрыВыбора = Новый Массив;
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ПредустановленныйОтбор", ВыборкаЭлементы.ОтборЭлементов));
			// для перечислений добавим текст запроса для СКД обрабатываемой при получении списка выбора.
			Если Перечисления.ТипВсеСсылки().СодержитТип(ВыборкаЭлементы.ТипЗначенияРеквизита.Типы()[0]) Тогда
				ТекстЗапросаОтбора = "Выбрать * Из Перечисление."+Метаданные.НайтиПоТипу(ВыборкаЭлементы.ТипЗначенияРеквизита.Типы()[0]).Имя+" Как Переч";
				ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ТекстЗапросаОтбора", ТекстЗапросаОтбора));
			КонецЕсли;				
			НовыйЭлемент.ПараметрыВыбора			= ПараметрыВыбора;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НовыйЭлемент;
	
КонецФункции

Процедура ДобавитьОбязательныеРеквизиты(ДобавляемыеРеквизиты) Экспорт
	
	// Обязательный реквизит формы для общих параметров, изменения которых контролируются в документах.
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"КэшПараметров", Новый ОписаниеТипов("Неопределено")));
	
	// Обязательные реквизиты механизма бухгалтерских операций.
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"БухгалтерскиеОперации_ПризнакФормированияПроводокАвтоматически", Новый ОписаниеТипов("Булево")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"БухгалтерскиеОперации_СписокЗависимыхЭлементов", Новый ОписаниеТипов("СписокЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"СписокЭлементовСКонфликтамиИмен", Новый ОписаниеТипов("СписокЗначений")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"БухгалтерскиеОперации_ИмяГруппыЭлементовТиповойОперации", Новый ОписаниеТипов("Строка")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"БухгалтерскиеОперации_ИмяГруппыДопТабличныхЧастей", Новый ОписаниеТипов("Строка")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"БухгалтерскиеОперации_УИДЗамераПроизводительности", Новый ОписаниеТипов("УникальныйИдентификатор")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"БухгалтерскиеОперации_ИзмениласьТиповаяОперация", Новый ОписаниеТипов("Строка")));
		
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(
		"БухгалтерскиеОперации_ДобавленныеРеквизитыОперации", Новый ОписаниеТипов("ТаблицаЗначений")));
	ТаблицаДобавленныхРеквизитов = ПустаяТаблицаДобавленныхРеквизитовОперации();
	Для каждого ОписаниеКолонки Из ТаблицаДобавленныхРеквизитов.Колонки Цикл
	
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(ОписаниеКолонки.Имя, ОписаниеКолонки.ТипЗначения,
			"БухгалтерскиеОперации_ДобавленныеРеквизитыОперации"));
	
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДобавленныеЭлементыФормыПриПовторномЧтении(Форма, ДобавленныеРеквизиты, ПолеДляРеквизитовОперации)

	Для каждого ОписаниеЭлемента Из Форма.БухгалтерскиеОперации_ДобавленныеРеквизитыОперации Цикл
	
		Если ОписаниеЭлемента.НеПовторять ИЛИ ОписаниеЭлемента.ПереопределенныйРеквизит Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы = Форма.Элементы.Найти(ОписаниеЭлемента.ИмяЭлемента);
		
		Если ЭлементФормы <> Неопределено Тогда
			Форма.Элементы.Удалить(ЭлементФормы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокСвязанныхРеквизитов(ТиповаяОперация, ИмяДокумента, ДобавленныеРеквизитыОперации)
	
	Результат = Новый СписокЗначений;
	
	Если НЕ ЗначениеЗаполнено(ТиповаяОперация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставляемыеРеквизитыТиповыхОпераций.СвязиПоТипу КАК СвязиПоТипу,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки КАК РеквизитПроводки,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК ТипЗначения,
	|	ПоставляемыеРеквизитыТиповыхОпераций.УпакованныеНастройки КАК УпакованныеНастройки
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации = ПоставляемыеРеквизитыТиповыхОпераций.Ссылка
	|ГДЕ
	|	РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ
	|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И ПоставляемыеРеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ
	|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|	И ПоставляемыеРеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|	И РеквизитыТиповыхОпераций.СостояниеПоддержки = &СостояниеПоддержки
	|	И РеквизитыТиповыхОпераций.Владелец.ПоставляемаяТиповаяОперация = ПоставляемыеРеквизитыТиповыхОпераций.Владелец
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.СвязиПоТипу, """"),
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения,
	|	ДанныеРеквизитовТиповыхОпераций.УпакованныеНастройки
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.Ссылка = ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации
	|ГДЕ
	|	РеквизитыТиповыхОпераций.ЭтоГруппа = ЛОЖЬ
	|	И РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И РеквизитыТиповыхОпераций.ПометкаУдаления = ЛОЖЬ
	|	И РеквизитыТиповыхОпераций.СостояниеПоддержки <> &СостояниеПоддержки";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Запрос.УстановитьПараметр("СостояниеПоддержки", Перечисления.СостоянияПоддержкиТиповыхОпераций.НеРедактируется);
	ДополнительныеРеквизиты = Запрос.Выполнить().Выгрузить();
	
	Для каждого ТекДопРеквизит Из ДополнительныеРеквизиты Цикл
		
		СвязиПоТипуСохр = "";
		Если ТипЗнч(ТекДопРеквизит.УпакованныеНастройки) = Тип("ХранилищеЗначения") Тогда
			УпакованныеНастройки = ТекДопРеквизит.УпакованныеНастройки.Получить();
			Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
				УпакованныеНастройки.Свойство("СвязиПоТипу", СвязиПоТипуСохр);
			КонецЕсли;
		Иначе
			СвязиПоТипуСохр = ТекДопРеквизит.СвязиПоТипу;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СвязиПоТипуСохр) Тогда
			
			Скобка = Найти(СвязиПоТипуСохр, "(");
			Если Скобка = 0 Тогда
				Продолжить;
			КонецЕсли;
			ВедущийЭлементИмя = Лев(СвязиПоТипуСохр, Скобка-1);
			ВедущийЭлементНомер = Сред(СвязиПоТипуСохр, Скобка+1, 1);
			СтрокаДопРеквизита = ДополнительныеРеквизиты.Найти(ВедущийЭлементИмя, "ИмяДляФормулы");
			СтруктураЗависимости = Неопределено;
			ОписаниеРеквизита = ДобавленныеРеквизитыОперации.Найти(ВРЕГ(ВедущийЭлементИмя), "ИмяДляФормулы");
			Если ОписаниеРеквизита <> Неопределено Тогда
				ВедущийЭлементИмяЗамены = ОписаниеРеквизита.ИмяРеквизита;
			Иначе
				ВедущийЭлементИмяЗамены = ВедущийЭлементИмя;
			КонецЕсли;
			ОписаниеРеквизита = ДобавленныеРеквизитыОперации.Найти(ВРЕГ(ТекДопРеквизит.ИмяДляФормулы), "ИмяДляФормулы");
			Если ОписаниеРеквизита <> Неопределено Тогда
				ЗависимыйРеквизитИмяЗамены = ОписаниеРеквизита.ИмяРеквизита;
				ЗависимыйЭлементИмяЗамены = ОписаниеРеквизита.ИмяЭлемента;
			Иначе
				ЗависимыйРеквизитИмяЗамены = ТекДопРеквизит.ИмяДляФормулы;
				ЗависимыйЭлементИмяЗамены = "";
			КонецЕсли;
			
			Если СтрокаДопРеквизита <> Неопределено Тогда
				Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(СтрокаДопРеквизита.ТипЗначения, Тип("ПланСчетовСсылка.ЕПСБУ")) Тогда
					СтруктураЗависимости = Новый Структура("ВедущийРеквизит, ПорядокРеквизита, ЗависимыйРеквизит,"
						+ "ЗависимыйЭлемент, ЗависимостьПоДоступности, ЗависимостьПоЗаголовку");
					СтруктураЗависимости.ВедущийРеквизит = ВедущийЭлементИмяЗамены;
					СтруктураЗависимости.ПорядокРеквизита = ВедущийЭлементНомер;
					СтруктураЗависимости.ЗависимыйРеквизит = ЗависимыйРеквизитИмяЗамены;
					СтруктураЗависимости.ЗависимыйЭлемент = ЗависимыйЭлементИмяЗамены;
					СтруктураЗависимости.ЗависимостьПоДоступности = Истина;
					СтруктураЗависимости.ЗависимостьПоЗаголовку = Истина;
				КонецЕсли;
			ИначеЕсли Лев(ВРЕГ(ВедущийЭлементИмя), 7) = "ОБЪЕКТ." Тогда
				СтруктураЗависимости = Новый Структура("ВедущийРеквизит, ПорядокРеквизита, ЗависимыйРеквизит,"
					+ "ЗависимыйЭлемент, ЗависимостьПоДоступности, ЗависимостьПоЗаголовку");
				СтруктураЗависимости.ВедущийРеквизит = ВедущийЭлементИмяЗамены;
				СтруктураЗависимости.ПорядокРеквизита = ВедущийЭлементНомер;
				СтруктураЗависимости.ЗависимыйРеквизит = ЗависимыйРеквизитИмяЗамены;
				СтруктураЗависимости.ЗависимыйЭлемент = ЗависимыйЭлементИмяЗамены;
				СтруктураЗависимости.ЗависимостьПоДоступности = Истина;
				СтруктураЗависимости.ЗависимостьПоЗаголовку = Истина;
				
			КонецЕсли;
			Если Число(ВедущийЭлементНомер) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураЗависимости = Новый Структура("ВедущийРеквизит, ПорядокРеквизита, ЗависимыйРеквизит,"
				+ "ЗависимыйЭлемент, ЗависимостьПоДоступности, ЗависимостьПоЗаголовку");
			СтруктураЗависимости.ВедущийРеквизит = ВедущийЭлементИмяЗамены;
			СтруктураЗависимости.ПорядокРеквизита = ВедущийЭлементНомер;
			СтруктураЗависимости.ЗависимыйРеквизит = ЗависимыйРеквизитИмяЗамены;
			СтруктураЗависимости.ЗависимыйЭлемент = ЗависимыйЭлементИмяЗамены;
			СтруктураЗависимости.ЗависимостьПоДоступности = Истина;
			СтруктураЗависимости.ЗависимостьПоЗаголовку = Истина;
			Результат.Добавить(СтруктураЗависимости);
			
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

Процедура ДобавитьКомандыУправленияТиповымиОперациями(Форма)

	КоманднаяПанель = Форма.КоманднаяПанель;
	Элементы 		= Форма.Элементы;
	
	ГруппаКоманд = Элементы.Добавить("ТиповыеОперации_ГруппаУправлениеТиповымиОперациями", Тип("ГруппаФормы"), КоманднаяПанель);
	ГруппаКоманд.Заголовок = "Управление типовыми операциями";
	
	КомандаФормы = Форма.Команды.Добавить("ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьОперациюПоУмолчанию");
	КомандаФормы.Действие = "Подключаемый_УправлениеТиповымиОперациями";
	КомандаФормы.Подсказка = НСтр("ru = 'Выбранная типовая операция будет автоматически подставляться при вводе нового документа'");
	
	Команда = Элементы.Добавить("ТиповыеОперации_ГруппаУправлениеТиповымиОперациями_УстановитьПоУмолчанию", Тип("КнопкаФормы"), ГруппаКоманд);
	Команда.Заголовок = НСтр("ru = 'Использовать по умолчанию выбранную типовую операцию'");
	Команда.ТолькоВоВсехДействиях = Истина;
	Команда.ИмяКоманды = "ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьОперациюПоУмолчанию";
	
	КомандаФормы = Форма.Команды.Добавить("ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьРеквизитыПоУмолчанию");
	КомандаФормы.Действие = "Подключаемый_УправлениеТиповымиОперациями";
	КомандаФормы.Подсказка = НСтр("ru = 'Выбранные значения дополнительных реквизитов будут автоматически подставляться при выборе данной типовой операции'");
	
	Команда = Элементы.Добавить("ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьРеквизитыПоУмолчанию", Тип("КнопкаФормы"), ГруппаКоманд);
	Команда.Заголовок = НСтр("ru = 'Использовать по умолчанию выбранные реквизиты операции'");
	Команда.ТолькоВоВсехДействиях = Истина;
	Команда.ИмяКоманды = "ТиповыеОперации_УправлениеТиповымиОперациями_УстановитьРеквизитыПоУмолчанию";

КонецПроцедуры

Процедура ДополнитьДеревоЭлементовТиповойОперацииДополнительнымиРеквизитами(ДеревоРезультат, ТиповаяОперация)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка КАК Ссылка,
	|	РеквизитыТиповыхОпераций.ЭтоГруппа КАК ЭтоГруппа,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки КАК РеквизитПроводки,
	|	РеквизитыТиповыхОпераций.Наименование КАК Наименование,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы КАК ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения КАК РеквизитПроводкиТипЗначения,
	|	РеквизитыТиповыхОпераций.СостояниеПоддержки КАК СостояниеПоддержки,
	|	РеквизитыТиповыхОпераций.ОтборЭлементов КАК ОтборЭлементов,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.РеквизитПроводки.ШиринаПоляВвода, 0) КАК ШиринаПоляВвода,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.Обязательный, ЛОЖЬ) КАК Обязательный,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.СвязиПараметровВыбора, """") КАК СвязиПараметровВыбора,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.СвязиПоТипу, """") КАК СвязиПоТипу,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.ВидЭлемента, 0) КАК ВидЭлемента,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.ГруппировкаЭлементов, 0) КАК ГруппировкаЭлементов,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.Отображение, 0) КАК Отображение,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.ОтображатьЗаголовок, ЛОЖЬ) КАК ОтображатьЗаголовок,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.РастягиватьПоГоризонтали, ЛОЖЬ) КАК РастягиватьПоГоризонтали,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.ПоложениеЗаголовка, 0) КАК ПоложениеЗаголовка,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.ЗапретитьИзменение, ЛОЖЬ) КАК ЗапретитьИзменение,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.НевидимыйЭлемент, ЛОЖЬ) КАК НевидимыйЭлемент,
	|	РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.УпакованныеНастройки КАК УпакованныеНастройки,
	|	РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации.ФункциональныеОпции.(
	|		ИмяФункциональнойОпции КАК ИмяФункциональнойОпции
	|	) КАК ФункциональныеОпции,
	|	РеквизитыТиповыхОпераций.Код КАК Код
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
	|	И НЕ РеквизитыТиповыхОпераций.Ссылка В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					Т.Ссылка
	|				ИЗ
	|					Справочник.РеквизитыТиповыхОпераций КАК Т
	|				ГДЕ
	|					Т.ЭтоГруппа
	|					И Т.ПометкаУдаления)
	|	И РеквизитыТиповыхОпераций.СостояниеПоддержки = ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыТиповыхОпераций.Ссылка,
	|	РеквизитыТиповыхОпераций.ЭтоГруппа,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки,
	|	РеквизитыТиповыхОпераций.Наименование,
	|	РеквизитыТиповыхОпераций.ИмяДляФормулы,
	|	РеквизитыТиповыхОпераций.РеквизитПроводки.ТипЗначения,
	|	РеквизитыТиповыхОпераций.СостояниеПоддержки,
	|	РеквизитыТиповыхОпераций.ОтборЭлементов,
	|	ЕСТЬNULL(РеквизитыТиповыхОпераций.РеквизитПроводки.ШиринаПоляВвода, 0),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.Обязательный, ЛОЖЬ),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.СвязиПараметровВыбора, """"),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.СвязиПоТипу, """"),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.ВидЭлемента, 0),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.ГруппировкаЭлементов, 0),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.Отображение, 0),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.ОтображатьЗаголовок, ЛОЖЬ),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.РастягиватьПоГоризонтали, ЛОЖЬ),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.ПоложениеЗаголовка, 0),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.ЗапретитьИзменение, ЛОЖЬ),
	|	ЕСТЬNULL(ДанныеРеквизитовТиповыхОпераций.НевидимыйЭлемент, ЛОЖЬ),
	|	ДанныеРеквизитовТиповыхОпераций.УпакованныеНастройки,
	|	РеквизитыТиповыхОпераций.ФункциональныеОпции.(
	|		ИмяФункциональнойОпции
	|	),
	|	РеквизитыТиповыхОпераций.Код
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.Ссылка = ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И НЕ РеквизитыТиповыхОпераций.ПометкаУдаления
	|	И НЕ РеквизитыТиповыхОпераций.Ссылка В ИЕРАРХИИ
	|				(ВЫБРАТЬ
	|					Т.Ссылка
	|				ИЗ
	|					Справочник.РеквизитыТиповыхОпераций КАК Т
	|				ГДЕ
	|					Т.ЭтоГруппа
	|					И Т.ПометкаУдаления)
	|	И РеквизитыТиповыхОпераций.СостояниеПоддержки <> ЗНАЧЕНИЕ(Перечисление.СостоянияПоддержкиТиповыхОпераций.НеРедактируется)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	
	Выборка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДобавитьЭлементыДополнительныхРеквизитов(Выборка.Строки, ДеревоРезультат, Ложь, Неопределено);
	
КонецПроцедуры

Процедура ДобавитьЭлементыДополнительныхРеквизитов(ВыборкаЭлементы, ТекущаяСтрокаДерева, ОперацияНаПоддержке, ТекущаяСсылка)
	
	Для каждого ТекСтрока Из ВыборкаЭлементы Цикл
		
		Если ТекСтрока.Ссылка = ТекущаяСсылка Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекСтрока.ЭтоГруппа Тогда
			
			Для Каждого СтрокаГруппы Из ТекСтрока.Строки Цикл
				Если ТекСтрока.Ссылка = СтрокаГруппы.Ссылка Тогда
					Если СтрокаГруппы.Строки.Количество() > 0 Тогда
						НоваяГруппа = ДобавитьГруппуДополнительныхРеквизитов(СтрокаГруппы.Строки[0], ТекущаяСтрокаДерева);
					Иначе
						НоваяГруппа = ДобавитьГруппуДополнительныхРеквизитов(СтрокаГруппы, ТекущаяСтрокаДерева);
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ДобавитьЭлементыДополнительныхРеквизитов(ТекСтрока.Строки, НоваяГруппа, ОперацияНаПоддержке, ТекСтрока.Ссылка);
			
		Иначе
			
			СтрокаТиповойОперации = ТекСтрока.Строки[0];
			
			ДобавитьЭлементДополнительныхРеквизитов(СтрокаТиповойОперации, ТекущаяСтрокаДерева);
			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьГруппуДополнительныхРеквизитов(ТекСтрока, ТекущаяСтрокаДерева)
	Перем УпакованныеНастройки;
	Перем ГоризонтальноеПоложениеВГруппе;
	Перем ГоризонтальноеПоложениеПодчиненных;
	Перем ВертикальноеПоложениеВГруппе;
	Перем ВертикальноеПоложениеПодчиненных;
	
	ИмяРеквизита = СтрШаблон(БухгалтерскиеОперацииКлиентСервер.ШаблонИмениРеквизитаФормы(),
		СтрЗаменить(Строка(ТекСтрока.Ссылка.УникальныйИдентификатор()), "-", "_"), ТекСтрока.ИмяДляФормулы);
		
	ПрефиксЭлементовОперации = БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации();
	
	НоваяГруппа = ДобавитьОписаниеЭлементаВДерево(ТекущаяСтрокаДерева, ИмяРеквизита,
		ПрефиксЭлементовОперации + ИмяРеквизита, Тип("ГруппаФормы"));
	НоваяГруппа.ИмяДляФормулы       = ВРЕГ(ТекСтрока.ИмяДляФормулы);
	НоваяГруппа.Заголовок           = ТекСтрока.Наименование;
	НоваяГруппа.ОтображатьЗаголовок = ТекСтрока.ОтображатьЗаголовок;
	
	Если ТипЗнч(ТекСтрока.УпакованныеНастройки) = Тип("ХранилищеЗначения") Тогда
		УпакованныеНастройки = ТекСтрока.УпакованныеНастройки.Получить();
	КонецЕсли;
	
	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		
		НоваяГруппа.ОтображатьЗаголовок = УпакованныеНастройки.ОтображатьЗаголовок;
		УстановитьГруппировкуЭлементов(УпакованныеНастройки, НоваяГруппа);
		УстановитьОтображениеГруппы(УпакованныеНастройки, НоваяГруппа);
		УстановитьВидЭлементаГруппы(УпакованныеНастройки, НоваяГруппа);
		
		Если ЗначениеЗаполнено(УпакованныеНастройки.Подсказка) Тогда
			НоваяГруппа.РасширеннаяПодсказка = ОбщегоНазначения.ЗначениеИзСтрокиXML(УпакованныеНастройки.Подсказка);
		КонецЕсли;
		УстановитьЗначениеОтображениеПодсказки(УпакованныеНастройки.ОтображениеПодсказки, НоваяГруппа);
		НоваяГруппа.Объединенная = УпакованныеНастройки.Объединенная;
		УстановитьСквозноеВыравнивание(УпакованныеНастройки, НоваяГруппа);
		УстановитьВыравниваниеЭлементовИЗаголовков(УпакованныеНастройки, НоваяГруппа);
		УпакованныеНастройки.Свойство("ГоризонтальноеПоложениеВГруппе", ГоризонтальноеПоложениеВГруппе);
		УстановитьЗначениеГоризонтальноеПоложение(ГоризонтальноеПоложениеВГруппе, НоваяГруппа.ГоризонтальноеПоложениеВГруппе);
		УпакованныеНастройки.Свойство("ВертикальноеПоложениеВГруппе", ВертикальноеПоложениеВГруппе);
		УстановитьЗначениеВертикальноеПоложение(ВертикальноеПоложениеВГруппе, НоваяГруппа.ВертикальноеПоложениеВГруппе);
		УпакованныеНастройки.Свойство("ГоризонтальноеПоложениеПодчиненных", ГоризонтальноеПоложениеПодчиненных);
		УстановитьЗначениеГоризонтальноеПоложение(ГоризонтальноеПоложениеПодчиненных, НоваяГруппа.ГоризонтальноеПоложениеПодчиненных);
		УпакованныеНастройки.Свойство("ВертикальноеПоложениеПодчиненных", ВертикальноеПоложениеПодчиненных);
		УстановитьЗначениеВертикальноеПоложение(ВертикальноеПоложениеПодчиненных, НоваяГруппа.ВертикальноеПоложениеПодчиненных);
		Если УпакованныеНастройки.Свойство("РастягиватьПоГоризонтали")
			И УпакованныеНастройки.РастягиватьПоГоризонтали <> "Авто" Тогда
			НоваяГруппа.РастягиватьПоГоризонтали = ПривестиЗначениеКБулево(УпакованныеНастройки.РастягиватьПоГоризонтали);
		Иначе
			НоваяГруппа.РастягиватьПоГоризонтали = Неопределено;
		КонецЕсли;
		Если УпакованныеНастройки.Свойство("РастягиватьПоВертикали") Тогда
			НоваяГруппа.РастягиватьПоВертикали = УпакованныеНастройки.РастягиватьПоВертикали;
		Иначе
			НоваяГруппа.РастягиватьПоВертикали = Ложь;
		КонецЕсли;
	Иначе
		
		Если ТекСтрока.ВидЭлемента = "Страница" ИЛИ ТекСтрока.ВидЭлемента = 1 Тогда
			НоваяГруппа.ВидЭлемента = ВидГруппыФормы.Страница;
		ИначеЕсли ТекСтрока.ВидЭлемента = "Страницы" ИЛИ ТекСтрока.ВидЭлемента = 2 Тогда
			НоваяГруппа.ВидЭлемента = ВидГруппыФормы.Страницы;
		Иначе
			НоваяГруппа.ВидЭлемента = ВидГруппыФормы.ОбычнаяГруппа;
		КонецЕсли;
		Если ТекСтрока.ГруппировкаЭлементов = 1 Тогда
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		Иначе
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		КонецЕсли;
		
		Если ТекСтрока.Отображение = "Обычное выделение" ИЛИ ТекСтрока.Отображение = 3 Тогда
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
		ИначеЕсли ТекСтрока.Отображение = "Сильное выделение" ИЛИ ТекСтрока.Отображение = 1 Тогда
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
		ИначеЕсли ТекСтрока.Отображение = "Слабое выделение" ИЛИ ТекСтрока.Отображение = 2 Тогда
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
		Иначе
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		КонецЕсли;
		
		УстановитьЗначениеОтображениеПодсказки("", НоваяГруппа);
		УстановитьСквозноеВыравнивание(УпакованныеНастройки, НоваяГруппа);
		УстановитьВыравниваниеЭлементовИЗаголовков("", НоваяГруппа);
		УстановитьЗначениеГоризонтальноеПоложение("", НоваяГруппа.ГоризонтальноеПоложениеВГруппе);
		УстановитьЗначениеВертикальноеПоложение("", НоваяГруппа.ВертикальноеПоложениеВГруппе);
		УстановитьЗначениеГоризонтальноеПоложение("", НоваяГруппа.ГоризонтальноеПоложениеПодчиненных);
		УстановитьЗначениеВертикальноеПоложение("", НоваяГруппа.ВертикальноеПоложениеПодчиненных);
		НоваяГруппа.РастягиватьПоГоризонтали = ТекСтрока.РастягиватьПоГоризонтали;
		
	КонецЕсли;
	
	Возврат НоваяГруппа;
	
КонецФункции

// Добавить ответственного исполнителя.
// 
// Параметры:
//  ТекущаяСтрокаДерева - см. ПустоеДеревоЭлементовФормы
Процедура ДобавитьОтветственногоИсполнителя(ТекущаяСтрокаДерева)
	
	Группа = ДобавитьОписаниеЭлементаВДерево(ТекущаяСтрокаДерева,
		БухгалтерскиеОперацииКлиентСервер.ИмяГруппыОтветственныйИсполнитель(),
		БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации()
			+ БухгалтерскиеОперацииКлиентСервер.ИмяГруппыОтветственныйИсполнитель(),
		Тип("ГруппаФормы"));
	Группа.Заголовок = НСтр("ru = 'Ответственный, отразивший в учете'");
	Группа.НеПовторять = Ложь;
	Группа.СквозноеВыравнивание = СквозноеВыравнивание.НеИспользовать;
	Группа.ОтображатьЗаголовок = Истина;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ИмяРеквизита = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель();
	ЭлементГруппы = ДобавитьОписаниеЭлементаВДерево(Группа, ИмяРеквизита,
		БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации() + ИмяРеквизита, Тип("ПолеФормы"));

	ЭлементГруппы.ИмяДляФормулы = ВРЕГ(БухгалтерскиеОперацииКлиентСервер.ИмяДляФормулыРеквизитаОтветственныйИсполнитель());
	ЭлементГруппы.Заголовок = НСтр("ru = 'Бухгалтер'");
	ЭлементГруппы.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
	ЭлементГруппы.ПриИзменении = "Подключаемый_ПриИзмененииДопРеквизита";
	ЭлементГруппы.ВидЭлемента = ВидПоляФормы.ПолеВвода;
	ЭлементГруппы.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	//@skip-check bsl-nstr-string-literal-format
	ЭлементГруппы.РасширеннаяПодсказка = Новый ФорматированнаяСтрока(
		НСтр("ru = 'Поле ""Бухгалтер"" заполняется автоматически, если выполняются следующие условия:
			| - у текущего пользователя заполнено поле ""Физическое лицо"";
			| - в организации, указанной в документе, есть только один сотрудник по этому физическому лицу;
			| - в централизованной бухгалтерии, есть только один сотрудник по этому физическому лицу (если документ проводится в ЦБ).
			|Если сотрудник не определился автоматически, его нужно выбрать вручную.
			|
			|Также можно указать нужного сотрудника, который будет использоваться при работе текущего пользователя
			|в'"),
		" ",
		Новый ФорматированнаяСтрока(
			НСтр("ru = 'Настройке ответственного исполнителя'"),,,,
			"e1cib/list/РегистрСведений.ОтветственныеИсполнителиПользователей"));
	ЭлементГруппы.СвязиПараметровВыбора = Новый Массив;
	ЭлементГруппы.СвязиПараметровВыбора.Добавить(
		Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Организация", РежимИзмененияСвязанногоЗначения.Очищать));
	ЭлементГруппы.ПараметрыВыбора = Новый Массив;
	ЭлементГруппы.ПараметрыВыбора.Добавить(Новый ПараметрВыбора("СотрудникиТекущегоПользователя", Ложь));
	ЭлементГруппы.НачалоВыбора = "Подключаемый_ПриНачалеВыбораДопРеквизита";
	
КонецПроцедуры

Процедура ДобавитьЭлементДополнительныхРеквизитов(ТекСтрока, ТекущаяСтрокаДерева)
	Перем УпакованныеНастройки;
	
	ИмяРеквизита = СтрШаблон(БухгалтерскиеОперацииКлиентСервер.ШаблонИмениРеквизитаФормы(),
		СтрЗаменить(Строка(ТекСтрока.Ссылка.УникальныйИдентификатор()), "-", "_"), ТекСтрока.ИмяДляФормулы);
		
	ЭлементГруппы = ДобавитьОписаниеЭлементаВДерево(ТекущаяСтрокаДерева, ИмяРеквизита,
		БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации() + ИмяРеквизита, Тип("ПолеФормы"));
		
	ЭлементГруппы.ИмяДляФормулы       = ВРЕГ(ТекСтрока.ИмяДляФормулы);
	ЭлементГруппы.Заголовок           = ТекСтрока.Наименование;
	ЭлементГруппы.ТипЗначения         = ТекСтрока.РеквизитПроводкиТипЗначения;
	ЭлементГруппы.Реквизит            = ТекСтрока.РеквизитПроводки;
	ЭлементГруппы.ПриИзменении        = "Подключаемый_ПриИзмененииДопРеквизита";
	ЭлементГруппы.ФункциональныеОпции = ТекСтрока.ФункциональныеОпции.ВыгрузитьКолонку("ИмяФункциональнойОпции");//Справочники.РеквизитыТиповыхОпераций.ФункциональныеОпцииРеквизитаТиповойОперации(ТекСтрока.Ссылка, ОперацияНаПоддержке);
	
	Если ТипЗнч(ТекСтрока.УпакованныеНастройки) = Тип("ХранилищеЗначения") Тогда
		УпакованныеНастройки = ТекСтрока.УпакованныеНастройки.Получить();
	КонецЕсли;
	
	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		
		СвязиПараметровВыбораСохр = УпакованныеНастройки.СвязиПараметровВыбора;
		
	Иначе
		
		СвязиПараметровВыбораСохр = ТекСтрока.СвязиПараметровВыбора;
		
	КонецЕсли;
	
	Если Лев(СвязиПараметровВыбораСохр, 4)="{""#""" Тогда
		СвязиПараметровВыбора = ЗначениеИзСтрокиВнутр(СвязиПараметровВыбораСохр);
		Массив = Новый Массив;
		Для каждого ТекСвязь Из СвязиПараметровВыбора Цикл
			
			Массив.Добавить(Новый СвязьПараметраВыбора(	ТекСвязь.Имя,
														ТекСвязь.Реквизит,
														?(	ТекСвязь.Режим = "Очищать",
															РежимИзмененияСвязанногоЗначения.Очищать,
															РежимИзмененияСвязанногоЗначения.НеИзменять)));
			
		КонецЦикла; 
		ЭлементГруппы.СвязиПараметровВыбора		= Массив;
	КонецЕсли;
	
	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		ПараметрыВыбораСохр = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(УпакованныеНастройки, "ПараметрыВыбора", "");
	Иначе
		ПараметрыВыбораСохр = "";
	КонецЕсли;
	
	ПараметрыВыбора = Новый Массив;
	Если Лев(ПараметрыВыбораСохр, 4)="{""#""" Тогда
		НеобработанныеПараметрыВыбора = ЗначениеИзСтрокиВнутр(ПараметрыВыбораСохр);
		Для каждого ТекПараметр Из НеобработанныеПараметрыВыбора Цикл
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора(ТекПараметр.Имя, ТекПараметр.Значение));
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		
		СвязиПоТипуСохр = УпакованныеНастройки.СвязиПоТипу;
		
	Иначе
		
		СвязиПоТипуСохр = ТекСтрока.СвязиПоТипу;
		
	КонецЕсли;
	ЭлементГруппы.СвязиПоТипу = СвязиПоТипуСохр;
	
	Если НЕ ПустаяСтрока(ТекСтрока.ОтборЭлементов) Тогда
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ПредустановленныйОтбор", ТекСтрока.ОтборЭлементов));
		// для перечислений добавим текст запроса для СКД обрабатываемой при получении списка выбора.
		Если Перечисления.ТипВсеСсылки().СодержитТип(ТекСтрока.РеквизитПроводкиТипЗначения.Типы()[0]) Тогда
			ТекстЗапросаОтбора = "Выбрать * Из Перечисление."+Метаданные.НайтиПоТипу(ТекСтрока.РеквизитПроводкиТипЗначения.Типы()[0]).Имя+" Как Переч";
			ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ТекстЗапросаОтбора", ТекстЗапросаОтбора));
		КонецЕсли;
	КонецЕсли;
	Если ПараметрыВыбора.Количество() > 0 Тогда
		ЭлементГруппы.ПараметрыВыбора			= ПараметрыВыбора;
	КонецЕсли;
	
	Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
		Если ЗначениеЗаполнено(УпакованныеНастройки.Подсказка) Тогда
			ЭлементГруппы.РасширеннаяПодсказка = ОбщегоНазначения.ЗначениеИзСтрокиXML(УпакованныеНастройки.Подсказка);
		КонецЕсли;
		УстановитьЗначениеОтображениеПодсказки(УпакованныеНастройки.ОтображениеПодсказки, ЭлементГруппы);
		Если УпакованныеНастройки.Свойство("РастягиватьПоГоризонтали")
			И УпакованныеНастройки.РастягиватьПоГоризонтали <> "Авто" Тогда
			ЭлементГруппы.РастягиватьПоГоризонтали = ПривестиЗначениеКБулево(УпакованныеНастройки.РастягиватьПоГоризонтали);
		Иначе
			ЭлементГруппы.РастягиватьПоГоризонтали = Неопределено;
		КонецЕсли;
		ЭлементГруппы.ВидЭлемента = ?(УпакованныеНастройки.ВидЭлемента = "Поле флажка", ВидПоляФормы.ПолеФлажка, ВидПоляФормы.ПолеВвода);
		ЭлементГруппы.ПоложениеЗаголовка = ?(УпакованныеНастройки.ПоложениеЗаголовка="",
			ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы[УпакованныеНастройки.ПоложениеЗаголовка]);
		ЭлементГруппы.ТолькоЧтение = УпакованныеНастройки.ТолькоЧтение = Истина;
		ЭлементГруппы.Видимость = УпакованныеНастройки.Видимость <> Ложь;
		УстановитьМаксимальнуюШиринуЭлементаВДерево(ЭлементГруппы, ТекСтрока, Истина, УпакованныеНастройки);
		ЭлементГруппы.ВысотаЗаголовка = УпакованныеНастройки.ВысотаЗаголовка;
		Если УпакованныеНастройки.ПроверкаВвода = "Выдавать ошибку" ИЛИ УпакованныеНастройки.ПроверкаВвода = "Выводить ошибку" Тогда
			ЭлементГруппы.ПроверкаВвода = ПроверкаЗаполнения.ВыдаватьОшибку;
		Иначе
			ЭлементГруппы.ПроверкаВвода = ПроверкаЗаполнения.НеПроверять;
		КонецЕсли;
		ЭлементГруппы.ПодсказкаВвода = УпакованныеНастройки.ПодсказкаВвода;
		Если УпакованныеНастройки.Свойство("ПодсказкаРастягиватьПоГоризонтали")
			И УпакованныеНастройки.ПодсказкаРастягиватьПоГоризонтали <> "Авто" Тогда
			ЭлементГруппы.ПодсказкаРастягиватьПоГоризонтали = ПривестиЗначениеКБулево(УпакованныеНастройки.ПодсказкаРастягиватьПоГоризонтали);
		Иначе
			ЭлементГруппы.ПодсказкаРастягиватьПоГоризонтали = Неопределено;
		КонецЕсли;
		Если УпакованныеНастройки.Свойство("ПодсказкаРастягиватьПоВертикали")
			И УпакованныеНастройки.ПодсказкаРастягиватьПоВертикали <> "Авто" Тогда
			ЭлементГруппы.ПодсказкаРастягиватьПоВертикали = ПривестиЗначениеКБулево(УпакованныеНастройки.ПодсказкаРастягиватьПоВертикали);
		Иначе
			ЭлементГруппы.ПодсказкаРастягиватьПоВертикали = Неопределено;
		КонецЕсли;
		ЭлементГруппы.ПодсказкаАвтоМаксимальнаяШирина = УпакованныеНастройки.ПодсказкаАвтоМаксимальнаяШирина;
		ЭлементГруппы.ПодсказкаМаксимальнаяШирина = УпакованныеНастройки.ПодсказкаМаксимальнаяШирина;
	Иначе
		ЭлементГруппы.ПоложениеЗаголовка			= ПоложениеЗаголовкаЭлементаПоСохраненномуЗначению(ТекСтрока.ПоложениеЗаголовка);
		ЭлементГруппы.ВидЭлемента					= ВидПоляФормыПоСохраненномуЗначению(ТекСтрока.ВидЭлемента);
		УстановитьЗначениеОтображениеПодсказки("", ЭлементГруппы);
		ЭлементГруппы.РастягиватьПоГоризонтали = ТекСтрока.РастягиватьПоГоризонтали;
		ЭлементГруппы.ТолькоЧтение = ТекСтрока.ЗапретитьИзменение;
		ЭлементГруппы.Видимость = НЕ ТекСтрока.НевидимыйЭлемент;
		УстановитьМаксимальнуюШиринуЭлементаВДерево(ЭлементГруппы, ТекСтрока);
		ЭлементГруппы.ВысотаЗаголовка = 0;
		ЭлементГруппы.ПроверкаВвода = ?(ТекСтрока.Обязательный, ПроверкаЗаполнения.ВыдаватьОшибку, ПроверкаЗаполнения.НеПроверять);
		ЭлементГруппы.ПодсказкаВвода = "";
		ЭлементГруппы.ПодсказкаРастягиватьПоГоризонтали = Неопределено;
		ЭлементГруппы.ПодсказкаРастягиватьПоВертикали = Неопределено;
		ЭлементГруппы.ПодсказкаАвтоМаксимальнаяШирина = Истина;
		ЭлементГруппы.ПодсказкаМаксимальнаяШирина = 0;
	КонецЕсли;
	
	Если ЭлементГруппы.ВидЭлемента = ВидПоляФормы.ПолеВвода Тогда
		ЭлементГруппы.НачалоВыбора				= "Подключаемый_ПриНачалеВыбораДопРеквизита";
	КонецЕсли;
	
КонецПроцедуры

Функция ПривестиЗначениеКБулево(Значение)

	Если Значение = "Да" Тогда
		Возврат Истина;
	ИначеЕсли Значение = "Нет" Тогда
		Возврат Ложь;
	Иначе
		Возврат ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповБулево().ПривестиЗначение(Значение);
	КонецЕсли;

КонецФункции

Процедура УстановитьМаксимальнуюШиринуЭлементаВДерево(Элемент, ТекСтрока, УпакованныеНастройкиЗаданы = Ложь, УпакованныеНастройки = Неопределено)

	Если УпакованныеНастройкиЗаданы Тогда
		Элемент.АвтоМаксимальнаяШирина = УпакованныеНастройки.АвтоМаксимальнаяШирина;
		Элемент.МаксимальнаяШирина = УпакованныеНастройки.МаксимальнаяШирина;
		
		Если Элемент.АвтоМаксимальнаяШирина И ЗначениеЗаполнено(ТекСтрока.ШиринаПоляВвода) Тогда
			Элемент.АвтоМаксимальнаяШирина = Ложь;
			Элемент.МаксимальнаяШирина = ТекСтрока.ШиринаПоляВвода;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(ТекСтрока.ШиринаПоляВвода) Тогда
			Элемент.АвтоМаксимальнаяШирина = Ложь;
			Элемент.МаксимальнаяШирина = ТекСтрока.ШиринаПоляВвода;
		Иначе
			Элемент.АвтоМаксимальнаяШирина = Истина;
			Элемент.МаксимальнаяШирина = 0;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция ДобавитьГруппуФормы(Форма, ТекСтрокаДерева, ПолеДляЭлементов, Знач ПрефиксЭлементов = "")

	Если Не ЗначениеЗаполнено(ПрефиксЭлементов) Тогда
		ПрефиксЭлементов = БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации();
	КонецЕсли;
	
	НовГруппа = Форма.Элементы.Добавить(ТекСтрокаДерева.ИмяЭлемента,
		Тип("ГруппаФормы"), ПолеДляЭлементов);
	
	НовГруппа.Вид = ТекСтрокаДерева.ВидЭлемента;
	Если НовГруппа.Вид = ВидГруппыФормы.Страницы Тогда
		НовГруппа.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	ИначеЕсли НовГруппа.Вид = ВидГруппыФормы.ГруппаКолонок Тогда
		НовГруппа.Группировка = ТекСтрокаДерева.Группировка;
	Иначе
		
		Если НовГруппа.Вид <> ВидГруппыФормы.Страница Тогда
			
			НовГруппа.ОтображатьЗаголовок = ТекСтрокаДерева.ОтображатьЗаголовок;
			Если ТекСтрокаДерева.Отображение = "Обычное выделение" Тогда
				НовГруппа.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			ИначеЕсли ТекСтрокаДерева.Отображение = "Сильное выделение" Тогда
				НовГруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			ИначеЕсли ТекСтрокаДерева.Отображение = "Слабое выделение" Тогда
				НовГруппа.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
			Иначе
				НовГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			КонецЕсли;
			
		КонецЕсли;
		
		НовГруппа.Группировка                        = ТекСтрокаДерева.Группировка;
		НовГруппа.ОтображениеПодсказки               = ТекСтрокаДерева.ОтображениеПодсказки;
		Если НовГруппа.Вид <> ВидГруппыФормы.Страница Тогда
			НовГруппа.Объединенная                   = ТекСтрокаДерева.Объединенная;
			НовГруппа.СквозноеВыравнивание           = ТекСтрокаДерева.СквозноеВыравнивание;
		КонецЕсли;
		НовГруппа.ВыравниваниеЭлементовИЗаголовков   = ТекСтрокаДерева.ВыравниваниеЭлементовИЗаголовков;
		НовГруппа.ГоризонтальноеПоложениеВГруппе     = ТекСтрокаДерева.ГоризонтальноеПоложениеВГруппе;
		НовГруппа.ВертикальноеПоложениеВГруппе       = ТекСтрокаДерева.ВертикальноеПоложениеВГруппе;
		НовГруппа.ГоризонтальноеПоложениеПодчиненных = ТекСтрокаДерева.ГоризонтальноеПоложениеПодчиненных;
		НовГруппа.ВертикальноеПоложениеПодчиненных   = ТекСтрокаДерева.ВертикальноеПоложениеПодчиненных;
		НовГруппа.РастягиватьПоВертикали             = ?(ТипЗнч(ТекСтрокаДерева.РастягиватьПоВертикали) = Тип("Булево"), ТекСтрокаДерева.РастягиватьПоВертикали, Неопределено);
		Если ЗначениеЗаполнено(ТекСтрокаДерева.РасширеннаяПодсказка) Тогда
			ДобавитьРасширеннуюПодсказкуЭлемента(Форма, НовГруппа, ТекСтрокаДерева.РасширеннаяПодсказка);
		КонецЕсли;
		
	КонецЕсли;
	НовГруппа.Заголовок                = ТекСтрокаДерева.Заголовок;
	НовГруппа.РастягиватьПоГоризонтали = ?(ТипЗнч(ТекСтрокаДерева.РастягиватьПоГоризонтали) = Тип("Булево"), ТекСтрокаДерева.РастягиватьПоГоризонтали, Неопределено);
	
	Возврат НовГруппа;

КонецФункции

Процедура ДобавитьКнопкуФормы(Форма, ТекСтрокаДерева, ПолеДляЭлементов)

	ПрефиксЭлементовОперации = БухгалтерскиеОперацииКлиентСервер.ПрефиксЭлементовОперации();
	
	НовКоманда = Форма.Команды.Добавить(ПрефиксЭлементовОперации + ТекСтрокаДерева.Реквизит);
	НовКоманда.Действие  = ТекСтрокаДерева.Действие;
	НовКоманда.Заголовок = ТекСтрокаДерева.Заголовок;
	НовКоманда.Подсказка = ТекСтрокаДерева.Подсказка;
	
	Если НЕ ПустаяСтрока(ТекСтрокаДерева.ИмяКартинки) Тогда
		НовКоманда.Картинка    = БиблиотекаКартинок[ТекСтрокаДерева.ИмяКартинки];
		НовКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЕсли;
	
	Если ТекСтрокаДерева.Реквизит = БухгалтерскиеОперацииКлиентСервер.ИмяКомандыФормыОбновитьКурсВалюты() Тогда
		НовКоманда.ИзменяетСохраняемыеДанные = Истина;
	КонецЕсли;
	
	НовКнопка = Форма.Элементы.Добавить(ТекСтрокаДерева.ИмяЭлемента,
		Тип("КнопкаФормы"), ПолеДляЭлементов);
	НовКнопка.ИмяКоманды = ПрефиксЭлементовОперации+ТекСтрокаДерева.Реквизит;

КонецПроцедуры

Функция ДобавитьТаблицуФормы(Форма, ТекСтрокаДерева, ПолеДляЭлементов)

	ИмяТЧ = ТекСтрокаДерева.Имя;
	
	ТаблицаФормы = Форма.Элементы.Добавить(ТекСтрокаДерева.ИмяЭлемента, Тип("ТаблицаФормы"), ПолеДляЭлементов);
	ТаблицаФормы.ПутьКДанным = ИмяТЧ;
	ТаблицаФормы.Заголовок   = ТекСтрокаДерева.Заголовок;
	
	Возврат ТаблицаФормы;
	
КонецФункции

Процедура ДобавитьПолеФормы(Форма, ТекСтрокаДерева, ПолеДляЭлементов, ДополнительныеПараметры, Префикс = "")
	
	НовЭлемент = Форма.Элементы.Найти(ТекСтрокаДерева.ИмяЭлемента); // ПолеФормы
	
	Если НовЭлемент = Неопределено Тогда
		НовЭлемент = Форма.Элементы.Добавить(ТекСтрокаДерева.ИмяЭлемента, Тип("ПолеФормы"), ПолеДляЭлементов);
		Если ЗначениеЗаполнено(ТекСтрокаДерева.ИмяТаблицы) Тогда
			ПутьКДанным = СтрШаблон("%1.%2", ТекСтрокаДерева.Путь, ТекСтрокаДерева.Имя);
		Иначе
			ПутьКДанным = ТекСтрокаДерева.Имя;
		КонецЕсли;
		НовЭлемент.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Конфликт = ДополнительныеПараметры.КонфликтыИменРеквизитов.НайтиПоЗначению(НовЭлемент.ПутьКДанным);
	
	Если Конфликт <> Неопределено Тогда
		НовЭлемент.Заголовок        = СтрШаблон("%1 %2", НСтр("ru = '<конфликт>'"), ТекСтрокаДерева.Заголовок);
	КонецЕсли;
	НовЭлемент.Вид                  = ТекСтрокаДерева.ВидЭлемента;
	НовЭлемент.ПоложениеЗаголовка   = ТекСтрокаДерева.ПоложениеЗаголовка;
	НовЭлемент.Видимость            = ТекСтрокаДерева.Видимость;
	НовЭлемент.ЦветФона             = ТекСтрокаДерева.ЦветФона;
	НовЭлемент.ОтображениеПодсказки = ТекСтрокаДерева.ОтображениеПодсказки;
	НовЭлемент.ВысотаЗаголовка      = ТекСтрокаДерева.ВысотаЗаголовка;
	НовЭлемент.ТолькоПросмотр       = ТекСтрокаДерева.ТолькоЧтение;
	Для Каждого ЗначениеСписка Из ТекСтрокаДерева.СписокВыбора Цикл  
		 НовЭлемент.СписокВыбора.Добавить(ЗначениеСписка.Значение, ЗначениеСписка.Представление);
	КонецЦикла;
	
	Если ТекСтрокаДерева.ВидЭлемента = ВидПоляФормы.ПолеВвода Тогда
		Если НовЭлемент.СписокВыбора.Количество() > 0 Тогда
			НовЭлемент.РежимВыбораИзСписка = Истина;
		КонецЕсли;
		НовЭлемент.АвтоОтметкаНезаполненного = (ТекСтрокаДерева.ПроверкаВвода = ПроверкаЗаполнения.ВыдаватьОшибку);
		НовЭлемент.Ширина                    = ТекСтрокаДерева.ШиринаЭлемента;
		НовЭлемент.ОграничениеТипа           = ТекСтрокаДерева.ТипЗначения;
		НовЭлемент.АвтоМаксимальнаяШирина    = ТекСтрокаДерева.АвтоМаксимальнаяШирина;
		НовЭлемент.МаксимальнаяШирина        = ТекСтрокаДерева.МаксимальнаяШирина;
		НовЭлемент.ПодсказкаВвода            = ТекСтрокаДерева.ПодсказкаВвода;
		НовЭлемент.ВыборГруппИЭлементов      = ГруппыИЭлементы.ГруппыИЭлементы;
		Если ТекСтрокаДерева.РастягиватьПоГоризонтали <> Неопределено
			И ТекСтрокаДерева.РастягиватьПоГоризонтали <> "Авто" Тогда
			НовЭлемент.РастягиватьПоГоризонтали = ТекСтрокаДерева.РастягиватьПоГоризонтали;
		КонецЕсли;
		
		Если ТипЗнч(ТекСтрокаДерева.СвязиПараметровВыбора) = Тип("Массив") Тогда
			НовыйСвязиПараметровВыбора = ПолучитьСвязиПараметровВыбора(Форма, ТекСтрокаДерева, ПолеДляЭлементов,
				ДополнительныеПараметры);
			//@skip-check empty-except-statement
			Попытка
				НовЭлемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйСвязиПараметровВыбора);
			Исключение
				// не обрабатывается
			КонецПопытки;
		КонецЕсли;
	
		Если ТипЗнч(ТекСтрокаДерева.ПараметрыВыбора) = Тип("Массив") Тогда
			НовЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(ТекСтрокаДерева.ПараметрыВыбора);
		КонецЕсли;
		
		ОписаниеСвязиПоТипу = БухгалтерскиеОперацииСервер.ДетальноеОписаниеСвязиПоТипу(ТекСтрокаДерева.СвязиПоТипу);
		Если ЗначениеЗаполнено(ТекСтрокаДерева.СвязиПоТипу) Тогда
			
			СоставИмениСвязи = СтрРазделить(ОписаниеСвязиПоТипу.ИмяСвязи, ".");
			ИмяСвязи = "";
			
			Если СоставИмениСвязи.Количество() = 1 Тогда
				// Связь с дополнительным реквизитом операции
				
				ДобавленныеРеквизитыПоИмени = ДополнительныеПараметры.ДеревоЭлементов.Строки.НайтиСтроки(
					Новый Структура("ИмяДляФормулы", ВРЕГ(СоставИмениСвязи[0])), Истина);
				Если ДобавленныеРеквизитыПоИмени.Количество() = 1 Тогда
					ИмяСвязи = ДобавленныеРеквизитыПоИмени[0].Имя;
				КонецЕсли;
				
			ИначеЕсли СоставИмениСвязи.Количество() = 2 Тогда
				// Связь с реквизитом объекта
				
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
					
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
					
						ИмяСвязи = ОписаниеСвязиПоТипу.ИмяСвязи;
					Иначе
						// Реквизиты операции добавляются не на форму объекта.
						
						Если Форма.ИмяФормы = "Обработка.ФормированиеБухгалтерскихПроводок.Форма.Форма" Тогда
							// вместо "связи по типу" назначаем "ограничение типа"
							
							СвойстваСчетаРеквизита = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(
								ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Форма.Объект.ДокументОснование,
									СоставИмениСвязи[1]));
								
							Если СвойстваСчетаРеквизита <> Неопределено Тогда
								
								Если ЗначениеЗаполнено(СвойстваСчетаРеквизита["ВидСубконто"
									+ ОписаниеСвязиПоТипу.ПорядокСвязи]) Тогда
									
									НовЭлемент.ОграничениеТипа = СвойстваСчетаРеквизита["ВидСубконто"
										+ ОписаниеСвязиПоТипу.ПорядокСвязи + "ТипЗначения"];
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли СоставИмениСвязи.Количество() = 3 Тогда
				// Связь с реквизитом табличной части
				
				ИмяРеквизитаСвязи = "";
				ДобавленныеРеквизитыПоИмени = ДополнительныеПараметры.ДеревоЭлементов.Строки.НайтиСтроки(
					Новый Структура("ИмяДляФормулы", СоставИмениСвязи[2]), Истина);
				Если ДобавленныеРеквизитыПоИмени.Количество() = 1 Тогда
					ИмяРеквизитаСвязи = ДобавленныеРеквизитыПоИмени[0].Имя;
				Иначе
					ИмяРеквизитаСвязи = СоставИмениСвязи[2];
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИмяРеквизитаСвязи) Тогда
					ИмяСвязи = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
						"Элементы.[ИмяТЧ].ТекущиеДанные.[ИмяРеквизитаТЧ]",
						Новый Структура("ИмяТЧ, ИмяРеквизитаТЧ", СоставИмениСвязи[1], ИмяРеквизитаСвязи));
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИмяСвязи) Тогда
				Попытка
				
					НовЭлемент.СвязьПоТипу = Новый СвязьПоТипу(ИмяСвязи, ОписаниеСвязиПоТипу.ПорядокСвязи);
				
				Исключение
					
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					
					СоставСообщения = Новый Массив;
					Если Не ЗначениеЗаполнено(ТекСтрокаДерева.ИмяТаблицы) Тогда
						СоставСообщения.Добавить(СтрШаблон(НСтр("ru = 'Типовая операция: %1'"),
							?(ЗначениеЗаполнено(ДополнительныеПараметры.ТиповаяОперация),
								ДополнительныеПараметры.ТиповаяОперация,
								НСтр("ru = 'типовая операция не выбрана'"))));
						СоставСообщения.Добавить(СтрШаблон(НСтр("ru = 'Документ: %1'"),
							?(ЗначениеЗаполнено(ДополнительныеПараметры.ТиповаяОперация),
								ДополнительныеПараметры.ТиповаяОперация.ИдентификаторДокумента,
								НСтр("ru = 'типовая операция не выбрана'"))));
					КонецЕсли;
					СоставСообщения.Добавить(СтрШаблон(НСтр("ru = 'ИмяДляФормулы: %1'"), ТекСтрокаДерева.ИмяДляФормулы));
					СоставСообщения.Добавить(СтрШаблон(НСтр("ru = 'Связь по типу: %1'"), ТекСтрокаДерева.СвязиПоТипу));
					СоставСообщения.Добавить(СтрШаблон(НСтр("ru = 'Описание ошибки:
						|%1'"), ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)));
					
					ЗаписьЖурналаРегистрации(СобытиеЖурналаРегистрацииОшибкаОтрисовкиФормДокументов(),
						УровеньЖурналаРегистрации.Ошибка,,,
						?(ЗначениеЗаполнено(ТекСтрокаДерева.ИмяТаблицы),
							НСтр("ru = 'Ошибка установки связи по типу при добавлении колонки табличной части:'"),
							НСтр("ru = 'Ошибка установки связи по типу при добавлении реквизита операции:'")) + "
						|" + СтрСоединить(СоставСообщения, "," + Символы.ПС)
						);
						
					
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТекСтрокаДерева.ПараметрыВыбора.Количество() > 0 Тогда
			НовЭлемент.ПараметрыВыбора = Новый ФиксированныйМассив(ТекСтрокаДерева.ПараметрыВыбора);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ТекСтрокаДерева.НачалоВыбора) И НЕ ТекСтрокаДерева.ПереопределенныйРеквизит Тогда
			НовЭлемент.УстановитьДействие("НачалоВыбора",ТекСтрокаДерева.НачалоВыбора);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСтрокаДерева.РасширеннаяПодсказка) Тогда
		ДобавитьРасширеннуюПодсказкуЭлемента(Форма, НовЭлемент, ТекСтрокаДерева.РасширеннаяПодсказка);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекСтрокаДерева.ПриИзменении) И НЕ ТекСтрокаДерева.ПереопределенныйРеквизит Тогда
		НовЭлемент.УстановитьДействие("ПриИзменении",ТекСтрокаДерева.ПриИзменении);
	КонецЕсли;
	
	Если ТекСтрокаДерева.Реквизит = "ТиповаяОперация" Тогда
		УстановитьСпецифическиеСвойстваЭлементаТиповаяОперация(НовЭлемент, ТекСтрокаДерева);
	КонецЕсли;
	
	Если ТекСтрокаДерева.Имя = БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаОтветственныйИсполнитель() Тогда
		НовЭлемент.КнопкаВыпадающегоСписка = Ложь;
		НовЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		НовЭлемент.КнопкаСоздания = Ложь;
		НовЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	КонецЕсли;
	
КонецПроцедуры

Функция СвязьПараметровВыбораДопРеквизит(Форма, СвязьПараметровВыбора, ДополнительныеПараметры)
	
	Если НЕ ЗначениеЗаполнено(БухгалтерскиеОперацииКлиентСервер.ИмяРеквизитаФормыПоИмениДляФормулы(
		Форма, СвязьПараметровВыбора.ПутьКДанным)) Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	ДобавленныеРеквизитыПоИмени = ДополнительныеПараметры.ДеревоЭлементов.Строки.НайтиСтроки(
		Новый Структура("ИмяДляФормулы", ВРЕГ(СвязьПараметровВыбора.ПутьКДанным)), Истина);
	Если ДобавленныеРеквизитыПоИмени.Количество() > 0 Тогда
		// связь с доп. реквизитом операции или добавленным реквизитом ТЧ
		НоваяСвязь = Новый СвязьПараметраВыбора(
			СвязьПараметровВыбора.Имя,
			ДобавленныеРеквизитыПоИмени[0].Имя,
			СвязьПараметровВыбора.ИзменениеЗначения);
		Возврат НоваяСвязь;
	КонецЕсли;

	Возврат СвязьПараметровВыбора;
	
КонецФункции

Функция СвязьПараметровВыбораРеквизитОбъекта(ТекСтрокаДерева, СвязьПараметровВыбора, ИмяРеквизита)
	
	Если СвязьПараметровВыбораНеОчищатьПриИзмененииДаты(ТекСтрокаДерева.ТипЗначения, ИмяРеквизита) Тогда
		Возврат Новый СвязьПараметраВыбора(
			СвязьПараметровВыбора.Имя,
			СвязьПараметровВыбора.ПутьКДанным,
			РежимИзмененияСвязанногоЗначения.НеИзменять);
	Иначе
		Возврат СвязьПараметровВыбора;
	КонецЕсли;
	
КонецФункции

Функция СвязьПараметровВыбораНеОчищатьПриИзмененииДаты(ТипРеквизита, Знач ИмяРеквизита)
	
	ИмяРеквизита = ВРег(ИмяРеквизита);
	Если ИмяРеквизита <> "ДАТА" И ИмяРеквизита <> "ИФО" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипРеквизита, Тип("СправочникСсылка.РазделыЛицевыхСчетов")) Тогда
		// Разделы лицевых счетов не очищать при изменении даты
		Возврат ИмяРеквизита = "ДАТА";
	ИначеЕсли ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипРеквизита, Тип("СправочникСсылка.КлассификационныеПризнакиСчетов"))
		ИЛИ ОбщегоНазначения.ОписаниеТипаСостоитИзТипа(ТипРеквизита, Тип("ПеречислениеСсылка.КВД")) Тогда
		// КФО и КПС не очищать при изменении даты и ИФО
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СвязьПараметровВыбораСтрокаТаблицы(ТекущаяСвязь, Знач ТекущаяТаблицаФормы, СоставПутиКДанным,
	ДополнительныеПараметры)

	Если ТипЗнч(ТекущаяТаблицаФормы) <> Тип("ТаблицаФормы") Тогда
		ТекущаяТаблицаФормы = ОбщегоНазначенияБГУКлиентСервер.РодительскийЭлементЗаданногоТипа(ТекущаяТаблицаФормы, 
			Тип("ТаблицаФормы"));
	КонецЕсли;

	ОтборРеквизитов = Новый Структура("ИмяТаблицы, ИмяДляФормулы", СоставПутиКДанным[0], СоставПутиКДанным[1]);
	ДобавленныеРеквизитыПоИмени = ДополнительныеПараметры.ДеревоЭлементов.Строки.НайтиСтроки(
		ОтборРеквизитов, Истина);
	Если ДобавленныеРеквизитыПоИмени.Количество() > 0 Тогда
		ИмяРеквизита = ДобавленныеРеквизитыПоИмени[0].Имя;
	Иначе
		ИмяРеквизита = СоставПутиКДанным[1];
	КонецЕсли;

	НовыйТекстПутьКДанным = СтрШаблон("Элементы.%1.ТекущиеДанные.%2", ТекущаяТаблицаФормы.Имя, ИмяРеквизита);
	Возврат Новый СвязьПараметраВыбора(ТекущаяСвязь.Имя, НовыйТекстПутьКДанным, ТекущаяСвязь.ИзменениеЗначения);

КонецФункции

Функция ЭтоТабличнаяЧасть(ЭлементФормы)
	Возврат ТипЗнч(ЭлементФормы) = Тип("ТаблицаФормы")
		ИЛИ ((ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы")
			И ЭлементФормы.Вид = ВидГруппыФормы.ГруппаКолонок));
КонецФункции

Функция ПолучитьСвязиПараметровВыбора(Форма, ТекСтрокаДерева, ПолеДляЭлементов, ДополнительныеПараметры)

	НовыйСвязиПараметровВыбора = Новый Массив;
	Для Каждого ТекущаяСвязь Из ТекСтрокаДерева.СвязиПараметровВыбора Цикл

		РазложениеПутиКДанным = СтрРазделить(ТекущаяСвязь.ПутьКДанным, ".");

		Если РазложениеПутиКДанным.Количество() > 2 Тогда
			// неизвестный формат пути к данным
			Продолжить;
		КонецЕсли;

		ДобавляемаяСвязь = Неопределено;
		Если РазложениеПутиКДанным.Количество() = 1 Тогда
			ДобавляемаяСвязь = СвязьПараметровВыбораДопРеквизит(Форма, ТекущаяСвязь, ДополнительныеПараметры);
		ИначеЕсли ВРег(РазложениеПутиКДанным[0]) = "ОБЪЕКТ" Тогда
			ДобавляемаяСвязь = СвязьПараметровВыбораРеквизитОбъекта(ТекСтрокаДерева, ТекущаяСвязь,
				РазложениеПутиКДанным[1]);
		ИначеЕсли ЭтоТабличнаяЧасть(ПолеДляЭлементов) Тогда
			ДобавляемаяСвязь = СвязьПараметровВыбораСтрокаТаблицы(ТекущаяСвязь, ПолеДляЭлементов,
				РазложениеПутиКДанным, ДополнительныеПараметры);
		Иначе
			ДобавляемаяСвязь = ТекущаяСвязь;
		КонецЕсли;

		Если ДобавляемаяСвязь <> Неопределено Тогда
			НовыйСвязиПараметровВыбора.Добавить(ДобавляемаяСвязь);
		КонецЕсли;

	КонецЦикла;

	Возврат НовыйСвязиПараметровВыбора;

КонецФункции

Процедура УстановитьСпецифическиеСвойстваЭлементаТиповаяОперация(НовЭлемент, ТекСтрокаДерева)

	НовЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовЭлемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	НовЭлемент.КнопкаВыпадающегоСписка = Ложь;
	
	НовСвязиПараметровВыбора = НовЭлемент.СвязиПараметровВыбора;
	ИменаРеквизитовДляВыбораТиповойОперации = БухгалтерскиеОперацииПовтИспНаВремяСеанса
		.ИменаРеквизитовДляВыбораТиповойОперации(ТекСтрокаДерева.ПараметрыВыбора[0].Значение);
	
	Если ПолучитьФункциональнуюОпцию("ФормированиеПроводокПриПроведенииДокумента") Тогда
		
		Если ИменаРеквизитовДляВыбораТиповойОперации.Количество() > 0 Тогда
			НовСвязиПараметровВыбора = Новый Массив;
			Для каждого ТекущаяСвязьПараметровВыбора Из НовЭлемент.СвязиПараметровВыбора Цикл
			
				НовСвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора(ТекущаяСвязьПараметровВыбора.Имя,
					ТекущаяСвязьПараметровВыбора.ПутьКДанным,
					ТекущаяСвязьПараметровВыбора.ИзменениеЗначения));
			
			КонецЦикла;
			Для каждого ТекИмяРеквизита Из ИменаРеквизитовДляВыбораТиповойОперации Цикл
			
				НовСвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора(
					СтрШаблон("ПараметрыИспользования.%1", ТекИмяРеквизита),
					СтрШаблон("Объект.%1", ТекИмяРеквизита),
					РежимИзмененияСвязанногоЗначения.НеИзменять));
			
			КонецЦикла;
			
			НовСвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора(
				"ПараметрыИспользования.СлужебныйДляВыбораНаДату",
				"Объект.Дата",
				РежимИзмененияСвязанногоЗначения.НеИзменять));
			НовСвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора(
				"ПараметрыИспользования.СлужебныйДляВыбораОрганизация",
				"Объект.Организация",
				РежимИзмененияСвязанногоЗначения.НеИзменять));
			
			Попытка
				НовЭлемент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовСвязиПараметровВыбора);
			Исключение
				
				ИОМ = Неопределено;
				Для каждого ПараметрВыбора Из НовЭлемент.ПараметрыВыбора Цикл
				
					Если ВРЕГ(ПараметрВыбора.Имя) = ВРЕГ("Отбор.ИдентификаторДокумента") Тогда
						
						ИОМ = ПараметрВыбора.Значение;
						
					КонецЕсли;
				
				КонецЦикла;
				
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ОбщегоНазначения.СообщитьПользователю(СтрШаблон(
					НСтр("ru = 'Ошибка при установке условий использования типовой операции: %1. Подробности в журнале регистрации.'"),
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке)));
				ЗаписьЖурналаРегистрации("Форма. Установка условий использования типовой операции",
					УровеньЖурналаРегистрации.Ошибка,
					?(ИОМ = Неопределено, Неопределено, ИОМ.ЗначениеПустойСсылки.Метаданные()),
					,
					СтрШаблон(НСтр("ru = 'Ошибка при установке условий использования типовой операции: %1.
						|Необходимо проверить настройки условий использования у всех типовых операций для данного вида документа'"),
						ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)));
					
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция НайтиЭлементыФормыРеальнойТаблицы(Форма, ИмяТаблицы, ПредопределеннаяТЧ)

	НайденныеЭлементы = Новый Массив;

	Если ПредопределеннаяТЧ Тогда
		ИмяТЧ = ВРег("Объект." + ИмяТаблицы);
	Иначе
		ИмяТЧ = ВРег(ИмяТаблицы);
	КонецЕсли;
	
	Для каждого ТекЭлемент Из Форма.Элементы Цикл
	
		Если ТипЗнч(ТекЭлемент) = Тип("ТаблицаФормы")
			И ВРег(ТекЭлемент.ПутьКДанным) = ИмяТЧ Тогда
			НайденныеЭлементы.Добавить(ТекЭлемент);
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат НайденныеЭлементы;

КонецФункции

Процедура ДобавитьРасширеннуюПодсказкуЭлемента(Форма, Элемент, Подсказка)

	Элемент.РасширеннаяПодсказка.Заголовок = Подсказка;

КонецПроцедуры

Функция ВидПоляФормыПоСтроке(СтроковоеПредставление)

	Результат = ВидПоляФормы.ПолеВвода;
	Если СтроковоеПредставление = "ПолеФлажка" Тогда
		Результат = ВидПоляФормы.ПолеФлажка;
	КонецЕсли;
	Возврат Результат;

КонецФункции // ВидПоляФормыПоСтроке()

Функция ГруппировкаКолонокТаблицыПоСтроке(СтроковоеПредставление)
	Если СтроковоеПредставление = "Горизонтальная" Тогда
		Возврат ГруппировкаКолонок.Горизонтальная;
	ИначеЕсли СтроковоеПредставление = "ВЯчейке" Тогда
		Возврат ГруппировкаКолонок.ВЯчейке;
	Иначе
		Возврат ГруппировкаКолонок.Вертикальная;
	КонецЕсли;
Конецфункции

Функция СобытиеЖурналаРегистрацииОшибкаОтрисовкиФормДокументов()

	Возврат НСтр("ru = 'Типовые операции. Добавление элементов формы'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецФункции

#КонецОбласти


