
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщегоНазначения.РазделениеВключено()
		И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ФормаСправочникПоставляемыеТиповыеОперацииОбновитьДанныеСправочника",
			"Видимость", Ложь);
	КонецЕсли;
	
	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ФормаСправочникПоставляемыеТиповыеОперацииОбновитьДанныеСправочника",
			"Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
			"ФормаСправочникТиповыеОперацииОбновитьДанныеСправочника",
			"Видимость", Ложь);
	КонецЕсли;
	
	УстановитьВидимостьГруппыОбновлениеОпераций(ЭтотОбъект);
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненоОбновлениеТиповыхОпераций" Тогда
		УстановитьВидимостьГруппыОбновлениеОпераций(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Перем ТекущийИдентификаторДокумента;
	
	Если Копирование Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Для копирования типовой операции необходимо использовать кнопку ""Скопировать операцию""'"));
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("ИдентификаторДокумента") Тогда
		ТекущийИдентификаторДокумента = ТекущиеДанные.ИдентификаторДокумента;
		Отказ = Истина;
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ИдентификаторДокумента", ТекущийИдентификаторДокумента));
		ОткрытьФорму("Справочник.ТиповыеОперации.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьИмпортЭкспорт(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ПараметрыОбработки = Новый Структура;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыОбработки.Вставить("ТекущаяСтрокаПриОткрытии", ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ТекущиеДанные, "Ссылка"));
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ИмпортЭкспортТиповыхОперацийВФормате20.Форма", ПараметрыОбработки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоПравамДоступа(Команда)
	ОткрытьФорму("Отчет.НастройкаПравДоступаКТиповымОперациям.Форма");
КонецПроцедуры

&НаКлиенте
Процедура НастроитьЗначенияПоУмолчанию(Команда)
	ОткрытьФорму("Справочник.ТиповыеОперации.Форма.ФормаУстановкиЗначенийПоУмолчанию");
КонецПроцедуры

&НаКлиенте
Процедура СравнитьТиповыеОперации(Команда)
	ОткрытьФорму("Обработка.СравнениеТиповыхОпераций.Форма",,,Новый УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗаменаДопРеквизитов(Команда)
	ОткрытьФорму("Обработка.ЗаменаТиповыхОперацийДопРеквизитов.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура СравнитьВсеТиповыеОперации(Команда)
	ОткрытьФорму("Обработка.СравнениеТиповыхОпераций.Форма",
		Новый Структура("СравнитьВсеТиповыеОперации, ТолькоОтличия", Истина, Истина),,
		Новый УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьГруппыОбновлениеОпераций(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаВыполняютсяПроцедурыОбновленияТиповыхОпераций", "Видимость",
		БухгалтерскиеОперацииВызовСервера.ЗапущеноФоновоеОбновлениеТиповыхОпераций());

КонецПроцедуры

#КонецОбласти

#Область ПроцедурыПодсистемыИнформационныйЦентр

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

#КонецОбласти
