
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ВедетсяУчетПоПодразделениям = БухгалтерскийУчет.ВедетсяУчетПоПодразделениям(
		БухгалтерскийУчет.СписокСчетов("106.50"), БухгалтерскийУчет.СписокСчетов("106.56"));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подразделение",
		"АвтоОтметкаНезаполненного", ВедетсяУчетПоПодразделениям);
	
	ЗаполнитьТекстПроСчетФактуруСервер();
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Подразделение",
			"ОтметкаНезаполненного", ВедетсяУчетПоПодразделениям И НЕ ЗначениеЗаполнено(Объект.Подразделение));
		Объект.СуммаВключаетНДС = Истина;
		ПодготовитьФормуНаСервере();
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда
			Подписанты = Новый Структура;
			Подписанты.Вставить("Руководитель", ЗаполнениеРеквизитовОбъектов.СтруктураПодписанта("Руководитель"));
			ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписантов(Объект, Подписанты);
		КонецЕсли;    
		
		Если ЗначениеЗаполнено(Параметры.Основание) 
			И НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		КонецЕсли;	
	КонецЕсли;
	
	УчетНДС.УстановитьУсловноеОформлениеПолейНДСКРаспределению(УсловноеОформление, "КапВложения");
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтаФорма, Объект.Организация);
	// Конец Централизованная бухгалтерия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Заполнение группы информационных ссылок
	ИнформационныйЦентрСервер.ВывестиКонтекстныеСсылки(ЭтаФорма, Элементы.ИнформационныеСсылки);
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448();
	
	ВидимостьЭлементовЭДО = ЭлектронныеДокументыБГУ.ВидимостьЭлементовЭДО(Объект.Контрагент, Объект.Организация);
	ВидимостьЭлементовЭДОДляЭДПоставщика = ВидимостьЭлементовЭДОДляДокумента();
	
	ВидимостьЭлементовЭДОАкта448 = ВидимостьЭлементовЭДОАкта448();
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448);
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.ГруппаОтветственныйКомментарий);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
	ПервичныеДокументыБГУ.ПриСозданииНаСервере(ЭтотОбъект, Истина);

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)   
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ДатаПодписанияПервичногоДокумента = Объект.Дата;
	КонецЕсли;
	
	УстановитьДоступностьКомиссии();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами"
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
		
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьВидНФА();
	УстановитьЗаголовкиКолонокВсехСтрок();
	УстановитьЗаголовкиКолонокДрагМатериаловВсехСтрок();
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, ТекущийОбъект);
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	
	Оповестить("ДокументыПоУчетуОСИзменение");
	
	Оповестить("Запись_ПоступлениеОС", ПараметрыЗаписи, Объект.Ссылка);
	
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_СчетФактураПолученный" Тогда
		ЗаполнитьТекстПроСчетФактуруКлиент(Параметр, Источник);
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "ОбновитьСостояниеЭДАктов" Тогда
		ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КонтрольИсполненияДоговоров" Тогда
		Объект.ОтразитьВГрафикеИсполненияДоговора = ВыбранноеЗначение;
		КонтрольИсполненияДоговоровКлиент.УстановитьСтатусОтразитьДокументВГрафикеИсполнения(
			ЭтотОбъект, Объект.ОтразитьВГрафикеИсполненияДоговора);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.СведенияЭлектронногоАктаОПриемеПередачеНФА" Тогда
		ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ДобавлениеСпискаДМ.Форма.Форма" Тогда
		ОбработкаДобавленияДМДляОбъектаНаСервере(ВыбранноеЗначение, ЭтаФорма.ВариантВводаДанныхДМ);
		УстановитьВидимостьДанныхДрагМатериалов();
		УстановитьЗаголовкиКолонокДрагМатериаловВсехСтрок();	
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
	 	И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьРеквизитовОрганизации(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	УстановитьОтветственного();
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура СпособЗачетаАвансаПриИзменении(Элемент)
	
	УчетРасчетовКлиент.СпособЗачетаАвансаПриИзменении(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПервичногоДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
КонецПроцедуры

&НаКлиенте
Процедура НадписьВалютаНДСНажатие(Элемент, СтандартнаяОбработка)
	
	// Старые значения (до изменения) запомним в кэше в локальных параметрах.
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	
	БухгалтерскийУчетКлиент.ПоказатьФормуВыбораТипаЦеныВалютыНДС(ЭтотОбъект, СтандартнаяОбработка,
		Новый ОписаниеОповещения("ПослеЗакрытияВыбораТипаЦеныВалютыНДС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВыбораТипаЦеныВалютыНДС(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЭтотОбъект.КэшПараметров.ВалютаДокумента <> Объект.ВалютаДокумента Тогда
		БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	КонецЕсли;
	Если ЭтотОбъект.КэшПараметров.Локальные.СуммаВключаетНДС <> Объект.СуммаВключаетНДС Тогда
		ПересчитатьТабличнуюЧасть();
	КонецЕсли;
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	УстановитьОтветственного();
КонецПроцедуры

&НаКлиенте
Процедура НадписьСчетФакутраНажатие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтаФорма, СтандартнаяОбработка, "СчетФактураВыданный");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	ВведенНаОснованииЭДП = Ложь;
	ЭлектронныеДокументыБГУКлиент.ОткрытьДокументОснованиеПоСсылкеСостояниеЭДО(ЭтаФорма, Объект.Ссылка,
		СтандартнаяОбработка, ВведенНаОснованииЭДП, Объект.ДокументОснование);
		
	Если НЕ ВведенНаОснованииЭДП Тогда
		// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
		ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
		// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСостояниеЭДОАктыОПриемеПередачеНФАНажатие(Элемент)

	ЭлектронныеДокументыБГУКлиент.ОткрытьСостояниеЭДОАктамиОПриемеПередачеНФА(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗаполнитьПоДокументуОснованию(Объект.ДокументОснование);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеБиблиотечногоФондаПриИзменении(Элемент)
	УстановитьВидимостьЭлементовФормы(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйДокументПриИзменении(Элемент)
	ОбщегоНазначенияБГУКлиент.ПриИзмененииКлючевогоРеквизита(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияНаименованиеГТНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора",,Элемент);
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКапВложения

&НаКлиенте
Процедура КапВложенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И НЕ Копирование Тогда
		ТекущиеДанные = Элементы.КапВложения.ТекущиеДанные;
		
		КоличествоСтрок = Объект.КапВложения.Количество();
		Если КоличествоСтрок > 1 Тогда
			ПредыдущаяСтрока = Объект.КапВложения[КоличествоСтрок-2];
			ТекущиеДанные.СтавкаНДС = ПредыдущаяСтрока.СтавкаНДС;
			ТекущиеДанные.КПС       = ПредыдущаяСтрока.КПС;
			ТекущиеДанные.КФО       = ПредыдущаяСтрока.КФО;
		Иначе
			ТекущиеДанные.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
		КонецЕсли;
		
		УстановитьЗаголовкиКолонок(ТекущиеДанные);

		Если НЕ ТекущиеДанные.ОтразитьВКарточкеКапвложений Тогда
			ТекущиеДанные.ОтразитьВКарточкеКапвложений = Истина;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ТекущиеДанные = Элементы.КапВложения.ТекущиеДанные;
		ТекущиеДанные.ВнеоборотныйАктив = ВыбранноеЗначение.Ссылка;
		ТекущиеДанные.ВидНФА = ВыбранноеЗначение.ВидНФА;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.КапВложения.ТекущиеДанные;
	ТекущиеДанные.ВидНФА = ПолучитьДанныеОсновногоСредства(ТекущиеДанные.ВнеоборотныйАктив).ВидНФА;
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияКПСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.НачалоВыбораПолногоСчетаОбъектаОСВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияКПСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбораПолногоСчетаОбъектаОСВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияКФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.НачалоВыбораПолногоСчетаОбъектаОСВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияКФООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбораПолногоСчетаОбъектаОСВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияСчетУчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.НачалоВыбораПолногоСчетаОбъектаОСВТаблицеДокумента(ЭтотОбъект,
		Неопределено, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияСчетУчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ОбработкаВыбораПолногоСчетаОбъектаОСВТаблицеДокумента(
		ЭтотОбъект, Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияСуммаПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.КапВложения.ТекущиеДанные, Объект.СуммаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияСтавкаНДСПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.КапВложения.ТекущиеДанные, Объект.СуммаВключаетНДС, "СтавкаНДС");
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияСуммаНДСПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.КапВложения.ТекущиеДанные, Объект.СуммаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура КапВложенияВсегоПриИзменении(Элемент)
	РасчитатьСтроку(Элементы.КапВложения.ТекущиеДанные, Объект.СуммаВключаетНДС, "Всего");
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "СтраницаДополнительно" Тогда
		ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи();
	ИначеЕсли ТекущаяСтраница.Имя = "СтраницаДрагМатериалы" Тогда
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНФАДокументаОснования

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииСтроки(Элемент)
	
	Если (Элемент.ТекущиеДанные <> Неопределено) И (ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА) Тогда
		ПодключитьОбработчикОжидания("ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДрагоценныеМатериалы

&НаКлиенте
Процедура ДрагоценныеМатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанные = Элементы.ДрагоценныеМатериалы.ТекущиеДанные;
		
		УстановитьЗаголовкиКолонокДрагМатериалов(ТекущиеДанные);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДрагоценныеМатериалыОбъектМЦОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Если НЕ Элемент.ТекстРедактирования = Строка(ВыбранноеЗначение) Тогда
		
		ТекущиеДанные = Элементы.ДрагоценныеМатериалы.ТекущиеДанные;
		ТекущиеДанные.ОбъектМЦ = ВыбранноеЗначение;
		
		УстановитьЗаголовкиКолонокДрагМатериалов(ТекущиеДанные);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗачетАвансов

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗачетАвансовДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УчетРасчетовКлиент.ДокументАвансаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		ЭтаФорма, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставКомиссии

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	УстановитьДоступностьКомиссии();
	
	Если Не ЗначениеЗаполнено(Объект.Комиссия) Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = ОбщегоНазначенияБГУКлиент.СтруктураПараметровВыбораКомисии(ЭтотОбъект);
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Объект.Комиссия, ДопПараметры, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ОбработатьПодборКомиссии(ЭтотОбъект, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии1.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1СотрудникОбработкаВыбора(
	Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Элементы.СоставКомиссии1.ТекущиеДанные.Сотрудник Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссии1СотрудникПриИзменении(Элемент)                 
	УправлениеОсновнымиСредствамиКлиент.ЗаполнитьДанныеЧленаКомиссии(
		Элементы.СоставКомиссии1.ТекущиеДанные, Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПредседательОбработкаВыбора(
	Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	Если ВыбранноеЗначение = Объект.Председатель Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПредседательПриИзменении(Элемент)
	УправлениеОсновнымиСредствамиКлиент.ЗаполнитьДанныеЧленаКомиссии(
		Объект, Объект.Дата, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи

&НаКлиенте
Процедура ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Поле.Имя = "ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачиИмяФайла" Тогда
		УправлениеНФАКлиент.ОткрытьЭлектронныйДокументПриложенияИзФайла(
			ВыбраннаяСтрока, 
			ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи, 
			УникальныйИдентификатор);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередаче(Команда)
	ЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередачеНаСервере();
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Контрагент""'"),, "Объект.Контрагент");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Организация""'"),, "Объект.Организация");
		Возврат;
	КонецЕсли;

	ТекстВопроса = "";	
	Если Объект.ЗачетАвансов.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Табличная часть будет очищена.
		|'") ;
	КонецЕсли;
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = 'Проведение документа будет отменено.
		|'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		 ТекстВопроса = ТекстВопроса + НСтр("ru = 'Продолжить?'");
		 ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнениеТаблицыАвансыЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		 Возврат;
	КонецЕсли;	 

	ЗаполнитьАвансыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОтбораДМПоОбъекту(Команда)
	
	ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА = НЕ ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА;
	УстановитьВидимостьДанныхДрагМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСписокДМДляОбъекта(Команда)

	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект вложения!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
	Иначе
		Если Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Количество() = 1 Тогда
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМ(ЭтотОбъект, Объект,
				Элементы.СписокНФАДокументаОснования.ТекущиеДанные.ОсновноеСредство,
				ПредопределенноеЗначение("Справочник.ИнвентарныеНомераОС.ПустаяСсылка"),
				Элементы.СписокНФАДокументаОснования.ТекущиеДанные.Количество, "Изделия");
			
			ЭтотОбъект.ВариантВводаДанныхДМ = 1;  
		Иначе
			МассивВыделенныеСтроки = Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки;
			
			АдресТаблицыОбъектовНФА = ПоместитьТаблицуОбъектовНФАДляДМВХранилище(МассивВыделенныеСтроки);
			
			УчетДрагМатериаловКлиент.ОткрытьДобавлениеСпискомДМДляПеречняОбъектов(ЭтотОбъект, Объект,
				АдресТаблицыОбъектовНФА, "Изделия"); 
			
			ЭтотОбъект.ВариантВводаДанныхДМ = 2;
		КонецЕсли;	
			
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьОбъектыОдногоНФА(Команда)
	
	Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные = Неопределено Тогда
		ТекстОшибки = НСтр("ru='Не выбран объект НФА!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
			Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
	Иначе
		Если Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Количество() = 1 Тогда
			ТекущийЭлементСправочникаНФА = Элементы.СписокНФАДокументаОснования.ТекущиеДанные.ОсновноеСредство;
			
			Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Очистить();
			Для Каждого ТекСтрока Из ЭтотОбъект.ОбъектыНФАСДрагМатериалами Цикл
				Если ТекСтрока.ОсновноеСредство = ТекущийЭлементСправочникаНФА Тогда
					Элементы.СписокНФАДокументаОснования.ВыделенныеСтроки.Добавить(ТекСтрока.ПолучитьИдентификатор());
				КонецЕсли;
			КонецЦикла;
				
		Иначе
			ТекстОшибки = НСтр("ru='Следует выбрать один объект НФА!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,
				Объект.Ссылка, "СписокНФАДокументаОснования", "Объект");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСотрудников(Команда)
	
	ОбщегоНазначенияБГУКлиент.ОткрытьПодборКомиссии(Элементы.СоставКомиссии, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредседателяКомиссии(Команда)
	
	ИменаРеквизитов = ОбщегоНазначенияБГУКлиент.СтруктураИменРеквизитовВыбораПредседателяКомиссии(
		"ДолжностьПредседателяКомиссии", "ФамилияПредседателяКомиссии", "ИмяПредседателяКомиссии",
		"ОтчествоПредседателяКомиссии");
	ОбщегоНазначенияБГУКлиент.НачатьВыборПредседателяКомиссии(ЭтотОбъект, ИменаРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДопСведенияЭлектронногоАктаПоФорме0510448Нажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если Параметры.Ключ.Пустая() Тогда
		ТекстОшибки = НСтр("ru='Необходимо записать документ для заполнение сведений электронного акта о приеме-передаче НФА.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыДопСведений = НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
	
	ПараметрыДопСведений.Ссылка = Объект.Ссылка;
	ПараметрыДопСведений.ДатаСведений = Объект.Дата;
	ПараметрыДопСведений.Организация = Объект.Организация;
	
	ЭлектронныеДокументыБГУКлиент.ОткрытьФормуДопСведенийДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, Объект, ПараметрыДопСведений);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаИнформационнуюСсылку(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаИнформационнуюСсылку(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеНаСсылкуВсеИнформационныеСсылки(Элемент)
	
	ИнформационныйЦентрКлиент.НажатиеНаСсылкуВсеИнформационныеСсылки(ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

// КонтрольИсполненияДоговоров
&НаКлиенте
Процедура Подключаемый_КонтрольИсполненияДоговоровПоказатьСтатус(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДокументСсылка", Объект.Ссылка);
	ДопПараметры.Вставить("ОтразитьВГрафикеИсполнения", Объект.ОтразитьВГрафикеИсполненияДоговора);
	ДопПараметры.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	
	КонтрольИсполненияДоговоровКлиент.ПоказатьСтатусИсполнения(
		Объект.Организация, Объект.Контрагент, Объект.Договор, ДопПараметры, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры
// Конец КонтрольИсполненияДоговоров

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ЗаполнитьДО(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Контрагент""'"),, "Объект.Контрагент");
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не заполнено обязательное поле ""Организация""'"),, "Объект.Организация");
		Возврат;
	КонецЕсли;
	
	Если Объект.Проведен Тогда
		
		ТекстВопроса = НСтр("ru = 'Перед заполнением денежных обязательств проведение документа будет отменено.
			|Продолжить?'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОтменитьПроведениеПередЗаполнениемДО", ЭтотОбъект),
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура ЗаполнитьРеквизитыКапВложения(Команда)
	Реквизиты = Новый Структура;
	Реквизиты.Вставить("СчетУчета", Новый Структура);
	Реквизиты.СчетУчета.Вставить("Счета", "106.50, 106.90");
	Реквизиты.СчетУчета.Вставить("ВИерархии", Истина);
	Реквизиты.СчетУчета.Вставить("Дата", Объект.Дата);

	Реквизиты.Вставить("КФО");
	
	Реквизиты.Вставить("КПС", Новый Структура);
	Реквизиты.КПС.Вставить("НаДату", Объект.Дата);
	Реквизиты.КПС.Вставить("Организация", Объект.Организация);
	Реквизиты.КПС.Вставить("ИФО", Объект.ИФО);
	
	ВидыПоказателей = Новый Массив;
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.Произвольный"));
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
	ВидыПоказателей.Добавить(ПредопределенноеЗначение("Перечисление.ВидыКБК.АУИБУ"));
	Реквизиты.КПС.Вставить("ВидПоказателя", ВидыПоказателей);
	
	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект, 
	"ПоступлениеОСИК", "КапВложения", "КапВложения", Реквизиты);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьКомиссии()
	
	ЕстьКомиссия = ЗначениеЗаполнено(Объект.Комиссия);
	
	Элементы.ГруппаПриказОНазначенииКомиссии.ТолькоПросмотр = ЕстьКомиссия;
	//Элементы.ГруппаПредседательКомиссии.ТолькоПросмотр = ЕстьКомиссия;
	Элементы.Председатель.Видимость = ЕстьКомиссия;
	Элементы.ВыбратьПредседателяКомиссии.Видимость = Не ЕстьКомиссия;
	Элементы.СоставКомиссии.Видимость = Не ЕстьКомиссия;
	Элементы.СоставКомиссии1.Видимость = ЕстьКомиссия;
	
КонецПроцедуры

// Обработчик выбора строки постоянно действующией комиссии. см.ОбщегоНазначенияБГУКлиент.НачатьВыборПостоянноДействующейКомиссии.
// "Объект" передается явно, без этого данные объекта не заполняются в web-клиенте.
&НаКлиенте
Процедура УстановитьКомиссиюВДокумент(Результат, ДопПараметры) Экспорт
	ОбщегоНазначенияБГУКлиент.УстановитьКомиссиюВДокумент(Результат, ДопПараметры, Объект)	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.КапВложенияСчетАмортизации.Имя);
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.КапВложенияСуммаАмортизации.Имя);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.КапВложения.ВидНФА", ВидСравненияКомпоновкиДанных.Равно, Перечисления.ВидыНФА.НПА);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<Для НПА не используется>");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Лево);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.КапВложенияЗаголовокВидГТ.Имя);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "Вид документа:");

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОбщийМодульСКД.ДобавитьОформляемоеПоле(ЭлементУО.Поля, Элементы.КапВложенияЗаголовокНомерДатаГТ.Имя);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "номер / дата / срок действия:");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ВестиУчетДрагМатериаловВМЦКапвложений = УчетДрагМатериалов.ПолучитьКонстантуВестиУчетДрагМатериаловВМЦКапвложений() 
		ИЛИ Объект.ДрагоценныеМатериалы.Количество() > 0;
		
	УстановитьЗаголовкиКолонокДрагМатериаловВсехСтрок();
	
	ЗаполнитьВидНФА();
	
	УстановитьДоступностьРеквизитовОрганизации(ЭтотОбъект);
	УстановитьДоступностьДоговора(ЭтотОбъект);
	
	УстановитьПредставлениеСтрокиЦенаНДСВалюта(ЭтотОбъект);
	
	УчетРасчетовКлиентСервер.УправлениеЭлементамиЗачетаАвансов(ЭтаФорма);
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	УстановитьЗаголовкиКолонокВсехСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеТаблицыАвансыЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАвансыНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт

	ДопустимыеВидыНФА = Новый Массив;
	ДопустимыеВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.ОС"));
	ДопустимыеВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.НМА"));
	ДопустимыеВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.НПА"));
	ДопустимыеВидыНФА.Добавить(ПредопределенноеЗначение("Перечисление.ВидыНФА.КапВложения"));
	
	ПараметрыПодбора.Отбор.Вставить("Организация"	, Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ВидНФА"		, ДопустимыеВидыНФА);
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения"	, "ПринятиеКУчетуВложения");
	ПараметрыПодбора.Вставить("КолонкиКорзины"	, Новый Структура("ОсновноеСредство", "ВнеоборотныйАктив"));
	
	Если Объект.КапВложения.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ОбработкаВыбораПодбораОССервер(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()

	ТаблицаОС = Объект.КапВложения.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);

КонецФункции

&НаСервере
Процедура ОбработкаВыбораПодбораОССервер(Знач ВыбранноеЗначение)
	
	ТаблицаОС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресОСВХранилище);
	ИсходныеДанные = Объект.КапВложения.Выгрузить();
	ИсходныеДанные.Индексы.Добавить("ВнеоборотныйАктив");
	
	Объект.КапВложения.Очистить();
	Для Каждого СтрокаТаблицыОС Из ТаблицаОС Цикл
		ЭлементКоллекции = Объект.КапВложения.Добавить();
		СтрокаИсходныхДанных = ИсходныеДанные.Найти(СтрокаТаблицыОС.ВнеоборотныйАктив,"ВнеоборотныйАктив");
		Если СтрокаИсходныхДанных <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭлементКоллекции, СтрокаИсходныхДанных);
		КонецЕсли;
			
		ЗаполнитьЗначенияСвойств(ЭлементКоллекции, СтрокаТаблицыОС);
		РасчитатьСтроку(ЭлементКоллекции, Объект.СуммаВключаетНДС, "Сумма");
		УстановитьЗаголовкиКолонок(ЭлементКоллекции);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьРеквизитовОрганизации(Форма)

	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("Подразделение");
	ИменаЭлементов.Добавить("ЛицевойСчет");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементов,
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация));

КонецПроцедуры // УстановитьДоступностьРеквизитовОрганизации()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьДоговора(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "Договор",
		"Доступность", ЗначениеЗаполнено(Форма.Объект.Организация) И ЗначениеЗаполнено(Форма.Объект.Контрагент));

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОсновногоСредства(ОсновноеСредство)

	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновноеСредство, "ВидНФА");

КонецФункции // ПолучитьДанныеОсновногоСредства()

&НаСервере
Процедура ЗаполнитьВидНФА()

	ЗначенияСвойств = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
		Объект.КапВложения.Выгрузить(,"ВнеоборотныйАктив").ВыгрузитьКолонку("ВнеоборотныйАктив"), "ВидНФА");
	Для каждого ТекСтр Из Объект.Капвложения Цикл
		
		ТекКапВложение = ЗначенияСвойств[ТекСтр.ВнеоборотныйАктив];
		Если ТекКапВложение <> Неопределено Тогда
			ТекСтр.ВидНФА =  ТекКапВложение.ВидНФА;
		КонецЕсли;
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьВидНФА()

&НаКлиенте
Процедура ЗаполнитьТекстПроСчетФактуруКлиент(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения)
	
	Перем ЗначениеСвойства;
	
	ЭтотДокументЯвляетсяОснованием = (ТипЗнч(ПараметрОбработкиОповещения) = Тип("Структура")
		И ПараметрОбработкиОповещения.Свойство("ДокументыОснования", ЗначениеСвойства)
		И ЗначениеСвойства.Найти(Объект.Ссылка) <> Неопределено);
	
	Если ЭтотДокументЯвляетсяОснованием Тогда
		ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения = Неопределено, ИсточникОбработкиОповещения = Неопределено)
	
	УчетНДС.ЗаполнитьТекстПроСчетФактуру(ЭтаФорма, ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвансыНаСервере()
	
	Отказ = Ложь;
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ПоВсемКФО", Истина);
	ПараметрыЗаполнения.Вставить("ПоВсемКПС", Истина);
	
	Если ЭтаФорма.Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПараметрыЗаполнения.Вставить("ПериодОстатков",
			Новый Граница(КонецДня(ДокументОбъект.Дата), ВидГраницы.Включая) );
	Иначе
		ПараметрыЗаполнения.Вставить("ПериодОстатков",
			Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая) );
	КонецЕсли;
	
	ДокументОбъект.ЗаполнитьПоОстаткамАвансов(ПараметрыЗаполнения, Отказ);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	Если НЕ Отказ Тогда
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОтменитьПроведениеПередЗаполнениемДО(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДОНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДОНаСервере()
	
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ЭтотОбъект.Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ПериодОстатков = Новый Граница(КонецДня(ДокументОбъект.Дата), ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ДокументОбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	ТаблицаОбязательств = УчетРасчетов.ДенежныеОбязательстваПоПоступлениюТРУ(ДокументОбъект, ПериодОстатков);
	
	Объект.ДенежныеОбязательства.Загрузить(ТаблицаОбязательств);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТабличнуюЧасть()
	Для Каждого СтрокаТЧ из Объект.КапВложения Цикл
		РасчитатьСтроку(СтрокаТЧ, Объект.СуммаВключаетНДС, "Сумма");
	КонецЦикла;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РасчитатьСтроку(СтрокаТЧ, СуммаВключаетНДС, ИмяРеквизита)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", СуммаВключаетНДС);
	УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(СтрокаТЧ, ИмяРеквизита, ПараметрыРасчета);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеСтрокиЦенаНДСВалюта(Форма)

	Объект = Форма.Объект;
	
	ПараметрыПредставления = Новый Структура("ВалютаДокумента, ПринятьНДСКВычету, СуммаВключаетНДС");
	ЗаполнитьЗначенияСвойств(ПараметрыПредставления, Объект);
	ПараметрыПредставления.Вставить("ПоказыватьНДС", Истина);
	ПараметрыПредставления.Вставить("ПоказыватьВалюту", Форма.КэшПараметров.ИспользоватьВалютныйУчет);
	
	Форма.НадписьВалютаНДС = БухгалтерскийУчетКлиентСервер.ПредставлениеСтрокиЦенаНДСВалюта(
		ПараметрыПредставления);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиКолонок(ТекущаяСтрока)

	ТекущаяСтрока.ТекстСчетАмортизации = НСтр("ru = 'Счет:'");
	ТекущаяСтрока.ТекстСуммаАмортизации = НСтр("ru ='Сумма:'");

КонецПроцедуры // УстановитьЗаголовкиКолонок()

&НаСервере
Процедура УстановитьЗаголовкиКолонокВсехСтрок()

	Для каждого ТекущаяСтрока Из Объект.КапВложения Цикл
	
		УстановитьЗаголовкиКолонок(ТекущаяСтрока);
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтветственного()
	
	Объект.ОтветственныйИсполнитель = ЗаполнениеРеквизитовОбъектов.ПолучитьОтветственногоИсполнителя(
		Объект.Ответственный, Объект.Организация, "Документ.ПоступлениеОСИК");
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ВидимостьЭлементовЭДОДляДокумента()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ВидимостьЭлементовЭДОАкта448()
	Результат = Ложь;
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма, ВидимостьЭлементовЭДО, ВидимостьЭлементовЭДОДляЭДПоставщика, ВидимостьЭлементовЭДОАкта448)
	Объект = Форма.Объект;
	
	Если ВидимостьЭлементовЭДОДляЭДПоставщика Тогда
		ВидимостьЭлементовЭДО = Истина;
		Форма.Элементы.ДекорацияСостояниеЭДО.Заголовок = НСтр("ru='Отражение ЭД в учете'");
	Конецесли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО И НЕ Объект.НФАПереданыЭлектроннымАктом);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"НадписьДопСведенияЭлектронногоАктаПоФорме0510448", "Видимость", ВидимостьЭлементовЭДОАкта448);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи", "Видимость", ВидимостьЭлементовЭДОАкта448);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"КапВложенияЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередаче", "Видимость", ВидимостьЭлементовЭДОАкта448);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоДокументуОснованию(ДокументОснование)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
		
		Если (Объект.КапВложения.Количество() > 0) Тогда
			Возврат;
		КонецЕсли;	
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		ДокументОбъект.ЗаполнитьПоЭлектронномуДокументуПоставщика(ДокументОснование);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПоДокументуОснованию()

&НаСервере
Процедура ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений = "")
	ЭлектронныеДокументыБГУ.ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ЭтотОбъект, ТекстСведений);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСведенийЭлектронногоАктаОПриемеПередаче(ДанныеДляАкта)
	КоличествоФайлов = ДанныеДляАкта.КоличествоФайлов;
	
	ТекстСведений = ЭлектронныеДокументыБГУКлиент.ТекстПриложеноФайлов(КоличествоФайлов);

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоАктаПоФорме0510448(ТекстСведений);
КонецПроцедуры	

&НаСервере
Функция НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448()
	Возврат ЭлектронныеДокументыБГУ.НовыеПараметрыДополнительныхСведенийЭлектронногоАктаПоФорме0510448();
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовФормы(Форма)
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;             

	ТекЭлементы = Новый Массив;
	ТекЭлементы.Добавить("КапВложенияКоличество");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ТекЭлементы,
		"Видимость", НЕ Объект.ПоступлениеБиблиотечногоФонда);       
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "СтраницаДрагМатериалы", "Видимость", Форма.ВестиУчетДрагМатериаловВМЦКапвложений);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияПоЭлектронномуАктуОПриемеПередачеНаСервере()
	
	ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя = 
		ДанныеЭлектронногоАктаОПриемеПередачеНФАПоНоменклатуреОтправителя(Объект.Организация, Объект.ДокументОснование);
		
	СведенияПТС = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[1].Выгрузить();
	СведенияКадастровогоУчета = ДанныеЭлектронногоАктаОПриемеПередачеНФАПоИнвентарнымНомерамОтправителя[2].Выгрузить();
		
	Для Каждого ТекСтрока Из Объект.КапВложения Цикл
		ТекНФА = ТекСтрока.ВнеоборотныйАктив;
		НовыйИнвНомерСсылка = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();

		Реквизиты = "GUIDНоменклатурыОтправителя";
		ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекНФА, Реквизиты);
		GUIDНоменклатурыОтправителя = ЗначенияРеквизитовНоменклатуры.GUIDНоменклатурыОтправителя;
		
		ПараметрыОтбораИнвНомера = Новый Структура;
		ПараметрыОтбораИнвНомера.Вставить("GUIDНоменклатурыУОтправителя", GUIDНоменклатурыОтправителя);
		
		//Заполнение сведений ПТС
		НайденныеСтрокиИнвНомераПТС = СведенияПТС.НайтиСтроки(ПараметрыОтбораИнвНомера);
		Для Каждого ТекДанныеПТС Из НайденныеСтрокиИнвНомераПТС Цикл
			НаборЗаписей = РегистрыСведений.ПаспортаТранспортныхСредств.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
			НаборЗаписей.Отбор.ОсновноеСредство.Установить(ТекНФА);
			НаборЗаписей.Отбор.ИнвентарныйНомер.Установить(НовыйИнвНомерСсылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = РегистрыСведений.ПаспортаТранспортныхСредств.СоздатьМенеджерЗаписи();
				НоваяЗапись.Организация = Объект.Организация;
				НоваяЗапись.ОсновноеСредство = ТекНФА;
				НоваяЗапись.ИнвентарныйНомер = НовыйИнвНомерСсылка;
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекДанныеПТС);
				НоваяЗапись.ДвигательМодель = ТекДанныеПТС.МодельДвигателя;
				НоваяЗапись.ДвигательНомер = ТекДанныеПТС.НомерДвигателя;
				НоваяЗапись.Период = '19800101';
				НоваяЗапись.Записать(Ложь);
			КонецЕсли;	
		КонецЦикла;

		//Заполнение сведений кадастрового учета
		НайденныеСтрокиИнвНомераКадастра = СведенияКадастровогоУчета.НайтиСтроки(ПараметрыОтбораИнвНомера);
		Для Каждого ТекДанныеКадастра Из НайденныеСтрокиИнвНомераКадастра Цикл
			НаборЗаписей = РегистрыСведений.СведенияКадастровогоУчета.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
			НаборЗаписей.Отбор.ОсновноеСредство.Установить(ТекНФА);
			НаборЗаписей.Отбор.ИнвентарныйНомер.Установить(НовыйИнвНомерСсылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				НоваяЗапись = РегистрыСведений.СведенияКадастровогоУчета.СоздатьМенеджерЗаписи();
				НоваяЗапись.Организация = Объект.Организация;
				НоваяЗапись.ОсновноеСредство = ТекНФА;
				НоваяЗапись.ИнвентарныйНомер = НовыйИнвНомерСсылка;
				
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекДанныеКадастра);
				НоваяЗапись.КадастровыйНомерЗемлиНедвижимости = ТекДанныеКадастра.КадастровыйНомерЗемли;
				НоваяЗапись.Период = '19800101';
				НоваяЗапись.Записать(Ложь);
			КонецЕсли;	
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ДанныеЭлектронногоАктаОПриемеПередачеНФАПоНоменклатуреОтправителя(Организация, ЭлектронныйАктОПриемеПередаче)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.КодВидаДрагоценногоМатериала КАК КодВидаДрагоценногоМатериала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ПолноеНаимВидаДрагоценногоМатериала КАК ПолноеНаимВидаДрагоценногоМатериала,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ЕдИзмКод КАК ЕдИзмКод,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.ЕдИзмНаим КАК ЕдИзмНаим,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.МассаДМ КАК МассаДМ,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.КоличествоДМ КАК КоличествоДМ
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияОСодержанииДрагМатериалов КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияОСодержанииДрагМатериалов.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.СерияНомер КАК СерияНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ИдентификационныйНомер КАК ИдентификационныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Марка КАК Марка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Модель КАК Модель,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Тип КАК Тип,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.МодельДвигателя КАК МодельДвигателя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерДвигателя КАК НомерДвигателя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерШасси КАК НомерШасси,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.НомерКузова КАК НомерКузова,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ЭкологическийКласс КАК ЭкологическийКласс,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Масса КАК Масса,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.ГаражныйНомер КАК ГаражныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Грузоподъемность КАК Грузоподъемность,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Колонна КАК Колонна,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.РегистрационныйЗнак КАК РегистрационныйЗнак
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияПаспортаТранспортногоСредства КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияПаспортаТранспортногоСредства.Ссылка = &ЭлектронныйАктОПриемеПередаче
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.Ссылка КАК Ссылка,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.НомерСтроки КАК НомерСтроки,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.НаименованиеНФА КАК НаименованиеНФА,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.GUIDНоменклатурыУОтправителя КАК GUIDНоменклатурыУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ИнвентарныйНомерУОтправителя КАК ИнвентарныйНомерУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.GUIDИнвентарногоНомераУОтправителя КАК GUIDИнвентарногоНомераУОтправителя,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастроваяСтоимость КАК КадастроваяСтоимость,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомер КАК КадастровыйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомерЗемли КАК КадастровыйНомерЗемли,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КадастровыйНомерЗдания КАК КадастровыйНомерЗдания,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.УсловныйНомер КАК УсловныйНомер,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.КоличествоЭтажей КАК КоличествоЭтажей,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ОбщаяПлощадь КАК ОбщаяПлощадь,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ОбщийОбъем КАК ОбщийОбъем,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ПодземныйОбъем КАК ПодземныйОбъем,
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.ЭтоПомещение КАК ЭтоПомещение
	               |ИЗ
	               |	Документ.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий.СведенияКадастровогоУчета КАК ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета
	               |ГДЕ
	               |	ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящийСведенияКадастровогоУчета.Ссылка = &ЭлектронныйАктОПриемеПередаче";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЭлектронныйАктОПриемеПередаче", ЭлектронныйАктОПриемеПередаче);

	Возврат Запрос.ВыполнитьПакет();

КонецФункции

&НаСервере
Процедура ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи()

	УправлениеНФА.ЗаполнитьСписокФайловВходящегоАктаПриемаПередачи(Объект, ФайлыПриложенийВходящегоЭлектронногоАктаПриемаПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаКлиенте()
	ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЭДОАктаПоФорме0510448НаСервере()
	ЭлектронныеДокументыБГУ.ЗаполнитьСостояниеЭДОАктаПоФорме0510448(Объект.Ссылка, Элементы.ДекорацияСостояниеЭДОАкты);
	Если Элементы.ДекорацияСостояниеЭДОАкты.Заголовок = "Не начат" Тогда
		ВидимостьЭДОАктами = Ложь;
	Иначе		
		ВидимостьЭДОАктами = Истина;
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаСостояниеЭДОБГУ", "Видимость", ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияЭДОУПД", "Видимость", НЕ ВидимостьЭДОАктами);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ДекорацияСостояниеЭДО", "Видимость", НЕ ВидимостьЭДОАктами);

КонецПроцедуры

// УчетДрагМатериалов
&НаКлиенте
Процедура ПослеЗакрытияВопросаОДрагМатериалах(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.НайденныеСтроки Цикл
		Объект.ДрагоценныеМатериалы.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаДобавленияДМДляОбъектаНаСервере(Знач ВыбранноеЗначение, ВариантВводаДанныхДМ = 1)
	
	Если ВариантВводаДанныхДМ = 2 Тогда
		ДобавленныеСтроки = УчетДрагМатериалов.ОбработатьДобавлениеДМДляОбъектов(
			Объект.ДрагоценныеМатериалы, ВыбранноеЗначение, , "ОбъектНФА,ОбъектМЦ,ВидДрагМатериала");
	Иначе
		ДобавленныеСтроки = УчетДрагМатериалов.ОбработатьДобавлениеДМДляОбъекта(
			Объект.ДрагоценныеМатериалы, ВыбранноеЗначение, , "ОбъектНФА,ОбъектМЦ,ВидДрагМатериала");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитовДМ() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыДобавленияДМ(ПараметрыПодбора) Экспорт
	
	Если (Объект.ДрагоценныеМатериалы.Количество() > 0) И (ПараметрыПодбора.ВариантВводаДанных < 2) Тогда
		ПараметрыПодбора.Вставить("АдресДМВХранилище", ПоместитьДМВХранилище(ПараметрыПодбора));
	Иначе
		ПараметрыПодбора.Вставить("АдресДМВХранилище", "");
	КонецЕсли;
	ПараметрыПодбора.Вставить("ЭтоКапвложение", Истина);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДМВХранилище(ПараметрыПодбора)
	
	МассивСтрок = ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора);
	
	ТаблицаНФА = Объект.ДрагоценныеМатериалы.Выгрузить(МассивСтрок,
		"ОбъектНФА, ОбъектМЦ, КоличествоМЦ, ВидДрагМатериала, МассаДМ, КоличествоДМ, ЕдИзм");
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНФА);
	
КонецФункции

&НаСервере
Функция ПолучитьСписокДМОбъектаНФА(ПараметрыПодбора)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ОбъектНФА", ПараметрыПодбора.ОбъектНФА);
	НайденныеСтроки = Объект.ДрагоценныеМатериалы.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеСтроки;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиКолонокДрагМатериалов(ТекущаяСтрока)

	ТекущаяСтрока.МатериальнаяЦенностьЗаголовок = НСтр("ru = 'Материальная ценность:'");
	ТекущаяСтрока.КоличествоМЦЗаголовок 		= НСтр("ru ='Количество:'");  
	
	ЕдиницаИзм = ПолучитьЕдиницуИзмеренияМатериальнойЦенности(ТекущаяСтрока.ОбъектМЦ); 
			
	ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзм; 
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияМатериальнойЦенности(Знач ОбъектМЦ)
	
	Если ТипЗнч(ОбъектМЦ) = Тип("СправочникСсылка.ОсновныеСредства") ИЛИ Не ЗначениеЗаполнено(ОбъектМЦ) Тогда 
		ЕдиницаИзм = УчетДрагМатериалов.Штуки();
	Иначе
		Если ЗначениеЗаполнено(ОбъектМЦ.ЕдиницаИзмерения) Тогда
			ЕдиницаИзм = ОбъектМЦ.ЕдиницаИзмерения; 
		Иначе
			ЕдиницаИзм = УчетДрагМатериалов.Штуки(); 
		КонецЕсли;
	КонецЕсли;
	Возврат ЕдиницаИзм;

КонецФункции 

&НаСервере
Процедура УстановитьЗаголовкиКолонокДрагМатериаловВсехСтрок()

	Для Каждого ТекущаяСтрока Из Объект.ДрагоценныеМатериалы Цикл
	
		УстановитьЗаголовкиКолонокДрагМатериалов(ТекущаяСтрока);
	
	КонецЦикла;

КонецПроцедуры

 &НаКлиенте
Процедура ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	
	Для Каждого ТекСтрока Из Объект.ДрагоценныеМатериалы Цикл
		ТекСтрока.КлючСтроки = УчетДрагМатериаловКлиент.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА,"");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючиСтрокДрагМатериалов()
	
	Если ЭтаФорма.ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыСДрагМатериалами()
	
	ТаблицаВсехОбъектов = Объект.КапВложения.Выгрузить(,
		"СчетУчета, ВнеоборотныйАктив, Количество");
	
	ТаблицаОбъектовОС = Новый ТаблицаЗначений;
	ТаблицаОбъектовОС.Колонки.Добавить("КлючСтроки",Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовОС.Колонки.Добавить("ОсновноеСредство",Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаОбъектовОС.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТаблицаОбъектовОС.Колонки.Добавить("ИнвентарныйНомер",Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	
	МассивСчетовОС = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляКапвложенийСМЦ();
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		Если МассивСчетовОС.Найти(ТекСтрока.СчетУчета)<>Неопределено 
					И ТекСтрока.ВнеоборотныйАктив.ВидНФа = Перечисления.ВидыНФА.КапВложения Тогда
			НоваяСтрока = ТаблицаОбъектовОС.Добавить();
			НоваяСтрока.ОсновноеСредство = ТекСтрока.ВнеоборотныйАктив;
			НоваяСтрока.Количество = ТекСтрока.Количество;
			НоваяСтрока.КлючСтроки = УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.ВнеоборотныйАктив, ""); 
		КонецЕсли;
	КонецЦикла;
	
	ОбъектыНФАСДрагМатериалами.Загрузить(ТаблицаОбъектовОС);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхДрагМатериалов()
	Если ЭтотОбъект.ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Истина;
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
		
		Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные <> Неопределено Тогда
			ОтборДрагМатериаловДляОбъекта(Элементы.СписокНФАДокументаОснования.ТекущиеДанные.КлючСтроки);
		КонецЕсли;
	Иначе
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Ложь;
		Элементы.ДрагоценныеМатериалы.ОтборСтрок = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборДрагМатериаловДляОбъекта(КлючСтроки)
	
	Элементы.ДрагоценныеМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки",КлючСтроки));
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ);
	ТаблицаДМ = ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтрокиТЧ); 
	
	Массив = Новый Массив;
	Массив.Добавить(ТаблицаНФА);
	Массив.Добавить(ТаблицаДМ);
	
	Возврат ПоместитьВоВременноеХранилище(Массив);
	
КонецФункции

&НаСервере
Функция ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтрокиТЧ)
	
	ТаблицаНФА = Новый ТаблицаЗначений;
	ТаблицаНФА.Колонки.Добавить("ОбъектНФА", Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаНФА.Колонки.Добавить("ИнвНомер", Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаНФА.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого ИдСтроки Из ВыделенныеСтрокиТЧ Цикл
		СтрокаТЧ = ЭтотОбъект.ОбъектыНФАСДрагМатериалами.НайтиПоИдентификатору(ИдСтроки);
		НоваяСтрока = ТаблицаНФА.Добавить();
		НоваяСтрока.ОбъектНФА = СтрокаТЧ.ОсновноеСредство;
		НоваяСтрока.ИнвНомер = Справочники.ИнвентарныеНомераОС.ПустаяСсылка();
		НоваяСтрока.Количество = СтрокаТЧ.Количество;
	КонецЦикла;
	
	Возврат ТаблицаНФА;
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеОДрагМатериалах(ВыделенныеСтроки) 
	
	ВыбранныеНФА = ТаблицаОбъектовНФАДляДМВХранилище(ВыделенныеСтроки);
	
	ТаблицаДМ = Объект.ДрагоценныеМатериалы.Выгрузить();
	
	Результат = УчетДрагМатериалов.ЕдиныйСписокДрагМатериаловДляНесколькихОбъектовВложений(ТаблицаДМ, ВыбранныеНФА);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА()
	
	Элемент = Элементы.СписокНФАДокументаОснования;
	ОтборДрагМатериаловДляОбъекта(Элемент.ТекущиеДанные.КлючСтроки);
	
КонецПроцедуры

// Конец УчетДрагМатериалов

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры

// Конец ИнтеграцияС1САрхивом

#КонецОбласти
