
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ,
													 СтандартнаяОбработка, 
													 Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(),-1));
	
		ЗаполнитьДанныеСчетов();
		УстановитьПризнакНаправленияДеятельностиПодразделения();
	КонецЕсли;
	
	УстановитьВидимостьНаправленияДеятельностиПодразделения();
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма,
												   ТекущийОбъект, 
												   Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ЗаполнитьДанныеСчетов();
	
	ЗаполнитьТаблицуОбщихРасходов();
	УстановитьПризнакНаправленияДеятельностиПодразделения();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьОбщиеЗатратыВДокумент(ТекущийОбъект);	
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

    // Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьТаблицуОбщихРасходов();
	УстановитьПризнакНаправленияДеятельностиПодразделения();
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		// Предложим воспользоваться новым документом.
		ТекстВопроса = НСтр("ru = 'ВНИМАНИЕ! Документ ""Распределение общих производственных затрат"" устарел.
			|Для распределения накладных (109.70) и/или общехозяйственных расходов (109.80) на себестоимость продукции, услуг
			|следует использовать документ ""Закрытие счетов производственных затрат"".
			|Перейти к документу ""Закрытие счетов производственных затрат""?'");
		Оповещение = Новый ОписаниеОповещения("ВопросПерейтиКЗакрытиюСчетовПроизводственныхЗатратЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	КонецЕсли;
	
	УстановитьПредставлениеПериода();
	УстановитьОтборПрямыхРасходов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВидОбщихЗатратОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ОбщиеРасходы.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстВопроса = НСтр("ru = 'При изменении вида общих затрат табличные части документа будут очищены.
							|Изменить вид общих затрат и очистить табличные части?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Изменить вид общих затрат и очистить табличные части'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Не изменять вид общих затрат'"));
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ВидОбщихЗатратОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение)), ТекстВопроса, Кнопки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбщихЗатратОбработкаВыбораЗавершение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ВидОбщихЗатрат = ДопПараметры.ВыбранноеЗначение;
		ОбщиеРасходы.Очистить();
		Объект.ПрямыеРасходы.Очистить();
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ТекстПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.Дата = КонецМесяца(ДобавитьМесяц(Объект.Дата, Направление));
	УстановитьПредставлениеПериода();
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

/////////////////////////////////////////////////////////////////////////////////////////
//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

    БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

//               ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТИПОВЫХ ОПЕРАЦИЙ                       //
/////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ОБЩИЕРАСХОДЫ

&НаКлиенте
Процедура ОбщиеРасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
		ТекущиеДанные.ИдСтроки = Новый УникальныйИдентификатор;
		ТекущийСписок = СписокСчетовОбщихЗатрат();
		Если ТекущийСписок.Количество() = 1 Тогда
			ТекущиеДанные.Счет = ТекущийСписок[0].Значение;
			УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке(ТекущиеДанные, ДанныеСчетов);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если НеЗаполненВидОбщихЗатрат() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыСчетПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
	УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке(ТекущиеДанные, ДанныеСчетов);
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.Счет, 
																			ТекущиеДанные.КПС, 
																			Объект.КФО), 
															Объект.Организация,
															Объект.ИФО,
															СписокСчетовОбщихЗатрат(),
															Объект.КФО,
															,
															Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПС,
															,
															ТекущиеДанные.КЭК,);
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыСчетАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Ссылка, ЭлементГруппа", СписокСчетовОбщихЗатрат(), Ложь);
		ПараметрыВыбораЗначения = Новый Структура("СтрокаПоиска, Отбор", Текст, Отбор);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), ПараметрыВыбораЗначения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыСчетОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Ссылка, ЭлементГруппа", СписокСчетовОбщихЗатрат(), Ложь);
		ПараметрыВыбораЗначения = Новый Структура("СтрокаПоиска, Отбор", Текст, Отбор);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), ПараметрыВыбораЗначения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыКЭКНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекущиеДанные.КЭК,
								Объект.Организация, 
								Объект.ИФО,
								Объект.КФО, 
                                ТекущиеДанные.Счет,
								Объект.Дата,
								"Дт");
КонецПроцедуры

&НаКлиенте
Процедура ОбщиеРасходыПриАктивизацииСтроки(Элемент)
	УстановитьОтборПрямыхРасходов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ПРЯМЫЕРАСХОДЫ

&НаКлиенте
Процедура ПрямыеРасходыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если НеЗаполненВидОбщихЗатрат() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	СтрокаОбщихРасходов = Элементы.ОбщиеРасходы.ТекущиеДанные;
	Если СтрокаОбщихРасходов = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрана строка общих расходов'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ПрямыеРасходы.ТекущиеДанные;
		Если Счета10960.Количество() = 1 Тогда
			ТекущиеДанные.Счет = Счета10960[0].Значение;
			УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке(ТекущиеДанные, ДанныеСчетов);
		КонецЕсли;
		СтрокаОбщихРасходов = Элементы.ОбщиеРасходы.ТекущиеДанные;
		ТекущиеДанные.ИдСтроки 					= СтрокаОбщихРасходов.ИдСтроки;
		ТекущиеДанные.КПСОЗ 					= СтрокаОбщихРасходов.КПС;
		ТекущиеДанные.КПС	 					= СтрокаОбщихРасходов.КПС;
		ТекущиеДанные.СчетОЗ 					= СтрокаОбщихРасходов.Счет;
		ТекущиеДанные.КЭК	 					= СтрокаОбщихРасходов.КЭК;
		ТекущиеДанные.ВидЗатрат 				= СтрокаОбщихРасходов.ВидЗатрат;
		ТекущиеДанные.НаправлениеДеятельности	= СтрокаОбщихРасходов.НаправлениеДеятельности;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыСчетПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПрямыеРасходы.ТекущиеДанные;
	УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке(ТекущиеДанные, ДанныеСчетов);
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка, 
															Новый Структура("Счет, КПС, КФО", 
																			ТекущиеДанные.Счет, 
																			ТекущиеДанные.КПС, 
																			Объект.КФО), 
															Объект.Организация,
															Объект.ИФО,
															Счета10960,
															Объект.КФО,
															,
															Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекущиеДанные.КПС);
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыСчетАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Ссылка, ЭлементГруппа", Счета10960, Ложь);
		ПараметрыВыбораЗначения = Новый Структура("СтрокаПоиска, Отбор", Текст, Отбор);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), ПараметрыВыбораЗначения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыСчетОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Если СтрДлина(Текст) > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("Ссылка, ЭлементГруппа", Счета10960, Ложь);
		ПараметрыВыбораЗначения = Новый Структура("СтрокаПоиска, Отбор", Текст, Отбор);
		ДанныеВыбора = ПолучитьДанныеВыбора(Тип("ПланСчетовСсылка.ЕПСБУ"), ПараметрыВыбораЗначения);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыСуммаПриИзменении(Элемент)
	ТекущиеОбщиеРасходы = Элементы.ОбщиеРасходы.ТекущиеДанные;
	Если ТекущиеОбщиеРасходы <> Неопределено Тогда
		ТекущиеОбщиеРасходы.СуммаПЗ = СуммаПрямыхЗатрат();
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	ТекстВопроса = "";
	Кнопки = Неопределено;
	
	Если Объект.Проведен Тогда
		ТекстВопроса = НСтр("ru = 'При заполнении будет выполнена отмена проведения и документ будет перезаполнен.
		|Отменить проведение и перезаполнить?'");		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Отменить проведение и перезаполнить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	ИначеЕсли ОбщиеРасходы.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Документ будет перезаполнен.
		|Перезаполнить?'");
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Перезаполнить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
	КонецЕсли;
	
	Если НЕ Кнопки = Неопределено Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьДокументЗавершение", ЭтотОбъект), ТекстВопроса, Кнопки, 20, КодВозвратаДиалога.Да);
        Возврат;
	КонецЕсли;	
	
	ЗаполнитьДокументНаСервере();
	Модифицированность = Истина;
	УстановитьОтборПрямыхРасходов();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументНаСервере();
	Модифицированность = Истина;
	УстановитьОтборПрямыхРасходов();

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьДанныеСчетов()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕПСБУ.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ЕПСБУВидыСубконто.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьНаправлениеДеятельности,
	               |	ЕПСБУ.УчетПоПодразделениям КАК ЕстьПодразделение
	               |ИЗ
	               |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	               |		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	               |			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.НаправленияДеятельности))
	               |ГДЕ
	               |	ЕПСБУ.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ЕПСБУ.Ссылка
	               |			ИЗ
	               |				ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |			ГДЕ
	               |				ЕПСБУ.Код = ""109.60"")
	               |	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕПСБУ.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ЕПСБУВидыСубконто.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьНаправлениеДеятельности,
	               |	ЕПСБУ.УчетПоПодразделениям КАК ЕстьПодразделение
	               |ИЗ
	               |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	               |		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	               |			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.НаправленияДеятельности))
	               |ГДЕ
	               |	ЕПСБУ.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ЕПСБУ.Ссылка
	               |			ИЗ
	               |				ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |			ГДЕ
	               |				ЕПСБУ.Код = ""109.70"")
	               |	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕПСБУ.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ЕПСБУВидыСубконто.Ссылка ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЕстьНаправлениеДеятельности,
	               |	ЕПСБУ.УчетПоПодразделениям КАК ЕстьПодразделение
	               |ИЗ
	               |	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	               |		ПО ЕПСБУ.Ссылка = ЕПСБУВидыСубконто.Ссылка
	               |			И (ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.НаправленияДеятельности))
	               |ГДЕ
	               |	ЕПСБУ.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ЕПСБУ.Ссылка
	               |			ИЗ
	               |				ПланСчетов.ЕПСБУ КАК ЕПСБУ
	               |			ГДЕ
	               |				ЕПСБУ.Код = ""109.80"")
	               |	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ";
	Результат = Запрос.ВыполнитьПакет();
	ДанныеИспользуемыхСчетов = Новый Соответствие;
	
	Выборка = Результат[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		Счета10960.Добавить(Выборка.Ссылка);
		ДанныеСчета = Новый Структура("ЕстьПодразделение, ЕстьНаправлениеДеятельности",
									  Выборка.ЕстьПодразделение,
									  Выборка.ЕстьНаправлениеДеятельности);
		ДанныеИспользуемыхСчетов.Вставить(Выборка.Ссылка, ДанныеСчета);
	КонецЦикла;
	
	Выборка = Результат[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Счета10970.Добавить(Выборка.Ссылка);
		ДанныеСчета = Новый Структура("ЕстьПодразделение, ЕстьНаправлениеДеятельности",
									  Выборка.ЕстьПодразделение,
									  Выборка.ЕстьНаправлениеДеятельности);
		ДанныеИспользуемыхСчетов.Вставить(Выборка.Ссылка, ДанныеСчета);
	КонецЦикла;
	
	Выборка = Результат[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Счета10980.Добавить(Выборка.Ссылка);
		ДанныеСчета = Новый Структура("ЕстьПодразделение, ЕстьНаправлениеДеятельности",
									  Выборка.ЕстьПодразделение,
									  Выборка.ЕстьНаправлениеДеятельности);
		ДанныеИспользуемыхСчетов.Вставить(Выборка.Ссылка, ДанныеСчета);
	КонецЦикла;
	
	ДанныеСчетов = Новый ФиксированноеСоответствие(ДанныеИспользуемыхСчетов);

КонецПроцедуры // ЗаполнитьДанныеСчетов()

&НаСервере
Процедура УстановитьВидимостьНаправленияДеятельностиПодразделения()

	ВидимостьНаправленияДеятельности	= Ложь;
	ВидимостьПодразделения				= Ложь;
	Для каждого ТекСчет Из Счета10960 Цикл
	
		Если ДанныеСчетов[ТекСчет.Значение].ЕстьНаправлениеДеятельности Тогда
			ВидимостьНаправленияДеятельности = Истина;
		КонецЕсли;
		Если ДанныеСчетов[ТекСчет.Значение].ЕстьПодразделение Тогда
			ВидимостьПодразделения = Истина;
		КонецЕсли;
		
		Если ВидимостьНаправленияДеятельности И ВидимостьПодразделения Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла; 
	
	Элементы.ПрямыеРасходыНаправлениеДеятельности.Видимость	= ВидимостьНаправленияДеятельности;
	Элементы.ПрямыеРасходыПодразделение.Видимость			= ВидимостьПодразделения;
	
	ВидимостьНаправленияДеятельности	= Ложь;
	ВидимостьПодразделения				= Ложь;
	Для каждого ТекСчет Из Счета10970 Цикл
	
		Если ДанныеСчетов[ТекСчет.Значение].ЕстьНаправлениеДеятельности Тогда
			ВидимостьНаправленияДеятельности = Истина;
		КонецЕсли;
		Если ДанныеСчетов[ТекСчет.Значение].ЕстьПодразделение Тогда
			ВидимостьПодразделения = Истина;
		КонецЕсли;
		
		Если ВидимостьНаправленияДеятельности И ВидимостьПодразделения Тогда
			Прервать;
		КонецЕсли;
	
	КонецЦикла;
	Если Не (ВидимостьНаправленияДеятельности И ВидимостьПодразделения) Тогда
		Для каждого ТекСчет Из Счета10980 Цикл
		
			Если ДанныеСчетов[ТекСчет.Значение].ЕстьНаправлениеДеятельности Тогда
				ВидимостьНаправленияДеятельности = Истина;
			КонецЕсли;
			Если ДанныеСчетов[ТекСчет.Значение].ЕстьПодразделение Тогда
				ВидимостьПодразделения = Истина;
			КонецЕсли;
			
			Если ВидимостьНаправленияДеятельности И ВидимостьПодразделения Тогда
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
	КонецЕсли;
	Элементы.ОбщиеРасходыНаправлениеДеятельности.Видимость	= ВидимостьНаправленияДеятельности;
	Элементы.ОбщиеРасходыПодразделение.Видимость			= ВидимостьПодразделения;

КонецПроцедуры // УстановитьВидимостьНаправленияДеятельности()

&НаСервере
Процедура УстановитьПризнакНаправленияДеятельностиПодразделения()

	Для каждого ТекСтрока Из ОбщиеРасходы Цикл
		
		УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке(ТекСтрока, ДанныеСчетов);
		
	КонецЦикла; 	

	Для каждого ТекСтрока Из Объект.ПрямыеРасходы Цикл
		
		УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке(ТекСтрока, ДанныеСчетов);
		
	КонецЦикла; 	

КонецПроцедуры // УстановитьПризнакНаправленияДеятельности()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке(ТекСтрока, ДанныеСчетов)

	ДанныеСчета = ДанныеСчетов.Получить(ТекСтрока.Счет);
	Если ДанныеСчета = Неопределено Тогда
		ТекСтрока.ЕстьНаправлениеДеятельности	= Ложь;
		ТекСтрока.ЕстьПодразделение				= Ложь;
	Иначе
		ТекСтрока.ЕстьНаправлениеДеятельности	= ДанныеСчета.ЕстьНаправлениеДеятельности;
		ТекСтрока.ЕстьПодразделение				= ДанныеСчета.ЕстьПодразделение;
	КонецЕсли;

КонецПроцедуры // УстановитьПризнакНаправленияДеятельностиПодразделенияВСтроке()

&НаКлиенте
Функция НеЗаполненВидОбщихЗатрат()

	Если ЗначениеЗаполнено(Объект.ВидОбщихЗатрат) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен вид общих затрат'"),,"Объект.ВидОбщихЗатрат");
	
	Возврат Истина;

КонецФункции // НеЗаполненВидОбщихЗатрат()

&НаКлиенте
Процедура УстановитьПредставлениеПериода()

	ТекстПериод = Формат(Объект.Дата, "ДФ='MMMM yyyy'");	

КонецПроцедуры // УстановитьПредставлениеПериода()

&НаКлиенте
Процедура УстановитьОтборПрямыхРасходов()

	ТекущиеДанные = Элементы.ОбщиеРасходы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		НовОтборСтрок = Новый ФиксированнаяСтруктура("ИдСтроки", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Иначе
		НовОтборСтрок = Новый ФиксированнаяСтруктура("ИдСтроки", ТекущиеДанные.ИдСтроки);
	КонецЕсли;
	
	ТекущийОтборСтрок = Элементы.ПрямыеРасходы.ОтборСтрок;
	Если ТекущийОтборСтрок = Неопределено ИЛИ ТекущийОтборСтрок.ИдСтроки <> НовОтборСтрок.ИдСтроки Тогда
		Элементы.ПрямыеРасходы.ОтборСтрок = НовОтборСтрок;
	КонецЕсли;

КонецПроцедуры // УстановитьОтборПрямыхРасходов()

&НаКлиенте
Функция СписокСчетовОбщихЗатрат()

	Список = Новый СписокЗначений;
	Если Объект.ВидОбщихЗатрат = ПредопределенноеЗначение("Перечисление.ВидыОбщихЗатратНаПроизводство.ОбщепроизводственныеЗатраты") Тогда
		Список.ЗагрузитьЗначения(Счета10970.ВыгрузитьЗначения());
	ИначеЕсли Объект.ВидОбщихЗатрат = ПредопределенноеЗначение("Перечисление.ВидыОбщихЗатратНаПроизводство.ОбщехозяйственныеЗатраты") Тогда
		Список.ЗагрузитьЗначения(Счета10980.ВыгрузитьЗначения());
	КонецЕсли;
	Возврат Список;

КонецФункции // СписокСчетовОбщихЗатрат()

&НаСервере
Процедура ЗаполнитьДокументНаСервере()

	ЗаблокироватьДанныеФормыДляРедактирования();
	
	ОбщиеРасходы.Очистить();
	Объект.ПрямыеРасходы.Очистить();
	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	ПараметрыУчетаЗатрат = Документы.РаспределениеОбщихЗатрат.ПараметрыУчетаЗатрат(Объект.Дата, Объект.Организация, Объект.ИФО, Объект.КФО);
	Если Объект.ВидОбщихЗатрат = Перечисления.ВидыОбщихЗатратНаПроизводство.ОбщепроизводственныеЗатраты Тогда
		ПараметрыУчетаЗатрат.РаспределятьОХЗ = Ложь;
	ИНаче	
		ПараметрыУчетаЗатрат.РаспределятьОПЗ = Ложь;
	КонецЕсли;
	
	ТаблицаРаспределенияЗатрат = Документы.РаспределениеОбщихЗатрат.РаспределитьОбщиеЗатраты(ПараметрыУчетаЗатрат);
	
	ЗаполнитьПоТаблице(ТаблицаРаспределенияЗатрат);
	ЗаполнитьТаблицуОбщихРасходов();
	УстановитьПризнакНаправленияДеятельностиПодразделения();

КонецПроцедуры // ЗаполнитьДокументНаСервере()

&НаСервере
Процедура ЗаполнитьПоТаблице(ТаблицаДляЗаполнения)

	ТаблицаОбщихРасходов = ТаблицаДляЗаполнения.Скопировать(,"КПССчетОЗ, СчетОЗ, КЭКСчетОЗ, ВидЗатратОЗ, НаправлениеДеятельностиОЗ, ПодразделениеОЗ, Сумма");
	ТаблицаОбщихРасходов.Свернуть("КПССчетОЗ, СчетОЗ, КЭКСчетОЗ, ВидЗатратОЗ, НаправлениеДеятельностиОЗ, ПодразделениеОЗ", "Сумма");
	
	Для каждого ТекОбщийРасход Из ТаблицаОбщихРасходов Цикл
	
		ИдСтроки = Новый УникальныйИдентификатор;
		СтрокаОбщихРасходов = ОбщиеРасходы.Добавить();
		СтрокаОбщихРасходов.КПС							= ТекОбщийРасход.КПССчетОЗ;
		СтрокаОбщихРасходов.Счет						= ТекОбщийРасход.СчетОЗ;
		СтрокаОбщихРасходов.КЭК							= ТекОбщийРасход.КЭКСчетОЗ;
		СтрокаОбщихРасходов.ВидЗатрат					= ТекОбщийРасход.ВидЗатратОЗ;
		СтрокаОбщихРасходов.НаправлениеДеятельности		= ТекОбщийРасход.НаправлениеДеятельностиОЗ;
		СтрокаОбщихРасходов.ИдСтроки					= ИдСтроки;
		СтрокаОбщихРасходов.Сумма						= ТекОбщийРасход.Сумма;
		СтрокаОбщихРасходов.ЕстьНаправлениеДеятельности = ДанныеСчетов.Получить(СтрокаОбщихРасходов.Счет) = Истина;
		СтрокаОбщихРасходов.Подразделение				= ТекОбщийРасход.ПодразделениеОЗ;
		
		Отбор = Новый Структура("КПССчетОЗ, СчетОЗ, КЭКСчетОЗ, ВидЗатратОЗ, НаправлениеДеятельностиОЗ, ПодразделениеОЗ");
		ЗаполнитьЗначенияСвойств(Отбор, ТекОбщийРасход);
		СтрокиПрямыхРасходов = ТаблицаДляЗаполнения.НайтиСтроки(Отбор);
		Для каждого ТекПрямойРасход Из СтрокиПрямыхРасходов Цикл
		
			СтрокаПрямыхРасходов = Объект.ПрямыеРасходы.Добавить();
			СтрокаПрямыхРасходов.КПСОЗ						= ТекОбщийРасход.КПССчетОЗ;
			СтрокаПрямыхРасходов.СчетОЗ						= ТекОбщийРасход.СчетОЗ;
			СтрокаПрямыхРасходов.КЭК						= ТекОбщийРасход.КЭКСчетОЗ;
			СтрокаПрямыхРасходов.ВидЗатрат					= ТекОбщийРасход.ВидЗатратОЗ;
			СтрокаПрямыхРасходов.КПС						= ТекПрямойРасход.КПССчетПЗ;
			СтрокаПрямыхРасходов.Счет						= ТекПрямойРасход.СчетПЗ;
			СтрокаПрямыхРасходов.НаправлениеДеятельности	= ТекПрямойРасход.НаправлениеДеятельностиПЗ;
			СтрокаПрямыхРасходов.Подразделение				= ТекПрямойРасход.ПодразделениеПЗ;
			СтрокаПрямыхРасходов.ПодразделениеОЗ			= ТекПрямойРасход.ПодразделениеОЗ;
			СтрокаПрямыхРасходов.Номенклатура				= ТекПрямойРасход.Номенклатура;
			СтрокаПрямыхРасходов.Сумма						= ТекПрямойРасход.Сумма;
			СтрокаПрямыхРасходов.СуммаОЗ					= ТекОбщийРасход.Сумма;
			СтрокаПрямыхРасходов.ИдСтроки					= ИдСтроки;
			СтрокаПрямыхРасходов.ЕстьНаправлениеДеятельности = ДанныеСчетов.Получить(СтрокаПрямыхРасходов.Счет) = Истина;
			
			СтрокаОбщихРасходов.Сумма = СтрокаОбщихРасходов.Сумма + СтрокаПрямыхРасходов.Сумма;
		
		КонецЦикла; 
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьПоТаблице()
 
&НаСервере
Процедура ЗаполнитьТаблицуОбщихРасходов()

	ОбщиеРасходы.Очистить();
	ТаблицаОбщихРасходов = Объект.ПрямыеРасходы.Выгрузить();
	ТаблицаОбщихРасходов.Свернуть("КПСОЗ, СчетОЗ, КЭК, ВидЗатрат, НаправлениеДеятельности, ПодразделениеОЗ, СуммаОЗ");
	ТаблицаОбщихРасходов.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	
	Для каждого ТекОбщийРасход Из ТаблицаОбщихРасходов Цикл
		
		Если ТекОбщийРасход.Обработано Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСчетаТекущейСтроки = ДанныеСчетов.Получить(ТекОбщийРасход.СчетОЗ);
		Если ДанныеСчетаТекущейСтроки = Неопределено Тогда
			ЕстьНД				= Ложь;
			ЕстьПодразделение	= Ложь;
		Иначе
			ЕстьНД 				= ДанныеСчетаТекущейСтроки.ЕстьНаправлениеДеятельности = Истина;
			ЕстьПодразделение	= ДанныеСчетаТекущейСтроки.ЕстьПодразделение = Истина;
		КонецЕсли;
		Отбор = Новый Структура("КПСОЗ, СчетОЗ, КЭК, ВидЗатрат");
		Если ЕстьНД Тогда
			Отбор.Вставить("НаправлениеДеятельности");
		КонецЕсли;
		Если ЕстьПодразделение Тогда
			Отбор.Вставить("ПодразделениеОЗ");
		КонецЕсли;
		
		ИдСтроки = Новый УникальныйИдентификатор;
		СтрокаОбщихРасходов = ОбщиеРасходы.Добавить();
		СтрокаОбщихРасходов.Подразделение			= ТекОбщийРасход.ПодразделениеОЗ;
		СтрокаОбщихРасходов.КПС						= ТекОбщийРасход.КПСОЗ;
		СтрокаОбщихРасходов.Счет					= ТекОбщийРасход.СчетОЗ;
		СтрокаОбщихРасходов.КЭК						= ТекОбщийРасход.КЭК;
		СтрокаОбщихРасходов.ВидЗатрат				= ТекОбщийРасход.ВидЗатрат;
		СтрокаОбщихРасходов.НаправлениеДеятельности	= ТекОбщийРасход.НаправлениеДеятельности;
		СтрокаОбщихРасходов.Сумма					= ТекОбщийРасход.СуммаОЗ;
		СтрокаОбщихРасходов.ИдСтроки				= ИдСтроки;
		СтрокаОбщихРасходов.СуммаПЗ					= 0;
		
		ЗаполнитьЗначенияСвойств(Отбор, ТекОбщийРасход);
		
		СтрокиПрямыхРасходов = Объект.ПрямыеРасходы.НайтиСтроки(Отбор);
		Для каждого ТекПрямойРасход Из СтрокиПрямыхРасходов Цикл
		
			ТекПрямойРасход.ИдСтроки = ИдСтроки;
			СтрокаОбщихРасходов.СуммаПЗ = СтрокаОбщихРасходов.СуммаПЗ + ТекПрямойРасход.Сумма;
		
		КонецЦикла; 
		
		ОбработанныеСтроки = ТаблицаОбщихРасходов.НайтиСтроки(Отбор);
		Для каждого ТекОбработаннаяСтрока Из ОбработанныеСтроки Цикл
		
			ТекОбработаннаяСтрока.Обработано = Истина;
		
		КонецЦикла; 
	
	КонецЦикла; 

КонецПроцедуры // ЗаполнитьТаблицуОбщихРасходов()
 
&НаСервере
Функция СуммаПрямыхЗатрат()

	Результат = 0;
	Отбор = Новый Структура("ИдСтроки", Элементы.ПрямыеРасходы.ОтборСтрок.ИдСтроки);
	СтрокиПрямыхЗатрат = Объект.ПрямыеРасходы.НайтиСтроки(Отбор);
	Для каждого ТекСтрокаПрямыхЗатрат Из СтрокиПрямыхЗатрат Цикл
	
		Результат = Результат + ТекСтрокаПрямыхЗатрат.Сумма;
	
	КонецЦикла; 
	
	Возврат Результат;

КонецФункции // СуммаПрямыхЗатрат()

&НаСервере
Процедура ЗаписатьОбщиеЗатратыВДокумент(ТекущийОбъект)

	ЕстьИзменения = Ложь;
	ОбработанныеСтроки = Новый Массив;
	Для каждого ТекОбщийРасход Из ОбщиеРасходы Цикл
	
		Отбор = Новый Структура("ИдСтроки", ТекОбщийРасход.ИдСтроки);
		СтрокиПрямыхРасходов = Объект.ПрямыеРасходы.НайтиСтроки(Отбор);
		Если СтрокиПрямыхРасходов.Количество() = 0 Тогда
			НоваяСтрока = Объект.ПрямыеРасходы.Добавить();	
			УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.КПС,	 					НоваяСтрока.КПСОЗ, 						ЕстьИзменения);
			УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.ВидЗатрат, 					НоваяСтрока.ВидЗатрат, 					ЕстьИзменения);
			Если ТекОбщийРасход.ЕстьНаправлениеДеятельности = Истина Тогда
				УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.НаправлениеДеятельности,НоваяСтрока.НаправлениеДеятельности,	ЕстьИзменения);
			КонецЕсли;
			УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.КЭК, 						НоваяСтрока.КЭК, 						ЕстьИзменения);
			УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.Сумма, 						НоваяСтрока.СуммаОЗ, 					ЕстьИзменения);
			ОбработанныеСтроки.Добавить(НоваяСтрока);
		Иначе
			Для каждого ТекПрямойРасход Из СтрокиПрямыхРасходов Цикл
			
				УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.Подразделение,				ТекПрямойРасход.ПодразделениеОЗ, 			ЕстьИзменения);
				УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.КПС,	 					ТекПрямойРасход.КПСОЗ, 						ЕстьИзменения);
				УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.ВидЗатрат, 					ТекПрямойРасход.ВидЗатрат, 					ЕстьИзменения);
				Если ТекОбщийРасход.ЕстьНаправлениеДеятельности = Истина Тогда
					УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.НаправлениеДеятельности,ТекПрямойРасход.НаправлениеДеятельности,	ЕстьИзменения);
				КонецЕсли;
				УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.КЭК, 						ТекПрямойРасход.КЭК, 						ЕстьИзменения);
				УстановитьНовоеЗначениеРеквизита(ТекОбщийРасход.Сумма, 						ТекПрямойРасход.СуммаОЗ, 					ЕстьИзменения);
				ОбработанныеСтроки.Добавить(ТекПрямойРасход);
			
			КонецЦикла; 
		КонецЕсли;
	
	КонецЦикла;
	
	СтрокиКУдалению = Новый Массив;
	Для каждого ТекСтрока Из Объект.ПрямыеРасходы Цикл
	
		Если ОбработанныеСтроки.Найти(ТекСтрока) = Неопределено Тогда
			СтрокиКУдалению.Добавить(ТекСтрока);
		КонецЕсли;
	
	КонецЦикла; 
	Если СтрокиКУдалению.Количество() > 0 Тогда
		ЕстьИзменения = Истина;
		Для каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		
			Объект.ПрямыеРасходы.Удалить(СтрокаКУдалению);
		
		КонецЦикла; 
	КонецЕсли;
	
	Если ЕстьИзменения Тогда
		ТекущийОбъект.ПрямыеРасходы.Загрузить(Объект.ПрямыеРасходы.Выгрузить());
	КонецЕсли;

КонецПроцедуры // ЗаписатьОбщиеЗатратыВДокумент()
 
&НаСервере
Процедура УстановитьНовоеЗначениеРеквизита(Источник, Приемник, ЕстьИзменения)

	Если Источник <> Приемник Тогда
		Приемник = Источник;
		ЕстьИзменения = Истина;
	КонецЕсли;

КонецПроцедуры // УстановитьНовоеЗначениеРеквизита()

&НаКлиенте
Процедура ВопросПерейтиКЗакрытиюСчетовПроизводственныхЗатратЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма.Закрыть();
		ОткрытьФорму("Документ.ЗакрытиеСчетовПроизводственныхЗатрат.ФормаОбъекта");
		
	КонецЕсли;
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом
	
#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
