&НаСервере
Перем ОбработкаОбъект;

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	ПрочитатьЗаполнитьХарактеристикиИЗначения(ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьЗаполнитьХарактеристикиИЗначения(ТекущееЗначениеХарактеристики)
	ОбработкаОбъект = ПолучитьОбработкуОбъект();
	ОбработкаОбъект.ОбъектОтбораЗначений   = ТекущееЗначениеХарактеристики;
    ОбработкаОбъект.ПрочитатьЗаполнитьХарактеристикиИЗначения();
	ПоместитьОбработкуОбъект();
КонецПроцедуры

&НаСервере
Функция ПолучитьОбработкуОбъект()
	Возврат РеквизитФормыВЗначение("ОбработкаОбъектЗначенияХарактеристик");	
КонецФункции

&НаСервере
Функция ПоместитьОбработкуОбъект()
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"ОбработкаОбъектЗначенияХарактеристик");
	ОбработкаОбъект = Неопределено;
КонецФункции

#КонецОбласти

