#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПоляПриказовОбразование.Ссылка КАК Значение,
	               |	ПоляПриказовОбразование.ПометкаУдаления,
	               |	ПРЕДСТАВЛЕНИЕССЫЛКИ(ПоляПриказовОбразование.Ссылка) КАК Представление
	               |ИЗ
	               |	ПланВидовХарактеристик.ПоляПриказовОбразование КАК ПоляПриказовОбразование
	               |ГДЕ
	               |	ПоляПриказовОбразование.Ссылка <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПоляПриказовОбразование.СостояниеСтудента)";
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтруктураВыбора = Новый Структура("Значение, ПометкаУдаления", Выборка.Значение, Выборка.ПометкаУдаления);
			ДанныеВыбора.Добавить(СтруктураВыбора, Выборка.Представление);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

