
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеДляЗаполнения = РасчетыСПодотчетнымиЛицамиВызовСервера.ДанныеПоРешениямОКомпенсацииДляВедомостиНаВыдачуДенегИзКассы(ПараметрКоманды);
	
	Для Каждого Элемент Из ДанныеДляЗаполнения Цикл
		
		Элемент.Вставить("ЗаполнитьПоДаннымОснований", Истина);
		
		ОткрытьФорму("Документ.ВедомостьНаВыдачуПодотчетнымЛицам.ФормаОбъекта",
			Элемент, ПараметрыВыполненияКоманды.Источник, Элемент.Ключ, ПараметрыВыполненияКоманды.Окно);
		
	КонецЦикла;
	
КонецПроцедуры
