
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("Организация", ОтборОрганизация) Тогда
		Параметры.Свойство("Организация", ОтборОрганизация);
	Иначе	
		// удаляем отбор из параметров, иначе в список добавится еще и он
		Параметры.Отбор.Удалить("Организация");
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Элементы.ОтборОрганизация.ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "РебенокОрганизация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РебенокОрганизация", "Видимость", НЕ ЗначениеЗаполнено(ОтборОрганизация));
	КонецЕсли;
	
	Если НЕ Параметры.Отбор.Свойство("НаДату", НаДату) Тогда
		Параметры.Свойство("НаДату", НаДату);
	Иначе
		// удаляем отбор из параметров, иначе в список добавится еще и он
		Параметры.Отбор.Удалить("НаДату");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаДату) Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаДату", НаДату, Истина);
	
	Если НЕ Параметры.Отбор.Свойство("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения) Тогда
		Параметры.Свойство("ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения);
	Иначе	
		// удаляем отбор из параметров, иначе в список добавится еще и он
		Параметры.Отбор.Удалить("ГруппаДетскогоУчреждения");
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения) Тогда
		Элементы.ОтборГруппаДетскогоУчреждения.ТолькоПросмотр = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетскогоУчреждения", "Видимость", НЕ ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Актуальность", Истина, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	
	ТекСтр = Новый Структура("ГруппаДетскогоУчреждения, Ребенок");
	ТекСтр.Ребенок = Параметры.ТекущаяСтрока;
	ТекСтр.ГруппаДетскогоУчреждения = Параметры.ТекГруппа;
	
	ТекЗнач = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(НаДату, ТекСтр);
	Если ТекЗнач.Количество() > 0 Тогда
		ТекСтр.Вставить("Период", ТекЗнач[0].Период);
	КонецЕсли;	

	Параметры.ТекущаяСтрока = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СоздатьКлючЗаписи(ТекСтр);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "НаДату", НаДату, Истина);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, , НаДату, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, "ДатаПриемаМеньше", Истина);
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, , Дата('00010101'), ВидСравненияКомпоновкиДанных.Равно, "ДатаПриемаРавно", Истина);
	//
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, , НаДату, ВидСравненияКомпоновкиДанных.БольшеИлиРавно, "ДатаВыбытияБольше", Истина);
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, , Дата('00010101'), ВидСравненияКомпоновкиДанных.Равно, "ДатаВыбытияРавно", Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "РебенокОрганизация", ОтборОрганизация,,, ЗначениеЗаполнено(ОтборОрганизация));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "РебенокОрганизация", "Видимость", НЕ ЗначениеЗаполнено(ОтборОрганизация));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетскогоУчреждения", "Видимость", НЕ ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));

КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппаДетскогоУчрежденияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГруппаДетскогоУчреждения", ОтборГруппаДетскогоУчреждения,,, ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДетскогоУчреждения", "Видимость", НЕ ЗначениеЗаполнено(ОтборГруппаДетскогоУчреждения));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.Список.ТекущиеДанные; 
	
	Значение = Новый Структура;
	Значение.Вставить("Ребенок", ТекСтрока.Ребенок);
	Значение.Вставить("ГруппаДетскогоУчреждения", ТекСтрока.ГруппаДетскогоУчреждения);
	Значение.Вставить("Контрагент", ТекСтрока.РебенокКонтрагент);
	Значение.Вставить("ДоговорКонтрагента", ТекСтрока.Договор);
	Значение.Вставить("СтавкаОплаты", ТекСтрока.СтавкаОплаты);
	Значение.Вставить("Льгота", ТекСтрока.Льгота);
	Значение.Вставить("Период", ТекСтрока.Период);
	
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры
