#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПлатежнаяВедомость";
	КомандаПечати.Идентификатор		= "Ведомость0504403";
	КомандаПечати.Представление		= НСтр("ru = 'Платежная ведомость (ф. 0504403)'");
	КомандаПечати.Порядок			= 1;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РасходныйКассовыйОрдер";
	КомандаПечати.Идентификатор		= "КО2";
	КомандаПечати.Представление		= НСтр("ru = 'Расходный кассовый ордер (к ведомости)'");
	КомандаПечати.Порядок			= 2;

	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Ведомость0504403") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Ведомость0504403", "Платежная ведомость", ПечатьВедомости(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_0504403"));
		
	КонецЕсли;
		
КонецПроцедуры // Печать()

// Функция формирует печатные формы документов
//
// Параметры
//  МассивОбъктов  - Массив - Массив ссылок на объекты которые нужно распечатать
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//
// Возвращаемое значение:
//   ТабличныйДокумент   - Результирующая таблица, содржащая печатный формы документов
//
Функция ПечатьВедомости(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ПлатежнаяВедомость";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПлатежнаяВедомость." + ИмяМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ПлатежнаяВедомость.Ссылка КАК Ссылка,
	|	ПлатежнаяВедомость.Дата КАК ДатаДок,
	|	ПлатежнаяВедомость.Номер КАК НомерДок,
	|	ПлатежнаяВедомость.НазначениеВыплат КАК НазначениеВыплат,
	|	ПлатежнаяВедомость.Период КАК Период,
	|	ПлатежнаяВедомость.ДатаНачалаВыплат КАК ДатаНачалаВыплат,
	|	ПлатежнаяВедомость.ДатаОкончанияВыплат КАК ДатаОкончанияВыплат,
	|	ПлатежнаяВедомость.СуммаДокумента КАК СуммаДокумента,
	|	ПлатежнаяВедомость.ИФО КАК ИФО,
	|	ПлатежнаяВедомость.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомость.Организация.НаименованиеПолное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ПлатежнаяВедомость.Организация.НаименованиеСокращенное = """"
	|						ТОГДА ПлатежнаяВедомость.Организация.Наименование
	|					ИНАЧЕ ПлатежнаяВедомость.Организация.НаименованиеСокращенное
	|				КОНЕЦ
	|		ИНАЧЕ ПлатежнаяВедомость.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ПлатежнаяВедомость.Организация.ИНН КАК ИНН,
	|	ПлатежнаяВедомость.Организация.КПП КАК КПП,
	|	ПлатежнаяВедомость.Организация.КодОКПО КАК КодОКПО,
	|	ПлатежнаяВедомость.Организация.Префикс КАК ПрефиксОрганизации,
	|	ПлатежнаяВедомость.ПодразделениеКор КАК Подразделение,
	|	ПлатежнаяВедомость.ПодразделениеКор.Наименование КАК НаименованиеПодразделения,
	|	ПлатежнаяВедомость.ПодразделениеКор.Код КАК КодПодразделения,
	|	ПлатежнаяВедомость.Руководитель КАК Руководитель,
	|	ПлатежнаяВедомость.ГлБухгалтер КАК ГлБухгалтер,
	|	ПлатежнаяВедомость.Кассир КАК Кассир,
	|	ПлатежнаяВедомость.Проверил КАК Проверил,
	|	ПлатежнаяВедомость.Раздатчик КАК Раздатчик,
	|	ПлатежнаяВедомость.Составил КАК Составил,
	|	ПлатежнаяВедомость.Счет КАК Счет,
	|	ПлатежнаяВедомость.КорСчет КАК КорСчет,
	|	ПлатежнаяВедомость.Состав.(
	|		НомерСтроки КАК НомерСтроки,
	|		Контрагент КАК Контрагент,
	|		Контрагент.Наименование КАК Физлицо,
	|		Сумма КАК Сумма,
	|		ВЫБОР
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер3 = 0
	|				ТОГДА """"
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер3 = 1
	|					И ПлатежнаяВедомость.СотрудникКонтрагент = 0
	|				ТОГДА ПлатежнаяВедомость.Состав.Сотрудник.Код
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер3 = 1
	|					И ПлатежнаяВедомость.СотрудникКонтрагент = 1
	|				ТОГДА ПлатежнаяВедомость.Состав.Контрагент.Код
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер3 = 2
	|				ТОГДА ПлатежнаяВедомость.Состав.Контрагент.ИНН
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер3 = 3
	|				ТОГДА ПлатежнаяВедомость.Состав.Контрагент.ЮридическоеФизическоеЛицо.СтраховойНомерПФР
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК УчетныйНомер3,
	|		ВЫБОР
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер4 = 0
	|				ТОГДА """"
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер4 = 1
	|					И ПлатежнаяВедомость.СотрудникКонтрагент = 0
	|				ТОГДА ПлатежнаяВедомость.Состав.Сотрудник.Код
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер4 = 1
	|					И ПлатежнаяВедомость.СотрудникКонтрагент = 1
	|				ТОГДА ПлатежнаяВедомость.Состав.Контрагент.Код
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер4 = 2
	|				ТОГДА ПлатежнаяВедомость.Состав.Контрагент.ИНН
	|			КОГДА ПлатежнаяВедомость.УчетныйНомер4 = 3
	|				ТОГДА ПлатежнаяВедомость.Состав.Контрагент.ЮридическоеФизическоеЛицо.СтраховойНомерПФР
	|			ИНАЧЕ """"
	|		КОНЕЦ КАК УчетныйНомер4
	|	) КАК Состав,
	|	ПлатежнаяВедомость.РасшифровкаПлатежа.(
	|		КФО КАК КФО,
	|		КПС КАК КПС,
	|		КЭК КАК КЭК,
	|		Сумма КАК Сумма
	|	) КАК РасшифровкаПлатежа
	|ИЗ
	|	Документ.ПлатежнаяВедомость КАК ПлатежнаяВедомость
	|ГДЕ
	|	ПлатежнаяВедомость.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
				 
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Выборка = РезультатЗапроса.Выбрать();
 	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;	
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ РезультатЗапроса.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);	
		КонецЦикла;
		
		СтруктураДанных.Вставить("Номер", ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(Выборка.Ссылка, Выборка.НомерДок));
		СтруктураДанных.Вставить("СуммаДокументаПрописью", ОбщегоНазначенияБГУ.СформироватьСуммуПрописью(Выборка.СуммаДокумента, Неопределено));
		
		// для печати даты в виде "__" ________ 20__ г.
		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(Выборка.ДатаНачалаВыплат);
		СтруктураДанных.Вставить("ЧислоДаты1", 			СтруктураДаты.Число);
		СтруктураДанных.Вставить("МесяцДаты1", 			СтруктураДаты.Месяц);
		СтруктураДанных.Вставить("ГодДаты1", 			СтруктураДаты.Год);
		
		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(Выборка.ДатаОкончанияВыплат);
		СтруктураДанных.Вставить("ЧислоДаты2", 			СтруктураДаты.Число);
		СтруктураДанных.Вставить("МесяцДаты2", 			СтруктураДаты.Месяц);
		СтруктураДанных.Вставить("ГодДаты2", 			СтруктураДаты.Год);

		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.Руководитель, СтруктураДанных.ДатаДок);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("РуководительФамилия", 			ДанныеСотрудника.Фамилия);
        СтруктураДанных.Вставить("РуководительИмя", 				ДанныеСотрудника.Имя);
		СтруктураДанных.Вставить("РуководительОтчество", 			ДанныеСотрудника.Отчество);
		СтруктураДанных.Вставить("РуководительИнициалыФамилия", 	КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));

		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.ГлБухгалтер, СтруктураДанных.ДатаДок);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ГлБухгалтерФамилия", 			ДанныеСотрудника.Фамилия);
        СтруктураДанных.Вставить("ГлБухгалтерИмя", 				ДанныеСотрудника.Имя);
		СтруктураДанных.Вставить("ГлБухгалтерОтчество", 		ДанныеСотрудника.Отчество);
		СтруктураДанных.Вставить("ГлБухгалтерИнициалыФамилия", 	КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));

		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество", СтруктураДанных.Кассир, СтруктураДанных.ДатаДок);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("КассирФамилия", 			ДанныеСотрудника.Фамилия);
        СтруктураДанных.Вставить("КассирИмя", 				ДанныеСотрудника.Имя);
		СтруктураДанных.Вставить("КассирОтчество", 			ДанныеСотрудника.Отчество);
		СтруктураДанных.Вставить("КассирИнициалыФамилия", 	КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));		
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Раздатчик, СтруктураДанных.ДатаДок);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("РаздатчикФамилия", 			ДанныеСотрудника.Фамилия);
        СтруктураДанных.Вставить("РаздатчикИмя", 				ДанныеСотрудника.Имя);
		СтруктураДанных.Вставить("РаздатчикОтчество", 			ДанныеСотрудника.Отчество);
		СтруктураДанных.Вставить("РаздатчикДолжность", 			ДанныеСотрудника.Должность);
		СтруктураДанных.Вставить("РаздатчикИнициалыФамилия", 	КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));	
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Проверил, СтруктураДанных.ДатаДок);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("ПроверилФамилия", 			ДанныеСотрудника.Фамилия);
        СтруктураДанных.Вставить("ПроверилИмя", 				ДанныеСотрудника.Имя);
		СтруктураДанных.Вставить("ПроверилОтчество", 			ДанныеСотрудника.Отчество);
		СтруктураДанных.Вставить("ПроверилДолжность", 			ДанныеСотрудника.Должность);
		СтруктураДанных.Вставить("ПроверилИнициалыФамилия", 	КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность", СтруктураДанных.Составил, СтруктураДанных.ДатаДок);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураДанных.Вставить("СоставилФамилия", 			ДанныеСотрудника.Фамилия);
        СтруктураДанных.Вставить("СоставилИмя", 				ДанныеСотрудника.Имя);
		СтруктураДанных.Вставить("СоставилОтчество", 			ДанныеСотрудника.Отчество);
		СтруктураДанных.Вставить("СоставилДолжность", 			ДанныеСотрудника.Должность);
		СтруктураДанных.Вставить("СоставилИнициалыФамилия", 	КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина));
		
		ТабДтКт = Выборка.РасшифровкаПлатежа.Выгрузить();
		ТабДтКт.Колонки.Добавить("Дебет", Новый ОписаниеТипов("Строка")); 
		ТабДтКт.Колонки.Добавить("Кредит", Новый ОписаниеТипов("Строка"));
		
		Для Каждого Стр ИЗ ТабДтКт Цикл
			
			// Кт, касса
			ДанныеСчета = Новый Структура("КПС, КФО, Счет, КЭК",
			БухгалтерскиеОперацииПовтИсп.КПССчета(СтруктураДанных.Организация, СтруктураДанных.ИФО, Стр.КФО, СтруктураДанных.ДатаДок, СтруктураДанных.Счет,, Стр.КПС),
			Стр.КФО,
			СтруктураДанных.Счет,
			"610");
			
			Стр.Кредит = УправлениеПечатьюБГУ.ПредставлениеСчета(ДанныеСчета, "", Ложь, Истина);
			
			// Дт, расчеты
			ДанныеСчета = Новый Структура("КПС, КФО, Счет, КЭК",
			Стр.КПС,
			Стр.КФО,
			БухгалтерскийУчет.ПолучитьАналитическийСчетПоКЭК(Стр.КЭК, СтруктураДанных.КорСчет,, СтруктураДанных.ДатаДок, СтруктураДанных.Организация, СтруктураДанных.ИФО),
			"837");
			
			Стр.Дебет = УправлениеПечатьюБГУ.ПредставлениеСчета(ДанныеСчета, "", Ложь, Истина);
			
		КонецЦикла;	
		
		ТабДтКт.Свернуть("Дебет, Кредит");
		ТабДтКт.Сортировать("Дебет, Кредит");

		Если ТабДтКт.Количество() > 0 Тогда
			СтруктураДанных.Вставить("Дебет_1", ТабДтКт[0].Дебет);
			СтруктураДанных.Вставить("Кредит_1", ТабДтКт[0].Кредит);
		КонецЕсли;	

		ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьШапка.Параметры.Заполнить(СтруктураДанных);
        ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ОбластьДтКт = Макет.ПолучитьОбласть("ДтКт");
		Для Инд = 1 По ТабДтКт.Количество() - 1 Цикл
			ОбластьДтКт.Параметры.Заполнить(ТабДтКт[Инд]);
			ТабличныйДокумент.Вывести(ОбластьДтКт);
		КонецЦикла;	
	
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("Разделитель"));
		
		ОбластьШапка = Макет.ПолучитьОбласть("ШапкаЛиста");
		ОбластьСтр = Макет.ПолучитьОбласть("Строка");
		ОбластьИтог = Макет.ПолучитьОбласть("ИтогПоСтанице");


		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ТабСписок = Выборка.Состав.Выгрузить();
		
		СтруктураДанных.Вставить("СуммаИтог", ТабСписок.Итог("Сумма"));
		
		ИтогоПоЛисту = 0;
		
		Для Каждого Стр ИЗ ТабСписок Цикл
			
			ОбластьСтр.Параметры.Заполнить(Стр);
			
			ВыводимыеОбласти = Новый Массив;
			ВыводимыеОбласти.Добавить(ОбластьСтр);
			ВыводимыеОбласти.Добавить(ОбластьИтог);
			
			Если НЕ ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти) Тогда
				ОбластьИтог.Параметры.Заполнить(Новый Структура("Сумма", ИтогоПоЛисту)); 
				ТабличныйДокумент.Вывести(ОбластьИтог);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьШапка);
				ИтогоПоЛисту =0;
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтр);
			
			ИтогоПоЛисту = ИтогоПоЛисту + Стр.Сумма;
			
		КонецЦикла;	
		
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьПодвал.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, СтруктураДанных.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатьВедомости()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры
//  Ссылка  - ДокументСсылка.РасходныйОрдерФондовый - ссылка на текущий документ
//  ДополнительныеСвойства  - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Организация,
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.ВалютаДокумента КАК Валюта,
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.КФО,
	|	СУММА(ПлатежнаяВедомостьРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.ПлатежнаяВедомость.РасшифровкаПлатежа КАК ПлатежнаяВедомостьРасшифровкаПлатежа
	|ГДЕ
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Оплачено
	|	И ПлатежнаяВедомостьРасшифровкаПлатежа.Выплачено
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.ВалютаДокумента,
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Организация,
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.КФО,
	|	ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение.ВедетсяКассоваяКнига
	|			ТОГДА ПлатежнаяВедомостьРасшифровкаПлатежа.Ссылка.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ";
				 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НаличныеДенежныеСредстваДвижения = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("НаличныеДенежныеСредства",  НаличныеДенежныеСредстваДвижения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
