
Функция ОписаниеТиповЭлементаРасходов(ВидРасхода) Экспорт
	
	Если ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.ОС") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства,СправочникСсылка.ИнвентарныеНомераОС");
	ИначеЕсли ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.НМА")
		  ИЛИ ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.КапВложения") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства");
	ИначеЕсли ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.МатериальныеЗапасы")
		  ИЛИ ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.ДопРасходы") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ИначеЕсли ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.Услуги") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ВидыЗатрат");
	ИначеЕсли ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.ОплатаТруда") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	ИначеЕсли ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.Налоги") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.ВидыНалоговИПлатежей");
	ИначеЕсли ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходовУСН.НДС") Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	Иначе
		Возврат Новый ОписаниеТипов(
			"СправочникСсылка.ОсновныеСредства,
			|СправочникСсылка.ИнвентарныеНомераОС,
			|СправочникСсылка.Номенклатура,
			|СправочникСсылка.ВидыЗатрат,
			|СправочникСсылка.Контрагенты,
			|СправочникСсылка.ВидыНалоговИПлатежей");
	КонецЕсли;
	
КонецФункции

