#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НачислениеКомпенсации.КонецПериода КАК Период,
	|	НачислениеКомпенсации.НачалоПериода КАК НачалоПериода,
	|	НачислениеКомпенсации.Организация КАК Организация,
	|	НачислениеКомпенсации.ИФО КАК ИФО,
	|	ТабЧасть.Ребенок КАК Ребенок,
	|	ТабЧасть.Плательщик КАК Плательщик,
	|	ТабЧасть.ДетскоеУчреждение КАК ДетскоеУчреждение,
	|	ТабЧасть.ПроцентКомпенсации КАК ПроцентКомпенсации,
	|	ТабЧасть.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ТабЧасть.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ТабЧасть.КПС,
	|	ТабЧасть.КФО
	|ИЗ
	|	Документ.НачислениеКомпенсацииРодительскойПлаты КАК НачислениеКомпенсации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачислениеКомпенсацииРодительскойПлаты.Начисления КАК ТабЧасть
	|		ПО НачислениеКомпенсации.Ссылка = ТабЧасть.Ссылка
	|ГДЕ
	|	НачислениеКомпенсации.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений.Вставить("УчетКомпенсацииРодительскойПлаты", Результат);

КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.НачислениеКомпенсацииРодительскойПлаты";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_Списком";
	КомандаПечати.Представление = Нстр("ru='Ведомость начисленной компенсации (списком)'");
	КомандаПечати.ДополнительныеПараметры = Новый Структура("ВидВедомости", 1);
	КомандаПечати.Порядок = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.НачислениеКомпенсацииРодительскойПлаты";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_ПоОрганизациям";
	КомандаПечати.Представление = Нстр("ru='Ведомость начисленной компенсации (по организациям)'");
	КомандаПечати.ДополнительныеПараметры = Новый Структура("ВидВедомости", 2);
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.НачислениеКомпенсацииРодительскойПлаты";
	КомандаПечати.Идентификатор = "ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_ПоОрганизациямИГруппам";
	КомандаПечати.Представление = Нстр("ru='Ведомость начисленной компенсации (по организациям и группам)'");
	КомандаПечати.ДополнительныеПараметры = Новый Структура("ВидВедомости", 3);
	КомандаПечати.Порядок = 3;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	ВидВедомости = 0;
	Если Не ПараметрыПечати.Свойство("ВидВедомости", ВидВедомости) Тогда
		Возврат;
	КонецЕсли;

	// Проверяем, нужно ли для макета ЗаявкаНаКассовыйРасход0531801 формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_Списком") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_Списком",
			НСтр("ru='Ведомость начисления компенсации (списком)'"),
			ПечатьВедомостиНачисленияКомпенсации(МассивОбъектов, ОбъектыПечати, ВидВедомости));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_ПоОрганизациям") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_ПоОрганизациям",
			НСтр("ru='Ведомость начисления компенсации (по организациям)'"),
			ПечатьВедомостиНачисленияКомпенсации(МассивОбъектов, ОбъектыПечати, ВидВедомости));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_ПоОрганизациямИГруппам") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты_ПоОрганизациямИГруппам",
			НСтр("ru='Ведомость начисления компенсации (по организациям и группам)'"),
			ПечатьВедомостиНачисленияКомпенсации(МассивОбъектов, ОбъектыПечати, ВидВедомости));
	КонецЕсли;

КонецПроцедуры

Функция ПараметрыРасчета(Объект = Неопределено) Экспорт
	Результат = Новый Структура("НачалоПериода, КонецПериода, ДетскоеУчреждение, ГруппаДетскогоУчреждения, ИФО, Подразделение, Ребенок, НаправлениеДеятельности, НастройкаПоУмолчанию, НастройкаРасчета");
	Результат.НастройкаПоУмолчанию = РасчетыПоРодительскойПлате.ПолучитьНастройкуРасчета();
	
	Если Объект <> Неопределено Тогда
		Результат.НачалоПериода = НачалоДня(Объект.НачалоПериода);
		Результат.КонецПериода  = КонецДня(Объект.КонецПериода);
		Результат.ИФО           = Объект.ИФО;
		Результат.Подразделение = Объект.Подразделение;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция РассчитатьНачислениеКомпенсации(ПараметрЗаполнения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних.КПС КАК КПС,
	|	ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних.КФО КАК КФО
	|ПОМЕСТИТЬ НастройкиОтраженияВУчетеКомпенсации
	|ИЗ
	|	РегистрСведений.ПараметрыОтраженияКомпенсацииРодительскойПлаты.СрезПоследних(&КонецПериода, ) КАК ПараметрыОтраженияКомпенсацииРодительскойПлатыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиРасчетовПоРодительскойПлате.Ссылка КАК Ссылка,
	|	НастройкиОтраженияВУчетеКомпенсации.КПС КАК КПС,
	|	НастройкиОтраженияВУчетеКомпенсации.КФО КАК КФО
	|ПОМЕСТИТЬ НастройкиКомпенсации
	|ИЗ
	|	Справочник.НастройкиРасчетовПоРодительскойПлате КАК НастройкиРасчетовПоРодительскойПлате
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиОтраженияВУчетеКомпенсации КАК НастройкиОтраженияВУчетеКомпенсации
	|		ПО НастройкиРасчетовПоРодительскойПлате.Ссылка = НастройкиОтраженияВУчетеКомпенсации.НастройкаКомпенсации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоставГруппДДУ.Ребенок КАК Ребенок,
	|	СоставГруппДДУ.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|	СоставГруппДДУ.Договор КАК Договор,
	|	СоставГруппДДУ.Период КАК Период
	|ПОМЕСТИТЬ СоставГруппЗаПериодВсеДоговоры
	|ИЗ
	|	РегистрСведений.СоставГруппДДУ КАК СоставГруппДДУ
	|ГДЕ
	|	&УсловияОтбораСоставГрупп
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставГруппДДУСрезПоследних.Ребенок,
	|	СоставГруппДДУСрезПоследних.ГруппаДетскогоУчреждения,
	|	СоставГруппДДУСрезПоследних.Договор,
	|	СоставГруппДДУСрезПоследних.Период
	|ИЗ
	|	РегистрСведений.СоставГруппДДУ.СрезПоследних(&НачалоПериода, &УсловияСрезСоставГрупп) КАК СоставГруппДДУСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоставГруппЗаПериодВсеДоговоры.Ребенок КАК Ребенок,
	|	СоставГруппЗаПериодВсеДоговоры.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|	СоставГруппЗаПериодВсеДоговоры.Договор КАК Договор
	|ПОМЕСТИТЬ СоставГруппЗаПериод
	|ИЗ
	|	СоставГруппЗаПериодВсеДоговоры КАК СоставГруппЗаПериодВсеДоговоры
	|ГДЕ
	|	ИСТИНА В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				(ВЫБРАТЬ
	|					СоставГруппВложенный.Ребенок КАК Ребенок,
	|					СоставГруппВложенный.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|					МАКСИМУМ(СоставГруппВложенный.Период) КАК Период
	|				ИЗ
	|					СоставГруппЗаПериодВсеДоговоры КАК СоставГруппВложенный
	|				СГРУППИРОВАТЬ ПО
	|					СоставГруппВложенный.Ребенок,
	|					СоставГруппВложенный.ГруппаДетскогоУчреждения) КАК ПоследнееИзменениеПоГруппе
	|			ГДЕ
	|				СоставГруппЗаПериодВсеДоговоры.Ребенок = ПоследнееИзменениеПоГруппе.Ребенок
	|				И СоставГруппЗаПериодВсеДоговоры.ГруппаДетскогоУчреждения = ПоследнееИзменениеПоГруппе.ГруппаДетскогоУчреждения
	|				И СоставГруппЗаПериодВсеДоговоры.Период = ПоследнееИзменениеПоГруппе.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетКомпенсации.Организация КАК ДетскоеУчреждение,
	|	РасчетКомпенсации.Ребенок КАК Ребенок,
	|	РасчетКомпенсации.Ребенок.Контрагент КАК Контрагент,
	|	РасчетКомпенсации.Плательщик КАК Плательщик,
	|	РасчетКомпенсации.ПроцентКомпенсации КАК ПроцентКомпенсации,
	|	РасчетКомпенсации.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|	СоставГруппЗаПериод.Договор КАК Договор,
	|	СУММА(РасчетКомпенсации.СуммаКомпенсации) КАК СуммаКомпенсации,
	|	РасчетКомпенсации.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ЕСТЬNULL(РасчетКомпенсации.НастройкаКомпенсации.РасчетКомпенсацииНеЗависитОтБазы, ЛОЖЬ) КАК НеЗависитОтБазы,
	|	НастройкиКомпенсации.КФО КАК КФО,
	|	НастройкиКомпенсации.КПС КАК КПС
	|ИЗ
	|	РегистрСведений.ЖурналУчетаКомпенсацииРодительскойПлаты КАК РасчетКомпенсации
	|		ЛЕВОЕ СОЕДИНЕНИЕ НастройкиКомпенсации КАК НастройкиКомпенсации
	|		ПО РасчетКомпенсации.НастройкаКомпенсации = НастройкиКомпенсации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоставГруппЗаПериод КАК СоставГруппЗаПериод
	|		ПО РасчетКомпенсации.Ребенок = СоставГруппЗаПериод.Ребенок
	|			И РасчетКомпенсации.ГруппаДетскогоУчреждения = СоставГруппЗаПериод.ГруппаДетскогоУчреждения
	|ГДЕ
	|	&УсловияЗапроса
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетКомпенсации.Организация,
	|	РасчетКомпенсации.Ребенок,
	|	РасчетКомпенсации.Ребенок.Контрагент,
	|	РасчетКомпенсации.Плательщик,
	|	РасчетКомпенсации.ПроцентКомпенсации,
	|	СоставГруппЗаПериод.Договор,
	|	РасчетКомпенсации.НастройкаКомпенсации,
	|	НастройкиКомпенсации.КФО,
	|	НастройкиКомпенсации.КПС,
	|	РасчетКомпенсации.ГруппаДетскогоУчреждения,
	|	ЕСТЬNULL(РасчетКомпенсации.НастройкаКомпенсации.РасчетКомпенсацииНеЗависитОтБазы, ЛОЖЬ)";
	
	УсловияЗапроса = Новый Массив;
	УсловияЗапроса.Добавить("РасчетКомпенсации.НачалоПериода >= &НачалоПериода");
	УсловияЗапроса.Добавить("РасчетКомпенсации.КонецПериода <= &КонецПериода");
	
	УсловияОтбораСоставГрупп = Новый Массив;
	УсловияОтбораСоставГрупп.Добавить("СоставГруппДДУ.Период >= &НачалоПериода");
	УсловияОтбораСоставГрупп.Добавить("СоставГруппДДУ.Период <= &КонецПериода");
	УсловияОтбораСоставГрупп.Добавить("СоставГруппДДУ.Актуальность = ИСТИНА");
	
	УсловияСрезСоставГрупп = Новый Массив;
	
	Если ЗначениеЗаполнено(ПараметрЗаполнения.ДетскоеУчреждение) Тогда
		УсловияЗапроса.Добавить("РасчетКомпенсации.Организация = &ДетскоеУчреждение");
		Запрос.УстановитьПараметр("ДетскоеУчреждение", ПараметрЗаполнения.ДетскоеУчреждение);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрЗаполнения.ИФО) Тогда
		УсловияЗапроса.Добавить("РасчетКомпенсации.ИФО = &ИФО");
	КонецЕсли;	
	Если ЗначениеЗаполнено(ПараметрЗаполнения.ГруппаДетскогоУчреждения) Тогда
		УсловияЗапроса.Добавить("РасчетКомпенсации.ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения");
		УсловияОтбораСоставГрупп.Добавить("СоставГруппДДУ.ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения");
		УсловияСрезСоставГрупп.Добавить("ГруппаДетскогоУчреждения = &ГруппаДетскогоУчреждения");
		
		Запрос.УстановитьПараметр("ГруппаДетскогоУчреждения", ПараметрЗаполнения.ГруппаДетскогоУчреждения);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрЗаполнения.НаправлениеДеятельности) Тогда
		УсловияЗапроса.Добавить("СоставГруппЗаПериод.Договор.НаправлениеДеятельности = &НаправлениеДеятельности");
		Запрос.УстановитьПараметр("НаправлениеДеятельности", ПараметрЗаполнения.НаправлениеДеятельности);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрЗаполнения.Ребенок) Тогда
		УсловияЗапроса.Добавить("РасчетКомпенсации.Ребенок = &Ребенок");
		УсловияОтбораСоставГрупп.Добавить("СоставГруппДДУ.Ребенок = &Ребенок");
		УсловияСрезСоставГрупп.Добавить("Ребенок = &Ребенок");
		
		Запрос.УстановитьПараметр("Ребенок", ПараметрЗаполнения.Ребенок);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрЗаполнения.НастройкаРасчета) Тогда
		УсловияЗапроса.Добавить("РасчетКомпенсации.НастройкаКомпенсации = &НастройкаРасчета");
		Запрос.УстановитьПараметр("НастройкаРасчета", ПараметрЗаполнения.НастройкаРасчета);
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияЗапроса", СтрСоединить(УсловияЗапроса, " И "));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбораСоставГрупп", СтрСоединить(УсловияОтбораСоставГрупп, " И "));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияСрезСоставГрупп", СтрСоединить(УсловияСрезСоставГрупп, " И "));
	
	Запрос.УстановитьПараметр("НачалоПериода",            ПараметрЗаполнения.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода",             ПараметрЗаполнения.КонецПериода);
	Запрос.УстановитьПараметр("ИФО",                      ПараметрЗаполнения.ИФО);
	Запрос.УстановитьПараметр("Подразделение",            ПараметрЗаполнения.Подразделение);
	Запрос.УстановитьПараметр("НастройкаПоУмолчанию",     ПараметрЗаполнения.НастройкаПоУмолчанию);
	
	ТаблицаКомпенсации = Запрос.Выполнить().Выгрузить();	
	Возврат ТаблицаКомпенсации;
	
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела. См.документы.НачислениеКомпенсацииРодительскойПлаты.РассчитатьНачислениеКомпенсации	
Функция ЗаполнитьДокумент(НачалоПериода, КонецПериода, ДетскоеУчреждение, ГруппаДетскогоУчреждения, ИФО,
	Подразделение, Ребенок = Неопределено, НаправлениеДеятельности = Неопределено) Экспорт
	
	Параметры = ПараметрыРасчета();
	Параметры.НачалоПериода            = НачалоДня(НачалоПериода);
	Параметры.КонецПериода             = КонецДня(КонецПериода);
	Параметры.ДетскоеУчреждение        = ДетскоеУчреждение;
	Параметры.ГруппаДетскогоУчреждения = ГруппаДетскогоУчреждения;
	Параметры.ИФО                      = ИФО;
	Параметры.Подразделение            = Подразделение;
	Параметры.Ребенок                  = Ребенок;
	Параметры.НаправлениеДеятельности  = НаправлениеДеятельности;
	
	Возврат РассчитатьНачислениеКомпенсации(Параметры);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует табличный документ с печатной формой ведомости по начислению компенсации родительской платы
// за содержание детей в детских учреждениях (форма 327)
//
// Возвращаемое значение:
//  Табличный документ - печатная форма ведомости по расчетам с родителями
//
Функция ПечатьВедомостиНачисленияКомпенсации(МассивОбъектов, ОбъектыПечати, ВидВедомости) 
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.НачислениеКомпенсацииРодительскойПлаты.ПФ_MXL_ВедомостьНачисленияКомпенсацииРодительскойПлаты");
	
	ОбластиМакета = Новый Структура("Шапка, Строка, Итого, Подвал");
	ОбластиМакета.Шапка  = Макет.ПолучитьОбласть("ШапкаПоОрганизации");
	ОбластиМакета.Строка = Макет.ПолучитьОбласть("СтрокаПоОрганизации");
	ОбластиМакета.Итого  = Макет.ПолучитьОбласть("ИтогоПоОрганизации");
	ОбластиМакета.Подвал = Макет.ПолучитьОбласть("ПодвалПоОрганизации");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаКассовыйРасход_ЗаявкаНаКассовыйРасход";
	
	ВыборкаДокумент = ВыборкаПоДокументу(МассивОбъектов, ВидВедомости);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ВыборкаОрганизация = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ПерваяЧастьДокумента = Истина;
		
		Пока ВыборкаОрганизация.Следующий() Цикл
			ВыборкаГруппа = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаГруппа.Следующий() Цикл
				
				Если Не ПерваяЧастьДокумента Тогда
					ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ПерваяЧастьДокумента = Ложь;
				
				ВывестиТекущийДокумент(ТабДокумент, ОбластиМакета, ВыборкаГруппа);
				
			КонецЦикла;
		КонецЦикла;
	
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ВыборкаДокумент.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ВывестиТекущийДокумент(ТабДокумент, ОбластиМакета, ВыборкаГруппа)

	ОбластиМакета.Шапка.Параметры.Заполнить(ВыборкаГруппа);
	
	ПараметрыШапки = Новый Структура("Период, ГруппаДДУ, ОрганизацияНаименование, КодОКПО");
	ПараметрыШапки.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(
		Перечисления.ДоступныеПериодыОтчета.ПустаяСсылка(),
		ВыборкаГруппа.НачалоПериода,
		ВыборкаГруппа.КонецПериода);
	ПараметрыШапки.ГруппаДДУ = ВыборкаГруппа.ГруппаДДУ;
	
	ДанныеОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыборкаГруппа.Организация,
		"ИспользоватьВПлатежныхДокументахСокращенноеНаименование, НаименованиеСокращенное, НаименованиеПолное, КодОКПО");
	ПараметрыШапки.ОрганизацияНаименование = ?(ДанныеОрганизации.ИспользоватьВПлатежныхДокументахСокращенноеНаименование,
		ДанныеОрганизации.НаименованиеСокращенное,
		ДанныеОрганизации.НаименованиеПолное);
	ПараметрыШапки.КодОКПО = ДанныеОрганизации.КодОКПО;

	ОбластиМакета.Шапка.Параметры.Заполнить(ПараметрыШапки);
	
	ТабДокумент.Вывести(ОбластиМакета.Шапка);
	
	ВыборкаСтроки = ВыборкаГруппа.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	ПараметрыСтроки = Новый Структура("Нпп", 1);
	
	Пока ВыборкаСтроки.Следующий() Цикл
		ОбластиМакета.Строка.Параметры.Заполнить(ВыборкаСтроки);
		ОбластиМакета.Строка.Параметры.Заполнить(ПараметрыСтроки);
		ТабДокумент.Вывести(ОбластиМакета.Строка);
		
		ПараметрыСтроки.Нпп = ПараметрыСтроки.Нпп + 1;
	КонецЦикла;
	
	ОбластиМакета.Итого.Параметры.Заполнить(Новый Структура("СуммаИтого", ВыборкаГруппа.СуммаКомпенсации));
	ТабДокумент.Вывести(ОбластиМакета.Итого);
	
	ПараметрыПодвала = Новый Структура("ДокДата, ГлБухгалтер");
	ПараметрыПодвала.ДокДата     = ВыборкаГруппа.ДокДата;
	ПараметрыПодвала.ГлБухгалтер = ФИОГлБухгалтера(ВыборкаГруппа);
	ОбластиМакета.Подвал.Параметры.Заполнить(ПараметрыПодвала);
	
	ТабДокумент.Вывести(ОбластиМакета.Подвал);
КонецПроцедуры

Функция ФИОГлБухгалтера(Выборка)
	
	Если ЗначениеЗаполнено(Выборка.ГлБухгалтер) Тогда
		Возврат Корреспонденты.ФИОПоОбъекту(Выборка.ГлБухгалтер, Истина);
	КонецЕсли;
	
	ОтветственныеЛица = ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизацииСоответствием(
		Выборка.Организация, Выборка.ДокДата);
	ГлБухгалтерФИО = ОтветственныеЛица.Получить("Главный бухгалтер").ОтветственноеЛицоФИО;
	
	Возврат КорреспондентыКлиентСервер.ФИО(ГлБухгалтерФИО, Истина);
	
КонецФункции

Функция ВыборкаПоДокументу(МассивОбъектов, ВидВедомости)
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТЧНачисление.Ссылка КАК Ссылка,
	|	ТЧНачисление.Ссылка.Номер КАК ДокНомер,
	|	ТЧНачисление.Ссылка.Дата КАК ДокДата,
	|	ВЫБОР
	|		КОГДА &ВидВедомости = 1
	|			ТОГДА ТЧНачисление.Ссылка.Организация
	|		ИНАЧЕ ТЧНачисление.ДетскоеУчреждение
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА &ВидВедомости = 1
	|			ТОГДА ТЧНачисление.Ссылка.ГлБухгалтер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	КОНЕЦ КАК ГлБухгалтер,
	|	ТЧНачисление.Ссылка.НачалоПериода КАК НачалоПериода,
	|	ТЧНачисление.Ссылка.КонецПериода КАК КонецПериода,
	|	МИНИМУМ(ТЧНачисление.НомерСтроки) КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &ВидВедомости = 1
	|				ИЛИ &ВидВедомости = 2
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыДетскогоУчреждения.ПустаяСсылка)
	|		ИНАЧЕ ТЧНачисление.ГруппаДетскогоУчреждения
	|	КОНЕЦ КАК ГруппаДДУ,
	|	ТЧНачисление.Ребенок КАК Ребенок,
	|	ТЧНачисление.Договор КАК Договор,
	|	ТЧНачисление.Плательщик КАК Плательщик,
	|	СУММА(ТЧНачисление.СуммаКомпенсации) КАК СуммаКомпенсации
	|ИЗ
	|	Документ.НачислениеКомпенсацииРодительскойПлаты.Начисления КАК ТЧНачисление
	|ГДЕ
	|	ТЧНачисление.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА &ВидВедомости = 1
	|			ТОГДА ТЧНачисление.Ссылка.ГлБухгалтер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВидВедомости = 1
	|			ТОГДА ТЧНачисление.Ссылка.Организация
	|		ИНАЧЕ ТЧНачисление.ДетскоеУчреждение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ВидВедомости = 1
	|				ИЛИ &ВидВедомости = 2
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыДетскогоУчреждения.ПустаяСсылка)
	|		ИНАЧЕ ТЧНачисление.ГруппаДетскогоУчреждения
	|	КОНЕЦ,
	|	ТЧНачисление.Договор,
	|	ТЧНачисление.Плательщик,
	|	ТЧНачисление.Ребенок,
	|	ТЧНачисление.Ссылка,
	|	ТЧНачисление.Ссылка.Дата,
	|	ТЧНачисление.Ссылка.КонецПериода,
	|	ТЧНачисление.Ссылка.НачалоПериода,
	|	ТЧНачисление.Ссылка.Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ДокНомер,
	|	ГруппаДДУ,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(СуммаКомпенсации)
	|ПО
	|	Ссылка,
	|	Организация,
	|	ГруппаДДУ";
				   
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	Запрос.УстановитьПараметр("ВидВедомости", ВидВедомости);
	
	Результат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				   
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецЕсли
