#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РасходноеРасписание";
	КомандаПечати.Идентификатор		= "Форма0531722_262н";
	КомандаПечати.Представление		= НСтр("ru = 'Расходное расписание (в ред приказа 262н)'");
	КомандаПечати.Порядок			= 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.РасходноеРасписание";
	КомандаПечати.Идентификатор		= "Форма0531722";
	КомандаПечати.Представление		= НСтр("ru = '(Устарел) Расходное расписание'");
	КомандаПечати.Порядок			= 90;

	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	// Устанавливаем признак доступности печати покомплектно.
	//ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;

	// Проверяем, нужно ли для макета ЗаявкаНаКассовыйРасход0531801 формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531722") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0531722",
			"Расходное расписание",
			ПечатьРасходноеРасписание(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Форма0531722"));
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0531722_262н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0531722_262н",
			"Расходное расписание",
			ПечатьРасходноеРасписание(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Форма0531722_262н"));
	КонецЕсли;

КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции 

// Возвращает массив структур, содержащих значения реквизитов документа для выгрузки
//
// Параметры:
// МассивОбъектов               - Массив объектов данного вида
// ИспользоватьДопКл            - Признак применения доп. классификации и указании ее значений в структурах реквизитов документов
// ИспользоватьКодМероприятия   - Признак применения кодов мероприятий
// ИспользоватьКЭК              - Признак использования КЭК
// ИспользоватьАналитическийКод - Признак использования аналитического кода
// ИспользоватьКФО              - Признак применения КФО и указания значений КФО в структурах реквизитов документа
// ИспользоватьКОСГУПолучателя  - Признак использования КОСГУПолучателя
Функция ЗначенияРеквизитовДокумента(МассивОбъектов, ИспользоватьДопКл = Ложь, ИспользоватьКодМероприятия = Ложь, ИспользоватьКЭК = Ложь, ИспользоватьАналитическийКод = Ложь, ИспользоватьКФО = Ложь, ИспользоватьКОСГУПолучателя = Ложь) Экспорт  
	
	Возврат ПлатежноРасчетныеДокументы.ЗначенияРеквизитовРасходноеРасписание(МассивОбъектов, ИспользоватьДопКл, ИспользоватьКодМероприятия, ИспользоватьКЭК, ИспользоватьАналитическийКод, ИспользоватьКФО, ИспользоватьКОСГУПолучателя);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВывесстиПодвалСтраницы(ТабДокумент, ДанныеПодвалаСтр)
	
	ДанныеПодвалаСтр.НомерСтраницы = ДанныеПодвалаСтр.НомерСтраницы + 1;
	ДанныеПодвалаСтр.ПодвалСтраницы.Параметры.Заполнить(ДанныеПодвалаСтр);
	
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ДанныеПодвалаСтр.Разделитель);
	ВыводимыеОбласти.Добавить(ДанныеПодвалаСтр.ПодвалСтраницы);
	
	
	Попытка 
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ВыводимыеОбласти[0]);
		КонецЦикла;
		ТабДокумент.Вывести(ВыводимыеОбласти[1]);
		ДанныеПодвалаСтр.ОбластиВсего.Добавить(ТабДокумент.ВысотаТаблицы)
	Исключение
		Сообщить("В системе не установлено ни одного принтера.");
	КонецПопытки;

	
КонецПроцедуры	

Процедура ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, Область, ИсточникПараметров, ПоляПодвала, Шапка = Неопределено, ШапкаРаздела = Неопределено, ДанныеПодвалаСтр)  
		
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(Макет.ПолучитьОбласть(Область));
    ВыводимыеОбласти.Добавить(Макет.ПолучитьОбласть("Подвал"));
	ВыводимыеОбласти.Добавить(ДанныеПодвалаСтр.ПодвалСтраницы);
	ВыводимыеОбласти[0].Параметры.Заполнить(ИсточникПараметров);
	ВыводимыеОбласти[1].Параметры.Заполнить(ПоляПодвала);

	Попытка 
		Если НЕ ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Тогда
			ТабДокумент.Вывести(ВыводимыеОбласти[1]);
			
			ВывесстиПодвалСтраницы(ТабДокумент, ДанныеПодвалаСтр);
			
			Если НЕ ШапкаРаздела = Неопределено Тогда
				ТабДокумент.Вывести(ШапкаРаздела);	
			КонецЕсли;	
			Если НЕ Шапка = Неопределено Тогда
				ТабДокумент.Вывести(Макет.ПолучитьОбласть(Шапка));	
			КонецЕсли;	
		КонецЕсли;
		ТабДокумент.Вывести(ВыводимыеОбласти[0]);
	Исключение
		Сообщить("В системе не установлено ни одного принтера.");
	КонецПопытки;

	
КонецПроцедуры

// Функция формирует табличный документ Расходное расписание
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьРасходноеРасписание(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабДокумент                                     = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы 					= ОриентацияСтраницы.Ландшафт;
	ТабДокумент.АвтоМасштаб 						= Истина;
	ТабДокумент.ВерхнийКолонтитул.Выводить			= Ложь;
	ТабДокумент.НижнийКолонтитул.Выводить			= Ложь;
	ТабДокумент.ИмяПараметровПечати 				= "ПАРАМЕТРЫ_ПЕЧАТИ_РасходноеРасписание1_РасходноеРасписание1";
	
	Макет                 = УправлениеПечатью.МакетПечатнойФормы("Документ.РасходноеРасписание." + ИмяМакета);	
	ДанныеДляПечатиМассив = ПлатежноРасчетныеДокументы.ЗначенияРеквизитовРасходноеРасписание(МассивОбъектов);	
	ПервыйДокумент        = Истина;

	Для Каждого ДанныеДляПечати Из ДанныеДляПечатиМассив Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент      = Ложь;
		
		НомерСтрокиНачало   = ТабДокумент.ВысотаТаблицы + 1;
				
		ВыборкаАссигнования =  ДанныеДляПечати.Ассигнования;
		ВыборкаЛБО 			=  ДанныеДляПечати.ЛБО;
		ВыборкаПОФ 			=  ДанныеДляПечати.ПОФ;
		
		ШапкаРаздела        = Макет.ПолучитьОбласть("ШапкаРаздела");
		ШапкаРаздела.Параметры.Заполнить(ДанныеДляПечати);
		
		ДанныеПодвалаСтр 	= Новый Структура;
		ДанныеПодвалаСтр.Вставить("НомерСтраницы",		0); 
		ДанныеПодвалаСтр.Вставить("ОбластиВсего", 		Новый Массив);
		ДанныеПодвалаСтр.Вставить("ПодвалСтраницы", 	Макет.ПолучитьОбласть("ПодвалСтраницы"));
		ДанныеПодвалаСтр.Вставить("Разделитель", 		Макет.ПолучитьОбласть("Разделитель"));
	
		// вывод в табличный документ
		ОбластьВывода = Макет.ПолучитьОбласть("Заголовок");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		
		ВывесстиПодвалСтраницы(ТабДокумент, ДанныеПодвалаСтр);  
		
		ТабДокумент.Вывести(ШапкаРаздела);
		
		// дальше надо смотреть, умещается ли на страницу
				
		Если ВыборкаАссигнования.Количество() > 0 Тогда
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "БА_Ш", ДанныеДляПечати, ДанныеДляПечати, , ШапкаРаздела, ДанныеПодвалаСтр);
			Для Каждого СтрВыборкаАссигнования Из ВыборкаАссигнования Цикл 
				ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "БА_Стр", СтрВыборкаАссигнования, ДанныеДляПечати, "БА_Ш_2", ШапкаРаздела, ДанныеПодвалаСтр);  
			КонецЦикла;
			ИтогАссигнования = Новый Структура ("Сумма_I, Сумма_II, Сумма_III", ВыборкаАссигнования.Итог("Сумма_I"), ВыборкаАссигнования.Итог("Сумма_II"), ВыборкаАссигнования.Итог("Сумма_III"));
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "БА_Итог", ИтогАссигнования, ДанныеДляПечати, "БА_Ш_2", ШапкаРаздела, ДанныеПодвалаСтр);  
		КонецЕсли;
		                                         		
		Если ВыборкаЛБО.Количество() Тогда
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "ЛБО_Ш", ДанныеДляПечати, ДанныеДляПечати,, ШапкаРаздела, ДанныеПодвалаСтр);  
			Для Каждого СтрВыборкаЛБО Из ВыборкаЛБО Цикл 
				ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "ЛБО_Стр", СтрВыборкаЛБО, ДанныеДляПечати, "ЛБО_Ш_2", ШапкаРаздела, ДанныеПодвалаСтр);  
			КонецЦикла;
			ИтогЛБО = Новый Структура ("Сумма_I, Сумма_II, Сумма_III", ВыборкаЛБО.Итог("Сумма_I"), ВыборкаЛБО.Итог("Сумма_II"), ВыборкаЛБО.Итог("Сумма_III"));
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "ЛБО_Итог", ИтогЛБО, ДанныеДляПечати, "ЛБО_Ш_2", ШапкаРаздела, ДанныеПодвалаСтр);
		КонецЕсли;
		
		Если ВыборкаПОФ.Количество() Тогда
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "ПОФ_Ш", ДанныеДляПечати, ДанныеДляПечати,, ШапкаРаздела, ДанныеПодвалаСтр);  
			Для Каждого СтрВыборкаПОФ Из ВыборкаПОФ Цикл 
				ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "ПОФ_Стр", СтрВыборкаПОФ, ДанныеДляПечати, "ПОФ_Ш_2", ШапкаРаздела, ДанныеПодвалаСтр);  
			КонецЦикла;
			ИтогПОФ = Новый Структура ("Сумма_I", ВыборкаПОФ.Итог("Сумма_I"));
			ВывестиОбластьСПодсчетомСтраниц(Макет, ТабДокумент, "ПОФ_Итог", ИтогПОФ, ДанныеДляПечати, "ПОФ_Ш_2", ШапкаРаздела, ДанныеПодвалаСтр);
		КонецЕсли;
		
		// последняя подпись ответственного исполнителя 
		ОбластьВывода = Макет.ПолучитьОбласть("Подвал");
		ОбластьВывода.Параметры.Заполнить(ДанныеДляПечати);
		ТабДокумент.Вывести(ОбластьВывода);
		
		ВывесстиПодвалСтраницы(ТабДокумент, ДанныеПодвалаСтр);
		
		// заполнение "всего страниц"

		Для Каждого НомерОбл Из ДанныеПодвалаСтр.ОбластиВсего Цикл
			
			 ТабДокумент.Область("R" + Формат(НомерОбл, "ЧДЦ=; ЧГ=") + "C16").Текст = ДанныеПодвалаСтр.НомерСтраницы;
			 
		КонецЦикла;	 
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДляПечати.Ссылка);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
