#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Значение перечисления "Ручное распределение" не выбирается пользователем интерактивно,
	// а устанавливается автоматически при ручной корректировке результатов распределения.
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.ПрямыеЗатраты);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.МатериальныеЗатраты);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.ОплатаТруда);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.Выручка);
	ДанныеВыбора.Добавить(Перечисления.БазыРаспределенияКосвенныхЗатрат.РегистрируетсяВручную);
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
