#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Формирует таблицу разделителей документов для целей формирования текущего документа по данным инвентаризационной описи.
//
// Параметры:
//  ДокОснование - ДокументСсылка.ИнвентаризационнаяОписьНФА - документ, по данным которого заполняется текущий документ
//  СсылкаЦелевогоДокумента - ДокументСсылка.ПоступлениеМЗ -
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица разделителей с полями:
//   * ЦМООтправитель - СправочникСсылка.ЦМО
//   * ПодразделениеОтправитель - СправочникСсылка.Подразделения
Функция ТаблицаРазделителейДокументов(ДокОснование, СсылкаЦелевогоДокумента = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Документы.ИнвентаризационнаяОписьНФА.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокОснование, СсылкаЦелевогоДокумента);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеИнвентаризации.ИФО КАК ИФО,
	|	СправочникЦМО.Ссылка КАК ЦМО,
	|	ДанныеИнвентаризации.Подразделение КАК Подразделение
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК СправочникЦМО
	|		ПО ДанныеИнвентаризации.МОЛШапки = СправочникЦМО.Сотрудник
	|			И ДанныеИнвентаризации.МестоИнвентаризации = СправочникЦМО.МестоХранения
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации = &Ссылка
	|	И ДанныеИнвентаризации.ВидОбъекта = 8
	|	И ДанныеИнвентаризации.МестоИнвентаризации ССЫЛКА Справочник.МестаХранения
	|	И ДанныеИнвентаризации.КоличествоИзлишкиНеПодтверждено <> 0
	|			
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ДанныеИнвентаризации.ИФО КАК ИФО,
	|	СправочникЦМО.Ссылка КАК ЦМО,
	|	ДанныеИнвентаризации.Подразделение КАК Подразделение
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК СправочникЦМО
	|		ПО ДанныеИнвентаризации.МОЛШапки = СправочникЦМО.Сотрудник
	|			И СправочникЦМО.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ПустаяСсылка)
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации = &Ссылка
	|	И ДанныеИнвентаризации.ВидОбъекта = 8
	|	И ТИПЗНАЧЕНИЯ(ДанныеИнвентаризации.МестоИнвентаризации) = ТИП(СТРОКА)
	|	И ДанныеИнвентаризации.КоличествоИзлишкиНеПодтверждено <> 0";
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО") Тогда
		Запрос.Текст = УправлениеНФА.УдалитьПолеИзТекстЗапроса(Запрос.Текст, "ИФО");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", ДокОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

// Формирует текст запроса для получения НФА, уже отработанных данным документом
// по инвентаризации
//
// Возвращаемое значение:
// - Строка - текст запроса
Функция ТекстЗапроса_НФАОтработанныеПоИнвентаризации() Экспорт
	Возврат 
	"ВЫБРАТЬ
	|	АктСписания.Ссылка КАК ДокументОтклонения,
	|	АктСписания.ДокументОснование КАК ДокументИнвентаризации,
	|	ТабМатериалы.Номенклатура КАК НФА,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомер,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОтклоненийВИнвентаризацииНФА.Излишки) КАК ВидОтклонения,
	|	АктСписания.ЦМО.МестоХранения КАК МестоИнвентаризации,
	|	ТабМатериалы.Количество КАК Количество
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК АктСписания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ.Материалы КАК ТабМатериалы
	|		ПО АктСписания.Ссылка = ТабМатериалы.Ссылка
	|ГДЕ
	|	АктСписания.ДокументОснование В(&ДокументыИнвентаризации)
	|	И НЕ АктСписания.ПометкаУдаления
	|	И АктСписания.Ссылка <> &ПоступлениеМЗСсылка";
КонецФункции

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

// Параметры заполнения КЭК в табличных частях документа:
//  - Имена табличных частей, содержащих КЭК.
//  - сторона проводки - Дт или Кт.
// 
// Возвращаемое значение:
//  Структура:
//   * ДтКт - Строка - "Дт" или "Кт"
//   * Включать106 - Булево - получать свойства счета 106
//   * ИменаТабличныхЧастей - Массив из Строка - Имена табличных частей содержащих КЭК
Функция ПараметрыЗаполненияКЭК() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ДтКт", "Дт");
	Результат.Вставить("Включать106", Истина);
	ИменаТабличныхЧастей = Новый Массив;
	ИменаТабличныхЧастей.Добавить("Материалы");
	ИменаТабличныхЧастей.Добавить("ВозвратнаяТара");
	Результат.Вставить("ИменаТабличныхЧастей", ИменаТабличныхЧастей);
	Возврат Результат;
КонецФункции

// Подготовить таблицу списание материальных запасов по документу.
// 
// Параметры:
//  Документ - ДокументОбъект.ПоступлениеМЗ
//  Параметры - Структура
// 
// Возвращаемое значение:
//  ТаблицаЗначений
Функция ПодготовитьТаблицуСписаниеМатериальныхЗапасовПоДокументу(Документ, Параметры) Экспорт
	
	Счет27 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Счет27", ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(Счет27) Тогда
		Счет27 = БухгалтерскийУчет.СчетПоКоду("27.02", Документ.Дата, Документ.Организация);
		Если Не ЗначениеЗаполнено(Счет27) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Не найден счет 27.02, действующий на %1'"),
			Формат(Документ.Дата, "ДФ=dd.MM.yyyy")));
		КонецЕсли;
	КонецЕсли;
	
	СвойстваСчета = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет27);
	
	ВидДопСубконто27 = Неопределено;
	Для Счетчик = 1 По СвойстваСчета.КоличествоСубконто Цикл
		Если ЗначениеЗаполнено(СвойстваСчета["ВидСубконто" + Счетчик]) Тогда
			Если СвойстваСчета["ВидСубконто" + Счетчик] <> ПланыВидовХарактеристик.ВидыСубконто.Номенклатура
				И СвойстваСчета["ВидСубконто" + Счетчик] <> ПланыВидовХарактеристик.ВидыСубконто.Контрагенты
				И СвойстваСчета["ВидСубконто" + Счетчик] <> ПланыВидовХарактеристик.ВидыСубконто.Партии Тогда
				
				ВидДопСубконто27 = СвойстваСчета["ВидСубконто" + Счетчик];
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = Запрос.Текст +
	"ВЫБРАТЬ
	|	""Материалы"" КАК ИмяСписка,
	|	""Материалы"" КАК СинонимСписка,
	|	Материалы.НомерСтроки КАК НомерСтроки,
	|	Материалы.Ссылка.ИФО КАК ИФО,
	|	Материалы.КФО КАК КФО,
	|	ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка) КАК КПС,
	|	ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) КАК КЭК,
	|	ВЫБОР
	|		КОГДА Материалы.Ссылка.ПодразделениеИсточник = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА Материалы.Ссылка.Подразделение
	|		ИНАЧЕ Материалы.Ссылка.ПодразделениеИсточник
	|	КОНЕЦ КАК Подразделение,
	|	Материалы.Ссылка.Подразделение КАК ПодразделениеПолучатель,
	|	&УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	&РазрешитьНеУказыватьПодразделение КАК РазрешитьНеУказыватьПодразделение,
	|	&СчетУчета КАК СчетУчета,
	|	Материалы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Материалы.Ссылка.ПолучательИмущества = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА Материалы.Ссылка.Контрагент
	|		ИНАЧЕ Материалы.Ссылка.ПолучательИмущества.Контрагент
	|	КОНЕЦ КАК ДопАналитика,
	|	ВЫБОР
	|		КОГДА &ВидДопСубконто27 <> НЕОПРЕДЕЛЕНО
	|			ТОГДА &ВидДопСубконто27
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.ПустаяСсылка)
	|	КОНЕЦ КАК ДопИзмерениеВидСубконто,
	|	ВЫБОР
	|		КОГДА &ВидДопСубконто27 <> НЕОПРЕДЕЛЕНО
	|			ТОГДА Материалы.ДополнительноеСубконтоСчета
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДопИзмерение,
	|	НЕОПРЕДЕЛЕНО КАК ДопИзмерениеПолучатель,
	|	Материалы.Количество КАК Количество,
	|	ЛОЖЬ КАК НеПересчитыватьСумму,
	|	0 КАК СуммаСписания,
	|	0 КАК СуммаСписанияНУ
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.УстановитьПараметр("СчетУчета", Счет27);
	Запрос.УстановитьПараметр("ВидДопСубконто27", ВидДопСубконто27);
	Запрос.УстановитьПараметр("УчетПоПодразделениям", СвойстваСчета.УчетПоПодразделениям);
	Запрос.УстановитьПараметр("РазрешитьНеУказыватьПодразделение", СвойстваСчета.РазрешитьНеУказыватьПодразделение);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТекстЗапросаТаблицыДляРасчетаДвижений() Экспорт
	Возврат
	"ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка КАК Ссылка,
	|	ПоступлениеМЗМатериалы.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура КАК Номенклатура,
	|	ПоступлениеМЗМатериалы.Количество КАК Количество,
	|	ПоступлениеМЗМатериалы.КПС КАК КПС,
	|	ПоступлениеМЗМатериалы.КФО КАК КФО,
	|	ПоступлениеМЗМатериалы.СчетУчета КАК СчетУчета,
	|	ПоступлениеМЗМатериалы.КЭК КАК КЭК,
	|	ПоступлениеМЗМатериалы.ДополнительнаяАналитикаСчета КАК ДополнительнаяАналитикаСчета,
	|	ПоступлениеМЗМатериалы.Ссылка.Дата КАК Дата,
	|	ПоступлениеМЗМатериалы.Ссылка.Организация КАК Организация,
	|	ПоступлениеМЗМатериалы.Ссылка.ИФО КАК ИФО
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)";
КонецФункции

// Настройка недоступности элементов таблицы.
// Ключ структуры - Имя табличной части, значение - массив имен реквизитов табличной части.
// 
// Возвращаемое значение:
//  Структура - Настройка недоступности элементов таблицы:
// * Материалы - Массив из Строка - имена элементов
Функция НастройкаНедоступностиЭлементовТаблицы() Экспорт
	Результат = Новый Структура;
	ИменаРеквизитов = Новый Массив;
	ИменаРеквизитов.Добавить("Номенклатура");
	ИменаРеквизитов.Добавить("Количество");
	ИменаРеквизитов.Добавить("КФО");
	ИменаРеквизитов.Добавить("СчетУчета");
	ИменаРеквизитов.Добавить("КЭК");
	ИменаРеквизитов.Добавить("ЕдиницаИзмерения");
	ИменаРеквизитов.Добавить("КоличествоМест");
	ИменаРеквизитов.Добавить("Коэффициент");
	ИменаРеквизитов.Добавить("Сумма");
	Результат.Вставить("Материалы", ИменаРеквизитов);
	Возврат Результат;
КонецФункции

// Добавить данные для печати0510448.
// 
// Параметры:
//  ДанныеДляПечати - см. УправлениеПечатьюБГУ.ТаблицаШапкиАктОПриемеПередачеОбъектовНефинансовыхАктивов0510448
//  МассивОбъектов - Массив из ДокументСсылка.ПоступлениеМЗ
//  МЗПоСебестоимости - Булево - печать по себестоимости или по цене реализации
Процедура ДобавитьДанныеДляПечати0510448(ДанныеДляПечати, МассивОбъектов, МЗПоСебестоимости) Экспорт
	
	УправлениеМатериальнымиЗапасами.ДобавитьДанныеДляПечати0510448(ДанныеДляПечати, МассивОбъектов,
		ТекстыЗапросовДляПечати0510448(), МЗПоСебестоимости);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнятьДатуНомерДокументаПоставщика(Документ) Экспорт
	
	Если Документ.ВидПоступленияМЗ = Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования
			Или Не ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Документ.Дата)
			Или Не ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(Документ.Материалы)
			Или Не Документ.ОтражатьВПрослеживаемости Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПервичныеДокументыБГУКлиентСервер.ВыбранУказанныйПервичныйДокумент(
			Документ.ПервичныйДокумент, "АктПриемаПередачи0510448") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СчетаПрослеживаемыхМЗ = УправлениеМатериальнымиЗапасами.СчетаУчетаПрослеживаемыхМЗ(
		Документ.Дата, Документ.Организация);
	Возврат СчетаПрослеживаемыхМЗ.Получить(Документ.СчетУчета) <> Неопределено;
КонецФункции

#Область ПрослеживаемыйТовар

//Формирует текст запроса для определения прослеживаемого товара в документе
//
// Возвращаемое значение:
//  Строка - Текст сформированного запроса.
//
Функция ТекстЗапросаТаблицаПрослеживаемыхТоваровПоОснованию() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Номенклатура КАК Номенклатура,
	|	СУММА(ПоступлениеМЗМатериалы.Количество) КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеМЗМатериалы.Ссылка.СуммаВключаетНДС
	|				ТОГДА ПоступлениеМЗМатериалы.Сумма - ПоступлениеМЗМатериалы.СуммаНДС
	|			ИНАЧЕ ПоступлениеМЗМатериалы.Сумма
	|		КОНЕЦ) КАК Сумма,
	|	ПоступлениеМЗМатериалы.Ссылка.Организация КАК Организация,
	|	ПоступлениеМЗМатериалы.Ссылка.Дата КАК ПериодСобытия,
	|	ПоступлениеМЗМатериалы.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|ГДЕ
	|	ПоступлениеМЗМатериалы.ПрослеживаемыйТовар
	|	И ПоступлениеМЗМатериалы.Ссылка = &Основание
	|	И ЕСТЬNULL(ПоступлениеМЗМатериалы.Ссылка.Контрагент.ЮридическоеФизическоеЛицо.СтранаРегистрации.УчастникЕАЭС, ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Ссылка.Организация,
	|	ПоступлениеМЗМатериалы.Ссылка.Дата,
	|	ПоступлениеМЗМатериалы.СтранаПроисхождения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТоваров.Количество КАК Количество,
	|	ВТ_ТаблицаТоваров.Сумма КАК Сумма,
	|	ВТ_ТаблицаТоваров.Организация КАК Организация,
	|	ВТ_ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРегистрацииПрослеживаемыхТоваров.ВвозТоваровИзЕАЭС) КАК ВидОперации,
	|	ВТ_ТаблицаТоваров.Номенклатура.КодТНВЭД КАК ТНВЭД,
	|	ВТ_ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ТоварыПоОснованию
	|ИЗ
	|	ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_ТаблицаТоваров.Количество КАК Количество,
	|	ВТ_ТаблицаТоваров.Сумма КАК Сумма,
	|	ВТ_ТаблицаТоваров.Организация КАК Организация,
	|	ВТ_ТаблицаТоваров.ПериодСобытия КАК ПериодСобытия,
	|	ЛОЖЬ КАК РанееРегистрировалсяВПрослеживаемости,
	|	0 КАК КоличествоУчет,
	|	ВТ_ТаблицаТоваров.ТНВЭД КАК ТНВЭД,
	|	ВТ_ТаблицаТоваров.ВидОперации КАК ВидОперации,
	|	ВТ_ТаблицаТоваров.СтранаПроисхождения КАК СтранаПроисхождения
	|ПОМЕСТИТЬ ВТ_ТаблицаТоваровРазмеченный
	|ИЗ
	|	ВТ_ТоварыПоОснованию КАК ВТ_ТаблицаТоваров";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Дата, Номер, ЭтоКорректировка, ДокументОснование, ЗабалансовыйСчет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ПериодДвижений", ДанныеДокумента.Дата); 
	Запрос.УстановитьПараметр("ГраницаДокумента", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ИмяДокумента"			, НСтр("ru = 'Приходный ордер'"));
	Запрос.УстановитьПараметр("НомерДокумента",
		ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ДокументСсылка, ДанныеДокумента.Номер));
	Если ДанныеДокумента.ЭтоКорректировка Тогда
		Запрос.УстановитьПараметр("КорректируемыйДокумент", ДанныеДокумента.ДокументОснование);
	КонецЕсли;
	УчетПодр = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям")
		И БухгалтерскийУчетПовтИсп.ПолучитьПризнакиУчета("02").УчетПоПодразделениям;
	Запрос.УстановитьПараметр("УчетПоПодразделениям", УчетПодр);
	Запрос.УстановитьПараметр("ЕстьОС", БухгалтерскиеОперации.ЕстьВидСубконто(ДанныеДокумента.ЗабалансовыйСчет, "ОсновныеСредства"));
	
	НомераТаблиц = Новый Структура;
	
	ИнициализироватьЗапросыПоОстаткамТоваров(Запрос, НомераТаблиц);
	ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц, ДанныеДокумента.ЭтоКорректировка, ДанныеДокумента.ДокументОснование);
	ИнициализироватьЗапросыПоОтражениюЭДВУчете(Запрос, НомераТаблиц);
	
	ТекстУсловияСписанияЗабалансовыхОС = "ОсновныеСредства.Ссылка.ВидПоступленияМЗ = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета)
	|	И &ЕстьОС";
	
	УправлениеМатериальнымиЗапасами.ИнициализироватьЗапросыСписанияЗабалансовыхОС(
	Запрос,
	НомераТаблиц,
	"Документ.ПоступлениеМЗ.Материалы",
	ТекстУсловияСписанияЗабалансовыхОС);

	ПрослеживаемостьБГУ.ИнициализироватьЗапросыСвойстваРНПТ(ДокументСсылка, Запрос, НомераТаблиц);

	ИнициализироватьЗапросыПоРеализованнымТоварамКомитентов(Запрос, НомераТаблиц, ДанныеДокумента.Дата);
	
	ИнициализироватьЗапросыПоЗакупленнымТоварамКомитентов(Запрос, НомераТаблиц, ДанныеДокумента.Дата);
	
	Результат = Запрос.ВыполнитьПакет();
	ОбщегоНазначенияБГУ.ВыгрузитьТаблицыЗапроса(ДополнительныеСвойства.ТаблицыДляДвижений, Результат, НомераТаблиц);
	
	БухгалтерскийУчет.УстановитьПериодВТаблицахДляПроведения(ДополнительныеСвойства.ТаблицыДляДвижений,
		ДокументСсылка);
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыДМ(Запрос, НомераТаблиц, ЭтоКорректировка, КорректируемыйДокумент)

	Запрос.УстановитьПараметр("ИмяДокументаДМ", НСтр("ru = 'Приходный ордер / Требование-накладная'"));
	
	ПараметрыЗапроса = УчетДрагМатериалов.ТекстЗапросаДвиженияНаличиеДрагМатериаловВОбъектахНФА_Параметры(
		"Документ.ПоступлениеМЗ.ДрагоценныеМатериалы", "Приход");
	ПараметрыЗапроса.ЭтоКорректировка = ЭтоКорректировка;
	ПараметрыЗапроса.КорректируемыйДокумент = КорректируемыйДокумент;
	
	УчетДрагМатериалов.ИнициализироватьДанныеДокумента(Запрос, НомераТаблиц, ПараметрыЗапроса);
	 
КонецПроцедуры	

Процедура ИнициализироватьЗапросыПоОстаткамТоваров(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("ДвиженияТоваров",       НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТоварыВТорговыхТочках", НомераТаблиц.Количество());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Дата КАК Период,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка КАК Регистратор,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Организация КАК Организация,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.ЦМО КАК ЦМО,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ИзмененияОстатковТоваровВТорговойТочкеТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ДвиженияТоваров
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ИзмененияОстатковТоваровВТорговойТочкеТовары
	|ГДЕ
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка = &Ссылка
	|	И ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.ПоступлениеТоваровНаСкладТорговойТочки = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Номенклатура,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.ЦМО,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Организация,
	|	ИзмененияОстатковТоваровВТорговойТочкеТовары.Ссылка.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ДвиженияТоваров.Период КАК Период,
	|	ДвиженияТоваров.Регистратор КАК Регистратор,
	|	ДвиженияТоваров.Организация КАК Организация,
	|	ДвиженияТоваров.ЦМО КАК ЦМО,
	|	ДвиженияТоваров.Номенклатура КАК Номенклатура,
	|	ДвиженияТоваров.Количество КАК Количество
	|ИЗ
	|	ДвиженияТоваров КАК ДвиженияТоваров";
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыПоОтражениюЭДВУчете(Запрос, НомераТаблиц)
	
	НомераТаблиц.Вставить("ОтражениеЭДВУчете", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() +
	РегистрыНакопления.ОтражениеЭДВУчете.ТекстЗапросаПоОтражениюЭДВУчете(Запрос.Параметры.Ссылка);
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыПоРеализованнымТоварамКомитентов(Запрос, НомераТаблиц, ДатаДокумента)
	
	Запрос.УстановитьПараметр("Счет", БухгалтерскийУчет.СписокСчетов("02.33", ДатаДокумента));
	
	НомераТаблиц.Вставить("РеализованныеТоварыКомитентов", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеМЗ.Дата КАК Период,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.ДополнительнаяАналитикаСчета КАК Документ.ПоступлениеМЗ).Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.ДополнительнаяАналитикаСчета КАК Документ.ПоступлениеМЗ).Договор КАК ДоговорКомитента,
	|	ПоступлениеМЗМатериалы.Номенклатура КАК Номенклатура,
	|	ПоступлениеМЗ.Контрагент КАК Покупатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ДокументОснование ССЫЛКА Документ.НакладнаяНаОтпускМ15
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеМЗ.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).Дата
	|		КОГДА ПоступлениеМЗ.ДокументОснование ССЫЛКА Документ.НакладнаяНаРеализациюТорг12
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеМЗ.ДокументОснование КАК Документ.НакладнаяНаРеализациюТорг12).Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаРеализации,
	|	ПоступлениеМЗ.Ссылка КАК ДокументРасчетов,
	|	СУММА(-ПоступлениеМЗМатериалы.Количество) КАК Количество,
	|	СУММА(-ПоступлениеМЗМатериалы.Всего) КАК Выручка,
	|	СУММА(-ПоступлениеМЗМатериалы.ЦенаОприходования * ПоступлениеМЗМатериалы.Количество) КАК СуммаПоступления,
	|	СУММА(-ПоступлениеМЗМатериалы.СуммаНДС) КАК СуммаНДС,
	|	ПоступлениеМЗ.Ссылка КАК Ссылка,
	|	ПоступлениеМЗ.Договор КАК Договор
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка = &Ссылка
	|	И ПоступлениеМЗМатериалы.СчетУчета В(&Счет)
	|	И ПоступлениеМЗ.ВидПоступленияМЗ = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленийМЗ.ВозвратОтПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеМЗ.Дата,
	|	ПоступлениеМЗ.Организация,
	|	ПоступлениеМЗ.Контрагент,
	|	ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.ДополнительнаяАналитикаСчета КАК Документ.ПоступлениеМЗ).Контрагент,
	|	ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.ДополнительнаяАналитикаСчета КАК Документ.ПоступлениеМЗ).Договор,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗ.Ссылка,
	|	ПоступлениеМЗ.Договор,
	|	ПоступлениеМЗ.Ссылка,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ДокументОснование ССЫЛКА Документ.НакладнаяНаОтпускМ15
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеМЗ.ДокументОснование КАК Документ.НакладнаяНаОтпускМ15).Дата
	|		КОГДА ПоступлениеМЗ.ДокументОснование ССЫЛКА Документ.НакладнаяНаРеализациюТорг12
	|			ТОГДА ВЫРАЗИТЬ(ПоступлениеМЗ.ДокументОснование КАК Документ.НакладнаяНаРеализациюТорг12).Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ"; 
	
КонецПроцедуры

Процедура ИнициализироватьЗапросыПоЗакупленнымТоварамКомитентов(Запрос, НомераТаблиц, ДатаДокумента)
	
	Запрос.УстановитьПараметр("СчетЗакупленныхТоваровКомитенту", БухгалтерскийУчет.СписокСчетов("02.34", ДатаДокумента));
	
	НомераТаблиц.Вставить("ЗакупленныеТоварыКомитентов", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + 
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеМЗ.Дата КАК Период,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	ПоступлениеМЗМатериалы.Комитент КАК Контрагент,
	|	ПоступлениеМЗМатериалы.ДоговорКомитента КАК ДоговорКонтрагента,
	|	ПоступлениеМЗМатериалы.Номенклатура КАК Номенклатура,
	|	ПоступлениеМЗ.Ссылка КАК Партия,
	|	СУММА(ПоступлениеМЗМатериалы.Количество) КАК Количество,
	|	СУММА(ПоступлениеМЗМатериалы.Всего) КАК Сумма,
	|	СУММА(ПоступлениеМЗМатериалы.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка = &Ссылка
	|	И ПоступлениеМЗМатериалы.СчетУчета В(&СчетЗакупленныхТоваровКомитенту)
	|	И ПоступлениеМЗ.ВидПоступленияМЗ = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленийМЗ.ПоступлениеОтПоставщика)
	|	И ПоступлениеМЗМатериалы.КомиссионнаяТорговля
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеМЗ.Дата,
	|	ПоступлениеМЗ.Организация,
	|	ПоступлениеМЗМатериалы.Комитент,
	|	ПоступлениеМЗМатериалы.ДоговорКомитента,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗ.Ссылка";
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
	КомандаПечати.Идентификатор		= "ОтветныйАктПриемаПередачи0510448";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Ответный Акт о приеме-передаче НФА'"), "0510448", "61н", "100н");
	КомандаПечати.Порядок			= 1;
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "НФАПереданыЭлектроннымАктом",
		Истина, ВидСравнения.Равно);

	КомандаПечати					= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.НакладнаяНаОтпускМ15";
	КомандаПечати.Идентификатор		= "АктПриемаПередачи0510448";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт о приеме-передаче НФА'"), "0510448", "61н", "100н");
	КомандаПечати.Порядок			= 1;
	УсловияВидимости = Новый Массив;
	УсловияВидимости.Добавить(Перечисления.ВидыПоступленийМЗ.Поступление);
	УсловияВидимости.Добавить(Перечисления.ВидыПоступленийМЗ.ВозвратИзДоверительногоУправления);
	УсловияВидимости.Добавить(Перечисления.ВидыПоступленийМЗ.ВозвратИзАренды);
	УсловияВидимости.Добавить(Перечисления.ВидыПоступленийМЗ.ВозвратИзБезвПользования);
	УсловияВидимости.Добавить(Перечисления.ВидыПоступленийМЗ.ОприходованиеСЗабалансовогоСчета);
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидПоступленияМЗ",
		УсловияВидимости, ВидСравнения.ВСписке);
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	УправлениеПечатью.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "НФАПереданыЭлектроннымАктом",
		Ложь, ВидСравнения.Равно);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
	КомандаПечати.Идентификатор		= "Акт0510434";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт приема-передачи в личное пользование'"), "0510434", "61н");
	КомандаПечати.Порядок			= 2;
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "ВидПоступленияМЗ",
		Перечисления.ВидыПоступленийМЗ.ВозвратИзЛичногоПользования);
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
	КомандаПечати.Идентификатор		= "ПриходныйОрдер0504207_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Приходный ордер'"), "0504207", "52н", "103н");
	КомандаПечати.Порядок			= 3;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати, Истина, Истина);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
	КомандаПечати.Идентификатор		= "ПриходныйОрдер0504207_52н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Приходный ордер'"), "0504207", "52н");
	КомандаПечати.Порядок			= 4;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати, Истина, Истина);
	
	УправлениеПечатьюБГУ.ДобавитьКомандуПечати(КомандыПечати, "СправкаОСодержанииДрагМатериалов", 5);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
	КомандаПечати.Идентификатор		= "ТребованиеНакладная0504204_103н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Требование - накладная'"), "0504204", "52н", "103н", Истина);
	КомандаПечати.Порядок			= 100;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
	КомандаПечати.Идентификатор		= "ТребованиеНакладная0504204_52н";
	КомандаПечати.Представление		= УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(
		НСтр("ru = 'Требование - накладная'"), "0504204", "52н", , Истина);
	КомандаПечати.Порядок			= 100;
	ПервичныеДокументыБГУ.УстановитьСвойстваКомандыПечати(КомандаПечати);
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПоступлениеМЗ";
	КомандаПечати.Идентификатор		= "ПриходныйОрдерМ4";
	КомандаПечати.Представление		= НСтр("ru = '(устарел) Приходный ордер (М-4)'");
	КомандаПечати.Порядок			= 101;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТребованиеНакладная0504204_103н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ТребованиеНакладная0504204_103н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Требование - накладная'"), "0504204", "52н", "103н"),
			ПечатьНакладной0504204(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ТребованиеНакладная0504204_103н"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТребованиеНакладная0504204_52н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ТребованиеНакладная0504204_52н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Требование - накладная'"), "0504204", "52н"),
			ПечатьНакладной0504204(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ТребованиеНакладная0504204"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходныйОрдер0504207_103н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПриходныйОрдер0504207_103н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Приходный ордер'"), "0504207", "52н", "103н"),
			Печать0504207(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПриходныйОрдер0504207_103н"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходныйОрдер0504207_52н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПриходныйОрдер0504207_52н",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Приходный ордер'"), "0504207", "52н"),
			Печать0504207(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ПриходныйОрдер0504207"));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриходныйОрдерМ4") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПриходныйОрдерМ4",
			"Поступление МЗ",
			ПечатьМ4(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"СправкаОСодержанииДрагМатериалов") Тогда
		
		ТабличныйДокумент = УчетДрагМатериалов.ПечатьСправкиОСодержанииДрагМатериалов(МассивОбъектов, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"СправкаОСодержанииДрагМатериалов","Справка о содержании драг. материалов", ТабличныйДокумент);
			
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Акт0510434") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Акт0510434",
			УправлениеПечатьюБГУ.ПредставлениеКомандыПечати(НСтр("ru = 'Акт приема-передачи в личное пользование'"), "0510434", "61н"),
			Напечатать0510434(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"АктПриемаПередачи0510448") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПриемаПередачи0510448",
			"Акт о приеме-передаче НФА (ф.0510448)",
			УправлениеПечатьюБГУ.Напечатать0510448(МассивОбъектов, ОбъектыПечати, Ложь));
		
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОтветныйАктПриемаПередачи0510448") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
			"ОтветныйАктПриемаПередачи0510448", "Ответный Акт о приеме-передаче НФА (ф.0510448)",
			ЭлектронныеДокументыБГУ.НапечататьОтветный0510448ДляМЗ(МассивОбъектов, ОбъектыПечати, Ложь));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстыЗапросовДляПечати0510448()
	ТекстыЗапросов = Новый Структура;
	ТекстыЗапросов.Вставить("Шапка");
	ТекстыЗапросов.Вставить("Материалы");
	ТекстыЗапросов.Вставить("ДрагоценныеМатериалы");
	ТекстыЗапросов.Вставить("ФизическиеЛица");
	ТекстыЗапросов.Вставить("Председатели");
	ТекстыЗапросов.Вставить("СоставКомиссии");
	ТекстыЗапросов.Вставить("ДополнительныеРеквизиты");
	
	ТекстыЗапросов.Шапка =
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Номер КАК Номер,
	|	Документ.Дата КАК Дата,
	|	Документ.Организация КАК Организация,
	|	Документ.ИФО КАК ИФО,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|			ТОГДА Документ.Контрагент.ГоловнаяОрганизация
	|		ИНАЧЕ Документ.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|		И Документ.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА Документ.Контрагент.ГоловнаяОрганизация.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|				И ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|					Справочник.ЮридическиеЛица).НаименованиеПолное <> """"
	|					ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|						Справочник.ЮридическиеЛица).НаименованиеПолное
	|				КОГДА Документ.Контрагент.ГоловнаяОрганизация.НаименованиеСокращенное <> """"
	|					ТОГДА Документ.Контрагент.ГоловнаяОрганизация.НаименованиеСокращенное
	|				ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Документ.Контрагент.ГоловнаяОрганизация)
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА Документ.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное <> """"
	|				ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).НаименованиеПолное
	|			КОГДА Документ.Контрагент.НаименованиеСокращенное <> """"
	|				ТОГДА Документ.Контрагент.НаименованиеСокращенное
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Документ.Контрагент)
	|		КОНЕЦ
	|	КОНЕЦ КАК КонтрагентНаименование,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|		И Документ.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|				Справочник.ЮридическиеЛица).КодПоППП.НаименованиеПолное
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК
	|				Справочник.ЮридическиеЛица).КодПоППП.НаименованиеПолное
	|	КОНЕЦ КАК КонтрагентУчредитель,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|		И Документ.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|				Справочник.ЮридическиеЛица).КодПоППП.Код
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоППП.Код
	|	КОНЕЦ КАК КонтрагентГлаваБК,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|		И Документ.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|				Справочник.ЮридическиеЛица).Бюджет.НаименованиеПолное
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК
	|				Справочник.ЮридическиеЛица).Бюджет.НаименованиеПолное
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентБюджетНаименование,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|		И Документ.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|				Справочник.ЮридическиеЛица).Бюджет.Код
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).Бюджет.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентОКТМО,
	|	ВЫБОР
	|		КОГДА Документ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|		И Документ.Контрагент.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|					Справочник.ЮридическиеЛица).КодПоРПБС <> """"
	|					ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ГоловнаяОрганизация.ЮридическоеФизическоеЛицо КАК
	|						Справочник.ЮридическиеЛица).КодПоРПБС
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|		КОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	|			ТОГДА ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС <> """"
	|					ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентКодРПБС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|				КОГДА Документ.Контрагент.НаименованиеСокращенное = """"
	|					ТОГДА ВЫБОР
	|						КОГДА Документ.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|						И НЕ Документ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|							ТОГДА Документ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|						ИНАЧЕ ПРЕДСТАВЛЕНИЕ(Документ.Контрагент)
	|					КОНЕЦ
	|				ИНАЧЕ Документ.Контрагент.НаименованиеСокращенное
	|			КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентОбособленноеПодразделениеНаименование,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|				КОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС <> """"
	|					ТОГДА ВЫРАЗИТЬ(Документ.Контрагент.ЮридическоеФизическоеЛицо КАК Справочник.ЮридическиеЛица).КодПоРПБС
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КонтрагентОбособленноеПодразделениеКодРПБС,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Документ.Контрагент.ОбособленноеПодразделение, ЛОЖЬ)
	|			ТОГДА Документ.Контрагент
	|	КОНЕЦ КАК КонтрагентОбособленноеПодразделение,
	|	Документ.ЦМО.Сотрудник КАК Сотрудник,
	|	Документ.ОснованиеДляАкта КАК НаименованиеОснования,
	|	Документ.НомерОснованияДляАкта КАК НомерОснования,
	|	Документ.ДатаОснованияДляАкта КАК ДатаОснования,
	|	ЕСТЬNULL(Документ.Комиссия.НаименованиеПриказа, """") КАК НаименованиеПриказа,
	|	ЕСТЬNULL(Документ.Комиссия.НомерПриказа, """") КАК НомерПриказа,
	|	ЕСТЬNULL(Документ.Комиссия.ДатаПриказа, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПриказа,
	|	Документ.Дата КАК ДатаСписания,
	|	ИСТИНА КАК Принятие,
	|	ИСТИНА КАК Передача,
	|	Документ.Ответственный КАК Ответственный,
	|	Документ.Руководитель КАК Руководитель,
	|	Документ.ВидПоступленияМЗ КАК ВидПередачиМЗ,
	|	ЛОЖЬ КАК Резервировать
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК Документ
	|ГДЕ
	|	Документ.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	
	ТекстыЗапросов.Материалы =
	"ВЫБРАТЬ
	|	Материалы.Ссылка КАК Ссылка,
	|	Материалы.НомерСтроки КАК НомерСтроки,
	|	Материалы.Номенклатура КАК НФА,
	|	ВЫБОР
	|		КОГДА Материалы.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА Материалы.Номенклатура.Наименование
	|		ИНАЧЕ Материалы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеНФА,
	|	"""" КАК КодПоОКОФ,
	|	Материалы.Номенклатура.МожетСодержатьДрагМатериалы КАК МожетСодержатьДрагМатериалы,
	|	ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка) КАК ИнвентарныйНомерСсылка,
	|	"""" КАК ИнвентарныйНомер,
	|	Материалы.Сумма КАК Сумма,
	|	Материалы.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА Материалы.Количество = 0
	|			ТОГДА Материалы.Сумма
	|		ИНАЧЕ Материалы.Сумма / Материалы.Количество
	|	КОНЕЦ КАК Цена,
	|	0 КАК СуммаАмортизации,
	|	0 КАК СуммаОбесценения,
	|	0 КАК СрокПолезногоИспользования,
	|	"""" КАК ДатаИнвКарточки,
	|	"""" КАК НомерИнвКарточки,
	|	0 КАК НормаАмортизации,
	|	Материалы.Сумма КАК СуммаВВалюте,
	|	"""" КАК ЗаводскойНомер,
	|	"""" КАК РеестровыйНомер,
	|	ВЫБОР
	|		КОГДА Материалы.Номенклатура.НоменклатурныйНомер = """"
	|			ТОГДА Материалы.Номенклатура.Код
	|		ИНАЧЕ Материалы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК ИнойНомер,
	|	"""" КАК ДатаВыпуска,
	|	Материалы.Номенклатура.Сведения КАК Сведения,
	|	"""" КАК Назначение,
	|	"""" КАК Адрес,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаВводаВЭксплуатацию,
	|	0 КАК ПорядокНачисления,
	|	NULL КАК ЗабалансовыйСчетУчета,
	|	NULL КАК ЗабалансовыйКПС,
	|	NULL КАК ЗабалансовыйКЭК,
	|	NULL КАК ЗабалансовыйДополнительнаяАналитикаСчета,
	|	Материалы.Номенклатура.ЕдиницаИзмерения.Код КАК ЕдИзмКод,
	|	Материалы.Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдИзмНаименование,
	|	Материалы.СчетУчета КАК СчетУчета
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	ТекстыЗапросов.ДрагоценныеМатериалы =
	"ВЫБРАТЬ
	|	ДрагоценныеМатериалы.Ссылка КАК Ссылка,
	|	ДрагоценныеМатериалы.ОбъектНФА КАК Номенклатура,
	|	ДрагоценныеМатериалы.ВидДрагМатериала КАК Драгметалл,
	|	ДрагоценныеМатериалы.ЕдИзм.Наименование КАК НаименованиеЕИ,
	|	ДрагоценныеМатериалы.ЕдИзм.Код КАК КодЕИ,
	|	ДрагоценныеМатериалы.МассаДМ КАК Количество
	|ИЗ
	|	Документ.ПоступлениеМЗ.ДрагоценныеМатериалы КАК ДрагоценныеМатериалы
	|ГДЕ
	|	ДрагоценныеМатериалы.Ссылка В (&МассивОбъектов)";
	
	ТекстыЗапросов.ФизическиеЛица =
	"ВЫБРАТЬ
	|	СоставКомиссииДокумента.Ссылка КАК Документ,
	|	СоставКомиссииДокумента.Сотрудник КАК Сотрудник,
	|	КОНЕЦПЕРИОДА(ПоступлениеМЗ.Дата, ДЕНЬ) КАК Период,
	|	ВЫРАЗИТЬ(Контрагенты.ЮридическоеФизическоеЛицо КАК Справочник.ФизическиеЛица) КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ФизическиеЛица
	|ИЗ
	|	Документ.ПоступлениеМЗ.СоставКомиссии КАК СоставКомиссииДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО СоставКомиссииДокумента.Ссылка = ПоступлениеМЗ.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО СоставКомиссииДокумента.Сотрудник = Сотрудники.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Сотрудники.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	СоставКомиссииДокумента.Ссылка В (&МассивОбъектов)
	|	И ПоступлениеМЗ.Ссылка В (&МассивОбъектов)";

	ТекстыЗапросов.Председатели =
	"ВЫБРАТЬ
	|	ПоступлениеМЗ.Ссылка КАК Документ,
	|	СоставВыбраннойКомиссии.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ Председатели
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК СоставВыбраннойКомиссии
	|		ПО ПоступлениеМЗ.Комиссия = СоставВыбраннойКомиссии.Ссылка
	|ГДЕ
	|	СоставВыбраннойКомиссии.СтатусЧленаКомиссии = ЗНАЧЕНИЕ(Перечисление.СтатусыЧленовКомиссии.Председатель)
	|	И ПоступлениеМЗ.Ссылка В (&МассивОбъектов)";
	
	ТекстыЗапросов.СоставКомиссии =
	"ВЫБРАТЬ
	|	СоставКомиссии.Ссылка КАК Ссылка,
	|	СоставКомиссии.Сотрудник КАК Сотрудник,
	|	ВЫБОР
	|		КОГДА Председатели.Сотрудник ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Председатель,
	|	ПолныеДанныеСотрудников.Должность.Наименование КАК НаименованиеДолжности,
	|	ПолныеДанныеСотрудников.Фамилия КАК Фамилия,
	|	ПолныеДанныеСотрудников.Имя КАК Имя,
	|	ПолныеДанныеСотрудников.Отчество КАК Отчество,
	|	СоставКомиссии.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Документ.ПоступлениеМЗ.СоставКомиссии КАК СоставКомиссии
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПолныеДанныеСотрудников КАК ПолныеДанныеСотрудников
	|		ПО СоставКомиссии.Ссылка = ПолныеДанныеСотрудников.Документ
	|		И СоставКомиссии.Сотрудник = ПолныеДанныеСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Председатели КАК Председатели
	|		ПО СоставКомиссии.Ссылка = Председатели.Документ
	|		И СоставКомиссии.Сотрудник = Председатели.Сотрудник
	|ГДЕ
	|	НЕ СоставКомиссии.Отсутствует
	|	И СоставКомиссии.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	ТекстыЗапросов.ДополнительныеРеквизиты =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	НоменклатураДополнительныеРеквизиты.НомерСтроки КАК НомерСтроки,
	|	НоменклатураДополнительныеРеквизиты.Свойство.Заголовок КАК Свойство,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|		ПО ПоступлениеМЗМатериалы.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки";
	
	Возврат ТекстыЗапросов;
	
КонецФункции

Функция ПечатьНакладной0504204(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов"	, МассивОбъектов);
	Запрос.УстановитьПараметр("Счет10539"		, БухгалтерскийУчетПовтИсп.СписокСчетов("105.39"));
	Запрос.УстановитьПараметр("Счет105"			, БухгалтерскийУчетПовтИсп.СписокСчетов("105.00,106.00", Неопределено, Истина));
	Запрос.УстановитьПараметр("Счета105"		, БухгалтерскийУчетПовтИсп.СписокСчетов("105.00, 113.00"));
	Запрос.УстановитьПараметр("Счета106"		, БухгалтерскийУчетПовтИсп.СписокСчетов("106.00"));
	
	НеУчитываемыеДопСубконто = Новый Массив;
	НеУчитываемыеДопСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	НеУчитываемыеДопСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	НеУчитываемыеДопСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Партии);
	НеУчитываемыеДопСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ВидыЗатрат);
	Запрос.УстановитьПараметр("НеУчитываемыеДопСубконто", НеУчитываемыеДопСубконто);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеМЗ.Ссылка КАК Ссылка,
	|	ПоступлениеМЗ.СчетУчета КАК СчетУчета
	|ПОМЕСТИТЬ СчетаДокументов
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	|	И НЕ ПоступлениеМЗ.СчетУчета В (&Счет105)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗ.Ссылка,
	|	ЕПСБУ.Ссылка
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ,
	|	ПланСчетов.ЕПСБУ КАК ЕПСБУ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	|	И ПоступлениеМЗ.СчетУчета В (&Счет105)
	|	И ЕПСБУ.Ссылка В(&Счета105, &Счета106)
	|	И ЕПСБУ.ЭлементГруппа = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	СчетУчета";
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеМЗ.Дата КАК Дата,
	|	ПоступлениеМЗ.Номер,
	|	ПоступлениеМЗ.Проведен,
	|	ПоступлениеМЗ.Организация,
	|	ПоступлениеМЗ.ИФО,
	|	ПоступлениеМЗ.СчетУчета КАК пКоррСчет,
	|	ПоступлениеМЗ.ЦМО КАК ЦМО,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка) КАК ЦМООтправитель,
	|	ПоступлениеМЗ.Ссылка КАК Ссылка,
	|	ПоступлениеМЗ.Организация.НаименованиеПолное КАК пНаименованиеОрганизации,
	|	ПоступлениеМЗ.Организация.КодОКПО КАК пКодОКПО,
	|	ПоступлениеМЗ.ЦМО.Сотрудник КАК МолПолучатель,
	|	ПоступлениеМЗ.ПолучательИмущества КАК МолОтправитель,
	|	"""" КАК пПодразделениеОтправитель,
	|	"""" КАК пПодразделениеОтправительКод,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ПоступлениеМЗ.Подразделение.ОбособленноеПодразделение = ИСТИНА
	|						ТОГДА ПоступлениеМЗ.Подразделение.НаименованиеПолное
	|					ИНАЧЕ ПоступлениеМЗ.Подразделение.Наименование
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК пПодразделениеПолучатель,
	|	ПоступлениеМЗ.Подразделение.Код КАК пПодразделениеПолучательКод,
	|	ПоступлениеМЗ.ОтветственныйИсполнитель,
	|	ПоступлениеМЗ.ОтветственныйИсполнительБух
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка КАК Ссылка,
	|	ПоступлениеМЗМатериалы.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Код КАК пКодМЦ,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование КАК пНоменклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер КАК пНоменклатурныйНомер,
	|	ПоступлениеМЗМатериалы.Номенклатура.ЕдиницаИзмерения.Код КАК пКодЕдиницы,
	|	ПоступлениеМЗМатериалы.Номенклатура.ЕдиницаИзмерения.Наименование КАК пЕдиница,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.СчетУчета В (&Счета106)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ПоступлениеМЗМатериалы.ДополнительнаяАналитикаСчета
	|	КОНЕЦ КАК ДопСубконто,
	|	ПоступлениеМЗМатериалы.Количество КАК пЗатребовано,
	|	ПоступлениеМЗМатериалы.Количество КАК пКоличество,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Сумма / ПоступлениеМЗМатериалы.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК пЦена,
	|	ПоступлениеМЗМатериалы.Сумма КАК пСумма,
	|	ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СчетУчета КАК ПланСчетов.ЕПСБУ) КАК Счет,
	|	ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) КАК КЭК,
	|	ПоступлениеМЗМатериалы.КПС,
	|	ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка) КАК КФО,
	|	"""" КАК Примечание,
	|	1 КАК ПорядокТЧ
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Код,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.ДополнительнаяАналитикаСчета,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗВозвратнаяТара.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма / ПоступлениеМЗВозвратнаяТара.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Сумма,
	|	ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.СчетУчета КАК ПланСчетов.ЕПСБУ),
	|	ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка),
	|	ПоступлениеМЗВозвратнаяТара.КПС,
	|	ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка),
	|	"""",
	|	2
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПорядокТЧ,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетДт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСДт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭКДт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт, ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка)) КАК СчетКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСКт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт, ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)) КАК КЭККт,
	|	ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КФО, ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка)) КАК КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Сумма,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоКт3 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 ССЫЛКА Справочник.Номенклатура
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.Номенклатура)
	|	КОНЕЦ КАК Материал,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 НЕ В (&НеУчитываемыеДопСубконто)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1, Неопределено)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 НЕ В (&НеУчитываемыеДопСубконто)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2, Неопределено)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 НЕ В (&НеУчитываемыеДопСубконто)
	|			ТОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3, Неопределено)
	|		ИНАЧЕ Неопределено
	|	КОНЕЦ КАК ДопСубконто,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.НомерСтроки,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Регистратор,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КоличествоДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.ЖурналОпераций
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(, , Регистратор В (&МассивОбъектов), , ) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаДокументов КАК СчетаДокументов
	|		ПО ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор = СчетаДокументов.Ссылка
	|			И (ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт = СчетаДокументов.СчетУчета
	|				ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт = СчетаДокументов.СчетУчета)
	|ГДЕ
	|	(ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский)
	|			ИЛИ ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский))
	|ИТОГИ ПО
	|	Регистратор";
	
	Возврат УправлениеПечатьюБГУ.ПечатьТребованияНакладной0504204(Запрос.ВыполнитьПакет(), ОбъектыПечати, ИмяМакета);
	
КонецФункции	

// Функция формирует табличный документ Приходный ордер (ф.0504207)
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция Печать0504207(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ПоступлениеМЗ) КАК Ссылка,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт КАК СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт КАК КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт КАК КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт КАК СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт КАК КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт КАК КЭККт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО КАК КФО,
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.Номенклатура)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК НоменклатураСсылка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СчетДтУчетКПС,
	|	МИНИМУМ(ЖурналПроводокЕПСБУДвиженияССубконто.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ СчетаДтКт
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор В (&МассивОбъектов)
	|				И (ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|					ИЛИ ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|					ИЛИ ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура))
	|				И СчетДт.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.Бухгалтерский),
	|			,
	|			) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор КАК Документ.ПоступлениеМЗ),
	|	ВЫБОР
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт1 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт2 КАК Справочник.Номенклатура)
	|		КОГДА ЖурналПроводокЕПСБУДвиженияССубконто.ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|			ТОГДА ВЫРАЗИТЬ(ЖурналПроводокЕПСБУДвиженияССубконто.СубконтоДт3 КАК Справочник.Номенклатура)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КФО,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭКДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.СчетДт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КПСКт,
	|	ЖурналПроводокЕПСБУДвиженияССубконто.КЭККт
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	НоменклатураСсылка,
	|	КПСДт";
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеМЗ.Ссылка КАК Ссылка,
	|	ПоступлениеМЗ.Номер КАК Номер,
	|	ПоступлениеМЗ.Дата КАК Дата,
	|	ПоступлениеМЗ.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	|	ПоступлениеМЗ.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	|	ПоступлениеМЗ.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	|	"""" КАК КодАналитики,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Организация.НаименованиеПолное = """"
	|			ТОГДА ПоступлениеМЗ.Организация.Наименование
	|		ИНАЧЕ ПоступлениеМЗ.Организация.НаименованиеПолное
	|	КОНЕЦ КАК Получатель,
	|	ПоступлениеМЗ.Организация.КодОКПО КАК ОКПОПолучатель,
	|	ПоступлениеМЗ.Подразделение КАК Подразделение,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Подразделение.НаименованиеПолное = """"
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПоступлениеМЗ.Подразделение)
	|		ИНАЧЕ ПоступлениеМЗ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК ПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ПоступлениеМЗ.ПолучательИмущества <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПоступлениеМЗ.ПолучательИмущества.Контрагент
	|		ИНАЧЕ ПоступлениеМЗ.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ПоступлениеМЗ.ПолучательИмущества <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПоступлениеМЗ.ПолучательИмущества.Контрагент.ЮридическоеФизическоеЛицо
	|		ИНАЧЕ ПоступлениеМЗ.Контрагент.ЮридическоеФизическоеЛицо
	|	КОНЕЦ КАК ЮридическоеФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ПоступлениеМЗ.ПолучательИмущества <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПРЕДСТАВЛЕНИЕ(ПоступлениеМЗ.ПолучательИмущества.Контрагент)
	|		КОГДА ПоступлениеМЗ.Контрагент.НаименованиеСокращенное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ПоступлениеМЗ.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|							И НЕ ПоступлениеМЗ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """"
	|						ТОГДА ПоступлениеМЗ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ПоступлениеМЗ.Контрагент)
	|				КОНЕЦ
	|		ИНАЧЕ ПоступлениеМЗ.Контрагент.НаименованиеСокращенное
	|	КОНЕЦ КАК Поставщик,
	|	ЕСТЬNULL(ПоступлениеМЗ.Контрагент.ЮридическоеФизическоеЛицо.КодОКПО, """") КАК ОКПОПоставщик,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И ПоступлениеМЗ.ПолучательИмущества <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПоступлениеМЗ.ПолучательИмущества.Контрагент.ИНН
	|		ИНАЧЕ ПоступлениеМЗ.Контрагент.ИНН
	|	КОНЕЦ КАК ИННПоставщик,
	|	ПоступлениеМЗ.Контрагент.КПП КАК КПППоставщик,
	|	ПоступлениеМЗ.Договор.Представление КАК Договор,
	|	ПоступлениеМЗ.ЦМО.Сотрудник КАК Принял,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗ.ЦМОСдал = ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка)
	|				И ПоступлениеМЗ.ПолучательИмущества <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ПоступлениеМЗ.ПолучательИмущества
	|		ИНАЧЕ ПоступлениеМЗ.ЦМОСдал.Сотрудник
	|	КОНЕЦ КАК Сдал,
	|	ПоступлениеМЗ.ВалютаДокумента КАК ВалютаДокумента,
	|	ПоступлениеМЗ.ОтветственныйИсполнитель КАК ОтветственныйИсполнитель,
	|	ПоступлениеМЗ.ОтветственныйИсполнительБух КАК ОтветственныйИсполнительБух
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеМЗМатериалы.Ссылка КАК Ссылка,
	|	1 КАК Порядок,
	|	ПоступлениеМЗМатериалы.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура КАК Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер КАК НомерНоменклатурный,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.Всего
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК Всего,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.СуммаНДС
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ КАК СуммаНДС,
	|	ПоступлениеМЗМатериалы.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Ссылка.ПринятьНДСКВычету = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|						ТОГДА ПоступлениеМЗМатериалы.Всего - ПоступлениеМЗМатериалы.СуммаНДС
	|					ИНАЧЕ (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2)))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|					ТОГДА ПоступлениеМЗМатериалы.Всего
	|				ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|			КОНЕЦ
	|	КОНЕЦ КАК Сумма,
	|	ПоступлениеМЗМатериалы.Количество КАК Количество,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт КАК СчетДт,
	|	ЕСТЬNULL(СчетаДтКт.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)) КАК КПСДт,
	|	СчетаДтКт.КПСКт КАК КПСКт,
	|	СчетаДтКт.СчетКт КАК СчетКт,
	|	СчетаДтКт.КЭКДт КАК КЭКДт,
	|	СчетаДтКт.КЭККт КАК КЭККт,
	|	СчетаДтКт.КФО КАК КФО,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Наименование КАК ЕдиницаНаименование,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Код КАК ЕдиницаКод
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (НЕ ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗМатериалы.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗМатериалы.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗМатериалы.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗМатериалы.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗМатериалы.КЭК = СчетаДтКт.КЭКДт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗМатериалы.КЭК <> ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗМатериалы.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗМатериалы.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗМатериалы.КПС = Т.КПСДт
	|				И ПоступлениеМЗМатериалы.КФО = Т.КФО
	|				И ПоступлениеМЗМатериалы.КЭК = Т.КЭКДт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка,
	|	1,
	|	ПоступлениеМЗМатериалы.НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.Всего
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.СуммаНДС
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Ссылка.ПринятьНДСКВычету = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|						ТОГДА ПоступлениеМЗМатериалы.Всего - ПоступлениеМЗМатериалы.СуммаНДС
	|					ИНАЧЕ (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2)))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|					ТОГДА ПоступлениеМЗМатериалы.Всего
	|				ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.Количество,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	ЕСТЬNULL(СчетаДтКт.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗМатериалы.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗМатериалы.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗМатериалы.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗМатериалы.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗМатериалы.КЭК = СчетаДтКт.КЭКДт
	|			И ПоступлениеМЗМатериалы.КПСРасчетов = СчетаДтКт.КПСКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗМатериалы.КЭК <> ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗМатериалы.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗМатериалы.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗМатериалы.КПС = Т.КПСДт
	|				И ПоступлениеМЗМатериалы.КФО = Т.КФО
	|				И ПоступлениеМЗМатериалы.КЭК = Т.КЭКДт
	|				И ПоступлениеМЗМатериалы.КПСРасчетов = Т.КПСКт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка,
	|	1,
	|	ПоступлениеМЗМатериалы.НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.Всего
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.СуммаНДС
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Ссылка.ПринятьНДСКВычету = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|						ТОГДА ПоступлениеМЗМатериалы.Всего - ПоступлениеМЗМатериалы.СуммаНДС
	|					ИНАЧЕ (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2)))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|					ТОГДА ПоступлениеМЗМатериалы.Всего
	|				ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.Количество,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	ЕСТЬNULL(СчетаДтКт.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (НЕ ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗМатериалы.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗМатериалы.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗМатериалы.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗМатериалы.КФО = СчетаДтКт.КФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗМатериалы.КЭК = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗМатериалы.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗМатериалы.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗМатериалы.КПС = Т.КПСДт
	|				И ПоступлениеМЗМатериалы.КФО = Т.КФО
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка,
	|	1,
	|	ПоступлениеМЗМатериалы.НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.Всего
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.СуммаНДС
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Ссылка.ПринятьНДСКВычету = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|						ТОГДА ПоступлениеМЗМатериалы.Всего - ПоступлениеМЗМатериалы.СуммаНДС
	|					ИНАЧЕ (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2)))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|					ТОГДА ПоступлениеМЗМатериалы.Всего
	|				ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.Количество,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	ЕСТЬNULL(СчетаДтКт.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗМатериалы.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗМатериалы.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗМатериалы.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗМатериалы.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗМатериалы.КПСРасчетов = СчетаДтКт.КПСКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗМатериалы.КЭК = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗМатериалы.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗМатериалы.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗМатериалы.КПС = Т.КПСДт
	|				И ПоступлениеМЗМатериалы.КФО = Т.КФО
	|				И ПоступлениеМЗМатериалы.КПСРасчетов = Т.КПСКт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка,
	|	1,
	|	ПоступлениеМЗМатериалы.НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.Всего
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.СуммаНДС
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Ссылка.ПринятьНДСКВычету = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|						ТОГДА ПоступлениеМЗМатериалы.Всего - ПоступлениеМЗМатериалы.СуммаНДС
	|					ИНАЧЕ (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2)))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|					ТОГДА ПоступлениеМЗМатериалы.Всего
	|				ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.Количество,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	ЕСТЬNULL(СчетаДтКт.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (НЕ ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗМатериалы.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗМатериалы.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗМатериалы.КФО = СчетаДтКт.КФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|	И НЕ СчетаДтКт.СчетДтУчетКПС
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗМатериалы.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗМатериалы.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗМатериалы.КФО = Т.КФО
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка,
	|	1,
	|	ПоступлениеМЗМатериалы.НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.Всего
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.СуммаНДС
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Ссылка.ПринятьНДСКВычету = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|						ТОГДА ПоступлениеМЗМатериалы.Всего - ПоступлениеМЗМатериалы.СуммаНДС
	|					ИНАЧЕ (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2)))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|					ТОГДА ПоступлениеМЗМатериалы.Всего
	|				ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.Количество,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	ЕСТЬNULL(СчетаДтКт.КПСДт, ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка)),
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗМатериалы.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗМатериалы.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗМатериалы.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗМатериалы.КПСРасчетов = СчетаДтКт.КПСКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|	И НЕ СчетаДтКт.СчетДтУчетКПС
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗМатериалы.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗМатериалы.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗМатериалы.КФО = Т.КФО
	|				И ПоступлениеМЗМатериалы.КПСРасчетов = Т.КПСКт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗМатериалы.Ссылка,
	|	1,
	|	ПоступлениеМЗМатериалы.НомерСтроки,
	|	ПоступлениеМЗМатериалы.Номенклатура,
	|	ПоступлениеМЗМатериалы.Номенклатура.Наименование,
	|	ПоступлениеМЗМатериалы.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.Всего
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗМатериалы.СуммаНДС
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ПоступлениеМЗМатериалы.Ссылка.ПринятьНДСКВычету = ИСТИНА
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|						ТОГДА ПоступлениеМЗМатериалы.Всего - ПоступлениеМЗМатериалы.СуммаНДС
	|					ИНАЧЕ (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.СуммаНДС * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2)))
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|					ТОГДА ПоступлениеМЗМатериалы.Всего
	|				ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗМатериалы.Всего * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ПоступлениеМЗМатериалы.Количество,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения,
	|	NULL,
	|	ЗНАЧЕНИЕ(Справочник.КлассификационныеПризнакиСчетов.ПустаяСсылка),
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗМатериалы.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗМатериалы.Ссылка = СчетаДтКт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗМатериалы.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	2,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	СчетаДтКт.КПСДт,
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (НЕ ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗВозвратнаяТара.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗВозвратнаяТара.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗВозвратнаяТара.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗВозвратнаяТара.КЭК = СчетаДтКт.КЭКДт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗВозвратнаяТара.КЭК <> ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗВозвратнаяТара.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗВозвратнаяТара.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗВозвратнаяТара.КПС = Т.КПСДт
	|				И ПоступлениеМЗВозвратнаяТара.КФО = Т.КФО
	|				И ПоступлениеМЗВозвратнаяТара.КЭК = Т.КЭКДт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	2,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	СчетаДтКт.КПСДт,
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗВозвратнаяТара.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗВозвратнаяТара.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗВозвратнаяТара.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗВозвратнаяТара.КЭК = СчетаДтКт.КЭКДт
	|			И ПоступлениеМЗВозвратнаяТара.КПСРасчетов = СчетаДтКт.КПСКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗВозвратнаяТара.КЭК <> ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗВозвратнаяТара.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗВозвратнаяТара.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗВозвратнаяТара.КПС = Т.КПСДт
	|				И ПоступлениеМЗВозвратнаяТара.КФО = Т.КФО
	|				И ПоступлениеМЗВозвратнаяТара.КЭК = Т.КЭКДт
	|				И ПоступлениеМЗВозвратнаяТара.КПСРасчетов = Т.КПСКт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	2,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	СчетаДтКт.КПСДт,
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (НЕ ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗВозвратнаяТара.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗВозвратнаяТара.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗВозвратнаяТара.КФО = СчетаДтКт.КФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗВозвратнаяТара.КЭК = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗВозвратнаяТара.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗВозвратнаяТара.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗВозвратнаяТара.КПС = Т.КПСДт
	|				И ПоступлениеМЗВозвратнаяТара.КФО = Т.КФО
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	2,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	СчетаДтКт.КПСДт,
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗВозвратнаяТара.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗВозвратнаяТара.КПС = СчетаДтКт.КПСДт
	|			И ПоступлениеМЗВозвратнаяТара.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗВозвратнаяТара.КПСРасчетов = СчетаДтКт.КПСКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.СчетДтУчетКПС
	|	И ПоступлениеМЗВозвратнаяТара.КЭК = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка)
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗВозвратнаяТара.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗВозвратнаяТара.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗВозвратнаяТара.КПС = Т.КПСДт
	|				И ПоступлениеМЗВозвратнаяТара.КФО = Т.КФО
	|				И ПоступлениеМЗВозвратнаяТара.КПСРасчетов = Т.КПСКт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	2,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	СчетаДтКт.КПСДт,
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (НЕ ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗВозвратнаяТара.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗВозвратнаяТара.КФО = СчетаДтКт.КФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|	И НЕ СчетаДтКт.СчетДтУчетКПС
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗВозвратнаяТара.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗВозвратнаяТара.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗВозвратнаяТара.КФО = Т.КФО
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	2,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения,
	|	СчетаДтКт.СчетДт,
	|	СчетаДтКт.КПСДт,
	|	СчетаДтКт.КПСКт,
	|	СчетаДтКт.СчетКт,
	|	СчетаДтКт.КЭКДт,
	|	СчетаДтКт.КЭККт,
	|	СчетаДтКт.КФО,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ПоступлениеМЗ.Ссылка
	|			И (ПоступлениеМЗ.НесколькоКПСРасчетов)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = СчетаДтКт.Ссылка
	|			И ПоступлениеМЗВозвратнаяТара.Номенклатура = СчетаДтКт.НоменклатураСсылка
	|			И ПоступлениеМЗВозвратнаяТара.КФО = СчетаДтКт.КФО
	|			И ПоступлениеМЗВозвратнаяТара.КПСРасчетов = СчетаДтКт.КПСКт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|	И НЕ СчетаДтКт.СчетДтУчетКПС
	|	И СчетаДтКт.НомерСтроки В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				Т.НомерСтроки
	|			ИЗ
	|				СчетаДтКт КАК Т
	|			ГДЕ
	|				ПоступлениеМЗВозвратнаяТара.Ссылка = Т.Ссылка
	|				И ПоступлениеМЗВозвратнаяТара.Номенклатура = Т.НоменклатураСсылка
	|				И ПоступлениеМЗВозвратнаяТара.КФО = Т.КФО
	|				И ПоступлениеМЗВозвратнаяТара.КПСРасчетов = Т.КПСКт
	|			УПОРЯДОЧИТЬ ПО
	|				Т.НомерСтроки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка,
	|	2,
	|	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НаименованиеПолное,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	0,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	|			ТОГДА ПоступлениеМЗВозвратнаяТара.Сумма
	|		ИНАЧЕ ВЫРАЗИТЬ(ПоступлениеМЗВозвратнаяТара.Сумма * ЕСТЬNULL(ОперацииДокументов.Курс, 1) / ЕСТЬNULL(ОперацииДокументов.Кратность, 1) КАК ЧИСЛО(18, 2))
	|	КОНЕЦ,
	|	ПоступлениеМЗВозвратнаяТара.Количество,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	NULL,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Наименование,
	|	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения.Код
	|ИЗ
	|	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаДтКт КАК СчетаДтКт
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = СчетаДтКт.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	|		ПО ПоступлениеМЗВозвратнаяТара.Ссылка = ОперацииДокументов.Документ
	|ГДЕ
	|	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	|	И СчетаДтКт.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Возврат УправлениеПечатьюБГУ.ПечатьПриходногоОрдера_0504207(РезультатЗапроса, ОбъектыПечати, , ИмяМакета);
	
КонецФункции

// Функция формирует табличный документ Приходный ордер (ф.М-4)
//
// Параметры: 
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ.
//
Функция ПечатьМ4(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫПЕЧАТИ_ПРИХОДНЫЙОРДЕР_М4";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПоступлениеМЗМатериалы.Ссылка КАК Ссылка,
	               |	1 КАК Порядок,
	               |	ПоступлениеМЗМатериалы.НомерСтроки КАК НомерСтроки,
	               |	ПоступлениеМЗМатериалы.Номенклатура КАК Номенклатура,
	               |	ПоступлениеМЗМатериалы.Номенклатура.НоменклатурныйНомер КАК НоменклатурныйНомер,
	               |	ПоступлениеМЗМатериалы.Всего КАК Всего,
	               |	ПоступлениеМЗМатериалы.СуммаНДС КАК СуммаНДС,
	               |	ПоступлениеМЗМатериалы.СтавкаНДС КАК СтавкаНДС,
	               |	ПоступлениеМЗМатериалы.Сумма КАК Сумма,
	               |	ПоступлениеМЗМатериалы.Количество КАК Количество,
	               |	ПоступлениеМЗМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	               |ПОМЕСТИТЬ СоставыДокументов
	               |ИЗ
	               |	Документ.ПоступлениеМЗ.Материалы КАК ПоступлениеМЗМатериалы
	               |ГДЕ
	               |	ПоступлениеМЗМатериалы.Ссылка В(&МассивОбъектов)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПоступлениеМЗВозвратнаяТара.Ссылка,
	               |	2,
	               |	ПоступлениеМЗВозвратнаяТара.НомерСтроки,
	               |	ПоступлениеМЗВозвратнаяТара.Номенклатура,
	               |	ПоступлениеМЗВозвратнаяТара.Номенклатура.НоменклатурныйНомер,
	               |	ПоступлениеМЗВозвратнаяТара.Сумма,
	               |	0,
	               |	0,
	               |	0,
	               |	ПоступлениеМЗВозвратнаяТара.Количество,
	               |	ПоступлениеМЗВозвратнаяТара.Номенклатура.ЕдиницаИзмерения
	               |ИЗ
	               |	Документ.ПоступлениеМЗ.ВозвратнаяТара КАК ПоступлениеМЗВозвратнаяТара
	               |ГДЕ
	               |	ПоступлениеМЗВозвратнаяТара.Ссылка В(&МассивОбъектов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ОперацииДокументов.Курс, 0) = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ ОперацииДокументов.Курс
	               |	КОНЕЦ КАК Курс,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ОперацииДокументов.Кратность, 0) = 0
	               |			ТОГДА 1
	               |		ИНАЧЕ ОперацииДокументов.Кратность
	               |	КОНЕЦ КАК Кратность,
	               |	ПоступлениеМЗ.Ссылка КАК Документ
	               |ПОМЕСТИТЬ КурсИКратностьДокумента
	               |ИЗ
	               |	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОперацииДокументов КАК ОперацииДокументов
	               |		ПО ПоступлениеМЗ.Ссылка = ОперацииДокументов.Документ
	               |ГДЕ
	               |	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МАКСИМУМ(ЖурналПроводокЕПСБУ.СчетКт) КАК КорСчет,
	               |	ЖурналПроводокЕПСБУ.Регистратор КАК Ссылка,
	               |	МАКСИМУМ(ЖурналПроводокЕПСБУ.КПСКт) КАК КорСчетБК,
	               |	МАКСИМУМ(ЖурналПроводокЕПСБУ.КЭККт) КАК КорСчетКОСГУ,
	               |	МАКСИМУМ(ЖурналПроводокЕПСБУ.КФО) КАК КФО
	               |ПОМЕСТИТЬ КорСчета
	               |ИЗ
	               |	РегистрБухгалтерии.ЖурналПроводокЕПСБУ КАК ЖурналПроводокЕПСБУ
	               |ГДЕ
	               |	ЖурналПроводокЕПСБУ.Регистратор В(&МассивОбъектов)
	               |	И ЖурналПроводокЕПСБУ.СчетДт В(&Счет105106)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЖурналПроводокЕПСБУ.Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПоступлениеМЗ.Ссылка КАК Ссылка,
	               |	ПоступлениеМЗ.Номер КАК Номер,
	               |	ПоступлениеМЗ.Дата КАК Дата,
	               |	ПоступлениеМЗ.ВидПервичногоДокумента КАК ВидПервичногоДокумента,
	               |	ПоступлениеМЗ.ДатаПервичногоДокумента КАК ДатаПервичногоДокумента,
	               |	ПоступлениеМЗ.НомерПервичногоДокумента КАК НомерПервичногоДокумента,
	               |	"""" КАК КодАналитики,
	               |	ПоступлениеМЗ.Организация КАК Организация,
	               |	ПоступлениеМЗ.Организация.НаименованиеПолное КАК НаименованиеОрганизации,
	               |	ПоступлениеМЗ.Организация.КодОКПО КАК КодОКПО,
	               |	ПоступлениеМЗ.ЦМО.Сотрудник КАК СотрудникСсылка,
	               |	ПоступлениеМЗ.ЦМО.МестоХранения КАК МестоХраненияСсылка,
	               |	ПоступлениеМЗ.ЦМО.МестоХранения.Представление КАК МестоХранения,
	               |	ПоступлениеМЗ.Контрагент.Код КАК КодПоставщика,
	               |	ПоступлениеМЗ.Контрагент КАК Контрагент,
	               |	ПоступлениеМЗ.ВалютаДокумента КАК ВалютаДокумента,
	               |	ВЫБОР
	               |		КОГДА СоставыДокументов.Номенклатура.НаименованиеПолное = """"
	               |			ТОГДА ПРЕДСТАВЛЕНИЕ(СоставыДокументов.Номенклатура)
	               |		ИНАЧЕ СоставыДокументов.Номенклатура.НаименованиеПолное
	               |	КОНЕЦ КАК Номенклатура,
	               |	СоставыДокументов.НоменклатурныйНомер КАК НоменклатурныйНомер,
	               |	СоставыДокументов.Всего * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК Всего,
	               |	СоставыДокументов.СуммаНДС * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК НДС,
	               |	СоставыДокументов.СтавкаНДС КАК СтавкаНДС,
	               |	(ВЫРАЗИТЬ(СоставыДокументов.Всего * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(СоставыДокументов.СуммаНДС * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК ЧИСЛО(18, 2))) КАК Сумма,
	               |	СоставыДокументов.Количество КАК Количество,
	               |	СоставыДокументов.ЕдиницаИзмерения.Код КАК КодЕдИзм,
	               |	СоставыДокументов.ЕдиницаИзмерения.Представление КАК ЕдИзм,
	               |	ВЫБОР
	               |		КОГДА СоставыДокументов.Количество <> 0
	               |			ТОГДА ((ВЫРАЗИТЬ(СоставыДокументов.Всего * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(СоставыДокументов.СуммаНДС * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК ЧИСЛО(18, 2)))) / СоставыДокументов.Количество
	               |		ИНАЧЕ (ВЫРАЗИТЬ(СоставыДокументов.Всего * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК ЧИСЛО(18, 2))) - (ВЫРАЗИТЬ(СоставыДокументов.СуммаНДС * КурсИКратностьДокумента.Курс / КурсИКратностьДокумента.Кратность КАК ЧИСЛО(18, 2)))
	               |	КОНЕЦ КАК Цена,
	               |	КорСчета.КорСчет КАК КорСчет,
	               |	КорСчета.КорСчетБК КАК КорСчетБК,
	               |	КорСчета.КорСчетКОСГУ КАК КорСчетКОСГУ,
	               |	СоставыДокументов.Порядок КАК Порядок,
	               |	КорСчета.КФО КАК КФО
	               |ИЗ
	               |	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КурсИКратностьДокумента КАК КурсИКратностьДокумента
	               |		ПО ПоступлениеМЗ.Ссылка = КурсИКратностьДокумента.Документ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ СоставыДокументов КАК СоставыДокументов
	               |		ПО ПоступлениеМЗ.Ссылка = СоставыДокументов.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КорСчета КАК КорСчета
	               |		ПО ПоступлениеМЗ.Ссылка = КорСчета.Ссылка
	               |ГДЕ
	               |	ПоступлениеМЗ.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	Номер,
	               |	Порядок,
	               |	СоставыДокументов.НомерСтроки
	               |ИТОГИ
	               |	СУММА(Всего),
	               |	СУММА(НДС),
	               |	СУММА(Сумма),
	               |	СУММА(Количество),
	               |	МАКСИМУМ(КорСчет),
	               |	МАКСИМУМ(КорСчетБК),
	               |	МАКСИМУМ(КорСчетКОСГУ),
	               |	МАКСИМУМ(КФО)
	               |ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов"	, МассивОбъектов);
	Запрос.УстановитьПараметр("Счет105106"		, БухгалтерскийУчетПовтИсп.СписокСчетов("105.00,106.00"));
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ПриходныйОрдерМ4");
	ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
	ОбластьИтог			= Макет.ПолучитьОбласть("Итог");
	ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
	ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
    	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаШапка);
		СтруктураОбластьШапка = Новый Структура("НомерСопроводительногоДокумента,Номер,Поставщик,КорСчет");
		СтруктураОбластьШапка.НомерСопроводительногоДокумента 	= ВыборкаШапка.ВидПервичногоДокумента 
																+ ?(ПустаяСтрока(ВыборкаШапка.НомерПервичногоДокумента), "", " №"+ВыборкаШапка.НомерПервичногоДокумента)
																+ ?(ЗначениеЗаполнено(ВыборкаШапка.ДатаПервичногоДокумента), " от "+Формат(ВыборкаШапка.ДатаПервичногоДокумента,"ДЛФ=D"), "");
		ДанныеКонтрагента = Новый Структура("СсылкаНаОбъект, Период, НаименованиеПолное", ВыборкаШапка.Контрагент, ВыборкаШапка.Дата);
		Справочники.Контрагенты.ПолучитьДанныеКонтрагента(ДанныеКонтрагента);
		СтруктураОбластьШапка.Поставщик	= ДанныеКонтрагента.НаименованиеПолное;
		СтруктураОбластьШапка.Номер 	= ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка,ВыборкаШапка.Номер);
		СтруктураОбластьШапка.КорСчет	= УправлениеПечатьюБГУ.ПредставлениеРабочегоСчета("", ВыборкаШапка.КФО, ВыборкаШапка.КорСчет, "");
		ОбластьШапка.Параметры.Заполнить(СтруктураОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ВыборкаСтроки = ВыборкаШапка.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
		
			ОбластьСтрока.Параметры.Заполнить(ВыборкаСтроки);
			Если НЕ ТабличныйДокумент.ПроверитьВывод(ОбластьСтрока) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			КонецЕсли;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		КонецЦикла;
		СтруктураОбластьИтог = Новый Структура("КоличествоИтог,СуммаИтог,НДСИтог,ВсегоИтог");

		СтруктураОбластьИтог.КоличествоИтог	= ВыборкаШапка.Количество;
		СтруктураОбластьИтог.СуммаИтог		= ВыборкаШапка.Сумма;
		СтруктураОбластьИтог.НДСИтог		= ВыборкаШапка.НДС;
		СтруктураОбластьИтог.ВсегоИтог		= ВыборкаШапка.Всего;
		ОбластьИтог.Параметры.Заполнить(СтруктураОбластьИтог);
		ТабличныйДокумент.Вывести(ОбластьИтог);
		ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, Фамилия, Имя, Отчество, Должность",
											ВыборкаШапка.СотрудникСсылка, ВыборкаШапка.Дата);
		Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника, Истина);
		СтруктураОбластьПодвал = Новый Структура("ДолжностьМОЛ,ФИОМол");
		СтруктураОбластьПодвал.ДолжностьМОЛ	= ДанныеСотрудника.Должность;
		СтруктураОбластьПодвал.ФИОМол		= КорреспондентыКлиентСервер.ФИО(ДанныеСотрудника, Истина);
		ОбластьПодвал.Параметры.Заполнить(СтруктураОбластьПодвал);
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
													   НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
		
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДанныеДляПечати0510434(МассивОбъектов)
	
	ПодразделенияСписанияМЗ = УправлениеПечатьюБГУ.ПодразделенияСотрудниковМЗ0510434(МассивОбъектов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ПодразделенияСписанияМЗ", ПодразделенияСписанияМЗ);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодразделенияСписанияМЗ.Документ КАК Документ,
	|	ПодразделенияСписанияМЗ.Подразделение КАК Подразделение,
	|	ПодразделенияСписанияМЗ.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ПодразделенияСписанияМЗ
	|ИЗ
	|	&ПодразделенияСписанияМЗ КАК ПодразделенияСписанияМЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериальныеЗапасы.Ссылка КАК Ссылка,
	|	МатериальныеЗапасы.НомерСтроки КАК НомерСтроки,
	|	МатериальныеЗапасы.Номенклатура КАК Номенклатура,
	|	МатериальныеЗапасы.Количество КАК Количество,
	|	МатериальныеЗапасы.ВидимыеДефекты КАК ВидимыеДефекты,
	|	МатериальныеЗапасы.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ПодразделенияСписанияМЗ.Сотрудник КАК СотрудникОбеспечения,
	|	МатериальныеЗапасы.Сумма
	|ПОМЕСТИТЬ ВТ_Материалы
	|ИЗ
	|	Документ.ПоступлениеМЗ.Материалы КАК МатериальныеЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ПО МатериальныеЗапасы.Ссылка = ПоступлениеМЗ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияСписанияМЗ КАК ПодразделенияСписанияМЗ
	|		ПО ПоступлениеМЗ.Ссылка = ПодразделенияСписанияМЗ.Документ
	|ГДЕ
	|	МатериальныеЗапасы.Ссылка В (&МассивОбъектов)
	|	И ПоступлениеМЗ.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПодразделенияСписанияМЗ.Сотрудник КАК Сотрудник,
	|	ТЧОбеспечениеИмуществом.Имущество,
	|	ТЧОбеспечениеИмуществом.Приспособления КАК Приспособления,
	|	ТЧОбеспечениеИмуществом.РазмерОдежды КАК РазмерОдежды,
	|	ТЧОбеспечениеИмуществом.РазмерГоловногоУбора КАК РазмерГоловногоУбора,
	|	ТЧОбеспечениеИмуществом.РазмерОбуви КАК РазмерОбуви,
	|	ТЧОбеспечениеИмуществом.РазмерИное КАК РазмерИное,
	|	ТЧОбеспечениеИмуществом.НормаВыдачи КАК НормаВыдачи,
	|	ТЧОбеспечениеИмуществом.СрокИспользованияПоНормативу КАК СрокИспользованияПоНормативу,
	|	ТЧОбеспечениеИмуществом.ЕдиницаИзмеренияСрока КАК ЕдиницаИзмеренияСрока,
	|	ТЧОбеспечениеИмуществом.КодУсловияВозвратаИмущества КАК КодУсловияВозвратаИмущества
	|ПОМЕСТИТЬ Вт_ОбеспечениеИмуществом
	|ИЗ
	|	Справочник.ОбеспечениеСотрудниковИмуществом КАК ОбеспечениеСотрудниковИмуществом
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбеспечениеСотрудниковИмуществом.ОбеспечениеИмуществом КАК ТЧОбеспечениеИмуществом
	|		ПО ОбеспечениеСотрудниковИмуществом.Ссылка = ТЧОбеспечениеИмуществом.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПодразделенияСписанияМЗ КАК ПодразделенияСписанияМЗ
	|		ПО ОбеспечениеСотрудниковИмуществом.Владелец = ПодразделенияСписанияМЗ.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеМЗ.Ссылка КАК Ссылка,
	|	ПоступлениеМЗ.Номер КАК Номер,
	|	ПоступлениеМЗ.Дата КАК ДатаАкта,
	|	ПоступлениеМЗ.Организация КАК Организация,
	|	2 КАК Операция,
	|	ПодразделенияСписанияМЗ.Сотрудник КАК СотрудникОтправитель,
	|	ЕСТЬNULL(ПодразделенияСписанияМЗ.Сотрудник.Код, """") КАК ТабельныйНомерОтправитель,
	|	ПоступлениеМЗ.ЦМО.Сотрудник КАК СотрудникПолучатель,
	|	ЕСТЬNULL(ПоступлениеМЗ.ЦМО.Сотрудник.Код, """") КАК ТабельныйНомерПолучатель,
	|	ПоступлениеМЗ.ЦМО.МестоХранения.Наименование КАК МестонахождениеПолучатель,
	|	ПодразделенияСписанияМЗ.Подразделение КАК СтруктурноеПодразделениеОтправитель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПодразделенияСписанияМЗ.Подразделение.НаименованиеПолное, """") = """"
	|			ТОГДА ПодразделенияСписанияМЗ.Подразделение.Наименование
	|		ИНАЧЕ ПодразделенияСписанияМЗ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделенияОтправитель,
	|	ПоступлениеМЗ.Подразделение КАК СтруктурноеПодразделениеПолучатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПоступлениеМЗ.Подразделение.НаименованиеПолное, """") = """"
	|			ТОГДА ПоступлениеМЗ.Подразделение.Наименование
	|		ИНАЧЕ ПоступлениеМЗ.Подразделение.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеСтруктурногоПодразделенияПолучатель,
	|	ПодразделенияСписанияМЗ.Сотрудник КАК СотрудникОбеспечения,
	|	ПоступлениеМЗ.ВидПервичногоДокумента КАК НаименованиеПриказа,
	|	ПоступлениеМЗ.НомерПервичногоДокумента КАК НомерПриказа,
	|	ПоступлениеМЗ.ДатаПервичногоДокумента КАК ДатаПриказа
	|ИЗ
	|	Документ.ПоступлениеМЗ КАК ПоступлениеМЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияСписанияМЗ КАК ПодразделенияСписанияМЗ
	|		ПО ПоступлениеМЗ.Ссылка = ПодразделенияСписанияМЗ.Документ
	|ГДЕ
	|	ПоступлениеМЗ.Ссылка В (&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериальныеЗапасы.Ссылка КАК Ссылка,
	|	МатериальныеЗапасы.НомерСтроки КАК НомерСтроки,
	|	МатериальныеЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА МатериальныеЗапасы.Номенклатура.НаименованиеПолное = """"
	|			ТОГДА МатериальныеЗапасы.Номенклатура.Наименование
	|		ИНАЧЕ МатериальныеЗапасы.Номенклатура.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеМЗ,
	|	ВЫБОР
	|		КОГДА МатериальныеЗапасы.Номенклатура.НоменклатурныйНомер = """"
	|			ТОГДА МатериальныеЗапасы.Номенклатура.Код
	|		ИНАЧЕ МатериальныеЗапасы.Номенклатура.НоменклатурныйНомер
	|	КОНЕЦ КАК НоменклатурныйНомер,
	|	МатериальныеЗапасы.Номенклатура.ЕдиницаИзмерения.Наименование КАК НаименованиеЕИ,
	|	МатериальныеЗапасы.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕИ,
	|	МатериальныеЗапасы.Сумма КАК Сумма,
	|	МатериальныеЗапасы.Количество КАК Количество,
	|	МатериальныеЗапасы.ВидимыеДефекты КАК Дефекты,
	|	МатериальныеЗапасы.ОсобыеОтметки КАК ОсобыеОтметки,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.Приспособления, """") КАК Приспособления,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерОдежды, 0) КАК РазмерОдежды,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерГоловногоУбора, 0) КАК РазмерГоловногоУбора,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерОбуви, 0) КАК РазмерОбуви,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.РазмерИное, 0) КАК РазмерИное,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.НормаВыдачи, 0) КАК НормаВыдачи,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.СрокИспользованияПоНормативу, 0) КАК СрокПолезногоИспользования,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.ЕдиницаИзмеренияСрока, 0) КАК ЕдиницаИзмеренияСрока,
	|	ЕСТЬNULL(ОбеспечениеИмуществом.КодУсловияВозвратаИмущества, """") КАК КодВозврата
	|ИЗ
	|	ВТ_Материалы КАК МатериальныеЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вт_ОбеспечениеИмуществом КАК ОбеспечениеИмуществом
	|		ПО (МатериальныеЗапасы.СотрудникОбеспечения = ОбеспечениеИмуществом.Сотрудник)
	|		И МатериальныеЗапасы.Номенклатура = ОбеспечениеИмуществом.Имущество
	|ГДЕ
	|	МатериальныеЗапасы.Ссылка В (&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДляПечати = Новый Структура;
	ДанныеДляПечати.Вставить("ВыборкаДокументов"	, РезультатЗапроса[3]);
	ДанныеДляПечати.Вставить("ВыборкаМЗДок"			, РезультатЗапроса[4]);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция Напечатать0510434(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ДанныеДляПечати		= ДанныеДляПечати0510434(МассивОбъектов);
	ВыборкаДокументов	= ДанныеДляПечати.ВыборкаДокументов.Выбрать();
	ВыборкаМЗДок		= ДанныеДляПечати.ВыборкаМЗДок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДанныеДокументов = УправлениеПечатьюБГУ.ТаблицаШапкиДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434();
	Пока ВыборкаДокументов.Следующий() Цикл
		
		// Шапка
		СтрокаДокумента = ДанныеДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, ВыборкаДокументов);
		СтрокаДокумента.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(
			ВыборкаДокументов.Ссылка, ВыборкаДокументов.Номер);
		
		СотрудникиДокумента = Новый Массив;
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникОтправитель);
		СотрудникиДокумента.Добавить(ВыборкаДокументов.СотрудникПолучатель);
		ДанныеСотрудников = Справочники.Сотрудники.ДанныеСотрудников(СотрудникиДокумента,
			"Фамилия,Имя,Отчество,Должность,ДолжностьНаименование,НаименованиеПолное",
			ВыборкаДокументов.ДатаАкта);
		ДанныеСотрудникаОтправителя = ДанныеСотрудников.Получить(ВыборкаДокументов.СотрудникОтправитель);	
		СтрокаДокумента.ФИООтправитель = ДанныеСотрудникаОтправителя.НаименованиеПолное;
		
		ДанныеСотрудникаПолучателя = ДанныеСотрудников.Получить(ВыборкаДокументов.СотрудникПолучатель);	
		СтрокаДокумента.ФИОПолучатель = ДанныеСотрудникаПолучателя.НаименованиеПолное;
		
		СтруктураПоиска = Новый Структура("Ссылка", ВыборкаДокументов.Ссылка);
		СтрокаДокумента.МатериальныеЗапасы = УправлениеПечатьюБГУ.ТаблицаСведенияОбОбъектахМЗДляПечатиАктПриемаПередачиИмуществаВЛичномПользовании0510434();
		
		// Материальные запасы
		
		ВыборкаМЗДок.Сбросить();
		Если ВыборкаМЗДок.НайтиСледующий(СтруктураПоиска) Тогда
			ВыборкаМЗ = ВыборкаМЗДок.Выбрать();
			Пока ВыборкаМЗ.НайтиСледующий(СтруктураПоиска) Цикл
				СтрокаМЗ = СтрокаДокумента.МатериальныеЗапасы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаМЗ, ВыборкаМЗ);
			КонецЦикла;
		КонецЕсли;
		
		СтрокаДокумента.ОбъектыСдалНаименованиеДолжности = ДанныеСотрудникаОтправителя.ДолжностьНаименование;
		СтрокаДокумента.ОбъектыСдалДолжность = ДанныеСотрудникаОтправителя.Должность;
		СтрокаДокумента.ОбъектыСдалДолжность = ДанныеСотрудникаОтправителя.Должность;
		СтрокаДокумента.ОбъектыСдалСотрудник = ВыборкаДокументов.СотрудникОтправитель;
		СтрокаДокумента.ОбъектыСдалФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудникаОтправителя, Истина);
		
		СтрокаДокумента.ОбъектыПринялНаименованиеДолжности = ДанныеСотрудникаПолучателя.ДолжностьНаименование;
		СтрокаДокумента.ОбъектыПринялДолжность = ДанныеСотрудникаПолучателя.Должность;
		СтрокаДокумента.ОбъектыПринялДолжность = ДанныеСотрудникаПолучателя.Должность;
		СтрокаДокумента.ОбъектыПринялСотрудник = ВыборкаДокументов.СотрудникПолучатель;
		СтрокаДокумента.ОбъектыПринялФИО = КорреспондентыКлиентСервер.ФИО(ДанныеСотрудникаПолучателя, Истина);
		
	КонецЦикла;
	
	Возврат УправлениеПечатьюБГУ.Напечатать0510434(МассивОбъектов, ОбъектыПечати, ДанныеДокументов);
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеДокумента

Функция ПолучитьЗначениеНастроекЗаполненияКПС(ДоговорСсылка, Период, Организация)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Договоры.КПСМатериаловВПоступлениеМЗ КАК КПСМатериаловВПоступлениеМЗ
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.Ссылка = &Ссылка
	|	И НЕ Договоры.КПСМатериаловВПоступлениеМЗ В (ЗНАЧЕНИЕ(Перечисление.ВидыНастройкиКПСВПоступленияхМЗ.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ВидыНастройкиКПСВПоступленияхМЗ.ПоУчетнойПолитике))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизацийСрезПоследних.КПСМатериаловВПоступлениеМЗ
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|		ПО Договоры.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|			И (Договоры.Ссылка = &Ссылка)
	|			И (Договоры.КПСМатериаловВПоступлениеМЗ В (ЗНАЧЕНИЕ(Перечисление.ВидыНастройкиКПСВПоступленияхМЗ.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ВидыНастройкиКПСВПоступленияхМЗ.ПоУчетнойПолитике)))");
	
	Запрос.УстановитьПараметр("Ссылка", ДоговорСсылка);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);

	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() Тогда
		Выборка.Следующий();
		Возврат Выборка.КПСМатериаловВПоступлениеМЗ;
	КонецЕсли;
	
	Возврат Перечисления.ВидыНастройкиКПСВПоступленияхМЗ.ПустаяСсылка();
	
КонецФункции

// Заполнить по инвентаризации0510466.
// 
// Параметры:
//  ДокументыИнвентаризации - Массив из ДокументСсылка.ИнвентаризационнаяОписьНФА - Документы инвентаризации
//  ЗаполняемыйДокумент - ДокументОбъект.ПоступлениеМЗ, ДанныеФормыСтруктура - Заполняемый документ
Процедура ЗаполнитьПоИнвентаризации0510466(ДокументыИнвентаризации, ЗаполняемыйДокумент) Экспорт 
	Запрос = Новый Запрос;
	Документы.ИнвентаризационнаяОписьНФА.ЗапросДанныхДокументаИнвентаризации(Запрос, ДокументыИнвентаризации);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации КАК ДокументИнвентаризации,
	|	ДанныеИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	ДанныеИнвентаризации.НФА КАК НФА,
	|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок
	|ПОМЕСТИТЬ СгруппированныеСтроки
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК СправочникЦМО
	|		ПО ДанныеИнвентаризации.МОЛШапки = СправочникЦМО.Сотрудник
	|			И (&УсловиеМестоХранения)
	|ГДЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации В(&Документы466)
	|	И ДанныеИнвентаризации.ВидОбъекта = 8
	|	И СправочникЦМО.Ссылка = &ЦМО
	|	И ДанныеИнвентаризации.ИФО = &ИФО
	|	И (НЕ &УчетПоПодразделениям
	|			ИЛИ НЕ ЕСТЬNULL(ДанныеИнвентаризации.Счет.УчетПоПодразделениям, ЛОЖЬ)
	|			ИЛИ ДанныеИнвентаризации.Подразделение = &Подразделение)
	|	И ДанныеИнвентаризации.КоличествоИзлишкиНеПодтверждено <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеИнвентаризации.ДокументИнвентаризации,
	|	ДанныеИнвентаризации.НомерСтроки,
	|	ДанныеИнвентаризации.НФА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДанныеИнвентаризации.ДокументИнвентаризации КАК ДокументИнвентаризации,
	|	ДанныеИнвентаризации.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ДанныеИнвентаризации.НФА КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ДанныеИнвентаризации.НФА КАК Справочник.Номенклатура).ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ДанныеИнвентаризации.КоличествоИзлишкиНеПодтверждено КАК Количество,
	|	ВЫБОР
	|		КОГДА СгруппированныеСтроки.КоличествоСтрок = 1
	|				И ДанныеИнвентаризации.Количество <> 0
	|			ТОГДА ДанныеИнвентаризации.КоличествоИзлишкиНеПодтверждено * ДанныеИнвентаризации.Сумма / ДанныеИнвентаризации.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма
	|ИЗ
	|	ДанныеДокументаИнвентаризации КАК ДанныеИнвентаризации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СгруппированныеСтроки КАК СгруппированныеСтроки
	|		ПО ДанныеИнвентаризации.ДокументИнвентаризации = СгруппированныеСтроки.ДокументИнвентаризации
	|			И ДанныеИнвентаризации.НомерСтроки = СгруппированныеСтроки.НомерСтроки
	|			И ДанныеИнвентаризации.НФА = СгруппированныеСтроки.НФА";
	Если ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаполняемыйДокумент.ЦМО, "МестоХранения")) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМестоХранения",
			"ДанныеИнвентаризации.МестоИнвентаризации = СправочникЦМО.МестоХранения");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеМестоХранения",
			"ТИПЗНАЧЕНИЯ(ДанныеИнвентаризации.МестоИнвентаризации) = ТИП(Строка)");
	КонецЕсли;
	Запрос.УстановитьПараметр("Документы466", ДокументыИнвентаризации);
	Запрос.УстановитьПараметр("ЦМО", ЗаполняемыйДокумент.ЦМО);
	Запрос.УстановитьПараметр("ИФО", ЗаполняемыйДокумент.ИФО);
	Запрос.УстановитьПараметр("Подразделение", ЗаполняемыйДокумент.Подразделение);
	Запрос.УстановитьПараметр("УчетПоПодразделениям", ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВШапке105 = ЗаполняемыйДокумент.СчетУчета = БухгалтерскийУчет.СчетПоКоду(
		"105.00", ЗаполняемыйДокумент.Дата, ЗаполняемыйДокумент.Организация);
	ВШапке106 = ЗаполняемыйДокумент.СчетУчета = БухгалтерскийУчет.СчетПоКоду(
		"106.00", ЗаполняемыйДокумент.Дата, ЗаполняемыйДокумент.Организация);
	
	ПараметрыОбработки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(ЗаполняемыйДокумент);
	ПараметрыОбработки.Вставить("ВШапке105", ВШапке105);
	ПараметрыОбработки.Вставить("ВШапке106", ВШапке106);
	ПараметрыОбработки.Вставить("ЗаполнятьСчет", Истина);
	ПараметрыОбработки.Вставить("ДтКт", "Дт");
	ПараметрыОбработки.Вставить("Организация", ЗаполняемыйДокумент.Организация);
	ПараметрыОбработки.Вставить("ИФО", ЗаполняемыйДокумент.ИФО);
	ПараметрыОбработки.Вставить("Дата", ЗаполняемыйДокумент.Дата);

	ЗаполняемыйДокумент.СуммаДокумента = 0;
	Пока Выборка.Следующий() Цикл
		СтрокаМатериалы = ЗаполняемыйДокумент.Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаМатериалы, Выборка);
		СтрокаМатериалы.КоличествоМест = СтрокаМатериалы.Количество;
		СтрокаМатериалы.Коэффициент = 1;
		СтрокаМатериалы.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		
		ПараметрыОбработки.Номенклатура = СтрокаМатериалы.Номенклатура;
		ПараметрыОбработки.Счет         = СтрокаМатериалы.СчетУчета;
		УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(СтрокаМатериалы, ПараметрыОбработки);
		
		СтрокаМатериалы.Всего = СтрокаМатериалы.Сумма;
		ЗаполняемыйДокумент.СуммаДокумента = ЗаполняемыйДокумент.СуммаДокумента + СтрокаМатериалы.Всего;
	КонецЦикла;

КонецПроцедуры

// Заполняет указанный документ по договору, по которому указан предмет договора.
// 
// Параметры:
// 	Документ - ДокументОбъект.ПоступлениеМЗ - заполняемый документ.
// 			 - см. Документ.ПоступлениеМЗ.Форма.ФормаДокумента.Объект
// 	ДоговорОснование - СправочникСсылка.Договоры - договор
// 	ЗаполнитьШапку - Булево - Признак необходимости заполнения шапки документа.

Процедура ЗаполнитьПоДоговору(Документ, ДоговорОснование, ЗаполнитьШапку = Ложь) Экспорт
	
	ПараметрыЗаполнения = РаботаСОбязательствами.ПараметрыПолученияОстатковНФАПоДоговору(Документ);
	ПараметрыЗаполнения.ПолучитьДанныеДоговора = ЗаполнитьШапку;
	ПараметрыЗаполнения.ДоговорОснование       = ДоговорОснование;
	ПараметрыЗаполнения.ТипыНоменклатуры       = УправлениеМатериальнымиЗапасами.ТипыНоменклатурыМатериальныеЗапасы();
	
	ОстаткиНФАПоДоговору = РаботаСОбязательствами.ОстатокМЗУслугПоДоговору(ПараметрыЗаполнения);
	
	Если ОстаткиНФАПоДоговору = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗаполнитьШапку Тогда
		
		ЗаполнитьЗначенияСвойств(Документ, ОстаткиНФАПоДоговору.ДанныеДоговора);
		
		Документ.СчетУчета          = БухгалтерскийУчет.СчетПоКоду("105.00", Документ.Дата, Документ.Организация);
		Документ.Договор            = ДоговорОснование;
		Документ.СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.Автоматически;
		Документ.ВидПоступленияМЗ   = Перечисления.ВидыПоступленийМЗ.ПоступлениеОтПоставщика;
		Документ.СуммаВключаетНДС   = Истина;
		
	КонецЕсли;
	
	ПараметрыРасчетаНДС = Новый Структура;
	ПараметрыРасчетаНДС.Вставить("СуммаВключаетНДС", Документ.СуммаВключаетНДС);
	ЗаполнятьНДСВТаблице = УправлениеМатериальнымиЗапасамиФормыКлиентСервер.ВПоступленииМЗВозможенУчетНДС(Документ);
	
	КЭК340 = БухгалтерскийУчетПовтИсп.КЭКПоКоду("340");
	ПараметрыОбработкиСтроки = УправлениеМатериальнымиЗапасамиКлиентСервер.ПараметрыУстановкиСчетаУчетаВСтроке(Документ);
	ПараметрыОбработкиСтроки.ДтКт          = "Дт";
	ПараметрыОбработкиСтроки.ЗаполнятьСчет = Ложь;
	
	ДатаСчета = Документ.Дата;
	Если Не ЗначениеЗаполнено(ДатаСчета) Тогда
		ДатаСчета = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	Счета105 = БухгалтерскийУчет.СписокСчетов("105.00", ДатаСчета, , Документ.Организация);
	Счета113 = БухгалтерскийУчет.СписокСчетов("113.00", ДатаСчета, , Документ.Организация);
	ЕстьСчета105 = Ложь;
	ЕстьСчета113 = Ложь;
	ЭтоПоступлениеНаСчет106 = Документ.СчетУчета = БухгалтерскийУчет.СчетПоКоду("106.00", ДатаСчета, Документ.Организация);
	
	МассивКПСРасчетов = ОбщегоНазначенияБГУ.УдалитьПовторяющиесяЭлементыМассива(ОстаткиНФАПоДоговору.ОстаткиНФА.ВыгрузитьКолонку("КПС"));
	КоличествоКПСР = МассивКПСРасчетов.Количество();
	Документ.НесколькоКПСРасчетов = КоличествоКПСР > 1;
	Если КоличествоКПСР = 1 Тогда
		Документ.КПСРасчетов = МассивКПСРасчетов[0];
	КонецЕсли;

	Для Каждого ОстатокТМЦ Из ОстаткиНФАПоДоговору.ОстаткиНФА Цикл
		
		НоваяСтрока = Документ.Материалы.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ОстатокТМЦ);
		НоваяСтрока.СчетУчета = БухгалтерскийУчет.СчетПоКоду(ОстатокТМЦ.СчетУчетаКод,
			 Документ.Дата, Документ.Организация);
		ЕстьСчета105 = ЕстьСчета105 Или Счета105.Найти(НоваяСтрока.СчетУчета) <> Неопределено;
		ЕстьСчета113 = ЕстьСчета113 Или Счета113.Найти(НоваяСтрока.СчетУчета) <> Неопределено;
		Если ЭтоПоступлениеНаСчет106 И ЗначениеЗаполнено(НоваяСтрока.СчетУчета) Тогда
			НоваяСтрока.СчетУчета = УправлениеМатериальнымиЗапасами.СчетВложенийПоСчетуМатериала(
				НоваяСтрока.СчетУчета,
				Документ.Дата,
				ДатаСчета);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.КЭК) ИЛИ НоваяСтрока.КЭК = КЭК340 Тогда
			ПараметрыОбработкиСтроки.Счет          = НоваяСтрока.СчетУчета;
			ПараметрыОбработкиСтроки.Номенклатура  = НоваяСтрока.Номенклатура;
			УправлениеМатериальнымиЗапасамиКлиентСервер.УстановитьДанныеСчетаУчетаВСтроке(НоваяСтрока,
				ПараметрыОбработкиСтроки);
		КонецЕсли;
			Если Не ЗаполнятьНДСВТаблице Тогда
				НоваяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.ПустаяСсылка");
				НоваяСтрока.СуммаНДС = 0;
			КонецЕсли;

		УправлениеНФАКлиентСервер.РассчитатьСтрокуДокумента(НоваяСтрока, "Сумма", ПараметрыРасчетаНДС);
		
	КонецЦикла;
	
	Если ЕстьСчета105 И ЕстьСчета113 Тогда
		Документ.СчетРасчетов       = БухгалтерскийУчет.СчетПоКоду("302.30", Документ.Дата, Документ.Организация);
	ИначеЕсли ЕстьСчета113 Тогда
		Документ.СчетРасчетов       = БухгалтерскийУчет.СчетПоКоду("302.36", Документ.Дата, Документ.Организация);
	Иначе
		Документ.СчетРасчетов       = БухгалтерскийУчет.СчетПоКоду("302.34", Документ.Дата, Документ.Организация);
	КонецЕсли;
	
	Если НЕ ЭтоПоступлениеНаСчет106 Тогда
		Если ПолучитьЗначениеНастроекЗаполненияКПС(ДоговорОснование, Документ.Дата, Документ.Организация) = Перечисления.ВидыНастройкиКПСВПоступленияхМЗ.ПоОбщимПравилам Тогда
			УправлениеМатериальнымиЗапасами.ЗаполнитьКПСМЗвТЧПоступления(Документ, "Материалы");
		КонецЕсли;
	КонецЕсли;
	
	Документ.СуммаДокумента = Документ.Материалы.Итог("Всего") + Документ.ВозвратнаяТара.Итог("Сумма");
	
КонецПроцедуры

// Заполняет таблицу "Зачет авансов"
// 
// Параметры:
// 	Документ - ДокументОбъект.ПоступлениеМЗ, ДанныеФормыСтруктураСКоллекцией - заполняемый документ.
// 	ПериодОстатков - Граница - граница расчета остатков авансов.
Процедура ЗаполнитьПоОстаткамАвансов(Документ, ПериодОстатков, Отказ) Экспорт
	
	ПараметрыЗаполнения = БухгалтерскийУчет.ПараметрыЗаполненияТаблицыДокументаЗачетАвансов(Документ);
	
	ПараметрыЗаполнения.ПериодОстатков = ПериодОстатков;
	ПараметрыЗаполнения.СчетРасчетов = Документ.СчетРасчетов;
	ПараметрыЗаполнения.КПСРасчетовВТЧ = Документ.НесколькоКПСРасчетов;
	ПараметрыЗаполнения.КПС = Документ.КПСРасчетов;
	
	Если  Документ.НесколькоКПСРасчетов ИЛИ ЗначениеЗаполнено(Документ.КПСРасчетов) Тогда
		ПараметрыЗаполнения.ПоВсемКПС = Ложь;
	Иначе
		ПараметрыЗаполнения.ПоВсемКПС = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(Документ.КПСРасчетов) Тогда
		ПараметрыЗаполнения.КПС = Документ.КПСРасчетов;
		ПараметрыЗаполнения.ПоВсемКПС = Ложь;
	Иначе
		ПараметрыЗаполнения.ПоВсемКПС = Истина;
	КонецЕсли;
	
	Если ТипЗнч(Документ) <> Тип("ДокументОбъект.ПоступлениеМЗ") Тогда
		ДокументОбъект = ДанныеФормыВЗначение(Документ, Тип("ДокументОбъект.ПоступлениеМЗ"));
	Иначе
		ДокументОбъект = Документ;
	КонецЕсли;
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуРасчетовПоДокументу(
		ДокументОбъект, ПараметрыЗаполнения, Отказ);
	
	ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов(
		ТаблицаДокумента, , ПараметрыЗаполнения, Отказ);
	
	Если НЕ Отказ Тогда
		
		Документ.ЗачетАвансов.Очистить();
		
		АвансыКЗачету = ТаблицаРасчетов.НайтиСтроки(
			Новый Структура("ЭтоЗачетАванса", Истина));
		
		Для Каждого АвансКЗачету Из АвансыКЗачету Цикл
			
			Если АвансКЗачету.ВидДопСубконтоАвансов <> ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = Документ.ЗачетАвансов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, АвансКЗачету, "КФО,КПС");
			
			НоваяСтрока.ДокументАванса = АвансКЗачету.ДопСубконтоАвансов;
			НоваяСтрока.КЭК            = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчетуСУчетомПоступленияМЗ(АвансКЗачету.СчетАвансов);
			НоваяСтрока.СуммаЗачета    = АвансКЗачету.СуммаРасчетов;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Многопоточный обработчик обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт

	ПервичныеДокументыБГУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры,
		Тип("ДокументСсылка.ПоступлениеМЗ"));
	
КонецПроцедуры

// Парный обработчик к процедуре ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию
// 
// Параметры:
//  Параметры - Структура:
//   * ОбработкаЗавершена - Булево
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПервичныеДокументыБГУ.ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры, Тип("ДокументСсылка.ПоступлениеМЗ"));
	
КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНа_2_106(Параметры) Экспорт

	ПрослеживаемостьБГУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНа_2_106(Параметры, "Документ.ПоступлениеМЗ.СведенияПрослеживаемости");

КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаВерсию_2_106(Параметры) Экспорт

	ПрослеживаемостьБГУ.ОбработатьДанныеДляПереходаНаВерсию_2_106(Параметры, "Документ.ПоступлениеМЗ", "Материалы");

КонецПроцедуры


#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ЗарегистрироватьДанныеКОбработкеДляПереходаНа_2_106");
	Методы.Вставить("ОбработатьДанныеДляПереходаНаВерсию_2_106");
КонецПроцедуры

#КонецОбласти

#КонецЕсли
