#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИсключение(Параметры, АдресРезультата) Экспорт
	
	Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НФА = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "НФА");
	ОстаткиНФА = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ОстаткиНФА");
	
	Если НФА = Неопределено ИЛИ ОстаткиНФА = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураРезультатаИсключения = Новый Структура;
	СтруктураРезультатаИсключения.Вставить("ОшибкиСписания", Новый Структура);
	СтруктураРезультатаИсключения.Вставить("НеобработанныеНФА", Новый Соответствие);
	
	Если ОстаткиНФА.Количество() Тогда
		
		ДлительныеОперации.СообщитьПрогресс(, "Списание остатков НФА из регистров прослеживаемости");
		
		ВТ_ДанныеДляЗаписиОстатки = МассивВТаблицуЗначений(ОстаткиНФА);
		МассивОрганизаций = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВТ_ДанныеДляЗаписиОстатки.ВыгрузитьКолонку("Организация"));
		
		Для Каждого ЭлементОрганизация Из МассивОрганизаций Цикл
			
			ТабицаДляЗаписи = ВТ_ДанныеДляЗаписиОстатки.Скопировать(Новый Структура("Организация", ЭлементОрганизация));
			
			Если ТабицаДляЗаписи.Количество() Тогда
				
				НачатьТранзакцию();
				
				Попытка
					
					ДокСписания = Документы.СписаниеПрослеживаемыхНФА.СоздатьДокумент();
					ДокСписания.Дата = ТекущаяДатаСеанса();
					ДокСписания.УстановитьНовыйНомер();
					ДокСписания.Организация = ЭлементОрганизация;
					ДокСписания.Комментарий = "Создан помощником исключения из прослеживаемости";
					ДокСписания.ПрослеживаемыеНФА.Загрузить(ТабицаДляЗаписи);
					
					Если ДокСписания.ПрослеживаемыеНФА.Количество() Тогда
						ДокСписания.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
					
					ЗафиксироватьТранзакцию();
					
				Исключение
					
					ОтменитьТранзакцию();
					
					ТекстСообщения = СтрШаблон(
					"Не удалось создать документ списания НФА по организации %1 по причине: %2 подробно в журнале регистрации",
					ЭлементОрганизация,
					ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					ЗаписьЖурналаРегистрации(
					"Помощник исключения НФА из прослеживаемости",
					УровеньЖурналаРегистрации.Ошибка,
					,
					,
					ТекстСообщения);
					
					Если ДокСписания.ДополнительныеСвойства.Свойство("ОшибкиПроведения") Тогда
						СтруктураРезультатаИсключения.Вставить("ОшибкиСписания", ДокСписания.ДополнительныеСвойства.ОшибкиПроведения);
					Иначе
						ОшибкиПроведения = Неопределено;
						ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(ОшибкиПроведения,,
						"Ошибка проведения ""Списание прослеживаемых НФА"" см. журнал регистрации",,,,);
						СтруктураРезультатаИсключения.ОшибкиСписания.Добавить("Ошибка проведения ""Списание прослеживаемых НФА"" см. журнал регистрации");
						СтруктураРезультатаИсключения.Вставить("ОшибкиСписания", ОшибкиПроведения);
					КонецЕсли;
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

	ВТ_ДанныеДляЗаписиСправочник = МассивВТаблицуЗначений(НФА);
	
	Если ВТ_ДанныеДляЗаписиСправочник.Количество() Тогда
		ДлительныеОперации.СообщитьПрогресс(, "Обработка элементов справочников НФА");

		ЗаписатьЭлементыНФА(ВТ_ДанныеДляЗаписиСправочник, "Номенклатура", СтруктураРезультатаИсключения.НеобработанныеНФА);
		ЗаписатьЭлементыНФА(ВТ_ДанныеДляЗаписиСправочник, "Основное средство", СтруктураРезультатаИсключения.НеобработанныеНФА);
	КонецЕсли;

	ПоместитьВоВременноеХранилище(СтруктураРезультатаИсключения, АдресРезультата);
	
КонецПроцедуры

Процедура ЗаписатьЭлементыНФА(ТаблицаНФА, ВидНФА, НеобработанныеНФА)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидНФА", ВидНФА);
		
	ТаблицаВидНФА = ТаблицаНФА.Скопировать(Отбор);

	ПолноеИмяСправочника = ?(ВидНФА = "Номенклатура", "Справочник.Номенклатура", "Справочник.ОсновныеСредства");
	
	Для Каждого СтрокаНФА Из ТаблицаВидНФА Цикл
		
		НачатьТранзакцию();
		
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяСправочника);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", СтрокаНФА.НФА);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			СправочникОбъект = СтрокаНФА.НФА.ПолучитьОбъект();
			СправочникОбъект.Заблокировать();
			СправочникОбъект.ПрослеживаемыйТовар = Ложь;
			
			СправочникОбъект.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			НеобработанныеНФА.Вставить(СтрокаНФА.НФА, СтрокаНФА.ИдентификаторСтроки);
			
			ОтменитьТранзакцию();
			
			ТекстСообщения = СтрШаблон(
			"Не удалось обработать объект: %1 по причине: %2 подробно в журнале регистрации",
			СтрокаНФА.НФА,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ЗаписьЖурналаРегистрации(
			"Помощник исключения НФА из прослеживаемости",
			УровеньЖурналаРегистрации.Ошибка,
			,
			СтрокаНФА.НФА,
			ТекстСообщения);
			
		КонецПопытки;
			
	КонецЦикла;

КонецПроцедуры

Функция МассивВТаблицуЗначений(МассивСтруктур)
	
	Таблица = Новый ТаблицаЗначений;

	Если ТипЗнч(МассивСтруктур) = Тип("Массив")
		И МассивСтруктур.Количество() <> 0 Тогда
		
		ПерваяСтруктура = МассивСтруктур[0];
		Для Каждого Свойство Из ПерваяСтруктура Цикл
			
			Если Свойство.Ключ = "НФА" ИЛИ Свойство.Ключ = "Комплектующее" Тогда
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
				МассивТипов.Добавить(Тип("СправочникСсылка.ОсновныеСредства"));
				ОписаниеТиповПоТипу = Новый ОписаниеТипов(МассивТипов);
			Иначе
				ОписаниеТиповПоТипу = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТипЗнч(Свойство.Значение)));
			КонецЕсли;
			
			Таблица.Колонки.Добавить(Свойство.Ключ, ОписаниеТиповПоТипу);
		КонецЦикла;
		
		Для Каждого Структура Из МассивСтруктур Цикл
			НоваяСтрока = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Структура);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#КонецЕсли
