////////////////////////////////////////////////////////////////////////////////
// Работа с комиссиями.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьОтветственногоИсполнителяКомиссииВДокументеОписи(ФормаДокумента, ИмяРеквизитаОтветственныйИсполнительКомиссии = "ОтветственныйИсполнитель") Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаДокумента.Объект, "НомерРабочейКомиссии") Тогда
		НомерРабочейКомиссии = ФормаДокумента.Объект.НомерРабочейКомиссии;
	Иначе
		НомерРабочейКомиссии = 0;
	КонецЕсли;
	
	КэшНастроекКомиссии = ФормаДокумента[ПолучитьИмяРеквизитаКэшНастроекКомиссии()];
	
	ОтветственныйИсполнительКомиссии = ПолучитьОтветственногоИсполнителяКомиссииСлужебный(КэшНастроекКомиссии, НомерРабочейКомиссии);
	
	ФормаДокумента.Объект[ИмяРеквизитаОтветственныйИсполнительКомиссии] = ОтветственныйИсполнительКомиссии;
	
КонецПроцедуры

Функция ПолучитьОтветственногоИсполнителяКомиссии(Комиссия, НомерРабочейКомиссии = 0, ДатаСведений = Неопределено) Экспорт
	
	КэшНастроекКомиссии = ПолучитьКэшНастроекКомиссии(Комиссия, ДатаСведений);
	
	Возврат ПолучитьОтветственногоИсполнителяКомиссииСлужебный(КэшНастроекКомиссии, НомерРабочейКомиссии);
	
КонецФункции

#Область ЗамещениеЧленаКомиссии

// Создает реквизиты формы КэшНастроекКомиссии, НастройкиМеханизмаЗамещенияЧленаКомиссии.
// Создает и заполняет колонки СтатусЧленаКомиссии, ДолжностьЧленаКомиссии, СтатусЗамещающегоСотрудника,
// ДолжностьЗамещающегоСотрудника, ИндексыЗамещающихСотрудников, КоличествоЗамещающихСотрудников.
Процедура ИнициализироватьФормуДокументаЗамещениеЧленаКомиссии(ФормаДокумента, Знач ДатаСведений = Неопределено, Знач ИменаТабличныхЧастей = "СоставКомиссии", Знач ЗаполнитьДолжности = Ложь) Экспорт
	
	ИмяРеквизитаНастроек = ПолучитьИмяРеквизитаНастроекЗамещениеЧленаКомиссии();
	
	ИмяРеквизитаКэшНастроекКомиссии = ПолучитьИмяРеквизитаКэшНастроекКомиссии();
	
	НастройкиМеханизма = Новый Структура();
	НастройкиМеханизма.Вставить("ИменаТабличныхЧастей", Новый ФиксированныйМассив(СтрРазделить(ИменаТабличныхЧастей, ", ", Ложь)));
	НастройкиМеханизма.Вставить("ЗаполнитьДолжности", ЗаполнитьДолжности);
	
	// Реквизиты формы
	ДобавитьРеквизитыФормыЗамещениеЧленаКомиссии(ФормаДокумента, НастройкиМеханизма, ИмяРеквизитаНастроек, ИмяРеквизитаКэшНастроекКомиссии);
	
	// Элементы формы
	ДобавитьЭлементыФормыЗамещениеЧленаКомиссии(ФормаДокумента, НастройкиМеханизма);
	
	НастроитьКолонкиЗамещающийСотрудник(ФормаДокумента, НастройкиМеханизма);
	
	ФормаДокумента[ИмяРеквизитаНастроек] = НастройкиМеханизма;
	
	КэшироватьНастройкиКомиссии(ФормаДокумента, ФормаДокумента.Объект.Комиссия, ДатаСведений);
	
	Для Каждого ИмяТабличнойЧасти Из НастройкиМеханизма.ИменаТабличныхЧастей Цикл
		ДобавитьУсловноеОформлениеНедоступностьЗамещающегоСотрудника(ФормаДокумента, ИмяТабличнойЧасти);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриИзмененииКомиссииЗамещениеЧленаКомиссии(ФормаДокумента, Знач ДатаСведений = Неопределено, Знач ИмяРеквизитаОтветственныйИсполнительКомиссии = "ОтветственныйИсполнитель") Экспорт
	
	КэшироватьНастройкиКомиссии(ФормаДокумента, ФормаДокумента.Объект.Комиссия, ДатаСведений);
	
	ЗаполнитьСлужебныеКолонкиЗамещениеЧленаКомиссии(ФормаДокумента);
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонкиЗамещениеЧленаКомиссии(ФормаДокумента) Экспорт
	
	НастройкиМеханизма = ФормаДокумента[ПолучитьИмяРеквизитаНастроекЗамещениеЧленаКомиссии()];
	
	КэшНастроекКомиссии = ФормаДокумента[ПолучитьИмяРеквизитаКэшНастроекКомиссии()];
	
	НомерРабочейКомиссии = ПолучитьНомерРабочейКомиссииДокумента(ФормаДокумента);
	
	Для Каждого ИмяТабличнойЧасти Из НастройкиМеханизма.ИменаТабличныхЧастей Цикл
		ТаблицаСоставКомиссии = ФормаДокумента.Объект[ИмяТабличнойЧасти];
		
		ЗаполнитьСлужебныеКолонкиСоставаКомиссииЗамещениеЧленаКомиссии(ТаблицаСоставКомиссии, НастройкиМеханизма, КэшНастроекКомиссии);
		
		РассчитатьЗамещенияПриОтсутствииПоСтатусам(ТаблицаСоставКомиссии, КэшНастроекКомиссии, НомерРабочейКомиссии);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЗамещенияПриОтсутствии(ФормаДокумента, ИмяТаблицыСоставКомиссии = "СоставКомиссии") Экспорт
	
	НастройкиМеханизма = ФормаДокумента[ПолучитьИмяРеквизитаНастроекЗамещениеЧленаКомиссии()];
	
	КэшНастроекКомиссии = ФормаДокумента[ПолучитьИмяРеквизитаКэшНастроекКомиссии()];
	
	ТаблицаСоставКомиссии = ФормаДокумента.Объект[ИмяТаблицыСоставКомиссии];
	
	НомерРабочейКомиссии = ПолучитьНомерРабочейКомиссииДокумента(ФормаДокумента);
	
	РассчитатьЗамещенияПриОтсутствииПоСтатусам(ТаблицаСоставКомиссии, КэшНастроекКомиссии, НомерРабочейКомиссии);
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоставКомиссии Цикл
		Если СтрокаТаблицы.Отсутствует И СтрокаТаблицы.КоличествоЗамещающихСотрудников > 0 Тогда
			// Если уже было указано замещающее лицо, и оно же есть в обновленном списке выбора,
			// то оставляем текущее значение в строке табличной части.
			Если ЗначениеЗаполнено(СтрокаТаблицы.ЗамещающийСотрудник) Тогда
				ОставитьТекущееЗначение = Ложь;
				
				Для Каждого Индекс Из СтрокаТаблицы.ИндексыЗамещающихСотрудников Цикл
					Если СтрокаТаблицы.ЗамещающийСотрудник = КэшНастроекКомиссии.ЗамещающиеЧленыКомиссии[Индекс].Сотрудник Тогда
						ОставитьТекущееЗначение = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ОставитьТекущееЗначение Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СвойстваЗамещающего = КэшНастроекКомиссии.ЗамещающиеЧленыКомиссии[СтрокаТаблицы.ИндексыЗамещающихСотрудников[0]];
		Иначе
			СвойстваЗамещающего = Неопределено;
		КонецЕсли;
		
		ЗаполнитьСведенияЗамещающегоСотрудника(СтрокаТаблицы, СвойстваЗамещающего, НастройкиМеханизма, КэшНастроекКомиссии);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИмяРеквизитаКэшНастроекКомиссии()
	
	Возврат "КэшНастроекКомиссии";
	
КонецФункции

Функция ПолучитьСледующийЭлементФормы(ЭлементФормы)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭлементФормы, "Родитель") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИндексЭлемента = ЭлементФормы.Родитель.ПодчиненныеЭлементы.Индекс(ЭлементФормы);
	
	ИндексСледующегоЭлемента = ИндексЭлемента + 1;
	
	Если (ИндексСледующегоЭлемента + 1) > ЭлементФормы.Родитель.ПодчиненныеЭлементы.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЭлементФормы.Родитель.ПодчиненныеЭлементы.Получить(ИндексСледующегоЭлемента);
	
КонецФункции

Функция ПрочитатьДанныеПолнойКомиссииДляДокументовОписей(СписокКомиссий, НаДату)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокКомиссий",	СписокКомиссий);
	ЗапросПоиск.УстановитьПараметр("НаДату",			НаДату);
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Статусы членов комиссий
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникПостоянноДействующиеКомиссии.Ссылка	КАК Комиссия,
	|	ТЧСоставКомиссии.Сотрудник						КАК Сотрудник,
	|	ТЧСоставКомиссии.НомерРабочейКомиссии			КАК НомерРабочейКомиссии,
	|	ТЧСоставКомиссии.СтатусЧленаКомиссии			КАК СтатусЧленаКомиссии,
	|	ТЧСоставКомиссии.ОтветственныйИсполнитель		КАК ОтветственныйИсполнитель
	|ИЗ
	|	Справочник.ПостоянноДействующиеКомиссии КАК СправочникПостоянноДействующиеКомиссии
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии КАК ТЧСоставКомиссии
	|		ПО	СправочникПостоянноДействующиеКомиссии.Ссылка = ТЧСоставКомиссии.Ссылка
	|ГДЕ
	|	СправочникПостоянноДействующиеКомиссии.Ссылка В(&СписокКомиссий)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Должности членов комиссий
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудник				КАК Сотрудник,
	|	Должность				КАК Должность,
	|	Должность.Наименование	КАК ДолжностьНаименование
	|ИЗ
	|	РегистрСведений.ДанныеСотрудников.СрезПоследних(
	|		&НаДату,
	|		Сотрудник В(ВЫБРАТЬ Сотрудник ИЗ Справочник.ПостоянноДействующиеКомиссии.СоставКомиссии ГДЕ Ссылка В(&СписокКомиссий))
	|	)
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	Должность.Наименование";
	
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	
	ДанныеПолнойКомиссии = Новый Структура();
	
	// [0]. Статусы членов комиссий
	ДанныеПолнойКомиссии.Вставить("СтатусыЧленовКомиссии", РезультатыЗапроса[0].Выбрать());
	
	// [1]. Должности членов комиссий
	ДанныеПолнойКомиссии.Вставить("ДолжностиЧленовКомиссии", РезультатыЗапроса[1].Выбрать());
	
	Возврат ДанныеПолнойКомиссии;
	
КонецФункции

Функция ПолучитьСтатусыЧленовКомиссии(Выборка)
	
	СтатусыЧленовКомиссии = Новый Соответствие();
	
	Поиск = Новый Структура("Сотрудник");
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		СтатусЧленаКомиссии = Выборка.СтатусЧленаКомиссии;
		
		Сотрудник = Выборка.Сотрудник;
		
		Поиск.Сотрудник = Сотрудник;
		
		Если СтатусыЧленовКомиссии.Получить(Сотрудник) = Неопределено Тогда
			СтатусыЧленовКомиссии.Вставить(Сотрудник, СтатусЧленаКомиссии);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтатусыЧленовКомиссии;
	
КонецФункции

Функция ПолучитьДолжностиЧленовКомиссии(Выборка)
	
	ДолжностиЧленовКомиссии = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
		Сотрудник = Выборка.Сотрудник;
		
		СписокДолжностей = ДолжностиЧленовКомиссии.Получить(Сотрудник);
		
		Если СписокДолжностей = Неопределено Тогда
			СписокДолжностей = Новый Массив();
		КонецЕсли;
		
		СписокДолжностей.Добавить(Выборка.Должность);
		
		ДолжностиЧленовКомиссии.Вставить(Сотрудник, СписокДолжностей);
	КонецЦикла;
	
	Возврат ДолжностиЧленовКомиссии;
	
КонецФункции

Функция ПолучитьЗамещающихЧленовКомиссии(Выборка, КлассификацияСтатусов)
	
	ЗамещающиеЧленыКомиссии = Новый Массив();
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		СтатусЧленаКомиссии = Выборка.СтатусЧленаКомиссии;
		
		Если КлассификацияСтатусов.СтатусыЗамещений.Найти(СтатусЧленаКомиссии) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СвойстваЗамещающего = ПолучитьПустуюСтруктуруСвойствЗамещающегоСотрудника();
		
		ЗаполнитьЗначенияСвойств(СвойстваЗамещающего, Выборка, "Сотрудник,НомерРабочейКомиссии");
		
		СвойстваЗамещающего.СтатусЧленаКомиссии = СтатусЧленаКомиссии;
		
		СвойстваЗамещающего.ПредставлениеДляСпискаВыбора = СтрШаблон("%1 (%2)", Строка(Выборка.Сотрудник), СтатусЧленаКомиссии);
		
		ЗамещающиеЧленыКомиссии.Добавить(СвойстваЗамещающего);
	КонецЦикла;
	
	Возврат ЗамещающиеЧленыКомиссии;
	
КонецФункции

Функция ПолучитьОтветственныхИсполнителей(Выборка)
	
	ОтветственныеИсполнители = Новый Структура();
	ОтветственныеИсполнители.Вставить("ОбщийСписок", Новый Массив());
	ОтветственныеИсполнители.Вставить("ПоРабочимКомиссиям", Новый Соответствие());
	
	Выборка.Сбросить();
	
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.ОтветственныйИсполнитель Тогда
			Продолжить;
		КонецЕсли;
		
		Сотрудник = Выборка.Сотрудник;
		
		Если ОтветственныеИсполнители.ОбщийСписок.Найти(Сотрудник) = Неопределено Тогда
			ОтветственныеИсполнители.ОбщийСписок.Добавить(Сотрудник);
		КонецЕсли;
		
		НомерРабочейКомиссии = Выборка.НомерРабочейКомиссии;
		
		СписокСотрудников = ОтветственныеИсполнители.ПоРабочимКомиссиям.Получить(НомерРабочейКомиссии);
		
		Если СписокСотрудников = Неопределено Тогда
			СписокСотрудников = Новый Массив();
		КонецЕсли;
		
		СписокСотрудников.Добавить(Сотрудник);
		
		ОтветственныеИсполнители.ПоРабочимКомиссиям.Вставить(НомерРабочейКомиссии, СписокСотрудников);
	КонецЦикла;
	
	Возврат ОтветственныеИсполнители;
	
КонецФункции

Процедура КэшироватьНастройкиКомиссии(ФормаДокумента, Комиссия, ДатаСведений)
	
	// Если в документе описи указана рабочая комиссия, то в табличной части СоставКомиссии
	// перечислены только члены указанной рабочей комиссии.
	// Если председатель или заместитель председателя не включены в состав такой рабочей комиссии,
	// то таких сотрудников не будет в табличной части СоставКомиссии.
	// Для возможности замещения сотрудника при его отсутствии необходимо прочитать не только состав указанной
	// рабочей комиссии (перечисленный в документе), но и состав полной комиссии.
	
	Если ДатаСведений = Неопределено Тогда
		ДатаСведений = ФормаДокумента.Объект.Дата;
	КонецЕсли;
	
	КэшНастроекКомиссии = Новый ФиксированнаяСтруктура(ПолучитьКэшНастроекКомиссии(Комиссия, ДатаСведений));
	
	ФормаДокумента[ПолучитьИмяРеквизитаКэшНастроекКомиссии()] = КэшНастроекКомиссии;
	
КонецПроцедуры

Функция ПолучитьКэшНастроекКомиссии(Комиссия, ДатаСведений)
	
	// Если в документе описи указана рабочая комиссия, то в табличной части СоставКомиссии
	// перечислены только члены указанной рабочей комиссии.
	// Если председатель или заместитель председателя не включены в состав такой рабочей комиссии,
	// то таких сотрудников не будет в табличной части СоставКомиссии.
	// Для возможности замещения сотрудника при его отсутствии необходимо прочитать не только состав указанной
	// рабочей комиссии (перечисленный в документе), но и состав полной комиссии.
	
	Если Не ЗначениеЗаполнено(ДатаСведений) Тогда
		ДатаСведений = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комиссия) Тогда
		ЭтоИнвентаризационнаяКомиссия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Комиссия, "Инвентаризационная");
	Иначе
		ЭтоИнвентаризационнаяКомиссия = Ложь;
	КонецЕсли;
	
	НастройкиСтатусовЗамещения = ПолучитьНастройкиСтатусовЗамещенияПриОтсутствии(ЭтоИнвентаризационнаяКомиссия);
	
	КлассификацияСтатусов = КлассифицироватьСтатусыПриОтсутствии(НастройкиСтатусовЗамещения);
	
	СписокКомиссий = Новый Массив();
	СписокКомиссий.Добавить(Комиссия);
	
	ДанныеПолнойКомиссии = ПрочитатьДанныеПолнойКомиссииДляДокументовОписей(СписокКомиссий, ДатаСведений);
	
	СтатусыЧленовКомиссии = ПолучитьСтатусыЧленовКомиссии(ДанныеПолнойКомиссии.СтатусыЧленовКомиссии);
	
	ДолжностиЧленовКомиссии = ПолучитьДолжностиЧленовКомиссии(ДанныеПолнойКомиссии.ДолжностиЧленовКомиссии);
	
	ЗамещающиеЧленыКомиссии = ПолучитьЗамещающихЧленовКомиссии(ДанныеПолнойКомиссии.СтатусыЧленовКомиссии, КлассификацияСтатусов);
	
	ОтветственныеИсполнители = ПолучитьОтветственныхИсполнителей(ДанныеПолнойКомиссии.СтатусыЧленовКомиссии);
	
	КэшНастроек = Новый Структура();
	
	КэшНастроек.Вставить("ЭтоИнвентаризационнаяКомиссия",	ЭтоИнвентаризационнаяКомиссия);
	КэшНастроек.Вставить("НастройкиСтатусовЗамещения",		НастройкиСтатусовЗамещения);
	КэшНастроек.Вставить("КлассификацияСтатусов",			КлассификацияСтатусов);
	
	КэшНастроек.Вставить("СтатусыЧленовКомиссии",	СтатусыЧленовКомиссии);
	КэшНастроек.Вставить("ДолжностиЧленовКомиссии",	ДолжностиЧленовКомиссии);
	КэшНастроек.Вставить("ЗамещающиеЧленыКомиссии",	ЗамещающиеЧленыКомиссии);
	
	КэшНастроек.Вставить("ОтветственныеИсполнители", ОтветственныеИсполнители);
	
	Возврат КэшНастроек;
	
КонецФункции

Функция ПолучитьОтветственногоИсполнителяКомиссииСлужебный(КэшНастроекКомиссии, НомерРабочейКомиссии = 0)
	
	СписокСотрудников = КэшНастроекКомиссии.ОтветственныеИсполнители.ПоРабочимКомиссиям.Получить(НомерРабочейКомиссии);
	
	Если СписокСотрудников = Неопределено И ЗначениеЗаполнено(НомерРабочейКомиссии) Тогда
		СписокСотрудников = КэшНастроекКомиссии.ОтветственныеИсполнители.ПоРабочимКомиссиям.Получить(0);
	КонецЕсли;
	
	Если СписокСотрудников = Неопределено Тогда
		СписокСотрудников = КэшНастроекКомиссии.ОтветственныеИсполнители.ОбщийСписок;
	КонецЕсли;
	
	Возврат ?(СписокСотрудников.Количество() > 0, СписокСотрудников[0], Неопределено);
	
КонецФункции

#Область ЗамещениеЧленаКомиссии

// Настройки

Функция ПолучитьИмяРеквизитаНастроекЗамещениеЧленаКомиссии()
	
	Возврат "НастройкиМеханизмаЗамещенияЧленаКомиссии";
	
КонецФункции

// Расчет

Функция ПолучитьНастройкиСтатусовЗамещенияПриОтсутствии(ЭтоИнвентаризационнаяКомиссия)
	
	НастройкиСтатусовЗамещения = Новый Соответствие();
	
	Если ЭтоИнвентаризационнаяКомиссия Тогда
		// Замещение Председателя
		СтатусыЗамещения = Новый Массив();
		СтатусыЗамещения.Добавить(Перечисления.СтатусыЧленовКомиссии.ЗаместительПредседателя);
		НастройкиСтатусовЗамещения.Вставить(Перечисления.СтатусыЧленовКомиссии.Председатель, СтатусыЗамещения);
		
		// Замещение Уполномоченного председателем лица
		СтатусыЗамещения = Новый Массив();
		СтатусыЗамещения.Добавить(Перечисления.СтатусыЧленовКомиссии.ЗаместительУполномоченногоПредседателемЛица);
		СтатусыЗамещения.Добавить(Перечисления.СтатусыЧленовКомиссии.Председатель);
		СтатусыЗамещения.Добавить(Перечисления.СтатусыЧленовКомиссии.ЗаместительПредседателя);
		НастройкиСтатусовЗамещения.Вставить(Перечисления.СтатусыЧленовКомиссии.УполномоченноеПредседателемЛицо, СтатусыЗамещения);
	КонецЕсли;
	
	Возврат НастройкиСтатусовЗамещения;
	
КонецФункции

Функция КлассифицироватьСтатусыПриОтсутствии(НастройкиСтатусовЗамещения)
	
	СтатусыОтсутствий			= Новый Массив();
	СтатусыЗамещений			= Новый Массив();
	СтатусыОтсутствийИЗамещений	= Новый Массив();
	
	Для Каждого Элемент Из НастройкиСтатусовЗамещения Цикл
		СтатусОтсутствия = Элемент.Ключ;
		СтатусыЗамещенийЭлемента = Элемент.Значение;
		
		Если СтатусыОтсутствий.Найти(СтатусОтсутствия) = Неопределено Тогда
			СтатусыОтсутствий.Добавить(СтатусОтсутствия);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтатусыЗамещений, СтатусыЗамещенийЭлемента, Истина);
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтатусыОтсутствийИЗамещений, СтатусыОтсутствий, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтатусыОтсутствийИЗамещений, СтатусыЗамещений, Истина);
	
	КлассификацияСтатусов = Новый Структура();
	КлассификацияСтатусов.Вставить("СтатусыОтсутствий",				СтатусыОтсутствий);
	КлассификацияСтатусов.Вставить("СтатусыЗамещений",				СтатусыЗамещений);
	КлассификацияСтатусов.Вставить("СтатусыОтсутствийИЗамещений",	СтатусыОтсутствийИЗамещений);
	
	Возврат КлассификацияСтатусов;
	
КонецФункции

Функция ПолучитьПустуюСтруктуруСвойствЗамещающегоСотрудника()
	
	Возврат Новый Структура("
		|Сотрудник,
		|НомерРабочейКомиссии,
		|СтатусЧленаКомиссии,
		|ПредставлениеДляСпискаВыбора");
	
КонецФункции

Процедура ЗаполнитьСведенияЗамещающегоСотрудника(СтрокаСоставаКомиссии, СвойстваЗамещающего, НастройкиМеханизма, КэшНастроекКомиссии)
	
	Если СвойстваЗамещающего = Неопределено Тогда
		ОчищающаяСтруктура = Новый Структура("ЗамещающийСотрудник,СтатусЗамещающегоСотрудника,ДолжностьЗамещающегоСотрудника");
		
		ЗаполнитьЗначенияСвойств(СтрокаСоставаКомиссии, ОчищающаяСтруктура);
		
		Возврат;
	КонецЕсли;
	
	ЗамещающийСотрудник = СвойстваЗамещающего.Сотрудник;
	
	СтрокаСоставаКомиссии.ЗамещающийСотрудник			= ЗамещающийСотрудник;
	СтрокаСоставаКомиссии.СтатусЗамещающегоСотрудника	= СвойстваЗамещающего.СтатусЧленаКомиссии;
	
	Если НастройкиМеханизма.ЗаполнитьДолжности Тогда
		СписокДолжностей = КэшНастроекКомиссии.ДолжностиЧленовКомиссии.Получить(ЗамещающийСотрудник);
		
		Если СписокДолжностей = Неопределено Тогда
			ДолжностьЗамещающегоСотрудника = Неопределено;
		Иначе
			ДолжностьЗамещающегоСотрудника = СписокДолжностей[0];
		КонецЕсли;
		
		СтрокаСоставаКомиссии.ДолжностьЗамещающегоСотрудника = ДолжностьЗамещающегоСотрудника;
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьЗамещенияПриОтсутствииПоСтатусам(ТаблицаСоставКомиссии, КэшНастроекКомиссии, НомерРабочейКомиссии)
	
	ПоискСотрудника = Новый Структура("Сотрудник");
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоставКомиссии Цикл
		ИндексыЗамещающихСотрудников = ОпределитьИндексыЗамещающихСотрудников(СтрокаТаблицы, ТаблицаСоставКомиссии, КэшНастроекКомиссии, ПоискСотрудника, НомерРабочейКомиссии);
		
		СтрокаТаблицы.ИндексыЗамещающихСотрудников = Новый ФиксированныйМассив(ИндексыЗамещающихСотрудников);
		СтрокаТаблицы.КоличествоЗамещающихСотрудников= ИндексыЗамещающихСотрудников.Количество();
	КонецЦикла;
	
КонецПроцедуры

Функция ОпределитьИндексыЗамещающихСотрудников(СтрокаСоставаКомиссии, ТаблицаСоставКомиссии, КэшНастроекКомиссии, ПоискСотрудника, НомерРабочейКомиссии)
	
	// Если все замещающие сотрудники перечислены в составе комиссии документа,
	// то для них имеется возможность указать возможное отсутствие.
	// И затем учесть такое отсутствие для расчета следующего замещающего.
	//
	// Если какой-то замещающий сотрудник отсутствует в составе комиссии документа,
	// то указать его возможное отсутствие невозможно.
	// Поэтому такие замещающие сотрудники указываются в списке выбора,
	// чтобы можно было вручную выбрать одного замещающего.
	
	ПредлагатьВыборИзВсехЗаместителейУполномоченныхПредседателемЛицДляПолнойКомиссии = Истина;
	ВыбиралисьВсеЗаместителиУполномоченныеПредседателемЛицаДляПолнойКомиссии = Ложь;
	
	ИндексыЗамещающихСотрудников = Новый Массив();
	
	ЗамещающиеЧленыКомиссии = КэшНастроекКомиссии.ЗамещающиеЧленыКомиссии;
	
	СтатусыЗамещения = КэшНастроекКомиссии.НастройкиСтатусовЗамещения.Получить(СтрокаСоставаКомиссии.СтатусЧленаКомиссии);
	
	Если СтатусыЗамещения = Неопределено Тогда
		Возврат ИндексыЗамещающихСотрудников;
	КонецЕсли;
	
	Для Каждого СтатусЗамещения Из СтатусыЗамещения Цикл
		Для Индекс = 0 По ЗамещающиеЧленыКомиссии.ВГраница() Цикл
			СвойстваЗамещающего = ЗамещающиеЧленыКомиссии[Индекс];
			
			Если СвойстваЗамещающего.СтатусЧленаКомиссии <> СтатусЗамещения Или СвойстваЗамещающего.Сотрудник = СтрокаСоставаКомиссии.Сотрудник Тогда
				Продолжить;
			КонецЕсли;
			
			Если СвойстваЗамещающего.СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.ЗаместительУполномоченногоПредседателемЛица
				И ЗначениеЗаполнено(НомерРабочейКомиссии)
				И СвойстваЗамещающего.НомерРабочейКомиссии <> НомерРабочейКомиссии Тогда
				Продолжить;
			КонецЕсли;
			
			ПоискСотрудника.Сотрудник = СвойстваЗамещающего.Сотрудник;
			
			МассивСтрок = ТаблицаСоставКомиссии.НайтиСтроки(ПоискСотрудника);
			
			ЗамещающийСотрудникУказанВТаблицеДокумента = (МассивСтрок.Количество() > 0);
			
			ЗамещающийСотрудникОтсутствует = Ложь;
			
			Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
				Если СтрокаТаблицы.Отсутствует Тогда
					ЗамещающийСотрудникОтсутствует = Истина;
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗамещающийСотрудникОтсутствует Тогда
				Продолжить;
			КонецЕсли;
			
			ИндексыЗамещающихСотрудников.Добавить(Индекс);
			
			Если ЗамещающийСотрудникУказанВТаблицеДокумента Тогда
				Если СвойстваЗамещающего.СтатусЧленаКомиссии = Перечисления.СтатусыЧленовКомиссии.ЗаместительУполномоченногоПредседателемЛица
					И Не ЗначениеЗаполнено(НомерРабочейКомиссии)
					И ПредлагатьВыборИзВсехЗаместителейУполномоченныхПредседателемЛицДляПолнойКомиссии Тогда
					ВыбиралисьВсеЗаместителиУполномоченныеПредседателемЛицаДляПолнойКомиссии = Истина;
					
					Продолжить;
				КонецЕсли;
				
				Возврат ИндексыЗамещающихСотрудников;
			КонецЕсли;
		КонецЦикла;
		
		Если ВыбиралисьВсеЗаместителиУполномоченныеПредседателемЛицаДляПолнойКомиссии Тогда
			Возврат ИндексыЗамещающихСотрудников;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИндексыЗамещающихСотрудников;
	
КонецФункции

Функция ПолучитьНомерРабочейКомиссииДокумента(ФормаДокумента)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаДокумента.Объект, "НомерРабочейКомиссии") Тогда
		Возврат ФормаДокумента.Объект.НомерРабочейКомиссии;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Настройка формы документа

Процедура ДобавитьРеквизитыФормыЗамещениеЧленаКомиссии(ФормаДокумента, НастройкиМеханизма, ИмяРеквизитаНастроек, ИмяРеквизитаКэшНастроекКомиссии)
	
	ДобавляемыеРеквизиты = Новый Массив();
	
	// РЕКВИЗИТЫ ФОРМЫ
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаДокумента, ИмяРеквизитаНастроек) Тогда
		НовыйРеквизитФормы = Новый РеквизитФормы(
			ИмяРеквизитаНастроек,
			Новый ОписаниеТипов());
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ФормаДокумента, ИмяРеквизитаКэшНастроекКомиссии) Тогда
		НовыйРеквизитФормы = Новый РеквизитФормы(
			ИмяРеквизитаКэшНастроекКомиссии,
			Новый ОписаниеТипов());
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
	КонецЕсли;
	
	// КОЛОНКИ ТАБЛИЧНОЙ ЧАСТИ
	
	Для Каждого ИмяТабличнойЧасти Из НастройкиМеханизма.ИменаТабличныхЧастей Цикл
		НовыйРеквизитФормы = Новый РеквизитФормы(
			"ОтветственныйИсполнитель",
			Новый ОписаниеТипов("Булево"),
			"Объект." + ИмяТабличнойЧасти,
			НСтр("ru='Ответственный исполнитель'"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		
		НовыйРеквизитФормы = Новый РеквизитФормы(
			"СтатусЧленаКомиссии",
			Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЧленовКомиссии"),
			"Объект." + ИмяТабличнойЧасти,
			НСтр("ru='Статус'"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		
		НовыйРеквизитФормы = Новый РеквизитФормы(
			"СтатусЗамещающегоСотрудника",
			Новый ОписаниеТипов("ПеречислениеСсылка.СтатусыЧленовКомиссии"),
			"Объект." + ИмяТабличнойЧасти,
			НСтр("ru='Статус замещающего'"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		
		Если НастройкиМеханизма.ЗаполнитьДолжности Тогда
			НовыйРеквизитФормы = Новый РеквизитФормы(
				"ДолжностьЧленаКомиссии",
				Новый ОписаниеТипов("СправочникСсылка.Должности"),
				"Объект." + ИмяТабличнойЧасти,
				НСтр("ru='Должность'"));
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
			
			НовыйРеквизитФормы = Новый РеквизитФормы(
				"ДолжностьЗамещающегоСотрудника",
				Новый ОписаниеТипов("СправочникСсылка.Должности"),
				"Объект." + ИмяТабличнойЧасти,
				НСтр("ru='Должность замещающего'"));
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		КонецЕсли;
		
		НовыйРеквизитФормы = Новый РеквизитФормы(
			"ИндексыЗамещающихСотрудников",
			Новый ОписаниеТипов(),
			"Объект." + ИмяТабличнойЧасти,
			НСтр("ru='Индексы замещающих сотрудников'"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		
		НовыйРеквизитФормы = Новый РеквизитФормы(
			"КоличествоЗамещающихСотрудников",
			ОбщегоНазначения.ОписаниеТипаЧисло(4, 0, ДопустимыйЗнак.Неотрицательный),
			"Объект." + ИмяТабличнойЧасти,
			НСтр("ru='Количество замещающих сотрудников'"));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
	КонецЦикла;
	
	ФормаДокумента.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормыЗамещениеЧленаКомиссии(ФормаДокумента, НастройкиМеханизма)
	
	Для Каждого ИмяТабличнойЧасти Из НастройкиМеханизма.ИменаТабличныхЧастей Цикл
		ЭлементФормыТабличнаяЧастьСоставКомиссии = ФормаДокумента.Элементы[ИмяТабличнойЧасти];
		
		ЭлементФормыКолонкаОтсутствует = ФормаДокумента.Элементы[ИмяТабличнойЧасти + "Отсутствует"];
		
		ЭлементФормыПослеКолонкиЗамещающийСотрудник = ПолучитьСледующийЭлементФормы(ФормаДокумента.Элементы[ИмяТабличнойЧасти + "ЗамещающийСотрудник"]);
		
		ИмяКолонки = "СтатусЧленаКомиссии";
		ИмяЭлемента = ИмяТабличнойЧасти + ИмяКолонки;
		НовыйЭлемент = ФормаДокумента.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементФормыТабличнаяЧастьСоставКомиссии, ЭлементФормыКолонкаОтсутствует);
		НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным	= "Объект." + ИмяТабличнойЧасти + "." + ИмяКолонки;
		НовыйЭлемент.Заголовок		= НСтр("ru='Статус'");
		НовыйЭлемент.ЦветТекста		= ЦветаСтиля.ТекстИнформационнойНадписи;
		НовыйЭлемент.ТолькоПросмотр	= Истина;
		
		ИмяКолонки = "СтатусЗамещающегоСотрудника";
		ИмяЭлемента = ИмяТабличнойЧасти + ИмяКолонки;
		Если ЭлементФормыПослеКолонкиЗамещающийСотрудник <> Неопределено Тогда
			НовыйЭлемент = ФормаДокумента.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементФормыТабличнаяЧастьСоставКомиссии, ЭлементФормыПослеКолонкиЗамещающийСотрудник);
		Иначе
			НовыйЭлемент = ФормаДокумента.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементФормыТабличнаяЧастьСоставКомиссии);
		КонецЕсли;
		НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным	= "Объект." + ИмяТабличнойЧасти + "." + ИмяКолонки;
		НовыйЭлемент.Заголовок		= НСтр("ru='Статус замещающего'");
		НовыйЭлемент.ЦветТекста		= ЦветаСтиля.ТекстИнформационнойНадписи;
		НовыйЭлемент.ТолькоПросмотр	= Истина;
		
		Если НастройкиМеханизма.ЗаполнитьДолжности Тогда
			ИмяКолонки = "ДолжностьЧленаКомиссии";
			ИмяЭлемента = ИмяТабличнойЧасти + ИмяКолонки;
			НовыйЭлемент = ФормаДокумента.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементФормыТабличнаяЧастьСоставКомиссии, ЭлементФормыКолонкаОтсутствует);
			НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным	= "Объект." + ИмяТабличнойЧасти + "." + ИмяКолонки;
			НовыйЭлемент.Заголовок		= НСтр("ru='Должность'");
			НовыйЭлемент.ЦветТекста		= ЦветаСтиля.ТекстИнформационнойНадписи;
			НовыйЭлемент.ТолькоПросмотр	= Истина;
			
			ИмяКолонки = "ДолжностьЗамещающегоСотрудника";
			ИмяЭлемента = ИмяТабличнойЧасти + ИмяКолонки;
			Если ЭлементФормыПослеКолонкиЗамещающийСотрудник <> Неопределено Тогда
				НовыйЭлемент = ФормаДокумента.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементФормыТабличнаяЧастьСоставКомиссии, ЭлементФормыПослеКолонкиЗамещающийСотрудник);
			Иначе
				НовыйЭлемент = ФормаДокумента.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементФормыТабличнаяЧастьСоставКомиссии);
			КонецЕсли;
			НовыйЭлемент.Вид			= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным	= "Объект." + ИмяТабличнойЧасти + "." + ИмяКолонки;
			НовыйЭлемент.Заголовок		= НСтр("ru='Должность замещающего'");
			НовыйЭлемент.ЦветТекста		= ЦветаСтиля.ТекстИнформационнойНадписи;
			НовыйЭлемент.ТолькоПросмотр	= Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСлужебныеКолонкиСоставаКомиссииЗамещениеЧленаКомиссии(ТаблицаСоставКомиссии, НастройкиМеханизма, КэшНастроекКомиссии)
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоставКомиссии Цикл
		СтатусЧленаКомиссии = Неопределено;
		СтатусЗамещающегоСотрудника = Неопределено;
		ДолжностьЗамещающегоСотрудника = Неопределено;
		Должность = Неопределено;
		
		Сотрудник = СтрокаТаблицы.Сотрудник;
		
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			СтатусЧленаКомиссии = КэшНастроекКомиссии.СтатусыЧленовКомиссии.Получить(Сотрудник);
			
			СписокДолжностей = КэшНастроекКомиссии.ДолжностиЧленовКомиссии.Получить(Сотрудник);
			
			Если СписокДолжностей <> Неопределено Тогда
				Должность = СписокДолжностей[0];
			КонецЕсли;
		КонецЕсли;
		
		ЗамещающийСотрудник = СтрокаТаблицы.ЗамещающийСотрудник;
		
		Если ЗначениеЗаполнено(ЗамещающийСотрудник) Тогда
			СтатусЗамещающегоСотрудника = КэшНастроекКомиссии.СтатусыЧленовКомиссии.Получить(ЗамещающийСотрудник);
			
			СписокДолжностей = КэшНастроекКомиссии.ДолжностиЧленовКомиссии.Получить(ЗамещающийСотрудник);
			
			Если СписокДолжностей <> Неопределено Тогда
				ДолжностьЗамещающегоСотрудника = СписокДолжностей[0];
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТаблицы.СтатусЧленаКомиссии = СтатусЧленаКомиссии;
		СтрокаТаблицы.СтатусЗамещающегоСотрудника = СтатусЗамещающегоСотрудника;
		СтрокаТаблицы.ОтветственныйИсполнитель = (КэшНастроекКомиссии.ОтветственныеИсполнители.ОбщийСписок.Найти(Сотрудник) <> Неопределено);
		
		Если НастройкиМеханизма.ЗаполнитьДолжности Тогда
			СтрокаТаблицы.ДолжностьЧленаКомиссии = Должность;
			СтрокаТаблицы.ДолжностьЗамещающегоСотрудника = ДолжностьЗамещающегоСотрудника;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформлениеНедоступностьЗамещающегоСотрудника(ФормаДокумента, ИмяТаблицыСоставКомиссии)
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	//---
	// 1
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Недоступность Замещающего сотрудника при отсутствии замещающих (таблица %1)'"), ИмяТаблицыСоставКомиссии);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.ЗамещающийСотрудник", ИмяТаблицыСоставКомиссии));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.КоличествоЗамещающихСотрудников", ИмяТаблицыСоставКомиссии));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='недоступно'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрШаблон("%1ЗамещающийСотрудник", ИмяТаблицыСоставКомиссии));
	
	
	//---
	// 2
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Недоступность замещающего сотрудника при сброшенном флажке ""Отсутствует"" (таблица %1)'"), ИмяТаблицыСоставКомиссии);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.ЗамещающийСотрудник", ИмяТаблицыСоставКомиссии));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.Отсутствует", ИмяТаблицыСоставКомиссии));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(СтрШаблон("%1ЗамещающийСотрудник", ИмяТаблицыСоставКомиссии));
	
КонецПроцедуры

Процедура НастроитьКолонкиЗамещающийСотрудник(ФормаДокумента, НастройкиМеханизма)
	
	Для Каждого ИмяТабличнойЧасти Из НастройкиМеханизма.ИменаТабличныхЧастей Цикл
		Элемент = ФормаДокумента.Элементы[ИмяТабличнойЧасти + "ЗамещающийСотрудник"];
		
		Элемент.КнопкаСоздания = Ложь;
		Элемент.РежимВыбораИзСписка = Истина;
		Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		Элемент.ВыбиратьТип	 = Ложь;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти