
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокиОтчетов",ПараметрКоманды);
	ДополнительныеПараметры.Вставить("ВидКС","");
	ДополнительныеПараметры.Вставить("ТолькоОшибочные",Истина);
	ДополнительныеПараметры.Вставить("ПараметрыВыполненияКоманды",ПараметрыВыполненияКоманды);
	
	КонтрольныеСоотношенияКлиент.ПроверитьОтчетыКлиентВнутр(ДополнительныеПараметры);
	
	
КонецПроцедуры
