////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("СтруктураРПС", СтруктураРПС) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СтруктураРПС", СтруктураРПС, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(СтруктураРПС));
		Элементы.ОтборСтруктураРПС.ТолькоПросмотр = Истина;	
		Элементы.ОтборСтруктураРПС.Видимость = Ложь;
		Элементы.СтруктураРПС.Видимость = Ложь;
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		Список.Группировка.Элементы.Очистить();	
	КонецЕсли;	
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборСтруктураРПСПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "СтруктураРПС", СтруктураРПС, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(СтруктураРПС));
КонецПроцедуры
