#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидОперации");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", "Передача здания (сооружения) (Акт приема-передачи ОС-1а)");
	
	ЭтоПередачаОСЗабаланс = (РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаОСАренда) Или 
		(РеквизитыДокумента.ВидОперации = Перечисления.ВидыОперацийПередачиОС.ПередачаОСвПользование);
	Запрос.УстановитьПараметр("ЭтоПередачаОСЗабаланс", ЭтоПередачаОСЗабаланс);
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ТаблицаОсновныеСредства.ЦМОПолучатель КАК ЦМОПолучатель,
	|	ТаблицаОсновныеСредства.Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.ВидОперации КАК ВидОперации,
	|	ТаблицаОсновныеСредства.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	1 КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	"""" КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.ПередачаЗдания КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаОСЗабаланс
	|			ТОГДА ТаблицаОсновныеСредства.ЦМОПолучатель
	|		ИНАЧЕ ТаблицаОсновныеСредства.ЦМО
	|	КОНЕЦ КАК ЦМО,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаОСЗабаланс
	|			ТОГДА ТаблицаОсновныеСредства.ПодразделениеПолучатель
	|		ИНАЧЕ ТаблицаОсновныеСредства.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаОСЗабаланс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета)
	|	КОНЕЦ КАК Состояние,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаОСЗабаланс
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаОСЗабаланс
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ВнутреннееПеремещение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|	КОНЕЦ КАК Событие,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА &ЭтоПередачаОСЗабаланс
	|			ТОГДА ТаблицаОсновныеСредства.Дата
	|		ИНАЧЕ ТаблицаОсновныеСредства.ДатаСписанияСБухУчета
	|	КОНЕЦ КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаОСАренда)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.СдачаВАренду)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование)
	|	КОНЕЦ,
	|	ТаблицаОсновныеСредства.Дата,
	|	ТаблицаОсновныеСредства.НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка,
	|	ТаблицаОсновныеСредства.Дата
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	&ЭтоПередачаОСЗабаланс";
	
	НомераТаблиц.Вставить("ОсновныеСредстваВПользовании", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПередачиОС.ПередачаОСАренда)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.СдачаВАренду)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование)
	|	КОНЕЦ КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК Период,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	&ЭтоПередачаОСЗабаланс";
	
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(РеквизитыДокумента.ВидОперации);
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаЗдания";
	КомандаПечати.Идентификатор		= "ОС1а";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о приеме - передаче здания (ОС-1а)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент, ТабличныйДокумент2, ТабличныйДокумент3;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС1а") Тогда
		
		ДанныеДокументов = УправлениеОсновнымиСредствами.ДокументыДляПечатиАктОС1_Передача(МассивОбъектов, Ложь, Истина, Ложь);
		УправлениеОсновнымиСредствами.НапечататьОС1(ДанныеДокументов, ОбъектыПечати, ТабличныйДокумент); 
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1а","ОС-1а", ТабличныйДокумент);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
