#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


// Возвращает вид документа, соответствующий переданным значениям реквизитов.
//
// Параметры:
//  Отбор - Структура - значения реквизитов, по которым осуществляется поиск.
//   * Ключ - Строка - имя реквизита справочника.
//   * Значение - Произвольный - значение реквизита справочника.
//
// Возвращаемое значение:
//  СправочникСсылка.ВидыДокументовБИА, Неопределено - найденный элемент.
//
Функция НайтиВидДокумента(Отбор) Экспорт 
	
	НайденныйВид = Неопределено;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыДокументовБИА.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыДокументовБИА КАК ВидыДокументовБИА
		|ГДЕ
		|	НЕ ВидыДокументовБИА.ПометкаУдаления");
	
	Для Каждого КлючИЗначение Из Отбор Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		Запрос.Текст = Запрос.Текст + Символы.ПС + СтрШаблон("	И &%1 = %1", КлючИЗначение.Ключ);
	КонецЦикла;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НайденныйВид = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат НайденныйВид;
	
КонецФункции

#КонецОбласти

#КонецЕсли

