&НаКлиенте
Перем ТекстЗаголовкаСообщений;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовкаСообщений = НСтр("ru='Ввод начальных остатков НДС'");
	
	ВводНачальныхОстатковКлиент.ПриОткрытии(ЭтаФорма);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Добавляем надпись (программно) на страницу "Бухгалтерская операция":
	ДобавитьНадписьНаЗакладкуБухОперация();
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
	// Очищаем колонки ТЧ, которые не используются для текущего выбранного Вида НДС:
	ИменаОчищаемыхПолей = ?(Объект.ВходящийНДС,
		ИменаКолонокДляИсходящегоНДС, // при Входящем очищаем Исходящий
		ИменаКолонокДляВходящегоНДС); // при Исходящем очищаем Входящий
		
	ОчищающаяСтруктура = Новый Структура();
	Для Каждого ИмяПоля Из ИменаОчищаемыхПолей Цикл
		ОчищающаяСтруктура.Вставить(ИмяПоля, Неопределено);
	КонецЦикла;
	
	ТЧ = ТекущийОбъект.НДС;
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ОчищающаяСтруктура);
	КонецЦикла;
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	УстановитьЗаголовокФормы();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Заново считываем данные документа,
	// т.к. при его проведении мы обновили колонку "Счет-фактура" табличной части:
	ЭтаФорма.Прочитать();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	// Конец Типовые операции и дополнительные табличные части
	
	// Оповещаем форму Помощника ввода начальных остатков:
	ИмяСобытия = "ЗаписанДокументВводНачальныхОстатков";
	Параметр = Объект["Организация"];
	Оповестить(ИмяСобытия, Параметр);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаВводаОстатковПриИзменении(Элемент)
	
	ЗаполнитьСоответствиеПНСчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииКлиент();
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНДСПриИзменении(Элемент)
	
	// Трансформируем реквизиты формы в реквизиты объекта
	Объект.ВходящийНДС = Булево(ВидНДС);
	
	Если Объект.НДС.Количество() = 0 Тогда
		
		ВидНДСПриИзмененииКлиент();
		
	Иначе
		// Уточним желание сменить Вид НДС
		ТекстСообщения = НСтр("ru='Изменение Вида НДС вызовет очистку некоторых полей
			|в табличной части документа.
			|
			|Продолжить и сменить вид НДС?'");
		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ВидНДСПриИзменении_Ответ", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияОЗавершении, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ВидНДСПриИзменении_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		ВидНДСПриИзмененииКлиент();
	Иначе
		// Отменяем уже произведенное изменение
		Объект.ВходящийНДС = НЕ Объект.ВходящийНДС;
		
		// Трансформируем реквизиты объекта в реквизиты формы
		ВидНДС = Число(Объект.ВходящийНДС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_НДС

&НаКлиенте
Процедура НДСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// Устанавливаем значения полей по умолчанию в новой строке:
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекДанные = Элементы.НДС.ТекущиеДанные;
		
		// 1 - бумажный, 2 - электронный
		ТекДанные["КодСпособаВыставления"] = 1;
		
	КонецЕсли;
	
	НастроитьТипЗначенияСчетФактуры();
	
	НастроитьДоступностьСубконто();
	
	ПрименяемаяИнструкция_ОбновитьСтруктуруДляВводаОстатков();
	
КонецПроцедуры

&НаКлиенте
Процедура НДСДатаСчетаФактурыПриИзменении(Элемент)
	
	ПрименяемаяИнструкция_ОбновитьСтруктуруДляВводаОстатков();
	
КонецПроцедуры

&НаКлиенте
Процедура НДССчетФактураПриИзменении(Элемент)
	
	ОбновитьРеквизитыСчетаФактурыВТекущейСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура НДССчетФактураОчистка(Элемент, СтандартнаяОбработка)
	
	//***
	//// Настраивает выбор типа колонки "Счет фактура":
	//Элементы["НДССчетФактура"].ВыбиратьТип = Истина;
	
	ОбновитьРеквизитыСчетаФактурыВТекущейСтроке();
	
КонецПроцедуры

&НаКлиенте
Процедура НДССчетФактураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Перем ВидДокумента;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Тип") Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	// Перечисляем все типы поля СчетФактура
	
	Если ВыбранноеЗначение = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ВидДокумента = "СчетФактураВыданный";
		
	ИначеЕсли ВыбранноеЗначение = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		ВидДокумента = "СчетФактураПолученный";
		
	ИначеЕсли ВыбранноеЗначение = Тип("ДокументСсылка.ГТДИмпорт") Тогда
		ВидДокумента = "ГТДИмпорт";
		
	ИначеЕсли ВыбранноеЗначение = Тип("ДокументСсылка.РегистрацияСтрокиКнигиПродаж") Тогда
		ВидДокумента = "РегистрацияСтрокиКнигиПродаж";
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Организация", Объект.Организация);
	
	Если ЗначениеЗаполнено(ТекДанные.Контрагент) Тогда
		Отбор.Вставить("Контрагент", ТекДанные.Контрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекДанные.Договор) Тогда
		Отбор.Вставить("Договор", ТекДанные.Договор);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Документ." + ВидДокумента + ".ФормаВыбора", ПараметрыФормы, Элементы["НДССчетФактура"],,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НДССтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСуммуНДС();
	
КонецПроцедуры

&НаКлиенте
Процедура НДССуммаБезНДСПриИзменении(Элемент)
	
	ПересчитатьСуммуНДС();
	
КонецПроцедуры

// При очистке (СчетКредита) также очищает КПССчетРасчетов.
&НаКлиенте
Процедура НДССчетКредитаПриИзменении(Элемент)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекДанные.СчетКредита) Тогда
		ТекДанные.КПССчетРасчетов = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НДССчетКредитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
															СтандартнаяОбработка,
															Новый Структура("Счет, КПС, КФО",
																			ТекДанные.СчетКредита,
																			ТекДанные.КПССчетРасчетов,
																			ТекДанные.КФО),
															Объект.Организация,
															Объект.ИФО,
															ТекДанные["ПрименяемаяИнструкция_СтруктураДляВводаОстатков"]["ДоступныеСчетаВычетаКт"],
															ТекДанные.КФО,
															,
															ПолучитьДату(Объект["Дата"]));
	
КонецПроцедуры
&НаКлиенте
Процедура НДССчетКредитаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
															ТекДанные.КПССчетРасчетов,
															ТекДанные.КФО);
КонецПроцедуры

&НаКлиенте
Процедура НДССчетРасчетовПриИзменении(Элемент)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	Если НЕ Объект.ВходящийНДС
		И НЕ ЗначениеЗаполнено(ТекДанные.СчетРасчетов) Тогда
		// Для исходящего НДС используется "длинный" Счет Расчетов.
		
		ТекДанные.КПССчетРасчетов = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НДССчетРасчетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Перем СпСчетов, СчетПоУмолчанию;
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	Если ТекДанные.ПричинаНалогообложения = ПредопределенноеЗначение("Перечисление.ПричиныНалогообложенияНДС.СМРХозяйственнымСпособом") Тогда
		ТекстСообщения = НСтр("ru='Для причины налогообложения ""СМР хозяйственным способом"" счет расчетов заполнять не надо.'");
		ПоказатьПредупреждение(, ТекстСообщения, 60, ТекстЗаголовкаСообщений);
		Возврат;
	КонецЕсли;	
	
	ПолучитьСчетаРасчетов(СпСчетов, СчетПоУмолчанию);
	
	Если Объект.ВходящийНДС Тогда
		// Для входящего НДС выбираем "короткий" Счет Расчетов.
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ОграниченияСписокСчетов", СпСчетов);
		ПараметрыФормы.Вставить("КодТекущейСтроки", СчетПоУмолчанию);
		ПараметрыФормы.Вставить("НаДату", ПолучитьДату(Объект["Дата"]));
		
		ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент);
		
	Иначе
		// Для исходящего НДС выбираем "длинный" Счет Расчетов.
		
		БухгалтерскийУчетКлиент.ОткрытьФормуВыбораРабочегоСчета(Элемент, 
																СтандартнаяОбработка,
																Новый Структура("Счет, КПС, КФО",
																				СчетПоУмолчанию,
																				ТекДанные.КПССчетРасчетов,
																				ТекДанные.КФО),
																Объект.Организация,
																Объект.ИФО,
																СпСчетов,
																ТекДанные.КФО,
																,
																ПолучитьДату(Объект["Дата"]));
	КонецЕсли
	
КонецПроцедуры
&НаКлиенте
Процедура НДССчетРасчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ Объект.ВходящийНДС Тогда
		// Для исходящего НДС используем "длинный" Счет Расчетов.
		
		ТекДанные = Элементы.НДС.ТекущиеДанные;
		
		БухгалтерскийУчетКлиент.ОбработатьВыборРабочегоСчета(	ВыбранноеЗначение, 
																ТекДанные.КПССчетРасчетов,
																ТекДанные.КФО);
	КонецЕсли;
															
КонецПроцедуры

&НаКлиенте
Процедура НДСПричинаНалогообложенияПриИзменении(Элемент)
	
	НастроитьТипЗначенияСчетФактуры();
	
	ОбновитьСчетРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура НДСВидЦенностиПриИзменении(Элемент)
	
	ОбновитьСчетРасчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура НДССчетДебетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОграниченияСписокСчетов = Новый Массив();
	ОграниченияСписокСчетов.Добавить("401.10");
	ОграниченияСписокСчетов.Добавить("210.13");
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОграниченияСписокСчетов", ОграниченияСписокСчетов);
	
	ОткрытьФорму("ПланСчетов.ЕПСБУ.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НДСКЭКСчетДебетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
    	
	БухгалтерскийУчетКлиент.ОткрытьФормуВыбораКЭК(Элемент, 
								СтандартнаяОбработка,
								ТекДанные.КЭКСчетДебета,
								Объект.Организация, 
								Объект.ИФО,
								ТекДанные.КФО, 
                                ТекДанные.СчетДебета,
								ПолучитьДату(Объект["Дата"]),
								"Дт");
КонецПроцедуры

&НаКлиенте
Процедура НДССубконтоСчетДебета1ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоСчетДебета");
КонецПроцедуры
&НаКлиенте
Процедура НДССубконтоСчетДебета1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,
		ДанныеВыбора,
		СтандартнаяОбработка,
		Объект.Организация,
		ТекДанные.СубконтоСчетДебета1, // ТекущееЗначение
		ТекДанные.СчетДебета, // Счет
		"СубконтоСчетДебета"); // ПрефиксСубконтоДанных
		
КонецПроцедуры
&НаКлиенте
Процедура НДССубконтоСчетДебета2ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоСчетДебета");
КонецПроцедуры
&НаКлиенте
Процедура НДССубконтоСчетДебета2НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,
		ДанныеВыбора,
		СтандартнаяОбработка,
		Объект.Организация,
		ТекДанные.СубконтоСчетДебета2, // ТекущееЗначение
		ТекДанные.СчетДебета, // Счет
		"СубконтоСчетДебета"); // ПрефиксСубконтоДанных
		
КонецПроцедуры
&НаКлиенте
Процедура НДССубконтоСчетДебета3ПриИзменении(Элемент)
	БухгалтерскиеОперацииКлиент.СубконтоПриИзменении(Элемент, "СубконтоСчетДебета");
КонецПроцедуры
&НаКлиенте
Процедура НДССубконтоСчетДебета3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	БухгалтерскиеОперацииКлиент.СубконтоНачалоВыбора(Элемент,
		ДанныеВыбора,
		СтандартнаяОбработка,
		Объект.Организация,
		ТекДанные.СубконтоСчетДебета3, // ТекущееЗначение
		ТекДанные.СчетДебета, // Счет
		"СубконтоСчетДебета"); // ПрефиксСубконтоДанных
		
КонецПроцедуры

&НаКлиенте
Процедура НДСКФОПриИзменении(Элемент)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	БухгалтерскийУчетКлиент.ОбработатьВыборКФО(	Объект.Организация,
												Объект.ИФО,
												ТекДанные.КФО,
												ПолучитьДату(Объект["Дата"]),
												ТекДанные.КПССчетРасчетов); //КПСДт
КонецПроцедуры

// Настраивает доступность СубконтоСчетаДебета.
&НаКлиенте
Процедура НДССчетДебетаПриИзменении(Элемент)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
//	Объект.Счет = ТекДанные.СчетДебета;
	
	НастроитьДоступностьСубконто();
	
КонецПроцедуры

// ----- НДС . Договор -----
&НаКлиенте
Процедура НДСДоговорПриИзменении(Элемент)
	
	ТекДанные = Элементы["НДС"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Обновляем поле "Контрагент" значением из текущего договора:
	ИмяПоляДоговор		= "Договор";
	ИмяПоляКонтрагент	= "Контрагент";
	Если ЗначениеЗаполнено(ТекДанные[ИмяПоляДоговор])
		И НЕ ЗначениеЗаполнено(ТекДанные[ИмяПоляКонтрагент]) Тогда
	
		КонтрагентСсылкаНов = ПолучитьКонтрагента(ТекДанные[ИмяПоляДоговор]);
		
		ТекДанные[ИмяПоляКонтрагент] = КонтрагентСсылкаНов;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СписокСозданныхСчетовФактур(Команда)
	
	ОткрытьСписокСозданныхСчетовФактур();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПризнакАгрегатора(Команда)
	
	ВводНачальныхОстатковКлиент.СнятьПризнакАгрегатора(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетаФактуры(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстСообщения = НСтр("ru='Этот документ ввода остатков еще не записан.
			|Создание счетов-фактур предусмотрено только для сохраненного документа ввода остатков.'");
		
		ПоказатьПредупреждение(, ТекстСообщения, 20, ТекстЗаголовкаСообщений);
		
		Возврат;
		
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru='Будут созданы документы вида:
		| - Счет-фактура полученный
		| - Счет-фактура выданный
		|для тех строк табличной части, в которых не указан документ счета-фактуры.
		|
		|Продолжить и создать новые документы счетов-фактур?'");
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("СоздатьСчетаФактуры_Выбор", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещенияВыбор, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколРаботы(Команда)
	
	ВремТекстовыйДокумент = Новый ТекстовыйДокумент();
	ВремТекстовыйДокумент.ТолькоПросмотр = Истина;
	ВремТекстовыйДокумент.УстановитьТекст(ПротоколРаботы.ПолучитьТекст());
	ВремТекстовыйДокумент.Показать(НСтр("ru='Протокол работы'"));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	ЗаголовокФормы = "Ввод начальных остатков НДС ";
	Если Объект.Ссылка.Пустая() Тогда
		ЗаголовокФормы = ЗаголовокФормы + "(создание)";
	Иначе
		ЗаголовокФормы = ЗаголовокФормы + Объект.Номер + " от " + Объект.Дата;
	КонецЕсли;
	ЭтаФорма.Заголовок = ЗаголовокФормы;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Трансформируем реквизиты объекта в реквизиты формы
	ВидНДС = Число(Объект.ВходящийНДС);
	
	// Инициализация
	СчетДляШапкиДокумента = БухгалтерскийУчетКлиентСервер.СчетПоКоду("210.10", Неопределено);
	Счет30231 = БухгалтерскийУчетКлиентСервер.СчетПоКоду("302.31", Неопределено);
	Счет30234 = БухгалтерскийУчетКлиентСервер.СчетПоКоду("302.34", Неопределено);
	
	ТипОперация_ВходящийНДС		= Справочники.ТиповыеОперации.ВводНачальныхОстатков_ВходящийНДС;
	ТипОперация_ИсходящийНДС	= Справочники.ТиповыеОперации.ПустаяСсылка();
	ПричиныНалогообложенияДляВыданногоСЧФ = Новый ФиксированныйМассив(УчетНДСПовтИсп.ПолучитьПричиныНалогообложенияДляСчетаФактурыВыданного());
	Элементы["ПодразделениеОрганизации"].Видимость = Документы.ВводНачальныхОстатков.ПодразделениеОбязательноКЗаполнению(Объект);

	// Имена колонок ТЧ, используемых только для Входящего НДС:
	ВремМассив = Новый Массив();
	ВремМассив.Добавить("СчетКредита");
	ИменаКолонокДляВходящегоНДС = Новый ФиксированныйМассив(ВремМассив);
	// Имена колонок ТЧ, используемых только для Исходящего НДС:
	ВремМассив = Новый Массив();
	ВремМассив = Новый Массив();
	ВремМассив.Добавить("СчетДебета");
	ВремМассив.Добавить("КЭКСчетДебета");
	ВремМассив.Добавить("СубконтоСчетДебета1");
	ВремМассив.Добавить("СубконтоСчетДебета2");
	ВремМассив.Добавить("СубконтоСчетДебета3");
	ИменаКолонокДляИсходящегоНДС = Новый ФиксированныйМассив(ВремМассив);
	
	// Заполним список выбора "Вид первичного документа" (начало).
	// Его состав - текущее значение реквизита объекта
	// и наименования печатных форм, если они отличаются между собой.
	СписокПечатныхФорм = Новый Массив();
	СписокПечатныхФорм.Добавить("Бухгалтерская справка 0504833"); //Метаданные.ОбщиеКоманды.ПечатьСправки0504833_173.Комментарий);
	
	// Заполняем по возможности пустые поля формы:
	Если Объект.Ссылка.Пустая() Тогда
		
		НастроитьТиповуюОперациюПоВидуНДС();
		
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
		КонецЕсли;
		
		Объект.Счет = ?(Объект.ВходящийНДС,
			СчетДляШапкиДокумента,
			Неопределено);
			
		Объект.ВидПервичногоДокумента = СписокПечатныхФорм[0];
	КонецЕсли;
	
	// Соответствие "Причина налогообложения" - "Список счетов"
	ЗаполнитьСоответствиеПНСчет();
	
	// Заполним список выбора "Вид первичного документа" (окончание).
	ТекВид = Объект.ВидПервичногоДокумента;
	СписокВыбора = Элементы.ВидПервичногоДокумента.СписокВыбора;
	Если НЕ ПустаяСтрока(ТекВид) Тогда
		СписокВыбора.Добавить(ТекВид);
	КонецЕсли;
	Для Каждого ИмяПечФормы Из СписокПечатныхФорм Цикл
		Если НЕ ИмяПечФормы = ТекВид Тогда
			СписокВыбора.Добавить(ИмяПечФормы);
		КонецЕсли;
	КонецЦикла;
	
	УстановитьЗаголовокФормы();
	
	// Настраиваем форму в зависимости от текущего Вида НДС:
	НастроитьПоВидуНДСНаСервере(Истина); // Истина=ЭтоНачальнаяНастройка
	
	// Добавляем надпись (программно) на страницу "Бухгалтерская операция":
	ДобавитьНадписьНаЗакладкуБухОперация();
	
	НадписьИтогоРуб = НСтр("ru='в рублях:'");
	НадписьИтогоВал = НСтр("ru='в валюте:'");
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// Поле "Код способа представления" - текст "бумажный" при значении=1
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Поле ""Код способа представления"" - текст ""бумажный"" при значении=1'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НДС.КодСпособаВыставления");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 1;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Лево);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "бумажный");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НДСКодСпособаВыставления");

	//---
	// Поле "Код способа представления" - текст "электронный" при значении=2
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Поле ""Код способа представления"" - текст ""электронный"" при значении=2'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НДС.КодСпособаВыставления");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 2;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Лево);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "электронный");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НДСКодСпособаВыставления");

	//---
	// Поле "Объект налогообложения" - текст <документ счета-фактуры> при пустой ссылке
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Поле ""Объект налогообложения"" - текст <документ счета-фактуры> при пустой ссылке'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.НДС.ОбъектНалогообложения");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Условие.ПравоеЗначение = Неопределено;

	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<документ счета-фактуры>");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстИнформационнойНадписи);

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("НДСОбъектНалогообложения");
	
	//---
	// Надпись "в рублях"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Надпись ""в рублях""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "НДСПолеНадписьРуб";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
	//---
	// Надпись "в валюте"
	//---
	ЭлементУО = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Надпись ""в валюте""'");
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте'"));
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Право);
	// Условие
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение	= Истина;
	Условие.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение	= Истина;
	// Оформляемые поля
	ИмяЭлемента = "НДСПолеНадписьВал";
	ПолеДляОформления = ЭлементУО.Поля.Элементы.Добавить();
	ПолеДляОформления.Поле = Новый ПолеКомпоновкиДанных(ИмяЭлемента);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНадписьНаЗакладкуБухОперация()
	
	Если НЕ ПолучитьФункциональнуюОпцию("ФормированиеПроводокОбособленноОтДокумента") Тогда
		ИмяДекорации = "ДекорацияБухОперацияКомментарий";
		Если Элементы.Найти(ИмяДекорации) = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить(
				ИмяДекорации, // имя
				Тип("ДекорацияФормы"), // тип
				Элементы["БухгалтерскаяОперация"]); // родитель
		    НовыйЭлемент.Заголовок = НСтр("ru='Для исходящего НДС типовую операцию указывать не следует (должна быть незаполненной)'");
			НовыйЭлемент.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДС()
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	ТекДанные.СуммаНДС = ТекДанные.СуммаБезНДС * УчетНДСКлиентСервер.ЗначениеСтавкиНДС(ТекДанные.СтавкаНДС) / 100;
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСоответствиеПНСчет()
	
	НаДату = ПолучитьДату(Объект.Дата);
	
	ВремСоответствие = Новый Соответствие();
	
	// АвансПолученный
	ВремСписок = Новый СписокЗначений();
	Если НаДату < УчетНДС.ПолучитьДатуНачалаПрименения64н(Объект.Организация) Тогда
		МассивСчетов = УчетНДС.ПолучитьТаблицуСчетовАвансовПолученных()["МассивСчетов"];
	Иначе
		МассивСчетов = БухгалтерскийУчет.СписокСчетов("205.00", НаДату);
	КонецЕсли;
	ВремСписок.ЗагрузитьЗначения(МассивСчетов);
	ВремСоответствие.Вставить(Перечисления.ПричиныНалогообложенияНДС.АвансПолученный,	ВремСписок);
	
	// Реализация, Реализация0
	ВремСписок = Новый СписокЗначений();
	ВремСписок.ЗагрузитьЗначения(ПлатежноРасчетныеДокументы.СформироватьСписокСсылокПоКодуОбъекта("ПланСчетов.ЕПСБУ", "205.20, 205.30, 205.70, 205.80"));
	ВремСоответствие.Вставить(Перечисления.ПричиныНалогообложенияНДС.Реализация,		ВремСписок);
	ВремСоответствие.Вставить(Перечисления.ПричиныНалогообложенияНДС.Реализация0,		ВремСписок);
	
	// АвансВыданный
	ВремСписок = Новый СписокЗначений();
	ВремСписок.ЗагрузитьЗначения(ПлатежноРасчетныеДокументы.СформироватьСписокСсылокПоКодуОбъекта("ПланСчетов.ЕПСБУ", "206.20, 206.30, 206.90"));
	ВремСоответствие.Вставить(Перечисления.ПричиныНалогообложенияНДС.АвансВыданный,		ВремСписок);
	
	// Все остальные причины налогообложения
	ВремСписок = Новый СписокЗначений();
	ВремСписок.ЗагрузитьЗначения(ПлатежноРасчетныеДокументы.СформироватьСписокСсылокПоКодуОбъекта("ПланСчетов.ЕПСБУ", "302.20, 302.30, 302.90"));
	ВремСоответствие.Вставить(1,														ВремСписок);
	
	СоответствиеПНСчет = Новый ФиксированноеСоответствие(ВремСоответствие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСчетаРасчетов(СписокСчетов, СчетПоУмолчанию)
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	ПН = ТекДанные.ПричинаНалогообложения;
	ВЦ = ТекДанные.ВидЦенности;
	
	СписокСчетов = СоответствиеПНСчет.Получить(ПН);
	Если СписокСчетов = Неопределено Тогда
		
		СписокСчетов = СоответствиеПНСчет.Получить(1);
		
		Если ВЦ = ПредопределенноеЗначение("Перечисление.ВидыЦенностейНДС.Материалы") Тогда
			СчетПоУмолчанию = Счет30234;
			
		ИначеЕсли ВЦ = ПредопределенноеЗначение("Перечисление.ВидыЦенностейНДС.ОС") Тогда
			СчетПоУмолчанию = Счет30231;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСчетРасчетов()
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	
	СпСчетов = ""; СчетПоУмолчанию = "";
	ПолучитьСчетаРасчетов(СпСчетов, СчетПоУмолчанию);
	
	ТекДанные.СчетРасчетов = СчетПоУмолчанию;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокСозданныхСчетовФактур()
	
	ПараметрыФормы = Новый Структура("ДокСсылка", Объект.Ссылка);
	
	ОткрытьФорму("Документ.ВводНачальныхОстатков.Форма.СчетаФактуры", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Настраивает форму в зависимости от текущего Вида НДС.
&НаСервере
Процедура НастроитьПоВидуНДСНаСервере(ЭтоНачальнаяНастройка = Ложь)
	
	НастроитьКолонкиПоВидуНДС();
	
	Если НЕ ЭтоНачальнаяНастройка Тогда
		НастроитьТиповуюОперациюПоВидуНДС();
		ОчиститьРеквизитыТабличнойЧастиНесоответствующиеВидуНДС();
	КонецЕсли;
	
	ОграничитьСписокВыбораПричиныНалогообложения();
	
КонецПроцедуры
&НаСервере
Процедура НастроитьКолонкиПоВидуНДС()
	
	Если Объект.ВходящийНДС Тогда
		// НДС входящий.
		МассивИменПоказать = ИменаКолонокДляВходящегоНДС;
		
		// Скрываем колонки исходящего НДС:
		МассивИменСкрыть = ИменаКолонокДляИсходящегоНДС;
		
	Иначе
		// НДС исходящий.
		МассивИменПоказать = ИменаКолонокДляИсходящегоНДС;
		
		// Скрываем колонки входящего НДС:
		МассивИменСкрыть = ИменаКолонокДляВходящегоНДС;
		
	КонецЕсли;
	
	ПрефиксИмениЭлемента = "НДС"; // Для таблицы "НДС"
	
	// Скрываем колонки:
	Для Каждого Имя Из МассивИменСкрыть Цикл
		ИмяЭлемента = ПрефиксИмениЭлемента + Имя;
		Элементы[ИмяЭлемента].Видимость = Ложь;
	КонецЦикла;
	
	// Показываем колонки:
	Для Каждого Имя Из МассивИменПоказать Цикл
		ИмяЭлемента = ПрефиксИмениЭлемента + Имя;
		Элементы[ИмяЭлемента].Видимость = Истина;
	КонецЦикла;
	
	// Отметка незаполненного только для Исходящего НДС:
	Элементы.НДССчетРасчетов.АвтоОтметкаНезаполненного = НЕ Объект.ВходящийНДС;

КонецПроцедуры
&НаСервере
Процедура НастроитьТиповуюОперациюПоВидуНДС()
	
	Попытка
		ЭтаФорма["ТиповаяОперация"] = ?(Объект["ВходящийНДС"],
			ТипОперация_ВходящийНДС,
			ТипОперация_ИсходящийНДС);
		ПодключаемыйСервер_ПриИзмененииТиповойОперации("ТиповыеОперации_ТиповаяОперацияДокумента");
	Исключение
	КонецПопытки;
		
КонецПроцедуры
&НаСервере
Процедура ОчиститьРеквизитыТабличнойЧастиНесоответствующиеВидуНДС()
	
	ЭтаФорма.Модифицированность = Истина;
	
	// Очищаем некоторые поля табличной части:
	ОчищающаяСтруктура = Новый Структура("
		|СчетФактура,
		|ПричинаНалогообложения,
		|СчетРасчетов,
		|КПССчетРасчетов");
	
	Для Каждого СтрокаТЧ Из Объект.НДС Цикл
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ОчищающаяСтруктура);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьСубконто()
	
	ТекДанные = Элементы.НДС.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПрефиксИмени = "НДССубконтоСчетДебета";
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекДанные.СчетДебета);
	Для Индекс = 1 По 3 Цикл
		Элемент = Элементы[ПрефиксИмени + Индекс];
		Элемент.Доступность = ?(Индекс <= ДанныеСчета.КоличествоСубконто, Истина, Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент(СтандартнаяОбработка, ВыбранноеЗначение = Неопределено)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ВыбранноеЗначение", ВыбранноеЗначение);
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ОрганизацияПередИзменениемКлиент_Ответ", ЭтотОбъект, ПараметрыОповещения);
	ПоказатьВопрос(ОписаниеОповещенияОЗавершении,
		НСтр("ru='Изменение организации вызовет очистку
		|табличной части документа.
		|
		|Продолжить и сменить организацию?'"),
		РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет, ТекстЗаголовкаСообщений, КодВозвратаДиалога.Нет);
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПередИзменениемКлиент_Ответ(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		Объект["Организация"] = ПараметрыОповещения["ВыбранноеЗначение"];
		ЭтаФорма.Модифицированность = Истина;
		ОрганизацияПриИзмененииКлиент();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияПриИзмененииКлиент()
	
	ОрганизацияПриИзмененииСервер();
	
КонецПроцедуры
&НаСервере
Процедура ОрганизацияПриИзмененииСервер()
	
	ОчиститьРеквизитыТабличнойЧастиНесоответствующиеОрганизации();
	
КонецПроцедуры
&НаСервере
Процедура ОчиститьРеквизитыТабличнойЧастиНесоответствующиеОрганизации()
	
	// Очищаем табличную часть документа:
	Объект.НДС.Очистить();
	
	// Устанавливаем новую дату документа:
	Объект.Дата = Документы.ВводНачальныхОстатков.ПолучитьДатуНовогоДокумента(Объект.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНДСПриИзмененииКлиент()
	
	ЭтаФорма.Модифицированность = Истина;
	
	Объект.Счет = ?(Объект.ВходящийНДС,
		СчетДляШапкиДокумента,
		Неопределено);
	
	НастроитьПоВидуНДСНаСервере();
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДату(ДатаДокумента)
	
	Возврат КонецГода(ДатаДокумента) + 1;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтрагента(ДоговорСсылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорСсылка, "Контрагент");
	
КонецФункции

&НаКлиенте
Процедура НастроитьТипЗначенияСчетФактуры()
	
	ТекДанные = Элементы["НДС"].ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекПричинаНалогообложения = ТекДанные["ПричинаНалогообложения"];
	
	ВыбиратьТип		= НЕ ЗначениеЗаполнено(ТекПричинаНалогообложения);
	УстановитьТип	= ЗначениеЗаполнено(ТекПричинаНалогообложения)
		И НЕ ЗначениеЗаполнено(ТекДанные["СчетФактура"]);
	
	// Настраивает выбор типа колонки "Счет фактура":
	Элементы["НДССчетФактура"].ВыбиратьТип = ВыбиратьТип;
	Если УстановитьТип Тогда
		ЭтоДляВыданногоСЧФ = ЗначениеЗаполнено(ТекПричинаНалогообложения)
			И НЕ (ПричиныНалогообложенияДляВыданногоСЧФ.Найти(ТекПричинаНалогообложения) = Неопределено);
		
		ТекДанные["СчетФактура"] = ?(ЭтоДляВыданногоСЧФ, СЧФВыданный_ПустаяСсылка, СЧФПолученный_ПустаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОграничитьСписокВыбораПричиныНалогообложения()
	
	ДопустимыеЗначения = УчетНДС.ПолучитьПричиныНалогообложенияВводОстатковНДС(Объект["ВходящийНДС"]);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ДопустимыеЗначения);
	
	НовыеПараметры = Новый Массив();
	НовыеПараметры.Добавить(НовыйПараметр);
	
	Элементы["НДСПричинаНалогообложения"].ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименяемаяИнструкция_ОбновитьСтруктуруДляВводаОстатков()
	
	ТекДанные = Элементы["НДС"].ТекущиеДанные;
	
	ПрименяемаяИнструкцияСтруктура = УчетНДСКлиентСервер.ИнструкцииУчета_ОпределитьСтрокуОбщейТаблицы(ТекДанные["ДатаСчетаФактуры"]);
	
	ДоступныеСчетаВычетаКт = Новый Массив();
	ДоступныеСчетаВычетаКт.Добавить(ПрименяемаяИнструкцияСтруктура["Вычет"]["АвансПолученный"]["СчетВычетКтБезРаспределенияПоУмолчанию"]);//***ДоступныеСчетаВычетаКт.Добавить(ПрименяемаяИнструкцияСтруктура["СчетВычетКтБезРаспределенияПоУмолчанию_АвансПолученный"]);
	ДоступныеСчетаВычетаКт.Добавить(ПрименяемаяИнструкцияСтруктура["Вычет"]["Прочее"]["СчетВычетКтБезРаспределенияПоУмолчанию"]);//***ДоступныеСчетаВычетаКт.Добавить(ПрименяемаяИнструкцияСтруктура["СчетВычетКтБезРаспределенияПоУмолчанию_Прочее"]);
	
	ВсеСчетаВычетаКт = БухгалтерскийУчетВызовСервераПовтИсп.СписокСчетов("210.01,210.10");
	
	ВремСтруктура = Новый Структура();
	ВремСтруктура.Вставить("ДоступныеСчетаВычетаКт",	ДоступныеСчетаВычетаКт);
	
	ПрименяемаяИнструкция_СтруктураДляВводаОстатков = Новый ФиксированнаяСтруктура(ВремСтруктура);
	
	ТекДанные["ПрименяемаяИнструкция_СтруктураДляВводаОстатков"] = ПрименяемаяИнструкция_СтруктураДляВводаОстатков;
	
	// Параметры выбора СчетВычетКт
	НовыеПараметры = Новый Массив();
	НовыйПараметр = Новый ПараметрВыбора("ОграниченияСписокСчетов", ВсеСчетаВычетаКт);
	НовыеПараметры.Добавить(НовыйПараметр);
	Элементы["НДССчетКредита"].ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьРеквизитыСчетаФактурыВТекущейСтроке();
	
	ТекДанные = Элементы["НДС"].ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШапкаДокумента = ПрочитатьРеквизитыСчетаФактуры(ТекДанные["СчетФактура"]);
	
	ЗаполнитьЗначенияСвойств(ТекДанные, ШапкаДокумента);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьРеквизитыСчетаФактуры(СчетФактура)
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		ИменаРеквизитов = "Контрагент,Договор,ПричинаНалогообложения,Номер,Дата";
		
	ИначеЕсли ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		// Вместо Номер и Дата здесь используются реквизиты
		// НомерПервичногоДокумента и ДатаПервичногоДокумента
		ИменаРеквизитов = "Контрагент,Договор,ПричинаНалогообложения,НомерПервичногоДокумента,ДатаПервичногоДокумента";
		
	ИначеЕсли ТипЗнч(СчетФактура) = Тип("ДокументСсылка.ГТДИмпорт") Тогда
		ИменаРеквизитов = "Контрагент,Договор,Номер,Дата";
			
	ИначеЕсли ТипЗнч(СчетФактура) = Тип("ДокументСсылка.РегистрацияСтрокиКнигиПродаж") Тогда
		ИменаРеквизитов = "Контрагент,Договор,ПричинаНалогообложения,Номер,Дата";
		
	Иначе
		Возврат Новый Структура();
	КонецЕсли;
	
	ШапкаДокумента = Новый Структура(ИменаРеквизитов);
	
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		ШапкаДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, ИменаРеквизитов);
	КонецЕсли;
	
	Если НЕ ШапкаДокумента.Свойство("ВидЦенности") Тогда
		ШапкаДокумента.Вставить("ВидЦенности");
	КонецЕсли;
	
	Если НЕ ШапкаДокумента.Свойство("ПричинаНалогообложения") Тогда
		ШапкаДокумента.Вставить("ПричинаНалогообложения");
	КонецЕсли;
	
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.ГТДИмпорт") Тогда
		ШапкаДокумента.Вставить("ПричинаНалогообложения", Перечисления.ПричиныНалогообложенияНДС.ТаможенныеПлатежи);
	КонецЕсли;
	
	Если УчетНДСПовтИсп.Аванс(ШапкаДокумента["ПричинаНалогообложения"]) Тогда
		ШапкаДокумента.Вставить("ВидЦенности", Перечисления.ВидыЦенностейНДС.Аванс);
	КонецЕсли;
	
	// Приведем имена свойств к именам колонок табличной части
	
	Если ТипЗнч(СчетФактура) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		
		ШапкаДокумента.Вставить("НомерСчетаФактуры",	ШапкаДокумента["НомерПервичногоДокумента"]);
		ШапкаДокумента.Вставить("ДатаСчетаФактуры",		ШапкаДокумента["ДатаПервичногоДокумента"]);
		
		ШапкаДокумента.Удалить("НомерПервичногоДокумента");
		ШапкаДокумента.Удалить("ДатаПервичногоДокумента");
		
	Иначе
		
		ШапкаДокумента.Вставить("НомерСчетаФактуры",	ШапкаДокумента["Номер"]);
		ШапкаДокумента.Вставить("ДатаСчетаФактуры",		ШапкаДокумента["Дата"]);
		
		ШапкаДокумента.Удалить("Номер");
		ШапкаДокумента.Удалить("Дата");
		
	КонецЕсли;
	
	Возврат ШапкаДокумента;
	
КонецФункции


&НаКлиенте
Процедура СоздатьСчетаФактуры_Выбор(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> КодВозвратаДиалога.Да Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СоздатьСчетаФактурыКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетаФактурыКлиент()
	
	Элементы.ГруппаСм.Показать();
	
	Статистика = СоздатьСчетаФактурыСервер();
	
	ПоказатьПредупреждение(, Статистика["ТекстСообщения"], 20, ТекстЗаголовкаСообщений);
	
КонецПроцедуры

&НаСервере
Функция СоздатьСчетаФактурыСервер()
	
	Статистика = Документы.ВводНачальныхОстатков.СоздатьДокументыСчетовФактур(Объект);
	
	Документы.ВводНачальныхОстатков.ДобавитьВПротоколРаботы(Статистика, ПротоколРаботы);
	
	// Удаляем свойства, уже не нужные, и приводящие к ошибке передачи типа на клиент
	
	Статистика.Удалить("ТаблицаОшибок");
	
	Модифицированность = Истина;
	
	Возврат Статистика;
	
КонецФункции

#КонецОбласти

#Область ТиповыеОперации

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)
	
	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)
	
	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)
	
	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)
	
	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

#КонецОбласти

#Область ИнформационныйЦентр

#КонецОбласти
