#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт

	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "НачалоПериода, Основание, ВидТабеля");  
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИсправляемыйДокумент", РеквизитыДокумента.Основание);
	
	Если РеквизитыДокумента.ВидТабеля = 0 Тогда
		
		НачалоПериода 	= НачалоМесяца(РеквизитыДокумента.НачалоПериода);
		ГодТабеля 		= Год(НачалоПериода);
		МесяцТабеля 	= Месяц(НачалоПериода);
		ДнейВМесяце 	= День(КонецМесяца(НачалоПериода));
		
		ТекстыЗапроса = Новый Массив;
		
		Для ДеньТабеля = 1 По ДнейВМесяце Цикл
			
			ТекстыЗапроса.Добавить(ТекстЗапросаТабельУчетаПосещаемостиДетейСКорректировкой(ДеньТабеля));
			
			Если ЗначениеЗаполнено(РеквизитыДокумента.Основание) Тогда
				ТекстыЗапроса.Добавить(ТекстЗапросаТабельУчетаПосещаемостиДетейСКорректировкойСторно(ДеньТабеля));
			КонецЕсли;
			
			ИмяПараметраПериод 	= СтрШаблон("Период%1", ДеньТабеля);
			ПараметрПериод 		= Дата(ГодТабеля, МесяцТабеля, ДеньТабеля);
			
			Запрос.УстановитьПараметр(ИмяПараметраПериод, ПараметрПериод);
			
		КонецЦикла;
		
		ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Иначе
		
		ТекстЗапроса = ТекстЗапросаТабельУчетаПосещаемостиДетейСКорректировкойСводный();
		Запрос.УстановитьПараметр("УсловиеСторно", ЗначениеЗаполнено(РеквизитыДокумента.Основание));
		Запрос.УстановитьПараметр("Период", КонецМесяца(РеквизитыДокумента.НачалоПериода));
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТабельУчетаПосещаемостиДетейСКорректировкой", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ТабельУчетаПосещаемостиДетейСКорректировкой";
	КомандаПечати.Идентификатор		= "ПФ_MXL_Форма0504608_103н";
	КомандаПечати.Представление		= НСтр("ru = 'Табель учета посещаемости детей (ф. 0504608), ред.103н'");
	КомандаПечати.Порядок			= 1;

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ТабельУчетаПосещаемостиДетейСКорректировкой";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно";
	КомандаПечати.Представление		= НСтр("ru = 'Табель учета посещаемости детей (сводно)'");
	КомандаПечати.Порядок			= 2;
    
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма0504608_103н") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"ПФ_MXL_Форма0504608_103н",
		"Табель учета посещаемости детей (ф.0504608), ред.103н",
		ПечатьТабеля(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_Форма0504608_103н"));
	КонецЕсли;	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно",
			"Табель учета посещаемости детей (сводно)",
			ПечатьТабеляСводно(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_ТабельУчетаПосещаемостиДетейСводно"));
	КонецЕсли;
		
КонецПроцедуры // Печать()

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаТабельУчетаПосещаемостиДетейСКорректировкой(ДеньТабеля)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Организация КАК Организация,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Группа КАК Группа,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.РодительскаяПлатаДопУслуги КАК РодительскаяПлатаДопУслуги,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ребенок КАК Ребенок,
		|	ВЫБОР
		|		КОГДА ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ВидЗаписиТабеля1
		|				= ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеОплачиваемое)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОплачиваемыеНевыходы,
		|	ВЫБОР
		|		КОГДА ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ВидЗаписиТабеля1
		|				= ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеНеоплачиваемое)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НеоплачиваемыеНевыходы
		|ИЗ
		|	Документ.ТабельУчетаПосещаемостиДетейСКорректировкой.ДанныеОПосещениях КАК ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях
		|ГДЕ
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка = &Ссылка
		|	И ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ВидЗаписиТабеля1
		|		В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеОплачиваемое), ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеНеоплачиваемое))";
	

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Период", СтрШаблон("&Период%1", ДеньТабеля));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВидЗаписиТабеля1", СтрШаблон("ВидЗаписиТабеля%1", ДеньТабеля));
	
    Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаТабельУчетаПосещаемостиДетейСКорректировкойСторно(ДеньТабеля)
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Организация КАК Организация,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Группа КАК Группа,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.РодительскаяПлатаДопУслуги КАК РодительскаяПлатаДопУслуги,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ребенок КАК Ребенок,
		|	ВЫБОР
		|		КОГДА ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ВидЗаписиТабеля1
		|				= ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеОплачиваемое)
		|			ТОГДА -1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОплачиваемыеНевыходы,
		|	ВЫБОР
		|		КОГДА ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ВидЗаписиТабеля1
		|				= ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеНеоплачиваемое)
		|			ТОГДА -1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НеоплачиваемыеНевыходы
		|ИЗ
		|	Документ.ТабельУчетаПосещаемостиДетейСКорректировкой.ДанныеОПосещениях КАК ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях
		|ГДЕ
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка = &ИсправляемыйДокумент
		|	И ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ВидЗаписиТабеля1
		|		В (ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеОплачиваемое), ЗНАЧЕНИЕ(Перечисление.ВидыЗаписейТабеля.НепосещениеНеоплачиваемое))";
	

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Период", СтрШаблон("&Период%1", ДеньТабеля));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВидЗаписиТабеля1", СтрШаблон("ВидЗаписиТабеля%1", ДеньТабеля));
	
    Возврат ТекстЗапроса;
КонецФункции

Функция ТекстЗапросаТабельУчетаПосещаемостиДетейСКорректировкойСводный()

	ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Организация КАК Организация,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Группа КАК Группа,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.РодительскаяПлатаДопУслуги КАК РодительскаяПлатаДопУслуги,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ребенок КАК Ребенок,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ОплНевыходы КАК ОплачиваемыеНевыходы,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.НеоплНевыходы КАК НеоплачиваемыеНевыходы
		|ИЗ
		|	Документ.ТабельУчетаПосещаемостиДетейСКорректировкой.ДанныеОПосещениях КАК ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях
		|ГДЕ
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка = &Ссылка
		|	И (ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ОплНевыходы > 0
		|			ИЛИ ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.НеоплНевыходы > 0)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Организация,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.Группа,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка.РодительскаяПлатаДопУслуги,
		|	ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ребенок,
		|	-ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ОплНевыходы,
		|	-ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.НеоплНевыходы
		|ИЗ
		|	Документ.ТабельУчетаПосещаемостиДетейСКорректировкой.ДанныеОПосещениях КАК ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях
		|ГДЕ
		|	&УсловиеСторно
		|	И ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.Ссылка = &ИсправляемыйДокумент
		|	И (ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.ОплНевыходы > 0
		|			ИЛИ ТабельУчетаПосещаемостиДетейСКорректировкойДанныеОПосещениях.НеоплНевыходы > 0)";
		
    Возврат ТекстЗапроса;

КонецФункции

Функция ПечатьТабеля(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабДокумент 					= Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТабельУчетаПосещаемостиРодительскаяПлата";
	Макет 							= УправлениеПечатью.МакетПечатнойФормы("Документ.ТабельУчетаПосещаемостиДетейСКорректировкой." + ИмяМакета);
	
	Если ИмяМакета = "ПФ_MXL_Форма0504608_103н" Тогда
		ПредставлениеНеоплачиваемый = НСтр("ru = 'Нн'");
		ПредставлениеОплачиваемый   = НСтр("ru = 'Но'");
		ПерваяКолонкаДнейПосещения  = 51;
	КонецЕсли;
		
	ПервыйДокумент = Истина;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		КоличествоДнейВМесяце = Ссылка.КоличествоДнейВМесяце;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Ссылка.ВидТабеля = 1 Тогда
			СообщениеПользователю = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru='В форме 0504608 для вида табеля ""Сводно"" отображается только общее количество дней непосещений, 
											|без отметок по дням отсутствия! (%1)'"),
											Ссылка);
			ОбщегоНазначения.СообщитьПользователю(СообщениеПользователю);
		КонецЕсли;
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечати(Ссылка);
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Заполнить(ДанныеДляПечати.ДанныеШапка);
		ТабДокумент.Вывести(Область);
		
		ОбластьЗаголовокЛеваяЧасть	= Макет.ПолучитьОбласть("Заголовок|ЛеваяЧасть");
		ОбластьЗаголовокПраваяЧасть	= Макет.ПолучитьОбласть("Заголовок|ПраваяЧасть");
		
		МассивОбластей = Новый Массив;
		
		Для К = 29 По 31 Цикл
			МассивОбластей.Добавить(Макет.ПолучитьОбласть("Заголовок|Д"+К));
		КонецЦикла;	
		
		ТабДокумент.Вывести(ОбластьЗаголовокЛеваяЧасть);
		
		Для К = 29 По КоличествоДнейВМесяце Цикл
			ТабДокумент.Присоединить(МассивОбластей[К-29]);
		КонецЦикла;
		
		ТабДокумент.Присоединить(ОбластьЗаголовокПраваяЧасть);
		
		ОбластьСтрокаЛеваяЧасть = Макет.ПолучитьОбласть("Строка|ЛеваяЧасть");
		ОбластьСтрокаПраваяЧасть = Макет.ПолучитьОбласть("Строка|ПраваяЧасть");
		
		МассивОбластей.Очистить();
		
		Для К = 29 По 31 Цикл
			МассивОбластей.Добавить(Макет.ПолучитьОбласть("Строка|Д"+К));
		КонецЦикла;
		
		Для Каждого Стр Из ДанныеДляПечати.ДанныеСтрока Цикл
			ОбластьСтрокаЛеваяЧасть.Параметры.Заполнить(Стр);
			
			ИнтервалЯчеек = 54;
			К = 0;
			
			ТабДокумент.Вывести(ОбластьСтрокаЛеваяЧасть);
			
			Для К = 29 По КоличествоДнейВМесяце Цикл
				МассивОбластей[К-29].Параметры.Заполнить(Стр);
				
				ТабДокумент.Присоединить(МассивОбластей[К-29]);
			КонецЦикла;
			
			ОбластьСтрокаПраваяЧасть.Параметры.Заполнить(Стр);
			ТабДокумент.Присоединить(ОбластьСтрокаПраваяЧасть);
		КонецЦикла;
		
		ОбластьИтогЛеваяЧасть = Макет.ПолучитьОбласть("Итог|ЛеваяЧасть");
		ОбластьИтогПраваяЧасть = Макет.ПолучитьОбласть("Итог|ПраваяЧасть");
		
		МассивОбластей.Очистить();
		
		Для К = 29 По 31 Цикл
			МассивОбластей.Добавить(Макет.ПолучитьОбласть("Итог|Д"+К));
		КонецЦикла;
		
		ОбластьИтогЛеваяЧасть.Параметры.Заполнить(ДанныеДляПечати.ДанныеИтог);
		ТабДокумент.Вывести(ОбластьИтогЛеваяЧасть);
		
		Для К = 29 По КоличествоДнейВМесяце Цикл
			МассивОбластей[К-29].Параметры.Заполнить(ДанныеДляПечати.ДанныеИтог);
			ТабДокумент.Присоединить(МассивОбластей[К-29]);
		КонецЦикла;
		
		ОбластьИтогПраваяЧасть.Параметры.Заполнить(ДанныеДляПечати.ДанныеИтог);
		ТабДокумент.Присоединить(ОбластьИтогПраваяЧасть);
		
		Область = Макет.ПолучитьОбласть("Подписи");
		Область.Параметры.Заполнить(ДанныеДляПечати.ДанныеПодписи);
		ТабДокумент.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПодготовитьДанныеДляПечати(Ссылка)
	
	ДанныеДляПечати = Новый Структура("ДанныеШапка, ДанныеСтрока, ДанныеИтог, ДанныеПодписи");
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Организация,Группа,Дата,НачалоПериода,КонецПериода,КоличествоРабочихДней,РодительскаяПлатаДопУслуги");
	
	КалендарныйГрафикГруппы = РасчетыПоРодительскойПлате.ПолучитьКалендарныйГрафикГруппы(Ссылка.Группа, Ссылка.НачалоПериода);
	
	ПредставленияВидовЗаписейТабеля = Новый Соответствие;
	ПредставленияВидовЗаписейТабеля.Вставить(Перечисления.ВидыЗаписейТабеля.Выходной, "В");
	ПредставленияВидовЗаписейТабеля.Вставить(Перечисления.ВидыЗаписейТабеля.НепосещениеНеоплачиваемое, "Нн");
	ПредставленияВидовЗаписейТабеля.Вставить(Перечисления.ВидыЗаписейТабеля.НепосещениеОплачиваемое, "Но");
	ПредставленияВидовЗаписейТабеля.Вставить(Перечисления.ВидыЗаписейТабеля.НеЧислитсяВГруппе, "-");
	
	ВидыЗаписейНепосещение = Новый Массив;
	ВидыЗаписейНепосещение.Добавить(Перечисления.ВидыЗаписейТабеля.НепосещениеНеоплачиваемое);
	ВидыЗаписейНепосещение.Добавить(Перечисления.ВидыЗаписейТабеля.НепосещениеОплачиваемое);
	
	ПлатаЗаПрисмотрИУход = ДанныеДокумента.РодительскаяПлатаДопУслуги = 0;
		
	// Шапка
	ДанныеШапка = Новый Структура;
	ДанныеШапка.Вставить("Дата", ДанныеДокумента.НачалоПериода);
	ДанныеШапка.Вставить("ДатаДокумента", ДанныеДокумента.Дата);
	ДанныеШапка.Вставить("Учреждение", ?(ДанныеДокумента.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, 
										ДанныеДокумента.Организация.НаименованиеСокращенное,
										ДанныеДокумента.Организация.НаименованиеПолное));
	ДанныеШапка.Вставить("Группа", ДанныеДокумента.Группа);
	ДанныеШапка.Вставить("ОКПО", ДанныеДокумента.Организация.КодОКПО);
	ДанныеШапка.Вставить("ВидРасчета", ?(ПлатаЗаПрисмотрИУход, 
										НСтр("ru = 'Родительская плата за присмотр и уход'"),
										НСтр("ru = 'Дополнительные образовательные услуги'")));
	ДанныеШапка.Вставить("РежимРаботы", ?(ЗначениеЗаполнено(КалендарныйГрафикГруппы), КалендарныйГрафикГруппы, ""));
	
	ДанныеДляПечати.ДанныеШапка = ДанныеШапка;
	
	// ТЧ
	ДанныеТЧ = Новый ТаблицаЗначений;
	
	ДанныеТЧ.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаСтрока(5));
	ДанныеТЧ.Колонки.Добавить("Ребенок", Новый ОписаниеТипов("СправочникСсылка.Дети"));
	ДанныеТЧ.Колонки.Добавить("Счет", ОбщегоНазначения.ОписаниеТипаСтрока(15));
	ДанныеТЧ.Колонки.Добавить("Ставка", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Для Сч = 1 По 31 Цикл
		ДанныеТЧ.Колонки.Добавить("День"+Сч, ОбщегоНазначения.ОписаниеТипаСтрока(2));
	КонецЦикла;
	ДанныеТЧ.Колонки.Добавить("ПропущеноВсего", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ДанныеТЧ.Колонки.Добавить("ПропущеноУчитываемых", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ДанныеТЧ.Колонки.Добавить("ДниКОплате", ОбщегоНазначения.ОписаниеТипаЧисло(3));
	ДанныеТЧ.Колонки.Добавить("ПричиныНепосещения", ОбщегоНазначения.ОписаниеТипаСтрока(0));
	
	ДанныеИтог = Новый Структура;
	Для Сч = 1 По 31 Цикл
		ДанныеИтог.Вставить("День"+Сч,0);
	КонецЦикла;
	ДанныеИтог.Вставить("ПропущеноВсего", 0);
	ДанныеИтог.Вставить("ПропущеноУчитываемых",0);
	ДанныеИтог.Вставить("ДниКОплате",0);
	
	Для Каждого СтрокаПосещений Из Ссылка.ДанныеОПосещениях Цикл
		НоваяСтрокаТЧ = ДанныеТЧ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, СтрокаПосещений);
		
		НоваяСтрокаТЧ.Счет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаПосещений.Ребенок, "Код");
		
		Для Сч = 1 По 31 Цикл
			ВидЗаписиТабеляЗаДень = СтрокаПосещений["ВидЗаписиТабеля"+Сч];
			НоваяСтрокаТЧ["День"+Сч] = ПредставленияВидовЗаписейТабеля.Получить(ВидЗаписиТабеляЗаДень);
			
			Если ВидыЗаписейНепосещение.Найти(ВидЗаписиТабеляЗаДень) <> Неопределено Тогда
				ДанныеИтог["День"+Сч] = ДанныеИтог["День"+Сч]+1;
			КонецЕсли;
		КонецЦикла;
		
		НоваяСтрокаТЧ.ПропущеноВсего = СтрокаПосещений.ОплНевыходы + СтрокаПосещений.НеоплНевыходы;
		НоваяСтрокаТЧ.ПропущеноУчитываемых = СтрокаПосещений.ОплНевыходы;
		НоваяСтрокаТЧ.ДниКОплате = СтрокаПосещений.ВсегоПосещений;
		
		// Механизм расчета ставки сохранен из документа ТабельУчетаПосещаемостиДетей.
		// Поскольку под "ставкой" в табеле может пониматься как сумма начислений, так и ставка (за день или месяц), по которой выполняется расчет.
		Если ПлатаЗаПрисмотрИУход Тогда
			Ставки = РегистрыСведений.СоставГруппДДУ.СрезПоследних(НачалоМесяца(ДанныеДокумента.НачалоПериода), Новый Структура("Ребенок", СтрокаПосещений.Ребенок));
			
			Если Ставки.Количество() = 0 ИЛИ НЕ Ставки[0].Актуальность Тогда
				Ставки = РегистрыСведений.СоставГруппДДУ.СрезПоследних(КонецМесяца(ДанныеДокумента.НачалоПериода), Новый Структура("Ребенок", СтрокаПосещений.Ребенок));
			КонецЕсли;
		Иначе
			Ставки = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(НачалоМесяца(ДанныеДокумента.НачалоПериода), Новый Структура("Ребенок, ГруппаДетскогоУчреждения", СтрокаПосещений.Ребенок, ДанныеДокумента.Группа));
			
			Если Ставки.Количество() = 0 ИЛИ НЕ Ставки[0].Актуальность Тогда
				Ставки = РегистрыСведений.СоставГруппДДУДополнительныеУслуги.СрезПоследних(КонецМесяца(ДанныеДокумента.НачалоПериода), Новый Структура("Ребенок, ГруппаДетскогоУчреждения", СтрокаПосещений.Ребенок, ДанныеДокумента.Группа));
			КонецЕсли;
		КонецЕсли;
		
	Если Ставки.Количество() > 0 Тогда
		Ставка = Ставки[0].СтавкаОплаты;
		Льгота = Ставки[0].Льгота.ПроцентЛьготы;
	Иначе
		Ставка = Справочники.СтавкиОплатыОбразование.ПустаяСсылка();
		Льгота = 0;
	КонецЕсли;
	
		НоваяСтрокаТЧ.Ставка = РасчетыПоРодительскойПлате.СтавкаОплаты(НачалоДня(ДанныеДокумента.НачалоПериода), 
																		КонецДня(ДанныеДокумента.КонецПериода), 
																		Ставка, 
																		ДанныеДокумента.КоличествоРабочихДней, 
																		СтрокаПосещений.ВсегоПосещений,
																		Льгота);
		
		ДанныеИтог.ПропущеноВсего = ДанныеИтог.ПропущеноВсего + НоваяСтрокаТЧ.ПропущеноВсего;
		ДанныеИтог.ПропущеноУчитываемых = ДанныеИтог.ПропущеноУчитываемых + НоваяСтрокаТЧ.ПропущеноУчитываемых;
		ДанныеИтог.ДниКОплате = ДанныеИтог.ДниКОплате + НоваяСтрокаТЧ.ДниКОплате;
	КонецЦикла;
	
	ДанныеДляПечати.ДанныеСтрока = ДанныеТЧ;
	
	// Итоги
	ДанныеДляПечати.ДанныеИтог = ДанныеИтог;
	
	// Подписи
	ОтветственныеЛица = ОрганизационнаяСтруктураПовтИсп.ОтветственныеЛицаОрганизацииСоответствием(Ссылка.Организация, Ссылка.Дата);
	
	Руководитель = ОтветственныеЛица.Получить("Руководитель");
	
	ДанныеПодписи = Новый Структура;
	ДанныеПодписи.Вставить("Руководитель", КорреспондентыКлиентСервер.ФИО(Руководитель.ОтветственноеЛицоФИО, ИСТИНА));
	ДанныеПодписи.Вставить("ДолжностьРуководителя", Руководитель.ДолжностьСсылка);
	ДанныеПодписи.Вставить("Воспитатель", ?(ЗначениеЗаполнено(Ссылка.Группа.Воспитатель), 
											Корреспонденты.ФИОПоОбъекту(Ссылка.Группа.Воспитатель, ИСТИНА), ""));
	ДанныеПодписи.Вставить("ДатаДокумента", Ссылка.Дата);
	ДанныеПодписи.Вставить("ФИООтвИсполнитель", Корреспонденты.ФИОПоОбъекту(Ссылка.ОтветственныйИсполнитель, ИСТИНА));
	ДанныеПодписи.Вставить("ОтвИсполнительДолжность", ОрганизационнаяСтруктура.ДолжностьСотрудника(Ссылка.ОтветственныйИсполнитель, Ссылка.Дата));
	
	ДанныеДляПечати.ДанныеПодписи = ДанныеПодписи;
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция ПечатьТабеляСводно(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.РазмерСтраницы = "A4";
	ТабДокумент.ИмяПараметровПечати = "ПараметрыПечати_ТабельУчетаПосещаемостиДетейСводно";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТабельУчетаПосещаемостиДетейСКорректировкой."+ИмяМакета);
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	ОблИтог = Макет.ПолучитьОбласть("Итог");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиСводно(Ссылка);
		
		ОблЗаголовок.Параметры.Заполнить(ДанныеДляПечати.Заголовок);
		ТабДокумент.Вывести(ОблЗаголовок);
		
		Для Каждого Стр Из ДанныеДляПечати.Строки Цикл
			ОблСтрока.Параметры.Заполнить(Стр);
			ТабДокумент.Вывести(ОблСтрока);
		КонецЦикла;
		
		ОблИтог.Параметры.Заполнить(ДанныеДляПечати.Итог);
		ТабДокумент.Вывести(ОблИтог);
		
		ОблПодвал.Параметры.Заполнить(ДанныеДляПечати.Подвал);
		ТабДокумент.Вывести(ОблПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 1, ОбъектыПечати, Ссылка);
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПодготовитьДанныеДляПечатиСводно(Ссылка)
	Результат = Новый Структура("Заголовок,Строки,Итог,Подвал");
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Организация,Группа,Дата,НачалоПериода,КонецПериода");
	
	Заголовок = Новый Структура;
	Заголовок.Вставить("Период", ПредставлениеПериода(НачалоДня(ДанныеДокумента.НачалоПериода), КонецДня(ДанныеДокумента.КонецПериода)));
	Заголовок.Вставить("Дата", ДанныеДокумента.Дата);
	Заголовок.Вставить("ПоОКУД", "");
	Заголовок.Вставить("ПоОКПО", ДанныеДокумента.Организация.КодОКПО);
	Заголовок.Вставить("Организация", ?(ДанныеДокумента.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, 
					ДанныеДокумента.Организация.НаименованиеСокращенное,
					ДанныеДокумента.Организация.НаименованиеПолное));
	Заголовок.Вставить("Группа", ДанныеДокумента.Группа);
	Результат.Заголовок = Заголовок;
	
	Строки = Новый ТаблицаЗначений;
	Строки.Колонки.Добавить("НомерСтроки", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(5));
	Строки.Колонки.Добавить("Группа", Новый ОписаниеТипов("СправочникСсылка.ГруппыДетскогоУчреждения"));
	Строки.Колонки.Добавить("Ребенок", Новый ОписаниеТипов("СправочникСсылка.Дети"));
	Строки.Колонки.Добавить("НеоплНевыходы", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(2, 0));
	Строки.Колонки.Добавить("ОплНевыходы", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповЧисла(2, 0));
	Строки.Колонки.Добавить("ПричиныНепосещения", ОбщегоНазначенияБГУ.ПолучитьОписаниеТиповСтроки(0));
	
	Для Каждого Стр Из Ссылка.ДанныеОПосещениях Цикл
		
		НоваяСтрока = Строки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр); 
		
		НоваяСтрока.Группа = Ссылка.Группа;
	КонецЦикла;
	
	Результат.Строки = Строки;
	
	Результат.Итог = Новый Структура("НеоплНевыходы,ОплНевыходы", Строки.Итог("НеоплНевыходы"), Строки.Итог("ОплНевыходы"));
	
	Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизацииСсылка("Руководитель", ДанныеДокумента.Организация, ДанныеДокумента.Дата, Неопределено);
	
	Подвал = Новый Структура;
	Подвал.Вставить("Дата", ДанныеДокумента.Дата);
	Подвал.Вставить("Руководитель", Корреспонденты.ФИОПоОбъекту(Руководитель, ИСТИНА));
	
	Результат.Подвал = Подвал;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
