
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Документ", Отчет.Документ);
	
	Элементы.Документ.ТолькоПросмотр = ЗначениеЗаполнено(Отчет.Документ);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("СпособВыводаОтчета", СпособВыводаОтчета);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Значение = Настройки.Получить("СпособВыводаОтчета");
	Если Значение <> Неопределено Тогда
		СпособВыводаОтчета = Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.Документ) Тогда
		
		СформироватьОтчет();
		ОтчетСформирован = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ОтчетСформирован И ЗначениеЗаполнено(Отчет.Документ) Тогда
		
		СформироватьОтчет();
		ОтчетСформирован = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьВыполнить()
	
	ОчиститьСообщения();
	
	СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчет()
	
	Если Не ЗначениеЗаполнено(Отчет.Документ) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран документ'"), , , "Отчет.Документ");
		Возврат;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособВыводаОтчета) Тогда
		// по горизонтали
		СпособВыводаОтчета = 2;
		
	КонецЕсли;
	
	ТабличныйДокумент.Очистить();
	
	Результат = Отчеты.ДвиженияДокументаБГУ.СформироватьОтчет(Отчет.Документ, СпособВыводаОтчета, Истина);
	ТабличныйДокумент.Вывести(Результат);
	
КонецПроцедуры

#КонецОбласти
