#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторПоставляемыхДанных = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	НеИспользовать = Ложь;
	Если СтрЗаканчиваетсяНа(Наименование, "(поставляемый)")
		И ЗначениеЗаполнено(ОбъектКопирования.ИдентификаторПоставляемыхДанных) Тогда
		
		Наименование = Лев(Наименование, СтрДлина(Наименование) - (СтрДлина("(поставляемый)") + 1));
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	НепроверяемыеРеквизиты = Новый Массив;
	Если НеИспользовать Тогда
		НепроверяемыеРеквизиты.Добавить("ТиповаяОперация");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
