#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	ПодготовитьФормуНаСервере();
	
	ЗаполнитьТекстПроСчетФактуруСервер(); 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Подсистема "ОбменСКонтрагентами".
	ВидимостьЭлементовЭДО = Истина;
	ВидимостьДанныхЭДОПродавцаДляГосНужд = ЭлектронныеДокументыБГУ.ВидимостьДанныхЭДОПродавцаДляГосНужд(Объект.Контрагент, Объект.Организация);
	
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	ЗаполнитьТекстПроДопСведенияДляЭлектронногоУПД();
	УстановитьВидимостьЭлементовЭДО(ЭтаФорма, ВидимостьЭлементовЭДО, ВидимостьДанныхЭДОПродавцаДляГосНужд);
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	//ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	ДополнительныеПараметры.Вставить("Объект", Объект);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_ПередаточныйДокументУслугиРаботы", ПараметрыЗаписи, Объект.Ссылка);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".
		
	ИначеЕсли ИмяСобытия = "Запись_СчетФактураВыданный" Тогда
		
		ЗаполнитьТекстПроСчетФактуруКлиент(Параметр, Источник);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".    
	
	ЗаполнитьТекстПроДопСведенияДляЭлектронногоУПД();

	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня Тогда
		
		ДатаПриИзмененииНаСервере();
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДопСведенияЭлектронногоУПДНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВариантВводаДанныхУПД = 2;
	
	ПараметрыДопСведений = НовыеПараметрыДополнительныхСведенийУПД();
	
	ПараметрыДопСведений.Ссылка = Объект.Ссылка;
	ПараметрыДопСведений.ДатаСведений = Объект.Дата;
	ПараметрыДопСведений.Организация = Объект.Организация;
	ПараметрыДопСведений.Контрагент = Объект.Контрагент;
	ПараметрыДопСведений.РеквизитыЛицевогоСчета = Объект.РеквизитыЛицевогоСчета;
	ПараметрыДопСведений.РасчетныйСчетКонтрагента = Объект.РасчетныйСчетКонтрагента;
	ПараметрыДопСведений.ТРУПереданы = Объект.ТРУПереданы;
	ПараметрыДопСведений.ДатаПередачиТРУ = Объект.ДатаПередачиТРУ;
	ПараметрыДопСведений.ОтветственныйПередалТРУ = Объект.ОтветственныйПередалТРУ;
	ПараметрыДопСведений.ОтветственныйПередалТРУВид = Объект.ОтветственныйПередалТРУВид;
	ПараметрыДопСведений.ОтветственныйПередалТРУДоверенность = Объект.ОтветственныйПередалТРУДоверенность;
	ПараметрыДопСведений.ОтветственныйПередалТРУДолжность = Объект.ОтветственныйПередалТРУДолжность;
	ПараметрыДопСведений.ОтветственныйПередалТРУИныеСведения = Объект.ОтветственныйПередалТРУИныеСведения;
	ПараметрыДопСведений.ОтветственныйПередалТРУКонтрагент = Объект.ОтветственныйПередалТРУКонтрагент;
	ПараметрыДопСведений.ОтветственныйПередалТРУОснованиеПолномочий = Объект.ОтветственныйПередалТРУОснованиеПолномочий;
	ПараметрыДопСведений.ОтветственныйПередалТРУДокументПолномочий = Объект.ОтветственныйПередалТРУДокументПолномочий;

	ПараметрыДопСведений.КПСПродавца = Объект.КПСПродавца;
	ПараметрыДопСведений.КодЦелиПродавца = Объект.КодЦелиПродавца;
	ПараметрыДопСведений.ВариантВводаДанныхУПД = ВариантВводаДанныхУПД;
	ПараметрыДопСведений.ВидимостьДанныхЭДОПродавцаДляГосНужд =ВидимостьДанныхЭДОПродавцаДляГосНужд;
	
	ЗаполнитьЗначенияСвойств(ПараметрыДопСведений, Объект, "Ответственный");
	
	ЭлектронныеДокументыБГУКлиент.ОткрытьФормуДопСведенийДляЭлектронногоУПД(ЭтотОбъект, Объект, ПараметрыДопСведений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.СведенияЭлектронногоУПДПоставщика" Тогда
		ОбработатьВыборСведенийЭлектронногоУПДПоставщика(ВыбранноеЗначение);	
	КонецЕсли;
	
	Модифицированность = Истина;
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьТекстПроСчетФактуруКлиент(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения)
	
	Перем ЗначениеСвойства;
	
	ЭтотДокументЯвляетсяОснованием = (ТипЗнч(ПараметрОбработкиОповещения) = Тип("Структура")
		И ПараметрОбработкиОповещения.Свойство("ДокументыОснования", ЗначениеСвойства)
		И ЗначениеСвойства.Найти(Объект.Ссылка) <> Неопределено);
	
	Если ЭтотДокументЯвляетсяОснованием Тогда
		ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения = Неопределено, ИсточникОбработкиОповещения = Неопределено)
	Если (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.СписаниеДоходовБудущихПериодов"))  
		ИЛИ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.НачислениеЗаУслугиОбразования"))  
		ИЛИ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.НачислениеРодительскойПлаты"))  
		ИЛИ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.НачислениеСтудентамЗаПрочиеУслуги"))  
		ИЛИ (ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.НачислениеДоходов")) Тогда 
		СчетФактура = СчетФактураИзДокументаГруппыЭД();
	КонецЕсли;
	
	УчетНДС.ЗаполнитьТекстПроСчетФактуру(ЭтаФорма, ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	
КонецПРоцедуры

&НаСервере
Функция СчетФактураИзДокументаГруппыЭД()
	Результат = Документы.ЭлектронныйПередаточныйДокументУслугиРаботы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СчетФактураВыданный.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	               |ГДЕ
	               |	СчетФактураВыданный.ДокументОснованиеЭДО = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура СчетФактураНажатие(Элемент, СтандартнаяОбработка)
	
	Если (НадписьСчетФактура = НСтр("ru = 'Ввести счет-фактуру'")) Тогда
		СтандартнаяОбработка = Ложь;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Для документа ""Списание доходов будущих периодов"" счета-фактуры вводятся с помощью специальной обработки-помощника,
		|которую можно открыть по кнопке ""Управление счетами-фактурами и печать"" в форме документа-основания.'");
		Сообщение.Сообщить();
	Иначе	
		ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтаФорма, СтандартнаяОбработка, "СчетФактураВыданный");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы(ЭтотОбъект, Объект);
	
	СоздаватьЭлектронныеПередаточныеДокументыДляКонтрагентаИДоговора = ЭлектронныеДокументыБГУ.ЗначениеНастройкиСоздаватьПередаточныеДокументыПоКонтрагентуИДоговору(Объект.ДокументОснование);
	
	РеквизитыДокумента = Новый Структура;
	РеквизитыДокумента.Вставить("Контрагент", Объект.Контрагент);
	РеквизитыДокумента.Вставить("Договор", Объект.Договор);
	
	Если НЕ СоздаватьЭлектронныеПередаточныеДокументыДляКонтрагентаИДоговора И Объект.ИдентификаторыСтрокДокументаОснования.Количество()>0 Тогда
		РеквизитыДокумента.Вставить("ИдентификаторЭД", Объект.ИдентификаторыСтрокДокументаОснования[0].ИдентификаторЭД);
	КонецЕсли;	
	
	НомерЭД = ЭлектронныеДокументыБГУ.НомерПередаточногоДокументаЭД(Объект.ДокументОснование, РеквизитыДокумента, СоздаватьЭлектронныеПередаточныеДокументыДляКонтрагентаИДоговора);
	
	ПереченьИдентификаторовЭД = Объект.ИдентификаторыСтрокДокументаОснования.Выгрузить(,"ИдентификаторЭД");
	
	ДанныеПередаточногоДокумента = ЭлектронныеДокументыБГУ.ДанныеПередаточногоДокумента(Объект.Ссылка, ПереченьИдентификаторовЭД);
	СписокНоменклатуры.Загрузить(ДанныеПередаточногоДокумента.СписокНоменклатуры);
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	ИтогСуммаНДС = СписокНоменклатуры.Итог("СуммаНДС")
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовЭДО(Форма, ВидимостьЭлементовЭДО, ВидимостьДанныхПродавца = Ложь)
	
	Объект = Форма.Объект;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаСостояниеЭДО", "Видимость", ВидимостьЭлементовЭДО);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаРеализацияДляГосНужд", "Видимость", ВидимостьЭлементовЭДО И ВидимостьДанныхПродавца);

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ПриИзмененииКлючевыхРеквизитовСостояниеЭДО(); 
	ЗаполнитьСведенияОПриемкеПередачеПоставщикаДляУПД();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКлючевыхРеквизитовСостояниеЭДО()
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ПараметрыПриИзменении = ОбменСКонтрагентами.ПараметрыПриИзмененииКлючевыхРеквизитовЭДО();
	
	ПараметрыПриИзменении.Форма                 = ЭтотОбъект;
	ПараметрыПриИзменении.ДокументСсылка        = Объект.Ссылка;
	ПараметрыПриИзменении.ДокументОбъект        = РеквизитФормыВЗначение("Объект");
	ПараметрыПриИзменении.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПриИзменении.ГруппаСостояниеЭДО    = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриИзмененииКлючевыхРеквизитовЭДО(ПараметрыПриИзменении);
	
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОПриемкеПередачеПоставщикаДляУПД()
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Возврат;	
	КонецЕсли;
	
	ЛицевойСчетОрганизиции = Справочники.ЛицевыеСчета.ПолучитьРеквизитыЛицевогоСчетаПоУмолчанию(Объект.Организация,
		"Документ.ЗаявкаНаВозврат", Объект.Дата, Перечисления.ТипыЛицевыхСчетов.Казначейский);
	Если ЗначениеЗаполнено(ЛицевойСчетОрганизиции.РеквизитыЛицевогоСчета) Тогда
		Объект.РеквизитыЛицевогоСчета = ЛицевойСчетОрганизиции.РеквизитыЛицевогоСчета;
	КонецЕсли;
	
	Если ЭлектронныеДокументыБГУ.УПДЗаполнятьДатуПередачиПоДатеДокументаРеализации(Объект.Организация) Тогда
		
		Объект.ДатаПередачиТРУ = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
		Объект.ТРУПереданы = Истина;
		
	КонецЕсли;  
	
	СведенияПоОтветственному = ЭлектронныеДокументыБГУ.ПолучитьСведенияОтветственныхЭлектронныУПД(Объект.Организация);
	
	Если ЗначениеЗаполнено(СведенияПоОтветственному) Тогда
		
		Объект.ОтветственныйПередалТРУ 						= СведенияПоОтветственному.ОтветственныйПередалТРУ;	
		Объект.ОтветственныйПередалТРУВид 					= СведенияПоОтветственному.ОтветственныйПередалТРУВид;
		Объект.ОтветственныйПередалТРУДоверенность 			= СведенияПоОтветственному.ОтветственныйПередалТРУДоверенность;
		Объект.ОтветственныйПередалТРУДолжность 			= СведенияПоОтветственному.ОтветственныйПередалТРУДолжность;
		Объект.ОтветственныйПередалТРУИныеСведения 			= СведенияПоОтветственному.ОтветственныйПередалТРУИныеСведения;
		Объект.ОтветственныйПередалТРУКонтрагент 			= СведенияПоОтветственному.ОтветственныйПередалТРУКонтрагент;
		Объект.ОтветственныйПередалТРУДокументПолномочий 	= СведенияПоОтветственному.ОтветственныйПередалТРУДокументПолномочий;
		Объект.ОтветственныйПередалТРУОснованиеПолномочий 	= ""; 

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РеквизитыЛицевогоСчета) Тогда
		ЗаполнитьТекстПроДопСведенияДляЭлектронногоУПД(Объект.РеквизитыЛицевогоСчета);
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаСервере
Процедура ЗаполнитьТекстПроДопСведенияДляЭлектронногоУПД(КлючевойДопРеквизит = Неопределено)
	ЭлектронныеДокументыБГУ.ЗаполнитьТекстПроДопСведенияДляЭлектронногоУПД(ЭтотОбъект, КлючевойДопРеквизит);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСведенийЭлектронногоУПДПоставщика(ДанныеДляУПД)
 	
	Объект.РеквизитыЛицевогоСчета = ДанныеДляУПД.РеквизитыЛицевогоСчета;
	Объект.РасчетныйСчетКонтрагента = ДанныеДляУПД.РасчетныйСчетКонтрагента;
	
	Объект.КПСПродавца = ДанныеДляУПД.КПСПродавца;
	Объект.КодЦелиПродавца = ДанныеДляУПД.КодЦелиПродавца;

	Объект.ТРУПереданы = ДанныеДляУПД.ТРУПереданы;
	Объект.ДатаПередачиТРУ = ДанныеДляУПД.ДатаПередачиТРУ;
	Объект.ОтветственныйПередалТРУ = ДанныеДляУПД.ОтветственныйПередалТРУ;
	Объект.ОтветственныйПередалТРУВид = ДанныеДляУПД.ОтветственныйПередалТРУВид;
	Объект.ОтветственныйПередалТРУДоверенность = ДанныеДляУПД.ОтветственныйПередалТРУДоверенность;
	Объект.ОтветственныйПередалТРУДолжность = ДанныеДляУПД.ОтветственныйПередалТРУДолжность;
	Объект.ОтветственныйПередалТРУИныеСведения = ДанныеДляУПД.ОтветственныйПередалТРУИныеСведения;
	Объект.ОтветственныйПередалТРУКонтрагент = ДанныеДляУПД.ОтветственныйПередалТРУКонтрагент;
	Объект.ОтветственныйПередалТРУОснованиеПолномочий = ДанныеДляУПД.ОтветственныйПередалТРУОснованиеПолномочий;
	Объект.ОтветственныйПередалТРУДокументПолномочий = ДанныеДляУПД.ОтветственныйПередалТРУДокументПолномочий;

	ЗаполнитьТекстПроДопСведенияДляЭлектронногоУПД(ДанныеДляУПД.РеквизитыЛицевогоСчета);
	
КонецПроцедуры	

&НаСервере
Функция НовыеПараметрыДополнительныхСведенийУПД()
	Возврат ЭлектронныеДокументыБГУ.НовыеПараметрыДополнительныхСведенийУПД();
КонецФункции

#КонецОбласти
