#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = ФинансовоеОбеспечение.Итог("Сумма");
	
	Для Каждого МестоИСрок Из МестоИСроки Цикл
		Если МестоИСрок.ДатаНачала > МестоИСрок.ДатаОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Дата начала командировки больше даты ее окончания'"), ,
				"Объект.МестоИСроки[" + МестоИСроки.Индекс(МестоИСрок) + "].ДатаНачала", , Отказ)
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УсловиеПроезда Из УсловияПроезда Цикл
		Если УсловиеПроезда.ДатаОтправления > УсловиеПроезда.ДатаПрибытия Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Дата отправления больше даты прибытия'"), ,
				"Объект.УсловияПроезда[" + УсловияПроезда.Индекс(УсловиеПроезда) + "].ДатаОтправления", , Отказ)
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УсловиеПроживания Из УсловияПроживания Цикл
		Если УсловиеПроживания.ДатаЗаезда > УсловиеПроживания.ДатаВыезда Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Дата заезда больше даты выезда'"), ,
				"Объект.УсловияПроживания[" + УсловияПроживания.Индекс(УсловиеПроживания) + "].ДатаЗаезда", , Отказ)
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьКрайниеДатыПоОснованию(ЭтотОбъект, Отказ);
	
	ДатаНачалаКомандировки = Неопределено;
	ДатаОкончанияКомандировки = Неопределено;
	
	ПунктыНазначения = Новый Массив;
	Для Каждого СтрокаМестоИСроки Из МестоИСроки Цикл
		
		ПунктНазначения = Новый Массив;
		Если ЗначениеЗаполнено(СтрокаМестоИСроки.ПунктНазначения) Тогда
			ПунктНазначения.Добавить(СтрокаМестоИСроки.ПунктНазначения);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаМестоИСроки.ОрганизацияНазначения) Тогда
			ПунктНазначения.Добавить(СтрокаМестоИСроки.ОрганизацияНазначения);
		КонецЕсли;
		Если ПунктНазначения.Количество() > 0 Тогда
			ПунктыНазначения.Добавить(СтрСоединить(ПунктНазначения, " / "));
		КонецЕсли;
		
		Если ДатаНачалаКомандировки = Неопределено Тогда
			ДатаНачалаКомандировки = СтрокаМестоИСроки.ДатаНачала;
		Иначе
			ДатаНачалаКомандировки = Мин(ДатаНачалаКомандировки, СтрокаМестоИСроки.ДатаНачала);
		КонецЕсли;
		
		Если ДатаОкончанияКомандировки = Неопределено Тогда
			ДатаОкончанияКомандировки = СтрокаМестоИСроки.ДатаОкончания;
		Иначе
			ДатаОкончанияКомандировки = Макс(ДатаОкончанияКомандировки, СтрокаМестоИСроки.ДатаОкончания);
		КонецЕсли;
		
	КонецЦикла;
	
	МестоКомандировки = СтрСоединить(ПунктыНазначения, ", ");
	СрокКомандировки = Строка(Формат(ДатаНачалаКомандировки, "ДФ=dd.MM.yyyy"))
						+ " - "
						+ Строка(Формат(ДатаОкончанияКомандировки, "ДФ=dd.MM.yyyy"));
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	ТипРешения = Неопределено;
	НомерИзменения = Неопределено;
	ДатаУтверждения = Неопределено;
	
	Задолженность.Очистить();
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РешениеОКомандировании") Тогда
		
		Если ЭтоНовый() Тогда
			ПроверитьДопустимостьЗаполненияПоДокументу(ДанныеЗаполнения);
		КонецЕсли;
		
		// Заполнение шапки
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, , "Дата, Номер, ПометкаУдаления, Проведен, ДатаУтверждения");
		
		ТипРешения = ПредопределенноеЗначение("Перечисление.ТипыРешенийОКомандировании.ИзменениеКорректирующее");
		
		ДокументОснование = ДанныеЗаполнения;
		
		НомерИзменения = ДанныеЗаполнения.НомерИзменения + 1;
		
		ДатаДокумента = ?(ЗначениеЗаполнено(ДатаУтверждения), ДатаУтверждения,
						?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
		
		Для Каждого ТЧ Из ДанныеЗаполнения.Метаданные().ТабличныеЧасти Цикл
			ЭтотОбъект[ТЧ.Имя].Очистить();
			Для Каждого Строка Из ДанныеЗаполнения[ТЧ.Имя] Цикл
				НоваяСтрока = ЭтотОбъект[ТЧ.Имя].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				Если ТЧ.Имя = "ФинансовоеОбеспечение" Тогда
					НоваяСтрока.Изменение = 0;
					НоваяСтрока.ИзменениеАванса = 0;
					НоваяСтрока.ФинансовыйГод = Год(ДатаДокумента);
				ИначеЕсли ТЧ.Имя = "КурсыВалют" Тогда
					КурсКратность = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НоваяСтрока.Валюта, Дата);
					НоваяСтрока.Курс = КурсКратность.Курс;
					НоваяСтрока.Кратность = КурсКратность.Кратность;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ДанныеЗаполнения));
		ЗначенияДопКолонок = Справочники.ДополнительныеТабличныеЧастиДокументов.ДанныеДополнительныхТабличныхЧастей(
			Идентификатор, ДанныеЗаполнения);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗначенияДопКолонок", ЗначенияДопКолонок);
		
		ТабличныеЧастиДляЗаменыКПС = Новый Массив;
		ТабличныеЧастиДляЗаменыКПС.Добавить(Суточные);
		ТабличныеЧастиДляЗаменыКПС.Добавить(УсловияПроезда);
		ТабличныеЧастиДляЗаменыКПС.Добавить(УсловияПроживания);
		ТабличныеЧастиДляЗаменыКПС.Добавить(ПрочиеРасходы);
		ТабличныеЧастиДляЗаменыКПС.Добавить(ФинансовоеОбеспечение);
		
		РегистрыСведений.СоответствиеКПСПриПереносеОстатков.ЗаменитьКПСвТаблицахСУчетомПереносаОстатковПоКПС(
			ДатаДокумента, ФинансовоеОбеспечение, , ТабличныеЧастиДляЗаменыКПС);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ДатаУтверждения) И ДатаУтверждения < Дата Тогда
		ТекстСообщения = НСтр("ru='Дата утверждения не может быть меньше даты документа.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "ДатаУтверждения", "Объект", Отказ);
	КонецЕсли;	
	
	Если ТипРешения <> Перечисления.ТипыРешенийОКомандировании.ИзменениеАннулирующее Тогда
		
		Для Каждого МестоИСрок Из МестоИСроки Цикл
			ЕстьПустаяДата = Ложь;
			Если Не ЗначениеЗаполнено(МестоИСрок.ДатаНачала) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата начала командировки не заполнена'"), ,
					"Объект.МестоИСроки[" + МестоИСроки.Индекс(МестоИСрок) + "].ДатаНачала", , Отказ);
				ЕстьПустаяДата = Истина;	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(МестоИСрок.ДатаОкончания) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата окончания командировки не заполнена'"), ,
					"Объект.МестоИСроки[" + МестоИСроки.Индекс(МестоИСрок) + "].ДатаОкончания", , Отказ);
				ЕстьПустаяДата = Истина;	
			КонецЕсли;
			Если Не ЕстьПустаяДата И МестоИСрок.ДатаНачала > МестоИСрок.ДатаОкончания Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата начала командировки больше даты ее окончания'"), ,
					"Объект.МестоИСроки[" + МестоИСроки.Индекс(МестоИСрок) + "].ДатаНачала", , Отказ);
			КонецЕсли;	
		КонецЦикла;
		
		Для Каждого УсловиеПроезда Из УсловияПроезда Цикл
			ЕстьПустаяДата = Ложь;
			Если Не ЗначениеЗаполнено(УсловиеПроезда.ДатаОтправления) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата отправления не заполнена'"), ,
					"Объект.УсловияПроезда[" + УсловияПроезда.Индекс(УсловиеПроезда) + "].ДатаОтправления", , Отказ);
				ЕстьПустаяДата = Истина;	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(УсловиеПроезда.ДатаПрибытия) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата прибытия не заполнена'"), ,
					"Объект.УсловияПроезда[" + УсловияПроезда.Индекс(УсловиеПроезда) + "].ДатаПрибытия", , Отказ);
				ЕстьПустаяДата = Истина;	
			КонецЕсли;
			Если Не ЕстьПустаяДата И УсловиеПроезда.ДатаОтправления > УсловиеПроезда.ДатаПрибытия Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата отправления больше даты прибытия'"), ,
					"Объект.УсловияПроезда[" + УсловияПроезда.Индекс(УсловиеПроезда) + "].ДатаОтправления", , Отказ)
			КонецЕсли;	
		КонецЦикла;
		
		Для Каждого УсловиеПроживания Из УсловияПроживания Цикл
			ЕстьПустаяДата = Ложь;
			Если Не ЗначениеЗаполнено(УсловиеПроживания.ДатаЗаезда) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата заезда не заполнена'"), ,
					"Объект.УсловиеПроживания[" + УсловияПроживания.Индекс(УсловиеПроживания) + "].ДатаЗаезда", , Отказ);
				ЕстьПустаяДата = Истина;	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(УсловиеПроживания.ДатаВыезда) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата выезда не заполнена'"), ,
					"Объект.УсловиеПроживания[" + УсловияПроживания.Индекс(УсловиеПроживания) + "].ДатаВыезда", , Отказ);
				ЕстьПустаяДата = Истина;	
			КонецЕсли;
			Если Не ЕстьПустаяДата И УсловиеПроживания.ДатаЗаезда > УсловиеПроживания.ДатаВыезда Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Дата заезда больше даты выезда'"), ,
					"Объект.УсловияПроживания[" + УсловияПроживания.Индекс(УсловиеПроживания) + "].ДатаЗаезда", , Отказ)
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(УсловиеПроживания.ПричинаОтклонения)
				И (УсловиеПроживания.СуммаПоНормативу <> 0 И УсловиеПроживания.СуммаФактическая > УсловиеПроживания.СуммаПоНормативу) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Поле ""Причина отклонения"" не заполнено'"), ,
					"Объект.УсловияПроживания[" + УсловияПроживания.Индекс(УсловиеПроживания) + "].ПричинаОтклонения", , Отказ);
			КонецЕсли;
		КонецЦикла;
		
		ПроверитьКрайниеДатыПроездаИПроживания(ЭтотОбъект, Отказ);
		ПроверитьКрайниеДатыПоОснованию(ЭтотОбъект, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДопустимостьЗаполненияПоДокументу(ДокументОснование)
	
	Если ДокументОснование.ПометкаУдаления Тогда
		
		ТекстОшибки = НСтр("ru='Документ %Документ% помечен на удаление. Ввод на основании невозможен.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОснование);
		
		ВызватьИсключение ТекстОшибки;
		
	ИначеЕсли НЕ ДокументОснование.Проведен Тогда
		
		ТекстОшибки = НСтр("ru='Документ %Документ% не проведен. Ввод на основании невозможен.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОснование);
		
		ВызватьИсключение ТекстОшибки;
		
	ИначеЕсли ДокументОснование.ТипРешения = Перечисления.ТипыРешенийОКомандировании.ИзменениеАннулирующее Тогда
		
		ТекстОшибки = НСтр("ru='Невозможен ввод на основании аннулированного документа.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОснование);
		
		ВызватьИсключение ТекстОшибки;
		
	ИначеЕсли НЕ Документы.РешениеОКомандировании.ЭтоПоследнийДействующийДокумент(ДокументОснование) Тогда
	// Ввод разрешен только для действующего документа
		
		ТекстОшибки = НСтр("ru='Редакция документа %Документ% не действующая. Ввод на основании невозможен.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ДокументОснование);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКрайниеДатыПоОснованию(Объект, Отказ)
	
	// Для изменения с типом "финансовый" требуется, чтобы не изменились крайние даты командировки
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ТипРешения <> ПредопределенноеЗначение("Перечисление.ТипыРешенийОКомандировании.ИзменениеФинансовое") Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаПоОснованию = Неопределено;
	ДатаОкончанияПоОснованию = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РешениеОКомандированииМестоИСроки.ДатаНачала КАК ДатаНачала,
	|	РешениеОКомандированииМестоИСроки.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ДатыКомандировки
	|ИЗ
	|	Документ.РешениеОКомандировании.МестоИСроки КАК РешениеОКомандированииМестоИСроки
	|ГДЕ
	|	РешениеОКомандированииМестоИСроки.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДатыКомандировки.ДатаНачала) КАК ДатаНачала,
	|	МАКСИМУМ(ДатыКомандировки.ДатаОкончания) КАК ДатаОкончания
	|ИЗ
	|	ДатыКомандировки КАК ДатыКомандировки";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДатаНачалаПоОснованию = Выборка.ДатаНачала;
		ДатаОкончанияПоОснованию = Выборка.ДатаОкончания;
	КонецЕсли;
	
	// поиск крайних дат в местах и сроках и условиях проезда
	ДатаНачалаТекущая = Дата(3999,1,1);
	ДатаОкончанияТекущая = Дата(1,1,1);
	
	Для Каждого СтрокаМестоИСроки Из Объект.МестоИСроки Цикл
		ДатаНачалаТекущая = Мин(ДатаНачалаТекущая, СтрокаМестоИСроки.ДатаНачала);
		ДатаОкончанияТекущая = Макс(ДатаОкончанияТекущая, СтрокаМестоИСроки.ДатаОкончания);
	КонецЦикла;
	
	Если ДатаНачалаПоОснованию <> ДатаНачалаТекущая ИЛИ ДатаОкончанияПоОснованию <> ДатаОкончанияТекущая Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Изменились крайние даты нахождения в командировке: было %1 - %2, стало %3 - %4
				|Требуется изменить тип изменения на ""Корректирующий""'"),
			Формат(ДатаНачалаПоОснованию, НСтр("ru='ДФ=''дд.ММ.гггг'''")), Формат(ДатаОкончанияПоОснованию, НСтр("ru='ДФ=''дд.ММ.гггг'''")),
			Формат(ДатаНачалаТекущая, НСтр("ru='ДФ=''дд.ММ.гггг'''")), Формат(ДатаОкончанияТекущая, НСтр("ru='ДФ=''дд.ММ.гггг'''")));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьКрайниеДатыПроездаИПроживания(Объект, Отказ)
	
	СтрокиСообщения = Новый Массив;
	ТекстОшибки = "";
	
	ДатаНачалаКомандировки = Дата(3999,1,1);
	ДатаОкончанияКомандировки = Дата(1,1,1);
	
	Для Каждого МестоИСрок Из МестоИСроки Цикл
		ДатаНачалаКомандировки = Мин(ДатаНачалаКомандировки, МестоИСрок.ДатаНачала);
		ДатаОкончанияКомандировки = Макс(ДатаОкончанияКомандировки, МестоИСрок.ДатаОкончания);	
	КонецЦикла;	
	
	ДатаНачалаУсловияПроезда = Дата(3999,1,1);
	ДатаОкончанияУсловияПроезда = Дата(1,1,1);
	
	Для Каждого СтрокаУсловияПроезда Из Объект.УсловияПроезда Цикл
		ДатаНачалаУсловияПроезда = Мин(ДатаНачалаУсловияПроезда, СтрокаУсловияПроезда.ДатаОтправления);
		ДатаОкончанияУсловияПроезда = Макс(ДатаОкончанияУсловияПроезда, СтрокаУсловияПроезда.ДатаПрибытия);
	КонецЦикла;
	
	ДатаНачалаУсловияПроживания = Дата(3999,1,1);
	ДатаОкончанияУсловияПроживания = Дата(1,1,1);
	
	Для Каждого СтрокаУсловияПроживания Из Объект.УсловияПроживания Цикл
		ДатаНачалаУсловияПроживания = Мин(ДатаНачалаУсловияПроживания, СтрокаУсловияПроживания.ДатаЗаезда);
		ДатаОкончанияУсловияПроживания = Макс(ДатаОкончанияУсловияПроживания, СтрокаУсловияПроживания.ДатаВыезда);
	КонецЦикла;
	
	Если ДатаНачалаКомандировки > ДатаНачалаУсловияПроживания 
			ИЛИ ДатаОкончанияКомандировки < ДатаОкончанияУсловияПроживания Тогда
		СтрокиСообщения.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Даты нахождения в командировке не соответствуют датам условий проживания: Места и сроки %1 - %2, 
				|Условия проживания %3 - %4	Требуется скорректировать даты.'"),
			Формат(ДатаНачалаКомандировки, НСтр("ru='ДФ=''дд.ММ.гггг'''")),
							Формат(ДатаОкончанияКомандировки, НСтр("ru='ДФ=''дд.ММ.гггг'''")),
			Формат(ДатаНачалаУсловияПроживания, НСтр("ru='ДФ=''дд.ММ.гггг'''")),
							Формат(ДатаОкончанияУсловияПроживания, НСтр("ru='ДФ=''дд.ММ.гггг'''"))));	
	КонецЕсли;
	
	ТекстОшибки = СтрСоединить(СтрокиСообщения, Символы.ПС);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
