
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыПраваОбременения = Параметры["ВидыПраваОбременения"];
	Если ПустаяСтрока(ВидыПраваОбременения) Тогда
		Элементы.ВидыПООК.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Данные = ОбщегоНазначения.ЗначениеИзСтрокиXML(ВидыПраваОбременения);
	
	Для Каждого Настройка Из Данные Цикл
		
		НоваяСтрока					= ВидыПО.Добавить();
		НоваяСтрока.ВидПО			= Настройка.Ключ;
		НоваяСтрока.Вручную			= (Настройка.Значение = 0);
		НоваяСтрока.Правообладание	= (Настройка.Значение = 1);
		НоваяСтрока.Обременение		= (Настройка.Значение = 2);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(Результат());
	
КонецПроцедуры

&НаСервере
Функция Результат()
	
	Данные = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ВидыПО Цикл
		Данные.Вставить(СтрокаТаблицы.ВидПО, ?(СтрокаТаблицы.Правообладание, 1, ?(СтрокаТаблицы.Обременение, 2, 0)));
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Данные);
	
КонецФункции

&НаКлиенте
Процедура ВидыПОВручнуюПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыПО.ТекущиеДанные;
	Если ТекущиеДанные.Вручную Тогда
		ТекущиеДанные.Правообладание = Ложь;
		ТекущиеДанные.Обременение = Ложь;
	Иначе
		ТекущиеДанные.Вручную = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыПОПравообладаниеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыПО.ТекущиеДанные;
	Если ТекущиеДанные.Правообладание Тогда
		ТекущиеДанные.Вручную = Ложь;
		ТекущиеДанные.Обременение = Ложь;
	Иначе
		ТекущиеДанные.Правообладание = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыПООбременениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВидыПО.ТекущиеДанные;
	Если ТекущиеДанные.Обременение Тогда
		ТекущиеДанные.Вручную = Ложь;
		ТекущиеДанные.Правообладание = Ложь;
	Иначе
		ТекущиеДанные.Обременение = Истина;
	КонецЕсли;
	
КонецПроцедуры
