#Область ПрограммныйИнтерфейс
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЭлементыОтбора = Новый Структура("ВидПоступления, Основание", ПредопределенноеЗначение("Перечисление.ВидыОперацийИК.Поступление"), ПараметрКоманды);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	
	ОткрытьФорму("Документ.ПринятиеКУчетуОбъектовИК.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
//Код процедур и функций
#КонецОбласти