#Область ОписаниеПеременных

&НаСервере
Перем ЭтоНовый;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ИдентификаторДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ИдентификаторДокумента");
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьОбщиеДанныеФормы(БухгалтерскиеОперацииРаботаСФормами.ШаблонСвойствЭлементаФормы(Истина));
		УстановитьСписокВыбораВидаЭлемента(ЭтотОбъект);
		Если Элементы.Запись_ВидГруппы.СписокВыбора.Количество() > 0
			И Элементы.Запись_ВидГруппы.СписокВыбора.НайтиПоЗначению(Запись_ВидГруппы) = Неопределено Тогда
			
			Запись_ВидГруппы = Элементы.Запись_ВидГруппы.СписокВыбора[0].Значение;
		КонецЕсли;
	КонецЕсли;
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ТиповаяОперацияНаПоддержке = Справочники.ТиповыеОперации.ТиповаяОперацияНаПоддержке(ТекущийОбъект.Владелец);
	
	Если ТиповаяОперацияНаПоддержке Тогда
		ПолучитьДанныеРеквизитаПоставляемойТиповойОперации();
	Иначе
		ПолучитьДанныеРеквизитаТиповойОперации();
	КонецЕсли;
	БухгалтерскиеОперацииРаботаСФормами.ЗаменитьУстаревшееОтображениеОбычнойГруппы(Запись_Отображение);
	УстановитьСписокВыбораВидаЭлемента(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЭтоНовый = ТекущийОбъект.ЭтоНовый();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписываемыеДанные = БухгалтерскиеОперацииРаботаСФормами.ШаблонСвойствЭлементаФормы(Истина);
	ЗаписатьОбщиеДанныеФормы(ЗаписываемыеДанные);
	
	ДанныеРегистра = РегистрыСведений.ДанныеРеквизитовТиповыхОпераций.СоздатьМенеджерЗаписи();
	ДанныеРегистра.РеквизитТиповойОперации = ТекущийОбъект.Ссылка;
	
	Если НЕ ЭтоНовый Тогда
		ДанныеРегистра.Прочитать();
		ДанныеРегистра.РеквизитТиповойОперации = ТекущийОбъект.Ссылка;// если записи в регистре не было
	КонецЕсли;
	
	ДанныеРегистра.УпакованныеНастройки = Новый ХранилищеЗначения(ЗаписываемыеДанные);
	ДанныеРегистра.Записать(Не ЭтоНовый);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("Запись_ВидГруппы");
	ПроверяемыеРеквизиты.Добавить("Запись_Отображение");
	ПроверяемыеРеквизиты.Добавить("Запись_Группировка");
	ПроверяемыеРеквизиты.Добавить("Запись_СквозноеВыравнивание");
	ПроверяемыеРеквизиты.Добавить("Запись_ВыравниваниеЭлементовИЗаголовков");
	ПроверяемыеРеквизиты.Добавить("Запись_РастягиватьПоГоризонтали");
	ПроверяемыеРеквизиты.Добавить("Запись_РастягиватьПоВертикали");
	ПроверяемыеРеквизиты.Добавить("Запись_ОтображениеПодсказки");
	ПроверяемыеРеквизиты.Добавить("Запись_ГоризонтальноеПоложениеВГруппе");
	ПроверяемыеРеквизиты.Добавить("Запись_ВертикальноеПоложениеВГруппе");
	ПроверяемыеРеквизиты.Добавить("Запись_ГоризонтальноеПоложениеПодчиненных");
	ПроверяемыеРеквизиты.Добавить("Запись_ВертикальноеПоложениеПодчиненных");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	УстановитьСписокВыбораВидаЭлемента(ЭтотОбъект);
	Если Элементы.Запись_ВидГруппы.СписокВыбора.НайтиПоЗначению(Запись_ВидГруппы) = Неопределено Тогда
		Запись_ВидГруппы = Элементы.Запись_ВидГруппы.СписокВыбора[0].Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Запись_ПодсказкаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработкаЗакрытияФормы = Новый ОписаниеОповещения("ПриОкончанииРедактированияКомментария", ЭтотОбъект);
	ОткрытьФорму("Справочник.РеквизитыТиповыхОпераций.Форма.ФормаРедактированияКомментария",
		Новый Структура("ТекстКомментария", Запись_Подсказка), ЭтотОбъект,,,,ОбработкаЗакрытияФормы,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.ИмяДляФормулы) Тогда
		СформироватьИмяДляФормулы();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы
//Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	Перем РазрешенныеЭлементы;
	
	Если БухгалтерскиеОперацииКлиент.ЗапроситьРазрешениеРедактированияРеквизитовТиповыхОпераций(РазрешенныеЭлементы) Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, РазрешенныеЭлементы);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеРеквизитаТиповойОперации()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеРеквизитовТиповыхОпераций.ВидЭлемента,
	|	ДанныеРеквизитовТиповыхОпераций.ГруппировкаЭлементов,
	|	ДанныеРеквизитовТиповыхОпераций.Отображение,
	|	ДанныеРеквизитовТиповыхОпераций.ОтображатьЗаголовок,
	|	ДанныеРеквизитовТиповыхОпераций.РастягиватьПоГоризонтали,
	|	ДанныеРеквизитовТиповыхОпераций.УпакованныеНастройки
	|ИЗ
	|	РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
	|ГДЕ
	|	ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации = &РеквизитТиповойОперации";
	Запрос.УстановитьПараметр("РеквизитТиповойОперации", Объект.Ссылка);
	
	ДанныеРеквизита = БухгалтерскиеОперацииРаботаСФормами.ШаблонСвойствЭлементаФормы(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		УпакованныеНастройки = Выборка.УпакованныеНастройки.Получить();
		Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
			
			ДанныеРеквизита = УпакованныеНастройки;
			
		Иначе
		
			ДанныеРеквизита.ВидГруппы = ?(Выборка.ВидЭлемента = 2, "Страницы",
				?(Выборка.ВидЭлемента = 1, "Страница", "Обычная группа"));
			ДанныеРеквизита.Группировка = ?(Выборка.ГруппировкаЭлементов = 1, "Вертикальная", "Горизонтальная");
			ДанныеРеквизита.Отображение = ?(Выборка.Отображение = 3, "Нормальное выделение",
				?(Выборка.Отображение = 2, "Слабое выделение", ?(Выборка.Отображение = 1, "Сильное выделение", "Без отображения")));
			ДанныеРеквизита.ОтображатьЗаголовок = Выборка.ОтображатьЗаголовок;
			ДанныеРеквизита.РастягиватьПоГоризонтали = ?(Выборка.РастягиватьПоГоризонтали = Истина, "Да", "Авто");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьОбщиеДанныеФормы(ДанныеРеквизита);
	
	Возврат ДанныеРеквизита;
	
КонецФункции // ПолучитьДанныеРеквизитаТиповойОперации()

&НаСервере
Функция ПолучитьДанныеРеквизитаПоставляемойТиповойОперации()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоставляемыеРеквизитыТиповыхОпераций.ВидЭлемента КАК ВидЭлемента,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ГруппировкаЭлементов КАК ГруппировкаЭлементов,
	|	ПоставляемыеРеквизитыТиповыхОпераций.Отображение КАК Отображение,
	|	ПоставляемыеРеквизитыТиповыхОпераций.ОтображатьЗаголовок КАК ОтображатьЗаголовок,
	|	ПоставляемыеРеквизитыТиповыхОпераций.РастягиватьПоГоризонтали КАК РастягиватьПоГоризонтали,
	|	ПоставляемыеРеквизитыТиповыхОпераций.УпакованныеНастройки КАК УпакованныеНастройки
	|ИЗ
	|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
	|		ПО РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации = ПоставляемыеРеквизитыТиповыхОпераций.Ссылка
	|ГДЕ
	|	РеквизитыТиповыхОпераций.Ссылка = &РеквизитТиповойОперации";
	Запрос.УстановитьПараметр("РеквизитТиповойОперации", Объект.Ссылка);

	ДанныеРеквизита = БухгалтерскиеОперацииРаботаСФормами.ШаблонСвойствЭлементаФормы(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		УпакованныеНастройки = Выборка.УпакованныеНастройки.Получить();
		Если ТипЗнч(УпакованныеНастройки) = Тип("Структура") Тогда
			
			ЗаполнитьЗначенияСвойств(ДанныеРеквизита, УпакованныеНастройки);
			
		Иначе
			
			БухгалтерскиеОперацииРаботаСФормами.ЗаполнитьСвойстваЭлементаФормыИзСтарогоФорматаНастроек(
				ДанныеРеквизита, Выборка, Ложь);
				
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьОбщиеДанныеФормы(ДанныеРеквизита);
	
	Возврат ДанныеРеквизита;
	
КонецФункции // ПолучитьДанныеРеквизитаПоставляемойТиповойОперации()

&НаСервере
Процедура ЗаполнитьОбщиеДанныеФормы(ДанныеРеквизита)

	Для каждого КлючИЗначение Из ДанныеРеквизита Цикл
	
		ЭтотОбъект["Запись_" + КлючИЗначение.Ключ] = КлючИЗначение.Значение;
	
	КонецЦикла;

КонецПроцедуры // ЗаполнитьОбщиеДанныеФормы()

&НаСервере
Процедура ЗаписатьОбщиеДанныеФормы(ДанныеРеквизита)

	Для каждого КлючИЗначение Из ДанныеРеквизита Цикл
	
		ДанныеРеквизита[КлючИЗначение.Ключ] = ЭтотОбъект["Запись_" + КлючИЗначение.Ключ];
	
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьОбщиеДанныеФормы()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСписокВыбораВидаЭлемента(Форма)
	Перем ДоступноОбычнаяГруппа;
	Перем ДоступноСтраница;
	Перем ДоступноСтраницы;
	Перем ВидЭлементаРодителя;
	
	Если Форма.ТиповаяОперацияНаПоддержке Тогда
		Форма.Элементы.Запись_ВидГруппы.РежимВыбораИзСписка = Ложь;
		Возврат;
	КонецЕсли;
	
	Список = Форма.Элементы.Запись_ВидГруппы.СписокВыбора;

	Если ЗначениеЗаполнено(Форма.Объект.Родитель) Тогда
		ВидЭлементаРодителя = ПолучитьВидГруппы(Форма.Объект.Родитель, Форма.ТиповаяОперацияНаПоддержке);
	КонецЕсли;
	
	Если ВидЭлементаРодителя = "Страницы" Тогда
		ДоступноОбычнаяГруппа = Ложь;
		ДоступноСтраница = Истина;
		ДоступноСтраницы = Ложь;
	Иначе
		ДоступноОбычнаяГруппа = Истина;
		ДоступноСтраница = Ложь;
		ДоступноСтраницы = Истина;
	КонецЕсли;
	
	ЭлементОбычнаяГруппа = Список.НайтиПоЗначению("Обычная группа");
	Если ДоступноОбычнаяГруппа Тогда
		Если ЭлементОбычнаяГруппа = Неопределено Тогда
			Список.Добавить("Обычная группа", "Обычная группа");
		КонецЕсли;
	Иначе
		Если ЭлементОбычнаяГруппа <> Неопределено Тогда
			Список.Удалить(ЭлементОбычнаяГруппа);
		КонецЕсли;
	КонецЕсли;
	
	ЭлементСтраницы = Список.НайтиПоЗначению("Страницы");
	Если ДоступноСтраницы Тогда
		Если ЭлементСтраницы = Неопределено Тогда
			Список.Добавить("Страницы", "Страницы");
		КонецЕсли;
	Иначе
		Если ЭлементСтраницы <> Неопределено Тогда
			Список.Удалить(ЭлементСтраницы);
		КонецЕсли;
	КонецЕсли;
	
	ЭлементСтраница = Список.НайтиПоЗначению("Страница");
	Если ДоступноСтраница Тогда
		Если ЭлементСтраница = Неопределено Тогда
			Список.Добавить("Страница", "Страница");
		КонецЕсли;
	Иначе
		Если ЭлементСтраница <> Неопределено Тогда
			Список.Удалить(ЭлементСтраница);
		КонецЕсли;
	КонецЕсли;
	
	Список.СортироватьПоЗначению();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидГруппы(Знач РеквизитТиповойОперации, Знач РеквизитНаПоддержке)

	Запрос = Новый Запрос;
	Если РеквизитНаПоддержке Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоставляемыеРеквизитыТиповыхОпераций.ВидЭлемента,
		|	ПоставляемыеРеквизитыТиповыхОпераций.УпакованныеНастройки
		|ИЗ
		|	Справочник.РеквизитыТиповыхОпераций КАК РеквизитыТиповыхОпераций
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПоставляемыеРеквизитыТиповыхОпераций КАК ПоставляемыеРеквизитыТиповыхОпераций
		|		ПО РеквизитыТиповыхОпераций.ПоставляемыйРеквизитТиповойОперации = ПоставляемыеРеквизитыТиповыхОпераций.Ссылка
		|ГДЕ
		|	РеквизитыТиповыхОпераций.Ссылка = &РеквизитТиповойОперации";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеРеквизитовТиповыхОпераций.ВидЭлемента,
		|	ДанныеРеквизитовТиповыхОпераций.УпакованныеНастройки
		|ИЗ
		|	РегистрСведений.ДанныеРеквизитовТиповыхОпераций КАК ДанныеРеквизитовТиповыхОпераций
		|ГДЕ
		|	ДанныеРеквизитовТиповыхОпераций.РеквизитТиповойОперации = &РеквизитТиповойОперации";
	КонецЕсли;
	Запрос.УстановитьПараметр("РеквизитТиповойОперации", РеквизитТиповойОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		УпакованныеНастройки = Выборка.УпакованныеНастройки.Получить();
		Если ТипЗнч(УпакованныеНастройки) = Тип("Структура")
			И УпакованныеНастройки.Свойство("ВидГруппы") Тогда
			Возврат УпакованныеНастройки.ВидГруппы;
		Иначе
			ВидЭлемента = ?(Выборка.ВидЭлемента = 2, "Страницы",
				?(Выборка.ВидЭлемента = 1, "Страница", "Обычная группа"));
			Возврат ВидЭлемента;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "Обычная группа";

КонецФункции

&НаКлиенте
Процедура ПриОкончанииРедактированияКомментария(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Запись_ПодсказкаПредставление = Результат;
	Запись_ПодсказкаПредставление = СтрЗаменить(Запись_ПодсказкаПредставление, Символы.ПС, "");
	Запись_ПодсказкаПредставление = СтрЗаменить(Запись_ПодсказкаПредставление, Символы.Таб, "");
	Если ПустаяСтрока(Запись_ПодсказкаПредставление) Тогда
		Запись_Подсказка = "";
	Иначе
		ЗаписатьСериализованнуюПодсказку(Результат);
	КонецЕсли;
	
КонецПроцедуры // ПриОкончанииРедактированияКомментария()

&НаСервере
Процедура ЗаписатьСериализованнуюПодсказку(Знач Результат)

	Запись_Подсказка = ОбщегоНазначения.ЗначениеВСтрокуXML(Результат);

КонецПроцедуры // ЗаписатьСериализованнуюПодсказку()

&НаСервере
Процедура СформироватьИмяДляФормулы()

	Объект.ИмяДляФормулы = Справочники.РеквизитыТиповыхОпераций.СформироватьИмяДляФормулы(Объект);

КонецПроцедуры // СформироватьИмяДляФормулы()

#КонецОбласти

#Область Инициализация

#КонецОбласти



