#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции


// Читает только заголовок, извлекая лишь комментарий, имена объектов (справочников, записей И тп), 
//  а также количество объектов Каждого объекта
//
// Возвращает Истина, если структура заголовка соответствует
//
Функция ПолучитьСвойстваФайлаЗагрузки(Знач ИмяФайла) Экспорт
	
	Попытка
			
		Если ЭтоАдресВременногоХранилища(ИмяФайла) Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("defx");
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(ИмяФайла);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			РабИмяФайла = ИмяВременногоФайла;
			
		Иначе
			
			РабИмяФайла = ИмяФайла;
			
		КонецЕсли;
		
		//**********************************		
				
	Исключение
		
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ЗагрузитьФайл(Знач АдресВременногоХранилищаФайла, Знач ИмяФайла, ИнформацияОбОшибке = "", ВебЗагрузка = Ложь) Экспорт

	ВсеОрганизации = ВсеОрганизации();
	
	ДанныеЗагрузки = Неопределено;
	ТипФайла = "";
	ТипДанных = "";
	
	Если ВебЗагрузка Тогда
		ИмяФайла = АдресВременногоХранилищаФайла;
	КонецЕсли;	

	Сч = 0;
	СчЗакрытыхКонтрактов = 0;
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ДеревоXML = ДеревоXMLИзФайла(ИмяФайла, ВебЗагрузка);
		Если ДеревоXML <> Неопределено Тогда
			ВидСведений = "contract";
			Если ЕстьСвойство(ДеревоXML, ВидСведений) Тогда
				Если ДеревоXML[ВидСведений] <> Неопределено Тогда
					ДанныеЗагрузки = Новый ТаблицаЗначений;
					ДанныеЗагрузки.Колонки.Добавить("ГосКонтракт", Новый ОписаниеТипов("СправочникСсылка.ГосударственныеКонтрактыЕИС"));
					Если ТипЗнч(ДеревоXML.contract) = Тип("СписокXDTO") Тогда
						Для Каждого ТекКонтракт Из ДеревоXML.contract Цикл
							Сч = Сч + 1;
							
							СоздатьИзменитьГосКонтракт(ТекКонтракт, ВсеОрганизации, ДанныеЗагрузки, ИнформацияОбОшибке);	
						КонецЦикла;
					Иначе
						Сч = 1;
						ТекКонтракт = ДеревоXML.contract;
						СоздатьИзменитьГосКонтракт(ТекКонтракт, ВсеОрганизации, ДанныеЗагрузки, ИнформацияОбОшибке);	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			ВидСведений = "closedContract";
			Если ЕстьСвойство(ДеревоXML, ВидСведений) Тогда
				Если ДеревоXML[ВидСведений] <> Неопределено Тогда
					Если ДанныеЗагрузки = Неопределено Тогда 
						ДанныеЗагрузки = Новый ТаблицаЗначений;
						ДанныеЗагрузки.Колонки.Добавить("ГосКонтракт", Новый ОписаниеТипов("СправочникСсылка.ГосударственныеКонтрактыЕИС"));
					КонецЕсли;
					Если ТипЗнч(ДеревоXML.closedContract) = Тип("СписокXDTO") Тогда
						Для Каждого ТекКонтракт Из ДеревоXML.closedContract Цикл
							СчЗакрытыхКонтрактов = СчЗакрытыхКонтрактов + 1;

							СоздатьИзменитьГосКонтракт(ТекКонтракт, ВсеОрганизации, ДанныеЗагрузки, ИнформацияОбОшибке);	
						КонецЦикла;
					Иначе	
						СчЗакрытыхКонтрактов = 1;
						ТекКонтракт = ДеревоXML.closedContract;
						СоздатьИзменитьГосКонтракт(ТекКонтракт, ВсеОрганизации, ДанныеЗагрузки, ИнформацияОбОшибке);	
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеЗагрузки = Неопределено Тогда
				ИнформацияОбОшибке = НСтр("ru = 'Файл не содержит данных для загрузки'");
				Возврат ДанныеЗагрузки;
            КонецЕсли;
			
			Если ДанныеЗагрузки.Количество() > 0 Тогда
				ВидСведений = "contractProcedure";
				Если ЕстьСвойство(ДеревоXML, ВидСведений) Тогда
					Если ДеревоXML[ВидСведений] <> Неопределено Тогда
						Если ТипЗнч(ДеревоXML.contractProcedure) = Тип("СписокXDTO") Тогда
							Для Каждого ТекПроцедураКонтракта Из ДеревоXML.contractProcedure Цикл
								Если ЕстьСвойство(ТекПроцедураКонтракта, "executions") Тогда
									НомерРеестровойЗаписи = ТекПроцедураКонтракта.regNum;
									ЗагрузитьДокументыИсполнения(ТекПроцедураКонтракта, НомерРеестровойЗаписи, ИнформацияОбОшибке);
								КонецЕсли;	
							КонецЦикла;
						Иначе
							ТекПроцедураКонтракта = ДеревоXML.contractProcedure;
							Если ЕстьСвойство(ТекПроцедураКонтракта, "executions") Тогда
								НомерРеестровойЗаписи = ТекПроцедураКонтракта.regNum;
								ЗагрузитьДокументыИсполнения(ТекПроцедураКонтракта, НомерРеестровойЗаписи, ИнформацияОбОшибке);
							КонецЕсли;	
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;

				ВидСведений = "closedContractProcedure";
				Если ЕстьСвойство(ДеревоXML, ВидСведений) Тогда
					Если ДеревоXML[ВидСведений] <> Неопределено Тогда
						Если ТипЗнч(ДеревоXML.closedContractProcedure) = Тип("СписокXDTO") Тогда
							Для Каждого ТекПроцедураКонтракта Из ДеревоXML.closedContractProcedure Цикл
								Если ЕстьСвойство(ТекПроцедураКонтракта, "executions") Тогда
									НомерРеестровойЗаписи = ТекПроцедураКонтракта.regNum;
									ЗагрузитьДокументыИсполнения(ТекПроцедураКонтракта, НомерРеестровойЗаписи, ИнформацияОбОшибке);
								КонецЕсли;	
							КонецЦикла;
						Иначе
							ТекПроцедураКонтракта = ДеревоXML.closedContractProcedure;
							Если ЕстьСвойство(ТекПроцедураКонтракта, "executions") Тогда
								НомерРеестровойЗаписи = ТекПроцедураКонтракта.regNum;
								ЗагрузитьДокументыИсполнения(ТекПроцедураКонтракта, НомерРеестровойЗаписи, ИнформацияОбОшибке);
							КонецЕсли;	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеЗагрузки) Тогда
		ДанныеЗагрузки.Свернуть("ГосКонтракт");
		
		ЗаписатьФайлыКонтрактов(ИмяФайла, Сч, СчЗакрытыхКонтрактов, ВебЗагрузка);
	Иначе
		Информация = НСтр("ru = 'Файл не содержит данных для загрузки'");
	КонецЕсли;
	
	Возврат ДанныеЗагрузки;
КонецФункции // ЗагрузитьФайл()

Процедура СоздатьИзменитьГосКонтракт(ТекКонтракт, ВсеОрганизации, ДанныеЗагрузки, ИнформацияОбОшибке = "")
	
	ИННОрганизации = "";
	КППОрганизации = "";
	Организация = Справочники.Организации.ПустаяСсылка();

	ДанныеКонтракта = ЭлектронноеАктированиеЕИС.РазобратьФайлКонтракта(ТекКонтракт, , Истина, );
	НомерРеестровойЗаписи = ТекКонтракт.regNum;
	ИННОрганизации = ДанныеКонтракта.СведенияОЗаказчике.ИНН;
	КППОрганизации = ДанныеКонтракта.СведенияОЗаказчике.КПП;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ИНН", ИННОрганизации);
	ПараметрыОтбора.Вставить("КПП", КППОрганизации);
	НайденныеСтроки = ВсеОрганизации.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 1 Тогда
		Организация = НайденныеСтроки[0].Организация;
	ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда 
		Для Каждого ТекОрг Из НайденныеСтроки Цикл
			УчетнаяПолитика = ПолучитьУчетнуюПолитику(ТекОрг.Организация, ТекущаяДатаСеанса());
			Если УчетнаяПолитика.ПолномочияПБС Тогда
				Организация = ТекОрг.Организация;
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = НайденныеСтроки[0].Организация;
		КонецЕсли;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Шаблон = НСтр("ru = 'Не удалось загрузить сведения государственного контракта (номер реестровой записи %3) по следующей причине: организация с ИНН/КПП %1/%2 не найдена'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ИННОрганизации, КППОрганизации, НомерРеестровойЗаписи);
		ИнформацияОбОшибке = ИнформацияОбОшибке + Символы.ПС + ОписаниеОшибки;
	Иначе
		
		НеИзменятьДоговорыПриЗагрузкеСведенийГК = ЭлектронныеДокументыБГУ.НеИзменятьДоговорыПриЗагрузкеСведенийГК(Организация);
		
		ЗаполнитьСведенияГосКонтракта = Истина;
		ГосударственныйКонтракт = ГосКонтрактПоНомеруРеестровойЗаписи(НомерРеестровойЗаписи);
		Если ЗначениеЗаполнено(ГосударственныйКонтракт) Тогда
			Если ГосударственныйКонтракт.НоменклатураОбъектовЗакупки.Количество() > 0 Тогда
				ЗаполнитьСведенияГосКонтракта = Ложь;
			КонецЕсли;
			ГосударственныйКонтрактЕИС = ГосударственныйКонтракт.ПолучитьОбъект();
		Иначе	
			ГосударственныйКонтрактЕИС = Справочники.ГосударственныеКонтрактыЕИС.СоздатьЭлемент();
		КонецЕсли;
		
		Если ЗаполнитьСведенияГосКонтракта Тогда
			ЭлектронноеАктированиеЕИСПолучениеВходящих.ЗаполнитьИзДанныхКонтракта(ДанныеКонтракта, ГосударственныйКонтрактЕИС, Истина);
			
			ЗаполнитьЗначенияСвойств(ГосударственныйКонтрактЕИС, ДанныеКонтракта);
			ГосударственныйКонтрактЕИС.Организация = Организация;
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			КонтрагентГоловнаяОрганизация = Справочники.Контрагенты.ПустаяСсылка();
			Если ЗначениеЗаполнено(ДанныеКонтракта.СведенияОПоставщиках) Тогда
				Если ДанныеКонтракта.СведенияОПоставщиках.Количество() = 1 Тогда
					Контрагент = КонтрагентПоПараметрам(ДанныеКонтракта.СведенияОПоставщиках[0].ИНН,
						ДанныеКонтракта.СведенияОПоставщиках[0].КПП,
						ДанныеКонтракта.СведенияОПоставщиках[0].Наименование,
						ДанныеКонтракта.СведенияОПоставщиках[0].ПолноеНаименование);
						
					ГосударственныйКонтрактЕИС.Контрагент = Контрагент;
				ИначеЕсли ДанныеКонтракта.СведенияОПоставщиках.Количество() > 1 Тогда
					Для Каждого ТекСтрокаПоставщика Из ДанныеКонтракта.СведенияОПоставщиках Цикл
						ЗаполнитьДанныеОбособленногоПодразделения = Ложь;
						ЗаполнитьДанныеКонтрагента = Ложь;
						Если ТекСтрокаПоставщика.Свойство("КППОбособленногоПодразделения") Тогда
							Если ЗначениеЗаполнено(ТекСтрокаПоставщика.КППОбособленногоПодразделения) Тогда
								ЗаполнитьДанныеОбособленногоПодразделения = Истина;
							КонецЕсли;
						Иначе
							ЗаполнитьДанныеКонтрагента = Истина;
						КонецЕсли;	
						Если ЗаполнитьДанныеОбособленногоПодразделения Тогда
							Контрагент = КонтрагентПоПараметрам(ТекСтрокаПоставщика.ИНН,
								ТекСтрокаПоставщика.КППОбособленногоПодразделения,
								ТекСтрокаПоставщика.ПолноеНаименованиеОбособленногоПодразделения,
								ТекСтрокаПоставщика.ПолноеНаименованиеОбособленногоПодразделения);
						ИначеЕсли ЗаполнитьДанныеКонтрагента Тогда
							Контрагент = КонтрагентПоПараметрам(ТекСтрокаПоставщика.ИНН,
								ТекСтрокаПоставщика.КПП,
								ТекСтрокаПоставщика.ПолноеНаименование,
								ТекСтрокаПоставщика.ПолноеНаименование);
						Иначе			
							КонтрагентГоловнаяОрганизация = КонтрагентПоПараметрам(ТекСтрокаПоставщика.ИНН,
								ТекСтрокаПоставщика.КПП,
								ТекСтрокаПоставщика.Наименование,
								ТекСтрокаПоставщика.ПолноеНаименование);
						КонецЕсли;	
					КонецЦикла;
					ГосударственныйКонтрактЕИС.Контрагент = Контрагент;
					ГосударственныйКонтрактЕИС.КонтрагентГоловнаяОрганизация = КонтрагентГоловнаяОрганизация;
				КонецЕсли;	
			КонецЕсли;
			
			ИдентификационныйКодЗакупки = ДанныеКонтракта.ИдентификационныйКодЗакупки;
			Если ЗначениеЗаполнено(ИдентификационныйКодЗакупки) Тогда
				Договор = ЭлектронноеАктированиеБГУ.ДоговорПоИКЗ(ИдентификационныйКодЗакупки);
				Если ЗначениеЗаполнено(Договор) Тогда
					ГосударственныйКонтрактЕИС.ВладелецКонтракта = Договор;
					
					//Изменение реквизитов договора
					Если НЕ НеИзменятьДоговорыПриЗагрузкеСведенийГК Тогда
						ДоговорОбъект = Договор.ПолучитьОбъект();
						ДоговорОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
						ДоговорОбъект.Контрагент = Контрагент;
						//смена наименования и реквизитов № и дата
						ДоговорОбъект.ВидОбязательства = НСтр("ru='Государственный контракт'");
						ДоговорОбъект.ДатаДоговора = ДанныеКонтракта.ДатаЗаключенияКонтракта;
						ДоговорОбъект.НомерДоговора = ДанныеКонтракта.НомерКонтракта;
						
						ДоговорОбъект.КраткоеСодержание = ГосударственныйКонтрактЕИС.ПредметКонтракта;
						
						Если НЕ ДанныеКонтракта.ЗакупкаУЕдинственногоПоставщика Тогда
							ДоговорОбъект.ЗаключаетсяПоРезультатамКонкурсныхПроцедур = Истина;
							ДоговорОбъект.ПризнакЗавершенияКонкурсныхПроцедур = Истина;
							ДоговорОбъект.РезультатЗавершенияКонкурсныхПроцедур = 1;
						КонецЕсли;

						ШаблонНаименованияДоговора = НСтр("ru = '%1 от %2 № %3'");
						ДоговорОбъект.Наименование = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименованияДоговора, 
							ДоговорОбъект.ВидОбязательства, ДоговорОбъект.ДатаДоговора, ДоговорОбъект.НомерДоговора);
						
						Если ЗначениеЗаполнено(ДанныеКонтракта.СведенияОПоставщиках) Тогда
							Если ДанныеКонтракта.СведенияОПоставщиках.Количество() > 0 Тогда
								РеквизитыСчетаПоставщика = ДанныеКонтракта.СведенияОПоставщиках[0].РеквизитыСчетаПоставщика;
								Если ЗначениеЗаполнено(РеквизитыСчетаПоставщика) Тогда
									Если РеквизитыСчетаПоставщика.Количество() > 0 Тогда 
										ДоговорОбъект.СчетКонтрагента = СчетКонтрагента(Контрагент, РеквизитыСчетаПоставщика[0]);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;	
						
						ДоговорОбъект.Записать();
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли;
			
			Для Каждого ТекСтрока Из ГосударственныйКонтрактЕИС.ОбъектыЗакупки Цикл
				Если НЕ ЗначениеЗаполнено(ТекСтрока.ЕдиницаИзмеренияНаименование) Тогда
					Если ЗначениеЗаполнено(ТекСтрока.ЕдиницаИзмерения) Тогда
						ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ТекСтрока.ЕдиницаИзмерения);
						Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
							РеквизитыЕдиницыИзмерения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЕдиницаИзмерения, "Наименование, Код");
							ТекСтрока.ЕдиницаИзмеренияНаименование = РеквизитыЕдиницыИзмерения.Наименование;
						КонецЕсли;	
					КонецЕсли;	
				КонецЕсли;
			КонецЦикла;	
			
			ГосударственныйКонтрактЕИС.Записать();
		КонецЕсли;
		
		НоваяСтрока = ДанныеЗагрузки.Добавить();
		НоваяСтрока.ГосКонтракт = ГосударственныйКонтрактЕИС.Ссылка;
		
	КонецЕсли;
КонецПроцедуры	

Функция НовыеДанныеИсполненияКонтракта()
	
	Результат = Новый Структура;
	
	Результат.Вставить("НомерДокумента", "");
	Результат.Вставить("ДатаДокумента", Дата(1,1,1));
	Результат.Вставить("ВидДокумента", "");
	Результат.Вставить("СуммаДокумента", 0);
	Результат.Вставить("ИдентификаторДокумента", "");
	Результат.Вставить("ИдентификаторЭлектронногоАктирования", "");
	Результат.Вставить("НомерРеестровойЗаписи", "");
	Результат.Вставить("ВалютаИсполнения", "");
	Результат.Вставить("ЭтоДокументЭлектронногоАктирования", Ложь);
	
	СведенияОНоменклатуреДокументаИсполненииКонтракта = Новый ТаблицаЗначений;
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("ИдентификаторДокумента");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("ВнутреннийИдентификаторЕИС");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("Сумма");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("Количество");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("Цена");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("НаименованиеНоменклатуры");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("СтавкаНДС");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("ЕдиницаИзмерения");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("КодЕдиницыИзмерения");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("ОКП");
	СведенияОНоменклатуреДокументаИсполненииКонтракта.Колонки.Добавить("ТипНоменклатуры");
	
	Результат.Вставить("СведенияОНоменклатуреДокументаИсполненииКонтракта", СведенияОНоменклатуреДокументаИсполненииКонтракта);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьДокументыИсполнения(ДанныеИсполненияКонтракта, НомерРеестровойЗаписи, ИнформацияОбОшибке)

	СоответствиеСтавокНДС = Новый Соответствие;
	ЭлектронныеДокументыБГУ.ЗаполнитьСоответствиеСтавокНДС(СоответствиеСтавокНДС);

	ЕстьdocAcceptance = Ложь;
	Для Каждого ДанныеИсполнения Из ЗначениеВКоллекцию(ДанныеИсполненияКонтракта.executions) Цикл
		Если ЕстьСвойство(ДанныеИсполнения.execution, "docAcceptance") Тогда
			ЕстьdocAcceptance = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьdocAcceptance Тогда
		ДанныеИсполнения = ЗначениеВКоллекцию(ДанныеИсполненияКонтракта.executions);
	Иначе	
		ДанныеИсполнения = ЗначениеВКоллекцию(ДанныеИсполненияКонтракта.executions.execution);
	КонецЕсли;	
	
	Для Каждого ДанныеИсполнения Из ДанныеИсполнения Цикл
		
		Результат = НовыеДанныеИсполненияКонтракта();
		
		ИдентификаторЭлектронногоАктирования = "";
		ЭтоДокументЭлектронногоАктирования = Ложь;
		
		Если ЕстьdocAcceptance Тогда
			ДанныеДокументаИсполнения = ДанныеИсполнения.execution;
			
			Если ЕстьСвойство(ДанныеИсполнения, "execution") Тогда
				Если ЕстьСвойство(ДанныеДокументаИсполнения, "guidEDI") Тогда
					ИдентификаторЭлектронногоАктирования = ДанныеДокументаИсполнения.guidEDI;
					ЭтоДокументЭлектронногоАктирования = Истина;
				КонецЕсли;
			Иначе
				Если ЕстьСвойство(ДанныеИсполнения.Владелец.execution, "guidEDI") Тогда
					ИдентификаторЭлектронногоАктирования = ДанныеДокументаИсполнения.guidEDI;
					ЭтоДокументЭлектронногоАктирования = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ДанныеДокументаИсполнения = ДанныеИсполнения;
		КонецЕсли;	
		
		ЕстьdocAcceptanceВДанныхИсполнения = Ложь;
		Если ЕстьСвойство(ДанныеДокументаИсполнения, "docAcceptance") Тогда
			ЕстьdocAcceptanceВДанныхИсполнения = Истина;
		КонецЕсли;
		
		Если ЕстьdocAcceptanceВДанныхИсполнения Тогда
			ДатаДокумента = Дата(СтрЗаменить(ДанныеДокументаИсполнения.docAcceptance.documentDate,"-",""));
			НомерДокумента = ДанныеДокументаИсполнения.docAcceptance.documentNum;
			ВидДокумента = ДанныеДокументаИсполнения.docAcceptance.name;
			ИдентификаторДокумента = ДанныеДокументаИсполнения.docAcceptance.sid;
			СуммаДокумента = Число(ДанныеДокументаИсполнения.docAcceptance.fulfilmentSum);
			ВалютаИсполнения = ДанныеДокументаИсполнения.currency.code;
			
			ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			Если ЗначениеЗаполнено(ВалютаИсполнения) Тогда
				ВалютаДокумента = Справочники.Валюты.НайтиПоНаименованию(ВалютаИсполнения);
			КонецЕсли;

			Результат.ДатаДокумента = ДатаДокумента;
			Результат.НомерДокумента = НомерДокумента;
			Результат.ВидДокумента = ВидДокумента;
			Результат.ИдентификаторДокумента = ИдентификаторДокумента;
			Результат.СуммаДокумента = СуммаДокумента;
			Результат.ВалютаИсполнения = ВалютаИсполнения;
			Результат.ИдентификаторЭлектронногоАктирования = ИдентификаторЭлектронногоАктирования;
			Результат.НомерРеестровойЗаписи = НомерРеестровойЗаписи;
			Результат.ЭтоДокументЭлектронногоАктирования = ЭтоДокументЭлектронногоАктирования;
			
			Если ЕстьСвойство(ДанныеДокументаИсполнения, "quantityDrugContractSubjects") Тогда
				Для Каждого ТекНоменклатура Из ЗначениеВКоллекцию(ДанныеДокументаИсполнения.quantityDrugContractSubjects.quantityDrugContractSubject) Цикл
					Сумма = Число(ТекНоменклатура.fulfilmentCostRUR);
					Количество = Число(ТекНоменклатура.consumerPackagesQuantity);
					Цена = Число(ТекНоменклатура.packagePrice);
					
					ВнутреннийИдентификаторЕИС = "";
					Если ЕстьСвойство(ТекНоменклатура, "sid") Тогда
						ВнутреннийИдентификаторЕИС = ТекНоменклатура.sid;
					ИначеЕсли ЕстьСвойство(ТекНоменклатура, "externalSid") Тогда
						ВнутреннийИдентификаторЕИС = ТекНоменклатура.externalSid;
					КонецЕсли;
					
					НаименованиеНоменклатуры = ТекНоменклатура.product.name;

					Если ЕстьСвойство(ТекНоменклатура, "VATRateInfo") Тогда
						СтавкаНДССтр = СтрЗаменить(ТекНоменклатура.VATRateInfo.VATCode, "R", "");
						Если СтавкаНДССтр = "N" Тогда
							СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						Иначе	
							СтавкаНДС = СоответствиеСтавокНДС[СтавкаНДССтр];
						КонецЕсли;
					Иначе
						СтавкаНДССтр = ТекНоменклатура.VATRate;
						Если СтавкаНДССтр = "n" Тогда
							СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						Иначе	
							СтавкаНДС = СоответствиеСтавокНДС[СтавкаНДССтр];
						КонецЕсли;
					КонецЕсли;
					
					Если ЕстьСвойство(ТекНоменклатура.product, "OKPD2") Тогда
						КодОКПД2 = ТекНоменклатура.product.OKPD2.code;
					ИначеЕсли ЕстьСвойство(ТекНоменклатура.product, "KTRU") Тогда
						КодОКПД2 = ТекНоменклатура.product.KTRU.code;
					КонецЕсли;
					
					ОКП = Справочники.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка();
					Если ЗначениеЗаполнено(КодОКПД2) Тогда
						ОКП = Справочники.ОбщероссийскийКлассификаторПродукции.НайтиПоКоду(КодОКПД2);
					КонецЕсли;
					
					КодОКЕИ = ТекНоменклатура.product.OKEI.code;
					ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодОКЕИ);
					
					ТипНоменклатурыЕИС = ТекНоменклатура.product.type;
					ТипНоменклатуры = ТипНоменклатурыБГУ(ТипНоменклатурыЕИС);

					
					НоваяСтрокаНоменклатуры = Результат.СведенияОНоменклатуреДокументаИсполненииКонтракта.Добавить();
					НоваяСтрокаНоменклатуры.ИдентификаторДокумента = ИдентификаторДокумента;
					НоваяСтрокаНоменклатуры.ВнутреннийИдентификаторЕИС = ВнутреннийИдентификаторЕИС;
					НоваяСтрокаНоменклатуры.Сумма = Сумма;
					НоваяСтрокаНоменклатуры.Количество = Количество;
					НоваяСтрокаНоменклатуры.Цена = Цена;
					НоваяСтрокаНоменклатуры.НаименованиеНоменклатуры = НаименованиеНоменклатуры;
					НоваяСтрокаНоменклатуры.СтавкаНДС = СтавкаНДС;
					НоваяСтрокаНоменклатуры.КодЕдиницыИзмерения = КодОКЕИ;
					НоваяСтрокаНоменклатуры.ЕдиницаИзмерения = ЕдиницаИзмерения;
					НоваяСтрокаНоменклатуры.ОКП = ОКП;
					НоваяСтрокаНоменклатуры.ТипНоменклатуры = ТипНоменклатуры;
				КонецЦикла;	
			Иначе	
				Для Каждого ТекНоменклатура Из ЗначениеВКоллекцию(ДанныеДокументаИсполнения.quantityContractSubjects.quantityContractSubject) Цикл
					Сумма = Число(ТекНоменклатура.fulfilledCost);
					Цена = Число(ТекНоменклатура.unitPrice);
					Если ЕстьСвойство(ТекНоменклатура, "quantity") Тогда
						Количество = Число(ТекНоменклатура.quantity);
					Иначе
						Количество = 0;
					КонецЕсли;	
					
					ВнутреннийИдентификаторЕИС = "";
					Если ЕстьСвойство(ТекНоменклатура, "sid") Тогда
						ВнутреннийИдентификаторЕИС = ТекНоменклатура.sid;
					ИначеЕсли ЕстьСвойство(ТекНоменклатура, "externalSid") Тогда
						ВнутреннийИдентификаторЕИС = ТекНоменклатура.externalSid;
					КонецЕсли;
					
					НаименованиеНоменклатуры = ТекНоменклатура.product.name;
					
					Если ЕстьСвойство(ТекНоменклатура.product, "VATRateInfo") Тогда
						СтавкаНДССтр = СтрЗаменить(ТекНоменклатура.product.VATRateInfo.VATCode, "R", "");
						Если СтавкаНДССтр = "N" Тогда
							СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						Иначе	
							СтавкаНДС = СоответствиеСтавокНДС[СтавкаНДССтр];
						КонецЕсли;
					Иначе
						СтавкаНДССтр = ТекНоменклатура.product.VATRate;
						Если СтавкаНДССтр = "n" Тогда
							СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						Иначе	
							СтавкаНДС = СоответствиеСтавокНДС[СтавкаНДССтр];
						КонецЕсли;
					КонецЕсли;
					
					Если ЕстьСвойство(ТекНоменклатура.product, "OKPD2") Тогда
						КодОКПД2 = ТекНоменклатура.product.OKPD2.code;
					ИначеЕсли ЕстьСвойство(ТекНоменклатура.product, "KTRU") Тогда
						КодОКПД2 = ТекНоменклатура.product.KTRU.code;
					КонецЕсли;
					
					ОКП = Справочники.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка();
					Если ЗначениеЗаполнено(КодОКПД2) Тогда
						ОКП = Справочники.ОбщероссийскийКлассификаторПродукции.НайтиПоКоду(КодОКПД2);
					КонецЕсли;
					
					КодОКЕИ = ТекНоменклатура.product.OKEI.code;
					ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(КодОКЕИ);
					
					ТипНоменклатурыЕИС = ТекНоменклатура.product.type;
					ТипНоменклатуры = ТипНоменклатурыБГУ(ТипНоменклатурыЕИС);
					
					НоваяСтрокаНоменклатуры = Результат.СведенияОНоменклатуреДокументаИсполненииКонтракта.Добавить();
					НоваяСтрокаНоменклатуры.ИдентификаторДокумента = ИдентификаторДокумента;
					НоваяСтрокаНоменклатуры.ВнутреннийИдентификаторЕИС = ВнутреннийИдентификаторЕИС;
					НоваяСтрокаНоменклатуры.Сумма = Сумма;
					НоваяСтрокаНоменклатуры.Количество = Количество;
					НоваяСтрокаНоменклатуры.Цена = Цена;
					НоваяСтрокаНоменклатуры.НаименованиеНоменклатуры = НаименованиеНоменклатуры;
					НоваяСтрокаНоменклатуры.СтавкаНДС = СтавкаНДС;
					НоваяСтрокаНоменклатуры.КодЕдиницыИзмерения = КодОКЕИ;
					НоваяСтрокаНоменклатуры.ЕдиницаИзмерения = ЕдиницаИзмерения;
					НоваяСтрокаНоменклатуры.ОКП = ОКП;
					НоваяСтрокаНоменклатуры.ТипНоменклатуры = ТипНоменклатуры;
				КонецЦикла;
			КонецЕсли;
			
			Если НЕ СведенияОДокументеИсполненияЗагружены(НомерРеестровойЗаписи, ИдентификаторДокумента) Тогда
				ГосударственныйКонтракт = Справочники.ГосударственныеКонтрактыЕИС.НайтиПоКоду(НомерРеестровойЗаписи);
				Если ЗначениеЗаполнено(ГосударственныйКонтракт) ТОгда
					РеквизитыКонтракта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ГосударственныйКонтракт, "Организация");
					
					Организация = РеквизитыКонтракта.Организация;
				
					Запись = РегистрыСведений.СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.СоздатьМенеджерЗаписи();
					
					Запись.ГосударственныйКонтракт = ГосударственныйКонтракт;
					Запись.Организация = Организация;

					Запись.ИдентификаторДокумента = ИдентификаторДокумента;
					Запись.ИдентификаторЭлектронногоАктирования = ИдентификаторЭлектронногоАктирования;
					Запись.ЭтоДокументЭлектронногоАктирования = ЭтоДокументЭлектронногоАктирования;
					Запись.НомерДокумента = НомерДокумента;
					Запись.ДатаДокумента = ДатаДокумента;
					Запись.ВидДокумента = ВидДокумента;
					Запись.СуммаДокумента = СуммаДокумента;
					Запись.ВалютаДокумента = ВалютаДокумента;
					Запись.НомерРеестровойЗаписи = НомерРеестровойЗаписи;
					
					Запись.ЗагруженныеДанные = Новый ХранилищеЗначения(Результат);
					Запись.ДатаЗагрузки = ТекущаяДатаСеанса();
					Запись.Пользователь = Пользователи.ТекущийПользователь();
					Запись.Записать();
				Иначе
					Шаблон = НСтр("ru = 'Не удалось загрузить сведения об исполнении государственного контракта (номер реестровой записи %1) по следующей причине: государственный контракт для документа с идентификатором %1 не загружен.'");
					ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, НомерРеестровойЗаписи, ИдентификаторДокумента);
					ИнформацияОбОшибке = ИнформацияОбОшибке + Символы.ПС + ОписаниеОшибки;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Функция СведенияОДокументеИсполненияЗагружены(НомерРеестровойЗаписи, ИдентификаторДокумента)
	Результат = Ложь;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.ИдентификаторЭлектронногоАктирования КАК ИдентификаторЭлектронногоАктирования,
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.ЭтоДокументЭлектронногоАктирования КАК ЭтоДокументЭлектронногоАктирования,
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.НомерДокумента КАК НомерДокумента,
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.ДатаДокумента КАК ДатаДокумента,
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.ВидДокумента КАК ВидДокумента,
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.СуммаДокумента КАК СуммаДокумента,
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.НомерРеестровойЗаписи КАК НомерРеестровойЗаписи
	|ИЗ
	|	РегистрСведений.СведенияОбИсполненииГосударственныхКонтрактовЗагруженные КАК СведенияОбИсполненииГосударственныхКонтрактовЗагруженные
	|ГДЕ
	|	СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.НомерРеестровойЗаписи = &НомерРеестровойЗаписи
	|	И СведенияОбИсполненииГосударственныхКонтрактовЗагруженные.ИдентификаторДокумента = &ИдентификаторДокумента");
	
	Запрос.УстановитьПараметр("НомерРеестровойЗаписи", НомерРеестровойЗаписи);
	Запрос.УстановитьПараметр("ИдентификаторДокумента", ИдентификаторДокумента);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
КонецФункции	

Функция ТипНоменклатурыБГУ(ТипНоменклатурыЕИС)
	Результат = Перечисления.ТипыНоменклатуры.ПрочиеМЗ; 
	
	Если ТипНоменклатурыЕИС = "SERVICE" Тогда
		Результат = Перечисления.ТипыНоменклатуры.Услуга; 
	ИначеЕсли ТипНоменклатурыЕИС = "WORK" Тогда
		Результат = Перечисления.ТипыНоменклатуры.Работа; 
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

Функция ВсеОрганизации()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Организации.Ссылка КАК Организация,
	               |	Организации.ИНН КАК ИНН,
	               |	Организации.КПП КАК КПП
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции	

Функция КонтрагентПоПараметрам(ИНН, КПП, Наименование, ПолноеНаименование)
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ИНН) И ЗначениеЗаполнено(КПП) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН
			|	И Контрагенты.КПП = &КПП
			|	И НЕ Контрагенты.ПометкаУдаления";
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Запрос.УстановитьПараметр("КПП", КПП);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Контрагент = Выборка.Ссылка;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ИНН) И Не ЗначениеЗаполнено(КПП) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН
			|	И НЕ Контрагенты.ПометкаУдаления";
		Запрос.УстановитьПараметр("ИНН", ИНН);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Контрагент = Выборка.Ссылка;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ПолноеНаименование) И Не ЗначениеЗаполнено(ИНН) И Не ЗначениеЗаполнено(КПП) Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.НаименованиеСокращенное = &НаименованиеПолное
			|	И НЕ Контрагенты.ПометкаУдаления";
		Запрос.УстановитьПараметр("НаименованиеПолное", ПолноеНаименование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Контрагент = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		//Создание нового контрагента
		РеквизитыКонтрагента = Новый Структура;
		РеквизитыКонтрагента.Вставить("ИНН", ИНН);
		РеквизитыКонтрагента.Вставить("КПП", КПП);
		РеквизитыКонтрагента.Вставить("НаименованиеСокращенное", Наименование);
		РеквизитыКонтрагента.Вставить("Наименование", ПолноеНаименование);
		
		Если СтрДлина(ИНН) = 12 Тогда
			НаименованиеБезИП = ПолноеНаименование;
			Если Лев(ПолноеНаименование, 2) = "ИП" Тогда
				НаименованиеБезИП = Сред(ПолноеНаименование, 3);
			Иначе
				ПризнакИП = "Индивидуальный предприниматель";
				ПозИП = СтрНайти(ПолноеНаименование, ПризнакИП);
				Если ПозИП > 0 Тогда
					НаименованиеБезИП = Сред(ПолноеНаименование, СтрДлина(ПризнакИП)+1);
				КонецЕсли;
			КонецЕсли;
			ФИОПоОтдельности = ЭлектронныеДокументыБГУ.ФИОПоОтдельности(НаименованиеБезИП);
			РеквизитыКонтрагента.Вставить("Фамилия", ФИОПоОтдельности.Фамилия);
			РеквизитыКонтрагента.Вставить("Имя", ФИОПоОтдельности.Имя);
			РеквизитыКонтрагента.Вставить("Отчество", ФИОПоОтдельности.Отчество);
		КонецЕсли;	
		
		ЭлектронныеДокументыБГУ.СоздатьКонтрагентаПоРеквизитам(РеквизитыКонтрагента, Контрагент);
	КонецЕсли;
	
	Возврат Контрагент;
КонецФункции	

Функция СчетКонтрагента(Контрагент, ПараметрыСчета)
	
	Если ЗначениеЗаполнено(ПараметрыСчета.НомерЛицевогоСчета) Тогда
		НомерСчета = ПараметрыСчета.НомерЛицевогоСчета;
	Иначе
		НомерСчета = ПараметрыСчета.НомерБанковскогоСчета;
	КонецЕсли;
	
	Результат = ЭлектронныеДокументыБГУ.СчетКонтрагента(Контрагент, НомерСчета);
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		//Создание нового счета
		УстановитьПривилегированныйРежим(Истина);

		СчетКонтрагента					 = Справочники.БанковскиеИКазначейскиеСчета.СоздатьЭлемент();
		СчетКонтрагента.Владелец		 = Контрагент;
		
		Если ПараметрыСчета.ТипЛицевогоСчета = Перечисления.ТипыЛицевогоСчетаЕИС.РасчетныйСчетВБанке Тогда
			ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Банковский;
			СчетКонтрагента.Код			 = ПараметрыСчета.НомерБанковскогоСчета;
		Иначе
			ТипЛицевогоСчета = Перечисления.ТипыЛицевыхСчетов.Казначейский;
			СчетКонтрагента.Код			 = ПараметрыСчета.НомерЛицевогоСчета;
		КонецЕсли;	
		
		СчетКонтрагента.ТипЛицевогоСчета = ТипЛицевогоСчета;
		СчетКонтрагента.Наименование	 = Строка(ПараметрыСчета.ТипЛицевогоСчета);
		Банк = Справочники.Банки.НайтиПоКоду(ПараметрыСчета.БИК);
		Если НЕ ЗначениеЗаполнено(Банк) Тогда
			ТЗБанки = Справочники.Банки.ПолучитьТаблицуБанковПоРеквизитам("Код", ПараметрыСчета.БИК);
			Если ТЗБанки.Количество()>0 Тогда
				Банк = ТЗБанки[0].Ссылка;
			КонецЕсли;	
		КонецЕсли;	
		Если НЕ ЗначениеЗаполнено(Банк) Тогда
			ТекстСообщения = НСтр("ru='Банк расчетного счета %1 контрагента %2 не найден в справочнике банков и его следует указать вручную.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПараметрыСчета.НомерЛицевогоСчета, КОнтрагент);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;	
		
		СчетКонтрагента.КассовыйОрган	 = Банк;
		
		Попытка
			СчетКонтрагента.Записать();
		
			Результат = СчетКонтрагента.Ссылка;
		Исключение
			Текст = НСтр("ru = 'Ошибка создания расчетного счета контрагента при загрузке сведений государственного контракта'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Создание расчетного счета контрагента %1'"), Текст);
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка, Контрагент.Метаданные(), Контрагент,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение(Текст);
		КонецПопытки;
			
	КонецЕсли;	
	
	
	Возврат Результат;
КонецФункции	

Функция ГосКонтрактПоНомеруРеестровойЗаписи(НомерРеестровойЗаписи)
	Результат = Справочники.ГосударственныеКонтрактыЕИС.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ГосударственныеКонтрактыЕИС.Ссылка КАК Ссылка,
	|	ГосударственныеКонтрактыЕИС.ВладелецКонтракта КАК ВладелецКонтракта,
	|	ГосударственныеКонтрактыЕИС.Код КАК Код
	|ИЗ
	|	Справочник.ГосударственныеКонтрактыЕИС КАК ГосударственныеКонтрактыЕИС
	|ГДЕ
	|	ГосударственныеКонтрактыЕИС.Код = &Код");
	Запрос.УстановитьПараметр("Код", НомерРеестровойЗаписи);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	

Функция ЕстьСвойство(Данные, Имя) Экспорт

	Если ТипЗнч(Данные) = Тип("ОбъектXDTO") Тогда
		Возврат Данные.Свойства().Получить(Имя) <> Неопределено;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ДеревоXMLИзФайла(ПутьКФайлу, ВебЗагрузка = Ложь)
	
	Если ВебЗагрузка Тогда
		
		ДвоичныеДанные     = ПолучитьИзВременногоХранилища(ПутьКФайлу);
		ЗагружаемыйОбъект  = ДвоичныеДанные.ОткрытьПотокДляЧтения();
		
		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьПоток(ЗагружаемыйОбъект);
			Фабрика = Новый ФабрикаXDTO;
			ДеревоXML = Фабрика.ПрочитатьXML(ЧтениеXML);
			ЧтениеXML.Закрыть();
			Возврат ДеревоXML;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	Иначе	
		Попытка
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.ОткрытьФайл(ПутьКФайлу);
			Фабрика = Новый ФабрикаXDTO;
			ДеревоXML = Фабрика.ПрочитатьXML(ЧтениеXML);
			ЧтениеXML.Закрыть();
			Возврат ДеревоXML;
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
КонецФункции

Процедура ЗаписатьФайлыКонтрактов(ИмяФайла, КоличествоКонтрактов, КоличествоЗакрытыхКонтрактов, ВебЗагрузка)
	Если ВебЗагрузка Тогда
		Данные = ПолучитьИзВременногоХранилища(ИмяФайла);
		ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("txt");
		Данные.Записать(ИмяПромежуточногоФайла);
		ЧтениеТекста = Новый ЧтениеТекста(ИмяПромежуточногоФайла, КодировкаТекста.UTF8, Символы.ПС, Символы.ПС);
	Иначе	
		ЧтениеТекста = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8, Символы.ПС, Символы.ПС);
	КонецЕсли;
	
	ПерваяЧастьФайла = "";
	Поз01 = 0;
	Поз02 = 0;
	ПоследняяЧасть = "</ns3:export>";
	
	ПризнакКонтракта = "<ns3:contract schemeVersion";
	ПризнакОкончанияКонтракта = "</ns3:contract>";
	
	ПризнакЗакрытогоКонтракта = "<ns3:closedContract schemeVersion";
	ПризнакОкончанияЗакрытогоКонтракта = "</ns3:closedContract>";
	
	ПризнакНРЗ = "<regNum>";
	ПризнакОкончанияНРЗ = "</regNum>";
	
	ПозНачалаКонтракта = 0;
	
	СтрокаТекста = ЧтениеТекста.Прочитать();
	
	Если Не ЗначениеЗаполнено(ПерваяЧастьФайла) Тогда
		Поз01 = СтрНайти(СтрокаТекста, "<ns3:export");
		Если Поз01>0 Тогда
			Поз02 = СтрНайти(СтрокаТекста, ">",,Поз01+1);
		КонецЕсли;
		Если Поз02>0 Тогда
			ПерваяЧастьФайла = Сред(СтрокаТекста,1,Поз02);
		КонецЕсли;
	КонецЕсли;
	
	Для н = 1 По КоличествоКонтрактов Цикл
		ПозНачалаКонтракта = СтрНайти(СтрокаТекста, ПризнакКонтракта,,, н);
		Если ПозНачалаКонтракта > 0 Тогда
			ПозОкончанияКонтракта = СтрНайти(СтрокаТекста, ПризнакОкончанияКонтракта,, ПозНачалаКонтракта,);
			ЧастьФайлаКонтракт = Сред(СтрокаТекста, ПозНачалаКонтракта, ПозОкончанияКонтракта + СтрДлина(ПризнакОкончанияКонтракта) - ПозНачалаКонтракта);
			
			ПозНачалаНРЗ = СтрНайти(ЧастьФайлаКонтракт, ПризнакНРЗ, НаправлениеПоиска.СКонца,,);
			ПозОкончанияНРЗ = СтрНайти(ЧастьФайлаКонтракт, ПризнакОкончанияНРЗ, НаправлениеПоиска.СКонца,,);
			
			НомерРеестровойЗаписи = Сред(ЧастьФайлаКонтракт, ПозНачалаНРЗ+СтрДлина(ПризнакНРЗ), ПозОкончанияНРЗ - ПозНачалаНРЗ - СтрДлина(ПризнакОкончанияНРЗ)+1);
			
			ТекстФайлаГосКонтракта = ПерваяЧастьФайла + Символы.ПС + ЧастьФайлаКонтракт + Символы.ПС + ПоследняяЧасть;
			
			//Запись в файл
			ГосударственныйКонтракт = Справочники.ГосударственныеКонтрактыЕИС.НайтиПоКоду(НомерРеестровойЗаписи);
			Если ЗначениеЗаполнено(ГосударственныйКонтракт) ТОгда
				СозданиеФайлаКонтракта(ГосударственныйКонтракт, ТекстФайлаГосКонтракта);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	

	Для н = 1 По КоличествоЗакрытыхКонтрактов Цикл
		ПозНачалаКонтракта = СтрНайти(СтрокаТекста, ПризнакЗакрытогоКонтракта,,, н);
		Если ПозНачалаКонтракта > 0 Тогда
			ПозОкончанияКонтракта = СтрНайти(СтрокаТекста, ПризнакОкончанияЗакрытогоКонтракта,, ПозНачалаКонтракта,);
			ЧастьФайлаКонтракт = Сред(СтрокаТекста, ПозНачалаКонтракта, ПозОкончанияКонтракта + СтрДлина(ПризнакОкончанияЗакрытогоКонтракта) - ПозНачалаКонтракта);
			
			ПозНачалаНРЗ = СтрНайти(ЧастьФайлаКонтракт, ПризнакНРЗ, НаправлениеПоиска.СКонца,,);
			ПозОкончанияНРЗ = СтрНайти(ЧастьФайлаКонтракт, ПризнакОкончанияНРЗ, НаправлениеПоиска.СКонца,,);
			
			НомерРеестровойЗаписи = Сред(ЧастьФайлаКонтракт, ПозНачалаНРЗ+СтрДлина(ПризнакНРЗ), ПозОкончанияНРЗ - ПозНачалаНРЗ - СтрДлина(ПризнакОкончанияНРЗ)+1);
			
			ТекстФайлаГосКонтракта = ПерваяЧастьФайла + Символы.ПС + ЧастьФайлаКонтракт + Символы.ПС + ПоследняяЧасть;
			
			//Запись в файл
			ГосударственныйКонтракт = Справочники.ГосударственныеКонтрактыЕИС.НайтиПоКоду(НомерРеестровойЗаписи);
			Если ЗначениеЗаполнено(ГосударственныйКонтракт) ТОгда
				СозданиеФайлаКонтракта(ГосударственныйКонтракт, ТекстФайлаГосКонтракта);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;	
	
	
	ЧтениеТекста.Закрыть();
	
КонецПроцедуры

Процедура СозданиеФайлаКонтракта(ГосударственныйКонтракт, СтрокаТекста)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТекста) Тогда
		Возврат;
	КонецЕсли;

	ДвоичныеДанныеКонтракта = ПолучитьДвоичныеДанныеИзСтроки(СтрокаТекста, КодировкаТекста.UTF8);
	
	ЭлектронноеАктированиеЕИС.СохранитьДанныеКонтракта(
		ГосударственныйКонтракт, ДвоичныеДанныеКонтракта);

КонецПроцедуры	

// Преобразует значение в Массив в случае необходимости.
// Для типов Массив, ТаблицаЗначений, СписокXDTO возвращается исходный объект.
// 
// Параметры:
//  Значение - Произвольный
// 
// Возвращаемое значение:
//  Массив - Массив, ТаблицаЗначений, СписокXDTO
Функция ЗначениеВКоллекцию(Значение) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Массив")
		И ТипЗнч(Значение) <> Тип("ТаблицаЗначений")
		И ТипЗнч(Значение) <> Тип("СписокXDTO") Тогда
		Коллекция = Новый Массив;
		Коллекция.Добавить(Значение);
		Возврат Коллекция;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ПроверитьЗагрузитьДанные(ТаблицаРезультат, ИнформацияОбОшибке) Экспорт
	
	Результат 	= Истина;
	Отказ 		= Ложь;
	
	ЗагрузитьГосКонтракты(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьГосКонтракты(ТаблицаРезультат, ИнформацияОбОшибке, Результат, Отказ)	

	ЗагруженныеОбъекты.Очистить();
	Для Каждого ТекСтрока Из ТаблицаРезультат Цикл
		НоваяСтрока = ЗагруженныеОбъекты.Добавить();
		НоваяСтрока.ЗагруженныйОбъект = ТекСтрока.ГосКонтракт;
	КонецЦикла;	

КонецПроцедуры	

Функция ПолучитьУчетнуюПолитику(Организация, Дата)
	Возврат ПлатежноРасчетныеДокументыПовтИсп.ПолучитьУчетнуюПолитикуОрганизации(Организация,Дата);
КонецФункции	

#КонецОбласти

#КонецЕсли
