////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>.
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Основными настройками выгрузки.

Функция ПолучитьСтруктуруОсновныхНастроекВыгрузки() Экспорт
	Результат = Новый Структура;
	
	Результат.Вставить("ФорматВыгрузки");
	Результат.Вставить("СпособВыгрузки");
	
	Возврат Результат;
	
КонецФункции	

Процедура СохранитьОсновныеНастройкиВыгрузки(ИмяПользователя,Настройки) Экспорт 
	
	ШаблонОписанияФормата = НСтр("ru = 'Основные настройки выгрузки отчетности пользователя:""%1"".'");
	
	ОписаниеНастроек = Новый ОписаниеНастроек;
	ОписаниеНастроек.КлючОбъекта = "ОсновныеНастройкиВыгрузкиОтчетности";
	ОписаниеНастроек.КлючНастроек = "";
	ОписаниеНастроек.Пользователь = ИмяПользователя;
	ОписаниеНастроек.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияФормата,ИмяПользователя);
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(
	ОписаниеНастроек.КлючОбъекта,
	ОписаниеНастроек.КлючНастроек,
	Настройки,
	ОписаниеНастроек,
	ОписаниеНастроек.Пользователь);

	
КонецПроцедуры	

Функция ЗагрузитьОсновныеНастройкиВыгрузки(ИмяПользователя) Экспорт
	
	Результат = ПолучитьСтруктуруОсновныхНастроекВыгрузки();
	
	ПолученныеНастройки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("ОсновныеНастройкиВыгрузкиОтчетности",
	"",
	Результат,
	,
	ИмяПользователя);
	
	ЗаполнитьЗначенияСвойств(Результат,ПолученныеНастройки);
	
	Возврат Результат;

	
КонецФункции	

// Основными настройками выгрузки.
////////////////////////////////////////////////////////////////////////////////
// Настройки способа выгрузки

Функция ПолучитьСтруктуруНастроекСпособаВыгрузки(Транспорт) Экспорт 
	
	СтруктуруНастроек = Новый Структура;
	
	ИмяТранспорта = ПолучитьПолноеИмяПредопределенногоЗначения(Транспорт);
	
	Если ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.Каталог" Тогда 
		СтруктуруНастроек.Вставить("ПутьВыгрузки","");
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.FTP" Тогда 
		СтруктуруНастроек.Вставить("НастройкаЭкспорта",Справочники.НастройкиЭкспортаФайловОтчетности.ПустаяСсылка());
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта" Тогда
		СтруктуруНастроек.Вставить("НастройкаЭкспорта",Справочники.НастройкиЭкспортаФайловОтчетности.ПустаяСсылка());
		
	ИначеЕсли ИмяТранспорта = "Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС" Тогда
		
		
	КонецЕсли;	
		
	Возврат СтруктуруНастроек;	
КонецФункции	

Процедура СохранитьНастройкиСпособаВыгрузки(ИмяПользователя,ФорматВыгрузки,Транспорт,НастройкиФормата) Экспорт 
	
	ШаблонОписанияФормата = НСтр("ru = 'Настройка способа доставки отчетов для формата:""%1"" и транспорта:""%2"".'");
	
	ОписаниеНастроек = Новый ОписаниеНастроек;
	ОписаниеНастроек.КлючОбъекта = "НастройкиСпособовОтправкиОтчетности";
	ОписаниеНастроек.КлючНастроек = СформироватьКлючНастроекСпособаВыгрузки(ФорматВыгрузки,Транспорт);
	ОписаниеНастроек.Пользователь = ИмяПользователя;
	ОписаниеНастроек.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписанияФормата,Строка(ФорматВыгрузки),Строка(Транспорт));
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(
	ОписаниеНастроек.КлючОбъекта,
	ОписаниеНастроек.КлючНастроек,
	НастройкиФормата,
	ОписаниеНастроек,
	ОписаниеНастроек.Пользователь);
	
	
КонецПроцедуры	

Функция ЗагрузитьНастройкиСпособаВыгрузки(ИмяПользователя,ФорматВыгрузки,Транспорт) Экспорт 
	Результат = ПолучитьСтруктуруНастроекСпособаВыгрузки(Транспорт);
	
	ПолученныеНастройки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить("НастройкиСпособовОтправкиОтчетности",
	СформироватьКлючНастроекСпособаВыгрузки(ФорматВыгрузки,Транспорт),
	Результат,
	,
	ИмяПользователя);
	
	ЗаполнитьЗначенияСвойств(Результат,ПолученныеНастройки);
	
	Возврат Результат;
КонецФункции

Функция СформироватьКлючНастроекСпособаВыгрузки(ФорматВыгрузки,Транспорт)
	
	Возврат Строка(ФорматВыгрузки.УникальныйИдентификатор())+"/"+ПолучитьПолноеИмяПредопределенногоЗначения(Транспорт);	
	
КонецФункции

// Настройки способа выгрузки
////////////////////////////////////////////////////////////////////////////////
// Дополнительные настройки формата.

Функция СформироватьТаблицуДополнительныхНастроек() Экспорт 
	
	ОписаниеХранилища = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)); 
	
	Результат = Новый ТаблицаЗначений;                         

	Результат.Колонки.Добавить("Имя"				,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));
	Результат.Колонки.Добавить("ГруппаПолей"		,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));
	Результат.Колонки.Добавить("Заголовок"			,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(255)));	
	Результат.Колонки.Добавить("Описание"			,Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	Результат.Колонки.Добавить("ВыбиратьИзСписка"	,Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ПредставлениеЗначения",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	Результат.Колонки.Добавить("ЗапоминатьЗначение",Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ПроверкаЗаполнения",Новый ОписаниеТипов("Булево"));
	
	Результат.Колонки.Добавить("ТипЗначенияХранилище",	ОписаниеХранилища);
	Результат.Колонки.Добавить("СписокВыбораХранилище",	ОписаниеХранилища);
	Результат.Колонки.Добавить("ЗначениеПоУмолчаниюХранилище",ОписаниеХранилища);
	Результат.Колонки.Добавить("СохраненноеЗначениеХранилище",ОписаниеХранилища);
	Результат.Колонки.Добавить("ЗначениеХранилище",		ОписаниеХранилища);
	
	Результат.Колонки.Добавить("ТипЗначения"		,Новый ОписаниеТипов("ОписаниеТипов"));
	Результат.Колонки.Добавить("СписокВыбора"		,Новый ОписаниеТипов("СписокЗначений"));
	Результат.Колонки.Добавить("ЗначениеПоУмолчанию");
	Результат.Колонки.Добавить("СохраненноеЗначение");
	Результат.Колонки.Добавить("Значение");
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьТаблицуДополнительныхНастроек(ФорматВыгрузки, ТаблицаДопНастроек) Экспорт 
	
	Если Не ЗначениеЗаполнено(ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФорматВыгрузки",ФорматВыгрузки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.Имя КАК Имя,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.ГруппаПолей КАК ГруппаПолей,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.Заголовок КАК Заголовок,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.Описание КАК Описание,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.ТипЗначенияХранилище КАК ТипЗначенияХранилище,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.ВыбиратьИзСписка КАК ВыбиратьИзСписка,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.СписокВыбораХранилище КАК СписокВыбораХранилище,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.ЗначениеПоУмолчаниюХранилище КАК ЗначениеПоУмолчаниюХранилище,
	|	ЕСТЬNULL(ЗначенияДополнительныхНастроекФорматовОбмена.ЗначениеХранилище, """") КАК СохраненноеЗначениеХранилище,
	|	"""" КАК ЗначениеХранилище,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.ЗапоминатьЗначение КАК ЗапоминатьЗначение,
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.ПроверкаЗаполнения КАК ПроверкаЗаполнения
	|ИЗ
	|	Справочник.ФорматыВыгрузкиБухгалтерскойОтчетности.ДополнительныеНастройкиФормата КАК ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхНастроекФорматовОбмена КАК ЗначенияДополнительныхНастроекФорматовОбмена
	|		ПО ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.Ссылка = ЗначенияДополнительныхНастроекФорматовОбмена.ФорматВыгрузки
	|			И ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.Имя = ЗначенияДополнительныхНастроекФорматовОбмена.Имя
	|ГДЕ
	|	ФорматыВыгрузкиБухгалтерскойОтчетностиДополнительныеНастройкиФормата.Ссылка = &ФорматВыгрузки";
	
	ДанныеДляСозданияТаблицы = Запрос.Выполнить().Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеДляСозданияТаблицы, ТаблицаДопНастроек);
	
	ПрочитатьЗначенияИзХранилища(ТаблицаДопНастроек);
	
	Для Каждого СтрокаДопНастроек Из ТаблицаДопНастроек Цикл
		
		Если ЗначениеЗаполнено(СтрокаДопНастроек.СохраненноеЗначение) 
			И СтрокаДопНастроек.ТипЗначения.СодержитТип(ТипЗнч(СтрокаДопНастроек.СохраненноеЗначение)) 
			И ?(СтрокаДопНастроек.ВыбиратьИзСписка,СтрокаДопНастроек.СписокВыбора.НайтиПоЗначению(СтрокаДопНастроек.СохраненноеЗначение) <> Неопределено,Истина) Тогда 
			
			СтрокаДопНастроек.Значение = СтрокаДопНастроек.СохраненноеЗначение;
			
		ИначеЕсли ЗначениеЗаполнено(СтрокаДопНастроек.ЗначениеПоУмолчанию) 
			И СтрокаДопНастроек.ТипЗначения.СодержитТип(ТипЗнч(СтрокаДопНастроек.ЗначениеПоУмолчанию)) Тогда  
			
			СтрокаДопНастроек.Значение = СтрокаДопНастроек.ЗначениеПоУмолчанию;
			
		Иначе 
			СтрокаДопНастроек.Значение = СтрокаДопНастроек.ТипЗначения.ПривестиЗначение();
			
		КонецЕсли;
		
		СтрокаДопНастроек.ЗначениеХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(СтрокаДопНастроек.Значение);
		СтрокаДопНастроек.ПредставлениеЗначения = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ПолучитьПредставлениеЗначения(СтрокаДопНастроек);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьЗначенияТаблицыДополнительныхНастроекВРегистр(ФорматВыгрузки, ТаблицаНастроек) Экспорт 
	
	Если Не ЗначениеЗаполнено(ФорматВыгрузки) Тогда 
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхНастроекФорматовОбмена.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФорматВыгрузки.Установить(ФорматВыгрузки);
	
	ТаблицаДляЗаписи = НаборЗаписей.ВыгрузитьКолонки();
	Для Каждого СтрокаТаблицыНастроек Из ТаблицаНастроек Цикл
		
		Если СтрокаТаблицыНастроек.ЗапоминатьЗначение = Ложь Тогда 
			Продолжить;
		КонецЕсли;	
		
		РедактируемаяСтрока = ТаблицаДляЗаписи.Добавить();
		РедактируемаяСтрока.ФорматВыгрузки = ФорматВыгрузки;
		РедактируемаяСтрока.Имя = СтрокаТаблицыНастроек.Имя;
		РедактируемаяСтрока.ЗначениеХранилище = СтрокаТаблицыНастроек.ЗначениеХранилище;
		РедактируемаяСтрока.ПредставлениеЗначения = СтрокаТаблицыНастроек.ПредставлениеЗначения;
		
	КонецЦикла;
	
	
	НаборЗаписей.Загрузить(ТаблицаДляЗаписи);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДопНастроек(ТаблицаНастроек, Отказ) Экспорт 
	
	Счетчик = 0;
	Для Каждого СтрокаТаблицыНастроек Из ТаблицаНастроек Цикл
		Счетчик = Счетчик + 1; 
		Если СтрокаТаблицыНастроек.ПроверкаЗаполнения = Ложь Тогда 
			Продолжить;
		КонецЕсли;	
		
		Значение = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(СтрокаТаблицыНастроек.ЗначениеХранилище);
		Если ЗначениеЗаполнено(Значение) Тогда 
			Продолжить;
		КонецЕсли;
		
		Отказ = Истина;
		
		Шаблон = НСтр(
		"ru = 'Не заполнена дополнительная настройка ""%1"".'");
		Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СтрокаТаблицыНастроек.Заголовок);
		ОбщегоНазначения.СообщитьПользователю(Сообщение,,
		ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ДополнительныеНастройкиФормата",Счетчик,"Значение"));
		
	КонецЦикла;
	
КонецПроцедуры	



Процедура ПрочитатьЗначенияИзХранилища(ТаблицаДопНастроек) Экспорт 
	
	Для Каждого СтрокаДопНастроек из ТаблицаДопНастроек Цикл 
		
		ИсходныеДанныеСтроки = Новый Структура("ТипЗначенияХранилище,СписокВыбораХранилище,ЗначениеПоУмолчаниюХранилище,СохраненноеЗначениеХранилище,ЗначениеХранилище");
		ИтоговыеДанныеСтроки = Новый Структура("ТипЗначения,СписокВыбора,ЗначениеПоУмолчанию,СохраненноеЗначение,Значение");
		
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтроки, СтрокаДопНастроек);
		
		ИтоговыеДанныеСтроки.ТипЗначения = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.ТипЗначенияХранилище);
		ИтоговыеДанныеСтроки.СписокВыбора = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.СписокВыбораХранилище);
		ИтоговыеДанныеСтроки.ЗначениеПоУмолчанию = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.ЗначениеПоУмолчаниюХранилище);
		ИтоговыеДанныеСтроки.СохраненноеЗначение = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.СохраненноеЗначениеХранилище);
		ИтоговыеДанныеСтроки.Значение = БюджетнаяОтчетностьКлиентСервер.ПрочитатьЗначениеИзXML(ИсходныеДанныеСтроки.ЗначениеХранилище);	
		
		ЗаполнитьЗначенияСвойств(СтрокаДопНастроек, ИтоговыеДанныеСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПоместитьЗначенияВХранилища(ТаблицаДопНастроек) Экспорт
			
	Для Каждого СтрокаДопНастроек из ТаблицаДопНастроек Цикл 
		
		ИсходныеДанныеСтроки = Новый Структура("ТипЗначения,СписокВыбора,ЗначениеПоУмолчанию,СохраненноеЗначение,Значение");
		ИтоговыеДанныеСтроки =  Новый Структура("ТипЗначенияХранилище,СписокВыбораХранилище,ЗначениеПоУмолчаниюХранилище,СохраненноеЗначениеХранилище,ЗначениеХранилище");
		
		ЗаполнитьЗначенияСвойств(ИсходныеДанныеСтроки, СтрокаДопНастроек);
		
		ИтоговыеДанныеСтроки.ТипЗначенияХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.ТипЗначения); 
		ИтоговыеДанныеСтроки.СписокВыбораХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.СписокВыбора); 
		ИтоговыеДанныеСтроки.ЗначениеПоУмолчаниюХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.ЗначениеПоУмолчанию); 
		ИтоговыеДанныеСтроки.СохраненноеЗначениеХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.СохраненноеЗначение);
		ИтоговыеДанныеСтроки.ЗначениеХранилище = БюджетнаяОтчетностьКлиентСервер.ЗаписатьЗначениеВXML(ИсходныеДанныеСтроки.Значение);
		
		ЗаполнитьЗначенияСвойств(СтрокаДопНастроек, ИтоговыеДанныеСтроки);
		
	КонецЦикла;
	
КонецПроцедуры

// Дополнительные настройки формата.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Формирование пакетов
// Служебные

Функция СоздатьИЗаполнитьОбъектОбработки(СтруктураДанных)
	
	НовыйЭкземплярОбработки = Новый (Тип(СтруктураДанных.ИмяТипаОбработки));
	ЗаполнитьЗначенияСвойств(НовыйЭкземплярОбработки,СтруктураДанных.Обработка,"ПутьВыгрузки,СпособВыгрузки");
	
	ИменаТаблиц = СтрРазделить("ОтчетыДляВыгрузки,Зависимости,ЭлектронныеЦифровыеПодписи,ДополнительныеНастройкиФормата,ПрисоединенныеФайлыДляВыгрузки",",");
	Для Каждого ТекТаблица Из ИменаТаблиц Цикл
		НовыйЭкземплярОбработки[ТекТаблица].Загрузить(СтруктураДанных.Обработка[ТекТаблица].Выгрузить());	
	КонецЦикла;	
	
	Возврат НовыйЭкземплярОбработки;
	
КонецФункции

Процедура ПеренестиДанныеВДанныеФормы(СтруктураДанных,ОбъектОбработки)
	
	ЗаполнитьЗначенияСвойств(СтруктураДанных.Обработка,ОбъектОбработки,"ПутьВыгрузки,СпособВыгрузки");
	
	ИменаТаблиц = СтрРазделить("ОтчетыДляВыгрузки,Зависимости,ЭлектронныеЦифровыеПодписи,ДополнительныеНастройкиФормата,ПрисоединенныеФайлыДляВыгрузки",",");
	Для Каждого ТекТаблица Из ИменаТаблиц Цикл
		СтруктураДанных.Обработка[ТекТаблица].Загрузить(ОбъектОбработки[ТекТаблица].Выгрузить());	
	КонецЦикла;	
		
КонецПроцедуры


Процедура ЗаполнитьЗависимости(СтруктураДанных) Экспорт 
	Если СтруктураДанных.Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("ИмяТипаОбработки")
		И СтруктураДанных.ИмяТипаОбработки <>"ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций" Тогда
		//считаем, что это внешнаяя обработка
		
		ОбъектОбработки = СоздатьИЗаполнитьОбъектОбработки(СтруктураДанных);
		ОбъектОбработки.ЗаполнитьТаблицуЗависимостей(СтруктураДанных);
		ПеренестиДанныеВДанныеФормы(СтруктураДанных,ОбъектОбработки);
		
	Иначе
		
		ОбъектОбработки = ДанныеФормыВЗначение(СтруктураДанных.Обработка ,Тип("ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций"));
		ОбъектОбработки.ЗаполнитьТаблицуЗависимостей(СтруктураДанных);
		ЗначениеВДанныеФормы(ОбъектОбработки, СтруктураДанных.Обработка);
		
	КонецЕсли;
	
КонецПроцедуры	


Процедура СформироватьПакеты(СтруктураДанных) Экспорт 
	
	Если СтруктураДанных.Свойство("ИмяТипаОбработки")
		И СтруктураДанных.ИмяТипаОбработки <>"ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций" Тогда
		//считаем, что это внешнаяя обработка
		
		ОбъектОбработки = СоздатьИЗаполнитьОбъектОбработки(СтруктураДанных);
		ОбъектОбработки.СформироватьПакеты(СтруктураДанных);
		ПеренестиДанныеВДанныеФормы(СтруктураДанных,ОбъектОбработки);
		
	Иначе
		
		ОбъектОбработки = ДанныеФормыВЗначение(СтруктураДанных.Обработка ,Тип("ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций"));
		ОбъектОбработки.СформироватьПакеты(СтруктураДанных);
		ЗначениеВДанныеФормы(ОбъектОбработки, СтруктураДанных.Обработка);
		
	КонецЕсли;
		
КонецПроцедуры


Процедура ЗаполнитьОписаниеФайловДляФормированияПодписей(СтруктураДанных,СтруктураДанныхПодписей) Экспорт
	
	Если СтруктураДанных.Свойство("ИмяТипаОбработки")
		И СтруктураДанных.ИмяТипаОбработки <>"ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций" Тогда
		//считаем, что это внешнаяя обработка
		
		ОбъектОбработки = СоздатьИЗаполнитьОбъектОбработки(СтруктураДанных);
		ОбъектОбработки.ЗаполнитьОписаниеФайловДляФормированияПодписей(СтруктураДанных,СтруктураДанныхПодписей);
		ПеренестиДанныеВДанныеФормы(СтруктураДанных,ОбъектОбработки);
		
	Иначе
		
		ОбъектОбработки = ДанныеФормыВЗначение(СтруктураДанных.Обработка ,Тип("ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций"));
		ОбъектОбработки.ЗаполнитьОписаниеФайловДляФормированияПодписей(СтруктураДанных,СтруктураДанныхПодписей);
		ЗначениеВДанныеФормы(ОбъектОбработки, СтруктураДанных.Обработка);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьНовыеПодписиВПакет(СтруктураДанных,СтруктураДанныхПодписей) Экспорт
	
	Если СтруктураДанных.Свойство("ИмяТипаОбработки")
		И СтруктураДанных.ИмяТипаОбработки <>"ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций" Тогда
		//считаем, что это внешнаяя обработка
		
		ОбъектОбработки = СоздатьИЗаполнитьОбъектОбработки(СтруктураДанных);
		ОбъектОбработки.ДобавитьНовыеПодписиВПакет(СтруктураДанных,СтруктураДанныхПодписей);
		ПеренестиДанныеВДанныеФормы(СтруктураДанных,ОбъектОбработки);
		
	Иначе
		
		ОбъектОбработки = ДанныеФормыВЗначение(СтруктураДанных.Обработка ,Тип("ОбработкаОбъект.ВыгрузкаОтчетностиОрганизаций"));
		ОбъектОбработки.ДобавитьНовыеПодписиВПакет(СтруктураДанных,СтруктураДанныхПодписей);
		ЗначениеВДанныеФормы(ОбъектОбработки, СтруктураДанных.Обработка);
		
	КонецЕсли;
		
КонецПроцедуры


// Служебные
// Формирование пакетов
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Отправка пакетов
// Общие

Процедура ВыполнитьВыгрузкуДанныхНаСервере(ДанныеОтправки) Экспорт 
	
	ПроверитьПакеты(ДанныеОтправки);
	РаспределитьПакетыПоТипуОтправки(ДанныеОтправки);
	ВыгрузкаВКаталогСервер(ДанныеОтправки);
	ВыгрузкаНаФТПСервер(ДанныеОтправки);
	ВыгрузкаЧерезEmailСервер(ДанныеОтправки);
	ВыгрузкаВФНССервер(ДанныеОтправки);
	
	УдалитьВременныеФайлы(ДанныеОтправки);
КонецПроцедуры

Процедура ПроверитьПакеты(ДанныеОтправки)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Пакеты",ДанныеОтправки.ПакетыДляОтправки);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетности.Ссылка,
	|	""ПометкаНаУдаление"" КАК ТипОшибки,
	|	ПакетВыгрузкиОтчетности.Дата КАК Дата
	|ПОМЕСТИТЬ ПакетыКоторыеНельзяОтправить
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Ссылка В(&Пакеты)
	|	И ПакетВыгрузкиОтчетности.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетности.Ссылка КАК Пакеты
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПакетыКоторыеНельзяОтправить КАК ПакетыКоторыеНельзяОтправить
	|		ПО (ПакетыКоторыеНельзяОтправить.Ссылка = ПакетВыгрузкиОтчетности.Ссылка)
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Ссылка В(&Пакеты)
	|	И ПакетыКоторыеНельзяОтправить.Ссылка ЕСТЬ NULL ";	
	
	ДанныеОтправки.ПакетыДляОтправки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пакеты");
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПакетыКоторыеНельзяОтправить.Ссылка КАК Пакет,
	|	ПакетыКоторыеНельзяОтправить.ТипОшибки КАК ТипОшибки
	|ИЗ
	|	ПакетыКоторыеНельзяОтправить КАК ПакетыКоторыеНельзяОтправить
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПакетыКоторыеНельзяОтправить.Дата";
	
	ТаблицаОшибок = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицыОшибок Из ТаблицаОшибок Цикл 
		Сообщение = "";
		Если СтрокаТаблицыОшибок.ТипОшибки = "ПометкаНаУдаление" Тогда 
			
			Шаблон = НСтр("ru = '""%1"" помечен на удаление. Отправка невозможна.'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СтрокаТаблицыОшибок.Пакет);
			
		Иначе 
			Сообщение = "Неизвестный тип ошибки.";
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	КонецЦикла;	
	
КонецПроцедуры	

Процедура РаспределитьПакетыПоТипуОтправки(ДанныеОтправки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пакеты",ДанныеОтправки.ПакетыДляОтправки);
	
	ИспользоватьКаталог = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.Каталог");  
	Запрос.УстановитьПараметр("ИспользоватьКаталог",ИспользоватьКаталог);
	Запрос.УстановитьПараметр("Каталог",?(ИспользоватьКаталог,ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.Каталог"),Неопределено));
	
	ИспользоватьФТП = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.FTP");  
	Запрос.УстановитьПараметр("ИспользоватьFTP",ИспользоватьФТП);
	Запрос.УстановитьПараметр("FTP",?(ИспользоватьФТП,ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.FTP"),Неопределено));
	
	ИспользоватьФНС = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС");  
	Запрос.УстановитьПараметр("ИспользоватьОбменСФНС",ИспользоватьФНС);
	Запрос.УстановитьПараметр("ОбменСФНС",?(ИспользоватьФНС,ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС"),Неопределено));
	
	ИспользоватьEmail = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта");  
	Запрос.УстановитьПараметр("ИспользоватьEmail",ИспользоватьEmail);
	Запрос.УстановитьПараметр("Email",?(ИспользоватьEmail,ПредопределенноеЗначение("Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта"),Неопределено));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетности.Ссылка КАК Пакет,
	|	""ДанныеВыгрузкиВКаталог"" КАК ВеткаДанных
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Ссылка В(&Пакеты)
	|	И &ИспользоватьКаталог
	|	И ПакетВыгрузкиОтчетности.СпособВыгрузки = &Каталог
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетности.Ссылка,
	|	""ДанныеВыгрузкиНаФТП""
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Ссылка В(&Пакеты)
	|	И &ИспользоватьFTP
	|	И ПакетВыгрузкиОтчетности.СпособВыгрузки = &FTP
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетности.Ссылка,
	|	""ДанныеВыгрузкиВФНС""
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Ссылка В(&Пакеты)
	|	И &ИспользоватьОбменСФНС
	|	И ПакетВыгрузкиОтчетности.СпособВыгрузки = &ОбменСФНС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетности.Ссылка,
	|	""ДанныеВыгрузкиЧерезEmail""
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Ссылка В(&Пакеты)
	|	И &ИспользоватьEmail
	|	И ПакетВыгрузкиОтчетности.СпособВыгрузки = &Email";
	
	ТаблицаПакетов = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаПакетов Цикл 
		ТекущаяВетка = ДанныеОтправки[СтрокаТаблицы.ВеткаДанных];
		ТекущаяВетка.ИспользоватьВыгрузку = Истина;
		ТекущаяВетка.МассивПакетов.Добавить(СтрокаТаблицы.Пакет);
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ЗаполнитьДанныеПакетов(ДанныеВыгрузки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пакеты",ДанныеВыгрузки.МассивПакетов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетности.Ссылка КАК Пакет,
	|	ПакетВыгрузкиОтчетности.Организация КАК Организация,
	|	ПакетВыгрузкиОтчетности.Период КАК Период,
	|	ПакетВыгрузкиОтчетности.ПутьВыгрузки КАК Путь,
	|	ПакетВыгрузкиОтчетности.НастройкаЭкспорта.FTPСервер КАК FTPСервер,
	|	ПакетВыгрузкиОтчетности.НастройкаЭкспорта.FTPПорт КАК FTPПорт,
	|	ПакетВыгрузкиОтчетности.НастройкаЭкспорта.FTPПуть КАК FTPПуть,
	|	ПакетВыгрузкиОтчетности.НастройкаЭкспорта.FTPПользователь КАК FTPПользователь,
	|	ПакетВыгрузкиОтчетности.НастройкаЭкспорта.FTPПароль КАК FTPПароль,
	|	ПакетВыгрузкиОтчетности.НастройкаЭкспорта.УчетнаяЗаписьЭлектроннойПочты КАК УчетнаяЗаписьЭлектроннойПочты,
	|	ПакетВыгрузкиОтчетности.НастройкаЭкспорта.Получатели КАК Получатели
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности КАК ПакетВыгрузкиОтчетности
	|ГДЕ
	|	ПакетВыгрузкиОтчетности.Ссылка В(&Пакеты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПакетВыгрузкиОтчетности.Дата";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультата Из РезультатЗапроса Цикл 
		
		СтруктураДанных = Новый Структура(ДанныеВыгрузки.ОписаниеСтруктураДанныхПакетов);
		ЗаполнитьЗначенияСвойств(СтруктураДанных,СтрокаРезультата);
		
		ДанныеВыгрузки.ДанныеПакетов.Добавить(СтруктураДанных);
		
		
	КонецЦикла;
	
КонецПроцедуры	

Функция РаспаковатьДанныеПакетов(Пакеты,ДанныеОтправки)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Пакет");
	Результат.Колонки.Добавить("Группа");
	Результат.Колонки.Добавить("ПолноеИмя");
	Результат.Колонки.Добавить("ОтносительноеИмя");
	Результат.Колонки.Добавить("ОтносительныйПуть");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пакеты",Пакеты);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Ссылка КАК Пакет,
	|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Группа КАК Группа,
	|	ПакетВыгрузкиОтчетностиФайлыОтчетов.ДанныеФайлов КАК ДанныеФайлов
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности.ФайлыОтчетов КАК ПакетВыгрузкиОтчетностиФайлыОтчетов
	|ГДЕ
	|	ПакетВыгрузкиОтчетностиФайлыОтчетов.Ссылка В(&Пакеты)";
	
	ДанныеДляСохранения = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаДанных Из ДанныеДляСохранения Цикл
		
		ИмяВременногоZipФала = ПолучитьИмяВременногоФайла("ZIP");
		ИмяВременногоКаталога = Лев(ИмяВременногоZipФала,СтрДлина(ИмяВременногоZipФала)- 4) + ПолучитьРазделительПути();
		
		ДанныеОтправки.ВременныеФайлы.Добавить(ИмяВременногоZipФала);
		ДанныеОтправки.ВременныеФайлы.Добавить(ИмяВременногоКаталога);
		
		
		ДвоичныеДанныеАрхива = СтрокаДанных.ДанныеФайлов.Получить();
		ДвоичныеДанныеАрхива.Записать(ИмяВременногоZipФала);
		
		ЧтениеФайла = Новый ЧтениеZipФайла(ИмяВременногоZipФала);
		Для Каждого ЭлементВАрхиве Из ЧтениеФайла.Элементы Цикл 
			
			ЧтениеФайла.Извлечь(ЭлементВАрхиве,ИмяВременногоКаталога);
			
			ПолноеИмя = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(ИмяВременногоКаталога, ЭлементВАрхиве.ПолноеИмя);
			
			ДанныеОтправки.ВременныеФайлы.Добавить(ПолноеИмя);
			
			НоваяСтрокаРезультата = Результат.Добавить();
			НоваяСтрокаРезультата.Пакет = СтрокаДанных.Пакет;
			НоваяСтрокаРезультата.Группа = СтрокаДанных.Группа;
			НоваяСтрокаРезультата.ПолноеИмя = ПолноеИмя;
			НоваяСтрокаРезультата.ОтносительноеИмя = ЭлементВАрхиве.ПолноеИмя;
			НоваяСтрокаРезультата.ОтносительныйПуть = ЭлементВАрхиве.Путь;

			
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции	

Процедура УдалитьВременныеФайлы(ДанныеОтправки)
	
	Для Каждого ПутьВременногоФайла Из ДанныеОтправки.ВременныеФайлы Цикл 
		
		УдалитьФайлы(ПутьВременногоФайла);
		
	КонецЦикла;
	
КонецПроцедуры	

// Общие
////////////////////////////////////////////////////////////////////////////////
// Каталог

Процедура ВыгрузкаВКаталогСервер(ДанныеОтправки)
	ДанныеВыгрузки = ДанныеОтправки.ДанныеВыгрузкиВКаталог;
	Если ДанныеВыгрузки.ИспользоватьВыгрузку = Ложь Тогда 
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьДанныеПакетов(ДанныеВыгрузки);
	
	РезультатСохранения = РаспаковатьДанныеПакетов(ДанныеВыгрузки.МассивПакетов,ДанныеОтправки);
	Для Каждого ДанныеПакета Из ДанныеВыгрузки.ДанныеПакетов Цикл
		
		ФайлыТекущегоПакета = РезультатСохранения.НайтиСтроки(Новый Структура("Пакет",ДанныеПакета.Пакет));
		
		МассивПолучаемыхФайлов = Новый Массив;
		
		Для Каждого СтрокаФайла Из ФайлыТекущегоПакета Цикл 
			
			НовоеОписание = Новый ОписаниеПередаваемогоФайла;
			НовоеОписание.Имя = СтрокаФайла.ОтносительноеИмя;
			НовоеОписание.Хранение = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(СтрокаФайла.ПолноеИмя),Новый УникальныйИдентификатор);
			
			ДанныеОтправки.ВременныеДанныеВХранилище.Добавить(НовоеОписание.Хранение);
			
			МассивПолучаемыхФайлов.Добавить(НовоеОписание);
		КонецЦикла;
		
		ДанныеПакета.ПолучаемыеФайлы = МассивПолучаемыхФайлов; 
		
	КонецЦикла;
	
	
КонецПроцедуры

// Каталог
////////////////////////////////////////////////////////////////////////////////
// FTP

Процедура ВыгрузкаНаФТПСервер(ДанныеОтправки)
	ДанныеВыгрузки = ДанныеОтправки.ДанныеВыгрузкиНаФТП;
	Если ДанныеВыгрузки.ИспользоватьВыгрузку = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	ХранилищеСоединений = Новый Соответствие;
	
	ЗаполнитьДанныеПакетов(ДанныеВыгрузки); 
	
	РезультатСохранения = РаспаковатьДанныеПакетов(ДанныеВыгрузки.МассивПакетов,ДанныеОтправки);
	
	Для Каждого ДанныеПакета Из ДанныеВыгрузки.ДанныеПакетов Цикл 
		
		ФайлыТекущегоПакета = РезультатСохранения.НайтиСтроки(Новый Структура("Пакет",ДанныеПакета.Пакет));
		
		Если Не ЗначениеЗаполнено(ФайлыТекущегоПакета) Тогда 
			
			Шаблон = НСтр("ru = 'Нет файлов по пакету ""%1 (""%2"" ""%3"")"".'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ДанныеПакета.Пакет, ДанныеПакета.Организация, ДанныеПакета.Период);
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
			ДанныеОтправки.ПропущенныеПакеты.Добавить(ДанныеПакета.Пакет);
			
			Продолжить;
			
		КонецЕсли;	
		
		Попытка
			СоединениеFTP = ПолучитьСоединениеFTP(ДанныеВыгрузки, ДанныеПакета.FTPСервер, ДанныеПакета.FTPПорт, ДанныеПакета.FTPПользователь, ДанныеПакета.FTPПароль, ХранилищеСоединений);
			ПодготовитьКаталог(СоединениеFTP,ДанныеПакета.FTPПуть);
			СоединениеFTP.УстановитьТекущийКаталог(ДанныеПакета.FTPПуть);
			
			Для Каждого СтрокаФайла Из ФайлыТекущегоПакета Цикл 
				
				ПутьНаСервере = СтрЗаменить(СтрокаФайла.ОтносительныйПуть,"\","/"); 
				ПодготовитьКаталог(СоединениеFTP,ПутьНасервере,Истина);
				
				ИмяНаСервере = СтрЗаменить(СтрокаФайла.ОтносительноеИмя,"\","/");
				
				НайденныеФайлы = СоединениеFTP.НайтиФайлы(ИмяНаСервере);
				Если ЗначениеЗаполнено(НайденныеФайлы) Тогда 
					СоединениеFTP.Удалить(ИмяНаСервере);
				КонецЕсли;	
				
				СоединениеFTP.Записать(СтрокаФайла.ПолноеИмя,ИмяНаСервере);
				
			КонецЦикла;	
			
		Исключение
			Шаблон = НСтр("ru = 'Не удалось выгрузить на FTP пакет""%1"".
                           |%2'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ДанныеПакета.Пакет,ОписаниеОшибки());   
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
			ДанныеОтправки.ПропущенныеПакеты.Добавить(ДанныеПакета.Пакет);
			
			Продолжить;
		КонецПопытки;
		
		Шаблон = НСтр("ru = '%1 (""%2"" ""%3"") успешно выгружен на FTP.'");
		Пояснение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ДанныеПакета.Пакет, ДанныеПакета.Организация, ДанныеПакета.Период);   
		
		СтруктураОповещения = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеОтправки.ШаблонСтрокиОповещенияПользователя);
		СтруктураОповещения.Текст = НСтр("ru = 'Пакет успешно выгружен на FTP.'");
		СтруктураОповещения.Пояснение = Пояснение;
		СтруктураОповещения.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ДанныеПакета.Пакет);
		СтруктураОповещения.Картинка = БиблиотекаКартинок.Успешно32;
		
		ДанныеОтправки.ОповещенияПользователя.Добавить(СтруктураОповещения);
		
		ДанныеОтправки.ОтправленныеПакеты.Добавить(ДанныеПакета.Пакет);
		
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПолучитьСоединениеFTP(ДанныеВыгрузки, FTPСервер, FTPПорт, FTPПользователь, FTPПароль, ХранилищеСоединений)
	СтрокаПоиска = FTPСервер+FTPПорт+FTPПользователь+FTPПароль; 
	
	НайденнаяСтрока = ХранилищеСоединений.Получить(СтрокаПоиска);
	Если НайденнаяСтрока = Неопределено Тогда 
		
		Попытка
			
			Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("ftp");
			
			СоединениеFTP =  Новый FTPСоединение(FTPСервер,
				?(ЗначениеЗаполнено(FTPПорт),FTPПорт,Неопределено),
				?(ЗначениеЗаполнено(FTPПользователь),FTPПользователь,Неопределено),
				?(ЗначениеЗаполнено(FTPПароль),FTPПароль,Неопределено),
				Прокси);
			
		Исключение
			Шаблон = НСтр("ru = 'Не удалось соединится с FTP.
			|%2'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ОписаниеОшибки());
			ВызватьИсключение Сообщение;
		КонецПопытки;	
		
		ХранилищеСоединений.Вставить(СтрокаПоиска,СоединениеFTP);
		
	Иначе 
		
		СоединениеFTP = НайденнаяСтрока;
		
	КонецЕсли;
	
	Возврат СоединениеFTP;
	
КонецФункции	

Процедура ПодготовитьКаталог(СоединениеFTP, Путь, УдалятьМешающиеФайлы= Ложь, ТекущийПуть = "/")
	Если Путь = "/" Тогда 
		Возврат;	// корень точно есть
	КонецЕсли;	
	
	Если Путь = ТекущийПуть Тогда 
		Возврат;
	КонецЕсли;
	
	ПодстрокиПолногоПути = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Путь,"/",Истина);
	ПодстрокиТекущегоПути = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекущийПуть,"/",Истина);
		
	
	ПроверяемыйПуть = "";
	Для н = 0 По ПодстрокиТекущегоПути.Количество() Цикл  
		ПроверяемыйПуть = ПроверяемыйПуть + "/" + ПодстрокиПолногоПути[н];
	КонецЦикла;
	
	
	НайденныеФайлы = СоединениеFTP.НайтиФайлы(ПроверяемыйПуть);
	Если ЗначениеЗаполнено(НайденныеФайлы) Тогда
		
		НайденныйФайл = НайденныеФайлы[0]; 
		Если НайденныйФайл.ЭтоКаталог() Тогда 
			ПодготовитьКаталог(СоединениеFTP, Путь, УдалятьМешающиеФайлы, ПроверяемыйПуть);
			
		Иначе 
			Если УдалятьМешающиеФайлы Тогда 
				СоединениеFTP.Удалить(ПроверяемыйПуть);
				СоединениеFTP.СоздатьКаталог(Путь);
				Возврат;
				
			Иначе 	
				Шаблон =НСтр("ru = 'Нельзя создать путь ""%1"".
				|Конфликт с существующим файлом ""%2"".'"); 
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,Путь,ПроверяемыйПуть);
				
			КонецЕсли;
		КонецЕсли;

	Иначе 
		СоединениеFTP.СоздатьКаталог(Путь);
		Возврат; 
		
	КонецЕсли;
	
КонецПроцедуры	

// FTP
////////////////////////////////////////////////////////////////////////////////
// Email 

Процедура ВыгрузкаЧерезEmailСервер(ДанныеОтправки)
	
	ДанныеВыгрузки = ДанныеОтправки.ДанныеВыгрузкиЧерезEmail;
	Если ДанныеВыгрузки.ИспользоватьВыгрузку = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	ХранилищеСоединений = Новый Соответствие;
	
	ЗаполнитьДанныеПакетов(ДанныеВыгрузки);
	
	РезультатСохранения = РаспаковатьДанныеПакетов(ДанныеВыгрузки.МассивПакетов,ДанныеОтправки);
	Для Каждого ДанныеПакета Из ДанныеВыгрузки.ДанныеПакетов Цикл
		ПараметрыПисьма = Новый Структура;
		
		ПараметрыПисьма.Вставить("Кому",ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(ДанныеПакета.Получатели));
		
		ШаблонТемы = НСтр("ru = 'Отчетность: %1'");
		ШаблонСообщения = НСтр("ru = 'Отчетность  на %1
		|%2'");
		ПараметрыПисьма.Вставить("Тема", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТемы, ДанныеПакета.Организация));
		ПараметрыПисьма.Вставить("Тело", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Формат(КонецДня(ДанныеПакета.Период.ДатаОкончания)+1,"ДФ=dd.MM.yyyy"), ДанныеПакета.Организация));
		
		ФайлыТекущегоПакета = РезультатСохранения.НайтиСтроки(Новый Структура("Пакет",ДанныеПакета.Пакет));
		ПараметрыПисьма.Вставить("Вложения",Новый Соответствие);
		Для Каждого СтрокаФайла Из ФайлыТекущегоПакета Цикл 	
			ПараметрыПисьма.Вложения.Вставить(СтрокаФайла.ОтносительноеИмя, Новый ДвоичныеДанные(СтрокаФайла.ПолноеИмя)); 
		КонецЦикла;
		
		Попытка
			Соединение = ПолучитьСоединениеСПочтовымСервером(ДанныеПакета.УчетнаяЗаписьЭлектроннойПочты, ХранилищеСоединений);
			ВыгрузкаРегламентированнойБухгалтерскойОтчетностиСерверПереопределяемый.ОтправитьСообщение(ДанныеПакета.УчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма, Соединение);
			
		Исключение
			
			Шаблон = НСтр("ru = 'Не удалось отправить через Email пакет""%1"".
			|%2'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ДанныеПакета.Пакет,ОписаниеОшибки());   
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
			ДанныеОтправки.ПропущенныеПакеты.Добавить(ДанныеПакета.Пакет);
			
			Продолжить;
		КонецПопытки;
		
		Шаблон = НСтр("ru = '%1 (""%2"" ""%3"") успешно отправлен через Email.'");
		Пояснение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,ДанныеПакета.Пакет, ДанныеПакета.Организация, ДанныеПакета.Период);   
		
		СтруктураОповещения = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ДанныеОтправки.ШаблонСтрокиОповещенияПользователя);
		СтруктураОповещения.Текст = НСтр("ru = 'Пакет успешно отправлен через Email.'");
		СтруктураОповещения.Пояснение = Пояснение;
		СтруктураОповещения.НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(ДанныеПакета.Пакет);
		СтруктураОповещения.Картинка = БиблиотекаКартинок.Успешно32;
		
		ДанныеОтправки.ОповещенияПользователя.Добавить(СтруктураОповещения);
		
		ДанныеОтправки.ОтправленныеПакеты.Добавить(ДанныеПакета.Пакет);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьСоединениеСПочтовымСервером(УчетнаяЗапись,ХранилищеСоединений)
	
	НайденнаяСтрока = ХранилищеСоединений.Получить(УчетнаяЗапись);
	Если НайденнаяСтрока = Неопределено Тогда 
		
		Профиль = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиСерверПереопределяемый.СформироватьИнтернетПрофиль(УчетнаяЗапись);
		Соединение = Новый ИнтернетПочта;
		Соединение.Подключиться(Профиль);
		
		ХранилищеСоединений.Вставить(УчетнаяЗапись,Соединение);
		
		Возврат Соединение;
		
	Иначе 
		
		Возврат НайденнаяСтрока;
		
	КонецЕсли;
	
	
КонецФункции	

// Email 
////////////////////////////////////////////////////////////////////////////////
// ФНС

Процедура ВыгрузкаВФНССервер(ДанныеОтправки)
	ДанныеВыгрузки = ДанныеОтправки.ДанныеВыгрузкиВФНС;
	Если ДанныеВыгрузки.ИспользоватьВыгрузку = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаПакета Из ДанныеВыгрузки.МассивПакетов Цикл 
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Документ.ПакетВыгрузкиОтчетности");
			ЭлементБлокировки.УстановитьЗначение("Ссылка",СтрокаПакета);
			Блокировка.Заблокировать();
			
			ДанныеГрупп = ПолучитьДанныеГрупп(СтрокаПакета);
			
			// нужно создавать документы
			Если ЗначениеЗаполнено(ДанныеГрупп.НайтиСтроки(Новый Структура("СуществующийДокумент",Документы.ЭлектронныйДокументБухгалтерскийОтчет.ПустаяСсылка()))) Тогда
				РезультатСохранения = РаспаковатьДанныеПакетов(ДанныеВыгрузки.МассивПакетов,ДанныеОтправки);
			КонецЕсли;
			
			Для Каждого СтрокаДанныхГрупп Из ДанныеГрупп Цикл 
				
				Если СтрокаДанныхГрупп.СуществующийДокумент.Пустая() Тогда 
					
					ФайлТекущейГруппы = РезультатСохранения.НайтиСтроки(Новый Структура("Пакет,Группа",СтрокаДанныхГрупп.Пакет,СтрокаДанныхГрупп.Группа));
					
					Если Не ЗначениеЗаполнено(ФайлТекущейГруппы) Тогда 
						Шаблон = НСтр("ru = 'Нет файлов для группы %1.'");
						Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,СтрокаДанныхГрупп.Группа);
						ВызватьИсключение Сообщение;
					КонецЕсли;
					
					Если ФайлТекущейГруппы.Количество() > 1 Тогда 
						Шаблон = НСтр("ru = 'Для группы %1 сформировано более одного файла.'");
						Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,СтрокаДанныхГрупп.Группа);
						ВызватьИсключение Сообщение;
					КонецЕсли;
					
					
					СтруктураЗаполнения = Новый Структура;
					СтруктураЗаполнения.Вставить("СпособЗаполнения","ЗаполнениеПоПакету");
					СтруктураЗаполнения.Вставить("Пакет",СтрокаДанныхГрупп.Пакет);
					СтруктураЗаполнения.Вставить("Группа",СтрокаДанныхГрупп.Группа);
					СтруктураЗаполнения.Вставить("ПолноеИмяФайла",ФайлТекущейГруппы[0].ПолноеИмя);
					СтруктураЗаполнения.Вставить("ДвоичныеДанные",Новый ДвоичныеДанные(ФайлТекущейГруппы[0].ПолноеИмя));
					
					НовыйДокумент = Документы.ЭлектронныйДокументБухгалтерскийОтчет.СоздатьДокумент();
					НовыйДокумент.Заполнить(СтруктураЗаполнения);
					НовыйДокумент.Записать();
					ДанныеВыгрузки.МассивДокументов.Добавить(НовыйДокумент.Ссылка);
					
				Иначе 
					
					ДанныеВыгрузки.МассивДокументов.Добавить(СтрокаДанныхГрупп.СуществующийДокумент);
					
				КонецЕсли;
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			
			Шаблон = НСтр("ru = 'Не удалось сформировать документы ""Бухгалтерский отчет (электронный документ)"" для пакета ""%1"".
			|%2'");
			Сообщение = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон,СтрокаПакета,ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			
			ДанныеОтправки.ПропущенныеПакеты.Добавить(СтрокаПакета);
			
		КонецПопытки;
		
	КонецЦикла;	
		
	
КонецПроцедуры	

Функция ПолучитьДанныеГрупп(Пакет)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пакет",Пакет);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПакетВыгрузкиОтчетностиОтчетыПакета.Ссылка КАК Пакет,
	|	ПакетВыгрузкиОтчетностиОтчетыПакета.Группа КАК Группа,
	|	ЕСТЬNULL(ЭлектронныйДокументБухгалтерскийОтчет.Ссылка, ЗНАЧЕНИЕ(Документ.ЭлектронныйДокументБухгалтерскийОтчет.ПустаяСсылка)) КАК СуществующийДокумент
	|ИЗ
	|	Документ.ПакетВыгрузкиОтчетности.ОтчетыПакета КАК ПакетВыгрузкиОтчетностиОтчетыПакета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭлектронныйДокументБухгалтерскийОтчет КАК ЭлектронныйДокументБухгалтерскийОтчет
	|		ПО ПакетВыгрузкиОтчетностиОтчетыПакета.Ссылка = ЭлектронныйДокументБухгалтерскийОтчет.Пакет
	|			И ПакетВыгрузкиОтчетностиОтчетыПакета.Группа = ЭлектронныйДокументБухгалтерскийОтчет.Группа
	|ГДЕ
	|	ПакетВыгрузкиОтчетностиОтчетыПакета.Ссылка = &Пакет";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

// ФНС
// Отправка пакетов
////////////////////////////////////////////////////////////////////////////////
// Прочее

Функция ПоказыватьСтраницуЭЦП(СпособВыгрузки) Экспорт
	
	ИспользоватьЭЦПВообще = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиСерверПереопределяемый.ПолучитьФункциональнуюОпциюИспользоватьЦифровыеПодписи();
	
	Если ИспользоватьЭЦПВообще = Ложь Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	ЕстьПрава = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиСерверПереопределяемый.РольДоступнаИспользованиеЭП() Или Пользователи.ЭтоПолноправныйПользователь();

	Если ЕстьПрава = Ложь Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	ВозможноДляЭтогоСпособа = ВыгрузкаРегламентированнойБухгалтерскойОтчетностиКлиентСервер.ИспользоватьЭПДляСпособаВыгрузки(СпособВыгрузки);
	
	Если ВозможноДляЭтогоСпособа = Ложь Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Возврат Истина; 
	
КонецФункции

Функция ПолучитьДанныеСертификата(Сертификат) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сертификат",Сертификат);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка,
	|	СертификатыКлючейЭлектроннойПодписиИШифрования.КомуВыдан,
	|	СертификатыКлючейЭлектроннойПодписиИШифрования.Отпечаток
	|ИЗ
	|	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
	|ГДЕ
	|	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка = &Сертификат";
	
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);
	
КонецФункции	

// Прочее
////////////////////////////////////////////////////////////////////////////////


