#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = КапВложения.Итог("Всего");
	
	КонтрольИсполненияДоговоров.ОчиститьДвиженияРегистровПодсистемы(ЭтотОбъект);
	ПрослеживаемостьБГУ.ПриЗаписиОбъекта(ЭтотОбъект);
	
	ВидыНФА = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(КапВложения.ВыгрузитьКолонку("ВнеоборотныйАктив"), "ВидНФА");
	Для Каждого СтрокаТаблицы Из КапВложения Цикл
		ВидНФА = ВидыНФА[СтрокаТаблицы.ВнеоборотныйАктив];
		Если ВидНФА = Перечисления.ВидыНФА.НПА Тогда
			СтрокаТаблицы.СчетАмортизации	= ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			СтрокаТаблицы.СуммаАмортизации	= 0;
		КонецЕсли;
		Если ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
			СтрокаТаблицы.СчетАмортизации	= ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			СтрокаТаблицы.СуммаАмортизации	= 0;
			СтрокаТаблицы.СчетОбесценения	= ПланыСчетов.ЕПСБУ.ПустаяСсылка();
			СтрокаТаблицы.СуммаОбесценения	= 0;
		КонецЕсли;
	КонецЦикла;
	
	ПрослеживаемостьБГУ.УдалитьНеиспользуемыеСтрокиСведенийПрослеживаемости(ЭтотОбъект, "КапВложения");
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем Основание;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеОСВПути") Тогда
		
		ЗаполнитьПоПоступлениюВПути(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Договоры") Тогда
		
		ЗаполнитьПоДоговору(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияОбязательствИСведенийПоДоговорам") Тогда	
		
		ЗаполнитьПоРегистрацииОбязательства(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
		
		Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(ДанныеЗаполнения.Организация) Тогда
			РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(ДанныеЗаполнения);
			Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
				ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(ДанныеЗаполнения, РазличающаясяНоменклатураКонтрагентаИОрганизации);
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
		КонецЕсли;	
		
		ЗаполнитьПоЭлектронномуДокументуПоставщика(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
		
		ЗаполнитьПоЭлектронномуДокументуПередающейСтороны(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИзвещениеВходящее") Тогда
		
		ЗаполнитьПоВходящемуИзвещению(ДанныеЗаполнения);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("Основание", Основание);
		Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйДокументПоставщика") Тогда
			
			Если ЭлектронныеДокументыБГУ.КонтролироватьСоответствиеНаименованияТРУДляДокументовУчетаНаОснованииЭДП(Основание.Организация) Тогда
				РазличающаясяНоменклатураКонтрагентаИОрганизации = ЭлектронныеДокументыБГУ.РазличающаясяНоменклатураКонтрагентаИОрганизации(Основание);
				Если РазличающаясяНоменклатураКонтрагентаИОрганизации.Количество() > 0 Тогда
					ТекстСообщения = ЭлектронныеДокументыБГУ.ТекстСообщенияОРазличающейсяНоменклатуре(Основание, РазличающаясяНоменклатураКонтрагентаИОрганизации);
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
			КонецЕсли;	
			
			ЗаполнитьПоЭлектронномуДокументуПоставщика(ДанныеЗаполнения.Основание, ДанныеЗаполнения.НоменклатураДляОтраженияВУчете.Выгрузить());
		ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
			ЗаполнитьПоЭлектронномуДокументуПередающейСтороны(ДанныеЗаполнения.Основание);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ);
	ПрослеживаемостьБГУ.УдалениеПроведенияПервичногоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	УчетРасчетов.ЗачетАвансовВыданныхОбработкаПроверкиЗаполнения(ЭтотОбъект, НепроверяемыеРеквизиты, Отказ);
	
	СписокСчетов = КапВложения.ВыгрузитьКолонку("СчетУчета");
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СписокСчетов, ПланыСчетов.ЕПСБУ.ПустаяСсылка());
	Если БухгалтерскийУчет.ЕстьСчетаСОбязательнымЗаполнениемПодразделения(СписокСчетов) Тогда
		ПроверяемыеРеквизиты.Добавить("Подразделение");
	КонецЕсли;
	
	ПроверятьРеквизитыПрослеживаемости = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Дата)
		И ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(КапВложения);
	
	Если Не ПроверятьРеквизитыПрослеживаемости Тогда
		НепроверяемыеРеквизиты.Добавить("НомерПервичногоДокумента");
		НепроверяемыеРеквизиты.Добавить("ДатаПервичногоДокумента");
	КонецЕсли;
	
	НепроверяемыеРеквизиты.Добавить("КапВложения.СтранаПроисхождения");
	ПрослеживаемостьБГУ.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, "КапВложения");

	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
	ШаблонСообщения = НСтр("ru = 'В строке %1 расчетные цены объектов различаются'");
	ШаблонСообщения1 = НСтр("ru = 'В строке %1 не заполнена карточка капвложений'");
	Для Каждого СтрокаТаблицы Из КапВложения Цикл
		Если СтрокаТаблицы.Количество <> 0 Тогда
			ВидНФА = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.ВнеоборотныйАктив, "ВидНФА");
			Если ВидНФА <> Перечисления.ВидыНФА.КапВложения Тогда
				Цена = СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество;
				Если Цена <> Окр(Цена, 2) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаТаблицы.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если СтрокаТаблицы.ОтразитьВКарточкеКапвложений
			И ОбслуживаниеКарточекКапвложений.ЭтоСчетКапвложений(СтрокаТаблицы.СчетУчета) 
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.КарточкаКапвложений) Тогда

			Отказ = Истина;
			ТекстСообщения1 = СтрШаблон(ШаблонСообщения1, СтрокаТаблицы.НомерСтроки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения1, ЭтотОбъект.Ссылка, 
				"КапВложения[" + КапВложения.Индекс(СтрокаТаблицы) + "].КарточкаКапвложений", "Объект");
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	ПрослеживаемостьБГУ.СформироватьДвижения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

Процедура ЗаполнитьПоПоступлениюВПути(ДокументОснование)
	
	ЗаполняемыеДанные = "Организация, Подразделение, ИФО, Контрагент, Договор, ВидПервичногоДокумента, ДатаПервичногоДокумента, НомерПервичногоДокумента, ВалютаДокумента, Дата, ПринятьНДСКВычетуУказываетсяВСтроках";
	ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования,, "Дата");
	СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
	|	ЖурналПроводокЕПСБУОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ЖурналПроводокЕПСБУОстатки.КФО КАК КФО,
	|	ЖурналПроводокЕПСБУОстатки.КПС КАК КПС
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&Период,
	|			Счет В (&Счет107),
	|			&ВидыСубконто,
	|			Организация = &Организация
	|				И Субконто2 = &ДокументОснование) КАК ЖурналПроводокЕПСБУОстатки
	|ГДЕ
	|	ЖурналПроводокЕПСБУОстатки.КоличествоОстаток <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	КФО,
	|	КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеОСВПутиКапВложения.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	Остатки.КоличествоОстаток КАК Количество,
	|	Остатки.СуммаОстаток КАК Сумма,
	|	Остатки.СуммаОстаток КАК Всего,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	ПоступлениеОСВПутиКапВложения.КПС КАК КПС,
	|	ПоступлениеОСВПутиКапВложения.КФО КАК КФО,
	|	ЕСТЬNULL(ПоступлениеОСВПутиКапВложения.СчетУчета.Код, """") КАК СчетУчетаВПути,
	|	ПоступлениеОСВПутиКапВложения.НДСКРаспределению КАК НДСКРаспределению,
	|	ПоступлениеОСВПутиКапВложения.ПринятьНДСКВычету КАК ПринятьНДСКВычету
	|ИЗ
	|	Документ.ПоступлениеОСВПути.КапВложения КАК ПоступлениеОСВПутиКапВложения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Остатки КАК Остатки
	|		ПО ПоступлениеОСВПутиКапВложения.ВнеоборотныйАктив = Остатки.ОсновноеСредство
	|			И ПоступлениеОСВПутиКапВложения.КПС = Остатки.КПС
	|			И ПоступлениеОСВПутиКапВложения.КФО = Остатки.КФО
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПоступлениеОСВПутиКапВложения.НомерСтроки";
	
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ПартииВПути);
	Запрос.УстановитьПараметр("Организация"			, ДанныеДокументаОснования.Организация);
	Запрос.УстановитьПараметр("ДокументОснование"	, ДокументОснование);
	Запрос.УстановитьПараметр("ВидыСубконто"		, ВидыСубконто);
	Запрос.УстановитьПараметр("Счет107"				, БухгалтерскийУчет.СписокСчетов("107.00"));
	Если Ссылка.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Период", "");
	Иначе
		Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	КонецЕсли;
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СоответствиеСчетов = Новый Соответствие;
	
	КапВложения.Очистить();
	Для Каждого ТекСтрока Из Результат Цикл
		
		НоваяСтрока = КапВложения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		СчетВложения = СоответствиеСчетов.Получить(ТекСтрока.СчетУчетаВПути);
		Если СчетВложения = Неопределено Тогда
			КодСчета = СтрЗаменить(ТекСтрока.СчетУчетаВПути, "107", "106");
			СчетВложения = БухгалтерскийУчет.СчетПоКоду(КодСчета, ДанныеДокументаОснования.Дата, Организация);
			СоответствиеСчетов.Вставить(ТекСтрока.СчетУчетаВПути, СчетВложения);
		КонецЕсли;
		НоваяСтрока.СчетУчета = СчетВложения;
		
	КонецЦикла;
	
КонецПроцедуры

// Заполняет документ остатками авансов к зачету.
//
Процедура ЗаполнитьПоОстаткамАвансов(ПараметрыЗаполнения, Отказ) Экспорт
	
	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	ПараметрыЗаполнения.Вставить("Организация"	, Организация);
	ПараметрыЗаполнения.Вставить("Дата"			, Дата);
	ПараметрыЗаполнения.Вставить("Ссылка"		, Ссылка);
	
	ТаблицаДокумента = УчетРасчетов.ПодготовитьТаблицуРасчетовПоДокументу(
		ЭтотОбъект, ПараметрыЗаполнения, Отказ);
	
	ТаблицаРасчетов = УчетРасчетов.ТаблицаРасчетовСЗачетомАвансов(
		ТаблицаДокумента, , ПараметрыЗаполнения, Отказ);
	
	Если Не Отказ Тогда
		
		ЗачетАвансов.Очистить();
		
		АвансыКЗачету = ТаблицаРасчетов.НайтиСтроки(Новый Структура("ЭтоЗачетАванса", Истина));
		
		Для Каждого АвансКЗачету Из АвансыКЗачету Цикл
			
			Если АвансКЗачету.ВидДопСубконтоАвансов <> ПланыВидовХарактеристик.ВидыСубконто.ДокументыРасчетов Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ЗачетАвансов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, АвансКЗачету, "КФО,КПС");
			
			НоваяСтрока.ДокументАванса = АвансКЗачету.ДопСубконтоАвансов;
			НоваяСтрока.КЭК            = БухгалтерскийУчетПовтИсп.АналитическийКЭКпоСчету(АвансКЗачету.СчетАвансов);
			НоваяСтрока.СуммаЗачета    = АвансКЗачету.СуммаРасчетов;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДоговору(ДанныеЗаполнения)
	
	Документы.ПоступлениеОС.ЗаполнитьОбъектПоДоговору(ДанныеЗаполнения, ЭтотОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьПоРегистрацииОбязательства(ДанныеЗаполнения)
	
	ЗаполнитьПоДоговору(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Договор"));
	
КонецПроцедуры

Процедура ЗаполнитьПоЭлектронномуДокументуПоставщика(ДанныеЗаполнения, СписокНоменклатуры = Неопределено) Экспорт

	Если ДанныеЗаполнения.НеОтражаетсяВУчете Тогда
		ОписаниеОшибки = НСтр("ru='Для документа-основания на странице ""Дополнительно"" включен признак ""Электронный документ не отражается в учете"".'");

		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	ТипДокументаУчета = Перечисления.ТипыДокументовДляОтраженияВУчетеЭДПоставщика.ПоступлениеОС;

	ДатаПодписания = Дата(1,1,1);
	Если ДанныеЗаполнения.ЗагруженИзЕИС Тогда
		ДатаПодписания = ЭлектронныеДокументыБГУ.ДатаПоследнейЭлектроннойПодписиЭД(ДанныеЗаполнения);
		Если ЗначениеЗаполнено(ДатаПодписания) Тогда
			Дата = ДатаПодписания;
		КонецЕсли;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаПодписания) Тогда
		Дата = ЭлектронныеДокументыБГУ.ДатаВходящегоИзвещенияЭДП(ДанныеЗаполнения);
	КонецЕсли;
	
	ДатаПодписанияПервичногоДокумента = Дата;

	Организация					= ДанныеЗаполнения.Организация;
	Контрагент					= ДанныеЗаполнения.Контрагент;
	Договор						= ДанныеЗаполнения.Договор;
	ВалютаДокумента				= ДанныеЗаполнения.ВалютаДокумента;
	СуммаВключаетНДС			= ДанныеЗаполнения.СуммаВключаетНДС;
	ВидПервичногоДокумента		= ДанныеЗаполнения.ВидПервичногоДокумента;
	ДатаПервичногоДокумента		= ДанныеЗаполнения.ДатаПервичногоДокумента;
	НомерПервичногоДокумента	= ДанныеЗаполнения.НомерПервичногоДокумента;
	ДокументОснование			= ДанныеЗаполнения;
	СпособЗачетаАванса			= Перечисления.СпособыЗачетаАвансов.Автоматически;
	
	Если Не ТипЗнч(СписокНоменклатуры) = Тип("ТаблицаЗначений") Тогда
		СписокНоменклатуры = ЭлектронныеДокументыБГУВызовСервера.СписокДоступнойНоменклатурыЭДПоставщика(ТипДокументаУчета, ДокументОснование);
	КонецЕсли;
	ИспользуемыеИдентификаторы = Новый Массив;
	
	Для Каждого СтрокаТЧ из СписокНоменклатуры Цикл
		Если СтрокаТЧ.КодВидаНоменклатуры = 2 Тогда
			ДанныеОбъектаОС = УправлениеОсновнымиСредствами.ДанныеОбъектаОС(СтрокаТЧ.Номенклатура, КонецДня(ДанныеЗаполнения.Дата));
			СчетВложенийОС = ДанныеОбъектаОС.СчетВложений;
			ДобавленаНоваяСтрока = Ложь;
			ВидНФА = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "ВидНФА");

			Если ВидНФА = Перечисления.ВидыНФА.ОС
				ИЛИ СтрокаТЧ.Номенклатура.ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
				НоваяСтрока = КапВложения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.ВнеоборотныйАктив = СтрокаТЧ.Номенклатура;
				НоваяСтрока.КоличествоМест = 1;
				НоваяСтрока.Коэффициент = 1;
				Если ЗначениеЗаполнено(СчетВложенийОС) Тогда
					НоваяСтрока.СчетУчета = СчетВложенийОС;
				Иначе	
					СчетВложенийОСПоУмолчанию = БухгалтерскийУчет.СчетПоКоду("106.31", ДанныеЗаполнения.Дата);
					НоваяСтрока.СчетУчета = СчетВложенийОСПоУмолчанию;
				КонецЕсли;
				ДобавленаНоваяСтрока = Истина;
			ИначеЕсли ВидНФА = Перечисления.ВидыНФА.НМА
				ИЛИ СтрокаТЧ.Номенклатура.ВидНФА = Перечисления.ВидыНФА.ПраваПользованияИмуществом Тогда
				НоваяСтрока = КапВложения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.ВнеоборотныйАктив = СтрокаТЧ.Номенклатура;
				НоваяСтрока.КоличествоМест = 1;
				НоваяСтрока.Коэффициент = 1;
				Если ЗначениеЗаполнено(СчетВложенийОС) Тогда
					НоваяСтрока.СчетУчета = СчетВложенийОС;
				Иначе	
					СчетВложенийОСПоУмолчанию = БухгалтерскийУчет.СчетПоКоду("106.6I", ДанныеЗаполнения.Дата);
					НоваяСтрока.СчетУчета = СчетВложенийОСПоУмолчанию;
				КонецЕсли;
				ДобавленаНоваяСтрока = Истина;
			ИначеЕсли ВидНФА = Перечисления.ВидыНФА.НПА Тогда 
				НоваяСтрока = КапВложения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.ВнеоборотныйАктив = СтрокаТЧ.Номенклатура;
				НоваяСтрока.КоличествоМест = 1;
				НоваяСтрока.Коэффициент = 1;
				Если ЗначениеЗаполнено(СчетВложенийОС) Тогда
					НоваяСтрока.СчетУчета = СчетВложенийОС;
				Иначе	
					СчетВложенийОСПоУмолчанию = БухгалтерскийУчет.СчетПоКоду("106.33", ДанныеЗаполнения.Дата);
					НоваяСтрока.СчетУчета = СчетВложенийОСПоУмолчанию;
				КонецЕсли;
				ДобавленаНоваяСтрока = Истина;
			КонецЕсли;
			Если ДобавленаНоваяСтрока Тогда
				Если ЗначениеЗаполнено(НоваяСтрока.ИдентификаторСтроки) Тогда
					ИспользуемыеИдентификаторы.Добавить(НоваяСтрока.ИдентификаторСтроки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьРНПТПоЭДПоставщика(ДокументОснование, ИспользуемыеИдентификаторы);
	Если СведенияПрослеживаемости.Количество()>0 Тогда
		ОтражатьВПрослеживаемости = Истина;
		КодОперацииПрослеживаемости = Справочники.КодыОперацийПрослеживаемости.ПриобретениеПлательщикомНДС;
	КонецЕсли;	
	
	СуммаДокумента = КапВложения.Итог("Всего");
	
КонецПроцедуры

Процедура ЗаполнитьРНПТПоЭДПоставщика(ДокументОснование, ИспользуемыеИдентификаторы)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭлектронныйДокументПоставщикаСведенияПрослеживаемости.РНПТ КАК РНПТ,
	|	ЭлектронныйДокументПоставщикаСведенияПрослеживаемости.Количество КАК Количество,
	|	ЭлектронныйДокументПоставщикаСведенияПрослеживаемости.КоличествоПрослеживаемости КАК КоличествоПрослеживаемости,
	|	ЭлектронныйДокументПоставщикаСведенияПрослеживаемости.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	Документ.ЭлектронныйДокументПоставщика.СведенияПрослеживаемости КАК ЭлектронныйДокументПоставщикаСведенияПрослеживаемости
	|ГДЕ
	|	ЭлектронныйДокументПоставщикаСведенияПрослеживаемости.Ссылка = &ДокументОснование
	|	И ЭлектронныйДокументПоставщикаСведенияПрослеживаемости.ИдентификаторСтроки В(&ИспользуемыеИдентификаторы)";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ИспользуемыеИдентификаторы", ИспользуемыеИдентификаторы);
	
	СведенияПрослеживаемости.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура ЗаполнитьПоЭлектронномуДокументуПередающейСтороны(ДанныеЗаполнения) Экспорт

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЭлектронныйАктОПриемеПередачеОбъектовНФАВходящий") Тогда
		Если ДанныеЗаполнения.ТипЭлектронногоАкта = ЭлектронныеДокументыБГУ.ТипАктаОтветногоПринимающейСтороны() Тогда
			ОписаниеОшибки = НСтр("ru='Для ответного акта нельзя ввести документ данного типа.'");

			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;	
	КонецЕсли;
	
	КодВидаОперации = ДанныеЗаполнения.КодВидаОперации;

	ЕстьОСИмуществаКазны = Ложь;
	Для Каждого ТекСтрока Из ДанныеЗаполнения.ПереданныеНФА Цикл
		Если ТекСтрока.КодСчетаУчетаУОтправителя = "108.52" Тогда
			ЕстьОСИмуществаКазны = Истина;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если НЕ КодВидаОперации = НСтр("ru = 'ПередачаКапвложений'") И НЕ ЕстьОСИмуществаКазны Тогда
		Возврат;	
	КонецЕсли;	

	Организация					= ДанныеЗаполнения.Организация;
	ДокументОснование			= ДанныеЗаполнения;
	Контрагент					= ДанныеЗаполнения.Контрагент;
	Договор						= ДанныеЗаполнения.Договор;
	ВалютаДокумента				= Справочники.Валюты.НайтиПоКоду(ДанныеЗаполнения.КодВалюты);
	ВидПервичногоДокумента		= ДанныеЗаполнения.ВидПервичногоДокумента;
	ДатаПервичногоДокумента		= ДанныеЗаполнения.ДатаПервичногоДокумента;
	НомерПервичногоДокумента	= ДанныеЗаполнения.НомерПервичногоДокумента;
	
	ПервичныйДокумент = ПервичныеДокументыБГУКлиентСервер.ПервичныйДокумент("АктПриемаПередачи0510448");

	СпособЗачетаАванса			= Перечисления.СпособыЗачетаАвансов.Автоматически;
	СуммаВключаетНДС			= Ложь;
	
	КФО = ЭлектронныеДокументыБГУ.ПолучитьСсылкуНаЗначениеПеречисления("КВД", ДанныеЗаполнения.КФОУОтправителя, Истина);
	НФАПереданыЭлектроннымАктом = Истина;

	КапВложения.Очистить();
	Для Каждого ТекСтрока Из ДанныеЗаполнения.ПереданныеНФА Цикл
		НоваяСтрока = КапВложения.Добавить();
		НоваяСтрока.ИдентификаторСтроки = ТекСтрока.ИдентификаторСтроки; 
		НоваяСтрока.ВнеоборотныйАктив 	= ТекСтрока.НФА;
		НоваяСтрока.КоличествоМест 		= 1;
		НоваяСтрока.Количество 			= ТекСтрока.Количество;
		НоваяСтрока.Коэффициент 		= 1;
		НоваяСтрока.СтранаПроисхождения = Справочники.СтраныМира.НайтиПоКоду(ТекСтрока.КодСтраныПроисхождения);
		
		ВидНФА = ЭлектронныеДокументыБГУ.ПолучитьСсылкуНаЗначениеПеречисления("ВидыНФА", ТекСтрока.ВидНФА, Истина);
		СчетВложенийОС = БухгалтерскийУчетПовтИсп.ПолучитьСчетПоКоду(ТекСтрока.КодСчетаУчетаУОтправителя);
		Если ВидНФА = Перечисления.ВидыНФА.КапВложения Тогда
			СчетВложенийОСПоУмолчанию = БухгалтерскийУчет.СчетПоКоду("106.31", ДанныеЗаполнения.Дата);
		ИначеЕсли ВидНФА = Перечисления.ВидыНФА.НМА Тогда
			СчетВложенийОСПоУмолчанию = БухгалтерскийУчет.СчетПоКоду("106.6I", ДанныеЗаполнения.Дата);
		ИначеЕсли ВидНФА = Перечисления.ВидыНФА.НПА Тогда
			СчетВложенийОСПоУмолчанию = БухгалтерскийУчет.СчетПоКоду("106.33", ДанныеЗаполнения.Дата);
		КонецЕсли;
		
		Если ЕстьОСИмуществаКазны Тогда
			СчетВложенийОС = БухгалтерскийУчет.СчетПоКоду("106.31", ДанныеЗаполнения.Дата);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СчетВложенийОС) Тогда
			НоваяСтрока.СчетУчета = СчетВложенийОС;
		Иначе	
			НоваяСтрока.СчетУчета = СчетВложенийОСПоУмолчанию;
		КонецЕсли;
		
		НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		НоваяСтрока.Сумма = ТекСтрока.БалансоваяСтоимость;
		НоваяСтрока.Всего = ТекСтрока.БалансоваяСтоимость;
		
		НоваяСтрока.КФО = КФО;
		НоваяСтрока.КПС = БухгалтерскиеОперации.КПСПоКоду(ТекСтрока.КодКПСУОтправителя, Дата);
	КонецЦикла;
	
	ТаблицаСведенийОДрагМатериалах = ДанныеЗаполнения.СведенияОСодержанииДрагМатериалов;
	ВестиУчетДрагМатериаловВМЦКапвложений = Константы.ВестиУчетДрагМатериаловВМЦКапвложений.Получить();
	
	ПрисутствуетМЦКапвложенийСДМ =
		ТаблицаСведенийОДрагМатериалах.Количество() > 0 И ЗначениеЗаполнено(ТаблицаСведенийОДрагМатериалах[0].GUIDМЦОтправителя);
	
	Если ВестиУчетДрагМатериаловВМЦКапвложений И ПрисутствуетМЦКапвложенийСДМ Тогда
		
		ДрагоценныеМатериалы.Очистить();
		Для Каждого ТекСтрока Из ТаблицаСведенийОДрагМатериалах Цикл
			
			ОбъектНФА = Справочники.ОсновныеСредства.НайтиПоРеквизиту("GUIDНоменклатурыОтправителя", ТекСтрока.GUIDНоменклатурыУОтправителя );
			
			ОбъектМЦ = "";
			Если ТекСтрока.ТипСправочникаМЦКапВложения = "Номенклатура" Тогда
				ОбъектМЦ = Справочники.Номенклатура.НайтиПоРеквизиту("GUIDНоменклатурыОтправителя", ТекСтрока.GUIDМЦОтправителя); 
			ИначеЕсли ТекСтрока.ТипСправочникаМЦКапВложения = "Основное средство" Тогда
				ОбъектМЦ = Справочники.ОсновныеСредства.НайтиПоРеквизиту("GUIDНоменклатурыОтправителя", ТекСтрока.GUIDМЦОтправителя);
			КонецЕсли;
					
			Если НЕ ЗначениеЗаполнено(ОбъектНФА) ИЛИ НЕ ЗначениеЗаполнено(ОбъектМЦ) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ДрагоценныеМатериалы.Добавить();
			
			НоваяСтрока.ОбъектНФА = ОбъектНФА;
			НоваяСтрока.ОбъектМЦ = ОбъектМЦ; 
			НоваяСтрока.КоличествоМЦ = ТекСтрока.КоличествоМЦ;
			НоваяСтрока.ВидДрагМатериала = Справочники.ДрагМеталлы.НайтиПоКоду(ТекСтрока.КодВидаДрагоценногоМатериала);
			НоваяСтрока.МассаДМ = ТекСтрока.МассаДМ;
			НоваяСтрока.ЕдИзм = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду(СокрЛП(ТекСтрока.ЕдИзмКод));
			НоваяСтрока.КоличествоДМ = ТекСтрока.КоличествоДМ; 
			
		КонецЦикла; 
	КонецЕсли;
	
	Если ДанныеЗаполнения.СведенияПрослеживаемости.Количество() > 0 Тогда
		ОтражатьВПрослеживаемости = Истина;
		КодОперацииПрослеживаемости = Справочники.КодыОперацийПрослеживаемости.БезвозмездноеПолучение;
		
		Для Каждого ТекСтрока Из ДанныеЗаполнения.СведенияПрослеживаемости Цикл
			НоваяСтрока = СведенияПрослеживаемости.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);			
		КонецЦикла;	
	КонецЕсли;
	
	СуммаДокумента = КапВложения.Итог("Всего");
	
КонецПроцедуры	

// Заполнить по входящему извещению.
// 
// Параметры:
//  ДанныеЗаполнения - ДокументСсылка.ИзвещениеВходящее -
//
Процедура ЗаполнитьПоВходящемуИзвещению(ДанныеЗаполнения)
	
	ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Организация, Поставщик, Договор, ИФО");
	
	Дата               = ОбщегоНазначения.ТекущаяДатаПользователя();
	ДокументОснование  = ДанныеЗаполнения;
	Организация        = ДанныеОснования.Организация;
	ИФО                = ДанныеОснования.ИФО;
	Контрагент         = ДанныеОснования.Поставщик;
	Договор            = ДанныеОснования.Договор;
	СпособЗачетаАванса = Перечисления.СпособыЗачетаАвансов.Автоматически;
	СуммаВключаетНДС   = Истина;
	ВалютаДокумента    = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИзвещениеВходящееОсновныеСредства.ОсновноеСредство КАК ВнеоборотныйАктив,
		|	ИзвещениеВходящееОсновныеСредства.Количество КАК Количество,
		|	ИзвещениеВходящееОсновныеСредства.Сумма КАК Сумма,
		|	ИзвещениеВходящееОсновныеСредства.КФО КАК КФО,
		|	ВЫБОР
		|		КОГДА &ВестиУчетПрослеживаемыхТоваров
		|			ТОГДА ОсновныеСредства.ПрослеживаемыйТовар
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ПрослеживаемыйТовар,
		|	ВЫБОР
		|		КОГДА &ВестиУчетПрослеживаемыхТоваров
		|			ТОГДА ОсновныеСредства.СтранаПроисхождения
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтранаПроисхождения
		|ИЗ
		|	Документ.ИзвещениеВходящее.ОсновныеСредства КАК ИзвещениеВходящееОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОсновныеСредства КАК ОсновныеСредства
		|		ПО ИзвещениеВходящееОсновныеСредства.ОсновноеСредство = ОсновныеСредства.Ссылка
		|ГДЕ
		|	ИзвещениеВходящееОсновныеСредства.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзвещениеВходящееОсновныеСредства.НомерСтроки";
	
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("ВестиУчетПрослеживаемыхТоваров", ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров"));
	
	ВыборкаОС = Запрос.Выполнить().Выбрать();
	
	КапВложения.Очистить();
	Пока ВыборкаОС.Следующий() Цикл
		НоваяСтрока = КапВложения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОС);
		НоваяСтрока.СтавкаНДС 	= Перечисления.СтавкиНДС.БезНДС;
		НоваяСтрока.Всего 		= НоваяСтрока.Сумма;
		НоваяСтрока.ОтразитьВКарточкеКапвложений = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
