#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.СпособПодключения <> Перечисления.СпособыПодключенияФРМО.ИПС Тогда
			НеПроверяемыеРеквизиты.Добавить("ИдентификаторКлиентаИПС");
			НеПроверяемыеРеквизиты.Добавить("Сертификат");
		КонецЕсли;
		
		Если Запись.СпособПодключения = Перечисления.СпособыПодключенияФРМО.РегионСервис1С Тогда
			НеПроверяемыеРеквизиты.Добавить("АдресСервиса");
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Запись.СпособПодключения <> Перечисления.СпособыПодключенияФРМО.ИПС Тогда
			Запись.ИдентификаторКлиентаИПС = "";
			Запись.Сертификат = Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.ПустаяСсылка();
		КонецЕсли;
		Если Запись.СпособПодключения <> Перечисления.СпособыПодключенияФРМО.РегионЛокальный Тогда
			Запись.Логин = "";
		КонецЕсли;
		Если Запись.СпособПодключения <> Перечисления.СпособыПодключенияФРМО.ИПС
			И Запись.СпособПодключения <> Перечисления.СпособыПодключенияФРМО.РегионЛокальный Тогда
			Запись.АдресСервиса = "";
			Запись.ЗащищенноеСоединение = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли