
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПИСИ УНИВЕРСАЛЬНОГО ОТЧЕТА
//

// Записывает движения документа на сервере приложения.
//
Процедура ЗаписатьДвиженияУниверсальногоОтчета(Знач Ссылка, Знач Контекст, УдалятьДвижения = Истина) Экспорт
	
	// Запись значений показателей.
	
	КоличествоЗаписейВНаборе = БюджетнаяОтчетностьСерверПовтИсп.МаксимальныйРазмерНабораЗаписейОтчета();
	
	Счетчик=1;
		
	Если УдалятьДвижения Тогда
		
		НаборЗаписей = РегистрыСведений.ЗначенияПоказателейОтчетов.СоздатьНаборЗаписей(); 	
		НаборЗаписей.Отбор.ЭкземплярОтчета.Установить(Ссылка); 
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.АналитикаПоказателей.СоздатьНаборЗаписей(); 	
		НаборЗаписей.Отбор.ЭкземплярОтчета.Установить(Ссылка); 
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхРеквизитовОтчета.СоздатьНаборЗаписей(); 	
		НаборЗаписей.Отбор.ЭкземплярОтчета.Установить(Ссылка); 
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	СоответствиеАналитики = БюджетнаяОтчетность.ПолучитьВидыАналитикиСТипомСтрока();
	
	//Запись показателей
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("мПоказатели"			,Контекст.мПоказатели);
	Запрос.УстановитьПараметр("мПоказателиРаскрытия",Контекст.мПоказателиРаскрытия);
	
	ПоляАналитики = "";
	Для Сч = 1 По Контекст.мЧислоДопАналитик Цикл
		ПоляАналитики = ПоляАналитики + ",
		|	мПоказателиРаскрытия.Аналитика" + Сч;
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	мПоказатели.Ссылка КАК Показатель,
	|	мПоказатели.ТипЗначения,
	|	мПоказатели.НеограниченнаяДлина,
	|	мПоказатели.ГруппаРаскрытия,
	|	мПоказатели.Значение
	|ПОМЕСТИТЬ мПоказатели
	|ИЗ
	|	&мПоказатели КАК мПоказатели
	|ГДЕ
	|	НЕ мПоказатели.Отключен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мПокРаскрытия.*
	|ПОМЕСТИТЬ мПокРаскрытия
	|ИЗ
	|	&мПоказателиРаскрытия КАК мПокРаскрытия
	|ИНДЕКСИРОВАТЬ ПО
	|	Показатель
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мПоказателиРаскрытия.Показатель КАК Показатель,
	|	мПоказателиРаскрытия.Индекс,
	|	мПоказатели.ТипЗначения,
	|	мПоказатели.НеограниченнаяДлина,
	|	мПоказатели.ГруппаРаскрытия,
	|	мПоказателиРаскрытия.ПромежуточныйИтог,
	|	мПоказателиРаскрытия.Значение"
	+ ПоляАналитики + "
	|ПОМЕСТИТЬ мПоказателиРаскрытия
	|ИЗ
	|	мПокРаскрытия КАК мПоказателиРаскрытия
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ мПоказатели КАК мПоказатели
	|	ПО мПоказателиРаскрытия.Показатель = мПоказатели.Показатель
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мПоказатели.Показатель,
	|	0 КАК Индекс,
	|	ЛОЖЬ КАК ПромежуточныйИтог,
	|	мПоказатели.ТипЗначения,
	|	мПоказатели.НеограниченнаяДлина,
	|	мПоказатели.Значение
	|ИЗ
	|	мПоказатели КАК мПоказатели";
	
	Если Контекст.мПоказателиРаскрытия.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	мПоказателиРаскрытия.Показатель,
		|	мПоказателиРаскрытия.Индекс,
		|	мПоказателиРаскрытия.ПромежуточныйИтог,
		|	мПоказателиРаскрытия.ТипЗначения,
		|	мПоказателиРаскрытия.НеограниченнаяДлина,
		|	мПоказателиРаскрытия.Значение
		|ИЗ
		|	мПоказателиРаскрытия КАК мПоказателиРаскрытия
		|УПОРЯДОЧИТЬ ПО
		|	Индекс
		|;
		|////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	мПоказателиРаскрытия.Индекс,
		|	мПоказателиРаскрытия.ГруппаРаскрытия"
		+ ПоляАналитики + "
		|ИЗ
		|	мПоказателиРаскрытия КАК мПоказателиРаскрытия
		|УПОРЯДОЧИТЬ ПО
		|	Индекс
		|
		|ИТОГИ ПО
		|	ГруппаРаскрытия";
		
	КонецЕсли;
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаПоказатели  = РезультатыЗапросов[3].Выбрать();
	
	СозданыЗаписи = Ложь;
	Пока ВыборкаПоказатели.Следующий() Цикл
		
		Если Счетчик=1 Тогда
			
			СозданыЗаписи = Истина;
			НаборЗаписей  = РегистрыСведений.ЗначенияПоказателейОтчетов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭкземплярОтчета.Установить(Ссылка);
			
		КонецЕсли;
		
		Движение = НаборЗаписей.Добавить(); 
		
		Движение.ЭкземплярОтчета    = Ссылка;
		Движение.Показатель     	= ВыборкаПоказатели.Показатель;
		
		// Запись ресурсов регистра
		
		// ЗначениеЧисло
		Если ВыборкаПоказатели.ТипЗначения = Перечисления.ТипыЗначенийПоказателейОтчетов.Число Тогда
			Попытка
				ЗначениеЧисло = Число(ВыборкаПоказатели.Значение);
			Исключение
				ЗначениеЧисло = 0;
			КонецПопытки;
			Движение.ЗначениеЧисло 	= ЗначениеЧисло;
			
			Движение.Значение = ЗначениеЧисло;
		Иначе
			Движение.Значение = ВыборкаПоказатели.Значение;
		КонецЕсли;		 
		
		// ЗначениеНеограниченнаяСтрока
		Если ВыборкаПоказатели.НеограниченнаяДлина Тогда
			Движение.ЗначениеНеограниченнаяСтрока = ВыборкаПоказатели.Значение;
		КонецЕсли;
		
		Движение.Индекс 			= ВыборкаПоказатели.Индекс;
		Движение.ПромежуточныйИтог 	= ВыборкаПоказатели.ПромежуточныйИтог;
		
		Если Счетчик>=КоличествоЗаписейВНаборе Тогда
			НаборЗаписей.Записать(Ложь);
			СозданыЗаписи = Ложь;
			Счетчик		  = 1;
		Иначе
			Счетчик=Счетчик+1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СозданыЗаписи Тогда
		НаборЗаписей.Записать(Ложь);
	КонецЕсли;
	
	Счетчик = 1;
	Если ЗначениеЗаполнено(Контекст.мПоказателиРаскрытия) Тогда
		
		СозданыЗаписи = Ложь;
		
		КэшГруппРаскрытия = КэшДанныхПоГруппамРаскрытия(Контекст.ВидОтчета,Контекст.мЧислоДопАналитик);
		ВыборкаГруппРаскрытия = РезультатыЗапросов[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаГруппРаскрытия.Следующий() Цикл
			
			ДанныеГруппы = КэшГруппРаскрытия.Найти(ВыборкаГруппРаскрытия.ГруппаРаскрытия,"ГруппаРаскрытия");
			
			// У группы может не быть аналитик. В этом случае не пишем ничего в регистр.
			Если ДанныеГруппы.ЧислоАналитик > 0 Тогда
				
				ВыборкаЗначений = ВыборкаГруппРаскрытия.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаЗначений.Следующий() Цикл						
					
					Для Сч = 1 По ДанныеГруппы.ЧислоАналитик Цикл
						
						Если Счетчик = 1 Тогда
							НаборЗаписейАналитика = РегистрыСведений.АналитикаПоказателей.СоздатьНаборЗаписей();
							НаборЗаписейАналитика.Отбор.ЭкземплярОтчета.Установить(Ссылка);
							СозданыЗаписи 		  = Истина;
						КонецЕсли;
						
						ЗаписьРегистра 					 = НаборЗаписейАналитика.Добавить();
						ЗаписьРегистра.ЭкземплярОтчета 	 = Ссылка;
						ЗаписьРегистра.ГруппаРаскрытия	 = ВыборкаЗначений.ГруппаРаскрытия;
						ЗаписьРегистра.Индекс			 = ВыборкаЗначений.Индекс;
						ЗаписьРегистра.ВидАналитики		 = ДанныеГруппы["ВидАналитики"+Сч];
						
						Если СоответствиеАналитики[ЗаписьРегистра.ВидАналитики] = Истина Тогда
							//обрежем пробелы, если есть.
							ЗаписьРегистра.Значение = СокрЛП(ВыборкаЗначений["Аналитика"+Сч]);
						Иначе
							ЗаписьРегистра.Значение = ВыборкаЗначений["Аналитика"+Сч];
						КонецЕсли;
						
						Если Счетчик >= КоличествоЗаписейВНаборе Тогда
							НаборЗаписейАналитика.Записать(Ложь);
							СозданыЗаписи 	= Ложь;
							Счетчик 		= 1;
						Иначе
							Счетчик = Счетчик+1;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если СозданыЗаписи Тогда
			НаборЗаписейАналитика.Записать(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	// Дополнительные реквизиты отчета
	
	НаборЗаписей = РегистрыСведений.ЗначенияДополнительныхРеквизитовОтчета.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ЭкземплярОтчета.Установить(Ссылка);
	
	Для Каждого Реквизит ИЗ Контекст.мДополнительныеРеквизиты Цикл
		
		Движение=НаборЗаписей.Добавить();
		Движение.ЭкземплярОтчета 				= Ссылка;
		Движение.ВидАналитики	 				= Реквизит.ВидАналитики;
		Движение.ДополнительныйРеквизитОтчета 	= Реквизит.ДополнительныйРеквизит;
		
		Если СоответствиеАналитики[Движение.ВидАналитики] = Истина Тогда
			//обрежем пробелы, если есть.
			Движение.Значение = СокрЛП(Реквизит.Значение);
		Иначе
			Движение.Значение = Реквизит.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
	
	Контекст = Неопределено;
	
КонецПроцедуры // ЗаписатьДвиженияУниверсальногоОтчета()

// Таблица настроек для групп раскрытия.
//
Функция КэшДанныхПоГруппамРаскрытия(ВидОтчета, ЧислоАналитик)
	
	Запрос = Новый Запрос;
		
	КэшНастроекГруппРаскрытия = Новый ТаблицаЗначений;
	
	Для Инд = 1 По ЧислоАналитик Цикл
		
		СтроковыйИндекс = Формат(Инд, "ЧДЦ=0; ЧН=0");
		Если Не ЗначениеЗаполнено(КэшНастроекГруппРаскрытия) Тогда
			КэшНастроекГруппРаскрытия.Колонки.Добавить("ВидАналитики" + СтроковыйИндекс,Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АналитикаОтчетов"));
			КэшНастроекГруппРаскрытия.Колонки.Добавить("ТипЗначенияАналитики" + СтроковыйИндекс);
			КэшНастроекГруппРаскрытия.Колонки.Добавить("ОбязательнаяАналитика" + СтроковыйИндекс);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(КэшНастроекГруппРаскрытия) Тогда
		КэшНастроекГруппРаскрытия.Колонки.Добавить("ГруппаРаскрытия" 	,Новый ОписаниеТипов("СправочникСсылка.ГруппыРаскрытия"));
		КэшНастроекГруппРаскрытия.Колонки.Добавить("КодГруппыРаскрытия"	,БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(20));
		КэшНастроекГруппРаскрытия.Колонки.Добавить("РазрешитьСовпаденияИзмерений",Новый ОписаниеТипов("Булево"));
		КэшНастроекГруппРаскрытия.Колонки.Добавить("ЧислоАналитик"		,БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(10));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГруппыРаскрытия.Ссылка КАК ГруппаРаскрытия,
	|	ГруппыРаскрытия.Код КАК КодГруппыРаскрытия,
	|	ГруппыРаскрытия.РазрешитьСовпаденияИзмерений,
	|	ЕСТЬNULL(ГруппыРаскрытияАналитика.НомерСтроки,0) КАК НомерАналитики,
	|	ГруппыРаскрытияАналитика.ВидАналитики,
	|	ГруппыРаскрытияАналитика.Обязательный КАК ОбязательнаяАналитика,
	|	ГруппыРаскрытияАналитика.ВидАналитики.ТипЗначения КАК ТипЗначенияАналитики
	|ИЗ
	|	Справочник.ГруппыРаскрытия КАК ГруппыРаскрытия
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	|		ПО ГруппыРаскрытия.Ссылка = ГруппыРаскрытияАналитика.Ссылка
	|ГДЕ ГруппыРаскрытия.Владелец = &Владелец
	|
	|ИТОГИ ПО
	|	ГруппаРаскрытия";
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ИскомаяСтрока = КэшНастроекГруппРаскрытия.Найти(Выборка.ГруппаРаскрытия,"ГруппаРаскрытия");
		Если ИскомаяСтрока = Неопределено Тогда
			ИскомаяСтрока = КэшНастроекГруппРаскрытия.Добавить();
			ИскомаяСтрока.ГруппаРаскрытия = Выборка.ГруппаРаскрытия;
		КонецЕсли;
		
		ИскомаяСтрока.КодГруппыРаскрытия = СокрЛП(Выборка.КодГруппыРаскрытия);
		ИскомаяСтрока.РазрешитьСовпаденияИзмерений = Выборка.РазрешитьСовпаденияИзмерений;
		Аналитики = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ИскомаяСтрока.ЧислоАналитик = Аналитики.Количество();
		Пока Аналитики.Следующий() Цикл
			
			Если Аналитики.НомерАналитики = 0 Тогда
				Если ИскомаяСтрока.ЧислоАналитик = 1 Тогда
					ИскомаяСтрока.ЧислоАналитик = 0;
				КонецЕсли;
				Прервать;
			КонецЕсли;
			
			ИскомаяСтрока["ВидАналитики"+Аналитики.НомерАналитики] 			= Аналитики.ВидАналитики;
			ИскомаяСтрока["ТипЗначенияАналитики"+Аналитики.НомерАналитики] 	= Аналитики.ТипЗначенияАналитики;
			ИскомаяСтрока["ОбязательнаяАналитика"+Аналитики.НомерАналитики] = Аналитики.ОбязательнаяАналитика;				
			
		КонецЦикла;
	КонецЦикла;
	
	КэшНастроекГруппРаскрытия.Индексы.Добавить("ГруппаРаскрытия");		
	
	Возврат КэшНастроекГруппРаскрытия;
	
КонецФункции // КэшДанныхПоГруппамРаскрытия()

// Блокировка движений по регистрам.
//
Процедура УстановитьБлокировкуДвиженийДокумента(Ссылка) Экспорт

	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета");
	ЭлементБлокировки.УстановитьЗначение("ЭкземплярОтчета",Ссылка);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.АналитикаПоказателей");
	ЭлементБлокировки.УстановитьЗначение("ЭкземплярОтчета",Ссылка);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияПоказателейОтчетов");
	ЭлементБлокировки.УстановитьЗначение("ЭкземплярОтчета",Ссылка);
	
	Блокировка.Заблокировать();

КонецПроцедуры



Функция ПолучитьДетализируемыйКлассификаторПоКоду(КодКлассификатора,ИдентификаторКлассификатора) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодКлассификатора) Тогда
		Возврат ПланыВидовХарактеристик.АналитикаОтчетов.ПустаяСсылка();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АналитикаОтчетов.Ссылка КАК Ссылка,
		|	АналитикаОтчетов.Код КАК Код
		|ИЗ
		|	ПланВидовХарактеристик.АналитикаОтчетов КАК АналитикаОтчетов
		|ГДЕ
		|	АналитикаОтчетов.Код = &Код
		|	И АналитикаОтчетов.ПубличныйИдентификатор = &ПубличныйИдентификатор
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Код", КодКлассификатора);
	Запрос.УстановитьПараметр("ПубличныйИдентификатор", ИдентификаторКлассификатора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.АналитикаОтчетов.ПустаяСсылка();

КонецФункции

Функция ПолучитьДетализируемоеЗначениеКлассификатораПоКоду(КодЗначения,Классификатор) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодЗначения) Тогда
		Возврат Справочники.Субконто.ПустаяСсылка();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Субконто.Ссылка КАК Ссылка,
		|	Субконто.Код КАК Код
		|ИЗ
		|	Справочник.Субконто КАК Субконто
		|ГДЕ
		|	Субконто.Код = &Код
		|	И Субконто.Владелец = &Владелец
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Код", КодЗначения);
	Запрос.УстановитьПараметр("Владелец", Классификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат Справочники.Субконто.ПустаяСсылка();

КонецФункции

Функция ПолучитьДетализируемыйКлассификаторПоСсылке(СсылкаНаКлассификатор) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаКлассификатор) Тогда
		Возврат ПланыВидовХарактеристик.АналитикаОтчетов.ПустаяСсылка();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	АналитикаОтчетов.Ссылка КАК Ссылка,
		|	АналитикаОтчетов.Код КАК Код
		|ИЗ
		|	ПланВидовХарактеристик.АналитикаОтчетов КАК АналитикаОтчетовИсходныйКлассификатор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АналитикаОтчетов КАК АналитикаОтчетов
		|		ПО АналитикаОтчетовИсходныйКлассификатор.АналитикаВладелецКод = АналитикаОтчетов.Код
		|			И АналитикаОтчетовИсходныйКлассификатор.АналитикаВладелецПубличныйИдентификатор = АналитикаОтчетов.ПубличныйИдентификатор
		|ГДЕ
		|	АналитикаОтчетовИсходныйКлассификатор.Ссылка = &СсылкаНаКлассификатор
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СсылкаНаКлассификатор", СсылкаНаКлассификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.АналитикаОтчетов.ПустаяСсылка();

КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ИНИЦИАЛИЗАЦИИ УНИВЕРСАЛЬНОГО ОТЧЕТА
//

Функция ЕстьГруппыРаскрытия(ВидОтчета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	ГруппыРаскрытия.Ссылка
		|ИЗ
		|	Справочник.ГруппыРаскрытия КАК ГруппыРаскрытия
		|ГДЕ
		|	ГруппыРаскрытия.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();	
	
КонецФункции

Функция НайтиГруппуРаскрытия(ВидОтчета,КодГруппыРаскрытия) Экспорт
	
	НайденнаяГруппаРаскрытия = Справочники.ГруппыРаскрытия.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ГруппыРаскрытия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыРаскрытия КАК ГруппыРаскрытия
		|ГДЕ
		|	ГруппыРаскрытия.Владелец = &Владелец
		|	И ГруппыРаскрытия.Код = &Код";
	
	Запрос.УстановитьПараметр("Владелец", ВидОтчета);
	Запрос.УстановитьПараметр("Код", КодГруппыРаскрытия);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		НайденнаяГруппаРаскрытия = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат НайденнаяГруппаРаскрытия;	
КонецФункции

// Создает основные внутренние таблицы контекста отчета.
//
Функция ИнициализироватьКонтекстОтчета(Знач РеквизитыОтчета) Экспорт

	Контекст = Новый Структура;
	
	Запрос = Новый Запрос;
	
	ВОтчетеЕстьГруппыРаскрытия = ЕстьГруппыРаскрытия(РеквизитыОтчета.ВидОтчета);
	
	мЧислоДопАналитик = БюджетнаяОтчетность.ЧислоДопАналитик(РеквизитыОтчета.ВидОтчета);
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПоказателейОтчетов.Показатель КАК Показатель,
		|	ЗначенияПоказателейОтчетов.Индекс КАК Индекс,
		|	ЗначенияПоказателейОтчетов.ПромежуточныйИтог,
		|	ЗначенияПоказателейОтчетов.ЗначениеЧисло КАК ЗначениеЧисло,
		|	ЗначенияПоказателейОтчетов.Значение КАК Значение,
		|	ЗначенияПоказателейОтчетов.ЗначениеНеограниченнаяСтрока КАК ЗначениеНеограниченнаяСтрока
		|ПОМЕСТИТЬ ЗначенияПоказателей
		|ИЗ
		|	РегистрСведений.ЗначенияПоказателейОтчетов КАК ЗначенияПоказателейОтчетов
		|ГДЕ
		|	ЗначенияПоказателейОтчетов.ЭкземплярОтчета = &ЭкземплярОтчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Показатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказателиОтчетов.Ссылка КАК Ссылка,
		|	ПоказателиОтчетов.Код,
		|	ПоказателиОтчетов.Наименование,
		|	ПоказателиОтчетов.ВидИтога,
		|	ПоказателиОтчетов.ГруппаРаскрытия,
		|	ЕСТЬNULL(ПоказателиОтчетов.ГруппаРаскрытия.Код, """") КАК КодГруппыРаскрытия,
		|	ПоказателиОтчетов.Колонка КАК Колонка,
		|	ПоказателиОтчетов.Колонка.Наименование КАК НаименованиеКолонки,
		|	ПоказателиОтчетов.НеФинансовый,
		|	ПоказателиОтчетов.ИндивидуальнаяТочность,
		|	ПоказателиОтчетов.УровеньТочностиПоказателя,
		|	ПоказателиОтчетов.СпособОбработки,
		|	ПоказателиОтчетов.Строка КАК Строка,
		|	ПоказателиОтчетов.ТипЗначения,
		|	ВЫБОР
		|		КОГДА &УчитыватьАктуальность
		|			ТОГДА ПоказателиОтчетов.Отключен
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Отключен,
		|	ПоказателиОтчетов.НеМасштабируется,
		|	ЕСТЬNULL(ЗначенияПоказателей.Индекс, 0) КАК Индекс,
		|	ЗначенияПоказателей.Значение КАК Значение,
		|	ЗначенияПоказателей.ЗначениеНеограниченнаяСтрока КАК ЗначениеНеограниченнаяСтрока,
		|	ЗначенияПоказателей.ПромежуточныйИтог,
		|	ПоказателиОтчетов.Колонка.Код КАК КодКолонки,
		|	ПоказателиОтчетов.Строка.Код КАК КодСтрока,
		|	ПоказателиОтчетов.Строка.ПорядковыйНомер КАК ПорядковыйНомерСтроки,
		|	ПоказателиОтчетов.Колонка.ПорядковыйНомер КАК ПорядковыйНомерКолонки,
		|	ПоказателиОтчетов.НеограниченнаяДлина КАК НеограниченнаяДлина,
		|	ПоказателиОтчетов.РазрешитьПромежуточныеИтоги
		|ИЗ
		|	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПоказателей КАК ЗначенияПоказателей
		|		ПО ПоказателиОтчетов.Ссылка = ЗначенияПоказателей.Показатель
		|ГДЕ
		|	ПоказателиОтчетов.Владелец = &ВидОтчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	Индекс";
		
	ТекРег = ?(ЗначениеЗаполнено(РеквизитыОтчета.мДокументОснование), РеквизитыОтчета.мДокументОснование, РеквизитыОтчета.Ссылка);
	
	Запрос.УстановитьПараметр("ЭкземплярОтчета"	, ТекРег);
	Запрос.УстановитьПараметр("ВидОтчета"		, РеквизитыОтчета.ВидОтчета);
	Запрос.УстановитьПараметр("УчитыватьАктуальность", 
		БюджетнаяОтчетность.РедакцияБланкаАктуальна(РеквизитыОтчета.ВидОтчета, РеквизитыОтчета.ШаблонОтчета));
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ИменаПолейДляИсключения = ",Показатель,Индекс,ВидАналитики,ЗначениеАналитики,НомерАналитики,ПромежуточныйИтог,ЗначениеЧисло,ЗначениеНеограниченнаяСтрока,";
	
	мПоказатели			 = Новый ТаблицаЗначений;
	ОписаниеТиповРесурсаЗначение = Метаданные.РегистрыСведений.ЗначенияПоказателейОтчетов.Ресурсы.Значение.Тип;
	ОписаниеТиповРесурсаЗначение = Новый ОписаниеТипов(ОписаниеТиповРесурсаЗначение,,,,Новый КвалификаторыСтроки);

	Для Каждого КолонкаЗапроса Из Результат.Колонки Цикл
		Если Найти(ИменаПолейДляИсключения, ","+КолонкаЗапроса.Имя+",") = 0 Тогда
			ТипКолонки = КолонкаЗапроса.ТипЗначения;
			Если КолонкаЗапроса.Имя = "Значение" Тогда
				мПоказатели.Колонки.Добавить(КолонкаЗапроса.Имя,ОписаниеТиповРесурсаЗначение);
			ИначеЕсли ТипКолонки.СодержитТип(Тип("Строка")) и ТипКолонки.КвалификаторыСтроки.ДопустимаяДлина = ДопустимаяДлина.Фиксированная Тогда
				ТипКолонки = БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(ТипКолонки.КвалификаторыСтроки.Длина);
				мПоказатели.Колонки.Добавить(КолонкаЗапроса.Имя,ТипКолонки);
			Иначе
				мПоказатели.Колонки.Добавить(КолонкаЗапроса.Имя,ТипКолонки);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
		
	мПоказателиРаскрытия = Новый ТаблицаЗначений;
			
	мПоказателиРаскрытия.Колонки.Добавить("Показатель"		 ,БюджетнаяОтчетность.ПолучитьОписаниеТиповПоТипуЗначения(Справочники.ПоказателиОтчетов.ПустаяСсылка()));
	мПоказателиРаскрытия.Колонки.Добавить("Индекс"			 ,БюджетнаяОтчетность.ПолучитьОписаниеТиповЧисла(7));
	мПоказателиРаскрытия.Колонки.Добавить("Значение"		 ,ОписаниеТиповРесурсаЗначение);
	мПоказателиРаскрытия.Колонки.Добавить("ПромежуточныйИтог",БюджетнаяОтчетность.ПолучитьОписаниеТиповБулево());
	мПоказателиРаскрытия.Колонки.Добавить("ГруппаРаскрытия",  Новый ОписаниеТипов("СправочникСсылка.ГруппыРаскрытия"));
	
	ТипАналитики = Метаданные.ПланыВидовХарактеристик.АналитикаОтчетов.Тип;
	
	Для Сч = 1 По мЧислоДопАналитик Цикл
		мПоказателиРаскрытия.Колонки.Добавить("Аналитика"+Сч, ТипАналитики);
	КонецЦикла;
	
	СоответствиеПустойТип = Новый Соответствие;
	СоответствиеПустойТип.Вставить(Перечисления.ТипыЗначенийПоказателейОтчетов.Число, 0);
	СоответствиеПустойТип.Вставить(Перечисления.ТипыЗначенийПоказателейОтчетов.Строка, "");
	СоответствиеПустойТип.Вставить(Перечисления.ТипыЗначенийПоказателейОтчетов.Дата, '00010101000000');
	СоответствиеПустойТип.Вставить(Перечисления.ТипыЗначенийПоказателейОтчетов.Булево, Ложь);
	
	// Обход основного запроса и формирование таблиц раскрытия и итогов показателей
	РежимОбхода = ?(мЧислоДопАналитик = 0,ОбходРезультатаЗапроса.Прямой,ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Выборка = Результат.Выбрать(РежимОбхода);
	
	Пока Выборка.Следующий() Цикл		
				
		Если Выборка.Индекс = 0 Тогда
			
			СтрокаПоказатель = мПоказатели.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаПоказатель,Выборка,,"Значение");
			Если ЗначениеЗаполнено(Выборка.Значение) Тогда
				Если Выборка.НеограниченнаяДлина Тогда
					СтрокаПоказатель.Значение = Выборка.ЗначениеНеограниченнаяСтрока;
				Иначе
					СтрокаПоказатель.Значение = Выборка.Значение;
				КонецЕсли;
			Иначе
				СтрокаПоказатель.Значение = СоответствиеПустойТип[Выборка.ТипЗначения];
			КонецЕсли;
			
			СтрокаПоказатель.Код = СокрП(СтрокаПоказатель.Код);
			СтрокаПоказатель.КодГруппыРаскрытия = СокрП(СтрокаПоказатель.КодГруппыРаскрытия);
			СтрокаПоказатель.КодСтрока			= СокрП(СтрокаПоказатель.КодСтрока);
			СтрокаПоказатель.КодКолонки			= СокрП(СтрокаПоказатель.КодКолонки);
			
			СтрокаПоказатель.Отключен = Выборка.Отключен и Выборка.Значение = Null;
			
		Иначе
			
			СтрокаАналитика = мПоказателиРаскрытия.Добавить();
			СтрокаАналитика.Показатель  = Выборка.Ссылка;
			СтрокаАналитика.Индекс		= Выборка.Индекс;
			СтрокаАналитика.Значение	= ?(Выборка.НеограниченнаяДлина,Выборка.ЗначениеНеограниченнаяСтрока,Выборка.Значение);
			СтрокаАналитика.ПромежуточныйИтог = Выборка.ПромежуточныйИтог;
			СтрокаАналитика.ГруппаРаскрытия = Выборка.ГруппаРаскрытия;
		КонецЕсли;
					
	КонецЦикла;
	
	НовИндекс = мПоказателиРаскрытия.Индексы.Добавить("ГруппаРаскрытия,Индекс");
	
	Если мЧислоДопАналитик > 0 Тогда
		ВыборкаАналитика = ПолучитьВыборкуАналитики(ТекРег);
		ТекГруппа = Неопределено;
		ТекИндекс = Неопределено;
		
		СтруктураЗначений = Новый Структура;
		Первый = Истина;
		Пока ВыборкаАналитика.Следующий() Цикл
			
			Если Первый Тогда
				ТекГруппа = ВыборкаАналитика.ГруппаРаскрытия;
				ТекИндекс = ВыборкаАналитика.Индекс;
				Первый = Ложь;
			КонецЕсли;
			
			Если ТекГруппа <> ВыборкаАналитика.ГруппаРаскрытия
				ИЛИ ТекИндекс <> ВыборкаАналитика.Индекс Тогда
				СтруктураПоиска = Новый Структура("ГруппаРаскрытия,Индекс",ТекГруппа,ТекИндекс);
				МассивСтрок = мПоказателиРаскрытия.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого СтрТЧ Из МассивСтрок Цикл
					ЗаполнитьЗначенияСвойств(СтрТЧ,СтруктураЗначений);
				КонецЦикла;
				
				СтруктураЗначений = Новый Структура;
			КонецЕсли;	
			
			
			ТекущийТип = ВыборкаАналитика.ВидАналитики.ТипЗначения;
			ТекущееЗначение = ТекущийТип.ПривестиЗначение(ВыборкаАналитика.ЗначениеАналитики);
			
			СтруктураЗначений.Вставить("Аналитика"+ВыборкаАналитика.НомерАналитики,ТекущееЗначение);
			
			ТекГруппа = ВыборкаАналитика.ГруппаРаскрытия;
			ТекИндекс = ВыборкаАналитика.Индекс;
		КонецЦикла;
		
		Если ТекГруппа <> Неопределено Тогда
			СтруктураПоиска = Новый Структура("ГруппаРаскрытия,Индекс",ТекГруппа,ТекИндекс);
			МассивСтрок = мПоказателиРаскрытия.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого СтрТЧ Из МассивСтрок Цикл
				ЗаполнитьЗначенияСвойств(СтрТЧ,СтруктураЗначений);
			КонецЦикла;
		КонецЕсли;		
		
	КонецЕсли;
	
	мПоказателиРаскрытия.Индексы.Удалить(НовИндекс);
	
	мПоказатели.Колонки.Добавить("ДанныеРасчета",Новый ОписаниеТипов("Структура"));
	мПоказатели.Колонки.Добавить("СохраненныеДанныеАктуальны",Новый ОписаниеТипов("Булево"));
	
	мПоказатели.ЗаполнитьЗначения(Истина,"СохраненныеДанныеАктуальны");
	мПоказатели.Индексы.Добавить("Код");
	мПоказатели.Индексы.Добавить("Ссылка");
	
	мПоказателиРаскрытия.Индексы.Добавить("Показатель");
	
	// ДополнительныеРеквизиты
	Запрос=Новый Запрос;
	Запрос.Текст=	
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыОтчетов.Код,
	|	ДополнительныеРеквизитыОтчетов.Наименование,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики,
	|	ДополнительныеРеквизитыОтчетов.Обязательный,
	|	ДополнительныеРеквизитыОтчетов.Ссылка КАК ДополнительныйРеквизит,
	|	ДополнительныеРеквизитыОтчетов.ПорядковыйНомер КАК ПорядковыйНомер,
	|	ЗначенияРеквизитов.Значение,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики.ТипЗначения КАК ТипЗначения,
	|	ДополнительныеРеквизитыОтчетов.ВидАналитики.ВидКлассификатораБК КАК ВидКлассификатораБК
	|ИЗ
	|	Справочник.ДополнительныеРеквизитыОтчетов КАК ДополнительныеРеквизитыОтчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗначенияДополнительныхРеквизитовОтчета.ВидАналитики КАК ВидАналитики,
	|			ЗначенияДополнительныхРеквизитовОтчета.Значение КАК Значение
	|		ИЗ
	|			РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
	|		ГДЕ
	|			ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета = &ЭкземплярОтчета) КАК ЗначенияРеквизитов
	|		ПО ДополнительныеРеквизитыОтчетов.ВидАналитики = ЗначенияРеквизитов.ВидАналитики
	|ГДЕ
	|	ДополнительныеРеквизитыОтчетов.Владелец = &ВидОтчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядковыйНомер";
	
	Запрос.УстановитьПараметр("ВидОтчета", РеквизитыОтчета.ВидОтчета);
	Запрос.УстановитьПараметр("ЭкземплярОтчета", ТекРег);
	
	мДополнительныеРеквизиты = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	// обрезаем коды.
	мДополнительныеРеквизиты.Колонки.Код.Имя = "Имя";
	мДополнительныеРеквизиты.Колонки.Добавить("Код",БюджетнаяОтчетность.ПолучитьОписаниеТиповСтроки(20));
	
	Для Каждого Стр Из мДополнительныеРеквизиты Цикл
		
		Стр.Код = СокрЛП(Стр.Имя);
		
		Если Стр.Значение = Неопределено ИЛИ Стр.Значение = Null 
			 ИЛИ (Не ЗначениеЗаполнено(Стр.Значение) И ТипЗнч(Стр.Значение) <> Стр.ВидАналитики.ТипЗначения.Типы()[0]) Тогда
			Стр.Значение = БюджетнаяОтчетность.ПустоеЗначениеТипа(Стр.ВидАналитики.ТипЗначения.Типы()[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	мДополнительныеРеквизиты.Колонки.Удалить(мДополнительныеРеквизиты.Колонки.Имя);
	мДополнительныеРеквизиты.Индексы.Добавить("Код");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БланкиОтчетов.ПараметрыНастройкиБланка
	|ИЗ
	|	Справочник.БланкиОтчетов КАК БланкиОтчетов
	|ГДЕ
	|	БланкиОтчетов.Ссылка = &ШаблонОтчета";
	
	Запрос.УстановитьПараметр("ШаблонОтчета", РеквизитыОтчета.ШаблонОтчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		мНастройкиБланка = Выборка.ПараметрыНастройкиБланка;
	Иначе
		мНастройкиБланка = Неопределено;
	КонецЕсли;
	
	Контекст = Новый Структура;
	Контекст.Вставить("мПоказатели",мПоказатели);
	Контекст.Вставить("мПоказателиРаскрытия",мПоказателиРаскрытия);
	Контекст.Вставить("мДополнительныеРеквизиты",мДополнительныеРеквизиты);
	Контекст.Вставить("мЧислоДопАналитик",мЧислоДопАналитик);
	Контекст.Вставить("мНастройкиБланка",мНастройкиБланка);
	
	Возврат Контекст;

КонецФункции // ИнициализироватьКонтекст()

Функция ПолучитьВыборкуАналитики(ЭкземплярОтчета)
	ЗапросКАналитике = Новый Запрос("ВЫБРАТЬ
	                                |	АналитикаПоказателей.ВидАналитики КАК ВидАналитики,
	                                |	АналитикаПоказателей.ГруппаРаскрытия КАК ГруппаРаскрытия,
	                                |	АналитикаПоказателей.Индекс КАК Индекс,
	                                |	ГруппыРаскрытияАналитика.НомерСтроки КАК НомерАналитики,
	                                |	АналитикаПоказателей.Значение КАК ЗначениеАналитики,
	                                |	АналитикаПоказателей.ЭкземплярОтчета КАК ЭкземплярОтчета
	                                |ИЗ
	                                |	РегистрСведений.АналитикаПоказателей КАК АналитикаПоказателей
	                                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыРаскрытия.Аналитика КАК ГруппыРаскрытияАналитика
	                                |		ПО АналитикаПоказателей.ГруппаРаскрытия = ГруппыРаскрытияАналитика.Ссылка
	                                |			И АналитикаПоказателей.ВидАналитики = ГруппыРаскрытияАналитика.ВидАналитики
	                                |ГДЕ
	                                |	АналитикаПоказателей.ЭкземплярОтчета = &ЭкземплярОтчета
	                                |
	                                |УПОРЯДОЧИТЬ ПО
	                                |	ГруппаРаскрытия,
	                                |	Индекс");
									
	ЗапросКАналитике.УстановитьПараметр("ЭкземплярОтчета",ЭкземплярОтчета);
	Результат = ЗапросКАналитике.Выполнить();
	
	ВыборкаАналитика = Результат.Выбрать();
	ЗапросКАналитике = Неопределено;
	Результат = Неопределено;	
	
	Возврат ВыборкаАналитика;
КонецФункции

//////////////////////////////////////////////////////////////////////////
// РЕДАКТИРОВАНИЕ ОТЧЕТА В УПРАВЛЯЕМОМ РЕЖИМЕ


// Процедуры работы с согласованными аналитиками

Функция КоллекцияАналитикГруппыРаскрытия(ГруппаРаскрытия) Экспорт

	Возврат БюджетнаяОтчетностьСерверПовтИсп.КоллекцияАналитикГруппыРаскрытия(ГруппаРаскрытия);

КонецФункции // КоллекцияАналитикГруппыРаскрытия()

Функция ПодменитьСценарийДляВидыДоходовКДБ(Знач ИсточникАналитики, Знач АналитикаГруппыРаскрытия, Знач ПозицияТекущегоТипа, Знач ДеревоСвязейАналитики, ВидАналитикиСценария,Сдвиг)
	
	Если ПозицияТекущегоТипа - Сдвиг < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияТекущегоТипа > (АналитикаГруппыРаскрытия.Количество() - 1) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	СтрокаАналитики = АналитикаГруппыРаскрытия[ПозицияТекущегоТипа-Сдвиг];
	ТекОписаниеТипов = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаАналитики.ВидАналитики);
	
	Если ТекОписаниеТипов.СодержитТип(Тип("СправочникСсылка.ВидыДоходовКДБ")) Тогда
				 
		НайденныйСценарий = ПодобратьСценарийВводаАналитики(ИсточникАналитики, 
			АналитикаГруппыРаскрытия[ПозицияТекущегоТипа-Сдвиг].ВидАналитики,
			ДеревоСвязейАналитики);
		Если НайденныйСценарий <> Неопределено Тогда
			ВидАналитикиСценария = АналитикаГруппыРаскрытия[ПозицияТекущегоТипа-Сдвиг].ВидАналитики;
		КонецЕсли;
		Возврат НайденныйСценарий;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПодменитьСценарийДляВидыДоходовКИФ(Знач ИсточникАналитики, Знач АналитикаГруппыРаскрытия, Знач ПозицияТекущегоТипа, Знач ДеревоСвязейАналитики, ВидАналитикиСценария,Сдвиг)
	
	Если ПозицияТекущегоТипа - Сдвиг < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозицияТекущегоТипа > (АналитикаГруппыРаскрытия.Количество() - 1) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	СтрокаАналитики = АналитикаГруппыРаскрытия[ПозицияТекущегоТипа-Сдвиг];
	ТекОписаниеТипов = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаАналитики.ВидАналитики);
	
	Если ТекОписаниеТипов.СодержитТип(Тип("СправочникСсылка.ГруппыПодгруппыКИФ")) Тогда
				 
		НайденныйСценарий = ПодобратьСценарийВводаАналитики(ИсточникАналитики, 
			АналитикаГруппыРаскрытия[ПозицияТекущегоТипа-Сдвиг].ВидАналитики,
			ДеревоСвязейАналитики);
		Если НайденныйСценарий <> Неопределено Тогда
			ВидАналитикиСценария = АналитикаГруппыРаскрытия[ПозицияТекущегоТипа-Сдвиг].ВидАналитики;
		КонецЕсли;
		Возврат НайденныйСценарий;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ПодобратьСценарийВводаАналитики(Знач ИсточникАналитики, Знач ВидАналитики, Знач ДеревоСвязейАналитики = Неопределено,ИспользуемыйВидАналитики = Неопределено) Экспорт

	Если ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ГруппыРаскрытия") Тогда
		АналитикаГруппыРаскрытия = КоллекцияАналитикГруппыРаскрытия(ИсточникАналитики);
	ИначеЕсли ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
		АналитикаГруппыРаскрытия = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикУровняОтчета(ИсточникАналитики);
	Иначе // Таблица значений
		АналитикаГруппыРаскрытия = ИсточникАналитики;
	КонецЕсли;
	
	Если ДеревоСвязейАналитики = Неопределено Тогда
		ДеревоСвязейАналитики = БюджетнаяОтчетность.ПараметрыВыбораСогласованныхАналитик(АналитикаГруппыРаскрытия);
	КонецЕсли;
	
	СтрАналитики          = АналитикаГруппыРаскрытия.Найти(ВидАналитики,"ВидАналитики");
	РеквизитыАналитики = Новый Структура("ТипЗначения,ВидКлассификатораБК",СтрАналитики.ТипЗначения,СтрАналитики.ВидКлассификатораБК);
	ТипТекущегоЗначения = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрАналитики.ВидАналитики, РеквизитыАналитики).Типы()[0];
		
	// Поиск позиции текущего типа в группе раскрытия.
	
	ПозицияТекущегоТипа = ПозицияВидаАналитики(АналитикаГруппыРаскрытия, ВидАналитики);
	
	Если ТипТекущегоЗначения = Тип("СправочникСсылка.КОСГУ")  Тогда
		НовыйСценарий = ПодменитьСценарийДляВидыДоходовКДБ(ИсточникАналитики, АналитикаГруппыРаскрытия, ПозицияТекущегоТипа,ДеревоСвязейАналитики,ИспользуемыйВидАналитики,2);
		Если НовыйСценарий <> Неопределено Тогда			
			Возврат НовыйСценарий;
		КонецЕсли;
		
		НовыйСценарий = ПодменитьСценарийДляВидыДоходовКИФ(ИсточникАналитики, АналитикаГруппыРаскрытия, ПозицияТекущегоТипа,ДеревоСвязейАналитики,ИспользуемыйВидАналитики,3);
		Если НовыйСценарий <> Неопределено Тогда			
			Возврат НовыйСценарий;
		КонецЕсли;
		
	ИначеЕсли ТипТекущегоЗначения = Тип("СправочникСсылка.ГруппыПодвидовКДБ")  Тогда
		НовыйСценарий = ПодменитьСценарийДляВидыДоходовКДБ(ИсточникАналитики, АналитикаГруппыРаскрытия, ПозицияТекущегоТипа,ДеревоСвязейАналитики,ИспользуемыйВидАналитики,1);
		Если НовыйСценарий <> Неопределено Тогда			
			Возврат НовыйСценарий;
		КонецЕсли;
		
	ИначеЕсли ТипТекущегоЗначения = Тип("СправочникСсылка.СтатьиКИФ")  Тогда
		НовыйСценарий = ПодменитьСценарийДляВидыДоходовКИФ(ИсточникАналитики, АналитикаГруппыРаскрытия, ПозицияТекущегоТипа,ДеревоСвязейАналитики,ИспользуемыйВидАналитики,1);
		Если НовыйСценарий <> Неопределено Тогда			
			Возврат НовыйСценарий;
		КонецЕсли;
	ИначеЕсли ТипТекущегоЗначения = Тип("СправочникСсылка.ВидыКИФ")  Тогда
		НовыйСценарий = ПодменитьСценарийДляВидыДоходовКИФ(ИсточникАналитики, АналитикаГруппыРаскрытия, ПозицияТекущегоТипа,ДеревоСвязейАналитики,ИспользуемыйВидАналитики,2);
		Если НовыйСценарий <> Неопределено Тогда			
			Возврат НовыйСценарий;
		КонецЕсли;
	КонецЕсли;
	
	// Поиск наиболее подходящего куста дерева типов.
	Если ПозицияТекущегоТипа < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Если ТипТекущегоЗначения = Тип("СправочникСсылка.Субконто") Тогда
		//возможно это выбор связанных аналитик
		ВозможныеСценарииВыбора  = ДеревоСвязейАналитики.Строки.НайтиСтроки(Новый Структура("ТипДанных,ВидАналитики",ТипТекущегоЗначения,ВидАналитики),Истина);
	Иначе
		ВозможныеСценарииВыбора  = ДеревоСвязейАналитики.Строки.НайтиСтроки(Новый Структура("ТипДанных",ТипТекущегоЗначения),Истина);
	КонецЕсли;
	
	СчетчикиСовпадений = Новый Соответствие;
	МаксимумСовпадений = 0;
	
	Для Каждого СценарийВыбора Из ВозможныеСценарииВыбора Цикл
		ЧислоСовпадений = СценарийВыбораМожетИспользоватьсяВДаннойГруппе(СценарийВыбора,АналитикаГруппыРаскрытия,ПозицияТекущегоТипа);
		Если ЧислоСовпадений > 0 Тогда
			МаксимумСовпадений = Макс(МаксимумСовпадений,ЧислоСовпадений);
			СчетчикиСовпадений.Вставить(ЧислоСовпадений,СценарийВыбора);
		КонецЕсли;
	КонецЦикла;
	
	ПрименяемыйСценарийВыбора = СчетчикиСовпадений[МаксимумСовпадений];
	
	Возврат ПрименяемыйСценарийВыбора;
	
КонецФункции // ВыбратьСценарийВводаАналитики()

Функция ПозицияВидаАналитики(Знач ИсточникАналитики, Знач ВидАналитики)

	Если ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ГруппыРаскрытия") Тогда
		АналитикаГруппыРаскрытия = КоллекцияАналитикГруппыРаскрытия(ИсточникАналитики);
	ИначеЕсли ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
		АналитикаГруппыРаскрытия = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикУровняОтчета(ИсточникАналитики);
	Иначе // Таблица значений
		АналитикаГруппыРаскрытия = ИсточникАналитики;
	КонецЕсли;
	
	СтрАналитики = АналитикаГруппыРаскрытия.Найти(ВидАналитики,"ВидАналитики");
	Если СтрАналитики = Неопределено Тогда
		Возврат -1
	Иначе
		Возврат АналитикаГруппыРаскрытия.Индекс(СтрАналитики);
	КонецЕсли;

КонецФункции // ПозицияВидаАналитики()

Функция СценарийВыбораМожетИспользоватьсяВДаннойГруппе(СценарийВыбора, АналитикаГруппыРаскрытия, ПозицияТекущегоТипа)
 
	Если ПозицияТекущегоТипа = -1 Тогда
		Возврат 0;
	КонецЕсли;

	СчетчикСовпадений = 0;
	
	ЭтоВыборСвязанныхАналитик = ЗначениеЗаполнено(СценарийВыбора.ВидАналитики);
	
	Если ЭтоВыборСвязанныхАналитик Тогда
		//Т.к. сценарии связанных аналитик дополняются для текущей группы раскрытия, 
		//то сценарий уже МОЖЕТ использоваться в данной группе.
		//Нужно только добавить приоритет, т.к. одна аналитики может быть одновременно и главной и детальной у разных аналитик:
		//Если это детальная аналитика, то у нее приоритет выше - 2
		//Если это главная аналитика, то у нее приоритет ниже - 1

		
		Если СценарийВыбора.Родитель = Неопределено Тогда
			СчетчикСовпадений = 1;
		Иначе
			СчетчикСовпадений = 2;
		КонецЕсли;	
				
	Иначе
		//обычный сценарий выбора
		// Поиск вверх.
		ТекущаяСтрокаТипа = СценарийВыбора;
		Индекс			  = ПозицияТекущегоТипа;
		
		Пока ТекущаяСтрокаТипа <> Неопределено Цикл
			Если Индекс >= 0 и ТекущаяСтрокаТипа <> СценарийВыбора Тогда
				РеквизитыАналитики = Новый Структура("ТипЗначения,ВидКлассификатораБК",АналитикаГруппыРаскрытия[Индекс].ТипЗначения,АналитикаГруппыРаскрытия[Индекс].ВидКлассификатораБК);
				ОписаниеТиповАналитики = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(АналитикаГруппыРаскрытия[Индекс].ВидАналитики, РеквизитыАналитики);
				Если ОписаниеТиповАналитики.СодержитТип(ТекущаяСтрокаТипа.ТипДанных) Тогда
					СчетчикСовпадений = СчетчикСовпадений + 1;
				КонецЕсли;
			КонецЕсли;
			
			ТекущаяСтрокаТипа = ТекущаяСтрокаТипа.Родитель;
			Индекс = Индекс - 1;
			
		КонецЦикла;
		
		// Поиск вниз.
		ТекущаяСтрокаТипа = СценарийВыбора;
		Индекс			  = ПозицияТекущегоТипа;
		Пока Истина Цикл
			Если Индекс < АналитикаГруппыРаскрытия.Количество() и ТекущаяСтрокаТипа <> СценарийВыбора Тогда
				РеквизитыАналитики = Новый Структура("ТипЗначения,ВидКлассификатораБК",АналитикаГруппыРаскрытия[Индекс].ТипЗначения,АналитикаГруппыРаскрытия[Индекс].ВидКлассификатораБК);
				ОписаниеТиповАналитики = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(АналитикаГруппыРаскрытия[Индекс].ВидАналитики, РеквизитыАналитики);
				Если ОписаниеТиповАналитики.СодержитТип(ТекущаяСтрокаТипа.ТипДанных) Тогда
					СчетчикСовпадений = СчетчикСовпадений + 1;
				КонецЕсли;
			КонецЕсли;
			
			Если ТекущаяСтрокаТипа.Строки.Количество() Тогда
				ТекущаяСтрокаТипа = ТекущаяСтрокаТипа.Строки[0];
				Индекс = Индекс + 1;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат СчетчикСовпадений;
	
КонецФункции // СценарийВыбораМожетИспользоватьсяВДаннойГруппе()

// После выбора значения тип выбранного значения может отличаться от первоначального.
// Процедура обрабатывает данную ситуацию и возвращает новый сценарий выбора.
//
Функция ИзменитьСценарийПослеВыбораЗначения(Знач ПрименяемыйСценарий, Знач ИсточникАналитики, Знач ВидАналитики, Знач ВыбранноеЗначение) Экспорт

	Перем КореньДерева;
	
	Если ПрименяемыйСценарий.ТипДанных = ТипЗнч(ВыбранноеЗначение) Тогда
		Возврат Новый Структура("ПрименяемыйСценарий,ВидАналитики",ПрименяемыйСценарий,ВидАналитики);
	КонецЕсли;
	
	ТекСтрока = ПрименяемыйСценарий;
	Пока Истина Цикл
		Если ТекСтрока.Родитель = Неопределено Тогда
			КореньДерева = ТекСтрока;
			Прервать;
		Иначе
			ТекСтрока = ТекСтрока.Родитель;
		КонецЕсли;
	КонецЦикла;

	НовыйСценарий = КореньДерева.Строки.Найти(ТипЗнч(ВыбранноеЗначение),"ТипДанных",Истина);
	Если НовыйСценарий = ПрименяемыйСценарий Тогда
		Возврат Новый Структура("ПрименяемыйСценарий,ВидАналитики",ПрименяемыйСценарий,ВидАналитики);
	ИначеЕсли Не НовыйСценарий = Неопределено Тогда
		
		Если ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ГруппыРаскрытия") Тогда
			КоллекцияАналитик = КоллекцияАналитикГруппыРаскрытия(ИсточникАналитики);
		ИначеЕсли ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
			КоллекцияАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикУровняОтчета(ИсточникАналитики);
		Иначе // Таблица значений
			КоллекцияАналитик = ИсточникАналитики;
		КонецЕсли;
		
		ТекущийУровень         = ПрименяемыйСценарий.Уровень();
		НовыйУровень           = НовыйСценарий.Уровень();
		ПозицияВСпискеАналитик = ПозицияВидаАналитики(ИсточникАналитики, ВидАналитики);
		ИскомыйИндекс          = ПозицияВСпискеАналитик+НовыйУровень-ТекущийУровень;
		
		Если ИскомыйИндекс > 0 и ИскомыйИндекс < КоллекцияАналитик.Количество() Тогда
			СтрокаНовойАналитики = КоллекцияАналитик[ИскомыйИндекс];
			
			РеквизитыАналитики = Новый Структура("ТипЗначения,ВидКлассификатораБК",СтрокаНовойАналитики.ТипЗначения,СтрокаНовойАналитики.ВидКлассификатораБК);
			ОписаниеТиповАналитики = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаНовойАналитики.ВидАналитики, РеквизитыАналитики);
			Если ОписаниеТиповАналитики.СодержитТип(ТипЗнч(ВыбранноеЗначение)) Тогда
				Возврат Новый Структура("ПрименяемыйСценарий,ВидАналитики",НовыйСценарий,СтрокаНовойАналитики.ВидАналитики);
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ИзменитьСценарийПослеВыбораЗначения()

// При использовании сценария ввода начальное поле значения может отличаться от выбранного.
//  Функция позволяет получить новые значения связанных элементов.
//
Функция ЗначенияОбработкиВыбораПоСценариюВвода(Знач ИсточникАналитики, Знач ПредыдущийВидАналитики, Знач ВыбранноеЗначение,СообщатьОПроблеме = Истина) Экспорт

	Если ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ГруппыРаскрытия") Тогда
		КоллекцияАналитик = КоллекцияАналитикГруппыРаскрытия(ИсточникАналитики);
	ИначеЕсли ТипЗнч(ИсточникАналитики) = Тип("СправочникСсылка.ВидыОтчетов") Тогда
		КоллекцияАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикУровняОтчета(ИсточникАналитики);
	Иначе // Таблица значений
		КоллекцияАналитик = ИсточникАналитики;
	КонецЕсли;
	
	СтрАналитики          = КоллекцияАналитик.Найти(ПредыдущийВидАналитики,"ВидАналитики");
	ПредыдущийТипЗначения = СтрАналитики.ТипЗначения.Типы()[0];
	
	ИспользуемыйВидАналитики = Неопределено;
	
	ПредыдущийСценарий = ПодобратьСценарийВводаАналитики(ИсточникАналитики, ПредыдущийВидАналитики,,ИспользуемыйВидАналитики);
	
	Если ЗначениеЗаполнено(ИспользуемыйВидАналитики) Тогда
		СтрАналитики          = КоллекцияАналитик.Найти(ИспользуемыйВидАналитики,"ВидАналитики");
		ПредыдущийТипЗначения = СтрАналитики.ТипЗначения.Типы()[0];
		ПредыдущийВидАналитики = ИспользуемыйВидАналитики;
	КонецЕсли;
	
	Если ПредыдущийСценарий = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выбранное значение не может быть использовано в данном отчете.'"));
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Если ВыбранноеЗначение.Свойство("ГруппаПодгруппаКИФ") Тогда
			//для выбора значения из полного классификатора КИФ
			РабочееЗначение = ВыбранноеЗначение.ГруппаПодгруппаКИФ;
		Иначе
			РабочееЗначение = ВыбранноеЗначение.Ссылка;
		КонецЕсли;
	Иначе
		РабочееЗначение = ВыбранноеЗначение;
	КонецЕсли;
	ПараметрыНовогоСценария = ИзменитьСценарийПослеВыбораЗначения(ПредыдущийСценарий, ИсточникАналитики, ПредыдущийВидАналитики, РабочееЗначение);
	
	Если Не ПараметрыНовогоСценария = Неопределено Тогда
		ПрименяемыйСценарий = ПараметрыНовогоСценария.ПрименяемыйСценарий;
		НовыйВидАналитики   = ПараметрыНовогоСценария.ВидАналитики;
	Иначе
		Если СообщатьОПроблеме = Истина Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Выбранное значение не может быть использовано в данном отчете.'"));
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;

	ИзмененныеЗначенияАналитик = Новый Структура;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ПоляИзменяемыхЗначений = ЗначенияОбработкиВыбораИзСтруктуры(ПрименяемыйСценарий, ВыбранноеЗначение);
	Иначе
		ПоляИзменяемыхЗначений = ЗначенияОбработкиВыбораИзЗапроса(ПрименяемыйСценарий, ВыбранноеЗначение);
		Если ПоляИзменяемыхЗначений = Неопределено Тогда
			ПоляИзменяемыхЗначений = ЗначенияОбработкиВыбораИзСтруктуры(ПрименяемыйСценарий, Новый Структура("Ссылка",ВыбранноеЗначение));
		КонецЕсли;
	КонецЕсли;
	
	Если ПоляИзменяемыхЗначений = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПозицияТекущегоТипа = ПозицияВидаАналитики(ИсточникАналитики, НовыйВидАналитики);
	
	// Поиск наиболее подходящего куста дерева типов.
	Если ПозицияТекущегоТипа < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаАналитики = КоллекцияАналитик[ПозицияТекущегоТипа];
	
	ИзмененныеЗначенияАналитик.Вставить(СтрокаАналитики.КодВидаАналитики, РабочееЗначение);
	
	Если ЗначениеЗаполнено(ПрименяемыйСценарий.ВидАналитики) Тогда
		//Это выбор связанных аналитик
		Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
			И ВыбранноеЗначение.Свойство("СоответствиеВыбранныхЗначений")
			И ТипЗнч(ВыбранноеЗначение.СоответствиеВыбранныхЗначений) = Тип("Соответствие") Тогда
			//СоответствиеВыбранныхЗначений - соответствие, где ключ - вид аналитики, а значение - значение этого вида аналитики
			
			Для Каждого КлючИЗначениеВыбранныхАналитик Из ВыбранноеЗначение.СоответствиеВыбранныхЗначений Цикл
				ТекСтрАналитики = КоллекцияАналитик.Найти(КлючИЗначениеВыбранныхАналитик.Ключ,"ВидАналитики");
				Если ТекСтрАналитики<>Неопределено Тогда
					ИзмененныеЗначенияАналитик.Вставить(ТекСтрАналитики.КодВидаАналитики,КлючИЗначениеВыбранныхАналитик.Значение);
				КонецЕсли;
			КонецЦикла;
					
		КонецЕсли;
		
	Иначе
		СчетчикИмен = 1;
		Для Каждого СтрСвязь Из ПрименяемыйСценарий.СвязиВыбора Цикл
			Индекс = ПозицияТекущегоТипа+СтрСвязь.Смещение;
			Если Индекс >= 0 и Индекс < КоллекцияАналитик.Количество() Тогда
				СтрокаАналитики = КоллекцияАналитик[Индекс];
				
				РеквизитыАналитики = Новый Структура("ТипЗначения,ВидКлассификатораБК",СтрокаАналитики.ТипЗначения,СтрокаАналитики.ВидКлассификатораБК);
				ОписаниеТиповАналитики = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрокаАналитики.ВидАналитики, РеквизитыАналитики);
				Если ОписаниеТиповАналитики.СодержитТип(СтрСвязь.ТребуемыйТип) Тогда
					
					НовоеЗначение = ПоляИзменяемыхЗначений["Поле"+СчетчикИмен];
					
					Если СтрСвязь.РежимИзменения = 0 // Заменять всегда
						или (СтрСвязь.РежимИзменения = 2 и ЗначениеЗаполнено(НовоеЗначение)) Тогда // Заменять только на непустое значение
						
						ИзмененныеЗначенияАналитик.Вставить(СтрокаАналитики.КодВидаАналитики, ?(ЗначениеЗаполнено(СтрокаАналитики.ВидКлассификатораБК), СокрЛП(НовоеЗначение), НовоеЗначение));
						
					КонецЕсли;
					
				КонецЕсли;
				СчетчикИмен = СчетчикИмен + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ИзмененныеЗначенияАналитик;
	
КонецФункции // ЗначенияОбработкиВыбораПоСценариюВвода()

Функция ЗначенияОбработкиВыбораИзСтруктуры(Знач ПрименяемыйСценарий, Знач ВыбранноеЗначение)
	
	СчетчикИмен = 1;
	ИзмененныеЗначенияАналитик = Новый Структура;
	
	Для Каждого СтрСвязь Из ПрименяемыйСценарий.СвязиВыбора Цикл
		
		Если ЗначениеЗаполнено(СтрСвязь.ПолеСсылки) и ВыбранноеЗначение.Свойство(СтрСвязь.ПолеСсылки) Тогда
			Ключ = СтрСвязь.ПолеСсылки;
			ИзмененныеЗначенияАналитик.Вставить("Поле"+СчетчикИмен, ВыбранноеЗначение[Ключ]);
		Иначе
			ИзмененныеЗначенияАналитик.Вставить("Поле"+СчетчикИмен, "");
		КонецЕсли;
		
		СчетчикИмен = СчетчикИмен + 1;
		
	КонецЦикла;
	
	Возврат ИзмененныеЗначенияАналитик;
	
КонецФункции

Функция ЗначенияОбработкиВыбораИзЗапроса(Знач ПрименяемыйСценарий, Знач ВыбранноеЗначение)
	
	ТипВыбранногоЗначения = ТипЗнч(ВыбранноеЗначение);
	ИмяТаблицы            = Метаданные.НайтиПоТипу(ТипВыбранногоЗначения).ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",ВыбранноеЗначение);
	
	ПоляЗапроса = "";
	СчетчикИмен = 1;
	
	Для Каждого СтрСвязь Из ПрименяемыйСценарий.СвязиВыбора Цикл
		
		ВыражениеЗапроса = ?(ЗначениеЗаполнено(СтрСвязь.ПолеСсылки),
								"Спр." + СтрСвязь.ПолеСсылки
								,"""""");
		
		ПоляЗапроса = ПоляЗапроса + ",
		|	" + ВыражениеЗапроса + " КАК Поле" + СчетчикИмен;
		
		СчетчикИмен = СчетчикИмен + 1;
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ" 
	+ Сред(ПоляЗапроса,2) + "
	|ИЗ
	|	" + ИмяТаблицы + " КАК Спр
	|ГДЕ
	|	Спр.Ссылка = &Ссылка";
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Выборка;
	
КонецФункции

Функция ПодготовитьКонтекстОтбора(СценарийВвода,БланкОтчета,КодМакета,ПереченьАналитик) Экспорт

	Запрос 		 = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БланкиОтчетовМакетРаскрытий.Макет
	|ИЗ
	|	Справочник.БланкиОтчетов.МакетРаскрытий КАК БланкиОтчетовМакетРаскрытий
	|ГДЕ
	|	БланкиОтчетовМакетРаскрытий.Ссылка = &БланкОтчета
	|	И БланкиОтчетовМакетРаскрытий.КодГруппыРаскрытия = &КодМакета";
	
	Запрос.УстановитьПараметр("БланкОтчета",БланкОтчета);
	Запрос.УстановитьПараметр("КодМакета"  ,КодМакета);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	МакетСтроки = Выборка.Макет.Получить();
	Если ТипЗнч(МакетСтроки) = Тип("Структура") Тогда
		МакетСтроки = МакетСтроки.Содержимое;
	КонецЕсли;
	
	// Поиск позиции текущего типа в группе раскрытия.
	ПозицияТекущегоТипа = -1;
	
	Для Каждого СтрАналитика Из ПереченьАналитик Цикл
		
		Если ЗначениеЗаполнено(СценарийВвода.ВидАналитики) Тогда
			Если СтрАналитика.ВидАналитики = СценарийВвода.ВидАналитики Тогда
				ПозицияТекущегоТипа = ПереченьАналитик.Индекс(СтрАналитика);
				Прервать;
			КонецЕсли;
		Иначе
		
			ОписаниеТиповАналитики = БюджетнаяОтчетность.ПолучитьОписаниеТиповБК(СтрАналитика.ВидАналитики);	
			Если ОписаниеТиповАналитики.СодержитТип(СценарийВвода.ТипДанных) Тогда
				ПозицияТекущегоТипа = ПереченьАналитик.Индекс(СтрАналитика);
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	МассивСвязейОтбора = Новый Массив;
	
	КонтекстныйОтбор = Новый Структура("ТребуетсяВызовСервера",Ложь);
	
	Для Каждого СтрСвязь Из СценарийВвода.СвязиОтбора Цикл
		Индекс = ПозицияТекущегоТипа+СтрСвязь.Смещение;
		Если Индекс >= 0 и Индекс < ПереченьАналитик.Количество() Тогда
			СтрокаАналитики = ПереченьАналитик[Индекс];
			СвязьОбработана = Ложь;
			ИмяОбластиМакета = КодМакета + "_" + СтрокаАналитики.ИмяОбъектаАналитики;
			
			Для Каждого Область Из МакетСтроки.Области Цикл
				Если Область.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Прямоугольник и Область.СодержитЗначение
					 и Лев(Область.Имя,СтрДлина(ИмяОбластиМакета)) = ИмяОбластиМакета Тогда
					 
					СвязьОтбора = Новый Структура("ПолеОтбора,ИмяОбласти",СтрСвязь.ПолеОтбора,Область.Имя); 
					МассивСвязейОтбора.Добавить(СвязьОтбора);
					СвязьОбработана = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если Не СвязьОбработана Тогда
				// Не все требуемые аналитики присутствуют в макете
				// При выборе потребуется дополнительный серверный вызов.
				МассивСвязейОтбора.Очистить();
				Прервать;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Если МассивСвязейОтбора.Количество() = 0 Тогда
		
		КонтекстныйОтбор.ТребуетсяВызовСервера = Истина;
		
		Для Каждого СтрСвязь Из СценарийВвода.СвязиОтбора Цикл
			Индекс = ПозицияТекущегоТипа+СтрСвязь.Смещение;
			Если Индекс >= 0 и Индекс < ПереченьАналитик.Количество() Тогда
				СтрокаАналитики = ПереченьАналитик[Индекс];
				СвязьОтбора = Новый Структура("ПолеОтбора,ИмяОбласти",СтрСвязь.ПолеОтбора,СтрокаАналитики.ИмяОбъектаАналитики); 
				МассивСвязейОтбора.Добавить(СвязьОтбора);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	КонтекстныйОтбор.Вставить("МассивСвязейОтбора",МассивСвязейОтбора);
	
	Возврат КонтекстныйОтбор;
	
КонецФункции // ПодготовитьКонтекстОтбора()


// функции интерактивного редактирования

// Запрашивает тип области с сервера для открытия нужной формы выбора.
//
// Возвращаемое значение:
//   Структура: ВидОбласти, НастройкиЯчейки (ЕстьПредставление, ЕстьСвязанныеРеквизиты, ЕстьВыборИзКПС)
//
Функция ПолучитьПараметрыОбластиСервер(Знач ВидОтчета, Знач АдресНастроек, Знач ИмяОбласти, Знач РежимРазбора = "ВТелеОтчета") Экспорт
	
	ВидОбласти = ПолучитьВидИсточникаДанныхОбласти(ВидОтчета,ИмяОбласти);
	Если ВидОбласти < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Здесь требуется формирование структуры с параметрами.
	Результат = Новый Структура;
	Результат.Вставить("ВидОбласти"		,ВидОбласти);
	Результат.Вставить("НастройкиЯчейки",Неопределено);
	Результат.Вставить("ВидАналитики"	,Неопределено);
	Результат.Вставить("ИмяТипа"	 	,Неопределено);
	Результат.Вставить("ГруппаРаскрытия",Неопределено);
	Результат.Вставить("СценарийВвода"	,Неопределено);

	Результат.Вставить("ДоступныеЗначения",Неопределено);
	Результат.Вставить("ВидКлассификатораБК",Неопределено);
	
	мНастройки = ПолучитьИзВременногоХранилища(АдресНастроек);
	Если Не мНастройки = Неопределено Тогда
		СтрНастроек = мНастройки.НастройкиБланка.Найти(ИмяОбласти);
		
		Если СтрНастроек <> Неопределено Тогда
			
			НастройкиЯчейки = Новый Структура;
			НастройкиЯчейки.Вставить("ЕстьСвязанныеРеквизиты",СтрНастроек.ЕстьСвязанныеРеквизиты);
			НастройкиЯчейки.Вставить("ЕстьПредставление"	 ,СтрНастроек.ЕстьПредставление);
			НастройкиЯчейки.Вставить("ЕстьВыборИзКПС"		 ,СтрНастроек.ЕстьВыборИзКПС);
			НастройкиЯчейки.Вставить("ЕстьСписокДоступныхЗначений",СтрНастроек.ЕстьСписокДоступныхЗначений);			
			НастройкиЯчейки.Вставить("ЕстьВыборЗначенийИзСписка",СтрНастроек.ЕстьВыборЗначенийИзСписка);
			
			Если ВидОбласти = 2 
				И СтрНастроек.ЕстьСписокДоступныхЗначений Тогда
				Результат.Вставить("ДоступныеЗначения",СтрНастроек.СтруктураНастроек.СписокДоступныхЗначений);
			КонецЕсли;
			
			Если (ВидОбласти = 0
					ИЛИ ВидОбласти = 5)
				И СтрНастроек.ЕстьВыборЗначенийИзСписка Тогда
				МассивСтруктурДляВыбора = Новый Массив;
				
				Если СтрНастроек.СтруктураНастроек.Свойство("НастройкаВыбораЗначенийИзСписка")
					И ТипЗнч(СтрНастроек.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка) = Тип("Структура") Тогда
					Если СтрНастроек.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка.Свойство("ТаблицаНастройки")
						И ТипЗнч(СтрНастроек.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка.ТаблицаНастройки) = Тип("ТаблицаЗначений") Тогда
						
						ТаблицаНастройки = СтрНастроек.СтруктураНастроек.НастройкаВыбораЗначенийИзСписка.ТаблицаНастройки;
						ЕстьКолонкаДР = ТаблицаНастройки.Колонки.Найти("ДоступноРедактирование") <> Неопределено;
						Для Каждого СтрТЧ Из ТаблицаНастройки Цикл
							СтруктураЗначений = Новый Структура("Значение,Представление,ДоступноРедактирование",
								СтрТЧ.Значение,СтрТЧ.Представление,Ложь);
							Если ЕстьКолонкаДР Тогда
								СтруктураЗначений.Вставить("ДоступноРедактирование", СтрТЧ.ДоступноРедактирование);
							КонецЕсли;
							МассивСтруктурДляВыбора.Добавить(СтруктураЗначений);
						КонецЦикла;
						
					КонецЕсли;
				КонецЕсли;
				
				НастройкиЯчейки.Вставить("МассивСтруктурДляВыбора",МассивСтруктурДляВыбора);
			КонецЕсли;
			
			Результат.НастройкиЯчейки = НастройкиЯчейки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ВидОбласти = 5 Тогда
		
		ЭтоВыводВТелеОтчета = (РежимРазбора = "ВТелеОтчета");
		АдресКлючевогоСлова = ?(ЭтоВыводВТелеОтчета, 2, 1);
		
		// Получить группу раскрытия для ячейки раскрытия.
		КодыАдресаЯчейки = СтрРазделить(ИмяОбласти,"_");
		Если Лев(КодыАдресаЯчейки[АдресКлючевогоСлова],10) <> "Показатель" Тогда
			Возврат Неопределено; // Неправильное имя области.
		КонецЕсли;
		
		КодГруппыРаскрытия = КодыАдресаЯчейки[0];
		
		ТекГруппаРаскрытия = НайтиГруппуРаскрытия(ВидОтчета,КодГруппыРаскрытия);
		Результат.Вставить("ГруппаРаскрытия",ТекГруппаРаскрытия);
		
	ИначеЕсли ВидОбласти = 4 Тогда
		
		ЭтоВыводВТелеОтчета = (РежимРазбора = "ВТелеОтчета");
		АдресКлючевогоСлова      = ?(ЭтоВыводВТелеОтчета, 2, 1);
		
		// Получить вид аналитики для ячейки раскрытия.
		КодыАдресаЯчейки = СтрРазделить(ИмяОбласти,"_");
		Если Лев(КодыАдресаЯчейки[АдресКлючевогоСлова],9) <> "Аналитика" Тогда
			Возврат Неопределено; // Неправильное имя области.
		КонецЕсли;
		
		ПереченьАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикПоГруппамРаскрытия(ВидОтчета);
		УсловияПоиска    = Новый Структура("КодГруппыРаскрытия",КодыАдресаЯчейки[0]);
		ПереченьАналитик = ПереченьАналитик.Скопировать(УсловияПоиска);
		
		СтрГруппыРаскрытия = ПереченьАналитик.Найти(КодыАдресаЯчейки[АдресКлючевогоСлова],"ИмяОбъектаАналитики");
		Если Не СтрГруппыРаскрытия = Неопределено Тогда
			Результат.ВидАналитики = СтрГруппыРаскрытия.ВидАналитики;
			Результат.ИмяТипа = СтрГруппыРаскрытия.ИмяТипаДанных;
			Результат.ГруппаРаскрытия = СтрГруппыРаскрытия.ГруппаРаскрытия;
			Результат.ВидКлассификатораБК = СтрГруппыРаскрытия.ВидКлассификатораБК;
			
			ИспользуемыйВидАналитики = Неопределено;
			СценарийВвода = ПодобратьСценарийВводаАналитики(СтрГруппыРаскрытия.ГруппаРаскрытия, СтрГруппыРаскрытия.ВидАналитики,,ИспользуемыйВидАналитики);
			Если СценарийВвода <> Неопределено Тогда
				СценарийВводаКлиент = КлиентскийСценарийВвода(СценарийВвода);
				Если СценарийВводаКлиент <> Неопределено и СценарийВводаКлиент.ЕстьКонтекстныйОтбор Тогда
					
					Если ЭтоВыводВТелеОтчета Тогда
						КодМакета = КодыАдресаЯчейки[0]+"_"+КодыАдресаЯчейки[1];
					Иначе
						КодМакета = КодыАдресаЯчейки[0];
					КонецЕсли;
					
					КонтекстныйОтбор = ПодготовитьКонтекстОтбора(СценарийВвода, мНастройки.БланкОтчета, КодМакета, ПереченьАналитик);
					СценарийВводаКлиент.Вставить("ТребуетсяВызовСервера",КонтекстныйОтбор.ТребуетсяВызовСервера);
					СценарийВводаКлиент.Вставить("СвязиОтбора"			,КонтекстныйОтбор.МассивСвязейОтбора);
				КонецЕсли;
				Если ЗначениеЗаполнено(ИспользуемыйВидАналитики) Тогда
					СценарийВводаКлиент.Вставить("ВидАналитикиСценария",ИспользуемыйВидАналитики);
				КонецЕсли;
				Результат.СценарийВвода = СценарийВводаКлиент;
			КонецЕсли;
			
		Иначе
			Возврат Неопределено; // Неправильное имя ячейки (не определено в бланке).
		КонецЕсли;
		
	ИначеЕсли ВидОбласти = 3 Тогда
		// Получить вид аналитики для ячейки доп. реквизита.
		
		ПереченьАналитик = БюджетнаяОтчетностьСерверПовтИсп.ПереченьАналитикУровняОтчета(ВидОтчета);
		СтрАналитики 	 = ПереченьАналитик.Найти(ИмяОбласти,"ИмяОбъектаАналитики");
		Если Не СтрАналитики = Неопределено Тогда
			Результат.ВидАналитики = СтрАналитики.ВидАналитики;
			Результат.ИмяТипа = СтрАналитики.ИмяТипаДанных;
			Результат.ВидКлассификатораБК = СтрАналитики.ВидКлассификатораБК;
			
			ИспользуемыйВидАналитики = Неопределено;
			СценарийВвода = ПодобратьСценарийВводаАналитики(ПереченьАналитик, СтрАналитики.ВидАналитики,,ИспользуемыйВидАналитики);
			Если СценарийВвода <> Неопределено Тогда
				СценарийВводаКлиент = КлиентскийСценарийВвода(СценарийВвода);
				Если СценарийВводаКлиент <> Неопределено и СценарийВводаКлиент.ЕстьКонтекстныйОтбор Тогда
					
					МассивСвязейОтбора = Новый Массив;
					//для доп.реквизитов не передаем настройки отбора, т.к. это редкий сценарий					
					СценарийВводаКлиент.Вставить("ТребуетсяВызовСервера",Ложь);
					СценарийВводаКлиент.Вставить("СвязиОтбора"			,Новый Массив);
					
				КонецЕсли;
				Если ЗначениеЗаполнено(ИспользуемыйВидАналитики) Тогда
					СценарийВводаКлиент.Вставить("ВидАналитикиСценария",ИспользуемыйВидАналитики);
				КонецЕсли;
				Результат.СценарийВвода = СценарийВводаКлиент;
			КонецЕсли;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьПараметрыОбластиСервер()

// Возвращает вид данных в ячейке.
//
// 0 - показатель отчета (не используется в механизме свойств)
// 1 - реквизит метаданных отчета
// 2 - параметр отчета
// 3 - дополнительный реквизит
// 4 - строка раскрытия по аналитике
// 5 - показатель раскрытия
//
// -1  ячейка не связана с данными отчета.
//
Функция ПолучитьВидИсточникаДанныхОбласти(Знач ВидОтчета, Знач ИмяЯчейки) Экспорт

	Если ВРег(ИмяЯчейки) = ВРег("Дата") Или ВРег(ИмяЯчейки) = ВРег("Номер")
	 Или Метаданные.Документы.УниверсальныйРегламентированныйОтчет.Реквизиты.Найти(ИмяЯчейки) <> Неопределено Тогда
		Возврат 1;
	КонецЕсли;
	
	Если Найти(ИмяЯчейки,"_Аналитика") > 0 Тогда
		Возврат 4;
	КонецЕсли;
	
	Если Найти(ИмяЯчейки,"_Показатель") > 0 Тогда
		Возврат 5;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Источники.ИскомыйТип
	|ИЗ
	|	(ВЫБРАТЬ
	|		2 КАК ИскомыйТип,
	|		ВидыОтчетовПараметрыОтчета.Код КАК Код
	|	ИЗ
	|		Справочник.ВидыОтчетов.ПараметрыОтчета КАК ВидыОтчетовПараметрыОтчета
	|	ГДЕ
	|		ВидыОтчетовПараметрыОтчета.Ссылка = &ВидОтчета
	|		И ВидыОтчетовПараметрыОтчета.Код = &Код
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		3,
	|		ДополнительныеРеквизитыОтчетов.Код
	|	ИЗ
	|		Справочник.ДополнительныеРеквизитыОтчетов КАК ДополнительныеРеквизитыОтчетов
	|	ГДЕ
	|		ДополнительныеРеквизитыОтчетов.Владелец = &ВидОтчета
	|		И ДополнительныеРеквизитыОтчетов.Код = &Код
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		ПоказателиОтчетов.Код
	|	ИЗ
	|		Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
	|	ГДЕ
	|		ПоказателиОтчетов.Владелец = &ВидОтчета
	|		И ПоказателиОтчетов.Код = &Код) КАК Источники";
	
	Запрос.УстановитьПараметр("ВидОтчета", ВидОтчета);
	Запрос.УстановитьПараметр("Код"		 , ИмяЯчейки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИскомыйТип;
	КонецЕсли;
	
	Возврат -1;

КонецФункции // ПолучитьВидИсточникаДанныхОбласти()

Функция КлиентскийСценарийВвода(Знач СценарийВвода) Экспорт
 
	Если Не СценарийВвода = Неопределено Тогда
		
		СценарийВводаКлиент = Новый Структура;
		ТекущаяФорма 		= СценарийВвода.ФормаВыбора;
		СтрокаТекущейФормы  = СценарийВвода;
		
		Пока ТекущаяФорма = Неопределено Цикл
			ТекущаяФорма = СтрокаТекущейФормы.ФормаВыбора;
			Если ТекущаяФорма = Неопределено Тогда
				СтрокаТекущейФормы = СтрокаТекущейФормы.Родитель;
			КонецЕсли;
		КонецЦикла;
		
		Если ТекущаяФорма = Неопределено Тогда
			ВызватьИсключение НСтр("ru = 'Неверно настроено дерево связей аналитики'");
		КонецЕсли;
		
		ИмяТипа 	= Метаданные.НайтиПоТипу(СтрокаТекущейФормы.ТипДанных).ПолноеИмя();
		ФормаВыбора = ?(ТекущаяФорма = "",ИмяТипа + ".ФормаВыбора",ИмяТипа + ".Форма." + ТекущаяФорма);
		
		СценарийВводаКлиент.Вставить("ФормаВыбора"			,ФормаВыбора);
		СценарийВводаКлиент.Вставить("ЕстьКонтекстныйОтбор"	,(СценарийВвода.СвязиОтбора.Количество() > 0));
		СценарийВводаКлиент.Вставить("ЕстьСвязиВыбора"		,(СценарийВвода.СвязиВыбора.Количество() > 0));
		СценарийВводаКлиент.Вставить("ФиксированныйОтбор"	,СценарийВвода.Отбор);
		
		СценарийВводаКлиент.Вставить("ДетальныйВидАналитики",СценарийВвода.ДетальныйВидАналитики);
		
		Возврат СценарийВводаКлиент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // КлиентскийСценарийВвода()

Функция ЭтоПлатформа83() Экспорт

	Информация = Новый СистемнаяИнформация;
	Возврат Лев(Информация.ВерсияПриложения, 3) = "8.3";

КонецФункции // ЭтоПлатформа83()

Процедура ЗаполнитьСтраницыБланкаПоИерархии(СтрокиДерева, МассивСтраниц) Экспорт
	
	Для Инд = 0 По СтрокиДерева.Количество()-1 Цикл
		СтрокаДерева = СтрокиДерева[Инд];
		МассивСтраниц.Добавить(СтрокаДерева);
		ПодчиненныеСтроки = СтрокаДерева.Строки;
		Если ПодчиненныеСтроки.Количество() > 0 Тогда
			ЗаполнитьСтраницыБланкаПоИерархии(ПодчиненныеСтроки, МассивСтраниц);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	

//////////////////////////////////////////////////////////////////////////
// СЕРВЕРНЫЕ ФУНКЦИИ ПОДСИСТЕМЫ

Функция ПолучитьСтраницуПоддержкиКонфигурации() Экспорт
	
	ИмяКонфигурации = Метаданные.Имя;
	
	АдресСтраницыПоддержки = "";
	
	Если ИмяКонфигурации = "БухгалтерияГосударственногоУчреждения" Тогда //ПРОФ
		
		АдресСтраницыПоддержки = "https://releases.1c.ru/project/StateAccounting20";
		
	ИначеЕсли ИмяКонфигурации = "БухгалтерияГосударственногоУчрежденияКОРП" Тогда //КОРП
		
		АдресСтраницыПоддержки = "https://releases.1c.ru/project/StateAccountingCorp";
		
	ИначеЕсли ИмяКонфигурации = "БухгалтерияГосударственногоУчрежденияБазовая" Тогда //Базовая
		
		АдресСтраницыПоддержки = "https://releases.1c.ru/project/StateAccountingBase20";
		
	КонецЕсли;
	
	БюджетнаяОтчетностьСерверПереопределяемый.ПриПолученииСтраницыПоддержкиКонфигурации(АдресСтраницыПоддержки);
	
	Возврат АдресСтраницыПоддержки;
	
КонецФункции

Процедура ПолучитьДоступныеКомплектыСоСтраницыПоддержкиКонфигурации() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ПолучениеДоступныхКомплектовОтчетностиСоСтраницыПоддержки);
		
		
	ДанныеАутентификации = Неопределено;
	УстановитьПривилегированныйРежим(Истина);
	ДанныеАутентификации = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
	Если ДанныеАутентификации <> Неопределено Тогда
		ДанныеАутентификации.Логин = КодироватьСтроку(ДанныеАутентификации.Логин, СпособКодированияСтроки.КодировкаURL);
		ДанныеАутентификации.Пароль = КодироватьСтроку(ДанныеАутентификации.Пароль, СпособКодированияСтроки.КодировкаURL);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ДанныеАутентификацииЗаполнены = (ДанныеАутентификации <> Неопределено);
	
	ТекЗадание = Метаданные.РегламентныеЗадания.ПолучениеДоступныхКомплектовОтчетностиСоСтраницыПоддержки;
	Если ДанныеАутентификацииЗаполнены = Ложь Тогда
		
		ТекстОшибки = НСтр("ru='Не подключена Интернет-поддержка. Информация о комплектах не получена.'");
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Комплекты отчетности. Получение доступных комплектов со страницы поддержки",УровеньЖурналаРегистрации.Предупреждение,ТекЗадание,ТекстОшибки);

		Возврат;	
	КонецЕсли;
	
	АдресСтраницыПоддержки = БюджетнаяОтчетностьСервер.ПолучитьСтраницуПоддержкиКонфигурации();
	СообщатьОбОшибкахПолученияДанных = Ложь;
	КукиДляНужнойСтраницы = "";
	
	ТекстОшибки = "";
	СтраницаСайта = Обработки.ИмпортКейса.ПолучитьДанныеНаСервере(АдресСтраницыПоддержки,КукиДляНужнойСтраницы,ДанныеАутентификации,СообщатьОбОшибкахПолученияДанных,ТекстОшибки);
	
	Если НЕ ЗначениеЗаполнено(СтраницаСайта) Тогда
		ТекстСообщения = НСтр("ru='Не удалось получить данные со страницы поддержки конфигурации.'");
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Комплекты отчетности. Получение доступных комплектов со страницы поддержки",УровеньЖурналаРегистрации.Ошибка,ТекЗадание,ТекстСообщения);

		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Комплекты отчетности. Получение доступных комплектов со страницы поддержки",УровеньЖурналаРегистрации.Ошибка,ТекЗадание,ТекстОшибки);

		Возврат;	
	КонецЕсли;
	
	ТипСтрока = ОбщегоНазначения.ОписаниеТипаСтрока(0);
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(10);
	
	ТаблицаФайлов = Новый ТаблицаЗначений;//колонки должны быть как в форме ФормаЗагрузкиКомплектовСоСтраницыПоддержки обработки ИмпортКейса
	ТаблицаФайлов.Колонки.Добавить("Наименование",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("Адрес",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ИмяФайла",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("Расширение",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("Описание",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ВерсияНаСайте",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ТекущаяВерсия",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ИдентификаторКомплекта",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ВерсияНаСайтеСДатой",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ЕстьОбновление",ТипБулево);
	ТаблицаФайлов.Колонки.Добавить("Информация",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ЗагруженаБолееНоваяВерсия",ТипБулево);
	ТаблицаФайлов.Колонки.Добавить("ПрогрессУстановки",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ИндексКартинки",ТипЧисло);
	ТаблицаФайлов.Колонки.Добавить("Загрузить",ТипБулево);
	ТаблицаФайлов.Колонки.Добавить("АдресКомплекта",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("ВерсияПредставление",ТипСтрока);
	ТаблицаФайлов.Колонки.Добавить("НеИспользуется",ТипБулево);
	
	Обработки.ИмпортКейса.ЗаполнитьТаблицуФайловПоДаннымСтраницыПоддержки(СтраницаСайта,ТаблицаФайлов);
	
	СоответствиеДоступныхКомплектов = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СОКРЛП(ДоступныеКомплектыОтчетности.ИдентификаторКомплекта) КАК ИдентификаторКомплекта,
		|	СОКРЛП(ДоступныеКомплектыОтчетности.Версия) КАК Версия
		|ИЗ
		|	РегистрСведений.ДоступныеКомплектыОтчетности КАК ДоступныеКомплектыОтчетности";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеДоступныхКомплектов.Вставить(ВыборкаДетальныеЗаписи.ИдентификаторКомплекта,ВыборкаДетальныеЗаписи.Версия);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого СтрТЧ Из ТаблицаФайлов Цикл
		Если ЗначениеЗаполнено(СтрТЧ.ИдентификаторКомплекта) Тогда
			
			Если СоответствиеДоступныхКомплектов[СтрТЧ.ИдентификаторКомплекта] <> СтрТЧ.ВерсияНаСайте Тогда
			
				ЗаписьРС = РегистрыСведений.ДоступныеКомплектыОтчетности.СоздатьМенеджерЗаписи();
				ЗаписьРС.ИдентификаторКомплекта = СтрТЧ.ИдентификаторКомплекта;
				ЗаписьРС.Версия = СтрТЧ.ВерсияНаСайте;
				ЗаписьРС.Наименование = СтрТЧ.Наименование;
				ЗаписьРС.Записать(Истина);
				
			КонецЕсли;
		КонецЕсли;
				
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция СоответствиеИменКомплектовИдентификаторам() Экспорт
	
	мСоответствиеИменИдентификаторам = Новый Соответствие;
	мСоответствиеИменИдентификаторам.Вставить("DATAFEA",       "urn:entities-1c-ru:reports/case-metadata/fin-economy-plan/2.0");
	мСоответствиеИменИдентификаторам.Вставить("STATEREP143N",  "urn:entities-1c-ru:reports/case-metadata/staterep/143/2.0");
	мСоответствиеИменИдентификаторам.Вставить("STATEREP33B",   "urn:entities-1c-ru:reports/case-metadata/staterep/33/2.B");
	мСоответствиеИменИдентификаторам.Вставить("FOREP",         "urn:entities-1c-ru:reports/case-metadata/forep/2.F");
	мСоответствиеИменИдентификаторам.Вставить("STATREP191K",   "urn:entities-1c-ru:reports/case-metadata/staterep/191/2.K");
	мСоответствиеИменИдентификаторам.Вставить("CHECK0503125",  "urn:entities-1c-ru:reports/case-metadata/check0503125");
	мСоответствиеИменИдентификаторам.Вставить("CONTING624",    "urn:entities-1c-ru:reports/case-metadata/conting624");
	мСоответствиеИменИдентификаторам.Вставить("CONTING625",    "urn:entities-1c-ru:reports/case-metadata/conting625");	
	мСоответствиеИменИдентификаторам.Вставить("MONIT7018",     "urn:entities-1c-ru:reports/case-metadata/7018");
    мСоответствиеИменИдентификаторам.Вставить("REPX25",        "urn:entities-1c-ru:reports/case-metadata/X25");
	мСоответствиеИменИдентификаторам.Вставить("MONIT500M",     "urn:entities-1c-ru:reports/case-metadata/500m");
	мСоответствиеИменИдентификаторам.Вставить("REP194N",       "urn:entities-1c-ru:reports/case-metadata/194n");
	мСоответствиеИменИдентификаторам.Вставить("REP129N",       "urn:entities-1c-ru:reports/case-metadata/0503442");
	мСоответствиеИменИдентификаторам.Вставить("REP90N",        "urn:entities-1c-ru:reports/case-metadata/90n");
	
	Возврат мСоответствиеИменИдентификаторам; 
	
КонецФункции

Процедура ВключитьЗаданиеПолучениеДоступлныхКомплектов() Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("РаботаВЛокальномРежиме") <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
		Возврат;
	КонецЕсли;
	
	//включаем только для локального режима, для главного узла
	
	РегЗадание = Метаданные.РегламентныеЗадания.ПолучениеДоступныхКомплектовОтчетностиСоСтраницыПоддержки;
	Задания = РегламентныеЗаданияСервер.НайтиЗадания(Новый Структура("Метаданные", РегЗадание));
	Для Каждого Задание Из Задания Цикл
		РегламентныеЗаданияСервер.ИзменитьЗадание(Задание.УникальныйИдентификатор,Новый Структура("Использование", Истина));
	КонецЦикла;
				
КонецПроцедуры


// См. РаботаВБезопасномРежимеПереопределяемый.ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам.
//
Процедура ПриЗаполненииРазрешенийНаДоступКВнешнимРесурсам(ЗапросыРазрешений) Экспорт
	
	// На основании https://its.1c.ru/db/elreps#content:74:hdoc
	
	НовыеРазрешения = Новый Массив;
		
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTP",
		"login.1c.ru",
		80,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		"login.1c.ru",
		443,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTP",
		"releases.1c.ru",
		80,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		"releases.1c.ru",
		443,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTP",
		"portal.1c.ru",
		80,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		"portal.1c.ru",
		443,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTP",
		"filerepository.1c.ru",
		80,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса(
		"HTTPS",
		"filerepository.1c.ru",
		443,
		НСтр("ru = 'Обновление комплектов отчетности со страницы поддержки конфигурации.'"));
	НовыеРазрешения.Добавить(Разрешение);
	
	ЗапросыРазрешений.Добавить(РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(НовыеРазрешения));
	
КонецПроцедуры

 // Комплект отчетности может загружаться монопольно, 
// либо с помощью транзакционной блокировки объектов подсистемы.
// Логика включения того ли иного режима определяется конфигурацией-потребителем.
//
// Возвращаемое значение:
//   Булево   - Истина, если для загрузки комплекта 
//              требуется установить монопольный режим.
//
Функция МонопольныйРежимЗагрузкиКомплектаОтчетов() Экспорт

	Возврат БюджетнаяОтчетностьСерверПереопределяемый.МонопольныйРежимЗагрузкиКомплектаОтчетов();
	
КонецФункции

Функция ПолучитьМенеджерПериодичность() Экспорт
		

	ИмяПеречисления  = "Периодичность";

	
	Возврат Перечисления[ИмяПеречисления];
	
КонецФункции

Функция ПолучитьВладельцаСубконтоДляАналитики(ВидАналитики) Экспорт 
	
	Возврат БюджетнаяОтчетностьСерверПовтИсп.ПолучитьВладельцаСубконтоДляАналитики(ВидАналитики); 
	
КонецФункции

// Возвращает признак наличия учета по источникам фин. обеспечения
//
Функция ИспользоватьУчетПоИФО() Экспорт

	Возврат БюджетнаяОтчетностьСерверПереопределяемый.ИспользоватьУчетПоИФО();

КонецФункции // ИспользоватьУчетПоИФО()

Функция ВозможноРедактированиеСубконто(Субконто) Экспорт 
	
	Если не ЗначениеЗаполнено(Субконто.Владелец) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Субконто.Владелец) <> Тип("ПланВидовХарактеристикСсылка.АналитикаОтчетов") 
		и ТипЗнч(Субконто.Владелец) <> Тип("СправочникСсылка.СпискиЗначенийАналитик") Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Если Не БюджетнаяОтчетностьКлиентСервер.КонфигурацияЯвляетсяПодчиненной() Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Возврат Субконто.Владелец.ВозможностьРедактированияВПодчиненныхКонфигурациях; 
	
КонецФункции	

Процедура ОбработатьРеквизитДляХеша(ТекОбъект,ИмяРеквизита,МассивФормированияХеша,ВидРеквизита,ДопустимыеВидыРеквизита) Экспорт
	
	МассивФормированияХеша.Добавить(ИмяРеквизита);
	МассивФормированияХеша.Добавить("=");
		
	Если ВидРеквизита = ДопустимыеВидыРеквизита.Строка Тогда
		
		МассивФормированияХеша.Добавить(СокрЛП(ТекОбъект[ИмяРеквизита]));
		
	ИначеЕсли ВидРеквизита = ДопустимыеВидыРеквизита.Перечисление Тогда
		
		Если ЗначениеЗаполнено(ТекОбъект[ИмяРеквизита]) Тогда
			ДобавляемоеЗначение = ОбщегоНазначения.ИмяЗначенияПеречисления(ТекОбъект[ИмяРеквизита]);
		Иначе
			ДобавляемоеЗначение = "";
		КонецЕсли;
		МассивФормированияХеша.Добавить(ДобавляемоеЗначение);
		
	ИначеЕсли ВидРеквизита = ДопустимыеВидыРеквизита.Булево Тогда
		
		Если ТекОбъект[ИмяРеквизита] Тогда
			ДобавляемоеЗначение = "Истина";
		Иначе
			ДобавляемоеЗначение = "Ложь";
		КонецЕсли;
		МассивФормированияХеша.Добавить(ДобавляемоеЗначение);
		
	ИначеЕсли ВидРеквизита = ДопустимыеВидыРеквизита.ХранилищеЗначения Тогда
		
		МассивФормированияХеша.Добавить(СтрЗаменить(ЗначениеВСтрокуВнутр(ТекОбъект[ИмяРеквизита]),Символы.ВК,""));
		
	Иначе
		//Не должно такого быть
		
	КонецЕсли;
	
	МассивФормированияХеша.Добавить(Символы.ПС);
	
КонецПроцедуры

Функция ПолучитьДопустимыеВидыРеквизитаДляХеша() Экспорт
	
	Возврат Новый Структура("Строка,Перечисление,Булево,ХранилищеЗначения","Строка","Перечисление","Булево","ХранилищеЗначения");
	
КонецФункции

Функция ИспользоватьОбменСоСводомОтчетов() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("УчетГосУчрежденийПодсистемы.РегламентированнаяБухОтчетность.ОбменСоСводомОтчетов") Тогда
		Возврат ПолучитьФункциональнуюОпцию("ИспользоватьОбменСоСводомОтчетов");
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСостояниеОтчетаВСводеОтчетов(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	СостоянияОтправленныхОтчетовСрезПоследних.Состояние
		|ИЗ
		|	РегистрСведений.СостоянияОтправленныхОтчетов.СрезПоследних(, ДокументОтчет = &Ссылка) КАК СостоянияОтправленныхОтчетовСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Состояние;
	КонецЕсли;
		
	Возврат Перечисления.СостоянияОтчетов.ПустаяСсылка();
		
КонецФункции


