
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	МассивНачисленийАЗ = Новый Массив;
	МассивНачисленийСобственных = Новый Массив;
	МассивПлатежейАЗ = Новый Массив;
	МассивПлатежейСобственныхАН = Новый Массив;
	МассивПлатежейПодведАН = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗагруженныеДанныеСМЭВ3.ЗагруженныйОбъект КАК Док,
		|	МАКСИМУМ(ЗагруженныеДанныеСМЭВ3.БылИзменен) КАК БылИзменен
		|ИЗ
		|	РегистрСведений.ЗагруженныеДанныеСМЭВ3 КАК ЗагруженныеДанныеСМЭВ3
		|ГДЕ
		|	ЗагруженныеДанныеСМЭВ3.ЗапросКСМЭВ = &ЗапросКСМЭВ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗагруженныеДанныеСМЭВ3.ЗагруженныйОбъект";
		
	
	Запрос.УстановитьПараметр("ЗапросКСМЭВ", Параметры.ЗапросСМЭВ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТипНачисленияАЗ = Тип("ДокументСсылка.НачислениеКонтрагентамГИСГМП");
	ТипНачислениеСобственное = Тип("ДокументСсылка.КвитанцияНаОплатуГосуслуг");
	ТипПлатежиАЗ = Тип("ДокументСсылка.ПлатежКонтрагентовГИСГМП");
	ТипНачисленияСобствАН = Тип("ДокументСсылка.ПлатежВОплатуГосуслуг");
	ТипНачисленияПодведАН = Тип("ДокументСсылка.ПлатежПодведомственному");
	
	МассивНовыхНачАЗ = Новый Массив;
	МассивНовыхПлатАЗ = Новый Массив;
	МассивНовыхСобственныхАН = Новый Массив;
	МассивНовыхПодведАН = Новый Массив;
	
	ЕстьДанные = Ложь;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Док) = ТипНачисленияАЗ Тогда
			МассивНачисленийАЗ.Добавить(ВыборкаДетальныеЗаписи.Док);
			
			Если ВыборкаДетальныеЗаписи.БылИзменен Тогда
				МассивНовыхНачАЗ.Добавить(ВыборкаДетальныеЗаписи.Док);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Док) = ТипНачислениеСобственное Тогда
			МассивНачисленийСобственных.Добавить(ВыборкаДетальныеЗаписи.Док);
						
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Док) = ТипПлатежиАЗ Тогда
			МассивПлатежейАЗ.Добавить(ВыборкаДетальныеЗаписи.Док);
			
			Если ВыборкаДетальныеЗаписи.БылИзменен Тогда
				МассивНовыхПлатАЗ.Добавить(ВыборкаДетальныеЗаписи.Док);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Док) = ТипНачисленияСобствАН Тогда
			МассивПлатежейСобственныхАН.Добавить(ВыборкаДетальныеЗаписи.Док);
			
			Если ВыборкаДетальныеЗаписи.БылИзменен Тогда
				МассивНовыхСобственныхАН.Добавить(ВыборкаДетальныеЗаписи.Док);
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Док) = ТипНачисленияПодведАН Тогда
			МассивПлатежейПодведАН.Добавить(ВыборкаДетальныеЗаписи.Док);
			
			Если ВыборкаДетальныеЗаписи.БылИзменен Тогда
				МассивНовыхПодведАН.Добавить(ВыборкаДетальныеЗаписи.Док);
			КонецЕсли;
			
		КонецЕсли;
		ЕстьДанные = Истина;
	КонецЦикла;
	
	Если ЕстьДанные = Ложь Тогда
		ТекстСообщения = НСтр("ru='Нет данных для отображения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(НачисленияАЗ,"ИзмененныеДокументы",МассивНовыхНачАЗ,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПлатежиАЗ,"ИзмененныеДокументы",МассивНовыхПлатАЗ,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПлатежиСобственныеАН,"ИзмененныеДокументы",МассивНовыхСобственныхАН,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ПлатежиПодведомственнымАН,"ИзмененныеДокументы",МассивНовыхПодведАН,Истина);	
	
	КоличествоНачисленияАЗ = МассивНачисленийАЗ.Количество();	
	
	Если КоличествоНачисленияАЗ>0 Тогда
		Элементы.ГруппаНачисленияАЗ.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НачисленияАЗ,"Ссылка",МассивНачисленийАЗ,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	Иначе
		Элементы.ГруппаНачисленияАЗ.Видимость = Ложь;
	КонецЕсли;
	
	КоличествоНачисленияСобственные = МассивНачисленийСобственных.Количество();	
	
	Если КоличествоНачисленияСобственные>0 Тогда
		Элементы.ГруппаСобственныеНачисления.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НачисленияСобственные,"Ссылка",МассивНачисленийСобственных,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	Иначе
		Элементы.ГруппаСобственныеНачисления.Видимость = Ложь;
	КонецЕсли;
	
	КоличествоПлатежейАЗ = МассивПлатежейАЗ.Количество();	
	
	Если КоличествоПлатежейАЗ>0 Тогда
		Элементы.ГруппаПлатежиАЗ.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлатежиАЗ,"Ссылка",МассивПлатежейАЗ,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	Иначе
		Элементы.ГруппаПлатежиАЗ.Видимость = Ложь;
	КонецЕсли;
		
	КоличествоПлатежейСобственныхАН = МассивПлатежейСобственныхАН.Количество();	
	
	Если КоличествоПлатежейСобственныхАН>0 Тогда
		Элементы.ГруппаСобственныеПлатежи.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлатежиСобственныеАН,"Ссылка",МассивПлатежейСобственныхАН,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	Иначе
		Элементы.ГруппаСобственныеПлатежи.Видимость = Ложь;
	КонецЕсли;
	
	КоличествоПлатежейПодведАН = МассивПлатежейПодведАН.Количество();	
	
	Если КоличествоПлатежейПодведАН>0 Тогда
		Элементы.ГруппаПлатежиПодведомственным.Видимость = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПлатежиПодведомственнымАН,"Ссылка",МассивПлатежейПодведАН,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	Иначе
		Элементы.ГруппаПлатежиПодведомственным.Видимость = Ложь;
	КонецЕсли;
	
	// Печать НачисленияАЗ
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.НачисленияАЗ.КоманднаяПанель;
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Документы.НачислениеКонтрагентамГИСГМП);
	ПараметрыРазмещения.ПрефиксГрупп = "НачисленияАЗ";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец Печать НачисленияАЗ
	
	// Печать ПлатежиАЗ
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПлатежиАЗ.КоманднаяПанель;
	ПараметрыРазмещения.Источники = Новый Массив;
	ПараметрыРазмещения.Источники.Добавить(Метаданные.Документы.ПлатежКонтрагентовГИСГМП);
	ПараметрыРазмещения.ПрефиксГрупп = "ПлатежиАЗ";
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец Печать ПлатежиАЗ
	
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНачисленияАЗ

&НаКлиенте
Процедура НачисленияАЗПриАктивизацииСтроки(Элемент)
	ИмяТабЧасти = "НачисленияАЗ";
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПлатежиАЗ

&НаКлиенте
Процедура ПлатежиАЗПриАктивизацииСтроки(Элемент)
	
	ИмяТабЧасти = "ПлатежиАЗ";
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеНачисленияАЗ(Команда)
	ОткрытьФорму("Документ.НачислениеКонтрагентамГИСГМП.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВсеПлатежиАЗ(Команда)
	ОткрытьФорму("Документ.ПлатежКонтрагентовГИСГМП.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВсеПлатежиСобств(Команда)
	ОткрытьФорму("Документ.ПлатежВОплатуГосуслуг.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВсеПлатежиПодв(Команда)
	ОткрытьФорму("Документ.ПлатежПодведомственному.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ВсеНачисленияСобственные(Команда)
	ОткрытьФорму("Документ.КвитанцияНаОплатуГосуслуг.ФормаСписка");
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
		
	Если ТипЗнч(ЭтотОбъект.ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
		ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, ЭтотОбъект.ТекущийЭлемент);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, ЭтотОбъект.ТекущийЭлемент, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	Если Элементы.ГруппаСтраницыДокументов.ТекущаяСтраница.Имя = "ГруппаНачисленияАЗ" Тогда
		ИмяТабЧасти = "НачисленияАЗ";
	ИначеЕсли Элементы.ГруппаСтраницыДокументов.ТекущаяСтраница.Имя = "ГруппаПлатежиАЗ" Тогда
		ИмяТабЧасти = "ПлатежиАЗ";
	Иначе
		Возврат;
	КонецЕсли;

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы[ИмяТабЧасти]);

КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти