#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииСервер.УстановитьОтборСпискаИзНастроекКомпоновки(Список, Параметры);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(
		Список, "ВалютаРегламентированногоУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	
	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Организация",Параметры.Организация, ВидСравненияКомпоновкиДанных.Равно, ,Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ИФО) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "ИФО",Параметры.ИФО, ВидСравненияКомпоновкиДанных.Равно, ,Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Подразделение",Параметры.Подразделение, ВидСравненияКомпоновкиДанных.Равно, ,Истина);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор, "Дата",КонецДня(Параметры.Дата), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно, ,Истина);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, "ВидДокумента", Тип("Неопределено"), ВидСравненияКомпоновкиДанных.Равно, , Ложь,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИнформационнуюНадпись();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ОповеститьОВыборе(АдресПодобранныхВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДобавитьВОтобранные();
	ОбновитьИнформационнуюНадпись();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДобавитьВОтобранные();
	ОбновитьИнформационнуюНадпись();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТаблицаПодобранных

&НаКлиенте
Процедура ТаблицаПодобранныхПриИзменении(Элемент)
	ОбновитьИнформационнуюНадпись();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодобранныхПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	ДобавитьВОтобранные();
	ОбновитьИнформационнуюНадпись();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьВОтобранные()
	
	Для Каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		
		// если заявление уже подобрано, то не надо добавлять его повторно
		Строки = ТаблицаПодобранных.НайтиСтроки(Новый Структура("Ссылка", ТекущиеДанные.Ссылка));
		Если Строки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПодобранных.Добавить();
		
		НоваяСтрока.Ссылка = ТекущиеДанные.Ссылка;
		НоваяСтрока.Сотрудник = ТекущиеДанные.Сотрудник;
		НоваяСтрока.ОснованиеПринятияОбязательства = ТекущиеДанные.ОснованиеПринятияОбязательства;
		НоваяСтрока.Сумма = ТекущиеДанные.СуммаДокумента;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформационнуюНадпись()
	
	Сумма = Формат(ТаблицаПодобранных.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2; ЧН=");
	
	Количество = СтрокаСЧислом(";подобран %1 документ;;подобрано %1 документа;подобрано %1 документов;подобрано %1 документа",
		ТаблицаПодобранных.Количество(),
		ВидЧисловогоЗначения.Количественное,
		"L=ru; ЧН=");
	
	ИнформационнаяНадпись = НСтр("ru = 'Всего [Количество] на выдачу аванса, на сумму [Сумма] руб.'");
	
	ВставляемыеЗначения = Новый Структура;
	ВставляемыеЗначения.Вставить("Количество", Количество);
	ВставляемыеЗначения.Вставить("Сумма", Сумма);
	
	ИнформационнаяНадпись = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ИнформационнаяНадпись, ВставляемыеЗначения);
	
КонецПроцедуры

&НаСервере
Функция АдресПодобранныхВХранилище(УникальныйИдентификаторВладельца)
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПодобранных.Выгрузить(), УникальныйИдентификаторВладельца);
	
КонецФункции

#КонецОбласти
