#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СформироватьШтрихКодEAN13(МаксимальныйШтрихКод = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(МаксимальныйШтрихКод) Тогда
		МаксимальныйШтрихКод = МаксимальныйШтрихКодEAN13();
	КонецЕсли;
	
	Если МаксимальныйШтрихКод = Неопределено Тогда
		МаксимальныйШтрихКод = "20000000000000";
	КонецЕсли;
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число");
	МаксимальныйШтрихкодЧислом = ОписаниеТиповЧисло.ПривестиЗначение(Сред(МаксимальныйШтрихКод, 2, 11));
	
	НовыйШтрихКод = "2"+Формат(МаксимальныйШтрихкодЧислом + 1, "ЧЦ=11; ЧВН=; ЧГ=0");
	
	Возврат НовыйШтрихКод + КонтрольныйСимволEAN(НовыйШтрихКод);
	
КонецФункции

Функция НайтиОбъектПоШтрихкоду(Штрихкод) Экспорт
	
	Результат = Новый Структура("ОсновноеСредство, ИнвентарныйНомер",
		Справочники.ОсновныеСредства.ПустаяСсылка(), Справочники.ИнвентарныеНомераОС.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Штрихкоды.Объект КАК ОсновноеСредство,
	|	Штрихкоды.ИнвентарныйНомер КАК ИнвентарныйНомер
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает максимальное значение штрихкода из регистра
//
Функция МаксимальныйШтрихКодEAN13()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ШтрихКоды.Штрихкод КАК ШтрихКод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Штрихкод ПОДОБНО ""2____________""
	|	И ШтрихКоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихКод УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ШтрихКод;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КонтрольныйСимволEAN(ШтрихКод)
	
	Четн   = 0;
	Нечетн = 0;
	
	Для Индекс = 1 По 6 Цикл
		Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	КонтЦифра = 10 - (Четн * 3 + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции

#КонецОбласти

#КонецЕсли
