#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ПроведениеДокумента

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидПередачи");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ИмяДокумента", "Передача объекта ИК (кроме зданий и сооружений) (Акт приема-передачи ОС-1)");
	
	НомераТаблиц = Новый Структура;
	
	НомераТаблиц.Вставить("ТаблицаОсновныеСредства", НомераТаблиц.Количество());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.Ссылка КАК Ссылка,
	|	ТаблицаОсновныеСредства.Номер КАК Номер,
	|	ТаблицаОсновныеСредства.Дата КАК Дата,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК ДатаСписанияСБухУчета,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.ЦМО.ПустаяСсылка) КАК ЦМО,
	|	ТаблицаОсновныеСредства.Контрагент КАК Контрагент,
	|	ТаблицаОсновныеСредства.ВидПередачи КАК ВидПередачи,
	|	ТаблицаОсновныеСредства.Ссылка.Номер КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.Ссылка.Дата КАК ДатаДокумента,
	|	&ИмяДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	1 КАК Количество,
	|	ТаблицаОсновныеСредства.Сумма КАК Сумма,
	|	ТаблицаОсновныеСредства.СуммаАмортизации КАК СуммаАмортизации,
	|	"""" КАК ПричинаСписания
	|ПОМЕСТИТЬ ТаблицаОсновныеСредства
	|ИЗ
	|	Документ.ПередачаОбъектаИК КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	ИнвентарныйНомер";
	
	НомераТаблиц.Вставить("МестонахождениеОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ТаблицаОсновныеСредства.Подразделение КАК Подразделение,
	|	ТаблицаОсновныеСредства.ЦМО КАК ЦМО,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК Состояние,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства
	|ГДЕ
	|	ТаблицаОсновныеСредства.ВидПередачи = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Передача)";
	
	НомераТаблиц.Вставить("СобытияОС", НомераТаблиц.Количество());
	Запрос.Текст = Запрос.Текст + ОбщегоНазначенияБГУ.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	ТаблицаОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
	|	ТаблицаОсновныеСредства.Организация КАК Организация,
	|	ТаблицаОсновныеСредства.ИнвентарныйНомер КАК ИнвНомер,
	|	ВЫБОР
	|		КОГДА ТаблицаОсновныеСредства.ВидПередачи = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.Передача)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|		КОГДА ТаблицаОсновныеСредства.ВидПередачи = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПередачаБезмозмездноеПользование)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПередачаВБезвозмездноеПользование)
	|		КОГДА ТаблицаОсновныеСредства.ВидПередачи = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИК.ПередачаАренда)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.СдачаВАренду)
	|	КОНЕЦ КАК Событие,
	|	ТаблицаОсновныеСредства.Дата КАК ДатаСобытия,
	|	ТаблицаОсновныеСредства.НазваниеДокумента КАК НазваниеДокумента,
	|	ТаблицаОсновныеСредства.НомерДокумента КАК НомерДокумента,
	|	ТаблицаОсновныеСредства.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаОсновныеСредства.Ссылка КАК Регистратор,
	|	ТаблицаОсновныеСредства.ДатаСписанияСБухУчета КАК Период
	|ИЗ
	|	ТаблицаОсновныеСредства КАК ТаблицаОсновныеСредства";
	
	// Движения по регистрам СтоимостьОбъектовОС и АмортизацияОбъектовОС.
	ПараметрыСписания = УправлениеОсновнымиСредствами.ПараметрыСписанияОСПоРегистрамНакопления(РеквизитыДокумента.ВидПередачи);
	ПараметрыСписания.ПереместитьСтоимостьПоЦМО = Ложь;
	УправлениеОсновнымиСредствами.ДобавитьТаблицыСписанияОСПоРегистрамНакопления(Запрос, НомераТаблиц,
		ДокументСсылка, ПараметрыСписания);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ПередачаОбъектаИК";
	КомандаПечати.Идентификатор		= "ОС1";
	КомандаПечати.Представление		= НСтр("ru = 'Акт о приеме - передаче объекта ОС (ОС-1)'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм,"ОС1") Тогда
		
		ПодготовитьОС1(МассивОбъектов, ОбъектыПечати, ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1","ОС-1", ТабличныйДокумент1);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1_2","ОС-1 (стр. 2)", ТабличныйДокумент2);
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ОС1_3","ОС-1 (стр. 3)", ТабличныйДокумент3);
		
	КонецЕсли;
	
КонецПроцедуры // Печать()

Процедура ПодготовитьОС1(МассивОбъектов, ОбъектыПечати, ТабличныйДокумент1, ТабличныйДокумент2, ТабличныйДокумент3)
	
	ТабличныйДокумент1 = Новый ТабличныйДокумент;
	ТабличныйДокумент2 = Новый ТабличныйДокумент;
	ТабличныйДокумент3 = Новый ТабличныйДокумент;
	ТабличныйДокумент1.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИнвентарногоОбъектаОС_ОС1";
	ТабличныйДокумент2.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИнвентарногоОбъектаОС_ОС1";
	ТабличныйДокумент3.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СписаниеИнвентарногоОбъектаОС_ОС1";

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПередачаОбъектаИК.Ссылка КАК Ссылка,
	               |	ПередачаОбъектаИК.Дата КАК пДата,
	               |	ПередачаОбъектаИК.Номер КАК НомерАкта,
	               |	ПередачаОбъектаИК.Организация КАК Организация,
	               |	ПередачаОбъектаИК.Организация.НаименованиеПолное КАК НаимСдатчика,
	               |	ПередачаОбъектаИК.Организация.КодОКПО КАК КодОКПОСдатчика,
	               |	ПередачаОбъектаИК.РеквизитыЛицевогоСчета КАК РеквизитыЛицевогоСчета,
	               |	ПередачаОбъектаИК.РеквизитыЛицевогоСчета.Владелец КАК ЛицевойСчет,
	               |	ПРЕДСТАВЛЕНИЕ(ПередачаОбъектаИК.Подразделение) КАК ПодрСдатчика,
	               |	ПередачаОбъектаИК.ОснованиеДляАкта КАК ОснованиеДляАкта,
	               |	ПередачаОбъектаИК.НомерОснованияДляАкта КАК НомерОснованияДляАкта,
	               |	ПередачаОбъектаИК.ДатаОснованияДляАкта КАК ДатаОснованияДляАкта,
	               |	ПередачаОбъектаИК.ДатаСписанияСБухУчета КАК ДатаПередачи,
	               |	ПРЕДСТАВЛЕНИЕ(ПередачаОбъектаИК.КФО) КАК КФО,
	               |	ПРЕДСТАВЛЕНИЕ(ПередачаОбъектаИК.КПС) КАК КПС,
	               |	ПередачаОбъектаИК.ОсновноеСредство.КодОКОФ.Код КАК пКодПоОКОФ,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектаИК.ОсновноеСредство.АмортизационнаяГруппа = ЗНАЧЕНИЕ(Перечисление.АмортизационныеГруппы.ПустаяСсылка)
	               |			ТОГДА """"
	               |		ИНАЧЕ ПередачаОбъектаИК.ОсновноеСредство.АмортизационнаяГруппа.Порядок + 1
	               |	КОНЕЦ КАК НомерАмортГруппы,
	               |	ПередачаОбъектаИК.ИнвентарныйНомер КАК ИнвНомер,
	               |	ПередачаОбъектаИК.ИнвентарныйНомер.ЗаводскойНомер КАК пЗавНомер,
	               |	ПередачаОбъектаИК.ОсновноеСредство.ИзготовительОС.НаименованиеПолное КАК Изготовитель,
	               |	ПередачаОбъектаИК.Сумма КАК ЦенаПродажи,
	               |	СобытияОС_ВводВЭксплуатацию.ДатаСобытия КАК ДатаВвода,
	               |	ПередачаОбъектаИК.ИнвентарныйНомер.ДатаВыпуска КАК ДатаВыпуска,
	               |	ПередачаОбъектаИК.СуммаАмортизации + ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма, 0) КАК НачАмортизация,
	               |	ПередачаОбъектаИК.Сумма - ПередачаОбъектаИК.СуммаАмортизации - ЕСТЬNULL(ЖурналПроводокЕПСБУДвиженияССубконто.Сумма, 0) КАК ОстСтоимость,
	               |	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК МОЛ,
	               |	ПередачаОбъектаИК.ДолжностьПредседателяКомиссии КАК ДолжностьПредседателяКомиссии,
	               |	ПередачаОбъектаИК.ФамилияПредседателяКомиссии КАК ФамилияПредседателяКомиссии,
	               |	ПередачаОбъектаИК.ИмяПредседателяКомиссии КАК ИмяПредседателяКомиссии,
	               |	ПередачаОбъектаИК.ОтчествоПредседателяКомиссии КАК ОтчествоПредседателяКомиссии,
	               |	"""" КАК ТабНомМОЛсдал,
	               |	ПередачаОбъектаИК.Приложение КАК ТекстПриложения,
	               |	ПередачаОбъектаИК.ОсновноеСредство КАК ОсновноеСредство,
	               |	ВЫБОР
	               |		КОГДА ПередачаОбъектаИК.ОсновноеСредство.НаименованиеПолное = """"
	               |			ТОГДА ПередачаОбъектаИК.ОсновноеСредство.Наименование
	               |		ИНАЧЕ ПередачаОбъектаИК.ОсновноеСредство.НаименованиеПолное
	               |	КОНЕЦ КАК НаимОС,
	               |	ПередачаОбъектаИК.Сумма КАК Сумма,
	               |	РасчетАмортизацииОССрезПоследних.СрокПолезногоИспользования КАК СрокПолезнИспПриПеред,
	               |	ВЫБОР
	               |		КОГДА Контрагенты.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	               |			ТОГДА ЮридическиеЛица.КодОКПО
	               |	КОНЕЦ КАК КодОКПОПолучателя,
	               |	ВЫБОР
	               |		КОГДА Контрагенты.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	               |			ТОГДА ЮридическиеЛица.НаименованиеПолное
	               |		ИНАЧЕ ФизическиеЛица.Наименование
	               |	КОНЕЦ КАК НаимПолучателя,
	               |	ВЫБОР
	               |		КОГДА Контрагенты.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	               |			ТОГДА ЮридическиеЛицаАдрес.Представление
	               |		ИНАЧЕ ФизическиеЛицаАдрес.Представление
	               |	КОНЕЦ КАК АдресПолучателя,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА Контрагенты.ЮридическоеФизическоеЛицо ССЫЛКА Справочник.ЮридическиеЛица
	               |				ТОГДА ЮридическиеЛицаТелефон.Представление
	               |			ИНАЧЕ ФизическиеЛицаТелефон.Представление
	               |		КОНЕЦ КАК СТРОКА) КАК ТелефонПолучателя
	               |ИЗ
	               |	Документ.ПередачаОбъектаИК КАК ПередачаОбъектаИК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СобытияОС КАК СобытияОС_ВводВЭксплуатацию
	               |		ПО ПередачаОбъектаИК.ОсновноеСредство = СобытияОС_ВводВЭксплуатацию.ОсновноеСредство
	               |			И (СобытияОС_ВводВЭксплуатацию.Событие = &ВводВЭксплуатацию)
	               |			И ПередачаОбъектаИК.ИнвентарныйНомер = СобытияОС_ВводВЭксплуатацию.ИнвНомер
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасчетАмортизацииОС.СрезПоследних(
	               |				,
	               |				ОсновноеСредство В
	               |					(ВЫБРАТЬ
	               |						ПередачаОбъектаОС.ОсновноеСредство
	               |					ИЗ
	               |						Документ.ПередачаОбъектаОС КАК ПередачаОбъектаОС
	               |					ГДЕ
	               |						ПередачаОбъектаОС.Ссылка В (&МассивОбъектов))) КАК РасчетАмортизацииОССрезПоследних
	               |		ПО ПередачаОбъектаИК.ОсновноеСредство = РасчетАмортизацииОССрезПоследних.ОсновноеСредство
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	               |				,
	               |				,
	               |				Регистратор В (&МассивОбъектов)
	               |					И СчетКт В (&Счет104),
	               |				,
	               |				) КАК ЖурналПроводокЕПСБУДвиженияССубконто
	               |		ПО ПередачаОбъектаИК.Ссылка = ЖурналПроводокЕПСБУДвиженияССубконто.Регистратор
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаАдрес
	               |				ПО ФизическиеЛица.Ссылка = ФизическиеЛицаАдрес.Ссылка
	               |					И (ФизическиеЛицаАдрес.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаТелефон
	               |				ПО ФизическиеЛица.Ссылка = ФизическиеЛицаТелефон.Ссылка
	               |					И (ФизическиеЛицаТелефон.Ссылка = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица))
	               |			ПО Контрагенты.ЮридическоеФизическоеЛицо = ФизическиеЛица.Ссылка
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица.КонтактнаяИнформация КАК ЮридическиеЛицаАдрес
	               |				ПО ЮридическиеЛица.Ссылка = ЮридическиеЛицаАдрес.Ссылка
	               |					И (ЮридическиеЛицаАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты))
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица.КонтактнаяИнформация КАК ЮридическиеЛицаТелефон
	               |				ПО ЮридическиеЛица.Ссылка = ЮридическиеЛицаТелефон.Ссылка
	               |					И (ЮридическиеЛицаТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагенты))
	               |			ПО Контрагенты.ЮридическоеФизическоеЛицо = ЮридическиеЛица.Ссылка
	               |		ПО ПередачаОбъектаИК.Контрагент = Контрагенты.Ссылка
	               |ГДЕ
	               |	ПередачаОбъектаИК.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	пДата,
	               |	НомерАкта
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК ОсновноеСредство,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА КАК Справочник.ОсновныеСредства).НаименованиеПолное + "" / "" + ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер КАК Справочник.ИнвентарныеНомераОС).Код КАК НазвДетали,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Наименование КАК Драгметалл,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ВидДрагМатериала КАК Справочник.ДрагМеталлы).Код КАК КодДрагМеталла,
	               |	ВЫРАЗИТЬ(НаличиеДрагМатериаловВОбъектахНФАОстатки.ЕдИзм КАК Справочник.КлассификаторЕдиницИзмерения).Наименование КАК НазвЕИ,
	               |	ЕСТЬNULL(НаличиеДрагМатериаловВОбъектахНФАОстатки.МассаДМОстаток, 0) КАК ВесДраг
	               |ИЗ
	               |	Документ.ПередачаОбъектаИК КАК ПередачаОбъектаИК
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НаличиеДрагМатериаловВОбъектахНФА.Остатки КАК НаличиеДрагМатериаловВОбъектахНФАОстатки
	               |		ПО ПередачаОбъектаИК.ОсновноеСредство = НаличиеДрагМатериаловВОбъектахНФАОстатки.ОбъектНФА
	               |			И ПередачаОбъектаИК.ИнвентарныйНомер = НаличиеДрагМатериаловВОбъектахНФАОстатки.ИнвНомер
	               |ИТОГИ ПО
	               |	ОсновноеСредство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СписаниеОбъектаИКСоставКомиссии.ДолжностьЧленаКомиссии КАК ДолжностьЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.ФамилияЧленаКомиссии КАК ФамилияЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.ИмяЧленаКомиссии КАК ИмяЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.ОтчествоЧленаКомиссии КАК ОтчествоЧленаКомиссии,
	               |	СписаниеОбъектаИКСоставКомиссии.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПередачаОбъектаИК.СоставКомиссии КАК СписаниеОбъектаИКСоставКомиссии
	               |ГДЕ
	               |	СписаниеОбъектаИКСоставКомиссии.Ссылка В(&МассивОбъектов)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СписаниеОбъектаИКСоставКомиссии.НомерСтроки
	               |ИТОГИ ПО
	               |	Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПередачаОбъектаИК.ОсновноеСредство КАК ОсновноеСредство,
	               |	ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Свойство) КАК ВидХарактеристики,
	               |	ПРЕДСТАВЛЕНИЕ(ДополнительныеСведения.Значение) КАК НазваниеХарактеристики
	               |ИЗ
	               |	Документ.ПередачаОбъектаИК КАК ПередачаОбъектаИК
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |		ПО ПередачаОбъектаИК.ОсновноеСредство = ДополнительныеСведения.Объект
	               |ГДЕ
	               |	ПередачаОбъектаИК.Ссылка В(&МассивОбъектов)
	               |ИТОГИ ПО
	               |	ОсновноеСредство";
				   
	Запрос.УстановитьПараметр("МассивОбъектов",		МассивОбъектов);
	Запрос.УстановитьПараметр("ВводВЭксплуатацию",	Перечисления.ВидыСобытийОС.ВводВЭксплуатацию);
	Запрос.УстановитьПараметр("Счет104",			БухгалтерскийУчет.СписокСчетов("104.00"));
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка 			= Результат[0].Выбрать();
	ВыборкаДрагМеталлы 		= Результат[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаКомиссия 		= Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаХарактеристик	= Результат[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_ОС_1");
	ОбластьСтр_1 			= Макет.ПолучитьОбласть("Стр_1");
	ОбластьСтр_2 			= Макет.ПолучитьОбласть("Стр_2");
	ОбластьСтр_2_1 			= Макет.ПолучитьОбласть("Стр_2_1");
	ОбластьДрагметалл 		= Макет.ПолучитьОбласть("Драгметалл");
	ОбластьДрагметалл_2		= Макет.ПолучитьОбласть("Дрметалл_2");
	ОбластьСтр_2_2 			= Макет.ПолучитьОбласть("Стр_2_2");
	ОбластьХарактеристики	= Макет.ПолучитьОбласть("Характеристики");
	ОбластьСтр_2_3 			= Макет.ПолучитьОбласть("Стр_2_3");
	ОбластьСтр_3_1 			= Макет.ПолучитьОбласть("Стр_3_1");
	ОбластьКомиссия 		= Макет.ПолучитьОбласть("Комиссия");
	ОбластьСтр_3_2 			= Макет.ПолучитьОбласть("Стр_3_2");
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент2 = Новый ТабличныйДокумент;
			ТабличныйДокумент3 = Новый ТабличныйДокумент;
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
    	НомерСтрокиНачало1 = ТабличныйДокумент1.ВысотаТаблицы + 1;
		
	    ОбластьСтр_1.Параметры.Заполнить(ВыборкаШапка);
		ПараметрыОбласти = Новый Структура("РукДолжнСдатчика,РукСдатчика,АдресСдатчика,СчетОС_Печ,РеквСдатчика,АдресПолучателя,НомерАкта");
		Руководитель = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Руководитель", ВыборкаШапка.Организация, ВыборкаШапка.пДата);
		ПараметрыОбласти.РукДолжнСдатчика 	= Руководитель.ДолжностьПредставление;
		ПараметрыОбласти.РукСдатчика		= КорреспондентыКлиентСервер.ФИО(Руководитель.ОтветственноеЛицоФИО, Истина);
		Адрес	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);		
		Телефон	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);		
		Факс	= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаШапка.Организация, Справочники.ВидыКонтактнойИнформации.ФаксОрганизации);		
		ПараметрыОбласти.АдресСдатчика = Адрес 
												+ ?(ПустаяСтрока(Телефон), "", ", тел.: "+Телефон)
												+ ?(ПустаяСтрока(Факс), "", ", факс: "+Факс);
												
		СчетУчета = УправлениеОсновнымиСредствами.СчетУчетаОС(ВыборкаШапка.ОсновноеСредство, ВыборкаШапка.Ссылка);
		КЭК = СчетУчета.КОСГУКт;
												
		ПараметрыОбласти.СчетОС_Печ	= ВыборкаШапка.КПС + "." + ВыборкаШапка.КФО + "."+СчетУчета 
											+ ?(ПустаяСтрока(КЭК), "", "."+КЭК);
		РеквСдатчика = "";
		Если ЗначениеЗаполнено(ВыборкаШапка.РеквизитыЛицевогоСчета) Тогда
			РеквизитыПлательщика = Новый Структура("НомерСчетаПлательщика, НаименованиеБанкаПлательщика, БикБанкаПлательщика, СчетБанкаПлательщика",
													"СчетНомер", "Банк", "БИК", "КоррСчет");
			ПлатежноРасчетныеДокументы.ПолучитьПлатежныеРеквизитыПоТребованиюБанка(ВыборкаШапка.ЛицевойСчет,
																					ВыборкаШапка.РеквизитыЛицевогоСчета,	
																					РеквизитыПлательщика);
			ПлательщикБанковскийСчет 	= РеквизитыПлательщика.НомерСчетаПлательщика;
			ПлательщикНаименованиеБанка = РеквизитыПлательщика.НаименованиеБанкаПлательщика;
			ПлательщикБИКБанка 			= РеквизитыПлательщика.БикБанкаПлательщика;
			ПлательщикКорСчетБанка 		= РеквизитыПлательщика.СчетБанкаПлательщика;
			РеквСдатчика = "счет № " + ПлательщикБанковскийСчет + " в " + ПлательщикНаименованиеБанка 
							+ ", БИК " + ПлательщикБИКБанка + ", кор.счет " + ПлательщикКорСчетБанка;
			ПараметрыОбласти.РеквСдатчика = РеквСдатчика;							
		КонецЕсли;
		ПараметрыОбласти.АдресПолучателя = ?(ЗначениеЗаполнено(ВыборкаШапка.АдресПолучателя),ВыборкаШапка.АдресПолучателя,"")+?(ЗначениеЗаполнено(ВыборкаШапка.ТелефонПолучателя),", тел.: "+ВыборкаШапка.ТелефонПолучателя, "");
		ПараметрыОбласти.НомерАкта = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(ВыборкаШапка.Ссылка,ВыборкаШапка.НомерАкта);
		ОбластьСтр_1.Параметры.Заполнить(ПараметрыОбласти);
		ТабличныйДокумент1.Вывести(ОбластьСтр_1);
		
	    ОбластьСтр_2.Параметры.Заполнить(ВыборкаШапка);
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("СрокЭксплР", УправлениеОсновнымиСредствами.РассчитатьСрокЭксплуатации(
												ВыборкаШапка.ОсновноеСредство,ВыборкаШапка.ИнвНомер,ВыборкаШапка.Организация,ВыборкаШапка.пДата).СрокЭкспл);
		ОбластьСтр_2.Параметры.Заполнить(ПараметрыОбласти);
	    ТабличныйДокумент2.Вывести(ОбластьСтр_2);
	    ТабличныйДокумент2.Вывести(ОбластьСтр_2_1);

	    // драгметаллы
		ВыборкаДрагМеталлы.Сбросить();
		ВывелиСтрок = 0;
		Если ВыборкаДрагМеталлы.НайтиСледующий(ВыборкаШапка.ОсновноеСредство, "ОсновноеСредство") Тогда
			ДрагМеталлы = ВыборкаДрагМеталлы.Выбрать();
			Пока ДрагМеталлы.Следующий() Цикл
				ОбластьДрагметалл.Параметры.Заполнить(ДрагМеталлы);
				ТабличныйДокумент2.Вывести(ОбластьДрагметалл);
				ВывелиСтрок = ВывелиСтрок + 1;
			КонецЦикла;
		КонецЕсли;
		Для Счетчик = ВывелиСтрок По 3 Цикл
			ТабличныйДокумент2.Вывести(ОбластьДрагметалл_2);
		КонецЦикла;
		ОбластьСтр_2_2.Параметры.Заполнить(ВыборкаШапка);
	    ТабличныйДокумент2.Вывести(ОбластьСтр_2_2);
		
		// характеристики
		ВывелиСтрок = 0;
		ВыборкаХарактеристик.Сбросить();
		Если ВыборкаХарактеристик.НайтиСледующий(ВыборкаШапка.ОсновноеСредство, "ОсновноеСредство") Тогда
			Характеристики = ВыборкаХарактеристик.Выбрать();
			Пока Характеристики.Следующий() Цикл
				ОбластьХарактеристики.Параметры.Заполнить(Характеристики);
				ТабличныйДокумент2.Вывести(ОбластьХарактеристики);
				ВывелиСтрок = ВывелиСтрок + 1;
			КонецЦикла;
		КонецЕсли;
		Для Счетчик = ВывелиСтрок По 4 Цикл
			ТабличныйДокумент2.Вывести(ОбластьСтр_2_3);
		КонецЦикла;
		
		ОбластьСтр_3_1.Параметры.Заполнить(ВыборкаШапка);
	    ТабличныйДокумент3.Вывести(ОбластьСтр_3_1);
		
		// Комиссия
		пСтатусЧленаКомиссии	= "Председатель комиссии";
		пДолжностьЧленаКомиссии = ВыборкаШапка.ДолжностьПредседателяКомиссии;
		Если ЗначениеЗаполнено(ВыборкаШапка.ФамилияПредседателяКомиссии) Тогда
			пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
	               																ВыборкаШапка.ФамилияПредседателяКомиссии,
	               																ВыборкаШапка.ИмяПредседателяКомиссии,
	               																ВыборкаШапка.ОтчествоПредседателяКомиссии));
		Иначе																				
			пЧленКомиссии			= "";
		КонецЕсли;
		ПараметрыОбласти = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
											пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии);
		ОбластьКомиссия.Параметры.Заполнить(ПараметрыОбласти);
		ТабличныйДокумент3.Вывести(ОбластьКомиссия);
		
		пСтатусЧленаКомиссии = "Члены комиссии:";
		ВыборкаКомиссия.Сбросить();
		ВывелиСтрок = 0;
		Если ВыборкаКомиссия.НайтиСледующий(ВыборкаШапка.Ссылка, "Ссылка") Тогда
			
			Комиссия = ВыборкаКомиссия.Выбрать();
			Пока Комиссия.Следующий() Цикл
				ВывелиСтрок = ВывелиСтрок + 1;
				пДолжностьЧленаКомиссии = Комиссия.ДолжностьЧленаКомиссии;
				пЧленКомиссии			= КорреспондентыКлиентСервер.ФИО(Новый Структура("Фамилия, Имя, Отчество",
			               																Комиссия.ФамилияЧленаКомиссии,
			               																Комиссия.ИмяЧленаКомиссии,
			               																Комиссия.ОтчествоЧленаКомиссии));
				ПараметрыОбласти = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
													пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии);
				ОбластьКомиссия.Параметры.Заполнить(ПараметрыОбласти);
				ТабличныйДокумент3.Вывести(ОбластьКомиссия);
				
				пСтатусЧленаКомиссии = "";
				
			КонецЦикла;
			
		КонецЕсли;
		Для Счетчик=ВывелиСтрок По 2 Цикл
		
			ПараметрыОбласти = Новый Структура("пСтатусЧленаКомиссии,пДолжностьЧленаКомиссии,пЧленКомиссии",
												пСтатусЧленаКомиссии,"","");
			ОбластьКомиссия.Параметры.Заполнить(ПараметрыОбласти);
			ТабличныйДокумент3.Вывести(ОбластьКомиссия);
			
			пСтатусЧленаКомиссии = "";
		
		КонецЦикла; 
		
		ОбластьСтр_3_2.Параметры.Заполнить(ВыборкаШапка);
		
		ПараметрыОбласти = Новый Структура("ГлавБухСдатчика");
		ГлБухгалтер = ОрганизационнаяСтруктураКлиентСервер.ОтветственноеЛицоОрганизации("Главный бухгалтер", ВыборкаШапка.Организация, ВыборкаШапка.пДата);
		ПараметрыОбласти.ГлавБухСдатчика		= КорреспондентыКлиентСервер.ФИО(ГлБухгалтер.ОтветственноеЛицоФИО, Истина);
		
		ОбластьСтр_3_2.Параметры.Заполнить(ПараметрыОбласти);
	    ТабличныйДокумент3.Вывести(ОбластьСтр_3_2);
		
		ТабличныйДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент1.Вывести(ТабличныйДокумент2);
		ТабличныйДокумент1.ВывестиГоризонтальныйРазделительСтраниц();
		ТабличныйДокумент1.Вывести(ТабличныйДокумент3);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент1, 
		                                               НомерСтрокиНачало1, ОбъектыПечати, ВыборкаШапка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
