#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПодключаемоеОборудование");
		МассивНепроверяемыхРеквизитов.Добавить("УстройствоПечатиСлипЧека");
	КонецЕсли;
	Если НЕ ИспользоватьУстройствоДляПечатиСлипЧеков Тогда
		МассивНепроверяемыхРеквизитов.Добавить("УстройствоПечатиСлипЧека");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Если ТипЗнч(ОбменДанными.Отправитель) = Тип("ПланОбменаСсылка.АвтономнаяРабота") 
			ИЛИ ТипЗнч(ОбменДанными.Отправитель) = Тип("ПланОбменаСсылка.Полный") 
			ИЛИ ТипЗнч(ОбменДанными.Отправитель) = Тип("ПланОбменаСсылка.ПоОрганизации") Тогда
			
			Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
				ИспользоватьБезПодключенияОборудования = Истина;
				ИспользоватьУстройствоДляПечатиСлипЧеков = Ложь;
				ПодключаемоеОборудование = Неопределено;
				УстройствоПечатиСлипЧека = Неопределено;
			Иначе
				ИспользоватьБезПодключенияОборудования = Ссылка.ИспользоватьБезПодключенияОборудования;
				ИспользоватьУстройствоДляПечатиСлипЧеков = Ссылка.ИспользоватьУстройствоДляПечатиСлипЧеков;
				ПодключаемоеОборудование = Ссылка.ПодключаемоеОборудование;
				УстройствоПечатиСлипЧека = Ссылка.УстройствоПечатиСлипЧека;
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ИспользоватьБезПодключенияОборудования Тогда
		ПодключаемоеОборудование = Неопределено;
		ИспользоватьУстройствоДляПечатиСлипЧеков = Ложь;
		УстройствоПечатиСлипЧека = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

