
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	УстановитьВидимость();
	УстановитьТекстПримера(); 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДействуетНачислениеПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура НачислятьВДеньПриказаПриИзменении(Элемент)
	
	УстановитьТекстПримера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		Результат = МожноРедактироватьРеквизиты();
		Если Результат = Истина Тогда
			
			МассивРеквизитов = ЗапретРедактированияРеквизитовОбъектовКлиент.Реквизиты(ЭтаФорма);
			ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, МассивРеквизитов);
			
		Иначе
			
			ПоказатьПредупреждение(Неопределено, "Редактирование ключевых значений запрещено, т.к. состояние используется в следующих видах приказов: " + Символы.ПС + Результат, 20);
			
		КонецЕсли;
		
	КонецЕсли;


КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.НачислятьВДеньПриказа.Видимость = НЕ Объект.ДействуетНачисление;
	Элементы.ГруппаПример.Видимость = НЕ Объект.ДействуетНачисление;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстПримера()
	
	Текст = "";
	
	Если Объект.НачислятьВДеньПриказа Тогда
		
		Текст = "Дата приказа - 31 января
		        |Начисления будут прекращены 01 февраля
				  |За 31 января будет произведено начисление";
		
	Иначе
		Текст = "Дата приказа - 31 января
		        |Начисления будут прекращены 31 января
				  |За 31 января не будет произведено начисление";
		
	КонецЕсли;
	
	Элементы.ДекорацияПример.Заголовок = Текст;
	
КонецПроцедуры

&НаСервере
Функция МожноРедактироватьРеквизиты()

	Перем Результат;
		
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВидыПриказовОбразование.Представление
	               |ИЗ
	               |	Справочник.ВидыПриказовОбразование КАК ВидыПриказовОбразование
	               |ГДЕ
	               |	ВидыПриказовОбразование.СостояниеСтудента = &СостояниеСтудента";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("СостояниеСтудента", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Результат = Истина;
		
	Иначе
		
		Результат = "";
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ПустаяСтрока(Результат) Тогда
				Результат = Результат + ", ";
			КонецЕсли; 
			Результат = Результат + Выборка.Представление; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции // МожноРедактироватьРеквизиты()

#КонецОбласти