
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части

	ОбщегоНазначенияБГУ.УстановитьДоступностьРедактированияСтрокВДокументахНФА(ЭтотОбъект);
	
	УстановитьДопустимыеКодыОперацийПрослеживаемости();
	ПрослеживаемостьФормыБГУ.ЗаполнитьСписокВыбораКодаОперацииПрослеживаемости(Элементы.КодОперацииПрослеживаемости,
		ПрослеживаемостьБГУКлиентСервер.КодыОперацийПрослеживаемостиУтилизация());
	
	РезервированиеНФА.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Параметры.Ключ.Пустая() Тогда   
		ПодготовитьФормуНаСервере();
		Если Не ЗначениеЗаполнено(Объект.Руководитель) Тогда
			Подписанты = Новый Структура;
			Подписанты.Вставить("Руководитель", ЗаполнениеРеквизитовОбъектов.СтруктураПодписанта("Руководитель"));
			ЗаполнениеРеквизитовОбъектов.ЗаполнитьПодписантов(Объект, Подписанты);
		КонецЕсли;
	КонецЕсли;
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Централизованная бухгалтерия
	ЗаполнениеРеквизитовОбъектов.ОпределитьПараметрыВыбораСотрудников(ЭтотОбъект);
	// Конец Централизованная бухгалтерия
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
	ЗаполнитьСписокВыбора_СпособыУтилизации();

	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект, Элементы.БухгалтерскаяОперация);
	// Конец Типовые операции и дополнительные табличные части
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.ПриЧтенииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.ОсновныеСредства.Количество() = 0 Тогда	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'Не заполнена табличная часть. Для проведения табличную часть следует заполнить'");
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
	// ГолосованиеКомиссии
	Если РешениеСотрудникаМодифицированность Тогда
		Если Объект.ГолосованиеЗаПолученныеМатериалы Тогда
			ИспользуемаяТаблица = Объект.ПолученныеМатериалы;
		Иначе
			ИспользуемаяТаблица = Объект.ОсновныеСредства;
		КонецЕсли;
		СохранитьРезультатыГолосованияНаСервере(Сотрудник,
			УправлениеНФАКлиентСервер.РезультатыГолосованияСотрудника(ИспользуемаяТаблица));
	КонецЕсли;
	// Конец ГолосованиеКомиссии
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом

	ОбщегоНазначенияБГУ.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ДатыПроведенияДокументов", Новый Структура("Документ", ДокументСсылка),,,Отказ);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект, "ОсновныеСредства");
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТДляОС" Тогда
		ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияДокументаДатаПроведенияПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если РешениеСотрудникаМодифицированность
		И ЗначениеЗаполнено(ВыбранныйСотрудник)
		И ВыбранныйСотрудник <> Сотрудник Тогда
		
		Если Объект.ГолосованиеЗаПолученныеМатериалы Тогда
			ИспользуемаяТаблица = Объект.ПолученныеМатериалы;
		Иначе
			ИспользуемаяТаблица = Объект.ОсновныеСредства;
		КонецЕсли;

		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("Сотрудник", ВыбранныйСотрудник);
		ДопПараметры.Вставить("РезультатыГолосования",
			УправлениеНФАКлиентСервер.РезультатыГолосованияСотрудника(ИспользуемаяТаблица));
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
		ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), ВыбранныйСотрудник);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
	СотрудникПриИзмененииНаСервере();
	
	ВыбранныйСотрудник = Сотрудник;
	
	РешениеСотрудникаМодифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	УправлениеНФА.ПолучитьФайлСотрудника(Сотрудник, ПараметрыФайлаСотрудника());
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОтборПрисутствующих = Новый Структура("Отсутствует", Ложь);
	ПрисутствующиеЧленыКомиссии = Объект.СоставКомиссии.НайтиСтроки(ОтборПрисутствующих);
	
	// Выбирается из присутствующих членов комиссии.
	Элемент.СписокВыбора.Очистить();
	Для Каждого ЧленКомиссии Из ПрисутствующиеЧленыКомиссии Цикл
		Элемент.СписокВыбора.Добавить(ЧленКомиссии.Сотрудник);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРешениеСотрудникаПоРезолюцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ТекущиеДанные.РешениеСотрудникаПоРезолюции = ВыбранноеЗначение;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "СтраницаДрагМатериалы" Тогда
		
		ЗаполнитьОбъектыСДрагМатериалами();
		ЗаполнитьКлючиСтрокДрагМатериалов();
		
		ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтаФорма);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПроведенияЗаголовок = ?(ЗначениеЗаполнено(ДатыПроведенияДокументов.ДатаПроведения), ДатыПроведенияДокументов.ДатаПроведения, Объект.Дата); 
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

&НаКлиенте
Процедура ПереключательРезервированиеПриИзменении(Элемент)
	РезервированиеНФАКлиент.ПриИзмененииПереключателяРезервирования(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура АннулированПриИзменении(Элемент)
	РезервированиеНФАКлиент.ПриИзмененииФлажкаАннулирован(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОсновныеСредства

&НаКлиенте
Процедура ОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Если ОбщегоНазначенияБГУКлиентСервер.ЗапрещеноДобавлениеСтрокВДокументыНФА(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрослеживаемостьФормыБГУКлиент.ОсновныеСредстваВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
	ОбщегоНазначенияБГУКлиент.РешениеСотрудникаПоРезолюцииВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("Подключаемый_УправлениеПрослеживаемостью", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОсновноеСредствоПриИзменении(Элемент)
	
	ОСПриИзмененииНаСервере(Элементы.ОсновныеСредства.ТекущиеДанные.ПолучитьИдентификатор());
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваИнвентарныйНомерПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ИнвентарныйНомер) Тогда
		ИнвентарныйНомерПриИзмененииНаСервере(Элементы.ОсновныеСредства.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРНПТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	ПараметрыПодбора = ПрослеживаемостьФормыБГУКлиент.ПараметрыОткрытияФормыПодбораРНПТ("ОсновныеСредства");
	ПараметрыПодбора.ЭтоПоступление = Ложь;
	ПараметрыПодбора.ТекущийДокумент = Объект.Ссылка;
	ПараметрыПодбора.Период = Объект.Дата;
	ПараметрыПодбора.ВнеоборотныйАктив = ТекущиеДанные.ОсновноеСредство;
	ПараметрыПодбора.Организация = Объект.Организация;
	ПараметрыПодбора.ИмяКолонкиНоменклатура = "ОсновноеСредство";
	ПараметрыПодбора.ПредставлениеКолонкиНоменклатура = НСтр("ru = 'Основное средство'");
	ПараметрыПодбора.ИмяФормыПодбора = "ФормаПодбораРНПТДляОС";
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, ПараметрыПодбора);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваРНПТОчистка(Элемент, СтандартнаяОбработка)
	СтрокаТабличнойЧасти = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар Тогда
		УдалитьСтрокиРНПТ(СтрокаТабличнойЧасти.ИдентификаторСтроки);
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиентСервер.ОчиститьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваОснованиеНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ВидыПервичныхДокументов.ФормаВыбора", , Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПричинаСписанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ПричинаСписанияНачалоВыбора(
		Элемент, Элементы.ОсновныеСредства.ТекущиеДанные, СтандартнаяОбработка, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредстваПричинаСписанияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	УправлениеОсновнымиСредствамиКлиент.ПричинаСписанияОбработкаВыбора(
		Элементы.ОсновныеСредства.ТекущиеДанные, ВыбранноеЗначение, Ложь);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокНФАДокументаОснования

&НаКлиенте
Процедура СписокНФАДокументаОснованияПриАктивизацииСтроки(Элемент)
	
	Если (Элемент.ТекущиеДанные <> Неопределено) И ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ПодключитьОбработчикОжидания("ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ВыполненныеРаботы

&НаКлиенте
Процедура ВыполненныеРаботыКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВыполненныеРаботы.ТекущиеДанные;
	ТекущиеДанные.ИдентификаторКонтрагента = ИдентификаторКонтрагента(ТекущиеДанные.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолученныеМатериалы

&НаКлиенте
Процедура ПолученныеМатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ПолученныеМатериалы.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолученныеМатериалыНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПолученныеМатериалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		ТекущиеДанные.ЕдиницаИзмерения = ЕдиницаИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	Иначе
		ТекущиеДанные.ЕдиницаИзмерения = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолученныеМатериалыЦенаПриИзменении(Элемент)
	ПересчитатьСтрокуПолученногоМатериала(Элементы.ПолученныеМатериалы.ТекущиеДанные, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ПолученныеМатериалыКоличествоПриИзменении(Элемент)
	ПересчитатьСтрокуПолученногоМатериала(Элементы.ПолученныеМатериалы.ТекущиеДанные, "Количество");
КонецПроцедуры

&НаКлиенте
Процедура ПолученныеМатериалыСуммаПриИзменении(Элемент)
	ПересчитатьСтрокуПолученногоМатериала(Элементы.ПолученныеМатериалы.ТекущиеДанные, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПолученныеМатериалыРешениеСотрудникаПоРезолюцииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ПолученныеМатериалы.ТекущиеДанные;
	ТекущиеДанные.РешениеСотрудникаПоРезолюции = ВыбранноеЗначение;
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Комиссия

&НаКлиенте
Процедура СоставКомиссииПриИзменении(Элемент)
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствияКлиентСервер.ОбновитьИндикатор(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииОтсутствуетПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	Если Не ТекущиеДанные.Отсутствует Тогда
		ТекущиеДанные.ПричинаОтсутствия = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставКомиссии.ТекущиеДанные;
	ТекущиеДанные.Отсутствует = Не ПустаяСтрока(ТекущиеДанные.ПричинаОтсутствия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставКомиссииПричинаОтсутствияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.ПричиныОтсутствияСотрудников.ФормаВыбора",, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТиповыхОпераций

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	ОбщегоНазначенияБГУКлиентСервер.ИзменитьДоступностьРедактированияСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)
	
	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(Элементы[ИмяЭлемента]);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДрагоценныеМатериалыВПолученныхМЦ

&НаКлиенте
Процедура ДрагоценныеМатериалыВПолученныхМЦПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
    Если НоваяСтрока И Не Копирование Тогда
        ТекСтрока = Элементы.ДрагоценныеМатериалыВПолученныхМЦ.ТекущиеДанные;
        ТекСтрока.ЕдИзм = ЕдиницыИзмеренияДрагМатериалов(ТекСтрока.ВидДрагМатериала);
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборОС(Команда)
	
	УправлениеОсновнымиСредствамиКлиент.ОткрытьПодборОсновныхСредств(ЭтаФорма, Объект);
	
КонецПроцедуры

// ГолосованиеКомиссии
&НаКлиенте
Процедура КомандаСохранитьРезультатыГолосования(Команда)
	
	Если Объект.ГолосованиеЗаПолученныеМатериалы Тогда
		ИспользуемаяТаблица = Объект.ПолученныеМатериалы;
	Иначе
		ИспользуемаяТаблица = Объект.ОсновныеСредства;
	КонецЕсли;

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Сотрудник", Сотрудник);
	ДопПараметры.Вставить("РезультатыГолосования",
		УправлениеНФАКлиентСервер.РезультатыГолосованияСотрудника(ИспользуемаяТаблица));
	
	Оповещение = Новый ОписаниеОповещения("ВопросСохранитьРезультатыГолосованияЗавершение", ЭтотОбъект, ДопПараметры);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Сохранить результаты голосования члена комиссии ""%1""?'"), Сотрудник);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВоВсехСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЗаВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("За", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеПротивВВыделенныхСтроках(Команда)
	
	УстановитьРешениеВСтрокахДокумента("Против", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноЗаВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.За"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "За");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеЕдиногласноПротивВоВсехСтроках(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Документ был изменен. Сначала следует записать документ!'"));
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросУстановитьРешениеЕдиногласноЗавершение", ЭтотОбъект,
		ПредопределенноеЗначение("Перечисление.РезультатыГолосованияЧленовКомиссии.Против"));
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Будет установлено и сохранено решение %1 для всех присутствующих членов комиссии по всем строкам документа.
			|Все предыдущие результаты голосования по документу будут перезаписаны.'"), "Против");
	Если Объект.Проведен Тогда
		ТекстВопроса = ТекстВопроса + НСтр("ru = ' Проведение документа будет отменено.'");
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + НСтр("ru = ' Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры
// Конец ГолосованиеКомиссии

&НаКлиенте
Процедура ЗаполнитьСписокДМДляСписания(Команда)
	
	ЗаполнитьСписокДМДляСписанияНаСервере();
	
	ЗаполнитьОбъектыСДрагМатериалами();
	ЗаполнитьКлючиСтрокДрагМатериалов();
	
	ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРежимОтбораДМПоОбъекту(Команда)
	
	ИспользоватьОтборДрагМатериаловПоОбъектуНФА = Не ИспользоватьОтборДрагМатериаловПоОбъектуНФА;
	УстановитьВидимостьДанныхДрагМатериалов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокДрагМатериалыПолученныеПоТехДокументацииПолученныхМЗ(Команда)
	ЗаполнитьСписокДрагМатериалыПолученныеПоТехДокументацииНаСервере();
КонецПроцедуры

// Файлы сотрудников
&НаКлиенте
Процедура НадписьФайлНеВыбранНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		СтандартнаяОбработка = Ложь;
		ОповещениеФайла = Новый ОписаниеОповещения("ОбработатьВыборФайлаСотрудника", ЭтотОбъект);
		РаботаСФайламиКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элементы.ФайлСотрудника, ,ОповещениеФайла);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьУдалитьФайлНажатие(Элемент)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Или Не ЗначениеЗаполнено(ФайлСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрепитьФайлСотрудникаНаСервере();
	
КонецПроцедуры
// Конец Файлы сотрудников

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура ИзменитьРеквизитыСтрокОсновныеСредства(Команда)    
	Реквизиты = Новый Структура("КлассОпасности, 
		|СпособУтилизации, ОснованиеНаименование, ОснованиеДата, ОснованиеНомер, ОснованиеРаботы");
	
	Реквизиты.Вставить("ПричинаСписания", Новый Структура);
	Реквизиты.ПричинаСписания.Вставить("ТипыДляВыбора", 
		Новый ОписаниеТипов("Строка, СправочникСсылка.ПричиныСписанияНФА"));
	Реквизиты.ПричинаСписания.Вставить("СинонимДляВыбора", НСтр("ru = 'Причина списания'")); 

	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект,
		"АктОбУтилизацииОСИК",
		"ОсновныеСредства",
		"ОсновныеСредства",
		Реквизиты);
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРеквизитыСтрокВыполненныеРаботы(Команда)
	УправлениеНФАКлиент.ИзменитьРеквизитыСтрокТЧ(ЭтотОбъект, "АктОбУтилизацииОСИК", "ОсновныеСредства", "ВыполненныеРаботы", 
	"Контрагент, РаботыНаименование, РаботыДата, РаботыНомер, РаботыСодержание");
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокВыбора_СпособыУтилизации()
	Элементы.ОсновныеСредстваСпособУтилизации.СписокВыбора.ЗагрузитьЗначения(УправлениеНФАКлиентСервер.СпособыУтилизацииИмущества());
КонецПроцедуры	

&НаСервере
Процедура УстановитьДопустимыеКодыОперацийПрослеживаемости()

	Если Не ВедетсяУчетПрослеживаемыхТоваров Тогда
		Возврат;
	КонецЕсли;
	
	ВидыОперацийПрослеживаемости = ПрослеживаемостьБГУКлиентСервер.ВидыОперацийПрослеживаемости();
	ВидыОперацийПрослеживаемости.Утилизация = Истина;
	ДанныеВыбора = ПрослеживаемостьБГУКлиентСервер.КодыОперацийПрослеживаемости(ВидыОперацийПрослеживаемости);
	ПрослеживаемостьФормыБГУ.ЗаполнитьСписокВыбораКодаОперацииПрослеживаемости(Элементы.КодОперацииПрослеживаемости, ДанныеВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	РассчитатьПрослеживаемыеТовары();
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект, "ОсновныеСредства");
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	УстановитьВидимостьЭлементов(ЭтотОбъект);
	РезервированиеНФАКлиентСервер.УстановитьПереключательРезервирование(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)
	Элементы = Форма.Элементы;
	
	// Прослеживаемость
	ВидимостьЭлементовПрослеживаемости = Форма.ВедетсяУчетПрослеживаемыхТоваров И Форма.ЕстьПрослеживаемыеТовары;
	
	ИменаЭлементовПрослеживаемости = Новый Массив;
	ИменаЭлементовПрослеживаемости.Добавить("ОсновныеСредстваПрослеживаемыйТовар");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости);
	
	ИменаЭлементовДвиженияПрослеживаемости = Новый Массив;
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("ОсновныеСредстваСтранаПроисхождения");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("ОсновныеСредстваРНПТ");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("КодОперацииПрослеживаемости");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементовДвиженияПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости);
	
	ИменаЭлементов = Новый Массив;
	ИменаЭлементов.Добавить("ОсновныеСредстваРезолюцияКомиссии");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, ИменаЭлементов,
		"Видимость", НЕ Форма.Объект.ГолосованиеЗаПолученныеМатериалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтрокуПолученногоМатериала(Строка, ИмяКолонки)
	Если ИмяКолонки = "Цена" Или ИмяКолонки = "Количество" Тогда
		Строка.Сумма = Строка.Цена * Строка.Количество;
	ИначеЕсли ИмяКолонки = "Сумма" Тогда
		Если Строка.Количество <> 0 Тогда
			Строка.Цена = Строка.Сумма / Строка.Количество;
		Иначе
			Строка.Цена = 0;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Единица измерения номенклатуры.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторЕдиницИзмерения - Единица измерения номенклатуры
&НаСервереБезКонтекста
Функция ЕдиницаИзмеренияНоменклатуры(Знач Номенклатура)
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
	Иначе
		Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	// Решение сотрудника - Основные средства.
	УправлениеНФА.УстановитьУсловноеОформлениеРешенияЧленаКомиссии(УсловноеОформление, "ОсновныеСредства");
	// Решение сотрудника - ПолученныеМатериалы.
	УправлениеНФА.УстановитьУсловноеОформлениеРешенияЧленаКомиссии(УсловноеОформление, "ПолученныеМатериалы");
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПроверяемыхРеквизитов() Экспорт
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Организация");
	
	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаКлиенте
Процедура ДополнитьПараметрыПодбора(ПараметрыПодбора) Экспорт
	
	ПараметрыПодбора.Отбор.Вставить("Организация"	, Объект.Организация);
	ПараметрыПодбора.Отбор.Вставить("ИФО"			, Объект.ИФО);
	ПараметрыПодбора.Отбор.Вставить("Подразделение"	, Объект.Подразделение);
	ПараметрыПодбора.Отбор.Вставить("ЦМО"			, Объект.ЦМО);
	ПараметрыПодбора.Отбор.Вставить("Счет"			, "02.5");
	
	ПараметрыПодбора.Вставить("ВидРаспоряжения", ПредопределенноеЗначение("Перечисление.ВидыРаспоряженияОС.НаХранении"));
	
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		ПараметрыПодбора.Вставить("АдресОСВХранилище", ПоместитьОСВХранилище());
	КонецЕсли;
	
	ПараметрыПодбора.Вставить("СкрытьКолонки", "СчетУчета,Контрагент");
	ПараметрыПодбора.Вставить("ДокументСРезервированиемОС", Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПодборПоОстаткамЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЕстьПрослеживаемыеТоварыСохр = ЕстьПрослеживаемыеТовары;
		ОбработкаВыбораПодбораОсновныхСредствНаСервере(Результат);
		Если ЕстьПрослеживаемыеТоварыСохр <> ЕстьПрослеживаемыеТовары Тогда
			УстановитьВидимостьЭлементов(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодбораОсновныхСредствНаСервере(Знач ВыбранноеЗначение)
	
	ДобавленныеСтроки = УправлениеОсновнымиСредствами.ОбработатьПодборОсновныхСредств(
		Объект.ОсновныеСредства, ВыбранноеЗначение, , "ОсновноеСредство,ИнвентарныйНомер");
		
	ДобавленныеОсновныеСредства = Новый Массив;
	Для Каждого НоваяСтрока Из ДобавленныеСтроки Цикл
		НоваяСтрока.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		Если ЗначениеЗаполнено(НоваяСтрока.ОсновноеСредство) Тогда
			ДобавленныеОсновныеСредства.Добавить(НоваяСтрока.ОсновноеСредство);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДобавленныхОС = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ДобавленныеОсновныеСредства, "ПрослеживаемыйТовар, СтранаПроисхождения");
	Для Каждого НоваяСтрока Из ДобавленныеСтроки Цикл
		ДанныеОС = ДанныеДобавленныхОС.Получить(НоваяСтрока.ОсновноеСредство);
		Если ДанныеОС <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеОС);
		КонецЕсли;
		Если НоваяСтрока.ПрослеживаемыйТовар Тогда
			ЕстьПрослеживаемыеТовары = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьСведенияДокументаСписания(ДобавленныеСтроки);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьОСВХранилище()
	
	ТаблицаОС = Объект.ОсновныеСредства.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТаблицаОС);
	
КонецФункции

&НаСервере
Процедура ОСПриИзмененииНаСервере(ИдентификаторСтроки)
	ТекущиеДанные = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтроки);
	ДанныеОС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.ОсновноеСредство, "ПрослеживаемыйТовар, СтранаПроисхождения");
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеОС);
	
	РассчитатьПрослеживаемыеТовары();
КонецПроцедуры

&НаСервере
Функция ИнвентарныйНомерПриИзмененииНаСервере(ТекущаяСтрока)
	
	ДобавленныеСтроки = Новый Массив;
	ДобавленныеСтроки.Добавить(Объект.ОсновныеСредства.НайтиПоИдентификатору(ТекущаяСтрока));
	
	ЗаполнитьСведенияДокументаСписания(ДобавленныеСтроки);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСведенияДокументаСписания(ДобавленныеСтроки)
	
	СписокОС = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ДобавленныеСтроки Цикл
		СписокОС.Добавить(СтрокаТаблицы.ОсновноеСредство);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период"          , КонецДня(Объект.Дата));
	Запрос.УстановитьПараметр("Организация"     , Объект.Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство", СписокОС);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтоимостьОбъектовОС.Период КАК Период,
	|	СтоимостьОбъектовОС.Регистратор КАК Регистратор,
	|	СтоимостьОбъектовОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СтоимостьОбъектовОС.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СтоимостьОбъектовОС.ВидРаспоряжения КАК ВидРаспоряжения,
	|	СтоимостьОбъектовОС.Стоимость КАК Стоимость,
	|	СтоимостьОбъектовОС.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьОбъектовОС.Регистратор) В (ТИП(Документ.СписаниеОбъектовОС),
	|			ТИП(Документ.СписаниеОбъектовИК))
	|			ТОГДА СтоимостьОбъектовОС.НазваниеДокумента 
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НазваниеДокумента,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьОбъектовОС.Регистратор) В (ТИП(Документ.СписаниеОбъектовОС),
	|			ТИП(Документ.СписаниеОбъектовИК))
	|			ТОГДА СтоимостьОбъектовОС.НомерДокумента 
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СтоимостьОбъектовОС.Регистратор) В (ТИП(Документ.СписаниеОбъектовОС),
	|			ТИП(Документ.СписаниеОбъектовИК))
	|			ТОГДА СтоимостьОбъектовОС.ДатаДокумента 
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ДатаДокумента,
	|	СтоимостьОбъектовОС.Причина КАК ПричинаСписания
	|ПОМЕСТИТЬ ДвиженияСписания1
	|ИЗ
	|	РегистрНакопления.СтоимостьОбъектовОС КАК СтоимостьОбъектовОС
	|ГДЕ
	|	СтоимостьОбъектовОС.Организация = &Организация
	|	И СтоимостьОбъектовОС.ВидРаспоряжения В (ЗНАЧЕНИЕ(Перечисление.ВидыРаспоряженияОС.НаБалансе))
	|	И СтоимостьОбъектовОС.ОсновноеСредство В (&ОсновноеСредство)
	|	И СтоимостьОбъектовОС.Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.Списание)
	|	И СтоимостьОбъектовОС.Активность
	|	И СтоимостьОбъектовОС.Период < &Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписаниеОбъектовИК.Ссылка.Решение КАК Регистратор,
	|	СписаниеОбъектовИК.ОсновноеСредство КАК ОсновноеСредство,
	|	СписаниеОбъектовИК.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА СписаниеОбъектовИК.Ссылка.ПервичныйДокумент <> ЗНАЧЕНИЕ(Справочник.ПервичныеДокументы.ПустаяСсылка)
	|			ТОГДА СписаниеОбъектовИК.Ссылка.Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА СписаниеОбъектовИК.Ссылка.ПервичныйДокумент <> ЗНАЧЕНИЕ(Справочник.ПервичныеДокументы.ПустаяСсылка)
	|			ТОГДА СписаниеОбъектовИК.Ссылка.Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА СписаниеОбъектовИК.Ссылка.ПервичныйДокумент <> ЗНАЧЕНИЕ(Справочник.ПервичныеДокументы.ПустаяСсылка)
	|			ТОГДА СписаниеОбъектовИК.Ссылка.ПервичныйДокумент.ВидПервичногоДокумента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НазваниеДокумента
	|ПОМЕСТИТЬ СписанияИК
	|ИЗ
	|	Документ.СписаниеОбъектовИК.ОсновныеСредства КАК СписаниеОбъектовИК
	|ГДЕ
	|	СписаниеОбъектовИК.Ссылка.Решение В
	|		(ВЫБРАТЬ
	|			Таб.Регистратор
	|		ИЗ
	|			ДвиженияСписания1 КАК Таб)
	|	И СписаниеОбъектовИК.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписаниеТранспорта.Решение,
	|	СписаниеТранспорта.ОсновноеСредство,
	|	СписаниеТранспорта.ИнвентарныйНомер,
	|	СписаниеТранспорта.Дата,
	|	СписаниеТранспорта.Номер,
	|	СписаниеТранспорта.ВидПервичногоДокумента
	|ИЗ
	|	Документ.СписаниеТранспортаИК КАК СписаниеТранспорта
	|ГДЕ
	|	СписаниеТранспорта.Решение В
	|		(ВЫБРАТЬ
	|			Таб.Регистратор
	|		ИЗ
	|			ДвиженияСписания1 КАК Таб)
	|	И СписаниеТранспорта.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияСписания1.Период КАК Период,
	|	ДвиженияСписания1.ОсновноеСредство КАК ОсновноеСредство,
	|	ДвиженияСписания1.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ДвиженияСписания1.ВидРаспоряжения КАК ВидРаспоряжения,
	|	ДвиженияСписания1.Стоимость КАК Стоимость,
	|	ДвиженияСписания1.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ СписанияИК.НазваниеДокумента ЕСТЬ NULL
	|		И СписанияИК.НазваниеДокумента <> """"
	|			ТОГДА СписанияИК.НазваниеДокумента
	|		ИНАЧЕ ДвиженияСписания1.НазваниеДокумента
	|	КОНЕЦ КАК НазваниеДокумента,
	|	ВЫБОР
	|		КОГДА НЕ СписанияИК.НазваниеДокумента ЕСТЬ NULL
	|		И СписанияИК.НазваниеДокумента <> """"
	|			ТОГДА СписанияИК.НомерДокумента
	|		ИНАЧЕ ДвиженияСписания1.НомерДокумента
	|	КОНЕЦ КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА НЕ СписанияИК.НазваниеДокумента ЕСТЬ NULL
	|		И СписанияИК.НазваниеДокумента <> """"
	|			ТОГДА СписанияИК.ДатаДокумента
	|		ИНАЧЕ ДвиженияСписания1.ДатаДокумента
	|	КОНЕЦ КАК ДатаДокумента,
	|	ДвиженияСписания1.ПричинаСписания КАК ПричинаСписания
	|ПОМЕСТИТЬ ДвиженияСписания
	|ИЗ
	|	ДвиженияСписания1 КАК ДвиженияСписания1
	|		ЛЕВОЕ СОЕДИНЕНИЕ СписанияИК КАК СписанияИК
	|		ПО ДвиженияСписания1.Регистратор = СписанияИК.Регистратор
	|		И ДвиженияСписания1.ОсновноеСредство = СписанияИК.ОсновноеСредство
	|		И ДвиженияСписания1.ИнвентарныйНомер = СписанияИК.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияСписания.ОсновноеСредство КАК ОсновноеСредство,
	|	ДвиженияСписания.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	МАКСИМУМ(ДвиженияСписания.Период) КАК Период
	|ПОМЕСТИТЬ МаксПериодСписания
	|ИЗ
	|	ДвиженияСписания КАК ДвиженияСписания
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСписания.ОсновноеСредство,
	|	ДвиженияСписания.ИнвентарныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ДвиженияСписания.ОсновноеСредство, ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)) КАК ОсновноеСредство,
	|	ЕСТЬNULL(ДвиженияСписания.ИнвентарныйНомер, """") КАК ИнвентарныйНомер,
	|	ЕСТЬNULL(ДвиженияСписания.НазваниеДокумента, """") КАК НазваниеДокумента,
	|	ЕСТЬNULL(ДвиженияСписания.НомерДокумента, """") КАК НомерДокумента,
	|	ЕСТЬNULL(ДвиженияСписания.ДатаДокумента, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокумента,
	|	ЕСТЬNULL(ДвиженияСписания.ПричинаСписания, """") КАК ПричинаСписания
	|ИЗ
	|	МаксПериодСписания КАК МаксПериодСписания
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСписания КАК ДвиженияСписания
	|		ПО МаксПериодСписания.ОсновноеСредство = ДвиженияСписания.ОсновноеСредство
	|		И МаксПериодСписания.ИнвентарныйНомер = ДвиженияСписания.ИнвентарныйНомер
	|		И МаксПериодСписания.Период = ДвиженияСписания.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвиженияСписания.ОсновноеСредство КАК ОсновноеСредство,
	|	ДвиженияСписания.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	СУММА(ДвиженияСписания.Стоимость) КАК Стоимость,
	|	СУММА(ДвиженияСписания.Количество) КАК Количество
	|ИЗ
	|	ДвиженияСписания КАК ДвиженияСписания
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияСписания.ОсновноеСредство,
	|	ДвиженияСписания.ИнвентарныйНомер";
	
	Результат = Запрос.ВыполнитьПакет();
	ДокументыСписания = Результат[4].Выгрузить();
	СтоимостьСписания = Результат[5].Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ДобавленныеСтроки Цикл
		
		Отбор = Новый Структура("ОсновноеСредство,ИнвентарныйНомер", СтрокаТаблицы.ОсновноеСредство, СтрокаТаблицы.ИнвентарныйНомер);
		
		Данные = ДокументыСписания.НайтиСтроки(Отбор);
		Если Данные.Количество() > 0 Тогда
			СтрокаТаблицы.ОснованиеНаименование	= Данные[0].НазваниеДокумента;
			СтрокаТаблицы.ОснованиеДата			= Данные[0].ДатаДокумента;
			СтрокаТаблицы.ОснованиеНомер		= Данные[0].НомерДокумента;
			СтрокаТаблицы.ПричинаСписания		= Данные[0].ПричинаСписания;
		КонецЕсли;
		
		Данные = СтоимостьСписания.НайтиСтроки(Отбор);
		Если Данные.Количество() > 0 Тогда 
			СтрокаТаблицы.БалансоваяСтоимость = СтрокаТаблицы.Количество * 
			Данные[0]["Стоимость"] / ?(Данные[0]["Количество"] = 0, 1, Данные[0]["Количество"]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияПриИзменении(Элемент)
	
	КомиссияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КомиссияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ЗаполнитьСоставКомиссии(ЭтаФорма);
	
	// ГолосованиеКомиссии
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	// Конец ГолосованиеКомиссии
	
	// ИндикаторКворумаПрисутствия
	ИндикаторКворумаПрисутствия.КомиссияПриИзмененииНаСервере(ЭтотОбъект);
	// Конец ИндикаторКворумаПрисутствия
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИдентификаторКонтрагента(Контрагент)
	
	Возврат БухгалтерскийУчет.ИдентификаторКонтрагента(Контрагент);
	
КонецФункции

&НаСервере
Процедура УдалитьСтрокиРНПТ(Знач ИдентификаторСтроки)
	СтрокиСРНПТ = Объект.СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	
	Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
		Объект.СведенияПрослеживаемости.Удалить(СтрокаСРНПТ);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)

	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТННаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
		СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки, ВыбранноеЗначение, СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр)
	
	СтрокаТабличнойЧасти = Объект.ОсновныеСредства.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТН(ЭтотОбъект, ИдентификаторСтроки, ВыбранноеЗначение);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТ(ЭтаФорма, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеПрослеживаемостью()

	РассчитатьПрослеживаемыеТовары();
	УстановитьВидимостьЭлементов(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура РассчитатьПрослеживаемыеТовары()

	ПрослеживаемыеТовары     = Объект.ОсновныеСредства.НайтиСтроки(Новый Структура("ПрослеживаемыйТовар", Истина));
	ЕстьПрослеживаемыеТовары = ПрослеживаемыеТовары.Количество() > 0;

КонецПроцедуры

#Область УчетДрагМатериалов

&НаСервере
Процедура ЗаполнитьСписокДМДляСписанияНаСервере()
	
	ПараметрыПолученияОстатков = УправлениеОсновнымиСредствами.СтруктураПараметровПолученияОстатков(Объект);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыПолученияОстатков.Ссылка) Тогда
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Период, ВидГраницы.Включая);
	Иначе
		ПериодОстатков = Новый Граница(ПараметрыПолученияОстатков.Ссылка.МоментВремени(), ВидГраницы.Исключая);
	КонецЕсли;
	
	ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков);
	
	УчетДрагМатериалов.ЗаполнитьИсточникиОбразованияЛомаОтходовДрагМатериалов(Объект.Организация, Объект.ДрагоценныеМатериалы, Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДМДляСписанияНаСервере(ПериодОстатков)
	
	ТаблицаСписанияОбъектов = Объект.ОсновныеСредства.Выгрузить(, "ОсновноеСредство,ИнвентарныйНомер,Количество");
	ТаблицаСписанияОбъектов.Колонки.ОсновноеСредство.Имя = "ОбъектНФА";
	ТаблицаСписанияОбъектов.Колонки.ИнвентарныйНомер.Имя = "ИнвНомер";
	
	ОстаткиДМ = УчетДрагМатериалов.ЗаполнитьДМДляСписанияОС(Объект.Организация, ТаблицаСписанияОбъектов, ПериодОстатков);
	
	ТаблицаДМДляНФА = Объект.ОсновныеСредства.Выгрузить(, "ОсновноеСредство,ИнвентарныйНомер,Количество");
	ОстаткиДМ = УчетДрагМатериалов.СодержаниеДрагМатериаловСУчетомТехДокументации(ОстаткиДМ, ТаблицаДМДляНФА, "ОС");  
	
	Объект.ДрагоценныеМатериалы.Загрузить(ОстаткиДМ);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	
	Для каждого ТекСтрока Из Объект.ДрагоценныеМатериалы Цикл
		ТекСтрока.КлючСтроки = УчетДрагМатериаловКлиент.ПолучитьКлючСтроки(ТекСтрока.ОбъектНФА, ТекСтрока.ИнвНомер);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъектыСДрагМатериалами()
	
	ТаблицаВсехОбъектов = Объект.ОсновныеСредства.Выгрузить(,"ОсновноеСредство, ИнвентарныйНомер, Количество");
	
	ТаблицаОбъектовОС = Новый ТаблицаЗначений;
	ТаблицаОбъектовОС.Колонки.Добавить("КлючСтроки"			, Новый ОписаниеТипов("Строка"));
	ТаблицаОбъектовОС.Колонки.Добавить("ОсновноеСредство"	, Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства"));
	ТаблицаОбъектовОС.Колонки.Добавить("ИнвентарныйНомер"	, Новый ОписаниеТипов("СправочникСсылка.ИнвентарныеНомераОС"));
	ТаблицаОбъектовОС.Колонки.Добавить("Количество"			, Новый ОписаниеТипов("Число"));
	ТаблицаОбъектовОС.Колонки.Добавить("КоличествоВсегоДМ"	, Новый ОписаниеТипов("Число"));
	
	МассивСчетовОС = УчетДрагМатериалов.ПолучитьМассивСчетовДМДляОС();
	
	Для Каждого ТекСтрока Из ТаблицаВсехОбъектов Цикл
		НоваяСтрока = ТаблицаОбъектовОС.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.КлючСтроки = УчетДрагМатериалов.ПолучитьКлючСтроки(ТекСтрока.ОсновноеСредство, ТекСтрока.ИнвентарныйНомер); 
	КонецЦикла;
	
	ОбъектыНФАСДрагМатериалами.Загрузить(ТаблицаОбъектовОС);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДанныхДрагМатериалов()
	
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Истина;
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
		
		Если Элементы.СписокНФАДокументаОснования.ТекущиеДанные <> Неопределено Тогда
			ОтборДрагМатериаловДляОбъекта(Элементы.СписокНФАДокументаОснования.ТекущиеДанные.КлючСтроки);
		КонецЕсли;
	Иначе
		Элементы.ДрагоценныеМатериалыУстановитьРежимОтбораДМПоОбъекту.Пометка = Ложь;
		Элементы.ДрагоценныеМатериалы.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	//Заголовки
	РеквизитыДрагМатериалы = Новый Массив;
	
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоВсегоДМЗаголовок");
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоЗаголовок");
	
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличествоВсегоДМ");
	РеквизитыДрагМатериалы.Добавить("СписокНФАДокументаОснованияКоличество");
	
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы,
		РеквизитыДрагМатериалы, "Видимость", Истина);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектовДрагМатериалов(ТекущаяСтрока)
	
	ТекущаяСтрока.КоличествоВсегоДМЗаголовок = НСтр("ru = 'Всего:'");
	ТекущаяСтрока.КоличествоЗаголовок = НСтр("ru = 'Списать:'");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовковВсехСтрокТаблицыОбъектовДрагМатериалов(Форма)
	
	Для каждого ТекущаяСтрока Из Форма.ОбъектыНФАСДрагМатериалами Цикл
		ОбновитьТекстЗаголовковВСтрокеТаблицыОбъектовДрагМатериалов(ТекущаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДрагМатериаловДляОбъекта(КлючСтроки)
	
	Элементы.ДрагоценныеМатериалы.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки",КлючСтроки));
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗаполнитьКлючиСтрокДрагМатериалов()
	
	Если ИспользоватьОтборДрагМатериаловПоОбъектуНФА Тогда
		ЗаполнитьКлючевоеПолеСтрокДрагМатериалов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОДрагМатериалах(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Параметры.НайденныеСтроки Цикл
		Объект.ДрагоценныеМатериалы.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьСтрокиТаблицыДрагМатериаловПриАктивизацииОбъектаНФА()
	Элемент = Элементы.СписокНФАДокументаОснования;
	ОтборДрагМатериаловДляОбъекта(Элемент.ТекущиеДанные.КлючСтроки);
КонецПроцедуры

&НаСервере
Функция ЕдиницыИзмеренияДрагМатериалов(ВидДрагМатериала)
	Возврат УчетДрагМатериалов.ЕдиницыИзмеренияДрагМатериалов(ВидДрагМатериала);
КонецФункции	

&НаСервере
Процедура ЗаполнитьСписокДрагМатериалыПолученныеПоТехДокументацииНаСервере()
 	КС = Новый КвалификаторыСтроки(100);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	
	ТаблицаНФА = Объект.ПолученныеМатериалы.Выгрузить();
	ТаблицаНФА.Колонки.Добавить("КлючСтроки", ОписаниеТиповС, "Ключ строки", 100);
	УчетДрагМатериалов.ЗаполнитьДляМЗДанныеОСодержанииДрагМатериаловТехДокументацииПоДеталям(ТаблицаНФА, "ОсновныеСредства");
	Объект.ДрагоценныеМатериалыВПолученныхМЦ.Загрузить(ТаблицаНФА);
КонецПроцедуры	

#КонецОбласти

#Область ГолосованиеКомиссии

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СохранитьРезультатыГолосования1", "Доступность",
			ЗначениеЗаполнено(Форма.Сотрудник)
				И Форма.РешениеСотрудникаМодифицированность
				И Не Форма.Объект.ГолосованиеЗаПолученныеМатериалы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"СохранитьРезультатыГолосования", "Доступность",
			ЗначениеЗаполнено(Форма.Сотрудник)
				И Форма.РешениеСотрудникаМодифицированность
				И Форма.Объект.ГолосованиеЗаПолученныеМатериалы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРешениеВСтрокахДокумента(РешениеСотрудника, ВоВсехСтроках = Истина)
	
	Если Объект.ГолосованиеЗаПолученныеМатериалы Тогда
		ОбрабатываемаяТаблица = Объект.ПолученныеМатериалы;
		ЭлементТаблица = Элементы.ПолученныеМатериалы;	
	Иначе
		ОбрабатываемаяТаблица = Объект.ОсновныеСредства;
		ЭлементТаблица = Элементы.ОсновныеСредства;
	КонецЕсли;	
	УправлениеНФАКлиентСервер.УстановитьРешениеВСтрокахДокумента(ОбрабатываемаяТаблица,
		РешениеСотрудника,
		ВоВсехСтроках,
		ЭлементТаблица.ВыделенныеСтроки);
	
	РешениеСотрудникаМодифицированность = Истина;
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохранитьРезультатыГолосованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьРезультатыГолосованияНаСервере(ДополнительныеПараметры.Сотрудник, ДополнительныеПараметры.РезультатыГолосования);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРезультатыГолосованияНаСервере(ЧленКомиссии, РезультатыГолосования)
	
	ОбщегоНазначенияБГУ.СохранитьРезультатыГолосованияНаСервере(Объект, ЧленКомиссии, РезультатыГолосования);
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановитьРешениеЕдиногласноЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		УстановитьРешениеЕдиногласноНаСервере(ДополнительныеПараметры);
		ОповеститьОбИзменении(Объект.Ссылка);
	КонецЕсли;
	
	РешениеСотрудникаМодифицированность = Ложь; // При любом ответе сбрасываем признак модифицированности.
	УстановитьДоступностьКнопкиСохранитьРезультатыГолосования(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРешениеЕдиногласноНаСервере(РезультатГолосования)
	
	Если Объект.ГолосованиеЗаПолученныеМатериалы Тогда
		ОбщегоНазначенияБГУ.УстановитьРешениеЕдиногласноНаСервере(Объект, "ПолученныеМатериалы", РезультатГолосования);
	Иначе
		ОбщегоНазначенияБГУ.УстановитьРешениеЕдиногласноНаСервере(Объект, "ОсновныеСредства", РезультатГолосования);
	КонецЕсли;
	РешениеСотрудникаМодифицированность = Ложь;
	
	ОбщегоНазначенияБГУ.ЗаполнитьРезультатГолосования(ЭтотОбъект);
	ОбщегоНазначенияБГУ.УправлениеЭлементамиГолосования(ЭтотОбъект);
	
КонецПроцедуры

// Файлы сотрудников

&НаКлиенте
Процедура ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ЗначениеВыбора) Тогда
		ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыборФайлаСотрудникаНаСервере(ЗначениеВыбора)
	
	УправлениеНФА.ОбработатьВыборФайлаСотрудника(ЗначениеВыбора, Сотрудник, ПараметрыФайлаСотрудника());
	
КонецПроцедуры

&НаСервере
Процедура ОткрепитьФайлСотрудникаНаСервере()
	
	УправлениеНФА.ОткрепитьФайлСотрудника(ФайлСотрудника, Сотрудник, ПараметрыФайлаСотрудника());
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФайлаСотрудника()
	ПараметрыФайлаСотрудника = УправлениеНФА.ФайлСотрудника_Параметры(ЭтотОбъект);
	Если НЕ Объект.ГолосованиеЗаПолученныеМатериалы Тогда
		ПараметрыФайлаСотрудника.ПолеФайла = "ФайлСотрудника";
		ПараметрыФайлаСотрудника.ПолеНадписи = "НадписьФайлНеВыбран1";
		ПараметрыФайлаСотрудника.ПолеУдалить = "НадписьУдалитьФайл1";
		ПараметрыФайлаСотрудника.ЭлементПолеФайла = "ФайлСотрудника1";
	КонецЕсли;
	Возврат ПараметрыФайлаСотрудника
КонецФункции

// Конец Файлы сотрудников

#КонецОбласти

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
