
//////////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ОТЧЕТЫ, КЛИЕНТСЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ                      //
//////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПолучитьТипГруппировки(Поле, ТипГруппировки = Неопределено) Экспорт
	
	Если Поле = "Период" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтандартныеОтчетыГруппировкаПериод.ПоДням");
		
	Иначе
		
		Возврат ПредопределенноеЗначение("Перечисление.ТипыДетализацииСтандартныхОтчетов.Элементы");
		
	КонецЕсли;
	
КонецФункции

// Получает параметр вывода компоновщика настроек или настройки СКД
//
// Параметры:
//		КомпоновщикНастроекГруппировка - компоновщик настроек или настройка/группировка СКД
//		ИмяПараметра - имя параметра СКД
//
Функция ПолучитьПараметрВывода(Настройка, ИмяПараметра) Экспорт
	
	МассивПараметров   = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяПараметра, ".");
	УровеньВложенности = МассивПараметров.Количество();
	
	Если УровеньВложенности > 1 Тогда
		ИмяПараметра = МассивПараметров[0];		
	КонецЕсли;
	
	Если ТипЗнч(Настройка) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройка.Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Иначе
		ЗначениеПараметра = Настройка.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	КонецЕсли;
	
	Если УровеньВложенности > 1 Тогда
		Для Индекс = 1 По УровеньВложенности - 1 Цикл
			ИмяПараметра = ИмяПараметра + "." + МассивПараметров[Индекс];
			ЗначениеПараметра = ЗначениеПараметра.ЗначенияВложенныхПараметров.Найти(ИмяПараметра); 
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЗначениеПараметра;  
	
КонецФункции

// Устанавливает параметр вывода компоновщика настроек или настройки СКД
//
// Параметры:
//		КомпоновщикНастроекГруппировка - компоновщик настроек или настройка/группировка СКД
//		ИмяПараметра - имя параметра СКД
//		Значение - значение параметра вывода СКД
//		Использование - Признак использования параметра. По умолчанию всегда принимается равным истине.
//
Функция УстановитьПараметрВывода(Настройка, ИмяПараметра, Значение, Использование = Истина) Экспорт
	
	ЗначениеПараметра = ПолучитьПараметрВывода(Настройка, ИмяПараметра);
	
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Использование;
		ЗначениеПараметра.Значение      = Значение;
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

// Удаляет отбор из коллекцию отборов компоновщика или группы отборов
//
// Параметры:
//		ЭлементСтруктуры - элемент структуры
//		Поле             - имя поля, по которому добавляется отбор
//		Значение         - значение отбора
//		ВидСравнения     - вид сравнений компоновки данных (по умолчанию: вид сравнения)
//		Использование    - признак использования отбора (по умолчанию: истина)
//
Функция УдалитьОтбор(ЭлементСтруктуры, Знач Поле, ВПользовательскиеНастройки = Ложь) Экспорт
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
		Если ВПользовательскиеНастройки Тогда
			Для Каждого ЭлементНастройки Из ЭлементСтруктуры.ПользовательскиеНастройки.Элементы Цикл	
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементСтруктуры.Настройки.Отбор.ИдентификаторПользовательскойНастройки Тогда
					Отбор = ЭлементНастройки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
	
	Возврат УдалитьПолеОтбора(Отбор, Поле);
	
	Возврат Ложь; // не удалили отбор
	
КонецФункции

Функция УдалитьПолеОтбора(Отбор, Поле)

	Вернуть = Ложь;

	й = 0;
	Пока й < Отбор.Элементы.Количество() Цикл
		Элемент = Отбор.Элементы[й];
		Если Тип(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Удалили = УдалитьПолеОтбора(Элемент, Поле);
			Вернуть = Истина;
		Иначе
			Если Элемент.ЛевоеЗначение = Поле Тогда
				Отбор.Элементы.Удалить(Элемент);
				й = й - 1;
				Вернуть = Истина;
			КонецЕсли;
		КонецЕсли;
		й = й + 1;
	КонецЦикла;

	Возврат Вернуть;

КонецФункции


Процедура ИзменитьОтборПоОрганизации(Куда) Экспорт
	
	СтандартныеОтчетыКлиентСервер.УдалитьОтбор(Куда.КомпоновщикНастроек, "Организация", Истина);
	Если ЗначениеЗаполнено(Куда.Организация) Тогда
		НовыйОтбор = СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Куда.КомпоновщикНастроек, "Организация", Куда.Организация,,, Истина);
		НовыйОтбор.Представление = "###ОтборПоОрганизация###"; 
		НовыйОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьОтборПоПодразделению(Куда) Экспорт
	
	СтандартныеОтчетыКлиентСервер.УдалитьОтбор(Куда.КомпоновщикНастроек, "Подразделение", Истина);
	Если ЗначениеЗаполнено(Куда.Подразделение) Тогда
		НовыйОтбор = СтандартныеОтчетыКлиентСервер.ДобавитьОтбор(Куда.КомпоновщикНастроек, "Подразделение", Куда.Подразделение,,, Истина);
		НовыйОтбор.Представление = "###ОтборПоПодразделению###"; 
		НовыйОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
КонецПроцедуры

// Рекурсивная функция нахождения поля в отборе
Функция НайтиЭлементОтбора(Отбор, Поле) Экспорт
	
	ПолеОтбора = ?(ТипЗнч(Поле) = Тип("Строка"), Новый ПолеКомпоновкиДанных(Поле), Поле);
	
	Для Каждого Элемент Из Отбор.Элементы Цикл
		Если Тип(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			Вернем = НайтиЭлементОтбора(Элемент, ПолеОтбора);
			Если Вернем <> Неопределено Тогда
				Возврат Вернем;
			КонецЕсли;
		Иначе
			Если Элемент.ЛевоеЗначение = ПолеОтбора Тогда
				Возврат Элемент;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет отбор в коллекцию отборов компоновщика или группы отборов
//
// Параметры:
//		ЭлементСтруктуры - элемент структуры
//		Поле             - имя поля, по которому добавляется отбор
//		Значение         - значение отбора
//		ВидСравнения     - вид сравнений компоновки данных (по умолчанию: вид сравнения)
//		Использование    - признак использования отбора (по умолчанию: истина)
//
Функция ДобавитьОтбор(ЭлементСтруктуры, Знач Поле, Значение, ВидСравнения = Неопределено, Использование = Истина, ВПользовательскиеНастройки = Ложь, РежимОтображения = Неопределено) Экспорт
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Настройки.Отбор;
		
		Если ВПользовательскиеНастройки Тогда
			Для Каждого ЭлементНастройки Из ЭлементСтруктуры.ПользовательскиеНастройки.Элементы Цикл	
				Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ЭлементСтруктуры.Настройки.Отбор.ИдентификаторПользовательскойНастройки Тогда
					Отбор = ЭлементНастройки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		Отбор = ЭлементСтруктуры.Отбор;
	Иначе
		Отбор = ЭлементСтруктуры;
	КонецЕсли;
		
	Если ВидСравнения = Неопределено Тогда
		ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	НовыйЭлемент = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение    = Поле;
	НовыйЭлемент.Использование    = Использование;
	НовыйЭлемент.ВидСравнения     = ВидСравнения;
	НовыйЭлемент.ПравоеЗначение   = Значение;
	НовыйЭлемент.РежимОтображения = ?(РежимОтображения = Неопределено, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, РежимОтображения);
	
	Возврат НовыйЭлемент;
	
КонецФункции

// Функция добавляет выбранное поле и возвращает элемент выбранного поля. 
//
// Параметры:
//		ЭлементСтруктуры - компоновщик настроек, настройка СКД, элемент структуры настройки отчета
//		Поле - имя поля, которое нужно добавить в СКД
//		Заголовок - заголовок добавляемого поля
//
Функция ДобавитьВыбранноеПоле(ЭлементСтруктуры, Знач Поле, Заголовок = Неопределено) Экспорт
	
	Если ТипЗнч(ЭлементСтруктуры) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Настройки.Выбор;
	ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("НастройкиКомпоновкиДанных") Тогда
		ВыбранныеПоля = ЭлементСтруктуры.Выбор;
	Иначе
		ВыбранныеПоля = ЭлементСтруктуры;
	КонецЕсли;
	
	Если ТипЗнч(Поле) = Тип("Строка") Тогда
		Поле = Новый ПолеКомпоновкиДанных(Поле);
	КонецЕсли;
	ВыбранноеПоле = ВыбранныеПоля.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Поле = Поле;
	Если Заголовок <> Неопределено Тогда
		ВыбранноеПоле.Заголовок = Заголовок;
	КонецЕсли;
	
	Возврат ВыбранноеПоле;
	
КонецФункции

// Добавляет в набор данных поле набора данных
Функция ДобавитьПолеНабораДанных(НаборДанных, Поле, Заголовок, ПутьКДанным = Неопределено) Экспорт
	
	Если ПутьКДанным = Неопределено Тогда
		ПутьКДанным = Поле;
	КонецЕсли;
	
	ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
	ПолеНабораДанных.Поле        = Поле;
	ПолеНабораДанных.Заголовок   = Заголовок;
	ПолеНабораДанных.ПутьКДанным = ПутьКДанным;
	Возврат ПолеНабораДанных;
	
КонецФункции

// Функция добавляет поле итога в схему компоновки данных. Если параметр Выражение не указан, используется Сумма(ПутьКДанным)
Функция ДобавитьПолеИтога(СхемаКомпоновкиДанных, ПутьКДанным, Выражение = Неопределено) Экспорт
	
	Если Выражение = Неопределено Тогда
		Выражение = "Сумма(" + ПутьКДанным + ")";
	КонецЕсли;
	
	ПолеИтога = СхемаКомпоновкиДанных.ПоляИтога.Добавить();
	ПолеИтога.ПутьКДанным = ПутьКДанным;
	ПолеИтога.Выражение = Выражение;
	Возврат ПолеИтога;
	
КонецФункции

// Добавляет в набор данных поля периода Период секунда, минута, час ....
Функция ДобавитьПоляПериодаВНаборДанных(НаборДанных) Экспорт
	
	СписокПериодов = Новый СписокЗначений;
	СписокПериодов.Добавить("ПериодСекунда",   "Период секунда");
	СписокПериодов.Добавить("ПериодМинута",    "Период минута");
	СписокПериодов.Добавить("ПериодЧас",       "Период час");
	СписокПериодов.Добавить("ПериодДень",      "Период день");
	СписокПериодов.Добавить("ПериодНеделя",    "Период неделя");
	СписокПериодов.Добавить("ПериодДекада",    "Период декада");
	СписокПериодов.Добавить("ПериодМесяц",     "Период месяц");
	СписокПериодов.Добавить("ПериодКвартал",   "Период квартал");
	СписокПериодов.Добавить("ПериодПолугодие", "Период полугодие");
	СписокПериодов.Добавить("ПериодГод",       "Период год");
	
	ИмяПапки = "Периоды";
	СписокПолейНабораДанных = Новый СписокЗначений;
	ПапкаПолейНабораДанных = НаборДанных.Поля.Добавить(Тип("ПапкаПолейНабораДанныхСхемыКомпоновкиДанных"));
	ПапкаПолейНабораДанных.Заголовок   = ИмяПапки;
	ПапкаПолейНабораДанных.ПутьКДанным = ИмяПапки;
	
	Для каждого Период Из СписокПериодов Цикл
		ПолеНабораДанных = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабораДанных.Поле        = Период.Значение;
		ПолеНабораДанных.Заголовок   = Период.Представление;
		ПолеНабораДанных.ПутьКДанным = ИмяПапки + "." + Период.Значение;
		СписокПолейНабораДанных.Добавить(ПолеНабораДанных);
	КонецЦикла;
	
	Возврат СписокПолейНабораДанных;
	
КонецФункции

// Добавляет в группировку автовыбранное поле
Функция ДобавитьАвтоВыбранноеПоле(Структура) Экспорт
	
	ВыбранноеПоле = Структура.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	Возврат ВыбранноеПоле;
	
КонецФункции

// Функция возвращает значение параметра компоновки данных
//
// Параметры:
//  Настройки - Пользовательские настройки СКД, Настройки СКД, Компоновщик настроек
//  Параметр - имя параметра СКД для которого нужно вернуть значение параметра
Функция ПолучитьПараметр(Настройки, Параметр) Экспорт
	
	ЗначениеПараметра = Неопределено;
	ПолеПараметр = ?(ТипЗнч(Параметр) = Тип("Строка"), Новый ПараметрКомпоновкиДанных(Параметр), Параметр);
	
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из Настройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Настройки) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		Для Каждого ЭлементНастройки Из Настройки.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(ЭлементНастройки) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") И ЭлементНастройки.Параметр = ПолеПараметр Тогда
				ЗначениеПараметра = ЭлементНастройки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеПараметра = Неопределено Тогда
			ЗначениеПараметра = Настройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Настройки) = Тип("ДанныеРасшифровкиКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.Найти(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("ОформлениеКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.НайтиЗначениеПараметра(ПолеПараметр);
	ИначеЕсли ТипЗнч(Настройки) = Тип("ОформлениеПоляОбластиКомпоновкиДанных") Тогда
		ЗначениеПараметра = Настройки.НайтиЗначениеПараметра(ПолеПараметр);
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

// Функция устанавливает значение параметра компоновки данных
//
// Параметры:
//		Настройки     - Пользовательские настройки СКД, Настройки СКД, Компоновщик настроек
//		Параметр      - имя параметра СКД для которого нужно вернуть значение параметра
//      Значение      - значение параметра
//		Использование - Признак использования параметра. По умолчанию всегда принимается равным истине.
//
Функция УстановитьПараметр(Настройки, Параметр, Значение, Использование = Истина) Экспорт
	
	ЗначениеПараметра = ПолучитьПараметр(Настройки, Параметр);
	
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Использование;
		ЗначениеПараметра.Значение      = Значение;
	КонецЕсли;
	
	Возврат ЗначениеПараметра;
	
КонецФункции

Функция ПолучитьПредставлениеПериода(Начало = Неопределено, Конец = Неопределено, ТолькоДаты  = Ложь, ТипПериода = Неопределено, ТолькоУказанныйПериод = Ложь, ФинансовыйПериод = Ложь) Экспорт
	
	ТекстПериод = "";
	
	Если НЕ ТолькоУказанныйПериод Тогда
		НачалоПериода = Начало; 
		КонецПериода = Конец;
	Иначе
	    НачалоПериода = НачалоГода(Начало); 
		КонецПериода = КонецГода(Конец);
	КонецЕсли;
	
	ФорматнаяСтрока = ?(ФинансовыйПериод, "ФП=Истина", "ФП=Ложь");
	Язык = СтандартныеОтчетыВызовСервера.ПолучитьЛокейл();
	Если СтрДлина(Язык) Тогда
	    ФорматнаяСтрока = ФорматнаяСтрока + "; Л=" + Язык;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда 
		Если КонецПериода >= НачалоПериода Тогда
			ТекстПериод = ?(ТолькоДаты, "", " за ") + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), ФорматнаяСтрока);
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(НачалоПериода) И Не ЗначениеЗаполнено(КонецПериода) Тогда
		ТекстПериод = ?(ТолькоДаты, "", " за ") + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(Дата(3999, 11, 11)), ФорматнаяСтрока);
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, Найти(ТекстПериод, " - ")), " - ...");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипПериода) Тогда
		ТекстПериод = ТекстПериод + ?(ТолькоУказанныйПериод, " ", " включая ");
		ТекстПериод = ТекстПериод + НРег(ТипПериода);
	КонецЕсли;
		
	Возврат ТекстПериод;
	
КонецФункции

Функция ПолучитьИдентификаторОбъекта(Форма) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Форма.ИмяФормы, ".")[1];
	
КонецФункции

Функция ПростойТип(Значение) Экспорт
	
	ОписаниеПростыхТипов = Новый ОписаниеТипов("Дата, Строка, Булево, Число");
	
	Возврат ОписаниеПростыхТипов.СодержитТип(ТипЗнч(Значение));
	
КонецФункции

Функция КонецПериода(Период, Периодичность) Экспорт
	
	КонецПериода = Период;
	Если Периодичность = 6 Тогда       //День
		КонецПериода = КонецДня(Период);
	ИначеЕсли Периодичность = 7 Тогда  //Неделя
		КонецПериода = КонецНедели(Период);
	ИначеЕсли Периодичность = 8 Тогда  //Декада
		Если День(Период) > 20 Тогда
			КонецПериода = КонецМесяца(Период);
		Иначе
			КонецПериода = КонецДня(Период + 10 * 86400 - 1);
		КонецЕсли; 
	ИначеЕсли Периодичность = 9 Тогда  //Месяц
		КонецПериода = КонецМесяца(Период);
	ИначеЕсли Периодичность = 10 Тогда //Квартал
		КонецПериода = КонецКвартала(Период);
	ИначеЕсли Периодичность = 11 Тогда //Полугодие
		КонецПериода = ?(Месяц(Период) < 7, КонецДня(Дата(Год(Период), 6, 30)), КонецДня(Дата(Год(Период), 12, 31)));
	ИначеЕсли Периодичность = 12 Тогда //Год
		КонецПериода = КонецГода(Период);
	КонецЕсли;
	
	Возврат КонецПериода;
	
КонецФункции

Функция ПолучитьНаименованиеЗаданияВыполненияОтчета(Форма) Экспорт
	
	НаименованиеЗадания = НСтр("ru = 'Выполнение отчета: %1'");
	ИмяОтчета = ПолучитьИдентификаторОбъекта(Форма);
	НаименованиеЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НаименованиеЗадания, ИмяОтчета);
	
	Возврат НаименованиеЗадания;
	
КонецФункции

// Копирует (добавляет) элементы отбора. Копируются в приемник только допустимые поля отбора.
//
// Параметры:
//	ОтборПриемник		- ОтборКомпоновкиДанных	- отбор приемник;
//	ОтборИсточник		- ОтборКомпоновкиДанных	- отбор источник;
//	ДоступныеПоляОтбора	- ДоступныеПоляКомпоновкиДанных	- доступные поля.
//						По умолчанию используются доступные поля указанного отбора-приемника.
Процедура СкопироватьОтбор(ОтборПриемник, ОтборИсточник, ДоступныеПоляОтбора = Неопределено) Экспорт
	
	Если ДоступныеПоляОтбора = Неопределено Тогда
		ДоступныеПоляОтбора = ОтборПриемник.ДоступныеПоляОтбора;
	КонецЕсли;
	
	Для Каждого Элем Из ОтборИсточник.Элементы Цикл
		Если ТипЗнч(Элем) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			// Обнаружена группа элементов.
			
			// Создаем новый элемент-группу:
			НовыйЭлемент = ОтборПриемник.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элем);
																			   
			// Рекурсивное копирование элементов группы:
			СкопироватьОтбор(НовыйЭлемент, Элем, ДоступныеПоляОтбора);
			
		Иначе
			// Обнаружен конечный элемент.
			
			ЭтоДоступноеПоле = НЕ (ДоступныеПоляОтбора.НайтиПоле(Элем.ЛевоеЗначение) = Неопределено);
			Если ЭтоДоступноеПоле Тогда
				// Создаем новый элемент:
				НовыйЭлемент = ОтборПриемник.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элем);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Удаляет недоступные элементы отбора (отсутствуют в доступных полях отбора).
//
// Параметры:
//	Отбор				- ОтборКомпоновкиДанных	- отбор для настройки.
//	ДоступныеПоляОтбора	- ДоступныеПоляКомпоновкиДанных	- доступные поля.
//						По умолчанию используются доступные поля указанного отбора.
Процедура УдалитьНедоступныеЭлементыОтбора(Отбор, ДоступныеПоляОтбора = Неопределено) Экспорт
	
	Если ДоступныеПоляОтбора = Неопределено Тогда
		ДоступныеПоляОтбора = Отбор.ДоступныеПоляОтбора;
	КонецЕсли;
	
	Для Каждого Элем Из Отбор.Элементы Цикл
		Если ТипЗнч(Элем) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			// Обнаружена группа элементов.
			УдалитьНедоступныеЭлементыОтбора(Элем, ДоступныеПоляОтбора);
			
		Иначе
			// Обнаружен конечный элемент.
			ЭтоНедоступноеПоле = (ДоступныеПоляОтбора.НайтиПоле(Элем.ЛевоеЗначение) = Неопределено);
			Если ЭтоНедоступноеПоле Тогда
				// Удаляем этот элемент отбора:
				Отбор.Элементы.Удалить(Элем);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Проверяет отличие значений указанных реквизитов шапки отчета и элементов отбора.
//
// Параметры:
//	Отбор				- ОтборКомпоновкиДанных	- отбор анализа;
//	РеквизитыШапки		- Структура	- реквизиты шапки отчета, для которых проверяется
//						соответствие элементам отбора;
//	НаходимсяВГруппе	- Булево	- служебный параметр, при вызове не указывается.
//
// Возвращаемое значение:
//	Булево	- Истина, если состояние элементов отбора отличается от состояния реквизитов шапки;
//			- Ложь, если состояния отбора и шапки соответствуют друг другу.
Функция УстановленДополнительныйОтбор(Отбор, РеквизитыШапки, НаходимсяВГруппе=Ложь) Экспорт
	
	Перем ЗначениеРеквизитаШапки;
	
	Результат = Ложь;
	
	Для Каждого ЭлементОтбора Из Отбор.Элементы Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			// Обрабатываем элементы этой группы:
			Результат = Результат ИЛИ УстановленДополнительныйОтбор(ЭлементОтбора, РеквизитыШапки, Истина);
			
		ИначеЕсли ЭлементОтбора.Использование Тогда
			Если ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
				ИмяПоляОтбора		= Строка(ЭлементОтбора.ЛевоеЗначение);
				ЗначениеПоляОтбора	= ЭлементОтбора.ПравоеЗначение;
				Если ЗначениеЗаполнено(ИмяПоляОтбора) Тогда
					инд = Найти(ИмяПоляОтбора, ".");
					Если инд = 0 Тогда
						Если РеквизитыШапки.Свойство(ИмяПоляОтбора, ЗначениеРеквизитаШапки) Тогда
							Если ЗначениеРеквизитаШапки = ЗначениеПоляОтбора И НЕ НаходимсяВГруппе Тогда
								Продолжить;
							Иначе
								// Значение в отборе не равно значению в шапке,
								// или элемент отбора находится в группе.
								Возврат Истина;
							КонецЕсли;
						Иначе
							// В шапке нет соответствующего поля.
							Возврат Истина;
						КонецЕсли;
					Иначе
						// Это имя поля "через точку".
						Возврат Истина;
					КонецЕсли;
				Иначе
					// Имя поля пустое.
					Возврат Истина;
				КонецЕсли;
			Иначе
				// Вид сравнения отличается от "Равно".
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 	
	
	Возврат Результат;
	
КонецФункции

// Скопировано из общей формы "ФормаОтчета"
Функция РассчитатьСуммуВыделенныхЯчеек(ТабличныйДокумент, ВыделенныеОбласти) Экспорт
	
	#Если Клиент Тогда
		ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
	#КонецЕсли
	
	#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
		КоличествоВыделенныхОбластей = ВыделенныеОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0 Тогда
			Возврат 0;
		ИначеЕсли КоличествоВыделенныхОбластей >= 100 Тогда
			Возврат Неопределено; // Нужен вызов сервера.
		КонецЕсли;
		КоличествоВыделенныхЯчеек = 0;
	#КонецЕсли
	
	Сумма = 0;
	ПроверенныеЯчейки = Новый Соответствие;
	
	Для Каждого ВыделеннаяОбласть Из ВыделенныеОбласти Цикл
		#Если Клиент Тогда
			Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
		#КонецЕсли
		
		ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Верх;
		ВыделеннаяОбластьНиз = ВыделеннаяОбласть.Низ;
		ВыделеннаяОбластьЛево = ВыделеннаяОбласть.Лево;
		ВыделеннаяОбластьПраво = ВыделеннаяОбласть.Право;
		
		Если ВыделеннаяОбластьВерх = 0 Тогда
			ВыделеннаяОбластьВерх = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьНиз = 0 Тогда
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбластьЛево = 0 Тогда
			ВыделеннаяОбластьЛево = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьПраво = 0 Тогда
			ВыделеннаяОбластьПраво = ТабличныйДокумент.ШиринаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
			ВыделеннаяОбластьВерх = 1;
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		ВыделеннаяОбластьВысота = ВыделеннаяОбластьНиз   - ВыделеннаяОбластьВерх;
		ВыделеннаяОбластьШирина = ВыделеннаяОбластьПраво - ВыделеннаяОбластьЛево;
		
		#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
			КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек + ВыделеннаяОбластьШирина * ВыделеннаяОбластьВысота;
			Если КоличествоВыделенныхЯчеек >= 1000 Тогда
				Возврат Неопределено; // Нужен вызов сервера.
			КонецЕсли;
		#КонецЕсли
		
		Для НомерКолонки = ВыделеннаяОбластьЛево По ВыделеннаяОбластьПраво Цикл
			Для НомерСтроки = ВыделеннаяОбластьВерх По ВыделеннаяОбластьНиз Цикл
				Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
					ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если Ячейка.Видимость = Истина Тогда
					Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
						Сумма = Сумма + Ячейка.Значение;
					ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
						Сумма = Сумма + СтрокаВЧисло(Ячейка.Текст);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Сумма;
	
КонецФункции


// Вычисляет сумму выделенных ячеек и возвращает ее представление.
//
// Параметры:
//   ТабличныйДокумент - ТабличныйДокумент - Таблица, для которой вычисляет сумма ячеек.
//   ВыделенныеОбласти
//       - Неопределено - При вызове с клиента этот параметр будет определен автоматически.
//       - Массив - При вызове с сервера в этот параметр следует передавать области,
//           предварительно вычисленные на клиенте
//           при помощи функции ОтчетыКлиент.ВыделенныеОбласти(ТабличныйДокумент).
//
// Возвращаемое значение: 
//   Строка - Представление суммы выделенных ячеек.
//
// См. также:
//   ОтчетыКлиент.ВыделенныеОбласти().
//
Функция СуммаЯчеек(ТабличныйДокумент, ВыделенныеОбласти) Экспорт
	
	Если ВыделенныеОбласти = Неопределено Тогда
		#Если Клиент Тогда
			ВыделенныеОбласти = ТабличныйДокумент.ВыделенныеОбласти;
		#Иначе
			Возврат НСтр("ru = 'Не указано значение параметра ""ВыделенныеОбласти"".'");
		#КонецЕсли
	КонецЕсли;
	
	#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
		КоличествоВыделенныхОбластей = ВыделенныеОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0 Тогда
			Возврат ""; // Нет ни одного числа.
		ИначеЕсли КоличествоВыделенныхОбластей >= 100 Тогда
			Возврат "<"; // Нужен вызов сервера.
		КонецЕсли;
		КоличествоВыделенныхЯчеек = 0;
	#КонецЕсли
	
	Сумма = Неопределено;
	ПроверенныеЯчейки = Новый Соответствие;
	
	Для Каждого ВыделеннаяОбласть Из ВыделенныеОбласти Цикл
		#Если Клиент Тогда
			Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
		#КонецЕсли
		
		ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Верх;
		ВыделеннаяОбластьНиз = ВыделеннаяОбласть.Низ;
		ВыделеннаяОбластьЛево = ВыделеннаяОбласть.Лево;
		ВыделеннаяОбластьПраво = ВыделеннаяОбласть.Право;
		
		Если ВыделеннаяОбластьВерх = 0 Тогда
			ВыделеннаяОбластьВерх = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьНиз = 0 Тогда
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбластьЛево = 0 Тогда
			ВыделеннаяОбластьЛево = 1;
		КонецЕсли;
		
		Если ВыделеннаяОбластьПраво = 0 Тогда
			ВыделеннаяОбластьПраво = ТабличныйДокумент.ШиринаТаблицы;
		КонецЕсли;
		
		Если ВыделеннаяОбласть.ТипОбласти = ТипОбластиЯчеекТабличногоДокумента.Колонки Тогда
			ВыделеннаяОбластьВерх = ВыделеннаяОбласть.Низ;
			ВыделеннаяОбластьНиз = ТабличныйДокумент.ВысотаТаблицы;
		КонецЕсли;
		
		ВыделеннаяОбластьВысота = ВыделеннаяОбластьНиз   - ВыделеннаяОбластьВерх;
		ВыделеннаяОбластьШирина = ВыделеннаяОбластьПраво - ВыделеннаяОбластьЛево;
		
		#Если Клиент И Не ТолстыйКлиентОбычноеПриложение Тогда
			КоличествоВыделенныхЯчеек = КоличествоВыделенныхЯчеек + ВыделеннаяОбластьШирина * ВыделеннаяОбластьВысота;
			Если КоличествоВыделенныхЯчеек >= 1000 Тогда
				Возврат "<"; // Нужен вызов сервера.
			КонецЕсли;
		#КонецЕсли
		
		Для НомерКолонки = ВыделеннаяОбластьЛево По ВыделеннаяОбластьПраво Цикл
			Для НомерСтроки = ВыделеннаяОбластьВерх По ВыделеннаяОбластьНиз Цикл
				Ячейка = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
				Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
					ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если Ячейка.Видимость = Истина Тогда
					Если Ячейка.ТипОбласти <> ТипОбластиЯчеекТабличногоДокумента.Колонки
						И Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
						Число = Ячейка.Значение;
					ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
						Число = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Ячейка.Текст);
					Иначе
						Продолжить;
					КонецЕсли;
					Если ТипЗнч(Число) = Тип("Число") Тогда
						Если Сумма = Неопределено Тогда
							Сумма = Число;
						Иначе
							Сумма = Сумма + Число;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если Сумма = Неопределено Тогда
		Возврат ""; // Нет ни одного числа.
	КонецЕсли;
	
	Возврат Формат(Сумма, "ЧН=0");
	
КонецФункции

//---
// Механизм связи полей шапки и отбора

Функция СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи() Экспорт
	
	Возврат СвязьПолейШапкиИОтбора_ПолучитьПрефиксНазванияМеханизма() + "ТаблицаСвязи";
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыКомментарийОтбора() Экспорт
	
	Возврат СвязьПолейШапкиИОтбора_ПолучитьПрефиксНазванияМеханизма() + "КомментарийОтбора";
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыИмяПоляПриНачалеРедактированияСтрокиОтбора() Экспорт
	
	Возврат СвязьПолейШапкиИОтбора_ПолучитьПрефиксНазванияМеханизма() + "ИмяПоляПриНачалеРедактированияСтрокиОтбора";
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ПолучитьПрефиксНазванияМеханизма() Экспорт
	
	Возврат "СвязьПолейШапкиИОтбора_";
	
КонецФункции

// Обработчики событий:

Процедура СвязьПолейШапкиИОтбора_ПриОткрытии(Форма, Отчет) Экспорт
	
	Перем ТаблицаСвязи;
	
	// Инициализация механизма отработала успешно?
	Попытка
		ТаблицаСвязи = Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи()];
	Исключение
		// Выходим:
		Возврат;
	КонецПопытки;
	
	СвязьПолейШапкиИОтбора_КэшироватьЗначенияПолейШапкиВТаблицуСвязи(Форма, Отчет);
	
	СвязьПолейШапкиИОтбора_СогласоватьПоляШапкиИОтбора(Форма, Отчет);
	
	Для Каждого СтрокаСвязи Из ТаблицаСвязи Цикл
		Если СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"] Тогда
			// Обновляем значения флажков в шапке формы:
			СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Отчет,
				СтрокаСвязи["ШапкаПутьКДаннымФлажкаИндикаторСвязи"],	// ПутьКДаннымРеквизита
				СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"]);		// ЗначениеРеквизита
				
			СвязьПолейШапкиИОтбора_НастроитьДекорации_РежимИндикаторСвязи(Форма, СтрокаСвязи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьНеУстановлена(Форма, Отчет, Элемент) Экспорт
	
	ОписаниеИсточника = Новый Структура("ИспользоватьРежимИндикаторСвязи, ЭтоКартинка, ЭтоВызовИзОбработчикаСвязьУстановлена",
		Истина, Истина, Ложь);
		
	СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Элемент, ОписаниеИсточника);
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьУстановлена(Форма, Отчет, Элемент) Экспорт
	
	ОписаниеИсточника = Новый Структура("ИспользоватьРежимИндикаторСвязи, ЭтоКартинка, ЭтоВызовИзОбработчикаСвязьУстановлена",
		Истина, Истина, Истина);
		
	СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Элемент, ОписаниеИсточника);
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриИзмененииПоляШапки(Форма, Отчет, Элемент) Экспорт
	
	ОписаниеИсточника = Новый Структура("ЭтоПоле", Истина);
		
	СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Элемент, ОписаниеИсточника);
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьНеУстановлена(Форма, Отчет, Элемент) Экспорт
	
	ОписаниеИсточника = Новый Структура("ИспользоватьРежимИндикаторСвязи, ЭтоФлажок, ЭтоВызовИзОбработчикаСвязьУстановлена",
		Истина, Истина, Ложь);
		
	СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Элемент, ОписаниеИсточника);
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьУстановлена(Форма, Отчет, Элемент) Экспорт
	
	ОписаниеИсточника = Новый Структура("ИспользоватьРежимИндикаторСвязи, ЭтоФлажок, ЭтоВызовИзОбработчикаСвязьУстановлена",
		Истина, Истина, Истина);
		
	СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Элемент, ОписаниеИсточника);
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаПоВсем(Форма, Отчет, Элемент) Экспорт
	
	ОписаниеИсточника = Новый Структура("ИспользоватьРежимПоВсем, ЭтоФлажок",
		Истина, Истина);
		
	СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Элемент, ОписаниеИсточника);
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриНачалеРедактированияСтрокиОтбора(Форма, Отчет, Элемент, НоваяСтрока, Копирование) Экспорт
	
	Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыИмяПоляПриНачалеРедактированияСтрокиОтбора()] =
		Элемент.ТекущиеДанные.ЛевоеЗначение;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора(Форма, Отчет, Элемент, НоваяСтрока, ОтменаРедактирования) Экспорт
	
	Перем ТекЭлементОтбора;
	
	ИзменилосьЛевоеЗначение = НЕ (Строка(Элемент.ТекущиеДанные.ЛевоеЗначение) =
		Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыИмяПоляПриНачалеРедактированияСтрокиОтбора()]);
	
	Если ИзменилосьЛевоеЗначение Тогда
		СвязьПолейШапкиИОтбора_ПриОткрытии(Форма, Отчет);
		
	Иначе
		СтрокаСвязи = СвязьПолейШапкиИОтбора_ПолучитьСтрокуСвязиИзЭлементаОтбора(Форма, Отчет, Элемент, ТекЭлементОтбора);
		
		Если НЕ СтрокаСвязи = Неопределено Тогда
			Если СтрокаСвязи["ИспользоватьРежимПоВсем"] Тогда
				СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора_РежимПоВсем(Форма, Отчет, СтрокаСвязи, ТекЭлементОтбора);
			КонецЕсли;
			
			Если СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"] Тогда
				СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора_РежимИндикаторСвязи(Форма, Отчет, СтрокаСвязи, ТекЭлементОтбора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора_РежимИндикаторСвязи(Форма, Отчет, СтрокаСвязи, ТекЭлементОтбора)
	
	ШапкаЗначениеФлажкаИндикаторСвязи	= СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"];
	
	ОбновитьШапкуИОтключитьДочерниеЭлементыОтбора = ШапкаЗначениеФлажкаИндикаторСвязи;
	
	Если ОбновитьШапкуИОтключитьДочерниеЭлементыОтбора Тогда
		БылиИзмененияПолей = СвязьПолейШапкиИОтбора_ОбновитьШапкуИОтключитьДочерниеЭлементыОтбора(Форма,
			СтрокаСвязи,
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы,
			ТекЭлементОтбора);
			
		// Устанавливаем новые значения реквизитов шапки из кэша.
		СвязьПолейШапкиИОтбора_УстановитьЗначенияВсехРеквизитовШапки(Форма, Отчет, СтрокаСвязи);
		
		СвязьПолейШапкиИОтбора_НастроитьДекорации_РежимИндикаторСвязи(Форма, СтрокаСвязи);
		
		Если БылиИзмененияПолей Тогда
			СтандартныеОтчетыКлиентСервер.УстановитьСостояние(Форма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора_РежимПоВсем(Форма, Отчет, СтрокаСвязи, ТекЭлементОтбора)
	
	ШапкаЗначениеФлажкаПоВсем	= СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"];
	ОтборИмяПоля				= СтрокаСвязи["ОтборИмяПоля"];
	ШапкаЗначениеПоля			= СтрокаСвязи["ШапкаЗначениеПоля"];
	
	Если ШапкаЗначениеФлажкаПоВсем Тогда
		// В режиме "По всем" с установленным флажком
		// запрещаем установку отбора, т.к. возникнет противоречие с флажком:
		ТекЭлементОтбора.Использование = Ложь;
		// Выходим:
		Возврат;
	КонецЕсли;
	
	ОбновитьШапкуИОтключитьДочерниеЭлементыОтбора = НЕ ШапкаЗначениеФлажкаПоВсем;
	
	Если ОбновитьШапкуИОтключитьДочерниеЭлементыОтбора Тогда
		БылиИзмененияПолей = СвязьПолейШапкиИОтбора_ОбновитьШапкуИОтключитьДочерниеЭлементыОтбора(Форма,
			СтрокаСвязи,
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы,
			ТекЭлементОтбора);
			
		// Устанавливаем новые значения реквизитов шапки из кэша.
		СвязьПолейШапкиИОтбора_УстановитьЗначенияВсехРеквизитовШапки(Форма, Отчет, СтрокаСвязи);
		
		Если НЕ ШапкаЗначениеФлажкаПоВсем Тогда
			// В режиме "По всем" со сброшенным флажком
			// запрещаем отключение отбора у единственного выбранного поля:
			ЭлементыОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = СвязьПолейШапкиИОтбора_ПолучитьПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ЭлементыОтбора, СтрокаСвязи["ОтборИмяПоля"]);
			Если ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = Неопределено Тогда
				// Создаем последний элемент отбора, "равный" значению реквизита шапки:
				ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(ОтборИмяПоля);
				ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
				ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ПравоеЗначение= ШапкаЗначениеПоля;
				ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.Использование	= Истина;
			ИначеЕсли ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = ТекЭлементОтбора Тогда
				ТекЭлементОтбора.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Механизм связи полей шапки и отбора
//---

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ И ПРОЦЕДУРЫ ОБЕСПЕЧЕНИЯ ВЫБОРА ПЕРИОДА

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ И ПРОЦЕДУРЫ ДЛЯ РАБОТЫ С СОСТОЯНИЕМ ОТЧЕТА

Процедура УстановитьСостояние(Форма, НеИспользовать = Ложь) Экспорт
	
	Перем ИспользуемыйЭлементФормы;
	
	ПоддерживаемыеИменаЭлементовФормы = Новый Структура("
		|Результат,
		|ОтчетТабличныйДокумент");
		
	Для Каждого Элем Из ПоддерживаемыеИменаЭлементовФормы Цикл
		Попытка
			ИспользуемыйЭлементФормы = Форма.Элементы[Элем.Ключ];
		Исключение
		КонецПопытки;
	КонецЦикла;
		
	Если ИспользуемыйЭлементФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НеИспользовать Тогда
		ИспользуемыйЭлементФормы.ОтображениеСостояния.Видимость                      = Ложь;
		ИспользуемыйЭлементФормы.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	Иначе
		ИспользуемыйЭлементФормы.ОтображениеСостояния.Видимость                      = Истина;
		ИспользуемыйЭлементФормы.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоЭлементОтбораСОднимУказаннымЗначением(ЭлементОтбора) Экспорт
	
	Результат = Ложь;
	Попытка
		ВидСравненияЭлементаОтбора = ЭлементОтбора.ВидСравнения;
		Результат = (	ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.Больше
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.БольшеИлиРавно
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.ВИерархии
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.Меньше
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.НеВИерархии
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.НеРавно
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.НеСодержит
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.Равно
					ИЛИ ВидСравненияЭлементаОтбора = ВидСравненияКомпоновкиДанных.Содержит);
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Скопировано из общей формы "ФормаОтчета"
Функция СтрокаВЧисло(ИсходнаяСтрока)
	// Превращает строку в число без вызова исключений. Стандартная функция преобразования
	//   Число() строго контролирует отсутствие каких-либо символов кроме числовых.
	
	Результат = 0;
	ЗнаковПослеЗапятой = -1;
	ЗнакОтрицательный = Ложь;
	Для НомерСимвола = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		КодСимвола = КодСимвола(ИсходнаяСтрока, НомерСимвола);
		Если КодСимвола = 32 Или КодСимвола = 160 Тогда // Пробел или неразрывный пробел.
			// Пропуск (действие не требуется).
		ИначеЕсли КодСимвола = 45 Тогда // Минус
			Если Результат <> 0 Тогда
				Возврат 0;
			КонецЕсли;
			ЗнакОтрицательный = Истина;
		ИначеЕсли КодСимвола = 44 Или КодСимвола = 46 Тогда // Запятая или точка.
			ЗнаковПослеЗапятой = 0; // Запуск отсчета знаков после запятой.
		ИначеЕсли КодСимвола > 47 И КодСимвола < 58 Тогда // Число.
			Если ЗнаковПослеЗапятой <> -1 Тогда
				ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
			КонецЕсли;
			Число = КодСимвола - 48;
			Результат = Результат * 10 + Число;
		Иначе
			Возврат 0;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗнаковПослеЗапятой > 0 Тогда
		Результат = Результат / Pow(10, ЗнаковПослеЗапятой);
	КонецЕсли;
	Если ЗнакОтрицательный Тогда
		Результат = -Результат;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

//---
// Механизм связи полей шапки и отбора

Процедура СвязьПолейШапкиИОтбора_КэшироватьЗначенияПолейШапкиВТаблицуСвязи(Форма, Отчет)
	
	ТаблицаСвязи = Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи()];
	
	Для Каждого СтрокаСвязи Из ТаблицаСвязи Цикл
		СтрокаСвязи["ШапкаЗначениеПоля"]				= СвязьПолейШапкиИОтбора_ПолучитьЗначениеРеквизита(Форма, Отчет, СтрокаСвязи["ШапкаПутьКДаннымПоля"]);
		СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"]= СвязьПолейШапкиИОтбора_ПолучитьЗначениеРеквизита(Форма, Отчет, СтрокаСвязи["ШапкаПутьКДаннымФлажкаИндикаторСвязи"]);
		СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"]		= СвязьПолейШапкиИОтбора_ПолучитьЗначениеРеквизита(Форма, Отчет, СтрокаСвязи["ШапкаПутьКДаннымФлажкаПоВсем"]);
	КонецЦикла;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_КэшироватьЗначенияПолейШапкиВСтрокуСвязи(Форма, Отчет, СтрокаСвязи)
	
	СтрокаСвязи["ШапкаЗначениеПоля"] = СвязьПолейШапкиИОтбора_ПолучитьЗначениеРеквизита(Форма, Отчет, СтрокаСвязи["ШапкаПутьКДаннымПоля"]);
	
	Если СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"] Тогда
		СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"] = СвязьПолейШапкиИОтбора_ПолучитьЗначениеРеквизита(Форма, Отчет, СтрокаСвязи["ШапкаПутьКДаннымФлажкаИндикаторСвязи"]);
	КонецЕсли;
	
	Если СтрокаСвязи["ИспользоватьРежимПоВсем"] Тогда
		СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"] = СвязьПолейШапкиИОтбора_ПолучитьЗначениеРеквизита(Форма, Отчет, СтрокаСвязи["ШапкаПутьКДаннымФлажкаПоВсем"]);
	КонецЕсли;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_НастроитьДекорации_РежимИндикаторСвязи(Форма, СтрокаСвязи)
	
	Попытка
		Если СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"] Тогда
			ИмяОтображаемойСтраницы	= СтрокаСвязи["ШапкаИмяЭлементаСтраницаСвязьУстановлена"];
		Иначе
			ИмяОтображаемойСтраницы	= СтрокаСвязи["ШапкаИмяЭлементаСтраницаСвязьНеУстановлена"];
		КонецЕсли;
		
		Форма.Элементы[СтрокаСвязи["ШапкаИмяЭлементаСтраницы"]].ТекущаяСтраница = Форма.Элементы[ИмяОтображаемойСтраницы];
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция СвязьПолейШапкиИОтбора_НастроитьОтборПоШапкеИСвязи(Форма, СтрокаСвязи, ЭлементыОтбора, ИсточникСобытия)
	
	Перем	ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению,
			БылиИзмененияЭлементов;
			
	ИспользоватьРежимИндикаторСвязи		= СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"];
	ИспользоватьРежимПоВсем				= СтрокаСвязи["ИспользоватьРежимПоВсем"];
	ШапкаЗначениеПоля					= СтрокаСвязи["ШапкаЗначениеПоля"];
	ШапкаЗначениеФлажкаИндикаторСвязи	= СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"];
	ШапкаЗначениеФлажкаПоВсем			= СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"];
	ОтборИмяПоля						= СтрокаСвязи["ОтборИмяПоля"];
	УстанавливатьСвязьПриИзмененииПоля	= СтрокаСвязи["УстанавливатьСвязьПриИзмененииПоля"];
	ЭтоПоле								= ИсточникСобытия.Свойство("ЭтоПоле");
	
	ЭтоОчисткаПоляШапки					= ЭтоПоле И НЕ ЗначениеЗаполнено(ШапкаЗначениеПоля);
	ЭтоИзменениеПоляШапки				= ЭтоПоле И ЗначениеЗаполнено(ШапкаЗначениеПоля);
	
	// Возвращаемое значение:
	БылиИзмененияЭлементов = Ложь;
	
	// Сбрасываем флажки "Использовать" у ВСЕХ соответствующих элементов отбора:
	ОтключитьВсе = Истина;
	Если ИспользоватьРежимИндикаторСвязи Тогда
		ОтключитьВсе = (ШапкаЗначениеФлажкаИндикаторСвязи ИЛИ ЭтоОчисткаПоляШапки);
		
	ИначеЕсли ИспользоватьРежимПоВсем Тогда
		ОтключитьВсе = Истина;
		
	КонецЕсли;
	
	// Устанавливаем элемент отбора, равный полю шапки:	
	УстановитьОтборПоПолю = Ложь;
	Если ИспользоватьРежимИндикаторСвязи Тогда
		УстановитьОтборПоПолю = (ШапкаЗначениеФлажкаИндикаторСвязи И НЕ ЭтоОчисткаПоляШапки)
			ИЛИ (УстанавливатьСвязьПриИзмененииПоля И ЭтоИзменениеПоляШапки);
		
	ИначеЕсли ИспользоватьРежимПоВсем Тогда
		УстановитьОтборПоПолю = НЕ ШапкаЗначениеФлажкаПоВсем;
		
	КонецЕсли;
	
	Если ОтключитьВсе Тогда
		// Сбрасываем флажки "Использовать" у ВСЕХ соответствующих элементов отбора:
		ОтключенныеПоляОтбораЧерезТочку = Новый Массив();
		БылиИзмененияЭлементов = СвязьПолейШапкиИОтбора_ОтключитьИспользованиеСоответствующихЭлементовОтбора(
			ЭлементыОтбора,
			ОтборИмяПоля,
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению,
			Истина, // СброситьИспользованиеВсехПодходящихЭлементовОтбора
			ОтключенныеПоляОтбораЧерезТочку);
	Иначе
		// Инициализируем переменные, используемые далее:
		ОтключенныеПоляОтбораЧерезТочку = Новый Массив();
		ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению =
			СвязьПолейШапкиИОтбора_ПолучитьПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ЭлементыОтбора, ОтборИмяПоля);
	КонецЕсли;
	
	Если УстановитьОтборПоПолю Тогда
		// Создаем последний элемент отбора, "равный" значению реквизита шапки:
		Если ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = Неопределено Тогда
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(ОтборИмяПоля);
			БылиИзмененияЭлементов = Истина;
		КонецЕсли;
		НовыйВидСравнения	= ВидСравненияКомпоновкиДанных.Равно;
		НовоеПравоеЗначение	= ШапкаЗначениеПоля;
		НовоеИспользование	= Истина;
		Если НЕ ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ВидСравнения		= НовыйВидСравнения Тогда
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ВидСравнения			= НовыйВидСравнения;
			БылиИзмененияЭлементов = Истина;
		КонецЕсли;
		Если НЕ ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ПравоеЗначение	= НовоеПравоеЗначение Тогда
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.ПравоеЗначение		= НовоеПравоеЗначение;
			БылиИзмененияЭлементов = Истина;
		КонецЕсли;
		Если НЕ ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.Использование		= НовоеИспользование Тогда
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.Использование			= НовоеИспользование;
			БылиИзмененияЭлементов = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если ИспользоватьРежимИндикаторСвязи Тогда
		
		Если ШапкаЗначениеФлажкаИндикаторСвязи Тогда
			
			// Если были отключены отборы по полям связи, то отключим соответствующие им флажки:
			СвязьПолейШапкиИОтбора_СброситьСоответствующиеФлажкиШапки_РежимИндикаторСвязи(ОтключенныеПоляОтбораЧерезТочку, Форма);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат БылиИзмененияЭлементов;
	
КонецФункции

Процедура СвязьПолейШапкиИОтбора_ОбновитьТекстКомментарияОтбора_РежимПоВсем(Форма)
	
	ТаблицаСвязи = Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи()];
	
	КомментарийОтбора = "";
	ЭтоПерваяСтрокаПоВсем = Истина;
	Для Каждого СтрокаСвязи Из ТаблицаСвязи Цикл
		Если СтрокаСвязи["ИспользоватьРежимПоВсем"] Тогда
			Если ЭтоПерваяСтрокаПоВсем Тогда
				КомментарийПоля = ?(СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"],
					СтрокаСвязи["ОтборКомментарийПоВсемПолный"],
					СтрокаСвязи["ОтборКомментарийПоОдномуПолный"]);
			Иначе
				КомментарийПоля = ?(СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"],
					СтрокаСвязи["ОтборКомментарийПоВсемКороткий"],
					СтрокаСвязи["ОтборКомментарийПоОдномуКороткий"]);
			КонецЕсли;
			
			КомментарийОтбора = КомментарийОтбора + ?(ЭтоПерваяСтрокаПоВсем, "", ", ") + КомментарийПоля;
			
			ЭтоПерваяСтрокаПоВсем = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыКомментарийОтбора()] = КомментарийОтбора;
	
КонецПроцедуры

Функция СвязьПолейШапкиИОтбора_ОбновитьШапкуИОтключитьДочерниеЭлементыОтбора(Форма, СтрокаСвязи, ЭлементыОтбора, ТекЭлементОтбора)
	
	Перем	ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению,
			ПравоеЗначение;
			
	// Возвращаемое значение:
	БылиИзмененияПолей = Ложь;
	
	ИспользоватьРежимИндикаторСвязи	= СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"];
	ИспользоватьРежимПоВсем			= СтрокаСвязи["ИспользоватьРежимПоВсем"];
	ШапкаЗначениеПоля		= СтрокаСвязи["ШапкаЗначениеПоля"];
	ОтборИмяПоля			= СтрокаСвязи["ОтборИмяПоля"];
	
	Если (Строка(ТекЭлементОтбора.ЛевоеЗначение) = ОтборИмяПоля)
		И СвязьПолейШапкиИОтбора_ЭтоЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ТекЭлементОтбора, ПравоеЗначение)
		//И ЗначениеЗаполнено(ПравоеЗначение)
		И ТекЭлементОтбора.Использование Тогда
		
		// Устанавливаем реквизит шапки, равный "значению" текущего элемента отбора:
		Если НЕ ШапкаЗначениеПоля = ПравоеЗначение Тогда
			ШапкаЗначениеПоля = ПравоеЗначение;
			БылиИзмененияПолей = Истина;
		КонецЕсли;
		
		// Сбрасываем флажки "Использовать" у всех соответствующих элементов отбора:
		ОтключенныеПоляОтбораЧерезТочку = Новый Массив();
		СвязьПолейШапкиИОтбора_ОтключитьИспользованиеСоответствующихЭлементовОтбора(
			ЭлементыОтбора,
			ОтборИмяПоля,
			ПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению,
			Истина, // СброситьИспользованиеВсехПодходящихЭлементовОтбора
			ОтключенныеПоляОтбораЧерезТочку);
			
		// Восстанавливаем использование:
		ТекЭлементОтбора.Использование = Истина;
		
		Если ИспользоватьРежимИндикаторСвязи Тогда
			// Если были отключены отборы по полям связи, то отключим соответствующие им флажки:
			СвязьПолейШапкиИОтбора_СброситьСоответствующиеФлажкиШапки_РежимИндикаторСвязи(ОтключенныеПоляОтбораЧерезТочку, Форма);
		КонецЕсли;
		
	Иначе
		Если ИспользоватьРежимИндикаторСвязи Тогда
			// Сбрасываем флажок "Установлена связь".
			// Кэшируем обновленные значения полей шапки:
			СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"]= Ложь;
			БылиИзмененияПолей = Истина;
		КонецЕсли;
		
		Если ИспользоватьРежимПоВсем Тогда
			// При сброшенном флажке "По всем"
			// Запрещаем установку отбора по полям "через точку":
			Если НЕ СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"] Тогда
				ТекЭлементОтбора.Использование = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Кэшируем обновленные значения полей шапки:
	СтрокаСвязи["ШапкаЗначениеПоля"]					= ШапкаЗначениеПоля;
	
	Возврат БылиИзмененияПолей;
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ОтключитьИспользованиеСоответствующихЭлементовОтбора(ЭлементыОтбора,
	ОтборИмяПоля,
	ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению,
	СброситьИспользованиеВсехПодходящихЭлементовОтбора = Ложь,
	ОтключенныеПоляОтбораЧерезТочку = Неопределено,
	ЭтоРекурсивныйВызов = Ложь)
	
	// Возвращаемое значение:
	Перем БылиИзмененияЭлементов;
	
	БылиИзмененияЭлементов = Ложь;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			// При обнаружении группы элементов - обрабатываем все эти дочерние элементы:
			БылиИзмененияЭлементов = СвязьПолейШапкиИОтбора_ОтключитьИспользованиеСоответствующихЭлементовОтбора(
				ЭлементОтбора.Элементы,
				ОтборИмяПоля,
				ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению,
				СброситьИспользованиеВсехПодходящихЭлементовОтбора,
				ОтключенныеПоляОтбораЧерезТочку,
				Истина); // ЭтоРекурсивныйВызов
		Иначе
			// Это конечный элемент отбора.
			
			ИмяПоля = Строка(ЭлементОтбора.ЛевоеЗначение);
			Если ИмяПоля = ОтборИмяПоля Тогда
				// Искомое имя поля.
				
				Если НЕ ЭтоРекурсивныйВызов Тогда
					Если СвязьПолейШапкиИОтбора_ЭтоЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ЭлементОтбора) Тогда
						// У предыдущего найденого такого элемента сбрасываем использование:
						Если НЕ ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = Неопределено Тогда
							Если НЕ ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.Использование = Ложь Тогда
								ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.Использование = Ложь;
								БылиИзмененияЭлементов = Истина;
							КонецЕсли;
						КонецЕсли;
						// Запоминаем только самый последний такой элемент:
						ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = ЭлементОтбора;
					Иначе
						Если НЕ ЭлементОтбора.Использование = Ложь Тогда
							ЭлементОтбора.Использование = Ложь;
							БылиИзмененияЭлементов = Истина;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Если НЕ ЭлементОтбора.Использование = Ложь Тогда
						ЭлементОтбора.Использование = Ложь;
						БылиИзмененияЭлементов = Истина;
					КонецЕсли;
				КонецЕсли;
				
			ИначеЕсли СвязьПолейШапкиИОтбора_ЭтоИмяПоляЧерезТочку(ИмяПоля, ОтборИмяПоля) Тогда
				// Поле "через точку" от искомого имени поля.
				Если НЕ ЭлементОтбора.Использование = Ложь Тогда
					ЭлементОтбора.Использование = Ложь;
					БылиИзмененияЭлементов = Истина;
					
					// Запоминаем имя этого поля:
					Если ТипЗнч(ОтключенныеПоляОтбораЧерезТочку) = Тип("Массив") Тогда
						ОтключенныеПоляОтбораЧерезТочку.Добавить(ИмяПоля);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СброситьИспользованиеВсехПодходящихЭлементовОтбора
		И НЕ ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению = Неопределено Тогда
		Если НЕ ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.Использование = Ложь Тогда
			ВозвратПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению.Использование = Ложь;
			БылиИзмененияЭлементов = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат БылиИзмененияЭлементов;
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ПолучитьЗначениеРеквизита(Форма, Отчет, ПутьКДаннымРеквизита)
	
	Перем ЛокальныйПутьКДанным;
	
	ЭтоРеквизитФормы = СвязьПолейШапкиИОтбора_ЭтоРеквизитФормы(ПутьКДаннымРеквизита, ЛокальныйПутьКДанным);
	
	Если ЗначениеЗаполнено(ЛокальныйПутьКДанным) Тогда
		Результат = ?(ЭтоРеквизитФормы,
			Форма[ЛокальныйПутьКДанным],
			Отчет[ЛокальныйПутьКДанным]);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ПолучитьПоследнийЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ЭлементыОтбора, ОтборИмяПоля)
	
	// Возвращаемое значение:
	Результат = Неопределено;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ИмяПоля = Строка(ЭлементОтбора.ЛевоеЗначение);
			Если ИмяПоля = ОтборИмяПоля Тогда
				// Искомое имя поля.
				Если СвязьПолейШапкиИОтбора_ЭтоЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ЭлементОтбора) Тогда
					// Запоминаем только самый последний такой элемент:
					Результат = ЭлементОтбора;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ПолучитьСтрокуСвязиИзЭлементаОтбора(Форма, Отчет, Элемент, ВозвратТекЭлементОтбора)
	
	// Возвращаемое значение:
	Перем СтрокаСвязи;
	
	// Используемый элемент с отбором компоновщика:
	ЭлементФормыТаблицыОтбора = Элемент;
	
	ТекДанные = ЭлементФормыТаблицыОтбора.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат СтрокаСвязи;
	КонецЕсли;
	
	ВозвратТекЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(
		ЭлементФормыТаблицыОтбора.ТекущаяСтрока);
	
	// Построим из имени поля массив кандидатов в поля отбора с учетом иерархии (через точку):
	ТекИмяПоля = Строка(ТекДанные.ЛевоеЗначение);
	МассивКандидатов = Новый Массив();
	инд = Найти(ТекИмяПоля, ".");
	сч = 0;
	Пока инд > 0 Цикл
		ЛеваяЧасть = Лев(ТекИмяПоля, инд - 1);
		
		ПредыдущееЗначение = ?(сч > 0,
			МассивКандидатов[сч - 1] + ".",
			"");
		МассивКандидатов.Добавить(ПредыдущееЗначение + ЛеваяЧасть);
		
		ТекИмяПоля = Сред(ТекИмяПоля, инд + 1);
		инд = Найти(ТекИмяПоля, ".");
		сч = сч + 1;
	КонецЦикла;
	ПредыдущееЗначение = ?(сч > 0,
		МассивКандидатов[сч - 1] + ".",
		"");
	МассивКандидатов.Добавить(ПредыдущееЗначение + ТекИмяПоля);
	сч = сч + 1;
	
	// Проверяем кандидатов по иерархии от "глубоких" к "верхним":
	ТаблицаСвязи = Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи()];
	Для инд = 0 По (сч - 1) Цикл
		КандидатИмяПоля = МассивКандидатов[сч - 1 - инд];
		
		// Определим имя соответствующего поля в шапке:
		Поиск = Новый Структура("ОтборИмяПоля", КандидатИмяПоля);
		МассивСтрок = ТаблицаСвязи.НайтиСтроки(Поиск);
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаСвязи = МассивСтрок[0];
			
			// Кэшируем текущие значения полей шапки:
			СвязьПолейШапкиИОтбора_КэшироватьЗначенияПолейШапкиВСтрокуСвязи(Форма, Отчет, СтрокаСвязи);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокаСвязи;
	
КонецФункции
		
Функция СвязьПолейШапкиИОтбора_ПолучитьСтрокуСвязиИзЭлементаШапки(Форма, Отчет, Элемент, ИсточникСобытия)
	
	Перем	СтрокаСвязи, // Возвращаемое значение
			ИмяКолонки,
			ИспользоватьРежимИндикаторСвязи,
			ИспользоватьРежимПоВсем;
			
	Если НЕ ИсточникСобытия.Свойство("ИспользоватьРежимИндикаторСвязи", ИспользоватьРежимИндикаторСвязи) Тогда
		ИспользоватьРежимИндикаторСвязи = Ложь;
	КонецЕсли;
	Если НЕ ИсточникСобытия.Свойство("ИспользоватьРежимПоВсем", ИспользоватьРежимПоВсем) Тогда
		ИспользоватьРежимПоВсем = Ложь;
	КонецЕсли;
	
	// Определим колонку, по которой будем искать в таблице связи:
	Если ИсточникСобытия.Свойство("ЭтоПоле") Тогда
		ИмяКолонки = "ШапкаИмяЭлементаПоля";
	
	ИначеЕсли ИспользоватьРежимИндикаторСвязи И ИсточникСобытия.Свойство("ЭтоФлажок") Тогда
		ИмяКолонки = ?(ИсточникСобытия["ЭтоВызовИзОбработчикаСвязьУстановлена"],
			"ШапкаИмяЭлементаФлажокСвязьУстановлена",
			"ШапкаИмяЭлементаФлажокСвязьНеУстановлена");
				
	ИначеЕсли ИспользоватьРежимИндикаторСвязи И ИсточникСобытия.Свойство("ЭтоКартинка") Тогда
		ИмяКолонки = ?(ИсточникСобытия["ЭтоВызовИзОбработчикаСвязьУстановлена"],
			"ШапкаИмяЭлементаКартинкаСвязьУстановлена",
			"ШапкаИмяЭлементаКартинкаСвязьНеУстановлена");
			
	ИначеЕсли ИспользоватьРежимПоВсем И ИсточникСобытия.Свойство("ЭтоФлажок") Тогда
		ИмяКолонки = "ШапкаИмяЭлементаФлажокПоВсем";
			
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ИмяКолонки) Тогда
		// Выходим:
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаСвязи = Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи()];
	Поиск = Новый Структура(ИмяКолонки, Элемент.Имя);
	МассивСтрок = ТаблицаСвязи.НайтиСтроки(Поиск);
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаСвязи = МассивСтрок[0];
		
		Если ИспользоватьРежимИндикаторСвязи Тогда
			// Изменяем значение флажка "Связь установлена" в шапке на противоположное,
			// если была нажата картинка, а не сам флажок:
			Если ИсточникСобытия.Свойство("ЭтоКартинка") Тогда
				СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Отчет,
					СтрокаСвязи["ШапкаПутьКДаннымФлажкаИндикаторСвязи"],
					НЕ СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"]);
			КонецЕсли;
		КонецЕсли;
		
		// Кэшируем текущие значения полей шапки:
		СвязьПолейШапкиИОтбора_КэшироватьЗначенияПолейШапкиВСтрокуСвязи(Форма, Отчет, СтрокаСвязи);
		
	КонецЕсли;
	
	Возврат СтрокаСвязи;
	
КонецФункции

Процедура СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Элемент, ИсточникСобытия, СтрокаСвязи = Неопределено);
	
	ОбновитьТекстКомментарияОтбора_РежимПоВсем = Ложь;
	Если СтрокаСвязи = Неопределено Тогда
		СтрокаСвязи = СвязьПолейШапкиИОтбора_ПолучитьСтрокуСвязиИзЭлементаШапки(Форма, Отчет, Элемент, ИсточникСобытия);
		ОбновитьТекстКомментарияОтбора_РежимПоВсем = Истина;
	КонецЕсли;
	
	Если НЕ СтрокаСвязи = Неопределено Тогда
		ИспользоватьРежимИндикаторСвязи	= СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"];
		ИспользоватьРежимПоВсем			= СтрокаСвязи["ИспользоватьРежимПоВсем"];
			
		Если СтрокаСвязи["ИспользоватьРежимПоВсем"] Тогда
			Если СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"] Тогда
				// В режиме "По всем" с установленным флажком
				// изменение поля шапки ни на что не влияет:
				Если ИсточникСобытия.Свойство("ЭтоПоле") Тогда
					// Выходим:
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ИспользоватьРежимИндикаторСвязи Тогда
			ШапкаЗначениеПоля					= СтрокаСвязи["ШапкаЗначениеПоля"];
			УстанавливатьСвязьПриИзмененииПоля	= СтрокаСвязи["УстанавливатьСвязьПриИзмененииПоля"];
			ЭтоПоле								= ИсточникСобытия.Свойство("ЭтоПоле");
			
			ЭтоОчисткаПоляШапки			= ЭтоПоле И НЕ ЗначениеЗаполнено(ШапкаЗначениеПоля);
			ЭтоИзменениеПоляШапки		= ЭтоПоле И ЗначениеЗаполнено(ШапкаЗначениеПоля);
			ОбновитьСвязь				= Ложь;
			
			Если ЭтоОчисткаПоляШапки Тогда
				// Сбрасываем связь:
				ОбновитьСвязь		= Истина;
				НовоеЗначениеФлажка	= Ложь;
				
			ИначеЕсли ЭтоИзменениеПоляШапки И УстанавливатьСвязьПриИзмененииПоля Тогда
				// Устанавливаем связь:
				ОбновитьСвязь		= Истина;
				НовоеЗначениеФлажка	= Истина;
				
			КонецЕсли;
			
			Если ОбновитьСвязь Тогда
				СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"] = НовоеЗначениеФлажка;
				
				// Обновляем реквизит формы:
				СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Неопределено, //Отчет,
					СтрокаСвязи["ШапкаПутьКДаннымФлажкаИндикаторСвязи"],	// ПутьКДаннымРеквизита
					НовоеЗначениеФлажка);									// ЗначениеРеквизита
			КонецЕсли;
			
		КонецЕсли;
		
		БылиИзмененияЭлементов = СвязьПолейШапкиИОтбора_НастроитьОтборПоШапкеИСвязи(Форма,
			СтрокаСвязи,
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы,
			ИсточникСобытия);
		
		Если БылиИзмененияЭлементов Тогда
			СтандартныеОтчетыКлиентСервер.УстановитьСостояние(Форма);
		КонецЕсли;
		
		Если ИспользоватьРежимИндикаторСвязи Тогда
			СвязьПолейШапкиИОтбора_НастроитьДекорации_РежимИндикаторСвязи(Форма, СтрокаСвязи);
		КонецЕсли;
		
		// Обновляем текст комментария таблицы отбора:
		Если ИспользоватьРежимПоВсем И ОбновитьТекстКомментарияОтбора_РежимПоВсем Тогда
			СвязьПолейШапкиИОтбора_ОбновитьТекстКомментарияОтбора_РежимПоВсем(Форма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_СброситьСоответствующиеФлажкиШапки_РежимИндикаторСвязи(ОтключенныеПоляОтбораЧерезТочку, Форма)
	
	ТаблицаСвязи = Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи()];
	
	Для Каждого ИмяПоля Из ОтключенныеПоляОтбораЧерезТочку Цикл
		Поиск = Новый Структура("ОтборИмяПоля", ИмяПоля);
		МассивСтрок = ТаблицаСвязи.НайтиСтроки(Поиск);
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаСвязи = МассивСтрок[0];
			
			// Обновляем значения флажков в таблице связи:
			НовоеЗначениеФлажка = Ложь;
			СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"] = НовоеЗначениеФлажка;
			
			// Обновляем значения флажков в шапке формы:
			СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Неопределено, //Отчет,
				СтрокаСвязи["ШапкаПутьКДаннымФлажкаИндикаторСвязи"],	// ПутьКДаннымРеквизита
				НовоеЗначениеФлажка);									// ЗначениеРеквизита
				
			СвязьПолейШапкиИОтбора_НастроитьДекорации_РежимИндикаторСвязи(Форма, СтрокаСвязи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_СогласоватьПоляШапкиИОтбора(Форма, Отчет)
	
	Перем ПравоеЗначение;
	
	ТаблицаСвязи	= Форма[СвязьПолейШапкиИОтбора_ПолучитьИмяРеквизитаФормыТаблицаСвязи()];
	ЭлементыОтбора	= Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	ИтогоИспользоватьРежимПоВсем = Ложь;
	
	Для Каждого СтрокаСвязи Из ТаблицаСвязи Цикл
		ИспользоватьРежимИндикаторСвязи	= СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"];
		ИспользоватьРежимПоВсем			= СтрокаСвязи["ИспользоватьРежимПоВсем"];
		ИтогоИспользоватьРежимПоВсем	= ИтогоИспользоватьРежимПоВсем ИЛИ ИспользоватьРежимПоВсем;
		
		Если ИспользоватьРежимПоВсем Тогда
			// Настраиваем отбор так же, как при нажатии на флажок "По всем":
			ИсточникСобытия = Новый Структура("ЭтоФлажок", Истина);
			СвязьПолейШапкиИОтбора_ПриИзмененииШапки(Форма, Отчет, Неопределено, ИсточникСобытия, СтрокаСвязи);
		КонецЕсли;
		
		Если ИспользоватьРежимИндикаторСвязи Тогда
				
			ШапкаЗначениеФлажкаИндикаторСвязи = СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"];
			
			// Если флажок "Установлена связь" в шапке установлен, то проанализируем взаимосвязанные данные.
			// Возможно, этот флажок нужно сбросить:
			Если ШапкаЗначениеФлажкаИндикаторСвязи Тогда
				ШапкаЗначениеПоля		= СтрокаСвязи["ШапкаЗначениеПоля"];
				ОтборИмяПоля			= СтрокаСвязи["ОтборИмяПоля"];
				
				ОтключитьФлажокВШапке	= Ложь;
				НайденЭлементОтбораВерхнегоУровняСРавенствомПолюШапки = Ложь;
				
				// Обходим элементы отбора только самого верхнего уровня:
				Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
					
					Попытка
						ИмяПоля = Строка(ЭлементОтбора.ЛевоеЗначение);
						Если ИмяПоля = ОтборИмяПоля Тогда
							// Искомое имя поля.
							Если ЭлементОтбора.Использование = Истина Тогда
								Если СвязьПолейШапкиИОтбора_ЭтоЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ЭлементОтбора, ПравоеЗначение) Тогда
									Если ПравоеЗначение = ШапкаЗначениеПоля Тогда
										НайденЭлементОтбораВерхнегоУровняСРавенствомПолюШапки = Истина;
									Иначе
										ОтключитьФлажокВШапке = Истина;
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
						ИначеЕсли СвязьПолейШапкиИОтбора_ЭтоИмяПоляЧерезТочку(ИмяПоля, ОтборИмяПоля) Тогда
							// Поле "через точку" от искомого имени поля.
							Если ЭлементОтбора.Использование = Истина Тогда
								Поиск = Новый Структура("ОтборИмяПоля", ИмяПоля);
								ИмеетсяСтрокаСвязи = (ТаблицаСвязи.НайтиСтроки(Поиск).Количество() > 0);
								Если НЕ ИмеетсяСтрокаСвязи Тогда
									ОтключитьФлажокВШапке = Истина;
									Прервать;
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
					Исключение
					КонецПопытки;
					
				КонецЦикла;
				
				// Сбрасываем флажок "Установлена связь" в шапке:
				Если НЕ НайденЭлементОтбораВерхнегоУровняСРавенствомПолюШапки
					ИЛИ ОтключитьФлажокВШапке Тогда
					СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"] = Ложь;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли; // Если ИспользоватьРежимИндикаторСвязи
		
	КонецЦикла;
	
	// Обновляем текст комментария таблицы отбора:
	Если ИтогоИспользоватьРежимПоВсем Тогда
		СвязьПолейШапкиИОтбора_ОбновитьТекстКомментарияОтбора_РежимПоВсем(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Отчет, ПутьКДаннымРеквизита, ЗначениеРеквизита)
	
	Перем ЛокальныйПутьКДанным;
	
	Если СвязьПолейШапкиИОтбора_ЭтоРеквизитФормы(ПутьКДаннымРеквизита, ЛокальныйПутьКДанным) Тогда
		Форма[ЛокальныйПутьКДанным] = ЗначениеРеквизита;
	Иначе
		Отчет[ЛокальныйПутьКДанным] = ЗначениеРеквизита;
	КонецЕсли;
	
КонецПроцедуры

Процедура СвязьПолейШапкиИОтбора_УстановитьЗначенияВсехРеквизитовШапки(Форма, Отчет, СтрокаСвязи)
	
	// Поле:
	СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Отчет,
		СтрокаСвязи["ШапкаПутьКДаннымПоля"],
		СтрокаСвязи["ШапкаЗначениеПоля"]);
		
	// Флажки:
	Если СтрокаСвязи["ИспользоватьРежимИндикаторСвязи"] Тогда
		СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Отчет,
			СтрокаСвязи["ШапкаПутьКДаннымФлажкаИндикаторСвязи"],
			СтрокаСвязи["ШапкаЗначениеФлажкаИндикаторСвязи"]);
	КонецЕсли;
	Если СтрокаСвязи["ИспользоватьРежимПоВсем"] Тогда
		СвязьПолейШапкиИОтбора_УстановитьЗначениеРеквизита(Форма, Отчет,
			СтрокаСвязи["ШапкаПутьКДаннымФлажкаПоВсем"],
			СтрокаСвязи["ШапкаЗначениеФлажкаПоВсем"]);
	КонецЕсли;
		
КонецПроцедуры
		
Функция СвязьПолейШапкиИОтбора_ЭтоИмяПоляЧерезТочку(ИмяПроверяемогоПоля, ОтборИмяПоля)
	
	Возврат (Лев(ИмяПроверяемогоПоля, СтрДлина(ОтборИмяПоля) + 1) = ОтборИмяПоля + ".");
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ЭтоРеквизитФормы(Знач ПутьКДаннымРеквизита, ЛокальныйПутьКДанным)
	
	инд = Найти(ПутьКДаннымРеквизита, ".");
	
	Если инд = 0 Тогда
		ЛокальныйПутьКДанным = ПутьКДаннымРеквизита;
		Возврат Истина;
	Иначе
		ЛокальныйПутьКДанным = Сред(ПутьКДаннымРеквизита, инд + 1);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция СвязьПолейШапкиИОтбора_ЭтоЭлементОтбораВерхнегоУровняСРавенствомОдномуЗначению(ЭлементОтбора, ПравоеЗначение = Неопределено)
	
	Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		
		// Это элемент верхнего уровня?
		Если НЕ ЭлементОтбора.Родитель = Неопределено Тогда
			// Выходим:
			Возврат Ложь;
		КонецЕсли;
		
		// Установлен отбор на равенство одному значению?
		ВидСравненияЭлемента = ЭлементОтбора.ВидСравнения;
		Если ВидСравненияЭлемента = ВидСравненияКомпоновкиДанных.Равно Тогда
			ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
			// Выходим:
			Возврат Истина;
			
		ИначеЕсли ВидСравненияЭлемента = ВидСравненияКомпоновкиДанных.ВСписке Тогда
			СписокЗначенийЭлемента = ЭлементОтбора.ПравоеЗначение;
			Попытка
				Колво = СписокЗначенийЭлемента.Количество();
			Исключение
				Колво = 0;
			КонецПопытки;
			
			Если Колво = 0 Тогда
				// Выходим:
				Возврат Истина;
				
			Иначе
				ПервоеЗначение = СписокЗначенийЭлемента[0].Значение;
				Для инд = 1 По Колво - 1 Цикл
					Если НЕ СписокЗначенийЭлемента[инд].Значение = ПервоеЗначение Тогда
						// Выходим:
						Возврат Ложь;
					КонецЕсли;
				КонецЦикла;
				
				ПравоеЗначение = ПервоеЗначение;
				// Выходим:
				Возврат Истина;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Механизм связи полей шапки и отбора
//---
