
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриСозданииНаСервере(Отказ, СтандартнаяОбработка,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	ЗаполнитьТекстПроСчетФактуруСервер();
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
			Объект.ВалютаДокумента = ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета;
		КонецЕсли;
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбщегоНазначенияБГУ.ПриСозданииНаСервере(ЭтотОбъект, Объект);

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
	УчетОригиналовПервичныхДокументов.ПриСозданииНаСервере_ФормаДокумента(ЭтотОбъект, Элементы.Подвал);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов 
	ПрослеживаемостьФормыБГУ.УстановитьУсловноеОформление(ЭтотОбъект);
	
	// ИнтеграцияС1САрхивом
	ОбменСАрхивом.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1САрхивом

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьДоговора();
	УстановитьДоступностьЭлементов();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект,
		Элементы.БухгалтерскаяОперация, Элементы.ДополнительныеТабличныеЧасти);
	// Конец Типовые операции и дополнительные табличные части
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриЧтенииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументСсылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.КомандыЭДО;
	ПараметрыЭДОПриСоздании.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПриЧтенииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	ОбщегоНазначенияБГУ.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииКлиент.ПередЗаписью(Отказ, ПараметрыЗаписи, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	БухгалтерскиеОперацииСервер.ПередЗаписью(Отказ, ТекущийОбъект, ПараметрыЗаписи, ЭтаФорма);
	ТекущийОбъект.СуммаДокумента = Объект.СоставЭтапаРабот.Итог("Всего");
	
	ОбщегоНазначенияБГУ.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	БухгалтерскиеОперацииКлиент.ПослеЗаписи(ПараметрыЗаписи, ЭтаФорма);

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтотОбъект, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Типовые операции и дополнительные табличные части
	БухгалтерскиеОперацииСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец Типовые операции и дополнительные табличные части
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, ТекущийОбъект);
	ОбщегоНазначенияБГУ.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Запись_СчетФактураВыданный" Тогда
		ЗаполнитьТекстПроСчетФактуруКлиент(Параметр, Источник);
	КонецЕсли;

	Если ИмяСобытия = "ОбновитьСостояниеЭД" Тогда
		
		// Подсистема "ОбменСКонтрагентами".
		ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
		ПараметрыОповещения.Форма = ЭтотОбъект;
		ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
		ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
		ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
		
		ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
		// Конец подсистема "ОбменСКонтрагентами".

	КонецЕсли;
	
	// СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов    
	УчетОригиналовПервичныхДокументовКлиент.ОбработчикОповещенияФормаДокумента(ИмяСобытия, ЭтотОбъект, Источник);
	// Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов

	ОбщегоНазначенияБГУКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.КонтрольИсполненияДоговоров" Тогда
		Объект.ОтразитьВГрафикеИсполненияДоговора = ВыбранноеЗначение;
		КонтрольИсполненияДоговоровКлиент.УстановитьСтатусОтразитьДокументВГрафикеИсполнения(
			ЭтотОбъект, Объект.ОтразитьВГрафикеИсполненияДоговора); 
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НомераГТД.Форма.ФормаПодбораРНПТ" Тогда
		ОбработкаВыбораРНПТНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ПередЗакрытием(ЭтотОбъект, Объект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовТиповойОперации

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	БухгалтерскиеОперацииКлиент.ПриНачалеВыбораТиповойОперации(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииТиповойОперации(Элемент)
	
	ПодключаемыйСервер_ПриИзмененииТиповойОперации(Элемент.Родитель.Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПодключаемыйСервер_ПриИзмененииТиповойОперации(ИмяЭлемента)

	БухгалтерскиеОперацииСервер.ПриИзмененииТиповойОперации(ЭтаФорма.Элементы[ИмяЭлемента]);	

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаОткрытьОперацию(Команда)

	БухгалтерскиеОперацииКлиент.КомандаОткрытьОперацию(Объект, Элементы.БухгалтерскаяОперация);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКурсВалюты(Команда)

	БухгалтерскиеОперацииКлиент.ОбновитьКурсВалюты(ЭтаФорма, Объект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриНачалеВыбораДопРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	БухгалтерскиеОперацииКлиент.ДопРеквизитНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДопРеквизита(Элемент)

	БухгалтерскиеОперацииКлиент.ДопРеквизитИзменение(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент)

	БухгалтерскиеОперацииКлиент.ПриИзмененииРеквизитаДополнительнойТабличнойЧасти(Элемент, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УправлениеТиповымиОперациями(Команда)

	БухгалтерскиеОперацииКлиент.КомандаУправлениеТиповымиОперациями(ЭтаФорма, Команда);	

КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ОбщегоНазначенияБГУКлиент.ПриИзмененииДатыДокумента(ЭтотОбъект, Объект, "ДатаПриИзмененииНаКлиенте");
	// Дальнейшая обработка изменения даты выполняется в процедурах ДатаПриИзмененииНаКлиенте и ДатаПриИзмененииНаСервере.
	// Код, размещенный здесь, может работать неправильно, т.к. пользователь мог отказаться от изменения даты.
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииНаКлиенте(Результат, ДополнительныеПараметры) Экспорт
	
	// Структура КэшПараметров инициализируется в ОбщегоНазначенияБГУ.ИнициализироватьКэшПараметровФормы().
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика
	 ИЛИ (Объект.ВалютаДокумента <> ЭтотОбъект.КэшПараметров.ВалютаРегламентированногоУчета
	 	И НЕ ЭтотОбъект.КэшПараметров.ИзмениласьДатаВПределахДня) Тогда
		
		ДатаПриИзмененииНаСервере();
		
		БухгалтерскиеОперацииКлиент.ПоказатьОповещениеПриИзмененииКурсаВалюты(
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьДатаДляКонтроляКурса,
			ЭтотОбъект.КэшПараметров.Служебные.ИзмениласьВалютаДляКонтроляКурса);
		
	КонецЕсли;
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если ЭтотОбъект.КэшПараметров.ИзмениласьУчетнаяПолитика Тогда
		
		ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
		
	КонецЕсли;
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	УстановитьДоступностьДоговора();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИФОПриИзменении(Элемент)
	
	ИФОПриИзмененииНаСервере();
	
	ОбщегоНазначенияБГУКлиент.ПослеИзмененияКлючевыхРеквизитовДокумента(ЭтотОбъект, Объект)
	
КонецПроцедуры

&НаСервере
Процедура ИФОПриИзмененииНаСервере()
	
	ОбщегоНазначенияБГУ.ПриИзмененииУчетнойПолитики(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	УстановитьДоступностьДоговора();
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВестиГрафикПлатежей,ВестиПланГрафикИсполнения"); 
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиГрафикПлатежей", ?(РеквизитыДоговора.ВестиГрафикПлатежей = Истина, Истина, Ложь));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиПланГрафикИсполнения", ?(РеквизитыДоговора.ВестиПланГрафикИсполнения = Истина, Истина, Ложь));
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьВидимостьЭлементов(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров,
		ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей);
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", Объект.Организация);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Исполнитель = "";
		ИсполнительДолжность = "";
		Возврат;
	КонецЕсли;
	
	ДанныеСотрудника = ИсполнительОбработкаВыбораСервер(ВыбранноеЗначение, Объект.Дата);
	
	Объект.Исполнитель = ДанныеСотрудника.НаименованиеПолное;
	
	Объект.ИсполнительДолжность = ДанныеСотрудника.ДолжностьНаименование;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	БухгалтерскиеОперацииКлиентСервер.ОбновитьКурсВалютыВФормеДокумента(ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьОплатуПриИзменении(Элемент)
	
	Если Объект.ЗапланироватьОплату Тогда
		Объект.ОплатитьДо = ПредельнаяДатаОплатыЗадолженности(Объект.Дата, Объект.Договор);
	Иначе
		Объект.ОплатитьДо = Неопределено;
	КонецЕсли;
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату);
	
КонецПроцедуры

&НаКлиенте
Процедура Реализация0ПриИзменении(Элемент)
	
	Если Объект.РеализацияПоСтавке0 Тогда
		НДС0 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
		
		Для Каждого Строка Из Объект.СоставЭтапаРабот Цикл
			Строка.СтавкаНДС = НДС0;
			ПересчитатьСуммуНДС(Строка);
			Строка.Всего = Строка.Сумма;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.СоставЭтапаРаботСтавкаНДС.ТолькоПросмотр = Объект.РеализацияПоСтавке0;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапСдачиРаботНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.СоставЭтапаРабот.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ЭтапСдачиРаботНачалоВыбораОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Табличная часть будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапСдачиРаботОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЭтапСдан(ВыбранноеЗначение) Тогда
		Оповещение = Новый ОписаниеОповещения("ЭтапСдачиРаботОбработкаВыбораОповещение", ЭтотОбъект, ВыбранноеЗначение);
		ПоказатьВопрос(Оповещение, НСтр("ru='Выбранный этап отмечен как сданный. Выбрать этот этап?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетФактураНажатие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.СчетФактураНажатие(СчетФактура, ЭтаФорма, СтандартнаяОбработка, "СчетФактураВыданный");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияБГУНажатие(Элемент, СтандартнаяОбработка)
	
	ОбщегоНазначенияБГУКлиент.ДекорацияНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтражатьВПрослеживаемостиПриИзменении(Элемент)
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ИнтеграцияС1САрхивом_Нажатие(Элемент)
	ОбменСАрхивомКлиент.Нажатие(Элемент, ЭтотОбъект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставРабот

&НаКлиенте
Процедура СоставЭтапаРаботСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	Количество = ?(ТекущиеДанные.Количество <>0, ТекущиеДанные.Количество, 1);
	
	ТекущиеДанные.Цена = ТекущиеДанные.Сумма / Количество;
	
	ПересчитатьСуммуНДС(ТекущиеДанные, Объект.СуммаВключаетНДС);
	
	Если Объект.СуммаВключаетНДС Тогда
		ТекущиеДанные.Всего = ТекущиеДанные.Сумма;
	Иначе
		ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ТекущиеДанные.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботСуммаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	
	Если Объект.СуммаВключаетНДС Тогда
		ТекущиеДанные.Всего = ТекущиеДанные.Сумма;
	Иначе
		ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ТекущиеДанные.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	ПересчитатьСтрокуТабличнойЧасти(ТекущиеДанные, Объект.СуммаВключаетНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	ПересчитатьСтрокуТабличнойЧасти(ТекущиеДанные, Объект.СуммаВключаетНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	ПересчитатьСтрокуТабличнойЧасти(ТекущиеДанные, Объект.СуммаВключаетНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	
	Если Объект.СоставЭтапаРабот.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СуммаВключаетНДСПриИзмененииОповещение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru='Суммы табличной части будут пересчитаны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.СоставЭтапаРабот.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ТипЦеныНачалоВыбораОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Суммы табличной части будут пересчитаны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныПриИзменении(Элемент)
	
	ПересчитатьТабличнуюЧасть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныОчистка(Элемент, СтандартнаяОбработка)
	
	Если Объект.СоставЭтапаРабот.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		
		Оповещение = Новый ОписаниеОповещения("ТипЦеныОчисткаОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Суммы табличной части будут пересчитаны. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
		Возврат;
	КонецЕсли;
	
	ПересчитатьТабличнуюЧасть();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("СоставЭтапаРаботСодержаниеКонецВыбора", ЭтотОбъект);
	ТекущиеДанные = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(ОписаниеОповещения, ТекущиеДанные.Содержание, "Введите содержание работы");
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботСодержаниеКонецВыбора(Строка, Параметры) Экспорт
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	Элементы.СоставЭтапаРабот.ТекущиеДанные.Содержание = Строка;
	
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботПриИзменении(Элемент)
	СоставЭтапаРаботПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПрослеживаемостьФормыБГУКлиент.МатериалыВыбор(ЭтотОбъект, Поле, СтандартнаяОбработка, Ложь, "СоставЭтапаРабот");
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботРНПТНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПрослеживаемостьФормыБГУКлиент.ОткрытьФормуПодбораРНПТ(ЭтотОбъект, "СоставЭтапаРабот");
КонецПроцедуры

&НаКлиенте
Процедура СоставЭтапаРаботРНПТОчистка(Элемент, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если СтрокаТабличнойЧасти.ПрослеживаемыйТовар Тогда
		УдалитьСтрокиРНПТ(СтрокаТабличнойЧасти.ИдентификаторСтроки);
	Иначе
		СтрокаТабличнойЧасти.РНПТ = Неопределено;
	КонецЕсли;
	
	ПрослеживаемостьФормыБГУКлиентСервер.ОчиститьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ЗначениеЗаполнено(Объект.ЭтапСдачиРабот) Тогда
		ТекстСообщения = НСтр("ru='Необходимо выбрать этап сдачи работ!'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.ЭтапСдачиРабот");
		
		Возврат;
	КонецЕсли;
	
	Если Объект.СоставЭтапаРабот.Количество() > 0 Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьОповещение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, НСтр("ru='Табличная часть будет очищена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
		Возврат;
	КонецЕсли;
		
	ЗаполнитьНаСервере();
КонецПроцедуры

// КонтрольИсполненияДоговоров
&НаКлиенте
Процедура Подключаемый_КонтрольИсполненияДоговоровПоказатьСтатус(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ДокументСсылка", Объект.Ссылка);
	ДопПараметры.Вставить("ВалютаДокумента", Объект.ВалютаДокумента);
	ДопПараметры.Вставить("ОтразитьВГрафикеИсполнения", Объект.ОтразитьВГрафикеИсполненияДоговора);
	
	КонтрольИсполненияДоговоровКлиент.ПоказатьСтатусИсполнения(
		Объект.Организация, Объект.Контрагент, Объект.Договор, ДопПараметры, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры
// Конец КонтрольИсполненияДоговоров

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуБГУ(Команда)
	
	ОбщегоНазначенияБГУКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

// ИнтеграцияС1САрхивом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивом(Команда)
	ОбменСАрхивомКлиент.ВыполнитьПодключаемуюКоманду(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ВедетсяУчетПрослеживаемыхТоваров = ПрослеживаемостьБГУ.ВедетсяУчетПрослеживаемыхТоваров(Объект.Дата);

	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ИспользоватьКонтрольИсполненияДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров"));
	РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Договор, "ВестиГрафикПлатежей,ВестиПланГрафикИсполнения");
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиГрафикПлатежей", ?(РеквизитыДоговора.ВестиГрафикПлатежей = Истина, Истина, Ложь));
	ЭтотОбъект.КэшПараметров.Локальные.Вставить("ВестиПланГрафикИсполнения", ?(РеквизитыДоговора.ВестиПланГрафикИсполнения = Истина, Истина, Ложь));
	КонтрольИсполненияДоговоров.ОбновитьГруппуКонтрольИсполнения(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));
	
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьВидимостьЭлементов(ЭтотОбъект,
		ЭтотОбъект.КэшПараметров.Локальные.ИспользоватьКонтрольИсполненияДоговоров,
		ЭтотОбъект.КэшПараметров.Локальные.ВестиГрафикПлатежей);
	КонтрольИсполненияДоговоровКлиентСервер.ЗапланироватьОплатуУстановитьДоступностьОплатитьДо(ЭтотОбъект, Объект.ЗапланироватьОплату); 
	
	ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(Объект.СоставЭтапаРабот);
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТВоВсехСтроках(ЭтотОбъект, "СоставЭтапаРабот");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовПрослеживаемости(Форма)

	ВидимостьЭлементовПрослеживаемости = Форма.ВедетсяУчетПрослеживаемыхТоваров И Форма.ЕстьПрослеживаемыеТовары;
	
	ИменаЭлементовПрослеживаемости = Новый Массив;
	ИменаЭлементовПрослеживаемости.Добавить("ОтражатьВПрослеживаемости");
	ИменаЭлементовПрослеживаемости.Добавить("СоставЭтапаРаботПрослеживаемыйТовар");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементовПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости);
	
	ИменаЭлементовДвиженияПрослеживаемости = Новый Массив;
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("СоставЭтапаРаботСтранаПроисхождения");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("СоставЭтапаРаботРНПТ");
	ИменаЭлементовДвиженияПрослеживаемости.Добавить("КодОперацииПрослеживаемости");
	ОбщегоНазначенияБГУКлиентСервер.УстановитьСвойствоЭлементовФормы(Форма.Элементы, ИменаЭлементовДвиженияПрослеживаемости,
		"Видимость", ВидимостьЭлементовПрослеживаемости И Форма.Объект.ОтражатьВПрослеживаемости);

КонецПроцедуры

&НаСервере
Процедура СоставЭтапаРаботПриИзмененииСервер()
	ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(Объект.СоставЭтапаРабот);
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиРНПТ(Знач ИдентификаторСтроки)
	
	СтрокиСРНПТ = Объект.СведенияПрослеживаемости.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	
	Для Каждого СтрокаСРНПТ Из СтрокиСРНПТ Цикл
		Объект.СведенияПрослеживаемости.Удалить(СтрокаСРНПТ);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьРНПТВХранилище(Адрес, ДополнительныеПараметры) Экспорт
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ПоместитьРНПТВХранилищеНаСервере(Адрес, ДополнительныеПараметры.ИдентификаторСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьРНПТВХранилищеНаСервере(Адрес, ИдентификаторСтроки)

	ТаблицаРНПТ = Объект.СведенияПрослеживаемости.Выгрузить(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	ПоместитьВоВременноеХранилище(ТаблицаРНПТ, Адрес);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораРНПТНаКлиенте(ВыбранноеЗначение)
	
	СтрокаТабличнойЧасти = Элементы.СоставЭтапаРабот.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
		СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	ОбработкаВыбораРНПТННаСервере(СтрокаТабличнойЧасти.ИдентификаторСтроки, ВыбранноеЗначение, СтрокаТабличнойЧасти.ПолучитьИдентификатор());
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораРНПТННаСервере(Знач ИдентификаторСтроки, Знач ВыбранноеЗначение, Знач ИдентификаторСтрокиВнутр)
	
	СтрокаТабличнойЧасти = Объект.СоставЭтапаРабот.НайтиПоИдентификатору(ИдентификаторСтрокиВнутр);
	ПрослеживаемостьФормыБГУ.ОбработкаВыбораРНПТН(ЭтотОбъект, ИдентификаторСтроки, ВыбранноеЗначение);
	ПрослеживаемостьФормыБГУ.ЗаполнитьПредставлениеРНПТ(ЭтотОбъект, СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДекорацияСостояниеОригиналаНажатие()
    // СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
    УчетОригиналовПервичныхДокументовКлиент.ОткрытьМенюВыбораСостояния(ЭтотОбъект,Элементы.ДекорацияСостояниеОригинала);
    //Конец СтандартныеПодсистемы.УчетОригиналовПервичныхДокументов
КонецПроцедуры

#Область ОбработчикиОповещений

&НаКлиенте
Процедура ЭтапСдачиРаботНачалоВыбораОповещение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.СоставЭтапаРабот.Очистить();
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Владелец", Объект.Организация);
		ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.ЭтапСдачиРабот);
		
		ОткрытьФорму("Справочник.ЭтапыСдачиРабот.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ЭтапСдачиРабот, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапСдачиРаботОбработкаВыбораОповещение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ЭтапСдачиРабот = ДопПараметры;
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Владелец", Объект.Организация);
		ПараметрыФормы.Вставить("ТекущаяСтрока", Объект.ЭтапСдачиРабот);
		
		ОткрытьФорму("Справочник.ЭтапыСдачиРабот.Форма.ФормаВыбора", ПараметрыФормы, Элементы.ЭтапСдачиРабот, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзмененииОповещение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для Каждого Строка Из Объект.СоставЭтапаРабот Цикл
			ПересчитатьСтрокуТабличнойЧасти(Строка, Объект.СуммаВключаетНДС);
		КонецЦикла;
	Иначе
		Объект.СуммаВключаетНДС = Не Объект.СуммаВключаетНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныНачалоВыбораОповещение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОткрытьФорму("Справочник.ТипыЦенНоменклатуры.Форма.ФормаВыбора", , Элементы.ТипЦены, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныОчисткаОповещение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ТипЦены = ПредопределенноеЗначение("Справочник.ТипыЦенНоменклатуры.ПустаяСсылка");
		ПересчитатьТабличнуюЧасть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОповещение(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция ЭтапСдан(Ссылка)
	Возврат Ссылка.ЭтапСдан;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТекстПроСчетФактуруКлиент(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения)
	
	Перем ЗначениеСвойства;
	
	ЭтотДокументЯвляетсяОснованием = (ТипЗнч(ПараметрОбработкиОповещения) = Тип("Структура")
		И ПараметрОбработкиОповещения.Свойство("ДокументыОснования", ЗначениеСвойства)
		И ЗначениеСвойства.Найти(Объект.Ссылка) <> Неопределено);
	
	Если ЭтотДокументЯвляетсяОснованием Тогда
		ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекстПроСчетФактуруСервер(ПараметрОбработкиОповещения = Неопределено, ИсточникОбработкиОповещения = Неопределено)
	
	УчетНДС.ЗаполнитьТекстПроСчетФактуру(ЭтаФорма, ПараметрОбработкиОповещения, ИсточникОбработкиОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьДоговора()
	Элементы.Договор.Доступность = ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.Контрагент);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	Элементы.СоставЭтапаРаботСтавкаНДС.ТолькоПросмотр = Объект.РеализацияПоСтавке0;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Номенклатура КАК Номенклатура,
	|	Спр.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	Спр.Номенклатура.НаименованиеПолное КАК Содержание,
	|	ВЫБОР
	|		КОГДА &Реализация0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|		ИНАЧЕ Спр.Номенклатура.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	ЦеныНоменклатуры.Цена КАК Цена,
	|	ЛОЖЬ КАК КомплектСПрослеживаемымиТоварами,
	|	ЛОЖЬ КАК ПрослеживаемыйТовар
	|ИЗ
	|	Справочник.СоответствиеЭтаповРаботИНоменклатуры КАК Спр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатуры
	|		ПО Спр.Номенклатура.Ссылка = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	Спр.Владелец = &Этап";
	
	ДатаДанные = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ОбщегоНазначения.ТекущаяДатаПользователя());
	
	Запрос.УстановитьПараметр("Дата", ДатаДанные);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТипЦен", Объект.ТипЦены);
	Запрос.УстановитьПараметр("Этап", Объект.ЭтапСдачиРабот);
	Запрос.УстановитьПараметр("Реализация0", Объект.РеализацияПоСтавке0);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Если ВедетсяУчетПрослеживаемыхТоваров Тогда
		
		ТаблицаРезультата = Результат.Выгрузить();
		
		СвойстваНоменклатуры = УправлениеМатериальнымиЗапасами.ПризнакиПрослеживаемостиНоменклатуры(
		ТаблицаРезультата.ВыгрузитьКолонку("Номенклатура"),
		ДатаДанные);
		
		Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
			ЗаполнитьЗначенияСвойств(СтрокаРезультата, СвойстваНоменклатуры.Получить(СтрокаРезультата.Номенклатура));
			ЗаполнитьЗначенияСвойств(Объект.СоставЭтапаРабот.Добавить(), СтрокаРезультата);
		КонецЦикла;
			
	ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(Объект.СоставЭтапаРабот);
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);

	Иначе
		Объект.СоставЭтапаРабот.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
	ЕстьПрослеживаемыеТовары = ПрослеживаемостьБГУ.ЕстьПрослеживаемыеТовары(Объект.СоставЭтапаРабот);
	УстановитьВидимостьЭлементовПрослеживаемости(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСтрокуТабличнойЧасти(ТекущиеДанные, СуммаВключаетНДС = Ложь)
	
	Количество = ?(ТекущиеДанные.Количество<>0, ТекущиеДанные.Количество, 1);
	ТекущиеДанные.Сумма = Количество*ТекущиеДанные.Цена;
	ПересчитатьСуммуНДС(ТекущиеДанные, СуммаВключаетНДС);
	
	Если СуммаВключаетНДС Тогда
		ТекущиеДанные.Всего = ТекущиеДанные.Сумма;
	Иначе
		ТекущиеДанные.Всего = ТекущиеДанные.Сумма + ТекущиеДанные.СуммаНДС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСуммуНДС(ТекущиеДанные, СуммаВключаетНДС = Ложь)
	
	МножительСтавки = УчетНДСКлиентСервер.ПолучитьМножительСтавки(ТекущиеДанные.СтавкаНДС, СуммаВключаетНДС, Не СуммаВключаетНДС);
	
	ТекущиеДанные.СуммаНДС = ТекущиеДанные.Сумма * МножительСтавки;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьТабличнуюЧасть()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТабТЧ.Номенклатура КАК Номенклатура,
	|	ТабТЧ.Содержание КАК Содержание,
	|	ТабТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТабТЧ.Количество КАК Количество,
	|	ТабТЧ.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ ТабТЧ
	|ИЗ
	|	&ТабТЧ КАК ТабТЧ;
	|
	|ВЫБРАТЬ
	|	ТабТЧ.Номенклатура КАК Номенклатура,
	|	ТабТЧ.Содержание КАК Содержание,
	|	ТабТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТабТЧ.Количество КАК Количество,
	|	ТабТЧ.СтавкаНДС КАК СтавкаНДС,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена
	|ИЗ ТабТЧ КАК ТабТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Дата,
	|				Организация = &Организация
	|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатуры
	|		ПО ТабТЧ.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ТипЦен", Объект.ТипЦены);
	Запрос.УстановитьПараметр("ТабТЧ", Объект.СоставЭтапаРабот.Выгрузить());
	
	ТаблицаСоставЭтапаРабот = Запрос.Выполнить().Выгрузить();
	
	ТипСумма = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	
	ТаблицаСоставЭтапаРабот.Колонки.Добавить("Сумма", ТипСумма);
	ТаблицаСоставЭтапаРабот.Колонки.Добавить("СуммаНДС", ТипСумма);
	ТаблицаСоставЭтапаРабот.Колонки.Добавить("Всего", ТипСумма);
	
	Для Каждого СтрокаТаблицы Из ТаблицаСоставЭтапаРабот Цикл
		ПересчитатьСтрокуТабличнойЧасти(СтрокаТаблицы, Объект.СуммаВключаетНДС);
	КонецЦикла;
	
	Объект.СоставЭтапаРабот.Загрузить(ТаблицаСоставЭтапаРабот);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИсполнительОбработкаВыбораСервер(Сотрудник, Период)
	
	ДанныеСотрудника = Новый Структура("СсылкаНаОбъект, Период, НаименованиеПолное, Должность, ДолжностьНаименование",
	Сотрудник, 
	Период);
	
	Справочники.Сотрудники.ПолучитьДанныеСотрудника(ДанныеСотрудника);
	
	Возврат ДанныеСотрудника;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Договор)
	
	Возврат КонтрольИсполненияДоговоров.ПредельнаяДатаОплатыЗадолженности(ДатаДокумента, Договор);
	
КонецФункции

#Область ОбработчикиСобытийПроцессыОбработкиДокументов

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокумента(Команда)
	ОбщегоНазначенияБГУКлиент.ВыполнитьЗадачу(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьЗадачуПоОбработкеДокументаОповещение(Контекст, ДополнительныеПараметры) Экспорт
	ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст);
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры, Контекст);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗадачуПоОбработкеДокументаНаСервере(Контекст)
	ОбщегоНазначенияБГУ.ВыполнитьЗадачу(ЭтотОбъект, Контекст, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийНаправившегоОткрытие(Элемент, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийНаправившегоОткрытие(ЭтотОбъект, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомментарийСледующемуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияБГУКлиент.КомментарийСледующемуНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти
	
// ИнтеграцияС1САрхивом
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуИнтеграцииС1САрхивомНаСервере(Знач Параметры) Экспорт
	ОбменСАрхивом.ВыполнитьПодключаемуюКоманду(ЭтотОбъект, Параметры);
КонецПроцедуры
// Конец ИнтеграцияС1САрхивом

#КонецОбласти
