#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
 
	ТаблицыДляДвижений = СтруктураДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Ведомость.Ссылка КАК Регистратор,
	|	Ведомость.Организация КАК Организация,
	|	Ведомость.КонецПериода КАК Период,
	|	&ВидДвижения КАК ВидДвижения,
	|	Ведомость.НачалоПериода КАК НачалоПериода,
	|	ВедомостьТЧ.ДетскоеУчреждение КАК ДетскоеУчреждение,
	|	ВедомостьТЧ.Ребенок КАК Ребенок,
	|	ВедомостьТЧ.Плательщик КАК Плательщик,
	|	ВедомостьТЧ.ПроцентКомпенсации КАК ПроцентКомпенсации,
	|	ВедомостьТЧ.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ВедомостьТЧ.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ВедомостьТЧ.КПС КАК КПС,
	|	ВедомостьТЧ.КФО КАК КФО,
	|	Ведомость.ИФО КАК ИФО
	|ИЗ
	|	Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ВедомостьКомпенсации КАК ВедомостьТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате КАК Ведомость
	|		ПО ВедомостьТЧ.Ссылка = Ведомость.Ссылка
	|ГДЕ
	|	Ведомость.Ссылка = &Ссылка
	|	И НЕ ВедомостьТЧ.Аннулировано";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений.Вставить("УчетКомпенсацииРодительскойПлаты", Результат);

КонецПроцедуры


// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати	= "Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате";
	КомандаПечати.Идентификатор		= "ПФ_MXL_ВедомостьКомпенсацииРПКВыплате";
	КомандаПечати.Представление		= НСтр("ru = 'Ведомость компенсации родительской платы к выплате'");
	КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ВедомостьКомпенсацииРПКВыплате") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ВедомостьКомпенсацииРПКВыплате",
			"Ведомость компенсации родительской платы к выплате",
			ПечатьВедомостиКВыплате(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
		
КонецПроцедуры

// Возвращает таблицу ведомости, свернутую по КПС и КФО.
// 
// Параметры:
// 	Ссылка - ДокументСсылка.ВедомостьКомпенсацииРодительскойПлатыКВыплате - документ
// Возвращаемое значение:
// 	ТаблицаЗначений - свернутая таблица. Содержит колонки:
//		* КПС - СправочникСсылка.КлассификационныеПризнакиСчетов - КПС
//		* КФО - ПеречислениеСсылка.КВД - КФО
//		* СуммаКомпенсации - Число - сумма компенсации.
Функция ВедомостьКомпенсацииПоКПС(Ссылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КПС,
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КФО,
	|	СУММА(ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.СуммаКомпенсации) КАК СуммаКомпенсации
	|ИЗ
	|	Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ВедомостьКомпенсации КАК
	|		ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации
	|ГДЕ
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.Ссылка = &Ведомость
	|	И
	|	НЕ ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.Аннулировано
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КПС,
	|	ВедомостьКомпенсацииРодительскойПлатыКВыплатеВедомостьКомпенсации.КФО";
	Запрос.УстановитьПараметр("Ведомость", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьДанныеНачисленияКомпенсации(Документ, КассовыйОрган) Экспорт
	
	Результат = Новый Структура("Шапка, ВедомостьКомпенсации");

	ДанныеЗаполнения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Дата, Организация, ИФО, Подразделение,"
		+ "ДетскоеУчреждение, ГруппаДетскогоУчреждения, РасчетЗаНесколькоМесяцев, НачалоПериода, КонецПериода,"
		+ "НаправлениеДеятельности");	
	
	// Реквизиты шапки
	Результат.Шапка = ДанныеЗаполнения;
	
	// Данные табличной части
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НачислениеКомпенсацииРодительскойПлатыНачисления.Ребенок КАК Ребенок
	|ПОМЕСТИТЬ СоставДокумента
	|ИЗ
	|	Документ.НачислениеКомпенсацииРодительскойПлаты.Начисления КАК НачислениеКомпенсацииРодительскойПлатыНачисления
	|ГДЕ
	|	НачислениеКомпенсацииРодительскойПлатыНачисления.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ребенок
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлательщикиПоУслугамДДУСрезПоследних.Ребенок,
	|	ПлательщикиПоУслугамДДУСрезПоследних.СчетПлательщика
	|ПОМЕСТИТЬ ДанныеПлательщиков
	|ИЗ
	|	РегистрСведений.ПлательщикиПоУслугамДДУ.СрезПоследних(&ДатаСреза, Ребенок В (ВЫБРАТЬ
	|				СоставДокумента.Ребенок
	|			Из
	|				СоставДокумента КАК СоставДокумента)) КАК
	|		ПлательщикиПоУслугамДДУСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНачислений.ДетскоеУчреждение КАК ДетскоеУчреждение,
	|	ТаблицаНачислений.ГруппаДетскогоУчреждения КАК ГруппаДетскогоУчреждения,
	|	ТаблицаНачислений.Договор КАК Договор,
	|	ТаблицаНачислений.Ребенок КАК Ребенок,
	|	ТаблицаНачислений.Ребенок.Контрагент КАК Контрагент,
	|	ТаблицаНачислений.Плательщик КАК Плательщик,
	|	ЕСТЬNULL(ДанныеПлательщиков.СчетПлательщика, ЗНАЧЕНИЕ(Справочник.БанковскиеИКазначейскиеСчета.ПустаяСсылка)) КАК СчетПлательщика,
	|	ТаблицаНачислений.ПроцентКомпенсации КАК ПроцентКомпенсации,
	|	ТаблицаНачислений.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ТаблицаНачислений.НастройкаКомпенсации КАК НастройкаКомпенсации,
	|	ЕСТЬNULL(ТаблицаНачислений.НастройкаКомпенсации.РасчетКомпенсацииНеЗависитОтБазы, ЛОЖЬ) КАК НеЗависитОтБазы,
	|	ТаблицаНачислений.КПС КАК КПС,
	|	ТаблицаНачислений.КФО КАК КФО
	|ИЗ
	|	Документ.НачислениеКомпенсацииРодительскойПлаты.Начисления КАК ТаблицаНачислений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПлательщиков КАК ДанныеПлательщиков
	|		ПО ТаблицаНачислений.Ребенок = ДанныеПлательщиков.Ребенок
	|ГДЕ
	|	ТаблицаНачислений.Ссылка = &Ссылка
	|	И &УсловиеКассовыйОрган
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаНачислений.НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка",    Документ);
	Запрос.УстановитьПараметр("ДатаСреза", ДанныеЗаполнения.Дата);
	
	Если ЗначениеЗаполнено(КассовыйОрган) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКассовыйОрган", "ЕстьNULL(ДанныеПлательщиков.СчетПлательщика.КассовыйОрган, ЗНАЧЕНИЕ(Справочник.Банки.ПустаяСсылка)) = &КассовыйОрган");
		Запрос.УстановитьПараметр("КассовыйОрган", КассовыйОрган);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеКассовыйОрган", "ИСТИНА");
	КонецЕсли;
	
	Результат.ВедомостьКомпенсации = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьВедомостиКВыплате(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_ВедомостьКомпенсацииРПКВыплате";
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ПФ_MXL_ВедомостьКомпенсацииРПКВыплате");
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		ДанныеДляПечати = ПодготовитьДанныеДляПечати(Ссылка);
		
		Область = Макет.ПолучитьОбласть("Шапка");
		
		Если НЕ ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения) Тогда
			Область.УдалитьОбласть(Область.Область("ГруппаШапка"), ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		Область.Параметры.Заполнить(ДанныеДляПечати.Шапка);
		ТабДок.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Строка");
		
		Если ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения) Тогда
			Область.УдалитьОбласть(Область.Область("ГруппаСтрока"), ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		Для Каждого Стр Из ДанныеДляПечати.ТаблицаСтрок Цикл
			Область.Параметры.Заполнить(Стр);
			ТабДок.Вывести(Область);
		КонецЦикла;
		
		Область = Макет.ПолучитьОбласть("Итого");
		Область.Параметры.Заполнить(ДанныеДляПечати.Итоги);
		ТабДок.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("Подписи");
		Область.Параметры.Заполнить(ДанныеДляПечати.Подписи);
		ТабДок.Вывести(Область);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок, 1, ОбъектыПечати, МассивОбъектов[0]);
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПодготовитьДанныеДляПечати(Ссылка)
	
	ДанныеДляПечати = Новый Структура;
	
	Шапка = Новый Структура;
	Шапка.Вставить("Период", Формат(Ссылка.НачалоПериода, "ДФ='ММММ гггг ""г.""'"));
	Шапка.Вставить("Дата", Ссылка.Дата);
	Шапка.Вставить("Организация", ?(Ссылка.Организация.ИспользоватьВПлатежныхДокументахСокращенноеНаименование, Ссылка.Организация.Наименование, Ссылка.Организация.НаименованиеПолное));
	Шапка.Вставить("КодПоОКПО", Ссылка.Организация.КодОКПО);
	Шапка.Вставить("ГруппаДДУ", ?(ЗначениеЗаполнено(Ссылка.ГруппаДетскогоУчреждения), Ссылка.ГруппаДетскогоУчреждения, ""));
	Шапка.Вставить("ДокументОснование", ?(ЗначениеЗаполнено(Ссылка.ДокументОснование), Ссылка.ДокументОснование, ""));
	Шапка.Вставить("КассовыйОрган", ?(ЗначениеЗаполнено(Ссылка.КассовыйОрган), Ссылка.КассовыйОрган, ""));
	
	ДанныеДляПечати.Вставить("Шапка", Шапка);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВедомостьКомпенсацииКВыплате.НомерСтроки КАК Нпп,
	|	ВедомостьКомпенсацииКВыплате.ГруппаДетскогоУчреждения КАК ГруппаДДУ,
	|	ВедомостьКомпенсацииКВыплате.Ребенок КАК Ребенок,
	|	ВедомостьКомпенсацииКВыплате.Плательщик КАК Плательщик,
	|	ВедомостьКомпенсацииКВыплате.СчетПлательщика.Код КАК СчетПлательщика,
	|	ВедомостьКомпенсацииКВыплате.СуммаКомпенсации КАК СуммаКомпенсации,
	|	ВедомостьКомпенсацииКВыплате.ПроцентКомпенсации КАК Процент,
	|	Договоры.Договор КАК Договор
	|ИЗ
	|	Документ.ВедомостьКомпенсацииРодительскойПлатыКВыплате.ВедомостьКомпенсации КАК ВедомостьКомпенсацииКВыплате
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоставГруппДДУ.СрезПоследних(&КонецПериода, ) КАК Договоры
	|		ПО ВедомостьКомпенсацииКВыплате.Ребенок = Договоры.Ребенок
	|ГДЕ
	|	ВедомостьКомпенсацииКВыплате.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Нпп";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Ссылка.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Ссылка.КонецПериода));
	Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	Запрос.УстановитьПараметр("Группа", Ссылка.ГруппаДетскогоУчреждения);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаСтрок = Запрос.Выполнить().Выгрузить();
	
	ДанныеДляПечати.Вставить("ТаблицаСтрок", ТаблицаСтрок);
	
	Итоги = Новый Структура;
	Итоги.Вставить("СуммаКомпенсации", ТаблицаСтрок.Итог("СуммаКомпенсации"));
	
	ДанныеДляПечати.Вставить("Итоги", Итоги);
	
	Подписи = Новый Структура;
	Подписи.Вставить("Дата", Ссылка.Дата);
	Подписи.Вставить("ГлБухгалтер", Корреспонденты.ФИОПоОбъекту(Ссылка.ГлБухгалтер, Истина));
	
	ДанныеДляПечати.Вставить("Подписи", Подписи);
	
	Возврат ДанныеДляПечати;
	
КонецФункции

#КонецОбласти

#КонецЕсли

