#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")  тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("Ребенок") тогда
			Элементы.Ребенок.ТолькоПросмотр = ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.Ребенок);
		КонецЕсли;	
		Если Параметры.ЗначенияЗаполнения.Свойство("ГруппаДетскогоУчреждения") тогда
			Элементы.ГруппаДетскогоУчреждения.ТолькоПросмотр 	= ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ГруппаДетскогоУчреждения);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИмяСобытия = "ИзменениеСоставаГруппДДУ";
	Параметр = Запись["Ребенок"];
	Оповестить(ИмяСобытия, Параметр);
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаДетскогоУчрежденияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.Ребенок) тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Отбор",Новый Структура("Владелец",ОрганизацияРебенок(Запись.Ребенок)));
		ОткрытьФорму("Справочник.ГруппыДетскогоУчреждения.ФормаВыбора",ПараметрыФормы,Элемент);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура РебенокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",Новый Структура("Организация",ОрганизацияГруппыДетскогоУчреждения(Запись.ГруппаДетскогоУчреждения)));
	ОткрытьФорму("Справочник.Дети.ФормаВыбора",ПараметрыФормы,Элемент);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОрганизацияГруппыДетскогоУчреждения(ГруппаДетскогоУчреждения)
	Возврат ГруппаДетскогоУчреждения.Владелец;
КонецФункции	

&НаСервереБезКонтекста
Функция ОрганизацияРебенок(Ребенок)
	Возврат Ребенок.Организация;
КонецФункции	

#КонецОбласти


