&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОценкаПроизводительностиКлиент.ЗамерВремени("ОткрытиеФормыСпискаДокументовПоОсновномуСредству");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ОсновноеСредство", ПараметрКоманды));
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ДокументыПоОсновномуСредству");
	
	Если ЭтоИмуществоКазны(ПараметрКоманды) Тогда
		
		ОткрытьФорму("ЖурналДокументов.ДокументыПоУчетуИмуществаКазны.Форма.ФормаСписка", ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	Иначе
		
		ОткрытьФорму("ЖурналДокументов.ДокументыПоОС.Форма.ФормаСписка", ПараметрыФормы,
			ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
			ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоИмуществоКазны(ОсновноеСредство)
	
	Если ТипЗнч(ОсновноеСредство) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновноеСредство, "ИмуществоКазны");
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции