////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("ОбъектФинансовогоВложения", ОбъектФинансовогоВложенияОтбор) Тогда
		
		КонтрагентОтбор = ОбъектФинансовогоВложенияОтбор.Контрагент;
		
		Элементы.Контрагент.Видимость = Ложь;
		
		ВалютаОтбор = ОбъектФинансовогоВложенияОтбор.Валюта;
		
		Элементы.Валюта.Видимость = Ложь;
		
		
	КонецЕсли;	

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТА ФОРМЫ Список

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Оповестить("ИзменениеСоставаПакетовАкций", ОбъектФинансовогоВложенияОтбор);
	
КонецПроцедуры
