
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ОбновитьПояснения(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МежотчетныйПериодПриИзменении(Элемент)
	
	Если Объект.МежотчетныйПериод Тогда 
		
		Объект.ПоказательСтрока 					= "";
		Объект.Показатель 							= "";
		Объект.РазделительСтрока 					= "";
		Объект.РазделительОпераций 					= "";
		Объект.ОстаткиВРазрезеПоказателя 			= Ложь;
		Объект.Приоритет  							= 0;
		Объект.ВыбиратьПроводкиСНомеромЖурналаСчета = Ложь;
		Объект.ВыводитьОборотыГлавнойКниги 			= Ложь;
		Объект.НеВыводитьОстаткиПоКЭК 				= Ложь;
		
		Объект.ВыбиратьИзСпискаЖО.Очистить();
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОборотыПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
 	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("Заголовок", "Выбор показателя");
	
	ОткрытьФорму("Справочник.Журналы.Форма.ФормаВыбораПоказателя", ПараметрыОткрытия,
			ЭтотОбъект,,,, Новый ОписаниеОповещения("ПослеВыбораРеквизита", ЭтотОбъект, "Показатель"));
	
КонецПроцедуры
		
&НаКлиенте
Процедура ПоказательСтрокаОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.ПоказательСтрока = "";
	Объект.Показатель = Неопределено;
	ПоказательПояснение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура РазделительОперацийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура("Заголовок", "Выбор разделителя операций");
	
	ОткрытьФорму("Справочник.Журналы.Форма.ФормаВыбораПоказателя", ПараметрыОткрытия,
			ЭтотОбъект,,,, Новый ОписаниеОповещения("ПослеВыбораРеквизита", ЭтотОбъект, "Разделитель"));
	
КонецПроцедуры

&НаКлиенте
Процедура РазделительОперацийОчистка(Элемент, СтандартнаяОбработка)
	
	Объект.РазделительСтрока = "";
	Объект.РазделительОпераций = Неопределено;
	РазделительПояснение = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьОборотыГлавнойКнигиПриИзменении(Элемент)
	
	Если НЕ Объект.ВыводитьОборотыГлавнойКниги Тогда
		Объект.ОборотыГлавнойКнигиБезКорреспонденции = Ложь;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужжебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораРеквизита(РезультатВыбора, Контекст) Экспорт
	
	Если ТипЗнч(РезультатВыбора) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Контекст = "Показатель" Тогда
		Объект.ПоказательСтрока = РезультатВыбора.Строка;
		Объект.Показатель = РезультатВыбора.Показатель;
	ИначеЕсли Контекст = "Разделитель" Тогда
		Объект.РазделительСтрока = РезультатВыбора.Строка;
		Объект.РазделительОпераций = РезультатВыбора.Показатель;
	КонецЕсли;
	
	ОбновитьПояснения();
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ОбщиеНастройки.Доступность = НЕ Объект.МежотчетныйПериод;
	Элементы.ОперацииОбороты.Доступность = НЕ Объект.МежотчетныйПериод;
	Элементы.РасширеннаяНастройкаОстатков.Доступность = НЕ Объект.МежотчетныйПериод;
	Элементы.ОборотыГлавнойКнигиБезКорреспонденции.Доступность = Объект.ВыводитьОборотыГлавнойКниги;
	
	Если НЕ Объект.МежотчетныйПериод Тогда
		Элементы.ОстаткиВРазрезеПоказателя.Доступность = НЕ Объект.НеВыводитьОстатки;
		Элементы.НеВыводитьОстаткиПоКЭК.Доступность = НЕ Объект.НеВыводитьОстатки;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьПояснения(Источник = Неопределено)
	
	Если Источник = Неопределено Тогда
		Источник = Объект;
	КонецЕсли;	
	
	СтруктураПоказателя = Новый Структура("ПоказательСтрока, ЭтоСубконто, ТипПоказателя, ТипРеквизита", Источник.ПоказательСтрока, Ложь, Источник.Показатель);
	СтруктураПоказателя = Справочники.Журналы.ЗаполнитьПоказательПоСтроке(СтруктураПоказателя);
	
	Если ЗначениеЗаполнено(СтруктураПоказателя.ПоказательСтрока) Тогда
		Если СтруктураПоказателя.ЭтоСубконто Тогда
			ПоказательПояснение = "Субконто: " + СтруктураПоказателя.ТипПоказателя.Наименование;
		Иначе
			ПоказательПояснение = "Измерение: " + СтруктураПоказателя.ИмяОбъекта;
		КонецЕсли;	
	КонецЕсли;
	
	СтруктураПоказателя = Новый Структура("ПоказательСтрока, ЭтоСубконто, ТипПоказателя, ТипРеквизита", Источник.РазделительСтрока, Ложь, Источник.РазделительОпераций);
	СтруктураПоказателя = Справочники.Журналы.ЗаполнитьПоказательПоСтроке(СтруктураПоказателя);
	
	Если ЗначениеЗаполнено(СтруктураПоказателя.ПоказательСтрока) Тогда
		Если СтруктураПоказателя.ЭтоСубконто Тогда
			РазделительПояснение = "Субконто: " + СтруктураПоказателя.ТипПоказателя.Наименование;
		Иначе
			РазделительПояснение = "Измерение: " + СтруктураПоказателя.ИмяОбъекта;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти