#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьФормуДокумента(ФормаДокумента) Экспорт
	
	ФормаДокумента.ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ФормаДокумента.ИспользоватьВалютныйУчет = ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	
	ФормаДокумента.НадписьИтогоВРублях = НСтр("ru='Итого в рублях:'");
	
	ФормаДокумента.ЦветТекстаФильтрУстановлен = ЦветаСтиля.ГиперссылкаЦвет;
	ФормаДокумента.ЦветТекстаФильтрНеУстановлен = ЦветаСтиля.ТекстИнформационнойНадписи;
	
	ФормаДокумента.СписокСчетовИсключенийСтрокой = ПолучитьСписокСчетовИсключенийСтрокой();
	
	ОграничитьВыборСчета_Раздел1СальдоКонечноеПоСчетам(ФормаДокумента);
	ОграничитьВыборСчета_СписокСчетов(ФормаДокумента);
	
	ИнициализироватьИменаПолейПоказываемыхВДиалоге(ФормаДокумента);
	
	УстановитьУсловноеОформление(ФормаДокумента);
	
КонецПроцедуры

Процедура ПроверитьЗаполнение(ДокументОбъект, Отказ) Экспорт
	
	ПараметрыПроверкиЗаполнения = НовыйПараметрыПроверкиЗаполнения();
	
	ПроверитьКорректностьГраницПериодаСверки(ДокументОбъект, Отказ);
	
	ПроверитьПризнакиКонтрагента(ДокументОбъект, Отказ);
	
	ПроверитьРаздел1СальдоНачальноеБезСчетов(ДокументОбъект, ПараметрыПроверкиЗаполнения, Отказ);
	
	ПроверитьСовместноеЗаполнениеТаблицРаздела1(ДокументОбъект, ПараметрыПроверкиЗаполнения);
	
КонецПроцедуры

Функция ПрочитатьРеквизитыКонтрагента(КонтрагентСсылка, НаДату) Экспорт
	
	РеквизитыКонтрагента = НовыйРеквизитыКонтрагента();
	
	Если Не ЗначениеЗаполнено(КонтрагентСсылка) Тогда
		Возврат РеквизитыКонтрагента;
	КонецЕсли;
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("КонтрагентСсылка",	КонтрагентСсылка);
	ЗапросПоиск.УстановитьПараметр("НаДату",			НаДату);
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. История КПП
	|//
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(&НаДату КАК ДАТА)					КАК	НаДату,
	|	МИНИМУМ(КППИстория.ДатаОкончанияДействия)	КАК ДатаОкончанияДействия
	|ПОМЕСТИТЬ
	|	ДатыОкончанияДействияКПП
	|ИЗ
	|	Справочник.Контрагенты.КППИстория КАК КППИстория
	|ГДЕ
	|	КППИстория.Ссылка = &КонтрагентСсылка
	|	И &НаДату < ДОБАВИТЬКДАТЕ(КППИстория.ДатаОкончанияДействия, ДЕНЬ, 1)
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(&НаДату КАК ДАТА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Реквизиты контрагента
	|//
	|ВЫБРАТЬ
	|	СправочникКонтрагенты.ИНН						КАК ИНН,
	|	ВЫБОР
	|		КОГДА &НаДату = ДАТАВРЕМЯ(1,1,1) ТОГДА
	|			СправочникКонтрагенты.КПП
	|		ИНАЧЕ
	|			ЕСТЬNULL(ТаблицаКППИстория.КПП, СправочникКонтрагенты.КПП)
	|	КОНЕЦ											КАК КПП,
	|	ЕСТЬNULL(СправочникЮридическиеЛица.ОГРН, """")	КАК ОГРН
	|ИЗ
	|	Справочник.Контрагенты КАК СправочникКонтрагенты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК СправочникЮридическиеЛица
	|		ПО СправочникКонтрагенты.ЮридическоеФизическоеЛицо = СправочникЮридическиеЛица.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДатыОкончанияДействияКПП
	|		ПО &НаДату = ДатыОкончанияДействияКПП.НаДату
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КППИстория КАК ТаблицаКППИстория
	|		ПО СправочникКонтрагенты.Ссылка = ТаблицаКППИстория.Ссылка
	|		И ДатыОкончанияДействияКПП.ДатаОкончанияДействия = ТаблицаКППИстория.ДатаОкончанияДействия
	|ГДЕ
	|	СправочникКонтрагенты.Ссылка = &КонтрагентСсылка";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = ЗапросПоиск.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыКонтрагента, Выборка);
	КонецЕсли;
	
	Возврат РеквизитыКонтрагента;
	
КонецФункции

Процедура ЗаполнитьСписокСчетовПоУмолчанию(ДокументОбъект) Экспорт
	
	ДокументОбъект.СписокСчетов.Очистить();
	
	СписокСчетов = ПолучитьСписокСчетовЗаполнения(ДокументОбъект.ДатаНачала, ДокументОбъект.Организация);
	
	Для Каждого Счет Из СписокСчетов Цикл
		НоваяСтрока = ДокументОбъект.СписокСчетов.Добавить();
		НоваяСтрока.Счет = Счет;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРассчитываемыеТабличныеЧастиПередЗаписью(ДокументОбъект) Экспорт
	
	ЗаполнитьРассчитываемыеТабличныеЧастиРаздела1(ДокументОбъект);
	
	ЗаполнитьРассчитываемыеТабличныеЧастиРаздела2(ДокументОбъект);
	
КонецПроцедуры

Функция ПолучитьСписокСчетовЗаполненияСтрокой() Экспорт
	
	Возврат "205.00, 206.00, 207.00, 209.00, 210.05, 302.00, 304.01";
	
КонецФункции

Функция ПолучитьСписокСчетовИсключенийСтрокой() Экспорт
	
	Возврат "205.11, 205.14, 205.51, 205.52, 205.53, 205.54"
		+ ", 206.10, 206.40, 206.50, 206.80"
		+ ", 209.81, 209.82"
		+ ", 302.11, 302.40, 302.50, 302.80";
	
КонецФункции

#Область ЗаполнениеРаздела1

Процедура ПроверитьПередЗаполнениемРаздела1(Знач ДокументОбъект, Отказ) Экспорт
	
	Отказ = Ложь;
	
	ИнвентаризацияСервер.ПроверитьЗаполненностьРеквизитовШапки(ДокументОбъект,
		"ДатаНачала,ДатаОкончания,Организация,Контрагент", Отказ);
	
	ИнвентаризацияСервер.ПроверитьНаличиеСтрокВТабличнойЧасти(ДокументОбъект, "СписокСчетов", Отказ);
	
	ПроверитьКорректностьГраницПериодаСверки(ДокументОбъект, Отказ);
	
	ПроверитьСписокСчетов(ДокументОбъект, Отказ);
	
	ПроверитьСписокДоговоров(ДокументОбъект, Отказ);
	
	ПроверитьПризнакиКонтрагента(ДокументОбъект, Отказ);
	
КонецПроцедуры

Функция ПолучитьДанныеДляРаздела1(ПараметрыПроцедуры) Экспорт
	
	Возврат ПрочитатьСведенияБухУчета(ПараметрыПроцедуры);
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеРаздела2

Процедура ЗаполнитьРаздел2ПоДаннымРаздела1(ДокументОбъект) Экспорт
	
	ЗаполнитьРаздел2ОперацииПоДаннымРаздела1(ДокументОбъект);
	
	ЗаполнитьРаздел2СальдоПоДаннымРаздела1(ДокументОбъект, "Раздел2СальдоНачальное",
		"Раздел1СальдоНачальноеБезСчетов");
	
	ЗаполнитьРаздел2СальдоПоДаннымРаздела1(ДокументОбъект, "Раздел2СальдоКонечное",
		"Раздел1СальдоКонечноеПоСчетам");
	
	ЗаполнитьРассчитываемыеТабличныеЧастиРаздела2(ДокументОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// Параллельный отложенный обработчик обновления.
	// Заполняет новую табличную часть Раздел1СписокДоговоров.
	
	Запрос = Новый Запрос();
	Запрос.Текст = ПолучитьТекстЗапросаЗарегистрироватьДанныеДляОбработкиЗаполнениеРаздел1СписокДоговоров();
	
	Данные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные);	
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	// Параллельный отложенный обработчик обновления.
	// Заполняет новую табличную часть Раздел1СписокДоговоров.
	
	Параметры.ОбработкаЗавершена = Ложь;
	МетаданныеДокумента = Метаданные.Документы.АктСверкиРасчетов;
	ПолноеИмяОбъекта = МетаданныеДокумента.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметры.ИмяВременнойТаблицы = "ВТДляОбработки";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(Параметры.Очередь,
		ПолноеИмяОбъекта, МенеджерВременныхТаблиц, ДополнительныеПараметры);
	
	Если Не Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ПолучитьТекстЗапросаЗаполнениеРаздел1СписокДоговоров();
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&КоличествоПервых", "500");
	
	ВыборкаДокумент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	ПлохиеДанные = Новый Соответствие;
	
	Пока ВыборкаДокумент.Следующий() Цикл
		НачатьТранзакцию();
		
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаДокумент.Ссылка);
			Блокировка.Заблокировать();
			
			ДокументОбъект = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
			
			// Если объект ранее был удален или обработан другими сеансами, пропускаем его.
			Если ДокументОбъект = Неопределено
				Или ДокументОбъект.Раздел1СписокДоговоров.Количество() > 0 Тогда

				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ВыборкаДокумент.Ссылка);
				ЗафиксироватьТранзакцию();
				ОбъектовОбработано = ОбъектовОбработано + 1;
				Продолжить;
			КонецЕсли;
			
			ДокументОбъект.Раздел1СписокДоговоров.Очистить();
			
			Выборка = ВыборкаДокумент.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НоваяСтрока = ДокументОбъект.Раздел1СписокДоговоров.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			КонецЦикла;
			
			Если ДокументОбъект.Модифицированность() Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(ДокументОбъект);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(ВыборкаДокумент.Ссылка);
			КонецЕсли;

			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать некоторые акты сверки расчетов (пропущены): %1'"), 
			ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	Иначе
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Информация, МетаданныеДокумента,, 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обработана очередная порция актов сверки расчетов: %1'"),
			ОбъектовОбработано));
	КонецЕсли;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ДляВызоваИзДругихПодсистем

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0510477";
	КомандаПечати.Представление = НСтр("ru='Акт сверки расчетов (ф. 0510477)'");
	КомандаПечати.Порядок = 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0510477") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0510477",
			"Акт сверки расчетов (ф.0510477)",
			ПечатьФормы0510477(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода));
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
Процедура СформироватьОписаниеДокументовСКонтрагентомВШапке(Описание, ДокументСсылка, ДокументОбъект, Форма) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписание(
		Описание, 
		ДокументСсылка, 
		Форма.Элементы.Контрагент,
		ДокументОбъект.Контрагент,
		Форма.Элементы.ГруппаКонтрагент);
	
КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

// ИнтеграцияС1САрхивом
// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции
// Конец ИнтеграцияС1САрхивом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйРеквизитыКонтрагента()
	
	РеквизитыКонтрагента = Новый Структура();
	РеквизитыКонтрагента.Вставить("ИНН", "");
	РеквизитыКонтрагента.Вставить("КПП", "");
	РеквизитыКонтрагента.Вставить("ОГРН", "");
	
	Возврат РеквизитыКонтрагента;
	
КонецФункции

#Область ОбщиеНастройки

Функция ПолучитьСписокСчетовЗаполнения(НаДату = Неопределено, Организация = Неопределено)
	
	Возврат БухгалтерскийУчет.СписокСчетов(ПолучитьСписокСчетовЗаполненияСтрокой(), НаДату, Истина, Организация);
	
КонецФункции

Функция ПолучитьСписокСчетовИсключений(НаДату = Неопределено, Организация = Неопределено)
	
	Возврат БухгалтерскийУчет.СписокСчетов(ПолучитьСписокСчетовИсключенийСтрокой());
	
КонецФункции

Функция ПолучитьИмяПоляСумма(ВидРасчетов, Валютная, Сторона, ВидСальдо = "")
	
	Возврат СтрШаблон("Сумма%1%2%3%4", ВидРасчетов, Валютная, Сторона, ВидСальдо);
	
КонецФункции

Функция ПолучитьИменаВидовРасчетов()
	
	Имена = Новый Массив();
	Имена.Добавить("ОД");
	Имена.Добавить("Процентов");
	Имена.Добавить("Штрафов");
	Имена.Добавить("Пеней");
	
	Возврат Имена;
	
КонецФункции

Функция ПолучитьИменаСторон()
	
	Имена = Новый Массив();
	Имена.Добавить("Дебет");
	Имена.Добавить("Кредит");
	
	Возврат Имена;
	
КонецФункции

Функция ПолучитьСписокВидовРасчетовДляКолонкиОД()
	
	Список = Новый Массив();
	Список.Добавить(Перечисления.ВидыРасчетовПоЗаймам.ОсновнойДолг);
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьСписокВидовРасчетовДляКолонкиПроцентов()
	
	Список = Новый Массив();
	Список.Добавить(Перечисления.ВидыРасчетовПоЗаймам.Проценты);
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьСписокВидовРасчетовДляКолонкиШтрафов()
	
	Список = Новый Массив();
	Список.Добавить(Перечисления.ВидыРасчетовПоЗаймам.Штрафы);
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьСписокВидовРасчетовДляКолонкиПеней()
	
	Список = Новый Массив();
	Список.Добавить(Перечисления.ВидыРасчетовПоЗаймам.ПениНаОсновнойДолг);
	Список.Добавить(Перечисления.ВидыРасчетовПоЗаймам.ПениНаПроценты);
	
	Возврат Список;
	
КонецФункции

Функция ПолучитьКолонкиСвернутыхСуммовыхПоказателейВал()
	
	// Значением свернутого показателя считается колонка Дебета.
	
	Возврат "СуммаОДВалДебет,СуммаПроцентовВалДебет,СуммаШтрафовВалДебет,СуммаПенейВалДебет";
	
КонецФункции

Функция ПолучитьКолонкиСвернутыхСуммовыхПоказателейРуб()
	
	// Значением свернутого показателя считается колонка Дебета.
	
	Возврат "СуммаОДРубДебет,СуммаПроцентовРубДебет,СуммаШтрафовРубДебет,СуммаПенейРубДебет";
	
КонецФункции

Функция ПолучитьКолонкиСуммовыхПоказателейТаблицыНарушений()
	
	// В имени нет стороны Дебет или Кредит.
	// Но есть уточнение ОжидаемоеЗначение или ФактическоеЗначение.
	
	Возврат "СуммаОДВалОжидаемоеЗначение,СуммаОДРубОжидаемоеЗначение,СуммаПроцентовВалОжидаемоеЗначение,СуммаПроцентовРубОжидаемоеЗначение,"
		+ "СуммаШтрафовВалОжидаемоеЗначение,СуммаШтрафовРубОжидаемоеЗначение,СуммаПенейВалОжидаемоеЗначение,СуммаПенейРубОжидаемоеЗначение,"
		
		+ "СуммаОДВалФактическоеЗначение,СуммаОДРубФактическоеЗначение,СуммаПроцентовВалФактическоеЗначение,СуммаПроцентовРубФактическоеЗначение,"
		+ "СуммаШтрафовВалФактическоеЗначение,СуммаШтрафовРубФактическоеЗначение,СуммаПенейВалФактическоеЗначение,СуммаПенейРубФактическоеЗначение";
	
КонецФункции

Функция ПолучитьКолонкиСуммовыхПоказателейБезВсего()
	
	Возврат "СуммаОДВалДебет,СуммаОДРубДебет,СуммаПроцентовВалДебет,СуммаПроцентовРубДебет,"
		+ "СуммаШтрафовВалДебет,СуммаШтрафовРубДебет,СуммаПенейВалДебет,СуммаПенейРубДебет,"
		+ "СуммаОДВалКредит,СуммаОДРубКредит,СуммаПроцентовВалКредит,СуммаПроцентовРубКредит,"
		+ "СуммаШтрафовВалКредит,СуммаШтрафовРубКредит,СуммаПенейВалКредит,СуммаПенейРубКредит";
	
КонецФункции

Функция ПолучитьКолонкиСуммовыхПоказателейСВсего()
	
	Возврат ПолучитьКолонкиСуммовыхПоказателейБезВсего()
		+ ",СуммаВсегоВалДебет,СуммаВсегоРубДебет,СуммаВсегоВалКредит,СуммаВсегоРубКредит";
	
КонецФункции

Функция ПолучитьИмяПоляНарушения(ИмяПоляСуммы)
	
	Возврат СтрЗаменить(ИмяПоляСуммы, "Дебет", "");
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗаполнения

Функция НовыйПараметрыПроверкиЗаполнения()
	
	ПараметрыПроверкиЗаполнения = Новый Структура();
	ПараметрыПроверкиЗаполнения.Вставить("ИспользоватьВалютныйУчет",			ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет"));
	ПараметрыПроверкиЗаполнения.Вставить("ИспользоватьУчетПоИФО",				ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО"));
	ПараметрыПроверкиЗаполнения.Вставить("ИспользоватьУчетПоПодразделениям",	ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"));
	
	Возврат ПараметрыПроверкиЗаполнения;
	
КонецФункции

Процедура ПроверитьКорректностьГраницПериодаСверки(ДокументОбъект, Отказ)
	
	ДатаНачала		= ДокументОбъект.ДатаНачала;
	ДатаОкончания	= ДокументОбъект.ДатаОкончания;
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Или Не ЗначениеЗаполнено(ДатаОкончания)
		Или ДатаНачала <= ДатаОкончания Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(
		НСтр("ru='Период сверки указан некорректно.
			|Дата начала периода сверки должна быть меньше или равна дате окончания периода сверки.'"),
		ДокументОбъект.Ссылка, "ДатаНачала", "Объект", Отказ);
	
КонецПроцедуры

Процедура ПроверитьСписокСчетов(ДокументОбъект, Отказ)
	
	СписокСчетовИсключений = ПолучитьСписокСчетовИсключений(ДокументОбъект.Дата, ДокументОбъект.Организация);
	
	Для Каждого СтрокаТаблицы Из ДокументОбъект.СписокСчетов Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Счет) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru='Счет'"), СтрокаТаблицы.НомерСтроки, НСтр("ru='Счета'")),
				ДокументОбъект.Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокСчетов", СтрокаТаблицы.НомерСтроки, "Счет"),
				"Объект", Отказ);
		КонецЕсли;
		
		Если СписокСчетовИсключений.Найти(СтрокаТаблицы.Счет) <> Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
					НСтр("ru='Счет'"), СтрокаТаблицы.НомерСтроки, НСтр("ru='Счета'"),
					НСтр("ru='Указанный счет входит в список исключений из заполнения акта сверки.'")),
				ДокументОбъект.Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокСчетов", СтрокаТаблицы.НомерСтроки, "Счет"),
				"Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСписокДоговоров(ДокументОбъект, Отказ)
	
	Для Каждого СтрокаТаблицы Из ДокументОбъект.СписокДоговоров Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Договор) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Заполнение",
					НСтр("ru='Договор'"), СтрокаТаблицы.НомерСтроки, НСтр("ru='Договоры'")),
				ДокументОбъект.Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("СписокДоговоров", СтрокаТаблицы.НомерСтроки, "Договор"),
				"Объект", Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДублиСтрок = ОбщегоНазначенияБГУ.НайтиДублиСтрок(ДокументОбъект.СписокДоговоров, "Договор");
	
	Если ТаблицаДублиСтрок.Количество() > 0 Тогда
		Отказ = Истина;
		
		ПараметрыВывода = ОбщегоНазначенияБГУ.ПараметрыВыводаСообщенийОДубляхСтрок();
		ПараметрыВывода.ШаблонСтроки = НСтр("ru='Обнаружены дубли договоров (строки [НомераСтрок])'");
		ПараметрыВывода.ТаблицаИмя = "СписокДоговоров";
		ПараметрыВывода.ИмяПоляДляВыводаСообщений = "Договор";
		ПараметрыВывода.ОбъектСсылка = ДокументОбъект.Ссылка;
		
		ОбщегоНазначенияБГУ.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПризнакиКонтрагента(ДокументОбъект, Отказ)
	
	// Сейчас эта проверка не блокирующая. Отказ не устанавливаем.
	
	ПризнакиКонтрагента = ПрочитатьПризнакиКонтрагента(ДокументОбъект.Контрагент);
	
	ТекстСообщения = ТекстСообщенияПоПризнакамКонтрагента(ПризнакиКонтрагента);
	
	Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(НСтр("ru='Справочно: %1'"), ТекстСообщения),
		ДокументОбъект.Ссылка, "Контрагент", "Объект");
	
КонецПроцедуры

Функция ПрочитатьПризнакиКонтрагента(Контрагент)
	
	ПризнакиКонтрагента = Новый Структура();
	ПризнакиКонтрагента.Вставить("ТипКонтрагента", "");
	ПризнакиКонтрагента.Вставить("ЭтоСотрудник", Ложь);
	ПризнакиКонтрагента.Вставить("ЭтоФизЛицо", Ложь);
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат ПризнакиКонтрагента;
	КонецЕсли;
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникКонтрагенты.Ссылка							КАК Контрагент,
	|	ЕСТЬNULL(СправочникТипыКонтрагентов.Код, """")			КАК ТипКонтрагента,
	|	МАКСИМУМ(НЕ СправочникСотрудники.Ссылка ЕСТЬ NULL)		КАК ЭтоСотрудник,
	|	МАКСИМУМ(НЕ СправочникФизическиеЛица.Ссылка ЕСТЬ NULL)	КАК ЭтоФизЛицо
	|ИЗ
	|	Справочник.Контрагенты КАК СправочникКонтрагенты
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
	|		ПО СправочникКонтрагенты.Ссылка = СправочникСотрудники.Контрагент
	|		И НЕ СправочникСотрудники.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК СправочникФизическиеЛица
	|		ПО СправочникКонтрагенты.ЮридическоеФизическоеЛицо = СправочникФизическиеЛица.Ссылка
	|		И НЕ СправочникФизическиеЛица.ПометкаУдаления
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыКонтрагентов КАК СправочникТипыКонтрагентов
	|		ПО СправочникКонтрагенты.ТипКонтрагента = СправочникТипыКонтрагентов.Ссылка
	|		И НЕ СправочникТипыКонтрагентов.ПометкаУдаления
	|ГДЕ
	|	СправочникКонтрагенты.Ссылка = &Контрагент
	|СГРУППИРОВАТЬ ПО
	|	СправочникКонтрагенты.Ссылка,
	|	ЕСТЬNULL(СправочникТипыКонтрагентов.Код, """")";
	
	Выборка = ЗапросПоиск.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПризнакиКонтрагента, Выборка);
	КонецЕсли;
	
	Возврат ПризнакиКонтрагента;
	
КонецФункции

Функция ТекстСообщенияПоПризнакамКонтрагента(ПризнакиКонтрагента)
	
	ОбщийТекст = НСтр("ru='Убедитесь, что составление акта сверки в отношении таких контрагентов предусмотрено законодательством.'");
	
	Если ПризнакиКонтрагента.ЭтоСотрудник Тогда
		Возврат СтрШаблон(НСтр("ru='Указанный контрагент является сотрудником учреждения.
			|%1'"), ОбщийТекст);
	КонецЕсли;
	
	Если ПризнакиКонтрагента.ТипКонтрагента = "7" Тогда
		Возврат СтрШаблон(НСтр("ru='Указанный контрагент является физическим лицом.
			|%1'"), ОбщийТекст);
	КонецЕсли;
	
	Если ПризнакиКонтрагента.ТипКонтрагента = "8" Или ПризнакиКонтрагента.ТипКонтрагента = "9" Тогда
		Возврат СтрШаблон(НСтр("ru='Указанный контрагент является нерезидентом.
			|%1'"), ОбщийТекст);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПроверитьРаздел1СальдоНачальноеБезСчетов(ДокументОбъект, ПараметрыПроверкиЗаполнения, Отказ)
	
	ИмяТЧ = "Раздел1СальдоНачальноеБезСчетов";
	
	ИменаКолонок = Новый Массив();
	ИменаКолонок.Добавить("Договор");
	
	Если ПараметрыПроверкиЗаполнения.ИспользоватьУчетПоИФО Тогда
		ИменаКолонок.Добавить("ИФО");
	КонецЕсли;
	
	Если ПараметрыПроверкиЗаполнения.ИспользоватьУчетПоПодразделениям Тогда
		ИменаКолонок.Добавить("Подразделение");
	КонецЕсли;
	
	Если ПараметрыПроверкиЗаполнения.ИспользоватьВалютныйУчет Тогда
		ИменаКолонок.Добавить("Валюта");
	КонецЕсли;
	
	ТаблицаДублиСтрок = ОбщегоНазначенияБГУ.НайтиДублиСтрок(ДокументОбъект[ИмяТЧ], ИменаКолонок, Истина);
	
	Если ТаблицаДублиСтрок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ПредставлениеТЧ = Метаданные.Документы.АктСверкиРасчетов.ТабличныеЧасти[ИмяТЧ].Синоним;
	
	ПараметрыВывода = ОбщегоНазначенияБГУ.ПараметрыВыводаСообщенийОДубляхСтрок();
	ПараметрыВывода.ТаблицаИмя					= ИмяТЧ;
	ПараметрыВывода.ТаблицаПредставление		= ПредставлениеТЧ;
	ПараметрыВывода.ОбъектСсылка				= ДокументОбъект.Ссылка;
	ПараметрыВывода.ШаблонСтроки				= НСтр("ru='Обнаружены дубли договоров (Таблица ""[ТаблицаПредставление]"", строки [НомераСтрок])'");
	ПараметрыВывода.ИмяПоляДляВыводаСообщений	= "Договор";
	
	ОбщегоНазначенияБГУ.ВывестиСообщенияОДубляхСтрок(ТаблицаДублиСтрок, ПараметрыВывода);
	
КонецПроцедуры

#Область СовместноеЗаполнениеТаблицРаздела1

// Расчет.

Процедура ПроверитьСовместноеЗаполнениеТаблицРаздела1(ДокументОбъект, ПараметрыПроверкиЗаполнения, Отказ = Неопределено)
	
	ПараметрыРасчета = ПолучитьПараметрыРасчетаНарушений(ДокументОбъект, ПараметрыПроверкиЗаполнения);
	
	ТаблицаНарушений = РассчитатьТаблицуНарушений(ПараметрыРасчета);
	
	Если ТаблицаНарушений.Количество() > 0 Тогда
		СообщитьОНаличииНарушений(ДокументОбъект, ТаблицаНарушений, ПараметрыРасчета, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПараметрыРасчетаНарушений(ДокументОбъект, ПараметрыПроверкиЗаполнения)
	
	КолонкиСвязи = "Договор,Валюта";
	
	Если ПараметрыПроверкиЗаполнения.ИспользоватьУчетПоИФО Тогда
		КолонкиСвязи = КолонкиСвязи + ",ИФО";
	КонецЕсли;
	
	Если ПараметрыПроверкиЗаполнения.ИспользоватьУчетПоПодразделениям Тогда
		КолонкиСвязи = КолонкиСвязи + ",Подразделение";
	КонецЕсли;
	
	КолонкиПоиска = КолонкиСвязи + ",СтрокаОбработана";
	
	КолонкиСумм = ПолучитьКолонкиСуммовыхПоказателейБезВсего();
	
	ОбщийСписокСуммовыхКолонокБезВсего = СтрРазделить(КолонкиСумм, ", ", Ложь);
	
	ВалютаРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ТаблицаОборотов = ДокументОбъект.Раздел1Операции.Выгрузить(, КолонкиСвязи + "," + КолонкиСумм);
	ТаблицаОборотов.Свернуть(КолонкиСвязи, КолонкиСумм);
	РассчитатьСвернутыеПоказателиВТаблице(ТаблицаОборотов, ВалютаРУ);
	УдалитьПолностьюНулевыеСтроки(ТаблицаОборотов);
	ДобавитьКолонкуСтрокаОбработана(ТаблицаОборотов);
	ТаблицаОборотов.Индексы.Добавить(КолонкиПоиска);
	
	ТаблицаСальдоНачальное = ДокументОбъект.Раздел1СальдоНачальноеБезСчетов.Выгрузить(, КолонкиСвязи + "," + КолонкиСумм);
	ТаблицаСальдоНачальное.Свернуть(КолонкиСвязи, КолонкиСумм);
	РассчитатьСвернутыеПоказателиВТаблице(ТаблицаСальдоНачальное, ВалютаРУ);
	ДобавитьКолонкуСтрокаОбработана(ТаблицаСальдоНачальное);
	ТаблицаСальдоНачальное.Индексы.Добавить(КолонкиПоиска);
	
	ТаблицаСальдоКонечное = ДокументОбъект.Раздел1СальдоКонечноеПоСчетам.Выгрузить(, КолонкиСвязи + "," + КолонкиСумм);
	ТаблицаСальдоКонечное.Свернуть(КолонкиСвязи, КолонкиСумм);
	РассчитатьСвернутыеПоказателиВТаблице(ТаблицаСальдоКонечное, ВалютаРУ);
	ДобавитьКолонкуСтрокаОбработана(ТаблицаСальдоКонечное);
	ТаблицаСальдоКонечное.Индексы.Добавить(КолонкиПоиска);
	
	// Только рублевые поля для ускорения работы.
	КолонкиСвернутыхПолейРуб = СтрРазделить(ПолучитьКолонкиСвернутыхСуммовыхПоказателейРуб(), ", ", Ложь);
	
	// И валютные, и рублевые поля.
	КолонкиСвернутыхПолейВал = СтрРазделить(ПолучитьКолонкиСвернутыхСуммовыхПоказателейВал()
		+ "," + ПолучитьКолонкиСвернутыхСуммовыхПоказателейРуб(), ", ", Ложь);
	
	ПолностьюНулеваяСтрока = ПолучитьПолностьюНулевуюСтроку(КолонкиСвернутыхПолейВал);
	
	ПараметрыРасчета = Новый Структура();
	ПараметрыРасчета.Вставить("ТаблицаОборотов", ТаблицаОборотов);
	ПараметрыРасчета.Вставить("ТаблицаСальдоНачальное", ТаблицаСальдоНачальное);
	ПараметрыРасчета.Вставить("ТаблицаСальдоКонечное", ТаблицаСальдоКонечное);
	ПараметрыРасчета.Вставить("КолонкиСвязи", КолонкиСвязи);
	ПараметрыРасчета.Вставить("КолонкиПоиска", КолонкиПоиска);
	ПараметрыРасчета.Вставить("ВалютаРУ", ВалютаРУ);
	ПараметрыРасчета.Вставить("КолонкиСвернутыхПолейРуб", КолонкиСвернутыхПолейРуб);
	ПараметрыРасчета.Вставить("КолонкиСвернутыхПолейВал", КолонкиСвернутыхПолейВал);
	ПараметрыРасчета.Вставить("ПолностьюНулеваяСтрока", ПолностьюНулеваяСтрока);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

Функция НовыйТаблицаНарушений()
	
	ТаблицаНарушений = Новый ТаблицаЗначений();
	ТаблицаНарушений.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	ТаблицаНарушений.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаНарушений.Колонки.Добавить("ИФО", Новый ОписаниеТипов("СправочникСсылка.ИсточникиФинансовогоОбеспечения"));
	ТаблицаНарушений.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	ТаблицаНарушений.Колонки.Добавить("ЕстьВТаблицеОборотов", Новый ОписаниеТипов("Булево"));
	ТаблицаНарушений.Колонки.Добавить("ЕстьВТаблицеСальдоНачальное", Новый ОписаниеТипов("Булево"));
	ТаблицаНарушений.Колонки.Добавить("ЕстьВТаблицеСальдоКонечное", Новый ОписаниеТипов("Булево"));
	
	ТаблицаНарушений.Колонки.Добавить("ИменаПолейНарушений", Новый ОписаниеТипов("Массив"));
	
	ТипСумма = ОбщегоНазначения.ОписаниеТипаЧисло(18, 2, ДопустимыйЗнак.Любой);
	
	ИменаКолонок = СтрРазделить(ПолучитьКолонкиСуммовыхПоказателейТаблицыНарушений(), ", ", Ложь);
	
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		ТаблицаНарушений.Колонки.Добавить(ИмяКолонки, ТипСумма);
	КонецЦикла;
	
	Возврат ТаблицаНарушений;
	
КонецФункции

Функция РассчитатьТаблицуНарушений(ПараметрыРасчета);
	
	ТаблицаНарушений = НовыйТаблицаНарушений();
	
	ДобавитьНарушенияПриОбходеТаблицы(ТаблицаНарушений, "ТаблицаОборотов", ПараметрыРасчета);
	ДобавитьНарушенияПриОбходеТаблицы(ТаблицаНарушений, "ТаблицаСальдоНачальное", ПараметрыРасчета);
	ДобавитьНарушенияПриОбходеТаблицы(ТаблицаНарушений, "ТаблицаСальдоКонечное", ПараметрыРасчета);
	
	Возврат ТаблицаНарушений;
	
КонецФункции

// Параметры:
//	ПараметрыРасчета - Структура - см. функцию ПолучитьПараметрыРасчетаНарушений().
//	ИмяТаблицыОбхода - Строка - имя таблицы в переданной структуре ПараметрыРасчета.
//					Одно из значений "ТаблицаОборотов", "ТаблицаСальдоНачальное", "ТаблицаСальдоКонечное".
Процедура ДобавитьНарушенияПриОбходеТаблицы(ТаблицаНарушений, ИмяТаблицыОбхода, ПараметрыРасчета)
	
	ВалютаРУ					= ПараметрыРасчета.ВалютаРУ;
	КолонкиСвернутыхПолейРуб	= ПараметрыРасчета.КолонкиСвернутыхПолейРуб;
	КолонкиСвернутыхПолейВал	= ПараметрыРасчета.КолонкиСвернутыхПолейВал;
	ПолностьюНулеваяСтрока		= ПараметрыРасчета.ПолностьюНулеваяСтрока;
	
	Поиск = Новый Структура(ПараметрыРасчета.КолонкиПоиска);
	
	ТаблицыПоиска = Новый Массив();
	
	Если ИмяТаблицыОбхода = "ТаблицаОборотов" Тогда
		ТаблицыПоиска.Добавить("ТаблицаСальдоНачальное");
		ТаблицыПоиска.Добавить("ТаблицаСальдоКонечное");
			
	ИначеЕсли ИмяТаблицыОбхода = "ТаблицаСальдоНачальное" Тогда
		ТаблицыПоиска.Добавить("ТаблицаОборотов");
		ТаблицыПоиска.Добавить("ТаблицаСальдоКонечное");
		
	ИначеЕсли ИмяТаблицыОбхода = "ТаблицаСальдоКонечное" Тогда
		ТаблицыПоиска.Добавить("ТаблицаОборотов");
		ТаблицыПоиска.Добавить("ТаблицаСальдоНачальное");
	КонецЕсли;
	
	СтруктураКолонок = Неопределено;
	
	ЕстьВТаблицеОборотов = Ложь;
	ЕстьВТаблицеСальдоНачальное = Ложь;
	ЕстьВТаблицеСальдоКонечное = Ложь;
	
	ТаблицаОбхода = ПараметрыРасчета[ИмяТаблицыОбхода];
	
	ПоискТаблицыОбхода = Новый Структура("СтрокаОбработана", Ложь);
	
	МассивСтрокТаблицыОбхода = ТаблицаОбхода.НайтиСтроки(ПоискТаблицыОбхода);
	
	Для Каждого СтрокаТаблицыОбхода Из МассивСтрокТаблицыОбхода Цикл
		СтрокаТаблицыОбхода.СтрокаОбработана = Истина;
		
		Если ИмяТаблицыОбхода = "ТаблицаОборотов" Тогда
			СтрокаОборотов = СтрокаТаблицыОбхода;
			ЕстьВТаблицеОборотов = Истина;
			
		ИначеЕсли ИмяТаблицыОбхода = "ТаблицаСальдоНачальное" Тогда
			СтрокаСальдоНачальное = СтрокаТаблицыОбхода;
			ЕстьВТаблицеСальдоНачальное = Истина;
			
		ИначеЕсли ИмяТаблицыОбхода = "ТаблицаСальдоКонечное" Тогда
			СтрокаСальдоКонечное = СтрокаТаблицыОбхода;
			ЕстьВТаблицеСальдоКонечное = Истина;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаТаблицыОбхода);
		Поиск.СтрокаОбработана = Ложь;
		
		Для Каждого ИмяТаблицы Из ТаблицыПоиска Цикл
			МассивСтрок = ПараметрыРасчета[ИмяТаблицы].НайтиСтроки(Поиск);
			
			ЕстьВТаблице = (МассивСтрок.Количество() > 0);
			
			Если ЕстьВТаблице Тогда
				СтрокаТаблицы = МассивСтрок[0];
				СтрокаТаблицы.СтрокаОбработана = Истина;
			Иначе
				СтрокаТаблицы = ПолностьюНулеваяСтрока;
			КонецЕсли;
			
			Если ИмяТаблицы = "ТаблицаОборотов" Тогда
				СтрокаОборотов = СтрокаТаблицы;
				ЕстьВТаблицеОборотов = ЕстьВТаблице;
				
			ИначеЕсли ИмяТаблицы = "ТаблицаСальдоНачальное" Тогда
				СтрокаСальдоНачальное = СтрокаТаблицы;
				ЕстьВТаблицеСальдоНачальное = ЕстьВТаблице;
				
			ИначеЕсли ИмяТаблицы = "ТаблицаСальдоКонечное" Тогда
				СтрокаСальдоКонечное = СтрокаТаблицы;
				ЕстьВТаблицеСальдоКонечное = ЕстьВТаблице;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаТаблицыОбхода.Валюта = ВалютаРУ Тогда
			КолонкиСвернутыхПолейСумм = КолонкиСвернутыхПолейРуб;
		Иначе
			КолонкиСвернутыхПолейСумм = КолонкиСвернутыхПолейВал;
		КонецЕсли;
		
		СтруктураКолонок = ОпределитьКолонкиНарушающиеРавенство(СтрокаОборотов, СтрокаСальдоНачальное, СтрокаСальдоКонечное, КолонкиСвернутыхПолейСумм);
		
		Если СтруктураКолонок.Количество() > 0 Тогда
			НоваяСтрока = ТаблицаНарушений.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Поиск);
			
			НоваяСтрока.ЕстьВТаблицеОборотов = ЕстьВТаблицеОборотов;
			НоваяСтрока.ЕстьВТаблицеСальдоНачальное = ЕстьВТаблицеСальдоНачальное;
			НоваяСтрока.ЕстьВТаблицеСальдоКонечное = ЕстьВТаблицеСальдоКонечное;
			
			ИменаПолейНарушений = Новый Массив();
			
			Для Каждого Элемент Из СтруктураКолонок Цикл
				ИмяПоляНарушения = Элемент.Ключ;
				ОписаниеНарушения = Элемент.Значение;
				
				ИменаПолейНарушений.Добавить(ИмяПоляНарушения);
				
				НоваяСтрока[ИмяПоляНарушения + "ОжидаемоеЗначение"] = ОписаниеНарушения.ОжидаемоеЗначение;
				НоваяСтрока[ИмяПоляНарушения + "ФактическоеЗначение"] = ОписаниеНарушения.ФактическоеЗначение;
			КонецЦикла;
			
			НоваяСтрока.ИменаПолейНарушений = ИменаПолейНарушений;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьСвернутыеПоказателиВТаблице(Таблица, ВалютаРУ)
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаОДРубДебет",			"СуммаОДРубКредит");
		РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаПроцентовРубДебет",	"СуммаПроцентовРубКредит");
		РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаШтрафовРубДебет",		"СуммаШтрафовРубКредит");
		РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаПенейРубДебет",		"СуммаПенейРубКредит");
		
		Если СтрокаТаблицы.Валюта <> ВалютаРУ Тогда
			РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаОДВалДебет",			"СуммаОДВалКредит");
			РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаПроцентовВалДебет",	"СуммаПроцентовВалКредит");
			РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаШтрафовВалДебет",		"СуммаШтрафовВалКредит");
			РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, "СуммаПенейВалДебет",		"СуммаПенейВалКредит");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьСвернутыеПоказателиВСтрокеТаблицы(СтрокаТаблицы, ИмяПоляСуммаДебет, ИмяПоляСуммаКредит)
	
	// Результат расчета записывается в колонку Дебета, далее эта колонка считается значением свернутого показателя.
	
	СтрокаТаблицы[ИмяПоляСуммаДебет] = СтрокаТаблицы[ИмяПоляСуммаДебет] - СтрокаТаблицы[ИмяПоляСуммаКредит];
	
КонецПроцедуры

Процедура ДобавитьКолонкуСтрокаОбработана(Таблица)
	
	Таблица.Колонки.Добавить("СтрокаОбработана", Новый ОписаниеТипов("Булево"));
	
КонецПроцедуры

Функция ПолучитьПолностьюНулевуюСтроку(СписокКолонок)
	
	СтруктураСтроки = Новый Структура();
	
	Для Каждого ИмяПоля Из СписокКолонок Цикл
		СтруктураСтроки.Вставить(ИмяПоля, 0);
	КонецЦикла;
	
	Возврат СтруктураСтроки;
	
КонецФункции

Функция ОпределитьКолонкиНарушающиеРавенство(СтрокаОборота, СтрокаСальдоНачальное, СтрокаСальдоКонечное, КолонкиСвернутыхПолейСумм)
	
	СтруктураКолонок = Новый Структура();
	
	Для Каждого ИмяКолонки Из КолонкиСвернутыхПолейСумм Цикл
		ОжидаемоеЗначение = СтрокаСальдоНачальное[ИмяКолонки] + СтрокаОборота[ИмяКолонки];
		ФактическоеЗначение = СтрокаСальдоКонечное[ИмяКолонки];
		
		Если ОжидаемоеЗначение <> ФактическоеЗначение Тогда
			СтруктураКолонок.Вставить(
				ПолучитьИмяПоляНарушения(ИмяКолонки),
				НовыйОписаниеНарушенияКолонки(ОжидаемоеЗначение,ФактическоеЗначение));
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураКолонок;
	
КонецФункции

Функция НовыйОписаниеНарушенияКолонки(ОжидаемоеЗначение,ФактическоеЗначение)
	
	Возврат Новый Структура("ОжидаемоеЗначение,ФактическоеЗначение",
		ОжидаемоеЗначение, ФактическоеЗначение);
	
КонецФункции

// Вывод сообщений.

Процедура СообщитьОНаличииНарушений(ДокументОбъект, ТаблицаНарушений, ПараметрыРасчета, Отказ, МаксимальноеКоличествоСообщений = 20)
	
	Перем ПолеДляВыводаСообщения, СтрокаТаблицыДляВыводаСообщения;
	Перем ПредставлениеОжидаемогоЗначения, ПредставлениеФактическогоЗначения, ПредставлениеРазницы;
	Перем ДобавленоВручную;
	
	СообщениеИнформационное = (Отказ = Неопределено);
	
	ТекстСправочно = ?(СообщениеИнформационное, НСтр("ru='Справочно: '"), "");
	
	Отказ = Истина;
	
	СчетчикСообщений = 0;
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТаблицыНарушений Из ТаблицаНарушений Цикл
		НомерСтроки = НомерСтроки + 1;
		
		ЭтоВалютаРУ = (СтрокаТаблицыНарушений.Валюта = ПараметрыРасчета.ВалютаРУ);
		
		Для Каждого ИмяПоляНарушения Из СтрокаТаблицыНарушений.ИменаПолейНарушений Цикл
			СчетчикСообщений = СчетчикСообщений + 1;
			
			Если СчетчикСообщений > МаксимальноеКоличествоСообщений Тогда
				ОсталосьСтрокТаблицы = ТаблицаНарушений.Количество() - НомерСтроки;
				
				Если ОсталосьСтрокТаблицы = 0 Тогда
					Индекс = СтрокаТаблицыНарушений.ИменаПолейНарушений.Найти(ИмяПоляНарушения);
					КоличествоОшибокОсталосьЕще = СтрокаТаблицыНарушений.ИменаПолейНарушений.ВГраница() - Индекс + 1;
					
					ТекстШаблон = НСтр("ru='еще %1'");
				Иначе
					КоличествоОшибокОсталосьЕще = ОсталосьСтрокТаблицы;
					ТекстШаблон = НСтр("ru='еще как минимум %1'");
				КонецЕсли;
				
				ТекстОшибокОсталосьЕще = СтрШаблон(ТекстШаблон, КоличествоОшибокОсталосьЕще);
				
				ТекстСообщения = СтрШаблон(
					НСтр("ru='%1Обнаружено больше ошибок расчета свернутого сальдо Конечного (%2), чем сообщено. Установлено ограничение на количество выводимых сообщений (%3) о таких ошибках.'"),
					ТекстСправочно,
					ТекстОшибокОсталосьЕще,
					МаксимальноеКоличествоСообщений);
					
				// Выводим это сообщение к тому же полю, что и ранее выведенное сообщение.
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка, ПолеДляВыводаСообщения, "Объект");
					
				Возврат;
			КонецЕсли;
			
			ТекстБольшеМеньше = ПолучитьТекстБольшеМеньше(СтрокаТаблицыНарушений, ИмяПоляНарушения);
			
			ИмяТЧДляВыводаСообщения = ОпределитьТабличнуюЧастьДляВыводаСообщенияОНарушении(
				ДокументОбъект, СтрокаТаблицыНарушений, ПараметрыРасчета, СтрокаТаблицыДляВыводаСообщения, ДобавленоВручную);
			
			ТекстПричины = ?(ДобавленоВручную, "", НСтр("ru='
				|Некоторые проводки за период не включены в табличную часть ""Операции"", но влияют на конечное сальдо.'"));

			ИмяПоляСообщения = ПолучитьИмяПоляДляВыводаСообщенияОНарушении(СтрокаТаблицыНарушений, СтрокаТаблицыДляВыводаСообщения, ИмяПоляНарушения);
			
			ПредставлениеПоляСообщения = ПолучитьПредставлениеПоляДляВыводаСообщенияОНарушении(ИмяПоляНарушения, ЭтоВалютаРУ);
			
			ОпределитьПредставленияВыводимыхЗначений(СтрокаТаблицыНарушений, ИмяПоляНарушения,
				ПредставлениеОжидаемогоЗначения, ПредставлениеФактическогоЗначения, ПредставлениеРазницы);
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='%1Для показателя ""%2"" сальдо Конечное по договору (%3) %4 чем расчетное (%5) на величину %6.
					|Расчетное значение сальдо Конечного по договору определяется для показателей без разреза по счетам по формуле сальдо Начальное плюс Обороты.%7'"),
				ТекстСправочно,
				ПредставлениеПоляСообщения,
				ПредставлениеФактическогоЗначения,
				ТекстБольшеМеньше,
				ПредставлениеОжидаемогоЗначения,
				ПредставлениеРазницы,
				ТекстПричины);
				
			Если СтрокаТаблицыДляВыводаСообщения = Неопределено Тогда
				ПолеДляВыводаСообщения = ИмяТЧДляВыводаСообщения;
			Иначе
				ПолеДляВыводаСообщения = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					ИмяТЧДляВыводаСообщения, СтрокаТаблицыДляВыводаСообщения.НомерСтроки, ИмяПоляСообщения);
			КонецЕсли;
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка, ПолеДляВыводаСообщения, "Объект");
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстБольшеМеньше(СтрокаТаблицыНарушений, ИмяПоляНарушения)
	
	ОжидаемоеЗначение = СтрокаТаблицыНарушений[ИмяПоляНарушения + "ОжидаемоеЗначение"];
	ФактическоеЗначение = СтрокаТаблицыНарушений[ИмяПоляНарушения + "ФактическоеЗначение"];
	
	ЗначенияОдинаковогоЗнака =
		(ОжидаемоеЗначение >= 0 И ФактическоеЗначение >= 0
		Или ОжидаемоеЗначение <= 0 И ФактическоеЗначение <= 0);
	
	Если ЗначенияОдинаковогоЗнака Тогда
		АбсолютноеОжидаемоеЗначение = Макс(ОжидаемоеЗначение, -ОжидаемоеЗначение);
		АбсолютноеФактическоеЗначение = Макс(ФактическоеЗначение, -ФактическоеЗначение);
		
		Возврат ?(АбсолютноеФактическоеЗначение > АбсолютноеОжидаемоеЗначение, НСтр("ru='больше'"), НСтр("ru='меньше'"));
	Иначе
		Возврат ?(ФактическоеЗначение > ОжидаемоеЗначение, НСтр("ru='больше'"), НСтр("ru='меньше'"));
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИмяПоляДляВыводаСообщенияОНарушении(СтрокаТаблицыНарушений, СтрокаТаблицыДляВыводаСообщения, ИмяПоляНарушения)
	
	ИмяПоляДебет = ИмяПоляНарушения + "Дебет";
	ИмяПоляКредит = ИмяПоляНарушения + "Кредит";
	
	ЗначениеДебет = СтрокаТаблицыДляВыводаСообщения[ИмяПоляДебет];
	ЗначениеКредит = СтрокаТаблицыДляВыводаСообщения[ИмяПоляКредит];
	
	ФактическоеЗначение = СтрокаТаблицыНарушений[ИмяПоляНарушения + "ФактическоеЗначение"];
	
	Если ЗначениеДебет <> 0 И ЗначениеКредит <> 0 Тогда
		Возврат ?(ФактическоеЗначение >= 0, ИмяПоляДебет, ИмяПоляКредит);
		
	ИначеЕсли ЗначениеДебет <> 0 Тогда
		Возврат ИмяПоляДебет;
		
	Иначе
		Возврат ИмяПоляКредит;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПредставлениеПоляДляВыводаСообщенияОНарушении(ИмяПоляНарушения, ЭтоВалютаРУ)
	
	Если ЭтоВалютаРУ Тогда
		Если ИмяПоляНарушения = "СуммаОДРуб" Тогда
			Возврат "Основной долг";
			
		ИначеЕсли ИмяПоляНарушения = "СуммаПроцентовРуб" Тогда
			Возврат "Проценты";
			
		ИначеЕсли ИмяПоляНарушения = "СуммаШтрафовРуб" Тогда
			Возврат "Штрафы";
			
		ИначеЕсли ИмяПоляНарушения = "СуммаПенейРуб" Тогда
			Возврат "Пени";
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоляНарушения = "СуммаОДРуб" Тогда
		Возврат "Основной долг, в рублях";
		
	ИначеЕсли ИмяПоляНарушения = "СуммаПроцентовРуб" Тогда
		Возврат "Проценты, в рублях";
		
	ИначеЕсли ИмяПоляНарушения = "СуммаШтрафовРуб" Тогда
		Возврат "Штрафы, в рублях";
		
	ИначеЕсли ИмяПоляНарушения = "СуммаПенейРуб" Тогда
		Возврат "Пени, в рублях";
	КонецЕсли;
	
	Если ИмяПоляНарушения = "СуммаОДВал" Тогда
		Возврат "Основной долг, в валюте";
		
	ИначеЕсли ИмяПоляНарушения = "СуммаПроцентовВал" Тогда
		Возврат "Проценты, в валюте";
		
	ИначеЕсли ИмяПоляНарушения = "СуммаШтрафовВал" Тогда
		Возврат "Штрафы, в валюте";
		
	ИначеЕсли ИмяПоляНарушения = "СуммаПенейВал" Тогда
		Возврат "Пени, в валюте";
	КонецЕсли;
	
КонецФункции

Процедура ОпределитьПредставленияВыводимыхЗначений(СтрокаТаблицыНарушений, ИмяПоляНарушения,
		ПредставлениеОжидаемогоЗначения, ПредставлениеФактическогоЗначения, ПредставлениеРазницы)
		
	ТекстШаблонБезСтороны = "%1";
	ТекстШаблонДебетовое = НСтр("ru='дебетовое %1'");
	ТекстШаблонКредитовое = НСтр("ru='кредитовое %1'");
	
	ФорматнаяСтрока = "ЧН=0,00; ЧДЦ=2";
	
	ОжидаемоеЗначение = СтрокаТаблицыНарушений[ИмяПоляНарушения + "ОжидаемоеЗначение"];
	
	ФактическоеЗначение = СтрокаТаблицыНарушений[ИмяПоляНарушения + "ФактическоеЗначение"];
	
	Разница = ОжидаемоеЗначение - ФактическоеЗначение;
	
	ЗначенияОдинаковогоЗнака =
		(ОжидаемоеЗначение >= 0 И ФактическоеЗначение >= 0
		Или ОжидаемоеЗначение <= 0 И ФактическоеЗначение <= 0);
	
	Если ЗначенияОдинаковогоЗнака Тогда
		ТекстШаблонОжидаемоеЗначение = ТекстШаблонБезСтороны;
		ТекстШаблонФактическоеЗначение = ?(ФактическоеЗначение >= 0, ТекстШаблонДебетовое, ТекстШаблонКредитовое);
	Иначе
		ТекстШаблонОжидаемоеЗначение = ?(ОжидаемоеЗначение >= 0, ТекстШаблонДебетовое, ТекстШаблонКредитовое);
		ТекстШаблонФактическоеЗначение = ?(ФактическоеЗначение >= 0, ТекстШаблонДебетовое, ТекстШаблонКредитовое);
	КонецЕсли;
	
	АбсолютноеОжидаемоеЗначение = Макс(ОжидаемоеЗначение, -ОжидаемоеЗначение);
	АбсолютноеФактическоеЗначение = Макс(ФактическоеЗначение, -ФактическоеЗначение);
	АбсолютнаяРазница = Макс(Разница, -Разница);
	
	ПредставлениеОжидаемогоЗначения		= СтрШаблон(ТекстШаблонОжидаемоеЗначение, Формат(АбсолютноеОжидаемоеЗначение, ФорматнаяСтрока));
	ПредставлениеФактическогоЗначения	= СтрШаблон(ТекстШаблонФактическоеЗначение, Формат(АбсолютноеФактическоеЗначение, ФорматнаяСтрока));
	
	ПредставлениеРазницы = Формат(АбсолютнаяРазница, ФорматнаяСтрока);
	
КонецПроцедуры

Функция ОпределитьТабличнуюЧастьДляВыводаСообщенияОНарушении(Знач ДокументОбъект, Знач СтрокаТаблицыНарушений, Знач ПараметрыРасчета, СтрокаТаблицы, ДобавленоВручную)
	
	// Если где-то есть строка, добавленная вручную, то вероятно нарушение вызвано этим фактом.
	// Поэтому выводим сообщение о нарушении в такой табличной части.
	// Если добавленных вручную строк нет нигде, выводим в табличной части, имеющей строку по договору,
	// чтобы можно было спозиционировать сообщение на конкретной строке табличной части.
	
	// Сначала пробуем найти добавленные вручную строки в табличных частях, допускающих добавление строк.
	ДобавленоВручную = Истина;
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеПоСчетам");
	ИменаТЧ.Добавить("Раздел1СальдоНачальноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1Операции");
	
	ПоискДобавленоВручную = Новый Структура(ПараметрыРасчета.КолонкиСвязи);
	
	ЗаполнитьЗначенияСвойств(ПоискДобавленоВручную, СтрокаТаблицыНарушений);
	
	ПоискДобавленоВручную.Вставить("ДобавленоВручную", Истина);
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		Если ИмяТЧ = "Раздел1Операции" И Не СтрокаТаблицыНарушений.ЕстьВТаблицеОборотов
			Или ИмяТЧ = "Раздел1СальдоНачальноеБезСчетов" И Не СтрокаТаблицыНарушений.ЕстьВТаблицеСальдоНачальное
			Или ИмяТЧ = "Раздел1СальдоКонечноеПоСчетам" И Не СтрокаТаблицыНарушений.ЕстьВТаблицеСальдоКонечное Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок = ДокументОбъект[ИмяТЧ].НайтиСтроки(ПоискДобавленоВручную);
		
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаТаблицы = МассивСтрок[0];
			
			Возврат ИмяТЧ;
		КонецЕсли;
	КонецЦикла;
	
	// Теперь определяем табличную часть без учета наличия добавленных строк.
	ДобавленоВручную = Ложь;
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1СальдоНачальноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1Операции");
	
	Поиск = Новый Структура(ПараметрыРасчета.КолонкиСвязи);
	
	ЗаполнитьЗначенияСвойств(Поиск, СтрокаТаблицыНарушений);
	
	МассивСтрок = ДокументОбъект.Раздел1СальдоКонечноеПоСчетам.НайтиСтроки(Поиск);
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		Если ИмяТЧ = "Раздел1Операции" И Не СтрокаТаблицыНарушений.ЕстьВТаблицеОборотов
			Или ИмяТЧ = "Раздел1СальдоНачальноеБезСчетов" И Не СтрокаТаблицыНарушений.ЕстьВТаблицеСальдоНачальное
			Или ИмяТЧ = "Раздел1СальдоКонечноеБезСчетов" И Не СтрокаТаблицыНарушений.ЕстьВТаблицеСальдоКонечное Тогда
			Продолжить;
		КонецЕсли;
		
		МассивСтрок = ДокументОбъект[ИмяТЧ].НайтиСтроки(Поиск);
		
		Если МассивСтрок.Количество() > 0 Тогда
			СтрокаТаблицы = МассивСтрок[0];
			
			Возврат ИмяТЧ;
		КонецЕсли;
	КонецЦикла;
	
	СтрокаТаблицы = Неопределено;
	
	Возврат "Раздел1СальдоКонечноеБезСчетов";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УсловноеОформление

Процедура УстановитьУсловноеОформление(ФормаДокумента)
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ВалютаРУ", ФормаДокумента.ВалютаРУ);
	
	ДобавитьУсловноеОформление_Отбор(ФормаДокумента, ДополнительныеПараметры);
	
	ДобавитьУсловноеОформление_Раздел1(ФормаДокумента, ДополнительныеПараметры);
	
	ДобавитьУсловноеОформление_Раздел2(ФормаДокумента, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Раздел1(ФормаДокумента, ДополнительныеПараметры)
	
	ДобавитьУсловноеОформление_НадписиИВалютныеСуммыРаздела1(ФормаДокумента, ДополнительныеПараметры);
	
	ДобавитьУсловноеОформление_УстановленФильтрСтрокРаздела1(ФормаДокумента, ДополнительныеПараметры);
	
	ДобавитьУсловноеОформление_НедоступныАвтоматическиДобавленныеСтроки(ФормаДокумента, "Раздел1Операции", ДополнительныеПараметры);
	ДобавитьУсловноеОформление_НедоступныАвтоматическиДобавленныеСтроки(ФормаДокумента, "Раздел1СальдоНачальноеБезСчетов", ДополнительныеПараметры);
	ДобавитьУсловноеОформление_НедоступныАвтоматическиДобавленныеСтроки(ФормаДокумента, "Раздел1СальдоКонечноеПоСчетам", ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_НадписиИВалютныеСуммыРаздела1(ФормаДокумента, ДополнительныеПараметры)
	
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел1Операции");
	ИменаТЧ.Добавить("Раздел1СальдоНачальноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1ОборотыБезСчетов");
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеПоСчетам");
	ИменаТЧ.Добавить("Раздел1ВсегоСальдоНачальноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1ВсегоСальдоКонечноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1ВсегоСальдоКонечноеПоСчетам");
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		ДобавитьУсловноеОформление_НадписиСумм(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
		
		ДобавитьУсловноеОформление_СкрытьВалютныеСуммыДляРублей(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_УстановленФильтрСтрокРаздела1(ФормаДокумента, ДополнительныеПараметры)
	
	// Возможен фильтр по договору.
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел1СписокДоговоров");
	ИменаТЧ.Добавить("Раздел1Операции");
	ИменаТЧ.Добавить("Раздел1СальдоНачальноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1ОборотыБезСчетов");
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеПоСчетам");
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		ДобавитьУсловноеОформление_УстановленФильтрСтрокПоДоговору(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
	КонецЦикла;
	
	// Возможен фильтр по валюте.
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел1Операции");
	ИменаТЧ.Добавить("Раздел1СальдоНачальноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1ОборотыБезСчетов");
	ИменаТЧ.Добавить("Раздел1СальдоКонечноеПоСчетам");
	ИменаТЧ.Добавить("Раздел1ВсегоСальдоНачальноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1ВсегоСальдоКонечноеБезСчетов");
	ИменаТЧ.Добавить("Раздел1ВсегоСальдоКонечноеПоСчетам");
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		ДобавитьУсловноеОформление_УстановленФильтрСтрокПоВалюте(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Раздел2(ФормаДокумента, ДополнительныеПараметры)
	
	ДобавитьУсловноеОформление_НадписиИВалютныеСуммыРаздела2(ФормаДокумента, ДополнительныеПараметры);
	
	ДобавитьУсловноеОформление_УстановленФильтрСтрокРаздела2(ФормаДокумента, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_НадписиИВалютныеСуммыРаздела2(ФормаДокумента, ДополнительныеПараметры)
	
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел2Операции");
	ИменаТЧ.Добавить("Раздел2СальдоНачальное");
	ИменаТЧ.Добавить("Раздел2СальдоКонечное");
	ИменаТЧ.Добавить("Раздел2Обороты");
	ИменаТЧ.Добавить("Раздел2ВсегоСальдоНачальное");
	ИменаТЧ.Добавить("Раздел2ВсегоСальдоКонечное");
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		ДобавитьУсловноеОформление_НадписиСумм(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
		
		ДобавитьУсловноеОформление_СкрытьВалютныеСуммыДляРублей(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_УстановленФильтрСтрокРаздела2(ФормаДокумента, ДополнительныеПараметры)
	
	// Возможен фильтр по договору.
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел2СписокДоговоров");
	ИменаТЧ.Добавить("Раздел2Операции");
	ИменаТЧ.Добавить("Раздел2СальдоНачальное");
	ИменаТЧ.Добавить("Раздел2СальдоКонечное");
	ИменаТЧ.Добавить("Раздел2Обороты");
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		ДобавитьУсловноеОформление_УстановленФильтрСтрокПоДоговору(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
	КонецЦикла;
	
	// Возможен фильтр по валюте.
	ИменаТЧ = Новый Массив();
	ИменаТЧ.Добавить("Раздел2Операции");
	ИменаТЧ.Добавить("Раздел2СальдоНачальное");
	ИменаТЧ.Добавить("Раздел2СальдоКонечное");
	ИменаТЧ.Добавить("Раздел2Обороты");
	ИменаТЧ.Добавить("Раздел2ВсегоСальдоНачальное");
	ИменаТЧ.Добавить("Раздел2ВсегоСальдоКонечное");
	
	Для Каждого ИмяТЧ Из ИменаТЧ Цикл
		ДобавитьУсловноеОформление_УстановленФильтрСтрокПоВалюте(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры);
	КонецЦикла;
	
КонецПроцедуры

// Общее.

Процедура ДобавитьУсловноеОформление_КФО0(ФормаДокумента)
	
	ИмяТЧ = "СписокСчетов";
	
	УсловноеОформление = ФормаДокумента.УсловноеОформление;
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Представление КФО 0 (список счетов)'");

	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.КФО", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");

	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "КФО");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_НадписиСумм(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры)
	
	//---
	// Надпись для валютных сумм.
	//---
	ЭлементУО = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись для валютных сумм (%1)'"), ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = 1;
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в валюте'"));
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "НадписьСуммаВал");
	
	//---
	// Надпись для рублевых сумм иностранной валюты.
	//---
	ЭлементУО = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись для рублевых сумм иностранной валюты (%1)'"), ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = 1;
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.Валюта", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Условие.ПравоеЗначение = ДополнительныеПараметры.ВалютаРУ;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru='в рублях'"));
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "НадписьСуммаРуб");
	
	//---
	// Надпись для рублевых сумм рублей.
	//---
	ЭлементУО = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Надпись для рублевых сумм рублей (%1)'"), ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = 1;
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.Валюта", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = ДополнительныеПараметры.ВалютаРУ;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "НадписьСуммаРуб");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_СкрытьВалютныеСуммыДляРублей(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры)
	
	ИменаВидовРасчетов = ПолучитьИменаВидовРасчетов();
	ИменаСторон = ПолучитьИменаСторон();
	
	ПредставлениеШаблон = НСтр("ru='Валютные суммы доступны только при указании иностранной валюты (%1)'");
	
	ЭлементУО = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(ПредставлениеШаблон, ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.Валюта", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = ДополнительныеПараметры.ВалютаРУ;
	
	Для Каждого Сторона Из ИменаСторон Цикл
		Для Каждого ВидРасчетов Из ИменаВидовРасчетов Цикл
			ИмяПоляВал = ПолучитьИмяПоляСумма(ВидРасчетов, "Вал", Сторона);
			
			// Условия
			Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.%2", ИмяТЧ, ИмяПоляВал));
			Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
			
			// Оформляемые поля (валютная сумма)
			ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
			ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ИмяПоляВал);
		КонецЦикла;
		
		// Условия (всего)
		Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.%2", ИмяТЧ, ПолучитьИмяПоляСумма("Всего", "Вал", Сторона)));
		Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		// Оформляемые поля (всего)
		ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + ПолучитьИмяПоляСумма("Всего", "Вал", Сторона));
	КонецЦикла;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// Оформляемые поля (надпись сумм)
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "НадписьСуммаВал");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_УстановленФильтрСтрокПоДоговору(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры)
	
	ШрифтЖирный = Новый Шрифт(,,Истина);
	
	ЭлементУО = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Установлен фильтр строк по договору (%1)'"), ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФильтрПоДоговоруУстановленный");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЖирный);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "Договор");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_УстановленФильтрСтрокПоВалюте(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры)
	
	ШрифтЖирный = Новый Шрифт(,,Истина);
	
	ЭлементУО = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Установлен фильтр строк по валюте (%1)'"), ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФильтрПоВалютеУстановленный");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ГиперссылкаЦвет);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтЖирный);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ + "Валюта");
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_НедоступныАвтоматическиДобавленныеСтроки(ФормаДокумента, ИмяТЧ, ДополнительныеПараметры)
	
	ЭлементУО = ФормаДокумента.УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = СтрШаблон(НСтр("ru='Недоступны автоматически добавленные строки (%1)'"), ИмяТЧ);
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрШаблон("Объект.%1.ДобавленоВручную", ИмяТЧ));
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = Ложь;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветНедоступноеПоле);
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяТЧ);
	
КонецПроцедуры

Процедура ДобавитьУсловноеОформление_Отбор(ФормаДокумента, ДополнительныеПараметры)
	
	ДобавитьУсловноеОформление_КФО0(ФормаДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаФормы

Процедура ИнициализироватьИменаПолейПоказываемыхВДиалоге(ФормаДокумента)
	
	СписокИмен = ФормаДокумента.ИменаПолейПоказываемыхВДиалоге;
	
	// Операции, Сальдо.
	СписокИмен.Добавить("СодержаниеОперации");
	СписокИмен.Добавить("Договор");
	СписокИмен.Добавить("ИФО");
	СписокИмен.Добавить("Подразделение");
	СписокИмен.Добавить("Счет");
	СписокИмен.Добавить("КПС");
	СписокИмен.Добавить("КЭК");
	СписокИмен.Добавить("Валюта");
	СписокИмен.Добавить("ДокументУчета");
	СписокИмен.Добавить("НаименованиеДокумента");
	
	// СписокДоговоров.
	СписокИмен.Добавить("КраткоеСодержание");
	
КонецПроцедуры

Процедура ОграничитьВыборСчета_Раздел1СальдоКонечноеПоСчетам(ФормаДокумента)
	
	ПараметрыВыбора = Новый Массив();
	
	НовыйПараметр = Новый ПараметрВыбора("ОграниченияСчета", ПолучитьСписокСчетовЗаполненияСтрокой());
	ПараметрыВыбора.Добавить(НовыйПараметр);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ЭлементГруппа", Ложь);
	ПараметрыВыбора.Добавить(НовыйПараметр);
	
	ЭлементКолонкиСчет = ФормаДокумента.Элементы.Раздел1СальдоКонечноеПоСчетамСчет;
	ЭлементКолонкиСчет.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

Процедура ОграничитьВыборСчета_СписокСчетов(ФормаДокумента)
	
	ПараметрыВыбора = Новый Массив();
	
	НовыйПараметр = Новый ПараметрВыбора("ОграниченияСчета", ПолучитьСписокСчетовЗаполненияСтрокой());
	ПараметрыВыбора.Добавить(НовыйПараметр);
	
	ЭлементКолонкиСчет = ФормаДокумента.Элементы.СписокСчетовСчет;
	ЭлементКолонкиСчет.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРаздела1

Функция ПолучитьПараметрыПоискаСведенийБухУчета(ПараметрыПроцедуры)
	
	ИспользоватьУчетПоИФО				= ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	ИспользоватьВалютныйУчет			= ПолучитьФункциональнуюОпцию("ИспользоватьВалютныйУчет");
	ИспользоватьУчетПоПодразделениям	= ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	НастройкиОтбораСчетовИКФО = ИнвентаризацияСервер.ПолучитьНастройкиОтбораСчетовИКФО(ПараметрыПроцедуры.СписокСчетов, ПараметрыПроцедуры.ДатаОкончания);
	
	ДатыПоиска = ПолучитьДатыПоискаСведенийБухУчета(ПараметрыПроцедуры);
	
	СписокДоговоровДляОтбора = ПолучитьСписокДоговоровДляОтбора(ПараметрыПроцедуры.СписокДоговоров);
	
	ИспользоватьОтборПоДоговорам = (СписокДоговоровДляОтбора.Количество() > 0);
	
	ВидыСубконтоКонтрагентДоговорВидыРасчетов = Новый Массив();
	ВидыСубконтоКонтрагентДоговорВидыРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	ВидыСубконтоКонтрагентДоговорВидыРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	ВидыСубконтоКонтрагентДоговорВидыРасчетов.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ВидыРасчетовПоЗаймам);
	
	ИсключаемыеТипыРегистратора = Новый Массив();
	ИсключаемыеТипыРегистратора.Добавить(Тип("ДокументСсылка.ЗакрытиеГода"));
	ИсключаемыеТипыРегистратора.Добавить(Тип("ДокументСсылка.ЗакрытиеГодаТехнологическое"));
	ИсключаемыеТипыРегистратора.Добавить(Тип("ДокументСсылка.ЗакрытиеГодаТехнологическоеГрупповое"));
	ИсключаемыеТипыРегистратора.Добавить(Тип("ДокументСсылка.ПереносОстатковПоКПС"));
	ИсключаемыеТипыРегистратора.Добавить(Тип("ДокументСсылка.ПереносОстатков64нРасчеты"));
	ИсключаемыеТипыРегистратора.Добавить(Тип("ДокументСсылка.ВводНачальныхОстатков"));
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("ДатаНачала",							ДатыПоиска.ДатаНачала);
	ПараметрыПоиска.Вставить("ДатаОкончания",						ДатыПоиска.ДатаОкончания);
	ПараметрыПоиска.Вставить("ДатаНачальныхОстатков",				ДатыПоиска.ДатаНачальныхОстатков);
	ПараметрыПоиска.Вставить("ДатаКонечныхОстатков",				ДатыПоиска.ДатаКонечныхОстатков);
	ПараметрыПоиска.Вставить("Организация",							ПараметрыПроцедуры.Организация);
	ПараметрыПоиска.Вставить("Контрагент",							ПараметрыПроцедуры.Контрагент);
	ПараметрыПоиска.Вставить("КонтрагентКИЕ",						ПолучитьКонтрагентКИЕ(ПараметрыПроцедуры.Контрагент));
	ПараметрыПоиска.Вставить("СписокДоговоров",						СписокДоговоровДляОтбора);
	ПараметрыПоиска.Вставить("ИспользоватьОтборПоДоговорам",		ИспользоватьОтборПоДоговорам);
	ПараметрыПоиска.Вставить("ИспользоватьВалютныйУчет",			ИспользоватьВалютныйУчет);
	ПараметрыПоиска.Вставить("ВалютаРУ",							Константы.ВалютаРегламентированногоУчета.Получить());
	ПараметрыПоиска.Вставить("ИФО",									ПараметрыПроцедуры.ИФО);
	ПараметрыПоиска.Вставить("ИспользоватьУчетПоИФО",				ИспользоватьУчетПоИФО);
	ПараметрыПоиска.Вставить("ИспользоватьОтборПоИФО",				ИспользоватьУчетПоИФО И ЗначениеЗаполнено(ПараметрыПроцедуры.ИФО));
	ПараметрыПоиска.Вставить("Подразделение",						ПараметрыПроцедуры.Подразделение);
	ПараметрыПоиска.Вставить("ИспользоватьУчетПоПодразделениям",	ИспользоватьУчетПоПодразделениям);
	ПараметрыПоиска.Вставить("ИспользоватьОтборПоПодразделению",	ИспользоватьУчетПоПодразделениям И ЗначениеЗаполнено(ПараметрыПроцедуры.Подразделение));
	ПараметрыПоиска.Вставить("КЭК000",								БухгалтерскийУчетПовтИсп.КЭК0());
	ПараметрыПоиска.Вставить("СчетаРасчетовКИСЕ",					БухгалтерскийУчет.СписокСчетов(ПланыСчетов.ЕПСБУ.КодыСчетовРасчетовКИСЕ()));
	ПараметрыПоиска.Вставить("ИсключаемыеТипыРегистратора",			ИсключаемыеТипыРегистратора);
	
	ПараметрыПоиска.Вставить("ИспользоватьОтборПоКФО",				НастройкиОтбораСчетовИКФО.ИспользоватьОтборПоКФО);
	ПараметрыПоиска.Вставить("СписокКФО",							НастройкиОтбораСчетовИКФО.СписокКФО);
	ПараметрыПоиска.Вставить("СписокСчетов",						НастройкиОтбораСчетовИКФО.СписокСчетов);
	ПараметрыПоиска.Вставить("ТаблицаИсключаемыхСчетов",			НастройкиОтбораСчетовИКФО.ДетальнаяТаблицаИсключаемыеСчета);
	
	ПараметрыПоиска.Вставить("СписокСчетовИсключений", ПолучитьСписокСчетовИсключений(ПараметрыПроцедуры.ДатаОкончания, ПараметрыПроцедуры.Организация));
	
	ПараметрыПоиска.Вставить("СписокСчетовКонтрагентДоговорВидыРасчетов",
		ПолучитьСписокСчетовСУказаннымиВидамиСубконто(
			НастройкиОтбораСчетовИКФО.СписокСчетов, ВидыСубконтоКонтрагентДоговорВидыРасчетов));
	ПараметрыПоиска.Вставить("ВидыСубконтоКонтрагентДоговорВидыРасчетов",	ВидыСубконтоКонтрагентДоговорВидыРасчетов);
	ПараметрыПоиска.Вставить("СписокВидовРасчетовДляКолонкиОД",				ПолучитьСписокВидовРасчетовДляКолонкиОД());
	ПараметрыПоиска.Вставить("СписокВидовРасчетовДляКолонкиПроцентов",		ПолучитьСписокВидовРасчетовДляКолонкиПроцентов());
	ПараметрыПоиска.Вставить("СписокВидовРасчетовДляКолонкиШтрафов",		ПолучитьСписокВидовРасчетовДляКолонкиШтрафов());
	ПараметрыПоиска.Вставить("СписокВидовРасчетовДляКолонкиПеней",			ПолучитьСписокВидовРасчетовДляКолонкиПеней());
	
	ПараметрыПоиска.Вставить("ПустаяВалюта",		Справочники.Валюты.ПустаяСсылка());
	ПараметрыПоиска.Вставить("ПустоеИФО",			Справочники.ИсточникиФинансовогоОбеспечения.ПустаяСсылка());
	ПараметрыПоиска.Вставить("ПустойДоговор",		Справочники.Договоры.ПустаяСсылка());
	ПараметрыПоиска.Вставить("ПустоеПодразделение",	Справочники.Подразделения.ПустаяСсылка());
	
	Возврат ПараметрыПоиска;
	
КонецФункции

Функция ПолучитьСписокДоговоровДляОтбора(СписокДоговоров)
	
	Если СписокДоговоров.Количество() = 0 Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Договоры
	|ГДЕ
	|	Ссылка В ИЕРАРХИИ(&СписокДоговоров)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПрочитатьСведенияБухУчета(ПараметрыПроцедуры)
	
	Перем ОбщийСписокДоговоров;
	
	ПараметрыПоиска = ПолучитьПараметрыПоискаСведенийБухУчета(ПараметрыПроцедуры);
	
	Операции = ПрочитатьОперации(ПараметрыПоиска);
	
	Остатки = ПрочитатьОстатки(ПараметрыПоиска);
	
	КолонкиСуммирования = ПолучитьКолонкиСуммовыхПоказателейБезВсего();
	
	Обороты = РассчитатьОбороты(Операции, КолонкиСуммирования);
	
	ДобавитьКонечныеОстаткиБезСчетов(Остатки, КолонкиСуммирования);
	
	ОстаткиВсего = РассчитатьОстаткиВсего(Остатки, КолонкиСуммирования);
	
	ЗаполнитьКолонкиВсего(Операции);
	ЗаполнитьКолонкиВсего(Обороты);
	ЗаполнитьКолонкиВсего(Остатки.НачальныеОстаткиБезСчетов);
	ЗаполнитьКолонкиВсего(Остатки.КонечныеОстаткиБезСчетов);
	ЗаполнитьКолонкиВсего(Остатки.КонечныеОстаткиПоСчетам);
	ЗаполнитьКолонкиВсего(ОстаткиВсего.НачальныеОстаткиБезСчетов);
	ЗаполнитьКолонкиВсего(ОстаткиВсего.КонечныеОстаткиБезСчетов);
	ЗаполнитьКолонкиВсего(ОстаткиВсего.КонечныеОстаткиПоСчетам);
	
	ТаблицаСписокДоговоров = ПолучитьТаблицуСписокДоговоровПриЗаполненииПоДаннымБухУчета(Обороты, Остатки);
	
	Сведения = Новый Структура();
	Сведения.Вставить("Операции",				Операции);
	Сведения.Вставить("Обороты",				Обороты);
	Сведения.Вставить("Остатки",				Остатки);
	Сведения.Вставить("ОстаткиВсего",			ОстаткиВсего);
	Сведения.Вставить("ТаблицаСписокДоговоров",	ТаблицаСписокДоговоров);
	
	Возврат Сведения;
	
КонецФункции

Функция ПрочитатьОперации(ПараметрыПоиска)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("ДатаНачала",						ПараметрыПоиска.ДатаНачала);
	ЗапросПоиск.УстановитьПараметр("ДатаОкончания",						ПараметрыПоиска.ДатаОкончания);
	ЗапросПоиск.УстановитьПараметр("Организация",						ПараметрыПоиска.Организация);
	ЗапросПоиск.УстановитьПараметр("Контрагент",						ПараметрыПоиска.Контрагент);
	ЗапросПоиск.УстановитьПараметр("СписокДоговоров",					ПараметрыПоиска.СписокДоговоров);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоДоговорам",		ПараметрыПоиска.ИспользоватьОтборПоДоговорам);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьУчетПоИФО",				ПараметрыПоиска.ИспользоватьУчетПоИФО);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоИФО",			ПараметрыПоиска.ИспользоватьОтборПоИФО);
	ЗапросПоиск.УстановитьПараметр("ИФО",								ПараметрыПоиска.ИФО);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьУчетПоПодразделениям",	ПараметрыПоиска.ИспользоватьУчетПоПодразделениям);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоПодразделению",	ПараметрыПоиска.ИспользоватьОтборПоПодразделению);
	ЗапросПоиск.УстановитьПараметр("Подразделение",						ПараметрыПоиска.Подразделение);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоКФО",			ПараметрыПоиска.ИспользоватьОтборПоКФО);
	ЗапросПоиск.УстановитьПараметр("СписокКФО",							ПараметрыПоиска.СписокКФО);
	ЗапросПоиск.УстановитьПараметр("СписокСчетов",						ПараметрыПоиска.СписокСчетов);
	ЗапросПоиск.УстановитьПараметр("ТаблицаИсключаемыхСчетов",			ПараметрыПоиска.ТаблицаИсключаемыхСчетов);
	ЗапросПоиск.УстановитьПараметр("ИсключаемыеТипыРегистратора",		ПараметрыПоиска.ИсключаемыеТипыРегистратора);
	ЗапросПоиск.УстановитьПараметр("СписокСчетовИсключений",			ПараметрыПоиска.СписокСчетовИсключений);
	
	ЗапросПоиск.УстановитьПараметр("ИспользоватьВалютныйУчет",			ПараметрыПоиска.ИспользоватьВалютныйУчет);
	ЗапросПоиск.УстановитьПараметр("ВалютаРУ",							ПараметрыПоиска.ВалютаРУ);
	
	ЗапросПоиск.УстановитьПараметр("СписокСчетовКонтрагентДоговорВидыРасчетов",	ПараметрыПоиска.СписокСчетовКонтрагентДоговорВидыРасчетов);
	ЗапросПоиск.УстановитьПараметр("ВидыСубконтоКонтрагентДоговорВидыРасчетов",	ПараметрыПоиска.ВидыСубконтоКонтрагентДоговорВидыРасчетов);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиОД",			ПараметрыПоиска.СписокВидовРасчетовДляКолонкиОД);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиПроцентов",	ПараметрыПоиска.СписокВидовРасчетовДляКолонкиПроцентов);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиШтрафов",		ПараметрыПоиска.СписокВидовРасчетовДляКолонкиШтрафов);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиПеней",		ПараметрыПоиска.СписокВидовРасчетовДляКолонкиПеней);
	
	ЗапросПоиск.УстановитьПараметр("ПустоеИФО",				ПараметрыПоиска.ПустоеИФО);
	ЗапросПоиск.УстановитьПараметр("ПустоеПодразделение",	ПараметрыПоиска.ПустоеПодразделение);
	ЗапросПоиск.УстановитьПараметр("ПустойДоговор",			ПараметрыПоиска.ПустойДоговор);
	ЗапросПоиск.УстановитьПараметр("ПустаяВалюта",			ПараметрыПоиска.ПустаяВалюта);
	
	ЗапросПоиск.Текст = ПолучитьТекстЗапросаОперации();
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаОперации = ЗапросПоиск.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблицаОперации;
	
КонецФункции

Функция ПрочитатьОстатки(ПараметрыПоиска)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("ДатаНачальныхОстатков",				ПараметрыПоиска.ДатаНачальныхОстатков);
	ЗапросПоиск.УстановитьПараметр("ДатаКонечныхОстатков",				ПараметрыПоиска.ДатаКонечныхОстатков);
	ЗапросПоиск.УстановитьПараметр("Организация",						ПараметрыПоиска.Организация);
	ЗапросПоиск.УстановитьПараметр("Контрагент",						ПараметрыПоиска.Контрагент);
	ЗапросПоиск.УстановитьПараметр("СписокДоговоров",					ПараметрыПоиска.СписокДоговоров);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоДоговорам",		ПараметрыПоиска.ИспользоватьОтборПоДоговорам);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьУчетПоИФО",				ПараметрыПоиска.ИспользоватьУчетПоИФО);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоИФО",			ПараметрыПоиска.ИспользоватьОтборПоИФО);
	ЗапросПоиск.УстановитьПараметр("ИФО",								ПараметрыПоиска.ИФО);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьУчетПоПодразделениям",	ПараметрыПоиска.ИспользоватьУчетПоПодразделениям);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоПодразделению",	ПараметрыПоиска.ИспользоватьОтборПоПодразделению);
	ЗапросПоиск.УстановитьПараметр("Подразделение",						ПараметрыПоиска.Подразделение);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоКФО",			ПараметрыПоиска.ИспользоватьОтборПоКФО);
	ЗапросПоиск.УстановитьПараметр("СписокКФО",							ПараметрыПоиска.СписокКФО);
	ЗапросПоиск.УстановитьПараметр("СписокСчетов",						ПараметрыПоиска.СписокСчетов);
	ЗапросПоиск.УстановитьПараметр("ТаблицаИсключаемыхСчетов",			ПараметрыПоиска.ТаблицаИсключаемыхСчетов);
	
	ЗапросПоиск.УстановитьПараметр("СписокСчетовИсключений",			ПараметрыПоиска.СписокСчетовИсключений);
	
	ЗапросПоиск.УстановитьПараметр("ИспользоватьВалютныйУчет",			ПараметрыПоиска.ИспользоватьВалютныйУчет);
	ЗапросПоиск.УстановитьПараметр("ВалютаРУ",							ПараметрыПоиска.ВалютаРУ);
	
	ЗапросПоиск.УстановитьПараметр("СписокСчетовКонтрагентДоговорВидыРасчетов",	ПараметрыПоиска.СписокСчетовКонтрагентДоговорВидыРасчетов);
	ЗапросПоиск.УстановитьПараметр("ВидыСубконтоКонтрагентДоговорВидыРасчетов",	ПараметрыПоиска.ВидыСубконтоКонтрагентДоговорВидыРасчетов);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиОД",			ПараметрыПоиска.СписокВидовРасчетовДляКолонкиОД);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиПроцентов",	ПараметрыПоиска.СписокВидовРасчетовДляКолонкиПроцентов);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиШтрафов",		ПараметрыПоиска.СписокВидовРасчетовДляКолонкиШтрафов);
	ЗапросПоиск.УстановитьПараметр("СписокВидовРасчетовДляКолонкиПеней",		ПараметрыПоиска.СписокВидовРасчетовДляКолонкиПеней);
	
	ЗапросПоиск.УстановитьПараметр("ПустоеИФО",				ПараметрыПоиска.ПустоеИФО);
	ЗапросПоиск.УстановитьПараметр("ПустоеПодразделение",	ПараметрыПоиска.ПустоеПодразделение);
	ЗапросПоиск.УстановитьПараметр("ПустойДоговор",			ПараметрыПоиска.ПустойДоговор);
	ЗапросПоиск.УстановитьПараметр("ПустаяВалюта",			ПараметрыПоиска.ПустаяВалюта);
	ЗапросПоиск.УстановитьПараметр("КЭК000",				ПараметрыПоиска.КЭК000);
	
	ЗапросПоиск.Текст = ПолучитьТекстЗапросаОстатки();
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = ЗапросПоиск.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	// [1]. Начальные остатки по данным бух.учета без разреза по счетам.
	НачальныеОстаткиБезСчетов = РезультатЗапроса[1].Выгрузить();
	
	// [2]. Конечные остатки по данным бух.учета в разрезе счетов.
	КонечныеОстаткиПоСчетам = РезультатЗапроса[2].Выгрузить();
	
	ДатаКонечныхОстатков = ПараметрыПоиска.ДатаКонечныхОстатков.Значение;
	
	Если ДатаКонечныхОстатков >= Дата(2020,12,31) Тогда
		ИнвентаризацияСервер.ЗаполнитьКЭКОстатков(
			КонечныеОстаткиПоСчетам,
			ПараметрыПоиска.СчетаРасчетовКИСЕ,
			ПараметрыПоиска.КонтрагентКИЕ);
	КонецЕсли;
	
	УдалитьПолностьюНулевыеСтроки(КонечныеОстаткиПоСчетам);
	
	Остатки = Новый Структура();
	Остатки.Вставить("НачальныеОстаткиБезСчетов", НачальныеОстаткиБезСчетов);
	Остатки.Вставить("КонечныеОстаткиПоСчетам", КонечныеОстаткиПоСчетам);
	
	Возврат Остатки;
	
КонецФункции

Процедура УдалитьПолностьюНулевыеСтроки(Таблица)
	
	МассивИмен = СтрРазделить(ПолучитьКолонкиСуммовыхПоказателейБезВсего(), ", ", Ложь);
	
	Поиск = Новый Структура();
	
	Для Каждого ИмяПоля Из МассивИмен Цикл
		Поиск.Вставить(ИмяПоля, 0);
	КонецЦикла;
	
	МассивСтрок = Таблица.НайтиСтроки(Поиск);
	
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		Таблица.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьКонечныеОстаткиБезСчетов(Остатки, КолонкиСуммирования)
	
	КонечныеОстаткиБезСчетов = РассчитатьКонечныеОстаткиБезСчетов(Остатки.КонечныеОстаткиПоСчетам, КолонкиСуммирования);
	
	Остатки.Вставить("КонечныеОстаткиБезСчетов", КонечныеОстаткиБезСчетов);
	
КонецПроцедуры

Функция РассчитатьКонечныеОстаткиБезСчетов(КонечныеОстаткиПоСчетам, КолонкиСуммирования)
	
	КонечныеОстаткиБезСчетов = КонечныеОстаткиПоСчетам.Скопировать();
	
	КонечныеОстаткиБезСчетов.Свернуть("Договор,Валюта,ИФО,Подразделение", КолонкиСуммирования);
	
	Возврат КонечныеОстаткиБезСчетов;
	
КонецФункции

Функция РассчитатьОстаткиВсего(Остатки, КолонкиСуммирования)
	
	КолонкиГруппировок = "Валюта,ИФО,Подразделение";
	НачальныеОстаткиБезСчетов = Остатки.НачальныеОстаткиБезСчетов.Скопировать();
	НачальныеОстаткиБезСчетов.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	НачальныеОстаткиБезСчетов.Сортировать(КолонкиГруппировок);
	
	КолонкиГруппировок = "Валюта,ИФО,Подразделение";
	КонечныеОстаткиБезСчетов = Остатки.КонечныеОстаткиБезСчетов.Скопировать();
	КонечныеОстаткиБезСчетов.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	КонечныеОстаткиБезСчетов.Сортировать(КолонкиГруппировок);
	
	КолонкиГруппировок = "Валюта,ИФО,Подразделение,КФО,Счет,КПС,КЭК";
	КонечныеОстаткиПоСчетам = Остатки.КонечныеОстаткиПоСчетам.Скопировать();
	КонечныеОстаткиПоСчетам.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	КонечныеОстаткиПоСчетам.Сортировать(КолонкиГруппировок);
	
	ОстаткиВсего = Новый Структура();
	ОстаткиВсего.Вставить("НачальныеОстаткиБезСчетов", НачальныеОстаткиБезСчетов);
	ОстаткиВсего.Вставить("КонечныеОстаткиБезСчетов", КонечныеОстаткиБезСчетов);
	ОстаткиВсего.Вставить("КонечныеОстаткиПоСчетам", КонечныеОстаткиПоСчетам);
	
	Возврат ОстаткиВсего;
	
КонецФункции

Функция РассчитатьОбороты(Операции, КолонкиСуммирования, КолонкиГруппировок = "Договор,Валюта,ИФО,Подразделение")
	
	НужныеКолонки = КолонкиГруппировок + "," + КолонкиСуммирования;
	
	Обороты = Операции.Скопировать(, НужныеКолонки);
	
	Обороты.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	
	Возврат Обороты;
	
КонецФункции

Процедура ЗаполнитьКолонкиВсего(Таблица)
	
	ИменаКолонок = Новый Массив();
	ИменаКолонок.Добавить("СуммаВсегоВалДебет");
	ИменаКолонок.Добавить("СуммаВсегоРубДебет");
	ИменаКолонок.Добавить("СуммаВсегоВалКредит");
	ИменаКолонок.Добавить("СуммаВсегоРубКредит");
	
	ТипСумма = ОбщегоНазначения.ОписаниеТипаЧисло(18, 2, ДопустимыйЗнак.Любой);
	
	Для Каждого ИмяКолонки Из ИменаКолонок Цикл
		Таблица.Колонки.Добавить(ИмяКолонки, ТипСумма);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.СуммаВсегоВалДебет =
			СтрокаТаблицы.СуммаОДВалДебет
			+ СтрокаТаблицы.СуммаПроцентовВалДебет
			+ СтрокаТаблицы.СуммаШтрафовВалДебет
			+ СтрокаТаблицы.СуммаПенейВалДебет;
			
		СтрокаТаблицы.СуммаВсегоРубДебет =
			СтрокаТаблицы.СуммаОДРубДебет
			+ СтрокаТаблицы.СуммаПроцентовРубДебет
			+ СтрокаТаблицы.СуммаШтрафовРубДебет
			+ СтрокаТаблицы.СуммаПенейРубДебет;
			
		СтрокаТаблицы.СуммаВсегоВалКредит =
			СтрокаТаблицы.СуммаОДВалКредит
			+ СтрокаТаблицы.СуммаПроцентовВалКредит
			+ СтрокаТаблицы.СуммаШтрафовВалКредит
			+ СтрокаТаблицы.СуммаПенейВалКредит;
			
		СтрокаТаблицы.СуммаВсегоРубКредит =
			СтрокаТаблицы.СуммаОДРубКредит
			+ СтрокаТаблицы.СуммаПроцентовРубКредит
			+ СтрокаТаблицы.СуммаШтрафовРубКредит
			+ СтрокаТаблицы.СуммаПенейРубКредит;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаОперации()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Исключаемые счета
	|//
	|ВЫБРАТЬ
	|	ТЗ.КФО	КАК КФО,
	|	ТЗ.Счет	КАК Счет
	|ПОМЕСТИТЬ
	|	ТаблицаИсключаемыхСчетов
	|ИЗ
	|	&ТаблицаИсключаемыхСчетов КАК ТЗ
	|ИНДЕКСИРОВАТЬ ПО
	|	КФО,
	|	Счет
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|// [1]. Отдельные проводки.
	|//
	|ВЫБРАТЬ
	|	Период												КАК Период,
	|	Регистратор											КАК ДокументУчета,
	|	Содержание											КАК СодержаниеОперации,
	|	ВЫБОР
	|		КОГДА СубконтоДт1 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(СубконтоДт1 КАК Справочник.Договоры)
	|		КОГДА СубконтоДт2 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(СубконтоДт2 КАК Справочник.Договоры)
	|		КОГДА СубконтоДт3 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(СубконтоДт3 КАК Справочник.Договоры)
	|		ИНАЧЕ
	|			&ПустойДоговор
	|	КОНЕЦ												КАК ДоговорДт,
	|	ВЫБОР
	|		КОГДА СубконтоКт1 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(СубконтоКт1 КАК Справочник.Договоры)
	|		КОГДА СубконтоКт2 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(СубконтоКт2 КАК Справочник.Договоры)
	|		КОГДА СубконтоКт3 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(СубконтоКт3 КАК Справочник.Договоры)
	|		ИНАЧЕ
	|			&ПустойДоговор
	|	КОНЕЦ												КАК ДоговорКт,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаДт, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|			ВалютаДт
	|		ИНАЧЕ
	|			&ВалютаРУ
	|	КОНЕЦ												КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаКт, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|			ВалютаКт
	|		ИНАЧЕ
	|			&ВалютаРУ
	|	КОНЕЦ												КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|			ЕСТЬNULL(ИФО, &ПустоеИФО)
	|		ИНАЧЕ
	|			&ПустоеИФО
	|	КОНЕЦ												КАК ИФО,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|			ЕСТЬNULL(ПодразделениеДт, &ПустоеПодразделение)
	|		ИНАЧЕ
	|			&ПустоеПодразделение
	|	КОНЕЦ												КАК ПодразделениеДт,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|			ЕСТЬNULL(ПодразделениеКт, &ПустоеПодразделение)
	|		ИНАЧЕ
	|			&ПустоеПодразделение
	|	КОНЕЦ												КАК ПодразделениеКт,
	|	ВидПервичногоДокумента								КАК НаименованиеДокумента,
	|	ДатаПервичногоДокумента								КАК ДатаДокумента,
	|	НомерПервичногоДокумента							КАК НомерДокумента,
	|	
	|	// Дебет, суммы в рублях.
	|	ВЫБОР
	|		КОГДА СчетДт В(&СписокСчетовКонтрагентДоговорВидыРасчетов) ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					Сумма
	|				КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					Сумма
	|				КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					Сумма
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			Сумма
	|	КОНЕЦ												КАК СуммаОДРубДебет,
	|	ВЫБОР
	|		КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|			Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПроцентовРубДебет,
	|	ВЫБОР
	|		КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|			Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаШтрафовРубДебет,
	|	ВЫБОР
	|		КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|			Сумма
	|		КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|			Сумма
	|		КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|			Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПенейРубДебет,
	|	
	|	// Дебет, суммы в валюте.
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаДт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СчетДт В(&СписокСчетовКонтрагентДоговорВидыРасчетов) ТОГДА
	|					ВЫБОР
	|						КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|							ВалютнаяСуммаДт
	|						КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|							ВалютнаяСуммаДт
	|						КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|							ВалютнаяСуммаДт
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ
	|				ИНАЧЕ
	|					ВалютнаяСуммаДт
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаОДВалДебет,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаДт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВалютнаяСуммаДт
	|				КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВалютнаяСуммаДт
	|				КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВалютнаяСуммаДт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПроцентовВалДебет,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаДт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВалютнаяСуммаДт
	|				КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВалютнаяСуммаДт
	|				КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВалютнаяСуммаДт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаШтрафовВалДебет,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаДт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоДт1 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВалютнаяСуммаДт
	|				КОГДА СубконтоДт2 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВалютнаяСуммаДт
	|				КОГДА СубконтоДт3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВалютнаяСуммаДт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПенейВалДебет,
	|	
	|	// Кредит, суммы в рублях.
	|	ВЫБОР
	|		КОГДА СчетКт В(&СписокСчетовКонтрагентДоговорВидыРасчетов) ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					Сумма
	|				КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					Сумма
	|				КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					Сумма
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			Сумма
	|	КОНЕЦ												КАК СуммаОДРубКредит,
	|	ВЫБОР
	|		КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|			Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПроцентовРубКредит,
	|	ВЫБОР
	|		КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|			Сумма
	|		КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|			Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаШтрафовРубКредит,
	|	ВЫБОР
	|		КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|			Сумма
	|		КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|			Сумма
	|		КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|			Сумма
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПенейРубКредит,
	|	
	|	// Кредит, суммы в валюте.
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаКт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СчетКт В(&СписокСчетовКонтрагентДоговорВидыРасчетов) ТОГДА
	|					ВЫБОР
	|						КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|							ВалютнаяСуммаКт
	|						КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|							ВалютнаяСуммаКт
	|						КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|							ВалютнаяСуммаКт
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ
	|				ИНАЧЕ
	|					ВалютнаяСуммаКт
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаОДВалКредит,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаКт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВалютнаяСуммаКт
	|				КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВалютнаяСуммаКт
	|				КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВалютнаяСуммаКт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПроцентовВалКредит,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаКт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВалютнаяСуммаКт
	|				КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВалютнаяСуммаКт
	|				КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВалютнаяСуммаКт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаШтрафовВалКредит,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(ВалютаКт, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ВЫБОР
	|				КОГДА СубконтоКт1 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВалютнаяСуммаКт
	|				КОГДА СубконтоКт2 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВалютнаяСуммаКт
	|				КОГДА СубконтоКт3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВалютнаяСуммаКт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ												КАК СуммаПенейВалКредит,
	|	
	|	// Признаки.
	|	(СчетДт В(&СписокСчетов)
	|		И НЕ СчетДт В(&СписокСчетовИсключений)
	|		И НЕ (КФО, СчетДт) В (ВЫБРАТЬ КФО, Счет ИЗ ТаблицаИсключаемыхСчетов)
	|		И ВЫБОР
	|			КОГДА СубконтоДт1 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(СубконтоДт1 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА СубконтоДт2 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(СубконтоДт2 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА СубконтоДт3 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(СубконтоДт3 КАК Справочник.Контрагенты) = &Контрагент
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА НЕ &ИспользоватьОтборПоДоговорам ТОГДА
	|				ИСТИНА
	|			КОГДА СубконтоДт1 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(СубконтоДт1 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА СубконтоДт2 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(СубконтоДт2 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА СубконтоДт3 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(СубконтоДт3 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоПодразделению ТОГДА
	|				СчетДт.УчетПоПодразделениям И ВЫРАЗИТЬ(ПодразделениеДт КАК Справочник.Подразделения) = &Подразделение
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ)											КАК СторонаДтСоответствуетОтбору,
	|	(СчетКт В(&СписокСчетов)
	|		И НЕ СчетКт В(&СписокСчетовИсключений)
	|		И НЕ (КФО, СчетКт) В (ВЫБРАТЬ КФО, Счет ИЗ ТаблицаИсключаемыхСчетов)
	|		И ВЫБОР
	|			КОГДА СубконтоКт1 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(СубконтоКт1 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА СубконтоКт2 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(СубконтоКт2 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА СубконтоКт3 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(СубконтоКт3 КАК Справочник.Контрагенты) = &Контрагент
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА НЕ &ИспользоватьОтборПоДоговорам ТОГДА
	|				ИСТИНА
	|			КОГДА СубконтоКт1 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(СубконтоКт1 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА СубконтоКт2 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(СубконтоКт2 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА СубконтоКт3 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(СубконтоКт3 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоПодразделению ТОГДА
	|				СчетКт.УчетПоПодразделениям И ВЫРАЗИТЬ(ПодразделениеКт КАК Справочник.Подразделения) = &Подразделение
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ)											КАК СторонаКтСоответствуетОтбору
	|ПОМЕСТИТЬ
	|	ОтдельныеПроводки
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|		&ДатаНачала, // 1
	|		&ДатаОкончания, // 2
	|		Активность
	|		И НЕ ТИПЗНАЧЕНИЯ(Регистратор) В (&ИсключаемыеТипыРегистратора)
	|		И Организация = &Организация // 3
	|		И Счет В(&СписокСчетов)
	|		И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоИФО ТОГДА
	|				ИФО = &ИФО
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР 
	|			КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|				КФО В(&СписокКФО)
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА Субконто1 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА Субконто2 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА Субконто3 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(Субконто3 КАК Справочник.Контрагенты) = &Контрагент
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА НЕ &ИспользоватьОтборПоДоговорам ТОГДА
	|				ИСТИНА
	|			КОГДА Субконто1 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА Субконто2 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА Субконто3 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоПодразделению ТОГДА
	|				Счет.УчетПоПодразделениям И ВЫРАЗИТЬ(Подразделение КАК Справочник.Подразделения) = &Подразделение
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ,
	|		Регистратор // 4
	|	)
	|;
	|
	|///////////////////////////////////////////////////////////////////////////////
	|// [2]. Сведения для табличной части Операции.
	|//
	|ВЫБРАТЬ
	|	Период							КАК Период,
	|	ДокументУчета					КАК ДокументУчета,
	|	СодержаниеОперации				КАК СодержаниеОперации,
	|	Договор							КАК Договор,
	|	Валюта							КАК Валюта,
	|	ИФО								КАК ИФО,
	|	Подразделение					КАК Подразделение,
	|	НаименованиеДокумента			КАК НаименованиеДокумента,
	|	ДатаДокумента					КАК ДатаДокумента,
	|	НомерДокумента					КАК НомерДокумента,
	|	// Дебет.
	|	СУММА(СуммаОДРубДебет)			КАК СуммаОДРубДебет,
	|	СУММА(СуммаПроцентовРубДебет)	КАК СуммаПроцентовРубДебет,
	|	СУММА(СуммаШтрафовРубДебет)		КАК СуммаШтрафовРубДебет,
	|	СУММА(СуммаПенейРубДебет)		КАК СуммаПенейРубДебет,
	|	СУММА(СуммаОДВалДебет)			КАК СуммаОДВалДебет,
	|	СУММА(СуммаПроцентовВалДебет)	КАК СуммаПроцентовВалДебет,
	|	СУММА(СуммаШтрафовВалДебет)		КАК СуммаШтрафовВалДебет,
	|	СУММА(СуммаПенейВалДебет)		КАК СуммаПенейВалДебет,
	|	// Кредит.
	|	СУММА(СуммаОДРубКредит)			КАК СуммаОДРубКредит,
	|	СУММА(СуммаПроцентовРубКредит)	КАК СуммаПроцентовРубКредит,
	|	СУММА(СуммаШтрафовРубКредит)	КАК СуммаШтрафовРубКредит,
	|	СУММА(СуммаПенейРубКредит)		КАК СуммаПенейРубКредит,
	|	СУММА(СуммаОДВалКредит)			КАК СуммаОДВалКредит,
	|	СУММА(СуммаПроцентовВалКредит)	КАК СуммаПроцентовВалКредит,
	|	СУММА(СуммаШтрафовВалКредит)	КАК СуммаШтрафовВалКредит,
	|	СУММА(СуммаПенейВалКредит)		КАК СуммаПенейВалКредит
	|ИЗ
	|	(ВЫБРАТЬ
	|		Период						КАК Период,
	|		ДокументУчета				КАК ДокументУчета,
	|		СодержаниеОперации			КАК СодержаниеОперации,
	|		ДоговорДт					КАК Договор,
	|		ВалютаДт					КАК Валюта,
	|		ИФО							КАК ИФО,
	|		ПодразделениеДт				КАК Подразделение,
	|		НаименованиеДокумента		КАК НаименованиеДокумента,
	|		ДатаДокумента				КАК ДатаДокумента,
	|		НомерДокумента				КАК НомерДокумента,
	|		// Дебет.
	|		СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|		СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|		СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|		СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|		СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|		СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|		СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|		СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|		// Кредит.
	|		0							КАК СуммаОДРубКредит,
	|		0							КАК СуммаПроцентовРубКредит,
	|		0							КАК СуммаШтрафовРубКредит,
	|		0							КАК СуммаПенейРубКредит,
	|		0							КАК СуммаОДВалКредит,
	|		0							КАК СуммаПроцентовВалКредит,
	|		0							КАК СуммаШтрафовВалКредит,
	|		0							КАК СуммаПенейВалКредит
	|	ИЗ
	|		ОтдельныеПроводки
	|	ГДЕ
	|		СторонаДтСоответствуетОтбору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Период						КАК Период,
	|		ДокументУчета				КАК ДокументУчета,
	|		СодержаниеОперации			КАК СодержаниеОперации,
	|		ДоговорКт					КАК Договор,
	|		ВалютаКт					КАК Валюта,
	|		ИФО							КАК ИФО,
	|		ПодразделениеКт				КАК Подразделение,
	|		НаименованиеДокумента		КАК НаименованиеДокумента,
	|		ДатаДокумента				КАК ДатаДокумента,
	|		НомерДокумента				КАК НомерДокумента,
	|		// Дебет.
	|		0							КАК СуммаОДРубДебет,
	|		0							КАК СуммаПроцентовРубДебет,
	|		0							КАК СуммаШтрафовРубДебет,
	|		0							КАК СуммаПенейРубДебет,
	|		0							КАК СуммаОДВалДебет,
	|		0							КАК СуммаПроцентовВалДебет,
	|		0							КАК СуммаШтрафовВалДебет,
	|		0							КАК СуммаПенейВалДебет,
	|		// Кредит.
	|		СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|		СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|		СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|		СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|		СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|		СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|		СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|		СуммаПенейВалКредит			КАК СуммаПенейВалКредит
	|	ИЗ
	|		ОтдельныеПроводки
	|	ГДЕ
	|		СторонаКтСоответствуетОтбору) КАК ВТ
	|СГРУППИРОВАТЬ ПО
	|	Период,
	|	ДокументУчета,
	|	СодержаниеОперации,
	|	Договор,
	|	Валюта,
	|	ИФО,
	|	Подразделение,
	|	НаименованиеДокумента,
	|	ДатаДокумента,
	|	НомерДокумента
	|ИМЕЮЩИЕ
	|	НЕ (// Дебет.
	|		СУММА(СуммаОДРубДебет) = 0
	|		И СУММА(СуммаПроцентовРубДебет) = 0
	|		И СУММА(СуммаШтрафовРубДебет) = 0
	|		И СУММА(СуммаПенейРубДебет) = 0
	|		И СУММА(СуммаОДВалДебет) = 0
	|		И СУММА(СуммаПроцентовВалДебет) = 0
	|		И СУММА(СуммаШтрафовВалДебет) = 0
	|		И СУММА(СуммаПенейВалДебет) = 0
	|		// Кредит.
	|		И СУММА(СуммаОДРубКредит) = 0
	|		И СУММА(СуммаПроцентовРубКредит) = 0
	|		И СУММА(СуммаШтрафовРубКредит) = 0
	|		И СУММА(СуммаПенейРубКредит) = 0
	|		И СУММА(СуммаОДВалКредит) = 0
	|		И СУММА(СуммаПроцентовВалКредит) = 0
	|		И СУММА(СуммаШтрафовВалКредит) = 0
	|		И СУММА(СуммаПенейВалКредит) = 0)
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Договор,
	|	Валюта
	|АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции

Функция ПолучитьТекстЗапросаОстатки()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Исключаемые счета
	|//
	|ВЫБРАТЬ
	|	ТЗ.КФО	КАК КФО,
	|	ТЗ.Счет	КАК Счет
	|ПОМЕСТИТЬ
	|	ТаблицаИсключаемыхСчетов
	|ИЗ
	|	&ТаблицаИсключаемыхСчетов КАК ТЗ
	|ИНДЕКСИРОВАТЬ ПО
	|	КФО,
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Начальные остатки по данным бух.учета без разреза по счетам.
	|//
	|ВЫБРАТЬ
	|	Договор							КАК Договор,
	|	Валюта							КАК Валюта,
	|	ИФО								КАК ИФО,
	|	Подразделение					КАК Подразделение,
	|	// Дебет.
	|	СУММА(СуммаОДРубДебет)			КАК СуммаОДРубДебет,
	|	СУММА(СуммаПроцентовРубДебет)	КАК СуммаПроцентовРубДебет,
	|	СУММА(СуммаШтрафовРубДебет)		КАК СуммаШтрафовРубДебет,
	|	СУММА(СуммаПенейРубДебет)		КАК СуммаПенейРубДебет,
	|	СУММА(СуммаОДВалДебет)			КАК СуммаОДВалДебет,
	|	СУММА(СуммаПроцентовВалДебет)	КАК СуммаПроцентовВалДебет,
	|	СУММА(СуммаШтрафовВалДебет)		КАК СуммаШтрафовВалДебет,
	|	СУММА(СуммаПенейВалДебет)		КАК СуммаПенейВалДебет,
	|	// Кредит.
	|	СУММА(СуммаОДРубКредит)			КАК СуммаОДРубКредит,
	|	СУММА(СуммаПроцентовРубКредит)	КАК СуммаПроцентовРубКредит,
	|	СУММА(СуммаШтрафовРубКредит)	КАК СуммаШтрафовРубКредит,
	|	СУММА(СуммаПенейРубКредит)		КАК СуммаПенейРубКредит,
	|	СУММА(СуммаОДВалКредит)			КАК СуммаОДВалКредит,
	|	СУММА(СуммаПроцентовВалКредит)	КАК СуммаПроцентовВалКредит,
	|	СУММА(СуммаШтрафовВалКредит)	КАК СуммаШтрафовВалКредит,
	|	СУММА(СуммаПенейВалКредит)		КАК СуммаПенейВалКредит
	|ИЗ
	|	(// Все счета, кроме 207.00.
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Субконто1 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры)
	|			КОГДА Субконто2 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры)
	|			КОГДА Субконто3 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры)
	|			ИНАЧЕ
	|				&ПустойДоговор
	|		КОНЕЦ												КАК Договор,
	|		ВЫБОР
	|			КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|				Валюта
	|			ИНАЧЕ
	|				&ВалютаРУ
	|		КОНЕЦ												КАК Валюта,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|				ЕСТЬNULL(ИФО, &ПустоеИФО)
	|			ИНАЧЕ
	|				&ПустоеИФО
	|		КОНЕЦ												КАК ИФО,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|				ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|			ИНАЧЕ
	|				&ПустоеПодразделение
	|		КОНЕЦ												КАК Подразделение,
	|		
	|		// Дебет.
	|		СУММА(СуммаОстатокДт)								КАК СуммаОДРубДебет,
	|		СУММА(0)											КАК СуммаПроцентовРубДебет,
	|		СУММА(0)											КАК СуммаШтрафовРубДебет,
	|		СУММА(0)											КАК СуммаПенейРубДебет,
	|		СУММА(ВЫБОР
	|			КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|				ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)												КАК СуммаОДВалДебет,
	|		СУММА(0)											КАК СуммаПроцентовВалДебет,
	|		СУММА(0)											КАК СуммаШтрафовВалДебет,
	|		СУММА(0)											КАК СуммаПенейВалДебет,
	|		
	|		// Кредит.
	|		СУММА(СуммаОстатокКт)								КАК СуммаОДРубКредит,
	|		СУММА(0)											КАК СуммаПроцентовРубКредит,
	|		СУММА(0)											КАК СуммаШтрафовРубКредит,
	|		СУММА(0)											КАК СуммаПенейРубКредит,
	|		СУММА(ВЫБОР
	|			КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|				ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)												КАК СуммаОДВалКредит,
	|		СУММА(0)											КАК СуммаПроцентовВалКредит,
	|		СУММА(0)											КАК СуммаШтрафовВалКредит,
	|		СУММА(0)											КАК СуммаПенейВалКредит
	|	ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаНачальныхОстатков, // 1 Период
	|			Счет В (&СписокСчетов)
	|				И НЕ Счет В (&СписокСчетовИсключений)
	|				И НЕ Счет В (&СписокСчетовКонтрагентДоговорВидыРасчетов), // 2 Условие счета
	|			, // 3 ВидыСубконто
	|			Организация = &Организация
	|			И ВЫБОР
	|				КОГДА &ИспользоватьОтборПоИФО ТОГДА
	|					ИФО = &ИФО
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ
	|			И ВЫБОР 
	|				КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|					КФО В(&СписокКФО)
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ
	|			И ВЫБОР
	|				КОГДА Субконто1 ССЫЛКА Справочник.Контрагенты ТОГДА
	|					ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты) = &Контрагент
	|				КОГДА Субконто2 ССЫЛКА Справочник.Контрагенты ТОГДА
	|					ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты) = &Контрагент
	|				КОГДА Субконто3 ССЫЛКА Справочник.Контрагенты ТОГДА
	|					ВЫРАЗИТЬ(Субконто3 КАК Справочник.Контрагенты) = &Контрагент
	|				ИНАЧЕ
	|					ЛОЖЬ
	|			КОНЕЦ
	|			И ВЫБОР
	|				КОГДА НЕ &ИспользоватьОтборПоДоговорам ТОГДА
	|					ИСТИНА
	|				КОГДА Субконто1 ССЫЛКА Справочник.Договоры ТОГДА
	|					ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры) В(&СписокДоговоров)
	|				КОГДА Субконто2 ССЫЛКА Справочник.Договоры ТОГДА
	|					ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры) В(&СписокДоговоров)
	|				КОГДА Субконто3 ССЫЛКА Справочник.Договоры ТОГДА
	|					ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры) В(&СписокДоговоров)
	|				ИНАЧЕ
	|					ЛОЖЬ
	|			КОНЕЦ)
	|	ГДЕ
	|		ВЫБОР 
	|			КОГДА &ИспользоватьОтборПоПодразделению ТОГДА
	|				Счет.УчетПоПодразделениям И Подразделение = &Подразделение
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И НЕ (КФО, Счет) В (ВЫБРАТЬ КФО, Счет ИЗ ТаблицаИсключаемыхСчетов)
	|	СГРУППИРОВАТЬ ПО
	|		ВЫБОР
	|			КОГДА Субконто1 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры)
	|			КОГДА Субконто2 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры)
	|			КОГДА Субконто3 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры)
	|			ИНАЧЕ
	|				&ПустойДоговор
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|				Валюта
	|			ИНАЧЕ
	|				&ВалютаРУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|				ЕСТЬNULL(ИФО, &ПустоеИФО)
	|			ИНАЧЕ
	|				&ПустоеИФО
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|				ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|			ИНАЧЕ
	|				&ПустоеПодразделение
	|		КОНЕЦ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	// Только счета 207.00.
	|	ВЫБРАТЬ
	|		ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры)			КАК Договор,
	|		ВЫБОР
	|			КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|				Валюта
	|			ИНАЧЕ
	|				&ВалютаРУ
	|		КОНЕЦ												КАК Валюта,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|				ЕСТЬNULL(ИФО, &ПустоеИФО)
	|			ИНАЧЕ
	|				&ПустоеИФО
	|		КОНЕЦ												КАК ИФО,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|				ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|			ИНАЧЕ
	|				&ПустоеПодразделение
	|		КОНЕЦ												КАК Подразделение,
	|		
	|		// Дебет.
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					СуммаОстатокДт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаОДРубДебет,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					СуммаОстатокДт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПроцентовРубДебет,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					СуммаОстатокДт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаШтрафовРубДебет,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					СуммаОстатокДт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПенейРубДебет,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаОДВалДебет,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПроцентовВалДебет,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаШтрафовВалДебет,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПенейВалДебет,
	|		
	|		// Кредит.
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					СуммаОстатокКт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаОДРубКредит,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					СуммаОстатокКт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПроцентовРубКредит,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					СуммаОстатокКт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаШтрафовРубКредит,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					СуммаОстатокКт
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПенейРубКредит,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаОДВалКредит,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПроцентовВалКредит,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаШтрафовВалКредит,
	|		СУММА(ВЫБОР
	|				КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|					ВЫБОР
	|						КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|							ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|						ИНАЧЕ
	|							0
	|					КОНЕЦ 
	|				ИНАЧЕ
	|					0
	|			КОНЕЦ)											КАК СуммаПенейВалКредит
	|	ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&ДатаНачальныхОстатков, // 1 Период
	|			Счет В (&СписокСчетов)
	|				И НЕ Счет В (&СписокСчетовИсключений)
	|				И Счет В (&СписокСчетовКонтрагентДоговорВидыРасчетов), // 2 Условие счета
	|			&ВидыСубконтоКонтрагентДоговорВидыРасчетов, // 3 ВидыСубконто
	|			Организация = &Организация
	|			И ВЫБОР
	|				КОГДА &ИспользоватьОтборПоИФО ТОГДА
	|					ИФО = &ИФО
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ
	|			И ВЫБОР 
	|				КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|					КФО В(&СписокКФО)
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ
	|			И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты) = &Контрагент
	|			И ВЫБОР
	|				КОГДА НЕ &ИспользоватьОтборПоДоговорам ТОГДА
	|					ИСТИНА
	|				ИНАЧЕ
	|					ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОНЕЦ)
	|	ГДЕ
	|		ВЫБОР 
	|			КОГДА &ИспользоватьОтборПоПодразделению ТОГДА
	|				Счет.УчетПоПодразделениям И Подразделение = &Подразделение
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И НЕ (КФО, Счет) В (ВЫБРАТЬ КФО, Счет ИЗ ТаблицаИсключаемыхСчетов)
	|	СГРУППИРОВАТЬ ПО
	|		ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры),
	|		ВЫБОР
	|			КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|				Валюта
	|			ИНАЧЕ
	|				&ВалютаРУ
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|				ЕСТЬNULL(ИФО, &ПустоеИФО)
	|			ИНАЧЕ
	|				&ПустоеИФО
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|				ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|			ИНАЧЕ
	|				&ПустоеПодразделение
	|		КОНЕЦ
	|	) КАК ВТ
	|СГРУППИРОВАТЬ ПО
	|	Договор,
	|	Валюта,
	|	ИФО,
	|	Подразделение
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	Валюта,
	|	ИФО,
	|	Подразделение
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Конечные остатки по данным бух.учета в разрезе счетов.
	|//
	|// Все счета, кроме 207.00.
	|ВЫБРАТЬ
	|	КФО													КАК КФО,
	|	Счет												КАК Счет,
	|	Счет.Забалансовый									КАК СчетЗабалансовый,
	|	Счет.БезДетализацииКОСГУ							КАК СчетБезДетализацииКОСГУ,
	|	ВЫБОР
	|		КОГДА Счет.КОСГУКт = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) ТОГДА
	|			""0""
	|		ИНАЧЕ
	|			ПОДСТРОКА(Счет.КОСГУКт.Код, 3, 1)
	|	КОНЕЦ 												КАК СчетКИЕ,
	|	КПС													КАК КПС,
	|	&КЭК000												КАК КЭК,
	|	ВЫБОР
	|		КОГДА Субконто1 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры)
	|		КОГДА Субконто2 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры)
	|		КОГДА Субконто3 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры)
	|		ИНАЧЕ
	|			&ПустойДоговор
	|	КОНЕЦ												КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|			Валюта
	|		ИНАЧЕ
	|			&ВалютаРУ
	|	КОНЕЦ												КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|			ЕСТЬNULL(ИФО, &ПустоеИФО)
	|		ИНАЧЕ
	|			&ПустоеИФО
	|	КОНЕЦ												КАК ИФО,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|			ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ
	|			&ПустоеПодразделение
	|	КОНЕЦ												КАК Подразделение,
	|	
	|	// Дебет.
	|	СУММА(СуммаОстатокДт)								КАК СуммаОДРубДебет,
	|	СУММА(0)											КАК СуммаПроцентовРубДебет,
	|	СУММА(0)											КАК СуммаШтрафовРубДебет,
	|	СУММА(0)											КАК СуммаПенейРубДебет,
	|	СУММА(ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)												КАК СуммаОДВалДебет,
	|	СУММА(0)											КАК СуммаПроцентовВалДебет,
	|	СУММА(0)											КАК СуммаШтрафовВалДебет,
	|	СУММА(0)											КАК СуммаПенейВалДебет,
	|	
	|	// Кредит.
	|	СУММА(СуммаОстатокКт)								КАК СуммаОДРубКредит,
	|	СУММА(0)											КАК СуммаПроцентовРубКредит,
	|	СУММА(0)											КАК СуммаШтрафовРубКредит,
	|	СУММА(0)											КАК СуммаПенейРубКредит,
	|	СУММА(ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|			ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)												КАК СуммаОДВалКредит,
	|	СУММА(0)											КАК СуммаПроцентовВалКредит,
	|	СУММА(0)											КАК СуммаШтрафовВалКредит,
	|	СУММА(0)											КАК СуммаПенейВалКредит
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|		&ДатаКонечныхОстатков, // 1 Период
	|		Счет В (&СписокСчетов)
	|			И НЕ Счет В (&СписокСчетовИсключений)
	|			 И НЕ Счет В (&СписокСчетовКонтрагентДоговорВидыРасчетов), // 2 Условие счета
	|		, // 3 ВидыСубконто
	|		Организация = &Организация
	|		И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоИФО ТОГДА
	|				ИФО = &ИФО
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР 
	|			КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|				КФО В(&СписокКФО)
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА Субконто1 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА Субконто2 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты) = &Контрагент
	|			КОГДА Субконто3 ССЫЛКА Справочник.Контрагенты ТОГДА
	|				ВЫРАЗИТЬ(Субконто3 КАК Справочник.Контрагенты) = &Контрагент
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА НЕ &ИспользоватьОтборПоДоговорам ТОГДА
	|				ИСТИНА
	|			КОГДА Субконто1 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА Субконто2 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			КОГДА Субконто3 ССЫЛКА Справочник.Договоры ТОГДА
	|				ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры) В(&СписокДоговоров)
	|			ИНАЧЕ
	|				ЛОЖЬ
	|		КОНЕЦ)
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &ИспользоватьОтборПоПодразделению ТОГДА
	|			Счет.УчетПоПодразделениям И Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И НЕ (КФО, Счет) В (ВЫБРАТЬ КФО, Счет ИЗ ТаблицаИсключаемыхСчетов)
	|СГРУППИРОВАТЬ ПО
	|	КФО,
	|	Счет,
	|	Счет.Забалансовый,
	|	Счет.БезДетализацииКОСГУ,
	|	ВЫБОР
	|		КОГДА Счет.КОСГУКт = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) ТОГДА
	|			""0""
	|		ИНАЧЕ
	|			ПОДСТРОКА(Счет.КОСГУКт.Код, 3, 1)
	|	КОНЕЦ,
	|	КПС,
	|	&КЭК000,
	|	ВЫБОР
	|		КОГДА Субконто1 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры)
	|		КОГДА Субконто2 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры)
	|		КОГДА Субконто3 ССЫЛКА Справочник.Договоры ТОГДА
	|			ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры)
	|		ИНАЧЕ
	|			&ПустойДоговор
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|			Валюта
	|		ИНАЧЕ
	|			&ВалютаРУ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|			ЕСТЬNULL(ИФО, &ПустоеИФО)
	|		ИНАЧЕ
	|			&ПустоеИФО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|			ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ
	|			&ПустоеПодразделение
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Только счета 207.00.
	|ВЫБРАТЬ
	|	КФО													КАК КФО,
	|	Счет												КАК Счет,
	|	Счет.Забалансовый									КАК СчетЗабалансовый,
	|	Счет.БезДетализацииКОСГУ							КАК СчетБезДетализацииКОСГУ,
	|	ВЫБОР
	|		КОГДА Счет.КОСГУКт = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) ТОГДА
	|			""0""
	|		ИНАЧЕ
	|			ПОДСТРОКА(Счет.КОСГУКт.Код, 3, 1)
	|	КОНЕЦ 												КАК СчетКИЕ,
	|	КПС													КАК КПС,
	|	&КЭК000												КАК КЭК,
	|	ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры)			КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|			Валюта
	|		ИНАЧЕ
	|			&ВалютаРУ
	|	КОНЕЦ												КАК Валюта,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|			ЕСТЬNULL(ИФО, &ПустоеИФО)
	|		ИНАЧЕ
	|			&ПустоеИФО
	|	КОНЕЦ												КАК ИФО,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|			ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ
	|			&ПустоеПодразделение
	|	КОНЕЦ												КАК Подразделение,
	|	
	|	// Дебет.
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|				СуммаОстатокДт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаОДРубДебет,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|				СуммаОстатокДт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПроцентовРубДебет,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|				СуммаОстатокДт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаШтрафовРубДебет,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|				СуммаОстатокДт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПенейРубДебет,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаОДВалДебет,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПроцентовВалДебет,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаШтрафовВалДебет,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокДт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПенейВалДебет,
	|	
	|	// Кредит.
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|				СуммаОстатокКт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаОДРубКредит,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|				СуммаОстатокКт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПроцентовРубКредит,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|				СуммаОстатокКт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаШтрафовРубКредит,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|				СуммаОстатокКт
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПенейРубКредит,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиОД) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаОДВалКредит,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПроцентов) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПроцентовВалКредит,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиШтрафов) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаШтрафовВалКредит,
	|	СУММА(ВЫБОР
	|			КОГДА Субконто3 В(&СписокВидовРасчетовДляКолонкиПеней) ТОГДА
	|				ВЫБОР
	|					КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ВалютаРУ) = &ВалютаРУ ТОГДА
	|						ЕСТЬNULL(ВалютнаяСуммаОстатокКт, 0)
	|					ИНАЧЕ
	|						0
	|				КОНЕЦ 
	|			ИНАЧЕ
	|				0
	|		КОНЕЦ)											КАК СуммаПенейВалКредит
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|		&ДатаКонечныхОстатков, // 1 Период
	|		Счет В (&СписокСчетов)
	|			И НЕ Счет В (&СписокСчетовИсключений)
	|			И Счет В (&СписокСчетовКонтрагентДоговорВидыРасчетов), // 2 Условие счета
	|		&ВидыСубконтоКонтрагентДоговорВидыРасчетов, // 3 ВидыСубконто
	|		Организация = &Организация
	|		И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоИФО ТОГДА
	|				ИФО = &ИФО
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР 
	|			КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|				КФО В(&СписокКФО)
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты) = &Контрагент
	|		И ВЫБОР
	|			КОГДА НЕ &ИспользоватьОтборПоДоговорам ТОГДА
	|				ИСТИНА
	|			ИНАЧЕ
	|				ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры) В(&СписокДоговоров)
	|		КОНЕЦ)
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &ИспользоватьОтборПоПодразделению ТОГДА
	|			Счет.УчетПоПодразделениям И Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|	И НЕ (КФО, Счет) В (ВЫБРАТЬ КФО, Счет ИЗ ТаблицаИсключаемыхСчетов)
	|СГРУППИРОВАТЬ ПО
	|	КФО,
	|	Счет,
	|	Счет.Забалансовый,
	|	Счет.БезДетализацииКОСГУ,
	|	ВЫБОР
	|		КОГДА Счет.КОСГУКт = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) ТОГДА
	|			""0""
	|		ИНАЧЕ
	|			ПОДСТРОКА(Счет.КОСГУКт.Код, 3, 1)
	|	КОНЕЦ,
	|	КПС,
	|	&КЭК000,
	|	ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры),
	|	ВЫБОР
	|		КОГДА &ИспользоватьВалютныйУчет И НЕ ЕСТЬNULL(Валюта, &ПустаяВалюта) = &ПустаяВалюта ТОГДА
	|			Валюта
	|		ИНАЧЕ
	|			&ВалютаРУ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|			ЕСТЬNULL(ИФО, &ПустоеИФО)
	|		ИНАЧЕ
	|			&ПустоеИФО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользоватьУчетПоПодразделениям ТОГДА
	|			ЕСТЬNULL(Подразделение, &ПустоеПодразделение)
	|		ИНАЧЕ
	|			&ПустоеПодразделение
	|	КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	Договор,
	|	Валюта,
	|	ИФО,
	|	Подразделение
	|АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции

Функция ПолучитьСписокСчетовСУказаннымиВидамиСубконто(СписокСчетов, ВидыСубконто)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокСчетов", СписокСчетов);
	ЗапросПоиск.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	ЗапросПоиск.УстановитьПараметр("КоличествоСубконто", ВидыСубконто.Количество());
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка			КАК Ссылка,
	|	КОЛИЧЕСТВО(*)	КАК КоличествоСубконто
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|ГДЕ
	|	Ссылка В(&СписокСчетов)
	|	И ВидСубконто В(&ВидыСубконто)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(*) = &КоличествоСубконто";
	
	Возврат ЗапросПоиск.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьДатыПоискаСведенийБухУчета(ПараметрыПроцедуры)
	
	ДатыПоиска = Новый Структура();
	
	// Поиск операций.
	ДатыПоиска.Вставить("ДатаНачала", НачалоДня(ПараметрыПроцедуры.ДатаНачала));
	ДатыПоиска.Вставить("ДатаОкончания", КонецДня(ПараметрыПроцедуры.ДатаОкончания));
	
	// Для остатков.
	ДатыПоиска.Вставить("ДатаНачальныхОстатков", НачалоДня(ПараметрыПроцедуры.ДатаНачала));
	ДатыПоиска.Вставить("ДатаКонечныхОстатков", Новый Граница(КонецДня(ПараметрыПроцедуры.ДатаОкончания), ВидГраницы.Включая));
	
	Возврат ДатыПоиска;
	
КонецФункции

Функция ПолучитьКонтрагентКИЕ(Контрагент)
	
	КонтрагентКИЕ = "0";
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ЗапросПоиск = Новый Запрос();
		ЗапросПоиск.УстановитьПараметр("Контрагент", Контрагент);
		ЗапросПоиск.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(СправочникТипыКонтрагентов.Код, ""0"") КАК КонтрагентКИЕ
		|ИЗ
		|	Справочник.Контрагенты КАК СправочникКонтрагенты
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыКонтрагентов КАК СправочникТипыКонтрагентов
		|		ПО СправочникКонтрагенты.ТипКонтрагента = СправочникТипыКонтрагентов.Ссылка
		|ГДЕ
		|	СправочникКонтрагенты.Ссылка = &Контрагент";
		
		Выборка = ЗапросПоиск.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			КонтрагентКИЕ = Выборка.КонтрагентКИЕ;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонтрагентКИЕ;
	
КонецФункции

Процедура ЗаполнитьРассчитываемыеТабличныеЧастиРаздела1(ДокументОбъект)
	
	ТаблицаРаздел1СальдоКонечноеПоСчетам = ДокументОбъект.Раздел1СальдоКонечноеПоСчетам.Выгрузить();
	
	ЗаполнитьРаздел1ОборотыБезСчетов(ДокументОбъект);
	
	ЗаполнитьРаздел1СальдоКонечноеБезСчетов(ДокументОбъект, ТаблицаРаздел1СальдоКонечноеПоСчетам);
	
	ЗаполнитьРаздел1ВсегоСальдо(ДокументОбъект, ТаблицаРаздел1СальдоКонечноеПоСчетам);
	
	ЗаполнитьРаздел1СписокДоговоров(ДокументОбъект); // Обязательно вызов последним по счету.
	
КонецПроцедуры

Процедура ЗаполнитьРаздел1ОборотыБезСчетов(ДокументОбъект)
	
	КолонкиГруппировок = "Договор,Валюта,ИФО,Подразделение";
	
	КолонкиСуммирования = ПолучитьКолонкиСуммовыхПоказателейСВсего();
	
	НужныеКолонки = КолонкиГруппировок + "," + КолонкиСуммирования;
	
	Операции = ДокументОбъект.Раздел1Операции.Выгрузить(, НужныеКолонки);
	
	Обороты = РассчитатьОбороты(Операции, КолонкиСуммирования);
	
	ДокументОбъект.Раздел1ОборотыБезСчетов.Загрузить(Обороты);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел1СальдоКонечноеБезСчетов(ДокументОбъект, ТаблицаРаздел1СальдоКонечноеПоСчетам)
	
	КолонкиСуммирования = ПолучитьКолонкиСуммовыхПоказателейСВсего();
	
	КонечныеОстаткиБезСчетов = РассчитатьКонечныеОстаткиБезСчетов(ТаблицаРаздел1СальдоКонечноеПоСчетам, КолонкиСуммирования);

	ДокументОбъект.Раздел1СальдоКонечноеБезСчетов.Загрузить(КонечныеОстаткиБезСчетов);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел1ВсегоСальдо(ДокументОбъект, ТаблицаРаздел1СальдоКонечноеПоСчетам)
	
	КолонкиСуммирования = ПолучитьКолонкиСуммовыхПоказателейСВсего();
	
	Остатки = Новый Структура();
	Остатки.Вставить("НачальныеОстаткиБезСчетов", ДокументОбъект.Раздел1СальдоНачальноеБезСчетов.Выгрузить());
	Остатки.Вставить("КонечныеОстаткиБезСчетов", ДокументОбъект.Раздел1СальдоКонечноеБезСчетов.Выгрузить());
	Остатки.Вставить("КонечныеОстаткиПоСчетам", ТаблицаРаздел1СальдоКонечноеПоСчетам);
	
	ОстаткиВсего = РассчитатьОстаткиВсего(Остатки, КолонкиСуммирования);
	
	ДокументОбъект.Раздел1ВсегоСальдоНачальноеБезСчетов.Загрузить(ОстаткиВсего.НачальныеОстаткиБезСчетов);
	ДокументОбъект.Раздел1ВсегоСальдоКонечноеБезСчетов.Загрузить(ОстаткиВсего.КонечныеОстаткиБезСчетов);
	ДокументОбъект.Раздел1ВсегоСальдоКонечноеПоСчетам.Загрузить(ОстаткиВсего.КонечныеОстаткиПоСчетам);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел1СписокДоговоров(ДокументОбъект)
	
	// Должно вызываться уже после обновления табличных частей оборотов и сальдо конечного,
	// потому что здесь используются сведения из этих табличных частей.
	
	ТаблицаСписокДоговоров = ПолучитьТаблицуСписокДоговоров(ДокументОбъект, 1);
	
	ДокументОбъект.Раздел1СписокДоговоров.Загрузить(ТаблицаСписокДоговоров);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеРаздела2

Процедура ЗаполнитьРаздел2ОперацииПоДаннымРаздела1(ДокументОбъект)
	
	Раздел2Операции = ДокументОбъект.Раздел2Операции;
	Раздел2Операции.Очистить();
	
	ИменаПолей = "Договор,Валюта,СодержаниеОперации,ДокументУчета,НаименованиеДокумента,НомерДокумента,ДатаДокумента";

	Для Каждого СтрокаРаздела1 Из ДокументОбъект.Раздел1Операции Цикл
		НоваяСтрока = Раздел2Операции.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаздела1, ИменаПолей);
		
		ЗаполнитьСуммыСтрокиРаздела2ПоДаннымРаздела1(НоваяСтрока, СтрокаРаздела1);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьРаздел2СальдоПоДаннымРаздела1(ДокументОбъект, ИмяТЧПриемникСальдо, ИмяТЧИсточникСальдо)
	
	СальдоРаздела2 = ДокументОбъект[ИмяТЧПриемникСальдо];
	СальдоРаздела2.Очистить();
	
	КолонкиГруппировок = "Договор,Валюта";
	
	КолонкиСуммирования = ПолучитьКолонкиСуммовыхПоказателейСВсего();
	
	НужныеКолонки = КолонкиГруппировок + "," + КолонкиСуммирования;
	
	СальдоРаздела1 = ДокументОбъект[ИмяТЧИсточникСальдо].Выгрузить(, НужныеКолонки);
	СальдоРаздела1.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	СальдоРаздела1.Сортировать(КолонкиГруппировок);
	
	Для Каждого СтрокаРаздела1 Из СальдоРаздела1 Цикл
		НоваяСтрока = СальдоРаздела2.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаздела1, КолонкиГруппировок);
		
		ЗаполнитьСуммыСтрокиРаздела2ПоДаннымРаздела1(НоваяСтрока, СтрокаРаздела1);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСуммыСтрокиРаздела2ПоДаннымРаздела1(СтрокаРаздела2, СтрокаРаздела1)
	
	СтрокаРаздела2.СуммаВсегоВалДебет		= СтрокаРаздела1.СуммаВсегоВалКредит;
	СтрокаРаздела2.СуммаВсегоРубДебет		= СтрокаРаздела1.СуммаВсегоРубКредит;
	СтрокаРаздела2.СуммаОДВалДебет			= СтрокаРаздела1.СуммаОДВалКредит;
	СтрокаРаздела2.СуммаОДРубДебет			= СтрокаРаздела1.СуммаОДРубКредит;
	СтрокаРаздела2.СуммаПроцентовВалДебет	= СтрокаРаздела1.СуммаПроцентовВалКредит;
	СтрокаРаздела2.СуммаПроцентовРубДебет	= СтрокаРаздела1.СуммаПроцентовРубКредит;
	СтрокаРаздела2.СуммаШтрафовВалДебет		= СтрокаРаздела1.СуммаШтрафовВалКредит;
	СтрокаРаздела2.СуммаШтрафовРубДебет		= СтрокаРаздела1.СуммаШтрафовРубКредит;
	СтрокаРаздела2.СуммаПенейВалДебет		= СтрокаРаздела1.СуммаПенейВалКредит;
	СтрокаРаздела2.СуммаПенейРубДебет		= СтрокаРаздела1.СуммаПенейРубКредит;
	
	СтрокаРаздела2.СуммаВсегоВалКредит		= СтрокаРаздела1.СуммаВсегоВалДебет;
	СтрокаРаздела2.СуммаВсегоРубКредит		= СтрокаРаздела1.СуммаВсегоРубДебет;
	СтрокаРаздела2.СуммаОДВалКредит			= СтрокаРаздела1.СуммаОДВалДебет;
	СтрокаРаздела2.СуммаОДРубКредит			= СтрокаРаздела1.СуммаОДРубДебет;
	СтрокаРаздела2.СуммаПроцентовВалКредит	= СтрокаРаздела1.СуммаПроцентовВалДебет;
	СтрокаРаздела2.СуммаПроцентовРубКредит	= СтрокаРаздела1.СуммаПроцентовРубДебет;
	СтрокаРаздела2.СуммаШтрафовВалКредит	= СтрокаРаздела1.СуммаШтрафовВалДебет;
	СтрокаРаздела2.СуммаШтрафовРубКредит	= СтрокаРаздела1.СуммаШтрафовРубДебет;
	СтрокаРаздела2.СуммаПенейВалКредит		= СтрокаРаздела1.СуммаПенейВалДебет;
	СтрокаРаздела2.СуммаПенейРубКредит		= СтрокаРаздела1.СуммаПенейРубДебет;
	
КонецПроцедуры

Процедура ЗаполнитьРассчитываемыеТабличныеЧастиРаздела2(ДокументОбъект)
	
	ЗаполнитьРаздел2Обороты(ДокументОбъект);
	
	ЗаполнитьРаздел2ВсегоСальдо(ДокументОбъект);
	
	ЗаполнитьРаздел2СписокДоговоров(ДокументОбъект);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел2Обороты(ДокументОбъект)
	
	КолонкиГруппировок = "Договор,Валюта";
	
	КолонкиСуммирования = ПолучитьКолонкиСуммовыхПоказателейСВсего();
	
	НужныеКолонки = КолонкиГруппировок + "," + КолонкиСуммирования;
	
	Операции = ДокументОбъект.Раздел2Операции.Выгрузить(, НужныеКолонки);
	
	Обороты = РассчитатьОбороты(Операции, КолонкиСуммирования, КолонкиГруппировок);
	
	ДокументОбъект.Раздел2Обороты.Загрузить(Обороты);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел2ВсегоСальдо(ДокументОбъект)
	
	КолонкиГруппировок = "Валюта";
	
	КолонкиСуммирования = ПолучитьКолонкиСуммовыхПоказателейСВсего();
	
	НужныеКолонки = КолонкиГруппировок + "," + КолонкиСуммирования;
	
	СальдоВсего = ДокументОбъект.Раздел2СальдоНачальное.Выгрузить(, НужныеКолонки);
	СальдоВсего.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	СальдоВсего.Сортировать(КолонкиГруппировок);
	
	ДокументОбъект.Раздел2ВсегоСальдоНачальное.Загрузить(СальдоВсего);
	
	СальдоВсего = ДокументОбъект.Раздел2СальдоКонечное.Выгрузить(, НужныеКолонки);
	СальдоВсего.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
	СальдоВсего.Сортировать(КолонкиГруппировок);
	
	ДокументОбъект.Раздел2ВсегоСальдоКонечное.Загрузить(СальдоВсего);
	
КонецПроцедуры

Процедура ЗаполнитьРаздел2СписокДоговоров(ДокументОбъект)
	
	// Должно вызываться уже после обновления табличной части оборотов,
	// потому что здесь используются сведения из этой табличной части.
	
	ТаблицаСписокДоговоров = ПолучитьТаблицуСписокДоговоров(ДокументОбъект, 2);
	
	ДокументОбъект.Раздел2СписокДоговоров.Загрузить(ТаблицаСписокДоговоров);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеСписковДоговоров

Функция НовыйТаблицаСписокДоговоров()
	
	ТипСумма = ОбщегоНазначения.ОписаниеТипаЧисло(18, 2, ДопустимыйЗнак.Любой);
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("Договор",						Новый ОписаниеТипов("СправочникСсылка.Договоры"));
	Таблица.Колонки.Добавить("ВидОбязательства",			ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Таблица.Колонки.Добавить("НомерДоговора",				ОбщегоНазначения.ОписаниеТипаСтрока(255));
	Таблица.Колонки.Добавить("ДатаДоговора",				ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	Таблица.Колонки.Добавить("ИдентификаторГосконтракта",	ОбщегоНазначения.ОписаниеТипаСтрока(25));
	Таблица.Колонки.Добавить("КраткоеСодержание",			Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("СальдоНачальноеДебет",		ТипСумма);
	Таблица.Колонки.Добавить("СальдоНачальноеКредит",		ТипСумма);
	Таблица.Колонки.Добавить("ОборотыДебет",				ТипСумма);
	Таблица.Колонки.Добавить("ОборотыКредит",				ТипСумма);
	Таблица.Колонки.Добавить("СальдоКонечноеДебет",			ТипСумма);
	Таблица.Колонки.Добавить("СальдоКонечноеКредит",		ТипСумма);
	
	// Служебные для расчета упорядочивания.
	Таблица.Колонки.Добавить("ИндексСтроки",				ОбщегоНазначения.ОписаниеТипаЧисло(6, 0, ДопустимыйЗнак.Неотрицательный));
	Таблица.Колонки.Добавить("ЭтоНовый",					Новый ОписаниеТипов("Булево"));
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТаблицуСписокДоговоров(ДокументОбъект, НомерРаздела)
	
	ТаблицаСписокДоговоров = НовыйТаблицаСписокДоговоров();
	
	ЗаполнитьСуммыДебетаИКредита(ТаблицаСписокДоговоров, ДокументОбъект, НомерРаздела);
	
	ПрименитьРучнойПорядокСтрок(ТаблицаСписокДоговоров, ДокументОбъект, НомерРаздела);
	
	ЗаполнитьСвойстваНовыхДоговоров(ТаблицаСписокДоговоров, ДокументОбъект, НомерРаздела);
	
	Возврат ТаблицаСписокДоговоров;
	
КонецФункции

Процедура ЗаполнитьСуммыДебетаИКредита(ТаблицаСписокДоговоров, ДокументОбъект, НомерРаздела)
	
	КолонкиСуммовыхПоказателейВсего = "СуммаВсегоРубДебет,СуммаВсегоРубКредит";
	
	ВыгружаемыеКолонки = "Договор," + КолонкиСуммовыхПоказателейВсего;
	
	ИменаТЧ = Новый Массив();
	
	Если НомерРаздела = 1 Тогда
		ИмяТЧСальдоНачальное= "Раздел1СальдоНачальноеБезСчетов";
		ИмяТЧОбороты		= "Раздел1ОборотыБезСчетов";
		ИмяТЧСальдоКонечное	= "Раздел1СальдоКонечноеБезСчетов";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяТЧСальдоНачальное= "Раздел2СальдоНачальное";
		ИмяТЧОбороты		= "Раздел2Обороты";
		ИмяТЧСальдоКонечное	= "Раздел2СальдоКонечное";
	КонецЕсли;
	
	ТаблицаПоказателей = ПолучитьТаблицуЗначений(ДокументОбъект, ИмяТЧСальдоНачальное, ВыгружаемыеКолонки);
	ТаблицаПоказателей.Свернуть("Договор", КолонкиСуммовыхПоказателейВсего);
	ДобавитьСтрокиДебетаИКредита(ТаблицаСписокДоговоров, ТаблицаПоказателей, "СальдоНачальноеДебет", "СальдоНачальноеКредит");
	
	ТаблицаПоказателей = ПолучитьТаблицуЗначений(ДокументОбъект, ИмяТЧОбороты, ВыгружаемыеКолонки);
	ТаблицаПоказателей.Свернуть("Договор", КолонкиСуммовыхПоказателейВсего);
	ДобавитьСтрокиДебетаИКредита(ТаблицаСписокДоговоров, ТаблицаПоказателей, "ОборотыДебет", "ОборотыКредит");
	
	ТаблицаПоказателей = ПолучитьТаблицуЗначений(ДокументОбъект, ИмяТЧСальдоКонечное, ВыгружаемыеКолонки);
	ТаблицаПоказателей.Свернуть("Договор", КолонкиСуммовыхПоказателейВсего);
	ДобавитьСтрокиДебетаИКредита(ТаблицаСписокДоговоров, ТаблицаПоказателей, "СальдоКонечноеДебет", "СальдоКонечноеКредит");
	
	КолонкиСуммирования = "СальдоНачальноеДебет,СальдоНачальноеКредит"
		+ ",ОборотыДебет,ОборотыКредит"
		+ ",СальдоКонечноеДебет,СальдоКонечноеКредит";
	
	КолонкиГруппировки = ПолучитьИменаВсехОстальныхКолонокТаблицы(ТаблицаСписокДоговоров, КолонкиСуммирования);
	
	ТаблицаСписокДоговоров.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	ТаблицаСписокДоговоров.Сортировать("Договор");
	
КонецПроцедуры

Функция ПолучитьТаблицуЗначений(ДокументОбъект, ИмяТаблицы, ВыгружаемыеКолонки)
	
	ТаблицаОбъекта = ДокументОбъект[ИмяТаблицы];
	
	Если ТипЗнч(ТаблицаОбъекта) = Тип("ТаблицаЗначений") Тогда
		Таблица = ТаблицаОбъекта.Скопировать(, ВыгружаемыеКолонки);
	Иначе
		Таблица = ТаблицаОбъекта.Выгрузить(, ВыгружаемыеКолонки);
	КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьИменаВсехОстальныхКолонокТаблицы(Таблица, ИменаИсключаемыхКолонок)
	
	МассивИсключаемых = СтрРазделить(ИменаИсключаемыхКолонок, ", ", Ложь);
	
	ИменаКолонок = Новый Массив();
	
	Для Каждого Колонка Из Таблица.Колонки Цикл
		ИмяКолонки = Колонка.Имя;
		
		Если МассивИсключаемых.Найти(ИмяКолонки) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИменаКолонок.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Возврат СтрСоединить(ИменаКолонок, ",");
	
КонецФункции

Процедура ДобавитьСтрокиДебетаИКредита(ТаблицаСумм, ТаблицаПоказателей, ИмяКолонкиСуммаДебет, ИмяКолонкиСуммаКредит)
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоказателей Цикл
		НоваяСтрока = ТаблицаСумм.Добавить();
		
		НоваяСтрока.Договор = СтрокаТаблицы.Договор;
		НоваяСтрока[ИмяКолонкиСуммаДебет] = СтрокаТаблицы.СуммаВсегоРубДебет;
		НоваяСтрока[ИмяКолонкиСуммаКредит] = СтрокаТаблицы.СуммаВсегоРубКредит;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПрименитьРучнойПорядокСтрок(ТаблицаСписокДоговоров, ДокументОбъект, НомерРаздела)
	
	// Ранее заполнили документ, в нем было несколько договоров,
	// печатная форма была упорядочена по наименованию договоров на дату ПЕЧАТИ.
	//
	// Позже установили новый релиз, обработчик обновления заполнил табличную часть СписокДоговоров
	// с упорядочиванием по наименованию договоров на дату ОБНОВЛЕНИЯ.
	//
	// Если в период времени от печати документа до установки нового релиза было изменено наименование договора,
	// то возможно заполнение табличной части СписокДоговоров в несколько ином порядке, по сравнению
	// с прежней печатной формой. В этом случае автоматически повлиять на порядок строк табличной части никак нельзя.
	//
	// Если же заполнение списка договоров происходит не из обработчика обновлениия, а при обычной записи документа,
	// то табличная часть СписокДоговоров может быть уже заполнена. Например, заполнена ранее обработчиком обновления,
	// или во время предыдущей записи документа. Порядок строк мог быть настроен вручную и необходимо его сохранить
	// при повторной записи документа. В противном случае при каждой записи документа список договоров будет автоматически
	// сортироваться по наименованию, и будут теряться сортировки пользователя.
	
	Если НомерРаздела = 1 Тогда
		ИмяТЧ = "Раздел1СписокДоговоров";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяТЧ = "Раздел2СписокДоговоров";
	КонецЕсли;
	
	ТЧСписокДоговоров = ДокументОбъект[ИмяТЧ];
	
	ТекущийПорядокДоговоров = ТЧСписокДоговоров.Выгрузить(, "Договор").ВыгрузитьКолонку("Договор");
	
	ИндексНовойСтроки = ТаблицаСписокДоговоров.Количество();
	
	Для Каждого СтрокаТаблицы Из ТаблицаСписокДоговоров Цикл
		ИндексСтроки = ТекущийПорядокДоговоров.Найти(СтрокаТаблицы.Договор);
		
		Если ИндексСтроки = Неопределено Тогда
			ИндексСтроки = ИндексНовойСтроки;
			
			ИндексНовойСтроки = ИндексНовойСтроки + 1;
			
			СтрокаТаблицы.ЭтоНовый = Истина;
		КонецЕсли;
		
		СтрокаТаблицы.ИндексСтроки = ИндексСтроки;
	КонецЦикла;
	
	ТаблицаСписокДоговоров.Сортировать("ИндексСтроки");
	
КонецПроцедуры

Процедура ЗаполнитьСвойстваНовыхДоговоров(ТаблицаСписокДоговоров, ДокументОбъект, НомерРаздела)
	
	// Для новых договоров (ранее отсутствовали в табличной части) считываются актуальные значения реквизитов.
	// Для прежних договоров (уже присутствовали в табличной части) реквизиты не обновляются.
	
	Если НомерРаздела = 1 Тогда
		ИмяТЧ = "Раздел1СписокДоговоров";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяТЧ = "Раздел2СписокДоговоров";
	КонецЕсли;
	
	ТЧСписокДоговоров = ДокументОбъект[ИмяТЧ];
	
	Поиск = Новый Структура("ЭтоНовый", Истина);
	
	СписокДоговоров = ТаблицаСписокДоговоров.Скопировать(Поиск, "Договор").ВыгрузитьКолонку("Договор");
	
	СведенияДоговоров = ПрочитатьСведенияДоговоров(СписокДоговоров);
	СведенияДоговоров.Индексы.Добавить("Ссылка");
	
	ПоискСведенийДоговора = Новый Структура("Ссылка");
	
	ИменаСвойств = "ВидОбязательства,НомерДоговора,ДатаДоговора,КраткоеСодержание,ИдентификаторГосконтракта";
	
	Для Каждого СтрокаТаблицы Из ТаблицаСписокДоговоров Цикл
		Если СтрокаТаблицы.ЭтоНовый Тогда
			Договор = СтрокаТаблицы.Договор;
			
			Если Не ЗначениеЗаполнено(Договор) Тогда
				Продолжить;
			КонецЕсли;
			
			ПоискСведенийДоговора.Ссылка = Договор;
			
			МассивСтрок = СведенияДоговоров.НайтиСтроки(ПоискСведенийДоговора);
			
			Если МассивСтрок.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, МассивСтрок[0], ИменаСвойств);
			КонецЕсли;
		Иначе
			СтрокаТЧ = ТЧСписокДоговоров[СтрокаТаблицы.ИндексСтроки];
			
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаТЧ, ИменаСвойств);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПрочитатьСведенияДоговоров(СписокДоговоров)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокДоговоров", СписокДоговоров);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	Ссылка											КАК Ссылка,
	|	ВидОбязательства								КАК ВидОбязательства,
	|	ДатаДоговора									КАК ДатаДоговора,
	|	НомерДоговора									КАК НомерДоговора,
	|	КраткоеСодержание								КАК КраткоеСодержание,
	|	ЕСТЬNULL(ГосударственныйКонтрактПоГОЗ.Код, """")	КАК ИдентификаторГосконтракта
	|ИЗ
	|	Справочник.Договоры
	|ГДЕ
	|	Ссылка В (&СписокДоговоров)";
	
	УстановитьПривилегированныйРежим(Истина);
	СведенияДоговоров = Запроспоиск.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СведенияДоговоров;
	
КонецФункции

Функция ПолучитьТаблицуСписокДоговоровПриЗаполненииПоДаннымБухУчета(Обороты, Остатки)
	
	СтруктураОбъект = Новый Структура();
	СтруктураОбъект.Вставить("Раздел1СальдоНачальноеБезСчетов",	Остатки.НачальныеОстаткиБезСчетов);
	СтруктураОбъект.Вставить("Раздел1ОборотыБезСчетов",			Обороты);
	СтруктураОбъект.Вставить("Раздел1СальдоКонечноеБезСчетов",	Остатки.КонечныеОстаткиБезСчетов);
	
	ТаблицаСписокДоговоров = НовыйТаблицаСписокДоговоров();
	
	ЗаполнитьСуммыДебетаИКредита(ТаблицаСписокДоговоров, СтруктураОбъект, 1);
	
	ЗаполнитьСвойстваВсехДоговоров(ТаблицаСписокДоговоров);
	
	Возврат ТаблицаСписокДоговоров;
	
КонецФункции

Процедура ЗаполнитьСвойстваВсехДоговоров(ТаблицаСписокДоговоров)
	
	СписокДоговоров = ТаблицаСписокДоговоров.ВыгрузитьКолонку("Договор");
	
	СведенияДоговоров = ПрочитатьСведенияДоговоров(СписокДоговоров);
	СведенияДоговоров.Индексы.Добавить("Ссылка");
	
	ПоискСведенийДоговора = Новый Структура("Ссылка");
	
	ИменаСвойств = "ВидОбязательства,НомерДоговора,ДатаДоговора,КраткоеСодержание,ИдентификаторГосконтракта";
	
	Для Каждого СтрокаТаблицы Из ТаблицаСписокДоговоров Цикл
		Договор = СтрокаТаблицы.Договор;
		
		Если Не ЗначениеЗаполнено(Договор) Тогда
			Продолжить;
		КонецЕсли;
		
		ПоискСведенийДоговора.Ссылка = Договор;
		
		МассивСтрок = СведенияДоговоров.НайтиСтроки(ПоискСведенийДоговора);
		
		Если МассивСтрок.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, МассивСтрок[0], ИменаСвойств);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Печать

Функция НовыйТабличныйДокумент()
	
	КлючПараметровПечати = "ПечатьФормы0510477";
	
	ТабДокумент = Новый ТабличныйДокумент();
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.КлючПараметровПечати = КлючПараметровПечати;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьФормы0510477(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	ОбщийТабДокумент = НовыйТабличныйДокумент();
	
	ТиповыеПараметры = Новый Структура();
	ТиповыеПараметры.Вставить("МассивОбъектов",			МассивОбъектов);
	ТиповыеПараметры.Вставить("ПараметрыПечати",		ПараметрыПечати);
	ТиповыеПараметры.Вставить("КоллекцияПечатныхФорм",	КоллекцияПечатныхФорм);
	ТиповыеПараметры.Вставить("ОбъектыПечати",			ОбъектыПечати);
	ТиповыеПараметры.Вставить("ПараметрыВывода",		ПараметрыВывода);
	
	Данные = ПолучитьДанныеДляПечати0510477(МассивОбъектов);
	
	ОбластиМакета = ПолучитьОбластиМакета0510477();
	
	ПервыйДокумент = Истина;
	
	ВыборкаШапка = Данные.Выборки.Шапки;
	
	Пока ВыборкаШапка.Следующий() Цикл
		Если МассивОбъектов.Найти(ВыборкаШапка.Ссылка) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабДокумент = СформироватьПечатнуюФорму0510477(Данные, ВыборкаШапка, ОбластиМакета, ТиповыеПараметры);
		
		Если Не ПервыйДокумент Тогда
			ОбщийТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ОбщийТабДокумент.ВысотаТаблицы + 1;
		
		ОбщийТабДокумент.Вывести(ТабДокумент);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ОбщийТабДокумент, 
			НомерСтрокиНачало,
			ОбъектыПечати,
			ВыборкаШапка.Ссылка);
			
		ПервыйДокумент = Ложь;
	КонецЦикла;
	
	// Колонтитулы
	ОбщийТабДокумент.ВерхнийКолонтитул.Выводить				= Истина;
	ОбщийТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница	= 2;
	ОбщийТабДокумент.ВерхнийКолонтитул.ТекстСправа			= НСтр("ru='Форма 0510477 с.[&НомерСтраницы]'");
	
	Возврат ОбщийТабДокумент;
	
КонецФункции

Функция ПолучитьОбластиМакета0510477()
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктСверкиРасчетов.ПФ_MXL_Ф0510477");
	
	ОбластиМакета = Новый Структура();
	
	ОбластиМакета.Вставить("Заголовок",										Макет.ПолучитьОбласть("Заголовок"));

	ОбластиМакета.Вставить("Раздел1Заголовок",								Макет.ПолучитьОбласть("Раздел1Заголовок"));
	
	// Начальное сальдо всего
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоНачальноеПерваяСтрока",		Макет.ПолучитьОбласть("Раздел1ВсегоСальдоНачальноеПерваяСтрока"));
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоНачальноеОчереднаяСтрока",	Макет.ПолучитьОбласть("Раздел1ВсегоСальдоНачальноеОчереднаяСтрока"));
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоНачальноеПодвал",				Макет.ПолучитьОбласть("Раздел1ВсегоСальдоНачальноеПодвал"));
	
	ОбластиМакета.Вставить("ШапкаТаблицы",									Макет.ПолучитьОбласть("ШапкаТаблицы"));
	ОбластиМакета.Вставить("ЗаголовокДоговора",								Макет.ПолучитьОбласть("ЗаголовокДоговора"));
	
	// Начальное сальдо по договору
	ОбластиМакета.Вставить("СальдоНачальноеПерваяСтрока",					Макет.ПолучитьОбласть("СальдоНачальноеПерваяСтрока"));
	ОбластиМакета.Вставить("СальдоНачальноеОчереднаяСтрока",				Макет.ПолучитьОбласть("СальдоНачальноеОчереднаяСтрока"));
	ОбластиМакета.Вставить("СальдоНачальноеПодвал",							Макет.ПолучитьОбласть("СальдоНачальноеПодвал"));
	
	// Операции
	ОбластиМакета.Вставить("ОперацииЗаголовок",								Макет.ПолучитьОбласть("ОперацииЗаголовок"));
	ОбластиМакета.Вставить("ОперацииСтрока",								Макет.ПолучитьОбласть("ОперацииСтрока"));
	
	// Обороты по договору
	ОбластиМакета.Вставить("ОборотыПерваяСтрока",							Макет.ПолучитьОбласть("ОборотыПерваяСтрока"));
	ОбластиМакета.Вставить("ОборотыОчереднаяСтрока",						Макет.ПолучитьОбласть("ОборотыОчереднаяСтрока"));
	ОбластиМакета.Вставить("ОборотыПодвал",									Макет.ПолучитьОбласть("ОборотыПодвал"));
	
	// Конечное сальдо по договору
	ОбластиМакета.Вставить("СальдоКонечноеПерваяСтрока",					Макет.ПолучитьОбласть("СальдоКонечноеПерваяСтрока"));
	ОбластиМакета.Вставить("СальдоКонечноеОчереднаяСтрока",					Макет.ПолучитьОбласть("СальдоКонечноеОчереднаяСтрока"));
	
	ОбластиМакета.Вставить("СальдоКонечноеПоСчетамЗаголовок",				Макет.ПолучитьОбласть("СальдоКонечноеПоСчетамЗаголовок"));
	ОбластиМакета.Вставить("СальдоКонечноеПоСчетамСтрока",					Макет.ПолучитьОбласть("СальдоКонечноеПоСчетамСтрока"));
	ОбластиМакета.Вставить("СальдоКонечноеПодвал",							Макет.ПолучитьОбласть("СальдоКонечноеПодвал"));
	
	// Конечное сальдо всего
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоКонечноеБезСчетовПерваяСтрока",	Макет.ПолучитьОбласть("Раздел1ВсегоСальдоКонечноеБезСчетовПерваяСтрока"));
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоКонечноеБезСчетовОчереднаяСтрока",Макет.ПолучитьОбласть("Раздел1ВсегоСальдоКонечноеБезСчетовОчереднаяСтрока"));
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоКонечноеПоСчетамЗаголовок",		Макет.ПолучитьОбласть("Раздел1ВсегоСальдоКонечноеПоСчетамЗаголовок"));
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоКонечноеПоСчетамСтрока",			Макет.ПолучитьОбласть("Раздел1ВсегоСальдоКонечноеПоСчетамСтрока"));
	ОбластиМакета.Вставить("Раздел1ВсегоСальдоКонечноеПодвал",					Макет.ПолучитьОбласть("Раздел1ВсегоСальдоКонечноеПодвал"));
	
	ОбластиМакета.Вставить("Раздел1ЗаголовокПодписей",							Макет.ПолучитьОбласть("Раздел1ЗаголовокПодписей"));
	ОбластиМакета.Вставить("Раздел2ЗаголовокПодписей",							Макет.ПолучитьОбласть("Раздел2ЗаголовокПодписей"));
	ОбластиМакета.Вставить("ПодписьБезТелефона",								Макет.ПолучитьОбласть("ПодписьБезТелефона"));
	ОбластиМакета.Вставить("ПодписьСТелефоном",									Макет.ПолучитьОбласть("ПодписьСТелефоном"));
	ОбластиМакета.Вставить("ДатаПодписи",										Макет.ПолучитьОбласть("ДатаПодписи"));
	
	// Раздел 2
	ОбластиМакета.Вставить("Раздел2Заголовок",									Макет.ПолучитьОбласть("Раздел2Заголовок"));
	ОбластиМакета.Вставить("Раздел2ВсегоСальдоНачальноеПерваяСтрока",			Макет.ПолучитьОбласть("Раздел2ВсегоСальдоНачальноеПерваяСтрока"));
	ОбластиМакета.Вставить("Раздел2ВсегоСальдоНачальноеОчереднаяСтрока",		Макет.ПолучитьОбласть("Раздел2ВсегоСальдоНачальноеОчереднаяСтрока"));
	ОбластиМакета.Вставить("Раздел2ВсегоСальдоНачальноеПодвал",					Макет.ПолучитьОбласть("Раздел2ВсегоСальдоНачальноеПодвал"));
	ОбластиМакета.Вставить("Раздел2ВсегоСальдоКонечноеБезСчетовПерваяСтрока",	Макет.ПолучитьОбласть("Раздел2ВсегоСальдоКонечноеБезСчетовПерваяСтрока"));
	ОбластиМакета.Вставить("Раздел2ВсегоСальдоКонечноеБезСчетовОчереднаяСтрока",Макет.ПолучитьОбласть("Раздел2ВсегоСальдоКонечноеБезСчетовОчереднаяСтрока"));
	ОбластиМакета.Вставить("Раздел2ВсегоСальдоКонечноеПодвал",					Макет.ПолучитьОбласть("Раздел2ВсегоСальдоКонечноеПодвал"));
	
	Возврат ОбластиМакета;
	
КонецФункции

Функция ПолучитьДанныеДляПечати0510477(МассивОбъектов)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("МассивСсылок", МассивОбъектов);
	ЗапросПоиск.Текст = ПолучитьТекстЗапросаПечать0510477();
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = ЗапросПоиск.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Данные = Новый Структура();
	Данные.Вставить("Выборки", Новый Структура());
	
	Данные.Выборки.Вставить("Шапки",								РезультатыЗапроса[0].Выбрать());
	Данные.Выборки.Вставить("Раздел1СписокДоговоров",				РезультатыЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1Операции",						РезультатыЗапроса[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1СальдоНачальноеБезСчетов",		РезультатыЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1СальдоКонечноеБезСчетов",		РезультатыЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1ОборотыБезСчетов",				РезультатыЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1СальдоКонечноеПоСчетам",		РезультатыЗапроса[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1ВсегоСальдоНачальноеБезСчетов",	РезультатыЗапроса[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1ВсегоСальдоКонечноеБезСчетов",	РезультатыЗапроса[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел1ВсегоСальдоКонечноеПоСчетам",	РезультатыЗапроса[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Данные.Выборки.Вставить("Раздел2СписокДоговоров",				РезультатыЗапроса[10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел2Операции",						РезультатыЗапроса[11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел2СальдоНачальное",				РезультатыЗапроса[12].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел2СальдоКонечное",				РезультатыЗапроса[13].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел2Обороты",						РезультатыЗапроса[14].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел2ВсегоСальдоНачальное",			РезультатыЗапроса[15].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	Данные.Выборки.Вставить("Раздел2ВсегоСальдоКонечное",			РезультатыЗапроса[16].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Данные.Вставить("ДополнительныеПараметры", ПолучитьДополнительныеПараметрыПечати());
	
	Данные.Вставить("СведенияУчреждений", УправлениеПечатьюБГУ.ОбщиеСведенияДокументовДляПечати(МассивОбъектов));
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьДополнительныеПараметрыПечати()
	
	СтруктураЗаполненияБезСчетов = Новый Структура();
	СтруктураЗаполненияБезСчетов.Вставить("КодВалюты", НСтр("ru='—'"));
	СтруктураЗаполненияБезСчетов.Вставить("СуммаВсегоВалДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаОДВалДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПроцентовВалДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаШтрафовВалДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПенейВалДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаВсегоРубДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаОДРубДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПроцентовРубДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаШтрафовРубДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПенейРубДебет", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаВсегоВалКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаОДВалКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПроцентовВалКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаШтрафовВалКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПенейВалКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаВсегоРубКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаОДРубКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПроцентовРубКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаШтрафовРубКредит", 0);
	СтруктураЗаполненияБезСчетов.Вставить("СуммаПенейРубКредит", 0);
	
	СтруктураЗаполненияПоСчетам = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураЗаполненияБезСчетов);
	СтруктураЗаполненияПоСчетам.Вставить("НомерСчета", НСтр("ru='—'"));
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("СтруктураЗаполненияБезСчетов", СтруктураЗаполненияБезСчетов);
	ДополнительныеПараметры.Вставить("СтруктураЗаполненияПоСчетам", СтруктураЗаполненияПоСчетам);
	ДополнительныеПараметры.Вставить("ПрочеркиПустыхПолей", ПолучитьНастройкиПрочерковПустыхПолей());
	
	ДополнительныеПараметры.Вставить("ОбъединятьГрафу1ПоВысоте", Истина);
	ДополнительныеПараметры.Вставить("КоличествоСтрокПриНачалеВывода", 0);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция ПолучитьНастройкиПрочерковПустыхПолей()
	
	Разделитель = ", ";
	
	ИменаПолей = Новый Структура();
	ИменаПолей.Вставить("ЗаголовокДоговора", СтрРазделить("НаименованиеДоговора,НомерДоговора,ДатаДоговора,ИдентификаторГосконтракта,ПредметДоговора", Разделитель));
	ИменаПолей.Вставить("КодВалюты", СтрРазделить("КодВалюты", Разделитель));
	ИменаПолей.Вставить("НомерСчетаКодВалюты", СтрРазделить("НомерСчета,КодВалюты", Разделитель));
	ИменаПолей.Вставить("ОперацииПоДоговору", СтрРазделить("СодержаниеОперации,КодВалюты,НаименованиеДокумента,НомерДокумента,ДатаДокумента", Разделитель));
	
	Возврат ИнвентаризацияСервер.ПолучитьНастройкиПрочерковПустыхПолей(ИменаПолей);
	
КонецФункции

Функция ПолучитьТекстЗапросаПечать0510477()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные шапок
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка									КАК Ссылка,
	|	Док.Дата									КАК Дата,
	|	Док.Номер									КАК Номер,
	|	Док.Организация								КАК Организация,
	|	Док.Подразделение							КАК Подразделение,
	|	Док.ИФО										КАК ИФО,
	|	Док.Контрагент								КАК Контрагент,
	|	Док.ИННКонтрагента							КАК ИНН,
	|	Док.КППКонтрагента							КАК КПП,
	|	Док.ОГРНКонтрагента							КАК ОГРН,
	|	Док.ДатаНачала								КАК ДатаНачала,
	|	Док.ДатаОкончания							КАК ДатаОкончания,
	|	Док.ОтветственныйИсполнитель				КАК ОтветственныйИсполнитель,
	|	Док.ГлавныйБухгалтер						КАК ГлавныйБухгалтер,
	|	Док.Руководитель							КАК Руководитель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СправочникКонтрагенты.ВидКонтрагента, ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И ЕСТЬNULL(СправочникКонтрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное, """") <> """" ТОГДА
	|			// Для юр.лиц возможно указание официального наименования
	|			ВЫРАЗИТЬ(СправочникКонтрагенты.ЮридическоеФизическоеЛицо.НаименованиеПолное КАК СТРОКА(512))
	|		КОГДА ЕСТЬNULL(СправочникКонтрагенты.НаименованиеСокращенное, """") <> """" ТОГДА
	|			СправочникКонтрагенты.НаименованиеСокращенное
	|		ИНАЧЕ
	|			ЕСТЬNULL(СправочникКонтрагенты.Наименование, """")
	|	КОНЕЦ										КАК НаименованиеКонтрагента,
	|	Док.РуководительКонтрагентаДолжность		КАК РуководительКонтрагентаДолжность,
	|	Док.РуководительКонтрагентаФИО				КАК РуководительКонтрагентаФИО,
	|	Док.ГлавБухКонтрагентаДолжность				КАК ГлавБухКонтрагентаДолжность,
	|	Док.ГлавБухКонтрагентаФИО					КАК ГлавБухКонтрагентаФИО,
	|	Док.ИсполнительКонтрагентаДолжность			КАК ИсполнительКонтрагентаДолжность,
	|	Док.ИсполнительКонтрагентаФИО				КАК ИсполнительКонтрагентаФИО,
	|	Док.ИсполнительКонтрагентаНомерТелефона		КАК ИсполнительКонтрагентаНомерТелефона,
	|	Док.ИсполнительКонтрагентаЭлектронныйАдрес	КАК ИсполнительКонтрагентаЭлектронныйАдрес
	|ИЗ
	|	Документ.АктСверкиРасчетов КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СправочникКонтрагенты
	|		ПО Док.Контрагент = СправочникКонтрагенты.Ссылка
	|ГДЕ
	|	Док.Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные табличных частей Раздел1СписокДоговоров
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	ВидОбязательства			КАК НаименованиеДоговора,
	|	НомерДоговора				КАК НомерДоговора,
	|	ДатаДоговора				КАК ДатаДоговора,
	|	ИдентификаторГосконтракта	КАК ИдентификаторГосконтракта,
	|	КраткоеСодержание			КАК ПредметДоговора,
	|	СальдоНачальноеДебет		КАК СальдоНачальноеДебет,
	|	СальдоНачальноеКредит		КАК СальдоНачальноеКредит,
	|	ОборотыДебет				КАК ОборотыДебет,
	|	ОборотыКредит				КАК ОборотыКредит,
	|	СальдоКонечноеДебет			КАК СальдоКонечноеДебет,
	|	СальдоКонечноеКредит		КАК СальдоКонечноеКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СписокДоговоров
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Данные табличных частей Раздел1Операции
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	СодержаниеОперации			КАК СодержаниеОперации,
	|	ДокументУчета				КАК ДокументУчета,
	|	НаименованиеДокумента		КАК НаименованиеДокумента,
	|	НомерДокумента				КАК НомерДокумента,
	|	ДатаДокумента				КАК ДатаДокумента,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1Операции
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Данные табличных частей Раздел1СальдоНачальноеБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СальдоНачальноеБезСчетов
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Данные табличных частей Раздел1СальдоКонечноеБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СальдоКонечноеБезСчетов
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [5]. Данные табличных частей Раздел1ОборотыБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1ОборотыБезСчетов
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [6]. Данные табличных частей Раздел1СальдоКонечноеПоСчетам
	|//
	|ВЫБРАТЬ
	|	Ссылка								КАК Ссылка,
	|	Договор								КАК Договор,
	|	Валюта								КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")			КАК КодВалюты,
	|	ИФО									КАК ИФО,
	|	Подразделение						КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(КФО)					КАК КФО,
	|	ЕСТЬNULL(Счет.Представление, """")	КАК Счет,
	|	ЕСТЬNULL(Счет.УчетПоКПС, ЛОЖЬ)		КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, ЛОЖЬ)		КАК СчетУчетПоКЭК,
	|	ЕСТЬNULL(КПС.Представление, """")		КАК КПС,
	|	ЕСТЬNULL(КЭК.Представление, """")		КАК КЭК,
	|	СуммаОДВалДебет						КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет						КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет				КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет				КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет				КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет				КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет					КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет					КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет					КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет					КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит					КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит					КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит				КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит				КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит				КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит				КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит					КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит					КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит					КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит					КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СальдоКонечноеПоСчетам
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [7]. Данные табличных частей Раздел1ВсегоСальдоНачальноеБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1ВсегоСальдоНачальноеБезСчетов
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [8]. Данные табличных частей Раздел1ВсегоСальдоКонечноеБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	ИФО							КАК ИФО,
	|	Подразделение				КАК Подразделение,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1ВсегоСальдоКонечноеБезСчетов
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [9]. Данные табличных частей Раздел1ВсегоСальдоКонечноеПоСчетам
	|//
	|ВЫБРАТЬ
	|	Ссылка								КАК Ссылка,
	|	Валюта								КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")			КАК КодВалюты,
	|	ИФО									КАК ИФО,
	|	Подразделение						КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(КФО)					КАК КФО,
	|	ЕСТЬNULL(Счет.Представление, """")	КАК Счет,
	|	ЕСТЬNULL(Счет.УчетПоКПС, ЛОЖЬ)		КАК СчетУчетПоКПС,
	|	ЕСТЬNULL(Счет.УчетПоКЭК, ЛОЖЬ)		КАК СчетУчетПоКЭК,
	|	ЕСТЬNULL(КПС.Представление, """")		КАК КПС,
	|	ЕСТЬNULL(КЭК.Представление, """")		КАК КЭК,
	|	СуммаОДВалДебет						КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет						КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет				КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет				КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет				КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет				КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет					КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет					КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет					КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет					КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит					КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит					КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит				КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит				КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит				КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит				КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит					КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит					КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит					КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит					КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1ВсегоСальдоКонечноеПоСчетам
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [10]. Данные табличных частей Раздел2СписокДоговоров
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	ВидОбязательства			КАК НаименованиеДоговора,
	|	НомерДоговора				КАК НомерДоговора,
	|	ДатаДоговора				КАК ДатаДоговора,
	|	ИдентификаторГосконтракта	КАК ИдентификаторГосконтракта,
	|	КраткоеСодержание			КАК ПредметДоговора,
	|	СальдоНачальноеДебет		КАК СальдоНачальноеДебет,
	|	СальдоНачальноеКредит		КАК СальдоНачальноеКредит,
	|	ОборотыДебет				КАК ОборотыДебет,
	|	ОборотыКредит				КАК ОборотыКредит,
	|	СальдоКонечноеДебет			КАК СальдоКонечноеДебет,
	|	СальдоКонечноеКредит		КАК СальдоКонечноеКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел2СписокДоговоров
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [11]. Данные табличных частей Раздел2Операции
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	СодержаниеОперации			КАК СодержаниеОперации,
	|	ДокументУчета				КАК ДокументУчета,
	|	НаименованиеДокумента		КАК НаименованиеДокумента,
	|	НомерДокумента				КАК НомерДокумента,
	|	ДатаДокумента				КАК ДатаДокумента,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел2Операции
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [12]. Данные табличных частей Раздел2СальдоНачальное
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел2СальдоНачальное
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [13]. Данные табличных частей Раздел2СальдоКонечное
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел2СальдоКонечное
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [14]. Данные табличных частей Раздел2Обороты
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел2Обороты
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [15]. Данные табличных частей Раздел2ВсегоСальдоНачальное
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел2ВсегоСальдоНачальное
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [16]. Данные табличных частей Раздел2ВсегоСальдоКонечное
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Валюта						КАК Валюта,
	|	ЕСТЬNULL(Валюта.Код, """")	КАК КодВалюты,
	|	СуммаОДВалДебет				КАК СуммаОДВалДебет,
	|	СуммаОДРубДебет				КАК СуммаОДРубДебет,
	|	СуммаПроцентовВалДебет		КАК СуммаПроцентовВалДебет,
	|	СуммаПроцентовРубДебет		КАК СуммаПроцентовРубДебет,
	|	СуммаШтрафовВалДебет		КАК СуммаШтрафовВалДебет,
	|	СуммаШтрафовРубДебет		КАК СуммаШтрафовРубДебет,
	|	СуммаПенейВалДебет			КАК СуммаПенейВалДебет,
	|	СуммаПенейРубДебет			КАК СуммаПенейРубДебет,
	|	СуммаВсегоВалДебет			КАК СуммаВсегоВалДебет,
	|	СуммаВсегоРубДебет			КАК СуммаВсегоРубДебет,
	|	СуммаОДВалКредит			КАК СуммаОДВалКредит,
	|	СуммаОДРубКредит			КАК СуммаОДРубКредит,
	|	СуммаПроцентовВалКредит		КАК СуммаПроцентовВалКредит,
	|	СуммаПроцентовРубКредит		КАК СуммаПроцентовРубКредит,
	|	СуммаШтрафовВалКредит		КАК СуммаШтрафовВалКредит,
	|	СуммаШтрафовРубКредит		КАК СуммаШтрафовРубКредит,
	|	СуммаПенейВалКредит			КАК СуммаПенейВалКредит,
	|	СуммаПенейРубКредит			КАК СуммаПенейРубКредит,
	|	СуммаВсегоВалКредит			КАК СуммаВсегоВалКредит,
	|	СуммаВсегоРубКредит			КАК СуммаВсегоРубКредит
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел2ВсегоСальдоКонечное
	|ГДЕ
	|	Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки ВОЗР
	|ИТОГИ
	|ПО
	|	Ссылка";
	
КонецФункции

Функция ПолучитьВыборкуПоТекущемуДокументу(СтрокаШапки, ОбщаяВыборкаТабличнойЧасти)
	
	ПоискТекущегоДокумента = Новый Структура("Ссылка", СтрокаШапки.Ссылка);
	
	ОбщаяВыборкаТабличнойЧасти.Сбросить();
	ОбщаяВыборкаТабличнойЧасти.НайтиСледующий(ПоискТекущегоДокумента);
	
	Возврат ОбщаяВыборкаТабличнойЧасти.Выбрать();
	
КонецФункции

Функция ПолучитьВыборкуПоТекущемуДокументуИДоговору(СтрокаШапки, ОбщаяВыборкаТабличнойЧасти, ВыборкаСведенияДоговора)
	
	ПоискТекущегоДокумента = Новый Структура("Ссылка", СтрокаШапки.Ссылка);
	
	ОбщаяВыборкаТабличнойЧасти.Сбросить();
	ОбщаяВыборкаТабличнойЧасти.НайтиСледующий(ПоискТекущегоДокумента);
	
	ПоискТекущегоДоговора = Новый Структура("Договор", ВыборкаСведенияДоговора.Договор);
	
	Выборка = ОбщаяВыборкаТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.НайтиСледующий(ПоискТекущегоДоговора);
	
	Возврат Выборка.Выбрать();
	
КонецФункции

Функция СформироватьПечатнуюФорму0510477(Данные, СтрокаШапки, ОбластиМакета, ТиповыеПараметры)
	
	ТабДокумент = НовыйТабличныйДокумент();
	
	ВывестиТитул(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета);
	
	ВывестиРаздел1(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ВывестиРаздел2(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета);
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ВывестиТитул(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ЗначенияПараметров = Новый Структура();
	
	УправлениеПечатьюБГУ.ЗаполнитьПараметрыСведенийУчреждения(ЗначенияПараметров, СтрокаШапки.Ссылка, Данные.СведенияУчреждений);
	
	Область = ОбластиМакета.Заголовок;
	Область.Параметры.Заполнить(СтрокаШапки);
	Область.Параметры.Заполнить(ЗначенияПараметров);
	Область.Параметры.Заполнить(ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(СтрокаШапки.Дата, Истина));
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

#Область Раздел1

Процедура ВывестиРаздел1(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ТабДокумент.Вывести(ОбластиМакета.Раздел1Заголовок);
	
	ТабДокумент.Вывести(ОбластиМакета.ШапкаТаблицы);
	
	ВывестиВсегоСальдоНачальное(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, 1);
	
	ВывестиСписокДоговоров(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, 1);
	
	ВывестиВсегоСальдоКонечное(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, 1);
	
	ВывестиПодписиРаздела1(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета);
	
КонецПроцедуры

Процедура ВывестиПодписиРаздела1(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ТабДокументПодписей = НовыйТабличныйДокумент();
	
	ТабДокументПодписей.Вывести(ОбластиМакета.Раздел1ЗаголовокПодписей);
	
	ВывестиПодписьРуководителяРаздела1(ТабДокументПодписей, Данные, СтрокаШапки, ОбластиМакета);
	
	ВывестиПодписьГлавбухаРаздела1(ТабДокументПодписей, Данные, СтрокаШапки, ОбластиМакета);
	
	ВывестиПодписьОтветственногоИсполнителяРаздела1(ТабДокументПодписей, Данные, СтрокаШапки, ОбластиМакета);
	
	ТабДокументПодписей.Вывести(ОбластиМакета.ДатаПодписи);
	
	Если Не ТабДокумент.ПроверитьВывод(ТабДокументПодписей) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ТабДокументПодписей);
	
КонецПроцедуры

Процедура ВывестиПодписьРуководителяРаздела1(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ЗначенияПараметров = ИнвентаризацияСервер.ПолучитьСведенияОтветственногоИсполнителяДляПечати(
		СтрокаШапки.Руководитель, СтрокаШапки.Дата);
		
	ЗначенияПараметров.Вставить("Заголовок", НСтр("ru='Руководитель (уполномоченное им лицо)'"));
	
	Область = ОбластиМакета.ПодписьБезТелефона;
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

Процедура ВывестиПодписьГлавбухаРаздела1(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ЗначенияПараметров = ИнвентаризацияСервер.ПолучитьСведенияОтветственногоИсполнителяДляПечати(
		СтрокаШапки.ГлавныйБухгалтер, СтрокаШапки.Дата);
		
	ЗначенияПараметров.Вставить("Заголовок", НСтр("ru='Главный бухгалтер'"));
	
	Область = ОбластиМакета.ПодписьБезТелефона;
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

Процедура ВывестиПодписьОтветственногоИсполнителяРаздела1(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ЗначенияПараметров = ИнвентаризацияСервер.ПолучитьСведенияОтветственногоИсполнителяДляПечати(
		СтрокаШапки.ОтветственныйИсполнитель, СтрокаШапки.Дата);
		
	ЗначенияПараметров.Вставить("Заголовок", НСтр("ru='Ответственный исполнитель бухгалтерской службы'"));
	
	Область = ОбластиМакета.ПодписьСТелефоном;
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

#КонецОбласти

#Область Раздел2

Процедура ВывестиРаздел2(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ТабДокумент.Вывести(ОбластиМакета.Раздел2Заголовок);
	
	ТабДокумент.Вывести(ОбластиМакета.ШапкаТаблицы);
	
	ВывестиВсегоСальдоНачальное(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, 2);
	
	ВывестиСписокДоговоров(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, 2);
	
	ВывестиВсегоСальдоКонечное(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, 2);
	
	ВывестиПодписиРаздела2(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета);
	
КонецПроцедуры

Процедура ВывестиПодписиРаздела2(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ТабДокументПодписей = НовыйТабличныйДокумент();
	
	ТабДокументПодписей.Вывести(ОбластиМакета.Раздел2ЗаголовокПодписей);
	
	ВывестиПодписьРуководителяРаздела2(ТабДокументПодписей, Данные, СтрокаШапки, ОбластиМакета);
	
	ВывестиПодписьГлавбухаРаздела2(ТабДокументПодписей, Данные, СтрокаШапки, ОбластиМакета);
	
	ВывестиПодписьИсполнителяРаздела2(ТабДокументПодписей, Данные, СтрокаШапки, ОбластиМакета);
	
	ТабДокументПодписей.Вывести(ОбластиМакета.ДатаПодписи);
	
	Если Не ТабДокумент.ПроверитьВывод(ТабДокументПодписей) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ТабДокументПодписей);
	
КонецПроцедуры

Процедура ВывестиПодписьРуководителяРаздела2(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("Должность",	СтрокаШапки.РуководительКонтрагентаДолжность);
	ЗначенияПараметров.Вставить("ФИО",			СтрокаШапки.РуководительКонтрагентаФИО);
	ЗначенияПараметров.Вставить("Заголовок",	НСтр("ru='Руководитель (уполномоченное им лицо)'"));
	
	Область = ОбластиМакета.ПодписьБезТелефона;
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

Процедура ВывестиПодписьГлавбухаРаздела2(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("Должность",	СтрокаШапки.ГлавБухКонтрагентаДолжность);
	ЗначенияПараметров.Вставить("ФИО",			СтрокаШапки.ГлавБухКонтрагентаФИО);
	ЗначенияПараметров.Вставить("Заголовок",	НСтр("ru='Главный бухгалтер'"));
	
	Область = ОбластиМакета.ПодписьБезТелефона;
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

Процедура ВывестиПодписьИсполнителяРаздела2(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ЗначенияПараметров = Новый Структура();
	ЗначенияПараметров.Вставить("Должность",		СтрокаШапки.ИсполнительКонтрагентаДолжность);
	ЗначенияПараметров.Вставить("ФИО",				СтрокаШапки.ИсполнительКонтрагентаФИО);
	ЗначенияПараметров.Вставить("НомерТелефона",	СтрокаШапки.ИсполнительКонтрагентаНомерТелефона);
	ЗначенияПараметров.Вставить("ЭлектроннаяПочта",	СтрокаШапки.ИсполнительКонтрагентаЭлектронныйАдрес);
	ЗначенияПараметров.Вставить("Заголовок",		НСтр("ru='Ответственный исполнитель'"));
	
	Область = ОбластиМакета.ПодписьСТелефоном;
	
	Область.Параметры.Заполнить(ЗначенияПараметров);
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

#КонецОбласти

#Область Общее

// Сальдо всего начальное.

Процедура ВывестиВсегоСальдоНачальное(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, НомерРаздела)
	
	Если НомерРаздела = 1 Тогда
		ИмяВыборки = "Раздел1ВсегоСальдоНачальноеБезСчетов";
		
		ОбластьПерваяСтрока		= ОбластиМакета.Раздел1ВсегоСальдоНачальноеПерваяСтрока;
		ОбластьОчереднаяСтрока	= ОбластиМакета.Раздел1ВсегоСальдоНачальноеОчереднаяСтрока;
		ОбластьПодвал			= ОбластиМакета.Раздел1ВсегоСальдоНачальноеПодвал;
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяВыборки = "Раздел2ВсегоСальдоНачальное";
		
		ОбластьПерваяСтрока		= ОбластиМакета.Раздел2ВсегоСальдоНачальноеПерваяСтрока;
		ОбластьОчереднаяСтрока	= ОбластиМакета.Раздел2ВсегоСальдоНачальноеОчереднаяСтрока;
		ОбластьПодвал			= ОбластиМакета.Раздел2ВсегоСальдоНачальноеПодвал;
	КонецЕсли;
	
	ОбщаяВыборкаТЧ = Данные.Выборки[ИмяВыборки];
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументу(СтрокаШапки, ОбщаяВыборкаТЧ);
	
	Если Выборка.Количество() = 0 Тогда
		ВывестиПустоеВсегоСальдоНачальноеБезСчетов(ТабДокумент, Данные, ОбластьПерваяСтрока, ОбластьПодвал);
		
		Возврат;
	КонецЕсли;
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(Неопределено);
	МассивОбластей.Добавить(ОбластьПодвал);
	
	Счетчик = 0;
	
	ПередНачаломВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		Область = ?(Счетчик = 1,
			ОбластьПерваяСтрока,
			ОбластьОчереднаяСтрока);
		
		Область.Параметры.Заполнить(Выборка);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
		
		МассивОбластей[0] = Область;
		
		Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ПередРазрывомСтраницы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
			
			Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
				Область = ОбластьПерваяСтрока;
				
				Область.Параметры.Заполнить(Выборка);
				
				ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
					Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
			КонецЕсли;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область)
	КонецЦикла;
	
	ПослеВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	ТабДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры

Процедура ВывестиПустоеВсегоСальдоНачальноеБезСчетов(ТабДокумент, Данные, ОбластьПерваяСтрока, ОбластьПодвал)
	
	ОбластьПерваяСтрока.Параметры.Заполнить(Данные.ДополнительныеПараметры.СтруктураЗаполненияБезСчетов);
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(ОбластьПерваяСтрока);
	МассивОбластей.Добавить(ОбластьПодвал);
	
	Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПерваяСтрока);
	ТабДокумент.Вывести(ОбластьПодвал);
	
КонецПроцедуры

// Список договоров.

Процедура ВывестиСписокДоговоров(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, НомерРаздела)
	
	Если НомерРаздела = 1 Тогда
		ИмяВыборки = "Раздел1СписокДоговоров";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяВыборки = "Раздел2СписокДоговоров";
	КонецЕсли;
	
	ВыборкаСведенияДоговора = ПолучитьВыборкуПоТекущемуДокументу(СтрокаШапки, Данные.Выборки[ИмяВыборки]);
	
	Пока ВыборкаСведенияДоговора.Следующий() Цикл
		ВывестиДоговор(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДоговор(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела)
	
	ВывестиЗаголовокДоговора(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора);
	
	ВывестиСальдоНачальноеПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела);
	
	ВывестиОперацииПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела);
	
	ВывестиОборотыПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела);
	
	ВывестиСальдоКонечноеПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела);
	
КонецПроцедуры

Процедура ВывестиЗаголовокДоговора(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора)
	
	ОбластьЗаголовок = ОбластиМакета.ЗаголовокДоговора;
	
	ОбластьЗаголовок.Параметры.Заполнить(ВыборкаСведенияДоговора);
	
	Если Не ТабДокумент.ПроверитьВывод(ОбластьЗаголовок) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(ОбластьЗаголовок, ВыборкаСведенияДоговора,
		Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "ЗаголовокДоговора");
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
КонецПроцедуры

Процедура ВывестиСальдоНачальноеПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела)
	
	Если НомерРаздела = 1 Тогда
		ИмяВыборки = "Раздел1СальдоНачальноеБезСчетов";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяВыборки = "Раздел2СальдоНачальное";
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументуИДоговору(СтрокаШапки,
		Данные.Выборки[ИмяВыборки],
		ВыборкаСведенияДоговора);
	
	КоличествоСтрок = Выборка.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		ВывестиПустоеСальдоНачальноеПоДоговоруБезСчетов(ТабДокумент, Данные, ОбластиМакета);
		
		Возврат;
	КонецЕсли;
	
	ОбластьПодвала = ОбластиМакета.СальдоНачальноеПодвал;
	
	Счетчик = 0;
	
	ПередНачаломВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		Область = ?(Счетчик = 1,
			ОбластиМакета.СальдоНачальноеПерваяСтрока,
			ОбластиМакета.СальдоНачальноеОчереднаяСтрока);
		
		Область.Параметры.Заполнить(Выборка);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
		
		Если Счетчик = КоличествоСтрок Тогда
			МассивОбластей = Новый Массив();
			МассивОбластей.Добавить(Область);
			МассивОбластей.Добавить(ОбластьПодвала);
		Иначе
			МассивОбластей = Область;
		КонецЕсли;
		
		Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ПередРазрывомСтраницы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
			
			Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
				Область = ОбластиМакета.СальдоНачальноеПерваяСтрока;
				
				Область.Параметры.Заполнить(Выборка);
				
				ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
					Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
			КонецЕсли;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	ПослеВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	ТабДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры

Процедура ВывестиСальдоКонечноеПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела)
	
	ВывестиСальдоКонечноеПоДоговоруБезСчетов(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела);
	
	Если НомерРаздела = 1 Тогда
		ВывестиСальдоКонечноеПоДоговоруПоСчетам(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСальдоКонечноеПоДоговоруБезСчетов(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела)
	
	Если НомерРаздела = 1 Тогда
		ИмяВыборки = "Раздел1СальдоКонечноеБезСчетов";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяВыборки = "Раздел2СальдоКонечное";
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументуИДоговору(СтрокаШапки,
		Данные.Выборки[ИмяВыборки],
		ВыборкаСведенияДоговора);
	
	ОбластьПодвал = ОбластиМакета.СальдоКонечноеПодвал;
	
	Если Выборка.Количество() = 0 Тогда
		ВывестиПустоеСальдоКонечноеПоДоговоруБезСчетов(ТабДокумент, Данные, ОбластиМакета);
		
		Если НомерРаздела = 2 Тогда
			ТабДокумент.Вывести(ОбластьПодвал);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Счетчик = 0;
	
	ПередНачаломВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		Область = ?(Счетчик = 1,
			ОбластиМакета.СальдоКонечноеПерваяСтрока,
			ОбластиМакета.СальдоКонечноеОчереднаяСтрока);
		
		Область.Параметры.Заполнить(Выборка);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
		
		Если Не ТабДокумент.ПроверитьВывод(Область) Тогда
			ПередРазрывомСтраницы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
			
			Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
				Область = ОбластиМакета.СальдоКонечноеПерваяСтрока;
				
				Область.Параметры.Заполнить(Выборка);
				
				ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
					Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
			КонецЕсли;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	ПослеВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	Если НомерРаздела = 2 Тогда
		ТабДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиСальдоКонечноеПоДоговоруПоСчетам(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора)
	
	ОбластьЗаголовок = ОбластиМакета.СальдоКонечноеПоСчетамЗаголовок;
	
	Если Не ТабДокумент.ПроверитьВывод(ОбластьЗаголовок) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументуИДоговору(СтрокаШапки,
		Данные.Выборки.Раздел1СальдоКонечноеПоСчетам,
		ВыборкаСведенияДоговора);
	
	КоличествоСтрок = Выборка.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		ВывестиПустоеСальдоКонечноеПоДоговоруПоСчетам(ТабДокумент, Данные, ОбластиМакета);
		
		Возврат;
	КонецЕсли;
	
	Область = ОбластиМакета.СальдоКонечноеПоСчетамСтрока;
	
	ОбластьПодвала = ОбластиМакета.СальдоКонечноеПодвал;
	
	Счетчик = 0;
	
	ЗначенияПараметров = Новый Структура();
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		ЗначенияПараметров.Вставить("НомерСчета", ИнвентаризацияКлиентСервер.ПолучитьПолныйНомерСчета(
			Выборка.КПС, Выборка.КФО, Выборка.Счет, Выборка.КЭК,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
		
		Область.Параметры.Заполнить(Выборка);
		Область.Параметры.Заполнить(ЗначенияПараметров);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "НомерСчетаКодВалюты");
		
		Если Счетчик = КоличествоСтрок Тогда
			МассивОбластей = Новый Массив();
			МассивОбластей.Добавить(Область);
			МассивОбластей.Добавить(ОбластьПодвала);
		Иначе
			МассивОбластей = Область;
		КонецЕсли;
		
		Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры

Процедура ВывестиПустоеСальдоНачальноеПоДоговоруБезСчетов(ТабДокумент, Данные, ОбластиМакета)
	
	Область = ОбластиМакета.СальдоНачальноеПерваяСтрока;
	
	Область.Параметры.Заполнить(Данные.ДополнительныеПараметры.СтруктураЗаполненияБезСчетов);
	
	Если Не ТабДокумент.ПроверитьВывод(Область) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

Процедура ВывестиПустоеСальдоКонечноеПоДоговоруБезСчетов(ТабДокумент, Данные, ОбластиМакета)
	
	Область = ОбластиМакета.СальдоКонечноеПерваяСтрока;
	
	Область.Параметры.Заполнить(Данные.ДополнительныеПараметры.СтруктураЗаполненияБезСчетов);
	
	Если Не ТабДокумент.ПроверитьВывод(Область) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	
КонецПроцедуры

Процедура ВывестиПустоеСальдоКонечноеПоДоговоруПоСчетам(ТабДокумент, Данные, ОбластиМакета)
	
	Область = ОбластиМакета.СальдоКонечноеПоСчетамСтрока;
	
	Область.Параметры.Заполнить(Данные.ДополнительныеПараметры.СтруктураЗаполненияПоСчетам);
	
	ОбластьПодвала = ОбластиМакета.СальдоКонечноеПодвал;
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(Область);
	МассивОбластей.Добавить(ОбластьПодвала);
	
	Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	ТабДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры

// Операции.

Процедура ВывестиОперацииПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела)
	
	ОбластьЗаголовок = ОбластиМакета.ОперацииЗаголовок;
	
	Если Не ТабДокумент.ПроверитьВывод(ОбластьЗаголовок) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	Если НомерРаздела = 1 Тогда
		ИмяВыборки = "Раздел1Операции";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяВыборки = "Раздел2Операции";
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументуИДоговору(СтрокаШапки,
		Данные.Выборки[ИмяВыборки],
		ВыборкаСведенияДоговора);
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Область = ОбластиМакета.ОперацииСтрока;
	
	Счетчик = 0;
	
	ЗначенияПараметров = Новый Структура();
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		Область.Параметры.Заполнить(Выборка);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "ОперацииПоДоговору");
		
		Если Не ТабДокумент.ПроверитьВывод(Область) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
КонецПроцедуры

// Обороты.

Процедура ВывестиОборотыПоДоговору(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, ВыборкаСведенияДоговора, НомерРаздела)
	
	Если НомерРаздела = 1 Тогда
		ИмяВыборки = "Раздел1ОборотыБезСчетов";
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяВыборки = "Раздел2Обороты";
	КонецЕсли;
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументуИДоговору(СтрокаШапки,
		Данные.Выборки[ИмяВыборки],
		ВыборкаСведенияДоговора);
	
	КоличествоСтрок = Выборка.Количество();
	
	Если КоличествоСтрок = 0 Тогда
		ВывестиПустыеОборотыПоДоговору(ТабДокумент, Данные, ОбластиМакета);
		
		Возврат;
	КонецЕсли;
	
	ОбластьПодвала = ОбластиМакета.ОборотыПодвал;
	
	Счетчик = 0;
	
	ПередНачаломВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		Область = ?(Счетчик = 1,
			ОбластиМакета.ОборотыПерваяСтрока,
			ОбластиМакета.ОборотыОчереднаяСтрока);
		
		Область.Параметры.Заполнить(Выборка);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
		
		Если Счетчик = КоличествоСтрок Тогда
			МассивОбластей = Новый Массив();
			МассивОбластей.Добавить(Область);
			МассивОбластей.Добавить(ОбластьПодвала);
		Иначе
			МассивОбластей = Область;
		КонецЕсли;
		
		Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ПередРазрывомСтраницы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
			
			Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
				Область = ОбластиМакета.ОборотыПерваяСтрока;
				
				Область.Параметры.Заполнить(Выборка);
				
				ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
					Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
			КонецЕсли;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	ПослеВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	ТабДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры

Процедура ВывестиПустыеОборотыПоДоговору(ТабДокумент, Данные, ОбластиМакета)
	
	ОбластьПодвала = ОбластиМакета.ОборотыПодвал;
	
	Область = ОбластиМакета.ОборотыПерваяСтрока;
	
	Область.Параметры.Заполнить(Данные.ДополнительныеПараметры.СтруктураЗаполненияБезСчетов);
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(Область);
	МассивОбластей.Добавить(ОбластьПодвала);
	
	Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	ТабДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры

// Сальдо всего конечное.

Процедура ВывестиВсегоСальдоКонечное(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, НомерРаздела)
	
	ВывестиВсегоСальдоКонечноеБезСчетов(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, НомерРаздела);
	
	Если НомерРаздела = 1 Тогда
		ВывестиВсегоСальдоКонечноеПоСчетам(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиВсегоСальдоКонечноеБезСчетов(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета, НомерРаздела)
	
	Перем ОбластьПодвал;
	
	Если НомерРаздела = 1 Тогда
		ИмяВыборки = "Раздел1ВсегоСальдоКонечноеБезСчетов";
		
		ОбластьПерваяСтрока		= ОбластиМакета.Раздел1ВсегоСальдоКонечноеБезСчетовПерваяСтрока;
		ОбластьОчереднаяСтрока	= ОбластиМакета.Раздел1ВсегоСальдоКонечноеБезСчетовОчереднаяСтрока;
		
	ИначеЕсли НомерРаздела = 2 Тогда
		ИмяВыборки = "Раздел2ВсегоСальдоКонечное";
		
		ОбластьПерваяСтрока		= ОбластиМакета.Раздел2ВсегоСальдоКонечноеБезСчетовПерваяСтрока;
		ОбластьОчереднаяСтрока	= ОбластиМакета.Раздел2ВсегоСальдоКонечноеБезСчетовОчереднаяСтрока;
		ОбластьПодвал			= ОбластиМакета.Раздел2ВсегоСальдоКонечноеПодвал;
	КонецЕсли;
	
	ОбщаяВыборкаТЧ = Данные.Выборки[ИмяВыборки];
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументу(СтрокаШапки, ОбщаяВыборкаТЧ);
	
	Если Выборка.Количество() = 0 Тогда
		ВывестиПустоеВсегоСальдоКонечноеБезСчетов(ТабДокумент, Данные, ОбластьПерваяСтрока);
		
		Если НомерРаздела = 2 Тогда
			ТабДокумент.Вывести(ОбластьПодвал);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(Неопределено);
	
	Если НомерРаздела = 2 Тогда
		МассивОбластей.Добавить(ОбластьПодвал);
	КонецЕсли;
	
	Счетчик = 0;
	
	ПередНачаломВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		Область = ?(Счетчик = 1,
			ОбластьПерваяСтрока,
			ОбластьОчереднаяСтрока);
		
		Область.Параметры.Заполнить(Выборка);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
		
		МассивОбластей[0] = Область;
		
		Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ПередРазрывомСтраницы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
			
			Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
				Область = ОбластьПерваяСтрока;
				
				Область.Параметры.Заполнить(Выборка);
				
				ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
					Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "КодВалюты");
			КонецЕсли;
			
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область)
	КонецЦикла;
	
	ПослеВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные);
	
	Если НомерРаздела = 2 Тогда
		ТабДокумент.Вывести(ОбластьПодвал);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиВсегоСальдоКонечноеПоСчетам(ТабДокумент, Данные, СтрокаШапки, ОбластиМакета)
	
	ОбластьЗаголовок = ОбластиМакета.Раздел1ВсегоСальдоКонечноеПоСчетамЗаголовок;
	
	Если Не ТабДокумент.ПроверитьВывод(ОбластьЗаголовок) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьЗаголовок);
	
	Выборка = ПолучитьВыборкуПоТекущемуДокументу(СтрокаШапки, Данные.Выборки.Раздел1ВсегоСальдоКонечноеПоСчетам);
	
	Если Выборка.Количество() = 0 Тогда
		ВывестиПустоеВсегоСальдоКонечноеПоСчетам(ТабДокумент, Данные, ОбластиМакета);
		
		Возврат;
	КонецЕсли;
	
	Область = ОбластиМакета.Раздел1ВсегоСальдоКонечноеПоСчетамСтрока;
	
	ОбластьПодвала = ОбластиМакета.Раздел1ВсегоСальдоКонечноеПодвал;
	
	Счетчик = 0;
	
	КоличествоСтрок = Выборка.Количество();
	
	ЗначенияПараметров = Новый Структура();
	
	Пока Выборка.Следующий() Цикл
		Счетчик = Счетчик + 1;
		
		ЗначенияПараметров.Вставить("НомерСчета", ИнвентаризацияКлиентСервер.ПолучитьПолныйНомерСчета(
			Выборка.КПС, Выборка.КФО, Выборка.Счет, Выборка.КЭК,, Выборка.СчетУчетПоКПС, Выборка.СчетУчетПоКЭК));
		
		Область.Параметры.Заполнить(Выборка);
		Область.Параметры.Заполнить(ЗначенияПараметров);
		
		ИнвентаризацияСервер.ПрочеркнутьПустыеПоля(Область, Выборка,
			Данные.ДополнительныеПараметры.ПрочеркиПустыхПолей, "НомерСчетаКодВалюты");
		
		Если Счетчик = КоличествоСтрок Тогда
			МассивОбластей = Новый Массив();
			МассивОбластей.Добавить(Область);
			МассивОбластей.Добавить(ОбластьПодвала);
		Иначе
			МассивОбластей = Область;
		КонецЕсли;
		
		Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры

Процедура ВывестиПустоеВсегоСальдоКонечноеБезСчетов(ТабДокумент, Данные, ОбластьПерваяСтрока)
	
	ОбластьПерваяСтрока.Параметры.Заполнить(Данные.ДополнительныеПараметры.СтруктураЗаполненияБезСчетов);
	
	Если Не ТабДокумент.ПроверитьВывод(ОбластьПерваяСтрока) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьПерваяСтрока);
	
КонецПроцедуры

Процедура ВывестиПустоеВсегоСальдоКонечноеПоСчетам(ТабДокумент, Данные, ОбластиМакета)
	
	Область = ОбластиМакета.Раздел1ВсегоСальдоКонечноеПоСчетамСтрока;
	
	Область.Параметры.Заполнить(Данные.ДополнительныеПараметры.СтруктураЗаполненияПоСчетам);
	
	ОбластьПодвала = ОбластиМакета.Раздел1ВсегоСальдоКонечноеПодвал;
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(Область);
	МассивОбластей.Добавить(ОбластьПодвала);
	
	Если Не ТабДокумент.ПроверитьВывод(МассивОбластей) Тогда
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	ТабДокумент.Вывести(ОбластьПодвала);
	
КонецПроцедуры

#КонецОбласти

#Область ОбъединениеГрафы1ПоВысоте

Процедура ПередНачаломВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные)
	
	Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
		Данные.ДополнительныеПараметры.КоличествоСтрокПриНачалеВывода = ТабДокумент.ВысотаТаблицы;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередРазрывомСтраницы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные)
	
	Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
		ОбъединитьГрафу1ПоВысоте(ТабДокумент, Данные);
		
		Данные.ДополнительныеПараметры.КоличествоСтрокПриНачалеВывода = ТабДокумент.ВысотаТаблицы;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыводаТаблицы_ОбъединятьГрафу1ПоВысоте(ТабДокумент, Данные)
	
	Если Данные.ДополнительныеПараметры.ОбъединятьГрафу1ПоВысоте Тогда
		ОбъединитьГрафу1ПоВысоте(ТабДокумент, Данные);
		
		Данные.ДополнительныеПараметры.КоличествоСтрокПриНачалеВывода = 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбъединитьГрафу1ПоВысоте(ТабДокумент, Данные)
	
	НомерГрафы = 1;
	
	НомерСтрокиНач = Данные.ДополнительныеПараметры.КоличествоСтрокПриНачалеВывода + 1;
	НомерСтрокиКон = ТабДокумент.ВысотаТаблицы;
	
	Если НомерСтрокиКон <= НомерСтрокиНач Тогда
		Возврат;
	КонецЕсли;
	
	ТабДокумент.Область(НомерСтрокиНач, НомерГрафы, НомерСтрокиКон, НомерГрафы).Объединить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Функция ПолучитьТекстЗапросаЗарегистрироватьДанныеДляОбработкиЗаполнениеРаздел1СписокДоговоров()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Потенциально необходимые к обработке документы (заполненные)
	|//
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ПОМЕСТИТЬ
	|	КандидатыНаОбработку
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1ОборотыБезСчетов
	|ГДЕ
	|	НомерСтроки = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СальдоНачальноеБезСчетов
	|ГДЕ
	|	НомерСтроки = 1
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ссылка КАК Ссылка
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СальдоКонечноеБезСчетов
	|ГДЕ
	|	НомерСтроки = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Необходимые к обработке документы
	|//
	|ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	КандидатыНаОбработку КАК Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктСверкиРасчетов.Раздел1СписокДоговоров КАК ТЧ
	|		ПО Док.Ссылка = ТЧ.Ссылка
	|ГДЕ
	|	ТЧ.Ссылка ЕСТЬ NULL";
	
КонецФункции

Функция ПолучитьТекстЗапросаЗаполнениеРаздел1СписокДоговоров()
	
	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Данные табличных частей Раздел1ОборотыБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	СУММА(СуммаВсегоРубДебет)	КАК СуммаВсегоРубДебет,
	|	СУММА(СуммаВсегоРубКредит)	КАК СуммаВсегоРубКредит
	|ПОМЕСТИТЬ
	|	Обороты
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1ОборотыБезСчетов
	|ГДЕ
	|	Ссылка В(ВЫБРАТЬ ПЕРВЫЕ &КоличествоПервых Ссылка ИЗ ВТДляОбработки)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Данные табличных частей Раздел1СальдоНачальноеБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	СУММА(СуммаВсегоРубДебет)	КАК СуммаВсегоРубДебет,
	|	СУММА(СуммаВсегоРубКредит)	КАК СуммаВсегоРубКредит
	|ПОМЕСТИТЬ
	|	СальдоНачальное
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СальдоНачальноеБезСчетов
	|ГДЕ
	|	Ссылка В(ВЫБРАТЬ ПЕРВЫЕ &КоличествоПервых Ссылка ИЗ ВТДляОбработки)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Данные табличных частей Раздел1СальдоКонечноеБезСчетов
	|//
	|ВЫБРАТЬ
	|	Ссылка						КАК Ссылка,
	|	Договор						КАК Договор,
	|	СУММА(СуммаВсегоРубДебет)	КАК СуммаВсегоРубДебет,
	|	СУММА(СуммаВсегоРубКредит)	КАК СуммаВсегоРубКредит
	|ПОМЕСТИТЬ
	|	СальдоКонечное
	|ИЗ
	|	Документ.АктСверкиРасчетов.Раздел1СальдоКонечноеБезСчетов
	|ГДЕ
	|	Ссылка В(ВЫБРАТЬ ПЕРВЫЕ &КоличествоПервых Ссылка ИЗ ВТДляОбработки)
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Суммы договоров
	|//
	|ВЫБРАТЬ
	|	Ссылка							КАК Ссылка,
	|	Договор							КАК Договор,
	|	СУММА(ОборотыДебет)				КАК ОборотыДебет,
	|	СУММА(ОборотыКредит)			КАК ОборотыКредит,
	|	СУММА(СальдоНачальноеДебет)		КАК СальдоНачальноеДебет,
	|	СУММА(СальдоНачальноеКредит)	КАК СальдоНачальноеКредит,
	|	СУММА(СальдоКонечноеДебет)		КАК СальдоКонечноеДебет,
	|	СУММА(СальдоКонечноеКредит)		КАК СальдоКонечноеКредит
	|ПОМЕСТИТЬ
	|	СуммыДоговоров
	|ИЗ
	|	(ВЫБРАТЬ
	|		Ссылка				КАК Ссылка,
	|		Договор				КАК Договор,
	|		СуммаВсегоРубДебет	КАК ОборотыДебет,
	|		СуммаВсегоРубКредит	КАК ОборотыКредит,
	|		0					КАК СальдоНачальноеДебет,
	|		0					КАК СальдоНачальноеКредит,
	|		0					КАК СальдоКонечноеДебет,
	|		0					КАК СальдоКонечноеКредит
	|	ИЗ
	|		Обороты
	|
	|	ОБЪЕДИНИТЬ
	|
	|	ВЫБРАТЬ
	|		Ссылка				КАК Ссылка,
	|		Договор				КАК Договор,
	|		0					КАК ОборотыДебет,
	|		0					КАК ОборотыКредит,
	|		СуммаВсегоРубДебет	КАК СальдоНачальноеДебет,
	|		СуммаВсегоРубКредит	КАК СальдоНачальноеКредит,
	|		0					КАК СальдоКонечноеДебет,
	|		0					КАК СальдоКонечноеКредит
	|	ИЗ
	|		СальдоНачальное
	|
	|	ОБЪЕДИНИТЬ
	|
	|	ВЫБРАТЬ
	|		Ссылка				КАК Ссылка,
	|		Договор				КАК Договор,
	|		0					КАК ОборотыДебет,
	|		0					КАК ОборотыКредит,
	|		0					КАК СальдоНачальноеДебет,
	|		0					КАК СальдоНачальноеКредит,
	|		СуммаВсегоРубДебет	КАК СальдоКонечноеДебет,
	|		СуммаВсегоРубКредит	КАК СальдоКонечноеКредит
	|	ИЗ
	|		СальдоКонечное
	|	) КАК ВТ
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Все сведения договоров
	|//
	|ВЫБРАТЬ
	|	СуммыДоговоров.Ссылка												КАК Ссылка,
	|	СуммыДоговоров.Договор												КАК Договор,
	|	СуммыДоговоров.ОборотыДебет											КАК ОборотыДебет,
	|	СуммыДоговоров.ОборотыКредит										КАК ОборотыКредит,
	|	СуммыДоговоров.СальдоНачальноеДебет									КАК СальдоНачальноеДебет,
	|	СуммыДоговоров.СальдоНачальноеКредит								КАК СальдоНачальноеКредит,
	|	СуммыДоговоров.СальдоКонечноеДебет									КАК СальдоКонечноеДебет,
	|	СуммыДоговоров.СальдоКонечноеКредит									КАК СальдоКонечноеКредит,
	|	ЕСТЬNULL(СправочникДоговоры.ВидОбязательства, """")					КАК ВидОбязательства,
	|	ЕСТЬNULL(СправочникДоговоры.ДатаДоговора, """")						КАК ДатаДоговора,
	|	ЕСТЬNULL(СправочникДоговоры.НомерДоговора, """")						КАК НомерДоговора,
	|	ЕСТЬNULL(СправочникДоговоры.КраткоеСодержание, """")					КАК КраткоеСодержание,
	|	ЕСТЬNULL(СправочникДоговоры.ГосударственныйКонтрактПоГОЗ.Код, """")	КАК ИдентификаторГосконтракта
	|ИЗ
	|	СуммыДоговоров КАК СуммыДоговоров
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Договоры КАК СправочникДоговоры
	|		ПО СуммыДоговоров.Договор = СправочникДоговоры.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	Договор
	|АВТОУПОРЯДОЧИВАНИЕ
	|ИТОГИ
	|ПО
	|	Ссылка";
	
КонецФункции

#КонецОбласти

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПолучитьДанныеДляРаздела1", Истина);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
