
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли; 
	
	АдресПараметровПодключения = Параметры.АдресПараметровПодключения;
	
	ПодключаемоеОборудованиеБГУВызовСервера.ПолучитьДоступноеПодключаемоеОборудование(ИспользоватьПодключаемоеОборудование);
	
	ЗаполнитьПервоначальныйСписокВыбора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокЧековВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ЗафиксироватьВыборСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЧекаПриИзменении(Элемент)
	
	УстановитьОтборПоНомеруЧека();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков,	"Дата");
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков,	"Дата");
	РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "Дата", ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "Дата", ДатаКонца, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонцаПриИзменении(Элемент)
	
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков,	"Дата");
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков,	"Дата");
	РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "Дата", ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "Дата", ДатаКонца, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ЗафиксироватьВыборСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьПоиск(Команда)
	
	ВводимоеЧисло = "";
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков,	"Дата");
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков,	"Дата");
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков,	"Номер");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗафиксироватьВыборСтроки()
	
	ТекущиеДанные = Элементы.СписокЧеков.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Закрыть();
	Иначе
		Закрыть(ИдентификаторКорзины)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПервоначальныйСписокВыбора()
	
	ДатаНачала 	= НачалоДня(ТекущаяДата());
	ДатаКонца 	= КонецДня(ТекущаяДата());
	
	РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "Дата", ДатаНачала, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "Дата", ДатаКонца, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЧекаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВводаНомераЧека", ЭтотОбъект);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ПараметрыФормы = Новый Структура("ВозвращатьЧислоСтрокой", Ложь);
	ПараметрыФормы.Вставить("Заголовок", "Введите номер чека");
	ОткрытьФорму("Обработка.РМКУправляемыйРежим.Форма.ФормаВводаЧисла", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОткрытьФормуВводаНомераЧека(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатОткрытияФормы) Тогда
		НомерЧека = РезультатОткрытияФормы;
		УстановитьОтборПоНомеруЧека();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоНомеруЧека()
	
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков, "Номер");
	Если ЗначениеЗаполнено(НомерЧека) Тогда
		РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "Номер", НомерЧека);
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура СписокЧековПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокЧеков.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		УстановитьИдентификаторКорзины(ТекущиеДанные.Ссылка); 
	Иначе
		ИдентификаторКорзины = "";
	КонецЕсли;	
	
КонецПроцедуры                       

&НаСервере
Процедура УстановитьИдентификаторКорзины(СсылкаНаДокумент)
	
	ИдентификаторКорзины = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "ИдентификаторКорзины");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		ПодключаемоеОборудованиеБГУКлиент.ВнешнееСобытиеОборудованияРМК(ЭтотОбъект,	Источник, Событие, Данные);
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры) Экспорт
	
	Если НЕ ПустаяСтрока(Штрихкод) Тогда 
		Если СтрДлина(Штрихкод) > 26 Тогда 
			ПолучитьИдентификаторКорзины(Штрихкод);
		Иначе           
			ИдентификаторКорзины = Штрихкод;
			УстановитьОтборТаблицы();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИдентификаторКорзины(Штрихкод)

    ПараметрыОперации 				= ПолучитьИзВременногоХранилища(АдресПараметровПодключения);
    ПараметрыОперации.QRКодЧекаККТ 	= Штрихкод; // Сканированный QR код фискального чека

    ОповещениеМетода = Новый ОписаниеОповещения("ПолучитьИдентификаторКорзиныЗавершение", ЭтотОбъект, ПараметрыОперации); 
    ЭлектронныеСертификатыНСПККлиент.НачатьПолучениеИдентификатораКорзины(ОповещениеМетода, ПараметрыОперации);

КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьИдентификаторКорзиныЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда 
    	ИдентификаторКорзины = РезультатВыполнения.ИдентификаторКорзины; 
		УстановитьОтборТаблицы(); 
	Иначе
		ТекстСообщения = НСтр("ru = 'При передаче данных продажи произошла ошибка.
		|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения 						= СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ПараметрыИнформации 				= ПодключаемоеОборудованиеБГУКлиентСервер.ПолучитьСтруктуруВыводимойВРМКИнформации();
		ПараметрыИнформации.ТекстИнформации = ТекстСообщения;
		РозничныеПродажиБГУКлиент.ОткрытьФормуИнформацииДляРМКУправляемой(ПараметрыИнформации);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборТаблицы()
	
	РозничныеПродажиБГУКлиентСервер.УдалитьЭлементОтбораСписка(СписокЧеков, "ИдентификаторКорзины");
	Если Не ИдентификаторКорзины = "" Тогда 
		РозничныеПродажиБГУКлиентСервер.УстановитьЭлементОтбораСписка(СписокЧеков, "ИдентификаторКорзины", ИдентификаторКорзины, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ИдентификаторКорзиныПриИзменении(Элемент)
	
	УстановитьОтборТаблицы();	
	
КонецПроцедуры
	
#КонецОбласти