#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	ИмяТранспорта = ПолучитьПолноеИмяПредопределенногоЗначения(ЭтотОбъект.СпособВыгрузки);
	
	Если ИмяТранспорта <> "Перечисление.СпособыВыгрузкиФайлов.Каталог" Тогда
		НепроверяемыеРеквизиты.Добавить("ПутьВыгрузки");
	КонецЕсли;	
	
	Если  ИмяТранспорта <> "Перечисление.СпособыВыгрузкиФайлов.ЭлектроннаяПочта" и ИмяТранспорта <> "Перечисление.СпособыВыгрузкиФайлов.FTP" Тогда
		НепроверяемыеРеквизиты.Добавить("НастройкаЭкспорта");
	КонецЕсли;	
	
	
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПроверитьЗаполнениеДопНастроек(ДополнительныеНастройкиФормата, Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,НепроверяемыеРеквизиты);	
	
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ
////////////////////////////////////////////////////////////////////////////////
// Зависимости

Процедура ЗаполнитьТаблицуЗависимостей(СтруктураДанных) Экспорт 
	Если СтруктураДанных.Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаДопНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СформироватьТаблицуДополнительныхНастроек();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеНастройкиФормата,ТаблицаДопНастроек);
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПрочитатьЗначенияИзХранилища(ТаблицаДопНастроек);
	
	ТаблицаДляЗаполнения = Зависимости.ВыгрузитьКолонки("ИсходныйОтчет,ОтчетнаяФорма,ВидВыбираемогоОтчета,ВыбранныйОтчет");
	ТаблицаДляЗаполнения.Колонки.Добавить("ДанныеДополнительныхОтборовСтруктура");
	
	Обработка = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.СоздатьОбъектОбработки(ФорматВыгрузки);
	
	Попытка
		Обработка.ЗаполнитьТаблицуЗависимостей(ОтчетыДляВыгрузки.ВыгрузитьКолонку("Отчет"),
		ТаблицаДляЗаполнения,
		ТаблицаДопНастроек);
		
	Исключение
		СтруктураДанных.Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось получить список зависимостей.'")+Символы.ПС+ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
		
	Зависимости.Очистить();
	Для Каждого СтрокаТаблицы Из ТаблицаДляЗаполнения Цикл 
		
		НоваяСтрока = Зависимости.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицы);
		НоваяСтрока.ДанныеДополнительныхОтборов = ЗначениеВСтрокуВнутр(СтрокаТаблицы.ДанныеДополнительныхОтборовСтруктура);
		
	КонецЦикла;
	
	ВыполнитьПоискРешенияЗависимостейАвтоматически();
	
КонецПроцедуры


Процедура ВыполнитьПоискРешенияЗависимостейАвтоматически()
	
	Если Зависимости.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаУсловийПоАналитикам = СформироватьТаблицуУсловийПоАналитикам();
	СписокВариантов = СформироватьСписокВариантов(ТаблицаУсловийПоАналитикам); 
	
	Для Каждого СтрокаЗависимостей Из Зависимости Цикл
		
		Если ЗначениеЗаполнено(СтрокаЗависимостей.ВыбранныйОтчет) Тогда 
			Продолжить;
		КонецЕсли;
		
		НайденныеВарианты = СписокВариантов.НайтиСтроки(Новый Структура("НомерЗависимости",СтрокаЗависимостей.НомерСтроки));
		Если НайденныеВарианты.Количество() = 1 Тогда 
			СтрокаЗависимостей.ВыбранныйОтчет = НайденныеВарианты[0].Вариант; 
		Иначе 
			МассивВыбранныхДляВыгрузкиВариантов = Новый Массив;
			
			Для Каждого СтрокаВарианта Из НайденныеВарианты Цикл
				Если ОтчетыДляВыгрузки.Найти(СтрокаВарианта.Вариант) <> Неопределено Тогда 
					МассивВыбранныхДляВыгрузкиВариантов.Добавить(СтрокаВарианта);
				КонецЕсли;
			КонецЦикла;	
			
			Если МассивВыбранныхДляВыгрузкиВариантов.Количество() = 1 Тогда 
					СтрокаЗависимостей.ВыбранныйОтчет = МассивВыбранныхДляВыгрузкиВариантов[0].Вариант;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры	

Функция СформироватьТаблицуУсловийПоАналитикам() Экспорт 
	
	ТаблицаУсловийПоАналитикам = Новый ТаблицаЗначений;
	ТаблицаУсловийПоАналитикам.Колонки.Добавить("НомерЗависимости",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаУсловийПоАналитикам.Колонки.Добавить("ВидВыбираемогоОтчета",Новый ОписаниеТипов("СправочникСсылка.ВидыОтчетов"));
	ТаблицаУсловийПоАналитикам.Колонки.Добавить("ИмяАналитики",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(20)));
	ТаблицаУсловийПоАналитикам.Колонки.Добавить("Значение", Метаданные.ПланыВидовХарактеристик.АналитикаОтчетов.Тип);
	                                                                            
	
	Для Каждого СтрокаЗависимости Из Зависимости Цикл
		
		СтруктураОтбора = ЗначениеИзСтрокиВнутр(СтрокаЗависимости.ДанныеДополнительныхОтборов);
		Если ТипЗнч(СтруктураОтбора) <> Тип("Структура") Тогда 
			Продолжить;
		КонецЕсли;	
		
		Для Каждого ЭлементОтбора Из СтруктураОтбора Цикл 
			НоваяСтрокаУсловий = ТаблицаУсловийПоАналитикам.Добавить();
			НоваяСтрокаУсловий.НомерЗависимости = СтрокаЗависимости.НомерСтроки;
			НоваяСтрокаУсловий.ВидВыбираемогоОтчета = СтрокаЗависимости.ВидВыбираемогоОтчета; 
			НоваяСтрокаУсловий.ИмяАналитики = ЭлементОтбора.Ключ;
			НоваяСтрокаУсловий.Значение = ЭлементОтбора.Значение;
			
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УсловияПоАналитикам",ТаблицаУсловийПоАналитикам);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.НомерЗависимости,
	|	Таблица.ВидВыбираемогоОтчета,
	|	Таблица.ИмяАналитики,
	|	Таблица.Значение
	|ПОМЕСТИТЬ УсловияПоАналитикам
	|ИЗ
	|	&УсловияПоАналитикам КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УсловияПоАналитикам.НомерЗависимости КАК НомерЗависимости,
	|	УсловияПоАналитикам.ВидВыбираемогоОтчета КАК ВидВыбираемогоОтчета,
	|	УсловияПоАналитикам.ИмяАналитики КАК ИмяАналитики,
	|	УсловияПоАналитикам.Значение КАК Значение,
	|	ДополнительныеРеквизитыОтчетов.Ссылка КАК ДопРеквизит
	|ИЗ
	|	УсловияПоАналитикам КАК УсловияПоАналитикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеРеквизитыОтчетов КАК ДополнительныеРеквизитыОтчетов
	|		ПО УсловияПоАналитикам.ВидВыбираемогоОтчета = ДополнительныеРеквизитыОтчетов.Владелец
	|			И УсловияПоАналитикам.ИмяАналитики = ДополнительныеРеквизитыОтчетов.Код";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции	

Функция СформироватьСписокВариантов(ТаблицаУсловийПоАналитикам) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИсходнаяТаблица",Зависимости.Выгрузить());
	Запрос.УстановитьПараметр("УсловияПоАналитикам",ТаблицаУсловийПоАналитикам);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.НомерСтроки,
	|	Таблица.ИсходныйОтчет,
	|	Таблица.ВидВыбираемогоОтчета
	|ПОМЕСТИТЬ ИсходнаяТаблица
	|ИЗ
	|	&ИсходнаяТаблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерЗависимости,
	|	Таблица.ВидВыбираемогоОтчета,
	|	Таблица.ИмяАналитики,
	|	Таблица.ДопРеквизит,
	|	Таблица.Значение
	|ПОМЕСТИТЬ УсловияПоАналитикам
	|ИЗ
	|	&УсловияПоАналитикам КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	УниверсальныйРегламентированныйОтчет.Ссылка КАК ИсходныйОтчет,
	|	ИсходнаяТаблица.ВидВыбираемогоОтчета КАК ВидВыбираемогоОтчета,
	|	УниверсальныйРегламентированныйОтчет.Организация КАК Организация,
	|	УниверсальныйРегламентированныйОтчет.ПериодОтчета КАК ПериодОтчета,
	|	УниверсальныйРегламентированныйОтчет.ВидОтчета
	|ПОМЕСТИТЬ ИсходнаяТаблицаСДопДанными
	|ИЗ
	|	ИсходнаяТаблица КАК ИсходнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|		ПО ИсходнаяТаблица.ИсходныйОтчет = УниверсальныйРегламентированныйОтчет.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходнаяТаблицаСДопДанными.НомерСтроки КАК НомерСтроки,
	|	УниверсальныйРегламентированныйОтчет.Ссылка КАК Вариант
	|ПОМЕСТИТЬ ВозможныеВарианты
	|ИЗ
	|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсходнаяТаблицаСДопДанными КАК ИсходнаяТаблицаСДопДанными
	|		ПО (УниверсальныйРегламентированныйОтчет.ПометкаУдаления = ЛОЖЬ)
	|			И (ИсходнаяТаблицаСДопДанными.ВидВыбираемогоОтчета = УниверсальныйРегламентированныйОтчет.ВидОтчета)
	|			И (ИсходнаяТаблицаСДопДанными.Организация = УниверсальныйРегламентированныйОтчет.Организация)
	|			И (ИсходнаяТаблицаСДопДанными.ПериодОтчета = УниверсальныйРегламентированныйОтчет.ПериодОтчета)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозможныеВарианты.НомерСтроки КАК НомерЗависимости,
	|	УсловияПоАналитикам.Значение КАК Значение,
	|	УсловияПоАналитикам.ДопРеквизит КАК ДопРеквизит,
	|	ВозможныеВарианты.Вариант КАК Вариант,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВозможныеУсловияПоДопРеквизитам
	|ИЗ
	|	ВозможныеВарианты КАК ВозможныеВарианты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УсловияПоАналитикам КАК УсловияПоАналитикам
	|		ПО ВозможныеВарианты.НомерСтроки = УсловияПоАналитикам.НомерЗависимости
	|ГДЕ
	|	УсловияПоАналитикам.ДопРеквизит <> ЗНАЧЕНИЕ(Справочник.ДополнительныеРеквизитыОтчетов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозможныеВарианты.НомерСтроки,
	|	ВложенныйЗапрос.Значение,
	|	ВложенныйЗапрос.ДопРеквизит,
	|	ВозможныеВарианты.Вариант,
	|	2
	|ИЗ
	|	ВозможныеВарианты КАК ВозможныеВарианты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВложенныйЗапрос.НомерЗависимости КАК НомерЗависимости,
	|			ВложенныйЗапрос.ДопРеквизит КАК ДопРеквизит,
	|			ЗначенияДополнительныхРеквизитовОтчета.Значение КАК Значение
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ИсходнаяТаблицаСДопДанными.НомерСтроки КАК НомерЗависимости,
	|				ИсходнаяТаблицаСДопДанными.ИсходныйОтчет КАК ИсходныйОтчет,
	|				ДополнительныеРеквизитыОтчетов.Ссылка КАК ДопРеквизит
	|			ИЗ
	|				ИсходнаяТаблицаСДопДанными КАК ИсходнаяТаблицаСДопДанными
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДополнительныеРеквизитыОтчетов КАК ДополнительныеРеквизитыОтчетов
	|					ПО ИсходнаяТаблицаСДопДанными.ВидОтчета = ДополнительныеРеквизитыОтчетов.Владелец
	|						И (ДополнительныеРеквизитыОтчетов.ПометкаУдаления = ЛОЖЬ)) КАК ВложенныйЗапрос
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
	|				ПО ВложенныйЗапрос.ДопРеквизит = ЗначенияДополнительныхРеквизитовОтчета.ДополнительныйРеквизитОтчета
	|					И ВложенныйЗапрос.ИсходныйОтчет = ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета) КАК ВложенныйЗапрос
	|		ПО ВозможныеВарианты.НомерСтроки = ВложенныйЗапрос.НомерЗависимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Вариант,
	|	ВложенныйЗапрос.НомерЗависимости
	|ПОМЕСТИТЬ ВариантыНеПодходящиеПоАналитикам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозможныеУсловияПоДопРеквизитам.НомерЗависимости КАК НомерЗависимости,
	|		ВозможныеУсловияПоДопРеквизитам.ДопРеквизит КАК ДопРеквизит,
	|		ВозможныеУсловияПоДопРеквизитам.Значение КАК Значение,
	|		ВозможныеУсловияПоДопРеквизитам.Вариант КАК Вариант
	|	ИЗ
	|		ВозможныеУсловияПоДопРеквизитам КАК ВозможныеУсловияПоДопРеквизитам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				ВозможныеУсловияПоДопРеквизитам.НомерЗависимости КАК НомерЗависимости,
	|				ВозможныеУсловияПоДопРеквизитам.Вариант КАК Вариант,
	|				ВозможныеУсловияПоДопРеквизитам.ДопРеквизит КАК ДопРеквизит,
	|				МИНИМУМ(ВозможныеУсловияПоДопРеквизитам.Приоритет) КАК Приоритет
	|			ИЗ
	|				ВозможныеУсловияПоДопРеквизитам КАК ВозможныеУсловияПоДопРеквизитам
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ВозможныеУсловияПоДопРеквизитам.НомерЗависимости,
	|				ВозможныеУсловияПоДопРеквизитам.Вариант,
	|				ВозможныеУсловияПоДопРеквизитам.ДопРеквизит) КАК ВложенныйЗапрос
	|			ПО ВозможныеУсловияПоДопРеквизитам.НомерЗависимости = ВложенныйЗапрос.НомерЗависимости
	|				И ВозможныеУсловияПоДопРеквизитам.Вариант = ВложенныйЗапрос.Вариант
	|				И ВозможныеУсловияПоДопРеквизитам.Приоритет = ВложенныйЗапрос.Приоритет
	|				И ВозможныеУсловияПоДопРеквизитам.ДопРеквизит = ВложенныйЗапрос.ДопРеквизит) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхРеквизитовОтчета КАК ЗначенияДополнительныхРеквизитовОтчета
	|		ПО ВложенныйЗапрос.Вариант = ЗначенияДополнительныхРеквизитовОтчета.ЭкземплярОтчета
	|			И ВложенныйЗапрос.Значение <> ЗначенияДополнительныхРеквизитовОтчета.Значение
	|			И ВложенныйЗапрос.ДопРеквизит = ЗначенияДополнительныхРеквизитовОтчета.ДополнительныйРеквизитОтчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозможныеВарианты.НомерСтроки КАК НомерЗависимости,
	|	ВозможныеВарианты.Вариант КАК Вариант
	|ИЗ
	|	ВозможныеВарианты КАК ВозможныеВарианты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыНеПодходящиеПоАналитикам КАК ВариантыНеПодходящиеПоАналитикам
	|		ПО ВозможныеВарианты.Вариант = ВариантыНеПодходящиеПоАналитикам.Вариант
	|			И ВозможныеВарианты.НомерСтроки = ВариантыНеПодходящиеПоАналитикам.НомерЗависимости
	|ГДЕ
	|	ВариантыНеПодходящиеПоАналитикам.НомерЗависимости ЕСТЬ NULL ";
	
	Возврат Запрос.Выполнить().Выгрузить();

	
КонецФункции

// Зависимости
////////////////////////////////////////////////////////////////////////////////
// Формирование пакетов

Процедура СформироватьПакеты(СтруктураДанных) Экспорт 
	Если СтруктураДанных.Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаДанных = СформироватьТаблицуДанныхДляОбработки();
	

	ВыполнитьОбработку(ТаблицаДанных, СтруктураДанных);
	СоздатьДокументы(ТаблицаДанных, СтруктураДанных);	
	
КонецПроцедуры

Функция СформироватьТаблицуДанныхДляОбработки()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Период",Новый ОписаниеТипов("СправочникСсылка.Периоды"));
	Результат.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Колонки.Добавить("УИДОбработкиФормата",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная)));
	Результат.Колонки.Добавить("Отчеты",Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ФайлыОтчетов",Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("Протокол",Новый ОписаниеТипов("ТаблицаЗначений"));
	Результат.Колонки.Добавить("ДопДанныеГрупп",Новый ОписаниеТипов("ТаблицаЗначений"));
	
	ТаблицаОтчеты = Новый ТаблицаЗначений;
	ТаблицаОтчеты.Колонки.Добавить("Отчет",Новый ОписаниеТипов("ДокументСсылка.УниверсальныйРегламентированныйОтчет"));
	ТаблицаОтчеты.Колонки.Добавить("Группа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаОтчеты.Колонки.Добавить("КодОтчетнойФормы",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10, ДопустимаяДлина.Переменная)));
	
	ТаблицаФайлыОтчетов = Новый ТаблицаЗначений;
	ТаблицаФайлыОтчетов.Колонки.Добавить("Группа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	ТаблицаФайлыОтчетов.Колонки.Добавить("ДанныеФайлов");// двоичные данные

	ТаблицаПротокол = Новый ТаблицаЗначений;
	ТаблицаПротокол.Колонки.Добавить("Отчет",Новый ОписаниеТипов("ДокументСсылка.УниверсальныйРегламентированныйОтчет"));
	ТаблицаПротокол.Колонки.Добавить("ТекстСообщения",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0, ДопустимаяДлина.Переменная)));
	ТаблицаПротокол.Колонки.Добавить("Важность",Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(30, ДопустимаяДлина.Переменная)));
	
	ТаблицаДопДанныеГрупп = Новый ТаблицаЗначений;
	ТаблицаДопДанныеГрупп.Колонки.Добавить("Группа",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));
	Если ВыгрузкаРегламентированнойБухгалтерскойОтчетностиПовтИсп.ТранспортИспользуется("Перечисление.СпособыВыгрузкиФайлов.ОбменСФНС") Тогда 
		ТаблицаДопДанныеГрупп.Колонки.Добавить("ВидОтправляемогоДокумента",Новый ОписаниеТипов("СправочникСсылка.ВидыОтправляемыхДокументов"));
	Иначе
		ТаблицаДопДанныеГрупп.Колонки.Добавить("ВидОтправляемогоДокумента");  
	КонецЕсли;	
	ТаблицаДопДанныеГрупп.Колонки.Добавить("КодИФНС",Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(4, ДопустимаяДлина.Переменная)));
	ТаблицаДопДанныеГрупп.Колонки.Добавить("НомерКорректировки",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5, 0, ДопустимыйЗнак.Неотрицательный)));


	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отчеты",ОтчетыДляВыгрузки.ВыгрузитьКолонку("Отчет"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УниверсальныйРегламентированныйОтчет.Ссылка КАК Отчет,
	|	УниверсальныйРегламентированныйОтчет.Организация КАК Организация,
	|	УниверсальныйРегламентированныйОтчет.ПериодОтчета КАК Период,
	|	ЛОЖЬ КАК Распределен
	|ИЗ
	|	Документ.УниверсальныйРегламентированныйОтчет КАК УниверсальныйРегламентированныйОтчет
	|ГДЕ
	|	УниверсальныйРегламентированныйОтчет.Ссылка В(&Отчеты)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаОтчета Из РезультатЗапроса Цикл 
		Если СтрокаОтчета.Распределен Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаОтчета,"Организация,Период");
		НоваяСтрока.Отчеты 			= ТаблицаОтчеты.СкопироватьКолонки();
		НоваяСтрока.ФайлыОтчетов 	= ТаблицаФайлыОтчетов.СкопироватьКолонки();
		НоваяСтрока.Протокол 		= ТаблицаПротокол.СкопироватьКолонки();
		НоваяСтрока.ДопДанныеГрупп	= ТаблицаДопДанныеГрупп.СкопироватьКолонки();
		
		ОтчетыПакета = РезультатЗапроса.НайтиСтроки(Новый Структура("Организация,Период",СтрокаОтчета.Организация,СтрокаОтчета.Период));
		Для Каждого СтрокаОтчета Из ОтчетыПакета Цикл
			СтрокаОтчета.Распределен = Истина;
			НоваяСтрокаОтчета = НоваяСтрока.Отчеты.Добавить();
			НоваяСтрокаОтчета.Отчет = СтрокаОтчета.Отчет;
			
		КонецЦикла;	
	КонецЦикла;
	
	Возврат Результат;
КонецФункции	

Процедура ВыполнитьОбработку(ТаблицаДанных,СтруктураДанных)
	Если СтруктураДанных.Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ТаблицаДопНастроек = ВыгрузкаРегламентированнойБухгалтерскойОтчетности.СформироватьТаблицуДополнительныхНастроек();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДополнительныеНастройкиФормата,ТаблицаДопНастроек);
	ВыгрузкаРегламентированнойБухгалтерскойОтчетности.ПрочитатьЗначенияИзХранилища(ТаблицаДопНастроек);
	
	Обработка = Справочники.ФорматыВыгрузкиБухгалтерскойОтчетности.СоздатьОбъектОбработки(ФорматВыгрузки);
	
	Если Обработка.Метаданные().ТабличныеЧасти.Найти("ПрисоединенныеФайлыДляВыгрузки")<> Неопределено Тогда
		Обработка["ПрисоединенныеФайлыДляВыгрузки"].Загрузить(ЭтотОбъект.ПрисоединенныеФайлыДляВыгрузки.Выгрузить());
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("СпособВыгрузки",СтруктураДанных.Обработка.СпособВыгрузки);
	
	ЗаполнитьЗначенияСвойств(Обработка,СтруктураРеквизитов);
	Попытка
		Обработка.СформироватьФайлыОтчетов(ТаблицаДанных, Зависимости.Выгрузить(), ТаблицаДопНастроек);
		
	Исключение
		СтруктураДанных.Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось сформировать файлы отчетов.'")+Символы.ПС+ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура СоздатьДокументы(ТаблицаДанных,СтруктураДанных)
	Если СтруктураДанных.Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	МассивПакетов = Новый Массив;
	
	ЗаполнятьПериод = ЗначениеЗаполнено(РабочийПериод);
	
	Для Каждого СтрокаТаблицыДанных Из ТаблицаДанных Цикл 
		
		СтруктураЗаполнения = Новый Структура("Организация,Период,УИДОбработкиФормата,Отчеты,ФайлыОтчетов,Протокол,ДопДанныеГрупп");
		СтруктураЗаполнения.Вставить("СпособЗаполнения","ЗаполнениеПоДаннымОбработкиВыгрузки");
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения,СтрокаТаблицыДанных);
		
		СтруктураЗаполнения.Вставить("ДанныеОбработки",Новый Структура("ФорматВыгрузки,СпособВыгрузки,ПутьВыгрузки,НастройкаЭкспорта,Зависимости,ДополнительныеНастройкиФормата"));
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения.ДанныеОбработки,ЭтотОбъект,,"Зависимости,ДополнительныеНастройкиФормата");
		
		СтруктураЗаполнения.ДанныеОбработки.Зависимости = ЭтотОбъект.Зависимости.Выгрузить();
		СтруктураЗаполнения.ДанныеОбработки.ДополнительныеНастройкиФормата = ЭтотОбъект.ДополнительныеНастройкиФормата.Выгрузить();
		
		МассивСтрокФайлов = Новый Массив;
		СоответствиеОтчетов = Новый Соответствие;
		Для Каждого СтрОтчетов Из СтрокаТаблицыДанных.Отчеты Цикл
			СоответствиеОтчетов.Вставить(СтрОтчетов.Отчет,Истина);
		КонецЦикла;
		Для Каждого СтрФайла Из ЭтотОбъект.ПрисоединенныеФайлыДляВыгрузки Цикл
			Если СоответствиеОтчетов[СтрФайла.Отчет]<>Неопределено Тогда
				МассивСтрокФайлов.Добавить(СтрФайла);
			КонецЕсли;
		КонецЦикла;
		
		СтруктураЗаполнения.Вставить("ПрисоединенныеФайлыДляВыгрузки", ЭтотОбъект.ПрисоединенныеФайлыДляВыгрузки.Выгрузить(МассивСтрокФайлов));
		
		Если ЗаполнятьПериод Тогда
			СтруктураЗаполнения.Период = РабочийПериод;
		КонецЕсли;
		
		НовыйПакет = Документы.ПакетВыгрузкиОтчетности.СоздатьДокумент();
		НовыйПакет.Заполнить(СтруктураЗаполнения);
		
		НовыйПакет.Записать();
		МассивПакетов.Добавить(НовыйПакет.Ссылка);
				
	КонецЦикла;
	
	СтруктураДанных.МассивПакетов =  МассивПакетов;
	СтруктураДанных.КоличествоСформированныхПакетов = МассивПакетов.Количество();
	
КонецПроцедуры

// Формирование пакетов
////////////////////////////////////////////////////////////////////////////////
// ЭЦП

Процедура ЗаполнитьОписаниеФайловДляФормированияПодписей(СтруктураДанных,СтруктураДанныхПодписей) Экспорт 
	Если СтруктураДанных.Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекПакетСсылка = СтруктураДанных.МассивПакетов.Получить(СтруктураДанных.НомерОбрабатываемогоПакета);
	ОбрабатываемыйПакет = ТекПакетСсылка.ПолучитьОбъект();	
	
	ОбрабатываемыйПакет.ЗаполнитьОписаниеФайловДляФормированияПодписей(СтруктураДанныхПодписей);
	
	Если ОбрабатываемыйПакет.Модифицированность() Тогда
		ОбрабатываемыйПакет.Записать();
	КонецЕсли;
	
	ОбрабатываемыйПакет = Неопределено;
	
КонецПроцедуры	

Процедура ДобавитьНовыеПодписиВПакет(СтруктураДанных,СтруктураДанныхПодписей) Экспорт 
	Если СтруктураДанных.Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ТекПакетСсылка = СтруктураДанных.МассивПакетов.Получить(СтруктураДанных.НомерОбрабатываемогоПакета);
	ОбрабатываемыйПакет = ТекПакетСсылка.ПолучитьОбъект();
		
	ОбрабатываемыйПакет.ДобавитьНовыеПодписи(СтруктураДанныхПодписей);
	
	Если ОбрабатываемыйПакет.Модифицированность() Тогда
		ОбрабатываемыйПакет.Записать();
	КонецЕсли;
	
	ОбрабатываемыйПакет = Неопределено;
		
КонецПроцедуры	

// ЭЦП
////////////////////////////////////////////////////////////////////////////////

FTPПорт = 21;

#КонецЕсли