
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ФормаКлиентскогоПриложения") Тогда
		УникальныйИдентификатор = ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор;
	Иначе
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	РезультатЗадания = ЗапуститьОбновлениеВФоне(УникальныйИдентификатор);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ПараметрыВыполненияКоманды.Источник);
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Обновляются типовые операции на поддержке...'");
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеОбновленияОпераций", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатЗадания, ОписаниеОповещения, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеОбновленияОпераций(Результат, ДополнительныеПараметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ТиповыеОперации"));
	Оповестить("ВыполненоОбновлениеТиповыхОпераций");
	Если Результат.Статус = "Выполнено" Тогда
		ПоказатьПредупреждение(,НСтр("ru = 'Типовые операции на поддержке обновлены из данных поддержки'"));
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'При обновлении типовых операций произошла ошибка'"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗапуститьОбновлениеВФоне(Знач УникальныйИдентификатор)

	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	//
	ПараметрыЗадания.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление списка типовых операций'");
	
	ПараметрыПроцедуры = Новый Структура;

	Возврат ДлительныеОперации.ВыполнитьВФоне("Справочники.ТиповыеОперации.ЗагрузитьЭлементыВФоне",
		ПараметрыПроцедуры, ПараметрыЗадания);
	
КонецФункции

