#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ТипЗначенияКолонкиДополнительногоИсточника(МетаданныеДокумента, ИмяТабличнойЧасти, ИмяКолонки) Экспорт

	ТабличнаяЧастьДокумента = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти);
	Если ТабличнаяЧастьДокумента <> Неопределено Тогда
		
		Реквизит = ТабличнаяЧастьДокумента.Реквизиты.Найти(ИмяКолонки);
		Если Реквизит <> Неопределено Тогда
			Возврат Реквизит.Тип;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов("Неопределено");

КонецФункции // ТипЗначенияДополнительнойКолонки()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИсточникиДанных(ТиповаяОперация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Ссылка,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяФункции,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.СпособЗаполнения,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ИмяИсточника,
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.КолонкиИсточника.(
	|		Ссылка,
	|		НомерСтроки,
	|		ИмяКолонки
	|	),
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПараметрыФункции.(
	|		Ссылка,
	|		НомерСтроки,
	|		ИмяПараметра,
	|		ФормулаПараметра
	|	),
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Наименование
	|ИЗ
	|	Справочник.ДополнительныеИсточникиДанныхДляТиповыхОпераций КАК ДополнительныеИсточникиДанныхДляТиповыхОпераций
	|ГДЕ
	|	ДополнительныеИсточникиДанныхДляТиповыхОпераций.Владелец = &ТиповаяОперация
	|	И ДополнительныеИсточникиДанныхДляТиповыхОпераций.СпособЗаполнения = &СпособЗаполнения
	|	И ДополнительныеИсточникиДанныхДляТиповыхОпераций.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТиповаяОперация", ТиповаяОперация);
	Запрос.УстановитьПараметр("СпособЗаполнения", Перечисления.СпособыЗаполненияДополнительныхИсточниковДанныхТО.Функция);
	
	ИсточникиДанных = Запрос.Выполнить().Выгрузить();
	
	// Определим приоритеты выполнения функций, используемых для подготовки таблиц источников данных, с учетом их зависимостей.
	ПриоритетыВыполненияФункций = Новый Соответствие;
	НеобработанныеФункции = БухгалтерскиеОперацииИсточникиДанных.ОписаниеФункцийМодуля(,Ложь);
	Пока НеобработанныеФункции.Количество() > 0 Цикл // Пока не обработаем все функции.
		
		КоличествоНеОбработанных = НеобработанныеФункции.Количество();
		Для Сч=1 По КоличествоНеОбработанных Цикл
			
			ИндексФункции  = КоличествоНеОбработанных - Сч;
			ТекущаяФункция = НеобработанныеФункции[ИндексФункции];
			
			Если НЕ ЗначениеЗаполнено(ТекущаяФункция.ЗависитОтФункций) Тогда
				
				// Независимые функции будем выполнять в первую очередь, т.к. от них могут зависеть другие функции.
				// Запомним приоритет выполнения этой функции и удалим ее из списка обрабатываемых.
				ПриоритетыВыполненияФункций.Вставить(ТекущаяФункция.Имя, 0);
				НеобработанныеФункции.Удалить(ИндексФункции);
				
			Иначе
				
				МаксимальныйПриоритетВыполнения = 0;
				МожноОпределитьПриоритетВыполнения = Истина;
				
				ФункцииОтКоторыхЗависит = СтрРазделить(ТекущаяФункция.ЗависитОтФункций, ",;" + Символы.ПС, Ложь);
				Для Каждого ИмяФункции Из ФункцииОтКоторыхЗависит Цикл
					
					Если ПриоритетыВыполненияФункций.Получить(ИмяФункции) <> Неопределено Тогда
						МаксимальныйПриоритетВыполнения = МАКС(МаксимальныйПриоритетВыполнения,
							ПриоритетыВыполненияФункций[ИмяФункции] + 1);
					Иначе
						Если НайтиВМассивеСтруктур(НеобработанныеФункции, "Имя", ИмяФункции) = Неопределено Тогда
							ВызватьИсключение "Неверно задано значение параметра ЗависитОт для функции """+ТекущаяФункция.Имя+""".
											|Функция """+ИмяФункции+""" не обнаружена.";
						КонецЕсли;
						// Пока не знаем приоритет выполнения этой функции, пропустим.
						МожноОпределитьПриоритетВыполнения = Ложь;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если МожноОпределитьПриоритетВыполнения Тогда
					// Запомним приоритет выполнения этой функции и удалим ее из списка обрабатываемых.
					ПриоритетыВыполненияФункций.Вставить(ТекущаяФункция.Имя, МаксимальныйПриоритетВыполнения);
					НеобработанныеФункции.Удалить(ИндексФункции);
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	ИсточникиДанных.Колонки.Добавить("ПорядокВыполнения", Новый ОписаниеТипов("Число"));
	Для Каждого ИсточникДанных Из ИсточникиДанных Цикл
		ИсточникДанных.ПорядокВыполнения = ПриоритетыВыполненияФункций[ИсточникДанных.ИмяФункции];
	КонецЦикла;
	ИсточникиДанных.Сортировать("ПорядокВыполнения");
	
	Возврат ИсточникиДанных;
	
КонецФункции // ПолучитьИсточникиДанных()

Функция ПолучитьЗаполнитьИсточникДанных(Ссылка, ТиповаяОперация, ИсточникиДанных, ДанныеИсточника) Экспорт

	Если ДанныеИсточника.СпособЗаполнения = Перечисления.СпособыЗаполненияДополнительныхИсточниковДанныхТО.Функция Тогда
		
		Структура_ПараметрыФункции = Новый Структура;
		
		Для Каждого ПараметрФункции Из ДанныеИсточника.ПараметрыФункции Цикл
		
			ФормулаЗаполнения = ВРЕГ(ПараметрФункции .ФормулаПараметра);
			Если Лев(ФормулаЗаполнения, 9) = "ДОКУМЕНТ." Тогда
				Структура_ПараметрыФункции.Вставить(ПараметрФункции.ИмяПараметра,
					ИсточникиДанных.Документ[0]["Документ_" + Сред(ФормулаЗаполнения, 10)]);
			ИначеЕсли Лев(ФормулаЗаполнения, 23) = "ДОПОЛНИТЕЛЬНЫЙРЕКВИЗИТ." Тогда
				Структура_ПараметрыФункции.Вставить(ПараметрФункции.ИмяПараметра,
					ИсточникиДанных.Документ[0]["ДополнительныйРеквизит_" + Сред(ФормулаЗаполнения, 24)]);
			Иначе
				Продолжить;
			КонецЕсли;
		
		КонецЦикла; 
		
		ТаблицаИсточника = БухгалтерскиеОперацииИсточникиДанных.ВыполнитьФункциюПолученияИсточникаДанных(
			ДанныеИсточника.ИмяФункции, ИсточникиДанных, ТиповаяОперация, Структура_ПараметрыФункции);
		Если ТаблицаИсточника.Колонки.Найти("НомерСтроки") = Неопределено Тогда
			ТаблицаИсточника.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число", 
				Новый КвалификаторыЧисла(5,0,ДопустимыйЗнак.Неотрицательный)));
			СчетчикНомераСтроки = 0;
			Для каждого СтрокаИсточника Из ТаблицаИсточника Цикл
				
				СчетчикНомераСтроки = СчетчикНомераСтроки + 1;
				СтрокаИсточника.НомерСтроки = СчетчикНомераСтроки;
			
			КонецЦикла; 
		КонецЕсли;
			
		ТаблицаИсточника.Колонки.Добавить("ИмяТабличнойЧасти", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(150)));
			
		Возврат ТаблицаИсточника;
		
	КонецЕсли;

КонецФункции // ПолучитьЗаполнитьИсточникДанных()

Процедура ПроверитьПравильностьЗаполненияИмениФункции(Объект, ЭлементИмяФункции) Экспорт

	Если Объект.СпособЗаполнения = Перечисления.СпособыЗаполненияДополнительныхИсточниковДанныхТО.Функция
		И ЗначениеЗаполнено(Объект.ИмяФункции) Тогда
		
		Если ЭлементИмяФункции.СписокВыбора.НайтиПоЗначению(Объект.ИмяФункции) = Неопределено Тогда
			
			ЭлементИмяФункции.СписокВыбора.Добавить(Объект.ИмяФункции, 
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'НЕ НАЙДЕНА ФУНКЦИЯ <%1>'"),
				Объект.ИмяФункции));
				
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Указана несуществующая функция <%1>'"), Объект.ИмяФункции);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ИмяФункции");
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция НайтиВМассивеСтруктур(МассивСтруктур, ИмяПоляПоиска, ЗначениеПоиска)
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		Если ЭлементМассива[ИмяПоляПоиска] = ЗначениеПоиска Тогда
			Возврат ЭлементМассива;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#КонецЕсли
